{
  "title": "The Assault on Truth: Boris Johnson, Donald Trump and the Emergence of a New Moral Barbarism",
  "description": "'A clinical and merciless account of Johnson's mendacity... gripping' GuardianWhen Peter Oborne wrote The Rise of Political Lying, looking at the growth of political falsehood during the governments of John Major and Tony Blair, he believed things had got as bad as they could be. But then on 23 July 2019, with the arrival of Boris Johnson at No 10, began a new and unprecedented epidemic of deceit.In The Assault on Truth, a short and powerful new polemic, Oborne shows how Boris Johnson lied again and again in order to secure victory so he could force through Brexit in the face of parliamentary opposition. Johnson and his ministers then lied repeatedly to win the general election in December 2019. The government’s woeful response to the coronavirus pandemic has generated another wave of falsehoods, misrepresentations and fabrications.The scale and shamelessness of the lying of the Johnson administration far exceeds the lying about Iraqi weapons of mass destruction and other issues under Tony Blair. This book argues that the ruthless use of political deceit under the Johnson government is part of a wider attack on civilised values and traditional institutions across the Western world, especially by Donald Trump in the USA. The Johnson and Trump methodology of deceit is about securing power for its own ends - even when they get exposed for lying, they shrug it off as a matter of no consequence. It matters because all Western institutions are built around the idea of integrity and accountability. This means that an assault on truth is an assault on the rule of law, state institutions and the fundamental idea of fairness, and even democracy itself.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Audiobook",
    "Dystopia",
    "Philosophy",
    "American History"
  ],
  "author": "Peter Oborne",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/57037132-the-assault-on-truth"
}