{
  "title": "The Price of Possession",
  "description": "When my family died at the hands of a demon prince, I hung up my exorcist hat. I’d failed to protect them, and while I was willing to risk myself, the price had risen too high.Now I’m serving up hot, fresh pizzas to everyone who wants them. I was the only person left to inherit the family business and I’m doing my best to keep it up and running in honor of my loved ones. These days, my biggest challenge is telling off a rampaging customer, and endless paperwork. That is, until he shows up again.Darius was the only guy I couldn’t say no to, the one who dragged me into the world of the occult in the first place. When he shows up and begs me to assist with an exorcism, I reluctantly agree. He’s still using me; because I’m the best exorcist around and he only calls when he needs my help.Before I know it, I’ve got an incubus in the living room, a hellhound marking around my yard, and a demon prince who can’t decide if he wants to kill me or… you know. Not to mention the vampire and the Nephilim I seem to have collected. Normally I wouldn’t work with the supernatural, but we all have a common goal. Prevent the crime syndicate from summoning a demon prince and becoming more powerful than we can hope to handle.If I can keep my cool, it will be a miracle. If I can hold on to my soul it’ll be an even bigger one. No one ever claimed being an exorcist was easy, but to protect those I’m coming to love, I’ll pay whatever price necessary.This book is intended for mature audiences. 18+ readers only! It contains language and sexual situations. This is a medium burn reverse harem where the girl gets all the guys. Why Choose? Harem members added as series progresses.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Demons",
    "Vampires",
    "Fantasy",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "Dakota  Brown",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/57044021-the-price-of-possession"
}