{
  "title": "The Call",
  "description": "AVAILABLE ON KINDLE UNLIMITED!\n Matilda was having a bad day. Caught in a bad Chicago storm, she was tossed into a disgusting drainage puddle while watching her workbag, with her laptop and phone, get run over by a bus.  No one would blame her for giving up on the day and skipping the career make-or-break sales pitch meeting she had scheduled.But, Matilda's an alpha female. She's made an amazing life for herself despite her cerebral palsy disability.  She has successfully navigated worse situations than a busted computer. The drainage puddle can go suck it - she's got a contract to win.  Focused on making the sale, Matilda wasn't expecting the start of a pool table romance.  After all, romance for people with disabilities is not covered the Happily Ever After fairytales from childhood.\nJake is obsessed with playing pool and lives in fear of lady-tears.\nWhen Matilda shows up in Jake's office doorway, dripping wet and partially frozen, babbling about a mishap, he just knows the tears are coming.  He wasn't anticipating getting trash-talked and trounced by the tiny redhead covered in street funk. Between Matilda's outrageous BFFs and Jake's hilarious extensive family, this Midwest-based romantic comedy offers inspiration, laughter, and a bit of psychic telepathic magic.  Jake and Matty's journey to love - screeching shrews, slobbering dogs, gifted dildos, unfortunate naughty public encounters, and family antics included - is the start of something bigger.The Call is an inspirational contemporary psychic paranormal romantic comedy and the first book in the Building the Circle series.   Each of the nine Tellis siblings will discover love and paranormal romance while wrangling their unique psychic empathic energy.",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Contemporary",
    "Fantasy",
    "Contemporary Romance",
    "Magic"
  ],
  "author": "Maggie M. Lily",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/57037096-the-call"
}