{
  "title": "A History of the World in Twelve Shipwrecks",
  "description": "From renowned underwater archaeologist David Gibbins comes an exciting and rich narrative of human history told through the archaeological discoveries of twelve shipwrecks across time.The Viking warship of King Cnut the Great. Henry VIII's the Mary Rose. Captain John Franklin's doomed HMS Terror. The SS Gairsoppa, destroyed by a Nazi U-boat in the Atlantic during World War II.Since we first set sail on the open sea, ships and their wrecks have been an inevitable part of human history. Archaeologists have made spectacular discoveries excavating these sunken ships, their protective underwater cocoon keeping evidence of past civilizations preserved. Now, for the first time, world renowned maritime archeologist David Gibbins ties together the stories of some of the most significant shipwrecks in time to form a single overarching narrative of world history.A History of the World in Twelve Shipwrecks is not just the story of those ships, the people who sailed on them, and the cargo and treasure they carried, but also the story of the spread of people, religion, and ideas around the world; it is a story of colonialism, migration, and the indominable human spirit that continues today. From the glittering Bronze Age, to the world of Caesar's Rome, through the era of the Vikings, to the exploration of the Arctic, Gibbins uses shipwrecks to tell all.Drawing on decades of experience excavating shipwrecks around the world, Gibbins reveals the riches beneath the waves and shows us how the treasures found there can be a porthole to the past that tell a new story about the world and its underwater secrets.",
  "genres": [
    "History",
    "Nonfiction",
    "Historical",
    "Audiobook",
    "World History",
    "Adventure",
    "Archaeology"
  ],
  "author": "David Gibbins",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/127305908-a-history-of-the-world-in-twelve-shipwrecks"
}