{
  "title": "Lords of Wrath",
  "description": "They hurt me, abuse me, use me…I signed up for it. Literally. I agreed to the contract that made me the Lords’ Lady, a position that requires me to do whatever they want, but only as protection from someone worse. I agreed to be in their beds, on my knees, and punished should I disobey.I just wasn’t expecting punishment like this.Killian is two-hundred-and-twenty pounds of muscle, brutal physicality, and pure spite. He thinks I don’t know that he watches me when I sleep.Tristian is fair-haired and charming to anyone who doesn’t know better. To me, he’s the man who seeks to control me, with his cold eyes and possessiveness.Rath is the dark-eyed tempest who took me into his bed. Even having been subjected to his barbed tongue, he’s the first man to ever make me feel safe.I hadn’t realized how much they’ve worn me down and made me feel complacent, but it turns out they’ve messed with my head just as much as they abused my body. Despite the awful things they've done to me, they actually made me feel special. Cared for. Protected.And then I found out it was all a lie.The way Tristian cares, Killian’s vigilant eyes, and worst of all, my contented moments in Rath’s bed, were all part of a game.A game to see who can use me best.A game they’ve been playing since day one.And now?It’s a game I’m going to win.WARNING: This book is a DARK/BULLY romance. It contains graphic content of abuse and assault that some readers may be particularly sensitive to. If you have triggers or are even remotely unsure, please heed the note at the beginning of this book.The Royals of Forsyth University is a three book, reverse harem series by Best Selling Authors, Angel Lawson & Samantha Rue.Lords of PainLords of WrathLords of Mercy",
  "genres": [
    "Reverse Harem",
    "Dark Romance",
    "Dark",
    "Romance",
    "Enemies To Lovers",
    "College",
    "Contemporary"
  ],
  "author": "Angel Lawson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/57053157-lords-of-wrath"
}