{
  "title": "Hammerfall",
  "description": "One of the most renowned figures in science fiction, C.J. Cherryh has been enthralling audiences for nearly thirty years with rich and complex novels. Now at the peak of her career, this three-time Hugo Award winner launches her most ambitious work in decades, Hammerfall, part of a far-ranging series, The Gene Wars, set in an entirely new universe scarred by the most vicious of future weaponry, nanotechnology. In this brilliant novel -- possibly Cherryh's masterwork -- the fate of billions has come down to a confrontation between two profoundly alien cultures on a single desert planet.\"The mad shall be searched out and given to the Ila's messengers. No man shall conceal madness in his wife, or his son, or his daughter, or his father. Every one must be delivered up.\" -- The Book of the Ila's Au'itMarak has suffered the madness his entire life. He is a prince and warrior, strong and shrewd and expert in the ways of the desert covering his planet. In the service of his father, he has dedicated his life to overthrowing the Ila, the mysterious eternal dictator of his world. For years he has successfully hidden the visions that plague him -- voices pulling him eastward, calling Marak, Marak, Marak, amid mind-twisting visions of a silver tower. But when his secret is discovered, Marak is betrayed by his own father and forced to march in an endless caravan with the rest of his world's madmen to the Ila's city of Oburan.Instead of death, Marak finds in Oburan his destiny, and the promise of life -- if he can survive what is surely a suicidal mission. The Ila wants him to discover the source of the voices and visions that afflict the mad. Despite the dangers of the hostile desert, tensions within the caravan, and his own excruciating doubts, Marak miraculously reaches his goal -- only to be given another, even more impossible mission by the strange people in the towers.According to these beings who look like him yet act differently than anyone he has ever known, Marak has a slim chance to save his world's people from the wrath of Ila's enemies. But to do so, he must convince them all -- warring tribes, villagers, priests, young and old, as well as the Ila herself -- to follow him on an epic trek across the burning desert before the hammer of the Ila's foes falls from the heavens above.Written with deceptive simplicity and lyricism, this riveting, fast-paced epic of war, love, and survival in a brave new world marks a major achievement from the masterful C.J. Cherryh.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Space Opera",
    "Own",
    "Dystopia"
  ],
  "author": "C.J. Cherryh",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/57064.Hammerfall"
}