{
  "title": "The Opposite of Butterfly Hunting: The Tragedy and The Glory of Growing Up",
  "description": "A searing memoir from Harry Potter star and activist Evanna Lynch about the bravery it takes to embrace ourselves and our dreams while navigating the battle between perfection and creativity.\nGradually, I began to feel this dawning awareness that womanhood was coming for me, that it was looming inevitably, and it didn't feel safe . . . While those around me tried to expedite it, simulate it, exacerbate it, I tried to strangle it.Evanna Lynch has long been viewed as a role model for people recovering from anorexia, as the story of her casting as Luna Lovegood in the Harry Potter films grew to almost mythic proportions--a tale of how she faced disordered eating as a young girl, found solace in a beloved book series, and several years later landed the part of her favorite character. But that is not the whole story.Even after recovery, there remains a conflict at the very core of her being: a bitter struggle between the familiar, anesthetizing pursuit of perfection and the desire to fully and fearlessly embrace her creativity. In her book, Evanna confronts all the complexities and contradictions within herself and reveals how she began to conquer her self-hate while facing her fear of leaving the neatness and safety of girlhood for the unpredictable journey of being a woman. Revealing a startlingly accomplished voice, Evanna delves into the very heart of a woman's relationship with her own body. Unwilling to let the darkness of her eating disorder eclipse her dreams, Evanna explores the pivotal moments and choices in her life that led her down the path of creativity. Taking the reader through her personal journey, she reveals how by channeling her fears of the messy, uncharted future into joyful, ambitious endeavors, she reaches toward acceptance of the wild, sensual, and unpredictable reality of womanhood.Honest, electrifying, and inspiring, this is a story of the tragedy and the glory of growing up, of mourning girlhood and stepping into the unknown, and how that act of courage is the most liberating thing a woman can do.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Mental Health",
    "Biography",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Evanna Lynch",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/57062720-the-opposite-of-butterfly-hunting"
}