{
  "title": "The Woman in the Sun Hat",
  "description": "Peggy Bubone is the envy of the Cold River, Long Island social scene: wife to a respected dermatologist, mother to two handsome children, and newly hired Literature teacher at a prestigious local high school,...before a knock on her classroom door turns her world upside down with the shocking news of her husband's arrest. With her and her children soon ostracized and homeless, she embarks on a humorous yet harrowing journey, which ultimately leads her back to her undesirable roots and, eventually, a deep dive into her own psyche.\"Daniel Damiano has written an extraordinary novel. 'The Woman in the Sun Hat' takes us on a journey from start to finish that not only invites us into the world of the protagonist Peggy Bubone, but helps us to inhabit that world with her in all its sometimes uncomfortable, emotionally challenging, earthy and ultimately invigorating glory.\" - Notes from the City\"5 STARS - An excellent read touching on many of life's rough realities. - A wonderful and realistic novel that keeps you wanting more. The author has done a miraculous job of telling Peggy's story and her far from perfect road to rediscovery. The chances are you won't want to put this one down until you get to the end.\" - The Authors Spot\"Daniel Damiano's stirring first novel not only creates a gripping tale of family disaster and deception, but he also takes on many myths of our modern life. - 'The Woman in the Sun Hat' is a novel imprinted by a distinguished voice and led by a heroine memorable for both the ordinariness and super strength of her resolve.\" - Sunday's Mail\"While Daniel Damiano could have turned Peggy’s tale into one of misery and desperation, he has instead crafted a humorous and uplifting story of perseverance and struggle against the odds.\"- Seattle Book Review (2021 Beach Read Recommendation)\"'The Woman in the Sun Hat' is a wonderful novel. It starts out one way, and then takes a sensationally gripping turn - and we ride with it all the way. It's gripping, disturbing, wrenching and sometimes very darkly funny and completely original.\" - Austin Pendleton (Tony Nominated Director, Actor and Author)\"A great read. Full of unexpected moments. I never knew what to expect from one page to the next. A beautifully written journey into a new beginning.\" - The Soulmate Call Podcast Review",
  "genres": [
    "Contemporary"
  ],
  "author": "Daniel Damiano",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/57088588-the-woman-in-the-sun-hat"
}