{
  "title": "Master of Hounds: Book 1",
  "description": "An old soldier in search of redemption.A condemned prisoner with the power to carve out his heart… or save it.Caius Oppita has served the Alyrion Empire for more than half his life, watching with growing revulsion as the royal family descends ever deeper into corruption and depravity. Powerless to do more than stand by as the land he loves slides toward civil war and social upheaval, he longs for his days as a general on the battlefield rather than a tame palace lapdog.When the execution of one of the emperor’s inconvenient bastard sons goes wrong, Caius has a choice to make—do his duty, or do what is right and spirit the innocent man away to safety.It should have been simple—hide Decian in plain sight for a few days, then smuggle him out of the palace compound. Buy him passage on a ship sailing someplace far away from the capital city, and take quiet pleasure in fighting one single injustice among many.Instead, the swirling undercurrents of politics and power struggles seem determined to drag them ever deeper into danger—even as Decian guilelessly slips past the armor surrounding Caius’ battered soul. Caius had never considered himself a fool… but only a fool would bed the emperor’s illegitimate son. Much less let the brash young idiot anywhere near his heart.The problem with secrets is that they breed more secrets.And betrayal only hurts when you cared in the first place.* * *\nMaster of Hounds: Book 1\n is the first installment in an M/M epic fantasy trilogy by USA Today bestseller R. A. Steffan. It is set in the world of The Eburosi Chronicles, but stands alone. The book contains adult content.Other completed series set in this world:\nThe Complete Horse Mistress Collection\n (2016 Rainbow Award winner)\nThe Complete Lion Mistress Collection\n (2019 Rainbow Award winner)\nThe Complete Dragon Mistress Collection",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Audiobook",
    "Romance",
    "Historical",
    "Shapeshifters",
    "LGBT"
  ],
  "author": "R.A. Steffan",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/57091446-master-of-hounds"
}