{
  "title": "When a Killer Calls: A Haunting Story of Murder, Criminal Profiling, and Justice in a Small Town",
  "description": "From John Douglas—the legendary FBI criminal profiler, #1  New York Times  bestselling author, and inspiration for the Netflix show  Mindhunter —comes a chilling journey inside the mind and crimes of Larry Gene Bell, one of the most dangerous serial killers Douglas confronted, and the desperate effort to identify and catch him.On May 31, 1985, two days before her high school graduation, Shari Smith was abducted from the driveway of her family home in South Carolina. Based on the crime scene and the abductor’s repeated and taunting calls to the family, law enforcement quickly realized they were dealing with a sophisticated and highly dangerous criminal. A letter arrived the next day entitled “Last Will & Testament,” in which Shari, knowing she was to be murdered, wrote bravely and achingly of her love for her parents, siblings, and boyfriend, saying that while they would miss her, she knew they would persevere through their faith. The abduction rocked her quiet town, triggering a massive manhunt and bringing in the FBI, which enlisted profiler John Douglas. A few days later, a phone call told the family where they could find Shari’s body. Then nine-year-old Debra May Helmick was kidnapped from her yard, confirming the harsh realization that Smith’s murder was no random act. A serial killer was evolving, and the only way to stop him would be to use the study of criminal behavior to anticipate his next move before he could kill again. Douglas devised a risky and emotionally fraught strategy to use Shari’s lookalike older sister Dawn as bait to draw out the unknown subject. Dawn and her parents courageously agreed. One of the most haunting investigations of Douglas’s storied career, this case details how the eerily accurate profile he created—alongside his carefully crafted and stage-managed manipulation of the killer’s psychology—combined with dedicated police work and cutting-edge forensic science to end a reign of criminal terror. As Shari’s family took incredible personal risks to lure her killer from the shadows, Douglas and the FBI pushed criminal profiling to its limits, culminating in one of his most dramatic and effective confrontations with a sadistic and remorseless killer.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "History",
    "Mystery",
    "Adult"
  ],
  "author": "John E. Douglas",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/57094286-when-a-killer-calls"
}