{
  "title": "Distorted",
  "description": "This is Alabaster Penitentiary…\n Where they send you when the world thinks you’re dead. And trust me, you’ll wish you were. We’re the stain on society. The freaks, the creeps, your favorite Netflix documentaries come to life. They lock us up and throw away the key, because we deserve it. But not me. I’m just a lowly bank robber. I don’t belong here, surrounded by psychopaths and killers with no remorse… At least, I don’t think I do.Getting by unscathed is my top priority. Unfortunately for me and my fellow prisoners, those in charge are more dangerous than we are. You see, the guards run the show, and I seem to have caught the attention of the most twisted one. He has a name, but it might as well be Officer. We move around one another like a sun and a moon, revolving in an axis of confused lust and torment until the truth is distorted, and the thing I once feared becomes that which I crave; my vile addiction, somehow so exquisite. \nReality warps in the dungeon, and I’m left wondering which prison is worse… the one holding my body, or my mind.\n    *DO NOT READ OR POST SPOILERS! I am begging you to think of your fellow readers, in your reviews, your posts… everywhere. Revealing plot twists is a dick move. And I promise, it’ll be fun to go in blind.  **Distorted is the first book in the Alabaster Penitentiary series. It is a full M/M romance, with HEA. Each book in this series is technically a standalone, though they are interconnected, so it will be recommended to read in order, as references to this story will be made in future books. Distorted is intended for mature audiences and open-minded readers ONLY! If you prefer the same old story, this book won’t be for you. This story is dark, probably darker for some than others, so please proceed with caution, and if you’re easily triggered, steer clear.  \nYou’ve been warned.",
  "genres": [
    "M M Romance",
    "Dark Romance",
    "Dark",
    "Romance",
    "Enemies To Lovers",
    "LGBT",
    "BDSM"
  ],
  "author": "Nyla K.",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/57091326-distorted"
}