{
  "title": "The First 21: How I Became Nikki Sixx",
  "description": "Rock-and-roll icon and three-time bestselling author Nikki Sixx tells his origin story: how Frank Feranna became Nikki Sixx, chronicling his fascinating journey from irrepressible Idaho farmboy to the man who formed the revolutionary rock group Mötley Crüe.Nikki Sixx is one of the most respected, recognizable, and entrepreneurial icons in the music industry. As the founder of Mötley Crüe, who is now in his twenty-first year of sobriety, Sixx is incredibly passionate about his craft and wonderfully open about his life in rock and roll, and as a person of the world. Born Franklin Carlton Feranna on December 11, 1958, young Frankie was abandoned by his father and partly raised by his mother, a woman who was ahead of her time but deeply troubled. Frankie ended up living with his grandparents, bouncing from farm to farm and state to state. He was an all-American kid—hunting, fishing, chasing girls, and playing football—but underneath it all, there was a burning desire for more, and that more was music. He eventually took a Greyhound bound for Hollywood.In Los Angeles, Frank lived with his aunt and his uncle—the president of Capitol Records—for a short time. But there was no easy path to the top. He was soon on his own. There were dead-end jobs: dipping circuit boards, clerking at liquor and record stores, selling used light bulbs, and hustling to survive. But at night, Frank honed his craft, joining Sister, a band formed by fellow hard-rock veteran Blackie Lawless, and formed a group of his own: London, the precursor of Mötley Crüe. Turning down an offer to join Randy Rhoads’s band, Frank changed his name to Nikki London, Nikki Nine, and, finally, Nikki Sixx. Like Huck Finn with a stolen guitar, he had a vision: a group that combined punk, glam, and hard rock into the biggest, most theatrical and irresistible package the world had ever seen. With hard work, passion, and some luck, the vision manifested in reality—and this is a profound true story finding identity, of how Frank Feranna became Nikki Sixx. It's also a road map to the ways you can overcome anything, and achieve all of your goals, if only you put your mind to it.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Audiobook",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Nikki Sixx",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/57094552-the-first-21"
}