{
  "title": "Tainted Souls",
  "description": "He's a seasoned detective. She's a reporter looking for a break. With a series of sadistic murders at hand, will the two find the person responsible before more people get killed? Before she gets killed?Twenty-eight years ago, Detective Michael Flowers became entangled in the twisted, sadistic mind games of a killer in Cartersville, Georgia. Now, once again, the tranquility of his town is pulled back to unearth a psychotic darkness born in the shadows of upper middle-class luxury.When the body of a college student is found hanging from the roof of the university’s main building, Detective Flowers knows it's the work of a devil.At the age of thirteen, Megan Thompson was thrown down a flight of stairs and stabbed seventeen times with a pencil that broke off in her back. Left for dead and partially paralyzed after this violent attack from her brother, she is taken in and cared for by a wealthy family. As she struggles to escape the memories of the cold and painful world she once lived, her hopes for a bright future shatter when her brother is released from the mental state facility.Rebekah Davenport is an ambitious reporter looking for a career making story. Nipping at Detective Flowers’ heels at every opportunity, she points out evidence and gives opinions that are contrary to his experience and intuition. Left to her own devices, Davenport falls in over her head pursuing the truth in a life-threatening dance with the devil.When a second mutilated and terribly tortured body is found, Flowers teams up with Davenport to investigate possibilities he may be too biased to see. They follow the trail of the victims to Megan’s group of friends and a tight-lipped business called Pleasure Island until an unexpected revelation brings the past colliding into the present.Tainted Souls is high-octane thriller mystery that will keep you rivetted to your seat until the last page.Order your copy now and get ready to read it through in one sitting!",
  "genres": [],
  "author": "Correy Cottle",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/57118856-tainted-souls"
}