{
  "title": "A Death at Seascape House",
  "description": "With its sweeping sandy beaches and rolling emerald hills, the island of St. Morwenna is an idyllic escape. But behind the perfectly pruned primroses and neighborly smiles a killer lies in wait…When librarian Jemima Jago is offered the opportunity to catalogue Cornwall’s largest collection of antique shipwreck records it is a dream come true. The only problem? The collection is housed on the island of St. Morwenna, the childhood home she left years ago and vowed never to return to.Shortly after Jem arrives back in town, island busybody and notorious grump Edith Reddy is found dead, with duct tape clamped over her mouth and nose. Jem, caught seemingly red-handed at the scene of the crime, mistakenly becomes the police’s number one suspect. The handsome Sergeant Hackman in particular can’t seem to leave Jem alone…Jem must take matters into her own hands if she wants to clear her name. Snooping around Edith’s once-grand home, she is struck by the mess before her. The bedroom is completely ransacked and in the living room all the photographs have been removed from their frames. Was Edith’s death simply a break-in gone wrong, or is there more to the mystery that the police are missing?Jem has a sharp eye for a clue and she soon realizes that many of the island’s eccentric residents had reason for wanting Edith out of the way. Could Declan, the curious café owner, or Bart, the fishy ferryman have killed Edith? Jem won’t rest until she uncovers the truth, but doing so will put her right in the killer’s line of sight…A totally charming cozy mystery from the New York Times and USA Today bestselling author Emma Jameson. Brimming with intrigue and warm humor, fans of Agatha Christie, Faith Martin and Betty Rowlands will love A Death at Seascape House.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "British Literature",
    "Crime",
    "Mystery Thriller"
  ],
  "author": "Emma Jameson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/57113734-a-death-at-seascape-house"
}