{
  "title": "Hunter of Worlds",
  "description": "A million people were about to die! The entire population of the planet Priamos was marked for death if one person on the surface could not be found in time. The staggering order was emotionless and inhuman — exactly like the iduve, the strange aliens who had handed down the decree.Perhaps the most advanced and least understood race in the known universe, the idvue lived in giant spaceships that roamed in random patterns around the galaxy. For nearly two hundred years one of these mammoth vessels, The Ashanome, had been stalking an offender ... one of their own kind who betrayed an ancient rite and fled into the sanctuary of \"human\" space.Now, as The Ashanome went into orbit around his hiding place, it was time for vaikka, the ultimate vengeance and return of honor which the iduve cherished above all else. To accomplish their task, they commanded the aid of three very different individuals — Aiela Lyailleue, a young man of the peaceable kallia race who was forcibly inducted into the Starlord's service, possibly never to see his home or family again; Daniel, a savage human with nothing but fear and a blind hatred for his captors; and Isande, a beautiful woman who knew more about the iduve than the iduve themselves.Together, through the process of Asuthi, all three had their minds melded into a single entity — learning not only each other's language, but each other's way of life, inner feelings and deepest secrets. For in a short time they would descend to the threatening surface of Priamos. Their mission: search out and kill the offender.If they were to be successful, they would surely need the combined resources of all their wits and intuitive knowledge. Within a few short hours, the trio had to find the needle in the haystack — or they and all the planet's million other men, women and children would perish in a single, searing flash of white hot energy. The iduve knew no other way...",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Space Opera",
    "Aliens",
    "Speculative Fiction"
  ],
  "author": "C.J. Cherryh",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/57121.Hunter_of_Worlds"
}