{
  "title": "Annie Duke: How I Raised, Folded, Bluffed, Flirted, Cursed, and Won Millions at the World Series of Poker",
  "description": "The top-ranked female poker player in the world reveals an insider’s view of the World Series of Poker, a glimpse of her fascinating journey to the top, and keen analysis of winning hands  \nFrom the Introduction\n I never set out to become a professional poker player.  I was schooled at St. Paul’s School, where my father taught English; Columbia University, where I majored in psychology and English literature, and the University of Pennsylvania, where, at twenty-six, I was nearing completion of a PhD in psycholinguistics.  The afternoon before I was scheduled to meet the academic committee for a job interview, I drove my Honda from Philadelphia to New York, to see my mother. She wanted to have a little pre-celebration for a future that was mine for the taking, an academic career that would ooze prominence and prosperity.  Once inside the apartment, suddenly, a dam burst. A simple tin trash can stood below my mother’s desk; I leaned over and hurled into it, again and again. The diagnosis? I was afraid to grow up.  That’s when I ran away. Without a word of explanation, I fled to Montana, to marry a man I had never dated. And then, when money got tight and I felt beaten down by life in a leaky shack with minimal hot water, I got into my Honda and drove fifty-one frontier miles to the Crystal Lounge, in Billings. I sat down at the poker table, among thick- fingered cowboys and boozing rednecks, slipped off my shoes, tucked my bare feet under my butt, and as the dealer tossed me an Ace-Queen, I knew I was home.  This is where my life begins.  Annie Duke takes readers deep into the World Series of Poker as she wins millions, becoming the only woman to ever win two major tournaments in one year.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Annie Duke",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/571069.Annie_Duke"
}