{
  "title": "The Voice of Venus: Collector's Edition",
  "description": "Collector's Edition features new visionary art illustrations in color (hardcover, e-book) or black & white (paperback). This is a book that changes lives. Dictated by the Ascended Masters of the Seven Shamballas, The Voice of Venus sweeps the reader off to the higher worlds where Luminaries of Earth's past continue their efforts to enlighten humanity after so-called \"death.\" In the higher dimensions of Venus, that means the Lighted Ones stay R.E. Moore's visionary art beautifully captures this transcendent tour of life on Venus. Your own view of life, death, and rebirth may never be the same after you read this unique book! Clairvoyantly and clairaudiently received through Ernest L. Norman (1904‒1971), The Voice of Venus , Book One of the five-volume Pulse of Creation series , was first published in 1956 and remains a popular favorite among his seventeen published works. The complete series features dissertations from the Ascended Masters who introduce a \"universal, articulate, interdimensional understanding of science\"- a cosmic \"theory of everything\" that joins science and spirit into a useful guide for visionary leaders in the arts, science, healing, education, leadership, devotion, and philosophy. Lightworkers, starseeds, spirit nerds, and humanitarians may find The Voice of Venus takes them back to places they remember, in the company of the Lighted Ones who are their teachers and guides. Generations of readers have exclaimed over the spiritual awakening the book inspired. Many claim the book never loses its luster, even after countless \" The Voice of Venus is like a celestial passport to the Inner Worlds of Light. I love to visit the crystalline cities with their classrooms, healing temples, and beautiful gardens, while taking in the higher energies radiated from the Venusians. After reading, I always feel more love, peace, and joy!\"- Jennifer Stovall \"The information that is contained in the five-volume set has been my source of inspiration for the past thirty-five plus years.\" - Michael L., Inventor \"I always wondered about life after death and what the experience of dying would be like. This book takes you through the process in a way that is unique and exquisitely explained. The scientific and spiritual blend of knowledge is beautiful beyond anything I have ever read-or experienced!\"- Douglas Taylor, Artist, Author of Soulic Journeys \"A few minutes with this book always lifts my mood and brings quick answers to trouble or confusion I might be experiencing that day.\"- Lianne Downey, Author of Speed Your Evolution \"The new, all-color collector's edition of The Voice of Venus has rekindled the excitement I felt upon discovering this book 33 years ago, when I stayed up half the night devouring its resonating truths.\"- Joseph Downey, Technical Advisor \"... other authors' and teachers' works continually affirm the truth that [Ernest Norman] so humbly brought to our world.\"- Liam Lukasik, Curator/Editor, Libris Lotus",
  "genres": [],
  "author": "Ernest L Norman",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/57102385-the-voice-of-venus"
}