{
  "title": "Tears of Titan: The Enlightenment: The journey to one's love and honour in a magical realm",
  "description": "A story of everlasting love and honour set in a magical world.Catered to young adults and adults, the Tears of Titan fantasy series is built around a heart wrenching love story that not merely explores the altruism we humans are capable of, but also implores us to reflect on attributes that make us humans. Presenting readers a varied view on humanity, the book reflects how beliefs and actions are sometimes formed not by choice but by circumstances; and how helpless yet resolute we humans can be in face of the destinies bestowed upon us.Book 1 of the Tears of Titan series introduces the protagonist, Jas a lowly ranked 'Green' Human, who embarks on a journey to reclaim his identity and love. Together with his companion, Belle the highly ranked 'Black' Elf, he travels across different fantasy realms to gradually rediscover who he really was, and how his fate is intricately connected to the world. As the other characters of different races obsessed with diverse goals make their marks across the realms, Jas once again finds himself embroiled within the world of turmoil. Despite his low level of Enlightenment— a mysterious grading system every being is born with, reflected through the colour of one’s crystal earrings and Sword— Jas is determined to break the shackles of the destiny bestowed upon him and seek the reason for his existence.Bask yourself in this magical world built on a vast array of mythologies and histories from diverse cultures— East and West, spanning across different time and civilizations. With characters personifying distinctive traits of different cultures— from the Greek Gods to European Crusaders to Korean Hwarangs— Tears of Titan reflects just how fundamentally we are all the same despite our differences, for the human mind and soul constantly seeks for validation of its own existence and worth till the end of time.Look at Jas as you would look at yourself, understand his pain as you would endure in your own journey— for in the end, you will Love and honour is all the same, in fiction or reality. And last but definitely not the least, enjoy the magical ride!P.S. Please kindly leave your reviews below as you deem fit after finishing the book, or visit our Facebook page for updates and share your love. Thank you and enjoy the journey!",
  "genres": [],
  "author": "YS L",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/57122920-tears-of-titan"
}