{
  "title": "The Last Place",
  "description": "In hot legal water -- and court-ordered therapy -- for having assaulted a potential child molester, Tess Monaghan is more than ready for a distraction. So she agrees to look into a series of unsolved homicides that date back over the past six years despite the fact that the assignment originates in part from a most troubling wealthy Baltimore benefactor Luisa O'Neal, who was both instrumental in launching Tess's present career and intimately connected with the murder of Tess's former boyfriend.There are other troubling aspects as well. Apart from the suspicion that each death was the result of domestic violence, nothing else seems to connect them, Five lives -- those of four women and one man -- were destroyed by fire, gunshot, and hit-and-run, and all five cases have gone ice cold. Though Luisa's nonprofit organization hires Tess simply to review old police documents for inconsistencies and investigative blunders, curiosity is soon leading the P.I. off the paper trail.And it just may get her killed. Tess's search for connecting threads takes her beyond the Charm City limits and into dangerously unfamiliar territory. With the help of a police officer obsessed with bringing a murderer down, she follows scant leads and intuition into the remotest corners of Maryland, where a psychopath can hide as easily in the fabric of a tiny, rough-hewn fishing community as in the alleys and shadows of bustling Baltimore. Straying far from everything that's familiar and safe in her life, Tess is suddenly cast into a terrifying cat-and-mouse game with an ingenious slayer who changes identities as often and effortlessly as clothing. Because a single common link to five senseless murders is beginning to emerge with shocking clarity to tie the loose ends together into one bloody knot...and the link is Tess Monaghan herself.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Audiobook",
    "Thriller",
    "Mystery Thriller",
    "Detective"
  ],
  "author": "Laura Lippman",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/571086.The_Last_Place"
}