{
  "title": "The Hidden Europe: What Eastern Europeans Can Teach Us",
  "description": "Francis Tapon yearned for a European adventure, but Western Europe seemed too tame and passe. So he traveled for 3 years visiting every Eastern European country all 25 of them.The Hidden Europe cleverly mixes insightful facts with hilarious personal anecdotes. It's profound, yet light. Francis Tapon is a sharp observer who helps you distinguish a Latvian from a Lithuanian, while not confusing Slovenia with Slovakia.You'll also - Why Baltic people are human squirrels. - When and why Poland disappeared from Europe. - Why Czechoslovakia and Yugoslavia broke up. - Why Hungarians are really Martians. - How Slovenians learn languages so quickly. - Why the Balkans is so screwed up. - Why there's much more to Romania than Dracula. - Which Moldovan tradition saves marriages. - What the future holds for Belarus, Ukraine, Russia. - Why communism was a dream . . . and a nightmare. You'll understand a side of Europe that is still mysterious and misunderstood even 20 years after the fall of the Soviet Union. Francis Tapon is an ideal guide in a book that will become a classic travel narrative.SUMMARYWhen people say that they're \"going to Europe,\" they're usually referring to Western Europe. But what about Eastern Europe? You don't really know Europe until you visit its mysterious eastern side.Francis Tapon's quest was explore every country in Eastern Europe from the Gulf of Finland to the Black Sea. He saw them all in 2004 and then returned in 2008 to revisit them to see what had changed. He finally left in 2011 to share a side of Europe that few know.Starting in the Baltic, you'll move through Belarus, Poland, Slovakia and get as far west as Slovenia before heading south into the thrilling Balkans. Then you'll head northeast through Bulgaria, Romania, Moldova, Ukraine, and Russia. It's a 25-country adventure spanning over 3 years!The Hidden Europe is an entertaining travelogue that also shares practical lessons that will impact your day-to-day life. You ll learn about today's Eastern Europe along with understanding the complex history of this fascinating region. You ll also see how the locals live and realize that they do some things better than most of the world. You'll understand why smart money and groundbreaking tourists are flocking to this undiscovered territory. Best of all, you won't have to deal with the grumpy train ticket vendors.INCLUDES 60 COLOR PHOTOS AND 2 COLOR MAPS",
  "genres": [
    "Travel",
    "Nonfiction",
    "History",
    "Memoir",
    "Biography",
    "Amazon"
  ],
  "author": "Francis Tapon",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/12733005-the-hidden-europe"
}