{
  "title": "Collide",
  "description": "Destiny is what happens when dreams collide with reality.I've made a name for myself as a world famous lingerie model. I'm rich and powerful now. Not too bad for a girl from small town Texas. All I really wanted was to become so beautiful that Luke, my teenage crush, would fall at my feet. But thirteen years is a long time.Long enough for this little girl to grow up and glue back together the pieces that were chipped away as a child. Plenty of time for me to figure out that love isn't made of fairy tales and high school crushes who didn't even know I existed. Maybe it's even long enough for me to realize what's staring at me through my best friend's eyes - even as I try to say we're just business partners.Then Gran dies. Now I have to go back to that same small town that destroyed me.I keep telling myself I've got this - right up until Luke shows up in my life again. This time, he's noticed me, but he comes with a troubled daughter that reminds me a little too much of myself. Then there's the new guy I just hired. He's the best person for the job, even if he is my best friend's ex - and looking at my crush a little too hard.I'm supposed to be taking over Gran's business, but the rumors are flying. This town hates me. My neighbor wants to see me fail, my love life is out of control, and Luke's daughter? It looks like she's going to be the only one who ends up hurt unless something changes. What good is success if I can't use it to help anyone else?I came home to save something. I just had no idea it was more than just a house.TRIGGERS MAY INCLUDE: Mentions of cancer, violence, criminal history, eating disorders, bullying, self harm, and discussions of child sexual assault and trauma.  This is a love story, but broken people deserve love too - and an ally on their side.Collide is a 155,000 word novel with an ending that will leave you needing more. The main female character will have multiple, often complicated, relationships with different men. The Shades of Trouble series includes M/M and M/F romance. For the purposes of the story, some medical and professional ethics may be bent or even broken.   Graphic language and situations that are suitable for a mature audience are included.Collide is the first in a series of four books.",
  "genres": [
    "Reverse Harem",
    "M M Romance",
    "Contemporary",
    "Romance",
    "Dark",
    "M M F",
    "Contemporary Romance"
  ],
  "author": "Kitty Cox",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/57135330-collide"
}