{
  "title": "The Elephant's Secret Sense: The Hidden Life of the Wild Herds of Africa",
  "description": "While observing a family of elephants in the wild, Caitlin O’Connell noticed a peculiar listening behavior—the matriarch lifted her foot and scanned the horizon, causing the other elephants to follow suit, as if they could “hear” the ground. The Elephant’s Secret Sense is O’Connell’s account of her groundbreaking research into seismic listening and communication, chronicling the extraordinary social lives of elephants over the course of fourteen years in the Namibian wilderness.            This compelling odyssey of scientific discovery is also a frank account of fieldwork in a poverty-stricken, war-ravaged country. In her attempts to study an elephant community, O’Connell encounters corrupt government bureaucrats, deadly lions and rhinos, poachers, farmers fighting for arable land, and profoundly ineffective approaches to wildlife conservation. The Elephant’s Secret Sense is ultimately a story of intellectual courage in the face of seemingly insurmountable obstacles. “I was transported by the author’s superbly sensuous descriptions of her years spent studying the animals. . . . Conjures a high-class nature documentary film in prose.”—Steven Poole, Guardian “A ride as rough and astonishing as the roads of the African floodplain.”—Joan Keener, Entertainment Weekly “A successful combination of science and soulfulness, explaining her groundbreaking theory of how elephants use seismic communication. . . . O’Connell’s account is studded with sympathetic insights and well-turned phrases.”— Publishers Weekly “This fascinating book reads like a fast-paced detective story of a scientific discovery and adventure set in contemporary Africa. . . . By the end, O’Connell takes her rightful place among the leading biographers of the African elephant.”—Iain Douglas-Hamilton, author of Among the Elephants",
  "genres": [
    "Animals",
    "Nonfiction",
    "Africa",
    "Science",
    "Nature",
    "Namibia",
    "Wildlife"
  ],
  "author": "Caitlin O'Connell",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/5713907-the-elephant-s-secret-sense"
}