{
  "title": "The Gateway",
  "description": "This is a novella length version of Gateway to NifleheimIn The Gateway, Glenn G. Thater transports us to an age of high adventure where knights battle supernatural horrors, magic is real but hidden, and the line between good and evil is all too thin.The Harbinger of Doom saga centers around one Lord Angle Theta, an enigmatic warrior of unknown origins and mystical power. No mortal man is his match in battle. No sorcery can contain or confound him. No scholar or sage can outwit him. But for all his skills, he is but one of us; a man, a human, who shares our faults, our dreams, and our ambitions. He boldly strides across the land, fearless, peerless, and cloaked in mystery; all his will bent on righting such wrongs as he deems fit.Until the day the Gateway opened and turned the world on its head. On that fateful day, Korrgonn came and washed away our dreams. And his outre' realm of Nifleheim set its unholy mark upon our world and claimed it for their own. Only Theta and his companions see the enemies aligning against us. Only they foresee our end coming- the end of civilization, the end of the world of man. Only they can hope to turn the tide of madness and preserve all that we hold dear. But no man, not even our greatest hero, can stand against the Lords of Nifleheim and the dark armies at their command. Fiends that infiltrate unseen within our ranks, that tear down our temples and our traditions; that devour us from within, unseen, unknown, unheralded, and unopposed until the hour grows far too late. Through the murk and mist that hangs before our eyes, one man only sees true. One man pierces the veil of magic that blinds us all and marks the world as it truly is, revealing secrets, secrets of Angle Theta, so horrifying as to shatter a man's mind and call into question the very nature of good and evil.When mad sorcerers open a gateway to the very pits of hell, releasing outre demons of darkest nightmare upon the world, only the intrepid knights of House Eotrus stand in their way. Claradon Eotrus takes up the mantle of his noble house to avenge his father and hold back the tide of chaos that threatens to engulf the world and destroy mankind. Claradon recruits Angle Theta and Gabriel Garn, mysterious knights of mystical power to stand with him. Theta and Garn take up their swords one last time against the coming darkness -- a darkness from which only one will emerge.",
  "genres": [
    "Fantasy",
    "Horror",
    "Fiction",
    "Epic Fantasy",
    "Epic",
    "Demons",
    "Amazon"
  ],
  "author": "Glenn G. Thater",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/5712707-the-gateway"
}