{
  "title": "Tough Guy",
  "description": "A Hero Club Novel. My sister lives to ruin my life. That isn’t fair.  It’s not her fault our dance instructor called me fat and awkward, and our parents funded Lisa’s training because I had a better head for business. So when Lisa went off the rails after her injury, it naturally came to me to track her down. The trail starts at the Spearmint Rhino —an upscale gentlemen’s club five minutes off the Las Vegas strip, where a group of hot Aussie soccer players are having a bachelor party.  Hello, Chance Bateman ! My sister still wears his jersey as a nightgown . However, Lisa's trail goes cold at Dalton’s, which is owned by a world-famous bouncer, Miles Carvello—six feet four inches of muscle, tattoos, and swagger. Combined with his intense green-eyed gaze, Miles makes my insides sizzle.   I’m just not sure if Miles Carvello is the reason she’s hiding out or not. Danger seems to surround him. How does a former Broadway hoofer wind up in Vegas as a stripper?  I’m about to find out, since no one will talk to me because I’m an outsider.  And besides, Miles thinks I’m too much of a prude to do it. I need to find my sister.  She’s in trouble.  I can feel it. I keep running into the bachelor party as well as Miles while I'm out searching for her. And while both of them are a good time, they're not getting me any closer to finding Lisa. And I've got a terrible feeling that her time is running out. *** I don’t remember Jackie Mitchell’s sister.  Just another stripper with baggage in a long line of them.  But Jackie?  Damn, she’s the real deal.  I don’t want to get distracted.  I need to shoot this club into the stratosphere.  I owe it to my uncle’s memory not to let the gangsters win. But she oozes sensuality that reminds me that I should take time to enjoy the finer things in life – like her long, toned legs wrapped around my shoulders. However, the demons of my past are pushing into my future. If they’re going after my employees, as a way to get to me —they picked the wrong guy to mess with.  And if they touch Jackie, all bets are off and I’ll put them in the ground—and to hell with the consequences. Tough Guy  takes place a year before the events of Cocky Bastard and features a few appearances by our favorite Aussie soccer player, Chance Bateman before he meets the love of his life, Aubrey.",
  "genres": [
    "Romance"
  ],
  "author": "Jamie K. Schmidt",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/57123402-tough-guy"
}