{
  "title": "Please Don't Sit on My Bed in Your Outside Clothes: Essays",
  "description": "New York Times bestselling author, comedian, actress, and producer Phoebe Robinson is back with a new essay collection that is equal parts thoughtful, hilarious, and sharp about human connection, race, hair, travel, dating, Black excellence, and more.Written in Phoebe's unforgettable voice and with her unparalleled wit, Robinson's latest collection, laced with spot-on pop culture references, takes on a wide range of topics. From the values she learned from her parents (including, but not limited to, advice on not bringing outside germs onto your clean bed) to her and her boyfriend, lovingly known as British Baekoff, deciding to have a child-free union, to the way the Black Lives Matter movement took center stage in America, and, finally, the continual struggle to love her 4C hair, each essay is packed with humor and humanity.By turns insightful, laugh-out-loud funny, and heartfelt,  Please Don't Sit On My Bed In Your Outside Clothes is not only a brilliant look at our current cultural moment, but a collection that will stay with you for years to come.Introduction: 2020 was gonna be my year! (LOL) --Yes, I have free time because I don't have kids --Guide to being a boss from someone who has been building a mini empire for the past two years and counting --#Quaranbae --Black girl, will travel --Please don't sit on my bed in your outside clothes --We don't need another White savior --Bish, what? That's English?!: a tale of an American dating a Brit --Self-care is not a candle and therapy is not a notebook: how we are doing the most and the absolute least at the same damn time --4C girl living in anything but a 4C world: the disrespect",
  "genres": [
    "Nonfiction",
    "Essays",
    "Humor",
    "Audiobook",
    "Memoir",
    "Comedy",
    "Feminism"
  ],
  "author": "Phoebe Robinson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/57169049-please-don-t-sit-on-my-bed-in-your-outside-clothes"
}