{
  "title": "At Any Cost: A Father's Betrayal, a Wife's Murder, and a Ten-Year War for Justice",
  "description": "At Any Cost unravels the twisted story of Rod Covlin, whose unrepentant greed drove him to an unspeakable act of murder and betrayal that rocked New York City.Wealthy, beautiful, and brilliant, Shele Danishefsky had fulfillment at her fingertips. Having conquered Wall Street, she was eager to build a family with her much younger husband, promising Ivy League graduate Rod Covlin. But when his hidden vices surfaced, marital harmony gave way to a merciless divorce. Rod had long depended on Shele's income to fund his tastes for high stakes backgammon and infidelity—and she finally vowed to sever him from her will. In late December 2009, Shele made an appointment with her lawyer to block him from her millions. She would never make it to that meeting.Two days later, on New Year’s Eve, Shele was found dead in the bathtub of her Upper West Side apartment. Police ruled it an accident, and Shele’s deeply Orthodox Jewish family quickly buried her without an autopsy on religious grounds. Rod had a clear path to his ex-wife's fortune, but suspicions about her death lingered. As the two families warred over custody of Shele’s children—and their inheritance—Rod concocted a series of increasingly demented schemes, even plotting to kill his own parents, to secure the treasure. And as investigators closed in, Rod committed a final, desperate act to frame his own daughter for her mother’s death.Journalists Rebecca Rosenberg and Selim Algar reconstruct the ten years that passed between the day Shele was found dead and the day her killer faced justice in this riveting account of how one man’s irrepressible greed devolved into obsession, manipulation, and murder.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "New York",
    "Biography",
    "True Story"
  ],
  "author": "Rebecca  Rosenberg",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/57171560-at-any-cost"
}