{
  "title": "Don't Forget to Ask: How to sell your position and negotiate anything with anyone",
  "description": "This book on negotiation and persuasion provides you 13 simple principles, refined over decades of real-world negotiations, that will better inform how to negotiate at work, negotiate for success, or generally how to negotiate anything when dealing with anyone from Wall Street to Main Street.“Easy to read and well written. I enjoyed the simplicity of the principles and how they can be applied to any situation” – Robert J“Whether a professional negotiator or a professional mom or dad, the book can be of benefit. I'd definitely recommend” – Mark SDid you know implementing any of the principles in Don't Forget to Ask could return 100 times the cost of the book (or more) the first time you use them? You certainly can, but don’t need to belong to the world of business in order to successfully employ the art of negotiation. Every single one of us negotiates at one time or another, and it makes up much more of our everyday lives and relationships than you may realize.Whether you’re hashing out dinner plans or organizing a multi-million dollar deal, your work relies on the successful back-and-forth that comes with reaching agreements. The key here is not to separate the idea of negotiating from that of a traditional salesman, but to combine the two ideals into one and using the strength that lies in both selling and negotiating to take your skills to the next level.As you read through Don’t Forget to Ask, you will That negotiation happens everywhere and all the time…..you can’t avoid itHow to get more of what you want out of your interactions with othersYou don’t need to execute “all” the principles in order to enjoy success“Buying” and “selling” are the opposite sides of the same coin……they both involve negotiationNegotiation does not need to be a “robotic” process, and in fact should not be in order to maximize successDon’t Forget to Ask is a comprehensive collection of time-tested principles of negotiating that can be learned, perfected, and applied to virtually any situation with anyone. With a thorough and easy-to-navigate format, Don’t Forget to Ask wants to know if you’re ready to start winning. Become the master negotiator in your home, work, and everyday life and start your journey today!",
  "genres": [],
  "author": "William Barton",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/57177260-don-t-forget-to-ask"
}