{
  "title": "The Traitor's Mercy",
  "description": "In the court of Staria, mercy is rarely a blessing…Sabre de Valois is the last of his line. Saved from the gallows while his family hangs for treason, Sabre is given the chance to pay off their debt and clear his family name. To do so, he must serve as a courtesan in the pleasure district, but the only House willing to take him in and risk the disfavor of the king is the House of Onyx, which caters to the darker desires of the Starian noble elite. There, he finds his masochism is an asset, the courtesans are kinder than the nobles of the Starian court, and that he cannot help but be inexorably drawn to the owner of the House of Onyx, Laurent de Rue.Lord Laurent de Rue knows that love is dangerous. Abandoned in the pleasure district with no memory of his past, Laurent clawed his way to notoriety and earned his title through cunning and skill. He has seen love ruin the lives and ambitions of those he passed on his way to the top, and he has no intention of letting himself fall prey to the same mistakes. Yet he can’t stop himself from growing closer to Sabre de Valois, who loves so earnestly and so completely that even Laurent’s steel will is starting to break.But Sabre has secrets of his own, and when the machinations of the court threaten to put Sabre in danger, Laurent will have to decide whether he will risk it all for love, or let Sabre de Valois slip through his fingers.(Please note: The Traitor’s Mercy is an m/m dark fantasy novel, set in a fictional world where the kink aspect is not intended as a representation of real-life BDSM practices or dynamics.Please be advised that while this title features a happy ending, it contains darker elements that some readers may find uncomfortable. It is intended for adult, mature readers only. )",
  "genres": [
    "Fantasy",
    "M M Romance",
    "BDSM",
    "Romance",
    "Dark",
    "Magic",
    "High Fantasy"
  ],
  "author": "Iris Foxglove",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/57191918-the-traitor-s-mercy"
}