{
  "title": "The Lipstick Murders",
  "description": "A DETECTIVE WHO’S NO ANGEL DESPITE HIS NAME.Discover a gripping series of murder mysteries set in south Yorkshire.MEET DETECTIVE INSPECTOR MICHAEL ANGEL. AN OLD-SCHOOL POLICEMAN WHO SOMETIMES RUBS HIS COLLEAGUES UP THE WRONG WAY. HE’S GOT HIS FLAWS, BUT HE NEVER GIVES UP ON A CASE.HE MARKS EACH VICTIM WITH A TWISTED MESSAGE WRITTEN IN HOT PINK LIPSTICK.There’s a brutal new killer on the loose in Bromersley. Detective Angel knows exactly who he’s hunting — vengeful patient Frank Arrowsmith.Arrowsmith went under the knife hoping for a brand-new face. But he hated what he got.Now he’s out of hospital and on the rampage — starting with the doctor and nurse who butchered his looks.The police know who he is. Just not what he looks like. No one has seen his new face and lived to tell the tale.Can Angel catch the Lipstick Murderer before he strikes again?A BRILLIANTLY ABSORBING MYSTERY FULL OF TWISTSPerfect for fans of R.D. Wingfield, Colin Dexter, Peter Robinson, Reginald Hill, and Agatha Christie .THE DETECTIVEMichael Angel is over fifty, married to Mary. They don’t have any children. They are a devoted couple but the relationship sometimes breaks down due to his job or due to the problems of Mary’s sister who lives in Edinburgh and imposes on their easygoing natures. Michael works at the small local police station and is devoted to defeating crime, murder, and dishonesty of any sort and has no personal ambition beyond being a good husband and a successful detective. He doesn’t want promotion with all the routine office work and stress that goes with it. He is incorruptible but always short of money. He is always at odds with his immediate chief, Detective Superintendent Horace Harker, who is lazy, a hypochondriac and not a bit interested in assisting Angel in serious police work.PRAISE FOR ROGER SILVERWOOD“Solid plotting, unpretentious writing, thoroughly reliable entertainment .” Morning Star“A cast of characters you really want to populate with familiar faces of actors you see each week on TV — great fun. Angel is terrific .” Books Monthly“Once again Silverwood combines a classic mystery plot with well-developed characters .” Publishers WeeklyDETECTIVE ANGEL SERIESBook 1: THE MISSING NURSEBook 2: THE MISSING WIFEBook 3: THE MAN IN THE PINK SUITBook 4: THE MORALS OF A MURDERERBook 5: THE AUCTION MURDERSBook 6: THE MISSING KILLERBook 7: THE UMBRELLA MURDERSBook 8: THE MISSING MILLIONAIREBook 9: THE MISSING THIEFBook 10: FIND THE LADYBook 11: THE MISSING MODELBook 12: MURDER IN BARE FEETBook 13: THE MISSING HUSBANDBook 14: THE CUCKOO CLOCK MURDERSBook 15: SHRINE TO MURDERBook 16: THE SNUFFBOX MURDERSBook 17: THE DOG COLLAR MURDERSBook 18: THE CHESHIRE CAT MURDERSBook 19: THE DIAMOND ROSARY MURDERSBook 20: THIRTEEN STEPS TO MURDERBook 21: THE FRUIT GUM MURDERSBook 22: THE MONEY TREE MURDERSBook 23: ANGEL AND THE ACTRESSBook 24: THE MURDER LISTBook 25: THE LIPSTICK MURDERSJoin the Joffe Books mailing list for updates on the next mystery coming soon!",
  "genres": [],
  "author": "Roger Silverwood",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/57188609-the-lipstick-murders"
}