{
  "title": "The Bandalore",
  "description": "His second chance at life will be the bloody death of him.Silas Mercer is a dead man. Or at least...he was.Upon waking in his grave, he finds himself without a single memory of the life he once lived. Silas is bewildered and lost, and apparently, now in the employ of the mysterious Order of the Golden Dawn. A secretive organisation who specialise in all things supernatural.To begin with, their plans for him seem to involve nothing more than making a spectacle of himself in front of London society, with his terrible dancing skills and inept attempts to host the occasional séance.But Silas’s odd new life takes a startling turn when the Order partners him with the scandalous rake, Tobias Astaroth. A quick-tempered, dangerously beautiful man who harbours some hellish secrets.Their unlikely, and infuriating, partnership soon faces its first terrifying challenge.A monster straight out of a nightmare is haunting the woods of Leicester, and the Order want Silas and Tobias to end its rampage.But nothing in this world is as it seems. Not the Order. Not Silas himself, and certainly not the incorrigible and utterly beguiling Mr Astaroth.For Silas, the perils that lie ahead are many. But few are as dangerous as the bewitching man at his side.A slow-burn, opposites attract, MM Historical Fantasy series.Contains: Sexual content, violence and rather a lot of cursing.This is the first book in the thrilling Historical Fantasy series, The Diabolus Chronicles (8 Book Series):The Verderer - Pitch & Sickle Book TwoThe Skriker - Pitch & Sickle Book ThreeThe Greensward - Pitch & Sickle Book FourThe Fulbourn - Pitch & Sickle Book Five The Herlequin - Pitch & Sickle Book Six (Preorder now - April 27 Release)",
  "genres": [
    "Fantasy",
    "Historical",
    "Paranormal",
    "M M Romance",
    "Historical Fiction",
    "LGBT",
    "Mystery"
  ],
  "author": "D.K. Girl",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/57202351-the-bandalore"
}