{
  "title": "Control Artist",
  "description": "Dahlia Akana has no idea where she’s going in life.All she’s ever wanted to do is travel, and her inner circle pressuring her to figure out her purpose only makes her wanderlust grow stronger. But she’s comfortable being a nanny to her nieces in the small Pennsylvania town where her sister lives. Though she’s far overstayed her desired timeline, it’s a place filled with friends and familiarity while she plots her next move.Until she meets the devastatingly gorgeous, obnoxious rookie who is slated to be the next superstar on the town’s top tier baseball team. He’s everything she doesn’t want, but can’t seem to stay away from. As they spend more time together, she discovers that he might just be the anchor she’s always looked for.When secrets, lies, and a humiliating public scandal rock their world, will she be able to stay with him? Fight for him? Or will her age-old tactic of fleeing erase any shot at a happily ever after?Garrett Chester has always known exactly what he wants.To be the best pitcher in the history of the major leagues. And luckily, with more talent in his pinky than other people have in their entire body, he’s well on his way. It’s his attitude that leaves something to be desired. Cocky, reckless and soaking up his newfound fame, the rookie attracts the attention of the tabloid press.When he meets the feisty woman just as beautiful as the flower she’s named after, she gives him a refreshing reality check. With each passing day, not only does he fall harder, but she makes him want to be a better man.Except the past that haunts him inevitably catches up, and ends up taking her down with him. Alone, exposed and cast out, it’s a reminder of the childhood trauma that has always plagued him. Can he put the rumors to rest, piece together a career in shambles, and be the hero she needs?",
  "genres": [
    "Sports Romance",
    "Baseball",
    "Romance",
    "Sports",
    "Small Town Romance"
  ],
  "author": "Carrie Aarons",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/57207750-control-artist"
}