{
  "title": "Upon a Midnight Dreary",
  "description": "When doors creak and ghostly whispers can be heard throughout the halls, this stunning collection of haunted Historical Romance novellas is sure to leave you breathless with ethereal, romantic tales...Welcome to Upon a Midnight Dreary anthology!Many of your favorite Historical Romance authors have come together for a collection of never-before published stories inspired by true, legendary hauntings of the British Isles. These tales will give you a chill, a thrill, and have you reading them over and over. From the moors of Devon to the ballrooms of Regency London, and far north into the Scottish Highlands, these stories will bring you wistful dreams of legendary and haunting romance. You’ve never before experienced a collection like this by some of the very best authors in Historical Romance.Authors in this anthology include:Kathryn Le Veque - NevermoreChasity Bowlin - Into the NightHildie McQueen - The Stones of Ard CairnMaggie Andersen - White Lady LostMary Lancaster - The Others of OchilMeara Platt - Moonstone LandingVioletta Rand - Belware BridgeAlexa Aston - The Bridge to LoveAnna Markland - Blind FaithAubrey Wynne - Percy's PerditionElizabeth Ellen Carter - The Ghost BrideElizabeth Johns - Haunted KnightElizabeth Keysian - The Grey Lady of the ManorEmily E.K. Murdoch - A Governess of No FearEmily Royal - Haunted HartHeather McCollum - Rohaise the RedAnna St. Claire - Once Upon a Haunted HeartLynne Connolly - The Lair of the BurrellsMaeve Greyson - Guardian of Midnight ManorWhitney Blake - The Dauntless BoyLight your candle, lock your doors, and settle down to this smashing collection of darkly-tinged romantic stories with unforgettable heroes and magnificent ladies. Romance has never been so daring... or so haunting!And if you hear a knock on your door… don’t answer it unless you are prepared to welcome a wandering wraith in a tattered wedding gown...",
  "genres": [
    "Historical"
  ],
  "author": "Kathryn Le Veque",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/57207423-upon-a-midnight-dreary"
}