{
  "title": "Nice Racism: How Progressive White People Perpetuate Racial Harm",
  "description": "We've all seen it. A white person is called to account for racism and responds with incredulity, offering a litany of justifications and excuses. White progressives will insist they cannot be racist, using evidence such as \"I have a black friend\" or \"I have traveled extensively.\" Their friends will vouch that the behavior cannot be racist because \"He's a really nice person.\" It's clear that many white people do not understand systemic racism and cannot separate intentions from impact. In this insightful follow-up to her acclaimed bestseller White Fragility, sociologist Robin DiAngelo illuminates the subtle and insidious racial patterns of progressive white people, revealing how a culture of niceness actually protects racism.Writing directly to white people as a white person, DiAngelo identifies many common white racial patterns and explains how white people who see themselves as racially progressive can cause the most daily harm to people of color. These patterns include rushing to prove that we are \"not racist,\" downplaying white advantage, pretending white segregation \"just happens,\" co-opting indigenous and other groups' rituals, and allowing shame or personal trauma to immobilize and excuse inaction. She challenges the ideology of individualism and explains why it is appropriate to generalize about white people in order to challenge racism. She demonstrates how white people who experience other oppressions still benefit from systemic racism. Writing candidly about her own missteps and struggles, and drawing on her insider's perspective, DiAngelo models a path forward, encouraging white readers to continually face their complicity and embrace courage, lifelong commitment, and accountability.",
  "genres": [
    "Nonfiction",
    "Race",
    "Social Justice",
    "Anti Racist",
    "Audiobook",
    "Politics",
    "Sociology"
  ],
  "author": "Robin DiAngelo",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/57205027-nice-racism"
}