{
  "title": "Believe, Live, Run: A story about having faith",
  "description": "In his story he introduces how he has become from a “village peasant” into a biomedical engineer, and what extreme difficulties he had to challenge during his way towards fulfilling childhood dreams.Long-distance running also played a major role in his complete recovery, therefore, in this regards, but regardless sport, he introduces that knowledge and life aspect being useful for everyone, which helps us to taste the joy of life even in the most desperate moments.\"My body no longer functions the way I want it to.My limbs no longer move as I would have them. My pulse is sky-high. I’m exhausted.I am in spasms, my legs ache. I can hardly maintain proper posture and move at the same time.I am exhausted not only physically, but mentally as well.Psychologically I’m falling apart; in my head, I am starting to unravel.I would love to stop, to give up. But despite all this, a voice whispers in my “Don’t give up. Keep going. One more step. It’s just one more step.”To keep on, the voice has to whisper in every moment, because one more step is, in reality, many thousand steps until the finish line. Several thousands of little obstacles to conquer. So many little emotional low points to get over.The phantoms of treatment received for a malignant tumor also surface among the memories above along with those of a marathon I had previously run. What the two have in common is that reaching the goal in both cases required not only physical but mental stamina as well.”Why me?”Asks everyone who has ever been in this situation.I am a strong, happy young person with my whole life ahead of me.It is just the beginning.I’m in my early twenties.I resisted, I was angry at the world that all this was happening to me.In this book, I seek and find the answer to the question “Why me?” I invite the reader to join me on this it is a story about wanting to live.\"“A real story, miracle about human will, outreaching our mind. In the book he shows that we can be able to achieve everything even in the most complicated moments.\"- Tamas Bodis, ultrarunner, Spartathlon winner\"He represents the truth with oiliness and passion, claiming that life is the biggest gift. Now he reveals his gratitude in the form of a book, also exemplarily encouraging us for activity and struggle\"- Gaspar Csere, Olimpic marathon runner“You are the example on that we should not accept less than we are able to! In particular if the opportunity of failure is also there, just like victory. Because it is always us who decide the competition between the two.”- Gabor Rakonczay, world recorder extreme athlete“The book aims to present a personal aspect on one of the most insane disease, malign tumour and sufferings experienced during the healing therapy. In the fire of suffering, a new personality, new life goal was forged. There are not many bigger gifts than learning from the experiences of others, and this book introduces many such experiences, which may set an example for all of us.\"- Peter Turai, MD\"Only the bravest are able to make the lives of other people easier inspired by their own personal tragedies, turning towards new and noble targets, making the lives of other people easier.",
  "genres": [],
  "author": "Bertalan Thuroczy",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/57204338-believe-live-run"
}