{
  "title": "Crucifixed",
  "description": "Model: Viking Will NewtonPhotographer: James CritchleyCover designer: Lou Gray/Gray Creations**DISCLAIMER**Crucifix is nothing like FOCUS from Rotten Apple--they are night and day different. This is a romance, albeit a gritty and emotional one.**There is unfiltered language, uncensored adult situations, and justifiable violence. Although this book is about a nun and would be priest it isn't about bashing the Catholic religion. It does delve into a specific group of Catholics doing very bad things.They knew the kid who would’ve become Father Giovanni. It was time for them to meet Crucifix—the man who would make them confess before administering Last Rites.Holy Mary, Mother of God—even you can’t hear their prayers.They’re damned.We were raised in the orphanage together until they tossed me out on the streets. By then, it was too late to give back the innocence I took from her. It was alotta years later, but somehow she found me. That’s when I becameher dirty secret—the president of a 1% club and the nun—hidin’ out away fromthe eyes of the church.Since that day on the street Gingersnap just keeps comin’ to confess her sins and kneel at my boots, and I’m more than happy to dish out the penance she feels she needs. From the start it’s been unholy communion with us. I was gonna be a priest, and she grew up to become Sister Fiona. We both know it’ll keep happenin’ like it has since we were teenagers.It kicks my heart all over NYC and back, but I keep waitin’ for her to feel sinful enough to show up at my door—she always does.Until the night I sent her away.Until the night I thought she was gonna die because of what I’d taken from her.I guess I’ve been a ba$tard since the day I was born. Now, I’m royalty and the onlyone who will save her. The only Ba$tard who loves her.",
  "genres": [
    "Dark",
    "Romance",
    "Friends To Lovers"
  ],
  "author": "B.B. Blaque",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/57225276-crucifixed"
}