{
  "title": "\"Did You Say Something, Susan?”: How Any Woman Can Gain Confidence with Assertive Communication",
  "description": "The secret is out! Many women - even successful professionals - have trouble saying what they need to say, for lack of confidence or skill or for fear of offending. Even the phenomenally successful Oprah Winfrey said that her \"biggest flaw is [her] inability to confront people.\" Most of these women would love to start speaking up more often - if only they had some guidance on how to do it.This powerful, practical guide offers proven techniques that enable women to experience the exhilaration and empowerment of expressing themselves in any situation - with coworkers and bosses, with friends and relatives, with doctors, lawyers, contractors, and other service providers. Anywhere, anytime.Who is Susan? She's every woman who has ever kicked herself for what she \"should\" have said. Maybe she just couldn't summon up the courage or think of the right response. Many girls who were brought up to be passive and uncomplaining never learned the skills involved in speaking up. And assertiveness really does involve knowing how to be tactful but forceful, how to escalate your response when necessary, how not to undermine what you say by using submissive body language or unassertive speech patterns.\"Did You Say Something, Susan?\" will teach you how * Say no without guilt* Speak up for your rights* Project confidence and high self-esteem* Get want you want on your own terms* Gracefully stop put-down artists in their tracks* Assertively accept and give praise* Gain the respect and admiration of others* Never leave anything important unsaid* Help your children become confident, assertive communicatorsThrough example and encouragement, self assessments and exercises, role-playing, positive imagery techniques, and mental rehearsal, \"Did You Say Something, Susan?\" offers a variety of specific hands-on strategies. A self-assessment in the introduction helps you identify your strengths and weaknesses and directs you to the most appropriate chapters. The book is rich with examples and anecdotes demonstrating how a variety of women have overcome their passive communication styles to achieve a level of effectiveness and self-confidence that they never thought possible. It serves as coach and counselor, and gives advice that will help you make immediate and long-term changes in your life.",
  "genres": [
    "Nonfiction",
    "Communication"
  ],
  "author": "Paulette Dale",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/57228958-did-you-say-something-susan"
}