{
  "title": "The Emperor of North America",
  "description": "John McNichol’s The Emperor of North America The Young Chesterton Chronicles Book 2 It’s been over a year since Gilbert Keith Chesterton and his friends defeated the Martian tripod invasion. Since then, he has a new faith, a new job as a reporter for the London Times, and a new love―a beautiful heiress named Frances. Life couldn’t be better. But then things begin to go very wrong. Disturbing questions surface from Gilbert’s murky past. His best friend Herb’s sudden, unexplained wealth has made him distant and evasive. And the mysterious redheaded woman reappears, with trouble surely behind her. When Gilbert learns his life is in jeopardy, he leaves England and returns to his American homeland, where he thinks he’ll be safe. There he meets a powerful man who calls himself the “Emperor of North America.” Why has he taken such a keen interest in Gilbert’s career? Gilbert fights past dogged, airborne assassins and steam-powered cowboys, through the streets of New York and a floating city in the clouds. Along the way he learns that while his adversaries may change, America may not be any safer than England. For it is in America that both Gilbert and Herb will confront their most dangerous opponents yet...themselves. About the Book The Emperor of North America by John McNichol is the sequel to the bestselling novel The Tripods Attack! and the second volume in the Young Chesterton Chronicles―a delightfully inventive fiction series for teens to adults that re-imagines the famous Catholic author as a young man living in an alternative Edwardian age of steam-driven wonders. “The Tripods Attack is a page-turning adventure of Chestertonian proportions, a feast of the imagination for the young and for adults. It rendered this reader ready to read more Chesterton, as well as, this, McNichol’s next volume!” Kevin Vost, Psy.D., bestselling author of Tending the Temple and Memorize the Faith!",
  "genres": [
    "Science Fiction"
  ],
  "author": "John McNichol",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/12735394-the-emperor-of-north-america"
}