{
  "title": "The Barbizon: The New York Hotel That Set Women Free",
  "description": "From award-winning author Paulina Bren comes the first history of New York’s most famous residential hotel—The Barbizon—and the remarkable women who lived there.The Barbizon tells the story of New York’s most glamorous women-only hotel, and the women—both famous and ordinary—who passed through its doors. World War I had liberated women from home and hearth, setting them on the path to political enfranchisement and gainful employment. Arriving in New York to work in the dazzling new skyscrapers, they did not want to stay in uncomfortable boarding houses; they wanted what men already had—exclusive residential hotels that catered to their needs, with daily maid service, cultural programs, workout rooms, and private dining. The Barbizon would become the most famous residential hotel of them all, welcoming everyone from aspiring actresses, dancers, and fashion models to seamstresses, secretaries, and nurses. The Barbizon’s residents read like a who’s who: Titanic survivor Molly Brown; actresses Rita Hayworth, Joan Crawford, Grace Kelly, Tippi Hedron, Liza Minelli, Ali McGraw, Jaclyn Smith, and Phylicia Rashad; writers Sylvia Plath, Joan Didion, Diane Johnson, Gael Greene, and Meg Wolitzer; and so many more. But before they were household names, they were among the young women arriving at the Barbizon with a suitcase, and hope. Beautifully written and impeccably researched, The Barbizon weaves together a tale that has, until now, never been told. It is an epic story of women’s ambition in the 20th century. The Barbizon Hotel offered its residents a room of their own and air to breathe, unfettered from family obligations and expectations. It gave women a chance to remake themselves however they pleased. No place had existed like it before, or has since.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Audiobook",
    "New York",
    "Biography",
    "Book Club"
  ],
  "author": "Paulina Bren",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/57206622-the-barbizon"
}