{
  "title": "Still of the Night",
  "description": "The seals are cracking. Hell will follow after, and I'm caught in the middle.Everyone says I'm cursed. My father would've used the word evil. That's his excuse for being so strict, at any rate. Little does he know how right he is. I might look like a good girl on the outside, but deep down I'm really not.I carry the mark on my hand to prove it.But being good means not getting in trouble at school or he'll take it out on me. I am barely allowed to hang out with my friends, and they're starting to resent it. The safe and stable life I've been forced into is falling apart.Then my stepbrother moves in.Suddenly, being good doesn't seem so important. He makes friends with the local bad boys, and being around them feels like exactly where I belong. The problem is that Dad is having none of it. They're trouble, I'm supposed to be good, and the only one suffering here is me.I'm going to have to choose what matters most. Is it the years I've spent with my best friend? The boyfriend who's my escape from this insanity? Or maybe it's the three guys who finally make me feel alive - even with all the secrets they keep.Secrets that I'm stuck in the middle of.Secrets that prove I'm so much worse than I thought.Secrets that are tied directly to the scar on my hand.Still of the Night is a complete slow burn paranormal romance where the heroine doesn't have to choose between her love interests. Some aspects may be triggering for some readers. Includes stepbrother romance, an abusive parent, a parent lost to cancer, incidences of domestic violence, bullying, and plenty of teen awkwardness.Book 1 of 4 - Release scheduled - April 2, 2021A joint writing project between Auryn Hadley and Kitty Cox, we've teamed up under a combined pseudonym, Cerise Cole.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Demons",
    "Fantasy",
    "Urban Fantasy",
    "Romance",
    "High School"
  ],
  "author": "Cerise Cole",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/57222282-still-of-the-night"
}