{
  "title": "Conquer",
  "description": "True love is facing your own fears so your family can conquer theirs.The world is supposed to be mine. I took it when I was younger, and now I'm just coasting on my success. As an internationally renowned lingerie designer, I have everything I've ever wanted, including the three loves of my life.Or so I thought.Because if the world is mine, then it needs to bend to my will, and this small Texas town refuses to do that. These people look at me and see one thing: gay. I'm not. Bi-erasure is real, and it's starting to piss me off.I've been playing good so my boyfriend doesn't end up paying the price, but this? These redneck bubbas have gone too far this time. They think throwing out a flew slurs or beating the crap out of me will scare me off? They're wrong. I'm Ashton Walker. I came from nothing, and I promised myself I would never go back there.So I'll change the world instead.The first step is to get Southwind open again. That means we need some people on our side, and Gran always said that we'd catch more flies with honey than vinegar. I'm about to risk it all for this place. If I fail, we'll have nothing - maybe not even us.So I'll fight for my family with everything I have. My money, my fame, and even that cruel streak that makes it so easy to tear others down - or lift them up. They want to call me gay? Well, it's time these cowboys see what happens when their wives meet me. After all, I come bearing lingerie.I know I'm going to end up paying for this stunt.I just hope it won't be with my life.TRIGGERS MAY INCLUDE: Mentions of cancer, violence, criminal history, eating disorders, bullying, self harm, and discussions of child sexual assault and trauma.This is a love story, but broken people deserve love too - and an ally on their side.\nConquer\n is a 190,000 word novel with the series ending that will leave you satisfied. The main female character will have multiple, often complicated, relationships with different men. Includes M/M and M/F romance.For the purposes of the story, some medical and professional ethics may be bent or even broken. Graphic language and situations that are suitable for a mature audience are included.",
  "genres": [
    "Reverse Harem",
    "Contemporary",
    "Romance",
    "M M Romance",
    "Contemporary Romance",
    "Friends To Lovers",
    "Second Chance"
  ],
  "author": "Kitty Cox",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/57222158-conquer"
}