{
  "title": "A Day in a Medieval City",
  "description": "An opportunity to experience the daily hustle and bustle of life in the late Middle Ages, A Day in a Medieval City provides a captivating dawn-to-dark account of medieval life. A visual trek through the thirteenth and fourteenth centuries—with seasoned historian and expert on medieval iconography Chiara Frugoni as guide—this book offers a vast array of images and vignettes that depicts the everyday hardships and commonplace pleasures for people living in the Middle Ages.A Day in a Medieval City breathes life into the activities of the city streets, homes, fields, schools, and places of worship. With entertaining anecdotes and gritty details, it engages the modern reader with its discoveries of the religious, economic, and institutional practices of the day. From urban planning and education to child care, hygiene, and the more leisurely pursuits of games, food, books, and superstitions, Frugoni unearths the daily routines of the private and public lives of citizens. A Day in a Medieval City is a charming portal to the Middle Ages that you'll surely want with you on your travels to Europe—or in your armchair.“With its color illustrations of rare paintings and artifacts, this thoughtful and informative, elegantly fashioned excursion into the life of a medieval city is a veritable feast of information and visual delights. Frugoni is a marvelously experienced historical travel guide.”— Choice “Stunningly beautiful . . . and a good read as well. . . . It’s amazing how much wealth of detail and image Ms. Frugoni has packed into this delightful, relatively small book.”—Steve Goode, Washington Times“Charming and insightful. . . .Written with exceptional grace and infused with a warm sense of humanity.”— Library Journal",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Italy",
    "Medieval History"
  ],
  "author": "Chiara Frugoni",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/100357.A_Day_in_a_Medieval_City"
}