{
  "title": "Food Saved Me: My Journey of Finding Health and Hope through the Power of Food",
  "description": "• National Bestseller •You can live a full, happy, and healthy life without ever feeling excluded or deprived.When doctors told Danielle Walker that food didn’t cause her autoimmune disease and couldn’t help control it, she set out to prove them wrong.Diagnosed with an extreme form of ulcerative colitis at 22, Danielle was terrified she’d never be able to eat all the wonderful, great-tasting foods she loved growing up or host warm, welcoming gatherings with family and friends. So when the medicine she was prescribed became almost as debilitating as the disease itself, Danielle took matters into her own hands, turned her kitchen into a laboratory, and set to work creating gut-healthy versions of the foods she thought she’d never be able to enjoy again. Three New York Times bestselling cookbooks later, Danielle has become a beacon of hope for millions around the world suffering from autoimmune diseases, food allergies, and chronic ailments.Now for the first time, with stunning transparency about the personal toll her illness took on her physically, emotionally, and spiritually, Danielle reflects on everything she’s learned during her decade-long journey toward healing―including the connection between gut health and overall well-being, the development of her favorite recipes, and the keys for not simply surviving her autoimmune disease but thriving despite it. Through her resilience, Danielle tells a story that provides hope ―hope that despite your ailments or hardships, you can live a full, happy, and healthy life without ever feeling excluded or deprived.Food saved Danielle Walker. And it can save you, too.Includes six fan-favorite recipes and the stories behind them!",
  "genres": [
    "Health",
    "Nonfiction",
    "Memoir",
    "Food",
    "Audiobook",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Danielle Walker",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/57239684-food-saved-me"
}