{
  "title": "Freedom's Forge: How American Business Produced Victory in World War II",
  "description": "SELECTED BY THE ECONOMIST AS ONE OF THE BEST BOOKS OF THE YEARRemarkable as it may seem today, there once was a time when the president of the United States could pick up the phone and ask the president of General Motors to resign his position and take the reins of a great national enterprise. And the CEO would oblige, no questions asked, because it was his patriotic duty.   In Freedom’s Forge, bestselling author Arthur Herman takes us back to that time, revealing how two extraordinary American businessmen—automobile magnate William Knudsen and shipbuilder Henry J. Kaiser—helped corral, cajole, and inspire business leaders across the country to mobilize the “arsenal of democracy” that propelled the Allies to victory in World War II.   “Knudsen? I want to see you in Washington. I want you to work on some production matters.” With those words, President Franklin D. Roosevelt enlisted “Big Bill” Knudsen, a Danish immigrant who had risen through the ranks of the auto industry to become president of General Motors, to drop his plans for market domination and join the U.S. Army. Commissioned a lieutenant general, Knudsen assembled a crack team of industrial innovators, persuading them one by one to leave their lucrative private sector positions and join him in Washington, D.C. Dubbed the “dollar-a-year men,” these dedicated patriots quickly took charge of America’s moribund war production effort.    Henry J. Kaiser was a maverick California industrialist famed for his innovative business techniques and his can-do management style. He, too, joined the cause. His Liberty ships became World War II icons—and the Kaiser name became so admired that FDR briefly considered making him his vice president in 1944. Together, Knudsen and Kaiser created a wartime production behemoth. Drafting top talent from companies like Chrysler, Republic Steel, Boeing, Lockheed, GE, and Frigidaire, they turned auto plants into aircraft factories and civilian assembly lines into fountains of munitions, giving Americans fighting in Europe and Asia the tools they needed to defeat the Axis. In four short years they transformed America’s army from a hollow shell into a truly global force, laying the foundations for a new industrial America—and for the country’s rise as an economic as well as military superpower.   Featuring behind-the-scenes portraits of FDR, George Marshall, Henry Stimson, Harry Hopkins, Jimmy Doolittle, and Curtis LeMay, as well as scores of largely forgotten heroes and heroines of the wartime industrial effort, Freedom’s Forge is the American story writ large. It vividly re-creates American industry’s finest hour, when the nation’s business elites put aside their pursuit of profits and set about saving the world.Praise for Freedom’s Forge   “A rambunctious book that is itself alive with the animal spirits of the marketplace.”—The Wall Street Journal   “A rarely told industrial saga, rich with particulars of the growing pains and eventual triumphs of American industry . . . Arthur Herman has set out to right an injustice: the loss, down history’s memory hole, of the epic achievements of American business in helping the United States and its allies win World War II.”—The New York Times Book Review   “Magnificent . . . It’s not often that a historian comes up with a fresh approach to an absolutely critical element of the Allied victory in World War II, but Pulitzer finalist Herman . . . has done just that.”—Kirkus Reviews (starred review)From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Business",
    "Economics",
    "World War II",
    "Military Fiction",
    "War"
  ],
  "author": "Arthur Herman",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/57236188-freedom-s-forge"
}