{
  "title": "The Five Lives of Our Cat Zook",
  "description": "In this warmhearted middle-grade novel, Oona and her brother, Fred, love their cat Zook (short for Zucchini), but Zook is sick. As they conspire to break him out of the vet’s office, convinced he can only get better at home with them, Oona tells Fred the story of Zook’s previous lives, ranging in style from fairy tale to grand epic to slice of life. Each of Zook’s lives has echoes in Oona’s own family life, which is going through a transition she’s not yet ready to face. Her father died two years ago, and her mother has started a relationship with a man named Dylan—whom Oona secretly calls “the villain.” The truth about Dylan, and about Zook’s medical condition, drives the drama in this loving family story.Praise for The Five Lives of Our Cat ZookSTARRED REVIEW \"Rocklin’s characters are fully developed: readers will be invested. Set in Oakland, readers are also treated to a refreshingly authentic child’s view of a diverse city. The only imperfection in this novel is that it ends.\" —Booklist, starred review “Oona’s character is a combination of Harriet the Spy in curiosity and Anastasia in spunk. Another emotionally satisfying outing from Rocklin; hanky recommended.” —Kirkus Reviews \"Just as she did in One Day and One Amazing Morning on Orange Street, Rocklin intertwines her characters so smartly that the many coincidences and serendipitous events feel organic to the story. The story’s ending—bittersweet, inevitable, and true—offers much-needed catharsis for the family and for anyone who has ever loved a pet.\" —The Horn Book \"This heartwarming family tale is filled with resilient and thoughtful characters who are willing to learn from their mistakes. Readers who enjoy the novels of Jeanne Birdsall and Leslie Crunch will appreciate this charming story.\" —School Library Journal \"There is a strong sense of place in this loving story with the ending sure to generate some tears. This would make a strong library lesson extension activity.\" —Library Media Connection\nAwards\n SCBWI’s Golden Kite Award for Fiction - 2012 Dorothy Canfield Fisher Book Award Rebecca Caudill Young Readers’ Book Award",
  "genres": [
    "Realistic Fiction",
    "Middle Grade",
    "Animals",
    "Cats",
    "Juvenile",
    "Family",
    "Fiction"
  ],
  "author": "Joanne Rocklin",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/12735988-the-five-lives-of-our-cat-zook"
}