{
  "title": "The Perfect Quickie Volume 1",
  "description": "Raunchy, Spine-Chiller, and Secrecy is compelled in this deliciously thought provoking novella of 4 short urban stories in Volume 1!Includes:Jack Of SpadesDetective Chris Malone is called into action after receiving word of a homicide less than a mile from his location. He finds a young woman shot dead at a popular club and is drawn into a twisted scene of drugs, sex, and power. Hounded every step of the way, it’s going to take every ounce of skill and smarts he has, if he hopes to survive long enough to stop the killer.The RingFaced with the championship fight of his life, Jamal Perry has to win. He had worked hard to get to this point and winning would mean the world to all those who believed in him. However, his journey had more to offer than just a reunion. Jamal finds what he believed to be true love and for the first time in his life, he felt fulfilled. But everything changes when the one who he gave his heart to turns out to become the opposite of love at first sight. Will this reunion have a bitter end? A question only Jamal could answer.A Gentle KissAnnie is a single mom just trying to make it through the day and find that right person. Anyone. Haunted by memories and unsure where the future plans on taking her, Annie and her best friend head across the ocean to Paris. There she stumbles into a world she isn’t ready for and one she isn’t sure she can handle. A Gentle Kiss is a sexually charged adventure that will change Annie’s life forever.When I Met YouAaliyah Johnson wants nothing more than to gain admission to the same University as her boyfriend and her best friend but all that changes with betrayal. With the quest of attaining a new life, she moves to another state with a long list of stringent rules and no expectations. Little does she know, her new beginning would be full of bigger surprises.",
  "genres": [],
  "author": "J.M. Tucker",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/57251250-the-perfect-quickie-volume-1"
}