{
  "title": "No Escape From War",
  "description": "Revenge. Oh, it was going to be sweet.Warren “War” Channing finally has the chance to nail his beautiful, lying ex. And, no, he doesn’t mean “nail” in the down and dirty sexual way…War means he has the opportunity to send the lovely and infuriating Rose Shadow to jail. Turned out, the woman who had shattered his heart beneath her high heeled shoes was wanted for murder. She was on the run, and he was just the man to hunt her down and toss her into the nearest cell…War could hardly wait.He was the last man she expected to need.The breakup had been ugly. Painful. It had ripped out her heart and left her in a sad, crying heap as she ate her ice cream, but Rose had moved the hell on, and she had sworn to never, ever need War again. Except, well, now she did need him and his sneaky skills because Rose was in trouble up to her eyes. The kind of trouble that could wreck a woman’s life.He’ll make her pay.Rose has cracked the story of a lifetime. She’s uncovered a brutal serial killer who has been hiding in the shadows—only now, she is his next target. The cops think she’s involved in the string of murders because maybe her DNA had been at a crime scene and maybe she’d been spotted by witnesses at another location, but Rose is a reporter—she’d been at the scenes because she was tracking down the real killer. Now, though, because War has caught her, Rose is out of time and options. War is former special ops. He’s the best PI in town. And he’s the man who gave her more pleasure than should be legal…Too bad that he’s also the man who hates her the most.Forty-eight hours…then jail.They make a grudging deal—she’ll pay him anything he wants if he just gives her forty-eight hours before he turns her over to the cops. During that forty-eight hours, he will help her track the real killer. When the clock runs down, she’ll be out of his life for good. Except…a whole lot can change for two people in forty-eight hours. Hate can turn into desire. Need can rage out of control. And a love that you thought was long dead? It just might flash to life again.Provided, of course, that the murderer hunting Rose doesn’t manage to kill her before she and War can catch him. Forty-eight hours. The countdown starts now…Author’s note: The Trouble For Hire romance series features hot, former military heroes…and these guys truly are the best kind of trouble. All of the books are stand-alones with guaranteed happy endings. Danger, romance, action, suspense, humor…oh, it’s definitely time to find some trouble…",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Contemporary",
    "Second Chance",
    "Contemporary Romance",
    "Military Fiction"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/57230130-no-escape-from-war"
}