{
  "title": "These Trespasses",
  "description": "Alien invasion, war and devastation; is Earth at its end?We hold precious our families. We work hard to provide for them. We struggle to put food on the table and to care for them when they are sick.What if all of that changed? What if those we cared for were inflicted with some horrible disease that we could not understand? What if that disease did not kill, but liberate, pitting you against your loved ones?In a small Midwestern town, the world as we know it is about to come to an abrupt end. Sheila has picked this moment in time to return to her hometown. Upon arriving, she finds the small community lying in ruins and she begins the struggle of discerning what has happened to her family, her friends, the people she grew up with. Her only clue is a single letter, left behind by a man named Marty.Soon, Sheila catches up to Marty. And with the world around them left in decimation, they band together with other survivors in search of escaping the destruction. But everything is not what it seems.The government has played a role in this destruction. What things did our government do in secret, nearly right under our noses, to bring an alien invasion to Earth?The answer to this question begins with Marty; the only survivor in their group who appears to have any knowledge of what has unfolded. Marty recalls his past, both distant and recent. He relays a story of great loss to his newfound confidants and in doing so, brings to mind many new questions.Marty is not the only one that knows of these horrors. Each of them must face the truth of the people they were before this destruction and the person they will need to become in order to confront this terror.What secrets lie among these friends? Has the government found a means of invading even this small group? And what of Marty’s brother? What is his role in the future of the Earth? What things will need to be done to ensure he doesn’t succeed?As their plight becomes hopeless, they are forced to take the battle to their enemy and strike at the heart of the matter. Here Marty must confront his brother. But will it come too late? And will Marty be able to drown out his memories and do what he must to save his friends?Join this ragtag group as they take on an alien invasion unlike any other. Discover what these aliens want and the lengths they will go to get it. Learn of Marty’s relationship with his brother, how close they were, how much they depended upon each other. See what Marty does to protect that brotherly bond.Who of you will fight with Marty and Sheila in order to protect everything we cherish in this thriller? Prepare yourself. Only you can determine the future of the Earth.",
  "genres": [],
  "author": "Kenneth W. Cain",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/12736586-these-trespasses"
}