{
  "title": "The Best of Harry Turtledove",
  "description": "For more than forty years, Harry Turtledove has been the acknowledged master of one of science fiction's most durable sub-genres: the tale of alternate history. In the course of an incredibly prolific career, Turtledove has created a host of brilliantly imagined revisionist histories on subjects ranging from the American Civil War to the Byzantine Empire to the Second World War (in which an alien invasion plays an unexpected role.) His work includes standalone novels and multi-volume epics, along with an impressive array of short fiction, the best of which has been gathered in this generous, irreplaceable volume. The Best of Harry Turtledove opens with “Peace is Better,” the first of three stories featuring Bill Williamson, the nine-foot-tall Sasquatch who serves as governor of the fictional state of Jefferson, a place where “everyone gets along, regardless of race or size.” Or species. “Bonehunters” posits a world in which the extinction event that ended the reign of the dinosaurs never took place. Two subsequent stories, “Junior & Me” and the Melville-inspired novella, “The Quest for the Great Gray Mossy,” continue to develop this scenario. “The Eighth Grade History Class Visits the Hebrew Home for the Aging” imagines a world in which Anne Frank survived and emigrated to the United States, where she recounts her experiences to a visiting middle school class. “But It Does Move” is the account of a fictional confrontation between Galileo and a leader of the Holy Inquisition. These are only a few of the people, places, and historical epochs you will encounter in this magisterial collection. The twenty-four stories in The Best of Harry Turtledove constitute a master class both in the technique of alternate history and in the art of narrative itself. Longtime Turtledove readers will take this book to their hearts. Newcomers will find themselves searching for more of the author's inimitable—and highly addictive—fiction. They have a lot to look forward to.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Alternate History",
    "Fantasy"
  ],
  "author": "Harry Turtledove",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/57280212-the-best-of-harry-turtledove"
}