{
  "title": "Burning Little Secrets",
  "description": "Recommended for readers 18 years and up!**A secret steamy standalone romance**JuliaWhen my best friend Eve invited me to visit her and my dad back home in North Carolina, I hesitated. My wedding with Robbie was only a week away, and our rocky relationship was already on edge. Even though it was a bad time to go back, I couldn’t resist the chance to visit my best friend—both to sort out my own feelings and escape from Robbie’s increasingly controlling behavior.Never could I have imagined how this quick trip and an innocent night of freedom could have spiraled out of control. Meeting Nathan wasn’t supposed to happen, and I definitely wasn’t supposed to kiss him. But he was so kind and sexy, and it was so nice to feel wanted for once. But, as soon as I came to my senses and ran from our kiss, I bumped into the one person I never expected. My trip away is now a harbor of secrets, created by those close to me, and my new found taste for freedom. NathanWhen I saw Julia watching me at the bar, I felt something I hadn’t felt in years. When I kissed her, I knew she was meant to be mine. But this Robbie guy she was with, he seemed to have some pull over her, something I couldn’t understand. I hated how he treated her, and I knew she deserved better. So, when she offered me the time she had left, I decided to take it, showing her the side of freedom she only dreamed of. Our connection, our chemistry—it was undeniable. I wanted her to leave Robbie; I wanted her to be with me. But, when it came down to it, what I really wanted was for her to be happy. But could I keep her close while keeping my demons at bay? The things I’ve done, the person I once was, and all my little secrets. I’ll fight to keep her home, to make her mine, even if it takes a little naughty convincing.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Dark Romance",
    "Drama",
    "Firefighters",
    "Adult"
  ],
  "author": "Vivian Mae",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/57294493-burning-little-secrets"
}