{
  "title": "Grave Revelations",
  "description": "\"It's always interesting to read early work by someone like Richard Laymon, John Little, or Gord Rollo, because you are looking at an established star's apprentice efforts. Sometimes the work is rough, the writer obviously learning by doing, but the writing and story-line is always compelling. And like those mentioned, Kenneth W. Cain achieves that with his writing. Grab the series and catch a rising star's early efforts. You won't be sorry. Recommended.\"--Gene O'Neill, THE CAL WILD CHRONICLES, and ENTANGLED SOUL with Chris MarrsThe Infinite has returned for his lost children.“Like the Walking Dead, but with aliens instead of zombies”“Cain does a nice job of making each character unique, going so far as to alter the narrative when focusing on different people.” ~ Amazon review“As with Kenneth Cain’s first representation of The Saga of I, this was definitely worth the time to read. Sci-fi and horror fans will enjoy the story and underlying themes.” ~ Amazon review “The characters just come alive and you feel like you’re right there with them, experiencing what they’re experiencing!” ~ Amazon reviewIn the post-apocalyptic world, as mankind struggles to rebuild, a familiar face returns. As this man descends from the skies, unclothed and resembling a well-known historical figure, those who meet him have no choice but to confront their beliefs. Because of this, their morals, their souls, their very essence is tested.Marty is once more called to battle, as he sees a terrifying glimmer in Sheila’s eyes that he remembers all too well. This time, though, Marty is prepared. But can he count on everyone else to stand by his side and fight with him?But The Infinite, or I as he prefers to be known, has his own plans. Calculating in his approach, ever dominate, he has convinced many to follow in his footsteps, drink of his blood, and eat of his flesh. He has made food were there was none. He has performed miracles.Not everyone is so easily convinced. And when one stray servant discovers the truth, it will be chilling. It will change the way you think, the way you picture The Infinite. You will learn of his true self and as his plan unfolds, you will see just how menacing I can be.What will Marty face when he seeks the help of his friends? Who will stand by his side and fight this unimaginable creature? This is now personal, more than ever before. There are secrets, things that even Sheila has kept from Marty. But the all-powerful, all-knowing I sees everything. And I will use these secrets to weaken his brother, to bring him to the edge of corruption.Will Marty and his friends once more be able to save their planet from annihilation? The horrors they face this time will be more powerful, more terrifying, capable of buckling their will and breaking them down to the point of surrender. And behind it all will be the relentless I, with one sole purpose driving him, where the only acceptable outcome is to have his brother standing by his side.But do not count everyone out. There are not other forces at work here. Sometimes the unexpected is the very thing one needs to rely on.Who of you will fight with Marty and his friends in order to protect everything we cherish in this thriller? Prepare yourself. Only you can determine the future of the Earth.",
  "genres": [],
  "author": "Kenneth W. Cain",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/12736568-grave-revelations"
}