{
  "title": "Sankta Psyko",
  "description": "Johan Theorins romaner med Öland som fond har satt stora avtryck i svensk spänningslitteratur. Nu byter han tillfälligt spelplats och från ett vindpinat alvar tar han oss med till en mellanstor stad någonstans på västkusten.Dit anländer Jan Hauger för att söka tjänst som förskolepedagog. Men Gläntan är inte riktigt som andra förskolor. Det ligger på andra sidan muren till Sankta Patricia - med öknamnet Sankta Psyko - ett säkerhetsklassat sjukhus där psykiskt störda våldsbrottslingar vårdas. Gläntan är Sankta Patricias egen förskola, där patienternas barn vistas för att under noggrann övervakning få träffa sina föräldrar. En av Jans uppgifter blir att eskortera barnen genom de underjordiska gångarna som förbinder förskolan med besöksrummet på kliniken.Jan är en duktig pedagog, men han har också hemligheter. Han har inte avslöjat för någon vad som egentligen hände nio år tidigare, när lille William försvann från den förskola där han då arbetade. Han har inte heller berättat varför han var så angelägen om att få tjänsten på Sankta Patricia: att det har att göra med att Alice Rami, den egensinniga sångerskan som han varit besatt av sedan tonåren, är patient på sjukhuset . Är något av dagisbarnen hennes? Jan är förbjuden att fråga, men lockelsen att hitta en väg in till de slutna avdelningarna och möta Alice igen växer.En natt när barnen sover djupt hämtar Jan nyckeln till källardörren, låser upp och börjar gå nedför trappan som leder in till Sankta Patricia.Med Sankta Psyko har Johan Theorin åstadkommit en psykologisk rysare i toppklass.\"Romanen bjuder på spänning från första sidan.\" Kulturdelen\"Johan Theorins nya roman Sankta psyko är en psykologisk thriller, som håller spänningen på hög nivå ända till slutet. Skickligt flätar han ihop trådarna till en oförutsägbar väv utan att det blir tvära kast eller känns som effektsökeri.\" Göteborgs-Posten",
  "genres": [
    "Thriller",
    "Fiction",
    "Crime",
    "Horror",
    "Mystery",
    "Swedish Literature",
    "Scandinavian Literature"
  ],
  "author": "Johan Theorin",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/12737016-sankta-psyko"
}