{
  "title": "Happy People Are Annoying",
  "description": "A wonderfully candid memoir from one of the most recognizable faces of a generation, actor, writer, Youtuber, and television superstar, Josh Peck. In his warm and inspiring book, Josh reflects on the many stumbles and silver linings of his life and traces a zigzagging path to redemption. Written with such impressive detail and aching honesty, Happy People are Annoying is full of surprising life lessons for anyone seeking to accept their past and make peace with the complicated face in the mirror.Josh Peck rose to near-instant fame when he starred for four seasons as the comedic center of Nickelodeon's hit show Drake & Josh. However, while he tried to maintain his role as the funniest, happiest kid in every room, Josh struggled alone with the kind of rising anger and plummeting confidence that quietly took over his life.For the first time, Josh reflects on his late teens and early twenties. Raised by a single mother, and coming of age under a spotlight that could be both invigorating and cruel, Josh filled the cratering hole in his self-worth with copious amounts of food, television, drugs, and all of the other trappings of young stardom. Until he realized the only person standing in his way...was himself. Today, with a string of lead roles on hit television shows and movies, and one of the most enviable and dedicated fanbases on the internet, Josh Peck is more than happy, he's finally, enthusiastically content.Happy People are Annoying is the culmination of years of learning, growing, and finding bright spots in the scary parts of life. Written with the kind of humor, strength of character, and unwavering self-awareness only someone who has mastered their ego can muster, this memoir reminds us of the life-changing freedom on the other side of acceptance.",
  "genres": [
    "Audiobook",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Humor",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Josh  Peck",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/57293647-happy-people-are-annoying"
}