{
  "title": "The Whiteness of Wealth: How the Tax System Impoverishes Black Americans—And How We Can Fix It",
  "description": "A groundbreaking exposé of racism in the American taxation system from a law professor and expert on tax policyDorothy Brown became a tax lawyer to get away from race. As a young black girl growing up in the South Bronx, she'd seen how racism limited the lives of her family and neighbors. Her law school classes offered a refreshing contrast: tax law was about numbers, and the only color that mattered was green. But when Brown sat down to prepare tax returns for her parents, she found something strange: James and Dottie Brown, a plumber and a nurse, seemed to be paying an unusually high percentage of their income in taxes. When Brown became a law professor, she set out to understand why.In 'THE WHITENESS OF WEALTH', Brown draws on decades of cross-disciplinary research to show that tax law isn't as colorblind as she'd once believed. She takes us into her adopted city of Atlanta, introducing us to families across the economic spectrum whose stories demonstrate how American tax law rewards the preferences and practices of white people while pushing black people further behind. From attending college to getting married to buying a home, black Americans find themselves at a financial disadvantage compared to their white peers. The result is an ever-increasing wealth gap, and more black families shut out of the American dream.Solving the problem will require a wholesale rethinking of America's tax code. But it will also require both black and white Americans to make different choices. This urgent, actionable book points the way forward.Running Time => 6hrs.©2021 Dorothy A. Brown (P)2021 Random House Audio",
  "genres": [
    "Nonfiction",
    "Race",
    "Economics",
    "Politics",
    "History",
    "Social Justice",
    "Finance"
  ],
  "author": "Dorothy A. Brown",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/57285983-the-whiteness-of-wealth"
}