{
  "title": "Norylska Groans",
  "description": "Norylska Groans...with the weight of her crimes. In a city where winter reigns amid the fires of industry and war, soot and snow conspire to conceal centuries of death and deception.Norylska Groans...and the weight of a leaden sky threatens to crush her people. Katyusha Leonova, desperate to restore her family name, takes a job with Norylska's brutal police force. To support his family, Genndy Antonov finds bloody work with a local crime syndicate.Norylska Groans...with the weight of her dead. As bodies fall, the two discover a foul truth hidden beneath layers of deception and Come the thaw, what was buried will be revealed.\"Rich in bone crunching violence and a grimly convincing sense of place and character, I found this an addictive mix of gangland intrigue and historical fantasy. More please.\" --Anthony Ryan, author of BLOOD SONG\"A sinister fantasy-noir that lands like a punch to the throat.\"--FANFIADDICT.COM\"The worldbuilding is so good, you feel the cold, the fear, the misery, and the filth of the city like a weight. The city of Norylska is a character in its own right.\" --FANTASY-FACTION\"Norylska Groans reframes classic motifs in an industrial-era world unlike any other I've read thus far.\" --THE FANTASY HIVE\"A brilliant Russian-influenced low fantasy that I stole every minute to read. If you like a bit of the old ultraviolence & a superb story, here be your poison. Absolutely engrossing.\" --OUT OF THIS WORLDSFF REVIEWS\"The magic system. Holy crap, the magic system. It. Is. Everything. Understated, yet incredibly powerful, the magic impacts the most personal part of you, and fundamentally changes you while doing so.\" --Sarah Chorn, author of Seraphina's Lament\"By the power invested in me by my little blog... I declare this book RAD! But dangerous... so very dangerous!!! 5 out of 5 stars!\" --Paul's Picks\"Utterly brilliant.\" --Booknest.eu\"This is not for the faint of heart.\" --Lynn's Book Blog\"A fantastic example of grimdark fantasy...\" --The Critiquing Chemist",
  "genres": [
    "Fantasy",
    "Dark Fantasy",
    "Fiction",
    "Audiobook",
    "Science Fiction",
    "Adult",
    "Science Fiction Fantasy"
  ],
  "author": "Michael R. Fletcher",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/57304432-norylska-groans"
}