{
  "title": "Kill Your Heroes",
  "description": "Eddie Marr never planned to be a supervillain, but it seemed like a surefire way to become rich and famous. All he had to do was come up with a flashy costume, a signature gimmick, and commit a couple of high profile (yet nonviolent) crimes. Eddie figured he’d eventually get caught and spend a year or two in a minimum security prison. Then he’d write a tell-all book, do the talk show circuit, and parlay that into a regular TV hosting gig. But the best laid plans… As the Puzzler, Eddie was strictly a C List supervillain. He matched wits with Dark Revenger, a grim and gritty, street-level superhero. Eddie always managed to get away unscathed, but one night, things go horribly wrong and the Dark Revenger is dead. It’s one thing to steal the Mona Lisa. But killing a world famous superhero? That’s hard time with the worst of the worst. Most people would cash out, change their identity, and go on the run. But Eddie knows there’s no running if you’re responsible for the death of an A List superhero. The only chance Eddie has in staying out of prison, and staying alive, is to take the Dark Revenger’s place and not let the rest of the world know the original is dead. Eddie can do it. He’s got the physical ability and the tech savvy. He even looks good in the costume. It’s the ultra-serious, crime-fighting part he has trouble with. (Seriously, does the Dark Revenger need to be so “dark” all the time?) Then the world’s premiere superhero team, the Majestic 12, needs help with a seemingly impossible One of their own has been murdered and they need “the world’s greatest detective” (a.k.a. the Dark Revenger) to solve it. He’s not the hero we need. He’s not the hero we deserve. He’s not really a hero at all. Kill Your Heroes",
  "genres": [
    "Superheroes",
    "Fantasy",
    "Audiobook",
    "Science Fiction",
    "Action",
    "Urban Fantasy"
  ],
  "author": "Slade Grayson",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/57303291-kill-your-heroes"
}