{
  "title": "The Matarese Countdown",
  "description": "CIA case officer Cameron Pryce thought he'd crushed the deadly cabal of powerbrokers and assassins. But like a phoenix rising from the ashes, the Matarese dynasty is back. Now the countdown begins -- and Pryce is already running out of time. \"The Matarese Circle, \" Robert Ludlum's multimillion-copy spellbinder, introduced a treacherous international cabal of powerbrokers and their hired assassins. More than 20 years ago, the top CIA and KGB agents joined together to insure that, in an explosive act, the Matarese conspiracy went up in flames. But now Robert Ludlum, the unsurpassed master of suspense, returns with a stunning thriller for the 21st century. . .Secret deals are in the making, massive mysterious transactions steeped in corruption and murder. The players stand at the highest pinnacles of global finance and government. It is an unprecedented consolidation of money, power, and ruthlessness. Their ultimate aim: worldwide economic domination and all it entails. . . by whatever means necessary. The Matarese dynasty is back in all its glory and evil. And the one man with enough knowledge to stop it, CIA case officer Cameron Pryce, may not have enough time. The Matarese countdown has begun and Pryce's only chance to cut it off is to follow the trail of blood money and stone-cold killers to the heart of this deadliest conspiracy.From the Hamptons to Monte Carlo to London's Belgrave Square, Matarese assassins have already struck with brutal efficiency, eliminating all who stand in their way. But on Spain's Costa del Sol, one victim survived long enough to breathe these dying words: '\"Find Beowulf Agate' --words that reverberate all the way to CIA headquarters in Langley,Virginia. Beowulf Agate is the code name for legendary retired agent Brandon Scofield, the only man ever to penetrate the Matarese and survive. Now Cameron Pryce has to draw Scofield and his wife, Antonia, out of their Caribbean paradise hideaway and back to a place they thought they'd never have to go again -- back into the Matarese circle of death. For from the oil fields of the Persian Gulf to the boardrooms of Manhattan, from the hills of Corsica to the halls of power in Washington, the circle is closing, the noose is tightening, the panic is spreading. And Pryce has made a chilling discovery: the Matarese have broken new ground. . . deep inside the CIA. \"The Matarese Countdown\" is Robert Ludlum at his best, as he delivers a terrifying and persuasive vision of worldwide financial mastery that could only happen today.",
  "genres": [
    "Fiction",
    "Thriller",
    "Espionage",
    "Mystery",
    "Action",
    "Suspense",
    "Adventure"
  ],
  "author": "Robert Ludlum",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/573202.The_Matarese_Countdown"
}