{
  "title": "The Beauty of Living Twice",
  "description": "SHARON STONE TELLS HER OWN STORY: A JOURNEY OF HEALING, LOVE, AND PURPOSE.Sharon Stone, one of the most renowned actresses in the world, suffered a massive stroke that cost her not only her health, but her career, family, fortune, and global fame. In 'THE BEAUTY OF LIVING TWICE', Stone chronicles her efforts to rebuild her life and writes about her slow road back to wholeness and health. In a business that doesn't accept failure, in a world where too many voices are silenced, stone found the power to return, the courage to speak up, and the will to make a difference in the lives of women and children around the globe.Over the course of these intimate chapters, as candid as a personal conversation, Stone talks about her pivotal roles, her life-changing friendships, her worst disappointments, and her greatest accomplishments. She reveals how she went from a childhood of trauma and violence to a career in an industry that in many ways echoes those same assaults, under cover of money and glamour. She describes the strength and meaning she found in her children and in her humanitarian efforts. And ultimately, she shares how she fought her way back to find not only her truth, but her family's reconciliation and love.Stone made headlines not just for her beauty and her talent, but for her candor and her refusal to \"play nice\", and it's those same qualities that make this memoir so powerful. 'THE BEAUTY OF LIVING TWICE' is a book for the wounded and a book for the survivors; it's a celebration of women's strength and resilience, a reckoning, and a call to activism. It is proof that it's never too late to raise your voice and speak out.Running Time => 7hrs. and 25mins.©2021 Sharon Stone (P)2021 Random House Audio",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Autobiography",
    "Biography Memoir",
    "Feminism"
  ],
  "author": "Sharon Stone",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/57311716-the-beauty-of-living-twice"
}