{
  "title": "Rhetorical Listening: Identification, Gender, Whiteness",
  "description": "Winner, Rhetorical Society of America Book Award, 2007Winner, CCCC Outstanding Book Award, 2007Winner, Gary A. Olson Award for Rhetoric and Cultural Studies, 2006Extending the feminist rhetorical project to define and model rhetorical listeningLong-ignored within rhetoric and composition studies, listening has returned to the disciplinary radar. Rhetorical Identification, Gender, Whiteness argues that rhetorical listening facilitates conscious identifications needed for cross-cultural communication. Krista Ratcliffe establishes eavesdropping, listening metonymically, and listening pedagogically as approaches to rhetorical listening. She defines and models rhetorical listening, addressing identifications with gender and whiteness within public debates, scholarship, and pedagogy. Offering an approach grounded in classical rhetorical theory, Heideggerian theory, feminist theory, and critical race theory, Ratcliffe presents rhetorical listening as an invention tactic that engages spoken and written texts and supplements reading, writing, speaking, and silence as a rhetorical art. Theorizing intersections of gender and whiteness, Rhetorical Listening examines how whiteness functions as an \"invisible\" racial category and provides disciplinary and cultural reasons for the displacement of listening and for the use of rhetorical listening as a code of cross-cultural conduct. Ratcliffe presents rhetorical listening in terms of cultural logics, stances, and dominant interpretive tropes. She highlights the modern identification theory of Kenneth Burke and the postmodern identification and disidentification theory of Diana Fuss and presents nonidentification as a more productive site for rhetorical listening.",
  "genres": [
    "Theory",
    "Nonfiction",
    "Academic",
    "Teaching",
    "Sociology"
  ],
  "author": "Krista Ratcliffe",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/573190.Rhetorical_Listening"
}