{
  "title": "Curse of the Wolf King",
  "description": "A Beauty and the Beast Retelling\nA beastly fae king with a deadly curse.A devious bargain to break it…All Gemma Bellefleur wants is to leave her past behind and forget the day scandal broke her heart. But when she’s captured by a trickster fae king who threatens to hold her for ransom, she’ll find herself at the top of the gossip column yet again. Unless…Plagued by a curse that will soon claim his life, the human-hating King Elliot will do anything to save himself. And if Gemma can use that to her advantage, she might be able to bargain her way to freedom. All she has to do is help him break his curse.There’s just one hitch—to do so, they’ll have to trick someone into falling in love with the beastly, brooding Elliot.With a devious alliance made, their scheme begins, bringing Gemma and Elliot into very close quarters. Soon, an unexpected desire stirs where once there was only hate. But Gemma must fight it. For when the curse is broken, Elliot will return to his true form—a wolf—and be lost to her for good.Can Gemma sacrifice her budding feelings to save the king’s life? Or will love force her to give up something even greater...her heart?ACOTAR meets Bridgerton in this standalone fairytale retelling of Beauty and the Beast. If you like slow burn romance, wolf shifters, and brooding fae royals, then you’ll love this swoon-worthy story in the Entangled with Fae series.*NOTE this book is upper YA/NA featuring mature situations, moderate violence and gore, substance abuse, and some adult language. The romance is slow burn but leads to moderate steam.\nCurse of the Wolf King\n is a complete stand-alone novel set in the same world as The Fair Isle Trilogy. Journey back to Faerwyvae or begin your adventure for the first time with this enchanting tale. Each book in the \nEntangled with Fae\n series can be read on its own and in any order. Happily ever after guaranteed!(An alternate cover for this ASIN can be found here.)",
  "genres": [
    "Fantasy",
    "Romance",
    "Retellings",
    "Fae",
    "Romantasy",
    "Fantasy Romance",
    "Young Adult"
  ],
  "author": "Tessonja Odette",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/57309054-curse-of-the-wolf-king"
}