{
  "title": "Reality Creation 101: Mastering Manifestation Through Awareness",
  "description": "Christopher A. Pinckley is the creator of Global Entrepreneurs Talk Radio , he's been featured on over 100 talk shows, and a contributor to magazines such as Sedona Journal of Emergence and Upscale . “This book gives you the tools, knowledge, and awareness to completely revamp your unconscious mind to create the life you really want.”- T. Harv Eker author of the #1 NY Times best seller Secrets of the Millionaire Mind “Maybe the best way to describe this book is that this is the ‘missing manual’ for positive thinking and re-creating a more fulfilled way of life…big thumbs up.”- Joanna Daneman Amazon top 10 Reviewer “Sometimes in order to create what you want, you have to get rid of what you don’t want. I like this book because it addresses the difficulties that people can face in life. It doesn’t take the reader for granted.”- Dr. Joe Vitale author of the #1 best seller The Attractor Factor Reality Creation 101 is THE book for beginners to understand what works and what doesn't when it comes to the subtle art of manifestation. Fans of Ask and It Is Given , The Power of Now , and The Seat of the Soul will feel right at home reading through the pages of this book... In this book you'll come to Reality Creation 101 discusses the importance of doing the spiritual work, emotional clearing yourself, and having an integral understanding of the law of attraction from the author's own life story and perspective in the form of hard learned lessons. Reading Chris' story will take you on an easy to understand, easy to follow path of learning how to use spirituality to heal your life and create what you truly desire. \"Christopher Pinckley pulls no punches when sharing his hard-won personal knowledge of what works and what doesn't in the field of manifestation...\"- Cynthia Sue Larson \"If you want to grow and develop, become more-self aware of the world you are creating for yourself, then this is a book for you!\"- B. Madar Stevenson \"Christopher Pinckley has managed to provide a valuable resource for self awareness and empowerment that even an amateur like me can understand and put to good use.\"- K. StrongWhy wait another single day? The world is changing, the vibration is rising. Isn't it time for you to have the life you've dreamed of? Get this book to get started today!",
  "genres": [],
  "author": "Christopher A. Pinckley",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/5730297-reality-creation-101"
}