{
  "title": "Quantum Gods: Creation, Chaos, and the Search for Cosmic Consciousness",
  "description": "Does quantum mechanics show a connection between the human mind and the cosmos? Are our brains tuned into a \"cosmic consciousness\" that pervades the universe enabling us to make our own reality? Do quantum mechanics and chaos theory provide a place for God to act in the world without violating natural laws?Many popular books make such claims and argue that key developments in twentieth-century physics, such as the uncertainty principle and the butterfly effect, support the notion that God or a universal mind acts upon material reality.Physicist Victor J. Stenger examines these contentions in this carefully reasoned and incisive analysis of popular theories that seek to link spirituality to physics. Throughout the book Stenger alternates his discussions of popular spirituality with a survey of what the findings of twentieth-century physics actually mean. Thus he offers the reader a useful synopsis of contemporary religious ideas as well as basic but sophisticated physics presented in layperson's terms (without equations).Of particular interest in this book is Stenger's discussion of a new kind of deism, which proposes a God who creates a universe with many possible pathways determined by chance, but otherwise does not interfere with the physical world or the lives of humans. Although it is possible, says Stenger, to conceive of such a God who \"plays dice with the universe\" and leaves no trace of his role as prime mover, such a God is a far cry from traditional religious ideas of God and, in effect, may as well not exist.Like his bestselling book, God, The Failed Hypothesis, this new work presents a rigorously argued challenge to many popular notions of God and spirituality.",
  "genres": [
    "Science",
    "Physics",
    "Religion",
    "Nonfiction",
    "Philosophy",
    "Atheism",
    "Spirituality"
  ],
  "author": "Victor J. Stenger",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/5731080-quantum-gods"
}