{
  "title": "Retold",
  "description": "Unwanted. Three boys grew up in an orphanage, abandoned and despised by those who should have taken care of them. They were starved, hit, and abandoned for years.But they are men now. Gentlemen, so to speak. A little broken, a little damaged and a little destroyed by life, but they hide it behind toughness, money, amazingly folded cravats and, in some cases, illegal activities. Their main strength is each other: they are best friends, partners in crime, a found family.And then comes the one battle that every gentleman, no matter how brooding, haughty or handsome, must face alone. These are the stories of how they each fight, and lose, the battle against love.Hooked: Wendy and Lord DarlingtonWhen Wendy Hooke was a little girl, she saved a boy from starvation. The boy, Peter, taught her how to fly. Now the boy is a man, a gorgeous man, and he has forgotten all about her. She watches him take London’s ballrooms by storm, pursued by every designing mama, but Peter doesn’t even glance at her. Because it’s not ‘Peter’ now, it’s Lord Darlington.Peter hasn’t forgotten the girl who saved his life, but his secrets hold him back. The webs of his secret gang that fights crime on the streets of London are closing in on the greatest criminal of all time, the Viscount Hooke. And Wendy…well, she is his daughter.Caged: Zella and Pirate CharmontZella isn’t crazy. She knows that, but no one else does. And, she has to admit, maybe she does look crazy, locked up here in the madhouse, with hair so long and wild it can practically become a rope.And it does. One day, she lets her hair down from the tiny window, and someone rudely grabs it like a rope. Like a rope thrown to a drowning man.“I’m not crazy, you know,” she tells the rugged-looking young man who climbs up, panting as if he is running for his life.“Sweetheart,” he replies, “I don’t care. If they catch me, I’ll get hanged.”“Oh. Why?”“Because, m’ dear. I’m a pirate.”Seduced: Poppy and Lord HadesLord Hades owns a gaming hell that sprawls underneath the city of London. It is no secret: the secret club is notorious all over Europe. Peers and millionaires travel from Vienna and Paris to enjoy the Turkish baths or play cards with the great political leaders of other countries.Money and power exchange hands nightly underneath the sparkling ballrooms and gentlemen’s clubs, and no one knows. Until Hades discovers a boy sent to spy on him. But the boy is not a boy.And she will pay.Retold includes three dark and sparkling Regency stories inspired by myths, folklore and fairytales, as well as the glittering world of Jane Austen and the roguish gentlemen of Georgette Heyer.They might look like quick, fun reads, but don’t be fooled: these stories are going to break your heart in a million pieces.",
  "genres": [
    "Romance",
    "Retellings",
    "Regency",
    "Historical Fiction",
    "Fiction",
    "Fantasy"
  ],
  "author": "M.C. Frank",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/57307947-retold"
}