{
  "title": "The Deep Places: A Memoir of Illness and Discovery",
  "description": "NEW YORK TIMES EDITORS’ CHOICE • In this vulnerable, insightful memoir, the New York Times columnist tells the story of his five-year struggle with a disease that officially doesn’t exist, exploring the limits of modern medicine, the stories that we unexpectedly fall into, and the secrets that only suffering reveals.“A powerful memoir about our fragile hopes in the face of chronic illness.”—Kate Bowler, bestselling author of Everything Happens for a Reason In the summer of 2015, Ross Douthat was moving his family, with two young daughters and a pregnant wife, from Washington, D.C., to a sprawling farmhouse in a picturesque Connecticut town when he acquired a mysterious and devastating sickness. It left him sleepless, crippled, wracked with pain--a shell of himself. After months of seeing doctors and descending deeper into a physical inferno, he discovered that he had a disease which according to CDC definitions does not actually exist: the chronic form of Lyme disease, a hotly contested condition that devastates the lives of tens of thousands of people but has no official recognition--and no medically approved cure.From a rural dream house that now felt like a prison, Douthat's search for help takes him off the map of official medicine, into territory where cranks and conspiracies abound and patients are forced to take control of their own treatment and experiment on themselves. Slowly, against his instincts and assumptions, he realizes that many of the cranks and weirdos are right, that many supposed \"hypochondriacs\" are victims of an indifferent medical establishment, and that all kinds of unexpected experiences and revelations lurk beneath the surface of normal existence, in the places underneath.The Deep Places is a story about what happens when you are terribly sick and realize that even the doctors who are willing to treat you can only do so much. Along the way, Douthat describes his struggle back toward health with wit and candor, portraying sickness as the most terrible of gifts. It teaches you to appreciate the grace of ordinary life by taking that life away from you. It reveals the deep strangeness of the world, the possibility that the reasonable people might be wrong, and the necessity of figuring out things for yourself. And it proves, day by dreadful day, that you are stronger than you ever imagined, and that even in the depths there is always hope.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Health",
    "Biography",
    "Biography Memoir",
    "Medical",
    "Audiobook"
  ],
  "author": "Ross Douthat",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/57341765-the-deep-places"
}