{
  "title": "Capital and Imperialism: Theory, History, and the Present",
  "description": "A comprehensive survey of capitalism's colonialist roots and uncertain futureThose who control the world’s commanding economic heights, buttressed by the theories of mainstream economists, presume that capitalism is a self-contained and self-generating system. Nothing could be further from the truth. In this pathbreaking book—winner of the Paul A. Baran-Paul M. Sweezy Memorial Award—radical political economists Utsa Patnaik and Prabhat Patnaik argue that the accumulation of capital has always required the taking of land, raw materials, and bodies from noncapitalist modes of production. They begin with a thorough debunking of mainstream economics. Then, looking at the history of capitalism, from the beginnings of colonialism half a millennium ago to today’s neoliberal regimes, they discover that, over the long haul, capitalism, in order to exist, must metastasize itself in the practice of imperialism and the immiseration of countless people.A few hundred years ago, write the Patnaiks, colonialism began to ensure vast, virtually free, markets for new products in burgeoning cities in the West. But even after slavery was generally abolished, millions of people in the Global South still fell prey to the continuing lethal exigencies of the marketplace. Even after the Second World War, when decolonization led to the end of the so-called “Golden Age of Capitalism,” neoliberal economies stepped in to reclaim the Global South, imposing drastic “austerity” measures on working people. But, say the Patnaiks, this neoliberal economy, which lives from bubble to bubble, is doomed to a protracted crisis. In its demise, we are beginning to see—finally—the transcendence of the capitalist system.",
  "genres": [
    "Economics",
    "History",
    "Nonfiction",
    "Politics",
    "Theory",
    "India",
    "Philosophy"
  ],
  "author": "Utsa Patnaik",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/57323069-capital-and-imperialism"
}