{
  "title": "The Truth About COVID-19: Exposing The Great Reset, Lockdowns, Vaccine Passports, and the New Normal",
  "description": "Multiple New York Times best-selling author Dr. Joseph Mercola and Ronnie Cummins, founder and director of the Organic Consumers Association, team up to expose the truth--and end the madness--about COVID-19.Since early 2020, the world has experienced a series of catastrophic events--a global pandemic caused by a so-called novel coronavirus; international lockdowns and border closings causing widespread business closures, economic collapse, and massive unemployment; and an unprecedented curtailment of civil liberties and freedoms in the name of keeping people safe by locking them up in their homes.We are now living in a world that is increasingly ruled, not by our democratic systems and institutions, but by public health fiat, carried out by politicians who rule by instilling fear and panic.In The Truth About COVID-19, Dr. Mercola and Cummins reveal new and emerging evidence that:The SARS-CoV-2 virus was, indeed, lab-engineered and emerged from a negligently managed bioweapons lab in Wuhan, ChinaThe global pandemic was long anticipated by global elites who have used it to facilitate and hide the largest upward transfer of wealth in human historyPCR testing, case counts, morbidity, and vaccine safety and efficacy data have been widely manipulated and misrepresentedObesity, diabetes, and heart disease are known to worsen COVID-19 outcomes, but the junk food industry continues to push its agenda at the expense of public healthSafe, simple, and inexpensive treatment and prevention for COVID-19 have been censored and suppressed to create a clear path for vaccine acceptanceEffectiveness of the vaccines has been wildly exaggerated and major safety questions have gone unansweredThe good news in all of this is that we can take control of our health and that, together, we have the power to unite and fight back for our health, democracy, and freedom. The time is now for a global awakening. As Dr. Mercola and Cummins remind us, this is the fight of our lives.",
  "genres": [
    "Health",
    "Nonfiction",
    "Politics",
    "Science",
    "Conspiracy Theories",
    "Medical",
    "Medicine"
  ],
  "author": "Joseph Mercola",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/57328323-the-truth-about-covid-19"
}