{
  "title": "This Poison Heart",
  "description": "_______________'Kalynn Bayron does more than re-write a fairy-tale ... She breaks it apart and rebuilds it into a wholly original and captivating story where girls finally decide for themselves who lives happily ever after' - Brigid Kemmerer'Brings much-needed inclusivity and contemporary flavor to the teen fantasy genre' - Kirkus Reviews'A delicious mix of intoxicating fantasy and coming of age, steeped in Greek mythology and peppered with references to the Jordan Peele films Get Out and Us ' - Observer New Review_______________Ever since she can remember, Briseis has had power over plants. Flowers bloom in her footsteps and leaves turn to face her as though she were the sun. It's a power she and her adoptive mothers have spent her whole life trying to hide. And then Briseis inherits an old house from her birth mother and suddenly finds herself with the space and privacy to test her powers for the first time.But as Briseis starts to bring the house's rambling garden back to life, she finds she has also inherited generations of secrets. A hidden altar to a dark goddess, a lineage of witches stretching back to ancient times, and a hidden garden overgrown with the most deadly poisonous plants on earth. And Briseis's long-departed ancestors aren't going to let her rest until she accepts her place as the keeper of the terrible power that lies at the heart of the Poison Garden.Cinderella Is Dead author Kalynn Bayron brings a message of proud inclusivity to this empowering fantasy about a young woman finding the strength to challenge everything she has been told is true.Don't miss the sequel, This Wicked Fate , where to save the people she loves, Briseis must change the most dangerous of fates ahead of her ...",
  "genres": [
    "Fantasy",
    "Young Adult",
    "LGBT",
    "Queer",
    "Lesbian",
    "Fiction",
    "Mythology"
  ],
  "author": "Kalynn  Bayron",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/57323083-this-poison-heart"
}