{
  "title": "The Billionaire's Big Gamble",
  "description": "One billionaire bad boy in search of a short-term girlfriend to close a major business deal. One analytical relationship coach looking for a test subject to prove her dating theories. He makes a bet with her that he’ll never fall in love…and it just might be the wildest gamble of his life.Jayson Vice: When I find out I have the chance to buy a landmark casino in Las Vegas, I plan to close the deal for the Vice empire. But the owners are dead set on selling to a couple, so I need to find myself a serious girlfriend, and fast. Only problem is…I don’t do serious. But then I meet Haley Ambrose, a relationship expert who wants to turn me into a month-long experiment to test her “fool proof” techniques. I’m willing to bet that I’m not the fool who’ll fall in love, but this Love Doctor has some steamy strategies. Before I can even get her to Vegas, I’m starting to worry that with this woman? All bets are off.Haley Ambrose: As a relationship expert, I can spot a commitment-phobe across any crowded bar, and I tell my clients to run far and fast. But some ladies just can’t resist a challenge, so I’ve been working on a guaranteed approach to reel in the most elusive catches on the dating scene. But I need to test the hypothesis that I can make any man fall in love. Then Jayson Vice lands in my lap and confesses he needs a temporary girlfriend, and I know I’ve found a sexy subject for my research. But I never expected the experiment to backfire and now I might lose a bet…and my heart.The Miami Vices:As colorful, vibrant, and sexy as the city they call home, the billionaire Vice brothers have secrets, temptations, and never met a risk they wouldn’t take…all in the name of love. This sizzling new rom com series will have you laughing, swooning, and looking for the next book. When you’re in Miami… everyone deserves a Vice.",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction"
  ],
  "author": "Breezie Bennett",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/57332572-the-billionaire-s-big-gamble"
}