{
  "title": "Reason To Believe",
  "description": "Lane Douglas is a die-hard realist, so when her superstitious grandfather tells her he will die if the tree planted long ago in his honor in Scotland is chopped down, she doesn't buy it for a second. But when her grandfather's health starts a downward slide, Lane hops on a plane and flies across the ocean to convince the landowner to spare the old, diseased oak. To her surprise the landowner is a devilishly handsome man named Conlan MacGregor. Practical Lane came prepared for a fight to save a silly tree, but she soon finds herself fighting to save her heart from falling under the magical charms of the hunky laird of Wolfscrag castle. --------------------------------------------------------------------------------------\"Reason To Believe is a lovely, emotionally satisfying read with lovable characters and an ending that made me go 'awww'. If you're looking for a heart-warming read, I recommend this book.\" - 4.5 out of 5 star review at Cocktail Reviews\"Reason To Believe is a delightfully mesmerizing novella that grabs the reader on page one and doesn't let go until the very end.\" - 5 out of 5 star review at Fallen Angels Reviews\"Reason to Believe is a light, easy read that will leave you with a deliciously warm glow.\" - Between the Lines Reviews\"In Reason to Believe, Leslie Ann Dennis has crafted a story as magical and beautiful as the Scottish Highlands. I loved every word! Open the cover and let her lyrical voice weave its sensual spell around you.\" - Gina Ardito, author of The Bonds of Matri-money and A Little Slice of Heaven\"Reason to Believe is a magical, heart-warming tale, steeped with Scottish folklore and superstition that will leave you with a smile of satisfaction. Conlan and Lane spark the pages from their first encounter to the end. I loved it!\" - Amanda Cummings, author of Bound by Magic\"Sexy, funny, and incredibly romantic, Reason to Believe is one of those unique stories that stays with you long after you've finished it...and oh, how I didn't want it to end! Conlan and Lane's heartwarming, magical road to true love will leave readers anxiously awaiting this talented author's next novel.\"- Shelby Reed, author of The Fifth Favor and Midnight Rose",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Leslie Ann Dennis",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/5733000-reason-to-believe"
}