{
  "title": "Don't Play With Odin",
  "description": "Big, bad, and currently out of his element...Odin Shaw thought he’d spend his life on a battlefield. But fate had other plans, and now the ex-Special Forces operative has just landed a new job at his best friend’s PI office. It’s one hell of a life change, and the giant “Viking” is trying to adjust, fast, but then she walks into his life.Delicate, beautiful, and hunting a killer…Maisey Bright has been following the news. She knows that the small PI firm just helped track a killer and get the perp locked away—so Maisey figures that the towering man sitting behind the massive desk will be perfect solution for her current predicament. The cops don’t believe her story, so Maisey has no choice. She wants to hire Odin. The job in question? Well, she needs him to help her find proof—irrefutable evidence—that her next-door neighbor is a serial killer.The gorgeous ones are always a little bit crazy…Odin figures the case will be a snap. He’ll prove that Maisey’s neighbor is most definitely not a serial killer. He’ll do it in record time, and he’ll score some extra cash for the PI firm. Maybe he’ll even score some points with the lovely—but obviously way too crime-enthusiast-obsessed—Maisey. Piece of cake.It’s not a piece of cake. It’s a freaking nightmare.When Odin steps into Maisey’s world, things seem off from the very beginning. Her neighbor is suspicious as hell, and when Maisey is nearly kidnapped after leaving her job, Odin realizes there is much more to the case than meets the eye. A whole lot more. He moves into Maisey’s place to protect her—and to keep an eye on her neighbor. But the close proximity to the maddening Maisey stirs a fierce desire inside of Odin. Maisey is smart, off-beat, sexy…and when he kisses her, Odin is a goner.But first, the killer…Odin and Maisey set off to uncover the truth about her neighbor, and as they dig deeper into the disappearances that have plagued the town for the last year, Odin begins to suspect that Maisey may be dead right. He also realizes that he is falling for a woman who now seems be the target of a killer. Looks like it might be time for Odin to go to battle once more. Because there is no way—no way—that anyone will hurt Maisey.Author’s Note: Calling all true-crime enthusiasts! Maisey is your girl. She spends her nights listening to podcasts and sleuthing, but when she suspects that a killer is living next door, Maisey knows that she needs a professional partner…so Odin Shaw enters the picture. Odin has muscles for days, and he doesn’t even blink when he faces danger. He’s just the PI that she wants. Danger, romance, twists—time for their story to begin.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Contemporary",
    "Contemporary Romance",
    "Military Fiction",
    "Mystery"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/57331592-don-t-play-with-odin"
}