{
  "title": "Autopsy",
  "description": "Scarpetta is back! In this twenty-fifth in the electrifying, landmark #1 bestselling thriller series chief medical examiner Dr. Kay Scarpetta hunts an ingenious killer who has mastered cutting-edge science for the most nefarious ends.Forensic pathologist Kay Scarpetta has returned to Virginia as the chief medical examiner. Finding herself the new girl in town once again after being away for many years, she’s inherited an overbearing secretary and a legacy of neglect and possible corruption.She and her husband Benton Wesley, now a forensic psychologist with the U.S. Secret Service, have relocated to Old Town Alexandria where she’s headquartered five miles from the Pentagon in a post-pandemic world that’s been torn by civil and political unrest. Just weeks on the job, she’s called to a scene by railroad tracks where a woman’s body has been shockingly displayed, her throat cut down to the spine, and as Scarpetta begins to follow the trail, it leads unnervingly close to her own historic neighborhood.At the same time, a catastrophe occurs in a top secret private laboratory in outer space, and at least two scientists aboard are found dead. Appointed to the highly classified Doomsday Commission that specializes in sensitive national security cases, Scarpetta is summoned to the White House Situation Room and tasked with finding out what happened. But even as she works the first crime scene in space remotely, an apparent serial killer strikes again. And this time, Scarpetta could be in greater danger than ever before.In this latest novel in her groundbreaking Kay Scarpetta series, Patricia Cornwell captivates readers with the shocking twists, high-wire tension, and forensic detail that she is famous for, proving once again why she’s the world’s #1 bestselling crime writer.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Audiobook",
    "Suspense"
  ],
  "author": "Patricia Cornwell",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/57340677-autopsy"
}