{
  "title": "The Right Rehab: A Guide to Addiction and Mental Illness Recovery When Crisis Hits Your Family",
  "description": "The ultimate ‘what you need to know’ guide for navigating the confusing world of addiction treatment, insurance coverage, and recovery.Imagine you are awakened by a call at 3 a.m., informing you that your loved one is in crisis due to addiction or mental illness. Maybe he or she has been incarcerated, hospitalized, or left for dead from an overdose. Who would you turn to and what would you do next?Walter Wolf got that very call when his own family member was in crisis . There was no playbook, but Walter knew who to call — a friend in the treatment world who knew exactly what to do. And that got him thinking about the $42 billion unregulated treatment industry with its share of grifters and 1-800 toll-free call centers standing by to promise you anything to get your credit card number. Who protects the uninitiated terrified to the point of doing anything they're told to save their loved one? Wolf knew something had to change.Families hit by addiction like Wolf’s needed a “how-to” book on finding the right treatment at the right rehab. Since that book didn’t exist, he wrote it himself. From intervention to recovery, The Right Rehab is a step-by-step guide that details how to identify and access treatment options available to all individuals and families, no matter how plentiful or spare their resources. Due to Walter's relationships with the most ethical and renowned professionals in the treatment world, he is able to explain the treatment plan principled experts insist is the most evidence-based, dependable, and customizable for the individual who is fully committed to sobriety. The Right Rehab is for the millions of vulnerable, terrified and uninitiated families who need to know what to do first, next, and into the future,while protecting them from programs that don’t work. No one wants to get that call, but many can see it coming. Arm yourself ahead of time with this clear, concise, and easy-to-follow guide to getting the right help for your loved one.",
  "genres": [],
  "author": "Walter  Wolf",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/57344529-the-right-rehab"
}