{
  "title": "Tenement Kid",
  "description": "Fizzing with an infectious passion for the magic of rock music, Gillespie’s vivid and evocative memoir traces the Primal Scream frontman’s path from Glasgow tenement to the release of Screamadelica, the psychedelic masterpiece that ushered in the 90s.Tenement Kid is Bobby Gillespie's story up to the recording and release of the album that has been credited with 'starting the 90's', Screamadelica.Born into a working class Glaswegian family in the summer of 1961, Bobby's memoirs begin in the district of Springburn, soon to be evacuated in Edward Heath's brutal slum clearances.Leaving school at 16 and going to work as a printers' apprentice, Bobby's rock n roll epiphany arrives like a bolt of lightning shining from Phil Lynott's mirrored pickguard at his first gig at the Apollo in Glasgow. Filled with 'the holy spirit of rock n roll' his destiny is sealed with the arrival of the Sex Pistols and punk rock which to Bobby, represents an iconoclastic vision of class rebellion and would ultimately lead to him becoming an artist initially in the Jesus and Mary Chain then in Primal Scream.Structured in four parts, Tenement Kid builds like a breakbeat crescendo to the final quarter of the book, the Summer of Love, Boys Own parties, and the fateful meeting with Andrew Weatherall in an East Sussex field. As the '80s bleed into the '90s and a new kind of electronic soul music starts to pulse through the nation's consciousness, Primal Scream become the most innovative British band of the new decade, representing a new psychedelic vanguard taking shape at Creation Records.Ending with the release of Screamadelica and the tour that followed in the autumn, Tenement Kid is a book filled with the joy and wonder of a rock n roll apostle who would radically reshape the future sounds of fin de siecle British pop. Published thirty years after the release of their masterpiece, Bobby Gillespie's memoir cuts a righteous path through a decade lost to Thatcherism and saved by acid house.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Scotland",
    "Pop Culture"
  ],
  "author": "Bobby Gillespie",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/57368842-tenement-kid"
}