{
  "title": "Invisible Child: Poverty, Survival & Hope in an American City",
  "description": "The riveting, unforgettable story of a girl whose indomitable spirit is tested by homelessness, poverty, and racism in an unequal America—from Pulitzer Prize-winning journalist Andrea Elliott of The New York TimesInvisible Child follows eight dramatic years in the life of Dasani Coates, a child with an imagination as soaring as the skyscrapers near her Brooklyn homeless shelter. Born at the turn of a new century, Dasani is named for the bottled water that comes to symbolize Brooklyn’s gentrification and the shared aspirations of a divided city. As Dasani grows up, moving with her tight-knit family from shelter to shelter, this story goes back to trace the passage of Dasani’s ancestors from slavery to the Great Migration north. By the time Dasani comes of age, New York City’s homeless crisis is exploding as the chasm deepens between rich and poor. In the shadows of this new Gilded Age, Dasani must lead her seven siblings through a thicket of problems: hunger, parental drug addiction, violence, housing instability, segregated schools, and the constant monitoring of the child-protection system. When, at age thirteen, Dasani enrolls at a boarding school in Pennsylvania, her loyalties are tested like never before. As she learns to “code switch” between the culture she left behind and the norms of her new town, Dasani starts to feel like a stranger in both places. Ultimately, she faces an impossible question: What if leaving poverty means abandoning the family you love? By turns heartbreaking and revelatory, provocative and inspiring, Invisible Child tells an astonishing story about the power of resilience, the importance of family, and the cost of inequality. Based on nearly a decade of reporting, this book vividly illuminates some of the most critical issues in contemporary America through the life of one remarkable girl.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Social Justice",
    "History",
    "Race",
    "Poverty"
  ],
  "author": "Andrea Elliott",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/57359691-invisible-child"
}