{
  "title": "Nuclear Folly: A History of the Cuban Missile Crisis",
  "description": "\"The definitive history.…With his masterly book, Mr. Plokhy has sounded a warning bell.\" — The EconomistA harrowing account of the Cuban missile crisis and how the US and USSR came to the brink of nuclear apocalypse.Nearly thirty years after the end of the Cold War, today’s world leaders are abandoning disarmament treaties, building up their nuclear arsenals, and exchanging threats of nuclear strikes. To survive this new atomic age, we must relearn the lessons of the most dangerous moment of the Cold the Cuban missile crisis.Serhii Plokhy’s Nuclear Folly offers an international perspective on the crisis, tracing the tortuous decision-making that produced and then resolved it, which involved John Kennedy and his advisers, Nikita Khrushchev and Fidel Castro, and their commanders on the ground. In breathtaking detail, Plokhy vividly recounts the young JFK being played by the canny Khrushchev; the hotheaded Castro willing to defy the USSR and threatening to align himself with China; the Soviet troops on the ground clearing jungle foliage in the tropical heat, and desperately trying to conceal nuclear installations on Cuba, which were nonetheless easily spotted by U-2 spy planes; and the hair-raising near misses at sea that nearly caused a Soviet nuclear-armed submarine to fire its weapons.More often than not, the Americans and Soviets misread each other, operated under false information, and came perilously close to nuclear catastrophe. Despite these errors, nuclear war was ultimately avoided for one central fear, and the realization that any escalation on either the Soviets’ or the Americans’ part would lead to mutual destruction.Drawing on a range of Soviet archival sources, including previously classified KGB documents, as well as White House tapes, Plokhy masterfully illustrates the drama and anxiety of those tense days, and provides a way for us to grapple with the problems posed in our present day.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Russia",
    "American History",
    "Military History",
    "The United States Of America"
  ],
  "author": "Serhii Plokhy",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/57367826-nuclear-folly"
}