{
  "title": "Please Scream Inside Your Heart: Breaking News and Nervous Breakdowns in the Year that Wouldn't End",
  "description": "Please lower your shoulder restraint and keep your hands and feet in. You’re about to board a roller coaster ride through a year that was at once laughable and lethal.If you’ve got an anti-anxiety prescription, now would probably be a good time to call in a refill.Please Scream Inside Your Heart is a time capsule; a real-time ride through the maddening hell that was the 2020 news cycle—when historic turmoil and media mania stretched American sanity, democracy, and toilet paper. Who better to examine this unhinged period in all of its twists and turns than news addict Dave Pell, aka the internet’s Managing Editor? Fueled by the wisdom and advice of his two Holocaust-surviving parents, for whom parts of this story were all too familiar, Pell puts the key stories of 2020 into context with pith and punch; highlighting turning points that widened America’s divisions, deepened our obsession with a media-driven civil war, and nearly knocked the country off its tracks.  Pell also examines the role of technology in society—and how we somehow built the exact opposite of what we thought we were building. Why did the lies spread faster than the truth? How did our tech addiction contribute to the nightmare? Why do you feel a vibration in your pocket right now? In 2020, the news was everywhere, and everything was political—even the air we breathed. So brace yourself as you’re hurtled through the twists and turns of the corkscrewiest year in American history; one that included two impeachment trials, a global pandemic, Black Lives Matter, the biggest election of a lifetime, a slide towards autocracy, and a warning from the makers of Lysol not to drink their products.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Humor",
    "Audiobook",
    "Memoir",
    "Historical"
  ],
  "author": "Dave Pell",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/57355838-please-scream-inside-your-heart"
}