{
  "title": "Beautiful Country: A Memoir",
  "description": "The moving story of an undocumented child living in poverty in the richest country in the world — an incandescent debut from an astonishing new talentIn Chinese, the word for America, Mei Guo, translates directly to “beautiful country.” Yet when seven-year-old Qian arrives in New York City in 1994 full of curiosity, she is overwhelmed by crushing fear and scarcity. In China, Qian’s parents were professors; in America, her family is \"illegal\" and it will require all the determination and small joys they can muster to survive.In Chinatown, Qian’s parents labor in sweatshops. Instead of laughing at her jokes, they fight constantly, taking out the stress of their new life on one another. Shunned by her classmates and teachers for her limited English, Qian takes refuge in the library and masters the language through books, coming to think of The Berenstain Bears as her first American friends. And where there is delight to be found, Qian relishes it: her first bite of gloriously greasy pizza, weekly \"shopping days,\" when Qian finds small treasures in the trash lining Brooklyn’s streets, and a magical Christmas visit to Rockefeller Center — confirmation that the New York City she saw in movies does exist after all.But then Qian’s headstrong Ma Ma collapses, revealing an illness that she has kept secret for months for fear of the cost and scrutiny of a doctor’s visit. As Ba Ba retreats further inward, Qian has little to hold onto beyond his constant refrain: Whatever happens, say that you were born here, that you’ve always lived here.Inhabiting her childhood perspective with exquisite lyric clarity and unforgettable charm and strength, Qian Julie Wang has penned an essential American story about a family fracturing under the weight of invisibility, and a girl coming of age in the shadows, who never stops seeking the light.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Book Club",
    "Biography",
    "China",
    "Biography Memoir"
  ],
  "author": "Qian Julie Wang",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/57359367-beautiful-country"
}