{
  "title": "Unbound: My Story of Liberation and the Birth of the Me Too Movement",
  "description": "From the founder and activist behind the largest movement of the twentieth and twenty-first centuries, Tarana Burke shares her never before revealed life story of how she first came to say me too and launch one of the largest cultural events in American history.After a long, difficult day working with young Black girls who had suffered the unimaginable, Tarana tossed in her bed, unable to sleep as a fit of memories intruded into her thoughts. How could she help these girls if she couldn't even be honest with herself and face her own demons? A fitful night led to pages and pages of scribbled notes with two clear words at the top: Me too.Tarana Burke is the founder and activist behind the largest social movement of the twentieth and twenty-first centuries, the me too movement, but first she had to find the strength to say me too herself. Unbound is the story of how she came to those two words, after a childhood growing up in the Bronx with a loving mother that took a terrible turn when she was sexual assaulted. She became withdrawn and her self split: there was the Tarana that was a good student, model kid, and eager to please young girl, and then there was the Tarana that she hid from everyone else, the one she believed to be bad. The one that would take all the love in her life away if she revealed.Tarana's debut memoir explores how to piece back together our fractured selves. How to not just bring the me too movement back to empathy, but how to empathize with our past selves, with out bad selves, and how to begin to love ourselves unabashedly. Healing starts with empowerment, and to Tarana empowerment starts with empathy. This is her story of finding that for herself, and then spreading it to an entire world.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Feminism",
    "Audiobook",
    "Social Justice",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Tarana Burke",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/57351643-unbound"
}