{
  "title": "Dark Things I Adore",
  "description": "\"[C]areful and sinewy plotting, which reveals in chilling detail who gets to make art, and who gets subsumed in the process.\"—New York Times Book ReviewA debut thriller for fans of Lucy Foley and Liz Moore, Dark Things I Adore is a stunning Gone Girl-esque tale of atonement that proves that in the grasp of manipulative men, women may momentarily fall. But in the hands of fierce women, men will be brought to their knees.Three campfire secrets. Two witnesses. One dead in the trees. And the woman, thirty years later, bent on making the guilty finally pay.1988. A group of outcasts gather at a small, prestigious arts camp nestled in the Maine woods. They're the bright, hopeful, teeming with potential. But secrets and dark ambitions rise like smoke from a campfire, and the truths they tell will come back to haunt them in ways more deadly than they dreamed.2018. Esteemed art professor Max Durant arrives at his protégé's remote home to view her graduate thesis collection. He knows Audra is beautiful and brilliant. He knows being invited into her private world is a rare gift. But he doesn't know that Audra has engineered every aspect of their weekend together. Every detail, every conversation. Audra has woven the perfect web.Only Audra knows what happened that summer in 1988. Max's secret, and the dark things that followed. And even though it won't be easy, Audra knows someone must pay.A searing psychological thriller of trauma, dark academia, complicity, and revenge, Dark Things I Adore unravels the realities behind campfire legends—the horrors that happen in the dark, the girls who become cautionary tales, and the guilty who go unpunished. Until now.\"A smart, nuanced exploration of victims and villains, inspiration and theft, and the intersection of these things, in every artist. Pay attention to Katie Lattari. She's the real deal.\"—Sarah Langan, author of Good Neighbors",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Dark Academia",
    "Suspense",
    "Adult"
  ],
  "author": "Katie Lattari",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/57374632-dark-things-i-adore"
}