{
  "title": "Hard to Love",
  "description": "New York Times bestselling author, K. Bromberg, is back with a heartfelt, enemies to lovers romance and a hero who redeems himself to steal your heart . . . He was the one-night stand that didn’t exactly go as planned. Now he’s standing before me as if he’s never seen me naked, telling my manager he’ll take the job. Reluctantly.Finn Sanderson.Sports agent extraordinaire. Handsome as hell. The man who just signed on to control my every move.Sure, I’m to blame for my recent bad press, but when your whole life has been so regimented, isn’t it normal to want to live it up a little? But when the partying stops and the grief I’m running from has nowhere else to hide, reality sets in. Turns out, Finn’s the only person I have left to help pick up the pieces. The only person to call. Staying with him is a temporary thing. But when our fighting turns into laughter and our friendship turns into something more, will I fight for a man who swears he’s hard to love? Or is it wiser to walk away? To follow the plan?* * *Offering to help with a client is a way to repay a long overdue IOU to my mentor. Little did I know she was the woman who left my hotel room at four in the morning. Stevie Lancaster.Top-seeded US tennis player. Good girl gone bad. The woman currently about to throw her career away. And now my problem. The compensation to “babysit” her is great, but she isn’t worth my trouble. But when her world falls apart and she has no one else to turn to, I try to be a good guy by gathering her up and hiding her from the media’s eye.Now she’s in my house, in my space, and even though I’m enjoying the side benefits of this unexpected arrangement, surely she’s better to leave when the time comes and follow her destiny. Because I’m not the man she needs. Not the man she could love. Right?Are you ready to fall for the Kincade sisters and the men who love them in K. Bromberg's sexy, contemporary, sports romance series? These books can all be read as standalones, but you’ll enjoy reading them as a series!Hard to Handle (Hunter & Dekker's story - hockey romance)Hard to Hold (Rush & Lennox''s story - soccer romance)Hard to Score (Drew & Brexton's story - football romance)Hard to Lose (Gunner & Chase's story - baseball romance)Hard to Love (Finn & Stevie's story)",
  "genres": [
    "Sports Romance",
    "Sports",
    "Romance",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Contemporary",
    "Forced Proximity"
  ],
  "author": "K. Bromberg",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/57390991-hard-to-love"
}