{
  "title": "How It's Supposed to Be",
  "description": "Auxor Bane has made a pact. He and his brothers made a promise to each other that they would let their bear shifter lineage die off with them, for the betterment of mankind. They aren’t fluffy, and they aren’t cute. As one of the three remaining bear shifters alive, Aux struggles daily with the predator inside of him. His life is simple and manageable so long as he never breaks the rules enforced by his brothers. Rule number one: Never touch a human’s skin. Rule number two: never fall for one of the fragile creatures. Rule number three: never, ever let a human know what he is. But when he stumbles upon a car wreck in the remote Montana mountains, during the biggest snow storm of the year, he can’t just leave the stranded human to die. And in a series of unfortunate events that follows, he also can’t let her out of his sight if he wants to survive her.Gwen Smithers had a plan. A great plan. A plan that will get her out of the stagnancy of her life and onto an adventure. This week was going to change her life, but in a split second on an icy road, all of her plans were derailed. Her rescuer is growly, and ill-mannered, and won’t show his face. And his eyes are such a strange color. But as she struggles to trust the mysterious mountain man, he’s revealing a strange and dangerous culture she never would’ve imagined existing. For the life of her, she can’t conjure up fear of Aux. Her human instincts must be broken, because it’s becoming clearer and clearer…Aux isn’t the man she thought he was. In fact, he isn’t a man at all. And the more she tries to understand him, the more she wants to break the oath he has made.Don’t miss this first novella in T. S. Joyce’s exciting brand-new Oath of Bane series.",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Supernatural",
    "Novella"
  ],
  "author": "T.S. Joyce",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/57384767-how-it-s-supposed-to-be"
}