{
  "title": "Love Potions",
  "description": "An incompetent witch, a cursed elf, and the wizard who wants to kill them both.Witch-in-training, Marion, is about to flunk her Potions class because of a serious case of 'love block'. If her love potions keep exploding like stink bombs, she won't graduate to the magical defense classes she really wants to take. A problem because her ex-boyfriend is out of prison and wants to pick up where they left off...with his hands around her throat. When Marion learns she'll never make a love potion if she doesn't fall in love, she takes a risk on Aidan, a handsome, charming elf...cursed to break her heart. Love Potions is a 30,000 word count novella, about 100 print pages. Includes exclusive excerpts of Ashley L. Willis' The Calling and Michelle McCleod's forthcoming Urban Fantasy, Crime Bites.ExcerptWrapping her arms around herself, Marion stood by the glass sliding doors in the breakfast nook and stared out at the forest that made up Aidan's backyard. It looked so peaceful, so idyllic. There were even deer grazing the sparse green grass, although not for long. As if sensing her tension, they bolted, white tails flickering between the trees.\"Good morning.\" Aidan's husky baritone sounded behind her.She jumped and turned to face him. \"You scared me.\"\"I've been here watching you. You were daydreaming.\"She frowned at him. \"Are you always so quiet?\"\"Do you always hold grudges?\"Marion gasped and Aidan grimaced.Running a hand through his hair, he said, \"Sorry. I shouldn't have said that.\" He brushed past her, not meeting her eyes, and poured himself a glass of orange juice, which he swallowed in one gulp.Slamming the glass down on the counter, he said, \"Look Marion, I'm sorry.\"\"For what? Using me or getting caught?\"\"Both, but worse, I'm sorry I like you so much that I even care.\" He held up a hand when she started to tell him what he could do with his apology. \"Just listen. I thought about you all night. About us.\"She snorted. \"Us? There's no us, Aidan. Without the curse, I'm nothing to you.\"He ignored her and pressed on. \"I wouldn't have chosen you Marion if I hadn't felt some pull, some attraction to you. Truth be told, I'm not really fulfilling the curse as the Lady intended and I don't care if I ever do right now. Something in you drew us together and it had nothing to do withthe curse. I wish I could go back and meet you all over again, but I can't. All I can do is tell you the truth and hope you'll forgive me.\" He moved to stand in front of her, capturing her hand in his as he met her gaze.She stared into his eyes for a long moment. They were pleading and over-bright. A dimple danced in his cheek as he clenched his jaw, waiting for her to respond.\"How do I know if I can trust you?\" she whispered.\"By trusting me.\"\"That's asking a lot.\"\"I know. I want to give you more back though.\"\"Like what?\"\"Your life. I want to get rid of Eric for you. I want to love you until you can't recall a time when you weren't adored and cherished, until Eric will seem like a bad dream, one you can barely remember.\"When she didn't say anything for a long moment, he sighed. \"I guess it's too late.\" He moved to release her hand, but she tightened her grip, holding him in place.\"I want to trust you Aidan, I do, but...",
  "genres": [
    "Romance",
    "Paranormal",
    "Magic",
    "Adult",
    "Short Stories",
    "Paranormal Romance"
  ],
  "author": "Michelle McCleod",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/12740934-love-potions"
}