{
  "title": "The examination and tryal of old Father Christmas together with his clearing by the jury, at the assizes held at the town of Difference in the county ... to legal proceeding / by Josiah King.",
  "description": "EARLY HISTORY OF RELIGION. Imagine holding history in your hands. Now you can. Digitally preserved and previously accessible only through libraries as Early English Books Online, this rare material is now available in single print editions. Thousands of books written between 1475 and 1700 can be delivered to your doorstep in individual volumes of high quality historical reproductions. From the beginning of recorded history we have looked to the heavens for inspiration and guidance. In these early religious documents, sermons, and pamphlets, we see the spiritual impact on the lives of both royalty and the commoner. We also get insights into a clergy that was growing ever more powerful as a political force. This is one of the world's largest collections of religious works of this type, revealing much about our interpretation of the modern church and spirituality.++++The below data was compiled from various identification fields in the bibliographic record of this title. This data is provided as an additional tool in helping to insure edition ++++The examination and tryal of old Father Christmas together with his clearing by the jury, at the assizes held at the town of Difference in the county of Discontent : written according to legal proceeding / by Josiah King.King, Josiah.Caption The tryal of Christmas.\"The afternoon tryal of old Father Christmas\" has special t.p.\"Licensed, Aug. 10, 1677. Ro. L'Estrange\"63 p.London : Printed for H. Brome, T. Basset, and J. Wright, 1678.Wing / K511EnglishReproduction of the original in the Henry E. Huntington Library and Art Gallery++++This book represents an authentic reproduction of the text as printed by the original publisher. While we have attempted to accurately maintain the integrity of the original work, there are sometimes problems with the original work or the micro-film from which the books were digitized. This can result in errors in reproduction. Possible imperfections include missing and blurred pages, poor pictures, markings and other reproduction issues beyond our control. Because this work is culturally important, we have made it available as part of our commitment to protecting, preserving and promoting the world's literature.",
  "genres": [],
  "author": "Josiah King",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/12740869-the-examination-and-tryal-of-old-father-christmas-together-with-his-clea"
}