{
  "title": "Seventy Times Seven",
  "description": "\"Give me chastity and self-restraint, but not just right now.\"—The Confessions of Saint Augustine \"Jesus instructed us to forgive those who have wronged us seventy times seven times,\" Brother Vito Fortunato teaches the boys in his high school religion class, but it's Vito himself who has the most trouble with trying to forgive the Church, the gay community, and most of all, himself. Just a few months from his final vows as a Brother in the Catholic Church, Vito finds himself at a crossroads, torn between his spirituality and his sexuality as a fully out and proud gay man. Will a summer of volunteer work at an AIDS center in San Francisco—and a love affair with Gabriel, a recently divorced landscaper—help Vito decide his calling—and his future? Seventy Times Seven is a poignant, sexy, funny, and romantic novel set in the early 1990s about a young man's struggle to integrate his religious beliefs with his sexual desires. The gap between sexuality and spirituality is punctuated throughout the novel with quotes from the Scripture, and from song lyrics from Prince and Madonna, artists who merged the two worlds in provocative and groundbreaking fashion. Vito struggles too, with the idealism that drives his desire to change the archaic ways of the Catholic Church and its views on AIDS and homosexuality. An excerpt from Seventy Times \"Come on, let's go in,\" Tim implored outside the Christopher Street video store. \"It'll be a riot. I know you're a Brother, but you don't have to do anything, just watch. But, whatever you do, don't make me laugh. They're hardcore in there.\" Tim has always been able to persuade me to take risks. He took me into my first gay bar, Uncle Charlie's in the Village, when I was seventeen years old (the legal drinking age in New York was eighteen at the time, so we didn't look out of place). Two years later, we snorted coke off of his Barney's credit card in the bathroom of the Roxy. He later was a part of my first threesome experience with some guy we met at the Spike. There was one risk, however, that Tim was unsuccessful in persuading me to take, and that was leaving religious life. Taking me into the video store that night required little effort on his part. Sal Sapienza's first novel, Seventy Times Seven, is an entertaining and enlightening look at the struggle many gay men experience as their try to reconcile their religion with their sexual natures.",
  "genres": [
    "LGBT",
    "Romance",
    "M M Romance",
    "Gay Fiction"
  ],
  "author": "Salvatore Sapienza",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/5739.Seventy_Times_Seven"
}