{
  "title": "Earn Your Extra Credit",
  "description": "\"She went home with someone else that night?\"Hearing the disbelief from my best friend's mouth makes the events of my failed date sting that much more.I would like to make it known, I have a lot more swagger than what it seems. I don't normally ask a girl out, have her fail to recognize it's a date, and then give me a high five--as if I'm her wingman--and take off with someone else.No. Normally I'm the one taking the girl home but with Stella, it's been one failed attempt after another and frankly, I'm done trying.But thanks to my best friend getting married in Hawaii right before the school year starts, I'm stuck on a tropical island, watching Stella parade around in what she claims is a bathing suit.Unfortunately, that's not the worst of it, just the tip of the iceberg. Because what I think is going to be a relaxing vacation, avoiding the one girl I can't seem to make it work with, has turned into a spectacle of being recruited as Stella's doting fake fiancé so she can save face with an old \"friend\" from high school.Now I'm navigating through purgatory while trying not to get turned on by the way she holds my hand or kisses my jaw. It's all fake, that's what I keep telling myself, even though it feels entirely too real.Note from author: This book is a smattering of tropes: Enemies to lovers, turned friends to lovers, and also coworkers to lovers. Not to mention, a fake fiancé romance that takes place in Maui and Chicago. Lots of heat--a balcony scene that will make you blush--absurdly funny pranks, best supporting cast, a surprise \"mom\" you'll never see coming, and a grumbly guss of a hero who can't stop pining after his girl. Enjoy!",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Contemporary",
    "Sports",
    "Sports Romance"
  ],
  "author": "Meghan Quinn",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/57390231-earn-your-extra-credit"
}