{
  "title": "Tomorrow Died Yesterday",
  "description": "In Port Harcourt at the height of the kidnap of oil workers in the Niger Delta, a kidnapping goes awry, and four lives are reconnected. Douye aka Doughboy the career militant responsible for the crime, Amaibi the gentle university professor / eco-warrior accused. Kaniye the lawyer turned restaurateur who tries to get him off and Tubo an amoral oil company executive. Against a backdrop of corrupt practises, failed systems and injustice, these four friends tell the story of oil in a region and its effects on local communities and the Nigerian larger society.Chimeka Garricks in his extraordinary debut novel has written a forthright and poignant story about the realities of contemporary Nigeria. The evil long-term effects of military rule resulting in the fragmentation and break down of moral values. His story paints a realistic picture of the very high price corruption exacts on a society and how no one is immune from its consequences.Chimeka has written a remarkable book; honest, insightful and tragic – Jude Dibia author of Blackbird.The book is absolute genius. Well researched, crisp lines, excellent and vivid dialogue, well developed characters. - Jekwu Ozoemene, author of The Anger of Unfulfillment.Tomorrow Died Yesterday is a chronicle of a region in turmoil, of a generation caught between the expectations of their parents and the depreciations of the Nigerian situation, each of these four men navigate their issues in different ways, and in their own voices. Mr Garricks is a new literary voice; unheralded, fresh, honest, unshorn of superficial flourish. Well worth the read. – Eghosa Imasuen, author of Fine Boys.Tomorrow Died Yesterday is a story of action and consequence, lies and love, greed and lust, the power of the truth and most poignantly, redemption. In a John Grisham-esque storytelling style, Chimeka Garricks carries the reader from the present to the past and back again in a seamless blend of storytelling, from the swamps of the Niger Delta to its courtrooms with some action, humour, suspense and just the right amount of romance thrown in. Tomorrow Died Yesterday is a novel by a Nigerian about Nigeria for the entire world. All in all, it is an impressive debut for a writer. - Seun Odukoya, reviewer www.naijastories.com",
  "genres": [
    "Fiction",
    "Nigeria",
    "African Literature",
    "Africa",
    "Thriller",
    "Novels"
  ],
  "author": "Chimeka Garricks",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/57374154-tomorrow-died-yesterday"
}