{
  "title": "An Immoral Erotic Parable of American Eve & African Adam: Holy Jest in New Genesis: Lucifer asked God to crack a devilish interracial sex joke",
  "description": "“An extremely long book of pure erotica. Overall, a very entertaining book. The FMC was so into BBC, she could never get enough. The black bull was so enchanted by Katheryn, he would follow her anywhere. The author did an amazing job of constantly reminding us how the two characters looked and reacted. He is without a doubt one of the best authors describing his characters.” — Kindle Customer ★★★★★“Chewins’ publishing debut. Naughty! Fluid writing style. His approach is funny, an intricate part of the (white-wife black-man interracial sex) story. Pornographic yes, but ENTERTAINING!”— Grady Harp, HALL OF FAME Top 100 REVIEWER ★★★★“Amazing, from start to finish. Hotter than pornography. By far the hottest interracial straight erotica. The narration is scorching hot; the dialogue is nothing less. The porn shoot format is fantastic, like a story within a story. DELICIOUS. FUN. ENTERTAINING!”— Constantine ★★★★★“A well-written story. Explores a variety of erotic scenarios.\" — Mungous474 ★★★★★What if the First Man Adam is black?When Almighty God cracks a joke, the result is explosive interracial sex exploits so torrid that they make Fifty Shades seem tame. Could it be the singular life decision of Katheryn Kellington—a well-bred, well-schooled Southern Belle who chooses to delve into African history during her college years, focusing particularly on the importation of negro slaves and the role of slavery in the American Civil War — that leads her down a path of corruption and taboo interracial lust? And subsequently, to her encounter with Massai Mobuku, thus transforming her into a ‘snow bunny’?Katheryn Kellington embodies the American Eve and Massai Mobuku personifies the African Adam. How Katheryn stumbles upon self-love, the ‘Princess & the Pea’, and ‘Razor’s Edge’ techniques! Is her journey of orgasmic discovery a darker narrative, facilitated by Lucifer himself? Lucifer intends their interracial sex to be natural, inevitable, and sanctioned by the Divine. And torrid, enthralling, transparent; nothing less will entice. In her extended exploits, Katheryn instructs white women on how to enjoy the black cock of a practiced and polished ‘woodsman’. Emulating every sex act in porn, akin to the Kama Sutra, she deliberates over each one — missionary, doggy, Reverse Cowgirl & Outercourse positions, and Golden Shower, with one Except anal.And, what has an ad in a classy women's magazine got to do with this?To see the ad, click on the Look Inside colorful button on top of the book cover.",
  "genres": [],
  "author": "D.H. Chewins",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/57369110-an-immoral-erotic-parable-of-american-eve-african-adam"
}