{
  "title": "Sunk Without a Sound : The Tragic Colorado River Honeymoon of Glen and Bessie Hyde",
  "description": "The mystery of Glen and Bessie Hyde is whitewater navigation's equivalent to Mallory and Irvine's disappearance on Everest in 1924. Just four years later in October 1928, the Hydes, a bright, attractive, and talented young couple built their own wooden sweep scow and launched on a honeymoon voyage down the Green and Colorado Rivers through Grand Canyon. Bessie was the first woman to ever attempt the river. Halfway through Grand Canyon they talked to the press, then disappeared into the gloomy November depths of the gorge. They were never seen again. Despite an extensive series of searches, no trace was found except, eerily, their upright, intact, fully loaded, and snagged in calm water. Glen and Bessie had vanished without a trace. For the next seven decades their tale evolved from simple facts to convoluted folklore and myth. A woman appeared on a river trip in 1971 claiming to be Bessie, having murdered Glen and hiked out. In 1976 a skeleton was found at Grand Canyon with a bullet through the skull. Size, age and circumstance suggested it was the body of Glen Hyde. In 1985 a woman surfaced with a tale of her father, Glenn Hyde, who had disappeared in 1928, but reappeared seven years later with tales of having rafted rivers. He said he had attempted the Colorado through Grand Canyon but \"it didn't work out.\" And he carried a scar on his back from a knife wound, delivered by a woman named Bessie. And in 1992, when Georgie Clark, the most famous of all river runners, died, her past was discovered to be pure fiction. She had been born Bessie, and her lingerie drawer held a marriage record for Glen and Bessie Hyde. And a pistol. Author and boatman Brad Dimock tackled this story with an obsession, tracking each clue, lead, and rumor, even going to the extreme of building a replica of the Hydes' archaic sweep scow for a harrowing journey through Grand Canyon with his own bride. The resulting book, a masterful interweaving of past and present, of pathos and humor, is a classic in outdoor adventure, mystery writing, literary nonfiction, and investigative journalism. With 304 profusely illustrated pages, this beautiful book is not only a joy to look at, but a true page turner.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Adventure",
    "True Crime",
    "Mystery",
    "American History"
  ],
  "author": "Brad Dimock",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/573694.Sunk_Without_a_Sound_"
}