{
  "title": "The Devil to Pay",
  "description": "A Mystical Relic. A disgraced Investigator. A grisly murder.Being an Investigator for the Royal Newfoundland Constabulary has taken its toll on Vivian Ellis’ life, both personal and professional. Her career and marriage both falling apart, she’s ready to call it quits.But when Louisiana oil tycoon Gustav Polk shows up dead and she’s the only officer qualified to work the case, she’s thrust back into the limelight of a media whirlwind – charges against the church, mysterious religious relics, and a grisly homicide.Under the stress of a job she doesn’t want to do anymore, and balancing her boss, her ex, and the intriguing detective from New Orleans PD, can she solve the mystery and uncover a secret hundreds of years old?“Berlin cleverly mingles Newfoundland history and mythology into a fast paced, modern day crime novel. Fans of mystery thrillers like Dan Brown’s Da Vinci Code won’t be disappointed.” Andrew Peacock, NLBA Award-winning author of Viral, Bifocal, and Creatures from the Rock.“Kit Berlin’s novel The Devil to Pay is a riveting, gritty crime novel. The story will hook you like a fish and then slowly reel you in. I enjoyed the author’s style of writing, especially the little bread crumbs that keep you going through the narration and then suddenly comes back to surprise you. Expertly done.” Paul Carberry, International Best-selling author of Zombies on the Rock, Carcharodon, and Terror Nova.“Kit Berlin’s The Devil to Pay is a fast paced, compelling book that will draw you in and keep you reading until you run out of pages to turn. A well-crafted mystery that spans the shores of Newfoundland and the old money politics of New Orleans, Berlin manages to keep the reader captivated and on the edge of their seat.” Jon Dobbin, Best-selling author of The Starving, The Broken Spire, and Slipstreamers.",
  "genres": [],
  "author": "Kit Berlin",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/57369661-the-devil-to-pay"
}