{
  "title": "P*TAG",
  "description": "In this second PoetryTagTime anthology, P*TAG, famous poets speak to the complicated lives of today's teens, with quirky, reflective, and soulful poems in many forms and with many themes: rhyming poems, free verse poetry, narrative poems, lyrical poems, funny poems, inspirational poems, nature poems, love poems, poems about war and worry, gothic poems (tattoos, piercings), personification poems, and poems about life: watching people and being watched, broken lives, luck, burping up kittens, and more. The list of contributors is a \"who's who\" of the best poets for young people, including YA poets and verse novelists Naomi Shihab Nye, Margarita Engle, Allan Wolf, Betsy Franco, Paul Janeczko, and Helen Frost, Newbery Honor winner Joyce Sidman, current Children's Poet Laureate J. Patrick Lewis, and poetry legend Lee Bennett Hopkins.A list of all included poets: Arnold Adoff, Jaime Adoff, Kathi Appelt, Jeannine Atkins, Jen Bryant, Margarita Engle, Betsy Franco, Helen Frost, Lorie Ann Grover, David L. Harrison, Stephanie Hemphill, Sara Holbrook, Lee Bennett Hopkins, Paul B. Janeczko, Michele Krueger, Julie Larios, JonArno Lawson, J. Patrick Lewis, Kimberly Marcus, Heidi Mordhorst, Naomi Shihab Nye, Michael Salinger, Joyce Sidman, Marilyn Singer, Sonya Sones, Charles Waters, April Halprin Wayland, Steven Withrow, Allan Wolf, Janet Wong, and Tracie Vaughn Zimmer. Photographs by Sylvia Vardell.P*TAG is ideal for teens who like writing poetry; readers can play P*TAG on their own by writing a poem about a photo from the photo library blog at http://teenpoetrytagtime.blogspot.com and comparing it to the P*TAG poem that was inspired by that same photo. PoetryTagTime is Book 1 in the series.Book 2 in the series is P*TAG, the first-ever poetry anthology e-book for teens.Book 3 in the series is GIFT TAG, an anthology of holiday poems to celebrate Thanksgiving, Hanukkah, Christmas, and \"Mew Year's Day for Cats\"!More info on the series at www.PoetryTagTime.com. Praise for the PoetryTagTime, P*TAG, and Gift Tag series:“[T]he organizing principle of the book is neat, with each poet \"tagging\" the next to write a poem which in some way links to his or her own. Fun and cheap: 99¢! The poems are light and lively, and I'm glad to report that the line-breaks remain sacrosanct no matter how you mess with the font size.” --Roger Sutton, Read Roger                                    “[A] collection of poetry that simply: YOU. MUST. HAVE. . . . The results are spectacular. Here is an eBook worthy of classroom use with plenty of teen appeal. Plus, it is perfect for reading aloud as well.” --Teri Lesesne, The Goddess of YA Literature“What a wonderful way for teenagers to encounter poetry; and the interactive nature of the e-book invites readers to explore each poet’s work more deeply.” --Marjorie Coughlan, Paper Tigers“In the engaging poems of PoetryTagTime children will discover just how amazing and magical words can be. Delighted young listeners, readers and writers will surely rush to join the poets at play with words.” --Glenna Sloan, Give Them Poetry",
  "genres": [
    "Poetry"
  ],
  "author": "Sylvia M. Vardell",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/12740918-p-tag"
}