{
  "title": "Gedichten",
  "description": "Paul Snoek (1933-1981) geldt als een van de bekendste dichters uit Vlaanderen. Hij stond mee aan de wieg van de vernieuwing in de Vlaamse poëzie, en wordt gerekend tot de groep van de 55'ers, het Vlaamse antwoord op de experimentele vernieuwing in Nederland. Zijn krachtige poëzie is moeilijk onder een enkele noemer te vatten.In dit boek zijn voor het eerst alle gedichten van Paul Snoek de gebundelde en de ongebundelde, de gepubliceerde en de ongepubliceerde. De teksten zijn zorgvuldig vergeleken met overgeleverde handschriften en typoscripten, eventuele tijdschriftpublicaties van de gedichten én met de originele eerste en eventueel later uitgegeven (geautoriseerde) drukken van Snoeks bundels, volgens de recentste bevindingen van de moderne editiewetenschap. Snoek was ook actief als plastisch kunstenaar. In het boek is daarom een selectie uit zijn plastisch werk opgenomen, die de interactie duidelijk maakt tussen zijn poëzie en zijn schilderwerk.Paul Snoek. Gedichten werd samengesteld door Yves T'Sjoen, docent moderne Nederlandse literatuur aan de Universiteit Gent, en Christophe Van der Vorst van het Centrum voor Teksteditie en Bronnenstudie van de Koninklijke Academie voor Nederlandse Taal- en Letterkunde Gent, en bevat een nawoord van dichter, recensent en Snoek-biograaf Paul Demets.Archipel. Gedichten; Noodbrug; Aardrijkskunde. Antropografische suite voor naïeve meisjes; Tussen vel en vlees. Gedichten; Ik rook een vredespijp. Gedichten 1956; De heilige gedichten. 1956-1958; Hercules. Gedichten; Richelieu. Gedichten; Op de grens van land en zee; Nostradamus. Gedichten; De zwarte muze. Gedichten; Gedrichten. Gedokumenteerde aktualiteitspoëzie en/of alternatieve griezelgedichten; Gedichten voor Maria-Magdalena; Frankenstein. Nagelaten gedrichten; Ik heb vannacht de liefde uitgevonden; Welkom in mijn onderwereld; De zangen van Lesbos; Schildersverdriet; Verspreide gepubliceerde gedichten; Plastisch werk; Ongepubliceerde gedichten; Nawoord; Verantwoording; Aantekeningen bij de gedichten; Bibliografie; Register op titels en beginregels; Inhoud.",
  "genres": [
    "Poetry"
  ],
  "author": "Paul Snoek",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/5739214-gedichten"
}