{
  "title": "Cicero Slumber",
  "description": "A Briar Rose Mafia RetellingIn Chicago- 1986, while Bruna Rossa was on bedrest from a rough pregnancy, she is visited by the Godfather of the Rossa Crime Famiglia, the one they call ‘The Toad’ due to his daunting appearance. She is told that she will have a daughter whose hand will be promised to one of the sons of their rival, the Dormire Famiglia. The Rossa couple is against this idea initially until she is told if they decline the request, there will be a curse put on their daughter on her 18th birthday. This was something they only laughed off, as it was only a thing of fairy tales, not believing in such nonsense.Fast forward to 2004, during Brianna ‘Bree’ Rossa’s graduation party, she becomes more acquainted with the boy she had a crush on all through her senior year, Leonardo Dormire. They hit it off much to her parents’ chagrin, although this does come as a relief with the thought the curse that plagued them for eighteen would be absolved. However, when Giovanni and Rosalyne Dormire hear of this union, they discourage Leo from ever seeing Bree again, since she is the daughter of the man who only wants to take over power in the Cicero area.The evening before her 18th birthday, Bree is woken by someone chanting her name using Leo’s voice. She follows the voice down to the basement of their illustrious home however, there is no one waiting for her. Nothing but a spindle used during medieval times. She chuffs it off until she’s met by a hooded figure, stating ‘It is a crime to marry your enemy and because of the love you have for leonardo Dormire, your heart is cursed.’ This confuses Bree and just as she turns to go back to bed, a green mist envelops her and she is rendered into a deep sleep. ‘Oh, yeah. I know you’re asleep now and won’t hear this but you are now in a hundred year deep sleep and only a kiss of true love will wake you up, princess Brianna of the Rossa Famiglia.’Does Leonardo Dormire truly love Brianna Rossa enough to break this spell? Is the power of love enough to wake Brianna up or will the families need to end their quarreling to break the curse?",
  "genres": [],
  "author": "L.D. Wosar",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/57406623-cicero-slumber"
}