{
  "title": "Blood Lite",
  "description": "A collection of entertaining tales that puts the fun back into dark fiction, with ironic twists and tongue-in-cheek wit to temper the jagged edge.Charlaine Harris reveals the dark side of going green, when a quartet of die-hard environmentalists hosts a fundraiser with a gory twist in \"An Evening with Al Gore\"...In an all-new Dresden Files story from Jim Butcher, when it comes to tracking deadly paranormal doings, there's no such thing as a \"Day Off\" for the Chicago P.D.'s wizard detective, Harry Dresden...Sherrilyn Kenyon turns a cubicle-dwelling MBA with no life into a demon-fighting seraph with one hell of an afterlife in \"Where Angels Fear to Tread\"...Celebrity necromancer Jaime Vegas is headlining a sold-out séance tour, but behind the scenes, a disgruntled ghost has a bone to pick, in Kelley Armstrong's \"The Ungrateful Dead.\" Plus tales guaranteed to get under your skin--in a good way!Mr. Bear by Joe R. LansdaleHell in a Handbasket by Lucien SoulbanThe Eldritch Pastiche from Beyond the Shadow of Horror by Christopher WelchElvis Presley and the Bloodsucker Blues by Matt VenneNo Problem by Don D'AmmassaOld School by Mark OnspaughThe Sound of Blunder by J.A. Konrath and F. Paul WilsonDear Prudence by Steven SavileA Good Psycho is Hard to Find by Will LudwigsenHigh Kicks and Misdemeanors by Janet BerlinerPR Problems by Eric James StoneA Very Special Girl by Mike ResnickLove Seat Solitaire by D.L. SnellI Know Who You Ate Last Summer by Nancy HolderBitches of the Night by Nancy KilpatrickThe Bell...FROM HELL!!! by Jeff StrandDead Hand by Sharyn McCrumbSo let the blood flow and laughter reign -- because when it comes to facing our deepest, darkest fears, a little humor goes a long way!",
  "genres": [
    "Urban Fantasy",
    "Anthologies",
    "Fantasy",
    "Paranormal",
    "Horror",
    "Vampires",
    "Short Stories"
  ],
  "author": "Kevin J. Anderson",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/5739760-blood-lite"
}