{
  "title": "Unsettled: What Climate Science Tells Us, What It Doesn’t, and Why It Matters",
  "description": "“Surging sea levels are inundating the coasts.”“Hurricanes and tornadoes are becoming fiercer and more frequent.”“Climate change will be an economic disaster.”You’ve heard all this presented as fact. But according to science, all of these statements are profoundly misleading.When it comes to climate change, the media, politicians, and other prominent voices have declared that “the science is settled.” In reality, the long game of telephone from research to reports to the popular media is corrupted by misunderstanding and misinformation. Core questions—about the way the climate is responding to our influence, and what the impacts will be—remain largely unanswered. The climate is changing, but the why and how aren’t as clear as you’ve probably been led to believe. Now, one of America’s most distinguished scientists is clearing away the fog to explain what science really says (and doesn’t say) about our changing climate. In What Climate Science Tells Us, What It Doesn't, and Why It Matters, Steven Koonin draws upon his decades of experience—including as a top science advisor to the Obama administration—to provide up-to-date insights and expert perspective free from political agendas. Fascinating, clear-headed, and full of surprises, this book gives readers the tools to both understand the climate issue and be savvier consumers of science media in general. Koonin takes readers behind the headlines to the more nuanced science itself, showing us where it comes from and guiding us through the implications of the evidence. He dispels popular myths and unveils little-known despite a dramatic rise in greenhouse gas emissions, global temperatures actually decreased from 1940 to 1970. What’s more, the models we use to predict the future aren’t able to accurately describe the climate of the past, suggesting they are deeply flawed. Koonin also tackles society’s response to a changing climate, using data-driven analysis to explain why many proposed “solutions” would be ineffective, and discussing how alternatives like adaptation and, if necessary, geoengineering will ensure humanity continues to prosper. Unsettled is a reality check buoyed by hope, offering the truth about climate science that you aren’t getting elsewhere—what we know, what we don’t, and what it all means for our future.",
  "genres": [
    "Science",
    "Nonfiction",
    "Climate Change",
    "Politics",
    "Environment",
    "Economics",
    "Nature"
  ],
  "author": "Steven E. Koonin",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/57433539-unsettled"
}