{
  "title": "The Fourth Part of the World: The Race to the Ends of the Earth, and the Epic Story of the Map That Gave America Its Name",
  "description": "\"Old maps lead you to strange and unexpected places, and none does so more ineluctably than the subject of this book: the giant, beguiling Waldseemuller world map of 1507.\" So begins this remarkable story of the map that gave America its name. For millennia Europeans believed that the world consisted of three parts: Europe, Africa, and Asia. They drew the three continents in countless shapes and sizes on their maps, but occasionally they hinted at the existence of a \"fourth part of the world,\" a mysterious, inaccessible place, separated from the rest by a vast expanse of ocean. It was a land of myth--until 1507, that is, when Martin Waldseemuller and Matthias Ringmann, two obscure scholars working in the mountains of eastern France, made it real. Columbus had died the year before convinced that he had sailed to Asia, but Waldseemuller and Ringmann, after reading about the Atlantic discoveries of Columbus's contemporary Amerigo Vespucci, came to a startling conclusion: Vespucci had reached the fourth part of the world. To celebrate his achievement, Waldseemuller and Ringmann printed a huge map, for the first time showing the New World surrounded by water and distinct from Asia, and in Vespucci's honor they gave this New World a name: America.\"The Fourth Part of the World \"is the story behind that map, a thrilling saga of geographical and intellectual exploration, full of outsize thinkers and voyages. Taking a kaleidoscopic approach, Toby Lester traces the origins of our modern worldview. His narrative sweeps across continents and centuries, zeroing in on different portions of the map to reveal strands of ancient legend, Biblical prophecy, classical learning, medieval exploration, imperial ambitions, and more. In Lester's telling the map comes alive: Marco Polo and the early Christian missionaries trek across Central Asia and China; Europe's early humanists travel to monastic libraries to recover ancient texts; Portuguese merchants round up the first West African slaves; Christopher Columbus and Amerigo Vespucci make their epic voyages of discovery; and finally, vitally, Nicholas Copernicus makes an appearance, deducing from the new geography shown on the Waldseemuller map that the earth could not lie at the center of the cosmos. The map literally altered humanity's worldview.One thousand copies of the map were printed, yet only one remains. Discovered accidentally in 1901 in the library of a German castle it was bought in 2003 for the unprecedented sum of $10 million by the Library of Congress, where it is now on permanent public display. Lavishly illustrated with rare maps and diagrams, \"The Fourth Part of the World \"is the story of that map: the dazzling story of the geographical and intellectual journeys that have helped us decipher our world.",
  "genres": [
    "History",
    "Nonfiction",
    "Geography",
    "Maps",
    "Science",
    "Travel",
    "Cartography"
  ],
  "author": "Toby Lester",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/5742798-the-fourth-part-of-the-world"
}