{
  "title": "1000 Years of Joys and Sorrows: A Memoir",
  "description": "In Ai Weiwei's widely anticipated memoir,  \"one of the most important artists working in the world today\" (Financial Times) tells a century-long epic tale of China through the story of his own extraordinary life and the legacy of his father,  the nation's most celebrated poet.\"With uncommon humanity, humbling scholarship, and poignant intimacy, Ai Weiwei recounts a life of courage, argument, defeat, and triumph. His is one of the great voices of our time.\"--Andrew SolomonHailed as \"an eloquent and seemingly unsilenceable voice of freedom\" by The New York Times,  Ai Weiwei has written a sweeping memoir that presents a remarkable history of China over the last hundred years while also illuminating his artistic process.Once an intimate of Mao Zedong and the nation's most celebrated poet, Ai Weiwei's father, Ai Qing, was branded a rightist during the Cultural Revolution, and he and his family were banished to a desolate place known as \"Little Siberia,\" where Ai Qing was sentenced to hard labor cleaning public toilets. Ai Weiwei recounts his childhood in exile, and his difficult decision to leave his family to study art in America, where he befriended Allen Ginsberg and was inspired by Andy Warhol. With candor and wit, he details his return to China and his rise from artistic unknown to art world superstar and international human rights activist--and how his work has been shaped by living under a totalitarian regime.Ai Weiwei's sculptures and installations have been viewed by millions around the globe, and his architectural achievements include helping to design the iconic Bird's Nest Olympic Stadium in Beijing. His political activism has long made him a target of the Chinese authorities, which culminated in months of secret detention without charge in 2011. Here, for the first time, Ai Weiwei explores the origins of his exceptional creativity and passionate political beliefs through his life story and that of his father, whose creativity was stifled.At once ambitious and intimate, Ai Weiwei's 1000 Years of Joys and Sorrows offers a deep understanding of the myriad forces that have shaped modern China, and serves as a timely reminder of the urgent need to protect freedom of expression.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Art",
    "China",
    "Biography",
    "History",
    "Biography Memoir"
  ],
  "author": "Weiwei Ai",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/57423429-1000-years-of-joys-and-sorrows"
}