{
  "title": "London Bridge is Falling Down",
  "description": "Oh, joy, a new Peculiar Crimes Unit case by Christopher Fowler . . . the best fun is running all over the city with these amiable partners. The New York Times Book Review,  on Bryant & May: The Lonely Hour The brilliant duo of Arthur Bryant and John May uncover a nefarious plot behind the seemingly innocuous death of an old lady--and when the case leads them to the London Bridge, it all comes down on the Peculiar Crimes Unit.Ninety-one-year-old Alice Hoffman died alone in her top-floor flat. Social services say she slipped through the cracks in a failing system. But detectives Arthur Bryant and John May of the Peculiar Crimes Unit have their suspicions. Mrs. Hoffman was not as innocent as she appeared. A former government security expert, she had once worked for their own unit, but there's no one left who can remember her. And when they uncover a link between her and a diplomat desperate to leave the country, it begins to look as if someone might have committed an impossible murder.But Mrs. Hoffman wasn't acting alone. Arthur Bryant is convinced that a group of talented women have been working together for decades and now the others are in danger. With the help of some of his more certifiable contacts and historical experts, he and John May embark on an investigation that will lead them down forgotten alleyways to riverside buildings and on to the city's oldest bridge. But just when the case appears to have been solved and unit chief Raymond Land can congratulate everyone on ending a threat to international security, the detectives discover that they've been the victims of the biggest deception of all. For even after her death, Mrs. Hoffman would prove too clever for them . . .Bryant and May's twentieth-anniversary case brings an ending and a new beginning to London's most peculiar crimes unit and all who work there.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Audiobook",
    "Detective",
    "Humor"
  ],
  "author": "Christopher Fowler",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/57423655-london-bridge-is-falling-down"
}