{
  "title": "OOF: An Online Outrage Fiesta for the Ages",
  "description": "Award-winning novelist and cultural critic Strobe Witherspoon interrogates his own profession. It goes terribly.\"Wildly entertaining ...Sometimes sad and sometimes hilarious, Witherspoon's timely metafictional novel explores the ways (mis)information can shape public discourse in the digital media age.\" – Booklife by Publishers Weekly”Strikingly original ...an innovative literary experiment that supplies a thoughtful commentary on the 'discourse virus' of our age ...Witherspoon tackles a broad spectrum of media, including comically scathing excerpts from tweets, podcasts, blogs, and even academic journals and also keenly exposes the ways in which Strobe, the character, is implicated in his own online assault, due to his obsessive attachment to public life.” – Kirkus ReviewsOOF explores the role of satire in a society lurching from one ridiculous crisis to the next, where media outlets rely on clicks to stay alive and everything is filtered through a lens of anger and misinformation.------------Strobe Witherspoon just sold his latest satirical novel for a lot of money. The book in question, FLOTUS: A Memoir, is a fictitious autobiography about a former first lady of the United States reflecting on years of misery at the hands of her much older POTUS husband. When a chapter is leaked in advance of the book's publication, an Online Outrage Fiesta (OOF) ensues via mainstream news outlets, blogs, Twitter, troll farms, and everything in between. Witherspoon has his life placed under a microscope. Family secrets are exposed. Now, an anthology has been put together to document Witherspoon’s downfall—and settle the score.------------”an impressive achievement of unflinching honesty from a noteworthy talent, as resonant and relevant as it is entertaining ...OOF tugs at the threads that connect American cynicism with radical extremism and weaves a character-rich tapestry of insight ...Each voice, whether of a New Yorker journalist or an Internet influencer, is rendered with uncanny fidelity. Perhaps most masterful is that key events are not depicted but merely alluded to, allowing the text to provide an elegant framework for a more personal story painted almost invisibly in the negative space.”– BlueInk Review \"a work of pure creative genius, engaging and thought-provoking ...You know that you are in for a treat when an author makes fun of himself, as Witherspoon wears two hats as an inquisitor general and heretic at the same time.\" - Readers' Favorite (5 out of 5 stars) \"a sly satire that imagines a world overrun by Internet toxicity.\" - Foreword (4 out of 5 stars) \"cutting and reflective, a close-to-the-bone societal mirror ...A valiant attempt at satirizing the almost-too-ludicrous-for-satire world of the online hot take.\" - IndieReader \"entertaining and thought-provoking, OOF combines satire and serious social inspection in a novel format that will intrigue literary, political, and social issues readers alike.\" - Midwest Book Review\"Those interested in \"the low art of chronicling human stupidity\" will not be able to put this book down ...Fans of works like Dear Committee Members will immediately find a new favorite in this book.\" - US Review of Books",
  "genres": [
    "Humor",
    "Fiction",
    "Amazon"
  ],
  "author": "Strobe Witherspoon",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/57435565-oof"
}