{
  "title": "Between the Assassinations",
  "description": "Welcome to Kittur, India. It's on India's southwestern coast, bounded by the Arabian Sea to the west and the Kaliamma River to the south and east. It's blessed with rich soil and scenic beauty, and it's been around for centuries. Of its 193,432 residents, only 89 declare themselves to be without religion or caste. And if the characters in Between the Assassinations are any indication, Kittur is an extraordinary crossroads of the brightest minds and the poorest morals, the up-and-coming and the downtrodden, and the poets and the prophets of an India that modern literature has rarely addressed.  A twelve-year-old boy named Ziauddin, a gofer at a tea shop near the railway station, is enticed into wrongdoing because a fair-skinned stranger treats him with dignity and warmth. George D'Souza, a mosquito-repellent sprayer, elevates himself to gardener and then chauffeur to the lovely, young Mrs. Gomes, and then loses it all when he attempts to be something more. A little girl's first act of love for her father is to beg on the street for money to support his drug habit. A factory owner is forced to choose between buying into underworld economics and blinding his staff or closing up shop. A privileged schoolboy, using his own ties to the Kittur underworld, sets off an explosive in a Jesuit-school classroom in protest against casteism. A childless couple takes refuge in a rapidly diminishing forest on the outskirts of town, feeding a group of \"intimates\" who visit only to mock them. And the loneliest member of the Marxist-Maoist Party of India falls in love with the one young woman, in the poorest part of town, whom he cannot afford to wed.  Between the Assassinations showcases the most beloved aspects of Adiga's writing to brilliant effect: the class struggle rendered personal; the fury of the underdog and the fire of the iconoclast; and the prodigiously ambitious narrative talent that has earned Adiga acclaim around the world and comparisons to Gogol, Ellison, Kipling, and Palahniuk. In the words of The Guardian (London), \"Between the Assassinations shows that Adiga...is one of the most important voices to emerge from India in recent years.\"  A blinding, brilliant, and brave mosaic of Indian life as it is lived in a place called Kittur, Between the Assassinations, with all the humor, sympathy, and unflinching candor of The White Tiger, enlarges our understanding of the world we live in today.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Indian Literature",
    "Contemporary",
    "Literature",
    "Historical Fiction",
    "Literary Fiction"
  ],
  "author": "Aravind Adiga",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/5743627-between-the-assassinations"
}