{
  "title": "Edge of the Wild",
  "description": "“Your lordship.” It’s a title Oliver will have to get used to: in just a few short months, he’s gone from the bastard son of a dead duke’s equally-dead brother, plain Oliver Meacham, to Lord Oliver, the royal consort of King Erik of Aeretoll. Still uncertain of his place amongst the Northerners, but cautiously hopeful that what he’s found with Erik is real and lasting, his new relationship is put to the ultimate test on the journey to the annual Midwinter Festival: a meeting of all the lords and clan chiefs of the North, across the treacherous Northern Wastes. It doesn’t help that he keeps having these visions…of blue light, and antlered shamans…and dragons.Lady Tessa Drake traveled North with her cousin Oliver as escort with the intention of wedding King Erik. But it was Oliver who captured Erik’s heart, and Tessa was instead offered the hand of Erik’s elder nephew, the handsome and kind-hearted Prince Leif. But with Leif away at the festival, and Tessa left behind at Aeres, she finds herself growing closer and closer to Leif’s younger brother, Rune, who’s recovering from a grave injury, and putting butterflies in her stomach.In the South, in the duchy of Drakewell, Tessa’s older sister, Amelia, spends her days scouting for outlaws with her men-at-arms – and her nights in the arms of her oldest and best friend, Malcolm, a guardsman she loves, but can’t marry if she hopes to secure an army to defend her homeland from the invading Sels. Her mother wants her to marry one of Tessa’s foppish former suitors, but Amelia has bigger things to worry about: namely, the strange happenings in the Inglewood, and the claims of “beasts” roaming there.The second installment in the Drake Chronicles is full of action, adventure, steamy romance, danger, necromancy, magic, and, finally, actual live dragons. It’s time for the Drakes of Drakewell to learn of the power that runs in their blood, just in time to save their respective kingdoms. Featuring M/M and M/F pairings, this is an ongoing epic fantasy romance intended for adult audiences.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Dragons",
    "Romance",
    "Historical",
    "M F Romance",
    "LGBT"
  ],
  "author": "Lauren Gilley",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/57456142-edge-of-the-wild"
}