{
  "title": "Febre Tropical",
  "description": "“Exuberante e assertivo [...] em qualquer página estão os sinais de uma escritora esmiuçando suas nuances.” – The New York TimesFinalista do Kirkus Prize, do Aspen Literary Prize e do Lambda Literary Awards, o primero livro de Juliana Delgado Lopera traz frescor e atualidade aos romances de formação e nos arrebata desde a primeira linha. Você será apresentado à história de Francisca e sua excêntrica família colombiana recém-chegada a Miami, no começo dos anos 2000. Nostálgica e atormentada pelo calor, a garota lida com o desconforto existencial e os desejos próprios da adolescência ao mesmo tempo que observa a inquietação da mãe e a dependência da avó por mais rum nas latinhas de Sprite. Para isso, ela se refugia em Sylvia Plath e The Cure, embora a mãe acredite que a salvação esteja na salsa cristã da congregação Iglesia Cristiana Jesucristo Redentor.Todo o universo em torno de Francisca se torna matéria para suas reflexões, que oscilam entre a ironia mais mordaz e uma delicadeza fortuita, expostas pela jovem que teme revelar seus sentimentos na mesma proporção que necessita vivê-los. Francisca não está apenas diante de sua sexualidade que aflora sem rótulos; ela também descobre as sutilezas de amar mulheres, viver em comunidade com mulheres, ser criada por mulheres, ao mesmo tempo em que rejeita performances de feminilidade vazias de sentido.Num momento precioso da narrativa caracterizado como uma espécie de arqueologia sentimental das mulheres da família Juan, Francisca reconta episódios de quando sua mãe, Myrian, e sua avó, Alba, tinham quinze anos, na tentativa de compreendê-las, se reconectar com elas, fechar o círculo das vivências que aproximam e afastam.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Contemporary",
    "Young Adult",
    "Romance",
    "Coming Of Age"
  ],
  "author": "Juliana Delgado Lopera",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/57456494-febre-tropical"
}