{
  "title": "Apples Never Fall",
  "description": "18 hours #1 New York Times bestselling author Liane Moriarty is back with a novel that looks at marriage, sibling rivalry, and the lies we tell others and ourselves. Apples Never Fall is the work of a writer at the top of her game.The Delaney family love one another dearly―it’s just that sometimes they want to murder each other . . .If your mother was missing, would you tell the police? Even if the most obvious suspect was your father?This is the dilemma facing the four grown Delaney siblings.The Delaney family is a communal foundation. Stan and Joy are the envy of all of their friends. They’re killer on the tennis court, and off it their chemistry is palpable. But after fifty years of marriage, they’ve finally sold their famed tennis academy and are ready to start what should be the golden years of their lives. So why are they so miserable?The four Delaney children―Amy, Logan, Troy, and Brooke―were tennis stars in their own right, yet as their father will tell you, none of them had what it took to go all the way. But that’s okay, now that they’re all successful grown-ups. Well, that depends on how you define success. No one in the family can really tell you what Troy does, but based on his fancy car and expensive apartment, he seems to do it very well, even if he blew up his perfect marriage. Logan is happy with his routine as a community college professor, but his family finds it easier to communicate with his lovely girlfriend than him. Amy, the eldest, can’t seem to hold down a job or even a lease, but leave it to Brooke, the baby of the family, to be the rock-steady one who is married with a new solo physiotherapy practice . . . which will take off any day now.One night a stranger named Savannah knocks on Stan and Joy’s door. She says she chose their house because it looked the friendliest. And since Savannah is bleeding after a fight with her boyfriend, the Delaneys are more than happy to give her the small kindness she sorely needs. If only that was all she wanted.Later, everyone will wonder what exactly went on in that household after Savannah entered their lives that night. Because now Joy is missing, no one knows where Savannah is, and the Delaneys are reexamining their parents’ marriage and their shared family history with fresh, frightened eyes.",
  "genres": [
    "Fiction",
    "Mystery",
    "Audiobook",
    "Book Club",
    "Thriller",
    "Mystery Thriller",
    "Contemporary"
  ],
  "author": "Liane Moriarty",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/57443907-apples-never-fall"
}