{
  "title": "To Save A King",
  "description": "A modern-day fairy tale of hope and rescue from NYT bestselling author Rachel HauckAfter growing up in small-town Hearts Bend, Tennessee, Gemma Stone set off to Hollywood to make her mark in the world.But her ambition turned into a journey of a “thousand” bad decisions and after twelve years of seeking fame and fortune, Gemma returns home with a limp and a dark secret.Now she runs a rescue ranch and is raising her friends’ orphaned daughter. She’s keenly aware these defenseless ones are also rescuing her. She just wants to stay hidden in the safe world she’s created.HRH Crown Prince John has learned a royal title cannot shield him from heartbreak. As heir to the revered House of Blue and married to the love of his life, he believed his future reign would strengthen the royal dynasty of Lauchtenland. Then tragedy changed everything. Can anything save him from his grief?When he travels to Hearts Bend on a mission for his mother, Queen Catherine, he’s drawn into the local life and cajoled into a three-legged race with the beautiful Gemma Stone during the 4th of July festivities.While the event has a disastrous result, Prince John and Gemma form a quick friendship—one of two wounded souls finding comfort in one other. However, love is absolutely not an option. John desperately wants to hold onto the memories of his wife, and Gemma refuses to trust her heart to any man. Even a prince.Then Prince John is called home for an emergency. How can he leave the woman who lifted him from his sorrows? But can Gemma join him on a royal stage and risk her secret coming to light?With a touch of divine help, Prince John and Gemma just might find the kind of love that saves and ultimately write their very own fairy tale.",
  "genres": [
    "Romance",
    "Contemporary",
    "Christian Fiction",
    "Christian Romance",
    "Christian",
    "Fiction",
    "Inspirational"
  ],
  "author": "Rachel Hauck",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/57453081-to-save-a-king"
}