{
  "title": "Heart of the Ronin",
  "description": "Fantasy writer Travis Heermann (THE IVORY STAR) brings thirteenth-century Japan alive in HEART OF THE RONIN, the first installment of a trilogy.Ken'ishi is just 17 years old and an orphan after the mysterious death of his parents. He dreams of training with a master who will some day help him become a samurai.Traveling with Silver Crane, a sword that belonged to his father, and a dog, Akao, for a sidekick, Ken'ishi's adventures begin after he murders a policeman and must flee. Just when he thinks he has escaped trouble, he saves Kazuko, the daughter of an influential lord, from a group of bandits. In return, he is asked to live in the lord's house, where he falls in love with Kazuko.Forced to flee once again, Ken'ishi goes on a hunt to discover his past while fighting off warriors and demons, not to mention worrying about the bounty that's on his head. Will he find out if his father really was a samurai or why the sword he wields seems to be infused with magic?Written while the author lived in Japan, HEART OF THE RONIN combines historical fiction with fantasy to keep readers guessing what Ken'ishi will encounter next in Heerman's mystical universe. \"A fusion of historical fiction and adventure fantasy, the first volume of Heermann's Ronin Trilogy is a page-turning folkloric narrative of epic proportions.\" -- Publishers Weekly\"Full of sword battles, intrigue, romance and fantastic elements blending well with historical ones, Heart of the Ronin is a very impressive opening in the Ronin Trilogy. It's also a page turner that you can't put down and will leave readers begging for more.\"-- Fantasy Book Critic\"Heart of a Ronin is a solid, likeable adventure story, sure to please fans of Japanese culture and fantasy readers alike.\" -- Adventures in Sci-Fi Publishing",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Japan",
    "Asia",
    "Martial Arts"
  ],
  "author": "Travis Heermann",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/5744013-heart-of-the-ronin"
}