{
  "title": "طيور أيلول",
  "description": "\"عندما يحلّ أيلول، تاسع أشهر السنة، تمر فوق قريتها أسرابٌ كثيرة من طيور كبيرة الحجم، قوية الجناحين، يعرفها السكان، بـ\"طيور أيلول\" ويتلفت الناس نحو الفضاء الموشّح ببواكير الغمام، يراقبون الطيور، وفي صدورهم غصّات انفعال. إن هذه الطيور المهاجر تسجّل نقطة جديدة في دائرة الزمن، ويذكرون أن فصل البرد أصبح على الأبواب. ويقف شيخ في منتصف الطريق يسند ثقله إلى عصا سنديان ويمسح شاربيه، ثم يرسل نظرات متسائلة نحو الطيور، تدغدغ حلماً عزيزاً. وتمسح امرأة يديها المبللّتين بالماء على جانبي ثوبها، وتنفض منديل الرأس لتعيد حزمه من جديد حول شعرها، وتشبع الطيور بنظرات الحنين... ويبقى الحبل موصولاً أياماً تراوح بين الثلاثة والعشرة، ويتناقل القرويون أنباء الطيور الراحلة، وتتلون أحاديثهم بلون جديد يحطم رتابة الحياة البطيئة. وتتابع القافلة سيرها صوب السهول الدافئة في الجنوب، إنها تهرب من أذى الصقيع في البلاد الشمالية... ويبقى طعم الهجر يتململ في أجواء القرية أياماً. إنه يعشش في الكوى، في شقوق السطوح الوطيئة، في المسام الصغيرة بين أوراق الزيتون والسنديان، في دموع تفلت من المآقي، في آهات حرّى تندفع من صدور الأمهات. وكأنما الطيور تشعر بالأشجان التي يثيرها عبورها، وتلقيها مع ظلالها فوق السطوح وبين الأزقة وتتابع رحلتها بصمت. الصمت الحزين، المرفرف في أجواء القرية، ينقل إليها، يعصر وجودها ويخضعها لرهبة السكون\". في أيلولها حزن وفي طيورها شجن، تنقاد إليهما من خلال كلماتها وعباراتها التي وكأنها ترسم لوحات ألوانها هي محض أحاسيس ومشاعر تدفقت من لحظة ولع بقرية هي موئل الفؤاد. فعند أملي نصر الله نبع إبداع أدبي لا ينضب مصدره القرية وطبيعتها، وهو متجسد بأعمالها، إلا أنه يبلغ ذروته في روايتها \"طيور أيلول\". فهذه الرواية، إلى جانب روعة صورها الفنية، وإلى جانب ثراءها التعبيري والبلاغي والتصويري واللغوي، إلى جانب كل ذلك، فإن طيور أيلول تمثل في إحدى جوانبها دراسة اجتماعية لعادات وتقاليد أهل تلك القرية، وفي جانب آخر، هي تمسّ وببراعة عالم النفس الإنسانية بكل طموحاتها المؤجلة والمعجلة، وبكل أمانيها المقهورة والمبتورة، وبكل معاناتها التي وكما هي بقعة سوداء في حياة بطلة أملي، هي إلى ذلك بقعة ضوء أكسبت تلك الرواية سمة الواقعية، وأغنت عالم الرواية بالكثير من التجارب الإنسانية.",
  "genres": [
    "Fiction",
    "Lebanon",
    "Novels",
    "Literature"
  ],
  "author": "Emily Nasrallah املي نصرالله",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/12742948"
}