{
  "title": "Harry Potter House Hufflepuff Edition Series 6-10: 5 Books Collection Set By J.K. Rowling",
  "description": "Please Note That The Following Individual Books As Per Original ISBN and Cover Image In this Listing shall be Dispatched Harry Potter House Hufflepuff Edition Series 6-10: 5 Books Collection Set By J.K. Harry Potter and the Philosopher's Stone – Hufflepuff Harry Potter and the Philosopher's Stone has been read and loved by every new generation since. These stunning editions each feature the individual house crest on the jacket and line illustrations exclusive to that house, by Kate Greenaway Medal winner Levi Pinfold.Harry Potter and the Chamber of Secrets – Hufflepuff Hogwarts School of Witchcraft and Wizardry. Issued to mark the 20th anniversary of first publication of Harry Potter and the Chamber of Secrets, these irresistible House Editions celebrate the noble character of the four Hogwarts houses.Harry Potter and the Prisoner of Azkaban – Hufflepuff With an exciting, bespoke introduction exploring the history of Gryffindor House, and exclusive insights into the use of the Patronus Charm by favourite Gryffindor characters, the book also boasts a spectacular image.Harry Potter and the Goblet of Fire – Hufflepuff Each Gryffindor House Edition features vibrant sprayed edges and intricate gold foiling. The Goblet of Fire blazes at the very centre of the front cover, framed by stunning iconography that draws on themes and moments from this much-loved story.Harry Potter and the Order of the Phoenix – Hufflepuff Each Gryffindor House Edition features vibrant sprayed edges and intricate gold foiling. The Order's iconic phoenix symbol rises from the flames at the very centre of the front cover, framed by stunning iconography of The Burrow, home of the Weasley family.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult"
  ],
  "author": "J.K. Rowling",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/57470610-harry-potter-house-hufflepuff-edition-series-6-10"
}