{
  "title": "The Royal Mess",
  "description": "In a world nearly identical to ours, the North won the Civil War, flannel is the new bling, and Russia never sold Alaska to the U.S. Instead, Alaska is a beautiful, rough-and-tumble country ruled by a famously eccentric royal family who put the fun back in dysfunctional. And the tabloid darlings are about to get more ink once the King's \"royal oats\" come back in the form of a surprise princess, landing them all in, well. . .  The Royal Mess Jeffrey Rodinov is descended from one of the oldest families in Alaska, and a Rodinov has been protecting a Baranov for generations. It's a job Jeffrey takes VERY seriously. Six feet four inches, 220 fatless lbs., black hair, and blue eyes;weapon of choice: the 9 mm Beretta. In a pinch? His fists. IQ: 157. (Yes, crossword puzzle, in ink, just after taking out the guy behind you. No thanks necessary.) No one ever sees Jeffrey Rodinov coming, and no one--not even a mouthy, illegitimate princess--is going to keep him from playing bodyguard when his king decrees it.Right. But no Rodinov ever had to protect Princess Nicole Krenski. Her credentials? Hunting guide in the Alaskan wilderness. Smart. Stubborn bordering on exasperating. Five-seven. Blue eyes. Very kissable mouth. Very kissable neck, back, legs, wrists, earlobes. The lady says she doesn't need a bodyguard, but that's where she's wrong. Someone needs to watch her and show her the royal ropes (and cuffs. . .and scarves. . .). Someone who can make her feel like a queen--in and out of bed. And that's a job Jeffrey Rodinov takes very seriously as well. . .In this deliciously sexy, wickedly funny companion to The Royal Treatment  and The Royal Pain,  a reluctant princess and a determined royal bodyguard are about to discover that when it comes to powerful love, there are no defenses. . .",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary Romance",
    "Contemporary",
    "Humor",
    "Fiction",
    "Fantasy"
  ],
  "author": "MaryJanice Davidson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/574852.The_Royal_Mess"
}