{
  "title": "Without a Hitch",
  "description": "Sweet Home Alabama\n meets Emily in Paris in this hilarious romp through the world of extravagant southern weddings.When floundering and unlucky-in-love twentysomething Lottie Jones lands a new career as a wedding planner at a top-tier boutique event firm, she begins navigating a cutthroat workplace specializing in over-the-top details, unlimited budgets, and a broad spectrum of taste. Whether planning for parachute landings or wrangling intoxicated groomsmen, she has her hands full at every million-dollar wedding she helps organize.After her boss announces he’s opening a new office, Lottie sees her chance to finally carve out her place—and earn an income that justifies her dating app subscription fees. The weddings get bigger, the clients get wilder, the mishaps get funnier, and the stakes get higher. And Lottie’s forced to discover what she’ll risk for love and how far she’ll go to find herself.Set against the glamorous, ruthless world of high-end Southern weddings and inspired by real events in the authors’ lives, Without a Hitch is a hilarious romp about taking ownership, facing fears, planning your ex-boyfriend’s wedding, and choosing a happy ending that wasn’t what you once expected.Praise for Without a Hitch:“Without a Hitch is a delightfully quirky novel that proves the age-old adage ‘We plan, God laughs.’ Filled with fascinating insights into the world of high-end wedding planning, you can’t help but cheer for Lottie Jones as she learns that you can’t script your life and that, sometimes, the best laid plans are the ones you never make.” —Emily Giffin, #1 New York Times bestselling author of All We Ever Wanted and The Lies that Bind“Put a ring on Without a Hitch—a sweet, Southern confection of a book about what it takes to orchestrate everyone else’s happily ever after when your own heart has been broken. This sneak peek into the world of high-end wedding planning will keep you laughing as Lottie deconstructs the fairy tale and finds her authentic self.” —Jodi Picoult, #1 New York Times bestselling author of Wish You Were Here and The Book of Two Ways“Without a Hitch is a must read. It is absolutely fabulous. As someone who works in the wedding industry, I found this book’s brevity, humor, and the glamorous over-the-top world of Southern Weddings a true joy to read. This is the book you will be gifting to all your friends!” —Mindy Weiss, bestselling author of The Wedding BookStand-alone novelBook length: 106,000 wordsIncludes discussion questions for book clubs",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Audiobook",
    "Contemporary",
    "Adult",
    "Adult Fiction"
  ],
  "author": "Mary Hollis Huddleston",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/57468137-without-a-hitch"
}