{
  "title": "When I Last Saw You",
  "description": "From USA Today Bestselling Author Bette Lee Crosby comes a powerful southern saga based on a true story… Betrayal and secrets tore her family apart decades ago, now a lonely widow must search for the pieces of her broken childhood.\nWHEN I LAST SAW YOUGEORGIA, 1968 - Margaret Rose McCutcheon has just buried her husband and must now name a beneficiary for their estate in case of her demise. She is hard-pressed to do so because there is no one. No children. No family. At least none to speak of. At one time, she had two sisters and six brothers, but the lot of them were scattered to the four winds, with no one knowing where the others went. In the hope of finding at least one of her siblings, Margaret hires a detective and sets off on a journey to uncover the truth of why the family broke apart as it did. WEST VIRGINIA, 1901 – When Eliza Hobbs gives birth to her sixth child, her husband is not there to welcome his daughter into the world. No surprise, because Martin is seldom there. He works in Charleston and returns to Coal Creek only when he has a mind to. Yes, he sends money on occasion, but seldom enough to make ends meet. Although Eliza believes each new child a blessing, he sees them as yet another responsibility on his already overloaded shoulders. When he discovers another child is on the way, he demands she get rid of it. he stops returning home and there is no more money. Left with the children, a mountainside patch of land, and a house in sorry need of repair, Eliza seeks help and turns to someone powerful enough to hold sway over Martin and force him into providing for his family. Pushed to the brink, Martin does something unforgivable and the family is forever torn apart.Now, after all these years, will Margaret be the one to find the pieces of her broken family?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Family",
    "20th Century",
    "Womens Fiction",
    "Contemporary"
  ],
  "author": "Bette Lee Crosby",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/57480989-when-i-last-saw-you"
}