{
  "title": "Zombie",
  "description": "Meet Quentin P. He is a problem for his professor father and his loving mother, though of course they do not believe the charge of sexual molestation of a minor that got him in that bit of trouble.He is a challenge for his court-appointed psychiatrist, who nonetheless is encouraged by the increasingly affirmative quality of his dreams and his openness in discussing them.He is a thoroughly sweet young man for his wealthy grandmother, who gives him more and more, and can deny him less and less.He is the most believable and thoroughly terrifying sexual psychopath and killer ever to be brought to life in fiction, as Joyce Carol Oates achieves her boldest and most brilliant triumph yet—a dazzling work of art that extends the borders of the novel into the darkest heart of the truth.What Joyce Carol Oates has done is not write about madness but write in the voice and the logic of madness itself. The horror of the novel is in the very absence of horror, as we enter the mind of a murderer who has not a trace of what we like to call conscience as he depicts the people he manipulates and the sexual savagery he perpetrates upon his victims. The terror of the novel is not that Quentin P. is so strange to us but that he is so fearfully familiar as he describes his carnal crimes with the innocent zest of delightful pleasures fondly recalled. His is a world in which he is an eternal outsider, playing a game of survival, living on his wits and wiles among strangers who only want to look the other way.Powered by the subtle enthrallment of a master storyteller with the imaginative courage to think the unthinkable, accept the unendurable, and say what has never before been said so searingly and scarily, Zombie takes its place as one of Joyce Carol Oates’ most shining achievements.",
  "genres": [
    "Horror",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery",
    "Contemporary",
    "Dark"
  ],
  "author": "Joyce Carol Oates",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/574694.Zombie"
}