{
  "title": "When Strivings Cease: Replacing the Gospel of Self-Improvement with the Gospel of Life-Transforming Grace",
  "description": "This is not a call to get busy; it’s a call to get discerning. In this hustling, image-forward age of opportunity, women are more anxious than ever. Despite all the affirming memes and self-reflections that dominate social media feeds, approval and worth often seem assigned to what we do rather than who we are. And we end up constantly feeling behind, lacking, and like we're failing--at home, at work, with friends, with God.Ruth Chou Simons knows something of feeling measured by achievement, performance, and the approval of others. As a Taiwanese immigrant growing up between two cultures, Ruth was always on a mission to prove her worth. Until she came to truly understand the one thing that changes everything: the extravagant, undeserved gift of grace from a merciful God. In When Strivings Cease, Ruth guides us all on a journey to find freedom from the never-ending quest for self-improvement. She shows us how to examine the ways we look to superficial means of acceptance and belonging, and find relief in realizing we can't be so amazing that we won't need grace; stop seeing God as someone we perform for and start finding delight in responding to God's welcome; and find relief from running the hamster wheel of relying on our own strength, our own abilities, and our own savvy--and always coming up short--by truly understanding the freedom Jesus purchased.With personal story, biblical insights, practical applications, and original artwork by Ruth, this book helps us see the truth that God's favor is the only currency we need, because in Christ we are enough.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Faith",
    "Christian Living",
    "Self Help",
    "Christian Non Fiction",
    "Christianity"
  ],
  "author": "Ruth Chou Simons",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/57468162-when-strivings-cease"
}