{
  "title": "THE MAN WHO WOULD NOT KISS WOMEN: Origin of \" EL HOMBRE QUE NO BESABA A LAS MUJERES\"",
  "description": "A psychiatrist at the peak of his career is placed in charge of therapy for a unique trio of patients whose histories are closely linked. He is told he is considered the only professional with the capacity to offer the necessary treatment.He reflects on his own life and how he came to be in his current position. Then, when he begins his assessment of the patients, he discovers something which has the potential to turn his own life upside down.The author biographyMohamed Bouzitoune was born in Nador (Morocco) 38 years ago. From early childhood he was described as gifted. By age eleven he began consistently winning literary competitions announced in the school where he studied. In 1997 his family emigrated to Spain, seeking a better future, and settled on the charming island of Mallorca. There, he was dazzled by its landscapes and people.Eager to contribute something to the island, he published a detective and mystery novel entitled \"El viaje de Rady Scott\"(Rady Scott’s Trip) , where the entire main plot takes place in the north of Mallorca, in Puerto de Pollensa.Along with the aforementioned novel, he wrote four short stories: \" El fin del mundo” (The end of the world), \" Todos los caminos conducen al Tesoro” (All roads lead to treasure)\", \" Dunia la sensible “(Dunia the sensitive)\" and \" Un novio para Samantha Gardner” (A boyfriend for Samantha Gardner).Mohamed Bouzitoune declares himself a true bibliophile as, he believes, more than anyone, that only a book can offer such wisdom.Mohamed is currently focused on the illness of his little daughter, almost four years old. Doctors have detected a cancer in her cerebellum for which she is receiving treatment , and striving, step by step, to recover.",
  "genres": [],
  "author": "Mohamed Bouzitoune",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/57488594-the-man-who-would-not-kiss-women"
}