{
  "title": "Johannes Cabal the Necromancer",
  "description": "In this uproarious and clever debut, it's time to give the Devil his due. Johannes Cabal, a brilliant scientist and notorious snob, is single-mindedly obsessed in heart and soul with raising the dead. Well, perhaps not \"soul\" . . . He hastily sold his years ago in order to learn the laws of necromancy. But now, tormented by a dark secret, he travels to the fiery pits of Hell to retrieve it. Satan, who is incredibly bored these days, proposes a little wager: Johannes has one year to persuade one hundred people to sign over their souls or he will be damned forever. To make the bet even more interesting, Satan throws in that diabolical engine of deceit, seduction, and corruption known as a \"traveling circus\" to aid in the evil bidding. What better place exists to rob poor sad saps of their souls than the traveling carnivals historically run by hucksters and legendary con men? With little time to lose, Johannes raises a motley crew from the dead and enlists his brother, Horst, a charismatic vampire (an unfortunate side effect of Johannes's early experiments with necromancy), to be the carnival's barker. On the road through the pastoral English countryside, this team of reprobates wields their black magic with masterful ease, resulting in mayhem at every turn. Johannes may have the moral conscience of anthrax, but are his tricks sinful enough to beat the Devil at his own game? You'll never guess, and that's a promise! Brilliantly written and wickedly funny, \"Johannes Cabal the Necromancer\" combines the chills and thrills of old-fashioned gothic tales like \"The Legend of Sleepy Hollow,\" the mischievous humor of \"Wicked,\" and the sophisticated charms of\" Jonathan Strange &Mr. Norrell \"and spins the Faustian legend into a fresh, irreverent, and irresistible new adventure.",
  "genres": [
    "Fantasy",
    "Horror",
    "Fiction",
    "Steampunk",
    "Humor",
    "Urban Fantasy",
    "Paranormal"
  ],
  "author": "Jonathan L. Howard",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/5750628-johannes-cabal-the-necromancer"
}