{
  "title": "Beat the Devils",
  "description": "This inventive, page-turning crime thriller with \"palpable emotional depth\" (New York Times Book Review) envisions a world in which the Red Scare never ended.USA, 1958. President Joseph McCarthy sits in the White House, elected on a wave of populist xenophobia and barely‑concealed anti‑Semitism. The country is in the firm grip of McCarthy's Hueys, a secret police force evolved from the House Un-American Activities Committee. Hollywood's sparkling vision of the American dream has been suppressed; its remaining talents forced to turn out endless anti‑communist propaganda. LAPD detective Morris Baker—a Holocaust survivor who drowns his fractured memories of the unspeakable in schnapps and work—is called to the scene of a horrific double‑homicide. The victims are John Huston, a once‑promising but now forgotten film director, and an up‑and‑coming young journalist named Walter Cronkite. Clutched in the hand of one of the dead men is a cryptic note containing the phrase “beat the devils” followed by a single name: Baker. Did the two men die in an attack fueled by better-dead-than-red sentiment, as the Hueys are quick to conclude, or were they murdered in a cover-up designed to protect—or even set in motion—a secret plot connected to Baker's past? In a country where terror grows stronger by the day, and paranoia rises unchecked, Baker is determined to find justice for two men who raised their voices in a time when free speech comes at the ultimate cost. In the course of his investigation, Baker stumbles into a conspiracy that reaches deep into the halls of power and uncovers a secret that could destroy the City of Angels—and the American ideal itself.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Thriller",
    "Alternate History",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "Josh  Weiss",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/57505820-beat-the-devils"
}