{
  "title": "The Assistants",
  "description": "In this wicked, laugh-out-loud debut novel, five miserable souls struggle to make their mark on Hollywood, the city of the soulless. Rachel Burt, starry-eyed and clueless, has left behind tiny Sugarland, Texas, and her position as Starbucks employee of the month, to pursue her dreams of becoming a screenwriter. The madness begins when she eagerly accepts a position as assistant to Victoria Rush, an aging television diva with \"a little pill-popping problem that two tours of duty at Betty Ford couldn't remedy.\"Rachel learns the ropes from Michaela Marsh, a never-say-die, plastic-surgery perfect \"midget Tai-Bo Barbie.\" Michaela has spent years (and years and years: she is -- gasp -- over thirty!) trying to break into Hollywood, which has given her a healthy respect for the casting couch; but even sleeping with her slimy agent hasn't landed her a meaty role, and the last pilot she almost got, some ten years ago, went to that little nobody, Lisa Kudrow.Jeb, who operates on pure rage, has been fired from more assistant jobs than he cares to count, and he currently teeters on the edge of insanity under Randall Blume, one of the sleaziest agents in Hollywood.Kecia Christy, a no-nonsense Pisces pining for love and addicted to Krispy Kremes, works for Travis Trask, the hottest teen heartthrob since \"that other white boy, Leo.\" More interested in smoking prizewinning pot with his bonehead buddies than in his next movie, Travis is always looking for the next good party -- until his ex-con brother shows up at the front door.Griffin's intelligence and ambition fail to shield him from endless humiliation at the hands of Johnny Treadway, a crass A-list manager with pec and cheek implants and a perpetual tan, courtesy of the Tropical Rays tanning bed he keeps in his office. Johnny takes all the credit while Griffin does all the real work, and Griffin has begun to suspect that selling his soul might not be worth that overdue promotion after all.Once a week, Rachel, Michaela, Jeb, Griffin, and Kecia meet at a dark, unhip watering hole to commiserate. Soon enough, however, the system spits them out, and they must learn to survive through sheer determination, hard-won industry savvy, and luck.At turns hilarious, poignant, and sinfully gossipy, The Assistants will keep you glued to your seat until the final page is turned.",
  "genres": [
    "Fiction",
    "Humor",
    "Chick Lit"
  ],
  "author": "Robin Lynn Williams",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/574965.The_Assistants"
}