{
  "title": "It's A Journey: The MUST-HAVE Roadmap to Successful Succession Planning",
  "description": "For owners of private and family businesses, the transition of the business to successors can be a joyful and inspiring journey that caps a lifetime of hard work and dedication and kicks off an exciting next adventure. Or it can be tumultuous and emotionally complex, and cause conflict and rifts in their most important relationships.In It's A Journey, authors Elizabeth Ledoux and Laura Chiesman share their Transition Roadmap Developer Process(TM), a relationships-first and principle-based Process that dramatically improves the odds of a successful business transfer. In fact, 100 percent of the owners who have used this Process to choose and mentor capable successors and position their companies for success have gone on to live happy and meaningful lives.It's A Journey includes multiple tools and worksheets for business owners to use as they think about and organize the many facets of their business succession journeys. Tools include transition timelines, a compass, strategy statement and unique tools to organize owner objectives and track successor development. The authors devote chapters to the six questions owners must answer to set a course for their transition journeys, the benefits of and challenges involved in more formal forms of business governance, and why, when and how to recruit professional advisors to increase the odds of transition success.The authors also lay out step-by-step actions that owners can take to: 1) Set and meet their emotional and material goals, 2) Communicate compassionately and effectively even in difficult situations, 3) Resolve dilemmas to achieve the outcomes they desire, 4) Maintain and enhance their relationships with the people they value, 5) Mentor and teach successors, and then step away, 6) Assess possible succession strategies, 7) Calculate the financial resources they need and want to live the next chapter of their lives, and 8) Create wins for themselves, their successors, families and customers.It's A Journey offers owners a completely new perspective on transferring their businesses to successors. It is a privilege to create transition plans for the ongoing success of their companies.",
  "genres": [],
  "author": "Elizabeth Ledoux",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/57502471-it-s-a-journey"
}