{
  "title": "The Dark Cabal",
  "description": "In the context of the Earth being an Enclosed Cosmological System, and there being no Outer Space, per se, it readily becomes apparent that a Transhumanistic Agenda, using fake Evolutionary Theory as its primary driver, with its subsequent viral mutational variants narrative, is governing all things in the world today. It is as though we are all living in the science fiction movies, Prometheus and Alien Covenant, by Ridley Scott, and our Ancient Alien Architect Engineers are coming back to mutate the species and exterminate as many humans as possible with Draconian genetic experimentation. Of course, the reality is that there are no Ancient Alien Architect Engineers from Outer Space and we are simply being exterminated by a network of secret society mystery school Transhumanist Technocrats who believe that Digital A.I. Driven Cosmic Consciousness and Apotheosis though secret Technological and Alchemical knowledge is their ticket to becoming Immortal Gods. We are in a Techno Spiritual War right now. New Age Techno Mysticism in the context of Astrophysics and The Heliocentric Model is the New One World Religion and saving imaginary Planet GAIA, at the expense of killing off Humanity, is the true “Great Reset”. Just look at Klaus Schwab. He is a character right out of Star Trek of Star Wars. He looks like a state official from the Galactic Empire as the Empire Strikes Back. They are merging science fiction Outer Space with their virus narrative at breakneck speed. I would not be surprised, at this point, if they stage a fake laser attack on The White House from above, like the scene from Independence Day, and claim we are under Alien Attack. Prepare for the Fake Alien Invasion soon so they can announce that their the fake virus came from fake Outer Space. Just look at how far the Mars Rover Story is being pushed by NASA. These Luciferians are salivating to announce their fake Alien Contact Story. And their imaginary Planet GAIA is all they intend to defend in this fake Galactic Empire fictional narrative. Earth’s inhabitants are being eliminated and supplanted with Human 2.0 genetically engineered hybrid machine creatures. The Ruling Elite do not need us. They are moving on to Human 2.0, their Transhumanist Satanic Wet Dream. In their eyes, “Resistance is futile.”, as if Star Trek were a nonfiction tale, and creating a Borg Mind of what will remain of the Human Species is their goal. As we all know, the vaccine is not a vaccine at all. Rather, it is a genetic",
  "genres": [],
  "author": "Gregory Garrett",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/57491910-the-dark-cabal"
}