{
  "title": "The Sybil’s Crystal",
  "description": "“The only thing you should know about us; we never give up, and we will find everyone no matter what”When people all over the land of Elysium start going missing, eight people know something wrong. All of their loved ones are going missing, so why isn't everyone searching? Our heroes know nothing, but they will find everyone and they will certainly never give up. (Or at least give it their best try)But everything changes suddenly when the young heroes stumble upon an abandoned castle. Once inside, they find an ominous-looking crystal... that glows. The characters are horribly confused and scared, “this type of magic isn't real”, or at least that's what they were told. But one misstep (quite literally) shatters the crystal. For centuries, a god-like spirit called the Sybil has been trapped inside. And with their wakening, comes an even more ominous prophecy. The new Peacekeepers are shocked, this shouldn't be happing... this can't be happening. The heroes refuse their new great responsibility, but the Sybil insists that it will uncover all secrets and mysteries. The Peacekeepers do not trust the Sybil, but it's their best shot at finding everyone. The Sybil assigns them three quests that will supposedly lead them to the answer. But before they can ask any questions about the mysterious quests, the Sybil fades away. The heroes have no choice but to complete the quests and retrieve the items. Once the Peacekeepers complete the quests, they finally piece together the puzzle pieces and uncover the horrifying truth. They have a lot more on their hands than they ever imagined, including the brink of war. The Peacekeepers now have a limited amount to set aside their differences, stop the war and save everyone before it is too late. Sounds easy enough, right? Let's hope they don't mess it up. We are all counting on you, no pressure.",
  "genres": [],
  "author": "Ceci Funez",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/57506770-the-sybil-s-crystal"
}