{
  "title": "Drop Acid: The Surprising New Science of Uric Acid―The Key to Losing Weight, Controlling Blood Sugar, and Achieving Extraordinary Health",
  "description": "THE NEW YORK TIMES BESTSELLERUnlock the secret to extraordinary health by reducing high uric acid levels—the hidden risk you didn't know you had—by the author of Grain Brain and Brain Wash.What do obesity, insulin resistance, diabetes, fatty liver disease, hypertension, cardiovascular disease, stroke, neurological disorders, and premature death have in common? All can be stoked by high uric acid levels. Our most respected scientific literature is bursting with evidence that elevated uric acid levels lie at the root of many pervasive health conditions, but mainstream medicine for the most part remains unaware of this connection. This is especially alarming because a large number of Americans don’t know they are suffering from increased levels, putting them at risk for developing or exacerbating potentially life-threatening illnesses. Offering an engaging blend of science and practical advice, Drop Acid exposes the deadly truth about uric acid and teaches invaluable strategies to manage its levels, including how to:Reduce fructose and foods high in “purines” through simple dietary edits Lower uric acid levels through natural hacks like consuming tart cherries, vitamin C, quercetin, and coffeeIdentify common pharmaceuticals that threaten to increase uric acidImplement lifestyle interventions, like restorative sleep and exerciseEasily test your uric acid levels at home—a test routinely performed in your doctor’s office during regular check-ups but typically ignoredFeaturing the groundbreaking “LUV” (Lower Uric Values) diet, 35 delicious recipes, self-assessment quizzes, and a 21-day program for dropping levels, Drop Acid empowers readers with the information they need to address this hidden danger and live longer, leaner, and healthier lives.",
  "genres": [
    "Health",
    "Nonfiction",
    "Nutrition",
    "Science",
    "Food",
    "Audiobook",
    "Medicine"
  ],
  "author": "David Perlmutter",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/57505860-drop-acid"
}