{
  "title": "Muscle and Bone",
  "description": "You belong to me and I know it down deep, in muscle and bone, where my wolf lives. Avery Rhine isn’t an average homicide detective with the Chicago PD. In fact, Avery isn’t an average anything. Sure, as an omega he knows he’s at the bottom of the food chain, but that’s never slowed him down. He’s got a great life, complete with a loving family and a best friend who’d take a bullet for him, so what more could he possibly want or need? Except, maybe, for the world to change. And to find someone to spend more than one night with, but that isn’t high on his list of priorities. He’s never been one to believe in destiny or whatever else the fantasies sell about there being someone special out there meant just for him. Then a chance encounter at a party changes everything.  Graeme Davenport has no delusions about finding his true mate. The consensus is that if an alpha doesn’t find their other half by the time they’re thirty, the chances of it ever happening go from slim to none. He’s not a mere alpha, though; Graeme is a cyne who sits at the pinnacle of lupine hierarchy, so he’s obligated by tradition and duty to choose an omega now, sign a contract, and bond with him. Love is not part of the equation. When Graeme and Avery meet, their fierce attraction to each other flies in the face of reason and logic. Avery’s intense physical reaction to the alpha is something he’s never experienced before, while Graeme, who has always been the soul of discretion, loses all his inhibitions to desire for the man he wants to possess. They are two very different men trying to navigate expectations, separate reason from innate primal drive, and do it while working together to solve a murder. It will take everything they are to find a middle ground, and to learn to trust in a fated kind of love.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Omegaverse",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Mary Calmes",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/57511879-muscle-and-bone"
}