{
  "title": "The Marriage Lie",
  "description": "Fourteen years ago Stella did something she has regretted ever since. But she did it for her daughter. Now, that mistake could mean she loses her precious girl forever… Stella follows her handsome husband Rob to the beautifully laid-out table in the restaurant he’s chosen specially for her fortieth birthday lunch. As the waiter pops the champagne, Rob proposes a toast and their crystal glasses clink together in celebration. Stella knows how they must look to anyone watching. Two people very much in love, with the perfect marriage and the perfect life. But Rob is about to drop a bombshell on Stella. He wants a divorce. If she doesn’t agree to his plan – to sell the house, divide the money and award him full custody of fourteen-year-old Georgie – he will tell their innocent daughter the one secret he promised to keep and that Stella has worked so hard to protect her from. Stella has a choice to make. To fight for her daughter, there is only one person she can turn to for help. A woman she hasn’t spoken to in over a decade. But to do it means facing up to her biggest regret, and risks losing Georgie forever, once she learns the truth… An absolutely heart-breaking and gripping novel about the price of keeping a secret. Fans of Amanda Prowse, Kate Hewitt and Susan Lewis will be gripped by this emotional family drama from the very first page. ‘ You’ve got to read this \"on the edge of your seat\" novel … Absolutely fantastic … It’s like one of those tea-cup rides at the amusement park… you end up with bruises after being slammed from side to side as it whirls you all over the place… But you still smile and say the ride was awesome!… Will make you smile, yell out in frustration and gasp in disbelief … There’s so much going on in this spectacular book… A must read .’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘Ali Mercer is one of my favourite authors, she writes with such tenderness yet is also able to shock in an instant . This is another excellent sorry of those who aren’t what they seem and the lengths we might go to protect those we love. A real thrill ride that I thoroughly enjoyed .’ NetGalley reviewer, ⭐⭐⭐⭐⭐‘ Will pull you in, and you will not want to put it down … This book about the importance of relationships within a family will keep you guessing until the end .’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘ I mean really... how could you not get hooked in the first chapter … Ali Mercer takes the concept of marriage and throws in every possible monkey wrench you could think of… Keeps you intrigued throughout the entire book and has you thinking that not one character is innocent… I highly recommend you read this book to find out this and so much more!!! ’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘ I love a book that keeps you guessing until the end . Ali Mercer did a fantastic job… LOVED it! ’ Two Girls and a Book Obsession , ⭐⭐⭐⭐⭐‘I would wholeheartedly recommend this novel to all… Heartbreaking but also uplifting at the same time . How is that possible? I guess you will just have to read it to find out!’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘ A huge twist that I definitely didn't see coming … Spectacular… Great plot that keeps you guessing throughout and lots to think about.’ Bobs and Books ‘ An excellent and emotional drama . I loved its characters. All were awesome.’ NetGalley reviewer, ⭐⭐⭐⭐⭐‘A textured and satisfying family drama … Highly believable and very finely observed… Uplifting and deeply humane. An excellent read .’ Goodreads reviewer",
  "genres": [
    "Contemporary",
    "Fiction"
  ],
  "author": "Ali  Mercer",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/57510952-the-marriage-lie"
}