{
  "title": "Save Me",
  "description": "From USA Today bestselling author Stacey Kennedy comes a captivating romance set in the exclusive world of the Phoenix club, where sizzling fantasies become reality...Reporter Hazel Rose has a new assignment: locate the masked man in the photograph taken at the Phoenix sex club and snag an interview with him. The only problem? Shy Hazel already knows all about the club… and the man in the photo. He’s her new roommate, Kieran Black. But there's no way Hazel would ever reveal his identity to the world, nor could she ever talk to Kieran about a secret sex club. His smile alone makes her blush. And after being beaten down by an emotionally cruel ex-boyfriend, Hazel has never really regained her self-confidence.Kieran loves his sex dirty and his relationships brief. A child of a terrible divorce, Kieran has never seen the point in commitment. But suddenly, all his of best friends are getting married, and he's beginning to realize how empty his life is. As Kieran and Hazel are both forced to attend wedding celebrations, he starts to learn more about his quiet roommate. When she explains her past struggles with relationships, he offers her a trade. He'll fulfill all of her wildest sexual fantasies if she'll help him understand how to be the type of partner a woman wants in a relationship.Hazel knows this sizzling fantasy with Kieran isn't supposed to last, but she quickly finds herself falling for the sweet, caring Kieran who is much better at relationships than he believes. But when life throws a wrench into their no-strings-attached arrangement, Hazel and Kieran must decide if they’re both willing to overcome their past heartaches and find a way forward… together.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "BDSM",
    "Contemporary",
    "Erotica",
    "Friends To Lovers",
    "Erotic Romance"
  ],
  "author": "Stacey Kennedy",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/57525446-save-me"
}