{
  "title": "Rumors",
  "description": "What’s a girl to do when there’s no revenge to be had? Hey b*tches, my name’s Kiera. You might know me as The Cat, infamous cat burglar/thief. No? Well, let me give you a little insight into my life over the last year and a half. I was going about, doing my own thing when my entire life got flipped upside down. Alongside my little assassin, we were able to help The Aces MC with a little problem with a rival MC. Easy peasy, right? Wrong. Somehow though, I found myself falling for the club’s president, his suspicious enforcer, and the VP… who just so happens to also be my asshole stepbrother. The Alloy Kings MC didn’t stand a chance but they weren’t alone. Backed by my bastard father and his mob of minions, we had a hell of a fight. Sound like fun to you? Ha, yeah, I didn’t think so. But in the end, we came out mostly unscathed. Six months later, I finally decided that was enough laying low. But I find myself surrounded by rumors, and I can’t let them lie when there’s so much to lose now. Can we figure out who's watching us before it’s too late, or will we end up getting blindsided? But I’m not the thief who became famous at 15 years old and survived the mob’s hell in my past just to lay down and get surprised in my own damned house. Again. Those f*ckers won’t know what hit them. I’m The Cat, and soon enough, they’ll learn that this is just the beginning. Book 1 of The Cat’s Series The Cat’s Crew Series is a second trilogy following Kiera and her men. It is highly recommended to read The Aces Series before this series. Both series are a WhyChoose/Reverse Harem trilogy featuring MMFMM meaning the female main character doesn't have to choose between her love interests. Please note, some scenes may contain M/M contact. This book contains references involving PTSD, sexual assault recollections, abuse, and other themes that some readers may find triggering.",
  "genres": [
    "Reverse Harem",
    "Contemporary"
  ],
  "author": "A.J. Macey",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/57530012-rumors"
}