{
  "title": "Secrets of Magpie Cove",
  "description": "Lila had a favourite rock to sit on towards the back of the cove, where she often ate her breakfast, gazing out at the tumbling Cornish sea. As the sun rose that morning, Lila wished with all her heart that the grey-green waves could wash away her old life. That Magpie Cove would help her move on, and to forget…When aspiring pastry chef Lila Bridges flees her life in the city after a heartbreaking tragedy, she finds herself working behind the counter at Magpie Cove’s most beloved local establishment – Serafina’s Café. The sweet, buttery aroma of freshly baked chocolate croissants, the cheerful gossip of the regulars and the elderly owner Serafina’s feisty humour are a much-needed balm to Lila’s broken heart. For the first time since it happened, Lila is beginning to laugh again…But when Serafina unexpectedly passes away, the future of the café looks bleak. Nathan Da Costa, Serafina’s estranged son, inherits, and returns to Magpie Cove determined to inject some big-city glamour into the place. To Lila, it seems impossible that dour, money-obsessed Nathan could be related to dear Serafina. He may have his mother’s mop of curly dark hair and deep brown eyes, but he has none of her warmth or heart.Lila needs this job and the sense of peace the town has brought her, so she’s determined to make it work with Nathan as her new boss. But her resolution is tested when the secret Lila has been keeping about what brought her to the cove begins to unravel, just as she discovers an unexpected, sweeter side to Nathan. Will trusting Nathan Da Costa with her long-held secret be Lila’s new beginning in Magpie Cove, or her emotional undoing?Be totally transported to the windswept beaches of Cornwall with this heart-warming and unputdownable story that will leave a huge smile on your face. Perfect for fans of Shari Low, Veronica Henry and Heidi Swain.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Womens Fiction"
  ],
  "author": "Kennedy Kerr",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/57511781-secrets-of-magpie-cove"
}