{
  "title": "Piercing Light",
  "description": "The Grove. The Intruders. The Anointed.My true name is Xi’an—Creator, sister of Xi’tan and Xi’li, and the protector and embodiment of Beauty. I’ve lived thousands of times, each existence ending in a war that destroyed the entire universe. This has been, by far, the worst lifetime...and it just keeps getting worse.I was just fine, living out my days in a little grove of my own making. There, I could avoid messy interactions with people and bide my time until the next war came. I had everything I needed, even a friend. Sounds nice, right?Well, it was until three intruders showed up, claiming they were merely doing their jobs. The job? To destroy my home because some lunatic calling himself The Anointed decided it. Ridiculous name, I know, but the threat he poses can’t be ignored. This is the reason we aren’t supposed to pull away from the civilizations on our planets, and my little rule-bending stunt has come back to bite me in my rear.Now, I’m stuck righting my wrongs, which means traveling to the city and finding a way to put a stop to the insanity that will destroy my planet. Shouldn’t take too long, then I can return home and wait for the signs of the real war. Except, I’m beginning to think that the embodiment of Chaos must have died a true death, and it attached itself to me. The Anointed is in hiding, I’m starting to actually like these three men, and I seem to piss everyone off. Ah, well, I suppose there’s a beauty in chaos, so I might as well enjoy it.****************Piercing Light is the first in a reverse harem fantasy series that is connected to the universe of The Anomaly series. While you do not need to read The Anomaly series first to understand this story, it is best if this is read after reading The Anomaly series to avoid major spoilers for The Anomaly series. The Unruly series will focus on Xi’an, Everly/Xi’li’s sister. Our heroine will not pick between her men, and this book does contain mature themes. It is not recommended for those under the age of 18.",
  "genres": [
    "Reverse Harem",
    "Fantasy"
  ],
  "author": "Aster North",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/57528194-piercing-light"
}