{
  "title": "Field Guide to White Supremacy",
  "description": "Drawing explicit lines, across time and a broad spectrum of violent acts, to provide the definitive field guide for understanding and opposing white supremacy in America Hate, racial violence, exclusion, and racist laws receive breathless media coverage, but such attention focuses on distinct events that gain our attention for twenty-four hours. The events are presented as episodic one-offs, unfortunate but uncanny exceptions perpetrated by lone wolves, extremists, or individuals suffering from mental illness—and then the news cycle moves on. If we turn to scholars and historians for background and answers, we often find their knowledge siloed in distinct academic subfields, rarely connecting current events with legal histories, nativist insurgencies, or centuries of misogynist, anti-Black, anti-Latino, anti-Asian, and xenophobic violence. But recent hateful actions are deeply connected to the past—joined not only by common perpetrators, but by the vast complex of systems, histories, ideologies, and personal beliefs that comprise white supremacy in the United States. Gathering together a cohort of researchers and writers, A Field Guide to White Supremacy provides much-needed connections between violence present and past. This book illuminates the career of white supremacist and patriarchal violence in the United States, ranging across time and impacted groups in order to provide a working volume for those who wish to recognize, understand, name, and oppose that violence. The Field Guide is meant as an urgent resource for journalists, activists, policymakers, and citizens, illuminating common threads in white supremacist actions at every scale, from hate crimes and mass attacks to policy and law. Covering immigration, antisemitism, gendered violence, lynching, and organized domestic terrorism, the authors reveal white supremacy as a motivating force in manifold parts of American life. The book also offers a sampling of some of the most recent scholarship in this area in order to spark broader conversations between journalists and their readers, teachers and their students, and activists and their communities. A Field Guide to White Supremacy will be an indispensable resource in paving the way for politics of alliance in resistance and renewal.",
  "genres": [
    "History",
    "Race",
    "Politics",
    "Nonfiction",
    "American History",
    "The United States Of America"
  ],
  "author": "Kathleen Belew",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/57527382-field-guide-to-white-supremacy"
}