{
  "title": "Blessedly Bound",
  "description": "Over 100 positive reviews.“I am unable to put to words how AMAZING this was!!” Amazon customer“I guarantee you will be hooked on this author for life.” Amazon customer“From the very first sentence you know that Blessedly Bound is going to be like nothing you have ever read.” Amazon customer“Truly a series worth owning and revisiting time and time again.” Amazon customer“It is rare that you find a book that captivates you so completely from the first page until the last but Blessedly Bound is my new favorite for witchy and supernatural beings. From the onset you are swept up into a story that tugs on the heartstrings as much as it captivates you.” Amazon customer“The Elemental Witch Trials novels are the most spell-binding and incredible stories I have read in a long while. For someone who favors reading about witches I cannot give it enough praise and I cannot wait for the next one of Lucretia Stanhope's continuation of these great novels.” Amazon customer“This book was captivating and beautiful. I felt for the characters and almost cried at the ending. It was intelligent, thought provoking and for those who follow paganism it twas beautiful.” Amazon customerDark Secrets. Bound Magic. A Determined Witch.Elemental witch, Gwen Hensley, wants answers. Why was her grandmother burned alive? Was it because she was witch? Did it have something to do the with the dark secrets of the family that orphaned her? Those answers won’t come easy and time is ticking.Behind the smiling faces of the locals lies a killer whose sights are set on her. Is it one of the friendly shopkeepers? The mysterious neighbor she’s drawn to? Or is someone closer to her behind the gruesome murder? None appear capable of such evil. With the target on her, she can’t be wrong. How will she decide who she can trust?",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Romance",
    "Witches",
    "Fiction",
    "Young Adult",
    "Magic"
  ],
  "author": "Lucretia Stanhope",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/57536890-blessedly-bound"
}