{
  "title": "Think it. Pitch it. Sell it.",
  "description": "BOOK BLURB This inspiring semi-autobiographical business book knits a powerful sales strategy and marketing techniques with an emotive thought-provoking narrative and a beautiful storyline.If you are looking for a feel-good book to help you actualise your business potential and generate sales, then look no further. Written by Sales & Marketing expert Pierre Coombes (As seen on BBC1, in High Profile Magazine and the Evening Standard) Entrepreneur, founder of award-winning B2B Lead generation group; Big Wolf Marketing.This ‘fail to sale’ story will not disappoint. With travel, opulence, money, and romance, it encapsulates something for every reader. Learn how to ‘Think it, Pitch it, Sell it. With scripts, original techniques (including The Coombes Sales Strategy, The SSS Combination, and 2F1 Thinking) and tricks, the advice in this book will give you the tools you need to succeed. ABOUT THE AUTHORPierre Coombes is one of the UK’s foremost experts on Sales & Marketing, having worked with 100s of companies worldwide across a multitude of different business sectors in the last decade. Pierre’s passion for business has taken him all over, talking at colleges, universities, and leading industry events.WHAT IS THE BOOK ABOUT?ts not just your basic sales book, it teaches selling but its so much more.The book is written in the style of a story wraps real-life sales & marketing experience with motivating advice. The powerful life lessons and inspiring concepts will move you. whether you are an entrepreneur looking to start a business or you are in sales and marketing, this book with give you strategies and tools to create results. THE STORYLINEThe story follows failing techie John, who reaches out to author sales expert Pierre. With his support and practice advice john changes his fortune around, building a thriving tech business. The story has it all, travel, luxury, sales, and business strategy and so much more. WHO WILL ENJOY ITif to love the 5am club, 4 hour work week, The 10x rule and similar sales, entrepreneurial and lifestyle books then you will love Think it. Pitch it. Sell it.WHAT READERS THINK‘Wow, I love it! Sales and marketing tips mixed into a really lovely story’ – Jessica Mendes‘Best book I’ve read in the last few years on selling, I’ll be reading again and again’ – Max tevernikle YOU WILL LEARN / WHATS IN THE BOOK-Sales scripts-Marketing techniques-Learn about sales funnels. -Digital Marketing overview-Objection handling -Learn how to get through the gatekeeper.-Team managementKeywords: sales, selling, telemarketing, telesales, marketing, digital marketing, self-help, entrepreneurial, marketer, business, how to.",
  "genres": [
    "Business"
  ],
  "author": "Pierre Coombes",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/57543256-think-it-pitch-it-sell-it"
}