{
  "title": "A Turtle's Adventures",
  "description": "Shelly the Leatherback Sea TurtleHad a shell that was painted purpleBy a little girl named Lisa MayOn a sandy beach at Matura BayShelly, an endangered leatherback sea turtle, the largest of all living turtles, returns to Matura, her hatching beach in the Republic of Trinidad and Tobago.Learn about the threats she faces, as she shares the exciting stories of her adventures, in this beautifully illustrated rhyming story for ages 4+.A Turtle's Adventures won a 2021 Purple Dragonfly Book Award (Honorable Mention for Excellence in Children's Picture Books - Ages 6 and Older).Reviewed by Emily-Jane Hills Orford for Readers' Favorite - 5 StarsShelly is a leatherback sea turtle. She was born on the beach of Matura Bay in Trinidad, the twelfth hatchling of ninety-five. Imagine having over ninety siblings! As a young turtle, she was rescued by a mysterious stranger from certain death. Saved, she lived a long life, traveling the underwater world from the Caribbean to Africa and back. She has lots of adventures to share and advice too about recycling and not discarding the plastic bags that endanger so many sea creatures, including the leatherback sea turtles.Wayne Gerard Trotman’s picture book story, A Turtle’s Adventures, is a clever story about sea life, following the travelogue shared by one special leatherback sea turtle named Shelly. Told in rhyming verse in a conversational tone between an unknown person asking Shelly about her story and, of course, Shelly regaling her tale, and with beautiful, bright colorful illustrations, this lyrical story will both entertain and educate young readers about sea life, ecology, the importance of recycling and so much more. Through Shelly’s sharing of her adventures, young readers will learn all about leatherback sea turtles, how they learn to swim, how they evade capture from bigger predators like whales and more. I love the way the author changes course. After describing a near-miss whale attack, he shares Shelly’s most dangerous enemy: plastic. “Although whales and sharks can break my shell/ Plastic bags are more dangerous where I dwell/ They look a lot like my favorite jellyfish/ But, plastic rubbish is the deadliest dish.” A compelling comparison that will hit home with its message. Overall, a beautiful story told with care and compassion and lots of interesting tidbits about leatherback sea turtles.",
  "genres": [],
  "author": "Wayne Gerard Trotman",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/57556754-a-turtle-s-adventures"
}