{
  "title": "The Poem of the Man-God",
  "description": "The Poem of the Man God (Italian Il Poema dell'Uomo-Dio) is a multi volume book of about four thousand pages on the life of Jesus Christ written by Italian mystic Maria Valtorta. The books were first published in Italian in 1956 and has since been translated into 10 languages. The books are based on over 15,000 handwritten pages produced by Maria Valtorta from 1943-1947. During these years she reported visions of Jesus and Mary and claimed personal conversations with Jesus. Since 1993 the Vatican has remained silent ok. Maria Valtorta was bed ridden in Viareggio Italy for most of her life due to complications from being struck in the back while walking down a street. On Good Friday 1943 she reported a vision in which Jesus appeared and spoke to her. She reported many visions and conversations with Jesus and Saint Mary and said Jesus had asked her to record her visions in writing. She continued to write her visions in her notebooks until 1947 The handwritten pages were surprising to her priest and others in that they included no overwrites, corrections or revisions and seemed like dictations. The fact that she often suffered from heart and lung ailments during the period of the visions made the natural flow of the text even more unusual. Some readers were struck by the fact that the sentences attributed to Jesus in the visions had a distinct and recognizable tone and style that was different from the rest of the text. Most of the episodes have a uniform format and structure. Valtorta first describes a scene, often with picturesque details of the background, the trees, the mountains and the weather conditions on that day in the Holy Land. For instance, her prelude to the Sermon on the Mount written on May 22, 1945 depicts the road on which Jesus is walking, states that it was a clear day on which Mount Hermon could be seen by Jesus but Lake Merom could not be seen. In some episodes she mentions the colors of the clothing worn by Jesus or the Apostles",
  "genres": [
    "Spirituality",
    "Religion",
    "Catholic"
  ],
  "author": "Maria Valtorta",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/575566.The_Poem_of_the_Man_God"
}