{
  "title": "How It Has to Be",
  "description": "Mercy. This was a word Brick Bane had never understood until his brother spared his life three weeks ago. As bear shifter with a failed mission, he’s watching his brother’s every move to try and discover what has changed him so much. The only thing that makes sense? The girl his brother has broken the rules with. There’s a waitress in town who is paying a little too much attention to Brick, and now he’s wondering why she’s calling so strongly to him. The rules are simple: Never touch a human’s skin, never fall for a woman, and never, ever let a human find out what he is. But this beguiling creature is slowly making him want to break the rules of the Oath of Bane too. The only problem? The consequence is complete annihilation…for both of them.Trinity is just trying to get her head above water right now, but when a big, burly, sexy-as-fire mountain man starts frequenting her restaurant, she can’t help but be distracted. He’s rough around the edges, and blunt, and has these crazy rules, but he’s also protective, and kind to her in surprising moments. After the year she’s had, she sure could use the feeling of safety he provides. The issue with that? Brick Bane’s life is anything but safe. There’s a big bad bear in the woods hunting them, and the crows in the sky say something is very, very wrong. She has two options. One, go back to the safe life, or two, stand beside Brick and weather the storm that is barreling toward them.Destiny is coming for the Bane brothers, and Trinity is determined not to let Brick hide from it any longer. Only her love can awaken the monster.Don’t miss this exciting second installment in T. S. Joyce’s bestselling Oath of Bane novella series.Content Warning: Explicit love scenes, naughty language, and piles of sexy shifter secrets. Intended for mature audiences.",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Supernatural",
    "Urban Fantasy"
  ],
  "author": "T.S. Joyce",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/57540433-how-it-has-to-be"
}