{
  "title": "Ike: An American Hero",
  "description": "A big, ambitious, and enthralling new biography of Dwight D. Eisenhower, full of fascinating details and anecdotes, which places particular emphasis on his brilliant generalship and leadership in World War Two, and provides, with the advantage of hindsight, a far more acute analysis of his character and personality than any that has previously been available, reaching the conclusion that he was perhaps America's greatest general and one of America's best presidents, a man who won the war and thereafter kept the peace.Ike starts with the story of D–Day, the most critical moment in America's history. It was Hitler's last chance to win the war –– he had the means to destroy the troops on the beaches, but he failed to react quickly enough. The one man who would have reacted quickly and decisively had he been on the spot, Field Marshal Erwin Rommel, was home on leave and didn't arrive back at his headquarters until it was too late. It was Ike's plan, Ike's decision, Ike's responsibility. He alone, among all the Allied generals, could win or lose the war in one day, and knew it.But of course there is more to this book than military history. It is a full biography of a remarkable man, ambitious, a late starter, a brilliant leader of men and perhaps the only American general who could command such a difficult coalition, and win the respect of not only his own soldiers, but also those of Great Britain and France, and lead them to a triumphant victory.It is also the story of a remarkable family. Ike grew up in Abilene, Kansas, and the Eisenhowers were Mennonites, who, like the Amish, were deeply committed pacifists, so it is ironic that he went to West Point and became a general, to his mother's horror. It is as well the portrait of a tumultuous and often difficult marriage, for Mamie was every bit as stubborn and forceful as her husband, and it was by no means the sunny, happy marriage that Republican publicists presented to the public when Ike made his first moves towards the presidency.Indeed, behind Ike's big grin and the easy–going, affable personality he liked to project was a very different man, fiercely ambitious, hot–tempered, shrewd, and tightly wound. He was a perfectionist for whom duty always came first, and a man of immense ability. In 1941 he was a soldier who was still an unknown and recently promoted colonel, and just two years later he was a four–star general who had commanded the biggest and most successful amphibious operation in history –– TORCH, the Anglo–American invasion of North Africa. He commanded respect and was dealt as an equal with such world figures as President Roosevelt, Winston Churchill, and Charles De Gaulle.",
  "genres": [
    "Biography",
    "History",
    "Presidents",
    "Nonfiction",
    "World War II",
    "Politics",
    "American History"
  ],
  "author": "Michael Korda",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/575506.Ike"
}