{
  "title": "Stolen Threadwitch Bride",
  "description": "Note from the publisher: this version of Stolen Threadwitch Bride has been unpublished. The new version is here: https://www.goodreads.com/book/show/6... The new version has been fully updated and a significant amount of text added, including scenes of an adult nature that weren't in the first edition, therefore reviews under the original may no longer be relevant. ~~~True names hold power. Fae cannot lie. And the women they steal become their brides.When threadwitch Ariadne is taken by a fae lord as part of a centuries-old bargain, she expects to marry him whether she likes it or not. But, desperate to return home, she won’t give in easily. Even if Lysander claims he doesn’t want her hand in marriage but for its skill with needle and the threads of magic, everyone knows the fae are not to be trusted.Plotting her escape, she sews spells into cloth and tries her hardest to ignore his charms as well as the fae realm’s equally alluring beauty.But she soon discovers his world is as dangerous as it is beautiful. With dark creatures in the forest and enemies who wear friendship as a mask, Ariadne must make every stitch perfect if she wants to not only escape but also keep Lysander alive. Which, it turns out, is something she wants far more than she ever expected.If you love feisty heroines, enemies-to-lovers romance, and arrogant fae lords with hearts of (mostly) gold, you’ll love this new adult fantasy romance that’s perfect for fans of Holly Black and Sarah J Maas.This is the sixth installment of STOLEN BRIDES OF THE FAE, a series of stand-alone short novels written by various romantic fantasy authors who share a passion for fantastical love stories.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fae",
    "Fantasy Romance",
    "Romantasy",
    "Magic",
    "Enemies To Lovers"
  ],
  "author": "Clare Sager",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/57534423-stolen-threadwitch-bride"
}