{
  "title": "ALL KAAL NONE, SAC OF SURPÄS - Part 1",
  "description": "Blurb – All KAAL NONE series Unfold the mystery of creation while discoursing with an alien. Four timelines, four planets, with a mystical backdrop on another, interlinked across many galaxies of our expansive Universe. A love triangle between an engineered reptilian being, a fairy, and a demon. Dive into the depths of human emotions characterized in the current, dystopian, and advanced eon. Tangled in the middle of the unrequited devotion of menacing darkness and forbidden passion of endless desire, an embodiment of The Destroyer. Assigned with the divine purpose and riveted by the mystery of his own identity. Navigating through life was a challenge for sure. One that The Supreme One thrives on. The otherworldly trotters of the Wormhole decorate this cosmic epic with their ethereal aura. The Trinity, Holy-River, Surpäs, Mercreatures, Discerns, and their hybrids. The Churning of the Milky Way is the cause of it all! A redemptive battle with the immortal Demon King concludes the Saga of the unintended gift of eternity. The time between All and None is an accumulation of memory at play. Made of experiences, thoughts, and ideas of artificial intelligence and native capabilities. Who knows, in the end, it might just be an illusion.Disclaimer Thank You, for picking my book for your reading! I realize the endless choices out there. I hope you will enjoy my book. Please be sure to leave a review. It helps independent authors like me, immensely.The series All Kaal None is a trilogy, not a standalone novel. SAC OF SURPÄS is the first book of this series. The other two have also been released and are available on Amazon as e-book and paperback. Refer to the Back Matter section 'Other Books In This Series' for a blurb on them towards the end. Refer to the Back Matter sections 'References' & 'Character Timeline' to better understand this book. This book has a radical take on the human world. If you are sensitive towards feminism, liberalism, and other societal norms, please read this book with an open mind. It is all inclusive and converges every topic beautifully by the end of the series. Part 1 – ALL KAAL NONE - SAC OF SURPÄSThis book is the first one from the Trilogy ALL KAAL NONE.  The continuous cycle of life and death on Earth, Dyáuṣ, and Pitṛ́. Infinite parallel possibilities & timelines with an endless archive of memories. The balance between seminal and synthetic.  Purified Supreme Ekluvya Eckhart and the first engineered reptilian being Royer DeSlayer – Ruthless assassins with contrasting outer persona. Subservience makes them accept an unholy union. But the cosmos pushes them to defy that commitment. Ensnared in the thrill of passion and obsession. Unwavering to their assigned purpose – Slaying the immortal demons. Clouded by Surpäs command, they continue to support The Trinity. ZeeSham ParAsher, the cursed embodiment of The Destroyer, struggles to balance saddling emotions and higher learnings. Promised to a Demon but then desiring to be with a human. Defying the divinity by time-traveling, discounting the powerful by breaking his promise, and exercising his innate power to view the future. These were his approaches to mock The Trinity.",
  "genres": [],
  "author": "P.B. Flower",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/57535465-all-kaal-none-sac-of-surp-s---part-1"
}