{
  "title": "Faucian Bargain: The Most Powerful and Dangerous Bureaucrat in American History",
  "description": "#1 Wall Street Journal Bestseller As seen on Tucker Carlson Tonight As heard on Glenn Beck and Mark Levin “In his famous Farewell Address, President Eisenhower warned about allowing public policy to become captive to a scientific elite without regard to the principles of our constitutional system and the goals of a free society. Eisenhower was prescient. During the COVID crisis, states like New York that embraced unadulterated Faucism saw poor results across the board, while states that pursued an Eisenhower-style approach like Florida protected freedom and performed better in education, economy and health outcomes. Executives are elected to lead and make tough decisions, and such leadership cannot be outsourced to health bureaucrats like Fauci.” —Florida Governor Ron DeSantis “In this important book the authors do the job our uninquisitive media has failed to do throughout this ordeal. Confirming with cited and sourced details the enemy of both liberty and logic the lockdowns have proven to be. Which also proves too much power in the hands of an unelected bureaucrat, regardless of his intentions, can no longer be our new normal.” —U.S. Senator Rand Paul (R-KY) Can liberty survive in the hands of one all-powerful, unchallenged, and unelected bureaucrat? It wasn’t too long ago that the average American didn’t know who Anthony Fauci was. Now, after the coronavirus has spread nationwide, he’s arguably the most powerful bureaucrat in American history. But is it dangerous for a free society to concentrate so much power in the hands of an unelected official? Who or what holds Fauci accountable? “Steve Deace is a true patriot whose zeal for liberty is undeniable. Every day, Steve walks the walk when it comes to fighting for Americans' fundamental rights. This book is written with a keen understanding of the pain and devastation we've all seen throughout this pandemic. Throughout, Steve's passion for protecting Americans' freedoms is ever-present.” —U.S. Senator Ted Cruz (TX) “This is an important book, to both get answers to how we got here and to help us never succumb to something like this ever again. Permitting unelected bureaucrats to hold this much power indefinitely doesn't end well.” —Mark Levin, New York Times best-selling author and talk show host “In their typical fashion, Steve Deace and Todd Erzen spare no expense in pursuit of truth. We’ve been told a lot of things during this pandemic, and a lot of them contradict each other. This book uses documented data and sources to cut through the clutter, most of it Fauci’s, and bring us to a place of reason and science.” —Glenn Beck, New York Times bestselling author and Radio Hall of Fame broadcaster",
  "genres": [
    "Nonfiction",
    "Politics",
    "Government",
    "Health",
    "History",
    "21st Century",
    "Science"
  ],
  "author": "Steve Deace",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/57547241-faucian-bargain"
}