{
  "title": "The Djinn Waits a Hundred Years",
  "description": "A New York Times Book Review Editor's Choice\nRebecca meets The House of Spirits in this sweeping, gorgeously atmospheric novel about a ruined mansion by the sea, the djinn that haunts it, and a curious girl who unearths the tragedy that happened there a hundred years previousAkbar Manzil was once a grand estate off the coast of South Africa. Now, nearly a century since it was built, it stands in ruins: an isolated boardinghouse for misfits, seeking to forget their pasts and disappear into the mansions dark corridors.Until Sana. She and her father are the latest of Akbar Manzil’s long list of tenants, seeking a new home after suffering painful loss. Unlike the others, who choose not to look too closely at the mansion’s unsettling qualities—the strange assortment of bones in the overgrown garden, the mysterious figure seen to move sometimes at night—she is curious and questioning and finds herself irresistibly drawn to the history of the mansion. To the eerie and forgotten East Wing, home to a clutter of broken and abandoned objects—and to the locked door at its end, unopened for decades.Behind the door is a bedroom frozen in time, with faded photographs of a couple in love and a worn diary that whispers of a dark past: the long-forgotten story of a young woman named Meena, the original owner’s second wife, who died there tragically a hundred years ago. Watching Sana from the room’s shadows is a grieving djinn, an invisible spirit who once loved Meena and has haunted the mansion since her mysterious death. Obsessed with Meena’s story, and unaware of the creature that follows her, Sana digs into the past like fingers into a wound, awakening the memories of the house itself—and dredging up old and terrible secrets that will change the lives of everyone living and dead at Akbar Manzil.Sublime, heart-wrenching, and lyrically stunning, The Djinn Waits a Hundred Years is a haunting, a love story, and a mystery, all twined beautifully into one young girl’s search for belonging.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Fiction",
    "Horror",
    "Magical Realism",
    "Gothic",
    "Mystery"
  ],
  "author": "Shubnum Khan",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/127464148-the-djinn-waits-a-hundred-years"
}