{
  "title": "With You Forever",
  "description": "Cozy up for a heartfelt, humorous, sizzling slow-burn in this marriage of convenience romance about finding love—and home—in the most unlikely of places.AxelRooney Sullivan is sunshine incarnate. Warm, bright, always smiling, she’s everything I’m not and the last person I have any business desiring. Desperate to hide a hopeless attraction, I’ve done everything possible to keep my distance...until a charades game gone wrong brought that to a grinding halt.Since then, steering clear of Rooney has been impossible. In a matter of months, she’s kissed me speechless, commandeered my art career, and infiltrated not only my dreams but my home. The woman who was once avoidable has become the last thing I needed: temptingly within reach.RooneyAxel Bergman is a gorgeous grump who doesn’t have the time of day for me. Thankfully, I’ve kept my crush under wraps...well, until I kissed him. Charades got away from me, okay? It was an accident! I haven’t seen him since, which is for the best. My life is a mess, and the last thing I need is to embarrass myself further with the man who avoids me like that’s his job rather than painting modern masterpieces.It seems the universe, however, has a different plan. When Axel and I unexpectedly find our paths—and problems—converging, a marriage of convenience proves the perfect solution. At least, until I’m facing my most serious problem yet: a once-loveless marriage of convenience that’s inconveniently become a love match, after all.​With You Forever is a sunshine and grump, marriage of convenience romance about a shy artist on the autism spectrum, and a smiley smartypants who has a chronic IBD. Complete with combustible cooking lessons, interfering family and friends, and a steamy slow burn, this standalone is the fourth in a series of novels about a Swedish-American family of five brothers, two sisters, and their wild adventures as they each find happily ever after.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Forced Proximity",
    "Adult",
    "Fiction"
  ],
  "author": "Chloe Liese",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/57558144-with-you-forever"
}