{
  "title": "The Darkness Within Ourselves",
  "description": "Running and hiding won’t save you because The Darkness lives within … and it will never stop hunting you.Amber and her four best friends are about to reach their teenage years when the unthinkable happens; one of her friends, Kieran, is killed in a freak accident.Twenty years later, Amber no longer speaks to her friends and is still haunted by that day in the form of severe psychological issues, including sleep paralysis, insomnia and hallucinations of a terrifying entity she calls The Creature. But it isn’t just in her head; it is real.Unbeknown to Amber, her former friends have also been suffering from their own psychological nightmares, each trapped and twisted into people they no longer recognise. Then a piece of evidence is found from that day and Amber and her former friends are forced to relive the events leading up to Kieran's death, learning truths along the way that they would rather not know about themselves.Can they work together to rid themselves of their demons and find out what really happened to Kieran all those years ago?The Darkness Within Ourselves is the first book in \"The Darkness Series\", a page-turning psychological thriller series that is guaranteed to keep you awake at night. If you like fast-paced thrillers with dark twists and themes of mental health then you’ll love this terrifying story of psychological disorders by author Jessica Huntley.** Winner of the Editor's Choice Award in the BookShelf Fiction Awards 2023**TRIGGER  Mental health issues (severe depression, agoraphobia, suicide), loss of a child (stillbirth), domestic violence, death.Reviews for The Darkness Within Ourselves\"One of those books you can't put down.\"\"This was an amazing read, and one of the things I loved the most was the description and representation of the different psychological issues the protagonists are facing after the death of their friend. It is amazing to have such a great depiction of how the same event can bring out such different reactions.\"\"Jessica is definitely an author to watch for the future, I am looking forward to reading more of her books!\"\"This story gave me IT the movie vibes!\"\"Loved it! Reminiscent of Stephen King novels. Highly recommend.\"\"The subject matter of childhood friends and the unbreakable bond was covered so well.\"\"Made me cry, made me scared and THE FEAR was infectious! A definite must read can't wait to read more from this author.\"",
  "genres": [
    "Thriller",
    "Fiction",
    "Horror",
    "Mystery",
    "Horror Thriller",
    "Mystery Thriller",
    "Psychological Thriller"
  ],
  "author": "Jessica  Huntley",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/57596632-the-darkness-within-ourselves"
}