{
  "title": "The Web of Humanity: A Novel",
  "description": "Praise for The Web of Humanity: \"Maria Turchin’s novel is a kaleidoscope of real people in the midst of struggling with the human condition. Turchin’s stories are laced with the complexity of unexpected love, and the savagery of war. In A Long Walk to Freedom, Nelson Mandela describes \"the triumph of the human spirit\"--bringing our humanity forward in the face of hatred and violence. Through her description of the power of human connection, Turchin takes us on a similar journey that allows us to reclaim our humanity. It is a must-read for young people and emerging leaders who are searching for ways to make a difference in a world gone wrong.\" —Dr. Mark Rittenberg, Founder of Berkeley Executive Coaching Institute, Walter Haas School of Business, UC Berkeley  \"Never have I read a piece of writing that is so adaptable to film. This book reads like a Hollywood blockbuster full of action and intrigue.\" —J. N. Elliott, producer of hit film Imperium and Netflix's The Vanished.  \"Epic.... an intelligent read full of twists and turns throughout.\" —Skip Woods, screenwriter of Swordfish & X-Men \"The Web of Humanity is a real treat for fans of historical fiction. Maria Turchin tells a sweeping and engrossing tale that spans four generations. It revisits the events -- and lasting implications -- of one of the most devastating periods of the last century. I couldn't put it down!\"—David Riemer, Board Chair, American Conservatory Theater & Author of the forthcoming book, Start-Up Story \"The pacing, poetry, and prose are quite impressive for a first-time novelist.\" —Julie Blattberg, former Managing Editor at Simon & Schuster, HarperCollins, and Disney Publishing  Book Anna Venu of Arizona can be very cunning, perceptive, and witty. She’s going to need every one of those traits to survive the journey she is about to embark on after the accidental discovery of a surprising family secret. Anna departs on a thrilling adventure across Vienna, Paris, and Berlin to unravel a mystery that takes her back to the final blood-soaked days of WWII. Anna quickly finds herself in over her head when her quest unexpectedly throws her into a modern-day European political conspiracy. When Anna becomes the target, she needs to use all her skills and determination to uncover the truth and stay alive. Told in a unique storytelling style, this book stretches across several generations and time periods with unexpected turns and events throughout. Alongside Anna, readers are forced to question the psychological need for aggression, racism, the abuse of power, and the unstoppable human drive for war. This book urges readers to discover the stories of their own lineage while echoing that we are all connected through the Web of Humanity, our only hope for survival.",
  "genres": [],
  "author": "Maria Turchin",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/57592197-the-web-of-humanity"
}