{
  "title": "The Finder",
  "description": "Emersyn’s heart was shattered when her father died when she was just twelve years old. If that weren’t enough, her mother married a man less than twelve months later, bringing her cruel step-brother into her life.On her eighteenth birthday, she finally finds the courage to run away. She leaves behind the only life she’s ever known with just the clothes on her back and three hundred dollars in her pocket. She begins her new life under her new name—Emma.For the first time in six years, Emma is finally free. She starts her new job, and her life begins to finally start tracking in the right direction. That is until the day she meets Garrett, the most gorgeous, intimidating man she's ever met. Unnerved by their connection, she tries to keep her distance. Little does she know that Garrett is the Alpha of the Northwoods Pack. She’s his mate, and he has no intention of letting Emma out of his sight.Garrett isn’t the only wolf who has his eye on Emma, though. Things are about to get heated, and Emma is at the center of it all. When danger hits too close to home, Garrett pulls Emma into his world. She’s going to find out she has a lot more to do with his world than either of them realized. In fact, she just might be the savior of his pack and the entire wolf kingdom because she is The Finder, capable of finding wolves’ mates. Change is coming to the Northwoods Pack and leading the change is Emma. She just has to survive first.**If you like paranormal romance with fated mates, protective males, and strong females, this series is for you. Each book in the series is full-length (95,000+ words), and features a different couple. Each book can be read as a stand-alone but is best enjoyed as part of the series.",
  "genres": [
    "Shapeshifters",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Paranormal Romance",
    "Urban Fantasy",
    "Werewolves"
  ],
  "author": "A.J. Manney",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/57584763-the-finder"
}