{
  "title": "Goodbye Is a Second Chance",
  "description": "**Amazon Top 50 seller**Sons of Sin- the hottest new band on tour. But their bassist strums a sour chord when he gets a glimpse of their wardrobe assistant.AngelBetrayal after betrayal leaves me knowing damn well women can’t be trusted for more than a good time and a quick goodbye. Now, I live for my music, my band, and the highs of rock n roll. Seeing her again after all these years is like a kick in the balls. Over and over again. I never understood what happened all those years ago. I just know this girl broke my damn heart and left me feeling abandoned like no other. Now with her front and center every day, I will get the answers I deserved all those years ago. JosieHow do you recover when your life is torn apart? I should be an old hand at it, with my past. But now, I’m as close to rock bottom as I can get without crashing. I don’t know if I can handle even one more thing going wrong. And then I see him again. What do you get when you run into the man that you hate more than anything? You avoid eye contact. That is until you can't. Now I'm stuck working for his band while they tour the country. Being around Angel brings back so many memories and a lot of insecurities I thought I was over, and I know I’m not going to come out intact.. I'm not sure how long this will last without one of us killing the other.Two damaged souls, once bound by friendship and love, torn apart by deceit. Now the bitterest of enemies, Josie and Angel are forced into daily contact. Forced to spend time together. Forced to face a painful past. But will taking a chance on their future mean saying goodbye to their past, or to each other?",
  "genres": [
    "Romance",
    "Second Chance",
    "Second Chance Romance",
    "Enemies To Lovers",
    "Musicians",
    "Music",
    "Forced Proximity"
  ],
  "author": "Nola Marie",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/57597911-goodbye-is-a-second-chance"
}