{
  "title": "Privilege and Scandal: The Remarkable Life of Harriet Spencer, Sister of Georgiana",
  "description": "Sweeping and scandalous, rich and compellingly readable, here is the first biography of Lady Harriet Spencer, ancestor of Diana, Princess of Wales, and devoted sister of Georgiana, Duchess of Devonshire. Harriet Spencer was without a doubt one of the most glamorous, influential, and notorious aristocrats of the Regency period.The second daughter of the prestigious Spencer family, Harriet was born into wealth and privilege. Intelligent, attractive, and exceedingly eager to please, at nineteen years of age she married Frederick, Viscount Duncannon, an aloof, distant relative. Unfortunately, it was not a happy union; the only trait they shared was an unhealthy love of gambling. The marriage produced four children, yet Harriet followed in the footsteps of her older sister and began a series of illicit dalliances, including one with the prominent and charismatic playwright Richard Brinsley Sheridan. Then she met Lord Granville Leveson Gower, handsome and twelve years her junior. Their years-long affair resulted in the birth of two children, and all but consumed concealing both pregnancies from her husband required great skill. Had the children been discovered, it surely would have resulted in divorce—which would have been disastrous.Harriet’s life was dramatic, and the history-making events she observed were equally fascinating. She was an eyewitness to the French Revolution; she participated in both the euphoria following Nelson’s victory at Trafalgar and the outpouring of grief at his spectacular funeral; she was privy to the debauchery of the Prince Regent’s wife, Princess Caroline. She quarreled bitterly with Lord Byron when he pursued her young daughter (rumor had it that he was truly interested in Harriet herself). She traveled through war-torn Europe during both the rise and the fall of Napoleon and saw the devastating aftermath of the Battle of Waterloo, where her son was gravely injured. Harriet, along with her sister, was one of the leading female political activists of her day; her charm allowed her to campaign noisily for Charles James Fox—while still retaining influence over supporters of his rival, William Pitt the Younger. Harriet survived Georgiana by fifteen years, living to see the coronation of George IV.Janet Gleeson’s elegant, page-turning style brings Harriet’s story vividly to life. Based on painstaking archival research, Privilege and Scandal gives readers an inside look at the lives of the British aristocracy during the decadent eighteenth century—while at the same time shining the spotlight on one of the era’s most fascinating women.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Historical",
    "18th Century",
    "British Literature",
    "Biography Memoir"
  ],
  "author": "Janet Gleeson",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/575831.Privilege_and_Scandal"
}