{
  "title": "Heart of the Raven Prince",
  "description": "A Cinderella Retelling\nA playboy prince in want of a decoy bride.A servant girl desperate for a disguise…Raven shifter Prince Franco is every social climbing debutante’s dream. He’s handsome, heir to the Lunar Court throne, and deliciously single. Every young woman wants to bed him, wed him, or steal a moment of his time. Except, of course, for Ember Montgomery.Half fae Ember craves freedom from her conniving stepfamily. As if they weren’t enough to deal with, a chance encounter with the arrogant Prince Franco leaves her humiliated and in a fiery rage. Nothing could convince her the prince is anything but a rake. But when the opportunity to evade her scheming stepmother falls into her lap, she’ll pay the price—even if it means impersonating the prince’s newest flame…To prove himself a worthy heir, Prince Franco must marry a princess. But after far too many unsatisfying trysts, he’s given up on love. With the social season in full swing, and bringing with it a horde of husband-hungry socialites, he’ll do anything to delay the pressures of both marriage and the crown. And what better solution than an alliance with a desperate servant girl glamoured as his false future bride?Locked in a bargain, Ember must pose as a princess until midnight at the full moon ball. Until then, all she has to do is wear the glamour, pretend to court the prince, and above all else, not fall in love. But when feelings emerge on both sides, she starts to wonder if there’s more to their contrived courtship than either of them planned…Can Ember and Franco find love when the masks come off? Or will illusions and lies prove stronger than their hearts?ACOTAR meets Bridgerton in this standalone fairytale retelling of Cinderella. If you like slow burn romance, fake engagements, and snarky fae royals, then you’ll love this swoon-worthy story in the Entangled with Fae series.*NOTE this book is upper YA/NA featuring mature situations, moderate violence and gore, substance abuse, and some adult language. The romance is slow burn but leads to moderate steam.\nHeart of the Raven Prince\n is a complete stand-alone novel set in the same world as The Fair Isle Trilogy. Journey back to Faerwyvae or begin your adventure for the first time with this enchanting tale. Each book in the \nEntangled with Fae\n series can be read on its own and in any order. Happily ever after guaranteed!",
  "genres": [
    "Fantasy",
    "Romance",
    "Retellings",
    "Fae",
    "Fantasy Romance",
    "Romantasy",
    "Young Adult"
  ],
  "author": "Tessonja Odette",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/57586319-heart-of-the-raven-prince"
}