{
  "title": "Saga of the Swamp Thing Box Set",
  "description": "All the groundbreaking Saga of the Swamp Thing graphic novels by Alan Moore, the writer of Watchmen and V For Vendetta, in a gorgeous slipcase box set! Before Watchmen, Alan Moore made his debut in the U.S. comic book industry with the revitalization of the horror comic book The Swamp Thing. His deconstruction of the classic monster stretched the creative boundaries of the medium and became one of the most spectacular series in comic book history. With modern-day issues explored against a backdrop of horror, The Swamp Thing stories became commentaries on environmental, political, and social issues, unflinching in their relevance.  Created out of the Swamp by a freak accident, Swamp Thing is an elemental creature who uses the forces of nature and wisdom of the plant kingdom to fight the polluted world's self-destruction. Alan Moore took the Swamp Thing to new heights in the 1980s with his unique narrative approach. His provocative and groundbreaking writing, combined with masterly artwork by some of the medium's top artists, made Swamp Thing one of the great comics of the late twentieth century. Book One begins with the story \"The Anatomy Lesson,\" a haunting origin story that reshapes Swamp Thing mythology with terrifying revelations that begin a journey of discovery and adventure that will take him across the stars and beyond. In this second collection, The Swamp Thing says goodbye to the illusion of his own humanity after learning that he is 100% plant, meets a crew of benevolent alien invaders inspired by the classic comic strip Pogo (also set in the swamp), and consummates his relationship with Abigail Arcane as only he could. The third volume is brimming with visceral horrors including underwater vampires, a werewolf with an unusual curse, the hideous madman called Nukeface. Best of all, this volume features the comics debut of John Constantine, Hellblazer, who launches Swamp Thing on a voyage of self-discovery that will take him from the darkest corners of America to the roots of his own long-hidden heritage. Volume four brings Swamp Thing’s quest for self-discovery with the mystic John Constantine to its shattering conclusion. A harbinger of doom has been released with the sole charge of waking an evil beyond comprehension, and Swamp Thing, John Constantine, Deadman, The Phantom Stranger, Etrigan the Demon, The Spectre and other masters of the occult must unite against the dark forces that threaten to eradicate Heaven’s light. The fifth volume begins as Swamp Thing returns from his sojourn to hell, only to learn that his girlfriend Abby is being persecuted for their “unnatural relations.” When she skips town for Gotham City, he follows and runs afoul of Batman, Lex Luthor, and the Gotham City Police Department. The sixth and final volume collects Moore's entire run, reprinting issues #57-64 and features the classic stories \"Loving the Alien\" and All Flesh is Grass.\"",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Horror",
    "Superheroes",
    "Science Fiction",
    "Fiction",
    "Adult"
  ],
  "author": "Alan             Moore",
  "average_rating": "4.66",
  "url": "https://www.goodreads.com/book/show/57617450-saga-of-the-swamp-thing-box-set"
}