{
  "title": "A World Without Soil: The Past, Present, and Precarious Future of the Earth Beneath Our Feet",
  "description": "A celebrated biologist’s manifesto addressing a soil loss crisis accelerated by poor conservation practices and climate change “Jo Handelsman is a national treasure, and her clarion call warning of a looming soil-loss catastrophe must be heard. Add her clearly written alarm to other climate change, pandemics, and mass extinctions.”—Laurie Garrett, Pulitzer Prize winner and author of The Coming Newly Emerging Diseases in a World out of Balance “The ground beneath our feet is slipping away as we lose the precious soil that sustains us. Jo Handelsman’s writing—as rich and life supporting as the soil itself—is a riveting warning.”—Alan Alda, actor, writer, and host of the podcast Clear+Vivid with Alan Alda This book by celebrated biologist Jo Handelsman lays bare the complex connections among climate change, soil erosion, food and water security, and drug discovery. Humans depend on soil for 95 percent of global food production, yet let it erode at unsustainable rates. In the United States, China, and India, vast tracts of farmland will be barren of topsoil within this century. The combination of intensifying erosion caused by climate change and the increasing food needs of a growing world population is creating a desperate need for solutions to this crisis. Writing for a nonspecialist audience, Jo Handelsman celebrates the capacities of soil and explores the soil-related challenges of the near future. She begins by telling soil’s origin story, explains how it erodes and the subsequent repercussions worldwide, and offers solutions. She considers lessons learned from indigenous people who have sustainably farmed the same land for thousands of years, practices developed for large-scale agriculture, and proposals using technology and policy initiatives.",
  "genres": [
    "Nonfiction",
    "Science",
    "Environment",
    "Climate Change",
    "Nature",
    "Ecology",
    "Sustainability"
  ],
  "author": "Jo Handelsman",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/57615561-a-world-without-soil"
}