{
  "title": "Capability",
  "description": "What are you capable of? Now go through a life-changing, tragic event, and ask yourself that same question. Could you lie, steal, cheat? Betray someone you love, hide secrets from the one person you are supposed to share everything with? Could you take justice into your own hands? Could you kill?Melany Polk had to ask herself these same questions.She had built the perfect life with her husband, Richard. Together they are raising two teenagers in the suburbs of Plano, Texas. While Richard’s work calls for him to be away from home a lot, Melany is allowed the privilege of being a stay-at-home mom. She spends her days catering to her children, taking strolls with the family dog, and gossiping with her elderly pothead neighbor.At the age of 43, she is in the best shape of her life. After taking up running as a hobby, she has a routine of fitting in a run around her neighborhood every night before bed. She considers herself a good, positive person. The people in her life would say the same. She could never answer yes to any of the questions above, or at least the old Melany couldn’t.On the evening of March 4th, a single act of brutal violence almost ends Melany's life during her nightly run.She now suffers through a grueling recovery. Melany struggles to find herself but is failing miserably. Every time she starts to feel like herself again, something is thrown in her path to remind her that he’s still out there. Lost and spiraling out of control, she has begun to withdraw from life. The disfigured face and body she now carries are starting to create a personality of its own. She wonders if she will ever be able to move on. The monster that did this to her remains a mystery; she fears he may come back so he can finish her off.Melany may seem like a timid housewife to some. The monster changed something inside her. She is no longer the innocent woman from before. After so much has been taken from her, she decides it’s time to take some of it back. With a taste for revenge, darkness takes over her. It has her doing things she thought she’d never be capable of.",
  "genres": [],
  "author": "Leigh M. Hall",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/57609122-capability"
}