{
  "title": "Medicine Is War: The Martial Metaphor in Victorian Literature and Culture",
  "description": "Medicine is most often understood through the metaphor of war. We encounter phrases such as \"the war against the coronavirus,\" \"the front lines of the Ebola crisis,\" \"a new weapon against antibiotic resistance,\" or \"the immune system fights cancer\" without considering their assumptions, implications, and history. But there is nothing natural about this language. It does not have to be, nor has it always been, the way to understand the relationship between humans and disease.Medicine Is War shows how this \"martial metaphor\" was popularized throughout the nineteenth century. Drawing on the works of Mary Shelley, Charles Kingsley, Bram Stoker, Arthur Conan Doyle, and Joseph Conrad, Lorenzo Servitje examines how literary form reflected, reinforced, and critiqued the convergence of militarism and medicine in Victorian culture. He considers how, in migrating from military medicine to the civilian sphere, this metaphor responded to the developments and dangers of modernity: urbanization, industrialization, government intervention, imperial contact, crime, changing gender relations, and the relationship between the one and the many. While cultural and literary scholars have attributed the metaphor to late nineteenth-century germ theory or immunology, this book offers a new, more expansive history stretching from the metaphor's roots in early nineteenth-century militarism to its consolidation during the rise of early twentieth-century pharmacology. In so doing, Servitje establishes literature's pivotal role in shaping what war has made thinkable and actionable under medicine's increasing jurisdiction in our lives. Medicine Is War reveals how, in our own moment, the metaphor remains conducive to harming as much as healing, to control as much as empowerment.",
  "genres": [],
  "author": "Lorenzo Servitje",
  "average_rating": "1.00",
  "url": "https://www.goodreads.com/book/show/57644500-medicine-is-war"
}