{
  "title": "Where the Truth Lies",
  "description": "A teenaged girl’s disappearance brings her community’s most devastating secrets to light in this “compelling and nuanced psychological thriller suffused with small town prejudice and dark family secrets” (Paula Hawkins, New York Times bestselling author) that is perfect for fans of Megan Miranda and Celeste Ng.The town of Whistling Ridge guards its secrets. When seventeen-year-old Abigail Blake disappears after a party, her best friend Emma is left with questions no one else can answer. The police initially believe Abi ran away, but Emma doesn’t believe that her friend would leave without her, and when disturbing evidence is discovered nearby, the festering secrets and longstanding resentment of both Abigail’s family and the people of Whistling Ridge begin to surface with devastating consequences. Among those Abi’s older brother’s passionate, dangerous love for a handsome Romanian immigrant who has recently made his home in the town’s trailer park; her younger brother’s feeling that he knows information he should tell the police, if only he could put it into words; her father’s mercurial rages and her mother’s silence. Then there is the rest of Whistling Ridge, where a charismatic preacher advocates for God with language that mirrors violence, all under the sway of the powerful businessman who rules the town. But Abi has secrets of her own, and the closer Emma grows to unraveling them, the further she feels from her friend. And in a tinderbox of small-town rage, all it will take is just one spark—the truth of what really happened that night—to change their community forever in this “intricate and compelling thriller, beautifully nuanced and wonderfully claustrophobic” (S.J. Watson, New York Times bestselling author).",
  "genres": [
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "Fiction",
    "Crime",
    "Contemporary",
    "Suspense"
  ],
  "author": "Anna  Bailey",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/57641227-where-the-truth-lies"
}