{
  "title": "The Reading List",
  "description": "🎧Run Time = 12 hours and 48 minutesA “beautiful novel about the magic of books and the joy of human connection” (Newsweek): While working at her local library, Aleisha stumbles upon a reading list — and when she shares it with elderly widower Mukesh, they forge an unlikely and transformative friendship. This “thoughtful and heartwarming” tale (Library Journal starred review) has over 41,000 five-star ratings!An unforgettable and heartwarming debut about how a chance encounter and a list of library books helps forge an unlikely friendship between two very different people—a lonely London widower and a troubled teenager. Widower Mukesh lives a quiet life in the London Borough of Ealing after losing his beloved wife. He shops every Wednesday, goes to Temple, and worries about his granddaughter, Priya, who hides in her room reading while he spends his evenings watching nature documentaries.Aleisha is a bright but anxious teenager working at the local library for the summer when she discovers a crumpled-up piece of paper in the back of To Kill a Mockingbird. It’s a list of novels that she’s never heard of before. Intrigued, and a little bored with her slow job at the checkout desk, she impulsively decides to read every book on the list, one after the other. As each story gives up its magic, the books transport Aleisha from the painful realities she’s facing at home.When Mukesh arrives at the library, desperate to forge a connection with his bookworm granddaughter, Aleisha passes along the reading list…hoping that it will be a lifeline for him too. Slowly, the shared books create a connection between two lonely souls, as fiction helps them escape their grief and everyday troubles and find joy again.",
  "genres": [
    "Fiction",
    "Books About Books",
    "Book Club",
    "Contemporary",
    "Audiobook",
    "Romance",
    "Adult"
  ],
  "author": "Sara Nisha Adams",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/57641117-the-reading-list"
}