{
  "title": "Cyber Mage",
  "description": "Welcome to Dhaka, Bangladesh in 2089. A city notorious for its extreme population density has found an unexpected way to not just survive a global climate apocalypse, but thrive: pump enough biological nanotech into the neighborhood and all of the bodies together form a self-sustaining, and even temperate, microclimate. Of course, this means that millions of humans have to stay put in order to maintain a livable temperature, and people are getting restless. All of the nanotech has also led to some surprises: certain people no longer need food or water while others can live without functioning organs. So the mercenary Djibrel has to carry a machete wherever he goes. Only a swift beheading can ensure the job gets done anymore. Djibrel navigates the crowded streets, humans teeming with genetic mutations, looking for answers about what happened to the Djinn, a magical super race of genies who seem to have disappeared, or merged, with humans for survival. What Djibrel doesn't know is that his every move is being tracked by the infamous Cyber Mage—better known to his parents as Murzak, a privileged snarky teenager who regularly works for a Russian crime syndicate with a band of elite hackers, like his best friend ReGi, who resides in North Africa's FEZ (Free Economic Zone). Respected and feared online, Murzak is about to embark on one of his biggest challenges: attending high school IRL. But when he discovers a brand new type of AI, operating on a dark web from the abandoned Kingdom of Bahrain that he thought was just an urban myth, Murzak and Djibrel will have to face the unimaginable in an already inconceivable world. In this laugh-out-loud-funny and totally original new novel, Saad Z. Hossain continues his signature genre mashup of SF and fantasy, challenging and subverting everything previously imagined about our future and climate change. A scathing critique of corporate greed, Hossain shows us how to think beyond the naïve ideas of preening moguls like Jeff Bezos and Elon Musk.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Cyberpunk",
    "Fiction",
    "Urban Fantasy",
    "Dystopia",
    "Speculative Fiction"
  ],
  "author": "Saad Z. Hossain",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/57642699-cyber-mage"
}