{
  "title": "All In: An Autobiography",
  "description": "An inspiring and intimate self-portrait of a champion of equality that encompasses her brilliant tennis career, unwavering activism, and an ongoing commitment to fairness and social justice.\nBillie Jean King was only seven years old when she told her mother, \"I'm going to do something great with my life someday.\" But the world she wanted did not exist yet, so she set out to create it. In this spirited account, King details her life's journey to find her true self. She recounts her groundbreaking tennis successes that came at a breathtaking pace--six years as the top-ranked woman in the world, twenty Wimbledon championships, thirty-nine grand-slam titles, and her watershed defeat of Bobby Riggs in the famous \"Battle of the Sexes.\" King poignantly recalls the cultural backdrop of her career and the profound impact on her worldview from the women's movement, the assassinations and anti-war protests of the 1960s, the civil rights movement, and, eventually, the LGBTQ+ rights movement.King describes the myriad challenges she hurdled, including entrenched sexism, an eating disorder, near financial ruin after being outed, and accepting her sexual identity. It was not until the age of 51 that she began to publicly and unequivocally acknowledge, \"I am gay.\" Today, King's life remains one of indefatigable service. She offers insights and advice on leadership, business, activism, sports, politics, marriage equality, parenting, sexuality and love. She shows how living honestly and openly has had a transformative effect on her relationships and happiness. Hers is the story of a pathbreaking feminist, world-class athlete, and an indomitable spirit whose impact has transcended her achievements in sports.",
  "genres": [
    "Nonfiction",
    "Sports",
    "Memoir",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "LGBT"
  ],
  "author": "Billie Jean King",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/57639878-all-in"
}