{
  "title": "Arminius and Thusnelda Versus Rome",
  "description": "In September of 9 A.D., the man appointed as the Roman Governor of Germania with the backing of Augustus tried to complete the Roman conquest of the Germans. At the time, the Germanic tribes were loosely allied, but they would unite for offensive or defensive warfare if they were threatened. The Roman Governor called Varus had been passing too many judgements upon the Germanic tribesmen, who too often saw their kinsmen and women either impaled or crucified. At an early age, three boys were taken to Rome for instruction in Roman Law, basic engineering, Latin, and learning to become officers serving with the Roman army to repay Rome for their education. After completing their training and at their mid to late teens, the boys were sent to their units. Over time, Arminius became disgusted with how the Romans treated people and resolved to throw them out of his county. In time Arminius met Thusnelda, who married him. Together, they became a thorn in the side of Rome. That resulted in Varus leading three entire legions against them. The legions were ambushed by a handful of Germanic warriors who destroyed all three roman legions and all of their supporting units. That totalled over 20,000 men. At the time, the Germanic woman had full equality with Germanic men. Women even sat on military councils, and often, their advice was sought by the male warriors. The woman would follow their men at a distance from them, but they were always close enough to their men to be able to lend assistance to them if needed. that often turned the tables of the fight and resulted in the Germanic woman being feared as such as the Germanic man by the Romans!",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Contemporary",
    "Drama",
    "Historical",
    "Novels",
    "Epic"
  ],
  "author": "Michael G. Kramer",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/57640572-arminius-and-thusnelda-versus-rome"
}