{
  "title": "Migration: New and Selected Poems",
  "description": "Winner of the National Book AwardA New York Times \"100 Notable Books of the Year\"A powerful case can be made for declaring W.S. Merwin the most influential American poet of the last half-century. Migration: New & Selected Poems is that case.As an undergraduate at Princeton, Merwin was advised by John Berryman to “get down on your knees and pray to the muse every day.” Over the last 50 years, Merwin’s muse led him beyond the traditional verse of his early years to revolutionary open forms that engaged a vast array of influences and possibilities. As Adrienne Rich wrote of W.S. Merwin’s work, “I would be shamelessly jealous of this poetry, if I didn’t take so much from it into my own life.”The definitive volume from “one of America’s greatest living poets.”—The Washington Post Book World\"The poems in Migration speak from a life-long belief in the power of words to awaken our drowsy souls and see the world with compassionate interconnection.\"—Citation from the National Book Award judges\"The publication of W. S. Merwin’s selected and new poems is one of those landmark events in the literary world... Merwin is one of the great poets of our age.\"—Los Angeles Times Book Review\"[I]t's hard to believe this rich selection represents the work of just one man.\"—Publishers Weekly\"[In] any landscape, Merwin stands tall.\"—Philadelphia Inquirer\"Complex, spiritual, and evocative, Merwin is a major poet, and this is a sublime measure of his achievements.\"—ALA Booklist\"Migration: New and Selected Poems gathers Merwin’s personal harvest of his fifty-year oeuvre into one magisterial volume.\"—The Wichita Eagle\"Many of us have followed W.S. Merwin’s work book by book, collection by collection.…He has created a body of wisdom literature that is unprecedented in our age. I feel lucky to be alive at a time when W.S. Merwin has been creating his startling and incomparable work.\"—Edward Hirsch, introduction to “A Tribute to W.S. Merwin”\"The trajectory of Merwin’s work is meteoric: its greatest flashes of beauty and insight are the product of traditional poetic impulses breaking up under the pressures of our atmosphere... he has written some of the most powerful poems in the language against our species’ murderous sense of self-importance.\"—Jacket\"W. S. Merwin's legacy is unquestionably secure: his best and most fierce poems are moody, visionary compositions that dive into the unconscious and the seeds of existence with an inwardness and scrutiny unique in American poetry.\"—PoetryFrom Once in SpringA sentence continues after thirty years it wakes in the silence of the same room the words that come to it after the long comma existed all that time wandering in space as points of light travel unseen through ages of which they alone are the measure and arrive at last to tell of something that came to pass before they ever began or meant anythingPoet and translator W.S. Merwin has received nearly every major literary accolade, including the Pulitzer Prize, Tanning Prize and Bollingen Prize. He has long been committed to artistic, political and environmental causes in both word and deed; when presented with the Pulitzer Prize, he donated the prize money to artists and the draft resistance. He currently lives in Hawaii, where he cultivates endangered palm trees.",
  "genres": [
    "Poetry",
    "Literature",
    "The United States Of America",
    "American",
    "Nature"
  ],
  "author": "W.S. Merwin",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/57628.Migration"
}