{
  "title": "Pixelnix",
  "description": "Living as an orphan with only a massive inheritance, two trusty butt plugs, and a pet cactus for company is not just lonely...it’s boring.So when I’m contacted with the chance of trial testing the new Virtual Reality gaming console, how can I refuse? Entering a whole new epic fantasy world where I can do whatever the hell I want...sign me the frick up!It’s a no brainer really. Especially when I get to spend my days battling dungeon bosses, crazy monsters and gaming noobs, while using an extensive arsenal of spiky and lethal objects that have my violent tendencies cooing in glee.What’s even better is I don’t have to rely on butt plugs for company anymore! Oh no, I have five hot as sin guardian warriors that I can rough house with, day and night, and a snuggly companion who knows when to put those sharp talons to good use.Of course, some mothertrucker always has to rear their ugly head and ruin everything.The question is, will I be able to contain my wrath, or will the whole world burn along with me?Join Xena on her epic video game quest full of adventures and journeys of steaminess, sensual ridings and a lot of hot fu- Ahem. A lot of action, brutality and sheer awesomeness!**Author’s note: This book contains adult themes. Including, but not limited to: swear words, detailed and explicit sexual situations, violence, gore, and BM (Bad Manners) galore. This book is not for those who are offended easily. There is also a lot of informal word usage...I am not an English major and our FMC doesn’t care much for formal language, so you’ll just have to deal.Seriously, if you don’t like the heavy duty call outs and plenty of colourful bad words, or violent and gruesome descriptions, put this book down now. It is not for you.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Humor",
    "Science Fiction",
    "Paranormal",
    "Fiction"
  ],
  "author": "Luna  May",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/57624970-pixelnix"
}