{
  "title": "ENLIGHTENMENT The Union",
  "description": "'I waited. And with the first breath of possibility, I jumped. Sink or Swim.' By responding to an SOS, Mary Ashe could save her own soul, as well as that of her soulmate.If you like a mystical touch to your romance stories then this book is for you.It is over twenty years since Mary refused to settle down with her first love, Joe Rowan, because she thought they were too young at the time. While regret still simmers below the calm surface of her emotions, she has become an expert at navigating the single life and has learnt to enjoy the advantages it offers.Then, fate and time align to offer Mary an opportunity to rescue Joe when his ship is lost at sea. Joe, newly separated, is abroad a US Navy vessel reported missing after a tropical storm. Mary travels to Florida to join the search and rescue operation. But what good is all her expertise and years of experience in the Irish Coast Guard, if it’s too late and Joe's body is already lying at the bottom of the ocean?As the rescue progresses, Mary is chosen to join the US Navy’s first responder to the SOS. She quickly discovers that she is involved in more than a standard rescue mission and finds herself embroiled in the type of adventure that Joe and herself used to dream about when they were young; filled with secret codes, mystical occurrences and divine revelations.ENLIGHTENMENT The Union is a mystical love story about soul mates in separation and the adventure that brings them back together. Mary leads the story; she is fully aware of the impact that walking away from her soul mate Joe has had on her life. However, she chooses not to settle for anyone else and leads a full life with an exciting career. When fate throws up a chance for Mary to save Joe’s life, she jumps right in.Mary and Joe’s relationship draws on the beliefs around Twin Flame Love. The characters love of symbols and codes leads them on an adventure that dives into the mystical, the spiritual and the deep and magical union of two people who share the one soul.You don’t need to know what Twin Flame love is to enjoy this story. However, Mary and Joe’s journey will strike a cord with anyone who is familiar with Twin Flames and the emotions that go along with being on this journey.ENLIGHTENMENT The Union is the first in a five book series. For more details on the series and when the next book will be released you may follow the author here and on Instagram @roseorua.",
  "genres": [],
  "author": "Rose O'Rua",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/57627316-enlightenment-the-union"
}