{
  "title": "ROCKLEDGE: INTRODUCING CADE CHASE",
  "description": "Rockledge is a crime thriller that examines the effects of a crooked, autocratic group of elites (politicians and contractors) on people who have been abused for many decades. This is the opener of a planned Cade Chase series. It is a crime thriller set in the fictional Rockledge, an impoverished town in the center of Appalachia, more precisely in extreme southwest Virginia.The main character, Cade Chase, recently retired from the military. He has given insufficient thought to life afterward. He accedes to the urgings of a longtime friend and former JAG officer, to come to the town of Rockledge. He leaves Florida and heads to Rockledge uncertain that this move is wise.On his first morning in Rockledge he runs across a hillbilly octogenarian named Dale Carter, who tells him finding a place to live will be tough. So Carter invites him to have a look at a home, one of three, he owns on a mountainside \"out in the valley.\" The home he shows Cade is one of the grandest Cade has ever seen. Carter tells Cade the house is his if he wants it. Seems joining the military was the defining event of Dale's life. Without the military's 'gifts' he wouldn't have amassed the wealth he possesses. But he stipulates one condition: help protect him and his wife against what appears to be a dangerous crew of squatters camping in the woods on or near his property.Cade is instantly fond of Dale, and agrees to help him. This agreement sets the story in motion. There's plenty of action from that point onward. Yes, it's a thrilling story involving crime, but more important, it's a story of the evils of autocratic behavior by political elites. Cade is determined to bring the evildoers down. He quickly learns that extreme southwest Virginia has been a whipping boy for sixty years or more. Cade and a cadre of like-minded people strive to end the trampling of this region of the state. You may find it on Amazon and Kindle books. If searching under my name, you need to search under John M. Vermillion, including the middle initial.Thank you.jmv",
  "genres": [
    "Book Club",
    "Novels",
    "Contemporary"
  ],
  "author": "John M. Vermillion",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/57639915-rockledge"
}