{
  "title": "Just His Assistant",
  "description": "She's just his assistant, which is exactly how this Southern belle wants it. No spotlight. Not anymore. But as she struggles to learn her new role in his office—especially because Lance is the surliest boss imaginable—Jessie might just have to open her heart to show him everyone has a past they're running from.Jessie:Lance Byers is by far the meanest man in Carolina. Both of them. All of the South. Heck, the whole country.He makes demands I don't know how to fulfill, like, \"Bring me those closing docs,\" or \"Set up that open house.\"I'm trying to learn as fast as I can, but the real estate market in Charleston is like a jet plane flying at three hundred miles per hour. It moves, and it moves fast.Lance is smart, handsome if I can admit that out loud, and entrenched in this realtor lingo I don't understand. He even brings in someone to train me, but I'm pretty sure I'm failing him on a daily basis.Failure? That, I understand.I'm determined to figure this out, though. I have to, because my only other option is to run back to Momma and Daddy in that big house I hate.I won't. I can't do it. Which means I have to figure out how to deal with Lance's attitude, learn what an escrow payment is, and hide my secrets all while smiling and entertaining clients.When a ball somewhere gets dropped and I'm about to take the blame, I decide to try one more thing...bare my soul to the meanest man on the planet. Surprisingly, I learn that Lance is human after all, and hurting just as much as I am.I suddenly want to take him under my broken wing and show him that there could be a second chance for both of us...if he doesn't fire me first.Get ready to laugh out loud in this hilarious, sweet workplace romantic comedy! The romance is clean, the jokes witty, and the office grump swoon-worthy. Read today!",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Chick Lit",
    "Clean Romance"
  ],
  "author": "Elana Johnson",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/57627803-just-his-assistant"
}