{
  "title": "Present Company",
  "description": "“The intentions of Merwin’s poetry are as broad as the biosphere yet as intimate as a whisper. He conveys in the sweet simplicity of grounded language a sense of the self where it belongs, floating between heaven, earth, and underground.”—The Atlantic Monthly“W.S. Merwin is our strongest poet.”—The New York Times Review of BooksIn this new masterwork from one of America’s foremost poets, W.S. Merwin guides his readers to universal themes through worldly specifics. Akin to Neruda’s Elemental Odes, every poem in Present Company directly addresses the people and things of daily life, as in “To the Thief at the Airport” or “To Lingering Regrets.”\nTo This May\nThey know so much more now about the heart we are told but the world still seems to come one at a time one day one year one season and here it is spring once more with its birds nesting in the holes in the walls its morning finding the first time its light pretending not to move always beginning as it goesThese poems to the world are playful, deadly serious, and full of wonder. Whether writing of an unused vehicle in “To Zbigniew Herbert’s Bicycle” or watching fireworks from a distance in “To the Coming Winter,” Merwin’s poems create a rare and compelling intimacy. There is no one writing today like W.S. Merwin.Poet and translator W.S. Merwin has long been committed to artistic, political, and environmental causes in both word and deed. He has received nearly every major literary accolade, including the Pulitzer, Tanning, Lannan, and Bollingen prizes. His most recent award is the International Golden Wreath from the Struga Foundation, a longstanding literary honor that, in its 70-year history, has been offered to only three English-speaking poets. W.S. Merwin lives in Hawaii, where he cultivates endangered palms.",
  "genres": [
    "Poetry"
  ],
  "author": "W.S. Merwin",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/57630.Present_Company"
}