{
  "title": "The Jerusalem Syndrome: My Life as a Reluctant Messiah",
  "description": "By the author of Attempting Normal and host of the podcast WTF with Marc Maron, The Jerusalem Syndrome is The Gospel according to a spiritual memoir of your average hyperintelligent, ultraneurotic, superhip Jewish standup comedian and seeker. The Jerusalem Syndrome is a genuine psychological phenomenon that often strikes visitors to the Holy Land_the delusion that they are suddenly direct vessels for the voice of God. Marc Maron seems to have a distinctly American version of the Jerusalem Syndrome, which has led him on a lifelong quest for religious significance and revelation in the most unlikely of places.Maron riffs on Beat phenomena with its sacred texts, established rituals, and prescribed pilgrimages. He spends some time exploring the dark side of things, as his obsessions with cocaine (known to Maron as “magic powder”), conspiracy theories, and famous self-destructive comedians convince him that the gates of hell open beneath Los Angeles. As his quest matures, he reveals the religious aspects of Corporate America, pontificating on the timeless beauty of the Coca-Cola logo and even taking a trip to the Philip Morris cigarette factory, where the workers puff their own products with a zealot-like fervor. The culmination of Maron’s Jerusalem Syndrome comes during his own tour of the Holy Land, where, with Sony camcorder glued to his eye socket, he comes face-to-face with his own ambiguous relationship to Judaism and reaches the brink of spiritual revelation_or is it nervous breakdown?Marc Maron has considerably adapted and expanded his praised one-man show to craft a genuine literary memoir. Whether he’s a genuine prophet or a neurotic mess, he’ll make you laugh as you question the meaning of life.“Marc Maron is blazingly smart, rapid-fire, and very funny . . . A brilliant and relentless screed.” –David Rakoff, author of Fraud“Marc Maron is the first crazy person I’ve ever envied. In his brainiac-memoir-meets-hilarious-travelogue, he demonstrates the ability to tell a story with an extraordinary provocative intelligence that is regrettably shared by few.” _ Janeane Garofolo, comedian",
  "genres": [
    "Humor",
    "Memoir",
    "Nonfiction",
    "Comedy",
    "Audiobook",
    "Biography",
    "Religion"
  ],
  "author": "Marc Maron",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/57642.The_Jerusalem_Syndrome"
}