{
  "title": "A Killer by Design: Murderers, Mindhunters, and My Quest to Decipher the Criminal Mind",
  "description": "A vivid behind-the-scenes look into the creation of the FBI's Behavioral Science Unit and the evolution of criminal profiling, written by the pioneering forensic nurse who transformed the way the FBI studies, profiles, and catches serial killers. Lurking beneath the progressive activism and sex positivity in the 1970-80s, a dark undercurrent of violence rippled across the American landscape. With reported cases of sexual assault and homicide on the rise, the FBI created a specialized team—the “Mindhunters” better known as the Behavioral Science Unit—to track down the country's most dangerous criminals. And yet narrowing down a seemingly infinite list of potential suspects seemed daunting at best and impossible at worst—until Dr. Ann Wolbert Burgess stepped on the scene.In A Killer By Design, Burgess reveals how her pioneering research on sexual assault and trauma caught the attention of the FBI, and steered her right into the middle of a chilling serial murder investigation in Nebraska. Over the course of the next two decades, she helped the budding unit identify, interview, and track down dozens of notoriously violent offenders, including Ed Kemper (\"The Co-Ed Killer\"), Dennis Rader (\"(\"BTK\"), Henry Wallace (\"The Taco Bell Strangler\"), Jon Barry Simonis (\"The Ski-Mask Rapist\"), and many others. As one of the first women trailblazers within the FBI’s hallowed halls, Burgess knew many were expecting her to crack under pressure and recoil in horror—but she was determined to protect future victims at any cost. This book pulls us directly into the investigations as she experienced them, interweaving never-before-seen interview transcripts and crime scene drawings alongside her own vivid recollections to provide unprecedented insight into the minds of deranged criminals and the victims they left behind. Along the way, Burgess also paints a revealing portrait of a formidable institution on the brink of a seismic scientific and cultural reckoning—and the men forced to reconsider everything they thought they knew about crime.Haunting, heartfelt, and deeply human, A Killer By Design forces us to confront the age-old question that has long plagued our criminal justice system: “What drives someone to kill, and how can we stop them?”",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Psychology",
    "Audiobook",
    "History",
    "Memoir"
  ],
  "author": "Ann Wolbert Burgess",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/57653187-a-killer-by-design"
}