{
  "title": "My Friends",
  "description": "From the Pulitzer Prize-winning author of The Return , a luminous novel of friendship, family, and the unthinkable realities of exileThe trick time plays is to lull us into the belief that everything lasts forever, and although nothing does, we continue, inside our dream.One evening, as a young boy growing up in Benghazi, Khaled hears a bizarre short story read aloud on the radio, about a man being eaten alive by a cat. Obsessed by the power of those words—and by their enigmatic author, Hosam Zowa—Khaled eventually embarks on a journey that will take him far from home, to pursue a life of the mind at the University of Edinburgh.There, thrust into an open society that is light years away from the world he knew in Libya, Khaled begins to change. He attends a protest against the Qaddafi regime in London, only to watch it explode in tragedy. In a flash, Khaled finds himself injured, clinging to life, an exile, unable to leave England, much less return to the country of his birth. To even tell his mother and father back home what he has done, on tapped phone lines, would jeopardize their safety.When a chance encounter in a hotel brings Khaled face to face with Hosam Zowa, the author of the fateful short story, he is subsumed into the deepest friendship of his life. It is a friendship that not only sustains him, but eventually forces him, as the Arab Spring erupts, to confront agonizing tensions between revolution and safety, family and exile, and how to define his own sense of self against those closest to him.A devastating meditation on friendship and family, and the ways in which time tests—and frays—those bonds, My Friends is an achingly beautiful work of literature by an author at the peak of his powers.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Literary Fiction",
    "Libya",
    "Africa",
    "Contemporary",
    "Novels"
  ],
  "author": "Hisham Matar",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/127488823-my-friends"
}