{
  "title": "The Adventures of Bentley Hippo: Inspiring Children to be Patient",
  "description": "We are pleased to announce that the NEW upgraded version of our 5-book series is now available. Search B0B8ZQRBY6 Thank you and enjoy!How can someone so small cause such a disturbance?Stuck in a long lineup for a chance to ride a rocket ship to the moon, Jaxon grows impatient and decides to make a dash to the front. With little regard for those around him, Jaxon's anxiety and excitement get the best of him, and he simply can't sit still. In a matter of minutes, ice cream cones are flying everywhere.Can Bentley and the others teach a hyperactive monkey how to calm down and wait patiently like the others?Children will the importance of being patient and waiting their turnunderstanding their emotionsidentifying ways to reduce their anxiety and ways to stay calm.paying attention to those around themInspiring Children to be Patient is part of this fabulous 5-book series of children’s picture books, following a bubbly, kind hippo and his diverse group of friends. It carries important messages and social-emotional values like friendship, sharing and teamwork, and kindness for kids. It is filled with colorful images that children will love, set out to become a firm favorite for your child’s bedtime read.A must-have collection for any classroom, home, and library. Ideal for children ages 4-8. Toddlers, preschoolers, kindergarten, and elementary grades will enjoy the benefits of this book and series.*Be sure to check out the final book in the series Inspiring Children to Accept Each Other to find out what happens when Bentley is forced to choose between his space dream of going to the moon and his friends. Be sure to download activities for each of our titles at bentleythehippo.com this title and the other books in the series have been updated to bring you an even better version that earned each title multiple awards.",
  "genres": [],
  "author": "Argyro Graphy",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/57657661-the-adventures-of-bentley-hippo"
}