{
  "title": "The New American Heart Association Cookbook",
  "description": "Since the American Heart Association published its first cookbook in 1973, dozens of health and diet trends have come and gone. Throughout this time, the Association, the foremost authority on heart health, has set the standard for nutritious eating. With millions of copies already in print, the Association’s flagship cookbook, The New American Heart Association Cookbook , is back—and better than ever. In today’s climate of confusing and often contradictory dietary trends, the American Heart Association once again rises above the fray and presents credible, easy-to-understand information about maintaining a healthy heart—and delicious recipes that make it simple to follow that advice at every meal.The more than 600 recipes, including 150 new ones, follow the American Heart Association’s guidelines for healthy eating and make The New American Heart Association Cookbook, Seventh Edition a welcome addition to the cookbook world. Whether you crave classic family favorites, ethnic dishes, vegetarian entrées, or the most varied, cutting-edge recipes, you’ll find plenty of options. Orange Chicken Lettuce Wraps, Greek-Style Beef Skillet Supper, and Grilled Vegetable Pizza with Herbs and Cheese are just a few examples of the up-to-date, exciting, and flavorful choices inside.The New American Heart Association Cookbook, Seventh Edition can even help with menu planning, holiday cooking, and shopping for healthful ingredients. With the latest information about the connection between good food and good health, emphasizing variety, balance, and common sense, The New American Heart Association Cookbook, Seventh Edition is the ultimate healthy-heart cookbook.From the Hardcover edition.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Reference",
    "Food",
    "Health",
    "Adult"
  ],
  "author": "American Heart Association",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/576612.The_New_American_Heart_Association_Cookbook"
}