{
  "title": "A Killing at Smugglers Cove",
  "description": "Wartime secrets, smugglers’ caves, skeletal remains... And the holiday’s only just begun…Summer, 1923. Reporter Iris Woodmore travels to sunny Devon with her friends Percy Baverstock and Millicent Nightingale for her father’s wedding to Katherine Keats.But when Millicent uncovers skeletal remains hidden on the private beach of Katherine’s former home, Iris begins to suspect her future stepmother isn’t all she seems.Police reveal the dead man was a smuggler who went missing in 1918. But when a new murder occurs, they realise the killer is still in their midst – and the link between both murders is Katherine. Could Iris’s own father be in danger?A completely gripping cozy mystery story ideal for fans of Verity Bright, Claire Gradidge, Jacqueline Winspear, Helena Dixon and Emily Organ!Readers love A Killing at Smugglers Cove:'Compulsive reading at its best. Iris Woodmore's fourth mystery has a mix of love, jealousy, and betrayal of the kind that can only lead to murder' Five Star Reader Review'The Iris Woodmore Mysteries are a firm favourite of mine – rich with period detail but with a damn fine mystery as well. Highly recommended' Five Star Reader Review'What an utterly delightful story! ... I am sure Dame Christie would have been delighted by this novel' Five Star Reader ReviewPraise for the Iris Woodmore Mysteries:'The mystery itself is intriguing, with plenty of twists and unexpected developments. If you enjoy 1920s mysteries and learning about the suffragettes and all they stood for, then I highly recommend Death at Crookham Hall' Verity Bright, author of the Lady Eleanor Swift Mysteries'A fabulous, well-written, mystery that holds all the promise of much more to come... The Iris Woodmore mysteries are fast becoming some of my favourites' M J Porter, author of The Eagle of Mercia Chronicles'A joy to read! Such a well-researched mystery. I absolutely loved the unconventional heroine, 1920s setting, engaging characterisation and poignant ending, all of which provide a captivating start to the Iris Woodmore cosy mystery series' Anita Davison, author of the Flora Maguire Mysteries‘Death at Crookham Hall is a lovely, murder mystery by a gifted writer’ Helena Dixon, author of The Miss Underhay Mysteries",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Suspense",
    "Historical",
    "Fiction"
  ],
  "author": "Michelle Salter",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/127487683-a-killing-at-smugglers-cove"
}