{
  "title": "Defiant",
  "description": "In shifter life, what's more important? Your human mind? Or your wolf's?Elena\nWhen my wolf appears for the first time, I’m so overjoyed that I don’t think, I just run into the forest…and smack into Black Maddox, the leader of my pack. Only…he doesn’t believe that I’m what I say I am. He insists that I’m part of a rival pack and locks me up in his basement.Black’s twice my age, insanely powerful, and has a streak of darkness running through him a mile wide and an ocean deep.He’s exactly the type of man that I always swore I’d stay far away from. I should stick with Jonah, the beta I know and trust, the man who’ll give me everything I ask for.But what if there are things I didn’t know I ever wanted before? Things I don’t know how to ask for?The shadow Black casts drenches me, his depravity soaking into my skin.He’s going to destroy me if I don’t escape him.\nBlack\nI discover pretty little Elena helpless in disputed territory.At first, I want to crack her open, this wide-eyed temptation who derails me. I want to shatter her and those who sent her into tiny pieces. I will not be manipulated or deceived by her false innocence.That’s what I tell myself. But even as I say it aloud, my obsession grows and the spell she weaves leaves my wolf and I both panting.But once I realize Elena’s a special type of shifter, the rarest of the rare, and the most precious of them all… I don’t want to crush her. I want to chain and keep her. I want to make her beg for mercy, but not because she’s broken.Because she’s mine.I want her desperate and aching for me in ways she’s never been before.My wolf and I will claim her, mark her, marry her and keep her.Only one thing’s stopping me.The entire shifter world wants her too.Author’s Note: This is a dark ménage romance. Please read the author's note at the beginning of this book before you dive in.",
  "genres": [
    "Omegaverse",
    "Paranormal",
    "Fantasy",
    "Shapeshifters",
    "Romance",
    "Menage",
    "Dark"
  ],
  "author": "Ann  Denton",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/57651316-defiant"
}