{
  "title": "A Sunrise Kind of Love",
  "description": "Makiya I always dreamed this day would happen. The day where Hunter would show up on my doorstep and confess his undying love for me. I never stopped loving him no matter how hard I tried, no matter how angry I was at him for leaving. Now, after five long years of waiting, he leans against my car with the same cocky smirk he wore when we were younger. Damn, if my body doesn’t react to him as if there was never any time lost between us. Just his gaze roving over my body makes me feel tingly all over. I hate how smug he looks like he knows how he still affects me. I hate that my heart still wants him after everything he’s done. What I hate most of all, though, is that he’s about to find out the secret I’ve been keeping from him all these years. And he’s going to be pissed. This is going to change my life forever. Hunter Secrets? Really, that’s how we’re playing this game? We’re keeping secrets from each other. The Ki I knew would have never kept something this big from me, but I guess she isn’t the same girl I knew. I’m not the same guy either. She thinks I don’t want anything to do with her. That’s why she kept this from me. Well, she’s about to find out the cold, hard truth. I’m not leaving without a fight, and I’m definitely not giving her a chance to walk away from me this time. I spent too many years of my life, hiding from my love for her. It’s about damn time for me to stop running. So, Ki better get used to the fact that she’s going to see my handsome face everywhere. Challenge accepted. A Sunrise Kind of Love is a second chance, sweet with a little heat romance and a guaranteed HEA. It is the first book in the Love in Sunrise Series but can be read as a standalone romance. You are guaranteed to fall in love with all the characters, and you might even laugh a few times too.",
  "genres": [],
  "author": "Loran Adelle  Davis",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/57687500-a-sunrise-kind-of-love"
}