{
  "title": "Legend of the Mind",
  "description": "A Phildickian Trip thru Space, Time, and Beyond!A full-color illustrated graphic novel dedicated to author Philip K. Dick.This colorful, psychedelic adventure carries the reader along a convoluted stream of events like a leaf riding rapids. The loosely drawn, lively narrative panels are interspersed with dazzling full-page compositions of surreal magnificence.Space opera meets mysticism in a series of images that carries you beyond the familiar world and into pastures bizarre. In 'Legends of the Mind' our hero (David) flits from one state of reality to the next, waking from a dream, activating or deactivating an immersive hologram, or being teleported to a new realm. There is no way of telling which, if any, of the arenas he finds himself in are 'real' reality or some alternative illusion. Woken by his radio playing the song The Martian Time-Slip, David drops the hypodermic on the floor. Staggering to the bathroom he is 'zapped' into a space car, flying through the air towards a concert hall. Arrested for being a 'commie', he finds himself interrogated by a telepathic slime mold from Ganymede... a creature who soon becomes frustrated at David's dogged insistence on his conspiracy theories. Rescued from a mental institution by a mysterious author, he finds himself communing with a higher dimension of intelligence. A new journey begins.GUIDED  When reading on your mobile device or tablet, double-tap on a panel to enter Guided View. Swipe or tap to cinematically shift from panel-to-panel at your own pace! Each Guided View experience has been hand crafted to make sure you have the best possible adventure, no matter how small your device. Pages can also be manually zoomed in and out by the viewer using fingers.The Legend of the Mind consists of four primary chapters filled with time travel, telepathy, drug paranoia, political conspiracies, space travel, rock and roll, dystopian future, alternate realities, and spiritual overtones. There is also an epilogue that consists of fine art paintings inspired by quotes from Philip K. Dick's Exegesis, as well as illustrations to poems from poets that Philip K. Dick was inspired by.",
  "genres": [
    "Graphic Novels"
  ],
  "author": "Jeffrey Hopp",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/57679570-legend-of-the-mind"
}