{
  "title": "The Love Interest",
  "description": "Dear Fiona, I hope this letter finds you well—and by well, I mean significantly less infuriated than you were yesterday.I’ve wanted to continue our conversation from the night we met, but there are so many things I can’t say or do, now that I’m your professor.As an anonymous letter writer, I can give you some idea of what I have planned for us, once the year is over.As an author, I can share my work in progress with you.Not for you to critique but to show you how much you mean to me.When you’re done reading this page, destroy it—and then write me back.Don’t sign the letter. Don’t put a return address on the envelope. Mail it from a random mailbox.Yours in problem solving,MeP.S. I still think you’re wasting your talent on that historical romance novel.P.P.S. I really wanted to push you up against the door and kiss your beautiful, angry face. I will. One day.***Dear Emmett,Your handwriting is almost as terrible as your mood swings, and it would have been my instinct to destroy that letter even if you hadn’t ordered me to.If you show me your work in progress, I will critique it.I am currently still too infuriated to write about all the other feelings I have for you.Expect another letter soon.Your problem and your solution,MeP.S. I still think an overpaid, overrated, overly handsome bestselling author of thrillers has no business teaching creative writing at a prestigious New York university.P.P.S. To my great horror, I really wanted you to push me up against that door and kiss my angry face too. I understand now that your appalling way of treating me in class has been overcompensation, but I don’t forgive you for it. I’ll kiss you again anyway. One day.",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary Romance",
    "Contemporary",
    "College",
    "Humor",
    "Teachers"
  ],
  "author": "Kayley Loring",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/57679534-the-love-interest"
}