{
  "title": "Ages of American Capitalism: A History of the United States",
  "description": "A leading economic historian traces the evolution of American capitalism from the colonial era through the 2008 crash--and argues that we've come to yet another turning point.Inspired by the market crash and great recession of 2008, Jonathan Levy began teaching a course to help his students understand everything that had happened in the economy to get to that point. Working from the beginning of U.S. history to the present, he found that capitalism in America has evolved through four distinct ages, separated by dramatic cataclysms that each forced a major turn in how the economy operated. In an ambitious, single-volume history of the United States, he reveals how the country's economic evolution is inseparable from the nature of American life.The Age of Commerce spans the colonial era, the founding of the United States, and up to the outbreak of t he Civil War, a period of history where economic growth and output was the result of the spread of trade, but also largely dependent on enslaved labor and severely limited by what could be drawn from the land beyond subsistence farming. The Age of Capital traces the impact of the first major leap in economic development following the Civil War: the Industrial Revolution, when capitalists set physical capital down in factories to produce commercial goods, fueled by labor moving into cities. But, investments in the new industrial economy led to great volatility, most dramatically with the outbreak of the Great Depression in 1929. The Great Depression immediately sparked the Age of Control, when the government took on a more active role in the economy, first trying to jumpstart it and then funding military production in World War II. Skepticism of government intervention in the Cold War combined with recession and stagflation during the 1970s led to a crisis of industrial capitalism, and the withdrawal of political will for regulation. In the Age of Chaos that followed, the combination of deregulation and the growth of the finance industry created a booming economy for some but also striking inequalities and a lack of oversight that led directly to the crash of 2008.Today, in the aftermath of the Age of Chaos and in the midst of severe political discord, the nature of capitalism in United States once again is at a crossroads. In Ages of American Capitalism, Jonathan Levy proves that, contrary to political dogma, capitalism in the United States has never been just one thing. Instead, it has morphed through the country's history--and it's likely changing again right now.",
  "genres": [
    "History",
    "Economics",
    "Nonfiction",
    "Politics",
    "American History",
    "Business",
    "American"
  ],
  "author": "Jonathan  Levy",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/57679150-ages-of-american-capitalism"
}