{
  "title": "Things Are Never So Bad That They Can't Get Worse: Inside the Collapse of Venezuela",
  "description": "Named Foreign Affairs Best Books of 2022 and the National Endowment for Democracy Notable Books of 2022\"Richly reported...a thorough and important history.\" -Tim Padgett, The New York TimesA nuanced and deeply-reported account of the collapse of Venezuela, and what it could mean for the rest of the world.Today, Venezuela is a country of perpetual crisis―a country of rolling blackouts, nearly worthless currency, uncertain supply of water and food, and extreme poverty. In the same land where oil―the largest reserve in the world―sits so close to the surface that it bubbles from the ground, where gold and other mineral resources are abundant, and where the government spends billions of dollars on public works projects that go abandoned, the supermarket shelves are bare and the hospitals have no medicine. Twenty percent of the population has fled, creating the largest refugee exodus in the world, rivaling only war-torn Syria’s crisis. Venezuela’s collapse affects all of Latin America, as well as the United States and the international community.Republicans like to point to Venezuela as the perfect example of the emptiness of socialism, but it is a better model for something the destructive potential of charismatic populist leadership. The ascent of Hugo Chávez was a precursor to the emergence of strongmen that can now be seen all over the world, and the success of the corrupt economy he presided over only lasted while oil sold for more than $100 a barrel. Chávez’s regime and policies, which have been reinforced under Nicolás Maduro, squandered abundant resources and ultimately bankrupted the country.Things Are Never So Bad That They Can’t Get Worse is a fluid combination of journalism, memoir, and history that chronicles Venezuela’s tragic journey from petro-riches to poverty. Author William Neuman witnessed it all firsthand while living in Caracas and serving as the New York Times Andes Region Bureau Chief. His book paints a clear-eyed, riveting, and highly personal portrait of the crisis unfolding in real time, with all of its tropical surrealism, extremes of wealth and suffering, and gripping drama. It is also a heartfelt reflection of the country’s great beauty and vibrancy―and the energy, passion, and humor of its people, even under the most challenging circumstances.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Audiobook",
    "Economics",
    "Latin American History",
    "International Relations"
  ],
  "author": "William Neuman",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/57693395-things-are-never-so-bad-that-they-can-t-get-worse"
}