{
  "title": "The Last Days of the Dinosaurs: An Asteroid, Extinction, and the Beginning of Our World",
  "description": "Winner of the AAAS/Subaru Prize for Excellence in Science Books!\"This is top-drawer science writing.\" ―Publishers Weekly, starred reviewIn The Last Days of the Dinosaurs, Riley Black walks readers through what happened in the days, the years, the centuries, and the million years after the impact, tracking the sweeping disruptions that overtook this one spot, and imagining what might have been happening elsewhere on the globe. Life’s losses were sharp and deeply-felt, but the hope carried by the beings that survived sets the stage for the world as we know it now.Picture yourself in the Cretaceous period. It’s a sunny afternoon in the Hell Creek of ancient Montana 66 million years ago. A Triceratops horridus ambles along the edge of the forest. In a matter of hours, everything here will be wiped away. Lush verdure will be replaced with fire. Tyrannosaurus rex will be toppled from their throne, along with every other species of non-avian dinosaur no matter their size, diet, or disposition. They just don’t know it yet.The cause of this disaster was identified decades ago. An asteroid some seven miles across slammed into the Earth, leaving a geologic wound over 50 miles in diameter. In the terrible mass extinction that followed, more than half of known species vanished seemingly overnight. But this worst single day in the history of life on Earth was as critical for us as it was for the dinosaurs, as it allowed for evolutionary opportunities that were closed for the previous 100 million years.\"This is pop science that reads like a fantasy novel, but backed up by hard facts and the latest fossil discoveries. Black is pioneering a new narrative prehistorical nonfiction.\" ― Steve Brusatte, New York Times bestselling author of The Rise and Fall of the Dinosaurs",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Dinosaurs",
    "Palaeontology",
    "Nature",
    "Audiobook"
  ],
  "author": "Riley Black",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/57693295-the-last-days-of-the-dinosaurs"
}