{
  "title": "After the Romanovs: Russian Exiles in Paris from the Belle Époque Through Revolution and War",
  "description": "From Helen Rappaport, the New York Times bestselling author of The Romanov Sisters comes After the Romanovs, the story of the Russian aristocrats, artists, and intellectuals who sought freedom and refuge in the City of Light.Paris has always been a city of cultural excellence, fine wine and food, and the latest fashions. But it has also been a place of refuge for those fleeing persecution, never more so than before and after the Russian Revolution and the fall of the Romanov dynasty. For years, Russian aristocrats had enjoyed all that Belle Époque Paris had to offer, spending lavishly when they visited. It was a place of artistic experimentation, such as Diaghilev’s Ballets Russes. But the brutality of the Bolshevik takeover forced Russians of all types to flee their homeland, sometimes leaving with only the clothes on their backs.Arriving in Paris, former princes could be seen driving taxicabs, while their wives who could sew worked for the fashion houses, their unique Russian style serving as inspiration for designers like Coco Chanel. Talented intellectuals, artists, poets, philosophers, and writers struggled in exile, eking out a living at menial jobs. Some, like Bunin, Chagall and Stravinsky, encountered great success in the same Paris that welcomed Americans like Fitzgerald and Hemingway. Political activists sought to overthrow the Bolshevik regime from afar, while double agents from both sides plotted espionage and assassination. Others became trapped in a cycle of poverty and their all-consuming homesickness for Russia, the homeland they had been forced to abandon. This is their story.",
  "genres": [
    "History",
    "Nonfiction",
    "Russia",
    "France",
    "Historical",
    "European History",
    "Romanovs"
  ],
  "author": "Helen Rappaport",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/57693415-after-the-romanovs"
}