{
  "title": "Such a Pretty Smile",
  "description": "A biting novel from an electrifying new voice, Such a Pretty Smile is a heart-stopping tour-de-force about powerful women, angry men, and all the ways in which girls fight against the forces that try to silence them.There’s something out there that’s killing. Known only as The Cur, he leaves no traces, save for the torn bodies of girls, on the verge of becoming women, who are known as trouble-makers; those who refuse to conform, to know their place. Girls who don’t know when to shut up.2019: Thirteen-year-old Lila Sawyer has secrets she can’t share with anyone. Not the school psychologist she’s seeing. Not her father, who has a new wife, and a new baby. And not her mother—the infamous Caroline Sawyer, a unique artist whose eerie sculptures, made from bent twigs and crimped leaves, have made her a local celebrity. But soon Lila feels haunted from within, terrorized by a delicious evil that shows her how to find her voice—until she is punished for using it.2004: Caroline Sawyer hears dogs everywhere. Snarling, barking, teeth snapping that no one else seems to notice. At first, she blames the phantom sounds on her insomnia and her acute stress in caring for her ailing father. But then the delusions begin to take shape—both in her waking hours, and in the violent, visceral sculptures she creates while in a trance-like state. Her fiancé is convinced she needs help. Her new psychiatrist waves her “problem” away with pills. But Caroline’s past is a dark cellar, filled with repressed memories and a lurking horror that the men around her can’t understand.As past demons become a present threat, both Caroline and Lila must chase the source of this unrelenting, oppressive power to its malignant core. Brilliantly paced, unsettling to the bone, and unapologetically fierce, Such a Pretty Smile is a powerful allegory for what it can mean to be a woman, and an untamed rallying cry for anyone ever told to sit down, shut up, and smile pretty.",
  "genres": [
    "Horror",
    "Thriller",
    "Fiction",
    "Mystery",
    "Mystery Thriller",
    "Feminism",
    "Adult"
  ],
  "author": "Kristi DeMeester",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/57693146-such-a-pretty-smile"
}