{
  "title": "The Art of Looking Into the Future: The Five Principles of Technological Evolution",
  "description": "Looking into the future does not come naturally for most of us. In fact, it is hard enough for us to see past today! This book makes an effort to present a technique for looking into the future with real world examples. Together we will journey into a fascinating future and see our own life. As we travel together, we will notice all of the technological marvels of the future are inevitable because the human technological evolution is unstoppable. We will explore how human life will change and how future generations must be prepared to face it... And so begins The Art of Looking into the Future by R. S. Amblee, an intellectual powerhouse of ideas that introduces a forward-thinking school of thought. A provocative work of nonfiction that looks at how the world works in a whole new way, Amblee helps redefine what the future holds in such areas as healthcare, stock markets, real estate, education, outsourcing, global warming, and green initiatives. If his premise that the future rests in the ever-evolving arms of technology, then the future is bright--the future is very bright, indeed. Using a timeless, unchanged model of evolution, Amblee shows readers what to expect in the near future. Broken into four parts and over twenty chapters he illustrates in very specific terms how the world will increasingly depend on automation as well as globalization. A natural progression, Amblee describes how such evolution is often hidden in the rigors of daily life. As humans logically continue to develop, there's a pattern; the genius of Amblee's work is that he identifies it. He makes no blind assumptions in his a priori assessments, which are notably hopeful, of what the future will hold, and that these guiding principles of evolution will reveal solutions for challenges in most sectors. From such an evolutionary bird's eye view, man's survival is, if not imminent, secure.",
  "genres": [
    "Science",
    "Nonfiction"
  ],
  "author": "R.S. Amblee",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/12751019-the-art-of-looking-into-the-future"
}