{
  "title": "Buses Are a Comin'",
  "description": "A firsthand exploration of the cost of boarding the bus of change to move America forward ― written by one of the Civil Rights Movement's pioneers.At 18, Charles Person was the youngest of the original Freedom Riders, key figures in the U.S. Civil Rights Movement who left Washington, D.C. by bus in 1961, headed for New Orleans. This purposeful mix of black and white, male and female activists―including future Congressman John Lewis, Congress of Racial Equality Director James Farmer, Reverend Benjamin Elton Cox, journalist and pacifist James Peck, and CORE field secretary Genevieve Hughes―set out to discover whether America would abide by a Supreme Court decision that ruled segregation unconstitutional in bus depots, waiting areas, restaurants, and restrooms nationwide.Two buses proceeded through Virginia, North and South Carolina, to Georgia where they were greeted by Dr. Martin Luther King Jr., and finally to Alabama. There, the Freedom Riders found their No. Southern states would continue to disregard federal law and use violence to enforce racial segregation. One bus was burned to a shell, its riders narrowly escaping; the second, which Charles rode, was set upon by a mob that beat several riders nearly to death.Buses Are a Comin’ provides a front-row view of the struggle to belong in America, as Charles Person accompanies his colleagues off the bus, into the station, into the mob, and into history to help defeat segregation’s violent grip on African American lives. It is also a challenge from a teenager of a previous era to the young people of become agents of transformation. Stand firm. Create a more just and moral country where students have a voice, youth can make a difference, and everyone belongs.",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "Race",
    "Biography",
    "Social Justice",
    "Biography Memoir"
  ],
  "author": "Charles Person",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/57693301-buses-are-a-comin"
}