{
  "title": "God Is Here: Reimagining the Divine",
  "description": "Toba Spitzer's God Is Here is a transformative exploration of the idea of God, offering new paths to experiencing the realm of the sacred.Most of us are hungry for a system of meaning to make sense of our lives, yet traditional religion too often leaves those seeking spiritual sustenance unsatisfied. Rabbi Toba Spitzer understands this problem firsthand, and knows that too often it is traditional ideas of the deity―he's too big, too impersonal, and too unbelievable―that get in the way. In God Is Here, Spitzer argues that whether we believe in God or fervently disbelieve, what we are actually disagreeing about is not God at all, but a metaphor of a Big Powerful Person that limits our understanding and our spiritual lives.Going back to the earliest sources for Judaism as well as Christianity, Spitzer discovers in the Hebrew Bible a rich and varied palette of metaphors for the divine―including Water, Voice, Fire, Rock, Cloud, and even the process of Becoming. She addresses how we can access these ancient metaphors, as well as those drawn from rabbinic tradition and modern science, to experience holiness in our daily lives and to guide us in challenging times. In the section on water, for instance, she looks at the myriad ways water flows through the Biblical stories of the Israelites and emerges as a powerful metaphor for the divine in the Prophets and Psalms. She invites us to explore what it might mean to “drink from God,” or to experience godly justice as something that “rains down” and “flows like a river.”Each chapter contains insights from the Bible and teachings from Judaism and other spiritual traditions, accompanied by suggestions for practice to bring alive each of the God metaphors. Rabbi Toba Spitzer has helped many people satisfy their spiritual hunger. With God Is Here she will inspire you to find new and perhaps surprising ways of encountering the divine, right where you are.",
  "genres": [
    "Judaism",
    "Nonfiction",
    "Religion",
    "Spirituality",
    "Jewish",
    "Theology",
    "Judaica"
  ],
  "author": "Toba Spitzer",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/57693412-god-is-here"
}