{
  "title": "آل روتشيلد",
  "description": "لم يعد يعنيني من قريب أو بعيد من يجلس على عرش بريطانيا، لأننا منذ أن نجحنا في السيطرة على مصادر المال والثروة في الإمبراطورية البريطانية، قد نجحنا بالفعل في إخضاع السلطة الملكية لسلطة المال التي نمتلكها\".. هذه العبارة جاءت على لسان الداهية ناثان مؤسس الفرع الإنجليزي لعائلة روتشيلد، وأحد الأبناء الخمسة لمائير موسى باور المرابي اليهودي العالمي، ومهندس بروتوكولات حكماء صهيون، وأكبر وأخطر متآمر عرفه العالم، ومعه ذريته التي تدربت على يديه، قبل أن تتفوق عليه. وربما لو عاش مائير الذي اتخذ من الدرع الأحمر الذي وضعه الأب والمعلم اليهودي الداهية أيضاً أمشيل موسى باور على باب مؤسسته وقصره في مدينة فرانكفورت الألمانية ويعني بالألمانية \"روتشيلد\" لقباً للعائلة.. ربما لو عاش مائير دي روتشيلد لما صدق أن أبناءه قد نفذوا مخططاته ومؤامراته بدرجة تفوق كل ما كان يحلم به. وربما لو عاش أيضاً لما صدق أن أحفاده قد ورثوا الفكر اليهودي التآكري عن أبنائه، وأم منهم مثلاً ليونيل بن ناثان مؤسسة الفرع الإنجليزي، الذي أصبح لورد روتشيلد، واستطاع بالمال والخيانة والخديعة أن يشتري وعد بلفور المشؤوم، ليؤسس لقيام الكيان الصهيوني على أرض فلسطين. وربما لو عاش مائير مهندس البروتوكولات لما صدق أيضاً أن إدموند دي روتشيلد حفيده من ابنه جيمس مؤسس الفرع الفرنسي قد استطاع بأموال الأسرة الملعونة أن يبني المستوطنات الأولى على أرض فلسطين المغتصبة، ويصبح تاريخياً بالنسبة لليهود \"أبا الاستيطان اليهودي\". وربما لو عاش مائير الملقب بالمتآمر اليهودي الكبير لما صدق أن صور أبنائه قد اصبحت تعلو مدخل البرلمان \"الكنيست\" في الكيان المغتصب الذي كان من أوائل من خططوا لقيامه وزرعه على خريطة العالم من العدم \"إسرائيل\". ولم يكن ليصدق أن صورته هو سوف تتصدر العملة الورقية لهذا الكيان \"الشيكل الإسرائيلي\" اعترافاً من يهود العالم بدوره هو وعائلته من بعده في سرقة وطن واغتصاب دولة!! وهذا الكتاب عبارة عن دراسة تتناول قصة آل روتشيلد، الذين لطالما كانت حكمتهم تقول: \"السيطرة على الملك أفضل من الجلوس على العرش\"، وتميط اللثام عن بداياتها، ثم تتبع مشوارها حتى توحشت وابتعلت الجميع. هذا الكتاب هو عملية توثيق للمسار الجهنمي الذي قطعته أخطر عائلة يهودية، وتمكنت من خلاله، وبما لديها من عبقرية شيطانية، من تغيير مجرى التاريخ، وإعادة تشكيل خريطة العالم!",
  "genres": [
    "Politics",
    "Biography",
    "Nonfiction"
  ],
  "author": "مجدي كامل",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/5769160"
}