{
  "title": "The Method: How the Twentieth Century Learned to Act",
  "description": "National Book Critics Circle Award Winner, NonfictionNAMED ONE OF THE BEST BOOKS OF 2022 BY THE NEW YORKER , TIME MAGAZINE , SAN FRANCISCO CHRONICLE , VOX, SALON, LIT HUB, AND VANITY FAIR“Entertaining and illuminating.”-- The New Yorker * “Compulsively readable.”-- New York Times * “Delicious, humane, probing.”-- Vulture * “The best and most important book about acting I’ve ever read.”--Nathan LaneThe critically acclaimed cultural history of Method acting―an ebullient account of creative discovery and the birth of classic Hollywood.On stage and screen, we know a great performance when we see it. But how do actors draw from their bodies and minds to turn their selves into art? What is the craft of being an authentic fake? More than a century ago, amid tsarist Russia’s crushing repression, one of the most talented actors ever, Konstantin Stanislavski, asked these very questions, reached deep into himself, and emerged with an answer. How his “system” remade itself into the Method and forever transformed American theater and film is an unlikely saga that has never before been fully told.Now, critic and theater director Isaac Butler chronicles the history of the Method in a narrative that transports readers from Moscow to New York to Los Angeles, from The Seagull to A Streetcar Named Desire to Raging Bull . He traces how a cohort of American mavericks--including Stella Adler, Lee Strasberg, and the storied Group Theatre--refashioned Stanislavski’s ideas for a Depression-plagued nation that had yet to find its place as an artistic powerhouse. The Group’s feuds and rivalries would, in turn, shape generations of actors who enabled Hollywood to become the global dream-factory it is today. Some of these performers the Method would uplift; others, it would destroy. Long after its midcentury heyday, the Method lives on as one of the most influential--and misunderstood--ideas in American culture.Studded with marquee names--from Marlon Brando, Marilyn Monroe, and Elia Kazan, to James Baldwin, Ellen Burstyn, and Dustin Hoffman-- The Method is a spirited history of ideas and a must-read for any fan of Broadway or American film.",
  "genres": [
    "Nonfiction",
    "Film",
    "History",
    "Theatre",
    "Art",
    "Media Tie In",
    "Drama"
  ],
  "author": "Isaac Butler",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/57693266-the-method"
}