{
  "title": "Damn Lucky: One Man's Courage During the Bloodiest Military Campaign in Aviation History",
  "description": "From Kevin Maurer―the #1 New York Times bestselling, award-winning coauthor of No Easy Day ―comes the true story of a World War II bomber pilot who survived twenty-five missions in Damn Lucky , “an epic, thrillingly written, utterly immersive account of a very lucky, incredible survivor of the war in the skies to defeat Hitler” ( New York Times bestselling author Alex Kershaw).“We were young citizen-soldiers, terribly naive and gullible about what we would be confronted with in the air war over Europe and the profound effect it would have upon every fiber of our being for the rest of our lives. We were all afraid, but it was beyond our power to quit. We volunteered for the service and, once trained and overseas, felt we had no choice but to fulfill the mission assigned. My hope is that this book honors the men with whom I served by telling the truth about what it took to climb into the cold blue and fight for our lives over and over again.”―John “Lucky” Luckadoo, Major, USAF (Ret.) 100th Bomb Group (H)Pearl Harbor, Hawaii was a world away from John Luckadoo’s hometown of Chattanooga, Tennessee. But when the Japanese attacked the American naval base on December 7, 1941, he didn’t hesitate to join the military. Trained as a pilot with the United States Air Force, Second Lieutenant Luckadoo was assigned to the 100th Bomb Group stationed in Thorpe Abbotts, England. Between June and October 1943, he flew B-17 Flying Fortresses over France and Germany on bombing runs devised to destroy the Nazi war machine.With a shrapnel torn Bible in his flight jacket pocket and his girlfriend’s silk stocking around his neck like a scarf as talismans, Luckadoo piloted through Luftwaffe machine-gun fire and antiaircraft flak while enduring subzero temperatures to complete twenty-five missions and his combat service. The average bomber crew rarely survived after eight to twelve missions. Knowing far too many airmen who wouldn’t be returning home, Luckadoo closed off his emotions and focused on his tasks to finish his tour of duty one moment at a time, realizing his success was more about being lucky than being skilled.Drawn from Luckadoo’s firsthand accounts, acclaimed war correspondent Kevin Maurer shares his extraordinary tale from war to peacetime, uncovering astonishing feats of bravery during the bloodiest military campaign in aviation history, and presenting an incredible portrait of a young man’s coming-of-age during the world’s most devastating war.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "World War II",
    "War",
    "Military Fiction",
    "Memoir"
  ],
  "author": "Kevin Maurer",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/57693304-damn-lucky"
}