{
  "title": "Mickey7",
  "description": "After several deaths punctuating a series of all-too-brief life spans, a clone reassesses his purpose – and his humanity – in Edward Ashton’s Mickey7, “a unique blend of thought-provoking sci-fi concepts, farcical relationship drama, and exotic body horror” (New York Times bestselling author Jason Pargin).EXPENDABLE \\ik’spen-d’-b’l\\ n. A human clone utilized for dangerous work on space exploration missions. An Expendable’s personality and memories may be transferred intact to a new body if and when the current host dies.Mickey Barnes is an Expendable, now on his seventh iteration, living – and dying – among his fellow colonists on the near-uninhabitable ice world of Niflheim. Some consider him immortal. Others believe he’s a soulless monstrosity. For the past nine years, he has been deployed for hazardous assignments and subjected to experiments that test the limits of human endurance, his humanity sacrificed for the greater good.While on reconnaissance, Mickey7 is injured and left for dead, only to be saved by Niflheim’s native species, thought to be insentient by the colonists. Returning to base, Mickey7 meets his next generation, Mickey8. Neither clone is willing to recycle himself, but if anyone discovers multiple Mickeys exist, they’ll both be executed – and there won’t ever be a Mickey9.But Mickey7’s premature twin isn’t his only secret. He hasn’t uploaded his memories in a month, leaving his clone in the dark about his near death and close encounter with the planet’s inhabitants. Mickey7 also doesn’t know how all of his previous selves died, and those he remembers have left him traumatized and mistrustful of the colony’s mission. A mission that has Mickey Barnes questioning his moral and mortal existence...again...and again....",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Space",
    "Adult",
    "Book Club",
    "Fantasy"
  ],
  "author": "Edward Ashton",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/57693457-mickey7"
}