{
  "title": "Reckless Girls",
  "description": "From the New York Times bestselling author of The Wife Upstairs comes a deliciously wicked gothic suspense, set on an isolated Pacific island with a dark history, for fans of Lucy Foley and Ruth Ware.When Lux McAllister and her boyfriend, Nico, are hired to sail two women to a remote island in the South Pacific, it seems like the opportunity of a lifetime. Stuck in a dead-end job in Hawaii, and longing to travel the world after a family tragedy, Lux is eager to climb on board The Susannah and set out on an adventure. She’s also quick to bond with their passengers, college best friends Brittany and Amma. The two women say they want to travel off the beaten path. But like Lux, they may have other reasons to be seeking an escape.Shimmering on the horizon after days at sea, Meroe Island is every bit the paradise the foursome expects, despite a mysterious history of shipwrecks, cannibalism, and even rumors of murder. But what they don’t expect is to discover another boat already anchored off Meroe’s sandy beaches. The owners of the Azure Sky, Jake and Eliza, are a true golden couple: gorgeous, laidback, and if their sleek catamaran and well-stocked bar are any indication, rich. Now a party of six, the new friends settle in to experience life on an exotic island, and the serenity of being completely off the grid. Lux hasn’t felt like she truly belonged anywhere in years, yet here on Meroe, with these fellow free spirits, she finally has a sense of peace.But with the arrival of a skeevy stranger sailing alone in pursuit of a darker kind of good time, the balance of the group is disrupted. Soon, cracks begin to emerge: it seems that Brittany and Amma haven’t been completely honest with Lux about their pasts––and perhaps not even with each other. And though Jake and Eliza seem like the perfect pair, the rocky history of their relationship begins to resurface, and their reasons for sailing to Meroe might not be as innocent as they first appeared.When it becomes clear that the group is even more cut off from civilization than they initially thought, it starts to feel like the island itself is closing in on them. And when one person goes missing, and another turns up dead, Lux begins to wonder if any of them are going to make it off the island alive.",
  "genres": [
    "Thriller",
    "Mystery",
    "Audiobook",
    "Mystery Thriller",
    "Fiction",
    "Suspense",
    "Adult"
  ],
  "author": "Rachel Hawkins",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/57693168-reckless-girls"
}