{
  "title": "Little Souls",
  "description": "Now a Denver Post bestsellerFinalist, 2023 Colorado Book AwardsSandra Dallas's Little Souls is a gripping tale of sisterhood, loyalty, and secrets set in Denver amid America’s last deadly flu pandemic.Colorado, 1918. World War I is raging overseas, but it’s the home front battling for survival. With the Spanish Flu rampant, Denver’s schools are converted into hospitals, churches and funeral homes are closed, and horse-drawn wagons collect corpses left in the street. Sisters Helen and Lutie have moved to Denver from Iowa after their parents’ deaths. Helen, a nurse, and Lutie, a carefree advertising designer at a fashionable women’s store share a small, neat house, and each finds a local beau―for Helen a doctor, for Lutie a young student who soon enlists. They make a modest income from a rental apartment in the basement. When their tenant dies from the flu, the sisters are thrust into caring for the woman’s small daughter, Dorothy. Soon after, Lutie comes home from work and discovers a dead man on their kitchen floor and Helen standing above the body, an icepick in hand. She has no doubt Helen killed the man―Dorothy’s father―in self-defense, but she knows that will be hard to prove. They decide to leave the body in the street, hoping to disguise it as a flu victim.Meanwhile Lutie also worries about her fiancé “over there.” As it happens, his wealthy mother harbors a secret of her own and helps the sisters as the danger deepens, from both the murder investigation and the outbreak.Set against the backdrop of an epidemic that feels all too familiar, Little Souls is a compelling tale of sisterhood and of the sacrifices people make to protect those they love most.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Audiobook",
    "Historical",
    "Romance",
    "Mystery",
    "World War I"
  ],
  "author": "Sandra Dallas",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/57693298-little-souls"
}