{
  "title": "The Man Who Tasted Words: A Neurologist Explores the Strange and Startling World of Our Senses",
  "description": "In The Man Who Tasted Words, neurologist Guy Leschziner leads readers through the five senses and how, through them, our brain understands or misunderstands the world around us.Vision, hearing, taste, smell, and touch are what we rely on to perceive the reality of our world. Our five senses are the conduits that bring us the scent of a freshly brewed cup of coffee or the notes of a favorite song suddenly playing on the radio. But are they really that reliable? The Man Who Tasted Words shows that what we perceive to be absolute truths of the world around us is actually a complex internal reconstruction by our minds and nervous systems. The translation into experiences with conscious meaning―the pattern of light and dark on the retina that is transformed into the face of a loved one, for instance―is a process that is invisible, undetected by ourselves, and, in most cases, completely out of our control.Leschziner explores how our nervous systems define our worlds and how we can, in fact, be victims of falsehoods perpetrated by our own brains. In his moving and lyrical chronicles of lives turned upside down by a disruption in one or more of their five senses, he introduces readers to extraordinary individuals, like one man who actually “tasted” words, and shows us how sensory disruptions like that have wreaked havoc, not only on their view of the world, but also on their relationships. The cases Leschziner shares are extreme, but they are also human, and they teach us that both our lives and what we perceive as reality are ultimately defined by the complexities of the nervous system.",
  "genres": [
    "Nonfiction",
    "Science",
    "Psychology",
    "Neuroscience",
    "Medical",
    "Health",
    "Medicine"
  ],
  "author": "Guy Leschziner",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/57693441-the-man-who-tasted-words"
}