{
  "title": "Let's Get Physical: How Women Discovered Exercise and Reshaped the World",
  "description": "A captivating blend of reportage and personal narrative that explores the untold history of women's exercise culture--from jogging and Jazzercise to Jane Fonda--and how women have parlayed physical strength into other forms of power.\nFor American women today, working out is as accepted as it is expected, fueling a multibillion-dollar fitness industrial complex. But it wasn't always this way. Seven decades ago, sweating was \"unladylike\" and girls grew up believing that physical exertion would cause their uterus to \"fall out.\" Most hid their muscle under sleeves and skirts. It was only in the Sixties that, thanks to a few forward-thinking fitness pioneers, women began to move en masse. When they did, journalist Danielle Friedman argues, they were participating in something subversive: the pursuit of physical strength and personal autonomy.In Let's Get Physical, Friedman reveals the fascinating hidden history of contemporary fitness culture, chronicling in vivid, cinematic prose how exercise evolved from a beauty tool sold almost exclusively as a way to \"reduce\" to one millions have harnessed as a path to mental, emotional, and physical well-being.Inspired by Friedman's viral article in New York Magazine's the Cut that unearthed the little-known origins of the popular barre workout, Let's Get Physical takes us into the workout studios and onto the mats of 20th century America to reclaim these forgotten origins. Each chapter uncovers the birth of an exercise movement that laid the groundwork for working out today: the radical post-war pitch for women to break a sweat, the invention of barre in the Swinging Sixties, jogging's path to liberation in the Seventies, the explosion of aerobic dancing in the Eighties, the rise of weight-training and yoga, and the ongoing push for a more socially just fitness culture--one that is inclusive of every body.Ultimately, Let's Get Physical tells the story of how, with the rise of late 20th century feminism, women discovered the joy of physical competence--and how, by moving together to transform fitness from a privilege into a right, we can create a more powerful sisterhood.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Audiobook",
    "Health",
    "Sports",
    "Womens"
  ],
  "author": "Danielle Friedman",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/57699965-let-s-get-physical"
}