{
  "title": "The Doomsday Mother: Lori Vallow, Chad Daybell, and the End of an American Family",
  "description": "In The Doomsday Mother , bestselling true crime author John Glatt tells the twisted tale of Lori Vallow, accused of having her two children murdered to start a new life with her new husband, doomsday prepper Chad Daybell.At first, the residents of Kauai Beach Resort took little notice of their new neighbors. The glamorous blonde and her tall husband fit the image of the ritzy gated community. The couple seemed to keep to themselves―until the police knocked on their door with a search warrant. Lori Vallow and Chad Daybell had fled to Hawaii in the midst of being investigated for the disappearance of Lori’s children back in Idaho―Tylee and JJ―who hadn’t been seen alive in five months.For years, Lori Vallow had been devoted to her children and her Mormon faith. But when her path crossed with Chad Daybell, a religious zealot who taught his followers how to prepare for the end-times, the tumultuous relationship transformed her into someone unrecognizable. As authorities searched for Lori’s children, they uncovered more suspicious deaths with links to both Lori and Chad, including the death of Lori’s third and fourth husbands, her brother, and Chad’s wife. In June 2020, the gruesome remains of JJ and Tylee were discovered on Chad’s property, and the newlyweds were arrested and charged with murder. And in a shocking development, horrifying statements revealed that the couple’s fanatical beliefs had convinced them the children had become zombies--a belief that may have led to their deaths.Bestselling author and journalist John Glatt takes readers deeper into the devastating story of Lori Vallow and Chad Daybell in an attempt to unravel the lethal relationship of this doomsday couple.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "Cults",
    "Religion",
    "Mystery"
  ],
  "author": "John Glatt",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/57693511-the-doomsday-mother"
}