{
  "title": "Wish You Were Here",
  "description": "From the #1 New York Times bestselling author of Small Great Things and The Book of Two Ways comes comes a deeply moving novel about the resilience of the human spirit in a moment of crisis.Jodi Picoult once again proves she is the master of wading through the darkness to find the light. Wish You Were Here is a powerfully evocative story of resilience and the triumph of the human spirit.--Taylor Jenkins Reid, New York Times bestselling author of Malibu RisingSynopsisDiana O’Toole is perfectly on track. She will be married by thirty, done having kids by thirty-five, and move out to the New York City suburbs, all while climbing the professional ladder in the cutthroat art auction world. She’s an associate specialist at Sotheby’s now, but her boss has hinted at a promotion if she can close a deal with a high-profile client. She’s not engaged just yet, but she knows her boyfriend, Finn, a surgical resident, is about to propose on their romantic getaway to the Galapagos—days before her thirtieth birthday. Right on time.But then a virus that felt worlds away has appeared in the city, and on the eve of their departure, Finn breaks the news: It’s all hands on deck at the hospital. He has to stay behind. You should still go, he assures her, since it would be a shame for all of their nonrefundable trip to go to waste. And so, reluctantly, she goes.Almost immediately, Diana’s dream vacation goes awry. Her luggage is lost, the Wi-Fi is nearly nonexistent, and the hotel they’d booked is shut down due to the pandemic. In fact, the whole island is now under quarantine, and she is stranded until the borders reopen. Completely isolated, she must venture beyond her comfort zone. Slowly, she carves out a connection with a local family when a teenager with a secret opens up to Diana, despite her father’s suspicion of outsiders.In the Galapagos Islands, where Darwin’s theory of natural selection was formed, Diana finds herself examining her relationships, her choices, and herself—and wondering if when she goes home, she too will have evolved into someone completely different.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Book Club",
    "Romance",
    "Adult",
    "Adult Fiction"
  ],
  "author": "Jodi Picoult",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/57701764-wish-you-were-here"
}