{
  "title": "Seeking Wisdom",
  "description": "Julia Cameron returns to the spiritual roots of the Artist’s Way in this 6-week ProgramAuthor Julia Cameron changed the way the world thinks about creativity when she first published The Artist’s A Spiritual Path to Higher Creativity thirty years ago. Over five million copies later, Cameron now turns her attention to creative prayer, which she believes is a key facet of the creative life. In Seeking Wisdom , a 6 Week Artist’s Way Program, readers, too, will learn to pray.Tracing her own creative journey, Cameron reveals that prayer led her forward at a time of personal crisis. Unexpectedly, prayer became an indispensable support to her artistic life. The tools she created to save herself in her darkest hour became the tools she would share with the world through The Artist's Way . Seeking Wisdom details the origin of these tools, and by Cameron's example, the central role that prayer plays in sustaining a life as an artist.In this volume, Cameron shares a mindful collection of prayer practices that open our creative souls. This path takes us beyond traditional religious rituals, welcoming readers regardless of their beliefs and backgrounds. As you journey through each week of the program you’ll explore prayers of petition, gratitude, creativity, and more. Along the way, the three beloved tools of The Artist’s Way ―Morning Pages, Artist Dates, and Walks―are refreshed and reintroduced, to provide a proven, grounded framework for growth and development.Additionally, Cameron introduces a fourth tool, Writing Out Guidance. She believes this powerful practice will greatly aid aspiring artists.Seeking Wisdom issues an invitation to step further into exciting creative practice.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Spirituality",
    "Writing",
    "Art",
    "Unfinished",
    "Inspirational"
  ],
  "author": "Julia Cameron",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/57693526-seeking-wisdom"
}