{
  "title": "The Local",
  "description": "\"A freewheeling, small-town attorney takes on a national murder trial when an out-of-town client is accused of killing a federal judge in Texas. In the town of Marshall sits the Federal courthouse of the Eastern District of Texas, a place revered by patent lawyers for its speedy jury trials and massive punitive payouts. Marshall is flooded with patent lawyers, all of whom find work being the local voice for the big-city legal teams that need to sway a small-town jury. One of the best is James Euchre. Euchre's new client is Amir Zawar, a firebrand CEO forced to defend his life's work against a software patent infringement. Late one night, after a heated confrontation in a preliminary hearing, Judge Gardner is found murdered in the courthouse parking lot. All signs point to Zawar-he has motive, he has opportunity, and he has no alibi. Moreover, he is an outsider, a wealthy Pakistani-American businessman, the son of immigrants, who stands accused of killing a beloved hometown hero. Zawar claims his innocence, and demands that Euchre defend him. It's the last thing Euchre wants-Judge Gardner was his good friend and mentor-but the only way he can get definitive answers is to take the case. With the help of a former prosecutor and a local PI, Euchre must navigate the byzantine world of criminal defense law in a town where everyone knows everyone, and bad blood has a long history. The deeper he digs, the more he fears that he'll either send an innocent man to death row or set a murderer free. The Local is a small-town legal thriller as big in scope as Texas. It crackles with courtroom tension and high stakes gambits on every page to the final, shocking verdict. Joey Hartstone is a film and television writer. He has written two feature films, LBJ (2016) and Shock and Awe (2017), which were both directed by Rob Reiner. He wrote on the first two seasons of the legal drama The Good Fight. He is currently a writer on the Showtime series Your Honor. Joey lives in Los Angeles with his family\"--",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Legal Thriller",
    "Audiobook",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "Joey  Hartstone",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/57695215-the-local"
}