{
  "title": "Dilla Time: The Life and Afterlife of J Dilla, the Hip-Hop Producer Who Reinvented Rhythm",
  "description": "Equal parts biography, musicology, and cultural history, Dilla Time chronicles the life and legacy of J Dilla, a musical genius who transformed the sound of popular music for the twenty-first century.He wasn’t known to mainstream audiences, even though he worked with renowned acts like D’Angelo and Erykah Badu and influenced the music of superstars like Michael Jackson and Janet Jackson. He died at the age of thirty-two, and in his lifetime he never had a pop hit. Yet since his death, J Dilla has become a demigod: revered by jazz musicians and rap icons from Robert Glasper to Kendrick Lamar; memorialized in symphonies and taught at universities. And at the core of this adulation is innovation: a new kind of musical time-feel that he created on a drum machine, but one that changed the way “traditional” musicians play.In Dilla Time, Dan Charnas chronicles the life of James DeWitt Yancey, from his gifted childhood in Detroit, to his rise as a Grammy-nominated hip-hop producer, to the rare blood disease that caused his premature death; and follows the people who kept him and his ideas alive. He also rewinds the histories of American rhythms: from the birth of soul in Dilla’s own “Motown,” to funk, techno, and disco. Here, music is a story of Black culture in America and of what happens when human and machine times are synthesized into something new. Dilla Time is a different kind of book about music, a visual experience with graphics that build those concepts step by step for fans and novices alike, teaching us to “see” and feel rhythm in a unique and enjoyable way.Dilla’s beats, startling some people with their seeming “sloppiness,” were actually the work of a perfectionist almost spiritually devoted to his music. This is the story of the man and his machines, his family, friends, partners, and celebrity collaborators. Culled from more than 150 interviews about one of the most important and influential musical figures of the past hundred years, Dilla Time is a book as delightfully detail-oriented and unique as J Dilla’s music itself.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Hip Hop",
    "History",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Dan Charnas",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/57693653-dilla-time"
}