{
  "title": "সেই সময়",
  "description": "এই সেই সময় যখন কলকাতার বাবুসমাজ সুরা, নারী ও বুলবুলি-বিলাসে মগ্ন, যখন নব্যশিক্ষিত যুবকেরা প্রাণপণে ইংরেজ-অনুকরণে মত্ত, গ্রাম নিঃস্ব করে প্রজাশোষণের অর্থে চলেছে সংস্কৃতি চর্চা, সমাজ ও ধর্মসংস্কার, তরুণ বিদ্যাসাগর রাত্রি জেগে রেড়ির তেলের আলোয় রচনা করছেন বাংলা গদ্যভাষা, জেগে উঠছে মধ্যবিত্ত শ্রেণী, এই সেই সময়—হ্যাঁ, একটি বিশেষ সময়ই সুনীল গঙ্গোপাধ্যায়ের এই সুকীর্তিত উপন্যাসের মুখ্য চরিত্র। তিনি নিজেও এ-উপন্যাস সম্পর্কে লিখতে গিয়ে বলেছেন—“আমার কাহিনীর পটভূমিকা ১৮৪০ থেকে ১৮৭০ খ্রীষ্টাব্দ। এবং এই কাহিনীর মূল নায়কের নাম সময়।” লিখেছেন, “সময়কে রক্ত-মাংসে জীবিত করতে হলে অন্তত একটি প্রতীক চরিত্র গ্রহণ করতে হয়। নবীনকুমার সেই সময়ের প্রতীক। তার জন্মকাহিনী থেকে তার জীবনের নানা ঘটনার বৈপরীত্য, শেষ দিকে এক অচেনা যুবতীর মধ্যে মার্তৃরূপ দর্শন এবং অদ্ভুত ধরনের মৃত্যু, সবই যে সেই প্রতীকের ধারাবাহিকতা, আশা করি তা আর বিশদভাবে এখানে বলার প্রয়োজন নেই। প্রয়োজনীয় কথা শুধু এই যে, নবীনকুমারের চরিত্রে এক অকাল-মৃত অসাধারণ ঐতিহাসিক যুবকের কিছুটা আদল আছে। অন্য কোনো প্রসিদ্ধ পুরুষের নাম বা জীবনকাহিনী আমি বদল করিনি....”।সত্যিই তাই। নাটকের শুরুতে যেমন দেওয়া থাকে পাত্রপাত্রীর নাম ও পরিচয়, তেমনভাবে এই বিপুল বর্ণাঢ্য উপন্যাসের গোড়াতেই যদি দেওয়া থাকত নবীনকুমারের সমকালীন চরিত্রাবলির নাম, বস্তুতই বিস্ময়কর মনে হত সেই তালিকা। মাইকেল, বিদ্যাসাগর, ডিরোজিও, হেয়ার সাহেব, দেবেন ঠাকুর—কে নেই। সমগ্র ঊনবিংশ শতাব্দীই যেন নানান চরিত্র হয়ে চোখের সামনে জীবন্ত।যেটুকু তফাৎ তা হল, গবেষকের রচনায় প্রাণ থাকে না, সুনীল গঙ্গোপাধ্যায় সেই প্রাণটি প্রতিষ্ঠা করেছেন।এক দুরন্ত সময়ের জীবন্ত চলচ্চিত্র ‘সেই সময়’। বঙ্কিম ও আকাদেমি পুরস্কারে সম্মানিত এই গ্রন্থের দুটি খণ্ডকে এক মলাটের মধ্যে এনে সম্পূর্ণ নতুন আকারে প্রকাশিত হল এই রাজসংস্করণ। এ-গ্রন্থের বিপুল সমাদর ও স্থায়ী কীর্তিমূল্যের কথা ম্ননে রেখে এ-এক আনন্দ-শ্রদ্ধাঞ্জলি।",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "India",
    "Historical",
    "Classics",
    "Novels",
    "Indian Literature"
  ],
  "author": "Sunil Gangopadhyay",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/10290924"
}