{
  "title": "Losing Our Minds: The Challenge of Defining Mental Illness",
  "description": "A compelling and incisive book that questions the overuse of mental health terms to describe universal human emotions.Public awareness of mental illness has been transformed in recent years, but our understanding of how to define it has yet to catch up. Too often, psychiatric disorders are confused with the inherent stresses and challenges of human experience. A narrative has taken hold that a mental health crisis has been building among young people. In this profoundly sensitive and constructive book, psychologist Lucy Foulkes argues that the crisis is one of ignorance as much as illness. Have we raised a 'snowflake' generation? Or are today's young people subjected to greater stress, exacerbated by social media, than ever before? Foulkes shows that both perspectives are useful but limited. The real question in need of answering is: how should we distinguish between 'normal' suffering and actual illness?Drawing on her extensive knowledge of the scientific and clinical literature, Foulkes explains what is known about mental health problems—how they arise, why they so often appear during adolescence, the various tools we have to cope with them—but also what remains unclear: distinguishing between normality and disorder is essential if we are to provide the appropriate help, but no clear line between the two exists in nature. Providing necessary clarity and nuance, Losing Our Minds argues that the widespread misunderstanding of this aspect of mental illness might be contributing to its apparent prevalence.PRAISE“This is a book that calls for nuance in answering difficult questions…To Foulkes, the way forward is in acceptance of a hard truth: we need to support everyone who is struggling in a way geared to their needs; we need a different conversation about managing life’s sadness.” —The Times (London)“Dr. Foulkes writes exquisitely well about this complex subject...Engaging and lucid, her book illuminates a subject relevant to all of us.” —Sarah-Jayne Blakemore, author of Inventing Ourselves: The Secret Life of the Teenage Brain\"Blending thoughtful analysis, clinical vignettes and her own young adult experience of depression, Foulkes skillfully examines key themes in the youthful onset of common mental disorders. Eloquently written and thoroughly researched, it is a welcome addition to the field.\" —B. Janet Hibbs and Anthony Rostain, authors of The Stressed Years of Their LivesDr Lucy Foulkes is an academic psychologist at UCL and the Anna Freud Centre in the UK. Her research focuses on mental health and social development, particularly in adolescence. She lives in London",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Science",
    "Self Help",
    "Health",
    "Audiobook"
  ],
  "author": "Lucy Foulkes",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/57693494-losing-our-minds"
}