{
  "title": "Life Between the Tides",
  "description": "Adam Nicolson explores the marine life inhabiting seashore rockpools with a scientist's curiosity and a poet's wonder in this beautifully illustrated book. The sea is not made of water. Creatures are its genes. Look down as you crouch over the shallows of a rockpool and you will find a periwinkle or a prawn, a claw-displaying crab or a cluster of anemones ready to meet you. Go to the rocks and the living will say hello.Inside each rockpool, tucked into one of the infinite crevices of the tidal coastline, lies a rippling, silent, unknowable universe. Below the stillness of the surface course different currents of endless motion--the ebb and flow of the tide, the steady forward propulsion of the passage of time, and the tiny lifetimes of its creatures, all of which coalesce into the grand narrative of evolution.In The Sea Is Not Made of Water, Adam Nicolson investigates one of the most revelatory habitats on earth. Under his microscope, we see a prawn's head become a medieval helmet and a group of \"winkles\" transform a Dickensian social scene, with mollusks munching on Stilton and glancing at their pocket watches. Or, rather, is a winkle more like Achilles, an ancient hero, throwing himself toward death for the sake of glory? For Nicolson, who writes \"with scientific rigor and a poet's sense of wonder\" (The American Scholar), the world of the rockpools is infinite and as intricate as our own.As Nicolson journeys between the tides, both in the pools he builds along the coast of Scotland and through the timeline of scientific discovery, he is accompanied by great thinkers--no one can escape the pull of the sea. We meet Virginia Woolf and her Waves; a young T. S. Eliot peering into his own rockpool in Massachusetts; even Nicolson's father-in-law, a classical scholar who would hunt for amethysts along the shoreline, his mind on Heraclitus and the Hellenists. And, of course, scientists populate the pages; not only their discoveries, but also their doubts and errors, their moments of quiet observation and their thrilling realizations.It is all within the rockpools, where you can look beyond your own reflection and find the miraculous an inch beneath your nose. \"The soul wants to be wet,\" Heraclitus said in Ephesus twenty-five hundred years ago. This marvelous book demonstrates why it is so.Includes Color and Black-and-White Photographs",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "Natural History",
    "Environment",
    "Animals",
    "Audiobook"
  ],
  "author": "Adam Nicolson",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/57693629-life-between-the-tides"
}