{
  "title": "The Past Came Hunting",
  "description": "\"Donnell Ann Bell has crafted a beautifully written story of love and redemption, with a sizzling suspense at its core. The Past Came Hunting is a page turner!\" -Kylie Brant, national bestselling author\"Donnell Ann Bell's debut novel The Past Came Hunting is a gripping read - a tale of love, deceit and facing down the sins of the past. A fast-moving and engrossing story, The Past Came Hunting will keep you up turning the pages. A thoroughly satisfying read!\" -Jeanne Adams, award-winning suspense authorShock made her numb.It wasn't possible. How had she missed the connection? She hadn't thought of the man in years. The cop who'd arrested her, his name had been . . . Crandall.Somehow Mel found the strength to look into his eyes. And when she did, she came face to face with what could only be a mutually shocked expression.\"You,\" she whispered.\"You,\" he replied.Fifteen years ago a young Colorado Springs police officer arrested a teen runaway accused of aiding a convenience store robbery and attempted murder. She was innocent, but still served prison time briefly. Her testimony sent the real thief to jail for much longer. Now she's a young widow raising a son, and the man she put in prison is free and seeking revenge. She moves to a home in a new neighborhood-then learns that her next-door neighbor is the by-the-book officer who arrested her. Now he's a Colorado Springs P.D. Lieutenant. Like it or not, he may be the only one who can protect her and her son from the past he helped create.Donnell Ann Bell is the recipient of numerous awards for her fiction writing and the co-owner of Crimescenewriters, a Yahoo group for mystery/suspense writers, which is 2,000 members strong. Donnell was raised in New Mexico's Land of Enchantment and today calls Colorado home. www.DonnellAnnBell.com",
  "genres": [
    "Romance",
    "Suspense",
    "Romantic Suspense",
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller"
  ],
  "author": "Donnell Ann Bell",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/12751829-the-past-came-hunting"
}