{
  "title": "Mistakes Not to Make When Avoiding a Rake",
  "description": "In the sleepy country village of Bedford, the promise of love can transform the most world-weary rake, and the power of passion can move a proud young woman to repent of even her most stubborn prejudices.A cynical rake...The arrival of Thomas Campbell and his elder brother has the village of Bedford abuzz with excitement. Not only is Thomas tall, dark, and handsome, he is also rumored to be a most notorious rake.Claire Gardner is young, innocent, and completely infuriating. Yet given an opportunity, Thomas can't help teaching the headstrong beauty a lesson in desire.A quiet life for a lady...Content with a simple rural life, Claire Gardner has no wish for a season in London, nor is she eager to wed. But after a catastrophic mistake compromises her honor, Claire finds herself ensnared in scandal.Claire is quite certain reformed rakes do not make the best husbands. She would rather face shame than lose her freedom to a man she is convinced does not love her. But as rumors swirl regarding her ruined reputation, the condemnation of her neighbors becomes more than she can bear.Tormented by a bitter betrayal, Thomas has steeled himself against ever loving again—but he harbors a secret which leaves him in need of a wife. Will the truth about the other woman in Thomas’s life destroy their marriage before it has even begun?Mistakes Not to Make When Avoiding a Rake is a standalone story. No cheating, no cliffhangers, and a happily ever after.Series: The Gardner Girls, Book 1 (However, each book is a complete story which may be read in any order.)Heat Level: Sweet-with-Heat, Slow Burn",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Enemies To Lovers",
    "Regency Romance"
  ],
  "author": "Fenna Edgewood",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/57735045-mistakes-not-to-make-when-avoiding-a-rake"
}