{
  "title": "Big Panda and Tiny Dragon",
  "description": "A thought-provoking journey of companionship, courage, tenderness, and tea.Big Panda and Tiny Dragon embark on a journey through the seasons of the year together. They get lost, as many of us do. But while lost, they discover many beautiful sights they'd never have found had they gone the right way. Told through a series of beautiful drawings and quiet, sometimes silly, conversations, the panda and the dragon explore the thoughts and emotions, hardships and happiness that connect us all. In nature, they learn how to live in the moment, how to be at peace with uncertainty, and how to find the strength to overcome life's obstacles together.  Inspired by Buddhist philosophy and spirituality, British author and artist James Norbury created the adventures of Big Panda and Tiny Dragon to share ideas that have helped him through difficult times. The book’s series of vignettes can be read cover to cover or dipped into whenever inspiration is needed. James hopes the book’s words and images will inspire others to pause, enjoy the stillness, and look at life in a positive new way.           WORDS OF WISDOM: The seemingly simple, and often silly, conversations between Big Panda and Tiny Dragon reveal meaningful insights on friendship, inner wisdom, and self-acceptance.  INSPIRING IMAGES: Depicted in bold brush strokes reminiscent of calligraphy, big, fluffy Panda and tiny, wiry Dragon journey through rolling hills, wooded forests, and blooming meadows in more than 120 elegant black-and-white and full-color scenes.   FOR READERS OF ALL AGES: From youngsters at story time to new graduates with the world ahead of them to adults in moments of challenge or transition, Big Panda and Tiny Dragon offer comfort, inspiration, and a wry smile for every reader.        WORK OF ART: Featuring a beautiful cover and a collection of stunning illustrations, each one more beautiful than the next, every page in this book is worthy of framing.  HEARTFELT GIFT: Full of wisdom and touching humor, Big Panda and Tiny Dragon  makes a thoughtful gift to be treasured.",
  "genres": [
    "Fiction",
    "Philosophy",
    "Graphic Novels",
    "Self Help",
    "Poetry",
    "Art",
    "Picture Books"
  ],
  "author": "James Norbury",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/57732605-big-panda-and-tiny-dragon"
}