{
  "title": "In the Event of Love",
  "description": "Fans of Casey McQuiston and Alexandria Bellefleur will adore this queer romcom that combines everything people love about Hallmark-style holiday romances with laugh-out-loud humor and a sweet and steamy love story between two women.With her career as a Los Angeles event planner imploding after a tabloid blowup, Morgan Ross isn’t headed home for the holidays so much as in strategic retreat. Breathtaking mountain vistas, quirky townsfolk, and charming small businesses aside, her hometown of Fern Falls is built of one heartbreak on top of another . . . Take her one-time best friend turned crush, Rachel Reed. The memory of their perfect, doomed first kiss is still fresh as new-fallen snow. Way fresher than the freezing mud Morgan ends up sprawled in on her very first day back, only to be hauled out via Rachel’s sexy new lumberjane muscles acquired from running her family tree farm.When Morgan discovers that the Reeds’ struggling tree farm is the only thing standing between Fern Falls and corporate greed destroying the whole town’s livelihood, she decides she can put heartbreak aside to save the farm by planning her best fundraiser yet. She has all the inspiration for a spectacular event: delicious vanilla lattes, acoustic guitars under majestic pines, a cozy barn surrounded by brilliant stars. But she and Rachel will ABSOLUTELY NOT have a heartwarming holiday happy ending. That would be as unprofessional as it is unlikely. Right?“Full of swoony steam, heartfelt charm, and laugh-out-loud moments, In the Event of Love is exactly the slow-burn, second-chance, friends-to-lovers romance I was craving. Treat yourself to the beautiful magic of Courtney Kae’s writing!” –Ali Hazelwood, New York Times bestselling author of The Love Hypothesis",
  "genres": [
    "Romance",
    "LGBT",
    "Christmas",
    "Lesbian",
    "Queer",
    "Holiday",
    "Contemporary"
  ],
  "author": "Courtney Kae",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/57730503-in-the-event-of-love"
}