{
  "title": "The 1619 Project: A New Origin Story",
  "description": "The 1619 Project: A New Origin Story offers a revealing vision of the American past and present. In late August 1619, a ship arrived in the British colony of Virginia bearing a cargo of twenty to thirty enslaved people from Africa. Their arrival led to the barbaric and unprecedented system of American chattel slavery that would last for the next 250 years. This is sometimes referred to as the country’s original sin, but it is more than that: It is the source of so much that still defines the United States. The 1619 Project: A New Origin Story builds on The New York Times Magazine’s award-winning “1619 Project,” which reframed our understanding of American history by placing slavery and its continuing legacy at the center of our national narrative. This book substantially expands on the original \"1619 Project, \"weaving together eighteen essays that explore the legacy of slavery in present-day America with thirty-six poems and works of fiction that illuminate key moments of oppression, struggle, and resistance. The essays show how the inheritance of 1619 reaches into every part of contemporary American society, from politics, music, diet, traffic, and citizenship to capitalism, religion, and our democracy itself. This legacy can be seen in the way we tell stories, the way we teach our children, and the way we remember. Together, the elements of the book reveal a new origin story for the United States, one that helps explain not only the persistence of anti-Black racism and inequality in American life today, but also the roots of what makes the country unique.  The book also features an elaboration of the original project’s Pulitzer Prize–winning lead essay by Nikole Hannah-Jones on how the struggles of Black Americans have expanded democracy for all Americans, as well as two original pieces from Hannah-Jones, one of which makes a case for reparative solutions to this legacy of injustice.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Social Justice",
    "Audiobook",
    "Essays",
    "American History"
  ],
  "author": "Nikole Hannah-Jones",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/57717410-the-1619-project"
}