{
  "title": "The Deep Zone",
  "description": "In this gripping debut thriller from James M. Tabor, a brilliant and beautiful scientist and a mysterious special ops soldier must lead a team deep into the Earth on a desperate hunt for the cure to a deadly epidemic. When she was unjustly fired from a clandestine government laboratory, microbiologist Hallie Leland swore she would never look back. But she can’t ignore an urgent summons from the White House to reenter the realm of cutting-edge science and dangerous secrets. “Potentially the worst threat since Pearl Harbor” is how the president describes a mysterious epidemic killing American soldiers  in Afghanistan—and now poised for outbreak in the States and beyond. Millions will die unless Hallie and a hastily mobilized team can recover the ultrarare organism needed to create a new antibiotic. The good news is that Hallie knows more about the organism than anyone else on the planet. The bad news is that it can be found only at the bottom of Earth’s deepest cave. Hallie’s team is capable—especially the mysterious Wil Bowman, who knows as much about high-tech weaponry as he does about microbiology—but the challenge appears insurmountable. Before even reaching the supercave, they must traverse a forbidding Mexican jungle populated by warring cartels, Federales, and murderous locals. Only then can they confront the cave’s flooded tunnels, lakes of acid, bottomless chasms, and mind-warping blackness. But the deadliest enemies are hiding in plain a powerful traitor high in the Washington ranks and a cunning assassin deep underground, determined to turn Hallie’s mission into a journey of no return. The award-winning and bestselling author of two nonfiction books about adventure and exploration, James M. Tabor now plunges readers into the harrowing subterranean world of supercaves—and even deeper, into a race-with-the-devil thriller that pits one woman against a lethal epidemic and a murderous conspiracy.",
  "genres": [
    "Thriller",
    "Fiction",
    "Adventure",
    "Suspense",
    "Science Fiction",
    "Action",
    "Mystery Thriller"
  ],
  "author": "James M. Tabor",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/12752235-the-deep-zone"
}