{
  "title": "Master of the Moors",
  "description": "Kealan Patrick Burke makes his full-length novel debut with what was originally an e-serial novel a couple of years back. Now fully revised and reworked from it’s original rapid-fire online delivery, it comes out in a nice-looking signed/limited hardcover from Necessary Evil Press. So what of the tale itself? This is Burke’s love-letter to the old Hammer horror films of the late `50’s to the early `70’s. He deftly takes the feel of those old foggy London backgrounds and adds a modern touch to it. All of which succeeds to flesh out the characters more realistically. Without giving too much away, he also takes on a classic archetype and infuses it with a fresh idea and life. The story focuses on teenaged Kate Mansfield and her blind brother Neil. Their father is in a virtually catatonic state after something he witnessed in the moors many years before while tracking something with some of the other townsfolk. The siblings are being raised by their house and groundskeeper now. With the arrival of a mysterious visitor to the town, it kicks off a chain of events linked to the mysterious happenings in the moors that day many years before. Burke manages to keep much of the cliffhanger feel of the online serial which works well for maintaining the suspense throughout. It’s another solid entry into his strong body of work. I think regardless if you were one of the ones who read it online before, or are just coming to it for the first time, it’s a must have for two first, it’s a killer story by a writer who is only getting better and better as time goes on and second, it’s another beautifully crafted hardcover limited from NEP, who is one of the best small press publishers out there (and one who sells out most of their stock fairly quick! Just try and find a copy of Kealan’s novella The Turtle Boy from a few years back. If you do, it’ll cost you.). Plain and simple, grab one while you can! -- Dark Discoveries - Reviewed by James R. Beach",
  "genres": [
    "Horror",
    "Werewolves",
    "Gothic",
    "Mystery"
  ],
  "author": "Kealan Patrick Burke",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/5771506-master-of-the-moors"
}