{
  "title": "The Darkness That Slept",
  "description": "Reader's Favorite reviews gave it multiple 5 star reviews@Readers'Favorite.comThe safety and isolation of the far North is gone, shattered by a legion of religious fanatics and the looming invasion of their very-real gods. In defiance rises the High-Warden, forsaking peace and solitude to fight a war he cannot win. Without alternative and in desperate need of time, he must race to wake the sleeping powers of his land, risk even the conniving games of a Fae court. Not everything is as it seems though, and this war may have more than one purpose.The demon Brimares is summoned from the Abyss and tasked with killing the High-Warden, ensuring their invasion breaks the North. She doesn’t care. Her only goal is to survive and delay getting dragged back into the hellish Abyss. That goal complicates, however, when allies decide she’s the perfect target for their torments and a scheming general takes a shrouded interest in her.  Further south across the Inland Sea, Dieharamon’s life is a tired slog through bloody sands, all choice and worth stripped away as he’s forced to kill for the entertainment of an entire city. But fate shifts when he encounters an ancient relic and it offers a fragile hope. Amidst all the death, there is a foreigner called Dayada Avenar. Dieharamon just needs to find him and protect him as skies darken, a coup brews in the blood-soaked city, and a terrifying stranger comes seeking aid for a war on the North. Meanwhile, in the seemingly uninvolved city of Tellor, rogue thief and grinning jester Slade Lammerock welcomes an emissary from Carr’Selain and the all-knowing Thieves Guild. The emissary extends a dangerous offer, pulling Slade into a treacherous web of deceit, greed, and uncertain alliances with powerful enemies. Matters complicate further when he’s given a young charge of worldly importance and an assassin comes hunting…",
  "genres": [
    "Fantasy",
    "High Fantasy",
    "Fae",
    "Dark Fantasy"
  ],
  "author": "Tristen Kozinski",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/57723454-the-darkness-that-slept"
}