{
  "title": "Wayne Gerard Trotman's Rhyming Stories",
  "description": "Wayne Gerard Trotman's Rhyming Stories is a 270-page anthology of seven award-winning illustrated children's poems introduced by Benjamin Zephaniah:The Last Honey Bee [Finalist - The Wishing Shelf Book Awards]A Tiger's Tale [Silver - The Wishing Shelf Book Awards]An Elephant's Advice [Winner - Purple Dragonfly Book Award]Mattie Boombalatty [Gold - Literary Titan Book Awards]Song of the Blue Whale [Gold - Literary Titan Book Awards]A Letter from a Gorilla [Gold - Literary Titan Book Awards]A Turtle's Adventures [Winner - Purple Dragonfly Book Award]Wayne Gerard Trotman's Rhyming Stories was a finalist in the 2021 Readers' Favorite Book Award Contest, in the category Children - Educational.Reviewed by Trisha Dawn for Readers' Favorite - 5 StarsWayne Gerard Trotman's Rhyming Stories: An Anthology of Seven Illustrated Children's Poems is a collection of different, witty poems focused on different modern concerns. The book starts off with a poem about honey bees, followed by a poem about the animals from the forests and seas, and a poem about a pure-hearted girl and her struggles in her new life in the city. Each page is filled with amazing and vibrant illustrations that children would surely adore. Join the characters of each poem as they tell the story of a whole different world from their perspective!Wayne Gerard Trotman's Rhyming Stories, introduced by Benjamin Zephaniah, is a fascinating and lovely series of poems that parents will surely enjoy reading with their children. It is filled with lessons mostly about the environment and animals, which is exactly what children need. The different poems truly helped me see the problems we are currently facing in our environment. Each poem has eye-catching illustrations, illustrated by Nhat Hao Nguyen, which added to the beauty of the stories and helped me clearly visualize the message each poem was trying to impart. I felt the sadness in each poem as they struggled to get through the problems they were facing and even sadder knowing that these problems are really happening around us. This book not only teaches us the consequences of the irresponsibility of mankind’s actions but also presents us with solutions to help make the world a better place. Overall, this was truly an eye-opening and awe-inspiring book. Well done!Reviewed by Emily-Jane Hills Orford for Readers' Favorite - 5 StarsAn orphaned honeybee tells its sad tale of being alone, lonely, and unable to pollinate our fruit trees or even make honey. Sad, but true, that honeybees are an endangered species. Telling the story from a honeybee’s point of view makes the tale all the more electrifying. “I’m from a land/ Across the sea/ An unhappy land/ Oh, what a pity/ There’s no more milk/ And no more honey/ In what was once/ A place of plenty.” The honeybee keeps meeting other living creatures and trying to explain its plight. It’s a sad tale, almost too close to the truth. And then there’s the story of Tun Tun, the six-year-old elephant whose greatest fear is the human poacher who threatens his family. “Run Tun Tun Tun, run Tun Tun/ I see a poacher with his gun/ Don’t wait for me just quickly flee/ Run Tun Tun Tun, run Tun Tun.” You can hear the panic in Tun Tun’s mother’s voice; the poacher, of course, means danger.Wayne Gerard Trotman’s Rhyming Stories: An Anthology of Seven Illustrated Children’s Poems is a compelling look at what we’ve done to our planet. Stories told in rhyming verse and accompanied by vibrant, colorful illustrations will teach readers young and old about the plight of other life forms on our planet and their struggle for survival. These are teaching stories, but parables too, cleverly told using the voice of the oppressed. The lyrical nature of the rhyming verses makes the stories sing their sorry tale and hopefully, the reader will listen, learn, and do all they can to change this downward trend toward disaster. But the stories are also fun, intuitive, and very insightful. These are stories about “all creatures great and small” told with both care and compassion.Reviewed by Bruce Arrington for Readers' Favorite - 5 StarsWayne Gerard Trotman's Rhyming Stories: An Anthology of Seven Illustrated Children's Poems by Wayne Gerard Trotman is a collection of seven different stories, all in one large volume. The target audience is children, and so the illustrations are geared toward that age group. Most of the stories (The Last Honey Bee, A Tiger’s Tale, An Elephant’s Advice, Song of the Blue Whale, A Letter From a Gorilla, and A Turtle’s Adventures) have strong conservation themes, targeting humans as the underlying cause of species population problems.Fortunately, the book also goes on to show that people can be a part of the solution instead of only the problem. This gives the reader a more hopeful view of how problems can be solved. The story, Mattie Boombalatty, is about a girl who is forced to move with her family because of a lost job. But the school is full of bullies and she has to deal with them. This is a fantasy story wherein a magical creature takes justice into his own hands, jeopardizing the lives of the bullies. Will Mattie stand up for them or let them go to ruin?The artwork is professional, colorful, and filled with lots of detail that will make the reader want to come back again and again. The artistic aspect helps young readers connect much better with the messages presented by the author. Wayne Gerard Trotman's Rhyming Stories: An Anthology of Seven Illustrated Children's Poems is a recommended collection that will inspire young readers.",
  "genres": [],
  "author": "Wayne Gerard Trotman",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/57744551-wayne-gerard-trotman-s-rhyming-stories"
}