{
  "title": "Shadow of the Son",
  "description": "“Ivan Obolensky possesses the narrative magic of great novelists, due to his ability to put together scenes, create dramatic tension, and slide characters into unexpected situations. The surprising succession of events prevents us from putting the book down… Obolensky invokes an experience that the reader, beyond just following the plot, lives the events as an exceptional witness.”-Marta Botero, JournalistWhat if someone set a deadly curse on you?Shadow of the Son is Book 2 in the award-winning Eye of the Moon series. It is preceded by Book 1 Eye of the Moon and followed by Book 3 Dark of the Earth.The novel starts shortly after the end of Eye of the Moon, with Percy confronting the imminent arrival of the infamous Lord Bromley at Rhinebeck. Lord Bromley has vowed to take back artifacts from the secret library that are rightfully his. He also says he’s at Rhinebeck to make peace with Alice, his former wife, but the dead don’t always want peace. Sometimes, they would rather settle for revenge. Shadow of the Son is a complex psychological thriller about family drama, gothic mystery, and extraordinary magic. Reading Shadow of the Son will captivate you. Get it now.“The first ‘stand-alone’ novel, Eye of the Moon, is a page-turner that weaves together stories and characters that will leave you wanting more. That's exactly what happened with the sequel, Shadow of the Son, which does not disappoint! I was literally up till 2 am for three nights. Set in historic Rhinebeck NY, two young men brought up as brothers pick up from the first novel and plan for a weekend of uninvited guests, aristocratic entanglements, paranormal visions, magical potions, and a sequence of events that kept my head spinning. Ivan Obolensky is a master wordsmith and storyteller. I left, still wanting more.”-Jane Ubell-Meyer, Founder Bedside Reading.",
  "genres": [
    "Mystery Thriller"
  ],
  "author": "Ivan Obolensky",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/57756111-shadow-of-the-son"
}