{
  "title": "#The Leftover Bride",
  "description": "For fans of second chance romance novels, holiday romance novels, rom-coms & small town romance novels.\nAll Sorcha O'Connor wants for Christmas is for her life to turn into a Hallmark movie—but sexier. Ryan Sawyer has a few things on his wishlist, such as staying away from Swans Cove and getting his career back on track. And he wants Sorcha. Always has, always will.When wedding dress designer Sorcha O'Connor got stranded at the altar and went viral as #TheLeftoverBride, she lost her fiancé, her thriving business, and her dreams. To forget the upcoming first anniversary of that fateful day, Sorcha is ticking items off her \"31 Things to Do Before the 31st\" list and working day and night to get her life back on track. Not on her list? Falling for her former best friend, Ryan Sawyer. Again. Ryan Sawyer skated out of Swans Cove right out of high school. Since then, he busted his ass, making sure he always had the perfect excuse to stay away: hockey. But even his own hashtag, #HockeyHottie, couldn't keep his injuries from possibly shattering his career. With the holidays and his mother's birthday coming up, Ryan's back in Swans Cove for a quick visit. Even though he’s supposed to lay low, he can't stop thinking about Sorcha, the redhead who knows him better than even his therapist.When Sorcha's former #RunawayGroom becomes the Most Coveted Bachelor in America, virtual eyes turn to Sorcha again. This time, Ryan won't bolt—even as Sorcha blurts out on national TV that both she and Ryan are working on their so-called \"Happy Lists\" over the holidays…together.Will the spotlight finally work in Sorcha and Ryan's favor? Or will their past—and their hashtags—get in the way of their Happily Ever After?One-click today to start reading this Hallmark's movie sexier and sassier cousin!#TheLeftoverBride is a second chance romance set during the holiday season in a small town on Maryland's Eastern Shore: full of laughter and heartwarming moments (and some sexy moments), checklists, family dynamics, a stubborn cat, and a rescue dog.",
  "genres": [
    "Christmas",
    "Romance",
    "Contemporary Romance",
    "Holiday",
    "Second Chance",
    "Second Chance Romance",
    "Contemporary"
  ],
  "author": "Elodie Nowodazkij",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/57746923-the-leftover-bride"
}