{
  "title": "The Beach House",
  "description": "“Oh, my goodness,” she whispered. At the bottom of the box was a stack of letters. Tied with a ribbon, the pages were faded with age. “These are all addressed from here,” she said, “but they’ve never been sent.”When her gram passes away, Melanie Simpson feels utterly lost. She has no idea what to do with her life after she has devoted years to looking after her beloved grandmother.But Gram’s will may hold the answer, instructing Melanie to use her inheritance to buy a crumbling house in Rosemary Bay. They used to visit the village every summer, sit by the sparkling gulf on a beach the color of a fresh pearl, and daydream about turning the place on the corner into a bed and breakfast.Fulfilling her grandmother’s legacy, Melanie decides to restore the beach house to its original glory. She sets out on renovations of the wrap-around porch weathered by the coastal breeze, and the peeling white paint faded by the sun.When Melanie runs into local carpenter, Josh Claiborne, whose eyes match the dazzling sea, she jumps at the chance to ask him for help. But that’s the last thing he wants. He’s off to New York soon, leaving his troubled past behind. Over a game of darts Melanie gets her wish, even if Josh isn’t happy about it.As they work together, Melanie tries to ignore their undeniable chemistry and how Josh’s rare smiles take her breath away––because soon they’ll be thousands of miles apart. But hiding in a closet is a yellowing stack of letters that could change everything. The looping handwriting reveals the mystery of the rickety house––a buried history that touches everyone in Rosemary Bay. Will its secrets bring Melanie and Josh together or tear them apart?An absolutely gorgeous and heartwarming read about never-ending love, new beginnings, and how family is always with you, no matter where you are. Fans of Pamela Kelley, Mary Alice Monroe and Susan Mallery will adore this romantic page-turner.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Adult",
    "Womens Fiction"
  ],
  "author": "Jenny  Hale",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/57742077-the-beach-house"
}