{
  "title": "See Beneath Your Beautiful",
  "description": "The only way she feels safe is when she’s in control. But falling in love is all about losing it…Libby Thompson has not exactly had the easiest childhood in the world.After being abandoned by her father at twelve and getting bullied for months on end, it took years of hard work, cognitive behavior therapy, and her mother’s unconditional love for her to become who she is an educated, successful, attractive young woman who just has a nightmare or two every now and then.But Libby knows how to keep the nightmares at bay.She just has to avoid risks.And Noah Rodrigo is the wildest risk she’s ever taken.Libby feels it the moment Chelsea, her best and only friend, introduces them casually at a party.Noah is handsome, charming, patient, and all around perfect.He’s also about to jeopardize everything Libby has been working so hard to a life of self discipline, celibacy, and professional success.Is he worth this gamble, or will he just leave her to pick up the pieces once again?See Beneath Your Beautiful is a heartwarming series standalone closed-door romance full of sizzling chemistry. Reviews for See Beneath Your Beautiful ★★★★★ “This book is engaging. The very first paragraph sets the scene and pulled me in. I love the culture that is showcased in the book. The setting is beautifully described throughout the book, and I could clearly see Libby and Noah in my head as they fall in love and find their way to each other. Libby reminds me of myself, and when I read this book, I was instantly rooting for her.” – Bobbi ★★★★★ “It's a cute, thoughtful, cosy, girl-meets-guy story peppered with classic challenges and self-imposed barriers that must be overcome if that inevitable happy ending is to be seized.” – Ellionamerikanida ★★★★★ “This story is so beautiful and so real. It’s incredibly easy to enjoy both characters, like them and frankly, wish they were your friends. The setting, the dialogues, the background stories are excellently and beautifully written.” – Avid Reader ★★★★★ “That was an amazing story about mental health and love and insecurities. Thank you for that griping story. What a great love story!” – Synna Kent ★★★★★ “See Beneath Your Beautiful is a wonderful love story with vivid imagery, authentic characters, and a well-written plot. Author Eunice Nascimento approaches the female protagonist’s struggles with gentleness and compassion, leading the reader to connect with her journey and to cheer for her to take the steps needed for her healing. The humour sprinkled along the way lightens the story at just the right times.” – SheenaM",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Eunice Nascimento",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/57744616-see-beneath-your-beautiful"
}