{
  "title": "The Adventures of Miss Barbara Pym",
  "description": "‘Captures both Barbara and her writing so miraculously’ JILLY COOPERPicked as a Book to Look Forward to in 2021 by the Guardian, The Times and the ObserverA Radio 4 Book of the Week, April 2021Barbara Pym became beloved as one of the wittiest novelists of the late twentieth century, revealing the inner workings of domestic life so brilliantly that her friend Philip Larkin announced her the era’s own Jane Austen. But who was Barbara Pym and why was the life of this English writer – one of the greatest chroniclers of the human heart – so defined by rejection, both in her writing and in love?Pym lived through extraordinary times. She attended Oxford in the thirties when women were the minority. She spent time in Nazi Germany, falling for a man who was close to Hitler. She made a career on the Home Front as a single working girl in London’s bedsit land. Through all of this, she wrote. Diaries, notes, letters, stories and more than a dozen novels – which as Byrne shows more often than not reflected the themes of Pym’s own worlds of spinster sisters and academics in unrequited love, of powerful intimacies that pulled together seemingly humble lives.Paula Byrne’s new biography is the first to make full use of Barbara Pym’s archive. Brimming with new extracts from Pym’s diaries, letters and novels, this book is a joyous introduction to a woman who was herself the very best of company.Byrne brings Barbara Pym back to centre stage as one of the great English a generous, shrewdly perceptive writer and a brave woman, who only in the last years of her life was suddenly, resoundingly recognised for her genius.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Books About Books",
    "Biography Memoir",
    "British Literature",
    "Memoir",
    "Audiobook"
  ],
  "author": "Paula Byrne",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/57741865-the-adventures-of-miss-barbara-pym"
}