{
  "title": "Cyber Attack on America: SuperAvni and Dabung Girl: A new age Superhero Graphic Novel / Comic Book for teens and adolescents",
  "description": "A must-read fictional comic book about SuperAvni and Dabung Girl, who work together with Kamala Harris, US Vice President to save America from a cyber attack. If you have not read it yet, you are missing something!Who is SuperAvni?SuperAvni is a next-gen superhero who combines empathy and technology to fight modern-day challenges. SuperAvni might be a superhero, but just like each one of us, she has a vulnerable aspect to her. Every time she uses next-gen empathy to connect with someone and feel their emotions, she is left drained. Her energy level falls drastically, and there is just one way she can regain her strength…food and music!Who is Dabung Girl? A new Indian superhero is here, and this time, it is a female superhero, Dabung Girl. She is a fearless hero, who has an elastic body as her superpower. However, unlike some other superheroes, who come and save the day, she helps children find solutions on their own. The imagination, creativity, and fun continues throughout the comic. This comic book inspires children to find their inner superheroes.Why do millions of adolescents and children love reading SuperAvni and Dabung Girl comics / graphic novels?★ They inspire them to learn, take action, and break stereotypes.★ Presents India's very own girl superheroes with relatable stories on overcoming gender biases.★ Meticulously researched and expertly written, this book is packed with vivid, carefully created artwork, illuminating infographics, and insightfully curated dialogues that make the readers think.★ Validated by educators as a valuable resource to encourage constructive dialogues.Does it really work?✓ Research shows that superhero stories give wings to the imagination and confidence of children. Children feel more empowered when they hear stories of superheroes. Often, the problems that seem very difficult can be solved if we believe in ourselves.✓ The impact of the story is empowered girls with confidence and knowledge, and at the same time, build gender sensitivity among boys, which is needed to build a better societyDo I need to know anything more?♥ Apart from winning hearts, Dabung Girl and SuperAvni are also winning several awards. Dabung Girl is also the winner of the best emerging comic book series for children at the prestigious CBAM Awards 2021.♥ SuperAvni won best comic book of the year award at CBAM awards 2021 by AnimationxpressWho are the authors of this story?Saurabh Agarwal - A Harvard University and IIT alumni who is a life skills educator and has conducted hundreds of experiential learning workshops with children and youth..Abhishek Singh - A global storyteller and an ex-management consultant with over a decade of experience across health, communications, media, and social sectors.KAVOOOM! So what are you waiting for?Don't forget to check out and read more Dabung Girl and SuperAvni books! ♥♥♥Other  Dabang Girl , Dabangg Girl , दबंग गर्ल, Super Avni, सुपर अवनी, सुपरअवनी",
  "genres": [],
  "author": "Saurabh Agarwal",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/57748691-cyber-attack-on-america"
}