{
  "title": "Laena's Elite",
  "description": "Over a hundred years ago the Eidolon virus ravaged the globe causing not only the dead to rise again, but also caused human males to vastly outnumber females. To revive the population, the law now requires women to marry more than one husband in order to ensure humanity’s survival. As a result, family lineages are now matriarchal, giving females more rights and protections thus raising them to a protected and endangered status.LaenaLaena Kanata has lived all her life constantly on the move, never staying too long in one place. Her father raised her by himself out in the wild expanse, outside the Seven Cities, learning to survive and to protect herself from Eidolon threats. She doesn’t know why they can’t live in one of the cities like the rest of the freethinking world, but her father isn’t forthcoming with an answer. All she knows is that they can never be discovered.Then came the one day she is left to fend for herself, and it’s the same day she is forced out of hiding.Vance, Rennick, and ReeseAs Elite members and army heroes in their own right, these three friends stumble upon a lone, unregistered female just inside the walls of their home city of New Phoenix. Their attraction to her is instant, but the mystery and secrets surrounding Laena should be enough to make them steer clear. With her arrival, they are thrown into a maelstrom of lies and long-buried secrets that threaten their way of life.Even with the attraction on both sides being mutual, it takes the all-out effort of these three warriors to convince Laena that she belongs with them. Together, they work together to uncover how bright their passion burns for this strong woman, along with the secrets that shroud not just Laena herself, but their entire world as they know it.",
  "genres": [
    "Reverse Harem",
    "Menage",
    "Fantasy",
    "Military Fiction",
    "Dystopia",
    "Erotica"
  ],
  "author": "Quinn Fisher",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/57753418-laena-s-elite"
}