{
  "title": "Skin of the Night",
  "description": "A modern woman scares people. Her drive, her ambition, her independence. She’s an enigma, and people often hate what they don't understand. But, to William, she's the perfect woman, and he will stop at nothing to solve the mystery of her.Cara is a top law student in London. She's got her life together and is dead set on realising her ambitions, so finding a romantic partner is not among her priorities – at least for now. Besides, she’s whole all on her own – she doesn’t need a man in order to feel complete. With loyal, genuine friends, a supportive family and an overall comfortable lifestyle, Cara is happy with her life as it is. So, when William crosses her path, it throws a real spanner in the works.The dashing lawyer boasts the most merciless tongue Cara has ever come across, whether it’s in debate or in bed. Blunt and sharply clever, he ticks every box, and even adds some of his own – things Cara never knew she desired in a man. Before long, he puts her convictions on trial, and he drives a ferocious prosecution. Cara finds it hard to resist him, but being together could have disastrous consequences. If William wins the trial, she may lose more than just her heart.Packed with complex characters, steamy scenes and cheeky dialogue, The Night series is sure to bring you on a journey of laughter, frustration, tears, and deep reflections you won't forget anytime soon.\nWarning:\n This is not your typical romance story. Consider skipping this book if you’re looking for a wholesome, comfortable read. The characters are very flawed and are written that way intentionally, as this series has a particular focus on character complexity and development. It is not a plot-driven story.This book contains several sexually explicit scenes. It is intended for mature audiences.Skin of the Night is the first book in The Night series. Books 3 & 4 haven't been published yet.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Adult",
    "Fiction",
    "New Adult",
    "Workplace Romance"
  ],
  "author": "Claire D.  Bennett",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/57739590-skin-of-the-night"
}