{
  "title": "Tales of Beastkin: Shiro",
  "description": "When an alpha wolf shifter mafia boss meets a beaten-up foxkin boy on the run, both their lives change in an unexpected way. A steamy hurt-comfort paranormal shifter alpha-omega mm romance. Adam The Beautiful Monster. Alpha wolf shifter Adam Sullivan, dubbed The Beautiful Monster, is on a “sabbatical leave” of his position as the head honcho of one of the most powerful mafia clans in America. Relishing in his newfound peaceful life, Adam’s wonderful tranquility is being threatened when he happens upon a beaten-up foxkin youth in the back alley of New York City. The moment Adam lays his eyes on the exquisite white-haired, cobalt-blue-eyed Shiro, he is beguiled and knows he’ll be kissing his serene life goodbye if he doesn’t walk away. When Shiro begs for his help, Adam loses the fight to the inevitability and takes the boy home. Shiro Into the arms of a beautiful monster… Shiro is a beastkin, a race of humans with small animal characteristics society despises. Having escaped the institute, he lives in the backstreet scavenging for survival. When Adam saves him after a deadly beating, he is grateful. It isn’t long when Shiro finds himself falling in love with Adam, whose rough exterior and standoffish kindness steals the boy’s fragile heart. Shiro knows he can’t linger around and take advantage of Adam’s generosity, but leaving is just so damn hard, especially when Adam makes him feels he belongs, a feeling he desperately yearns for. Tales of Beastkin: Shiro is a hurt-comfort paranormal shifter alpha-omega mm romance (boys love, yaoi) with some dark themes. The uke (Shiro) is a beautiful beastkin (a race of humans with small animal characteristics) and the seme (Adam) is an alpha shifter hunk.",
  "genres": [
    "M M Romance",
    "Omegaverse",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Fantasy",
    "M M Paranormal"
  ],
  "author": "Bella Chan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/57768335-tales-of-beastkin"
}