{
  "title": "Infinite Country",
  "description": "For readers of Valeria Luiselli and Edwidge Danticat, an urgent and lyrical novel about a Colombian family fractured by deportation, offering an intimate perspective on an experience that so many have endured—and are enduring right now. At the dawn of the new millennium, Colombia is a country devastated by half a century of violence. Elena and Mauro are teenagers when they meet, their blooming love an antidote to the mounting brutality of life in Bogotá. Once their first daughter is born, and facing grim economic prospects, they set their sights on the United States. They travel to Houston and send wages back to Elena’s mother, all the while weighing whether to risk overstaying their tourist visas or to return to Bogotá. As their family expands, and they move again and again, their decision to ignore their exit dates plunges the young family into the precariousness of undocumented status, the threat of discovery menacing a life already strained. When Mauro is deported, Elena, now tasked with caring for their three small children, makes a difficult choice that will ease her burdens but splinter the family even further. Award-winning, internationally acclaimed author Patricia Engel, herself the daughter of Colombian immigrants and a dual citizen, gives voice to Mauro and Elena, as well as their children, Karina, Nando, and Talia—each one navigating a divided existence, weighing their allegiance to the past, the future, to one another, and to themselves. Rich with Bogotá urban life, steeped in Andean myth, and tense with the daily reality for the undocumented in America, Infinite Country is the story of two countries and one mixed-status family—for whom every triumph is stitched with regret and every dream pursued bears the weight of a dream deferred.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Contemporary",
    "Literary Fiction",
    "Audiobook",
    "Book Club",
    "Adult"
  ],
  "author": "Patricia Engel",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/57772571-infinite-country"
}