{
  "title": "Off the Record",
  "description": "Peter Mansbridge invites us to walk the beat with him in this entertaining and revealing look into his life and career, from his early broadcasting days in the remote northern Manitoba community of Churchill to the fast-paced news desk of CBC’s flagship show, The National, where he reported on stories from around the world.Today, Peter Mansbridge is often recognized for his distinctive deep voice, which calmly delivered the news for over fifty years. But ironically, he never considered becoming a broadcaster. In some ways, though, Peter was prepared for a life as a newscaster from an early age. Every night around the dinner table, his family would debate the news of the day, from Cold War scandals and Vietnam to Elvis Presley and the Beatles.So in 1968, when by chance a CBC radio manager in Churchill, Manitoba, offered him a spot hosting the local late night music program, Peter embraced the opportunity. Without a teacher, he tuned into broadcasts from across Canada, the US, and the UK to learn the basic skills of a journalist and he eventually parlayed his position into his first news job. Less than twenty years later, he became the chief correspondent and anchor of The National.With humour and heart, Peter shares never-before-told stories from his distinguished career, including reporting on the fall of the Berlin Wall and the horror of 9/11, walking the beaches of Normandy with Tom Brokaw, and talking with Canadian prime ministers from John Diefenbaker to Justin Trudeau. But it’s far from all serious. Peter also writes about finding the “cure” for baldness in China and landing the role of Peter Moosebridge in Disney’s Zootopia. From the first (and only) time he was late to broadcast to his poignant interview with the late Gord Downie, these are the moments that have stuck with him.After years of interviewing others, Peter turns the lens on himself and takes us behind the scenes of his life on the frontlines of journalism as he reflects on the toll of being in the spotlight, the importance of diversity in the newsroom, the role of the media then and now, and the responsibilities we all bear as citizens in an increasingly global world.",
  "genres": [
    "Nonfiction",
    "Sports",
    "Biography",
    "Hockey",
    "Memoir",
    "History",
    "Canada"
  ],
  "author": "Peter Mansbridge",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/57772574-off-the-record"
}