{
  "title": "Visions of Awakening Space and Time: Dōgen and the Lotus Sutra",
  "description": "As a religion concerned with universal liberation, Zen grew out of a Buddhist worldview very different from the currently prevalent scientific materialism. Indeed, says Taigen Dan Leighton, Zen cannot be fully understood outside of a worldview that sees reality itself as a vital, dynamic agent of awareness and healing. In this book, Leighton explicates that worldview through the writings of the Zen master Eihei Dōgen (1200-1253), considered the founder of the Japanese Sōtō Zen tradition, which currently enjoys increasing popularity in the West.The Lotus Sutra , arguably the most important Buddhist scripture in East Asia, contains a famous story about bodhisattvas (enlightening beings) who emerge from under the earth to preserve and expound the Lotus teaching in the distant future. The story reveals that the Buddha only appears to pass away, but actually has been practicing, and will continue to do so, over an inconceivably long life span.Leighton traces commentaries on the Lotus Sutra from a range of key East Asian Buddhist thinkers, including Daosheng, Zhiyi, Zhanran, Saigyo, Myōe, Nichiren, Hakuin, and Ryōkan. But his main focus is Eihei Dōgen, the 13th century Japanese Sōtō Zen founder who imported Zen from China, and whose profuse, provocative, and poetic writings are important to the modern expansion of Buddhism to the West.Dōgen's use of this sutra expresses the critical role of Mahayana vision and imagination as the context of Zen teaching, and his interpretations of this story furthermore reveal his dynamic worldview of the earth, space, and time themselves as vital agents of spiritual awakening.Leighton argues that Dōgen uses the images and metaphors in this story to express his own religious worldview, in which earth, space, and time are lively agents in the bodhisattva project. Broader awareness of Dōgen's worldview and its implications, says Leighton, can illuminate the possibilities for contemporary approaches to primary Mahayana concepts and practices.",
  "genres": [
    "Buddhism",
    "Zen",
    "Philosophy",
    "Religion",
    "The World",
    "Belief"
  ],
  "author": "Taigen Dan Leighton",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/5777234-visions-of-awakening-space-and-time"
}