{
  "title": "Sleepwalk",
  "description": "A high speed and darkly comic road trip through a near future America with a big hearted mercenary, from beloved and acclaimed novelist Dan ChaonSleepwalk’s hero, Will Bear, is a man with so many aliases that he simply thinks of himself as the Barely Blur. At fifty years old, he’s been living off the grid for over half his life. He’s never had a real job, never paid taxes, never been in a committed relationship. A good-natured henchman with a complicated and lonely past and an LSD microdosing problem, he spends his time hopscotching across state lines in his beloved camper van, running sometimes shady, often dangerous errands for a powerful and ruthless operation he’s never troubled himself to learn too much about. He has lots of connections, but no true ties. His longest relationships are with an old rescue dog with posttraumatic stress, and a childhood friend as deeply entrenched in the underworld as he is, who, lately, he’s less and less sure he can trust.Out of the blue, one of his many burner phones heralds a call from a twenty-year-old woman claiming to be his biological daughter, Cammie. She says she’s the product of one of his long-ago sperm donations; he’s half certain she’s AI. She needs his help. She’s entrenched in a widespread and nefarious plot involving Will’s employers, and continuing to have any contact with her increasingly fuzzes the line between the people Will is working for and the people he’s running from. With his signature blend of haunting emotional realism and fast-paced intrigue, Chaon populates his fractured America with characters who ring all too true. Gazing both back to the past and forward to an inevitable enough seeming future, Sleepwalk examines where we’ve been and where we’re going, and the curses and joys of being human that will never change, no matter how far we travel to dodge them, or how cleverly we hide.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Thriller",
    "Mystery",
    "Dystopia",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Dan Chaon",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/57771216-sleepwalk"
}