{
  "title": "Surrender to Me",
  "description": "Arabella Adams was the one woman I would have laid my life down for, no matter the circumstance, because that’s what you would do for your soulmate. But when she broke up with me our senior year of college—for no reason or explanation at all—my world as I knew it fell completely apart. My heart was instantly ripped from my chest…and it was a pain I felt in my very soul, and one I never truly recovered from.Now, here I am, ten years later, and I’ve finally learned the real reason Bella pushed me away. So, I must prove to her that anything that happened in her past—our past—doesn’t change the way I feel about her. After all, soulmates never stop loving each other, and even a decade later, I will make her see that I will protect her until the day I die.Because you see, we promised one another we wouldn’t keep secrets, wouldn’t hide parts of ourselves that the other wouldn’t understand. Except, well, I lied. Because the moment I find the person who took Bella from me all those years ago, I’m going to make him pay for every lost moment of the past ten years, and nothing—not even the fact I’m a cop—will stop me from inflicting the same level of pain on him that Arabella and me endured all this time.Note to readers: Arabella endures trauma no woman should have to suffer. Respectfully, the author invites you to emotionally and mentally prepare before experiencing this book on your own terms, should you choose to do so.Surrender to Me is book four in the Boggy Creek Valley series and can be read as a stand alone. For a better reading experience, I suggest reading them in order.1. The Butterfly Effect2. Playing with Words3. She's the One4. Surrender to Me5. Hearts in Motion6. Looking for You",
  "genres": [
    "Second Chance",
    "Romance",
    "Contemporary Romance",
    "Small Town Romance",
    "Second Chance Romance",
    "Contemporary",
    "Abuse"
  ],
  "author": "Kelly Elliott",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/57769034-surrender-to-me"
}