{
  "title": "Apotheosis Now: Rabbit Hole to the Beyond",
  "description": "A mind that is fragmented and sees the world in terms of what is me and not me, good and bad, will be caught in endless conflict. Because externally, we are always trying to control what is “not me,” and internally, we always get perplexed trying to figure out whether our actions came from our “higher” or “lower” self. As Albert Einstein said: “We can not solve our problems with the same level of thinking that created them.”This book will help you to understand:Why we have internal conflictsHow does our ego trap us in undesirable circumstancesHow do our beliefs limit usWhy thought-based teachings (Law of Attraction), or self-improvement advice don’t workHow do we really get what we wantWhy is happiness so rare for usWho we are reallyWhat is the nature of existenceWhat is the meaning of lifeHow do we know if there is a GodWhat is the process of spiritual enlightenmentMany of us are starting to become tired of this game of life. We have been comparing and striving all our life. But no matter how much success we have achieved—we are still hollow and still have found nothing fulfilling. We don’t even know if happiness exists because it is no longer a living thing in our experience—it has become dead, as we only know it as a concept or memory.We have sought self-help advice, philosophies, and religious teachings to transform ourselves but have not gotten anywhere. We have made some superficial improvements—like adopting a new mindset—but our core remains the same. We are still competitive, still fearful, and we get disturbed all the time.The problem with all attempts at self-improvement is that we do not address the fundamental problem, which is: who is the “you” who needs to be improved? We do not see that the one who is making the improvement is the same one who needs to be improved. The more we try to improve, the more conflict we introduce, within and without. The more knowledge we stuff in our heads, the more we become trapped in a conceptual prison of reality. Inevitably, the more confused we get in life.The book guides the reader out of their distorted beliefs to experience reality beyond the mind. When the deeper intelligence is allowed to flourish without our mind's interference, then the game of life becomes effortless.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Spirituality",
    "Mental Health",
    "How To",
    "Amazon"
  ],
  "author": "Yanhao Huang",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/57771623-apotheosis-now"
}