{
  "title": "The Kingdom of Copper",
  "description": "S. A. Chakraborty continues the sweeping adventure begun in \nThe City of Brass\n conjuring a world where djinn summon flames with the snap of a finger and waters run deep with old magic; where blood can be dangerous as any spell, and a clever con artist from Cairo will alter the fate of a kingdom.Nahri’s life changed forever the moment she accidentally summoned Dara, a formidable, mysterious djinn, during one of her schemes. Whisked from her home in Cairo, she was thrust into the dazzling royal court of Daevabad—and quickly discovered she would need all her grifter instincts to survive there.Now, with Daevabad entrenched in the dark aftermath of a devastating battle, Nahri must forge a new path for herself. But even as she embraces her heritage and the power it holds, she knows she’s been trapped in a gilded cage, watched by a king who rules from the throne that once belonged to her family—and one misstep will doom her tribe..Meanwhile, Ali has been exiled for daring to defy his father. Hunted by assassins, adrift on the unforgiving copper sands of his ancestral land, he is forced to rely on the frightening abilities the marid—the unpredictable water spirits—have gifted him. But in doing so, he threatens to unearth a terrible secret his family has long kept buried.And as a new century approaches and the djinn gather within Daevabad's towering brass walls for celebrations, a threat brews unseen in the desolate north. It’s a force that would bring a storm of fire straight to the city’s gates . . . and one that seeks the aid of a warrior trapped between worlds, torn between a violent duty he can never escape and a peace he fears he will never deserve.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Audiobook",
    "Historical Fiction",
    "Adult",
    "Magic",
    "Mythology"
  ],
  "author": "S.A. Chakraborty",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/57802893-the-kingdom-of-copper"
}