{
  "title": "Take My Body",
  "description": "“I don’t want to have him. I want to be him.”Gunner. Big. Butch. Bully… Secretly submissive.Caspian. Tiny. Weak. Nerd… A Dominant at heart.Caspian might be rich and destined for a life of privilege, courtesy of loving parents, but he’s far from happy. Short, frail, and hung up on his physique, he’s never built up the confidence to be the dominant man from his dreams.But when he clashes with his old high school bully - Gunner Russo, reality becomes stranger than either of them could imagine. Gunner is Caspian’s polar opposite. Tall, muscular, tattooed, he oozes testosterone, and violence. Caspian hates him with all his heart, yet he couldn’t be more jealous, so when they swap bodies, it’s everything Caspian ever wanted.Only that it isn’t. Because Gunner is dirt-poor, unemployed, lives in a trailer with his toxic ex, and has drug dealers for friends.Gunner on the other hand, wakes up in a body that is nothing like the hyper-masculine mask he’d perfected, and in that new form, he feels free to explore his submissive fantasies without consequences.Only that the man whose body he now occupies isn’t about to let him sleep with just anyone. Caspian wants to experiment too, and if they both found themselves in this crazy situation, why not do that... with one another?*Dirty, dark, and delicious, “Take My Body” is a gritty M/M dark romance novel with magical elements and a happy ending. Prepare for violence, intense arguments, and scorching hot, emotional, explicit scenes.POSSIBLE SPOILERS:Themes: body swap, enemies to lovers, magical bond, revenge, poverty, body dysmorphia, past bully, masculinity, coming out, size difference, opposites attractLength: ~130,000 words (Standalone novel)WARNING: This story contains scenes of violence, offensive language and morally ambiguous characters as well as sensitive topics of child abuse, body dysmorphia, and bullying.",
  "genres": [
    "M M Romance",
    "Enemies To Lovers",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Gay",
    "LGBT"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/57802412-take-my-body"
}