{
  "title": "How It's Meant to Be",
  "description": "Moore is the only one of the Bane brothers who is upholding a blood oath they made years ago. It has left him at a disadvantage. Without the bond from his mate, his brothers are too powerful to destroy. He has a plan, but it will come with big consequences. A mate chosen at random in town should give him a bond that will make him powerful enough to go to war with his brothers, but the more he gets to know the stranger he’s picked, the more he thinks she is more trouble than she’s worth. Stage five clinger, human, fragile, emotional, and much too pretty for her own good. This isn’t what he’s signed up for, but the more he gets to know her, the more his old life seems very far away. She’s teaching him a lot about patience, and making him question everything he’s been trained to do. She was supposed to be a tool to start a war, but she’s teaching him the value of peace, little by little. Too bad peace isn’t an option for a monster like him. He is a legend in the making, and nothing, not even Aurora, can stop what he has to do.Aurora Shelton is done with men. For the next three months, the only plans she has are to grow her business and ignore all boys. It’s self-care time. But one chance encounter with a growly man in town has her thinking she should just go on one tiny date with him, as a temporary farewell to dating. With Moore, she’s stepped into something so much deeper than she could’ve ever imagined. His life is covered in secrets and shadows, and with the reveal of each one, she is realizing she’s in way over her head. The man in him has her hooked, but the bear inside of him is a different beast altogether. There’s a war brewing, and she might be the only one who can stop Moore from fulfilling his dark destiny. Or can she?Three brothers, three monsters, three oaths, one destiny.Their greatest power lies within the women they claim.Their love will conquer all…or destroy all…Nothing is as it seems with the Oath of Bane.Content Warning: Explicit love scenes, naughty language, and piles of sexy shifter secrets. Intended for mature audiences.",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Urban Fantasy",
    "Slow Burn"
  ],
  "author": "T.S. Joyce",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/57801471-how-it-s-meant-to-be"
}