{
  "title": "I Am a Girl from Africa: A Memoir of Empowerment, Community, and Hope",
  "description": "A “profound and soul-nourishing memoir” (Oprah Daily) from an African girl whose near-death experience sparked a lifelong dedication to humanitarian work that helps bring change across the world.When severe drought hit her village in Zimbabwe, Elizabeth Nyamayaro, then only eight, had no idea that this moment of utter devastation would come to define her life’s purpose. Unable to move from hunger and malnourishment, she encountered a United Nations aid worker who gave her a bowl of warm porridge and saved her life—a transformative moment that inspired Elizabeth to dedicate herself to giving back to her community, her continent, and the world.In the decades that have followed, Elizabeth has been instrumental in creating change and uplifting the lives of by fighting global inequalities, advancing social justice for vulnerable communities, and challenging the status quo to accelerate women’s rights around the world. She has served as a senior advisor at the United Nations, where she launched HeForShe, one of the world’s largest global solidarity movements for gender equality. In I Am a Girl from Africa, she charts this “journey of perseverance” (Entertainment Weekly) from her small village of Goromonzi to Harare, Zimbabwe; London; New York; and beyond, always grounded by the African concept of ubuntu—“I am because we are”—taught to her by her beloved grandmother.This “victorious” (The New York Times Book Review) memoir brings to vivid life one extraordinary woman’s story of persevering through incredible odds and finding her true calling—while delivering an important message of hope, empowerment, community support, and interdependence.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Africa",
    "Feminism",
    "Biography Memoir",
    "Biography",
    "Zimbabwe"
  ],
  "author": "Elizabeth Nyamayaro",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/57799221-i-am-a-girl-from-africa"
}