{
  "title": "I Came All This Way to Meet You: Writing Myself Home",
  "description": "From New York Times bestselling author Jami Attenberg comes a dazzling memoir about unlocking and embracing her creativity—and how it saved her life.In this brilliant, fierce, and funny memoir of transformation, Jami Attenberg—described as a “master of modern fiction” (Entertainment Weekly) and the “poet laureate of difficult families” (Kirkus Reviews)—reveals the defining moments that pushed her to create a life, and voice, she could claim for herself. What does it take to devote oneself to art? What does it mean to own one’s ideas? What does the world look like for a woman moving solo through it?As the daughter of a traveling salesman in the Midwest, Attenberg was drawn to a life on the road. Frustrated by quotidian jobs and hungry for inspiration and fresh experiences, her wanderlust led her across the country and eventually on travels around the globe. Through it all she grapples with questions of mortality, otherworldliness, and what we leave behind.It is during these adventures that she begins to reflect on the experiences of her youth—the trauma, the challenges, the risks she has taken. Driving across America on self-funded book tours, sometimes crashing on couches when she was broke, she keeps writing: in researching articles for magazines, jotting down ideas for novels, and refining her craft, she grows as an artist and increasingly learns to trust her gut and, ultimately, herself.Exploring themes of friendship, independence, class, and drive, I Came All This Way to Meet You is an inspiring story of finding one’s way home—emotionally, artistically, and physically—and an examination of art and individuality that will resonate with anyone determined to listen to their own creative calling.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Writing",
    "Audiobook",
    "Essays",
    "Travel",
    "Biography Memoir"
  ],
  "author": "Jami Attenberg",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/57797674-i-came-all-this-way-to-meet-you"
}