{
  "title": "The Magnificent Lives of Marjorie Post",
  "description": "Mrs. Post, the President and First Lady are here to see you. . . . So begins another average evening for Marjorie Merriweather Post. Presidents have come and gone, but she has hosted them all. Growing up in the modest farmlands of Battle Creek, Michigan, Marjorie was inspired by a few simple rules: always think for yourself, never take success for granted, and work hard—even when deemed American royalty, even while covered in imperial diamonds. Marjorie had an insatiable drive to live and love and to give more than she got. From crawling through Moscow warehouses to rescue the Tsar's treasures to outrunning the Nazis in London, from serving the homeless of the Great Depression to entertaining Roosevelts, Kennedys, and Hollywood's biggest stars, Marjorie Merriweather Post lived an epic life few could imagine. Marjorie's journey began gluing cereal boxes in her father's barn as a young girl. No one could have predicted that C. W. Post's Cereal Company would grow into the General Foods empire and reshape the American way of life, with Marjorie as its heiress and leading lady. Not content to stay in her prescribed roles of high-society wife, mother, and hostess, Marjorie dared to demand more, making history in the process. Before turning thirty she amassed millions, becoming the wealthiest woman in the United States. But it was her life-force, advocacy, passion, and adventurous spirit that led to her stunning legacy. And yet Marjorie's story, though full of beauty and grandeur, set in the palatial homes she built such as Mar-a-Lago, was equally marked by challenge and tumult. A wife four times over, Marjorie sought her happily-ever-after with the blue-blooded party boy who could not outrun his demons, the charismatic financier whose charm turned to betrayal, the international diplomat with a dark side, and the bon vivant whose shocking secrets would shake Marjorie and all of society. Marjorie did everything on a grand scale, especially when it came to love. Bestselling and acclaimed author Allison Pataki has crafted an intimate portrait of a larger-than-life woman, a powerful story of one woman falling in love with her own voice and embracing her own power while shaping history in the process.",
  "genres": [
    "Historical Fiction",
    "Book Club",
    "Fiction",
    "Audiobook",
    "Historical",
    "Romance",
    "Adult"
  ],
  "author": "Allison Pataki",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/57792084-the-magnificent-lives-of-marjorie-post"
}