{
  "title": "Poirot Investigates",
  "description": "First there was the mystery of the film star and the diamond... then came the “suicide” that was murder... the mystery of the absurdly cheap flat...a suspicious death in a locked gun room... a million dollar bond robbery... the curse of a pharaoh’s tomb... a jewel robbery by the sea... the abduction of a prime minister... the disappearance of a banker... a phone call from a dying man... and, finally, the mystery of the missing will.What links these fascinating cases? Only the brilliant deductive powers of Hercule Poirot!The short stories are: 1. The Adventure of 'The Western Star', 2. The Tragedy of Marsdon Manor, 3. The Adventure of the Cheap Flat, 4. The Mystery of Hunter's Lodge, 5. The Million Dollar Bond Robbery, 6. The Adventure of the Egyptian Tomb, 7. The Jewel Robbery at the Grand Metropolitan, 8. The Kidnapped Prime Minister, 9. The Disappearance of Mr. Davenheim, 10. The Adventure of the Italian Nobleman, and 11. The Case of the Missing Will.Librarian's note #1: besides the eleven above, there were three more included in the American version of the same title a year later: 12. The Chocolate Box, 13. The Veiled Lady, and 14. The Lost Mine.Librarian's note #2: this is the entry for the collection of short stories, 'Poirot Investigates'. Entries for each of the stories are located elsewhere on Goodreads. All 14 can be found by searching Goodreads for: 'a Hercule Poirot Short Story'.Librarian's note #3: in published order, the first 10 Christie mystery books featuring Poirot are: 1) The Mysterious Affair at Styles, 2) The Murder on the Links, 3) Poirot Investigates, 4) The Murder of Roger Ackroyd, 5) The Big Four, 6) The Mystery of the Blue Train, 7) Black Coffee: A Mystery Play in Three Acts [Charles Osborne novelized the play in 1998 under the title, Black Coffee], 8) Peril at End House, 9) Lord Edgware Dies, and 10) Murder on the Orient Express. Each has its own entry on Goodreads.",
  "genres": [
    "Mystery",
    "Fiction",
    "Short Stories",
    "Crime",
    "Classics",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "Agatha Christie",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/57806251-poirot-investigates"
}