{
  "title": "Legacy of Violence: A History of the British Empire",
  "description": "From the Pulitzer Prize-winning historian: a searing study of the British Empire that interrogates the country's pervasive use of violence throughout the twentieth century and traces how these practices were exported, modified, and institutionalized in colonies around the globe.Sprawling across a quarter of the world's land mass and claiming nearly five hundred colonial subjects, Britain's twentieth-century empire was the largest empire in human history. For many Britons, it epitomized their nation's cultural superiority, but what legacy did the island nation deliver to the world? Covering more than two hundred years of history, Caroline Elkins reveals an evolutionary and racialized doctrine that espoused an unrelenting deployment of violence to secure and preserve the nation's imperial interests. She outlines how ideological foundations of violence were rooted in the Victorian era calls for punishing recalcitrant \"natives,\" and how over time, its forms became increasingly systematized. And she makes clear that when Britain could no longer maintain control over the violence it provoked and enacted, it retreated from empire, destroying and hiding incriminating evidence of its policies and practices.Drawing on more than a decade of research on four continents, Legacy of Violence implicates all sides of Britain's political divide in the creation, execution, and cover-up of imperial violence. By demonstrating how and why violence was the most salient factor underwriting Britain's empire and the nation's imperial identity at home, Elkins upends long-held myths and sheds new light on empire's role in shaping the world today.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "World History",
    "Audiobook",
    "British Literature",
    "Historical"
  ],
  "author": "Caroline Elkins",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/57822882-legacy-of-violence"
}