{
  "title": "I, Doll: Life and Death with the New York Dolls",
  "description": "The New York Dolls, during and after their all-too brief existence, were a huge influence on David Bowie and Mott the Hoople, KISS and Aerosmith, Guns n’ Roses and Mötley Crüe; when they toured England under the supervision of punk impresario Malcolm McLaren, they indirectly caused the formation of the Sex Pistols. Their bassist Arthur “Killer” Kane died suddenly at age 55 in 2004, but he left behind not only the Dolls’ timeless music--and their many thousands of fans and friends--but this memoir of the Dolls’ early years. Arthur Kane was playing bass for the New York Dolls before there even was a New York Dolls. Along with guitarist Johnny Thunders and drummer Billy Murcia, he founded the band in 1971. The next year they added guitarist Sylvain Sylvain and singer David Johansen--at which point they became famous at Max’s Kansas City, rubbed elbows with Andy Warhol and Lou Reed, recorded two landmark albums, unwittingly invented the thing we now call punk rock, and generally lived up to their slogan “Too Much, Too Soon.” I, Doll covers in detail the first sixteen months of the Dolls’ time on earth, from Kane’s first meeting with Thunders to Murcia’s tragic death in London. To read it is to revisit a glorious, glamorous era of high drama (drug busts and brawls with bouncers) and low comedy (how Kane locked himself out of his studio one winter night while in full Dolls drag and tripping on LSD). This distinctive and extroverted memoir of an undisciplined showman is supplemented with a foreword and epilogue by Kane’s widow, Barbara, bringing his full story to light. Never has there been a rock’n’roll memoir like this one--a book that captures the music, the style, and the life in all its foolhardy glory.",
  "genres": [
    "Music",
    "Punk",
    "Biography",
    "Autobiography"
  ],
  "author": "Arthur Kane",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/5782168-i-doll"
}