{
  "title": "Crazy, Wicked Love",
  "description": "Scorching heat, laugh-out-loud humor, and swoon-worthy moments abound in this sexy new standalone romance by New York Times and Wall Street Journal bestselling author Melissa Foster.What happens when the player gets played?Sidney Carver has a big problem, and he goes by the name of Dwayne “Gunner” Wicked: six-plus feet of muscular, motorcycle-riding, animal-loving deliciousness. Gunner is her boss, roommate, and best friend. They’ve seen each other through life-altering injuries and unimaginable losses, and they work side by side at Wicked Animal Rescue, fulfilling their passion to save animals. Unfortunately, Gunner is also the man Sidney is in love with, and he's the ultimate player. As her former military comrade, Gunner sees her as his buddy—just one of the guys. Sidney is at her wit’s end, ready to risk the friendship and job she adores for a chance at forever love with the man she can’t live without. Like any good Marine, she comes up with a mission. Enter Operation Get My Guy.Gunner loves his life. He has a family he adores, a brotherhood that always has his back, and a host of willing women to warm his bed. As the owner of Wicked Animal Rescue, he saves lives and works with his best friend, Sid, the coolest woman on the planet. When Sid concocts a crazy plan to win his cousin’s heart, Gunner reluctantly agrees to be her wingman.Practices heat up as roommates become teammates. Let the wicked fun begin…No cheating. No cliffhangers. Guaranteed to melt panties and leave readers hopelessly in love with the sinfully delicious Wickeds.About The Wickeds: Dark Knights at BaysideSet on the sandy shores of Cape Cod, the Wickeds feature fiercely protective heroes, strong heroines, and unbreakable family bonds. If you think bikers are all the same, you haven’t met the Dark Knights. The Dark Knights are a motorcycle club, not a gang. Their members stick together like family and will stop at nothing to keep their communities safe. These men are wickedly alpha and intensely loyal, but they are not alphaholes.***Want more WICKED sexy love stories?A Little Bit Wicked (Justin and Chloe)The Wicked Aftermath (Tank and Leah)Crazy, Wicked LoveThe Wicked TruthHis Wicked WaysMeet the WHISKEYS (Wicked cousins). Now available for your binge-reading pleasure!Tru BlueTruly, Madly, WhiskeyDriving Whiskey WildWicked Whiskey LoveMad About MoonTaming My WhiskeyThe Gritty TruthIn for a PennyRunning on DieselFind out more about these and many other steamy romance series in Melissa Foster’s big-family contemporary romance collection, Love in Bloom, featuring characters from all walks of life, from billionaires to blue-collar workers. You’ll love her fun, sexy, and relatable characters, and their real-life issues. Best of all, you’re always guaranteed a happily ever after.",
  "genres": [
    "Friends To Lovers",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Military Fiction",
    "Slow Burn",
    "Small Town Romance"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/57811944-crazy-wicked-love"
}