{
  "title": "In My Mother's Footsteps: A Palestinian Refugee Returns Home",
  "description": "‘Refugees are like seeds that scatter in the wind, and land in different soils that become their reluctant homes’ my mother once told me. As a small child, I looked up at my mother and clutched her hand. The puffiness of her palm reminded me of a loaf of warm pita bread, and when she laced her fingers into mine like a pretzel, I felt safe. I would have walked with her to the ends of the earth.When Mona moved from California to Ramallah to teach conflict resolution in a school for a year, she kept a journal. Within its pages, she wrote her impressions of her homeland, a place she had only experienced through her mother’s memories. As she settled into her teaching role, getting to know her students and the challenges they faced living in a militarized, occupied town, Mona also embarked on a personal pilgrimage to find her mother’s home in Jerusalem. Mona had dreamed of being guided by her mother down the old souqs, and the leafy streets of her neighborhood, listening to the muezzin’s call for prayer and the medley of church bells. But after fifty-nine years of exile, it was Mona’s mother who held her daughter’s hand as they visited Jerusalem together, walking the narrow cobblestone alleys of the Old City. Their roles were reversed. Mona had become her Mama’s legs and her memory – and the one to tell her story going forward. In My Mother’s Footsteps is a moving and heart-rending journey of a daughter discovering her roots and recovering her mother’s beloved past. It’s also an intimate and tender account of daily life for Palestinians as never seen before. For fans of The Bookseller of Kabul and The Beekeeper of Aleppo.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Biography",
    "Biography Memoir",
    "Social Justice",
    "Contemporary"
  ],
  "author": "Mona Hajjar Halaby",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/57810613-in-my-mother-s-footsteps"
}