{
  "title": "Battle for the Top",
  "description": "alternate cover edition of ASIN B092W6BH6RWhether it’s on or off the tennis court, Knightley is always ready to battle for the top. An explosive confrontation with his nemesis Kingston leads them to take their rivalry to the next level off the court. Can two fierce adversaries turn passion into romance?Knightley NeilsonKingston Sabatino throws fuel on my fire like nothing else ever has. Our rivalry is all-consuming since I’m determined to dethrone him and reclaim my rightful place as the number one tennis player in the world. I will beat him, someday.When I confront Kingston after another devastating loss, the line between my rage and obsession to win begins to blur as I discover there might be another way for me to come out on top. True, I’ve never been attracted to a man before, but the temptation to have him at my mercy matters more to me than his gender. I’m not just willing to make him mine; I want to claim him as mine in every way. Having him give in to me will ultimately be the sweetest victory.Is it really possible for me to love a man like Kingston while still wanting to be the winner?Kingston SabatinoI’ll do anything to win Knightley’s heart. That includes becoming the best tennis player in the entire world and defeating him every time we meet. Next, I’ll issue a challenge I know he’ll never be able to resist, even though he’s straight: take his passionate rage out on me in the hottest way possible. That’s how I discover he kisses to win. And I’m not about to let him stop there.Can I help him see past our rivalry to understand that we’re perfect for each other in every way? Tennis starts with “Love-all,” so let the game begin.Battle for the Top is a standalone novella featuring a rivals to lovers, bisexual awakening, sports romance. Full of hot banter and sexy fun, this book ends with a satisfying HEA and no cliffhangers.",
  "genres": [
    "M M Romance",
    "Sports",
    "Enemies To Lovers",
    "Novella",
    "Romance",
    "Contemporary",
    "Sports Romance"
  ],
  "author": "Ariella Zoelle",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/57811132-battle-for-the-top"
}