{
  "title": "The Things We Do To Our Friends",
  "description": "\"She's an outsider desperate to belong, but the cost of entry might be her darkest secret in this intoxicating debut of literary suspense following a clique of dangerously ambitious students at the University of Edinburgh. Edinburgh, a moody city of labyrinthine alleyways, oppressive fog, and buried history; the ultimate destination for someone with something to hide. Perfect for Clare, then, who arrives utterly alone and yearning to reinvent herself. And what better place to conceal the dark secrets in her past than at the university in the heart of the fabled, cobblestoned Old Town? When Clare meets Tabitha, a charismatic, beautiful, and intimidatingly rich girl from her art history class, she knows she's destined to be friends with her and her exclusive raffish Samuel; shrewd Ava; and pragmatic Imogen. Clare is immediately drawn into their libertine world of sophisticated dinner parties and summers in France. The new life she always envisioned for herself has seemingly begun. And then Tabitha reveals a little project she's been working on, one that she needs Clare's help with. Even though it goes against everything Clare has tried to repent for. Even though their intimacy begins to darken into codependence. But as Clare starts to realize just what her friends are capable of, it's already too late. Because they've taken the plunge. They're so close to attaining the things they want. And there's no going back. What is the cost of an extraordinary life if others have to pay? Reimagining the classic themes of obsession and striving with an original and sinister edge, The Things We Do to Our Friends is a seductive thriller about the toxic battle between those who have, and those who covet-between the desire to truly belong, and the danger of being truly known\"--",
  "genres": [
    "Dark Academia",
    "Thriller",
    "Fiction",
    "Mystery",
    "Mystery Thriller",
    "Contemporary",
    "Adult"
  ],
  "author": "Heather Darwent",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/57840627-the-things-we-do-to-our-friends"
}