{
  "title": "The Gray Lady Winked: How the New York Times's Misreporting, Distortions and Fabrications Radically Alter History",
  "description": "Think a newspaper can’t be responsible for mass murder? Think again.As flagship of the American news media, the New York Times is the world’s most powerful news outlet. With thousands of reporters covering events from all corners of the globe, the Times has the power to influence wars, foment revolution, shape economies and change the very nature of our culture. It doesn’t just cover the news: it creates it.But the institution that is the New York Times is showing cracks. No longer the fact-stringing paper of record once known as the Gray Lady, the Times has become a political lightning rod that divides more often than it unites. It is frequently beset by scandal and has even emerged as a symbol of the political, cultural and social ills plaguing our society.The Gray Lady Winked pulls back the curtain on this illustrious institution to reveal a quintessentially human organization where ideology, ego, power and politics compete with the more humble need to present the facts. In its 10 gripping chapters, The Gray Lady Winked offers readers an eye-opening, often shocking, look at the New York Times’s greatest journalistic failures, so devastating they changed the course of history.These are the stories that mattered most, including the Times’s disastrous coverage of the:Second World War – Holocaust – Rise of the Soviet Union – Cuban Revolution – Vietnam War – Second Palestinian Intifada – Atomic Bombing of Japan – Iraq War – Founding of AmericaThe result is an essential look at the tangled relationship between media, power and politics in a post-truth world told with novelistic flair to reveal a uniquely powerful institution’s tortured relationship with the truth.Most importantly of all, The Gray Lady Winked presents a cautionary tale that shows what happens when the guardians of the truth abandon that sacred value in favor of self-interest and ideology—and what this means for our future as much as for our past.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Journalism",
    "American History",
    "Audiobook",
    "Society"
  ],
  "author": "Ashley Rindsberg",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/57844169-the-gray-lady-winked"
}