{
  "title": "To All the Earls I've Loved Before",
  "description": "Meet the Gardner Girls:Four devoted sisters must face pride, peril, and adventure before each finds a love that conquers all.Sometimes love is an accidentAs Angel and Gwendolen are about to discover, love can be found in the strangest places—such as in the dead of night, on a bridge, when a drunk duke stumbles across a knife-wielding woman.A lady with a secretStanding at danger's threshold, Lady Gwendolen Gibson (née Gardner) has no idea that love is about to beckon her in. Hiding from a man who seeks to destroy her life and steal her child, the countess has lived for years with a secret past. Now widowed and threatened with the loss of her home, a guardian angel rescues her and makes her an offer she can't refuse.Out of options and weary of running from her past, Gwendolen wants nothing more than the chance to build a new life for herself and her son. But Gwendolen's secrets will not stay hidden, and as her dangerous adversary steps into the light, he threatens her present, her future, and all she holds dear.A scoundrel with honorAngel Beaumont, the Duke of Englefield, lives up to his name. A golden Adonis, his looks leave women swooning in his wake, while his fortune is greater than Croesus'. Returning to England after being betrayed on the battlefield, Angel seeks to alleviate the dullness of his privileged life with the usual womanizing, drinking, racing, and gambling.Until the night he steps across Blackwater Bridge and discovers a mysterious woman in desperate circumstances. Deciding only he can keep her safe, Angel makes a gallant proposition, offering himself as her protector in a marriage of convenience.But, although Angel believed he could remain aloof to Gwendolen's charms, this wild-living nobleman finds he cannot steel his heart to a woman who is more than she seems and everything he never knew he needed.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Regency",
    "Fiction",
    "Historical Fiction",
    "Regency Romance"
  ],
  "author": "Fenna Edgewood",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/57825460-to-all-the-earls-i-ve-loved-before"
}