{
  "title": "Our Lit: A far future science fiction novel.",
  "description": "“Our Lit is a highly imaginative work of speculative fiction that has all the makings of a modern-day classic. Author (Dr.) Li Tchaikov crafts an epic tale that is as thought-provoking as it is timely and relevant to the current world.” - Book Life.(Updated 25 April 2021)The Golden CalderonSet 125,000 years in the future, Our Lit is the story of the Golden Calderon (aka Goldie), a Professor of the Hunt and heir to the throne of Terra Aurora; a highly magical and scientifically advanced civilisation.Like all hunters, I was tall with a muscular ropey build. I kept my face clean-shaven most of the time, but I knew it didn’t help, I still had wolfish features, frightening to new students.The Sky CliffsThe Terra Auroran's live in the Sky Cliffs, a thunderingly massive cylinder, 700 floors high. They are trapped there, by ancient forcefields, and can never leave, yet, its the only home they have ever known.Oppressive and magnificent like hundreds of encircling ribbons, the concrete and steel balconies seemed to rise endlessly to the heavens.The Red EndlaiFor 2,000 years the Terra Auroran's had been terrorized by the Red Endlai, terrifying monsters with an inverse relationship with pain.“This artificial order is demeaning to nature. The dominant species is the one that creates the most pain.” The Red Endlai King.The ProphecyWhen the Golden Calderon’s 17-year-old undergraduate student, the Orange Jenta, is kidnapped by the Red Endlai, the prophesied great war begins.I was hunting with six elite undergraduate students in the jungles of Terra Aurora at the base of the Sky Cliffs when I saw the Red Endlai.“Orange!” I shouted as a glowing red claw reached up out of the black pond water and grabbed the wiry 17-year old’s orange lit leg.“Golden Professor!” he cried out, his head instantly ablaze in nervous fire.A sudden jerk pulled him underwater and his cry became a gurgle as his flames were extinguished with a smoky hiss.“Null!” I swore as I became visible. Elite Hunting StudentsGoldie had known he was destined to be King after the great war, he’d known since he was a lumina (a Terra Auroran child) - all Terra Auroran’s are lit with their own unique color or glow. To succeed he needs the help of the lethal Mint Pelor, the heavily built Dark Blue Luka, and four other elite hunting students.“Mint, stop it,” laughed the Dark Blue Luka gently nudging her in the stomach.The Mint Pelor had a tendency to keep her classmates on their toes, something the strongest hunters found intoxicating.First ContactYet, as the battle proceeds, the most radical event in Terra Auroran history happens when the timestopping Iona makes first contact with Goldie. To make matters complicated, he falls for her, hard. What happens next will set the course of history for millennia to come.“I feel a strong connection towards you,” I told her as we sipped wine on a private terrace. We were shielded by a giant pair of rare sycamore trees at the base of the jungle overlooking an idyllic ocean beneath Oceans Royal.",
  "genres": [],
  "author": "LI Tchaikov",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/57859416-our-lit"
}