{
  "title": "It Started with a Dog",
  "description": "\"Thanks to an accidental phone swap, two adorable rescue pups, and a coffeehouse clash, a holiday flirtation goes to the dogs and hilarity ensues, from New York Times bestselling author Julia London. All Harper Thompson wants for Christmas is the huge promotion she's worked so hard for-which she should get, as long as her launch of the hip new coffeehouse, Deja Brew, goes according to plan. Jonah Rogers is spending the holiday season trying to save his family's coffee shop, Lucky Star, from going out of business, which will be tough with the brand-new Deja Brew opening across the street. When Jonah and Harper meet for the first time after accidentally swapping phones, their chemistry is as electric as a strand of Christmas lights. He's a tall, handsome, compassionate hunk of engineer, and she's an entrepreneur whose zest for life is very sexy. They love all the same things, like running, scary movies, greasy food-and most of all, dogs. It's a match made in heaven...until Jonah finds out that Harper's the one about to put him out of business. Only one coffee shop can survive, and a competition of one-upmanship ensues in a holiday battle of the brews. The paws really come out when the local rescue shelter has a fundraiser where local businesses foster dogs, and patrons donate cash to vote for their favorite pup. Harper takes in an adorable old bulldog on behalf of Deja Brew, while Jonah fosters a perky three-legged dachshund for Lucky Star. When one precious pup is crowned King Mutt, and a For Sale sign goes up in the other shop's window, Harper and Jonah must decide if their connection was all steam or if they are the perfect blend\"--",
  "genres": [
    "Romance",
    "Contemporary",
    "Christmas",
    "Audiobook",
    "Contemporary Romance",
    "Chick Lit",
    "Fiction"
  ],
  "author": "Julia London",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/57849314-it-started-with-a-dog"
}