{
  "title": "And Never Let Her Go: Thomas Capano: The Deadly Seducer",
  "description": "From America's most celebrated true-crime writer comes the heartbreaking real-life drama of a doomed young woman hopelessly trapped in a web of sexual intrigue, political manipulation, and emotional deception by her charming and successful—but ultimately deadly—lover.The author of fifteen New York Times national bestsellers, Ann Rule, a former Seattle policewoman, has researched thousands of homicides and understands every facet of murder investigation. Now, in the most complex and shocking book of her long career, she delves into the motivation that drove a seemingly successful man to kill, and she explores heretofore unknown aspects of a fatal affair between a beautiful young woman who moved confidently in the heady world of the upper echelons of government and a widely admired millionaire attorney who was an immensely popular political figure.On June 27, 1996, thirty-year-old Anne Marie Fahey, who was the scheduling secretary for the governor of Delaware, had dinner with a man she had been having a secret affair with for more than two years. \"Tommy\" Capano, forty-seven, was perhaps the most politically powerful man in Wilmington. Son of a wealthy contractor, former state prosecutor, partner in a prestigious law firm, advisor to governors and mayors, Tom Capano had a soft-spoken and considerate manner that endeared him to many. Although recently estranged from his wife, he was a devoted father to his four beautiful young daughters, the trusted son of his widowed mother, and the backbone of his extended family. But sometime after 9:15 that night when Anne Marie and Tom left a Philadelphia restaurant, something terrible happened to Anne Marie. It would be forty-eight hours before her brothers and sisters realized that she had disappeared entirely.Ann Rule brilliantly traces the lives of both Fahey and Capano as she discloses the intimate details of their ill-fated bonding. A vulnerable, trusting woman becomes spellbound by a charming, duplicitous married man, and what begins as a seemingly unremarkable affair is slowly transformed into an obsessive, convoluted, and deadly relationship.Through her impeccable research, Rule peels away layer after layer of deception to reveal a man who lived a secret life for decades, a man so greedy that he would sacrifice anyone to gain what he desired. One of his many mistresses—all of whom were unknown to one another—was Deborah MacIntyre, an attractive and wealthy member of one of Wilmington's oldest families and an administrator of an elite private school. She, too, would become part of the mystery surrounding Anne Marie's disappearance.As three prominent families are destroyed to satisfy one man's jealous obsessions, this unfathomable tragedy becomes a tale that few would believe if it were presented as fiction. Shockingly, it is all true. Destined to become a classic, And Never Let Her Go is a riveting account of forbidden love and murder among the rich and powerful, and a chilling insight into the evil that sometimes hides behind even the most charming façade.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Mystery",
    "Audiobook",
    "Biography",
    "Adult"
  ],
  "author": "Ann Rule",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/102916.And_Never_Let_Her_Go"
}