{
  "title": "Lost in the Valley of Death: A Story of Obsession and Danger in the Himalayas",
  "description": "In the vein of Jon Krakauer's Into the Wild, a riveting work of narrative nonfiction centering on the unsolved disappearance of an American backpacker in India--one of at least two dozen tourists who have met a similar fate in the remote and storied Parvati Valley.For centuries, India has enthralled westerners looking for an exotic getaway, a brief immersion in yoga and meditation, or in rare cases, a true pilgrimage to find spiritual revelation. Justin Alexander Shetler, an inveterate traveler trained in wilderness survival, was one such seeker.In his early thirties Justin Alexander Shetler, quit his job at a tech startup and set out on a global journey: across the United States by motorcycle, then down to South America, and on to the Philippines, Thailand, and Nepal, in search of authentic experiences and meaningful encounters, while also documenting his travels on Instagram. His enigmatic character and magnetic personality gained him a devoted following who lived vicariously through his adventures. But the ever restless explorer was driven to pursue ever greater challenges, and greater risks, in what had become a personal quest--his own hero's journey.In 2016, he made his way to the Parvati Valley, a remote and rugged corner of the Indian Himalayas steeped in mystical tradition yet shrouded in darkness and danger. There, he spent weeks studying under the guidance of a sadhu, an Indian holy man, living and meditating in a cave. At the end of August, accompanied by the sadhu, he set off on a \"spiritual journey\" to a holy lake--a journey from which he would never return.Lost in the Valley of Death is about one man's search to find himself, in a country where for many westerners the path to spiritual enlightenment can prove fraught, even treacherous. But it is also a story about all of us and the ways, sometimes extreme, we seek fulfillment in life.Lost in the Valley of Death includes 16 pages of color photographs.",
  "genres": [
    "Nonfiction",
    "Travel",
    "True Crime",
    "Biography",
    "Audiobook",
    "Adventure",
    "India"
  ],
  "author": "Harley Rustad",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/57850254-lost-in-the-valley-of-death"
}