{
  "title": "American Marxism",
  "description": "The six-time #1 New York Times bestselling author, Fox News star, and radio host Mark R. Levin explains how the dangers he warned against in the “timely yet timeless” (David Limbaugh, author of Jesus Is Risen) bestseller Liberty and Tyranny have come to pass. In 2009, Mark R. Levin galvanized conservatives with his unforgettable manifesto Liberty and Tyranny, by providing a philosophical, historical, and practical framework for halting the liberal assault on Constitution-based values. That book was about standing at the precipice of progressivism’s threat to our freedom and now, over a decade later, we’re fully over that precipice and paying the price. In American Marxism, Levin explains how the core elements of Marxist ideology are now pervasive in American society and culture—from our schools, the press, and corporations, to Hollywood, the Democratic Party, and the Biden presidency—and how it is often cloaked in deceptive labels like “progressivism,” “democratic socialism,” “social activism,” and more. With his characteristic trenchant analysis, Levin digs into the psychology and tactics of these movements, the widespread brainwashing of students, the anti-American purposes of Critical Race Theory and the Green New Deal, and the escalation of repression and censorship to silence opposing voices and enforce conformity. Levin exposes many of the institutions, intellectuals, scholars, and activists who are leading this revolution, and provides us with some answers and ideas on how to confront them.  As Levin writes: “The counter-revolution to the American Revolution is in full force. And it can no longer be dismissed or ignored for it is devouring our society and culture, swirling around our everyday lives, and ubiquitous in our politics, schools, media, and entertainment.” And, like before, Levin seeks to rally the American people to defend their liberty.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Philosophy",
    "Audiobook",
    "American",
    "Sociology"
  ],
  "author": "Mark R. Levin",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/57873303-american-marxism"
}