{
  "title": "Groupies",
  "description": "In a debut perfect for fans of Daisy Jones & The Six, Mary Jane, and The Final Revival of Opal & Nev, Sarah Priscus shines a bright light on the grungy yet glittery world of 1970s rock 'n' roll and the women – the groupies – who unapologetically love too much in a world that doesn’t love them back.It’s 1977, and Faun Novak is in love with rock ‘n’ roll.After her mother’s death, Faun, a naïve college dropout, grabs her Polaroid and hops a Greyhound to Los Angeles. In the City of Angels, she reconnects with her charismatic childhood friend Josie, now an up-and-coming model and muse. To make their reunion even sweeter, Josie is now dating Cal Holiday, the frontman of the superstar rock band Holiday Sun, and Faun is positively mesmerized.Except it’s not just the band she can’t get enough of. It’s also the proud groupies who support them in myriad ways. Among the groupies are: a doting high school girl at war with her mother; a drug-dealing wife and new mom who longs to be a star herself; and a cynical mover-and-shaker with a soft spot for Holiday Sun’s bassist.Faun obsessively photographs every aspect of this dazzling new world, struggling to balance her artistic ambitions with the band’s expectations. As her confidence grows for the first time in her life, her priorities shift. She becomes reckless with friendship, romance, her ethics, and her bank account.But just as everything is going great and her boring, old life is falling away, Faun realizes just how blind she has been to the darkest corners of this glamorous musical dreamland as the summer heats up and everything spirals out of control . . .Equal parts an evocative coming-of-age and a cutting look at fame, desire, and the media, Groupies is a novel that will have you turning the pages until the music and drug-fueled end.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Music",
    "Historical",
    "Contemporary",
    "Coming Of Age",
    "Adult"
  ],
  "author": "Sarah Priscus",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/57883989-groupies"
}