{
  "title": "Jim Bridger: Trailblazer of the American West",
  "description": "Even among iconic frontiersmen like John C. Frémont, Kit Carson, and Jedediah Smith, Jim Bridger stands out. A mountain man of the American West, straddling the fur trade era and the age of exploration, he lived the life legends are made of. His adventures are fit for remaking into the tall tales Bridger himself liked to tell. Here, in a biography that finally gives this outsize character his due, Jerry Enzler takes this frontiersman’s full measure for the first time—and tells a story that would do Jim Bridger proud. Born in 1804 and orphaned at thirteen, Bridger made his first western foray in 1822, traveling up the Missouri River with Mike Fink and a hundred enterprising young men to trap beaver. At twenty he “discovered” the Great Salt Lake. At twenty-one he was the first to paddle the Bighorn River’s Bad Pass. At twenty-two he explored the wonders of Yellowstone. In the following years, he led trapping brigades into Blackfeet territory; guided expeditions of Smithsonian scientists, topographical engineers, and army leaders; and, though he could neither read nor write, mapped the tribal boundaries for the Great Indian Treaty of 1851. Enzler charts Bridger’s path from the fort he built on the Oregon Trail to the route he blazed for Montana gold miners to avert war with Red Cloud and his Lakota coalition. Along the way he married into the Flathead, Ute, and Shoshone tribes and produced seven children. Tapping sources uncovered in the six decades since the last documented Bridger biography, Enzler’s book fully conveys the drama and details of the larger-than-life history of the “King of the Mountain Men.” This is the definitive story of an extraordinary life.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Westerns",
    "Audiobook",
    "American History",
    "Historical"
  ],
  "author": "Jerry Enzler",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/57889036-jim-bridger"
}