{
  "title": "The Salon of Exiled Artists in California: Salka Viertel took in actors, prominent intellectuals and anonymous people in exile fleeing from Nazism",
  "description": "The Salon of Exiled Artists in California is a biography of Salka Viertel, a Jewish actress who emigrated to Hollywood and was popularly known as the screenwriter of the Swedish actress Greta Garbo. Besides, she had a salon in Santa Monica, California, which was attended by a large part of the European intelligentsia in exile. Salka was a very modern and interesting woman for her time who should be recognized as such.The book deals with topics such as Salka Viertel's alleged bisexuality and the number of friends she had, to name but a few: Albert Einstein, Charles Chaplin, Sergei Eisenstein, F. W. Murnau, Max Reinhardt, Arnold Schönberg, Thomas Mann, Bertolt Brecht, Greta Garbo, Montgomery Clift... Also, like Gertrude Stein and other notorious women, she had her literary salon through which writers like Truman Capote, Christopher Isherwood, Gore Vidal and many other writers passed. Other themes she covers are the Berlin of the 1920s; the transition from silent to spoken film, as seen from the Mecca of Hollywood. Then, the rise of Hitler and what it meant for the Jewish condition; the exile of those intellectuals who could not return to their respective countries because of the Second World War. Later, the Cold War and the witch-hunt against communism. The truth is that the background to the life of Salka Viertel and her circle of friends encompasses the great events of the 20th century.With this project, the author was awarded the Shanghai Writing Program (China, 2016) and the Baltic Centre (Sweden, 2017) residency grants.\"A very interesting story and I think even in these very current times since in my eyes we have not made much progress on the issue of acceptance of 'interpersonal feelings' in general. A great and extremely interesting book about Hollywood in the thirties and forties about the influence of artists from European countries such as Germany, Austria, France, Sweden, England, Ukraine and others. An extensive and high-quality research project resulting in an in-depth account of many well-known and famous personalities and their interpersonal relationships.\"-Joannes W. M. Groenewege, Translator\"Even though Salka Viertel was such a pivotal figure in the exile community very little has been written about her, so Núria Añó's book is a corrective, and she fills in many of the gaps of The Kindness of Strangers\" -Dialog InternationalINTERVIEW with author Núria Añó on Salka Viertel (Oct 22, 2016)Q: You are currently working on a biography of Salka Viertel. Tell us what it is about this actress and screenwriter that drew you to write her biography?A: As I learned about Salka Viertel, I saw just how fascinating a woman she was. In the 1930s, she was well known as a specialist on scripts for Greta Garbo, but she is much more than that. In exile in California she created a salon that welcomed many prominent European artists, composers, film and theater directors, actors, physicians and writers who emigrated to the US, fleeing Nazism. Her house was a shelter for intellectuals, and this is what attracted me. And I love cinema and classic films, and appreciate other women's lives.Q: Do you consider Salka Viertel an antihero?A: Yes, as a Jewish woman in exile in the 1930s, she is an antihero. In Europe, she was an actress who had to leave her work and dreams. When her husband's contract expired, she had to learn English and support him and the family for many years. Her work as a screenwriter was closely associated with Swedish actress Greta Garbo, so much so that when Garbo retired from the silver screen, it meant the end for Salka Viertel as well.",
  "genres": [
    "Art",
    "LGBT",
    "Bisexual",
    "20th Century",
    "Feminism",
    "Biography",
    "Writing"
  ],
  "author": "Núria Añó",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/57892261-the-salon-of-exiled-artists-in-california"
}