{
  "title": "Rise and Fall",
  "description": "The H.E.R.O. series continues after the events of H.E.R.O. - New Markets. This short novel follows Diva through her initial trials as a new member of H.E.R.O. We follow Chrome as her life shatters from the devastating change into one of the most powerful brick superhumans in Metrocity. Gravitix's early story unfolds as he adjusts from normal life to a decision for or against the use of power for easy gain and evil. Through their trials, Shrinker uses all her charm and wiles in an attempt to corrupt the new supers and aid her in freeing the bloodthirsty mutant followers she lost in H.E.R.O. - Metamorphosis.The story brings in many familiar faces from the first two novels in the series as we again interact with Stephanie, Lance, Rael, Gatecrasher, Psycom and Silverlash.The H.E.R.O. Universe is a new supers universe of heroes and villains. As a novel-based story forum, it allows for deeper character development than that of a comic book or graphic novel based story. Each novel in the series follows the perspective of several heroes - or villains - in their lives and schemes.The common super types include Psychics, Blasters, Bricks and Mutants, although some crossover occurs in unusual individuals. Psychics generally gain mental powers, such as telepathy, telekinesis, or emotional powers. Blasters have the ability to generate or control an element or waveform, such as light, electricity, or heat. Bricks are the strongmen of the world, having massive strength and bodies that can sustain immense damage. Mutants appear less human in appearance due to the addition of blades, tentacles, fins, wings, tails, and more to their bodies, and are between a brick and the others in physical strength.The other novels in the series include H.E.R.O. - Metamorphosis (Book 1), H.E.R.O. - New Markets (Book 2), and H.E.R.O. - Dark Research (Book 3, coming soon). As an ongoing series, each novel stands alone. However, many of the characters in Metrocity do make recurring appearances and the history of the world does build with each novel.H.E.R.O. - Rise and Fall is a short novel of approximately 53,000 words. Please visit the author's website for more information on characters and character images. (http://www.kevinrau.com)",
  "genres": [
    "Superheroes",
    "Science Fiction"
  ],
  "author": "Kevin Rau",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/12757636-rise-and-fall"
}