{
  "title": "The Pendulum has Swung too far",
  "description": "2020 was a nasty year, a muddy, polluted, oily, smoky and rank year. A ratbag of a year. A year of easy virtue, if ever there was such a thing. A number of people, mainly politicians, large pharmaceutical companies and the exceedingly wealthy have shown their true colours, leaving us with the inescapable conclusion that we’re being lied to all the time. Are we on the brink of a new kind of totalitarianism, as predicted by Aldous Huxley and George Orwell? Has the pendulum really swung too far?We don’t live in a military state, disciplined by violence, so they have to deceive us and offer the misconception of independence, and they have to find other ways of controlling us. Masks, for instance …. although of course it was never about the masks.The more they can strengthen the general public’s fear s, the easier it is to control us. In a dictatorship, you just take orders without bothering to vote, but in a democracy, you vote first and take orders second. And that’s the only difference. If they can control what we think then they can prevent us - the uneducated and illiterate masses - from meddling in their affairs. They see running the country as none of our business. They want us to be bystanders, and certainly not participantsWe’re living in a totalitarian state, but don’t realise it. Boris Johnson tells us when we are allowed to be outside, where we are allowed to go, when we’re allowed to work, if we’re permitted to go on holiday or not, what parts of the country we can visit, and how many of us can sit in a pub.I’ve always been ready to stand up and be counted because I know that if I allow my emotions to be stilled, then a kind of blue funk settles in, and I can’t allow that.In this book, I’m sure to rattle a few cages. And in case the wrong person picks up this book I’ll even help you write the review, ‘Typical right-wing bull ….’ There you go, that’s all you need to write. Except, of course, I don’t think of myself as right-wing at all (well, I’m not), but I’ve been called a fascist by fascists, and a racist by racists, so I don’t mind you calling me right-wing, even though the right-wing are nearly always wrong. Hey, call me a Conspiracy Theorist, if you like, but first of all make sure you understand what exactly that means. Call me that, and I’ll be quite complimented.Freethinkers, you see, are those who have evolved beyond other people’s comfort zones.But my intention isn’t to be quarrelsome, it’s just to offer the reader enough moments to ponder over. I make every effort to stay away from Conspiracy Theories, not because I don’t believe in them, but more because I find it a rather dismissive term, allowing others to reject the freethinker’s point of view out of hand.People are getting angry – about Boris Johnson, Donald Trump, immigration, pensions, and most of all Lockdown - and in this book I analyse these views and justify them in the words of the bloke who goes to football on a Saturday afternoon, enjoys a few pints with his mates before the game and puts the world to right.I’ve no doubt there will be people who disagree with my reflections, and that’s okay. We’re not all supposed to agree. But there are issues right now that need addressing. I haven’t watered down my writing at all, or bent over backwards to suit the do-gooders, I promise you that.In the book I’ve made every effort to finish on a positive note, and that may surprise some, but although the pendulum has now swung too far, a pendulum will always return to its equilibrium. And I see big changes ahead for humanity as long as we don’t buy into the fear.‘His style is very readable. He talks to you with all the confidence of a man in touch with his own reality, in a voice which is seasoned with the hint of a world weariness that is so telling of a writer who has written what he knows and written it with disarming fearlessness.’",
  "genres": [
    "Nonfiction"
  ],
  "author": "Karl Wiggins",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/57890759-the-pendulum-has-swung-too-far"
}