{
  "title": "Scourge of the Five Kingdoms",
  "description": "Welcome to Five Kingdoms of Cordizal Series!---Question: What is Scourge of the Five Kingdoms and the Five Kingdoms of Cordizal Series?Charles K. Jordan's answer:That is a question I often get asked by bloggers, book lovers, friends, and family. It is a simple question with a complex answer.The setting for Scourge of the Five Kingdoms' story is a decade-long war, but it's not just a war story. The war and rogue's gallery of antagonists are a clear threat, but just who or how these problems will be resolved isn't cut and dried. You could say that there aren't any plucky protagonists or chosen ones in this particular universe.There is plenty of political intrigue and maneuvering in the Five Kingdoms, but the world's problems are, unfortunately, a bit beyond being resolved in the framework of a political thriller.Then we get to magic. To me, magic is an essential part of a fantasy series, so, of course, there is magic in the world. In the Five Kingdoms, though, magic is an abundant commodity that is a part of everyday life, not some plot device used to drive the story.Speaking of people's lives, there's a diverse, large ensemble cast of characters who have developed already well before we meet them. These characters have goals, and many are at the zenith of their prowess. Scourge of the Five Kingdoms' story does not focus on a single hero, a journey, or a prophecy, but rather it focuses on the actions of many, and it is their ambitions that drive a story full of twists and betrayals.In short, Scourge of the Five Kingdoms is the first novel of an epic fantasy series with deep characters and world-building.---Publisher's SummaryFor all of recorded history, the sentient races of Cordizal clashed in war and strife. Details changed from time to time, but the broad strokes remained the same — peoples, societies, and governments rising then falling, then rising only to fall again. Year after year, the patterns held until the five most powerful kingdoms on the continent, burnished and tempered by their past, set aside their differences and united into the Five Kingdoms.   Presently, this young coalition of sovereign nations faces its first enemy together and is embroiled in a decade-long war against an enemy without stated demands or obvious goals — an enemy whose only purpose seems to be to spread chaos and destruction as far and wide as possible. In the capital of the Five Kingdoms, the Consul of the Five attempts to come to terms with a war they could very well lose. Unfortunately, old habits are hard to break, and bickering and posturing hinder effective governing at every step. On the outskirts of the Arza, a disgraced, self-entitled Arzan noble is sent to a man with a questionable background to finish his tutelage while his father attempts to clear their family name.   Meanwhile, in Rame, a Maximus aligns himself with the foulest individuals the Five Kingdoms has to offer, hoping to restore Rame to its former glory and claim his birthright.  On the frontlines of war, the supreme commander of the Five Kingdoms' combined military does everything within his power to keep their tireless enemy at bay.   The winds of change are once again blowing their way through Cordizal. The question is, can the people of the Five Kingdoms somehow come together and weather the storm, or will a new force emerge to change the very face of the continent?",
  "genres": [
    "Fantasy"
  ],
  "author": "Charles K. Jordan",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/57874745-scourge-of-the-five-kingdoms"
}