{
  "title": "The Last Grand Duchess",
  "description": "This sweeping new novel from the internationally bestselling author of The Woman Before Wallis takes readers behind palace walls to see the end of Imperial Russia through the eyes of Olga Romanov, the first daughter of the last Tsar.   Grand Duchess Olga Romanov comes of age amid a shifting tide for the great dynasties of Europe. But even as unrest simmers in the capital, Olga is content to live within the confines of the sheltered life her parents have built for and her three sisters: hiding from the world on account of their mother’s ill health, their brother Alexei’s secret affliction, and rising controversy over Father Grigori Rasputin, the priest on whom the Tsarina has come to rely. Olga’s only escape from the seclusion of Alexander Palace comes from her aunt, who takes pity on her and her sister Tatiana, inviting them to grand tea parties amid the shadow court of Saint Petersburg. Finally, she glimpses a world beyond her mother’s Victorian sensibilities—a world of opulent ballrooms, scandalous flirtation, and whispered conversation.   But as war approaches, the palaces of Russia are transformed. Olga and her sisters trade their gowns for nursing habits, assisting in surgeries and tending to the wounded bodies and minds of Russia’s military officers. As troubling rumours about her parents trickle in from the Front, Olga dares to hope that a budding romance might survive whatever the future may hold. But when tensions run high and supplies run low, the controversy over Rasputin grows into fiery protest, and calls for revolution threaten to end 300 years of Romanov rule.  At turns glittering and harrowing, The Last Grand Duchess is story about dynasty, duty, and love, but above all, it’s the story of a family who would choose devotion to each other over everything—including their lives.",
  "genres": [
    "Historical Fiction",
    "Russia",
    "Fiction",
    "Historical",
    "Audiobook",
    "Adult",
    "War"
  ],
  "author": "Bryn Turnbull",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/57873328-the-last-grand-duchess"
}