{
  "title": "Right Here Waiting",
  "description": "He lives in a world of winter.Sled dog musher and outdoor adventurer Nick Dahlquist doesn’t mean to be a loner—he just feels at home in the woods, with his dogs, and also online in his vlogging world, where he’s amassed nearly a million viewers. But he’s just a simple guy, with simple goals—care for his dogs, teach people how to survive the cold, and run the Iditarod. Unfortunately, life turns cold when his lead dog is injured, and he’s low on funds. Good thing he has LadyJHawk to chat with. She’s become an online friend he can turn to, and he’s starting to need her more than he’d like to admit. But the last thing he wants is for some random woman to show up on his doorstep…She doesn’t belong in his world.Chopper pilot and Texas gal Jae Lynn Washington has been following Nick’s DogQuest videos and Get Lost in the Woods vlogs since she inherited her deceased boyfriend’s military working dog. Three years later, his encouragement and help as online chat buddies have made her wonder if he could be more than a friend. What if she moved to Deep Haven? Would that be considered stalking, even if she had a bonafide job on the Crisis Response Team?But she’s determined to try…When Jae shows up in Deep Haven—and on Nick’s doorstep—he’s not at all the man she met online. The last thing she’ll do is tell him she’s really LadyJHawk. And when Nick is tapped to train the Crisis Response Team, he’s pretty sure that petite, summer-loving Jae won’t last a moment in the brutal cold—a fear he pours out to LadyJHawk. As their training takes a personal turn, their chilly start begins to thaw. But is he ready to shake off his online relationship for the one in real life? And if Jae tells him the truth, will it spook him back into the woods?When a blizzard strikes, and the CRT is called out into the storm, it might be too late…Cozy up to this delightful, wintery twist on You’ve Got Mail set in the snowy escape of Deep Haven.",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Contemporary",
    "Fiction",
    "Christian",
    "Contemporary Romance",
    "Christian Romance"
  ],
  "author": "Michelle Sass Aleckson",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/57880551-right-here-waiting"
}