{
  "title": "The Beneath (Behind the Wall, #1).",
  "description": "A thrilling and emotional dark romance, set in a dystopian esque world. A world so eerily similar to our own, it will make you wonder... could it happen?It started with a law to punish those who had babies outside of wedlock. It was just supposed to be an orphanage, and yet it became a divide. It became The Beneath.The Beneath; the world behind the wall. The world where the orphans are sent, a world where you live by the rule of The Council, and a world you can never leave.Eve and Adam are unique. The only orphans that are full blood siblings, and to Eve; there is nothing more important than keeping the brother she would give everything for, safe.Noah Joyson is a fourth generation Founding Family Trueborn. He's part of the ruling class, and he's untouchable to everyone, except Eve.Their love awakens something in them both. It's passionate, it's all consuming, it's dark and it's forbidden.When Noah's family discover their secret, they intervene and tear them apart, causing Noah to spiral into a reign of violence. Drastic action is taken to regain control, and Eve is asked to do the unthinkable; the unbearable.Desperate to keep those she loves safe; the line is drawn and the deal is made.Only time will tell if the deal is kept.**Book one in a three-part series. Must be read in order. Ends on a cliffhanger.** CONTENT WARNINGThis contains elements of dark romance with regards to consensual sexual acts. There is reference to suicide and rape but these acts are not committed. This book is 18+ due to sexual content, violence and adult language.\"It's dystopian for people that don't like dystopian.\" Ashlyn Drewek - Author \"This is a story that I truly can not put into words how it makes me feel. It is a story that you have to read to experience. There is no review that will tell you the emotions you are going to feel, and the experiences that Roxanna is going to toss at you. This story has so many twists and turns. It is going to keep you on your toes, and just make you feel so helpless until the end. Then you are going to want more! So much more!\" Alicia Andrews - Alicia's Book Blog\"It's incredible.\" Angela Mack - Author of I Am Unworthy and I AM Unbreakable",
  "genres": [
    "Dark Romance",
    "Dystopia",
    "Contemporary",
    "Dark",
    "Fantasy",
    "Romance"
  ],
  "author": "Roxanna C. Revell",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/57896916-the-beneath-behind-the-wall-1"
}