{
  "title": "Love or Money",
  "description": "A sizzling new standalone series from bestselling romance author Michelle St. JamesImperium: Power is ProtectionHawking McGregor was a kid from the wrong side of the tracks, responsible for taking care of both his sick mom and his little sister. He started at the bottom, creating the Imperium Group with nothing more than a few thousand dollars and some very big balls. Now it’s a multi-million dollar firm whose sole job is to protect the rich and famous.Keeping them safe is his deal with the devil, but that doesn’t mean he has to like them.Laurel Bancroft gets it. When you’re born with a silver spoon in your mouth, you don’t get to complain. Not when your mom overdoses or when your dad fades out of your life. Not even when your big brother dies in a car accident. At thirty-four years old, she’s given up on happily ever after. She wanders the family mansion like a ghost, trying not to attract attention and fighting the depression that haunts her.But somewhere in the dark, an enemy watches. It starts with texts and phone calls and escalates to packages left on the doorstep of the Bancroft estate. Still, Laurel is less than thrilled when she opens the door to Hawk McGregor.As Hawk works to protect her, he finds himself inexplicably drawn to the woman who embodies everything he despises. When Laurel’s stalker gets bolder, the pair hole up at an isolated lake house where their passion ignites into an undeniable inferno. Then, just when Laurel begins to believe it’s not too late for her after all, the enemy arrives.And he’s playing for keeps.Can Hawk heal the wounds of the past to find love in the most unexpected place of all? Can he keep Laurel alive long enough to find out?",
  "genres": [
    "Romance",
    "Contemporary",
    "Suspense",
    "Romantic Suspense",
    "Contemporary Romance",
    "Mystery Thriller"
  ],
  "author": "Michelle St. James",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/57902316-love-or-money"
}