{
  "title": "Henry ‘Chips’ Channon: The Diaries (Volume 2): 1938-43",
  "description": "The second volume of the remarkable, Sunday Times bestselling diaries of Chips Channon.'A masterpiece - a time machine that transports the reader back to British politics and high society at the end of the 1930s.' Robert Harris'The uncensored, unvarnished thought of one of the 20th century's greatest diarists. - Best Biographies of the Year, Telegraph'An unrivalled guide to the social and political life of Britain in the first half of the 20th century.' Books of the Year, The Times'Fascinating.' New Statesman'Never a dull day, never a dull sentence.' \nDaily Mail_______________________________________________\nThis second volume of the bestselling diaries of Henry 'Chips' Channon takes us from the heady aftermath of the Munich agreement, when the Prime Minister so admired by Chips was credited with having averted a general European conflagration, through the rapid unravelling of appeasement, and on to the tribulations of the early years of the Second World War. It closes with a moment of hope, as Channon, in recording the fall of Mussolini in July 1943, 'The war must be more than half over.'For much of this period, Channon is genuinely an eye-witness to unfolding events. He reassures Neville Chamberlain as he fights for his political life in May 1940. He chats to Winston Churchill while the two men inspect the bombed-out chamber of the House of Commons a few months later. From his desk at the Foreign Office he charts the progress of the war. But with the departure of his boss 'Rab' Butler to the Ministry of Education, and Channon's subsequent exclusion from the corridors of power, his life changes - and with it the preoccupations and tone of the diaries. The conduct of the war remains a constant theme, but more personal preoccupations come increasingly to the fore. As he throws himself back into the pleasures of society, he records his encounters with the likes of Noël Coward, Prince Philip, General de Gaulle and Oscar Wilde's erstwhile lover Lord Alfred Douglas. He describes dinners with members of European royal dynasties, and recounts gossip and scandal about the great, the good and the less good. And he charts the implosion of his marriage and his burgeoning, passionate friendship with a young officer on Wavell's staff.These are diaries that bring a whole epoch vividly to life.",
  "genres": [
    "Diary",
    "History",
    "Nonfiction",
    "British Literature"
  ],
  "author": "Henry Channon",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/57894632-henry-chips-channon"
}