{
  "title": "Poker Face",
  "description": "Every girl dreams about meeting her celebrity crush–Running into them on the street and snapping a selfie. Maybe even being saved like a gorgeous damsel and having said celebrity crush sweep her off of her feet. Me personally? Let’s just say that me and the Hemsworth boys have had our fair share of imaginary meet-cutes.I’m not picky. I’d take any of them.The thing is, every girl dreams about what she would do if she got to meet her celebrity crush, but no one dreams about what they’d do if they met their celebrity nemesis. Let me tell you–I have a celebrity nemesis. And he was sitting in front of me wearing a scowl that could be seen from space.And ten hours earlier I had been sitting on his lap, clinging to him like a koala while his tongue was down my throat.Pastry chef Madeline Dorsey only hates a few things: people who think that charcuterie boards are an acceptable substitution for dinner, last call at the bar, idiots who don’t return their shopping carts to the corral, and celebrity chef and restaurateur Luca DeRossi.When her mortal enemy buys out the restaurant that Maddie views as her kingdom, right on the heels of criticizing her on national television, she has no choice but to go toe to toe with him.Luca DeRossi was expecting a sleepy, coastal fishing town to be a little more, well, quiet. That is, until a spitfire hurricane of blonde hair comes whirling into his life without warning.Staying in Beaufort, North Carolina isn’t part of his plan and letting a chef with an ego the size of Mars best her isn’t on her agenda. When Maddie realizes that Luca isn’t quite the judgemental grump he pretends to be, she has to decide which side of him to believe. Maybe there really is a heart of gold underneath all those designer suits. Maybe he’s just a jerk. His poker face is too good to tell.Get ready for Maddie and Luca, their epic meet-cute that turns into a meet-hate, a group of obnoxiously lovable friends, and all the FIRE. If you can’t stand the heat, get out of the kitchen.“Poker Face” is the first book in the Beaufort Poker Club series. This book is an enemies to lovers romance that features a grumpy hero with a swoony side with a heroine that would rather be jumping off of roofs than picking out glass slippers, a feels-packed love story with a fairy tale happily ever after, and some moments that are so hot they’ll melt your Kindle. You’ve been warned.",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Small Town Romance",
    "Contemporary",
    "Contemporary Romance",
    "Found Family",
    "Workplace Romance"
  ],
  "author": "Maggie C. Gates",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/57910838-poker-face"
}