{
  "title": "My Unexpected Family",
  "description": "Never in my wildest dreams did I think I’d walk into my living room to see a woman dancing to old-school hip-hop music while six months pregnant and I’d actually enjoy the sight of it.But then again, I never thought I’d get a woman pregnant and have her living in my house either.That’s what’s happened though.I’m going to be a dad, and Chloe Pierce—the most beautiful and unapologetically honest woman I’ve ever met—is going to be the mother of my child.Turning down her blatant offer for one night together the first time was painful, but I knew it was the right thing to do. My restaurant business and my family have always come first, a rule I’ve instilled in my life since I was sixteen. But when I saw her months later, my body remembered the draw to her. I blame it on the tequila, the romantic setting of my best friend’s wedding in Aruba, and the fact that since I met Chloe one night months ago in Vegas, I couldn’t get her out of my head.Little did I know that one wild night together would change our lives forever.Chloe is crass, wild, and stunning—unlike any woman I’ve met before. But I don’t do relationships. I don’t let people in for very important reasons.But now she’s living with me and my instinct is to protect and care for her in every way I know how. And while I’m dedicated to being the best father I can be, she’s in denial about the fact that our lives will be changing. Still, being around her is making me envision thoughts of the future, a future that includes her in my life—a future I never wanted after suffering a loss that made me fear getting close to other people again.But we’re not just growing close, we’re not just becoming friends. No, I’m quickly falling in love with my baby’s momma—and now I’m afraid that the unexpected family I’m having will get ripped away from me too.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Forced Proximity",
    "Billionaire Romance",
    "Contemporary"
  ],
  "author": "Harlow James",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/57903107-my-unexpected-family"
}