{
  "title": "Laptop from Hell: Hunter Biden, Big Tech, and the Dirty Secrets the President Tried to Hide",
  "description": "As seen on Tucker Carlson Tonight! USA Today and Wall Street Journal Bestseller!   The inside story of the laptop that exposed the president’s dirtiest secret.When a drug-addled Hunter Biden abandoned his waterlogged computer at a Mac repair shop in Delaware in the spring of 2019, just six days before his father announced his candidacy for the United States presidency, it became the ticking time bomb in the shadows of Joe Biden’s campaign. The dirty secrets contained in Hunter’s laptop almost derailed his father’s presidential campaign and ignited one of the greatest media coverups in American history. This is the unvarnished story of what’s really inside the laptop and what China knows about the Bidens, by the New York Post journalist who brought it into the open. It exposes the coordinated censorship operation by Big Tech, the media establishment, and former intelligence operatives to stifle the New York Post’s coverage, in a chilling exercise of raw political power three weeks before the 2020 election. A treasure trove of corporate documents, emails, text messages, photographs, and voice recordings, spanning a decade, the laptop provided the first evidence that President Joe Biden was involved in his son’s ventures in China, Ukraine, and beyond, despite his repeated denials. This intimate insight into Hunter’s dissolute lifestyle shows he was incapable of holding down a job, let alone being paid tens of millions of dollars in high-powered international business deals by foreign interests, unless he had something else of value to sell—which of course he did. He was the son of the vice president who would go on to become the leader of the free world.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Crime",
    "Biography",
    "Audiobook",
    "Government"
  ],
  "author": "Miranda Devine",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/57902342-laptop-from-hell"
}