{
  "title": "The Last Language",
  "description": "From Jennifer duBois, “one of a handful of living American novelists who can comprehend both the long arc of history and the minute details that animate it” (Karan Mahajan) and “a writer of thrilling psychological precision” (Justin Torres), comes a spellbinding new novel.A few months after the death of her husband, Angela is ejected from her doctoral program in linguistics at Harvard University. Spinning and raw, and with few other options, the young widow and her four-year-old daughter move into her mother’s house in Medford, Massachusetts.Trained with an understanding of spoken language as the essential foundation of thought, Angela finds underpaid work at the Center, a fledgling organization that is developing an experimental therapy aimed at helping nonverbal patients with motor impairments. Through the Center, Angela begins to work closely with Sam, a twenty-seven-year-old patient who has been confined to his bedroom for the majority of his life. Following some faltering steps, Sam takes to the technology, proving to be not just literate but literary, and charming. Angela is initially stunned, then drawn intensely to Sam, and they develop an intimate relationship.When their secret is discovered, Sam’s family intervenes and brings charges. As Angela tells her story in the form of an unrepentant plea addressed from prison to her beloved, we are plunged into a Nabokovian hall of mirrors in which it is hard to know whom or what to believe. Is this a haunting story of doomed love, a manipulative account of pitiful self-delusion, or, as the state has charged, a criminal assault of a victim who doesn’t have the agency or intelligence required of a willing participant in a love affair?Provocative and profound in its exploration of what makes us human, this is an extraordinary novel from one of our most acclaimed contemporary writers.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Mental Health",
    "Book Club",
    "Novels",
    "Language"
  ],
  "author": "Jennifer duBois",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/127593128-the-last-language"
}