{
  "title": "The Urge: Our History of Addiction",
  "description": "An authoritative, illuminating, and deeply humane history of addiction--a phenomenon that remains baffling and deeply misunderstood despite having touched countless lives--by an addiction psychiatrist striving to understand his own family and himselfEven after a decades-long opioid overdose crisis, intense controversy still rages over the fundamental nature of addiction and the best way to treat it. With uncommon empathy and erudition, Carl Erik Fisher draws on his own experience as a clinician, researcher, and alcoholic in recovery as he traces the history of a phenomenon that, centuries on, we hardly appear closer to understanding--let alone addressing effectively.As a psychiatrist-in-training fresh from medical school, Fisher was soon face-to-face with his own addiction crisis, one that nearly cost him everything. Desperate to make sense of the condition that had plagued his family for generations, he turned to the history of addiction, learning that the current quagmire is only the latest iteration of a centuries-old story: humans have struggled to define, treat, and control addictive behavior for most of recorded history, including well before the advent of modern science and medicine.A rich, sweeping history that probes not only medicine and science but also literature, religion, philosophy, and sociology, The Urge illuminates the extent to which the story of addiction has persistently reflected broader questions of what it means to be human and care for one another. Fisher introduces us to the people who have endeavored to address this complex condition through the ages: physicians and politicians, activists and artists, researchers and writers, and of course the legions of people who have struggled with their own addictions. He also examines the treatments and strategies that have produced hope and relief for many people with addiction, himself included. Only by reckoning with our history of addiction, he argues--our successes and our failures--can we light the way forward for those whose lives remain threatened by its hold.The Urge is at once an eye-opening history of ideas, a riveting personal story of addiction and recovery, and a clinician's urgent call for a more expansive, nuanced, and compassionate view of one of society's most intractable challenges.",
  "genres": [
    "Nonfiction",
    "History",
    "Psychology",
    "Science",
    "Audiobook",
    "Health",
    "Sociology"
  ],
  "author": "Carl Erik Fisher",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/57925153-the-urge"
}