{
  "title": "The Ghosts of Rose Hill",
  "description": "A brilliantly original tale for fans of The Bear and the Nightingale and The Hazel Wood about embracing your power, facing your monsters, and loving deeply enough to transcend a century.Inspired by the author's experiences restoring Jewish cemeteries in Eastern Europe.\"A must-read for lost souls everywhere.\" —Kirkus Reviews, Starred ReviewMagic will burn you up.Sent to stay with her aunt in Prague and witness the humble life of an artist, Ilana Lopez—a biracial Jewish girl—finds herself torn between her dream of becoming a violinist and her immigrant parents’ desire for her to pursue a more stable career. When she discovers a forgotten Jewish cemetery behind her aunt’s cottage, she meets the ghost of a kindhearted boy named Benjamin, who died over a century ago. As Ilana restores Benjamin’s grave, he introduces her to the enchanted side of Prague, where ghosts walk the streets and their kisses have warmth. But Benjamin isn't the only one interested in Ilana. Rudolph Wassermann, a man with no shadow, has become fascinated with her and the music she plays. He offers to share his magic, so Ilana can be with Benjamin and pursue her passion for violin. But after Ilana discovers the truth about Wassermann and how Benjamin became bound to the city, she resolves to save the boy she loves, even if it means losing him—forever.A love letter to Latin American and Jewish diasporas, based on the author's experiences working to maintain Jewish cemeteries in Eastern Europe. The Ghosts of Rose Hill is a tender and empowering read that you will devour in one sitting. Steeped in history and the experiences of immigrant families, especially Jewish families, each carefully-chosen word of this magical verse novel casts a spell.A Sydney Taylor Notable BookA School Library Journal Best Book of the YearA Kirkus Best YA Book of the YearA BuzzFeed Best YA Book of the YearAn Indie Next Pick!",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Poetry",
    "Romance",
    "Magical Realism",
    "Historical Fiction",
    "Paranormal"
  ],
  "author": "R.M. Romero",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/57918190-the-ghosts-of-rose-hill"
}