{
  "title": "A Plague Upon Our House: My Fight at the Trump White House to Stop COVID from Destroying America",
  "description": "National Bestseller a s seen on Tucker Carlson , The Ingraham Angle , The Megyn Kelly Show , The Clay Travis & Buck Sexton Show , The Next Revolution with Steve Hilton and more!What really happened behind the scenes at the Trump White House during the COVID pandemic?When Dr. Scott W. Atlas was tapped by Donald Trump to join his COVID Task Force, he was immediately thrust into a maelstrom of scientific disputes, policy debates, raging egos, politically motivated lies, and cynical media manipulation. Numerous myths and distortions surround the Trump Administration’s handling of the crisis, and many pressing questions remain unanswered. Did the Trump team really bungle the response to the pandemic? Were the right decisions made about travel restrictions, lockdowns, and mask mandates? Are Drs. Anthony Fauci and Deborah Birx competent medical experts or timeserving bureaucrats? Did half a million people really die unnecessarily because of Trump’s incompetence?So far no trusted figure has emerged who can tell the story straight—until now. In this unfiltered insider account, Dr. Scott Atlas brings us directly into the White House, describes the key players in the crisis, and assigns credit and blame where it is deserved.The book includes shocking evaluations of the Task Force members’ limited knowledge and grasp of the science of COVID and details heated discussions with Task Force members, including all of the most controversial episodes that dominated headlines for weeks. Dr. Atlas tells the truth about the science and documents the media’s relentless campaign to suffocate it, which included canceled interviews, journalists’ off-camera hostility in White House briefings, and intentional distortion of facts. He also provides an inside account of the delays and timelines involving vaccines and other treatments, evaluates the impact of the lockdowns on American public health, and indicts the relentless war on truth waged by Big Business and Big Tech.No other book contains these revelations. Millions of people who trust Dr. Atlas will want to read this dramatic account of what really went on behind the scenes in the White House during the greatest public health crisis of the 21st century.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Science",
    "Health",
    "American History",
    "Medical"
  ],
  "author": "Scott W. Atlas",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/57919252-a-plague-upon-our-house"
}