{
  "title": "Baggage: Tales from a Fully Packed Life",
  "description": "An intimate look at the making of a man, an actor, an advocate--and most importantly--a happy human being. A wonderful book that is funny, honest, fearless, and generous in its vulnerability. --Douglas Stuart, Booker Prize-winning author of Shuggie Bain\nThere is absolutely no logical reason why I am here. The life trajectory my nationality and class and circumstances portended for me was not even remotely close to the one I now navigate. But logic is a science and living is an art.\nThe release I felt in writing my first memoir, Not My Father's Son, was matched only by how my speaking out empowered so many to engage with their own trauma. I was reminded of the power of my words and the absolute duty of authenticity.But...No one ever fully recovers from their past. There is no cure for it. You just learn to manage and prioritize it. I believe the second you feel you have triumphed or overcome something - an abuse, an injury to the body or the mind, an addiction, a character flaw, a habit, a person - you have merely decided to stop being vigilant and embraced denial as your modus operandi. And that is what this book is about, and for: to remind you not to buy in to the Hollywood ending.Ironically maybe, much of Baggage chronicles my life in Hollywood and how, since I recovered from a nervous breakdown at 28, work has repeatedly whisked me away from personal calamities to sets and stages around the world. It is also about marriage(s): starting with the break-up of my first (to a woman) and ending with the ascension to my second (to a man) with many kissed toads in between! But in everything, each failed relationship or encounter with a legend (Liza! X Men! Gore Vidal! Kubrick! Spice Girls!), in every bad decision or moment of sensual joy I have endeavored to show what I have learned and how I've become who I am today: a happy, flawed, vulnerable, fearless middle-aged man, with a lot of baggage.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "Autobiography",
    "LGBT"
  ],
  "author": "Alan Cumming",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/57931617-baggage"
}