{
  "title": "Your Next Big Idea: Improve Your Creativity and Problem-Solving",
  "description": "Winner of 20 Awards!2022 International Rubery Book Award Grand Prize Shortlist2022 Eric Hoffer Awards First Horizon Award Winner, 2022 Eric Hoffer Awards Reference Category Winner, 2022 Eric Hoffer Awards Grand Prize Shortlist2022 Independent Press Awards Best Debut Nonfiction2022 Global Ebook Grand Prize Legacy Award for Non-fiction2022 Next Generation Indie Book Career Genre Book of the Year2022 NYC Big Book Award Category Best How-To Book2022 National Indie Excellence Awards - Education Book of the YearIndieReader 2021 Discovery Awards Business Category Book of the YearReadFree.ly Top 100 Indie Books of 20212021 Living Now Mind Award WinnerNonfiction Authors Association Gold Medal Book Award2021 Readers' Favorite International Book Award Contest - Marketing Book of the YearIndependent Author Network Book of The Year Awards - 2021 Business, Finance, and Sales Book of the YearAward Winner in Personal Growth & Development - 2021 International Impact Book AwardsBest Book Awards - 2021 Interior Design of the YearIndie B.R.A.G. Medallion Winner2022 International Book Awards Winner - Best Cover Nonfiction2021 Nonfiction IndieReader Summer Book Cover Design Contest WinnerHow-To Category Summer 2021 Pinnacle Book Achievement AwardAward Winner in Business - 2021 International Impact Book AwardsThis book is carbon negative.From an author who has written for Business 2 Community & Advertising Week comes a book featured by Yahoo!, Booklist Magazine, Publishers Weekly, ABC's Good Morning Washington, Thrive Global, multiple affiliates of CBS, Fox and NBC.This non-fiction business and self-help creativity guide encourages innovation in aspiring entrepreneurs and business leaders. Have you ever looked at a product and thought, 'Why didn't I think of that?' or, 'I'm just not a creative person!' Improve problem-solving skills and increase the effectiveness of knowledge management in your organization to come up with the next game-changing idea to hit the market!In this book you how others innovate by examining the world around themPractice asking questions, and see how to recognize details in observationsComplete creative exercises to get into the right mindsetUnderstand the importance of sharing ideas, and assessing their feasibilityFueling You to Your Next Big IdeaAre you ready? Click the purchase button above to get started.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Business",
    "Personal Development",
    "Writing",
    "Psychology"
  ],
  "author": "Samuel  Sanders",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/57924594-your-next-big-idea"
}