{
  "title": "Open: An Uncensored Memoir of Love, Liberation, and Non-Monogamy",
  "description": "An award-winning journalist delves into the growing trend toward relationships--including her own--that push love beyond the familiar borders of monogamy.When Rachel Krantz met and fell for Adam, he told her that he was looking for a committed partnership--just one that did not include exclusivity. Excited and a little trepidatious, Rachel set out to see whether love and a serious partnership with Adam could coexist alongside the freedom to explore relationships with other people. Their relationship was designed to strike an exquisite balance between intimacy and independence, calibrated to fan desire for the long haul.Armed with her instincts from her career as a journalist, Rachel not only put her own heart on the line, she also kept detailed journals, interviewed experts and therapists, immersed herself in the polyamory community, and relentlessly interrogated her own emotions. Now, in her debut memoir, she chronicles her dive into non-monogamy--from debilitating anxiety spirals to heart-opening connections with the men and women she dates--with an unflinching eye, fly-on-the-wall detail, and extraordinary perceptiveness. Through page-turning storytelling, she takes us inside the Brooklyn parties where Rachel first dips her toes in the water of non-monogamy; into the wider swinger and polyamory community where they search for a relationship style that suits them; and into her private moments with Adam and their other lovers. As she and Adam attempt to write a new plot for their love story, she also runs up against miscommunications, ancient power dynamics, and seeming betrayals that threaten the foundation of their love. Rachel breaks new ground in confronting the unique ways coercion and gaslighting manifest in open relationships, and finds herself wondering what liberation really looks like.Casting new light on universal experiences like jealousy, restlessness, and love, Open explores the seemingly endless range of relationships couples have created to answer their desires, and ultimately probes the questions: Can we have both freedom and love? How can we reconcile comfort and lust? Is a relationship ever equal? And is the pleasure worth the pain?",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Polyamory",
    "Relationships",
    "LGBT",
    "Queer",
    "Sexuality"
  ],
  "author": "Rachel  Krantz",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/57933307-open"
}