{
  "title": "Recommendations for Usage, Commercial Contracts, and Cost Recovery in Government Contracts",
  "description": "This book will be of interest to those in the field of contract management in the United States government, the private sector, and internationally. This book is relevant to scholars and academics as well as both American and international policymakers, those working in the field of contract management, and those seeking to join the field of contract management. It will be useful for people interested in contracting with the United States government and in designing and implementing acquisitions and or contract management policy both in the United States of America and internationally. Lastly, it will be useful for people in a wide variety of industries, countries, and regions internationally and in the United States of America already contracting with the United States government or interested in contracting with the United States government in understanding how to terminate commercial contracts for convenience using United States of America procurement regulations.A concise overview of the recommendations for usage of termination for convenience provisions, commercial government contracts, and cost recovery in commercial item contracts. Topics discussed include the Federal Acquisition Regulations System (FAR) as promogulated by the United States Congress, the Financial Accounting Standards Board, and the A201 commercial contracting standard as promogulated by the American Institute of Architects. Applicability of termination for convenience in commercial government contracts to sole source acquisitions and intelligence community acquisitions are also discussed. Net present value clauses, cash flow, and United States Generally Accepted Accounting Principles (GAAP) are also discussed within the context of United States government contracts terminated for convenience.Purpose, design/methodology/approach, findings, and originality/value are also discussed as it relates to both recommendations for the usage of termination clauses in commercial government contracts terminated for convenience and as it relates to cost recovery in commercial government contracts terminated for convenience using United States of America procurement regulations.About the Greg Tharp has over 15 years of experience as a librarian and researcher, including research positions with Harvard Medical School and Tufts University. He previously served as a member of the State of Connecticut Library Advisory Council on Library Planning and Development. He is a member of the American Library Association, Massachusetts Library Association, ARMA International, and IAACM. Tharp’s area of expertise is information policy.Tharp holds an Master’s Certificate in Acquisitions and Contract Management from American Graduate University, an Advanced Certificate in Archives Management from Simmons University, a Master of Library Science from Southern Connecticut State University, and a Bachelor of Science from Sacred Heart University where he was elected to Phi Eta Sigma and received the Passion for Learning Award. Tharp also holds a Certificate of Professional Librarianship from the Commonwealth of Massachusetts Board of Library Commissioners and is a Second Degree Black Belt in Tang Soo Mi Guk Kwan.Additionally, he received acquisitions training at Defense Acquisitions University, Federal Acquisitions Institute, and the University of Virginia. He also received human resources training at HR University.",
  "genres": [],
  "author": "Gregory K. Tharp",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/57928208-recommendations-for-usage-commercial-contracts-and-cost-recovery-in-go"
}