{
  "title": "Of Dreams and Angels",
  "description": "Winner of the 2022 Readers' Favorite Book Awards - Paranormal Romance - GOLDWinner of the 2022 NYC Big Book Award - Paranormal Romance\"Intelligent without pretension... Of Dreams and Angels is an enjoyable, easy-to-read romance that probes the weight and meaning of our relationships.\" - BookLife Reviews by Publisher's Weekly, Editor's PickA man dreams through the eyes of a woman he's never met, setting out to find love that might be a figment of his imagination.Joe Riley has a successful, by-design life in the world of finance. He loves order, discipline, the tangible, the measurable. In pursuit of success he's spurned attachment, keeping romantic entanglements \"on an island\" while leaving his life and heart invulnerable. When he begins to dream of a woman half a world away he's never encountered, his notions of practicality and planning are called into question.In a search that variously brings him to the psychologist's office, a medium's table, and from the Rocky Mountains to the streets of London, England, Joe begins to fall for the woman of his dreams. In the process, he's beset by innumerable Is he going mad? Might she actually exist? If so, why does he see through her eyes? Why is he party to visions that are either the greatest privacy invasion of all time, or a possible cosmic match in the making?In the quest for answers, Joe confronts the deeper questions that assail most of us who dare open our Will I be enough? Will they love me when it stops being easy? Will they stay? Will they sweep me up, just to watch me fall?A moving exploration of relinquishing fear and embracing the unknown, Of Dreams and Angels invites you to trust the dreams that brought you this far will bring you further.More praise for Of Dreams and ﻿\"Morrison delivers a grounded, absorbing romantic tale... a refreshingly realistic narrative approach. An appealing love story that's both sentimental and down-to-earth.\" - Kirkus ReviewsAward-Winning Finalist in the Paranormal category of the 2021 American Fiction AwardsAward-Winning Finalist in the Cross-Genre category of the 2021 Best Book Awards sponsored by American Book Fest",
  "genres": [
    "Romance",
    "Fiction",
    "Paranormal",
    "Contemporary"
  ],
  "author": "Jared Morrison",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/57914615-of-dreams-and-angels"
}