{
  "title": "\"Bismarck\": A Minute-by-minute Account of the Final Hours of Germany's Greatest Battleship",
  "description": "A gripping tale of heroism -and doom-on the high seas . . .The sinking of the German battleship Bismarck-a masterpiece of engineering, well-armored with a main artillery of eight 15-inch guns-was one of the most dramatic events of World War II. She left the port of Gotenhafen for her first operation on the night of 18 May 1941, yet was almost immediately discovered by Norwegian resistance and Allied air reconnaissance. British battlecruiser Hood was quickly dispatched from Scapa Flow to intercept the Bismarck, together with new battleship Prince of Wales. They were ordered to find the ship quickly because, on their way from the USA, several large convoys were heading for Britain.On 24 May, Bismarck was found off the coast of Greenland, but the ensuing battle was disastrous for the British. The Hood was totally destroyed within minutes (only 3 crewmen surviving), and Prince of Wales was badly damaged. The chase resumed until the German behemoth was finally caught, this time by four British capital ships supported by torpedo-bombers from the carrier Ark Royal. The icy North Atlantic roiled from the crash of shellfire and bursting explosions until finally the Bismarck collapsed, sending nearly 2,000 German sailors to a watery grave.Tamelander and Zetterling's work rests on stories from survivors and the latest historical discoveries. The book starts with a thorough account of maritime developments from 1871 up to the era of the giant battleship, and ends with a vivid account, hour by hour, of the dramatic and fateful hunt for the mighty Bismarck, Nazi-Germany's last hope to pose a powerful surface threat to Allied convoys.NIKLAS ZETTERLING, a researcher at the Swedish Defense College, is most recently co-author of The Korsun Pocket: The Encirclement and Breakout of a German Army in the East, 1944. Together with MICHAEL TAMELANDER, a part-time military author, they have written books about the battleship Tirpitz, the D-Day landings and the 1940 campaign in Norway.REVIEWS..\". a very interesting and useful history ...once you start... you will be very hard pressed to stop until the smoke has cleared and the ship is sunk.\"Internet Modeler, 08/2009..\".unable to put it down...I highly recommend this book for anyone that likes the study of naval battles or just wants to read about an action-packed sea battle.\"IPMS, 08/2009\"outstanding book about naval warfare...real time, you are there style that conveys all of the anxiety of actual combat at sea.\" WWII History, Winter 2009\"essential background and new historical insights make otherwise inexplicable elements of the Bismarck story much clearer, without diminishing the drama of the epic sea chase and its vivid, human details.\"World War II Magazine, 11/2009\"A fresh look at the life and death of the most famous German warship of World War II.\"The NYMAS Review, Fall-Winter 2009",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Naval History",
    "Military Fiction",
    "Military History"
  ],
  "author": "Michael Tamelander",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/5792481-bismarck"
}