{
  "title": "O Castelo Animado",
  "description": "Mergulhe no universo mágico de Diana Wynne Jones, que inspirou a animação O castelo animado do Studio Ghibli. Nomeado pela revista Times como uma das fantasias mais icônicas de todos os tempos.Certo dia, enquanto trabalha na chapelaria da família, a jovem Sophie é surpreendida e misteriosamente amaldiçoada por uma terrível bruxa, que a transforma em uma senhora de noventa anos. Sem saber como se livrar do feitiço e com receio de não ser reconhecida pelas irmãs, Sophie foge e acaba parando em um fantástico castelo, comandado pelo jovem e sedutor Mago Howl, cuja reputação é de devorador de corações das moças do povoado. No castelo, onde passa a trabalhar, Sophie promove uma grande transformação, mudando os hábitos de Michael, o aprendiz de mago, e de Calcifer, o demônio do fogo, responsável pela “vida mágica” do lugar.Além de ficar presa no corpo de uma senhora, o feitiço impede que Sophie revele que está sob o efeito de uma maldição. Calcifer, que logo percebe o que está acontecendo, propõe que ela o ajude a se libertar do pacto que o liga ao Mago Howl, oferecendo, em troca, ajuda para quebrar a maldição da Bruxa.Enquanto Sophie aprende a lidar, na inusitada rotina do castelo, com o insensível e impetuoso Howl, ela descobre um novo mundo, repleto de magias e maldições, bruxas e feiticeiros, e – o mais importante – conhece uma nova e surpreendente versão de si mesma.De um modo ou outro interligadas, as histórias de Diana Wynne Jones são, definitivamente, o que você precisa para escapar do mundo real e viajar para bem longe: em um tapete diferente, para uma cidade distante, refúgio de poções mágicas, personagens fantásticos e um segredo a cada esquina. Com um projeto gráfico especialmene por Isadora Zeferino (@imzeferino), ilustradora carioca dona de trabalhos supercoloridos e com clientes como Faber Castell, Globosat e Melissa, O castelo animado e as demais obras da autora são o presente ideal – para alguém que você ama ou, melhor ainda, você mesmo.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Middle Grade",
    "Magic",
    "Classics",
    "Audiobook"
  ],
  "author": "Diana Wynne Jones",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/57914711-o-castelo-animado"
}