{
  "title": "The Secrets We Keep",
  "description": "High school freshman Emma Clark harbors a secret—a secret so vile it could implode her whole world, a secret she’s managed to keep hidden away. . . Until the day her best friend, Hannah, accuses Emma’s father of a heinous crime.Following her father’s arrest, and torn between loyalty to Hannah and to her family, Emma is devastated to learn she must testify against Hannah’s word in order to keep her family together. As Emma wrestles with this impossible decision, her fractured past begins to resurface piece by painful piece—causing the line to blur between her present-day reality and the dark fairytales she writes to survive, all of which threaten to expose Emma’s long-buried truths.The Secrets We Keep explores the complex, powerful bonds of friendship and family, asking the difficult question: at what point does Emma’s loyalty to another become a betrayal of herself? And perhaps the toughest question of all: Can Emma find the strength to finally unbury her secret?\"Well-written and heartfelt.[...] Impressive and brave.[...] A much-needed book and an important purchase.\" -School Library Journal *starred review*\"An exceedingly well-written, powerful, and suspenseful novel that lights the path toward truthfulness and healing.\" -Kirkus *starred review*\"Gustafson delivers a gut-wrenching account.[...] The narrative’s dark climax and Gustafson’s visceral prose don’t shy away from the inherent trauma surrounding sexual assault, making for a vital, heart-wrenching account of one teen’s harrowing experience.\" -Publishers Weekly *starred review*In the vein of Amber Smith's The Way I Used to Be and Kelly Loy Gilbert’s Conviction, this heartbreaking yet hopeful young adult novel follows a girl's struggle to reconcile friendship, sexual abuse, and the secrets we bury deep down inside to survive./b>",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Realistic Fiction",
    "Abuse",
    "Mental Health",
    "Young Adult Contemporary"
  ],
  "author": "Cassie Gustafson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/57965368-the-secrets-we-keep"
}