{
  "title": "Twenty Years Later",
  "description": "The New York Times Best Thrillers This Season | E! News Recommended Books | Overdrive Biggest Books of the Month Fans of Verity by Colleen Hoover won’t want to miss this thrilling new suspense novel from the #1 internationally bestselling author of The Girl Who Was Taken! Hiding her own dark past in plain sight, a TV reporter is determined to uncover the truth behind a gruesome murder decades after the investigation was abandoned. But TWENTY YEARS LATER, to understand the present, you need to listen to the past… Avery Mason, host of American Events, knows the subjects that grab a TV audience’s attention. Her latest story—a murder mystery laced with kinky sex, tragedy, and betrayal—is guaranteed to be ratings gold. New DNA technology has allowed the New York medical examiner’s office to make its first successful identification of a 9/11 victim in years. The twist: the victim, Victoria Ford, had been accused of the gruesome murder of her married lover. In a chilling last phone call to her sister, Victori Emma Kind has waited twenty years to put her sister to rest, but closure won’t be complete until she can clear Victoria’s name. Alone she’s had no luck, but she’s convinced that Avery’s connections and fame will help. Avery, hoping to negotiate a more lucrative network contract, goes into investigative overdrive. Victoria had been having an affair with a successful novelist, found hanging from the balcony of his Catskills mansion. The rope, the bedroom, and the entire crime scene was covered in Victoria’s DNA. But the twisted puzzle of Victoria’s private life just the beginning. And what Avery doesn't realize is that there are other players in the game who are interested in Avery’s own secret past—one she has kept hidden from both the network executives and her television audience. A secret she thought was dead and buried . . .  Accused of a brutal murder, Victoria Ford made a final chilling call from the North Tower on the morning of 9/11. Twenty years ago, no one listened. Today, you will.",
  "genres": [
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Book Club",
    "Suspense",
    "Audiobook"
  ],
  "author": "Charlie Donlea",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/57940030-twenty-years-later"
}