{
  "title": "Crime and Criminals of Victorian London",
  "description": "In this fascinating exploration of the seedy underside of London life in the Victorian era, Adrian Gray provides a rich picture of the sheer variety of criminal activity in the city. While taking care to cover the familiar Dickensian themes of grisly murders and ragged street urchins, he also uses a range of dramatic but forgotten cases as evidence for patterns of crime, and to illustrate the causes and effects of changes in criminal law. Starting with murder and other violent crimes, he shows how pure greed and genuine mental illness were both responsible for unpleasant cases - such as the murder of an elderly aristocrat in his bed or the poisoning of a series of 'working girls'. The author covers the whole spectrum of theft, from the spectacular - including train and bank robberies and the infamous garrotting gangs - to the mundane - such as the petty thieving by servants so typical of the times. Other chapters focus on less publicised topics, including prosecution for possession of obscene material, dynamite explosions set off by desperate Irishmen, the criminal sub-world 'down by the river' and the widespread rioting that typified popular politics at moments of crisis. Changes in the law are charted, showing how new offences were created from old customs, and how the law was updated to deal with new problems such as dangerous motor cars. In a book that covers the complete range of crime across a teeming Victorian metropolis, the reader will meet many colourful characters, including Charlie Peace, the professional burglar eventually hung for a squalid murder and Courvoisier, a murderous butler. With many gruesome details and excellent illustrations, this book will appeal to London and Victorian historians as well as the macabre-minded.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "History",
    "Victorian",
    "19th Century"
  ],
  "author": "Adrian Gray",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/12761014-crime-and-criminals-of-victorian-london"
}