{
  "title": "Cape Contrition",
  "description": "Joe Crowley and his dog have been on the road a long time when they stop over in the struggling fishing and logging town of Delilah on the coast of Oregon in autumn of 1962. A veteran of the Second World War and disgraced former author, Joe has squandered his prospects, fame, and family in a decade-long struggle with alcoholism and unresolved trauma. He feels his luck has turned around when he meets an eccentric, wealthy fan who approaches him with a strange proposition: the story that will save his career. On an unorthodox patronage, Joe is commissioned to live in a historic lighthouse keeper’s cottage at the edge of a remote headland three miles from town. There, he is to sample firsthand the isolation of a lighthouse keeper as he researches and writes the saga of the Ushers: the clannish, abusive, and cult-like family who tended the lighthouse in the 1910s, before perishing in unexplained circumstances. As Joe’s amateur sleuthing brings him closer to uncovering a dying town’s darkest shame, he comes to believe Cape Contrition is under the mastery of a diabolical and ancient power, manifest in a powerful supernatural entity known as the Drowned Woman. To understand this evil, Joe must learn the truth about the grisly fate of the Usher Family and follow the evidence through tragic local history and a disturbing series of suicides in town. But if Joe and his reluctant allies can discover a way to break the Drowned Woman’s power before even greater disaster strikes, he must first confront the demons of his past that brought him to Cape Contrition in the first place. After all, if he fails, who will think twice about an aging alcoholic writer throwing himself into the sea after living alone in that forlorn house? Especially after what he did.Cape Contrition is a terrifying, atmospheric, character-driven blend of Gothic fiction, paranormal and psychological horror, and Noir mystery, enriched by the unique setting of the rain-battered coast of the Pacific Northwest.“Ghosts, abusive cult family, ancient pagan deity from the sea, teenage witches, and government black hats testing experimental weapons… Am I missing anything? Oh, the forest fire coming closer to town every day. That was it.” -Will Blake, Chief of Police in Delilah, Oregon",
  "genres": [],
  "author": "Benjamin Connor Irwin",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/57940937-cape-contrition"
}