{
  "title": "Tattooed King, Unraveling the Mystery of Jesus",
  "description": "TIRED OF RELIGIOUS HYPOCRISY? READY TO KNOW THE REAL JESUS?Most people, even Christians have an incomplete image of Jesus. Religion has made Kingdom teachings about the afterlife. Surrender to God without intimacy with the Holy Spirit is mere religion. Break out of the stereotype and discover a relatable countercultural King who operates a revolutionary society on earth through regular people. It is possible that you have more in common with Jesus than you know, such as love of art, color, and even body art.Tattooed King, Unraveling the Mystery of Jesus welcomes readers into the actual personality of Jesus in ways that will deepen their faith. You will learn what Jesus meant when He taught in parables, replacing mystery with a clear understanding of His Kingdom of the heart. I love a mystery so much that I founded my own Private Investigative agency. But one need not be a trained detective to understand the Father’s heart. Each chapter clarifies a parable riddle, explaining Kingdom principles one by one. Put them together to grasp God’s character, His preferences, dislikes, His attractiveness, and true nature. God truly reveals Himself unceasingly.One spiritual root of social unrest in America is the lack of intimate knowledge of God and His Kingdom methods. The strategy of forces opposing Christ is to disparage the knowledge of God until it is completely disreputable and vanquished from American culture. It aims to silence Christianity and its influence in American society, replacing morality with tolerance and immoral choices. Learn how living from a kingdom mindset and practicing the values that Jesus espoused is a way to impact social change. Tattooed King provides you practical and Scriptural guidance, questions for reflection, and relatable personal illustrations to help you know the real Jesus. I invite you into the unraveling mystery!",
  "genres": [],
  "author": "Kathryne A. Leach",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/57962626-tattooed-king-unraveling-the-mystery-of-jesus"
}