{
  "title": "Antoinette's Sister",
  "description": "As Marie Antoinette took her last breath as Queen of France in Paris, another formidable monarch—Antoinette’s dearly beloved sister, Charlotte—was hundreds of miles away, in Naples, fighting desperately to secure her release from the revolutionaries who would take her life. Little did Charlotte know, however, that her sister’s execution would change the course of history—and bring about the end of her own empire.A Pennie's Pick book club selection. “You are the queen. You are the queen that Antoinette wanted to be.” Austria 1767 : Maria Carolina Charlotte—tenth daughter and one of sixteen children of Empress Maria Theresa of Austria—knows her position as a Habsburg archduchess will inevitably force her to leave her home, her family, and her cherished sister, Antoinette, whose companionship she values over all else. But not yet. The Habsburg family is celebrating a great Charlotte’s older sister, Josepha, has been promised to King Ferdinand IV of Naples and will soon take her place as queen. Before she can journey to her new home, however, tragedy strikes. After visiting the family crypt, Josepha contracts smallpox and dies. Shocked, Charlotte is forced to face an unthinkable new she must now marry Ferdinand in her sister’s stead. Bereft and alone, Charlotte finds that her life in Naples is more complicated than she could ever have imagined. Ferdinand is weak and feckless, and a disastrous wedding night plunges her into despair. Her husband’s regent, Tanucci, a controlling and power-hungry man, has pushed the country to the brink of ruin. Overwhelmed, she asks her brother Leopold, now the Holy Roman Emperor, to send help—which he does in the form of John Acton, a handsome military man twenty years Charlotte’s senior who is tasked with overseeing the Navy. Now, Charlotte must gather the strength to do what her mother did before take control of a country. In a time of political uprisings and royal executions and with the increasingly desperate crisis her favorite sister, Queen Marie Antoinette, is facing in France, how is a young monarch to keep hold of everything—and everyone—she loves? Find out in this sweeping, luxurious tale of family, court intrigue, and power.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Italy",
    "Romance",
    "18th Century",
    "France"
  ],
  "author": "Diana Giovinazzo",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/57941465-antoinette-s-sister"
}