{
  "title": "embracing God in the right perspective with the right foundation of faith in Him",
  "description": "Knowledge without God's enlightenment is not the Truth. Only Truth leads us to the meaning of Life as the Power of Life is in God. God is The Everlasting Truth. Faith without Understanding of Faith is an Unfinished Work in Faith.Each and every one of us needs to discover our true identity of who we are before we could truly inherit the fullness of Life as we desire to live a life filled with gifts in the fullest measure of Peace, Love, and Joy in our Hearts Now and Forevermore, with an Assured Destiny of Eternal Life!The Objective of this Book is not to put down any religious beliefs, teachings, laws, and practices we embrace. Its intention is to discover our true identity of who we are in the spiritual realm and how our identity relates to God, who is our Creator and Master of this Universe, and how this Father and Child Relationship gives us Freedom of Peace, which is the ultimate goal in Humanity in The Kingdom of God.I humbly express this Book as the priceless companion guide in studying the Word of God that shall bring forth healing to all souls throughout the nations on earth. All Glory be unto our Father God.God loves you! Jesus loves you! Amen. Let all men on earth embrace God in the right perspective with the right foundation of faith in Him. Every living soul in the history of mankind is a child of God. In Christ and through Christ, we shall all live again. Blood and flesh do not inherit the kingdom of God. Conquering Jerusalem is likened to men’s attempts to attain divinity and righteousness with the might and knowledge of the flesh. Such repeated feats as recorded throughout the history of mankind would never bring down the kingdom of God from heaven to earth. Our Heavenly Father is a God of Peace, Love and Harmony. He is not a God of War, Hatred and Division. Misguided beliefs and biblical misinterpretations through religious laws of men in the flesh had inflicted countless and senseless innocent bloodsheds upon mankind. Walking with faith in the flesh is knowledge. Walking with faith in the spirit is truth. All men shall be born again of the Word of God which is full of truth and grace, to fully embrace God and live eternally in His divine Truth and Spirit. The Word of God is embedded in all men as each man is born with a given measure of faith in the Word of God.The Word of God shall bring forth an abundance of insightful revelations and joyful enlightenment to your heart and soul. The return of Christ is a certainty with His millennial reign on earth! Jesus is the Alpha (the beginning of all) and Omega (the end of all). This Book contains end times prophecy. Pray that you keep your spiritual vigilance. The future middle eastern war is coming soon. The days and seasons are all numbered in the Word of God and the prophetic timeline in His Word has been predestined since the foundation of this world. This Book shall serve as a good text material for interfaith dialogue involving mainly Christians, Moslems, Jews and Taoists, or even Buddhists and Hindus. In many Christian seminars, speakers have relentlessly bashed Islam and other religious beliefs. It is the preordained duty of believers in Christ to share the Gospel of Light with members of other beliefs with understanding and love. You are glory pristine; therefore, you are glory destined. You shall know the truth and the truth shall set you free. God bless all of you! Amen.",
  "genres": [],
  "author": "Chris Tham",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/57977164-embracing-god-in-the-right-perspective-with-the-right-foundation-of-fait"
}