{
  "title": "The Safest Place",
  "description": "When Lena Martin gets set up with Ember Grove’s most boring bachelor Will Ashton, she doesn’t realize the worst part will be falling for his sister Grace.Especially when she finds out Grace is the girl she’s been anonymously exchanging love letters with—and who thinks her letter partner is a man.Relying on her friend Cara’s hospitality for a place to live, Lena really doesn’t have a choice when Cara tells her to start seeing her fiancé’s brother and have a date for their wedding. Never mind the fact that Lena’s been starting to realize maybe she’s not as straight as she’d thought—there’s no way she’s telling Cara that. As usual, her way out is to grin and bear it.Grace Ashton is tired of this small town and her family’s backwards attitude. After shoving her eldest brother Dan into planning his wedding with his ex and then lining up a date for her next brother Will, she knows she’s next on the chopping block, and wants to do whatever it takes to drive away this Lena Martin girl who’s apparently got her eyes on Will.And both of them find refuge in the same secret grotto, hidden deep in the woods, where they realize they’re not the only one with this secret hiding place, and leave anonymous letters for one another—and fall headfirst in love without even knowing the other’s name.And for Grace, without even knowing the anonymous letter writer she’s fallen for is a woman.But as wedding planning keeps drawing Lena and the Ashtons together, can Lena and Grace resist that same spark of connection in one another they feel from their love-letter writers?The Safest Place is a 78,000-word slow burn new adult romance set in the same small-town romance setting as and after the events of The Simple Answer, but follows different characters and stands alone. It features two absolute disasters who figure out the people they want to be, a double toaster oven plotline, overbearing family trying to get Lena with Will but her falling for his sister instead, some enemies-to-lovers that’s more like enemies-to-grudgingly-accepting-being-in-the-same-room-to-friends-to-enemies-to-best-friends-to-enemies-to-even-better-best-friends-to-lovers, and some very mushy falling in love anonymously via secret letters. Content warnings for open-door sex scenes, homophobic and abusive parents, mentions of past relationship abuse and of conversion therapy but it never happens I promise, Lena whacking Percy with a stick but he was asking for it, a very boring man who actually turns out to be all right, and a girl who stubbornly refuses to notice she’s a lesbian.",
  "genres": [
    "Lesbian",
    "Enemies To Lovers",
    "Queer",
    "Romance",
    "New Adult",
    "Lesbian Romance",
    "Friends To Lovers"
  ],
  "author": "Lily  Seabrooke",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/57982972-the-safest-place"
}