{
  "title": "The Refusal",
  "description": "WINNER OF 16 ROMANCE BOOK AWARDS: Overall winner of the 16th National Indie Excellence Awards and the National Excellence in Romance Fiction Awards for best first book. Winner of the Pinnacle Book Achievement Award. Finalist in the International Book awards. Global Book Award Gold.______________________________________________________________________________Have you ever had one of those really bad days at work?When you meet a famous guy in a lift and pretend not to know who he is?Only to find you’re working for him?No? Just me then?Now I’ve got to try and dazzle him with my personality and professionalism.Ha, bloody, ha.And you haven’t seen him.Janus Phillips. CEO.Floppy hair, heart-breaking smile. In and out of the tabloids.And did I mention his carousel of model girlfriends?I wear Doc Martens and strange clothes.Yeah. Riiiight.Problem is, I think he kind of likes me.That is, until he catches me with someone else.So now he’s gorgeous and pissed off.And we’ve got to go to Hong Kong together.What could possibly go wrong?The Refusal is a full-length romance with a HEA and no cliffhanger. Don’t miss out on this fun, edge-of-the-seat read. Click BUY NOW to find out what happens between Jo and Janus.HOW OBSESSED CAN YOU GET WITH A NEW ROMANCE SERIES?\"Have you ever found yourself reading a really exceptional book and you find that you’re forcing yourself to slow down on your reading because you simply don’t want the book to end? That’s exactly how I felt.” Shannon Kuhn Writes\"Do not pass on this story. You won't regret reading it!\" Vivian Gunn, Erotic Romance Author\"I loved, loved, loved it! Jo and Janus have captured my heart. Definitely in my top 5 romance novels! I can't wait to see what comes next in the series. Eve M. Riley may be a debut author but she's right up there with the great romance authors. This book is a definite must read!\" Clare Murphy, Romance Author\"I’m ruined now. I loved this story! I didn’t want to put it down. Jo with her fierce attitude and Janus’s softness yet domineering way made for the perfect couple!\" C.G. Miller, Romance Author, Marked for You\"The Refusal is overall one of the best romance novels I have read in a long time. I can't wait to read the next in series.\" T.S. Simons, Author, Antipodes“Let’s all take a moment of silence now that I’ve finished this book and it’s truly over until book two is released. This is a must read and will get you out of any book slump you’ve fallen into.” Beauty and The Book, Book Blogger“I loved this book. I finished it in one day because I couldn't put it down.” All the Romance, Book Blog“I have to say, first of all, DAMN! This book was sensational!” Pride Prejudice and Pups, Goodreads Reviewer“Janus and Jo's story is absolutely brilliant. I loved the slow burn of their relationship at first and then the risk for it all!” Anne Mckayla, Book Blogger",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Workplace Romance",
    "Slow Burn",
    "Fiction",
    "Friends To Lovers"
  ],
  "author": "Eve M. Riley",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/57990486-the-refusal"
}