{
  "title": "The Party Crasher",
  "description": "From the #1 New York Times bestselling author of Love Your Life comes a humorous and heartwarming novel about family, set against the backdrop of the most fabulous party you've ever snuck into.It's been over two years since Effie's beloved parents got divorced, destroying the image of the happy, loving childhood she thought she had. Since then, she's become estranged from her father and embarked on a feud with his hot (and much younger) girlfriend, Krista. And now, more earth-shattering news: Greenoaks, the rambling Victorian country house Effie called home her whole life, has been sold.When Krista decides to throw a grand \"house cooling\" party, Effie is originally left off the guest list--and then receives a last-minute \"anti-invitation\" (maybe it's because she called Krista a gold-digger, but Krista totally deserved it, and it was mostly a joke anyway). Effie declines, but then remembers a beloved childhood treasure is still hidden in the house. Her only chance to retrieve it is to break into Greenoaks while everyone is busy celebrating. As Effie sneaks around the house, hiding under tables and peeping through trapdoors, she realizes the secrets Greenoaks holds aren't just in the dusty passageways and hidden attics she grew up exploring. Watching how her sister, brother, and dad behave when they think no one is looking, Effie overhears conversations, makes discoveries, and begins to see her family in a new light. Then she runs into Joe--the love of her life, who long ago broke her heart, and who's still as handsome and funny as ever--and even more truths emerge.But will Effie act on these revelations? Will she stay hidden or step out into the party and take her place with her family? And truthfully, what did she really come back to Greenoaks for? Over the course of one blowout party, Effie realizes that she must be honest with herself and confront her past before she'll ever be able to face her future.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Family",
    "Humor"
  ],
  "author": "Sophie Kinsella",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/57996835-the-party-crasher"
}