{
  "title": "Foxgloves in Summer",
  "description": "After losing her leg in an accident when she was eight years old, Nora Seymour has never felt whole. Years later, her stepfather’s passing and her mother’s declining health have left her at the mercy of the baron Thomas Bradley, her cruel stepbrother, and his callous wife Josephine. With only her sickly mother and their loyal maid, Helen, to offer any respite, Nora escapes into the secret novels she writes in the privacy of her room. One night, when Thomas’ abuse turns violent, Nora flees into the woods for her usual hiding place—the old hunting lodge.Westley Haywood has spent his life hiding from society events as well as the women who attend them. As the son of the Duke of Harrington, he will one day inherit the title and all the responsibilities that come with it. Preferring instead to spend his days shut up in his workroom with his inventions, Westley makes a wager with his frustrated father—he must either create something worthwhile by the last day of summer or choose a woman to court at the end-of-season ball. Eager to prove to his father that he is not wasting his time, Westley withdraws to his family’s hunting lodge for a little peace and quiet. The last thing he expects to find is an intruder in the lodge. An intruder that will change his life forever.Thrown together by chance, Westley quickly realizes that the beautiful trespasser just might be the answer to all of his problems. Nora agrees to help him win his wager, permitting him to create a prosthesis that will allow her to walk without a crutch. With her mother’s condition worsening and the ball quickly approaching, Nora and Westley must each put aside their feelings of inadequacy and self-doubt and realize that what they really need is each other. What started out as a business arrangement just might turn into so much more.",
  "genres": [
    "Historical",
    "Historical Romance",
    "Romance",
    "Historical Fiction",
    "Fiction",
    "Regency Romance",
    "Disability"
  ],
  "author": "Penelope Daniels",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/57996961-foxgloves-in-summer"
}