{
  "title": "Accidental Happiness",
  "description": "Someone once told me that groupings of objects should be displayed in threes. Three provides both tension and balance among items of varying size and heft. My sister’s accident made me an only child; my husband’s accident made me a widow. Part of me will always believe that Angel was the third, the one that left me with hope.After her husband’s unexpected death at the age of thirty-six, Gina Melrose becomes a “live-aboard” on his boat, docked at a marina in coastal South Carolina, near the home she and Ben once shared. In this temporary, borrowed existence on the water, she settles into numb survival. But Gina finds her life taking yet another dramatic turn late one night when a woman named Reese disrupts her quiet world.  With Reese comes a   a charming girl named Angel. After a rough start, Gina realizes that, strange as it may seem, she’s drawn to both Reese and Angel. Their sudden appearance shatters the stillness–and Gina is remade. She is fascinated by Reese, who seems both invincible and vulnerable–and whose past may hold the key to Gina’s future. Gina begins to realize that for the first time since Ben’s death, she’s getting her senses back. As both pain and joy reenter her world, Gina discovers that she is able to accept feeling in order to live fully once more.But the biggest surprise for Gina is her relationship with Angel. After the painful loss of her sister during childhood, Gina had decided that she would never have children of her own. Struggling through conflicted emotions, Gina’s finds her life unexpectedly transformed by the precocious little girl who may be Ben’s daughter.This tender, poignant novel movingly explores the bonds of family and the resilience of hope. In the accomplished tradition of the novels of Elizabeth Berg and Anita Shreve, Jean Reynolds Page’s Accidental Happiness is a lyrical, enthralling drama unafraid to examine complex relationships with a clear eye and an honest heart.",
  "genres": [
    "Fiction",
    "Audiobook"
  ],
  "author": "Jean Reynolds Page",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/127631.Accidental_Happiness"
}