{
  "title": "Hold on to My Heart",
  "description": "Ashley Sullivan’s whole world changed when she got pregnant at seventeen. After the father of her child ditched her and their son, she bypassed college, shelved her plans to see the world, and went straight to managing the family café in Bar Harbor, Maine. For the next eleven years, she poured her entire heart into raising her amazing son, Kevin. But when her brother invites her to the grand opening of his new hotel in Vienna, she decides it's finally time to experience a little of the adventure she still secretly longs for. She isn’t planning on doing anything crazy, of course. Especially not something as wild and reckless as ending up in bed with one of the sexiest music superstars in the world...Nash Hardwin has been on the road full time since leaving his rough childhood behind when he was sixteen. Beloved by millions of fans around the world, he’s never had a real home and never trusted anyone enough to fall in love. Not until he meets Ashley Sullivan. After she unexpectedly steps in to help him out of a very tricky situation, he ends up having the best day of his life with her in Vienna. Ashley is sweet, beautiful and intelligent...with the biggest heart of anyone he’s ever met.When their perfect day together inevitably turns into an even more perfect night, there’s no denying that they make incredibly beautiful music together. But is there even the slightest chance that the small-town single mom and the road warrior rock star can make things work? Or will the realities of lives that are polar opposites make it impossible to hold on to each other’s hearts?HOLD ON TO MY HEART is part of Bella Andre's USA Today and New York Times #1 bestselling series about The Sullivans. W",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "Fiction",
    "Music"
  ],
  "author": "Bella Andre",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/58037672-hold-on-to-my-heart"
}