{
  "title": "Abolition For The People",
  "description": "Edited by activist and former San Francisco 49ers Super Bowl quarterback Colin Kaepernick, Abolition for the People is a manifesto calling for a world beyond prisons and policing.Abolition for the People brings together 30 essays representing a diversity of voices—political prisoners, grassroots organizers, scholars, and relatives of those killed by the anti-Black terrorism of policing and prisons. This collection presents readers with a moral question. \"Will you continue to be actively complicit in the perpetuation of these systems,” Kaepernick asks in his introduction, “or will you take action to dismantle them for the benefit of a just future?”Powered by courageous hope and imagination, Abolition for the People provides a blueprint and vision for creating an abolitionist future where communities can be safe, valued, and truly free. “Another world is possible,” Kaepernick writes, “a world grounded in love, justice, and accountability, a world grounded in safety and good health, a world grounded in meeting the needs of the people.”The complexity of abolitionist concepts and the enormity of the task at hand can be overwhelming. To help readers on their journey toward a greater understanding, each essay in the collection is followed by a reader’s guide that offers further provocations on the subject.Newcomers to these ideas might Is the abolition of the prison industrial complex too drastic? Can we really get rid of prisons and policing altogether? As writes organizer and New York Times bestselling author Mariame Kaba, “The short We can. We must. We are.”Abolition for the People begins by uncovering the lethal anti-Black histories of policing and incarceration in the United States. Juxtaposing today’s moment with 19th-century movements for the abolition of slavery, freedom fighter Angela Y. Davis writes “Just as we hear calls today for a more humane policing, people then called for a more humane slavery.” Drawing on decades of scholarship and personal experience, each author deftly refutes the notion that police and prisons can be made fairer and more humane through piecemeal reformation. As Derecka Purnell argues, “reforms do not make the criminal legal system more just, but obscure its violence more efficiently.”Blending rigorous analysis with first-person narratives, Abolition for the People definitively makes the case that the only political future worth building is one without and beyond police and prisons.You won’t find all the answers here, but you will find the right questions--questions that open up radical possibilities for a future where all communities can thrive.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Race",
    "Social Justice",
    "History",
    "Sociology",
    "Activism"
  ],
  "author": "Colin Kaepernick",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/58021042-abolition-for-the-people"
}