{
  "title": "Snowflake Falls Romance Bundle: Christmas, Trapped and New Year with the Guy Next Door: Books 1-3",
  "description": "★Welcome to Snowflake Falls★ It’s a special place, where it’s usually a holiday of some kind; the snow is deep, the men are HOT and steamy romance is waiting around every corner. 1. Christmas with the Guy Next DoorA BBW Guy Next Door RomanceTannenI hate Christmas, with a side order of hell...no. I have two rules: no relationships and no decorations. But the last thing I expected was a woman like Hollee to move in next door. She’s curvy, gorgeous and I can’t resist her.I’ll deliver her Christmas tree and warm her up by the fire.But am I willing to drop my defences for this special present? She’ll have to take my wrapping off to find out.HolleeI love Christmas, with extra sprinkles on top. But my holiday plans are a mess.Then I literally slide into the guy next door at the coffee shop.Tannen’s a grande cup of tall, dark and extra, extra hot. Even better, he cuts down trees for a living. His trees may be super-sized, but he’s even bigger.Can my sexy next door neighbour give me a holiday miracle?2. Trapped with the Guy Next DoorA second chance romance with first love.NevaI’ve lost my job, home and boyfriend. Just before Christmas.But when I move back home, my gorgeous high school crush is living right next door. He’s sex in a Santa suit but there are two big problems.One - I think he hates me. And two - he’s my new boss. Will getting trapped with him make my Christmas wish come true?EldenI’ve never stopped thinking about her. But she left me high and dry on our third date when she was at high school.Now she’s back in Snowflake Falls, working with me every day and I can’t get her out of my head.She’s the sexiest Christmas helper I’ve ever seen, but can I forget the past?3. New Year with the Guy Next DoorAn enemies to lovers miltary alpha guy next door holiday romance. TaylorI didn’t expect to spend my New Year catering for a big party. And I really didn’t expect my next door neighbor to be there with me. Miles is hot as hellfire but we don’t see eye to eye. He’s order and I’m chaos - it’s a recipe for fireworks.When the whole thing goes up in flames, will he save me or watch me burn? MilesI’ve had my eye on her since she moved in next door.But I’m usually serving overseas, until a family tragedy brings me back home. Taylor’s a perfect 10 but she’s making one hell of a mess. She’s way out of line and breaking down all my boundaries. Can I rescue her from disaster and be the hero she needs?Each story is standalone, but keep an eye out for recurring characters and families in every one. Grab your favourite drink or snuggle up under the covers and get ready for the delicious men in these three stories to turn up the heat!Jessa ♥",
  "genres": [],
  "author": "Jessa Joy",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/58034472-snowflake-falls-romance-bundle"
}