{
  "title": "Rethinking Sex: A Provocation",
  "description": "Part searing examination, part call to arms—a bold case against modern sexual ethics, from young Washington Post columnist Christine Emba.For years now, modern-day sexual ethics has held that “anything goes” when it comes to sex—as long as everyone says yes, and does so enthusiastically. So why, even when consent has been ascertained, are so many of our sexual experiences filled with frustration, and disappointment, even shame? The truth is that the rules that make up today’s consent-only sexual code may actually be the cause of our sexual malaise—not the solution. In Rethinking Sex, reporter Christine Emba shows how consent is a good ethical floor but a terrible ceiling. She spells out the cultural, historical, and psychological forces that have warped our idea of sex, what is permitted, and what is considered “safe.” In visiting critical points in recent years—from #MeToo and the Aziz Ansari scandal, to the phenomenal response to “Cat Person”—she reveals how a consent-only view of sex has hijacked our ability to form authentic and long-lasting connections, exposing us further to chronic isolation and resentment. Reaching back to the wisdom of thinkers like Thomas Aquinas and Andrea Dworkin, and drawing from sociological studies, interviews with college students, and poignant examples from her own life, Emba calls for a more humane philosophy, one that starts with consent but accounts for the very real emotional, mental, social, and political implications of sex—even, she argues, if it means saying no to certain sexual practices or challenging societal expectations altogether. More than a bold reassessment of modern norms, Rethinking Sex invites us to imagine what it means to will the good of others, and in turn, attain greater affirmation, fulfillment, and satisfaction for ourselves.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Sexuality",
    "Sociology",
    "Philosophy",
    "Gender",
    "Relationships"
  ],
  "author": "Christine Emba",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/58037743-rethinking-sex"
}