{
  "title": "Stuck Improving: Racial Equity and School Leadership",
  "description": "An incisive case study of changemaking in action, Stuck Improving analyzes the complex process of racial equity reform within K–12 schools. Scholar Decoteau J. Irby emphasizes that racial equity is dynamic, shifting as our emerging racial consciousness evolves and as racism asserts itself anew. Those who accept the challenge of reform find themselves “stuck improving,” caught in a perpetual dilemma of both making progress and finding ever more progress to be made. Rather than dismissing stuckness as failure, Irby embraces it as an inextricable part of the improvement process.Irby brings readers into a large suburban high school as school leaders strive to redress racial inequities among the school’s increasingly diverse student population. Over a five-year period, he witnesses both progress and setbacks in the leaders’ attempts to provide an educational environment that is intellectually, socioemotionally, and culturally affirming.Looking beyond this single school, Irby pinpoints the factors that are essential to the work of equity reform in education. He argues that lasting transformation relies most urgently on the cultivation of organizational conditions that render structural racism impossible to preserve. Irby emphasizes how schools must strengthen and leverage personal, relational, and organizational capacities in order to sustain meaningful change.Stuck Improving offers a clear-eyed accounting of school-improvement practices, including data-driven instructional approaches, teacher cultural competency, and inquiry-based leadership strategies. This timely work contributes both to the practical efforts of equity-minded school leaders and to a deeper understanding of what the work of racial equity improvement truly entails.",
  "genres": [
    "Education",
    "Nonfiction"
  ],
  "author": "Decoteau J. Irby",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/58038529-stuck-improving"
}