{
  "title": "Love Springs Eternal",
  "description": "Apprenticed to the infamous Necromancer of Boston, Daniel Macavoy has seen a lot of upheaval in his life since that fateful day. Rescued from an abusive father and the monster he was once enslaved by, Daniel has struggled with every trauma that scarred his heart and mind.Yet with the love and support of his found family, Daniel has become stronger than he ever imagined. A capable sorcerer, he's been entrusted with the ancestral family seat of the Salvatores, the legendary site of the Massacre, the culmination of the centuries long Blood Wars between the Salvatores and the Macavoys. The huge mansion is a testament to old school magic, high sorcery, and comes with a history almost as impressive as the enigmatic fae warrior who calls the gardens home.Rory Brennan is immortal. A member of the nearly extinct High Court Sidhe, Rory remembers when humans climbed down from trees and learned to stand upright. His long life has been spent hand in hand with his identical twin, Cian, who happens to be locked in prison, sentenced to a thousand years for heinous crimes committed while Rory slept for centuries in stasis, hovering at the edge of death. Rory wakes to a modern world after his resurrection at the hands of the Necromancer of Boston, only to lose Cian to a mortal prison.Once worshipped as a god, Rory Brennan is learning what it means to exist in a modern mortal world. Rory finds that for the very first time, true love has found its way into his immortal heart.Daniel and Rory grow closer, love springing to life in the narrowing space between them. Daniel has concerns about Cian, the serial killer twin brother of the man he loves, and the repeated attempts of strangers trying to break into the Mansion. He's got no idea what these strangers are after, and Rory is certain that Cian is in ever-growing danger locked up in Blackguard Prison.With the danger increasing from all sides, Daniel and Rory struggle to balance surviving with falling in love. A dragon with a growth spurt isn't helping matters, and his mentor's watchful eye makes things both more awkward and potentially lethal.LOVE SPRINGS ETERNAL is the fifth book in the bestselling Beacon Hill Sorcerer series and should not be read as a standalone.",
  "genres": [
    "Paranormal",
    "M M Romance",
    "Fantasy",
    "Urban Fantasy",
    "Magic",
    "Vampires",
    "Romance"
  ],
  "author": "S.J. Himes",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/58038223-love-springs-eternal"
}