{
  "title": "المدونة الكبرى",
  "description": "الإمام مالك بن أنس عالم المدينة وإمام دار الهجرة والمحدث الأعظم المتوفى سنة 179 أخذ العلم عن تسعمائة شيخ فأكثر وما أفتى حتى شهد له سبعون إماما أنه أهل لذلك وكتب بيده مائة ألف حديث وجلس للدرس وهو ابن سبعة عشر عاماقال الشافعي إذا جاء الأثر فمالك النجم وإذا ذكر العلماء فمالك النجم الثاقب ولم يبلغ أحد مبلغ مالك في العلم لحفظه وإتقانه وصيانته وما أحد أمن علي في الله من مالك وجعلت مالكا حجة بيني وبين الله تعالى.وقال بن حنبل: كان مالك مهيبا في مجلسه لا يرد عليه إعظاما وكان الثوري في مجلسه فلما رأى إجلال الناس له وإجلاله للعلم أنشد:يأبى الجواب فما يراجع هيبة ... فالسائلون نواكسوا الأذقانأدب الوقار وعز سلطان التقى ... فهو المهيب وليس ذا سلطانقال بشر الحافي: إن من زينة الدنيا أن يقول الرجل: حدثنا مالك.وقال القعنبي: ما أحسب بلغ مالك ما بلغ إلا بسريرة كانت بينه وبين الله تعالى رأيته يقام بين يديه الرجل كما يقام بين يدي الأمير.وعنه روى الإمام سحنون بن سعيد التنوخي عن الإمام عبد الرحمن بن القاسم العنقي كتاب المدونة الكبرى في فقه مالك. وهذا السفر الجليل عند المالكية ككتاب الأم عند الشافعية فيها من أحاديث الرسول - صلى الله عليه وسلم - 4000 حديث. ومن الآثار 36000 أثر – و40000 مسألة تضطرنا إلى الاستغراق في تلاوتها الساعات وقد استفدنا أمورا ما كنا نظن أحدا من الفقهاء حرك فيها بنانا ولا غرو ففي مذهب مالك من التوسع في العبادات والمعاملات ما لا تراه في غيرهعبد الرحمن بن القاسم العتقيقال الدارقطني: هو من كبار المصريين وفقهائهم رجل صالح مقل صابر متقن حسن الضبط.سئل مالك عنه وعن بن وهب فقال: بن وهب عالم وابن القاسم فقيه.وقال النسائي: بن القاسم ثقة رجل صالح سبحان الله ما أحسن حديثه وأصحه عن مالك ليس يختلف في كلمة ولم يرو - أحد الموطأ عن مالك أثبت من بن القاسم وليس أحد من أصحاب مالك عندي مثله قيل له: فأشهب؟ قال: ولا أشهب ولا غيره وهو عجب من العجب: الفضل والزهد وصحة الرواية وحسن الحديث حديثه يشهد له.وقال بن وهب لأبي ثابت: إن أردت هذا الشأن يعني فقه مالك فعليك بابن القاسم فإنه انفرد به وشغلنا بغيره. وبهذا الطريق رجح القاضي أبو محمد: عبد الوهاب مسائل المدونة لرواية سحنون لها عن بن القاسم وانفرد بن القاسم بمالك وطول صيته له وأنه لم يخلط به غيره - إلا في شيء يسير ثم كون سحنون أيضا مع بن القاسم بهذا السبيل مع ما كانا عليه من الفضل والعلم. وقال يحيى بن يحيى: كان بن القاسم أعلمهم بعلم مالك وآمنهم عليه.وقال بن حارث: هو أقعد الناس بمذهب مالك وسمعنا الشيوخ يفضلون بن القاسم على جميع أصحابه في علم البيوع وقال له مالك: اتق الله وعليك بنشر هذا العلم.وكان بن القاسم لا يقبل جوائز السلطان وكان يقول: ليس في قرب الولاة ولا في الدنو منهم خير.عبد السلام أبو سعيد: سحنون بن سعيد بن حبيب التنوخيقال أبو العرب: كان سحنون ثقة حافظا للعلم فقيه البدن اجتمعت فيه خلال قلما اجتمعت في غيره: الفقه البارع والورع الصادق والصرامة في الحق والزهادة في الدنيا والتخشن في الملبس والمطعم والسماحة.وكان لا يقبل من السلطان شيئا وربما وصل أصحابه بالثلاثين دينارا أو نحوها. ومناقبه كثيرة وكان مع هذا رقيق القلب غزير الدمعة ظاهر الخشوع متواضعا قليل التصنع كريم الأخلاق حسن الأدب سالم الصدر شديدا على أهل البدع لا يخاف في الله لومة لائم وسلم له الإمامة أهل عصره واجتمعوا على فضله وتقديمه.سئل أشهب عمن قدم إليكم من أهل المغرب؟ قال: سحنون قيل له: فأسد؟ قال: سحنون والله أفقه منه بتسع وتسعين مرة. وقال أيضا: ما قدم إلينا من المغرب مثله وقال بن القاسم: ما قدم إلينا من إفريقية مثل سحنون قال أبو زيد بن أبي الغمر: لم يقدم علينا أفقه من سحنون إلا أنه قدم علينا من هو أطول لسانا منه يعني بن حبيب. وقال يونس بن عبد الأعلى: هو سيد أهل المغرب فقال له حمديس: أو لم يكن سيد أهل المغرب والمشرق؟أخذ سحنون من بن وهب مغازيه إجازة وكان العلم في صدر سحنون كسورة من القرآن من حفظه وقال سحنون: إني حفظت هذه الكتب حتى صارت في صدري كأم القرآن وقال بن القاسم: إن أسعد أحد - بهذه الكتب - لسحنون. وقال بن وضاح: كان سحنون يروي تسعة وعشرين سماعا وما رأيت في الفقه مثل سحنون بالمشرق.وقال بن حارث: قدم سحنون بمذهب مالك واجتمع له مع ذلك فضل الدين والعقل والورع والعفاف والانقباض فبارك الله فيه للمسلمين فمالت إليه الوجوه وأحبته القلوب وصار زمانه كأنه مبتدأ قد انمحى ما قبله فكان أصحابه سرج أهل القيروان وأنبه علمائها وأكثرهم تأليفا وابن عبدوس فقيهها وابن غافق عاقلها. وابن عمر حافظها وجبلة زاهدها وحمديس أصلبهم في السنة وأعداهم للبدعة وسعيد بن الحداد لسانها وفصيحها وابن مسكين أرواهم للكتب والحديث وأشدهم وقارا.",
  "genres": [
    "Religion",
    "Islam"
  ],
  "author": "Malik Ibn Anas",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/58023726"
}