{
  "title": "Kye's Heart",
  "description": "Kye’s idea of fun doesn’t include toting Roxie’s three-month-old daughter to the zoo, but like the good little Protector he is, Kye travels to the land of exotic furballs with pup in tow...and then smacks himself for not heading to the zoo ages ago. There, dressed in drab brown and looking more gorgeous than any woman he’s ever seen, Kye knows he’s finally found his mate.Being a zookeeper, Michaela is used to soothing savage beasts...not screaming babies. Feeling sorry for the hottie who’s looking more panicked by the second, she’s quick to offer her assistance in calming the little bundle of adorable he’s holding. Of course Kye doesn’t hesitate to show his appreciation by asking her out and giving her a kiss that sends her heart racing.While Kye struggles to tell Michaela about his penchant for howling at the moon, he manages to toss her right into the middle of his secretive life as a Protector and all the fangs that it entails. The question Can Michaela tolerate any more fur in her life, or is she going to trample all over Kye’s heart?***Kye's Heart is a very romantic tale, and the story I've enjoyed the most of this series. The plot was quick-paced, and it was good to read how quickly the two characters were introduced to each other. I enjoyed the dialogue between Kye and Michaela, especially because it was so playful and described so romantically the instantaneous chemistry between them. As for the sex scenes, they were very hot revealing that Kye knows how to treat a woman because he wanted Michaela forever and not just for one night. What I liked so much about Michaela was her brave nature in being able to handle the truth about Kye. While with Kye, I liked how protective he was not just of his mate but of Nevaeh as well.Bec, The Romance Studio ~ 4/5 Stars***\"Those of you that are familiar with my reviews will know that this series and author are one of my favorites and will probably guess that I enjoyed this book. Well you would be right... Kye’s Heart is more of a fun and entertaining read... I loved Kye he is a wonderful man and when he puts Michaela’s high school nemesis in her place he won a place in my heart. Michaela is a good woman with a big heart and how could I not love that she is a zookeeper. The two make a great couple. I enjoyed the trust and love that developed between them.The bond Kye is forming with Nevaeh is a wonderful read as well. The scenes with her, Kye and Michaela were too cute. She is an adorable little baby and I hope that we get to see more of her. Having Nevaeh adds another dimension to an already interesting story and I cannot wait to see where the rest of this series is going to go.\"Gabrielle, You Gotta Read Reviews",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Shapeshifters",
    "Erotica",
    "Werewolves",
    "Adult"
  ],
  "author": "Marisa Chenery",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/12763947-kye-s-heart"
}