{
  "title": "The Finn Chronicles: Year Three",
  "description": "The third book in the hilarious series is here! Training hoomans is a ruff job, but somedoggy has to do it. T he Finn Chronicles © is a unique story told by an extraordinary dog. Join Finn as he shares his third year of weekly reports about his struggles to train and protect his rescued hoomans. With sarcastic wit, he observes the curious world around him, heroically saves his hoomans from danger, and vents about his lackluster servants. With bonus content like links to Finn’s social media and videos, you’ll get to see this vocal and opinionated dog in action. You’re sure to fall in love with Finn, his hilarious facial expressions, his tantrums, and even his dim-witted hoomans. This is the light-hearted and funny read we need in these not so light-hearted times. ★ A review from BESTSELLING AUTHOR, Melissa Bourbon/Winnie \"Calling all dog lovers. With The Finn Chronicles , not only will you laugh out loud, your heart will melt as Finn tells his tales about the hoomans he loves - and who adore him. You'll be absolutely charmed.\" ★ ♥ “A hysterical and light-hearted view into the life of the luckiest rescue in the world...oh, and the dog that rescued them.\" ♥ \"This is a most unusual book, and completely enthralling! Finn is wise and witty, not sentimental nor sappy. He knows what's going on, and tries so hard to stay in control of life with two humans who just don't seem to get it. The sense of humor is terrific, and it just does not grow old. As the year closed, I was reading more slowly, hoping to make it last longer. Finn's editor (The Squishy One) writes with a real voice, and doesn't insert herself, but gives Finn the entire stage. It's great fun, and should be in the hands of everyone who has ever owned a dog, wanted a dog, or admired a dog!\" ♥ \"Hilariously funny for both kids and adults! We love hearing about Finn's adventures and his witty personality comes through in his tales. Well written. I have recommended to all my animal loving friends. We love Finn!!!\" ♥ \"The Finn Chronicles is a wonderful documentary of stories told through the eyes of Finn (of course cleverly narrated via the author). Finn (or his ghost writer :)) has an amazing ability to share the highs and lows of his adventures; from rescue dog to rescuer. The author has a beautiful storytelling ability and her hash game is totally on point. I enjoyed reading about his stories—and a perfect distraction to the heaviness of the times.\" ♥ “One of the funniest diaries you'll ever read. I first came across The Finn Chronicles as a series of Facebook posts and was immediately hooked. I don't use Facebook for much, but reading Finn's updates was something my whole family grew to love. Gwen is a fantastic writer, and has a gift for translating Finn's world into a hilarious soliloquy, as he reports on his daily life, rituals, food explorations, adventures and temper tantrums. You will quickly fall in love with this bold, moody, opinionated dog & his wonderful people. It's a must read for any dog lover!\"",
  "genres": [],
  "author": "Gwen Romack",
  "average_rating": "4.97",
  "url": "https://www.goodreads.com/book/show/58020164-the-finn-chronicles"
}