{
  "title": "City of Lights",
  "description": "Far From Home, an ordinary girl is a powerful warrior: Mary Jingo of the Shadowlands, the People of LeeChee’s great hope.City of Lights is the debut book in the Far From Home series, a BRAND NEW juvenile / middle-grade fiction fantasy series. A very ordinary eleven-year-old girl finds herself on the brink of adventure. As she is whisked away to the land of LeeChee (teeming with flying bicycles—Flycycles—and Thunderbirds), she must decide if she is willing and able to help the Resistors restore the Everything and conquer the evil Shoeboxians. Gear up, future Oracles in Training, your journey to LeeChee is about to begin. The first book in the new Far From Home series, City of Lights is a middle-grade / juvenile literature book for students and children age 9 to 99.\nFrom the back cover:\nOh! Hello there, future reader. Thank you for picking up this book. Your humble narrator would like you to know that this is a story worth reading—if you like tales about ordinary girls who get the chance to be whisked off to magical lands, that is! Our main character is one Mary Jingo. When you crack the spine on this volume, she will be one week away from finishing fifth grade and already looking forward to middle school and getting her own phone.But then this ordinary girl will notice glimmers of light and meet a strange little man who conjures the best smells she has ever smelled. Before she even stops to consider what she’s doing, she agrees to set off on an adventure into the strange new land of LeeChee. Far From Home, an ordinary girl is a powerful warrior: Mary Jingo of the Shadowlands, the People of LeeChee’s great hope.Now our heroine must find a way to save LeeChee from Thrall and restore the Everything. How can she face down the Void, the foul-smelling Shoeboxians, or the evil Mellie? But that’s a lot of details and words that are probably new to you, dear reader. You’ll just need to open these pages and read about Mary Jingo’s adventures Far From Home.",
  "genres": [
    "Middle Grade"
  ],
  "author": "Kelly Byrd",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/58059452-city-of-lights"
}