{
  "title": "Peachtree Creek: A Natural and Unnatural History of Atlanta's Watershed",
  "description": "In 1990 David Kaufman decided to explore Peachtree Creek from its headwaters to its confluence with the Chattahoochee River. For thirteen years he paddled the creek, photographed it, and researched its history as the Atlanta area's major watershed. The result is Peachtree Creek , a compelling mix of urban travelogue, local history, and call for conservation. Historical images and Kaufman's evocative color photographs help capture the creek's many faces, past and present.Most Atlantans only glimpse Peachtree Creek briefly, as they pass over it on their daily commute, if at all. Looking down on the creek from Piedmont or Peachtree Roads, few contemplate how it courses through the city, where it originates and flows to. Fewer still-many fewer-would ever consider paddling down it, with its pollution and flash floods.Through his expeditions down Peachtree Creek and its five tributaries―North Fork, South Fork, Clear Creek, Nancy Creek, and Tanyard Creek―Kaufman takes readers through such places as Piedmont and Chastain Parks, which, aside from the polluted water, are beautiful, even bucolic. Other stretches of creek, like those draining Midtown and Atlantic Station, are channeled into massive culverts and choked with discarded waste from the city. One day, floating past the Bobby Jones Golf Course, he surprises a golfer searching for his stray ball along the creek bank; another he spends talking to a homeless man living under a bridge near Buckhead.Kaufman reveals fascinating aspects of Atlanta by examining how Peachtree Creek shaped and was shaped by the history of the area. Street names like Moore's Mill Road and Howell Mill Road take on new meaning. He explains the dynamics of water run off that cause the creek to go from a trickle to a torrent in a matter of hours. Kaufman asks how a waterway that was once people's source of water, power, and livelihood became, at its worst, an open sewer and flooding hazard. Portraying some of our worst mishandling of the environment, Kaufman suggests ways to a more sustainable stewardship of Peachtree Creek.",
  "genres": [
    "Photography",
    "Nature",
    "History"
  ],
  "author": "David R. Kaufman",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/580448.Peachtree_Creek"
}