{
  "title": "The Black Boom",
  "description": "Economic inequality continues to be one of America’s most hotly debated topics. Still, there has been relatively little discussion of the fact that black-white gaps in joblessness, income, poverty and other measures were shrinking before the pandemic. Why was it happening, and why did this phenomenon go unacknowledged by so much media? In  The Black Boom , Jason L. Riley—acclaimed  Wall Street Journal  columnist and senior fellow at the Manhattan Institute—digs into the data and concludes that the economic lives of black people improved significantly under policies put into place during the Trump administration. To acknowledge as much is not to endorse the 45th president but to champion policies that achieve a clear moral objective shared by most Americans. Riley argues that before the Covid-19 pandemic of 2020, the economic fortunes of blacks improved under Trump to an extent unseen under Obama and unseen going back several generations. Black unemployment and poverty reached historic lows, and black wages increased faster than white wages. Less inequality is something that everyone wants, but disapproval of Trump’s personality and methods too often skewed the media’s appraisal of effective policies advocated by his administration. If we're going to make real progress in improving the lives of low-income minorities, says Riley, we must look beyond our partisan differences at what works and keep doing it. Unfortunately, many press outlets were unable or unwilling to do that. Riley notes that political reporters were not unaware of this data. Instead, they chose to ignore or downplay it because it was inconvenient. In their view, Trump, because he was a Republican and because he was Trump, had it in for blacks, and thus his policy preferences would be harmful to minorities. To highlight that significant racial disparities were narrowing on his watch—that the administration’s tax and regulatory reforms were mainly boosting the working and middle classes rather than ‘the rich’—would have undermined a narrative that the media preferred to advance, regardless of its veracity.” As with previous books in our  New Threats to Freedom  series,  The Black Boom  includes two essays from prominent experts who take issue with the author’s perspective. Juan Williams, a veteran journalist, and Wilfred Reilly, a political scientist, contribute thoughtful responses to Riley and show that it is possible to share a deep concern for disadvantaged groups while disagreeing on how best to help them.",
  "genres": [
    "Race",
    "Economics",
    "Politics"
  ],
  "author": "Jason L. Riley",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/58054815-the-black-boom"
}