{
  "title": "Affinities",
  "description": "Gathering a remarkable collection of over 500 public domain images, Affinities is a carefully curated visual journey illuminating connections across more than two thousand years of image-making. Drawing on a decade of archival immersion at The Public Domain Review, the book has been assembled from a vast array of sources: from manuscripts to museum catalogues, ship logs to primers on Victorian magic. The images are arranged in a single captivating sequence which unfurls according to a dreamlike logic, through a play of visual echoes and evolving thematic threads – hatching eggs twin with early Burmese world maps, marbled endpapers meet tattooed stowaways, and fireworks explode beside deep-sea coral.At once an art book, a sourcebook, and a kaleidoscopic visual poem, Affinities is a unique and enthralling publication that will offer something different on each visit. Exquisitely cloth-bound and extending across more than 360 pages, its playful and imaginative space invites the reader to transcend familiar categories of epoch, style, or historical theme, and to instead revel in a new world of creative possibilities played out between the images – opening up new connections, ways of seeing, and forms of knowledge.A compelling object and experience in its own right, Affinities also acts as a launchpad for further discoveries and inventive engagements with the commons. Channelling the bold curatorial spirit of The Public Domain Review, the book’s meticulous sourcing points to works, creators, and collections around the world, serving as a gateway for future forays into the digital public domain.Launched to coincide with the tenth anniversary of The Public Domain Review, the book promises to give followers of the hugely popular site more of the wonderful encounters that they have come to expect, and to introduce a new audience to its singular creative vision. Volume is delighted to move this digital cabinet of curiosities onto the printed page.",
  "genres": [
    "Art",
    "History",
    "Nonfiction",
    "Art History"
  ],
  "author": "Adam  Green",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/58060437-affinities"
}