{
  "title": "Stormy Weather: The Life of Lena Horne",
  "description": "At long last, the first serious biography of entertainment legend Lena Horne -- the celebrated star of film, stage, and music who became one of the first African-American icons.At the 74th annual Academy Awards in 2002, Halle Berry thanked Lena Horne for paving the way for her to become the first black recipient of a Best Actress Oscar. Though limited, mostly to guest singing appearances in splashy Hollywood musicals, \"the beautiful Lena Horne,\" as she was often called, became a pioneering star for African Americans in the 1940s and fifties. Now James Gavin, author of Deep in a Dream: The Long Night of Chet Baker, draws on a wealth of unmined material and hundreds of interviews -- one of them with Horne herself -- to give us the defining portrait of an American icon.Gavin has gotten closer than any other writer to the celebrity who has lived in reclusion since 1998. Incorporating insights from the likes of Ruby Dee, Tony Bennett, Diahann Carroll, Arthur Laurents, and several of Horne's fellow chorines from Harlem's Cotton Club, Stormy Weather offers a fascinating portrait of a complex, even tragic Horne -- a stunning talent who inspired such giants of showbiz as Barbra Streisand, Eartha Kitt, and Aretha Franklin, but whose frustrations with racism, and with tumultuous, root-less childhood, left wounds too deep to heal. The woman who emerged was as angry as she was luminous.From the Cotton Club's glory days and the back lots of Hollywood's biggest studios to the glitzy but bigoted hotels of Las Vegas's heyday, this behind-the-scenes look at an American icon is as much a story of the limits of the American dream as it is a masterful, ground-breaking biography.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Music",
    "Race",
    "History",
    "African American",
    "Biography Memoir"
  ],
  "author": "James Gavin",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/5804806-stormy-weather"
}