{
  "title": "A Wee Christmas Homicide",
  "description": "'Tis the season to be jolly, but in Moosetookalook, Maine, Christmas cheer is in short supply due to a snowless winter that's keeping skiers and shoppers at a distance. Fortunately, Liss MacCrimmon of the Scottish Emporium has a plan…Liss’s brainstorm focuses on Tiny Teddies, the new “hot” toy of the season. Every store across the country is out of stock—except a few wee establishments in good ol' Moosetookalook. It's easy enough to drum up approval for the idea of luring consumers to town and keeping them there with a stockingful of New England holiday charm. Liss’s real challenge lies in contending with bickering businesspeople and—once America learns of Moosetookalook's Tiny Teddy cache—doggedly determined shopaholics.The first sign of something amiss occurs when the last Tiny Teddy is summarily executed: shot through the heart in the display window of greedy toy store owner Gavin Thorne. But the Teddy's demise is just a precursor to the eerily similar murder of Gavin himself...The two men in Liss’s life want her far from the case, but she can't help feeling guilty for starting the fur frenzy that seems to have led to Gavin's death. Besides, how can she ignore the lengthy list of suspects, not the least of whom include Gavin's vindictive ex-wife, an unscrupulous selectman, a ski shop owner with an axe to grind, and a rabid toy collector packing heat in her purse..?Now, with the Twelve (or, in Scots terms, the Daft) Days of Christmas rapidly approaching, Liss has a plate full of things worse than haggis to contend with, starting with a stockroom packed with poultry (don't ask), and ending with a killer who'd like to see Liss's goose well and fully cooked...",
  "genres": [
    "Mystery",
    "Christmas",
    "Cozy Mystery",
    "Fiction",
    "Holiday",
    "Cozy",
    "Mystery Thriller"
  ],
  "author": "Kaitlyn Dunnett",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/10292742-a-wee-christmas-homicide"
}