{
  "title": "Irresistible Revolution: Marxism's Goal of Conquest & the Unmaking of the American Military",
  "description": "Irresistible Revolution is a timely and bold contribution from an active-duty Space Force lieutenant colonel who sees the impact of a neo-Marxist agenda at the ground level within our armed forces. In it, author Matthew Lohmeier provides answers to many important questions that Americans are currently asking: Is systemic racism a reality, or is much of our talk about race merely a rhetorical tool used to divide Americans? Why has the Defense Department suddenly shifted to a focus on extremism within the ranks? Is there really a white supremacy or white nationalist problem within our armed forces? Are the many Diversity and Inclusion trainings that are being conducted in our federal agencies helping solve these problems, or are they creating conflict where none previously existed? What is Marxism, and what does it have to do with all of this?Though pundits often appear perplexed by current policy decisions being made in our country, our apparent missteps are part of a longstanding plot against America, patiently and methodically pursued by those with a mind intent on the overthrow of the US Government and its replacement with a communist dictatorship. Unfortunately, many of those now furthering that agenda do so unwittingly.After becoming aware of the Marxist conquest of American society, you will never again look at things in the same way. Mainstream media, social media, the public education system (including universities), as well as federal agencies have all become vessels of various schools of thought that are rooted in Marxist ideology - an ideology bent on the destruction of America's history, of Western tradition, specifically Judeo-Christian values, and of patriotism and conservatism. Marxism's sinister and dark agenda has led the country into what some have called a cold civil war. The problem has become systemic, a tragedy considering that the defeat of Marxist-communist ideology was the very cause against which our nation spent great treasures of blood and iron during much of the twentieth century.The book's three-part framework begins with a discussion of the greatness of the American ideal (including the importance of the Declaration of Independence, the Constitution, the Bill of Rights, and the notions of individual and civil liberties), transitions to an examination of the history and overarching narrative of Marxist ideology (specifically Marx's and Engels' Communist Manifesto wherein the oppressor vs. oppressed narrative is developed), and concludes by looking into the ongoing transformation of America's military culture and military policy, while also providing a warning about where the country is headed if we choose to not make an immediate course correction.Irresistible Revolution also covers a breadth of hot topics everyone is hearing and talking about - topics that actually have implications for our national security: woke ideology, cancel culture, identity politics, the Black Lives Matter movement, anti-racism, postmodernism, political correctness, and critical and cynical theories, to include critical race theory. Lohmeier's penetrating and common sense look at current events within our military and across American society is a sublimely unique contribution that is certain to be shared, referenced, and discussed for years to come. Every American, including every US military servicemember, needs to read and understand the Irresistible Revolution.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Military Fiction",
    "Cultural"
  ],
  "author": "Matthew Lohmeier",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/58062110-irresistible-revolution"
}