{
  "title": "Funny You Should Ask",
  "description": "Then. Twentysomething writer Chani Horowitz is stuck. While her former MFA classmates are nabbing book deals, she's in the trenches writing puff pieces. Then she's hired to write a profile of movie star Gabe Parker. The Gabe Parker--her forever celebrity crush, the object of her fantasies, the background photo on her phone--who's also just been cast as the new James Bond. It's terrifying and thrilling all at once... yet if she can keep her cool and nail the piece, it could be a huge win. Gabe will get good press, and her career will skyrocket. But what comes next proves to be life-changing in ways Chani never saw coming, as the interview turns into a whirlwind weekend that has the tabloids buzzing.Now. Ten years later, after a brutal divorce and a heavy dose of therapy, Chani is back in Los Angeles, laser-focused on one thing: her work. But she's still spent the better part of the last decade getting asked about her deeply personal Gabe Parker profile at every turn. No matter what new essay collection or viral editorial she's promoting, it always comes back to Gabe. So when his PR team requests that they reunite for a second interview, she wants to say no. She wants to pretend that she's forgotten about the time they spent together, years ago. But the truth is that those seventy-two hours are still crystal clear, etched in her memory. And so... he says yes.Chani knows that facing Gabe again also means facing feelings she's tried so hard to push away. Alternating between their first meeting and their reunion a decade later, this deliciously irresistible novel will have you hanging on until the last word.\nA restless young journalist with big dreams interviews a Hollywood heartthrob--and, ten years later, it's clear that their time together meant more than meets the eye in this sexy, engrossing adult debut novel.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Adult",
    "Second Chance"
  ],
  "author": "Elissa Sussman",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/58065414-funny-you-should-ask"
}