{
  "title": "If Nietzsche Were a Narwhal: What Animal Intelligence Reveals About Human Stupidity",
  "description": "“A dazzling, delightful read on what animal cognition can teach us about our own mental shortcomings.” - Adam GrantThis funny, \"extraordinary and thought-provoking\" (The Wall Street Journal) book asks whether we are in fact the superior species. As it turns out, the truth is stranger—and far more interesting—than we have been led to believe.If Nietzsche Were a Narwhal overturns everything we thought we knew about human intelligence, and asks the question: would humans be better off as narwhals? Or some other, less brainy species? There’s a good argument to be made that humans might be a less successful animal species precisely because of our amazing, complex intelligence.   All our unique gifts like language, math, and science do not make us happier or more “successful” (evolutionarily speaking) than other species. Our intelligence allowed us to split the atom, but we’ve harnessed that knowledge to make machines of war. We are uniquely susceptible to bullshit (though, cuttlefish may be the best liars in the animal kingdom); our bizarre obsession with lawns has contributed to the growing threat of climate change; we are sexually diverse like many species yet stand apart as homophobic; and discriminate among our own as if its natural, which it certainly is not. Is our intelligence more of a curse than a gift?     As scientist Justin Gregg persuasively argues, there’s an evolutionary reason why human intelligence isn’t more prevalent in the animal kingdom. Simply put, non-human animals don’t need it to be successful. And, miraculously, their success arrives without the added baggage of destroying themselves and the planet in the process.  In seven mind-bending and hilarious chapters, Gregg highlights one feature seemingly unique to humans—our use of language, our rationality, our moral systems, our so-called sophisticated consciousness—and compares it to our animal brethren. Along the way, remarkable tales of animal smarts emerge, as you’ll discover: The house cat who’s better at picking winning stocks than actual fund managers Elephants who love to drinkPigeons who are better than radiologists at spotting cancerous tissueBumblebees who are geniuses at teaching each other soccer What emerges is both demystifying and remarkable, and will change how you look at animals, humans, and the meaning of life itself.",
  "genres": [
    "Nonfiction",
    "Science",
    "Philosophy",
    "Animals",
    "Psychology",
    "Nature",
    "Audiobook"
  ],
  "author": "Justin Gregg",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/58078524-if-nietzsche-were-a-narwhal"
}