{
  "title": "Jegudiel",
  "description": "They are the Fallen.A brotherhood of murderers whose nature compels them to kill. But guided by their leader, Gabriel, the Fallen have learned to use their urges to rid the world of those it is better off without.Control. Diel has spent his entire life under it. His childhood years were spent in the sadistic captivity of the Brethren. Now the Fallen are free, but the monster that lives inside Diel is not—can not be. The darkness within is curbed by an electric collar, the only thing that stops Diel from killing everyone in his path.Diel’s monster yearns for freedom—the freedom to tear apart Brethren priests, as many as possible, one after the other in a frenzied, liberating spree. When Diel is granted a taste of that freedom, he expects bloodlust, violence, death.He didn’t expect to find her.The Fallen are not the only ones chasing the destruction of the Brethren. They were not the only ones to suffer at the priests’ hands. This Diel discovers when he stumbles upon Noa, second in command of the Coven, a group of women who are intent on bringing the Brethren down.From the second they collide, Noa seems to understand Diel in a way that no one ever has before. She is unafraid of his rage, the bloodthirsty monster that dwells within him.Because there is a darkness inside Noa too, and it recognises the one in Diel as if it is the missing half of her soul. For years she has tried to suppress it, but as she is inescapably drawn to the fury-filled man in the collar, she starts to wonder if she can keep up the fight.She starts to wonder if she even should…Dark contemporary romance. Contains sexual situations, violence, sensitive and taboo subjects, offensive language, and topics some may find triggering. Recommended for age 18 years and up.",
  "genres": [
    "Dark Romance",
    "Dark",
    "Romance",
    "Abuse",
    "Contemporary Romance",
    "Suspense",
    "Contemporary"
  ],
  "author": "Tillie Cole",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/58077039-jegudiel"
}