{
  "title": "Nightfall",
  "description": "From New York Times bestselling author Penelope Douglas comes the thrilling, final installment in the Devil’s Night series…What happens when it's five against one and nowhere to run?EMORYThey call it Blackchurch. A secluded mansion in a remote, undisclosed location where the wealthy and powerful send their misbehaving sons to cool off away from prying eyes.Will Grayson has always been an animal, though. Reckless, wild, and someone who was never bound by a single rule other than to do exactly what he wanted. There was no way his grandfather was going risk him humiliating the family again.Not that the last time was entirely his fault. He might’ve enjoyed backing me into corners in high school when no one was looking, so they wouldn’t catch on that Mr. Popular actually wanted a piece of that quiet, little nerd he loved to torture so much, but…He could also be warm. And fierce in keeping me safe.The truth is… He has a right to hate me.It’s all my fault. Everything.Devils Night. The videos. The arrests.I’m to blame for all of it.And I regret nothing.WILLI never minded being locked up. I learned a long time ago that being treated like an animal gives you permission to act like one. No one has ever looked at me any other way.Their only mistake is believing anything I do is an accident. I can sit in this house with no Internet, television, liquor, or girls, but I’ll come out of here with something far more frightening to my enemies.A plan.And a new pack of wolves.I just didn’t expect one of my enemies to come to me.I don’t know who smuggled her in or if they meant to leave her here, but I can smell her hiding in the house. She’s here.And as the security detail leaves the supplies, the gates close, and the door to my gilded cage opens, giving me free reign of the house and grounds for another unsupervised month, I remember with a smile…Blackchurch houses five prisoners. I’m only one of her problems.*Nightfall is a full-length, romantic suspense suitable for readers 18+. It’s necessary to read the prior installments in the series before starting this story.",
  "genres": [
    "Dark Romance",
    "Romance",
    "Dark",
    "Enemies To Lovers",
    "New Adult",
    "Second Chance",
    "Contemporary"
  ],
  "author": "Penelope Douglas",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/58080352-nightfall"
}