{
  "title": "Otherlands: A Journey Through Earth's Extinct Worlds",
  "description": "A stirring, eye-opening journey into deep time,  from the Ice Age to the first appearance of microbial life 550 million years ago, by a brilliant young paleobiologistThe past is past, but it does leave clues, and Thomas Halliday has used cutting-edge science to decipher them more completely than ever before. In Otherlands,  Halliday makes sixteen fossil sites burst to life on the page.This book is an exploration of the Earth as it used to exist, the changes that have occurred during its history, and the ways that life has found to adapt―or not. It takes us from the savannahs of Pliocene Kenya to watch a python chase a group of australopithecines into an acacia tree; to a cliff overlooking the salt pans of the empty basin of what will be the Mediterranean Sea just as water from the Miocene Atlantic Ocean spills in; into the tropical forests of Eocene Antarctica; and under the shallow pools of Ediacaran Australia, where we glimpse the first microbial life.Otherlands also offers us a vast perspective on the current state of the planet. The thought that something as vast as the Great Barrier Reef, for example, with all its vibrant diversity, might one day soon be gone sounds improbable. But the fossil record shows us that this sort of wholesale change is not only possible but has repeatedly happened throughout Earth history.Even as he operates on this broad canvas, Halliday brings us up close to the intricate relationships that defined these lost worlds. In novelistic prose that belies the breadth of his research, he illustrates how ecosystems are formed; how species die out and are replaced; and how species migrate, adapt, and collaborate. It is a breathtaking achievement: a surprisingly emotional narrative about the persistence of life, the fragility of seemingly permanent ecosystems, and the scope of deep time, all of which have something to tell us about our current crisis.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Nature",
    "Biology",
    "Natural History",
    "Palaeontology"
  ],
  "author": "Thomas Halliday",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/58065802-otherlands"
}