{
  "title": "When We Were Birds",
  "description": "A mythic love story set in Trinidad and Tobago, Ayanna Lloyd Banwo's radiant debut introduces two unforgettable outsiders brought together by their connection with the dead. You were never the smartest child, but even you should know that when a dead woman offers you a cigarette, the polite thing to do would be to take it. Especially when that dead woman is your mother.The St. Bernard women have lived in Morne Marie, the house on top of a hill outside Port Angeles, for generations. Built from the ashes of a plantation that enslaved their ancestors, it has come to shelter a lineage that is bonded by much more than blood. One woman in each generation of St. Bernards is responsible for the passage of the city's souls into the afterlife. But Yejide's relationship with her mother, Petronella, has always been contorted by anger and neglect, which Petronella stubbornly carries to her death bed, leaving Yejide unprepared to fulfill her destiny.Raised in the countryside by a devout Rastafarian mother, Darwin has always abided by the religious commandment not to interact with death. He has never been to a funeral, much less seen a dead body. But when his ailing mother can no longer work and the only job he can find is grave digging, he must betray the life she built for him in order to provide for them both. Newly shorn of his dreadlocks and his past and determined to prove himself, Darwin finds himself adrift in a city electric with possibility and danger.Yejide and Darwin will meet inside the gates of Fidelis, Port Angeles's largest and oldest cemetery, where the dead lie uneasy in their graves and a reckoning with fate beckons them both. A masterwork of lush imagination and immersive lyricism, When We Were Birds is a spellbinding novel about inheritance, loss, and love's seismic power to heal.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Magical Realism",
    "Romance",
    "Book Club",
    "Literary Fiction",
    "Audiobook"
  ],
  "author": "Ayanna Lloyd Banwo",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/58065031-when-we-were-birds"
}