{
  "title": "Yonder",
  "description": "The Water Dancer\n meets The Prophets in this spare, gripping, and beautifully rendered novel exploring love and friendship among a group of enslaved Black strivers in the mid-19th century.They call themselves the Stolen. Their owners call them captives. They are taught their captors’ tongues and their beliefs but they have a language and rituals all their own. In a world that would be allegorical if it weren’t saturated in harsh truths, Cato and William meet at Placid Hall, a plantation in an unspecified part of the American South. Subject to the whims of their tyrannical and eccentric captor, Cannonball Greene, they never know what harm may befall them: inhumane physical toil in the plantation’s quarry by day, a beating by night, or the sale of a loved one at any moment. It’s that cruel practice—the wanton destruction of love, the belief that Black people aren’t even capable of loving—that hurts the most. It hurts the reserved and stubborn William, who finds himself falling for Margaret, a small but mighty woman with self-possession beyond her years. And it hurts Cato, whose first love, Iris, was sold off with no forewarning. He now finds solace in his hearty band of friends, including William, who is like a brother; Margaret; Little Zander; and Milton, a gifted artist. There is also Pandora, with thick braids and long limbs, whose beauty calls to him. Their relationships begin to fray when a visiting minister with a mysterious past starts to fill their heads with ideas about independence. He tells them that with freedom comes the right to choose the small things—when to dine, when to begin and end work—as well as the big things, such as whom and how to love. Do they follow the preacher and pursue the unknown? Confined in a landscape marked by deceit and uncertainty, who can they trust? In an elegant work of monumental imagination that will reorient how we think of the legacy of America’s shameful past, Jabari Asim presents a beautiful, powerful, and elegiac novel that examines intimacy and longing in the quarters while asking a vital question: What would happen if an enslaved person risked everything for love?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Race",
    "Magical Realism",
    "Historical",
    "African American",
    "Literary Fiction"
  ],
  "author": "Jabari Asim",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/58070060-yonder"
}