{
  "title": "A House So Mad",
  "description": "Previously published as Asylum Bound by Analeigh Ford.This isn’t your ordinary asylum, and these aren’t your ordinary patients.  Ashford isn't the sort of place you’re sent to get better, it’s the sort of place you’re sent to be forgotten. Thalia already knows that from the moment she arrives. Long abandoned by the families who put them away to begin with, this place has had to develop its own sort of hierarchy to keep from falling apart. And it all starts with Price, Ives, and Kingsley—the self-proclaimed princes of Ashford Asylum as untouchable as they are cruel. Price, the boy whose mere presence makes the mind go mad. Ives, whose temper makes the whole asylum go into panic. And Kingsley. Kingsley, the greatest threat of all…mostly because he’s as unpredictable as he is vicious. Tempered only by the fact that he shares his body with a boy as kind as he is dangerous. The three of them think they can bully the rest of the inmates into submission, force them to bow to their reign…but there’s one little problem. Thalia doesn’t run from chaos. She embraces it. Unlike the rest of the inmates, she’s no victim. She’s dealt with bullies like them all her life. Anything they do to her, she’ll do ten times worse. Let them try to bruise her, she’ll break them. If she doesn’t get out of there first. There’s only one problem with that—no one leaves Ashford Asylum. Not until now. Not if Thalia has anything to do with it. Not when the voices are telling her otherwise. A House So Mad is a dark enemies-to-lovers paranormal romance where the main character has no intention of choosing between the love interests she starts falling for. It’s the first part of the Asylum Bound duology. This series contains steam and sensitive subjects that may not be suitable for all readers.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Enemies To Lovers"
  ],
  "author": "Analeigh Ford",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/58079647-a-house-so-mad"
}