{
  "title": "The Authority Gap: Why Women Are Still Taken Less Seriously Than Men, and What We Can Do About It",
  "description": "An incisive, intersectional look at the mother of all gender biases: a resistance to women’s authority and power. Every woman has a story of being underestimated, ignored, challenged, or patronized in the workplace. Maybe she tried to speak up in a meeting, only to be talked over by male colleagues. Or a client addressed her male subordinate instead of her. These stories remain true even for women at the top of their fields; in the U.S. Supreme Court, for example, female justices are interrupted four times more often than their male colleagues―and 96 percent of the time by men. Despite the progress we’ve made toward equality, we still fail, more often than we might realize, to take women as seriously as men. In  The Authority Gap , journalist Mary Ann Sieghart provides a startling perspective on the gender bias at work in our everyday lives and reflected in the world around us, whether in pop culture, media, school classrooms, or politics. With precision and insight, Sieghart marshals a wealth of data from a variety of disciplines―including psychology, sociology, political science, and business―and talks to pioneering women like Booker Prize winner Bernardine Evaristo, renowned classicist Mary Beard, U.S. Secretary of the Treasury Janet Yellen, and Hillary Clinton. She speaks with women from a range of backgrounds to explore how gender bias intersects with race and class biases. Eye-opening and galvanizing, The Authority Gap teaches us how we as individuals, partners, parents, and coworkers can together work to narrow the gap. Sieghart exposes unconscious bias in this fresh feminist take on how to address and counteract systemic sexism in ways that benefit us all: men as well as women.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Politics",
    "Business",
    "Womens",
    "Sociology",
    "Gender"
  ],
  "author": "Mary Ann Sieghart",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/58085228-the-authority-gap"
}