{
  "title": "The Call of Cthulhu: And Other Stories",
  "description": "The essential literary collection of H. P. Lovecraft’s ten finest short stories, from the celebrated editor of the two-volume New Annotated H. P. Lovecraft . An indispensable collection of the best of one of literature’s “most critically fascinating and yet enigmatic figures” (Alan Moore), featuring H. P. Lovecraft’s most bone-chilling tales, “Dagon”, “The Outsider”, “The Music of Erich Zann”, “The Rats in the Walls”, “The Call of Cthulhu\", “The Colour Out of Space”, “The Dunwich Horror”, “The Shadow over Innsmouth”, “The Shadow Out of Time” and “The Haunter of the Dark”. Though he died an unknown, dejected pulp-magazine writer in 1937, Howard Phillips Lovecraft is now considered the first great “genius of weird fiction” (Peter Straub). There is no better guide through the peculiarities of his universe than Leslie S. Klinger, whose work as annotator of the “exciting and definitive” (Danielle Trussoni, New York Times Book Review ) New Annotated H. P. Lovecraft has proven him a leading Lovecraft scholar. Keenly aware of the author’s inspiration of “dozens―hundreds―of stories written by others playing in [his] galactic sandbox,” Klinger now presents this essential reader’s edition for both fanatics and newcomers to the canon. Equipped with explanatory annotations and sharp historical insight, this highly accessible?collection features Lovecraft’s ten most profound and unnerving short stories. From the early tale “Dagon” to the mature and sprawling “The Haunter of the Dark,” these expertly curated stories built a Lovecraftian sense of dread that has reverberated in the world of horror literature for that all of us are “outsiders” in the universe. 11 black-and-white photographs",
  "genres": [
    "Horror",
    "Fiction",
    "Short Stories",
    "Classics",
    "Fantasy",
    "Science Fiction",
    "Collections"
  ],
  "author": "H.P. Lovecraft",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/58085210-the-call-of-cthulhu"
}