{
  "title": "Mayhem for Her Majesty",
  "description": "Who did it? Who has the power to bump the Beatles?It’s 1963...the Beatles are putting out hit after hit...and Super smart Helen must unravel why the Beatles are mysteriously bumped...from playing for the Royals! It was supposed to be a star studded weekend in London...but now it's an awkward disaster...can she figure it out and fix the playbill in time to help the Beatles get their biggest-ever break? Or is this snub the end of Helen?One thing's for sure...Helen will stop at nothing, no matter how far she has to go...how hilarious it gets...or how knackered she gets in the process...Helen's thrilled to travel at Brian Epstein's direction to swinging London, checking into the posh Mapleton Hotel, adjacent to the Prince of Wales Theater...where the crowds are surging in the streets behind barricades of Bobbies in anticipation of the Beatles.Only funny things are happening, and a mysterious someone doesn't want things to work out and gets them bumped from the show...Overwhelming odds against her, high ranking political figures conspiring to thwart her, Helen must figure out who is behind this debacle in the making, what they want, how to fix it...and it has to happen fast because the Beatles have just arrived ...and London is going bonkers...Here goes Helen...taking on the establishment and stopping at nothing to support the Beatles she loves...and they need Helen to come through now more than ever! Do the cheeky Beatles have something to say about it? You can count on it...With a cast of quirky and loveable characters, including John, Paul, George and Ringo, the Queen's own staff, Lords and Ladies, (and perhaps a budding love interest for Helen?)...It's a big weekend to remember...for Helen, the Royals, and especially the Beatles!Click BUY NOW and start your adventureTitles in the A Cozy Beatles Mystery series: LARCENY IN LIVERPOOL: 1962, she needed a job...they needed a big break...all went well ...until the robbery! Who stole the souped up lyrics to Please Please Me? Helen helps the Beatles set a trap for the culprits to save their dreams (#1)MAYHEM FOR HER MAJESTY: 1963, who is the culprit? Can Helen figure it out, and restore the Beatles to the Royal Variety Show playbill?...they've been mysteriously bumped...the Performance is in 1 day...and London is going crazy! (#2)THE BEVERLY HILLS BEATLES BURGLARY: 1964, STOLEN! Helen's with mum and dad in sunny California ...the Beatles are set to play at the Hollywood Bowl, only George's Rickenbacker 12-string is suddenly stolen...before the biggest West Coast show of the Beatles 1st American Tour...the chase is on! (#3)THE BEATLE CAR BANDITS: 1965-69: Who is stealing the Beatles' cars? And the crown jewel, John's famous psychedelic Rolls Royce, is prime for picking...Oxford student Helen aims to figure it out because the Bobbies and the Beatles are baffled! (#4)Short stories:A Cozy Beatles Mystery Short Story: PUNCHING UP: Backstage at the Cavern Club, in chilly January 1963, the Beatles reveal a mysterious nemesis to Helen through a highly embellished story told by Paul...oh, and it’s release day for Please Please Me…Buy the whole series and experience the excitement!",
  "genres": [],
  "author": "Kal Smagh",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/58090741-mayhem-for-her-majesty"
}