{
  "title": "Pink and Country",
  "description": "Pink and Country\n is an emotional soulmates romance about a broody music superstar hiding in a cabin in the Tennessee mountains to escape the press and the colorful and sassy girl living next door, who’ll get under his skin in every possible way.- \"It is full of emotions and feels. A roller coaster ride that had me smiling even through my tears.\" (Book Reviews by Shalini)- \"This was a wonderfully complex, powerful and deeply romantic book with leads perfectly crafted, flaws and gifts and all. A totally believable fantasy that sucked me in, emotionally drained me, and kept me addictively engaged [...]\" (The Mysterious Reader)Carter Hills is my moody and hot-as-hell country music star new neighbor.How I didn’t recognize him when I rented the cabin next to his for a month is still a mystery. Yeah, I bet he had a great time messing with me on purpose. And disrupting all my plans.The guy is not only Nashville's most eligible bachelor, but he’s a pain in my a**. Worse, he’s acting like he knows better. But he is about to discover I can master that game too. I’m not some innocent damsel in distress. I can definitely take care of myself.My heart rate picks up every time we’re together, but it doesn’t matter, his attitude should be enough to ward me off him. But still, the more I get to know him, the closer I want to get.Despite our banter, Carter is always coming back for more, and my month-long retreat isn’t going as expected.Should I push him away, or should I indulge in the fire searing between us and risk being burned?If you like Mariana Zapata or Mia Sheridan, you'll love Emmanuelle Snow's Pink and Country and fall in love with Nashville's hottest bachelor.",
  "genres": [
    "Romance",
    "Contemporary",
    "Music",
    "Contemporary Romance",
    "Forced Proximity",
    "Fiction",
    "Small Town Romance"
  ],
  "author": "Emmanuelle Snow",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/58090668-pink-and-country"
}