{
  "title": "City of the Dead",
  "description": "The past comes back to haunt psychologist Alex Delaware and Detective Milo Sturgis when they investigate a grisly double homicide and uncover an even more unspeakable motive in this riveting thriller from the #1 New York Times bestselling master of suspense.Los Angeles is a city of sunlight, celebrity, and possibility. The L.A. often experienced by Homicide Lt. Detective Milo Sturgis and psychologist Alex Delaware, is a city of the dead. Early one morning, the two of them find themselves in a neighborhood of pretty houses, pretty cars, and pretty people. The scene they encounter is anything but. A naked young man lies dead in the street, the apparent victim of a collision with a moving van hurtling through suburbia in the darkness. But any thoughts of accidental death vanish when a blood trail leads to a nearby home. Inside, a young woman lies butchered. The identity of the male victim and his role in the horror remain elusive, but that of the woman creates additional questions. And adding to the shock, Alex has met her while working a convoluted child custody case. Cordelia Gannett was a self-styled internet influencer who’d gotten into legal troubles by palming herself off as a psychologist. Even after promising to desist, she’s found a loophole and has continued her online career, aiming to amass clicks and ads by cyber-coaching and cyber-counseling people plagued with relationship issues. But upon closer examination, Alex and Milo discover that her own relationships are troublesome, including a tortured family history and a dubious personal past. Has that come back to haunt her in the worst way? Is the mystery man out in the street collateral damage or will he turn out to be the key to solving a grisly double homicide? As the psychologist and the detective explore L.A.'s meanest streets, they peel back layer after layer of secrets and encounter a savage, psychologically twisted, almost unthinkable motive for violence and bloodshed. This is classic Delaware: Alex, a man Milo has come to see as irreplaceable, at his most insightful and brilliant.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Jonathan Kellerman",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/58108593-city-of-the-dead"
}