{
  "title": "Hawk Quest",
  "description": "A huge, exciting historical adventure epic in the bestselling tradition of Bernard Cornwell, Conn Iggulden and Robyn Young In this sweeping epic set in the aftermath of the Norman Conquest, a rogue French knight named Vallon accepts a dangerous he must travel to the ends of Europe in search of four rare gyrfalcons demanded as ransom for a Norman knight held captive by Seljuk Turks in Anatolia. Accompanied by a young English falconer and a Sicilian scholar, Vallon sets out on a quest that takes him from Iceland to Greenland to Russia and south to Byzantium. On the nine-month journey the company is joined by other adventurers. Together they brave raging seas, icy arctic wastes, treacherous rapids. They fight furious battles against Normans, Vikings and steppe nomads, pit their wits against warlords desperate to steal their precious cargo. And these are not the only perils they face, for among their company is a man who will stop at nothing to prevent them from fulfilling their quest. At more than 200,000 words, Hawk Quest is one of the most vast, utterly thrilling historical adventures ever written. 1072 AD The Normans have captured England. The Turks have captured a Norman knight. And in order to free him, a Frank warrior named Vallon must capture four rare hawks. In the company of a Sicilian scholar and an English falconer, Vallon sets off a heart-stopping odyssey to the far ends of the earth - from Greenland to Russia to Constantinople, across raging Arctic seas and blood-drenched battlefields. Braving Viking warlords, vengeful Normans, and the unforgiving elements, Vallon and his comrades must track down their quarry one by one in a relentless race against time. Ten years in the making, Hawk Quest is high adventure in the grand tradition of Bernard Cornwell and Robyn Young, an epic story packed with visceral combat, marvellous period detail, and gripping suspense. The scale is huge. The journey is incredible. The history is real. This is Hawk Quest",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fantasy",
    "Fiction",
    "Medieval",
    "Adventure",
    "British Literature"
  ],
  "author": "Robert Lyndon",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/12768027-hawk-quest"
}