{
  "title": "Hidden Agenda",
  "description": "Deception at the intersection of work and passion. Carlie is a broken-hearted genius.Alex is a broody writer.Kurt is a playboy millionaire. One of them has a Hidden Agenda.\"Halberg is a skilled writer and storyteller. This is a distinctive and refreshing work with memorable characters and an original premise. Dialogue is particularly enlightening as the reader attempts to figure out who these people really are at their cores.\" — Publishers Weekly reviewer for The BookLife Prize Carlie, the fiercely intelligent younger daughter of global media mogul Charles Eller, is emerging from a brutal betrayal that led to a breakup with her college sweetheart. Exhausted by the well-meaning efforts of her sister Rachael and de facto sister Kim, who are pushing her to get back into the dating game, Carlie escapes to Chicago for a work conference. Adrift within her world…A klutzy introvert, Carlie struggles with severe anxiety, nightmares, and an inferiority complex. She grew up in the shadow of the strong personalities in her famous family and allowed herself to be defined by those around her. Not only is this conference an opportunity to flee the drama in Cincinnati, but it is also a chance to make her mark on the industry she loves. In the air and on the ground…She falls into a dangerous love triangle. Her attention is snagged by both Alex, a sexy, bestselling author from New York, and Kurt, a charming, self-made millionaire from California. One of the men is not who he appears to be and is out for revenge. But which one? And can Carlie survive another betrayal? Hidden Agenda is the second book of the series and can be read as a standalone novel. To get all the background, read Animal Attraction, The Eller Series Book 1. The series continues with Lost and Found, The Eller Series Book 3.  Women's fiction and adult contemporary romance; story contains steamy intimate scenes that are not suitable for young readers.Will appeal to readers who enjoyed: The Reunion by Meghan Quinn Hidden by Fern Michaels The Takeover by T L Swan Not My Romeo by Ilsa Madden-Mills Just Haven’t Met You Yet by Sophie Cousens The Worst Best Man by Lucy Score",
  "genres": [
    "Romance"
  ],
  "author": "Kathryn Halberg",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/58113690-hidden-agenda"
}