{
  "title": "Southern Ballz",
  "description": "TRIGGERS POSSIBLE: If you have military based PTSD there may be a scene that could trigger you or make you feel uncomfortable. Maybe you'd just relate. The adult situations are unprotected and uncensored as with most most of my work. I like to push the envelope. Spice level: 4 peppers. The language is unfiltered and realistic. Blitz is very possessive/territorial and protective. He's alpha to the bone and he's also broken and vulnerable.It all started when the RBMC wanted to get their hands on Brooklyn. It was a good move for the founding member of my club, the Malevolent MC, but someone needed to take the reins with our chapter there—someone they could trust—someone –Malevolent. The old man wanted one of my guys to patch over to and made the deal to trade me to the RBMC. The one condition was that I step in as president of the new RBMC Brooklyn chapter. Easy, right? I’m a guy from another club. A “southern belle” they say. Redhook expected me to step right in and take the most coveted of the five boroughs. It meant Crucifix would have to share, and believe me, he wasn’t so thrilled with the idea.Now, it’s almost Thanksgiving and I’m in New York City fixin' to spend the holidays alone with my ghosts. The guys are ball breakers, the chicks too, but after all my time in Iraq and Afghanistan on the USMC elite Force Recon and Scout Sniper teams, I’m always down for one of those. They aren’t countin’ on my southern ballz. The real test of my abilities will be her. Vixen is like no one I’ve ever known and could be the best or absolute worst part of my new life as a Ba$tard.I haven't had a woman share my bed in over three years to keep them safe. Vixen is the only one I've wanted to keep there, and I'm terrified my ghosts and demons could harm her. I chose to fight in the war. She's only choosing to try to be with me.How will she react when she sees them up close and personal? Will she stand toe to toe with them like she always does or run to the hills?",
  "genres": [],
  "author": "B.B. Blaque",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/58116286-southern-ballz"
}