{
  "title": "She Thinks Like a Boss: Leadership—9 Essential Skills for New Female Leaders in Business and the Workplace",
  "description": "Discover how to become an effective woman in leadership -- even if you’re shy, avoid conflict at all costs, or lack confidence. Are you tired of seeing men at work get promoted, be given better assignments, and enjoy pay raises even though you know your skills and results are just as good, if not better? Do you find it difficult to express yourself during work meetings without being hostile or apologetic? Perhaps you're tired of coming home feeling frustrated because you didn't speak up at the meeting, or maybe you feel as though, no matter what you try, people just walk all over you. You know that there must be another way. And you’re right. But don’t help is at hand. In an incredibly male-dominated world, it’s crucial -- now more than ever -- to develop the necessary skills to become an effective leader and start demanding what you deserve . Luckily, it’s easier than you think. You don't have to buy into the self-help industry, which wastes your time, resources and energy on costly and often condescending life coaches and counselling sessions. All you need are easy, proven skills and traits that will help you gradually develop your self-esteem, sharpen your trust, and hone your boundary-setting and communication skills. If you're someone then Jemma Roedel can help you. Many people don’t understand that there’s a lot more to being a leader than just managing people. The first step to thinking like a boss is having the insight and understanding that pioneering successful women have -- and using it to take constructive action. In She Thinks Like a Boss , here’s just a fraction of what you will And much more . Even if you feel uncomfortable or scared to face the issues that being a great leader brings, the key is to dive straight in. In She Thinks Like a Boss , you will be given specific and practical techniques to help you gradually overcome the problems you're facing. You’re on a personal journey, but there are key steps you can take to set you on the path to live the life you dream of and be an inspiration to other women in business. Become an inspirational female leader scroll up, and click the \"Add to Cart\" button right now.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Business",
    "Leadership",
    "Inspirational",
    "Productivity",
    "Psychology"
  ],
  "author": "Jemma Roedel",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/58118531-she-thinks-like-a-boss"
}