{
  "title": "Count Your Lucky Stars",
  "description": "Following Written in the Stars and Hang the Moon, national bestselling author Alexandria Bellefleur pens another steamy queer rom-com about former best friends who might be each other's second chance at love…Margot Cooper doesn’t do relationships. She tried and it blew up in her face, so she’ll stick with casual hookups, thank you very much. But now her entire crew has found \"the one\" and she’s beginning to feel like a fifth wheel. And then fate (the heartless bitch) intervenes. While touring a wedding venue with her engaged friends, Margot comes face-to-face with Olivia Grant—her childhood friend, her first love, her first… well, everything. It’s been ten years, but the moment they lock eyes, Margot’s cold, dead heart thumps in her chest.Olivia must be hallucinating. In the decade since she last saw Margot, her life hasn’t gone exactly as planned. At almost thirty, she’s been married... and divorced. However, a wedding planner job in Seattle means a fresh start and a chance to follow her dreams. Never in a million years did she expect her important new client’s Best Woman would be the one that got away.When a series of unfortunate events leaves Olivia without a place to stay, Margot offers up her spare room because she’s a Very Good Person. Obviously. It has nothing to do with the fact that Olivia is as beautiful as ever and the sparks between them still make Margot tingle. As they spend time in close quarters, Margot starts to question her no-strings stance. Olivia is everything she’s ever wanted, but Margot let her in once and it ended in disaster. Will history repeat itself or should she count her lucky stars that she gets a second chance with her first love?",
  "genres": [
    "Romance",
    "LGBT",
    "Lesbian",
    "Queer",
    "Contemporary",
    "Adult",
    "Fiction"
  ],
  "author": "Alexandria Bellefleur",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/58114499-count-your-lucky-stars"
}