{
  "title": "Em",
  "description": "A novel of the emotional intricacies of trauma and exile, from the author of international bestselling RuFinalist of the New Academy Prize in LiteratureFinalist Scotiabank Giller PrizeWinner du Prix du Gran Public au salon du livre de MontrealWinner of the Governor General's Literary Award for FictionWinner of the Grand Prix RTL-LireEmma-Jade and Louis are born into the havoc of the Vietnam War. Orphaned, saved and cared for by adults coping with the chaos of Saigon in free-fall, they become children of the Vietnamese diaspora. Em is not a romance in any usual sense of the word, but it is a word whose homonym—aimer, to love—resonates on every page, a book powered by love in the larger sense. A portrait of Vietnamese identity emerges that is wholly remarkable, honed in wartime violence that borders on genocide, and then by the ingenuity, sheer grit and intelligence of Vietnamese-Americans, Vietnamese-Canadians and other Vietnamese former refugees who go on to build some of the most powerful small business empires in the world. Em is a poetic story steeped in history, about those most impacted by the violence and their later accomplishments. In many ways, Em is perhaps Kim Thúy's most personal book, the one in which she trusts her readers enough to share with them not only the pervasive love she feels but also the rage and the horror at what she and so many other children of the Vietnam War had to live through.Written in Kim Thúy's trademark style, near to prose poetry, Em reveals her fascination with connection. Through the linked destinies of characters connected by birth and destiny, the novel zigzags between the rubber plantations of Indochina; daily life in Saigon during the war as people find ways to survive and help each other; Operation Babylift, which evacuated thousands of biracial orphans from Saigon in April 1975 at the end of the Vietnam War; and today's global nail polish and nail salon industry, largely driven by former Vietnamese refugees—and everything in between. Here are human lives shaped both by unspeakable trauma and also the beautiful sacrifices of those who made sure at least some of these children survived.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Canada",
    "Historical",
    "Asia",
    "War",
    "France"
  ],
  "author": "Kim Thúy",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/58117224-em"
}