{
  "title": "Woke Racism: How a New Religion Has Betrayed Black America",
  "description": "People of good will on both the left and the right are secretly asking themselves the same question: how has the conversation on race gone so crazy?Bestselling author and acclaimed linguist John McWhorter argues that an illiberal neoracism, disguised as antiracism, is hurting black communities and weakening the social fabric.We're told to read books and listen to music by people of colour but that wearing certain clothes is 'appropriation.' We hear that being white automatically gives you privilege and that being black makes you a victim. We want to speak up but fear we'll be seen as unwoke, or worse, labelled a racist. According to John McWhorter, the problem is that a well-meaning but pernicious form of antiracism has become, not a progressive ideology, but a religion - and one that's illogical, unreachable, and unintentionally neoracist.In Woke Racism, McWhorter reveals the workings of this new religion, from the original sin of 'white privilege' and the weaponization of cancel culture to ban heretics, to the evangelical fervour of the 'woke mob.' He shows how this religion that claims to 'dismantle racist structures' is actually harming his fellow black Americans by infantilizing black people, setting black students up for failure, and passing policies that disproportionately damage black communities. The new religion might be called 'antiracism, ' but it features a racial essentialism that's barely distinguishable from racist arguments of the past.Fortunately, for all of us, it's not too late to push back against woke racism. McWhorter shares scripts and encouragement with those trying to deprogramme friends and family. And most importantly, he offers a roadmap to justice that actually will help, not hurt, black people.A NEW YORK TIMES BESTSELLER",
  "genres": [
    "Nonfiction",
    "Politics",
    "Race",
    "Sociology",
    "Philosophy",
    "Audiobook",
    "Social Justice"
  ],
  "author": "John McWhorter",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/58133534-woke-racism"
}