{
  "title": "Ties That Bind",
  "description": "Grab a badge and a gun and strap in for an absolutely gripping ride that’s “full of suspense from the beginning to the end…” (Readers Abode)She could feel him watching her… Though every time she turned to look, there was no one there. The rest of the world thought she was going crazy—until it was too late.When Laura Saunders is found strangled in her home with a man’s necktie, Detective Madison Knight is assigned the case. Her sergeant at the Stiles Police Department wants her to conclude it was an isolated incident and move on with the investigation, but Madison’s not the type to cave under pressure. She’s haunted by certain unexplainable clues at the crime scene, including the presence of a mysterious photograph. Madison believes the picture may somehow tie into the murder, but before she can dig into it, another woman’s body is discovered in a local park. Heather Nguyen was also murdered with the same brand of necktie that had been used on Laura.On the surface, there doesn’t seem to be anything beyond the way they were killed that connects the women. But as Madison delves into the lives of the victims, she unravels a web of deceit and betrayal and lays bare decades of deadly family secrets. Edging closer to the truth, Madison’s quite sure at least one more woman is slated to die. But can Madison piece together all the clues in time to save her?A gripping crime thriller full of heart-pounding twists. Perfect for fans of Robert Dugoni, J.D. Robb, and Lisa Regan.Readers love Ties That Bind:“Arnold has written one of the best female cops that I’ve ever read… Madison is just one of those characters that will stay with you.” –Harlie’s Books, ⭐⭐⭐⭐⭐“A good detective story with lots of twists and turns and an unexpected ending.” ⭐⭐⭐⭐⭐“This is one heck of a mystery!” ⭐⭐⭐⭐⭐“Brace yourself for the ending! I didn't see that one coming.” ⭐⭐⭐⭐⭐“I loved Madison Knight and her sassy dialogue.” ⭐⭐⭐⭐⭐“I found myself unable to stop reading this book.” ⭐⭐⭐⭐⭐“A must-read for the mystery fan.” ⭐⭐⭐⭐⭐“So many twists and turns I never saw the ending coming!” ⭐⭐⭐⭐⭐“A solid police procedure mystery.” ⭐⭐⭐⭐⭐“If you like true suspense, this is a book to read.” ⭐⭐⭐⭐⭐“Like watching an award-winning police drama in my mind.” ⭐⭐⭐⭐⭐“Intriguing, suspenseful, and full of surprises!” ⭐⭐⭐⭐⭐“Well-written and researched on police procedures.” ⭐⭐⭐⭐⭐“It was very difficult to set this book aside to do something else.” ⭐⭐⭐⭐⭐“From the moment I began reading this book, I was hooked.” ⭐⭐⭐⭐⭐",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Thriller",
    "Suspense",
    "Mystery Thriller",
    "Amazon"
  ],
  "author": "Carolyn Arnold",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/58142372-ties-that-bind"
}