{
  "title": "The Road to Happy Is Not One Way",
  "description": "#1 Bestselling book in three categories, The Road To Happy Is Not One Way is a must-read for any young adult, parent, or anyone in their twenties or thirties going through just about any tough time in their lives. In this very real and powerful story of hitting rock bottom and bouncing back, Sara, a wife and mother, opens up about her own personal struggles with mental health in this mixture of a memoir meets self-help book meets daily wellness journal and workbook, a perfect, easy read for anyone from the anxiety-ridden teen years to those dealing with the stresses of adulthood and raising children. The book reads like you're talking to a friend who is offering advice, and it forces an honest look inward at your own happiness through friendships, parenthood, relationships, and career. Get the most out of this book by getting your FREE DOWNLOADABLE WORKBOOK, available at www.saraglashagel.com.\"I'm blown away by this book! Once I began reading, I couldn't put it down. The author's vulnerability inspired me to tap into the challenges in life. The rules of the road are excellent reminders of how to get past the obstacles of life and live a life of joy. I love how the workbook is within the book so you can implement the strategies immediately. I highly recommend this book to anyone! It's a must read.\" Five-Star Reviewer\"I bought this book after understanding it was written by a mother of young children, hoping she could shed some light on how she remains happy. I was so glad I did! This was raw, real, relatable, and more helpful without feeling like a \"self help\" book!! I felt like I was getting a talk session from a girlfriend almost the entire time and she really gave some practical advice that I know I can carry out and even impart wisdom on my friends in similar situations. Love this and can't wait for another by this author.\" -Five-Star Reviewer",
  "genres": [],
  "author": "Sara Glashagel",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/58132288-the-road-to-happy-is-not-one-way"
}