{
  "title": "TRANSFER: AMERICANS vs COVID",
  "description": "As COVID-19 sinks its teeth into America, a Police Officer, a Nurse, a Trucker, and a Drug-Dealing Grandmother become entwined in an extraordinary effort to survive the storm, protect those they love, and discover the truth.TRANSFER began as an experimental project written as the first stages of the pandemic turned America upside-down. The resulting story is immersive, chilling, and remarkable, offering a brand-new way to understand the personal impact of the pandemic that is overrunning the country.Fictionalized true-to-life stories at their best, this is a read not to be missed.---\"Written in real-time as the drama of COVID-19 plays out around us, and from the perspective of everyday, relatable people, Transfer is brilliant for helping the reader process this unique time in history.”- Simon Kennedy, Screenwriter, Co-creator of Safe Harbour, International Emmy Award Winner.Crafted by dynamic writing team Joel Cutter and Geoff Young, Transfer is a finely-balanced twist of the knife that makes the heart pound and the mind ponder. Four unique characters, none of whom had the option to stay ‘safer at home,’ become a portal to a world gone off the rails.Meet those on the frontline: Jake is a trucker and loving father who is hauling Over-The-Road when the Coronavirus sinks its teeth into America. With crazy new regulations, his family sick at home, and no hope of being able to pay ICU bills, he must take ever-increasing risks to make ends meet.Police Officer and family man James Myers struggles to understand and enforce his city's draconian stay-at-home order. Then the suspicious death of a local scientist draws him into a dangerous web, and his job and family are put in jeopardy when he questions his orders.When life unexpectedly left 45- year-old Kate with custody of her two grandchildren, she began selling illegal narcotics from home to make ends meet. Now COVID-19 threatens to kill her unique small business, and she must play a dangerous game against the power-hungry mayor if she and her family are to survive.Amanda's strong faith and 20 years as an emergency-room nurse make her a strong pillar to lean on when the world starts going to pieces. But when the virus takes one thing she loves after another, she finds herself alone in New York, fighting to hang on to the last scraps of her hope.---Early chapters were released on Facebook, and here's what the readers had to say.\"You've got me hooked! More, more, more!\"- J. Klimchuck\"YES!!! Another page-turner with yet to be answered questions!- D. Olden\"An emotional rollercoaster ride. Makes me grateful for all my blessings!\"- S. Crouch\"Hitting it from all the angles. Making me beg for more.\"- D. Convery",
  "genres": [],
  "author": "Joel Cutter",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/58121127-transfer"
}