{
  "title": "You Got Anything Stronger?: Stories",
  "description": "Remember when we hit it off so well that we decided We're Going to Need More Wine? Well, this time you and I are going to turn to our friend the bartender and ask, You Got Anything Stronger? I promise to continue to make you laugh, but with this round, the stakes get higher as the conversation goes deeper.So. Where were we?Right, you and I left off in October 2017, when my first book came out. The weeks before were filled with dreams of loss. Pets dying. My husband leaving me. Babies not being born. My therapist told me it was my soul preparing for my true self to emerge after letting go of my grief. I had finally spoken openly about my fertility journey. I was having second thoughts—in fact, so many thoughts they were organizing to go on strike. But I knew I had to be honest because I didn't want other women going through IVF to feel as alone as I did. I had suffered in isolation, having so many miscarriages that I could not give an exact number. Strangers shared their own journeys and heartbreak with me. I had led with the truth, and it opened the door to compassion.When I released We're Going to Need More Wine, the response was so great people asked when I would do a sequel. The New York Times even ran a headline reading \"We're Going to Need More Gabrielle Union.\" Frankly, after being so open and honest in my writing, I wasn't sure there was more of me I was ready to share. But life happens with all its plot twists. and new stories demand to be told. This time, I need to be more vulnerable—not so much for me, but anyone who feels alone in what they're going through.A lot has changed in four years—I became a mom and I'm raising two amazing girls. My husband retired. My career has expanded so that I have the opportunity to lift up other voices that needs to be heard. But the world has also shown us that we have a lot we still have to fight for—as women, as black women, as mothers, as aging women, as human beings, as friends. In You Got Anything Stronger?, I show you how this ever-changing life presents challenges, even as it gives me moments of pure joy. I take you on a girl's night at Chateau Marmont, and I also talk to Isis, my character from Bring It On. For the first time, I truly open up about my surrogacy journey and the birth of Kaavia James Union Wade. And I take on racist institutions and practices in the entertainment industry, asking for equality and real accountability.You Got Anything Stronger? is me at my most vulnerable. I have recently found true strength in that vulnerability, and I want to share that power with you here, through this book.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Biography",
    "Essays",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Gabrielle Union",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/58132534-you-got-anything-stronger"
}