{
  "title": "The Darkness Calling",
  "description": "The Darkness Calling is a gritty, stylish, action-packed novel from start to finish. Populated with vividly portrayed characters, thrilling moments and plenty of dark humour, it is brilliantly written, and will keep you turning the pages far into the night.Perfect for fans of Lee Child, J.J Connelly, Ben Aaronovitch, Iain Banks and Warren Ellis.When a contract goes out on the head of a human-trafficker living in one of London's most exclusive suburbs, romantically deprived hitman, Archie Nyx, assumes it's just another day at the office. In a profession that usually comes with minimal moral high ground, being paid a hefty sum to expunge an excrescence like Andras Janos is as close to a good day at work as Archie gets. It's a nice thought, but when the hit goes south and the unexpected elements rear their heads, Archie must track down the mysterious client who seems to want more than just Janos dead.Beautiful but hard-boiled Detective Inspector Valentina Galanti is back at work at the Met after an accident that tore her life apart. Her old friend and boss, Detective Superintendent Jack McNeill, assigns Val to a brutal multiple homicide by way of a welcome back. Val embraces the carnage as a pleasing escape from the grief and fury that are threatening to overwhelm her.By chance, or so it seems, Archie and Val meet one afternoon. Lies and deceptions breed more lies and deceptions, with the assassin and copper having no idea that they are both working towards the middle of the same problem from opposite sides.Set in a near-future London not too dissimilar to the one we know, The Darkness Calling is a soft sci-fi novel that explores whether any silver lining can be found in the midst of a son's hatred for his father, a mother's heart-crushing grief, and the place where the bullets fly.",
  "genres": [],
  "author": "Joe Coates",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/58144550-the-darkness-calling"
}