{
  "title": "The Loneliest Americans",
  "description": "A riveting blend of family history and original reportage by a conversation-starting writer for The New York Times Magazine that explores--and reimagines--Asian American identity in a Black and white world In 1965, a new immigration law lifted a century of restrictions against Asian immigrants to the United States. Nobody, including the lawmakers who passed the bill, expected it to transform the country's demographics. But over the next four decades, millions arrived, including Jay Caspian Kang's parents, grandparents, aunts, and uncles. They came with almost no understanding of their new home, much less the history of \"Asian America\" that was supposed to define them.The Loneliest Americans is the unforgettable story of Kang and his family as they move from a housing project in Cambridge to an idyllic college town in the South and eventually to the West Coast. Their story unfolds against the backdrop of a rapidly expanding Asian America, as millions more immigrants, many of them working-class or undocumented, stream into the country. At the same time, upwardly mobile urban professionals have struggled to reconcile their parents' assimilationist goals with membership in a multicultural elite--all while trying to carve out a new kind of belonging for their own children, who are neither white nor truly \"people of color.\"Kang recognizes this existential loneliness in himself and in other Asian Americans who try to locate themselves in the country's racial binary. There are the businessmen turning Flushing into a center of immigrant wealth; the casualties of the Los Angeles riots; the impoverished parents in New York City who believe that admission to the city's exam schools is the only way out; the men's right's activists on Reddit ranting about intermarriage; and the handful of protesters who show up at Black Lives Matter rallies holding \"Yellow Peril Supports Black Power\" signs. Kang's exquisitely crafted book brings these lonely parallel climbers together amid a wave of anti-Asian violence. In response, he calls for a new form of immigrant solidarity--one rooted not in bubble tea and elite college admissions but in the struggles of refugees and the working class.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Politics",
    "Race",
    "Audiobook",
    "Essays"
  ],
  "author": "Jay Caspian Kang",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/58145392-the-loneliest-americans"
}