{
  "title": "Isla And The Highlander Complete Collection: Scottish Medieval Highland Romance",
  "description": "*Revised Edition*♥ Seduced By The Highlander\"The complete breathtaking ISLA AND THE HIGHLANDER™ collection by best-selling author Fiona Knightley. A thrilling tale of greed, betrayal, and true love set in the majestic Scottish highlands. Be transported back to a time of honor, beauty, and passion.♥ Her Heart's Desire Bold and beautiful Isla has finally escaped the clutches of her abusive father and evaded an arranged marriage to his deranged henchman. Having gone from rags to riches, Isla is preparing to marry strong, handsome Caelen, the powerful laird of North Berwick and the love of her life. But will the peasant daughter of a notorious and feared criminal be accepted into the clan?Will her vengeful, hate-filled father hunt her down once again?What must she do to break the bonds of servitude that plague her?As the wedding approaches, Isla fears grave retaliation from the torrid past she had so desperately hoped to escape …♥ Love And Cherish Blood ran down Caelan’s face, his hair matted with it. Isla had seen the lifeless way he had dropped to the ground just a few minutes ago ...Now they were both tied hand and foot, helpless, and being rowed across the loch. She knew beyond all doubt that they would kill her husband.Her dreams of any future wilted. If she wasn’t simply killed--and she doubted she would have it that easy--she would be given to another man. The thought made her shudder.Nightmares again?When a mysterious soothsayer shows up at the castle suspicions run wild. Is she on their side, or is she wielding dark magic? And why is she oddly familiar to Isla?♥ To Have And Hold My true love is out there somewhere in the bitter cold darkness of the highland night. Hunted for sport at this very moment. He has to be all right.This unborn child needs him ... I need him!Winter is coming. After the raiders’ latest attack, Caelan is stuck outside the city. Isla is trying to keep the city safe, but can she protect the city and get Caelan back, or will she be forced to choose between the two? Do the people trust Isla to lead them?Ignoring Isla’s legal marriage to Caelan, Isla’s father tries to force her into an arranged marriage to solidify his evil alliances. Will Isla be able to avoid his grasp and save the city?♥ Spy In The Shadows -Isla's blood was pounding. Did he trust her that little? Did he think her so easily manipulated?As winter comes to an end, resources have been strained almost to the breaking point. How much longer can the city hold out against their attackers, whose efforts to strangle the city’s supply lines have become ever more effective?In a bizarre twist Isla’s mother, long presumed to be dead, has suddenly resurfaced and found her way into the castle keep. Is the unexpected return of this mystery woman legitimate or does she harbour darker motives, planted as an insurgent to undermine and betray Isla and Caelan's trust?Is a fateful duel for the city the only resolution to the ongoing siege, or is this simply a ploy orchestrated to capture the city, punish the clan and claim the real treasure ... Isla?♥ Passion And Power Isla sits in the damp dark tent, trying desperately not to think of what will happen next.",
  "genres": [],
  "author": "Fiona Knightley",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/58133040-isla-and-the-highlander-complete-collection"
}