{
  "title": "The Royal Rump",
  "description": "THE ROYAL RUMP is the hilarious story of King Grosso, a raging, dictatorial ruler who thinks of his RUMP as the “seat” of imperial power. “A thing of magnificent beauty”, he proudly blusters. Sabrina, a fiery young prodigy and the superstar of the story, fights for the rights of the little people against the giant of a demagogue…“I must fight for what is right and kick the Royal Ass,” she vows, then challenges the King and, ultimately…takes him down. Not David and Goliath. Sabrina and Grosso. The battle is depicted in a provocative narrative and laugh-out-loud drawings. Ideal for spirited YA and adult readers. Sabrina, a precocious young girl, demands justice for her compatriots when King Grosso enacts a law that eradicates the beloved food of the Kingdom – PASTA. The book provides comedic insights into the persona of a dictator obsessed with control over his citizens. An episode of Grosso’s freakish demands is depicted in a must-see drawing: The King points to a spot on his derriere, and his dutiful Lawmakers pucker-up to kiss the monstrous thing. King Grosso, a giant of a man with a miniscule mind, demands that all pasta-artisans compete to create a noodle in the shape of his RUMP. All other pastas are forbidden. His absurd Pasta Law forces the people to eat Grossotto, the noodles modeled after…his heinie. The citizens of the Kingdom -who adore their macaroni, lasagna and linguini - fall into a deep state of melancholia.Sabrina is the citizens’ only hope for escaping Grosso’s maniacal grip. She wins the pasta contest to confront the King and fight for the people’s rights. In this excerpt from the story, she entices the ruler with a ruse to stroke his ego. “My King…Do you know what inspired the design for your grand Grossotto?”“Tell me,” he replied excitedly, expecting a well-deserved reward. She pauses, imagining the model for her creation...“The butt of an OLD…FAT…COW.” Her taunt is depicted in yet another outrageously funny drawing that features the backside of, what else? A hefty bovine. Grosso’s rule reaches a crisis point: The once mighty King listens fretfully to thousands of citizens protesting outside of his Castle. “Off with his rump! Off with his rump! Off with the Royal Rump!”A pivotal drawing shows a petrified Grosso waiting for the Royal Executioner to drop a razor-sharp guillotine onto the SEAT of his imperial power. Finally, Grosso’s demise: Prince Marcello, the King’s beloved son, returns from exile to escort the Royal Nitwit to a sanitarium to have his head examined and the demons exorcised from his soul. Sabrina is hailed as a hero for her courage to stick to her vow: To fight for what is right. She kicks the Royal Ass and imbues the people of the Kingdom with a sense of empowerment.",
  "genres": [],
  "author": "Sly Segreto",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/58158890-the-royal-rump"
}