{
  "title": "Your One Wild and Precious Life: An Inspiring Guide to Becoming Your Best Self At Any Age",
  "description": "WINNER OF THE AUDIENCE CHOICE IRISH BOOK AWARD 2021Once you've got a few decades on the clock, life can seem sort of cross-roadsy. Once you're no longer thinking of yourself as 'young', you may be looking back, thinking 'How did I get here?' And also looking ahead, wondering: 'What do I do now?'This realization that neither time nor choices are limitless is both daunting and exciting. This is the moment to take stock and figure out how to make the best of every precious moment of the rest of your life. And to develop the tools to be able to do so again and again.Your One Wild and Precious Life is an eye-opening account of this surprisingly liberating process. Using the latest ground-breaking research, leading psychologist Maureen Gaffney has written an inspiring and practical guide for getting to grips with time. Taking the key stages of our life - from infancy to old age - she explores what we learn at each stage. And, crucially, she explains how, no matter what has happened in the past, and what age you are, you can find a better route forward.Your One Wild and Precious Life is both profound and reassuring. It will transform your thinking, connect you with who you truly are and help you to reclaim control over your life. Crucially, it will empower you to face the future with optimism. It is a book to fundamentally alter your relationship with time and show you that every age can be your best age.'A profound, important work; simultaneously wise, instructive and a love letter to humanity' \nIRISH TIMES\n'Fascinating and engaging' \nSUNDAY TIMES\n'A must-read' \nIRISH DAILY MAIL\n'[It] will transform your thinking' \nIRISH FARMERS JOURNAL",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help"
  ],
  "author": "Maureen Gaffney",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/58169319-your-one-wild-and-precious-life"
}