{
  "title": "Strong Bones",
  "description": "\"Peterson’s tale strives to enshrine all that was magical about growing up in the ’80s. He laces his narrative with mentions of favorite films, toys, video games, music, and fashion, much like Ernest Cline does in Ready Player One (2011). While primarily being a Stephen King–style panorama of a town gripped by horror, Peterson’s story also feels like a cautionary middle-grade tale ... A magical killer and ’80s pop culture headline this crowded but engaging horror tale..\" —Kirkus ReviewsIt’s 1989, and evil’s on the loose in the Smoky Mountains.Now, only a brave group of friends can stop it, using their imaginations and a little bit of magic.Okay … a lot of magic.Hiram and Mac Gresham live with their recently widowed Mom in the foothills of the Smokies. But when she starts dating a new man, he introduces two abrasive step-siblings into their lives, upending everything they knew.Meanwhile, Hiram is having dreams he can’t ignore—dreams of a man with a Plaid Face. The Plaid Man haunts the woods around their home, sending cryptic messages about East Tennessee’s most notorious serial killer, Lenny Skelton. Skelton just broke out of prison and is on the hunt for his latest prey.All that stands in his way are Hiram, Mac, and an unlikely group of heroes that includes their best pals, Lee and Dawn, their rowdy new step-sister Kaitlyn, their wise and tough old Aunt Hanna, and Justin, a kind-hearted cop who’s crossed paths with Skelton before. Together they must tap into ancient magicks to battle the forces of evil on an epic quest where they’ll explore enchanted theme parks and extradimensional dungeons, armed with their knowledge of folklore, classic video games and movies, and an array of magical weapons.In the proud tradition of The Goonies, IT, and Stranger Things comes this high-spirited retrowave adventure from the creator of the Deadblast Chronicles. Influenced by everything from Stand By Me to A Nightmare on Elm Street 3: Dream Warriors, Strong Bones explores the challenges and horrors of growing up all while delivering a healthy dose of pop nostalgia for the 80s and 90s.",
  "genres": [
    "Horror"
  ],
  "author": "Robert J. Peterson",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/58175759-strong-bones"
}