{
  "title": "The Luminaries",
  "description": "From Susan Dennard, the New York Times bestselling author of the Witchlands series, comes a haunting and high-octane contemporary fantasy about the magic it takes to face your fears in a nightmare-filled forest and the mettle required to face the secrets hiding in the dark corners of your own family.An Instant New York Times BestsellerA Barnes & Noble YA Book Club PickAn Indigo Best Teen Book of 2022A Junior Library Guild PickAn Indie Next PickA Goodreads Most Anticipated YA BookHemlock Falls isn't like other towns. You won't find it on a map, your phone won't work here, and the forest outside town might just kill you. Winnie Wednesday wants nothing more than to join the Luminaries, the ancient order that protects Winnie's town—and the rest of humanity—from the monsters and nightmares that rise in the forest of Hemlock Falls every night. Ever since her father was exposed as a witch and a traitor, Winnie and her family have been shunned. But on her sixteenth birthday, she can take the deadly Luminary hunter trials and prove herself true and loyal—and restore her family's good name. Or die trying.But in order to survive, Winnie enlists the help of the one person who can help her Jay Friday, resident bad boy and Winnie’s ex-best friend. While Jay might be the most promising new hunter in Hemlock Falls, he also seems to know more about the nightmares of the forest than he should. Together, he and Winnie will discover a danger lurking in the forest no one in Hemlock Falls is prepared for.Not all monsters can be slain, and not all nightmares are confined to the dark.\"You'll want to get lost in the world of The Luminaries again and again.”—Leigh Bardugo, #1 New York Times bestselling authorAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Horror",
    "Paranormal",
    "Audiobook",
    "Fiction",
    "Young Adult Fantasy"
  ],
  "author": "Susan Dennard",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/58163754-the-luminaries"
}