{
  "title": "Tongues of Flame",
  "description": "These beautifully crafted stories depict the changing relationships between black and white southerners, the impact of the civil rights movement, and the emergence of the New South.Mary Ward Brown is a storyteller in the tradition of such powerful 20th-century writers as William Faulkner, Harper Lee, Flannery O'Connor, and Eudora Welty-writers who have explored and dramatized the tension between the inherited social structure of the South and its contemporary dissolution. With Tongues of Flame, her first collection of short stories, Brown bares the awkward, sometimes hopeful, and often tragic suffering of people caught in changing times within a timeless setting.Here we meet such memorable characters as a dying black woman who seeks the advice of a now-alcoholic white doctor whom she knew in better years; a young woman, jilted at the altar, driven crazy by an illuminated cross erected by the church opposite her house; and a 95-year-old woman buying a tombstone for her long-deceased husband only to discover that he had been adulterous throughout their marriage. Brown constructs her characters in a disarmingly plain style while breathing life into them with compassion and honesty as they confront the large moments of their lives.First published by E. P. Dutton in 1986 to immediate critical acclaim, Tongues of Flame won the 1987 PEN/Ernest Hemingway Foundation Award. The judges commended Brown for \"seeing life whole, without prejudice, without sentimentality, without histrionics. Her voice may be quiet-sometimes she speaks in a whisper-but her words are, nevertheless, always forceful, clear, and ultimately lasting.\" With this new publication of Tongues of Flame and its inclusion in the University of Alabama Press's Deep South Books series, a whole new generation of readers may once more discover Mary Ward Brown's profound stories of pain, loss, and hope.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Southern"
  ],
  "author": "Mary Ward Brown",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/1276957.Tongues_of_Flame"
}