{
  "title": "Restoration, Book Three: “The Masters”",
  "description": "Chris Brenner has a hard choice to stay with his friends in San Francisco, surrounded by the memories of his dead boyfriend; or move to a city thousands of miles away? His friends, Mary and George have already relocated to Manhattan, for family reasons. But life in New York turns out to be quite different from that they expected— and Chris soon finds himself on a path he never imagined. Finally deciding he must escape from the sorrow that haunts him, Chris packs everything he owns into a single suitcase and flies to New York, to resume his studies at the humanistic Center for Restoration in Manhattan. But even though his friends, George and Mary, are also in New York, the trio of Initiates from the program at the Center rapidly realize that their lives are headed in radically different directions. Chris quickly finds that his education has been commandeered by several mysterious retired Priests from the Center, called Masters. Together, they train Chris and guide him to a career he had never imagined for himself, as he discovers and deepens the talents that were born in him. George endures the demanding tutoring his aunt inflicts on him to raise him to the level of competence she requires in the family business— but his old adolescent habits and lack of discipline threaten to undo all the good work Aunt Miriam has done. Meanwhile, Mary comes to help her older sister through her first pregnancy, only to confront the truth about her family’s past and the dysfunction of her present in the crucible of her sister’s time of need. For all three of the Initiates, the fall of 2020 in New York brings new friends, new experiences and skills, and above all else new self-awareness as they struggle to make the transition from victims of religion to survivors. Set during the violence and turmoil of the final year of the failed Trump Presidency, the RESTORATION series reveals the lives and loves of average Americans as they struggle to rise above the shackles of their legacy religions, all while attempting to create new lives for themselves.",
  "genres": [],
  "author": "Bayla Dornon",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/58175024-restoration-book-three"
}