{
  "title": "Cold Hearted Bastard",
  "description": "A full-length gritty mafia romance that blurs the lines between right and wrong... and love and hate.He didn’t have a heart... but he wanted hers.All I knew about life was anger and violence. Pain and suffering. Kill or be killed.I was a “fixer” for the Ruin—a syndicate for the Bratva, Cosa Nostra, Cartel, and any other organized crime faction that dealt in the darker, crueler aspects of humanity.I was a free agent who was called upon to do things weaker men didn’t have the stomach for.And when you surround yourself with death for long enough, soon, you didn’t remember what it felt like to be alive.And then I saw her. She was a fragile little thing who tried to be strong. But I could tell she’d seen too much horror in the world, too much of the ugly within people. I should have stayed away. I’d only bring her farther down into the darkness.But for the first time in my life, I felt a stirring in my chest, this protectiveness and possessiveness toward another living person. And it was painful. It made me feel alive.Lina tried to hide how broken she was, but I was an old friend of being ruined. She held secrets I’d find out. Because for the first time in my miserable life, I wanted something for myself. I felt something more than apathy and indifference.I wanted to possess the innocence she clung to. I wanted to break it open and consume it for myself. I could look into her too trusting blue eyes and knew I’d maim for her. I’d kill for her. And that became our truth when her past finally came back for her when my present tried to destroy her. They thought they could take the one thing—the only thing—I’d ever wanted for myself. They were wrong.When I looked at her, I felt some of the monster that made me who I retreated back to my black soul. He’d never leave... but he’d share the space. For her.A complete standalone novel in the Underworld Kings series.",
  "genres": [
    "Dark Romance",
    "Romance",
    "Mafia Romance",
    "Dark",
    "Contemporary",
    "Contemporary Romance",
    "Crime"
  ],
  "author": "Jenika Snow",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/58184239-cold-hearted-bastard"
}