{
  "title": "Demon Rejected",
  "description": "My mother called me Demon before hitting me.My dreams are made of fire...I am getting used to being rejected. No one really wanted me, starting with my mother, my foster family and my fated mate.I don't understand what is happening in my dreams. When I get scared, a beautiful wolf made of flames protects me. Fire doesn't burn me.My name is Scarlet and I am a survivor, the scars on my wrist and throat are reminders.I grew up in a trailer park with a mother who got drunk and beat me until the fire wolf came and the home of my suffering turned into flames and ashes.The foster system didn't treat me any better. As the years passed I started to believe what the therapist said, that Sparky, my fire wolf, wasn't real and only a figment of my imagination.Everything changed on the day Mountain Man saved me from the mental asylum. I was locked in a place where they did experiments on people like me...Shifters.I am a shifter, a wolf shifter but not an ordinary one.Mountain Man became my teacher, my mentor and so much more. He is a wolf and I opened up and trusted him only to be rejected by the one who was perfect for me.Scorned, hurt and broken hearted I join the Shifter Nation, the wolf shifter pack who protects the weak and orphan shifters.I am a weapon, an assassin who hides her fire wolf from the other \"normal” wolf shifters.After Mountain Man gets kidnapped I am the only one who can save him. Risking everything, I throw myself into danger for my fated mate who rejected me.But who is the other mystery shifter I saved? I could have sworn that he had an ice wolf next to him.I am a target now, the last fire wolf, turned from the hunter into the prey.My connection to Ziggy the loner and Kyle, the son of the Alpha of the Shifter Nation doesn't make things easier.This story features a wild FMC who battles her own darkness, fears and inability to trust others.This is a why choose reverse harem novel with wolf shifters and demons. Scarlett is a potty mouth heroine who fights mental illness and the urge to inflict self-harm.Fit for mature readers 18 +Cover by Luminescence Covers.",
  "genres": [
    "Paranormal",
    "Reverse Harem",
    "Shapeshifters",
    "Demons",
    "Unfinished"
  ],
  "author": "Kitty Siberia",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/58192390-demon-rejected"
}