{
  "title": "Truth and Consequences: Special Comments on the Bush Administration's War on American Values",
  "description": "Short, sharp, and oftentimes shocking, Keith Olbermann’s “Special Comments” have made his nightly MSNBC program, Countdown with Keith Olbermann, must-see viewing–and the fastest-growing news show on cable TV. In these segments, Olbermann calls out the perpetrators of mismanagement, brutality, cronyism, and the appalling lack of accountability at the highest levels of the Bush administration. In so doing, Olbermann goes where most of the mainstream media fear to tread–and his rapidly expanding audience eagerly follows. In Truth and Consequences, Olbermann collects the best of his Special Comments, presented here with additional observations and other new material. Whether taking to task the likes of Vice President Dick Cheney and (the thankfully former) Secretary of Defense Donald Rumsfeld, who compare critics of the Iraq War to Nazi appeasers, or giving his impassioned perspective on why torture is un-American and what it really means to support our troops, or grilling timid lawmakers who fail to rein in presidential overreach and abuses of executive power, Olbermann’s devastatingly blunt (and at times wickedly funny) commentary cuts to the core of the duplicity and cynicism of a government that has lost the ability to distinguish between leading our great nation and ruling it. Naturally, Keith Olbermann’s candor and razor-sharp polemic have earned him many detractors and enemies. His antagonists in the media, such as Bill O’Reilly, have mocked him and accused him of rank intolerance. Yes, Keith Olbermann is intolerant–of hypocrisy, demagoguery, fear-mongering, and especially the equation of dissent with treason. In Truth and Consequences, he fights to reclaim for himself and all Americans the dignity of speaking one’s mind and acting on one’s conscience. \nPraise for Keith Olbermann\n“A truth-telling, Bush-bashing accidental liberal hero.”–New York “The most honest man in news . . . Olbermann clearly relishes his feuds and doesn’t seem to worry much about sparking new ones.”–Rolling Stone “Part Jon Stewart (the funny), Dennis Miller (the erudite and biting sub-references), [and] H. L. Mencken (the skewering of power and stupidity in equal doses) as well as crusading journalist . . . Olbermann has emerged as a kind of force of nature.” –San Francisco Chronicle“Intelligent, well-read, forceful and incisive.”–Rocky Mountain NewsFrom the Hardcover edition.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Journalism",
    "Government",
    "Biography"
  ],
  "author": "Keith Olbermann",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1029340.Truth_and_Consequences"
}