{
  "title": "THE POPE'S BUTCHER",
  "description": "Abandoned as a child and raised by the Church, young Sebastian works tirelessly in his pursuit of priesthood. But when a shadowy hooded figure passes him a scroll, his careful plans face a turning point. It appears his name has drawn the attention of the Inquisition and his attendance is commanded at once—for retribution, information, or something else, he does not know.Father Heinrich Institoris the Grand Inquisitor is lauded as a visionary man, driven by a burning desire to cleanse the world of Eve’s original sin by eradicating witches. As Inquisition courts bloom across Europe, he vows to leave no stone unturned, no hovel unexamined, and no woman alive, in his search for justice.As the Inquisitor’s violent mission unfolds, Sebastian embarks on a quest through dank crypts, crumbling abbeys, and the darkest depravities known to man. Torn between duty and love when he encounters the beautiful pagan Brigantia, he fights to uncover the truth: of his past abandonment, the power of the occult, and just how far he’ll go to protect the Church he loves. A Church that is harboring deadly secrets.Inspired by true historical figures and events in the 15th Century, The Pope’s Butcher is not only a hair-raising work of suspense and espionage, but an astonishing account of religion and the occult in the Middle Ages.With an intriguing writing tone and a talent to create suspense and mystery from true events, Joseph C. Gioconda delivers a shocking story of serial murders within the Catholic Church. In writing his latest book, he has interviewed leading scholars in the U.S. and Europe and hired professional researchers to comb through newly discovered source material from Germany and Italy.",
  "genres": [
    "Historical Fiction",
    "Thriller",
    "Fiction",
    "Mystery",
    "Medieval",
    "Religion",
    "Audiobook"
  ],
  "author": "Joseph C. Gioconda",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/58177662-the-pope-s-butcher"
}