{
  "title": "Used A Dark Romance",
  "description": "An underground fighter in love with his stepbrother’s fiancée.A club dancer struggling to make ends meet.Two men lusting after the same woman.A wrong choice leading to irrevocable damage.Excerpt:DmitryFrom the moment I see her on stage, I cannot keep my eyes off of her sultry curves and gorgeous face. She has put too much work into looking like a bad-ass broad, but I can tell from the way she carries herself that she is faking it. Too bad she has just the kind of commodity that is rarely found in girls dancing at strip clubs.Class.I can see it even if she tries desperately to hide it underneath all that bravado and fuck-you attitude. She may fool everybody gathered around her beautiful feet, but she does not fool me. Boris is already enchanted by her exotic looks, her long raven hair, and stunning body. She might look petite and fragile, but she is feisty, and most men are into that. Including my brother.I pull up a chair next to Boris and watch her dance around the pole, imagining her long legs wrapped around me as I plow my way inside her velvety softness. And if I am doing that, so are the rest of the guys who are literally eye-fucking her. My stomach turns when she straddles my brother’s legs, her naked breasts grazing his face, rubbing all over his chest. I clench my teeth, trying to calm down because I have no right feeling the way I do about a girl I just met. She is just doing her job. Who am I to judge?\"Used\" is an 8K-word Dark Romance Novelette with no cheating and a HEA.Trigger Warnings: Assault, pregnancy loss.Note from the Author: This book also contains Bonus Material, the original version of USED as it was submitted to the Service Scape Short Story Contest.Trigger Warnings: Content mentions domestic abuse, drug use, cheating and attempted suicide. Please read with caution.",
  "genres": [
    "Dark Romance"
  ],
  "author": "Selena  Moore",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/58176198-used-a-dark-romance"
}