{
  "title": "The Stable Boy",
  "description": "PaigeWe called him the stable boy. Dad took him out of foster care and brought him to our farm because it meant free labor. I didn't know his name. Didn't want to.You know what else I didn't want?I didn't want to notice him as he eventually grew out of that lanky frame and got...hot. I didn't want thoughts of him invading my brain when I was on dates with my boyfriend. I didn't want to care when he looked like he needed to say something so badly but couldn't.Because he was mute. He couldn't speak even if his life depended on it. And after making that same life a living hell for him all these years, I didn't want to face the fact that he might never forgive me.OliverWhy didn't they ever say it? Why didn't they ever say my name? I ached to hear it sometimes instead of the usual phrases like 'stable boy' and 'dumb kid'. In their eyes, that was all I was. Because of what? My disability?And her...My tormentor. My foster father's daughter who never got off her high horse. What did I ever do to her? Why did she hate me so much?Even when I treated her with kindness.Even when I helped her out with things.Even when tears gathered in my eyes and I wanted to tell her to stop because I didn't deserve to be bullied but words wouldn't come out of my mouth.The world was my hell and she ruled it like the devil. And the worst part of it all was that...I let her.TW: This book contains themes and situations pertaining to slavery, abuse, bullying, sexual assault, trauma and disability discrimination. Reader discretion is advised...(Note: The Dreamhaven duet is a loose retelling of the classics 'Oliver Twist' and 'The Count of Monte Cristo' consisting of reverse bully romance and rich girl/poor boy trope in Book 1 followed by a vengeance plot and HEA in Book 2. Book 1 ends on a cliffhanger and features a hero suffering from mutism and 17 y.o MCs but with 18+ content.)",
  "genres": [
    "Dark",
    "Romance",
    "Dark Romance",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Fiction",
    "Contemporary"
  ],
  "author": "Z.S. Storm",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/58190137-the-stable-boy"
}