{
  "title": "Writing Under Pressure: The Quick Writing Process",
  "description": "Most writing is done under pressure. An executive has to produce a three-page position paper by tomorrow at nine. A department head suddenly has to write a one-page action memo by noon. A graduate student has a twenty-page research paper due in a week. Yet, while most students and professionals write under pressure--with limited time, limited space, and a supervisor or instructor to please--few approach the task systematically.In Writing Under Pressure , Sanford Kaye, a renowned expert on the subject, presents a system he calls the Quick Writing Process (QWP) that focuses on real-world writing tasks and demonstrates how to produce the clearest, most honest, most powerful work possible under the constraints of time and space. A writing instructor with twenty-five years' experience teaching students and professionals in business and government, Kaye tells writers how to budget their time and how to use this time efficiently.Exploring particular writing situations in which QWP can be applied to make the most of what the writer knows, Kaye discusses the process of taking exams, focusing on how instructors select questions and evaluate essays. He also considers writing in business and government, featuring an insightful analysis of a memo written by Colonel Oliver North. This memo highlights one of the most important issues writers in business and government whether to write the truth as they see it or simply what their bosses want to hear. Presenting a wealth of such examples, Kaye reveals how to break through stifling organizational codes in order to write memos and position papers that count.While most guides to writing ignore the constraints of time and space, Writing Under Pressure tackles these problems head on, making it an essential reference for students, business professionals, government officials, or anyone else faced with a difficult writing assignment that has to be done now.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Research"
  ],
  "author": "Sanford Kaye",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1277019.Writing_Under_Pressure"
}