{
  "title": "Cliff's Descent",
  "description": "For the first time, New York Times bestselling author Dianne Duvall brings readers a novel--set in the \"fast-paced\" (Publishers Weekly) and \"totally addictive\" (RT Book Reviews) world of the Immortal Guardians--that revolves around a vampire... one who has become a friend and trusted ally of the powerful warriors.Every mortal who works at network headquarters knows that vampires reside below them. They were the first to surrender to the powerful Immortal Guardians who hunt them. And they did so, hoping they can be saved, that the doctors and scientists the Immortal Guardians employ can halt the progressive brain damage that robs all vampires of their sanity. Though curious, Emma never thought she would meet any of the vampires who remain under heavy guard several stories beneath her office. Then mercenaries strike, bombarding the building with heavy artillery. The vampires are freed to join the fray... and Cliff saves her life.From that moment on, she can't stop thinking about him regardless of the restrictions placed on interactions with vampires. When Emma discovers a way to speak to Cliff at network headquarters, she becomes even more fascinated by him. He's smart, charming, and honorable to his core despite the darkness that lies ahead. And he seems to crave her company as much as she does his. Aware of the eyes that watch them, they keep their encounters innocent, limiting them to those of mere acquaintances. Nevertheless, their attraction grows and she soon falls in love with him even as the madness begins to claim him.Cliff realizes his future is dark. As one vampire friend after another succumbs to insanity, hope that network doctors will be able to find a cure in time to keep him from meeting the same fate begins to dwindle, leaving him little to look forward to... until he meets Emma. Just speaking to her brings him a happiness and contentment he hasn't experienced since before his transformation. And when they finally find a way to be alone together, everything changes. Emma burrows her way right into his heart and quiets the voices. She sparks dreams of a future with her that strengthen his determination to beat back the madness. But as time passes, the voices grow louder and insanity begins to chip away at him until he fears it will eradicate every part of him she fell in love with.Will the two of them find a way to defy the odds and find their happily-ever-after? Or will Cliff's descent consume him?Praise for the IMMORTAL GUARDIANS Series\"Crackles with energy, originality, and a memorable take-no-prisoners heroine.\"--Publishers Weekly\"This series is earth-shattering awesome and Dianne has quickly become one of my favorite authors.\"--Reading Between the Wines Book Club\"Fans of terrific paranormal romance have hit the jackpot with Duvall and her electrifying series.\"--RT Book Reviews\"Awesome characters, snappy dialogue, exciting action... and delightful humor.\"--I'm a Voracious Reader\"Paranormal romance fans who enjoy series like J.R. Ward's Black Dagger Brotherhood will definitely want to invest time in the Immortal Guardians series.\"--All Things Urban Fantasy\"Paranormal at its finest.\"--Book Reader Chronicles",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Vampires",
    "Fantasy",
    "Audiobook",
    "Urban Fantasy"
  ],
  "author": "Dianne Duvall",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/58188708-cliff-s-descent"
}