{
  "title": "CodeName: Orcus Series",
  "description": "If you like Lee Child's Jack Reacher, David Baldacci's Amos Decker, and Robert Ludlum's Jason Bourne, you won't be able to put down Thomas J Eyre's compulsively addictive CodeName Orcus series. .Books 1 -3 of the gripping Paddy Regan thrillers in the CodeName: Orcus series in one boxset.Book#1 Desert OverWatch.A 1990 deployment to Iraq, in the build-up to the first Gulf War turns deadly.Sergeant James Regan wants nothing more than to be at home with his family. After nearly two decades of putting his life on the line fighting for Queen and country, he has decided it's time to quit the Royal Marines, he just has to make it home.Corporal Roger Morgan hates life in the corps and uses alcohol to take the edge off. A downed coalition aircraft brings the two men together while behind enemy lines on a mission to track and destroy Iraqi SCUD missile launchers.Old rivalry surfaces amid the danger, tension and stress of life behind enemy lines. Was it passion, jealousy or fear that turned a Royal Marine into a calculating, cold-blooded murderer?Book #2 The British FrontLineThe Russian Mafia picked the wrong girl to abduct. Now Paddy is hunting on British soil, and they are his prey.The dark forces of the Russian Mafia have launched an assault on the underworld of British society, and the very people tasked with the protection of British Isles, are colluding with the Mafia's hostile intent.Used to fighting to keep his country safe, Royal Marines Sergeant Patrick (Paddy) Regan, realises there is a war being fought in Great Britain. This brutal conflict is being waged between the Russian Mafia and Britain's organised crime. The rot caused by the Russian Mob's toxic regimen of bribery, intimidation, and violence has reached the very top of Mi5, the British secret service.What Paddy wants most is to find and rescue his young half-sister, Susie. He knows the Russian Mob abducted her and he's getting zero help from the authorities. He deserts from the Royal Marines, determined to track her down and kill those responsible for taking her. Calling on skills honed in Northern Ireland, Iraq and Afghanistan, he infiltrates their organisation and begins its destruction from within.Book #3 The Namibian OffensiveA wounded sniper. A mission for revenge. But does he have the skill to take down his most dangerous enemy?Leicester, UK. Royal Marine deserter Paddy Regan swears vengeance against the Russian Mafia. Enraged by his parents’ savage murders, Regan organizes a rule-breaking rampage to shut down the cruel organization, even if he has to resort to torture. So when the gangsters attempt to rob and kill innocents at an amusement arcade, he seizes the chance to execute every last one…But with news of his estranged fiancée’s kidnapping by Namibian rebels, Regan and his team must shift their sights on her rescue by infiltrating a terrorist base. As the onslaught of bloody violence in sex trafficking, blackmail and murder escalates, Regan’s forced to deploy his heavy weaponry to end the enemy’s brutal exploits.",
  "genres": [],
  "author": "Thomas J. Eyre",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/58191572-codename"
}