{
  "title": "The Lost Women of Rock Music: Female Musicians of the Punk Era",
  "description": "In Britain during the late 1970s and early 1980s, a new phenomenon emerged, with female guitarists, bass-players, keyboard-players and drummers playing in bands. Before this time, women's presence in rock bands, with a few notable exceptions, had always been as vocalists. This sudden influx of female musicians into the male domain of rock music was brought about partly by the enabling ethic of punk rock ('anybody can do it!') and partly by the impact of the Equal Opportunities Act. But just as suddenly as the phenomenon arrived, the interest in these musicians evaporated and other priorities became important to music audiences. In an updated new paperback edition of a book originally published in hardcover in 2007, Helen Reddington investigates the social and commercial reasons for how these women became lost from the rock music record, and rewrites this period in history in the context of other periods when female musicians have been visible in previously male environments. Reddington draws on her own experience as bass-player in a punk band, thereby contributing a fresh perspective on the socio-political context of the punk scene and its relationship with the media. In addition to a wealth of original interview material with key protagonists, including the late John Peel, Geoff Travis, The Raincoats and the Poison Girls, this edition has been updated to reflect the national nature of punk and post-punk with the inclusion of interviews from members of Birmingham-based band The Au Pairs, Leeds-based band The Delta 5 and Viv Albertine of The Slits. Lucy Whitman (aka Lucy Toothpaste) who started the fanzine Jolt and later wrote for Spare Rib also provides enlightening words on the relationship between female punk band members and feminism.",
  "genres": [
    "Music",
    "Nonfiction",
    "Feminism",
    "History",
    "Punk",
    "Womens"
  ],
  "author": "Helen Reddington",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/12771470-the-lost-women-of-rock-music"
}