{
  "title": "Bad Things Happen",
  "description": "The man who calls himself David Loogan is leading a quiet, anonymous life in the college town of Ann Arbor, Michigan. He’s hoping to escape a violent past he would rather forget. But his solitude is broken when he finds himself drawn into a friendship with Tom Kristoll, publisher of the mystery magazine Gray Streets—and into an affair with Laura, Tom’s sleek blond wife. When Tom offers him a job as an editor, Loogan sees no harm in accepting. What he doesn’t realize is that the stories in Gray Streets tend to follow a simple formula: Plans go wrong. Bad things happen. People die.Elizabeth Waishkey is a single mother raising a fifteen-year-old daughter. She’s also the most talented detective in the Ann Arbor Police Department. But when Tom Kristoll turns up dead, she doesn’t quite know what to make of David Loogan. Is he a killer, or an ally who might help her find the truth? Loogan, for his part, would like to trust her, but he has his own agenda. He suspects his friend’s death is part of a much larger puzzle, and he’s not going to wait for someone else to put the pieces together. As Loogan and Elizabeth navigate their way through the Kristoll's world, they find no shortage of people with motives for murder, from a young graduate student obsessed with Laura Kristoll to a trio of bestselling writers, all of them with secrets they don’t want uncovered.As the deaths start mounting up—some of them echoing stories published in Gray Streets—Loogan begins to look more and more like the most promising suspect.Soon it becomes clear that only Elizabeth can find the path to solving both the murders and the mystery of Loogan himself. But by the time she unravels the twisted skein, Loogan May be indicted for murder—or more likely, become the next victim.",
  "genres": [
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Thriller",
    "Crime",
    "Audiobook",
    "Book Club"
  ],
  "author": "Harry Dolan",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/5819399-bad-things-happen"
}