{
  "title": "Public Speaking · Presentations · Media Interviews: Helping you succeed",
  "description": "Do you wish you could deliver a speech with confidence and style? Do you fall apart at job interviews or workplace presentations? Are you afraid of media questions? The fact is that effective communication is a skill, but it’s a skill you can learn.This handbook offers a toolkit of techniques you can use to become a natural and successful communicator. From wearing the right clothes to delivering a clear message, from how to stand to what to do with your hands, from how to give a good job interview in person or on the Internet, to learning to shine in the media spotlight. This book provides the techniques required to succeed.You will learn tips on how to conquer your fears by turning this obstacle into energy that helps you persuade. You will find tips on how to get through that first minute of your presentation and how to use pauses for dramatic effect. There is information about body language, eye contact and conversational speech delivery. The book also explores various ways you can deliver a speech, whether it’s from a fixed text or a few points written on a napkin. You will learn the importance of knowing your audience and making your way to the podium with a clear understanding of what you wish to achieve.The second part of the book deals with media interviews. How to become a successful media spokesperson, how to project a positive image of yourself, your brand, your company, your organization, are all part of lessons learned. Underpinning it all is a critical education about the media itself in all its forms including their modern-day needs and the role you play in meeting their priorities.This book provides techniques to communicate your key messages in various interview situations: the conversational talk show, radio, podcasts, print, television, and the investigative and confrontational interview situation. You will learn to structure your message according to the Three Tells.Then there’s the off-putting “No comment.” In this book you will learn how to say “No comment,” without actually saying it. Instead you will learn how to steer the narrative subtly to your agenda. “No comment” will be replaced by your brief and impactful sound bite.Gabor’s successful Public Speaking, Presentation and Media Interview workshops have helped hundreds of executives, politicians (both men and women) improve their communications skills. And, as reflected in this book, they can help you too.",
  "genres": [],
  "author": "Agota Gabor",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/58218963-public-speaking-presentations-media-interviews"
}