{
  "title": "Waking the Tiger",
  "description": "Shortlisted for a Crime Writers' Association John Creasey (New Blood) Dagger 2022.Finalist for the Ngaio Marsh Awards Best First Novel 2022.Longlisted for the Bloody Scotland McIlvanney Prize for Scottish Crime Book of the Year 2021 and shortlisted for the Scottish Crime Debut of the Year 2021.'Intricately plotted, thoroughly authentic and in Betancourt, a world-weary but witty and appealing protagonist, Waking the Tiger is a wonderfully accomplished debut. I felt transported back to the Singapore of the 1940s and I can't wait for the next one. Wightman is a writer we can expect great things of.' Abir Mukherjee'A splendidly evoked 1930s Singapore, a determined and engaging detective and a dark and twisting tale - Waking the Tiger is historical crime fiction at its best.' William Ryan, author of the Captain Korolev series and winner of Guardian Novel of the YearMark Wightman's Waking the Tiger was the winner of the Pitch Perfect event at the Bloody Scotland Crime Festival in 2017. Mark was also selected to be one of the seventeen UNESCO City of Literature Story Shop emerging writers at the 2017 Edinburgh International Book Festival.For fans of Abir Mukerhjee and Donna Leon, Mark Wightman's brilliant debut novel is historical crime fiction at its very best. Singapore, 1939A young Japanese woman is found dead on the dockside, her throat slashedInspector Maximo Betancourt is working a new beat, one he didn’t ask for. Following the disappearance of his wife, his life and career have fallen apart.A distinctive tiger tattoo is the only clue to her identityOnce a rising star of Singapore CID, Betancourt has been relegated to the Marine Division, with tedious dockyard disputes and goods inspections among his new duties.Who is she? And why are the authorities turning a blind eye?But when a beautiful, unidentified Japanese woman is found murdered in the shadow of a warehouse owned by one of Singapore’s most powerful families, Betancourt defies orders and pursues those responsible. What he discovers will bring him into conflict with powerful enemies, and force him to face his personal demons.",
  "genres": [
    "Mystery",
    "Fiction",
    "Asia",
    "Historical Fiction",
    "Crime",
    "Historical",
    "Historical Mystery"
  ],
  "author": "Mark  Wightman",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/58231489-waking-the-tiger"
}