{
  "title": "Lawson",
  "description": "After serving his country, Lawson Masterson turned to bounty hunting,tracking fugitives alongside his two best friends. High-stakes skips are Gray WolfCorp’s specialty. Chasing criminals and bringing them to justice is a dangerous job and Lawson is determined to get his bounty no matter the cost.Known as the playboy of Graystone and content with his bachelor status,Lawson doesn’t do relationships. He’s dedicated to living life to the fullest and having a good time—no strings attached.Nothing long-term.Nothing serious.Answer to no one.Lawson tosses his rules out the window when the mysterious and timid WillowKeaton catches his eye. Aside from her beauty, there is something alluring aboutWillow that Lawson finds irresistible.  Willow Keaton struggled through her childhood years.Her only dream—to one day have a better life.Barely grown and wanting more for herself, Willow Keaton married a manpromising to give her the world. Turned out, her new husband was nothing more than a wolf in sheep’s clothing, leaving her trapped in a loveless, controlling marriage with a broken spirit.One day Willow finds the courage and strength needed to take back her life.She finds herself in Graystone, Texas, with nothing more than the clothes onher back and a few dollars in her pocket. Willow’s determination empowers her to make a fresh new start in the smalltown. Not even the smooth-talking playboy, Lawson Masterson, will distract her from starting over.  The further you run, the more exhausted you become, and the demons Willowleft behind finally catch up to her. The ultimate test of a man is who he will fight and die for. Lawson will give hislast breath to keep Willow safe.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Westerns",
    "Abuse",
    "Friends To Lovers",
    "Contemporary",
    "Romantic Suspense"
  ],
  "author": "Sandy Alvarez",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/58219054-lawson"
}