{
  "title": "Encyclopedia of Dr. Sebi 7 in 1: Everything You Need to Win Against STDs, Cancer, Diabetes, Leukemia, Epilepsy, Herpes, and Other Diseases. 500+ Natural Remedies Included",
  "description": "THE BOOK THAT BEGINNERS AND EXPERTS SHOULD HAVE IN THEIR LIBRARYThe Foolproof Remedies to Eliminate Once and for All Suffering from Your Life and Live Free>>> ENCYCLOPEDIA OF DR. SEBI 7 IN 1 >>> TRY IT NOW !__________________________________________________________________________________Are Looking for A Complete Guide that Teaches You How to Eat Healthy, How to Naturally Detox Your Body, Keep Your Immune System Strong and Control Diseases? If YES , then THIS GUIDE Is the Best Solution for You.? - INTRO ABOUT THE AUTHORA. J. Bridgeford is a young author who has been a student of Dr. Sebi's natural remedies for years. He used all his knowledge to help many people recover from bad diseases with excellent results.His motivation arose after losing his mother to chronic infection and after 10 years he has helped more than 5,375 people. With experience, he decided to document all his knowledge and write a collection of books to help all families._________________________________________________________________ _________________The 7 Complete Volumes in 1 Book Only | Body-Mind-Spirit Free from Diseases__________________________________________________________________________________? - WHAT YOU WILL LEARNWithin this book, you have over 500 different natural remedies to regulate the immune system and eat healthy.You will learn to manage your ph level, in this way you can definitely eliminate the toxins and mucus from your body.You will know the essential natural ingredients to heal you and make excellent body treatments.And Much more.__________________________________________________________________________________? - WHAT YOU FIND IN THIS COMPLETE ENCYCLOPEDIA :VOL.",
  "genres": [],
  "author": "A.J. Bridgeford",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/58243244-encyclopedia-of-dr-sebi-7-in-1"
}