{
  "title": "Allow Me to Retort: A Black Guy’s Guide to the Constitution",
  "description": "MSNBC legal commentator Elie Mystal thinks that Republicans are wrong about the law almost all of the time. Now, instead of talking about this on cable news, Mystal explains why in his first book.\"After reading Allow Me to Retort, I want Elie Mystal to explain everything I don't understand--quantum astrophysics, the infield fly rule, why people think Bob Dylan is a good singer . . .\" --Michael Harriot, The RootAllow Me to Retort is an easily digestible argument about what rights we have, what rights Republicans are trying to take away, and how to stop them. Mystal explains how to protect the rights of women and people of color instead of cowering to the absolutism of gun owners and bigots. He explains the legal way to stop everything from police brutality to political gerrymandering, just by changing a few judges and justices. He strips out all of the fancy jargon conservatives like to hide behind and lays bare the truth of their project to keep America forever tethered to its slaveholding past.Mystal brings his trademark humor, expertise, and rhetorical flair to explain concepts like substantive due process and the right for the LGBTQ community to buy a cake, and to arm readers with the knowledge to defend themselves against conservatives who want everybody to live under the yoke of eighteenth-century white men. The same tactics Mystal uses to defend the idea of a fair and equal society on MSNBC and CNN are in this book, for anybody who wants to deploy them on social media.You don't need to be a legal scholar to understand your own rights. You don't need to accept the \"whites only\" theory of equality pushed by conservative judges. You can read this book to understand that the Constitution is trash, but doesn't have to be.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Law",
    "Race",
    "Audiobook",
    "Social Justice"
  ],
  "author": "Elie Mystal",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/58228943-allow-me-to-retort"
}