{
  "title": "Hot Jocks",
  "description": "The Hot Jocks are ready for you to binge! Love hockey romance? This collection contains 4 full-length books of stubborn hockey players and the women who tame them. (Contains Crossing the Line, Down and Dirty, Wild for You, Taking His Shot)\"A TOTAL, UTTER MUST READ.\" -Book FanaticCrossing the LineRecovering from a pulled groin muscle isn’t exactly how I planned to spend my much-needed summer vacation. But being nursed back to health by my gorgeous friend Bailey, who’s just graduated from medical school, doesn’t exactly sound like a hardship.We spend a week together at my family’s beach house, a week of swimming and barbecues, a week of entertaining my little cousins and sleeping right across the hall from each other. A week of watching Bailey grow closer with my mom and sisters, and my wacky but lovable grandma. A week of enjoying Bailey tending to me—which is saying something, because it involves a lot of shoving ice packs into my underwear and taping up sore muscles.She’s funny and kind, and after just being myself for the first time in a long time, I find my walls come tumbling down. But when Bailey says she’s not looking for a relationship, I’m bound and determined to be more than just the fun hookup who sprained his groin a second time—this time with her.Is me.Down and Dirty Remember that time you accidentally woke up in Vegas married to your hot younger guy friend?That’s basically my life right now. Mistakes were made, okay?He's too young for me. Twenty-three to my thirty. And he's saving himself for the right girl.Yup. Apparently I've married the last alpha-male virgin on the planet. And my stubborn, oddly traditional, new husband doesn’t want a divorce.He wants me. Complicated doesn't even begin to cover it.Wild for YouHe’s growly. Grumpy. Stubborn.And now, my new roommate.Walking away from my disastrous last relationship was an easy decision, but moving in with a friend-of-a-friend hockey star who’s rarely home? Not quite as simple, because Grant makes me feel all kinds of things I’m not prepared for.Protected. Desired. Unsteady.• • •She’s beautiful. Smart. Tempting.And a little fragile.I’ve never been anyone’s knight in shining armor, but when Ana needed a place to stay, it was easy to offer her a room with me.Not so simple, though, is keeping my hands—or my mouth—to myself. And the night she crawls into my bed and shares her body with me? Heaven.But she’s not looking for a relationship, and to my surprise, I find myself pissed off by that idea.They say my heart is broken, that I’ll never settle down. I used to think that was true. Now, though? Hell, your guess is as good as mine.First, she took my bed.Then she took my heart.Then she took my everything.Taking His ShotShe says she doesn’t date players.She swears up and down that she’ll never handle my stick.We’ll see about that, sweetheart.",
  "genres": [
    "Hockey",
    "Sports"
  ],
  "author": "Kendall Ryan",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/58238998-hot-jocks"
}