{
  "title": "Arabian Pearl",
  "description": "The guest of a foreign prince, Robert St. Claire is given a beautiful slave for his pleasure. Unusual customs aside, he finds himself in a terrible dilemma. Not only is she English, but the daughter of a friend. In order to rescue her from captivity, he must use her like a harem girl in every way possible... Lady Celia Davenport has been abducted, sold into slavery, and now finds herself in the bed of an Infidel lord. If she gives him erotic pleasure with subservient eagerness, there is a glimmer of hope in her future. Anxious to escape, she finds that perhaps sexual servitude isn't the prison she once imagined. Besides, every time she gives her lover satisfaction, she receives a rare and valuable pearl as a reward. An English lord and a lovely slave find that circumstance and fate have a hand in granting those rare Arabian Pearls... Erotic Historical [contains graphic sexual content and adult language] Novella  (25,000 words) 5 \"The Regency era has never been sexier than what you’ll experience in Arabian Pearl. Emma Wildes’ unique writing style is edgy and erotic. Robert’s tenderness is sweet and sexy while Celia’s acceptance of him and her situation is both moving and emotional. These two sensual characters create enough heat to warm you on the coldest of nights and will have you reaching for ice when things get too hot. I anxiously look forward to the remaining stories in the Brothers of the Absinthe Club series. If they’re anything like Arabian Pearl, I'll need to free up more space on my Keeper shelf!\" —Kerin, Two Lips Reviews 5 \"WOW!! Arabian Pearl is an amazing story. When Celia realizes the situation, she offers herself to Robert. Ms. Wildes has an incredible storytelling talent and she shows it here. Celia is a beautiful and innocent young woman who is seduced by Robert, a handsome and knowledgeable man. Their sexual encounters are beyond erotic; each night for twelve nights Robert teaches Celia something new. I was trembling in my chair as I read about their exploits. Celia grows in this story from an innocent child to an adult and sexually aware young woman. Robert knows that what he is doing is against all the rules of his society, but he does not want Celia punished and thrown into a far corner of the harem. Although they are not allowed to discuss their lives in England, they manage to get to know each other in whispers. I was simply enthralled by this story and I highly recommend it to everyone who enjoys a beautiful, graphic and erotic love story.\" —Marcy Arbitman, The Romance Studio 5 \"This reader found Arabian Pearl a most interesting read that not only charms but titillates as well. This fascinating tale allows the reader to escape into a world of sultans, harems, and a beautiful love slave with her English lord. Even though Celia and Robert’s story is so much different from the other beautiful women in Celia’s predicament, I found my heart going out to those women who couldn’t be helped and had to suffer their fate when they were sold into slavery. Emma Wildes blends some wonderful characters, romance, and a bit of history to make a sensual read that keeps the readers interest. She paints characters with so much emotion that touch the reader, especially the poor women in bondage, yet she creates a very poignant love story between Celia and Robert that is remarkably breathtaking making this one excellent read.\" —Linda L., Fallen Angel Reviews",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Regency",
    "Manga",
    "Erotica",
    "Harem"
  ],
  "author": "Emma Wildes",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/5822224-arabian-pearl"
}