{
  "title": "The School of Mirrors",
  "description": "A scintillating, gorgeously written historical novel about a mother and a daughter in eighteenth-century France, beginning with decadence and palace intrigue at Versailles and ending in an explosive new era of revolution.During the reign of Louis XV, impoverished but lovely teenage girls from all over France are sent to a discreet villa in the town of Versailles. Overseen by the King’s favorite mistress, Madame de Pompadour, they will be trained as potential courtesans for the King. When the time is right, each girl is smuggled into the palace of Versailles, with its legendary Hall of Mirrors. There they meet a mysterious but splendidly dressed man who they’re told is merely a Polish count, a cousin of the Queen. Living an indulgent life of silk gowns, delicious meals, and soft beds, the students at this “school of mirrors” rarely ask questions, and when Louis tires of them, they are married off to minor aristocrats or allowed to retire to one of the more luxurious nunneries. Beautiful and canny Veronique arrives at the school of mirrors and quickly becomes a favorite of the King. But when she discovers her lover’s true identity, she is whisked away, sent to give birth to a daughter in secret, and then to marry a wealthy Breton merchant. There is no return to the School of Mirrors.This is also the story of the King’s daughter by Veronique—Marie-Louise. Well-provided for in a comfortable home, Marie-Louise has never known her mother, let alone her father. Capable and intelligent, she discovers a passion for healing and science, and becomes an accredited midwife, one of the few reputable careers for women like her. But eventually Veronique comes back into her daughter’s life, bringing with her the secret of Marie-Louise’s birth. But the new King—Louis XVI—is teetering on his throne and it’s a volatile time in France…and those with royal relatives must mind their step very carefully.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "France",
    "18th Century",
    "French Revolution",
    "Audiobook"
  ],
  "author": "Eva Stachniak",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/58262072-the-school-of-mirrors"
}