{
  "title": "Thick as Thieves",
  "description": "Julian:I've been in love with my best friend since forever. Okay, fine. Like, kindgergarten. It started out platonic, obviously, but then became... nope. Still platonic. The problem is that Parker Ellis has been straight since forever. And that makes it difficult to convince him the two of us are meant to be together.And now there's no point. All is lost. He's gone and gotten engaged to his high-school sweetheart which means I have to grin and bear it while pretending to be the happy, supportive best man while he prepares to commit his life to a woman I can't even fault. She's great. We've all been friends forever. I know he'll be happy with Erin, just not... just not as happy as he could be with me.Parker:I'll admit. Sometimes I press the easy button. Like when Julian Thick had offered me half his sandwich back in grade school after noticing I didn't have any food. Or when I'd needed a date to homecoming in tenth grade and Erin told me she was it. Or when I'd used the one thing that came easy to me, skiing, to get my college tuition paid for. Or when Erin had showed back up in my life six months ago and told it was time to marry and start a family...But for the first time in my life I'm facing something that's not at all easy. It's my wedding weekend and I've just been left at the altar. Not only that, but when my best friend whisks me away to drown my sorrows in a snowy cabin in Aster Valley, I accidentally discover Julian's been keeping secrets. Big secrets.The kind of secrets that lead to hot experimental kisses in front of a blazing fire, tentative physical exploration in a way I'd never imagined before, and the kind of intimate, true confessions I'd never even dreamed of between me and the one person who's always been my true home.But after twenty-plus years of thinking of Jules as my friend without benefits, is it truly possible to change who we are to each other? There's no easy button this time, but I'm willing to do the work. I only wonder if Julian is ready to trust I really mean it.",
  "genres": [
    "M M Romance",
    "Friends To Lovers",
    "Romance",
    "Contemporary",
    "LGBT",
    "Gay For You",
    "Audiobook"
  ],
  "author": "Lucy Lennox",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/58262610-thick-as-thieves"
}