{
  "title": "All the Quiet Places",
  "description": "Brian Isaac's powerful debut novel All the Quiet Places is the coming-of-age story of Eddie Toma, an Indigenous (Syilx) boy, told through the young narrator's wide-eyed observations of the world around him.It's 1956, and six-year-old Eddie Toma lives with his mother, Grace, and his little brother, Lewis, near the Salmon River on the far edge of the Okanagan Indian Reserve in British Columbia's Southern Interior. Grace, her friend Isabel, Isabel's husband Ray, and his nephew Gregory cross the border to work as summer farm labourers in Washington state. There Eddie is free to spend long days with Gregory exploring the climbing a hill to watch the sunset and listening to the wind in the grass. The boys learn from Ray's funny and dark stories. But when tragedy strikes, Eddie returns home grief-stricken, confused, and lonely.Eddie's life is governed by the decisions of the adults around him. Grace is determined to have him learn the ways of the white world by sending him to school in the small community of Falkland. On Eddie's first day of school, as he crosses the reserve boundary at the Salmon River bridge, he leaves behind his world. Grace challenges the Indian Agent and writes futile letters to Ottawa to protest the sparse resources in their community. His father returns to the family after years away only to bring chaos and instability. Isabel and Ray join them in an overcrowded house. Only in his grandmother's company does he find solace and true companionship.In his teens, Eddie's future seems more secure—he finds a job, and his long-time crush on his white neighbour, Eva, is finally reciprocated. But every time things look up, circumstances beyond his control crash down around him. The cumulative effects of guilt, grief, and despair threaten everything Eddie has ever known or loved.All the Quiet Places is the story of what can happen when every adult in a person's life has been affected by colonialism; it tells of the acute separation from culture that can occur even at home in a loved familiar landscape. Its narrative power relies on the unguarded, unsentimental witness provided by Eddie.",
  "genres": [
    "Fiction",
    "Indigenous",
    "Canada",
    "Historical Fiction",
    "Audiobook",
    "Coming Of Age",
    "Book Club"
  ],
  "author": "Brian Thomas Isaac",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/58262411-all-the-quiet-places"
}