{
  "title": "Across the North Sea: A Dark Viking Romance",
  "description": "When the Frankish sisters Ishild and Odilia are stolen away to the North by savage Norsemen, they must each adapt to survive in such a brutish, unforgiving land, so far from home.Odilia's Story: After the attack on her home, Frankish noblewoman Odilia is taken hostage by a Viking warrior with unknown motivations. She has never seen a Viking before, let alone one from the African continent; with his umber-colored skin and black, textured locs, he stands apart from the other Northerners– in more ways than just appearance.When Odilia is saved from becoming the concubine of another Viking, and dangerous forces require her to hunker down in hiding at Svendsholm, the dark Viking swears his fealty to her; as she spends the months at Torsten’s homestead, learning the ways of the Northerners, Odilia comes to know more and more about her strange protector... and discovers that Torsten is a more honorable and noble man than she had initially believed. The sort of man whom she had always hoped she would be fortuitous enough to have as her husband someday.Having suffered the tragedy of losing his family once before, Torsten has no desire to ever marry; as Odilia withers from the weight of her increasingly unrequited love for her savior, she wonders if she can possibly show Torsten that taking a chance on love– even at the risk of a lifetime of hardship– is worth everything.Ishild’s Story: During her attempt to flee from the raid on her home, as the city around her burns to ash, the eldest daughter of Adalbehrt of the Franks stumbles across a wounded Norseman; against her better judgement, Ishild saves his life– a mistake that leads to her ultimate capture and subsequent imprisonment in the North.As a prisoner of the Danes and the promised bride of their chieftain, rumors quickly circulate that Ishild is a witch, forcing her to remain locked away and isolated from the rest of the village. Having been married once before, to a monster of a man, Ishild would rather die than become a bride again. With each day that her wedding to the chieftain draws nearer, she finds herself increasingly helpless, until a series of odd circumstances lead her to the very same Viking whose life she had saved; willing to repay his debt to his brother’s captive, Brandr promises to teach Ishild to fight, meeting clandestinely beneath the chieftain’s own nose, so that she may fight her captors and win her freedom.When she learns of Brandr’s terrible secret, Ishild must choose between her romantic feelings for the dishonorable Viking, or her plan to save herself– before it is too late for either of them.*Told in alternating POVs, both sisters' stories are intertwined in a duet throughout the novel; while they are intended to be read straight through and all at once, they can also be read separately by skipping chapters. Ishild’s Story is told in the even-numbered chapters, while Odilia’s Story has all of the odd-numbered chapters.**Readers take note: This book contains violence, death, blood, mature scenes, and attempted, on-page assault (including by one of the mains). More or less what you would expect from a Viking/historical romance.",
  "genres": [],
  "author": "Sofia Hahn",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/58260703-across-the-north-sea"
}