{
  "title": "Love at First Spite",
  "description": "Falling in love is the ultimate payback in this delightful romcom about an interior designer who teams up with a mysterious architect at her firm to get revenge on her ex the only way she knows how: by building a spite house next doorThey say living well is the best revenge. But sometimes, spreading the misery seems a whole lot more satisfying. That’s interior designer Dani Porter’s justification for buying the vacant lot next to her ex-fiancé’s house…the house they were supposed to live in together, before he cheated on her with their Realtor. Dani plans to build a vacation rental that will a) mess with his view and his peace of mind and b) prove that Dani is not someone to be stepped on. Welcome to project Spite House.That plan quickly becomes complicated when Dani is forced to team up with Wyatt Montego, the handsome, haughty architect at her firm, and the only person available to draw up blueprints. Wyatt is terse and stern, the kind of man who eats his sandwich with a knife and fork. But as they spend time together on- and off-site, Dani glimpses something deeper beneath that hard veneer, something surprising, vulnerable, and real. And the closer she gets to her goal, the more she wonders if winning revenge could mean losing something infinitely sweeter…“Love at First Spite had me hooked from the first page! The playful banter, steamy love scenes, and delightful cast of secondary characters made this debut an unputdownable read.”—Alexandria Bellefleur, author of Written in the Stars“Love at First Spite delivers on every level with humor, heat, and heart. Collins has crafted characters I was so delighted to spend time with, and whose love story was full of emotion and sparkling sexual tension.”—Denise Williams, author of How to Fail at Flirting",
  "genres": [
    "Romance",
    "Contemporary",
    "Audiobook",
    "Contemporary Romance",
    "Fiction",
    "Enemies To Lovers",
    "Chick Lit"
  ],
  "author": "Anna E. Collins",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/58262280-love-at-first-spite"
}