{
  "title": "The Tobacco Wives",
  "description": "For the audience of Fiona Davis and Lisa Wingate, a vibrant historical debut set in 1946 North Carolina following a young female seamstress who uncovers dangerous truths about the Big Tobacco empire ruling the American South.“Myers brilliantly seduces us with her setting—a North Carolina town of beautiful socialites, opulent dresses, and elegant soirees—before revealing a terrible secret that threatens the entire community. This is a story of courage, of women willing to take a stand in the face of corporate greed, and most definitely a tale for our times.” —Fiona Davis, New York Times bestselling author of The Lions of Fifth AvenueMaddie Sykes is a burgeoning seamstress who’s just arrived in Bright Leaf, North Carolina—the tobacco capital of the South—where her aunt has a thriving sewing business. After years of war rations and shortages, Bright Leaf is a prosperous wonderland in full technicolor bloom, and Maddie is dazzled by the bustle of the crisply uniformed female factory workers, the palatial homes, and, most of all, her aunt’s glossiest clientele: the wives of the powerful tobacco executives.When a series of unexpected events thrusts Maddie into the role of lead dressmaker for the town’s most influential women, she scrambles to produce their ornate gowns for the biggest party of the season. But she soon learns that Bright Leaf isn’t quite the carefree paradise that it seems: A trail of misfortune follows many of the women, including substantial health problems. Although Maddie is quick to believe that this is a coincidence, she inadvertently uncovers evidence that suggests otherwise.Maddie wants to report what she knows, but in a town where everyone depends on Big Tobacco to survive, she doesn’t know who she can trust—and fears that exposing the truth may destroy the lives of the proud, strong women with whom she has forged strong bonds.Shedding light on the hidden history of women’s activism during the post-war period, at its heart, The Tobacco Wives is a deeply human, emotionally satisfying, and dramatic novel about the power of female connection and the importance of seeking truth.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Audiobook",
    "Historical",
    "Coming Of Age",
    "Southern"
  ],
  "author": "Adele Myers",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/58262041-the-tobacco-wives"
}