{
  "title": "Getting Shit Done: The No-Nonsense Framework for Closing the Strategy-Execution Gap",
  "description": "Organizations continue to struggle to achieve their strategies. Although organizations and industries can identify what needs to change, most strategy-execution efforts fail. Those strategy executions that don’t fail outright will limp forward. Staggering price tags, incomplete deliverables, and a demoralized workforce usually lie in the wake of many change efforts. Not that this is a new problem, but the pace of competition and innovation today has substantially raised the stakes of the game. What worked yesterday may not work today, and an organization needs to be dynamic enough to choose new courses of action and make them a reality.Enough already.Closing the strategy execution gap starts by acknowledging that execution is a distinctive discipline and skill set built over time. By learning how to set better targets, align resources, lead at all levels, deliver results, and build controls around processes, we learn to build a system that ensures what gets done, stays done.What will reading Getting Shit Done do for me? 5.0 out of 5 stars Must Read on Strategic PlanningReviewed in the United States on July 1, 2021Verified PurchaseThe book provides a framework of 13 stages on how to move successfully from Strategy to Execution. Ben Wann (Author) does an excellent job providing details on why many companies are not successful in executing their objectives. I love how the book discusses involving people at all levels in shaping the strategy. If the plans are simply created by executives the company misses out on the vast amount of knowledge from the other employees. Also, lower-level employees may struggle with motivation to carry out targets they themselves did not set.Ben also touches on the fact that many initiatives fail because there is not a clear picture of who will do what and by when. In the book he reinforces the point on 3 questions that must be answered to ensure success.1. What needs to be done?2. Who is going to do it?3. When is it going to be done?I highly recommend this book for current leaders/managers and those aspiring to grow in their career. Ben has written this book through his own experience as well as extensive research. Simply reading the sources list in the back of the book helps you appreciate the level of research by him.This book is a must-read as we now have a framework to close the strategy-execution gap.",
  "genres": [],
  "author": "Benjamin  Wann",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/58262679-getting-shit-done"
}