{
  "title": "The Lotus Blossom - A Novel About Waking Up",
  "description": "Madison Albright is a girl who hates her name. She has noticed that many of the girls in her school, including herself, were given names like Madison, Taylor, Reagan and Carter that happen to be the names of mostly dead presidents. At school she participates in a texting social network that she calls Gossipedia where reputations and social credit scores are slashed at the speed of thumbs.On the invitation of a classmate, Megan Laskowitz, an unusually confident young woman who rides a bright yellow motorcycle to school, Madison and her friend Beth break a few rules and venture into the city to a hookah bar. There they meet a group of teenagers that spend their time racing motorcycles through the streets of St. Louis and training in the martial arts. As she is returning to her car, Madison sees a light on in a shop window on a side street and decides to check it out. Inside she meets Rinchen, the unusual martial arts and meditation master at Byakuren (White Lotus) Dojo.After being brutally attacked after a party in her supposedly safe suburb, Madison defeats the would-be rapist and classmate by using a very simple technique that Rinchen had taught her merely for the purposes of demonstration. Not only does she defeat her assailant, but in the process unleashes her own furious and hateful attack on him. Ultimately, her attacker kills himself leaving Madison to contemplate the implications of power, war and what it really means to be a warrior.Madison starts to train at the dojo and discovers a whole new way of life based on discipline, hard work, respect, courage and compassion. Rinchen gives her the nickname “Lhamo”, a Tibetan name for the wrathful female deity that protects the Buddhist world. Over time, she loses interest in her old life of cellphones, reality TV and the tsunami of useless information that swamps her generation. Her eyes open to the real condition of people, the smell of the air she breathes and a thousand other nuances that go unnoticed by many of her peers. As she digs deeper into to her own mind, she comes to see a world where nuns fight to protect battered women, where teenagers meditate on art and friends refuse to trash others behind their backs. Over time, she finds herself surrounded by vajra masters, budo warriors and other deeply inspired teachers that show her that in order for her to really love her life, she will have to take stand. The Lotus Blossom is the story of a young woman’s journey to define her own nobility in an era where character has been replaced by a personal marketing plan.",
  "genres": [],
  "author": "D.M. Kenyon",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/12772831-the-lotus-blossom---a-novel-about-waking-up"
}