{
  "title": "Talking to Canadians",
  "description": "Canada’s beloved comic genius tells his own story for the first time. What is Rick Mercer going to do now? That was the question on everyone’s lips when the beloved comedian retired his hugely successful TV show after 15 seasons—and at the peak of its popularity. The answer came not long after, when he roared back in a new role as stand-up-comedian, playing to sold-out houses wherever he appeared. And then Covid-19 struck. And his legions of fans began asking again: What is Rick Mercer going to do now? Well, for one thing, he’s been writing a comic masterpiece. For the first time, this most private of public figures has turned the spotlight on himself, in a memoir that’s as revealing as it is hilarious. In riveting anecdotal style, Rick charts his rise from highly unpromising schoolboy (in his reports “the word ‘disappointment’ appeared a fair bit”) to the heights of TV fame. Along the way came an amazing break when, not long out of his teens, his one-man show Show Me the Button, I’ll Push It. Or, Charles Lynch Must Die, became an overnight sensation—thanks in part to a bizarre ambush by its target, Charles Lynch himself. That’s one story you won’t soon forget, and this book is full of them. There’s a tale of how little Rick helped himself to a tree from the neighbours’ garden that’s set to become a new Christmas classic. There’s Rick the aspiring actor, braving “the scariest thing I have ever done in my life” by performing with the Newfoundland Shakespeare Company; unforgettable scenes with politicians of every variety, from Jean Chretien to George W. Bush to Stockwell Day; and a wealth of behind-the-scenes revelations about the origins and making of This Hour Has 22 Minutes, Made in Canada, and Talking to Americans. All leading of course to the greenlighting of that mega-hit, Rick Mercer Report . . . It’s a life so packed with incident (did we mention Bosnia and Kabul?) and laughter we can only hope that a future answer to “What is Rick Mercer going to do now?” is: “Write volume two.”",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Canada",
    "Audiobook",
    "Humor",
    "Autobiography"
  ],
  "author": "Rick   Mercer",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/58254451-talking-to-canadians"
}