{
  "title": "Not Happening Again",
  "description": "From USA Today bestselling author A. M. Madden comes a love-versus-lust, unplanned-relationship, stand-alone novel about a romance author who learns that “commitment free” can be anything but.Some think that every romance author leads a hearts-and-rainbows existence.But in my case, they’re wrong.Sure, I’ve had my share of relationships . . . and heartbreak. But who needs the hassle? I prefer to leave love and emotions for my books, because that way I won’t get hurt. And my beliefs provide a stress-free and fun personal life.So, when a chance encounter with my best friend’s brother-in-law puts me on his radar, and we end up at his place, logic smacks me hard. He is the “love ’em and leave ’em” type. But I’m the one who runs—and I’m the one who claims it won’t happen again.Until encounter number two occurs. Hey, a woman has needs too.To say he’s hot would be an understatement. But with his looks comes a level of cockiness usually found only between the pages of steamy novels. And just like a character in my fictional tales, the ever-confident walking orgasm makes me an offer I can’t refuse.I decide to indulge in Nate Navarro provided I do so in moderation, on my terms, with a modicum of control. He’s my chance to get lost in lust, and you better believe I jump on it.Who cares that he’s known as a serial bachelor who shuns the notion of love? I don’t. Nor do I get hung up on the fact that the very successful divorce lawyer contradicts my own hearts-and-rainbows profession. It’s just sex. Besides, being with him fits my own agenda perfectly, since he wants a passionate, no-strings-attached arrangement.Until it becomes more than just sex, more than just an arrangement . . . for me at least.For him, nothing has changed.I am such an idiot.Not Happening Again is book 2 in the stand-alone series, Navarro Triplets.Not According to Plan - Max's bookNot Happening Again - Nate's bookNot a Chance in Hell - Brad's bookWarning: This book is meant for mature readers who are 18+. It contains explicit language and graphic sexual content.",
  "genres": [
    "Audiobook",
    "Contemporary",
    "Romance"
  ],
  "author": "A.M. Madden",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/58289690-not-happening-again"
}