{
  "title": "Ghost Stories And The Unexplained",
  "description": "Imagine that you are seven years old – a mere child – alone in the house after your parents leave for work. The clock on the mantle ticks loudly, ominously counting off the seconds. Tick. Tock. Tick. Tock.Quite suddenly, your ears are pricked by the sound of chains dragging heavily across the floor and down the long hallway of your parent’s home. The chains seem to clank and tangle as they cross the threshold from The Beyond. Terror surges through your body, you are barely breathing. Your vision sharpens. You watch as down the dark hallway that leads to your parent’s bedroom a translucent figure begin to materialize. You recognize the manifestation as your grandfather who has passed over. Shrinking away from the vision you gaze in fascination as the specter roams the house, one room at a time, through the living room and into each of the bedrooms. It is seemingly unaware of your existence – as though it is on a plane wholly separate from yours. Has the spirit of your grandfather come back to reassure himself that all he has left behind is secure? How soon will he depart, and release you from the terror of the possibility that he has left the portal open to the World Beyond?On your sixteenth birthday you hold the clammy fingertips of your classmates at a slumber party séance, having waited until midnight to summon the power of The Ouija. Your friends gasp as the candles that throw shadows across the room flicker and the lens into The Other World begins to sweep across the board.In the crypt-like quiet that follows midnight you watch from across your room as the doorknob of your bedroom door turns, almost imperceptibly. It creaks ever so slightly, rattling in its casing. You know that it is not a human presence that has come a'callin' – a human would most certainly would have been caught by the alarm system.You don’t think these occurrences could ever happen? Think again. Because they do happen; and they have happened to me. I remember each incident vividly.Ghost Stories…And The Unexplained, is a collection of contemporary ghost stories that recount my own experiences with The Unexplained supernatural occurrences in my life.Seven Stories. 11,000 words.",
  "genres": [],
  "author": "Emily Hill",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/12773563-ghost-stories-and-the-unexplained"
}