{
  "title": "The Emergency: A Year of Healing and Heartbreak in a Chicago ER",
  "description": "The riveting, pulse-pounding story of a year in the life of an emergency room doctor trying to steer his patients and colleagues through a crushing pandemic and a violent summer, amidst a healthcare system that seems determined to leave them behind As an emergency room doctor working on the rapid evaluation unit, Dr. Thomas Fisher has about three minutes to spend with the patients who come into the South Side of Chicago ward where he works before directing them to the next stage of their care. Bleeding: three minutes. Untreated wound that becomes life-threatening: three minutes. Kidney failure: three minutes. He examines his patients inside and out, touches their bodies, comforts and consoles them, and holds their hands on what is often the worst day of their lives. Like them, he grew up on the South Side; this is his community and he grinds day in and day out to heal them.Through twenty years of clinical practice, time as a White House fellow, and work as a healthcare entrepreneur, Dr. Fisher has seen firsthand how our country's healthcare system can reflect the worst of society: treating the poor as expendable in order to provide top-notch care to a few. In The Emergency,  Fisher brings us through his shift, as he works with limited time and resources to treat incoming patients. And when he goes home, he remains haunted by what he sees throughout his day. The brutal wait times, the disconnect between hospital executives and policymakers and the people they're supposed to serve, and the inaccessible solutions that could help his patients. To cope with the relentless onslaught exacerbated by the pandemic, Fisher begins writing letters to patients and colleagues--letters he will never send--explaining it all to them as best he can.As fast-paced as an ER shift, The Emergency has all the elements that make doctors' stories so compelling--the high stakes, the fascinating science and practice of medicine, the deep and fraught interactions between patients and doctors, the persistent contemplation of mortality. And, with the rare dual perspective of somebody who also has his hands deep in policy work, Fisher connects these human stories to the sometimes-cruel machinery of care. Beautifully written, vulnerable and deeply empathetic, The Emergency is a call for reform that offers a fresh vision of health care as a foundation of social justice.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Medicine",
    "Medical",
    "Health",
    "Audiobook",
    "Biography"
  ],
  "author": "Thomas         Fisher",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/58284097-the-emergency"
}