{
  "title": "The Unfinished Autobiography of Aileen Wuornos",
  "description": "A letter correspondence over many years between Aileen and her best friend from childhood Dawn was collated into a book, in the order the letters were sent.Mixed into the letters were long essays about her life on the road which she asked Dawn to keep safe encase she ever wrote enough that she could start knocking it into an autobiography.As I was reading it, I found her experiences of the time she lived through so fascinating that I wanted to save each one and see it in perspective to her other memories in the timeline of her life.So that’s what I’ve done here. And if it’s useful in the future to anyone’s creative pursuits, like writing non-fiction plays or graphic novels, essay reflections on her life, the 70s, or even fictional stories with characters based on Aileen, then all the better.I first discovered Aileen’s story through Nick Broomfield’s documentary, ‘The Life And Death Of A Serial Killer’ which gave an in-depth look into the tortured childhood she came from.The myopic reason it resonated with me is the very tenuous comparison I saw between myself and Aileen, in that she had been setting off hitchhiking and living on communes since the age of 15 with the hope of doing some psychological healing from the circle she was stuck moving in in Troy, Michigan, where she grew up. And that this was a very romanticized road to take at the time, although I don’t think Aileen bought into all of that, as she was simply homeless from the age of 13, and traveling further afield was a nice break from relying on friends in Troy. But, she loved the hippie music of the era and cherished every commune she stayed at for the people who attempted a new more compassionate way of relating to one another.So for me, that was activist circles, and it left me with the understanding that you don't get a choice in the strange situational reasons that different people will be alienated from society enough to join this or that campaign, but you can make the best of the journey all the same.I’ll include a forward by Hunter S. Thompson on the hippie counter-culture for this reason anyway. Then the rest is almost all Aileen, with just a few excerpts from interviews in the documentary.Finally here are Aileen’s words on her attempts to write this autobiography from jail:This is being done like Sound off. But of course like I said, real brief, hitting area’s most important. Like looks and character, on Mom, Dad, Lori, Barry, Keith, then to me, and the life I lead. That’s going to be really hard to be brief. Do you know how much I’ve seen?! Geez! But, I’ll get through. And must, before I should die soon.I am really close to God. Read the Bible three times all the way through. And even in my young and road days, I got into God (Jesus) and my heart was as good then it as it is now. Even though I became a pro in being a prostitute I still believed on the road anyway, and always willing to give a helping hand to anyone, even “strangers” because of my experiences from my young days and how I was treated. I cannot elaborate how many times sex was forced upon me, but when I do get some time down the road to get a book out. It is going to be about my life, not these crimes. And how people should NOT treat each other like this.--- Disclaimers ---Putting this together is not an endorsement of Aileen’s views or actions, she was failed by society and as a result, was a danger to that society in return. And even though reading stories of her beating up a homophobe or escaping juvenile detention is heartwarming, the way in which she was a danger was by no means always good. She killed for money, was a hateful racist, a controlling abusive partner, and abused animals through neglect.So, bear all that in mind when you’re reading & obviously be very skeptical of whether some of the claimed facts & narratives are even true. I'm not claiming to own the copyright or seeking to earn money from the original letters.I grammar and spell corrected it, as Aileen was not very literate, it would have been a torturous read otherwise for many. But, if you want to see the letters preserved with their original spelling, you can simply read the book, Dear Dawn. And if you're simply curious to cross-reference where a specific paragraph from a story fits into the original letter, you can copy a rare word or sentence, pull up an e-book of Dear Dawn, hit Ctrl+F, and paste to see.Finally, I don’t know what genre this would fall into, but I think it’s fairly close to arriving at what her autobiography might have looked like, had she desired to or been mentally well enough to finish filling in key moments, with a ghostwriter to help. So, unfinished memoir or biography maybe? You decide.",
  "genres": [
    "True Crime"
  ],
  "author": "Theo Slade",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/58267697-the-unfinished-autobiography-of-aileen-wuornos"
}