{
  "title": "The Vaccine: Inside the Race to Conquer the COVID-19 Pandemic",
  "description": "The dramatic story of the married scientists who founded BioNTech and developed the first vaccine against the COVID-19 pandemic.Nobody thought it was possible. In mid-January 2020, Ugur Sahin told Özlem Türeci, his wife and decades-long research partner, that a vaccine against what would soon be known as COVID-19 could be developed and safely injected into the arms of millions before the end of the year. His confidence was built upon almost thirty years of research. While working to revolutionize the way that cancerous tumors are treated, the couple had explored a volatile and overlooked molecule called messenger RNA; they believed it could be harnessed to turn the human body into its own pharmacy. As the founders of BioNTech, they faced widespread skepticism from the scientific community at first; but by the time Sars-Cov-2 was discovered in Wuhan, BioNTech was prepared to deploy cutting edge technology and create the world’s first approved inoculation for the coronavirus.The Vaccine draws back the curtain on one of the most important medical breakthroughs of our age; it will reveal how Doctors Sahin and Türeci were able to develop twenty vaccine candidates within weeks, convince Big Pharma to support their ambitious project, navigate political interference from the Trump administration and the European Union, and manage to provide more than two billion doses of the Pfizer/BioNTech vaccine to countries around the world in record time.Written by Joe Miller—the Financial Times’ Frankfurt correspondent who covered BioNTech’s COVID-19 project in real time—with contributions from Sahin and Türeci, as well as interviews with more than 50 scientists, politicians, public health officials, and BioNTech staff, the book covers key events throughout the extraordinary year, as well as exploring the scientific, economic, and personal background of each medical innovation. Crafted to be both completely accessible to the average reader and filled with details that will fascinate seasoned microbiologists, The Vaccine explains the science behind the breakthrough, at a time when public confidence in vaccine safety and efficacy is crucial to bringing an end to this pandemic.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Medicine",
    "Health",
    "Medical",
    "Biography"
  ],
  "author": "Joe Miller",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/58271538-the-vaccine"
}