{
  "title": "SPEECH! How Language Made Us Human",
  "description": "Praise from STEPHEN FRY: \"A book to make you cry out 'Yes, yes, yes!' SPEECH! is an utterly enthralling voyage into the very heart of what makes us human. To put it simply, Simon Prentis gets it. He gets that language is, above everything else, the key to understanding ourselves, our past and our future. But he gets something else too - fascinating, illuminating, thrilling as his voyage may be, it is above all urgent.\"\"Stands with Steven Pinker and James Lovelock as a 'must-read' for our times.\" - JOHN GRIBBIN\"I couldn't stop reading until I finished it. This book should be widely read!\" - JAMES LOVELOCK\"I'm glad to have read it. A literate and stylish writer.\" - RICHARD DAWKINS\"Subtle, erudite and profoundly thought-provoking.\" - NICHOLAS CRANE \"Such an imaginative and scholarly work.\" - SIR ANTHONY SELDON\"Reading for both pleasure and research.\" - RICKY GERVAIS\"Bravo! A compelling read.\" - YOKO ONO LENNON\"I think you're right.\" - STEVEN PINKERWhat makes us human? Why are we the only animals who wear clothes, surf social media, and send robots to Mars? It’s all because we’ve learnt to yet remarkably, we still don’t know how we did it. SPEECH! suggests an answer that’s been hiding in plain sight – a simple yet radical shift that turned our primitive grunts and shrieks to words. But the consequences were far from simple, for language was an evolutionary tipping it gave us the power to share ideas and pass on knowledge. SPEECH! traces our roller-coaster ride from hunter-gatherer to urban hipster – the epic tale of humanity’s struggle to escape the traps of culture, religion and identity. That journey leaves us on the brink of a destiny we may still resist, but must now learn to embrace if we are to survive…About the author: Simon Prentis has spent a lifetime working with other cultures and languages in over fifty countries. A veteran translator and interpreter of Japanese, his clients have ranged from government departments and academic and international institutions to cultural icons like Paul McCartney, Stanley Kubrick, Frank Zappa and Yoko Ono.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Linguistics",
    "Language",
    "Medicine",
    "Science"
  ],
  "author": "Simon Prentis",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/58274420-speech-how-language-made-us-human"
}