{
  "title": "Winged Darkness",
  "description": "Sequel to Winged Victory .Zurellius, winged ruler of Valtar, haunts the crystal ruins of the Ancients looking for the cure to his race’s survival. During his search he exposed himself to the Ancients’ greatest evil. Now his strength grows daily, but his emotions verge on violent insanity. His personal sacrifice will ensure Valtar’s survival even though it will cost him his soul and most likely his life.Mona de’Lacy has violated Valtar’s forbidden air space to get her listing warship repaired. Her mission: to tell Zurellius his brother and sister-in-law were kidnapped by pirates and to deliver his half-breed niece to him for protection. A constant flame of hatred burns inside Mona. The pirates who attacked Da’tarn killed her husband and son. As soon as her ship is repaired she’ll search for the pirate leader Synika and kill him.But Mona doesn’t count on Zurellius’s threatening beauty or his ominous sexual pull. She’s sure her reaction to him is caused by his mesmerizing eyes and compelling voice—the very Valtarie traits that banned his planet of winged vampires from the Alliance.She also hasn’t planned on Zurellius insisting he come with her on her mission to rescue Da’tarn’s kidnapped residents. During their journey, Zurellius unleashes the evil dwelling within him and becomes the monster that made his race the most feared in the universe. Mona soon realizes she and Zurellius share a bond—they’re two damned souls with no hope of salvation.Can Mona open her heart to the demon he has become? Can she bring him back from the brink of Hell? Or will she have to watch him be executed by the Alliance?L.F. Hampton is a Southern California writer living with her husband and two rescued fur babies. She has worked in a variety of careers ranging from library clerk to a major city's first female business license inspector to a nail shop owner. But, her passion is creating new worlds filled with aliens in fantasy situations of intrigue and romance. She has a deep love of anything mystical, and her love of writing is only surpassed by her love of reading.",
  "genres": [
    "Vampires",
    "Science Fiction Romance"
  ],
  "author": "L.F. Hampton",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/5827724-winged-darkness"
}