{
  "title": "Tagging Up",
  "description": "All Anna Callahan wants is her independence.Being the youngest member of her immediate family, and massive network of cousins, she’s always been sheltered. That ends now. After graduating with her masters in nursing, she’s ready to move out of her parents’ house, whether they support that decision or not. While wallowing in the guilt of that choice at the local bar, she bumps into the one guy she shouldn’t go near.A player for her family’s team and her cousin’s best friend, Clark should come with a warning label. Not only because he’s the league’s number one playboy, but because he’s significantly older than her. Unfortunately, they can’t seem to keep their hands off of each other. That initial night together leads to scorching glances across public parties, secret hookups in hidden places, and way more than either of their hearts bargained for.But being with Clark means lying to those closest to them. When their secret is finally discovered, it sends the already skittish bad boy running for the hills. And although she claimed to want freedom with no strings, Anna can’t help but feel the sharp pull to be with him forever.Clark Nyle swore a long time ago he’d never be committed to anyone.After watching his mother ruin his father through adultery and abandonment, he knows that love is for masochists and he certainly isn’t one. Baseball and living life like every day’s a party are his only two passions.Then his father dies, and he’s forced to question everything. It leads to a barstool, too many drinks, and into the backseat of his car with the one woman he should never have touched.Now that he’s gotten a taste of Anna, he can’t stay away. Even if their secret affair comes with way too many consequences. Her family owns the team he plays for, not to mention his best friend would cut off his balls if he knew what they were up to. Plus, he doesn’t want anything long-term, and eventually he’s going to break her heart.But the more time he spends with her, the more he seems to want a different future than the one he always planned on. Until they’re found out, and he’s forced to choose between his demons and the disapproval of his closest friends … or her.",
  "genres": [
    "Sports Romance",
    "Sports",
    "Baseball",
    "Romance",
    "Contemporary Romance",
    "Small Town Romance"
  ],
  "author": "Carrie Aarons",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/58273494-tagging-up"
}