{
  "title": "Paradise Falls: The True Story of an Environmental Catastrophe",
  "description": "The staggering story of an unlikely band of mothers in the 1970s who discovered Hooker Chemical's deadly secret of Love Canal--exposing one of America's most devastating toxic waste disasters and sparking the modern environmental movement as we know it today.Lois Gibbs, Luella Kenny, and other mothers loved their neighborhood on the east side of Niagara Falls. It had an elementary school, a playground, and rows of affordable homes. But in the spring of 1977, pungent odors began to seep into these little houses, and it didn't take long for worried mothers to identify the curious scent. It was the sickly sweet smell of chemicals.In this propulsive work of narrative storytelling, NYT journalist Keith O'Brien uncovers how Gibbs and Kenny exposed the poisonous secrets buried in their neighborhood. The school and playground had been built atop an old canal--Love Canal, it was called--that Hooker Chemical, the city's largest employer, had quietly filled with twenty thousand tons of toxic waste in the 1940s and 1950s. This waste was now leaching to the surface, causing a public health crisis the likes of which America had never seen before and sparking new and specific fears. Luella Kenny believed the chemicals were making her son sick.O'Brien braids together previously unknown stories of Hooker Chemical's deeds; the local newspaperman, scientist, and congressional staffer who tried to help; the city and state officials who didn't; and the heroic women who stood up to corporate and governmental indifference to save their families and their children. They would take their fight all the way to the top, winning support from the EPA, the White House, and even President Jimmy Carter. By the time it was over, they would capture America's imagination.Sweeping and electrifying, Paradise Falls brings to life a defining story from our past, laying bare the dauntless efforts of a few women who--years before Erin Brockovich took up the mantle-- fought to rescue their community and their lives from the effects of corporate pollution and laid foundation for the modern environmental movement as we know it today.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Environment",
    "True Crime",
    "Audiobook",
    "Politics"
  ],
  "author": "Keith  O'Brien",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/58284109-paradise-falls"
}