{
  "title": "Price of a Bounty",
  "description": "Keira Maddock has never considered herself a lady. In fact, she often acts in ways that would be considered downright un-ladylike. A hired killer and thief whose only goal is to provide the necessities of life for herself and her sister, she has learned to be brutally effective in her trade, with skills as sharp as the weapons she prefers. And when the head of a huge, shadowy corporation hires her to remove a powerful and wealthy opponent, Keira is happy to oblige. Until she meets him... Scott Maddock is a hardened Terenian soldier-for-life. His job, to uphold the motto of the realm: \"Reliance on Citizens Makes Us Great!\" Soldiers work for the Gov, and the Gov is run by heads of corporations. But where do Scott's loyalties really lie? Only he and his best friend know for sure. April Maddock is trying to make it on her own and has taken a job with a wealthy family. She has chosen not to fight the system like Keira, nor to fight for the Gov like Scott. Unlike her siblings, she recognizes the good in everyone. Even so, outside appearances can be deceiving. April knows that better than most. Infested with greed and divided by power, the realm of Terene bears remarkable resemblance to our own society. But opposite despair, there is always hope. Whereas Keira Maddock brings destruction, Guy Bensen brings promise. Wealthy and powerful, yet thoughtful and caring, he is an anomaly who throws her completely off guard. When she learns of his connections to Scott and April, Keira knows she has made the right decision in not only sparing his life but in joining his cause. In book one of the Reliance on Citizens trilogy, S. L. Wallace introduces a world divided in which not everyone is who he seems to be. In a seamless blend of action, sci-fi, romance and political suspense, we are encouraged to consider the bonds that makes us human.",
  "genres": [
    "Dystopia",
    "Science Fiction",
    "Fiction"
  ],
  "author": "S.L. Wallace",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/12774270-price-of-a-bounty"
}