{
  "title": "Run Towards the Danger: Confrontations with a Body of Memory",
  "description": "Oscar-nominated screenwriter, director, and actor Sarah Polley's Run Towards the Danger explores memory and the dialogue between her past and her presentThese are the most dangerous stories of my life. The ones I have avoided, the ones I haven't told, the ones that have kept me awake on countless nights. As these stories found echoes in my adult life, and then went another, better way than they did in childhood, they became lighter and easier to carry.Sarah Polley's work as an actor, screenwriter, and director is celebrated for its honesty, complexity, and deep humanity. She brings all those qualities, along with her exquisite storytelling chops, to these six essays. Each one captures a piece of Polley's life as she remembers it, while at the same time examining the fallibility of memory, the mutability of reality in the mind, and the possibility of experiencing the past anew, as the person she is now but was not then. As Polley writes, the past and present are in a \"reciprocal pressure dance.\"Polley contemplates stories from her own life ranging from stage fright to high-risk childbirth to endangerment and more. After struggling with the aftermath of a concussion, Polley met a specialist who gave her wholly new advice: to recover from a traumatic injury, she had to retrain her mind to strength by charging towards the very activities that triggered her symptoms. With riveting clarity, she shows the power of applying that same advice to other areas of her life in order to find a path forward, a way through. Rather than live in a protective crouch, she had to run towards the danger. \n\nIn this extraordinary book, Polley explores what it is to live in one's body, in a constant state of becoming, learning, and changing.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Essays",
    "Audiobook",
    "Canada",
    "Biography",
    "Book Club"
  ],
  "author": "Sarah Polley",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/58284103-run-towards-the-danger"
}