{
  "title": "Scoundrel: How a Convicted Murderer Persuaded the Women Who Loved Him, the Conservative Establishment, and the Courts to Set Him Free",
  "description": "From the author of The Real Lolita and editor of Unspeakable Acts, the astonishing story of a murderer who conned the people around him--including conservative thinker William F. Buckley--into helping set him freeIn the 1960s, Edgar Smith, in prison and sentenced to death for the murder of teenager Victoria Zielinski, struck up a correspondence with William F. Buckley, the founder of National Review. Buckley, who refused to believe that a man who supported the neoconservative movement could have committed such a heinous crime, began to advocate not only for Smith's life to be spared but also for his sentence to be overturned.So begins a bizarre and tragic tale of mid-century America. Sarah Weinman's Scoundrel leads us through the twists of fate and fortune that brought Smith to freedom, book deals, fame, and eventually to attempting murder again. In Smith, Weinman has uncovered a psychopath who slipped his way into public acclaim and acceptance before crashing down to earth once again.From the people Smith deceived--Buckley, the book editor who published his work, friends from back home, and the women who loved him--to Americans who were willing to buy into his lies, Weinman explores who in our world is accorded innocence, and how the public becomes complicit in the stories we tell one another.Scoundrel shows, with clear eyes and sympathy for all those who entered Smith's orbit, how and why he was able to manipulate, obfuscate, and make a mockery of both well-meaning people and the American criminal justice system. It tells a forgotten part of American history at the nexus of justice, prison reform, and civil rights, and exposes how one man's ill-conceived plan to set another man free came at the great expense of Edgar Smith's victims.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Audiobook",
    "Biography",
    "Mystery"
  ],
  "author": "Sarah Weinman",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/58283071-scoundrel"
}