{
  "title": "Guardians of Mayhem MC & Guardians of Mayhem MC: Santa Fe Chapter Books 1-10",
  "description": "MC ROMANCE NOVELLAS WITH A HEALTHY DOSE OF NAUGHTY⭐⭐⭐⭐⭐ \"One of my favorite MC series. LOVE these guys!\"I’m the eyes and ears of the club. I’m the son of a gun...My dead father left me in charge and I take the job seriously. I have to know who, what, how and when. That’s the Sergeant code.So when the Devils come knocking trying to steal our guns, we have shut them down, and let them know we’re the club that runs Edgewood.I never knew the striking redhead, Chloe, from back in the day that well, but we were about to be reacquainted. Pity she was off limits.With a newly formed Albuquerque police task force tracking clubs and the Devils working to infiltrate our network we have our work cut out for us.Will good girl Chloe be able to hold her ground with Finn?Or will she get wrapped up in the mayhem of the Guardians? Books Included In This Box Book 1: FinnBook 2: HavocBook 3: AxleBook 4: RushBook 5: RedBook 6: ShadowBook 7: ShaggyBook 8: HawkBook 9: MaverickBook 10: Mustang What Readers Are Saying About The ★★★★★ \" These alpha men are romantic, fierce protectors; and their women are smart, and feisty. Each novel is a thrilling adventure with danger, suspense, violence, and enough action, twists and turns to make it an intriguing read.\"★★★★★ \"Super hot read! This group of bikers are loyal, fierce and love with their all when they fall. All the books are connected and the storyline flows through this box set.\"★★★★★ \"This is an amazing collection of stories that will captivate you from beginning to end. This is a well written and very entertaining book. I would recommend this book to any book lover.\"★★★★★ \"Every time a book in the Guardians of Mayhem series is released, I say it’s my favorite. They are all just that good!\"★★★★★ \"This is an absolute bargain for the countless hours of entertainment that it will provide.\" SCROLL UP AND GRAB YOUR COPY TODAY - THE GUARDIANS ARE WAITING!Read ALL TEN books FREE with KU",
  "genres": [],
  "author": "Hope Stone",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/58307151-guardians-of-mayhem-mc-guardians-of-mayhem-mc"
}