{
  "title": "Both/And: A Memoir",
  "description": "A New York Times bestseller, this extraordinary memoir from Huma Abedin—Hillary Clinton’s famously private top aide and longtime advisor—offers “a gripping testament to the power of a woman finding her voice, owning her ambition, and sharing her truth” (Glennon Doyle).Abedin’s stunning memoir garnered an extraordinary amount of media coverage, with appearances on CBS Sunday Morning , the Today show, The Late Show with Stephen Colbert , The View , Late Night with Seth Meyers , Christiane Amanpour, and coverage in many other outlets, including The Washington Post , The New York Times , and NPR.The daughter of Indian and Pakistani intellectuals and advocates, Abedin grew up in the United States and Saudi Arabia and traveled widely. Both/And grapples with family, legacy, identity, faith, marriage, motherhood—and work—with wisdom, sophistication, grace, and clarity.Abedin launched full steam into a college internship in the office of the First Lady in 1996, never imagining that her work at the White House would blossom into a career in public service, nor that her career would become an all-consuming way of life. She thrived in rooms with diplomats and sovereigns, entrepreneurs and artists, philanthropists and activists, and witnessed many crucial moments in 21st-century American history—Camp David for urgent efforts at Middle East peace in the waning months of the Clinton administration, Ground Zero in the days after the September 11 attacks, the inauguration of the first African American president of the United States, and the convention floor when America nominated its first female presidential candidate.Abedin’s relationship with Hillary Clinton has seen both women through extraordinary personal and professional highs, as well as unimaginable lows. Here, for the first time, is a deeply personal account of Clinton as mentor, confidante, and role model. Abedin cuts through caricature, rumor, and misinformation to reveal a crystal-clear portrait of Clinton as a brilliant and caring leader, a steadfast friend, generous, funny, hardworking, and dedicated.Both/And is “the story of a person of substance—someone determined to tell her own story” ( The New York Times ) including the heartbreaking chronicle of her marriage to Anthony Weiner, what drew her to him, how much she wanted to believe in him, the devastation wrought by his betrayals—and their shared love for their son.Abedin’s journey through the opportunities and obstacles, the trials and triumphs, of a full and complex life is a testament to her profound belief that in an increasingly either/or world, she can be both/and. Abedin’s compassion and courage, her resilience and grace, her work ethic and mission are an inspiration to women of all ages.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Politics",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Huma Abedin",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/58304881-both-and"
}