{
  "title": "Song of Silver, Flame Like Night",
  "description": "In a fallen kingdom, one girl carries the key to discovering the secrets of her nation’s past—and unleashing the demons that sleep at its heart. An epic fantasy series inspired by the mythology and folklore of ancient China.Once, Lan had a different name. Now she goes by the one the Elantian colonizers gave her when they invaded her kingdom, killed her mother, and outlawed her people’s magic. She spends her nights as a songgirl in Haak’gong, a city transformed by the conquerors, and her days scavenging for what she can find of the past. Anything to understand the strange mark burned into her arm by her mother in her last act before she died.The mark is mysterious—an untranslatable Hin character—and no one but Lan can see it. Until the night a boy appears at her teahouse and saves her life.Zen is a practitioner—one of the fabled magicians of the Last Kingdom. Their magic was rumored to have been drawn from the demons they communed with. Magic believed to be long lost. Now it must be hidden from the Elantians at all costs.When Zen comes across Lan, he recognizes what she is: a practitioner with a powerful ability hidden in the mark on her arm. He’s never seen anything like it—but he knows that if there are answers, they lie deep in the pine forests and misty mountains of the Last Kingdom, with an order of practitioning masters planning to overthrow the Elantian regime.Both Lan and Zen have secrets buried deep within—secrets they must hide from others, and secrets that they themselves have yet to discover. Fate has connected them, but their destiny remains unwritten. Both hold the power to liberate their land. And both hold the power to destroy the world. Now the battle for the Last Kingdom begins.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Mythology",
    "Romance",
    "Young Adult Fantasy",
    "Dragons",
    "Fiction"
  ],
  "author": "Amélie Wen Zhao",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/58303740-song-of-silver-flame-like-night"
}