{
  "title": "The Blood Red Game",
  "description": "The Sundered Worlds (retitled The Blood Red Game): The main attraction of this story is the ideas with which it's packed. The Shifter System of eleven planets orbiting around a sun traveling transversely thru the dimensions of the multiverse, phasing into normal space-time for brief periods over many years, a refuge for criminals & others who wish to escape; Roth, the ragged planet, part of the Shifter System, sections of which orbit thru the multiverse in different directions to the others; the Blood-Red Game, a ritual contest of sickness & self-revulsion, played for the highest stakes between humans & aliens of another dimension. Unfortunately the ideas tend to get slightly in the way of the story. At times the natural flow of the action is stopped completely to examine the implications of a situation. This tends to lead to overemphasis on certain parts of the plot, which otherwise, would have been less important. Nonetheless, this book sparkles with ideas & makes interesting reading. We see too that the multiverse of Moorcock has much in common with the inner world of Sellings' The Silent Speakers. These books both show that in sf, the macrocosm ultimately turns out to be identical to the microcosm. Inner space & outer space are in reality the same.--Langdon Jones, New Worlds (edited). 'Renark was born to wander under the diamond glare of a myriad suns. He was never alone because he sensed the power of unseen hands which guided the ebb & flow of the universe. Then, after two years of watching & waiting, he was ready for the great journey to the galactic rim & beyond. There he found himself in the arena of the Blood Red Game. Stakes were high. For the human race it meant extinction or rebirth.'",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Novels",
    "Pulp"
  ],
  "author": "Michael Moorcock",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/583044.The_Blood_Red_Game"
}