{
  "title": ".  جاسوس من أجل لا أحد . ستة عشر عاماً في المخابرات السورية",
  "description": "الكتاب يتحدث عن سيرة الكاتب الذاتية خلال حياته، وخاصة عن عمله في شعبة المخابرات (الأمن العسكري) العائدة للنظام السوري في عهدي حافظ الأسد ثم بشار الأسد، وذلك رغم كونه معارضًا للنظامين المذكورين، وما مر به من أحداث غريبة، وشهاداته على جرائم نظام الأسد، وعن دوره منذ سن الشباب المبكر في تشكيل تنظيم طلابي سري ضد نظام الأسد، وهدفه إسقاطه.وبشكل عام يتحدث عن مذكرات سوريا السياسية والممارسات القمعية والأعمال الأمنية الاستخباراتية ضد الشعب في عهدي الأسدين المجرمين الأب والابن، وعن الثورة السورية المباركة وبداياتها، وعن مشاركة الكاتب فيها منذ بدايتها، ثم اعتقاله وتعرضه للتعذيب، وغيرها من هذا النوع من التفاصيل التي تتعلق بالظلم الرهيب والإضطهاد المريع الذي كان يتعرض له أغلبية الشعب السوري في ذلك الزمان، والتي يعرضها الكاتب ويكشفها للعلن لأول مرة، خاصة لكونه كان مُطلعًا خلال حياته كضابط أمن على ما لا يطلع عليه سوى القليل من الناس من أسرار ذلك النظام.ويتحدث الكتاب أيضا عن سوريا وعن المجتمع السوري ، وعن الثورة السورية ، وعن مجازر مدينة حماه التي ارتكبها نظام المجرم الأسد عام 1982The book:\"Spy for nobody\"very important book, which includes an explanation of the espionage process for the benefit of the Syrian people and against the intelligence services of the Syrian regime that lasted for eighteen years.It is a very interesting book and has great popularity around the world.The book : \"Spy for nobody\" it contains very important information about the massacres of the city of Hama in /1982 / carried out by the regime of the criminal Assad in Syria, which was classified information and with details for the first time revealing to people .It has been chosen by nine of the world's leading universities and USA universities, as well as the Library of Congress of all Arabic and Syrian books as a reference for research and studies About international intelligence services, the Middle East and About Syria, and other topics and addresses . .The author of this book is from Syria , He is an activist and supporter of the Syrian revolution that demanded freedom, which started in 2011. He is a freelance journalist, political analyst, and military and security intelligence expert. his name is:. Basel Saneeb & Al Sannib _.The Book : Spy for nobody .wonderful , distinct, different, the story is very strange and exciting .This book is very interesting and strange. I read it several times. A strange and dangerous and very interesting events passed by the author:\"Basel Saneeb.AL Sannib..\"During his lifetime. He was always in danger, and he had an unprecedented spy experience, and the writer had broken into one of the most evil intelligence agencies in the world. I advise everyone to read this book, ... It is available in Arabic and English. . It is worth reading.The book : spy for nobodyBy: .Basel Saneeb .AL SANNIB.Fantastic book and awesome intelligence adventure.It is a very interesting book with important information. For this reason, the largest and most prestigious universities in the United States have taken that book as a reference for research and in the Library of Congress.I advise you all to read this very important book, the most important book explaining the situation of the Syrian people :The book : spy for nobodyBy : .Basel Saneeb .AL SANNIB.Fantastic book and awesome intelligence adventure. It is a very interesting book with important information. For this reason, the largest and most prestigious universities in the United States have taken that book as a reference for research. I hope someone will turn the book into a movie because it will be a wonderful film very interesting.This writer has two famous books in two different languages, not just one! The two books are:1 - جاسوس من أجل لا أحد . ستة عشر عاماً في المخابرات السورية \"الكاتب :باسل محمد روحي صنيبPublished 2017 by darelnokhbaISBN13 - 9789776580879Edition Language : Arabic .And :\" Spy... for Nobody!: Sixteen Years in the Syrian Intelligence \"by Basel Saneeb (Goodreads Author),Paperback, English Edition, 192 pagesPublished September 27th 2020 by E-KUTUB LtdISBN13 - 9781780585420Edition Language : English.By the same Person and author.Thank you",
  "genres": [
    "Biography",
    "Politics"
  ],
  "author": "صنيب، باسل محمد روحي. ‏باسل محمد روحي صنيب.",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/58294954"
}