{
  "title": "The Wakeful Wanderer's Guide: to Disillusionment",
  "description": "The Second book in the Wakeful Wanderer’s Guide series picks up a few months before the end of book one. It follows the travails of the conquering tyrant, his abandoned spy, the possessed and grieving mother, and the runaway aristocrat, and of course, Marto, among others. Turmoil is brewing for the Interconnected and the Traditionalists alike as a third power emerges.Society is divided along socio-economic and technological-philosophical lines. The Traditionalists eschew invasive technologies in favor of tangible materials. They value the structures of hierarchical systems based on wealth and birth. They long for the return of the grand markets that boomed before a world shaking disaster called The Great Tide wiped them out. Across from this culture are the Interconnected, who have incorporated the world of data, information, and social networks into their bodies. They live in constant communication with each other, mind to mind, and employ a gifting economy based on Merit to maintain their post-scarcity automated economy.Marto, the traveling Interconnected historian, has exiled himself to protect the ones he loves from his dark secret. In his absence, Helen, a runaway Traditionalist aristocrat, struggles to find her place among the Interconnected, unwilling to return to her cruel family. Reyleena, the former head of security in the Interconnected down of Reverside, has returned to a life of quiet solitude, broken occasionally by the impositions of The Other, an omnipresent AI, who cannot leave her alone. Barnabas, the Traditionalist leader of New Atlantic, fights to get back to his town and regain control in the wake of a chaotic attack. Nora, his sister, is trapped in Reverside and must come to terms with her new life in captivity.This middle book of the Wakeful Wanderer’s Guide series delves deeper into the origins of the Interconnected and Traditionalist worlds, and broadens the perspective on both. The Memoria emerges as a force that might dissolve the divisions between these cultures. Old friends hold the key to forward progress or a backslide into disaster. The struggle to control the future of humanity in this near-future America is a battle of cultures, stories, and ideals.",
  "genres": [],
  "author": "Jim Infantino",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/58318531-the-wakeful-wanderer-s-guide"
}