{
  "title": "Wicked, Lovely Magic",
  "description": "A murder threatens to tear apart the delicate balance of power in New Toya, Jo's home city and favorite place in the world. That's already a lot, but a recent death in the family is also threatening to tear apart Jo's own delicate mental health.Given that she's a powerful immortal witch, this has a lot of people worried. Including, if she's honest, Jo herself.But that's fine, it's all fine, Jo will process things her own way (not by taking a week off like people keep suggesting, that’s clearly not going to work, is she just expected to sit quietly and listen to her own thoughts? Her own thoughts?? Does anyone even know what that’s like???) she’ll solve this murder at day and party at night! Police work, one-night-stands and no time to feel the crushing emptiness of grief, it’s the perfect solution!Or it was. Until her first one-night stand is with an elf trying to find ‘The Great Witch Jo’ so she can help track down his missing brother. Oops. Better leg it before he realizes who she is and drags her away from the city she needs like life itself.Oh, and except for the murder, which is not as easy to solve as Jo hoped it would be. It has all the markings of a vampire kill but the vampires are adamant they’re not guilty – of this at least. And they’re not happy that they’re being dragged into this. If Jo keeps asking questions, she’s going to get on the bad side of the vampire Lord Raphael, who granted her a huge favor decades ago that she has (accidentally) not paid back, and she’s fairly sure that’s a debt that has accrued some interest. Also, she finds his aura of power extremely sexy and that’s a desire better left shoved alllllll the way down to the bottom of her psyche, right next to the grief she’s also not thinking about. Better just figure out if someone's trying to frame the vampires or if they're covering up for one of their own. By herself.Oh, and she’s accidentally collected a very cute incubus who’s determined to stick to her like glue. Jo sure hopes he’s not going to exacerbate the situation.As one murder becomes two, Jo realizes she might have less of a ‘perfect solution’ and more of a ‘whole mess that might destroy her fragile mental health and also the entire city.’ Maybe everyone was right. She should have taken a week off.WICKED, LOVELY MAGIC is the start of the new reverse harem paranormal romance series, Witch of Witches! Content warning: graphic sex scenes, multiple partners, consensual light BDSM and voyeurism, some violence.",
  "genres": [
    "Reverse Harem",
    "Vampires",
    "Witches",
    "Fae",
    "Paranormal"
  ],
  "author": "Rosalie Spencer",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/58312969-wicked-lovely-magic"
}