{
  "title": "Whisper",
  "description": "Mʏ ʙʀᴏᴛʜᴇʀ ᴀɴᴅ I ᴡᴇʀᴇ ᴋɪᴅɴᴀᴘᴘᴇᴅ ᴡʜᴇɴ ᴡᴇ ᴡᴇʀᴇ ᴇɪɢʜᴛ & sɪxͯ ʏᴇᴀʀs ᴏʟᴅ.KEN:Fᴏʀ ᴇʟᴇᴠᴇɴ ʏᴇᴀʀs, ᴡᴇ’ᴅ ʙᴇᴇɴ ʟᴏᴄᴋᴇᴅ ᴀᴡᴀʏ. Fᴏʀᴄᴇᴅ ᴛᴏ ᴇɴᴅᴜʀᴇ ᴀʙᴜsᴇ, ᴍᴏʟᴇsᴛᴀᴛɪᴏɴ, ᴀɴᴅ ᴛᴏʀᴍᴇɴᴛ ᴛʜᴀᴛ ᴍᴀᴅᴇ ᴜs ᴡɪsʜ ᴡᴇ ᴡᴇʀᴇ ɴᴇᴠᴇʀ ʙᴏʀɴ. Pᴀx ᴀɴᴅ Vᴇʀɴᴀ, ᴛᴡᴏ ᴏᴛʜᴇʀ ᴠɪᴄᴛɪᴍs, sᴜғғᴇʀᴇᴅ ᴛʜᴇ sᴀᴍᴇ ғᴀᴛᴇ. Iᴛ ᴡᴀs ᴏɴᴇ ᴛʜɪɴɢ ᴛᴏ ʙᴇ ᴍᴏʟᴇsᴛᴇᴅ ᴍʏsᴇʟғ. Iᴛ ᴡᴀs ᴀɴᴏᴛʜᴇʀ sᴇᴇɪɴɢ ᴛʜᴇᴍ ᴇxᴘᴇʀɪᴇɴᴄᴇ ɪᴛ ᴀɴᴅ ɴᴏᴛ ʙᴇ ᴀʙʟᴇ ᴛᴏ ʜᴇʟᴘ ᴛʜᴇᴍ.Wʜᴇɴ ᴡᴇ ғɪɴᴀʟʟʏ ᴇsᴄᴀᴘᴇᴅ, I ᴛʜᴏᴜɢʜᴛ ᴛʜᴀᴛ ᴏᴜʀ ʜᴇʟʟ ᴀɴᴅ ᴘᴀɪɴ ᴡᴇʀᴇ ᴏᴠᴇʀ. I ᴡᴀs ᴡʀᴏɴɢ. Tʜᴇ ʏᴇᴀʀs ᴛʜᴀᴛ ғᴏʟʟᴏᴡᴇᴅ ᴅɪᴅ ɴᴏᴛʜɪɴɢ ʙᴜᴛ ғᴇᴇᴅ ᴍʏ ᴀɴɢᴇʀ ᴀɴᴅ ᴍᴀᴋᴇ ᴍᴇ ᴍᴏʀᴇ ᴘʀᴏᴛᴇᴄᴛɪᴠᴇ ᴏғ ᴍʏ ғᴀᴍɪʟʏ, Vᴇʀɴᴀ ʙᴇᴄᴏᴍɪɴɢ ᴛʜᴇ ʟᴏᴠᴇ ᴏғ ᴍʏ ʟɪғᴇ ᴀɴᴅ ᴍʏ sᴛʀᴏɴɢᴇsᴛ ʀᴇᴀsᴏɴ ᴛᴏ ʟɪᴠᴇ. I’ᴅ ʙᴇᴄᴏᴍᴇ ᴘᴏssᴇssɪᴠᴇ ᴏғ ʜᴇʀ ᴀɴᴅ ᴡᴏᴜʟᴅɴ’ᴛ ʟᴇᴛ ᴀɴʏᴏɴᴇ ʜᴜʀᴛ ʜᴇʀ ᴇᴠᴇʀ ᴀɢᴀɪɴ. Tʜᴇʏ’ᴅ ʜᴀᴠᴇ ᴛᴏ ᴋɪʟʟ ᴍᴇ ғɪʀsᴛ, ʙᴜᴛ ɪᴛ ᴡᴏᴜʟᴅɴ’ᴛ ʙᴇ ᴇᴀsʏ. Nᴏᴛ ᴡʜᴇɴ ᴘᴀʀᴛs ᴏғ ᴍᴇ ᴡᴇʀᴇ ᴀʟʀᴇᴀᴅʏ ᴅᴇᴀᴅ, ᴀɴᴅ ᴇᴠᴇʀʏ ʙʀᴇᴀᴛʜ I ᴛᴏᴏᴋ ᴡᴀs sᴏʟᴇʟʏ ғᴏʀ ʜᴇʀ.VERNA:Eᴠᴇʀ sɪɴᴄᴇ ᴡᴇ ᴡᴇʀᴇ ᴋɪᴅs, Kᴇɴ ʜᴀᴅ ʙᴇᴄᴏᴍᴇ ᴀ ʟᴇᴀᴅᴇʀ ᴛᴏ ᴛʜᴇ ғᴏᴜʀ ᴏғ ᴜs ᴛʀᴀᴘᴘᴇᴅ ɪɴ ᴀ ʜᴏᴜsᴇ ᴏғ ʜᴏʀʀᴏʀs. Aғᴛᴇʀ ᴡᴇ’ᴅ ᴇsᴄᴀᴘᴇᴅ ᴏᴜʀ ᴄᴀᴘᴛᴏʀs, ᴡᴇ ᴄᴏᴜʟᴅɴ’ᴛ ʟᴏᴄᴀᴛᴇ ᴏᴜʀ ᴘᴀʀᴇɴᴛs ᴀɴᴅ ᴡᴇʀᴇ ʀᴇᴊᴇᴄᴛᴇᴅ ʙʏ ᴛʜᴇ ᴡᴏʀʟᴅ ᴛʜᴀᴛ sᴇᴇᴍᴇᴅ ᴛᴏ ғᴏʀɢᴇᴛ ᴜs. Wᴇ ᴡᴀɴᴅᴇʀᴇᴅ ғʀᴏᴍ ᴘʟᴀᴄᴇ ᴛᴏ ᴘʟᴀᴄᴇ, ᴛʀʏɪɴɢ ᴛᴏ ғɪɴᴅ ᴀ ʜᴏᴍᴇ ᴡʜᴇʀᴇ ᴡᴇ ᴄᴏᴜʟᴅ ғɪᴛ ɪɴ ᴀɴᴅ ʙᴇ ʟᴏᴠᴇᴅ ғᴏʀ ᴡʜᴏ ᴡᴇ ᴡᴇʀᴇ. Wʜᴀᴛ ᴡᴇ ʜᴀᴅ ʙᴇᴄᴏᴍᴇ.Nᴏᴡ ᴡᴇ’ʀᴇ ʙᴀᴄᴋ ɪɴ Cʟᴀɴᴄʏ, Mᴏɴᴛᴀɴᴀ, ᴡʜᴇʀᴇ ɪᴛ ᴀʟʟ ʙᴇɢᴀɴ, ᴀɴᴅ ᴍᴀᴅʟʏ ɪɴ ʟᴏᴠᴇ, ᴏʀ ɪs ɪᴛ ᴊᴜsᴛ ᴍᴀᴅ ʟᴏᴠᴇ? Nᴏɴᴇ ᴏғ ᴜs ʜᴀᴅ ᴛʜᴇ ᴅᴇsɪʀᴇ ᴛᴏ ᴅʀᴇᴅɢᴇ ᴜᴘ ᴛʜᴇ ᴘᴀsᴛ, ʙᴜᴛ sᴏᴍᴇʜᴏᴡ, ᴡᴇ ᴡᴇʀᴇ ᴅʀᴀᴡɴ ʙᴀᴄᴋ ᴛᴏ ᴛʜᴇ ᴠᴇʀʏ ᴘʟᴀᴄᴇ ᴛʜɪs ɴɪɢʜᴛᴍᴀʀᴇ ʙᴇɢᴀɴ. Wʜᴇɴ Dᴇᴛᴇᴄᴛɪᴠᴇ Bᴇɴsᴏɴ ʀᴇᴀᴘᴘᴇᴀʀᴇᴅ ᴡɪᴛʜ ǫᴜᴇsᴛɪᴏɴs ᴀʙᴏᴜᴛ ᴍʏ ᴘᴀsᴛ, ɪᴛ ᴡᴀs ᴍᴏʀᴇ ᴛʜᴀɴ I ᴄᴏᴜʟᴅ ʙᴇᴀʀ. Hᴇ ʜᴀᴅɴ’ᴛ ʜᴇʟᴘᴇᴅ ᴜs ᴛᴇɴ ʏᴇᴀʀs ᴀɢᴏ ᴡʜᴇɴ I ᴛʀɪᴇᴅ ᴛᴏ ʀᴇᴘᴏʀᴛ ɪᴛ, ᴀɴᴅ ɴᴏᴡ I ᴅɪᴅɴ’ᴛ ᴡᴀɴᴛ ʜɪs ʜᴇʟᴘ. I ᴏɴʟʏ ᴡᴀɴᴛᴇᴅ ᴛᴏ ᴍᴏᴠᴇ ᴏɴ ғʀᴏᴍ ᴛʜᴇ ᴘᴀɪɴ.TRIGGER WARNING: This book contains strong subject matter not suitable for some readers. The topics described include child abduction, sexual abuse, prostitution, alcoholism, tobacco use, profanity, and both violent and sexual situations. 18+",
  "genres": [
    "Dark"
  ],
  "author": "R&C Christiansen",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/58329045-whisper"
}