{
  "title": "On the Line: A Story of Class, Solidarity, and Two Women's Epic Fight to Build a Union",
  "description": "“Riveting and intimate. It is hard to imagine a more humanizing portrait of the American labor movement. A remarkable debut.” —Francisco Cantú, New York Times bestselling author of The Line Becomes a River  On the Line takes us inside a bold five-year campaign to bring a union to the dangerous industrial laundry factories of Phoenix, Arizona. The fight is led by two courageous women: Daisy Pitkin, a young labor organizer, and Alma, a second-shift immigrant worker who risks her livelihood fighting for safer working conditions. On the Line illuminates the harsh realities that workers in these factories face—routine exposure to biohazardous waste, surgical tools left in hospital sheets, and overheating machinery—as well as the ways broken US labor law makes it nearly impossible for them to fight back. Forged in the flames of a vicious anti-union crusade and a grueling legal battle, the relationships that grow between Daisy, Alma, and the other factory workers show how a union, at its best, can reach beyond the workplace and form a solidarity so powerful that it can transcend friendship and transform communities. But when political strife divides the union, and her bond with Alma along with it, Daisy is forced to reflect on her own position of privilege and the power imbalances inherent in any top-down organizing movement. In the social tradition of Barbara Ehrenreich’s Nickel and Dimed, Stephanie Land’s Maid, or Matthew Desmond’s Evicted, and capturing the deeply personal nature of organizing, On the Line offers an exhilarating and long overdue look at the modern-day labor movement, how difficult it is to bring about social change, and why we can’t afford to stop trying. At this moment, when interest in collective action is rising, On the Line is a vital contribution to our national conversation.",
  "genres": [
    "Nonfiction",
    "History",
    "Labor",
    "Memoir",
    "Politics",
    "Biography",
    "Social Justice"
  ],
  "author": "Daisy Pitkin",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/58328434-on-the-line"
}