{
  "title": "Bed of Nails",
  "description": "**Amazon top 50 seller**Author's note:This book heavily features physical and emotional abuse.  Please, before you start reading, understand you may not approve or even understand the heroine's choices.  While this is a work of fiction, unfortunately, her choices and the motivation behind them are experienced every day by abused women.  Please have compassion and empathy when you read instead of judgment and criticism for her choices.  But also remember, this is romance.  HEA is guaranteed.They say love is blind. But Dane and Cami are the ones with the vision problems, because everyone else can see what’s growing between these two. And it isn’t the friendship they keep claiming.DaneThey say all drummers are a little crazy.  And when it comes to my overprotective nature, my sisters, and pretty much everyone else, agrees that I parted company with rationality long ago.  But I can't help it.  I need to look out for the people I care about.  And surprisingly, my best friend Cami, has made the top of that list.  I'm trying to rein it in, but I know what her boyfriend is doing.  When I catch him, I don't know if anyone will be able to stop my need to keep her safe.CamiThey say most girls have a 'type'.  My type?  Trouble.  I've gone through d-bag after d-bag in my dating life, but I can honestly say, none have been as bad as my current boyfriend Travis.  But they say love takes work, right?  So I'll keep trying to make things work until either Travis calls it quits or there's nothing left to fight for.  I just have to figure out why I spend every night dreaming about my best friend, Dane.These two proclaim they're just friends loud and proud, despite what everyone around them thinks.  Until suddenly, friendship isn't enough, and Dane and Cami see what's been right in front of them.  But when Cami's troubles gets out of hand, will her fighting nature and Dane's protective streak be enough to protect her from Travis.Warning:  this book is for mature audiences only due to language to explicit situations.   Trigger warnings due to domestic abuse should be noted.",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Dark Romance",
    "Contemporary",
    "Dark",
    "New Adult",
    "Abuse"
  ],
  "author": "Nola Marie",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/58343083-bed-of-nails"
}