{
  "title": "The Fair Isle Trilogy: Complete Series Collection",
  "description": "Every young woman dreams of marrying a king.Everyone except for me.Because the king I am to wed has razor sharp fangs and a thirst for blood…The Fair Isle Trilogy is a complete series collection, featuring three full length novels in a single volume: To Carve a Fae Heart, To Wear a Fae Crown, and To Spark a Fae War.All my life I knew I’d come of age during the Hundred Year Reaping. According to the ridiculous treaty, two human girls are sent to the faelands as brides for the fearsome fae king and his devilish younger brother.Not me. I was supposed to be safe. Two girls were chosen from my village already. But when they are executed for offending the king, my sister and I are sent in their place.What a mess. Then again, maybe it’s not so bad. The younger brother I’m paired with doesn’t seem as monstrous as I’d expected. He’s delightfully handsome too. But nothing compares to the chilling, dangerous beauty of the fae king. And when my sister flees the castle and her terrifying husband-to-be, I’m left to marry him instead.If I go through with this, I might not survive my wedding night. If I don’t, no one is safe, neither human nor fae. An ancient war will return, bringing devastation we haven’t seen in a thousand years. Can I sacrifice myself for the good of my people? Or will a dangerous desire be the death of me first?If I don’t lose my heart, the king will certainly lose his. I’ll carve it out with an iron blade if I have to.The Fair Isle Trilogy Complete Series Collection is an enemies-to-lovers fantasy, perfect for fans of The Cruel Prince, ACOTAR, and The Iron King. If you like snarky fae, brooding fae royals, sizzling romance, and fierce heroines, you'll love this breathtaking fae fantasy.BUY THE FAIR ISLE TRILOGY TO CROSS INTO FAERIE TODAY!The Fair Isle Trilogy Complete Series Collection contains an illustrated map and four character illustrations not published in any other edition!The three full-length novels included in this single volume are…To Carve a Fae HeartForced to marry a cruel fae king, Evelyn Fairfield must do what it takes to fulfill the treaty and keep her people safe. But can she do her duty without losing her heart?To Wear a Fae CrownEvelyn was supposed to despise the king, not fall in love with him. And when the human and fae councils turn against her and her beloved, she has so much more to fight for…and more to lose.To Spark a Fae WarWith the truth of Evelyn’s heritage exposed, the line between friend and foe is blurred. War looms and only she can stop it…or start it. Evelyn and her mate must make a final stand against the force that threatens the lives of everyone they love.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fae",
    "Romantasy",
    "Young Adult",
    "Fantasy Romance",
    "New Adult"
  ],
  "author": "Tessonja Odette",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/58327706-the-fair-isle-trilogy"
}