{
  "title": "Here Comes Trouble",
  "description": "Lacy Taylor didn't exactly have a fairytale childhood. After being abandoned by both her parents and raised by her grandfather, she learned to take care of herself at a young age. Fiercely independent, Lacy finds herself back in Trouble, Wyoming working to pay the mortgage on the home her grandfather left her. Though she isn't pleased to be back in the town that triggers memories from her complicated past, Lacy decides to make the best of her situation until she learns her father has been released from jail and she’s not able to make the payments on the house in time. What's a girl to do?Chase McDermott hadn't thought about Lacy Taylor in years. When he last knew her, she was nothing more than a lanky teenager who was glued to his dorky younger brother’s side. Years later, she’s standing in front of him—grown up and he must admit hot--asking for a waitress position at his restaurant. Even though she doesn’t have previous experience, he offers her a shot and right away her sexy confidence and strong convictions begin to spark something unexpected in him. But when money starts to go missing, the pressure is on Chase to figure out which employee has the greatest motive. While Chase and Lacy’s attraction continues to escalate, her personal problems are on the rise when her half-sister comes into her life forcing her to deal with the mother that let her down. Lacy and Chase’s relationship culminates in a windfall that neither of them ever fathomed and challenges Lacy to learn what it means to trust someone. Chase will have to push aside his stubborn, unemotional side if there’s any chance they can reconcile their steamy affair into a real future. Can they get past all the roadblocks or will they fall prey to their own troubles?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Amazon",
    "Westerns"
  ],
  "author": "Erin Kern",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/12777315-here-comes-trouble"
}