{
  "title": "The White Label Promo Preservation Society",
  "description": "HoZac Books is proud to present The White Label Promo Preservation Society: 100 Flop Albums You Ought to Know, written and compiled by Sal Maida and Mitchell Cohen, who have recruited for their “society” a gang of esteemed music obsessives: musicians, label executives, and journalists who chose favorite albums from the 1960s and 1970s to rave about and expound upon. The only criterion was that the albums never made the top 100 on Billboard’s LP Top 200 (although in a few cases, they did quite well on the R&B or country chart). The selection ranges from east coast vocal-group harmony to punk and metal, from superstars like The Who and the Beach Boys to virtual unknowns.As Sal and Mitchell write in the book’s introduction, “These are the albums you might not read about, except here. No one needs to tell you why Pet Sounds, Revolver or Blonde On Blonde are essential parts of any decent record collection, or guide you towards classics – or even somewhat lesser efforts – by the Rolling Stones, Chuck Berry or the Jimi Hendrix Experience. Or which Pink Floyd album is indispensable (hint: the debut; you can stop right there). Although we have strong opinions about pantheon artists like Led Zeppelin and Marvin Gaye, and are happy to share those views with anyone in earshot, that isn’t what this book is about. We aren’t here to challenge or endorse rock orthodoxy. Neither is the mission to, once again, assert the brilliance of Skip Spence’s Oar, of such artists as Nick Drake, Big Star, and the Velvet Underground, whose influence, despite the lack of any commercial success in their time, has been thoroughly – one might even say exhaustively – documented elsewhere.”To help tell this story, Sal and Mitchell called on an impressive team of guest essayists: Lenny Kaye, Russ Titelman, Amy Rigby, Brian Koppelman, Dennis Diken, Bebe Buell, Jim Farber, Susan Whitall, Steve Shelley, Phil King, Ira Robbins, Billy Altman, Marshall Crenshaw, Peter Holsapple, Wreckless Eric, Peter Keepnews, Miriam Linna, Joe McEwen, and a cast of dozens. Sal Maida has played bass guitar with Roxy Music and Sparks, was a member of the snappy NYC power-pop band Milk ‘n’ Cookies, and has chronicled his exploits as fan and musician in the HoZac book Four Strings, Phony Proof, and 300 45s. There is not much about rock music in the ‘60s and ‘70s that he doesn’t know, and it was quite an ordeal getting him to hone his list of underrated, underselling albums down to manageable length for these purposes. Mitchell Cohen has been writing about music and movies since the early ’70s (CREEM, Film Comment, High Fidelity, Musician, Phonograph Record…), was a major-label A&R guy for around a quarter-century, and is the co-author of Matt Pinfield’s memoir All These Things That I’ve Done, as well as the author of an upcoming book on Arista Records for RPM/BMG Books.What you will find out here are things like how Evie Sands, with Any Way That You Want Me, made one of the most confident and accomplished albums by a female singer-songwriter before Tapestry. You’ll find out how Bobbie Gentry followed up “Ode to Billie Joe” and the LP of that title with a haunting, mysterious concept album. You will, in all likelihood, be introduced to the quirky New York folk-rock duo of Bunky & Jake, to the art-rock of Ars Nova, and to the entrancing psych-pop of Blossom Toes. Georgie Fame, Joe South, the Hollies, Jackie DeShannon, the Impressions, the Everly Brothers, and Nico, all pop up here, often in ways you might not expect. This is a book for everyone who has gravitated to used-record stores, garage sales and flea markets in search of something he or she hasn’t encountered before. You might be at a record fair, browsing with a friend through cardboard boxes, and have that friend say, “You need to hear this,” pretty much forcing an album you’ve never heard of into your hands.This is the book version of that.",
  "genres": [
    "Music"
  ],
  "author": "Sal Maida",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/58329444-the-white-label-promo-preservation-society"
}