{
  "title": "Then You Saw Me",
  "description": "You know what’s guaranteed to send your heart into your throat? Opening the front door of your off-campus house to find the boy you had a crush on all through high school telling you he’s the new subletter.Of course, he barely knew I existed back then, and still doesn’t even though we attend the same university. But in a house of six college kids, it should be easy to remain invisible while carrying a torch for him. After all, I’m skilled at being overlooked and playing second fiddle.Except Austin Van Hewitt, my hometown’s golden boy, doesn’t get the memo. After we throw our first party of the year, I’m on his radar and somehow my lips miraculously end up on his. The budding romance is one I’ve always dreamt about. As he shows more and more interest, I push aside the plaguing insecurity of never being good enough.But then a letter shows up in our mailbox. A time capsule I wrote to myself when I was fifteen. You know, the kind where a teacher sends it to you years later? Guess who opens it by mistake and reads all about how I plan on marrying him and having his babies one day? Did I mention I signed it using his last name?Mortifying would be an understatement. After he starts pulling away, I’m once again the girl in the background hoping that someone will understand me enough to pay me all of their attention. The old me, the one conditioned to settle for what she’s given, would back down. This time, though, if I want everything I almost held in my hands, I’ll have to speak up. I’ll have to admit exactly how I feel, fight for the love that was blossoming. And I’m not sure what’s scarier; voicing my inner thoughts or facing his ultimate rejection.",
  "genres": [
    "Romance",
    "College",
    "Contemporary Romance",
    "Second Chance",
    "Forced Proximity",
    "Contemporary",
    "Friends To Lovers"
  ],
  "author": "Carrie Aarons",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/58349373-then-you-saw-me"
}