{
  "title": "Disorientation",
  "description": "A Taiwanese American woman’s coming-of-consciousness ignites eye-opening revelations and chaos on a college campus in this outrageously hilarious and startlingly tender debut novel.Twenty-nine-year-old PhD student Ingrid Yang is desperate to finish her dissertation on the late canonical poet Xiao-Wen Chou and never read about “Chinese-y” things again. But after years of grueling research, all she has to show for her efforts are junk food addiction and stomach pain. When she accidentally stumbles upon a curious note in the Chou archives one afternoon, she convinces herself it’s her ticket out of academic hell. But Ingrid’s in much deeper than she thinks. Her clumsy exploits to unravel the note’s message lead to an explosive discovery, upending not only her sheltered life within academia but her entire world beyond it. With her trusty friend Eunice Kim by her side and her rival Vivian Vo hot on her tail, together they set off a roller coaster of mishaps and misadventures, from book burnings and OTC drug hallucinations, to hot-button protests and Yellow Peril 2.0 propaganda. In the aftermath, nothing looks the same to Ingrid—including her gentle and doting fiancé, Stephen Greene. When he embarks on a book tour with the super kawaii Japanese author he’s translated, doubts and insecurities creep in for the first time… As the events Ingrid instigated keep spiraling, she’ll have to confront her sticky relationship to white men and white institutions—and, most of all, herself. For readers of Paul Beatty’s The Sellout and Charles Yu’s Interior Chinatown, this uproarious and bighearted satire is a blistering send-up of privilege and power in America, and a profound reckoning of individual complicity and unspoken rage. In this electrifying debut novel from a provocative new voice, Elaine Hsieh Chou asks who gets to tell our stories—and how the story changes when we finally tell it ourselves.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Mystery",
    "Audiobook",
    "Adult",
    "Book Club"
  ],
  "author": "Elaine Hsieh Chou",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/58350424-disorientation"
}