{
  "title": "Castaways: The Penikese Island Experiment",
  "description": "Cadwalader, a Marine captain severely wounded in Vietnam, recuperates but is unable to return to combat. Strongly influenced by his experience in the Marines, he recruits a small band of unlikely \"teachers\" - well-educated social drop-outs - and launches an experiment in the rehabilitation of hard-core juvenile delinquents. The site he selects is Penikese, a remote island off the Massachusetts coast. Once a leper colony, Penikese is slowly transformed by the students and staff into a self-sufficient school community. The Outward-Bound atmosphere the author and his staff create on the primitive island involves construction, boat-building, farming, and nature study. If the wood isn't chopped, there's no heat; if the vegetables aren't harvested, there's no food. Cadwalader and his cohorts treat the kids consistently, and try to hold them accountable for their actions. Buffeted on all sides - by the weather, the violent unpredictability of the kids, jittery surrounding communities, and a rudderless criminal justice system - the author undergoes some painful changes as he confronts the stark irrationality and rock-hard recalcitrance of his juvenile criminal charges, some of whom he takes into his own home. The admonition of an old Marine sergeant comes back to haunt \"That son-of-a-bitch was born bad, and ain't you or anyone else gonna change him.\" But Cadwalader and his colleagues persist, and despite setbacks, the school survives. The dialogue is raw and gritty. The narrative moves from the hilarious to the somber and back again as the author chronicles the lives of the boys who come from Penikese. Castaways is a true story, a tale of idealism tempered but not surrendered - an intensely human portrait.",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir"
  ],
  "author": "George Cadwalader",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/5835807-castaways"
}