{
  "title": "All-Night Pharmacy",
  "description": "*An instant national bestseller*Winner of the National Jewish Book Award for Debut FictionFinalist for the California Book AwardsFinalist for the Lambda Literary Award for Bisexual NovelRachel Kushner meets David Lynch in this fever dream of an LA novel about a young woman who commits a drunken act of violence just before her sister vanishes without a trace.On the night of her high school graduation, a young woman follows her older sister Debbie to Salvation, a Los Angeles bar patronized by energy healers, aspiring actors, and all-around misfits. After the two share a bag of unidentified pills, the evening turns into a haze of sensual and risky interactions—nothing unusual for two sisters bound in an incredibly toxic relationship. Our unnamed narrator has always been under the spell of the alluring and rebellious Debbie and, despite her own hesitations, she has always said yes to nights like these. That is, until Debbie disappears.Falling deeper into the life she cultivated with her sister, our narrator gets a job as an emergency room secretary where she steals pills to sell on the side. Cue Sasha, a Jewish refugee from the former Soviet Union who arrives at the hospital claiming to be a psychic tasked with acting as the narrator’s spiritual guide. The nature of this relationship evolves and blurs, a kaleidoscope of friendship, sex, mysticism, and ambiguous power dynamics.With prose pulsing like a neon sign, Ruth Madievsky’s All-Night Pharmacy is an intoxicating portrait of a young woman consumed with unease over how a person should be. As she attempts sobriety and sexual embodiment, she must decide whether to search for her estranged sister, or allow her to remain a relic of the past.",
  "genres": [
    "Fiction",
    "Contemporary",
    "LGBT",
    "Queer",
    "Literary Fiction",
    "Lesbian",
    "Adult"
  ],
  "author": "Ruth Madievsky",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/58349243-all-night-pharmacy"
}