{
  "title": "The Magician’s Daughter",
  "description": "A young woman raised on an isolated island by a magician discovers things aren’t as they seem and must venture into early 1900s England to return magic to the world in this lush and lyrical historical fantasy.  It is 1912, and for the last seventy years magic has all but disappeared from the world. Yet magic is all Biddy has ever known.   Orphaned as a baby, Biddy grew up on Hy-Brasil, a legendary island off the coast of Ireland hidden by magic and glimpsed by rare travelers who return with stories of wild black rabbits and a lone magician in a castle. To Biddy, the island is her home, a place of ancient trees and sea-salt air and mysteries, and the magician, Rowan, is her guardian. She loves both, but as her seventeenth birthday approaches, she is stifled by her solitude and frustrated by Rowan's refusal to let her leave.    One night, Rowan fails to come home from his mysterious travels. To rescue him, Biddy ventures into his nightmares and learns not only where he goes every night, but that Rowan has powerful enemies. Determination to protect her home and her guardian, Biddy's journey will take her away from the safety of her childhood, to the poorhouses of Whitechapel, a secret castle beneath London streets, the ruins of an ancient civilization, and finally to a desperate chance to restore lost magic. But the closer she comes to answers, the more she comes to question everything she has ever believed about Rowan, her own origins, and the cost of bringing magic back into the world.For more from H. G. Parry, check out:The Shadow HistoriesA Declaration of the Rights of Magicians A Radical Act of Free MagicThe Unlikely Escape of Uriah Heep",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Fantasy",
    "Magic",
    "Young Adult"
  ],
  "author": "H.G. Parry",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/58349172-the-magician-s-daughter"
}