{
  "title": "Forgiven: Con",
  "description": "Con\nI have everything I’ve ever wanted… so why do I still feel like the kid who came from nothing?Please help him …Three little words that have haunted me for years.Three little words that I know I’ll take to my grave.It was supposed to be just another fight. Another few minutes of using my fists and my so-called natural “gift” for fighting to raise the cash I needed to save my little brother’s life.But it wasn’t just another fight.Yes, I had walked away with the prize money and yes, I had saved my brother, but I’d also destroyed not one, but two lives. I’d left my opponent broken on the ground with his eight-year-old brother begging the onlookers around him for help.Begging me for help.But I’d walked away…Fifteen years later and that little boy is now a bitter, broken young man standing over his brother’s grave; the grave I might as well have put him in. I want nothing more than to help Micah Fox escape the hell his life has become, the life I condemned him to, but he wants nothing to do with me.But I can’t walk away this time.I won’t.\nMicah\nI’m so close to escaping my ugly little world that I can practically taste it. No way in hell am I letting the man who put me there try to play hero now.That night was supposed to change my life.It did.Just not in any way I could have ever conceived of.Fifteen years ago, the man known only as Zeus to his fans left my brother a broken man who wanted nothing to do with the world around him. I couldn’t save my brother, but I sure as hell can make sure my niece and nephew have a future… the one their father should have had.Zeus or Con or whatever the hell his name is wants to help me now? Not happening. He might know how to turn on the charm and play to his legions of adoring fans, but he and I both know what kind of monster lurks inside him.Okay, so what if strange things happen in my belly when he touches me? What if I feel a little stronger when he wraps his arms around me and promises me that everything will be okay?It’s not real.It can’t be.Because hate is all I have right now. If I let Con take that from me…Like I said… it can’t be real.I won’t let it be.",
  "genres": [
    "M M Romance",
    "Abuse",
    "Romance",
    "Enemies To Lovers",
    "Contemporary",
    "LGBT",
    "Gay"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/58354644-forgiven"
}