{
  "title": "DR. SEBI’S CURE FOR HERPES: Discover The Story of a World Star and His Mentor. How to Eradicate Herpes From Your Life and That of Your Loved Ones, Avoiding ... Even If You're in a Period of Stress",
  "description": "Are you looking for a way to become a Herpes-free person? Did your doctor recommend a treatment, but it only worked for a short while?Are you tired of wasting your money on the medicines your physician told you to take? Then you're in the right place! Let's face it, herpes is a very awkward condition!When I had the rash on my lips, I was embarrassed in every situation; I couldn't take a selfie for days...In fact, I could hardly look at myself in the mirror! Not to mention when I had it in my private parts : I was so ashamed and mortified, that I avoided meeting my boyfriend for a week!I was scared that he would judge me , and that he might not want to be with me anymore! With Western medicine, I managed to make it disappear for some time... but it came back, cyclically.Indeed, the relapses gradually became more frequent. Be warned that if you continue to rely on \"them\", your herpes outbreaks will happen more and more often! But don't worry, everyone knows that Doctor Sebi managed to eradicate the virus forever and that he has already helped hundreds of people to become “Herpes Free”. What few people know, however, is that Dr. Sebi used a specific diet to cure singer Lisa Left Eye from herpes .In this book, you can find the one and only diet used by Sebi himself to be a Herpes Free person! Here you will If you have already thrown a lot of money and time out of the window with hardly any results, this is the book for you! The special food plan for herpes implemented by Dr. Sebi himself is the only one capable of creating an environment in which the virus cannot survive! It has already been tested and proven effective by an international star like Lisa Left Eye. And she was so satisfied, that she became Dr. Sebi's testimonial at every event! What are you waiting for? Take back your life, go back to meeting men and smiling at you will no longer need to fear their judgment! Scroll up and click the \"BUY NOW\" button!Today is your first day as a “Herpes-Free” girl, FOREVER!",
  "genres": [],
  "author": "Samantha Akilah",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/58385200-dr-sebi-s-cure-for-herpes"
}