{
  "title": "Acts of Mercy",
  "description": "What to ♥ stepbrother♥ age-gap♥ forbiddenALYSSAI'm f*cked.Broken down on the side of the road wasn’t how I pictured my first stint with independence, and calling my mother to let her know I already need help is completely off the table.Throwing insult to injury, Mr. Tall Dark and F*ck Me has come to my rescue, strolling in like some Knight in shining armor.Hudson Maxwell, with his chiselled jaw and striking grey eyes looks under the hood of my car like some sort of Greek God, sent to test my will.His wicked mouth flirts with me, saying all the words any girl would want to hear. Especially me. He’s been my unattainable crush. The man I could never have.But now? He doesn’t know who I am, fully grown and far from the little girl he last saw.So as he continues his assault on my libido—unaffected by the rules that would keep us apart—I have to ask, do I stop this charade, or do I cave in and taste him just this once?HUDSONOne moment is all it takes.One move to wreck your world.Alyssa Rogers, with her hypnotic green eyes and luscious lips, was that for me. The siren that sang me straight to my demise.I should’ve seen her for what she was. A trickster and a thief.But as the walls cave in, our forced proximity forcing us closer and closer, the answer becomes clear.Come hell or high water, Alyssa Rogers needs to go.\"Ma’am excuse me!!! AOM was a-freaking-mazing!!! You out did yourself and saved the best for last!!!\" Shawna Jimenez, More.Books.Forever\"Holly of all holiness! I think this possibly hits the best seller list! It fast and furious, the forbidden never tasted so good! Let me just say Hudson didn’t see it coming! I want more! Can’t wait for the next book to come!\" - Goodreads Reviewer\"Just absolutely phenomenal! Acts of Mercy by Eleanor Aldrick will keep you up well into the night, turning page after page, tugging at your heartstrings!\" - Goodreads Reviewer\"Amazing, brilliant and sexy story.\" Lauren, Goodreads Reviewer\"By far my favorite book of this series!!!\" Courtney, Goodreads Reviewer",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Eleanor Aldrick",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/58370641-acts-of-mercy"
}