{
  "title": "A Civil Campaign",
  "description": "The recently widowed Ekaterin Vorsoisson returns to Barrayar, following the events described in KOMARR, and finds herself under siege from several suitors, including Miles Vorkosigan. Miles’ initial attempts at courtship result in colossal disasters, affecting as well Miles’ brother Mark, who is forbidden from courting his own ladylove by the girl’s outraged parents. Some nasty political maneuverings by ambitious Vor aristocrats create new trials for Miles while he wages his campaign for Ekaterin’s heart. Intrigue, wit and high hilarity make this Hugo and Nebula finalist a must for readers of science fiction and romance alike.on A CIVIL \"All the virtues we have come to expect from Bujoid including more and more prose that sings.\"- The Chicago Sun Timeson Lois McMaster “Bujold continues to prove what marvels genius can create out of basic space operatics.”- Library Journal“Bujold is not just a master of plot, she is a master of emotion.”- SF Site“Bujold is one of the best writers of SF adventure to come along in years.”- Locus Magazine“A superb craftsman and stylist, Ms. Bujold is well on her way to becoming one of the great voices of speculative fiction.” - Rave Reviews\"Boy, can she write!\"- Anne McCaffrey“Bujold has a gift, nearly unique in science fiction, for the comedy of manners.” - Chicago Sun Times“Superb far-future saga.”- Publishers Weekly on the 'Vorkosigan' seriesBujold's \"work remains among the most enjoyable and rewarding in contemporary SF.\"- Publishers Weekly\"Bujold is also head and shoulders above ... current fantasists and well as science-fictionists.\"- Booklist about the McMaster Bujold was born in 1949, the daughter of an engineering professor at Ohio State University, from whom she picked up her early interest in science fiction. She now lives in Minneapolis, and has two grown children. She began writing with the aim of professional publication in 1982. She wrote three novels in three years; in October of 1985, all three sold to Baen Books, launching her career. Bujold went on to write many other books for Baen, mostly featuring her popular character Miles Naismith Vorkosigan, his family, friends, and enemies. Her books have been translated into twenty-one languages. Her fantasy from Eos includes the award-winning Chalion series and the Sharing Knife series.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Fiction",
    "Space Opera",
    "Audiobook",
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Lois McMaster Bujold",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/12779339-a-civil-campaign"
}