{
  "title": "The Lady's Mine",
  "description": "A delightful new western romance from the New York Times bestselling author of Redeeming LoveNew York Times bestselling author Francine Rivers returns to the California frontier in this sweeping, romantic tale of a displaced New England suffragette, a former Union soldier disinherited by his Southern family, and the town they join forces to save.1875. When Kathryn Walsh arrives in tiny Calvada, a mining town nestled in the Sierra Nevadas, falling in love is the farthest thing from her mind. Banished from Boston by her wealthy stepfather, she has come to claim an inheritance from the uncle she never a defunct newspaper office on a main street overflowing with brothels and saloons, and a seemingly worthless mine. Moved by the oppression of the local miners and their families, Kathryn decides to relaunch her uncle’s newspaper―and then finds herself in the middle of a maelstrom, pitted against Calvada’s most powerful men. But Kathryn intends to continue to say―and publish―whatever she pleases, especially when she knows she’s right.Matthias Beck, owner of a local saloon and hotel, has a special interest in the new lady in town. He instantly recognizes C. T. Walsh’s same tenacity in the beautiful and outspoken redhead―and knows all too well how dangerous that family trait can be. While Kathryn may be right about Calvada’s problems, her righteousness could also get her killed. But when the handsome hotelier keeps finding himself on the same side of the issues as the opinionated Miss Walsh, Matthias’s restless search for purpose becomes all about answering the call of his heart.Everyone may be looking to strike it rich in this lawless boomtown, but it’s a love more precious than gold that will ultimately save them all.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Christian Fiction",
    "Fiction",
    "Christian",
    "Historical",
    "Historical Romance"
  ],
  "author": "Francine  Rivers",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/58389761-the-lady-s-mine"
}