{
  "title": "Last Call at the Hotel Imperial: The Reporters Who Took On a World at War",
  "description": "They were an astonishing group: glamorous, gutsy, and irreverent to the bone. As cub reporters in the 1920s, they roamed across a war-ravaged world, sometimes perched atop mules on wooden saddles, sometimes gliding through countries in the splendor of a first-class sleeper car. While empires collapsed and fledgling democracies faltered, they chased deposed empresses, international financiers, and Balkan gun-runners, and then knocked back doubles late into the night.Last Call at the Hotel Imperial is the extraordinary story of John Gunther, H. R. Knickerbocker, Vincent Sheean, and Dorothy Thompson. In those tumultuous years, they landed exclusive interviews with Hitler and Mussolini, Nehru and Gandhi, and helped shape what Americans knew about the world. Alongside these backstage glimpses into the halls of power, they left another equally incredible set of records. Living in the heady afterglow of Freud, they subjected themselves to frank, critical scrutiny and argued about love, war, sex, death, and everything in between.Plunged into successive global crises, Gunther, Knickerbocker, Sheean, and Thompson could no longer separate themselves from the turmoil that surrounded them. To tell that story, they broke long-standing taboos. From their circle came not just the first modern account of illness in Gunther's Death Be Not Proud--a memoir about his son's death from cancer--but the first no-holds-barred chronicle of a marriage: Sheean's Dorothy and Red,  about Thompson's fractious relationship with Sinclair Lewis.Told with the immediacy of a conversation overheard, this revelatory book captures how the global upheavals of the twentieth century felt up close.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Journalism",
    "Politics",
    "World War II",
    "War"
  ],
  "author": "Deborah  Cohen",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/58394774-last-call-at-the-hotel-imperial"
}