{
  "title": "Have You Ever Wondered What You Will Be?",
  "description": "“This ‘whimsical, engaging, beautifully illustrated’ picture book (Kirkus Reviews) offers a myriad of fun answers to the age-old question: What do you want to be when you grow up? Filled with positive affirmations and a diverse array of characters, this inspiring read will delight any hopeful youngster.” \n–BookBub\nWinner of 31 literary awards, this uplifting picture book of wit and wisdom inspires readers and graduates young and old.For those preparing for the adventures of life and pursuing their dreams, this charming picture book is a rhyming story of inspirational affirmations that chronicles all of the many wonderful potential futures that lie before us. Have You Ever Wondered What You Will Be? is perfect for inspiration seekers, graduates young and old, someone turning the page to a new chapter in life, and those looking for a meaningful gift.Through gorgeous painterly illustrations with a whimsical mix of art styles, combining surrealist, classic, and a creative interpretation of the art deco movement, the story’s child characters look into mirrors to see what future befalls them. A poignant text introduces the many potential vocations, professions, and callings that are within our grasp, as long as they are pursued with courage and determination.The story acknowledges that life isn’t always perfect and that the path to success and happiness will have peaks and valleys, but what matters is that you don’t give up working toward your dream with patience and positivity. Overcoming obstacles and not fearing failure is part of the adventure.But never forget that at times you might fail,For failures and flops are part of the tale.Readers will enjoy some of the book illustrations’ architectural labyrinths, reminiscent of such classics as Dr. Seuss, as they are introduced to a myriad of professions including an inventor, an animal rescuer, a software developer, an architect, an entrepreneur, or fitness instructor, among other unique offerings.A lasting message will stay with the reader long after the book is closed, reminding one that they are unique and special and that they can do anything – the future is wide open.",
  "genres": [
    "Childrens",
    "Picture Books",
    "Fiction"
  ],
  "author": "Junia Wonders",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/58390522-have-you-ever-wondered-what-you-will-be"
}