{
  "title": "Long Distance Relationships",
  "description": "They say love conquers all. But does it? Is love enough to keep it together for your Seattle friends as they work towards building lasting relationships? Does distance—emotional and physical—prove too big a barrier for budding love? Or is it just enough space for it to bloom? Long Distance Relationships picks up where Short Term Relationships left off, but it stands alone if you’re just meeting these friends for the trials, tribulations, and total unpredictability of mid-life dating. Join Kate as she takes a leap and leaves Seattle—and her new love—to work the land on a ranch in Montana. Catch up with Liza as she races towards her dream of the Ironman World Championships, while maintaining a long-distance relationship she didn’t sign up for. Find out if Nathan has what it takes to go on tour as a solo artist—and how his dreams impact the love of his life. And peek in on Emily’s new novel—is she writing her way to her own happy ending? Meet the Kate Conrad gave up a long-term job in high tech to chase her dream of running a ranch in Montana. And she put a new relationship on the line—was the move worth the cost? Liza Barrett raced her way to a qualifying slot in the Ironman World Championships—does her determination to succeed at all costs translate into a successful long-distance relationship with the one she thinks is The One? Nathan Stapleton is off to San Francisco to prepare to go on tour as Nate Staples. Can he hold on to what’s important—the relationship with the one he’s pined over for years—while chasing his dream to be an out trans artist? Emily Hall teaches English literature by day and is writing her second novel—a second chance lesbian romance, told as a memoir—by night. Does art imitate life and lead her to a second chance at true love? Christine George stumbled into an intriguing woman’s life on a hiking trail and flipped her own world on its edge. Can she put a past love to rest and open her heart to the opportunities of the present? Jen Scott runs a queer publishing house and dreams of one of her authors’ novels—their babies—reaching the New York Times Bestseller List. She also desperately wants a baby of her own. The clock is ticking—is motherhood in her future? Theirs is an ensemble tale with overlapping stories and histories, but the same goal—find love that lasts, wherever it is.",
  "genres": [
    "LGBT",
    "Teen",
    "Love Story"
  ],
  "author": "A.K.   Rose",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/58398437-long-distance-relationships"
}