{
  "title": "Fortunate Son",
  "description": "Ry Archer and Bowe Keller are as different as night and day. But that doesn’t stop the childhood frenemies from reconnecting whenever one of them needs some help tackling any of life’s major puzzles, like figuring out why getting what you always thought you wanted isn’t living up to all the hype. They might constantly rub each other the wrong way (except for the times when they rub each other the really-really right way), but there is no denying they’ve always made one hell of a great team. They manage to balance each other out… when they aren’t driving each other crazy.For Ry, he thought he had the perfect girl, the one who was going to run headfirst into a methodically planned future. He was going to marry young and have the same kind of legendary, life-long romance his parents did… or so he believed. His girl was going to stand by his side as he chased his dream of being a professional football player all the way to the NFL. He was wrong. Now, Ry’s gotta figure out the difference between a bruised heart and a broken one, and the only person who can teach him the difference is Bowe. Bowe always felt like she had to run before she learned to walk to keep up with her father’s musical legacy. He’s her hero, and she wants nothing more than to make him proud. Bowe’s about to figure out that maybe she wasn’t meant to be in a rock and roll band, and that it is entirely possible she let her father’s success cloud her idea of what making music should be. Bowe needs to find her own path to fame, and there’s a good chance she wouldn’t be brave enough or bold enough to start over if Ry Archer hadn’t pushed his way back into her life when she least expected it.Some days they’re enemies. Other days they’re lovers. For a while, they were strangers. But now, it feels more like they might’ve always been soulmates.Eventually, Ry and Bowe realize that letting go of an old dream and creating a new one is much easier to do with the right person by your side.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Audiobook",
    "Sports",
    "Music",
    "Second Chance"
  ],
  "author": "Jay Crownover",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/58395555-fortunate-son"
}