{
  "title": "The Flonary Tales: Three-in-One Collection",
  "description": "Three enchanting and adventurous stories of bonding, magic and mystery! Each story evolves in a different setting - a village, a city and a magical world - combining reality and fantasy.The Mystery of The Rainbow ButterflyRicha is excited to visit her grandma at the beautiful village. But she is not aware of the magical adventure that awaits her in the woods. A missing boy... and a missing fairy! Will Richa be able to save both of them? Who are the flonaries? What does she discover while trying to help others?The Mystery of The Strange TreewayRicha is back from vacation. Life is normal again and she is happy to have a new friend, though she misses her flonary friends from the woods. One fine day, she notices a Flonasian treeway near her house. She could swear it was not there before. How did it appear suddenly? In the heart of the city! Richa is anxious. Are the flonaries safe? Why is the magic ring not helping her to contact them? Can she trust her new friend?The Mystery of The Hidden KeyThe flonaries are protecting a secret which has been hidden for centuries in an invisible palace. They are unaware that a young boy is on a mission to get to it. Ruby, the new queen, is warned in her dreams about the impending danger. She comes across another shocking discovery that an integral part of the hidden key - a small cube with a special symbol - is missing. It means that someone had taken it out of Flonasia and placed it back. But why and when? The flonaries are safe only as long as the key, along with its cube, doesn't fall into the wrong hands. Who has the missing piece? Is there a bigger force behind the boy? They need help from Richa and her friends to get to the bottom of this. Will they be able to bring back peace to Flonasia? To find out, read this enchanting and adventurous story, spanning across generations..",
  "genres": [],
  "author": "Bharati Guntury",
  "average_rating": "4.85",
  "url": "https://www.goodreads.com/book/show/58405533-the-flonary-tales"
}