{
  "title": "Mother of Invention: How Good Ideas Get Ignored in an Economy Built for Men",
  "description": "An illuminating and maddening examination of how gender bias has skewed innovation, technology, and historyIt all starts with a rolling suitcase. Though the wheel was invented some five thousand years ago, and the suitcase in the nineteenth century, it wasn’t until the 1970s that someone successfully married the two. What was the hold up? For writer and journalist Katrine Marçal, the answer is both shocking and simple: because “real men” carried their bags, no matter how heavy.Mother of Invention is a fascinating and eye-opening examination of business, technology, and innovation through a feminist lens. Because it wasn’t just the suitcase. Drawing on examples from electric cars to bra seamstresses to tech billionaires, Marçal shows how gender bias stifles the economy and holds us back, delaying innovations, sometimes by hundreds of years, and distorting our understanding of our history. While we talk about the Iron Age and the Bronze Age, we might as well talk about the “Ceramic Age” or the “Flax Age,” since these technologies were just as important. But inventions associated with women are not considered to be technology in the same way.This is a sweeping tour of the global economy with a powerful message: if we upend our biases, we can unleash our full potential.\"Another eye-opening entry for the 'Where Are All the Women?' playbook. A wide-ranging swoop through the history of technology and how game-changing innovations got delayed, dismissed, or forgotten if they were suggested by women or just because they were seen as feminine. Set in an apparently implacable framework of an absolute difference between female and male ideas and life abilities, the narrative can, at times, be infuriating but always thought-provoking and intriguing. It is a clearly needed wake-up call to future innovators not to view the world through a narrowly gendered lens but to pay attention to the skills and lived experiences of all.\"—Professor Gina Rippon, bestselling author of The Gendered Brain",
  "genres": [
    "Nonfiction",
    "Feminism",
    "History",
    "Economics",
    "Science",
    "Politics",
    "Audiobook"
  ],
  "author": "Katrine Marçal",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/58387790-mother-of-invention"
}