{
  "title": "The Haven (The Guard Trilogy Extended Series, Book 4) The Guards of Haven",
  "description": "NOW AVAILABLEFrom the Author who gave you the paranormal mystery The Guard Trilogy, comes the New Extended Series, The Guards of Haven.If every time a bell rings, an angel gets their wings, then what tears them away? I stood fixated at the sight in front of me, the magnificence of his features I could still see through the bloodstains on his cheeks. A grunt, then hiss of pain suddenly escape his swollen lips and his eyes flutter open. He is still alive.New town, new house… new dangers.For Lynn, ditching Miami and moving to a small town hadn’t been about leaving her old life behind, it had been about moving forward with her new one. Though she hadn’t anticipated that this newfound happiness she had discovered here would come with new threats.It’s been 12 years since the gathering, and since Lynn discovered more about her true ancestry. They’d all learned a lot more about family, friendship, and their gifts, except along with this knowledge came the sacrifices and losses that we tended to learn about the hard way. Thankfully, there had been many joys, successes, and even a financial windfall for them along the journey. But what came next, this new threat, not even Lynn’s gift of premonition could have ever seen it coming.What if the wrong people knew you could see/sense things that they couldn’t? What if having this ability put you, your family, and so many other innocents in danger? But what if you could help the innocent by using your gift—would you do it, would you risk it?​This novel, like the others in succession, is not a standalone story.Book 4, The Haven, is the next in series and carries the reader from the original trilogy into The Guard Trilogy Extended Series, The Guards of Haven. Although the previous three books of The Guard Trilogy can stand alone as a complete story, and even though these next novels adhere to the original storyline and characters, readers should finish the trilogy before going on to the rest of the books in the extended series.",
  "genres": [],
  "author": "N.L. Westaway",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/58403868-the-haven-the-guard-trilogy-extended-series-book-4-the-guards-of-have"
}