{
  "title": "Fearlessly Different: An Autistic Actor's Journey to Broadway's Biggest Stage",
  "description": "My name is Mickey Rowe. I am an actor, a theatre director, a father, and a husband. I am also a man with autism. You think those things don't go together? Let me show you that they do. Growing up, Mickey Rowe was told that he couldn't enter the mainstream world. He was iced out by classmates and colleagues, infantilized by well-meaning theatre directors, barred from even earning a minimum wage. Why? Because he is autistic. Fearlessly Different: An Autistic Actor's Journey to Broadway's Biggest Stage is Mickey Rowe's story of growing up autistic and pushing beyond the restrictions of a special education classroom to shine on Broadway. As an autistic and legally blind person, living in a society designed by and for non-disabled people, it was always made clear to Mickey the many things he was apparently incapable of doing. But Mickey did them all anyway--and he succeeded because of, not in spite of, his autism. He became the first autistic actor to play the lead role in the play The Curious Incident of the Dog in the Night-Time, landed the title role in the play Amadeus, co-created the theatre/philanthropy company Arts on the Waterfront, and founded the National Disability Theatre. Mickey faced untold obstacles along the way, but his story ends in triumph. Many people feel they are locked out of the world of autism--that it's impossible to even begin to understand. In Fearlessly Different, Mickey guides readers to that world while also helping those with autism to feel seen and understood. And he shows all people--autistic and non-autistic alike--that the things that make us different are often our biggest strengths.",
  "genres": [
    "Autistic Spectrum Disorder",
    "Nonfiction",
    "Memoir",
    "Disability",
    "Autobiography",
    "Biography Memoir",
    "Biography"
  ],
  "author": "Mickey Rowe",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/58401009-fearlessly-different"
}