{
  "title": "Of All Hearts #1-3",
  "description": "3-Book Series Box Set3 Standalone steamy small-town romance novels set in breathtaking locations + Bonus epilogues!Can love be found in unexpected places and with the unlikeliest of people? Take a heartfelt trip to Corfu, Greece; Rimini, Italy; and Kotor, Montenegro to find out.Of All Can the most embarrassing day of your life lead to the love of your life?Corfu, Greece.It’s not a vacation for HR expert, Olivia Duncan. It’s a business trip. One that she has diligently planned for, because Olivia likes to keep things organized and perfect. Not even her frizzy hair gets away with not doing as she wants.But an embarrassing mishap at the company conference puts her in the path of Niko Teresi, a handsome taverna owner who knows a thing or two about how constricting corporate life can be.Olivia doesn’t do change or spontaneity and never deviates from her path.Hiding from the world in his village, can Niko show her there’s life in letting go?Of All He doesn't do romance or promises. She's been burned by love before. Can mending a derelict hotel help mend two lonely hearts?Romeo Dante Lorenzo, owner of cobalt blue eyes and a chiseled jawline, is one of New York's most eligible bachelors. Too bad he’s not looking for love.Used to a different type of women—beautiful and vain—Romeo doesn’t think much of Siena Borrelli upon first meeting her while attending to family business in Italy.After divorcing her cheating husband, Siena started a new life in Rimini, Italy, a coastal town as unique and warm as its occupants, caring for an elderly woman who owns the old hotel she now calls home. When the woman’s great-nephew, Romeo, visits to sell the place, Siena won't let it go without a fight. His physique can be distracting, but she's determined to not let it deceive her.Can they both look beyond the surface?Of All She’s read all about romance but never found love. Can a consolation trip open a new chapter in her life?At almost 40, Melanie Allen needs a change. Longing to escape her uneventful life, the introverted librarian jets off to picturesque Montenegro for a one-week tour. With little confidence in herself, she encounters a stunningly handsome man and acts impulsively for the very first time.Theo Martinovic is gorgeous, self-confident, and a town local. Everything Melanie is not. Still unsure how she captured his attention and sensing he's holding back wounds of his own, Melanie knows she must defy her self-conscious ways if she doesn’t want to repeat the mistakes of her past.Can love be found in an unexpected place, time, and person?",
  "genres": [],
  "author": "Lily Baines",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/58419024-of-all-hearts-1-3"
}