{
  "title": "The Best American Short Stories 2007",
  "description": "In his introduction to this volume, Stephen King writes, “Talent does more than come out; it bursts out, again and again, doing exuberant cartwheels while the band plays 'Stars and Stripes Forever' . . . Talent can’t help itself; it roars along in fair weather or foul, not sparing the fireworks. It gets emotional. It struts its stuff. In fact, that’s its job.”Wonderfully eclectic, The Best American Short Stories 2007 collects stories by writers of undeniable talent, both newcomers and favorites. These stories examine the turning points in life when we, as children or parents, lovers or friends or colleagues, must break certain rules in order to remain true to ourselves. In T. C. Boyle’s heartbreaking “Balto,” a thirteen-year-old girl provides devastating courtroom testimony in her father’s trial. Aryn Kyle’s charming story “Allegiance” shows a young girl caught between her despairing British mother and motherly American father. In “The Bris,” Eileen Pollack brilliantly writes of a son struggling to fulfill his filial obligations, even when they require a breach of morality and religion. Kate Walbert’s stunning “Do Something” portrays one mother’s impassioned and revolutionary refusal to accept her son’s death. And in Richard Russo’s graceful “Horseman,” an English professor comes to understand that plagiarism reveals more about a student than original work can.New series editor Heidi Pitlor writes, “[Stephen King’s] dedication, unflagging hard work, and enthusiasm for excellent writing shone through on nearly a daily basis this past year . . . We agreed, disagreed, and in the end very much concurred on the merit of the twenty stories chosen.” The result is a vibrant assortment of stories and voices brimming with attitude, deep wisdom, and rare compassion.Pa's darling / Louis Auchincloss --Toga party / John Barth --Solid wood / Ann Beattie --Balto / T.C. Boyle --Riding the doghouse / Randy DeVita --My brother Eli / Joseph Epstein --Where will you go when your skin cannot contain you? / William Gay --Eleanor's music / Mary Gordon --L. DeBard and Aliette, a love story / Lauren Groff --Wake / Beverly Jensen --Wait / Roy Kesey --Findings & impressions / Stellar Kim --Allegiance / Aryn Kyle --Boy in Zaquitos / Bruce McAllister --Dimension / Alice Munro --Bris / Eileen Pollack --St. Lucy's home for girls raised by wolves / Karen Russell --Horseman / Richard Russo --Sans farine / Jim Shepard --Do something / Kate Walbert",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Literature",
    "Contemporary",
    "Horror",
    "American"
  ],
  "author": "Stephen        King",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/1278221.The_Best_American_Short_Stories_2007"
}