{
  "title": "Dianetics: The Modern Science of Mental Health",
  "description": "The #1 New York Times bestseller\n \nWith over 22,000,000 copies sold in 50 languages, and used in more than 176 nations, Dianetics brings dramatic and permanent improvement to people all over the world.\n \n“While it’s true that Dianetics has become the self-improvement classic, there can be little doubt that what it has to offer is just what people are now looking for in ever increasing numbers. Reducing stress, achieving goals, improving relationships and striving to live up to one’s full potential is definitely the in thing.” (New York Post)\n \n“Hubbard’s bestseller has helped millions, and it should be read and used by all who are searching for a true understanding of the mind and a solution to such problems as self-doubt, stress, anxiety and depression.” (World Reporter)\n \n“[Dianetics is] a new science which works with the invariability of physical science in the field of the human mind. From all indications it will prove to be as revolutionary for humanity as the first caveman’s discovery and utilization of fire.” (Daily Mirror)\n If you’ve ever felt there was something holding you back in life, ruining your plans and stopping you from being who you want to be, you were right. The fact is, there is a single source of all your problems, stress, unhappiness and self-doubt. It’s called the reactive mind—the hidden part of your mind that stores all painful experiences, then uses them against you. With Dianetics, you can learn to control your reactive mind—freeing you to live an extraordinary life and be your true self. Don’t live with insecurity, negative thoughts, depression and irrational behavior. Use Dianetics to take control of your future. Key discoveries contained in Dianetics:  \n   Why do we give up on our dreams? \n   What is the real cause of depression? \n   Is there a cure for stress? \n   How do you reach your full potential? \n   Why do we hurt the ones we love? \n   Why are some people prone to illness? \n   How can you improve your mental health? \n   Can you conquer your fears? \n  Start the adventure—of you. Buy and read Dianetics: The Modern Science of Mental Health. About the author:  With over two hundred million copies of his works in circulation and dozens of international bestsellers, L. Ron Hubbard has inspired a movement spanning every continent on earth. All told, those works comprise some 5,000 writings and 3,000 recorded lectures and, as such, stand as the single most embracive statement on the human mind and spirit. His breakthroughs have helped millions lead more successful lives and achieve true happiness.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Psychology",
    "Philosophy",
    "Self Help",
    "Spirituality",
    "Science"
  ],
  "author": "L. Ron Hubbard",
  "average_rating": "2.57",
  "url": "https://www.goodreads.com/book/show/58412013-dianetics"
}