{
  "title": "The Lost Book of Eleanor Dare",
  "description": "The fate of the world is often driven by the curiosity of a girl. What happened to the Lost Colony of Roanoke remains a mystery, but the women who descended from Eleanor Dare have long known that the truth lies in what she left behind: a message carved onto a large stone and the contents of her treasured commonplace book. Brought from England on Eleanor’s fateful voyage to the New World, her book was passed down through the fifteen generations of daughters who followed as they came of age. Thirteen-year-old Alice had been next in line to receive it, but her mother’s tragic death fractured the unbroken legacy and the Dare Stone and the shadowy history recorded in the book faded into memory. Or so Alice hoped. In the waning days of World War II, Alice is a young widow and a mother herself when she is unexpectedly presented with her birthright: the deed to Evertell, her abandoned family home and the history she thought forgotten. Determined to sell the property and step into a future free of the past, Alice returns to Savannah with her own thirteen-year-old daughter, Penn, in tow. But when Penn’s curiosity over the lineage she never knew begins to unveil secrets from beneath every stone and bone and shell of the old house and Eleanor’s book is finally found, Alice is forced to reckon with the sacrifices made for love and the realities of their true inheritance as daughters of Eleanor Dare. In this sweeping tale from award-winning author Kimberly Brock, the answers to a real-life mystery may be found in the pages of a story that was always waiting to be written. Praise for The Lost Book of Eleanor Dare : “From the haunting first line, The Lost Book of Eleanor Dare transports the reader to a mysterious land, time and family . . . the captivating women of the Dare legacy must find their true inheritance hiding behind the untold secrets.” — Patti Callahan , New York Times bestselling author",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Audiobook",
    "Historical",
    "Books About Books",
    "Family"
  ],
  "author": "Kimberly Brock",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/58429364-the-lost-book-of-eleanor-dare"
}