{
  "title": "I Guess I Haven't Learned That Yet: Discovering New Ways of Living When the Old Ways Stop Working",
  "description": "When everything we've been clinging to falls apart, how do we know what to keep and what to let go of? I Guess I Haven't Learned That Yet , now a New York Times bestseller, is a clear-eyed look at where we go from here--and how we can transform our lives along the way. Just after her fortieth birthday, author Shauna Niequist found herself in a season of chaos, change, and loss unlike anything she'd ever faced. She discovered that many of the beliefs and practices that she usually turned to were no longer serving her. After trying--and failing--to pull herself back up using the same old strategies and systems, she realized she required new courage, curiosity, and compassion. She discovered the way through was more about questions than answers, more about forgiveness than force, more about tenderness than trying hard. In I Guess I Haven't Learned That Yet , Niequist chronicles her journey--from her life-changing move from the Midwest to Manhattan to the power of unlearning what is no longer helpful and accepting the unknowns that come with midlife, heartbreak, and chronic pain. With her characteristic candor and grace, Niequist writes about her experience learning how Follow Niequist as she endeavors to understand grief, to reshape her faith, and to practice courage when it feels impossible. Praise for I Guess I Haven't Learned That Yet : \"Gentle. Loving. This tender book asks us to listen to our pain, lean into our discomfort, and trust that we can be lifted back on our feet by God and each other.\" --Kate C. Bowler, New York Times bestselling author of No Cure for Being Human \"This book is a masterpiece. It is a journey and an invitation and a joy and a heartbreak and all the things you need to read to be reminded that hope can still be found.\" --Annie F. Downs, New York Times bestselling author of That Sounds Fun",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Self Help",
    "Audiobook",
    "Christian",
    "Faith",
    "Essays"
  ],
  "author": "Shauna Niequist",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/58429175-i-guess-i-haven-t-learned-that-yet"
}