{
  "title": "Social Justice Goes to Church: The New Left in Modern American Evangelicalism",
  "description": "\"The infusion of social justice into the gospel may well be the most dangerous problem facing the church today. Yet, it is going unnoticed in far too many circles. Social Justice Goes to Church can serve as a wake-up call.\"—Samuel C. Smith, Ph.D.Chair and Graduate Program Director, Department of History, Liberty UniversityIn order to understand why so many evangelicals recently support left-leaning political causes, it is important to know a little history.In the 1970s, many campus radicals raised in Christian homes brought neo-Marxist ideas from college back to church with them. At first, figures like Jim Wallis, Ron Sider, and Richard Mouw made great gains for their progressive evangelical cause. But, after the defeat of Jimmy Carter, the religious right stole the headlines.Today, a new crop of mainstream evangelicals has taken up the cause of the New Left, whether they know it or not. As pro-life evangelicals rush to support movements like #BlackLivesMatter and #MeToo, it is important to realize they are walking in footprints already laid down. Their mission may be more successful, but it is not new. To understand where the evangelical social justice movement is heading, it is vital to understand the origins of the movement.Social Justice Goes to Church: The New Left in Modern American Evangelicalism answers, from a historical perspective, the vital question, \"Why are American evangelicals moving Left?\"“The great injunction to the Church was to preach the Gospel to the world, while not being of the world. Social justice neatly reverses this trend, preaching the ways of the world into the church. That is not its only critical reversal. The Gospel is about freedom from guilt and sin and bondage. Social justice seeks above all to apportion guilt and sin and bondage, enslaving entire demographics and requiring that they kneel before man in attrition. How important that a book of this nature should enter the fray right now. I applaud Mr. Harris for his excellent work in providing the practical means of identifying and repelling this fraudulent force, this ideological interloper, this dangerous false teaching.”—Douglas KrugerAuthor of Political Correctness Does More Harm Than Good: How to Identify, Debunk, and Dismantle Dangerous Ideas",
  "genres": [
    "History",
    "Politics",
    "Theology",
    "Religion",
    "Social Justice",
    "Cult Classics",
    "Philosophy"
  ],
  "author": "Jon   Harris",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/58420663-social-justice-goes-to-church"
}