{
  "title": "The Listmaker of Acapulco: A Detective Emilia Cruz Novella",
  "description": "A secret list and a nine-fingered man push Acapulco’s first female police detective to the edge in this exciting companion to the award-winning Detective Emilia Cruz mystery series.After she stops a gang attack in an upscale neighborhood, Emilia discovers a black notebook with a list of names, numbers, and dates. Convinced it is a list of dirty cops, Emilia knows she’s in danger.In a police department riddled with corruption, how long until someone finds out she has the list and comes gunning for her?Meanwhile, the head of the police union initiates an internal investigation, all but accusing Emilia of taking a bribe from a drug gang. Playing all the angles, he makes a fateful offer.For a deceptively high price, he’ll make the investigation go away.As Emilia’s career as a police detective teeters on the brink of disaster, a gruesome discovery is made at the Acapulco morgue. One of the dead attackers wears a grafted finger from another man.Suddenly, a wave of false identities and criminal intrigue engulfs the entire investigation.When Emilia finally finds the author of the list, the riptide could carry them both away.“A thrilling series” -- National Public Radio.2019 and 2020 Poison Cup Award, Outstanding Series, Crime Masters of America After a 30-year career with the Central Intelligence Agency, author Carmen Amato uses her own counterdrug and espionage experiences to craft crime fiction that keeps you guessing until the very end. Amato is a recipient of both the National Intelligence Award and the Career Intelligence Medal.Fans of international mystery series crime fighters like Armand Gamache, Harry Hole, Guido Brunetti, Vera Stanhope, and the Department Q series team, as well as Don Winslow’s Mexican cartel and border thrillers, have embraced Detective Emilia Cruz.Readers love the complex plots, pulse-pounding suspense, and Acapulco’s iconic Pacific setting.Find all the Detective Emilia Cruz books on CLIFF Detective Emilia Cruz Book 1HAT Detective Emilia Cruz Book 2DIABLO Detective Emilia Cruz Book 3KING Detective Emilia Cruz Book 4PACIFIC Detective Emilia Cruz Book 543 Detective Emilia Cruz Book 6RUSSIAN Detective Emilia Cruz Book 7NARCO Detective Emilia Cruz Book 8FELIZ NAVIDAD FROM A Detective Emilia Cruz Short ReadMADE IN 5 Detective Emilia Cruz Stories",
  "genres": [],
  "author": "Carmen Amato",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/58412133-the-listmaker-of-acapulco"
}