{
  "title": "Everybody Breaks",
  "description": "Emilia Gallo knows darkness. She has been abused and controlled by it for her entire life.Trapped in the clutches of an evil, criminal stepfather, with only her selfish, weak mother on her side she is alone and constantly afraid of what each new horror-filled day will bring. She has learnt from a young age to survive in this hellish existence, but when her stepfather lands the ultimate blow – selling her to the Albanian Mafia – she knows it’s only a matter of time before her monsters truly win the battle she has spent her whole life fighting, and break her.But an unexpected opportunity for escape gives Emilia the chance she needs to flee her fate and she grabs onto it with both hands. Armed with very little cash, few belongings and a letter that details a possible hope for her future, she ventures into a world she has been sheltered from and knows very little of. There she finds new friends, a job and a home she can feel safe in for the first time in her life, but what she really wants is family – someone to love her.When she tracks down Nico, the brother she never knew existed, she finds that family she had always longed for, and so much more.Lincoln, Parker and Jax – Nico’s brothers and teammates – are instantly attracted to Emilia from the moment they meet her, and she falls for them too. They make her feel safe and whole in a way she has never known and can’t explain. She wants them all – needs them – but these retired Navy SEALs are not men who share.With her monsters close on her heels, a confusing attraction to three guys, and the trauma of her horror filled past making a normal life impossible, Emilia finds her new beginning isn’t all she had hoped it would be. She thought she had left behind the danger and fear of her past, but as it stalks closer she realizes she can never escape it. Will she be strong enough tofight it with her new found family, and the men she is fast falling for, at her side?",
  "genres": [
    "Reverse Harem",
    "Dark",
    "Romance",
    "Contemporary",
    "Abuse",
    "Dark Romance",
    "Slow Burn"
  ],
  "author": "Kerry     Taylor",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/58422723-everybody-breaks"
}