{
  "title": "Beneath a Silent Moon",
  "description": "June-July 1817 The task had taken shape thanks to the inconvenient way secrets had of bubbling to the surface. It went without saying that it was going to be difficult. But then, murder always was…  The London docks.  Beneath a silent moon, a mysterious exile slips back into the city to complete a nefarious mission that began decades before.  On that same night, London's titled, wealthy and beautiful waltz the night away at Glenister House. Among the guests aristocratic Charles Fraser, a former spy recently returned from the Napoleonic Wars, and his bride Mélanie, who has charmed London society but hides her own secrets. In the brilliance of Mayfair, a visitor from their past pulls Charles and Mélanie back into the world of danger and espionage they thought they had left behind. But this time, the intrigues are rooted in Charles's complex and troubled family. Melanie and Charles Fraser have traded the moment-to-moment dangers of the war-ravaged Continent for the glittering world of the British ton. But beneath the shimmering veneer of London society, they discover an establishment that is rotten to its very core. An assassination and a trail of clues that lead back to the French Revolution itself plunge Charles and Melanie once more into the danger that has always been the common ground in their marriage. As they search for the truth, they find that the answers cut shockingly close to their own friends and family - including the seemingly perfect Honoria Talbot.  A secret society, and the dangerous liaisons of the Fraser family lead Charles and Mélanie from the glittering ballrooms and shadowy streets of London to the Fraser estate on the Scottish coast. This is a deadly game that could shake the fate of nations: but for Charles, the stakes are the lives of those he holds most dear, and the love of the enigmatic woman who shares his name...and his bed.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Romance",
    "Historical Mystery",
    "Fiction",
    "Espionage"
  ],
  "author": "Tracy Grant",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/1278131.Beneath_a_Silent_Moon"
}