{
  "title": "Fight Like Hell: The Untold History of American Labor",
  "description": "A 2022 New Yorker Best Book of the YearA 2022 Esquire Best Nonfiction Book of the YearA 2022 BuzzFeed Book You’ll LoveA 2022 LitHub Favorite Book of the Year“Kelly unearths the stories of the people-farm laborers, domestic workers, factory employees—behind some of the labor movement’s biggest successes.” — The New York TimesA revelatory, inclusive history of the American labor movement, from independent journalist and Teen Vogue labor columnist Kim Kelly.Freed Black women organizing for protection in the Reconstruction-era South. Jewish immigrant garment workers braving deadly conditions for a sliver of independence. Asian American fieldworkers rejecting government-sanctioned indentured servitude across the Pacific. Incarcerated workers advocating for basic human rights and fair wages. The queer Black labor leader who helped orchestrate America’s civil rights movement. These are only some of the working-class heroes who propelled American labor’s relentless push for fairness and equal protection under the law.The names and faces of countless silenced, misrepresented, or forgotten leaders have been erased by time as a privileged few decide which stories get cut from the final copy: those of women, people of color, LGBTQIA people, disabled people, sex workers, prisoners, and the poor. In this assiduously researched work of journalism, Teen Vogue columnist and independent labor reporter Kim Kelly excavates that history and shows how the rights the American worker has today—the forty-hour workweek, workplace-safety standards, restrictions on child labor, protection from harassment and discrimination on the job—were earned with literal blood, sweat, and tears.Fight Like Hell comes at a time of economic reckoning in America. From Amazon’s warehouses to Starbucks cafes, Appalachian coal mines to the sex workers of Portland’s Stripper Strike, interest in organized labor is at a fever pitch not seen since the early 1960s.Inspirational, intersectional, and full of crucial lessons from the past, Fight Like Hell shows what is possible when the working class demands the dignity it has always deserved.",
  "genres": [
    "History",
    "Nonfiction",
    "Labor",
    "Politics",
    "Social Justice",
    "Audiobook",
    "American History"
  ],
  "author": "Kim   Kelly",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/58438592-fight-like-hell"
}