{
  "title": "A Ballad of Love and Glory",
  "description": "Finalist for the Texas Institute of Letters’s Jesse H. Jones Award for Best FictionA Long Petal of the Sea meets Cold Mountain in this sweeping historical saga following a Mexican army nurse and an Irish soldier who must fight, at first for their survival and then for their love, amidst the atrocity of the Mexican-American War—from the author of the “timely and riveting” ( People ) Across a Hundred Mountains and The Distance Between Us .A forgotten war. An unforgettable romance.The year is 1846. After the controversial annexation of Texas, the US Army marches south to provoke war with México over the disputed Río Grande boundary.​Ximena Salomé is a gifted Mexican healer who dreams of building a family with the man she loves on the coveted land she calls home. But when Texas Rangers storm her ranch and shoot her husband dead, her dreams are burned to ashes. Vowing to honor her husband’s memory and defend her country, Ximena uses her healing skills as an army nurse on the frontlines of the ravaging war.Meanwhile, John Riley, an Irish immigrant in the Yankee army desperate to help his family escape the famine devastating his homeland, is sickened by the unjust war and the unspeakable atrocities against his countrymen by nativist officers. In a bold act of defiance, he swims across the Río Grande and joins the Mexican Army—a desertion punishable by execution. He forms the St. Patrick’s Battalion, a band of Irish soldiers willing to fight to the death for México’s freedom.When Ximena and John meet, a dangerous attraction blooms between them. As the war intensifies, so does their passion. Swept up by forces with the power to change history, they fight not only for the fate of a nation but for their future together.Heartbreaking and lyrical, Reyna Grande’s spellbinding saga, inspired by true events and historical figures, brings these two unforgettable characters to life and illuminates a largely forgotten moment in history that impacts the US-México border to this day.Will Ximena and John survive the chaos of this bitter war, or will their love be devoured along with the land they strive to defend?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "War",
    "Audiobook",
    "Adult"
  ],
  "author": "Reyna Grande",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/58438579-a-ballad-of-love-and-glory"
}