{
  "title": "The Girl Across the Wire Fence",
  "description": "1944, Amersfoort Concentration Camp, Holland. Based on a true story, the unforgettable tale of two young lovers who risked everything to keep hope alive in the very depths of hell.On a cold, dark day in a tiny Dutch village, Saskia and her boyfriend Frans watch as Nazi soldiers force thousands of prisoners towards Amersfoort Concentration Camp. Their hearts break as they see the desperate faces of innocent men and women and realise that the war is closer to them than it’s ever been before…Saskia’s father’s draper’s shop is raided when the guards suspect that he is Jewish, and Frans is soon forced to enter the concentration camp every day to collect scraps of food as it’s the only way to feed the animals on his family’s farm. But despite the growing fear the couple feel, when a prisoner begs Frans to send a letter to his beloved reassuring her he is alive, they know they must risk everything to help him. Right under the noses of the Nazi occupiers they smuggle his letter. And eventually they ferry hundreds of messages for prisoners, bringing them hope in the darkest moments of their lives.But every letter Frans gets out of the camp puts him in even more danger.And every reply Saskia manages to collect is a risk.And then Saskia is led into Kamp Amersfoort and is forced to wear a yellow star.Inside, she cannot ignore the pain of the other prisoners, and Frans knows she will be putting herself in more danger to help them – attracting the attention of the guards. The couple know they must act. Everyone says it’s impossible to escape the camp, but it’s the only option they have left. Their love has kept them together but is it enough to help them survive?",
  "genres": [
    "Historical Fiction",
    "Holocaust",
    "Historical",
    "Audiobook",
    "World War II"
  ],
  "author": "Imogen Matthews",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/58434822-the-girl-across-the-wire-fence"
}