{
  "title": "Just Pursuit: A Black Prosecutor's Fight for Fairness",
  "description": "This instant New York Times bestseller offers “a firsthand, eye-opening story of a prosecutor that exposes the devastating criminal punishment system” (Ibram X. Kendi, National Book Award–winning author of How to Be an Antiracist ) in this “compelling collection of engaging, well-written, keenly observed vignettes from [Laura Coates’s] years as a lawyer with the US Department of Justice” ( The New York Times Book Review ).When Laura Coates joined the Department of Justice as a prosecutor, she wanted to advocate for the most vulnerable among us. But she quickly realized that even with the best intentions, “the pursuit of justice creates injustice.”Coates’s experiences show that no matter how fair you try to fight, being Black, a woman, and a mother are identities often at odds in the justice system. She and her colleagues face seemingly impossible situations as they teeter between what is right and what is just.On the front lines of our legal system, Coates saw how Black communities are policed differently; Black cases are prosecuted differently; Black defendants are judged differently. How the court system seems to be the one place where minorities are overrepresented, an unrelenting parade of Black and Brown defendants in numbers that belie their percentage in the population and overfill American prisons. She also witnessed how others in the system either abused power or were abused by it—for example, when an undocumented witness was arrested by ICE, when a white colleague taught Coates how to unfairly interrogate a young Black defendant, or when a judge victim-blamed a young sexual assault survivor based on her courtroom attire.Through these “searing, eye-opening” ( People ) scenes from the courtroom, Laura Coates explores the tension between the idealism of the law and the reality of working within the parameters of our flawed legal system, exposing the chasm between what is right and what is lawful.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Social Justice",
    "Race",
    "Law",
    "Politics",
    "Audiobook"
  ],
  "author": "Laura Coates",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/58438599-just-pursuit"
}