{
  "title": "The Candy House",
  "description": "From one of the most dazzling and iconic writers of our time and winner of the Pulitzer Prize, an electrifying, deeply moving novel about the quest for authenticity, privacy, and meaning in a world where our memories are no longer our own—featuring characters from A Visit from the Goon Squad.It’s 2010. Staggeringly successful and brilliant tech entrepreneur Bix Bouton is desperate for a new idea. He’s forty, with four kids, and restless when he stumbles into a conversation with mostly Columbia professors, one of whom is experimenting with downloading or “externalizing” memory. Within a decade, Bix’s new technology, Own Your Unconscious—that allows you access to every memory you’ve ever had, and to share every memory in exchange for access to the memories of others—has seduced multitudes. But not everyone. In spellbinding linked narratives, Egan spins out the consequences of Own Your Unconscious through the lives of multiple characters whose paths intersect over several decades. Egan introduces these characters in an astonishing array of styles—from omniscient to first person plural to a duet of voices, an epistolary chapter, and a chapter of tweets. In the world of Egan’s spectacular imagination, there are “counters” who track and exploit desires and there are “eluders,” those who understand the price of taking a bite of the Candy House. Intellectually dazzling and extraordinarily moving, The Candy House is a bold, brilliant imagining of a world that is moments away. With a focus on social media, gaming, and alternate worlds, you can almost experience moving among dimensions in a role-playing game.​ Egan delivers a fierce and exhilarating testament to the tenacity and transcendence of human longing for real connection, love, family, privacy and redemption.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Book Club",
    "Audiobook",
    "Literary Fiction",
    "Contemporary",
    "Fantasy"
  ],
  "author": "Jennifer Egan",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/58437521-the-candy-house"
}