{
  "title": "The Wedding Veil",
  "description": "This “masterfully woven…literary home run” ( New York Journal of Books ) follows four women across generations, bound by a beautiful wedding veil and a connection to the famous Vanderbilt family from the New York Times bestselling author of the Peachtree Bluff series.Four women. One family heirloom. A secret connection that will change their lives—and history as they know it.Present Julia Baxter’s wedding veil, bequeathed to her great-grandmother by a mysterious woman on a train in the 1930s, has passed through generations of her family as a symbol of a happy marriage. But on the morning of her wedding day, something tells her that even the veil’s good luck isn’t enough to make her marriage last forever. Overwhelmed, she escapes to the Virgin Islands to clear her head.Meanwhile, her grandmother, Babs, is also feeling shaken. Still grieving the death of her beloved husband, she decides to move into a retirement community. Though she hopes it’s a new beginning, she does not expect to run into an old flame, dredging up the same complicated emotions she felt a lifetime ago.1914: Socialite Edith Vanderbilt is struggling to manage the luxurious Biltmore Estate after the death of her cherished husband. With 250 rooms to oversee and an entire village dependent on her family to stay afloat, Edith is determined to uphold the Vanderbilt legacy—and prepare her free-spirited daughter Cornelia to inherit it—despite her family’s deteriorating financial situation. But Cornelia has dreams of her own, and as she explores more of the rapidly changing world around her, she’s torn between upholding tradition and pursuing the exciting future that lies beyond Biltmore’s gilded gates.In the vein of Therese Anne Fowler’s A Well-Behaved Woman and Jennifer Robson’s The Gown , The Wedding Veil is “a sparkling, fast-paced joy of a book that celebrates love, family, and the right to shape one’s own destiny” (Kristin Harmel, New York Times bestselling author).",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Audiobook",
    "Book Club",
    "Contemporary",
    "Womens Fiction"
  ],
  "author": "Kristy Woodson Harvey",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/58438626-the-wedding-veil"
}