{
  "title": "Devotion",
  "description": "Prussia, 1836Hanne Nussbaum is a child of nature - she would rather run wild in the forest than conform to the limitations of womanhood. In her village of Kay, Hanne is friendless and considered an oddity . . . until she meets Thea.Ocean, 1838The Nussbaums are Old Lutherans, bound by God's law and at odds with their King's order for reform. Forced to flee religious persecution the families of Kay board a crowded, disease-riddled ship bound for the new colony of South Australia. In the face of brutal hardship, the beauty of whale song enters Hanne's heart, along with the miracle of her love for Thea. Theirs is a bond that nothing can break.The whale passed. The music faded.South Australia, 1838A new start in an old land. God, society and nature itself decree Hanne and Thea cannot be together. But within the impossible . . . is devotion.Praise for Devotion:'Devotion is utterly original. A glorious, heartbreaking love story of infinite beauty.' - Heather Rose'Hannah Kent's latest novel is stunning - full of magic and adventure. I fell in love with language again reading it. So beautiful and so raw. Devotion is impossibly good.' - Evie Wyld'Such a glorious love story. And the poetry of the landscape had, for me, a Whitmanesque sensibility. A mighty impassioned cry to love and the land.' - Sarah Winman'Devotion is rare and exquisite, both beautiful and muscular in its portrayal of love found and denied. It's a story of love as a radical act, and a celebration of place and persistence. As we've come to expect from Kent, this is masterful storytelling with pull-no-punches stakes. It's taken root in my heart.' - Kiran Millwood Hargrave'I absolutely love this book. Hannah Kent writes some of the most transcendently beautiful prose I've ever read.' - Magda Szubanski",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Lesbian",
    "Queer",
    "LGBT"
  ],
  "author": "Hannah Kent",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/58430339-devotion"
}