{
  "title": "Don't Want You Like a Best Friend",
  "description": "A swoon-worthy debut queer Victorian romance in which two debutantes distract themselves from having to seek husbands by setting up their widowed parents, and instead find their perfect match in each other—the lesbian Bridgerton/Parent Trap you never knew you needed!Gwen has a brilliant beyond brilliant idea.It’s 1857, and anxious debutante Beth has just one season to snag a wealthy husband, or she and her mother will be out on the street. But playing the blushing ingenue makes Beth’s skin crawl and she’d rather be anywhere but here.Gwen, on the other hand, is on her fourth season and counting, with absolutely no intention of finding a husband, possibly ever. She figures she has plenty of security as the only daughter of a rakish earl, from whom she’s gotten all her flair, fun, and less-than-proper party games.“Let’s get them together,” she says.It doesn’t take long for Gwen to hatch her latest scheme: rather than surrender Beth to courtship, they should set up Gwen’s father and Beth’s newly widowed mother. Let them get married instead.“It’ll be easy” she says.There’s just…one, teeny, tiny problem. Their parents kind of seem to hate each other.But no worries. Beth and Gwen are more than up to the challenge of a little twenty-year-old heartbreak. How hard can parent-trapping widowed ex-lovers be?Of course, just as their plan begins to unfold, a handsome, wealthy viscount starts calling on Beth, offering up the perfect, secure marriage.Beth’s not mature enough for this…Now Gwen must face the prospect of sharing Beth with someone else, forever. And Beth must reckon with the fact that she’s caught feelings, hard, and they’re definitely not for her potential fiancé.That’s the trouble with matchmaking: sometimes you accidentally fall in love with your best friend in the process.",
  "genres": [
    "Romance",
    "LGBT",
    "Historical Fiction",
    "Lesbian",
    "Queer",
    "Historical",
    "Historical Romance"
  ],
  "author": "Emma R. Alban",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/127823335-don-t-want-you-like-a-best-friend"
}