{
  "title": "Where Are the Children Now?",
  "description": "The legacy of the “Queen of Suspense” continues with the highly anticipated follow-up to Mary Higgins Clark’s iconic novel Where Are The Children?, featuring the children of Nancy Harmon, facing peril once again as adults.Of the fifty-six bestsellers the “Queen of Suspense” Mary Higgins Clark published in her lifetime, Where Are the Children? was her biggest, selling millions of copies and forever transforming the genre of suspense fiction. In that story, a young California mother named Nancy Harmon was convicted of murdering her two children. Though released on a technicality, she was abandoned by her husband and became such a pariah in the media that she was forced to move across the country to Cape Cod, change her identity and appearance, and start a new life. Years later her two children from a second marriage, Mike and Melissa, would go missing, and Nancy yet again became the prime suspect—but this time, Nancy was able to confront the secrets buried in her past and rescue her kids from a dangerous predator.Now, more than four decades since readers first met Nancy and her children, comes the thrilling sequel to the groundbreaking book that set the stage for future generations of psychological suspense novels. A lawyer turned successful podcaster, Melissa has recently married a man whose first wife died tragically, leaving him and their young daughter, Riley, behind. While Melissa and her brother, Mike, help their mom, Nancy, relocate from Cape Cod to the equally idyllic Hamptons, Melissa’s new stepdaughter goes missing. Drawing on the experience of their own abduction, Melissa and Mike race to find Riley to save her from the trauma they still struggle with—or worse.Just like the original, Where Are the Children Now? keeps readers guessing and holding their breath until the very last page.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Audiobook",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "Mary Higgins Clark",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/58438656-where-are-the-children-now"
}