{
  "title": "Made in Manhattan",
  "description": "From the New York Times bestselling author of the Central Park Pact comes a reverse My Fair Lady for the modern era about a pampered and privileged Manhattan socialite who must teach an unpolished and denim-loving nobody from the Louisiana Bayou how to fit in with the upper crust of New York City. Perfect for fans of Christina Lauren and Sally Thorne.Violet Townsend has always been a people pleaser. Raised in the privileged world of Upper East Side Manhattan, she always says the right things, wears the right clothes, and never rocks the boat. Violet would do anything for the people closest to her, especially her beloved grandmother. So when she asks Violet to teach the newly-discovered grandson of her friend how to fit in with New York City’s elite, Violet immediately agrees. Her goal? To get Cain Stone ready to take his place as heir to his family company…but to say he’s not exactly an eager student is an understatement.Born and raised in rural Louisiana and now making his own way in New Orleans, Cain Stone is only playing along for the paycheck at the end. He has no use for the grandmother he didn’t know existed and no patience for the uppity Violet’s attempts to turn him into a suit-wearing, museum-attending gentleman.But somewhere amidst antagonistic dinner parties and tortured tux fittings, Cain and Violet come to a begrudging understanding—and the uptight Violet realizes she’s not the only one doing the teaching. As she and Cain begin to find mutual respect for one another (and maybe even something more), Violet learns that blindly following society’s rules doesn’t lead to happiness…and that sometimes the best things in life come from the most unexpected places.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Chick Lit",
    "Fiction",
    "Adult"
  ],
  "author": "Lauren Layne",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/58438547-made-in-manhattan"
}