{
  "title": "American Reboot: An Idealist's Guide to Getting Big Things Done",
  "description": "From former US Congressman and CIA Officer Will Hurd, a “how-to guide with a prescription for getting the nation on the right footing” ( Politico ) and “a clarion call for a major political pivot” ( San Antonio Report ) rooted in the timeless ideals of bipartisanship, inclusivity, and democratic values.“Hurd has the biography and the charisma and the God-given political chops to put the Republican Party—and the rest of the country—on notice.” — THE ATLANTICIt’s getting harder to get big things done in America. The gears of our democracy have been mucked up by political nonsense. To meet the era-defining challenges of the 21st century, our country needs a reboot.In American Reboot , Hurd, called “the future of the GOP” by Politico , provides a “detailed blueprint” (Robert M. Gates, Secretary of Defense, 2006–2011) for America grounded by what Hurd calls pragmatic idealism—a concept forged from enduring American values to achieve what is actually achievable.Hurd takes on five seismic problems facing a country in crisis: the Republican Party’s failure to present a principled vision for the future; the lack of honest leadership in Washington, DC; income inequality that threatens the livelihood of millions of Americans; US economic and military dominance that is no longer guaranteed; and how technological change in the next thirty years will make the advancements of the last thirty years look trivial.Hurd has seen these challenges up close. A child of interracial parents in South Texas, Hurd survived the back alleys of dangerous places as a CIA officer. He carried that experience into three terms in Congress, where he was, for a time, the House’s only Black Republican, representing a seventy-one percent Latino swing district in Texas that runs along 820 miles of the US-Mexico border. As a cyber security executive and innovation crusader, Hurd has worked with entrepreneurs on the cutting edge of technology to anticipate the shockwaves of the future.Hurd, who the Houston Chronicles calls “a refreshing contract to the panderers, petty demagogues, and political provocateurs who reign these days,” draws on his remarkable experience to present “a call to Americans to consider the most contentious issues of our times more holistically” ( The Atlantic ). He outlines how the Republican party can look like America by appealing to the middle, not the edges. He maps out how leaders should inspire rather than fearmonger. He forges a domestic policy based on the idea that prosperity should be a product of empowering people, not the government. He articulates a foreign policy where our enemies fear us and our friends love us. And lastly, he charts a forceful path forward for America’s technological future.We all know we can do better. It’s time to hit “ctrl alt del” and start the American Reboot.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Political Science",
    "Audiobook"
  ],
  "author": "Will Hurd",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/58438568-american-reboot"
}