{
  "title": "The Fifties: An Underground History",
  "description": "A bold and original argument that upends the myth of the Fifties as a decade of conformity to celebrate the solitary, brave, and stubborn individuals who pioneered the radical gay rights, feminist, civil rights, and environmental movements, from historian James R. Gaines.In a fascinating and beautifully written series of character portraits, The Fifties invokes the accidental radicals—people motivated not by politics but by their own most intimate conflicts—who sparked movements for change in their time and our own. Among many others, we meet the legal pathfinder Pauli Murray, who was tortured by both her mixed-race heritage and her “in between” sexuality. Through years of hard work and self-examination, she turned her demons into historic victories. Ruth Bader Ginsberg credited her for the argument that made sex discrimination illegal, but that was only one of her gifts to 21st-century feminism. We meet Harry Hay, who dreamed of a national gay-rights movement as early as the mid-1940s, a time when the US, Soviet Union, and Nazi Germany viewed gay people as subversives and mentally ill. And in perhaps the book’s unlikeliest pairing, we hear the prophetic voices of Silent Spring ’s Rachel Carson and MIT’s preeminent mathematician, Norbert Wiener, who from their very different perspectives—she in the living world, he in the theoretical one—converged on the then-heretical idea that our mastery over the natural world carried the potential for disaster. Their legacy is the environmental movement.The Fifties is a dazzling and provocative work of history that transforms our understanding of a seemingly staid decade and honors the pioneers of gay rights, feminism, civil rights, and environmentalism. The book carries the powerful message that change actually begins not in mass movements and new legislation but in the lives of de-centered, often lonely individuals, who learn to fight for change in a daily struggle with themselves.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Feminism",
    "American History",
    "LGBT",
    "Audiobook"
  ],
  "author": "James R. Gaines",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/58437512-the-fifties"
}