{
  "title": "A Place to Call Home: The Amazing Success Story of Modern Orphanages",
  "description": "Jamie Foxx, Oprah Winfrey, Maya Angelou, Angelina These are just a few of the famous faces who have gotten involved in the world crisis of homeless children. What is in the best interests of the child is once again a hot topic, and finally, with a twist. Orphanages are becoming part of the discussion again, but in a modern-day form.A Place to Call Home is the untold story of present-day orphanages - now called residential education facilities (REFs) and academies - and how they fit into the spectrum of choices for children who no longer have a family to return home to every night. Noted journalist Martha Randolph Carr tells the story of five residential education facilities from the heart of urban America to the plains of Texas.Go along with Carr on an amazing journey of discovery as she opens the doors of REFs and shows the cottages, resident couples, dining halls, gyms, flute lessons, bowling trips, hayrides, karate lessons, graduations, and many more glimpses into the lives of the thousands of children who now live and thrive in these places and call them home today. Learn how the tools for successful reinvention used in these academies can be adapted by anyone who is facing great changes such as divorce or career shifts. And get solid tips from each home on how every family can raise a happier, more confident, and independent child.As Carr learns about the families that are made in residential education facilities, she relates the moving story of her relationship with her son, Louie. She discovers that though they have been pulled apart, the secrets the homes have to share could become the road map to mending their troubled relationship and allow them to embrace the constant changes required to feel fulfilled and live without regret.Part study of modern-day orphanages and part memoir, A Place to Call Home shows us an effective solution for America' troubled families. In light of the demonstrable successes of REFs in helping homeless children, Carr questions why there should be any controversy about them, especially considering the decline in the number of available foster families. She argues that REFs are a less-expensive option for public money, providing wrap-around care and structure to the world's most vulnerable population. Furthermore, REFs have succeeded in sending more children to colleges and trade schools than from the general populace. Finally, she describes her own foundation, the Shared Abundance Foundation, a national college scholarship fund for children who have grown up in US residential education facilities, plus the Family Tree Project, which works to reunite the thousands of alumni of orphanages who cannot find each other. Small vignettes of REF alumni are included between chapters. A Place to Call Home is a compelling story of many dedicated people who are succeeding in providing a better life and a hopeful future for more and more homeless children.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Martha Carr",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/584488.A_Place_to_Call_Home"
}