{
  "title": "The Savage & the Swan",
  "description": "The king of wolves was more beast than man, more tyrant than king, and so much more than he seemed.Raised to avenge his murdered parents, he’d been trained and conditioned until nothing but violence and hatred lined the walls of his dead heart.For nearly four years, I’d done all I could to help my kingdom as we faced the wolf king’s unconquerable evil—hardly anything at all.As the only heir to the Gracewood line, I’d been relegated to menial tasks that would keep me and my secrets safe.A chance to do more than fret behind our castle walls arrived when I breached them after overhearing my parents’ plans for my future. Fleeing, I unknowingly raced into a fate we’d all desperately hoped to avoid.By the time I saw him coming, it was far too late. For my family. For my kingdom.For my heart.Before I could staunch the bleeding, the king had me under his giant paw, and one wrong move after another caused those razor-sharp claws to sink deeper and deeper beneath my bruised skin.I might have been trapped, naïve, and furious, but I still had a kingdom to save—and a plan. Yet when we collided, the bloodshed, the fear, his atrocities... all of it dissolved like stardust upon the night sea.The stars had mapped out our destiny, but it didn’t matter what they or my heart wanted. I refused to see the enigmatic male, the heartless lost boy with a soul beneath the flesh of a monster. The savage king who’d destroyed everything I loved would fall—even if my heart fell with him.—Inspired by Hades and Persephone, Rumpelstiltskin, and The Swan Princess, The Savage and the Swan is not connected to any other Ella Fields novel. It’s a full-length standalone romantic fantasy containing mature content.",
  "genres": [
    "Fantasy",
    "Romance",
    "Enemies To Lovers",
    "Fantasy Romance",
    "Fae",
    "Romantasy",
    "Paranormal"
  ],
  "author": "Ella Fields",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/58443294-the-savage-the-swan"
}