{
  "title": "A Rival for Rivingdon",
  "description": "He must marry well, to secure his fortune.The Honourable Loftus Rivingdon is poised to make his debut into Society. He’s beautiful, charming, and quite the catch of the Season. If only he could find the right hat. With the zealous assistance of his doting mother, Loftus has one ambition only: to meet and marry a wealthy peer. And Loftus knows just the peer—the dauntingly handsome, infinitely fashionable Viscount Soulden. Good thing there’s nothing standing in his way.He must also marry well, to secure his fortune.The Honourable Morgan Notley is poised to make his debut into Society. He’s beautiful, charming, and quite the catch of the Season. And he has just found the perfect hat. With the zealous assistance of his doting mother, Morgan has one ambition only: to meet and marry a wealthy peer. And Morgan knows just the peer—the dauntingly handsome, infinitely fashionable Viscount Soulden. Good thing there’s nothing standing in his w—Damn it all to hell.Their ambitions collide. When Loftus and Morgan both set their sights on Soulden, the rivalry of the Season begins. Their mutual hatred escalates into spite, sabotage, and scandal, as all of Society eagerly waits to see which diamond of the first water will prevail. Except the course of true loathing, just like true love, never did run smooth. The harder they try to destroy each other, the closer they come to uncovering each other’s deepest vulnerabilities—and the more difficult it becomes to deny the burning attraction between them.A Rival for Rivingdon is the third book in the Lords of Bucknall Club series, where the Regency meets m/m romance. The Lords of Bucknall Club can be read in any order.",
  "genres": [
    "Historical",
    "Romance",
    "M M Romance",
    "Historical Fiction",
    "Enemies To Lovers",
    "Historical Romance",
    "LGBT"
  ],
  "author": "J.A. Rock",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/58468203-a-rival-for-rivingdon"
}