{
  "title": "The Japanese Myths: A Guide to Gods, Heroes and Spirits",
  "description": "An illustrated guide to the fantastic world of Japanese myths: retelling the stories and exploring how Japanese mythology has changed over time, as new gods, heroes, and spirits have entered the canon.While people around the world love Japan’s cultural exports―from manga and anime to Zen―not everyone is familiar with Japan’s unique mythology that shapes these interests, which is enriched by Shinto, Buddhism, and regional folklore. The Japanese Myths is a smart and succinct guide to the rich tradition of Japanese mythology, from the earliest recorded legends of Izanagi and Izanami with their divine offspring and the creation of Japan, to medieval tales of vengeful ghosts, through to the modern-day reincarnation of ancient deities as the heroes of mecha anime.Mythology remains a living, evolving part of Japanese society. The ways in which the people of Japan understand their myths are very different today even from a century ago, let alone over a millennium into the past. This volume not only retells these ancient stories but also considers their place within the patterns of Japanese religions, culture, and history, helping readers understand the deep links between past and present in Japan, and the ways these myths live and grow.Author Joshua Frydman takes the very earliest written myths in the Kojiki and the Nihon Shoki as his starting point, and from there traces Japan’s mythology through to post-war State Shinto, the rise of the manga industry in the 1960s, J-horror, and modern-day myths. Frydman ties in reinventions and retellings of myths that are present across all genres of contemporary Japanese culture, from its auteur cinema to renowned video games such as Okami. This book is for anyone interested in Japan and Japanese exports, as knowing its myths allows readers to understand and appreciate its culture in a new light.",
  "genres": [
    "Mythology",
    "Nonfiction",
    "Japan",
    "History",
    "Religion",
    "Japanese Literature",
    "Asia"
  ],
  "author": "Joshua Frydman",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/58470854-the-japanese-myths"
}