{
  "title": "Meet Me at the Summit: A Coming of Age Sweet Romance",
  "description": "Marly’s road trip of a lifetime doesn’t just check off bucket-list destinations, it forces her to face the grief and guilt she feels over her parents’ death.For most 19-year-olds, a cross-country trip is an offer you can’t refuse, but for Marly, it’s the last thing she wants after losing both her parents in a car accident. Nine months after their death, she would rather stay home working the retail job she hates, than deal with her loss. It’s not until family and friends corner Marly into driving her mom’s renovated 1978 VW bus across the United States that she’s ripped from her emotional paralysis.Marly goes on the trip, warily exploring the life her parents knew she always wanted—hiking mountain summits and living out her photography dreams. Her composure unravels when she meets a guy who pushes at the walls she’s so carefully built around herself.Will he be the one that causes her to face her deepest wounds and reclaim the life she thought was gone forever?Meet Me at the Summit is the first book in the Road Trip Snapshot Series. If you like sweet romance, travel, and coming of age, then you’ll love this story that will be sure to tug at your heartstrings.Start your own road trip by reading Meet Me at the Summit today!PRAISE FOR MEET ME AT THE \"What an adventure! I loved living vicariously through Marly - hiking, exploring the wilderness, learning cool facts about photography, VW buses, and of course, enjoying a sweet romance! This book addresses grief in a very raw and real way, and it made me tear up a few times. It also made me want to become a hiker and explore the world - despite the fact that I’m actually not a fan of wilderness at all in real life lol! Overall, the story hooked me and I loved all the twists and turns.\"-Bethany Atazadeh, The Stolen Kingdom Series",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Realistic Fiction",
    "Travel",
    "Mental Health"
  ],
  "author": "Mandi Lynn Bell",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/58471484-meet-me-at-the-summit"
}