{
  "title": "Don't Kill Me Because I'm Beautiful: A Near Future Suspense thriller",
  "description": "In near-future Los Angeles, a city cracking with tension, Neo-Nazies, and a nasty gang of unemployed salesgirls, the daughter of a fading movie queen is kidnapped by a mentally unbalanced cult leader who has convinced his Millennial followers that they are superstars in an alternate reality he calls, “Dynamic Potential World Time.” Brooklyn’s choice is join the cult or die. Reader’s Favorite Book Reviews ***** “What an excellent read for psychological thriller fans who are also curious about what goes on behind the beautiful faces and places, the glitz, gloom, and glamour of Hollywood… Readers follow Brooklyn’s thoughts and movements with increasing tension, and when she comes face to face with the real monsters of her childhood, she can barely breathe, and neither can we!… The complex plot is thoroughly engaging and full of twists.”IndieReader—\"Gewirtz writes with an enjoyable poison-pen tone... “…an engrossing story with a dizzying array of complicated plot lines, many of which speak to timely topics like ageism, cancel culture, and even… the Coronavirus pandemic. It's a thrilling, engaging read that will keep readers in suspense until the last page.\"Foreword/Clarion Reviews—\"Fascinating descriptions of the machinations of the movie industry also come through... Ending on a note of grace, Don’t Kill Me Because I’m Beautiful is a dark thriller in which Hollywood’s beauty belies its true evil.\" Online Book Club —\"Don't Kill Me Because I'm Beautiful is an intriguing story with an array of complicated plots and twists in a storyline that examines human behavior.\" “The book is a page-turner, full of terrors and compassion, with the sense that some of the events happened or came damned near close to happening.” —Amazon Customer“Every plot twist (and there are many) had me guessing -- and then surprised. Perfect, escapist entertainment…”— Amazon Customer“An array of fascinating, funny, and freaky characters. I highly recommend.” — Amazon Customer",
  "genres": [
    "Fiction"
  ],
  "author": "H. Gewirtz",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/58470004-don-t-kill-me-because-i-m-beautiful"
}