{
  "title": "Love Stories",
  "description": "Trent Dalton, Australia's best-loved writer, goes out into the world and asks a simple, direct question: 'Can you please tell me a love story?'A blind man yearns to see the face of his wife of thirty years. A divorced mother has a secret love affair with a travelling priest. A widower miraculously finds a three-minute video recorded by his wife before she died. A tree lopper's heart falls in a forest. A working mum contemplates taking the photographs of her late husband down from the fridge. A girl writes her last letter to the man she loves, then sets it on fire. An ageing gigolo regrets the one that got away. A palliative care nurse helps a dying woman converse with the angel at the end of her bed. A renowned 100-year-old scientist ponders the one great earthly puzzle he was never able to solve: 'What is love?'Endless stories. Human stories. Love stories.Inspired by a personal moment of profound love and generosity, bestselling author – and one of Australia's finest journalists – Trent Dalton spent two months in 2021 pounding city pavements, speaking to Australians from all walks of life and asking them one simple and direct question: 'Can you please tell me a love story?' For two straight weeks he sat at a desk with a sky-blue 1960s Olivetti typewriter, on the bustling corner of Adelaide and Albert streets, Brisbane, with a sign saying, 'Sentimental writer collecting love stories. Do you have one to share?'The result is Love Stories – a warm, wise, poignant, funny and moving book about love in all its guises, including stories, observations and reflections on lovers in parks; people in cemeteries, hospital wards, pubs and bingo halls; and newlyweds walking out of registry offices. There will be stories of people falling into love, falling out of love, and never letting go of the loved ones in their hearts. And woven through it all will be remembrances of Trent's own special moments, and of the people whose love stories have made him the man and writer he is today.A heartfelt, deep, funny, wise and tingly tribute to the greatest thing we will never understand and the only thing we will ever really need: love.",
  "genres": [
    "Nonfiction",
    "Short Stories",
    "Romance",
    "Audiobook",
    "Book Club",
    "Australia",
    "Memoir"
  ],
  "author": "Trent Dalton",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/58464268-love-stories"
}