{
  "title": "Princess and Country",
  "description": "Princess and Country\n is an emotional soulmates romance about a music superstar on the rise, trying to juggle her career and the love of her life when he needs her the most. Dahlia Ellis is not a princess. She’s just a girl trying to give her heart what it desires.- \"If I could give more than 5 stars, I would.\" (Jessica Belmont blog)- \"Where has Emmanuelle Snow been hiding all my life?! It's the second book in the series and I'm still in love with her words.\" (Tanja, OMG Reads blog)- \"Emmanuelle's magic lay in her words, and how she could squeeze my heart with a single stroke of her pen. It was magical. Not many authors could imbibe their words with emotions. This author could, and I was in awe.\" (Book Reviews by Shalini)- \"This is heartbreaking as much as it is heartwarming.\" (Lili Blissful Pages)- \"It was sweet, romantic, sad and all the feels. I laughed and cried.\" (Goodreads review)- \"Princess and Country is a lovely romance that will tug at the heartstrings and keep you reading until the end.\" (Red Pillows blog)I made a mistake. A pretty big one. Can he forgive me? But mostly, can I forgive myself?I’m not a princess. That’s the nickname he gave me when we were kids. But it doesn’t define me. I’m just a girl trying to live up to her dreams and to follow her heart. And my heart is set on him. No one else. And no matter how messy our lives get; I’m not backing up from the challenge. We’re meant to be together. No matter the cost.Fame, money, and success are my new reality. But they are not enough to patch my broken heart as I miss him. I’m here. He’s there, broken and alone. And my heart isn’t whole when we’re apart.His smile, the way he makes me feel, his stubbornness, and his love are all I crave. And all I need. The record deal and the world tour are only noises in my life. They only matter when he’s around.Just when I thought things between us could finally make sense again, life has its own game plan ready for me.Will I get through this new reality, or will music leave my life forever?If you like Mariana Zapata or Mia Sheridan, you'll love Emmanuelle Snow's Princess and Country.*All books in the series are STANDALONE NOVELS. For a better experience, read in the suggested order.*Due to mature subject, only suitable for people over 18 years of age.",
  "genres": [
    "Romance",
    "Contemporary",
    "Friends To Lovers"
  ],
  "author": "Emmanuelle Snow",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/58475763-princess-and-country"
}