{
  "title": "Our American Friend",
  "description": "11 hours, 48 minutesA mysterious first lady.The intrepid journalist writing her biography.And the secret that could destroy them both.Tired of covering the grating dysfunction of Washington and the increasingly outrageous antics of President Henry Caine, White House correspondent Sofie Morse quits her job and plans to leave politics behind. But when she gets a call from the office of First Lady Lara Caine, asking Sofie to come in for a private meeting with Lara, her curiosity is piqued. Sofie, like the rest of the world, knows little about Lara - only that Lara was born in Soviet Russia, raised in Paris, and worked as a model before moving to America and marrying the notoriously brash future president.When Lara asks Sofie to write her official biography, and to finally fill in the gaps of her history, Sofie’s curiosity gets the better of her. She begins to spend more and more time in the White House, slowly developing a bond with Lara - and eventually a deep and surprising friendship with her.Even more surprising to Sofie is the fact that Lara is entirely candid about her mysterious past. The first lady doesn’t hesitate to speak about her beloved father’s work as an undercover KGB officer in Paris - and how he wasn’t the only person in her family working undercover during the Cold War.As Lara’s story unfolds, Sofie can’t help but wonder why Lara is rehashing such sensitive information. Why to her? And why now? Suddenly Sofie is in the middle of a game of cat and mouse that could have explosive ramifications.For fans of The Secrets We Kept and American Wife, Our American Friend is a propulsive Cold War-era spy thriller crossed with a fictional biography of a First Lady. Spanning from the 1970s to the present day, traveling from Moscow and Paris to Washington and New York, Anna Pitoniak’s novel is a gripping pause resister - and a devastating love story - about power and complicity and how sometimes, the fate of the world is in the hands of the people you’d never expect.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Thriller",
    "Politics",
    "Audiobook",
    "Russia"
  ],
  "author": "Anna Pitoniak",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/58485522-our-american-friend"
}