{
  "title": "A Life Like Anybody Else: How a Man with an Intellectual Disability Fulfilled His American Dream",
  "description": "“A book told in the voice of an individual with disabilities is a rarity. This book — so rich and full, so vivid and moving, so free of cliché, so bursting with hope — is a marvel.” — Rachel Simon, New York Times bestselling author of Riding the Bus with My Sister and The Story of Beautiful Girl“Wonderful ... Informative and inspirational … A different perspective.” — Barbara E. Bromley, Ph.D., California State Polytechnic University, Pomona“Michael Long tells the truth in this book. And truth about what it means to be a human being is hard to come by.” — Nancy R. Thaler, Deputy Secretary for the Office of Developmental Programs, Commonwealth of PennsylvaniaMichael S. Long is a dreamer, and this candid memoir brings you into those dreams and into the reality of life with a disability.Born with an intellectual disability and cerebral palsy, Michael takes you right along with him as he recounts his youth and teen years — when he was mocked, ridiculed and branded “a retard” — through his young adult life, when he learned to truly believe in himself and in the power of his potential.Michael will win you over with his plainspoken style as he shares how he fulfilled his dreams — to have a home of his own, a career, and someone to love — and offers the inspiration to go after your own heart’s fondest desires, no matter what.CRITICAL PRAISE\"Every page is full of breathtaking honesty, hard-won insights, love for others so deep you feel it in your own bones, clarity about the rights of people with disabilities, and enthusiasm for all life has to offer, from education to employment to civic involvement to romance to living the American Dream. His journey from child to man is populated by many naysayers who put him down and tell him what he cannot do, but also caring parents, good friends, and one teacher who made a huge difference. As I read on, watching Michael come to believe in himself, move into an independent life, and strive to make his mark on the world, my emotions rose and fell and rose again — until he becomes a prominent and influential self-advocate and public speaker, and then, my heart soared.\" — Rachel Simon, New York Times bestselling author of Riding the Bus with My Sister and The Story of Beautiful Girl“Michael has made presentations in my Mainstreaming and Special Education classes for a number of years. I cannot praise Michael’s contributions enough ... He is an example of the results for which we all strive.” — Patricia M. Phipps, Ph.D., Professor / Special Education, California State University, Chico“Michael Long has been a visionary pioneer forging dreams of a future where people with disabilities are living, working, learning, and playing in communities that recognize the value of all people. He is an outspoken, courageous leader and ‘hero’ in the self-advocacy movement. ... I have personally witnessed the transformation in others when they have been ‘touched’ by Michael — he is a unique and generous human being.",
  "genres": [
    "Disability"
  ],
  "author": "Michael S Long",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/58480906-a-life-like-anybody-else"
}