{
  "title": "Dear Barack: The Extraordinary Partnership of Barack Obama and Angela Merkel",
  "description": "One of the great political friendships of the modern world, as told through key moments that shaped the twenty-first century Today, we know US President Barack Obama and German Chancellor Angela Merkel as two of the world’s most influential leaders, together at the center of some of the biggest controversies and most impressive advancements of our time. But while their friendship has been the subject of both scrutiny and admiration, few know the full story. Taking office at the height of the 2008 global recession, Obama was keenly aware of the fractured relationship between the US and Europe. And for her part, Merkel was suspicious of the charismatic newcomer who had captivated her country. Faced with the challenges of globalization, the two often clashed over policy, but—as the first Black president and first female chancellor—they shared a belief that democracy could uplift the world. United by this conviction, they would forge a complicated but inspiring partnership. Dear Barack is a thoroughly researched document of the parallel trajectories that led to Obama and Merkel meeting on the world stage and the trials, both personal and political, that they confronted in office. At times in the leaders’ own words, the book details such events as Merkel’s historic acceptance of the Presidential Medal of Freedom, Russia’s annexation of Crimea, and the 2013 NSA spying scandal, demonstrating the highs and lows of this extraordinary alliance. A story of camaraderie at a global scale, Dear Barack shows that it is possible for political adversaries to establish bonds of respect—and even friendship—in the service of the free world.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "How To",
    "Book Club",
    "Biography",
    "Inspirational"
  ],
  "author": "Claudia   Clark",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/58480569-dear-barack"
}