{
  "title": "What Souls Are Made Of: A Wuthering Heights Remix",
  "description": "In the Remixed Classics series, authors from marginalized backgrounds reinterpret classic works through their own cultural lens to subvert the overwhelming cishet, white, and male canon. Two British Indian teens cut off from their heritage find solace in each other in this gothic Wuthering Heights YA remix that subverts the default whiteness of the original text.Sometimes, lost things find their way home...Yorkshire, North of England, 1786. As the abandoned son of a lascar―a sailor from India―Heathcliff has spent most of his young life maligned as an \"outsider.\" Now he's been flung into an alien life in the Yorkshire moors, where he clings to his birth father's language even though it makes the children of the house call him an animal, and the maids claim he speaks gibberish.Catherine is the younger child of the estate's owner, a daughter with light skin and brown curls and a mother that nobody talks about. Her father is grooming her for a place in proper society, and that's all that matters. Catherine knows she must mold herself into someone pretty and good and marriageable, even though it might destroy her spirit.As they occasionally flee into the moors to escape judgment and share the half-remembered language of their unknown kin, Catherine and Heathcliff come to find solace in each other. Deep down in their souls, they can feel they are the same.But when Catherine's father dies and the household's treatment of Heathcliff only grows more cruel, their relationship becomes strained and threatens to unravel. For how can they ever be together, when loving each other―and indeed, loving themselves―is as good as throwing themselves into poverty and death?",
  "genres": [
    "Historical Fiction",
    "Retellings",
    "Young Adult",
    "Romance",
    "Historical",
    "Fiction",
    "Gothic"
  ],
  "author": "Tasha Suri",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/58484146-what-souls-are-made-of"
}