{
  "title": "Into the Sublime",
  "description": "\"Gripping and breathless, Into the Sublime is equal parts terrifying, claustrophobic, psychological, and cunning.\" ―Wendy Heard, author of She's Too Pretty to Burn and Dead End GirlsA new YA psychological thriller from Kate A. Boorman, author of What We Buried, about four teenage girls who descend into a dangerous underground cave system in search of a lake of local legend, said to reveal your deepest fears.When the cops arrive, only a few things are clear:- Four girls entered a dangerous cave.- Three of them came out alive.- Two of them were rushed to the hospital.- And one is soaked in blood and ready to talk.Amelie Desmarais' story begins believably enough: Four girls from a now-defunct thrill-seeking group planned an epic adventure to find a lake that Colorado locals call \"The Sublime.\" Legend has it that the lake has the power to change things for those who risk―and survive―its cavernous depths. They each had their reasons for going. For Amelie, it was a promise kept to her beloved cousin, who recently suffered a tragic accident during one of the group’s dares.But as her account unwinds, and the girls’ personalities and motives are drawn, things get complicated. Amelie is hardly the thrill-seeking type, and it appears she’s not the only one with the ability to deceive. Worse yet, Amelie is covered in someone's blood, but whose exactly? And where's the fourth girl?Is Amelie spinning a tale to cover her guilt? Or was something inexplicable waiting for the girls down there? Amelie's the only one with answers, and she's insisting on an explanation that is more horror-fantasy than reality. Maybe the truth lies somewhere in between?After all, strange things inhabit dark places. And sometimes we bring the dark with us.",
  "genres": [
    "Horror",
    "Young Adult",
    "Thriller",
    "Mystery",
    "Fiction",
    "Horror Thriller",
    "Teen"
  ],
  "author": "Kate A. Boorman",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/58484026-into-the-sublime"
}