{
  "title": "My Forbidden Shifter Match",
  "description": "Four best friend and ex-special forces shifters contact the Love Bites Dating Agency, each for different reasons. One for love, one to forget, one on a dare, and one by mistake. This is Rule’s story, the one who joined on a dare.Rule Young just got out of the military after serving for over a decade. He was sick of all of the travel, but he’d admit that he does miss being in control, being a leader. He’s still been enjoying himself, living out in the woods with his three best friends, but now that everyone else has found their mates, his life feels like it's missing something.His friends suggest that he use the Love Bites Dating Agency to find his fated mate too, but he knows what the agency will tell him.See, there’s just one problem.He already knows who his fated mate is and she’s completely off limits. Not only is he old enough to be her father, but she’s also his little sister’s best friend.Then, during one drunken night with his friends, they dare him to sign up and he’s had just enough to drink to not think too much about the consequences.When the agency contacts him with his match, he’s right. It’s Sunny, the girl he’s been in love with for most of his life. When she shows up on his doorstep, he knows that he won’t be able to hold himself back. Not if she keeps smiling at him like that.He’s using all of his self control to keep his hands to himself, but when one slip of the tongue leads them both to a discovery, he knows that he won’t ever be able to let her go. She’s his fated mate and he doesn’t care if it all started as a dare.This alpha shifter might have a forbidden mate, but all of that changes as soon as he hears her call him daddy. Now nothing is going to get in the way of him caring for his little girl. Not if he has anything to say about it.",
  "genres": [
    "Shapeshifters",
    "Paranormal",
    "Novella",
    "Paranormal Romance"
  ],
  "author": "Skye Alder",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/58487228-my-forbidden-shifter-match"
}