{
  "title": "The Secrets We Share",
  "description": "A mesmerizing, twisty suspense novel perfect for fans of Mary Kubica and Riley Sager from an acclaimed author! Explore the deep bonds—and deadly secrets—between two very different sisters haunted by the crimes of their father murdered nearly twenty years earlier…\n At first glance, Natalie Cavanaugh and Glenn Abbott hardly look like sisters. Even off-duty, Natalie dresses like a Boston cop, preferring practical clothes and unfussy, pinned-up hair. Her younger sister, Glenn, seems tailor-made for the spotlight, from her signature red mane to her camera-ready smile. Glenn has spent years cultivating her brand through her baking blog, and with the publication of her new book, that hard work seems about to pay off. But her fans have no idea about the nightmare in Glenn and Natalie’s past. Twenty years ago, their father’s body was discovered in the woods behind their house. A trauma like that doesn’t fit with Glenn’s public image. Yet, maybe someone reading her blog does know something. There have been anonymous online messages, vague yet ominous, hinting that she’s being watched. And with unsettling coincidences hitting ever closer to home, both Glenn and Natalie soon have more pressing matters to worry about, especially when a dead body is found in an abandoned building . . . Natalie is starting to wonder how much Glenn really knows about the people closest to her. But are there also secrets Natalie has yet to uncover about those she herself trusts? For two decades, she’s believed their father was murdered by their neighbor, with whom he was having an affair. But if those events are connected to what’s happening now, maybe there’s much more that Natalie doesn’t know. About their father. About their neighbors. About her friends. Maybe even about herself. But there are no secrets between sisters . . . are there?",
  "genres": [
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "Fiction",
    "Suspense",
    "Crime",
    "Audiobook"
  ],
  "author": "Edwin   Hill",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/58475481-the-secrets-we-share"
}