{
  "title": "Call and Response: The Story of Black Lives Matter",
  "description": "Call and The Story of Black Lives Matter is a broad and powerful exploration of the history of Black Lives Matter told through photographs, quotes, and informative text by New York Times bestselling authors Veronica Chambers and Jennifer Harlan.In this essential history, New York Times editors Veronica Chambers and Jennifer Harlan explore Black Lives Matter through striking photographs, in-depth reporting, stunning visual timelines and graphics, and compelling quotes. Call and Response is perfect for young readers who need an introduction to this impactful movement—and for any reader looking for concrete information on this timely topic.In 2020, the world watched history being made in the streets of America. The rallying cry of Black Lives Matter captured global attention and spurred thousands of people of all ages, races, genders, and backgrounds to stand up for major progressive social reform. The widespread protests, rooted in the call-and-response tradition of the Black community, were fueled by a growing understanding for many that systemic racism undermines the very nature of democracy. But where did this movement begin? And why, after years of work by everyday people, did the world finally begin to take notice?Call and The Story of Black Lives Matter covers the rise of Black Lives Matter and how it has been shaped by U.S. history. From the founders of the movement—Alicia Garza, Patrisse Cullors, and Opal Tometi—to the watershed moments that challenged people to take action, this book tells the story of how a hashtag became a movement. It follows the activists and organizers on their journeys, examines some of the ways that protest has been fundamental to American history, and shows how marches, rallies, and demonstrations can be vital tools for making meaningful change.",
  "genres": [
    "Nonfiction",
    "Social Justice",
    "Middle Grade",
    "Historical",
    "Juvenile",
    "History",
    "Activism"
  ],
  "author": "Veronica Chambers",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/58479963-call-and-response"
}