{
  "title": "The Lords of Easy Money: How the Federal Reserve Broke the American Economy",
  "description": "The \nNew York Times \nbestseller from business journalist Christopher Leonard infiltrates one of America’s most mysterious institutions—the Federal Reserve—to show how its policies spearheaded by Chairman Jerome Powell over the past ten years have accelerated income inequality and put our country’s economic stability at risk.  If you asked most people what forces led to today’s unprecedented income inequality and financial crashes, no one would say the Federal Reserve. For most of its history, the Fed has enjoyed the fawning adoration of the press. When the economy grew, it was credited to the Fed. When the economy imploded in 2008, the Fed got credit for rescuing us.   But here, for the first time, is the inside story of how the Fed has reshaped the American economy for the worse. It all started on November 3, 2010, when the Fed began a radical intervention called quantitative easing. In just a few short years, the Fed more than quadrupled the money supply with one to encourage banks and other investors to extend more risky debt. Leaders at the Fed knew that they were undertaking a bold experiment that would produce few real jobs, with long-term risks that were hard to measure. But the Fed proceeded anyway…and then found itself trapped. Once it printed all that money, there was no way to withdraw it from circulation. The Fed tried several times, only to see the market start to crash, at which point the Fed turned the money spigot back on. That’s what it did when COVID hit, printing 300 years’ worth of money in a few short months.   Which brings us to Ten years on, the gap between the rich and poor has grown dramatically, inflation is raging, and the stock market is driven by boom, busts, and bailouts. Middle-class Americans seem stuck in a stage of permanent stagnation, with wage gains wiped out by high prices even as they remain buried under credit card debt, car loan debt, and student debt. Meanwhile, the “too big to fail” banks remain bigger and more powerful than ever while the richest Americans enjoy the gains of a hyper-charged financial system.   The Lords of Easy Money “skillfully” (The Wall Street Journal) tells the “fascinating” (The New York Times) tale of how quantitative easing is imperiling the American economy through the story of the one man who tried to warn us. This is the first inside story of how we really got here—and why our economy rests on such unstable ground.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Finance",
    "Business",
    "History",
    "Politics",
    "Money"
  ],
  "author": "Christopher Leonard",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/58485511-the-lords-of-easy-money"
}