{
  "title": "Meow Is Not a Cat",
  "description": "A wild story about being different, for ages 4-8.Meow Is Not Cat is a picture book about a clever kid who learns to embrace their unique qualities on a field trip. Meow, the main character, is puzzled as to why everyone calls them Meow. They suspect it's because they have cat-like ears on their hat, but their snarky feline friend has other ideas.Readers deeply appreciate how fun the book is to read, the stunning illustrations, and how it offers a positive view of a neurodiverse character. Many stories about neurodiverse kids feature adults “correcting” them. In this story, Meow changes an adult’s perspective.Praise for Meow Is Not a CatKirkus Reviews calls it, “An appealingly offbeat book with a strong message about appreciating unusual thinking.”The Children’s Book Review says, “Thanks to the clever illustrations and relatable characters, this book will be enjoyed by readers of all ages. Meow is Not a Cat is also a valuable reference for introducing the concept of neurodivergence both at home and in the classroom...\"The StoryMeow's teacher, Ms. Snickety, thinks Meow doesn't listen, but Meow believes they \"just listen differently.\" On a field trip to see wildlife, Ms. Snickety gives clear instructions on feeding the monkeys. But when no bananas are left for the children, Meow decides to implement another one of Ms. Snickety’s teachings, “sharing is caring.”The monkeys fail to grasp the concept of sharing. When Meow takes back a banana, it leads to a comical and chaotic chase. Somehow Meow ends up with all the bananas. Meow tries everything to escape, including some more literal interpretations of Ms. Snickey’s teachings.As the confusion escalates, Meow eventually nails it. By having all the kids get into a straight line - just like Ms, Snickety always says, and combining that with some outlandish banana cannon solution, Meow is able to ensures that everyone, including the monkeys, gets their fair share.♡This book celebrates kids who think differently and has a playful, colorful art style that matches the whimsical story.",
  "genres": [
    "Picture Books",
    "Childrens"
  ],
  "author": "Kelly Tills",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/58483618-meow-is-not-a-cat"
}