{
  "title": "The Seafaring Lady's Guide to Love",
  "description": "What would you do for a little adventure?A rebellious young lady...Miss Rosalind Gardner's two older sisters are happily married, but she has no plans to follow in their footsteps anytime soon. Determined to see the world before settling down, she sets out on an ocean voyage to distant lands. Exuberant, warm-hearted, and ceaselessly optimistic, Rosalind has spent her life waiting for this opportunity. But it's one thing to dream about adventure and another thing to live it—especially when doing so means living in close quarters with the coldest, most arrogant man alive.\n...and a heartless hero...\nSir Philip Calvert has already lived two very different lives. A rebellious rake in his youth, he was thoroughly reformed when he fell in love with his first wife, only to lose her tragically. When he undertakes a perilous sea voyage, Philip is horrified to find himself boxed in with an uninhibited hoyden who has used his name to secure her passage. Having sworn off love and marriage, his resolve will be tested by this high-spirited woman whose passion and beauty threaten to pull him into uncharted waters.\n...are about to set sail on a journey into love.\nOut on the deep blue sea, with nowhere to run and nowhere to hide, small berths and narrow decks bring hidden desires into the light... along with dark secrets better left buried.Meet the Gardner Girls:Four devoted sisters must face pride, peril, and adventure before each finds a love that conquers all.The Gardner Girls series is composed of standalone stories which may be read in any order. The Seafaring Lady’s Guide to Love is the third in the series chronologically.\nBook Details\nNo cheating, no cliffhangers, and a happily ever after.Heat Level: Sweet-with-Heat, Slow Burn",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Fiction",
    "Historical Fiction",
    "Adult"
  ],
  "author": "Fenna Edgewood",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/58487999-the-seafaring-lady-s-guide-to-love"
}