{
  "title": "Glory",
  "description": "From the award-winning author of the Booker-prize finalist We Need New Names, a blockbuster of a novel that chronicles the fall of an oppressive regime, and the chaotic, kinetic potential for real liberation that rises in its wake.Glory centers around the unexpected fall of Old Horse, a long-serving leader of a fictional country, and the drama that follows for a rumbustious nation of animals on the path to true liberation. Inspired by the unexpected fall by coup, in November 2017, of Robert Mugabe, Zimbabwe's president of nearly four decades, Bulawayo's bold, vividly imagined novel shows a country imploding, narrated by a chorus of animal voices who unveil the ruthlessness and cold strategy required to uphold the illusion of absolute power, and the imagination and bullet-proof optimism to overthrow it completely.As with her debut novel We Need New Names, Bulawayo's fierce voice and lucid imagery immerses us in the daily life of a traumatized nation, revealing the dazzling life force and irrepressible wit that lies barely concealed beneath the surface of seemingly bleak circumstances. At the center of this tumult is Destiny, who has returned to Jidada from exile to bear witness to revolution--and focus on the unofficial history and the potential legacy of the women who have quietly pulled the strings in this country.The animal kingdom--its connection to our primal responses and resonance in the mythology, folktales, and fairytales that define cultures the world over--unmasks the surreality of contemporary global politics to help us understand our world more clearly, even as Bulwayo plucks us right out of it. Glory is a blockbuster, an exhilarating ride, and crystalizes a turning point in history with the texture and nuance that only the greatest of fiction can.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Literary Fiction",
    "Zimbabwe",
    "Politics",
    "Contemporary",
    "Audiobook"
  ],
  "author": "NoViolet Bulawayo",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/58491879-glory"
}