{
  "title": "Midnight in the Garden of the Prince: A Regency Cinderella Retelling",
  "description": "A realistic, historical Cinderella alive during the Regency era....Amelia Wren’s life alone with her papa is perfect the way it is, but because he has been a widower for such a long time, he decides to marry a woman with two daughters. The trouble for Amelia is her new Stepmother and stepsisters have no interest in treating her kindly.One day, her father is critically injured in a carriage accident and dies suddenly, leaving her at the mercy of her ruthless Stepmother and stepsisters. Stepmother puts her to work in the kitchen all day just to keep her from distracting the suitors meant for her daughters. Amelia is made a prisoner in her own home, forgotten by the rest of the world.But one fortunate evening, Stepmother unwittingly meets Amelia’s long-lost great aunt, Lady Bryant—a socially powerful marchioness who insists on debuting her niece to the beau monde during the London Season. Amelia leaves to stay in her home, finally free of her wicked Stepmother—or is she?His Royal Highness Prince Rufus is the youngest and only single prince in all of England. The entire country’s maidens are in a tizzy trying to wed him, but when he catches sight of Amelia at a friend’s ball, he knows she is meant for him. He will do whatever it takes to convince his mother, the Queen, to allow their marriage.Stepmother is not amused by the prince’s infatuation with her stepdaughter. In fact, she will see that England’s only eligible bachelor prince is wed to one of her two daughters, not Amelia. No act to drive them apart is too depraved for her.But if Prince Rufus fails to obtain the Queen’s approval, Stepmother will force Amelia into an odious marriage, and all hope of her living happily ever after with her Prince Charming will be lost forever.Balls, Belles and Beaux... Midnight in the Garden of the Prince is a clean historical romance that is approximately 90,000 words. Catherine Keaton's books always have a happily-ever-after!",
  "genres": [
    "Historical Romance",
    "Cinderella",
    "Fairy Tales",
    "Historical"
  ],
  "author": "Catherine Keaton",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/58502131-midnight-in-the-garden-of-the-prince"
}