{
  "title": "The High 5 Habit: Take Control of Your Life with One Simple Habit",
  "description": "AN INSTANT NEW YORK TIMES BESTSELLER   · INSTANT INTERNATIONAL BESTSELLER In her global phenomenon The 5 Second Rule, Mel Robbins taught millions of people around the world the five second secret to motivation. Now she's back with another simple, proven tool you can use to take control of your life: The High 5 Habit.Don't let the title fool you. This isn't a book about high fiving everyone else in your life. You're already doing that. Cheering for your favorite teams. Celebrating your friends. Supporting the people you love as they go after what they want in life.Imagine if you gave that same love and encouragement to yourself. Or even better, you made it a daily habit.You'd be unstoppable.In this book, Mel teaches you how to start high fiving the most important person in your life, the one who is staring back at you in the mirror: YOURSELF.If you struggle with self-doubt (and who doesn't?) ...If you're tired of that nagging critic in your head (could somebody evict them already?) ...If you're wildly successful but all you focus on is what's going wrong (you're not alone) ...If you're sick of watching everybody else get ahead while you sit on the couch with your dog (don't bring your dog into this) ......Mel dedicates this book to you.Using her signature science-backed wisdom, deeply personal stories, and the real-life results that The High 5 Habit is creating in people's lives around the world (and you'll meet a lot of them throughout this book), Mel will teach you how to make believing in yourself a habit so that you operate with the confidence that your goals and dreams demand.The High 5 Habit is a simple yet profound tool that changes your attitude, your mindset, and your behavior. So be prepared to laugh and learn as you take steps to immediately boost your confidence, happiness, and results.It's time to give yourself the high fives, celebration, and support you deserve.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Psychology",
    "Audiobook",
    "Business",
    "Productivity"
  ],
  "author": "Mel Robbins",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/58505300-the-high-5-habit"
}