{
  "title": "Practice These Principles: Living the Spiritual Disciplines and Virtues in 12-Step Recovery to Achieve Spiritual Growth, Character Development, and Emotion Sobriety – Step 4",
  "description": "Know ThyselfWhy are we the way we are, and why do we do the things we do? These are the fundamental questions we humans have been asking ourselves from the dawn of recorded history. The call to answer them can be traced back over 2,500 years to an injunction inscribed in a Greek temple. AA’s Step 4 follows in the tradition of self-examination which emerged in response to that call. Borrowing from religion, philosophy, and psychology, it’s the foundation of an inventory process which extends over eight Steps, reaches into every important area of life, and continues for as long as we live. This constitutes the most comprehensive and effective program of self-knowledge and self-transformation that has ever been devised. Though initially meant for alcoholics, it’s available to all who wish to work it. And therein lies the rub. Step 4 takes a lot of work. In it we are digging into a wide range of experience over a long period of time—the entirety of our past lives, in fact. An inventory of such depth and breadth is a daunting task. It’s easy to get confused, sidetracked, overwhelmed, and discouraged. Many of us procrastinate. Some never get started. Others abandon it early on. But even if we have gone through it once, we have barely begun to scratch the surface.For various reasons, these first attempts are very limited. That’s why later in sobriety many of us feel the need to try again. Though sober, our recovery may have stalled. Maybe there are serious things about the past we skipped the first time around. Perhaps important issues remain unresolved which are still affecting us today. Or maybe we’ve gotten in trouble again, perhaps even relapsed. In any case, we feel we have to go back and take another hard look at ourselves. And yet, we’re not sure we have the tools we need. We might have 10, 20, or 30 years in the program, but our understanding of Step 4 may not be much better than it was the first time we did it. This book is for those alcoholics. It’s also for those, alcoholic or not, who wish to change and to grow and who are willing to practice the principles which have helped millions to accomplish that and to live better and happier lives.",
  "genres": [],
  "author": "Ray A.",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/58503722-practice-these-principles"
}