{
  "title": "Ways and Means: Lincoln and His Cabinet and the Financing of the Civil War",
  "description": "From renowned journalist and master storyteller Roger Lowenstein, a revelatory financial investigation into how Lincoln and his administration used the funding of the Civil War as the catalyst to centralize the government and accomplish the most far-reaching reform in the country's history\nUpon his election to the presidency, Abraham Lincoln inherited a country in crisis. Even before the Confederacy's secession, the United States Treasury had run out of money. The government had no authority to raise taxes, no federal bank, no currency. But amid unprecedented troubles Lincoln saw opportunity--the chance to legislate in the centralizing spirit of the \"more perfect union\" that had first drawn him to politics. With Lincoln at the helm, the United States would now govern \"for\" its people: it would enact laws, establish a currency, raise armies, underwrite transportation and higher education, assist farmers, and impose taxes for them. Lincoln believed this agenda would foster the economic opportunity he had always sought for upwardly striving Americans, and which he would seek in particular for enslaved Black Americans.Salmon Chase, Lincoln's vanquished rival and his new secretary of the Treasury, waged war on the financial front, levying taxes and marketing bonds while desperately battling to contain wartime inflation. And while the Union and Rebel armies fought increasingly savage battles, the Republican-led Congress enacted a blizzard of legislation that made the government, for the first time, a powerful presence in the lives of ordinary Americans. The impact was revolutionary. The activist 37th Congress legislated for homesteads and a transcontinental railroad and involved the federal government in education, agriculture, and eventually immigration policy. It established a progressive income tax and created the greenback--paper money. While the Union became self-sustaining, the South plunged into financial free fall, having failed to leverage its cotton wealth to finance the war. Founded in a crucible of anticentralism, the Confederacy was trapped in a static (and slave-based) agrarian economy without federal taxing power or other means of government financing, save for its overworked printing presses. This led to an epic collapse. Though Confederate troops continued to hold their own, the North's financial advantage over the South, where citizens increasingly went hungry, proved decisive; the war was won as much (or more) in the respective treasuries as on the battlefields.Roger Lowenstein reveals the largely untold story of how Lincoln used the urgency of the Civil War to transform a union of states into a nation. Through a financial lens, he explores how this second American revolution, led by Lincoln, his cabinet, and a Congress studded with towering statesmen, changed the direction of the country and established a government of the people, by the people, and for the people.",
  "genres": [
    "History",
    "Economics",
    "Nonfiction",
    "Civil War",
    "American History",
    "Finance",
    "Politics"
  ],
  "author": "Roger Lowenstein",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/58494811-ways-and-means"
}