{
  "title": "O Pazo Baleiro (Sopa de libros / Soup of books)",
  "description": "A Nicolás anóxao a escola pero pásao fenomenal cando visita seu Tío Delio, que é reloxeiro e vive nun vello vagón de tren, que el mesmo amañou. Alí, tío e sobriño consultan libros e pasan os mellores momentos observando o curioso mecanismo dos reloxos e a engrenaxe das súas diferentes pezas. Un día, na caixa dun reloxo antigo, descobren un antigo cofre que contén unhas cartas de amor –que fan referencia a desavinzas familiares, herdos e a un obxecto misterioso–, un pano cunhas iniciais bordadas que envolve unha presa de xoais e unhas moedas antigas. Daquela deciden investigar. Para iso conta con Ramiro, Sol e Társila, os amigos de Nicolás. As esculcas levaranos a contactar cun anticuario da cidade e despois cunha señora pertencente a unha familia nobre que era a propietaria dun pazo deshabitado de Eiravela, de onde inicialmente procede o reloxo. Todos os catro acodirán ao pazo nunha misión un tanto arriscada, pero chea de sorpresas. Xabier P. Docampo en O Pazo Baleiro deixa albiscar a súa afección pola literatura de aventuras cando eses catro amigos tratan de desenredar xuntos un misterio da aldea onde viven e que se remonta a tempos moi afastados. Docampo retrata con eses catro nenos catro universos diferentes: a rapaza tímida, a valente, o neno independente e o honesto, catro calidades coas que os rapaces conseguirán o que se propoñen. Pero aínda hai algo máis. Amais dunha historia de aventuras tamén o é de solidariedade, de comprensión e de respecto á diferencia pois o misterio comézao Delio, que é o retrato dun ser marxinal, extravagante, incomprendido, pero apaixonado polo seu traballo e cómplice co seu sobriño, a quen lle demostra que o importante é actuar como un pensa. En O Pazo Baleiro, como nas mellores novelas de aventuras, o lector ou a lectora sente que hai algo prohibido. Unha novela de corte clásico que de seguro ha cumprir un dos desexos do autor. “Gústame pensar que para cada libro que escribo existe alguén a quen lle gusta lelo”.",
  "genres": [],
  "author": "Xabier P. DoCampo",
  "average_rating": "2.88",
  "url": "https://www.goodreads.com/book/show/5849205-o-pazo-baleiro-sopa-de-libros-soup-of-books"
}