{
  "title": "Animal Instincts",
  "description": "Thirty year old veterinarian Beckett Rosa runs a small town animal clinic. When he isn’t at his beloved home away from home, Lakeside Animal Hospital, he spends his time mixing it up and basking in the beauty of the single life.He’s an insufferable flirt, a proud ladies man, and completely incapable of toning down his over-friendly demeanour for the sake of not making a scene, but what happens when Tabitha Lawrence—plain, smart, and in a committed relationship—applies to work at Lakeside?Tabitha breezed through her degree and boasts a number of years experience as a vet. Not to mention, she’ll be the first to point out the graduate certificate framed and hung on her wall—with honors, of course. But when she moves to a town that requires only one vet, she settles for the far inferior position of ‘assistant’, though she holds high hopes to soon join her new boss in the examination room.It will only be a matter of time before Beckett sees her competence and begs her to join him.Right?Unfortunately, Tabitha’s plans go wayward when Beckett has no interest in bringing in a new vet. Instead, his demands lean more toward coffee collection, phone answering, and social calendar organizer, and he has zero guilt that the dates he forces Tabby to schedule tend to rhyme; Jana, Lana, Drama.Tabitha refuses to play a role in Beckett’s disastrous circus act, but when she sets out to inform him of that, more than animal instincts activate.⭐️⭐️⭐️⭐️⭐️ \"Once again I can’t even begin to tell you how amazing Emilia Finn is. The stories are incredible! Once you start you can’t stop til the end only to have the end begging you for the next! Keep ‘em coming! Breathless! Sexy! Sassy! Heated flames!\" -DANIELLE ESTEN, Amazon Review⭐️⭐️⭐️⭐️⭐️\"Emilia Finn has done it again! Another amazing book. I loved this story so much. The chemistry and laughs are plenty in this one.\" -Nicole mink, Amazon Review⭐️⭐️⭐️⭐️⭐️\"With a story that includes an accidental late night drunken phone call, a family that lives in a murder house, a boyfriend who seems reluctant to move, and a pregnant horse about to give birth, you really can’t ask for more. Full of humor, passion, and emotion, Animal Instincts is a must read.\" -Susan D., Amazon Review⭐️⭐️⭐️⭐️⭐️\"This book made me laugh so hard. Watching the love between Beckett and Tabby grow was intense, hilarious and heart warming. 100% worth the read\" -Kindle Customer, Amazon Review",
  "genres": [
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Emilia Finn",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/58488139-animal-instincts"
}