{
  "title": "How It Will Be",
  "description": "Bron is supposed to be dead. His best friend threw him from the sky to land at the feet of his king in a war Bron never asked for. It’s only three left in his Murder now, and everyone knows the Crow Blooded only survive in numbers. Betrayed by his people, Bron looks to the bears he was supposed to kill for a forbidden alliance, but he and Krome can’t build a crew on their own. He hires a ghost from his past with a special set of skills. His childhood friend can draw in the monsters he needs to protect his king, but Ren has changed in the fifteen years since he’s seen her last. The little pipsqueak that followed him around all those years ago has turned into a sass-filled, tough-as-nails, sensitive-in-surprising-ways vixen who catches his attention and holds it from the second she drives up to his cabin. The only problem? For reasons unknown to him, she’s holding a mighty big grudge on Bron. And as he tries to draw her closer, he slowly discovers nothing was ever what it seemed. Caught right in the middle of forming an alliance that will bring all of the War Birds down on him, and wanting to protect the only woman who can save his damaged soul, Bron has to decide exactly how far he will go for loyalty.Ren is a coveted female crow who holds the secrets of every Murder she’s been passed around to. On the run from a possessive king, she finds herself answering a call from an old friend she’s vowed never to forgive. The worst part? He doesn’t even realize what he’s done to her. In an unfortunate turn of events, the man she hates is the man she’s safest with now. And as she realizes the alliance he’s trying to build for his king, she starts to see Bron clearly for the first time. He’s no pushover, and he’d not the crow boy she remembers. Now he’s a man whose been betrayed, and destroyed, and has reinvented himself into one of the most relentless War Birds in existence. Heaven help anyone who comes for his king now. Bron’s loyalty knows no bounds, and that is made even clearer when she understands what he’s really doing for her.The Oath of Bane isn’t over.The Monsters are coming.The old Murder is dead.Long live the new Crew.Content Warning: Explicit love scenes, naughty language, and piles of sexy shifter secrets. Intended for mature audiences.",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Urban Fantasy",
    "Fantasy"
  ],
  "author": "T.S. Joyce",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/58508649-how-it-will-be"
}