{
  "title": "Zero O'Clock",
  "description": "Sixteen-year-old Geth Montego must carve a new path for herself in a world turned upside down by the COVID pandemic and Black Lives Matter protests.An insightful, eye-opening, and inventive story. C.J. Farley has penned a novel that sheds an important light on real issues facing young people today.--Angie Thomas, author of \nThe Hate U Give\nZero O'Clock is a beautiful and timely YA novel that is both heartbreaking and whip smart, a glimpse into the world of virtual friendship, classrooms, and pop stardom.--Jeanne McWilliams Blasberg, author of The NineThoughtful, provocative, and pounding with the fast-paced beat of a sharp-witted adolescent mind, Zero O'Clock is the story of a Jamaican-American teen girl at the early epicenter of the COVID-19 pandemic in New Rochelle, New York. C.J. Farley has created an irresistible heroine in Geth Montego. Simmering with justifiable anger at everything from the cancellation of her senior prom to racial injustices and police brutality, Geth manages to overcome grief, anxiety, and confusion to discover a new sense of herself and her ability to create change.--Karen Dukess, author of The Last Book PartyZero O'Clock seems to have a direct line into the mindset of a modern teenager. I enjoyed it immensely!--Alex Wheatle, author of Cane WarriorsGeth Montego only has three friends. There's her best friend Tovah, who's been acting weird ever since they started applying to the same colleges. Then there's Diego, who she wants to ask to prom, but if she does it could ruin everything. And there's the K-pop band BTS, who she's never seen up close but she's certain she'd be BFFs with every member of the group if she ever met them for real.Then Geth's small town of New Rochelle, New York, becomes the center of a virus sweeping the world. Schools are closed, jobs are lost, and the only human contact she has is over Zoom. After a confrontation with cops, Geth gets caught up in the Black Lives Matter movement and finds herself having to brave the dangers she's spent months in quarantine trying to avoid.Geth's friends, family, and hometown are upended by the pandemic and the protests. Geth faces a choice: Is she willing to risk everything to fight for her beliefs? And what exactly does she believe in, anyway?",
  "genres": [
    "Young Adult",
    "Fiction",
    "Contemporary",
    "Teen",
    "African American",
    "New York",
    "Coming Of Age"
  ],
  "author": "C.J. Farley",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/58516085-zero-o-clock"
}