{
  "title": "The Blood Trials",
  "description": "Blending fantasy and science fiction, N. E. Davenport's fast-paced, action-packed debut kicks off a duology of loyalty and rebellion, in which a young Black woman must survive deadly trials in a racist and misogynistic society to become an elite warrior.It's all about blood.The blood spilled between the Republic of Mareen and the armies of the Blood Emperor long ago. The blood gifts of Mareen's deadliest enemies. The blood that runs through the elite War Houses of Mareen, the rulers of the Tribunal dedicated to keeping the republic alive.The blood of the former Legatus, Verne Amari, murdered.For his granddaughter, Ikenna, the only thing steady in her life was the man who had saved Mareen. The man who had trained her in secret, not just in martial skills, but in harnessing the blood gift that coursed through her.Who trained her to keep that a secret.But now there are too many secrets, and with her grandfather assassinated, Ikenna knows two things: that only someone on the Tribunal could have ordered his death, and that only a Praetorian Guard could have carried out that order.Bent on revenge as much as discovering the truth, Ikenna pledges herself to the Praetorian Trials--a brutal initiation that only a quarter of the aspirants survive. She subjects herself to the racism directed against her half-Khanaian heritage and the misogyny of a society that cherishes progeny over prodigy, all while hiding a power that--if found out--would subject her to execution...or worse. Ikenna is willing to risk it all because she needs to find out who murdered her grandfather...and then she needs to kill them.Mareen has been at peace for a long time...Ikenna joining the Praetorians is about to change all that.Magic and technology converge in the first part of this stunning debut duology, where loyalty to oneself--and one's blood--is more important than anything.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Young Adult",
    "Romance",
    "Fiction",
    "Adult",
    "Audiobook"
  ],
  "author": "N.E. Davenport",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/58511056-the-blood-trials"
}