{
  "title": "Deflecting the Duke",
  "description": "Welcome to the new world from Alexa Aston—Dukes Done Wrong.Accused of something they never did. Five boys banished from their homes in disgrace, to the place where they find the brothers of their heart—and build new family ties that will last a lifetime.An angry army spy who becomes a reluctant duke. A virgin widow who seeks a husband who will give her children. An attraction that leads to passion... and love...Wyatt Stanton served as a spy for Wellington until he receives word of his brother’s death. Reluctantly, he returns to England as the Duke of Amesbury and to Amberwood, a place he once loved and was banished from after his brother falsely accused Wyatt of burning down the family stables with over two dozen horses inside. His soul seared by war, the man who lived for danger must now become a member of Polite Society and find himself a duchess so he has an heir.Meadow Grant’s father sold her to Lord Selfridge so he could pay his gambling debts. Selfridge collects beautiful things, and Meadow is the most beautiful girl of the Season. Once he possessed her, Selfridge lost interest and moved on to other things. Now a widow, the resilient Meadow is ready to make her own choice this time and find a husband who yearns for children as much as she does. Though attracted to the Duke of Amesbury, he is far too arrogant and conceited for her tastes, even if he does kiss well.Wyatt is bored with all the younger women on the Marriage Mart, but he believes the beautiful and more mature Lady Selfridge fits his idea of a suitable duchess. The fact that he is attracted to her and she gets along well with his friends only confirms she is the one. Meadow wants to be courted, though, and Wyatt is up to the challenge, relentless in his pursuit, even liking how Meadow makes him work to earn her favor.Though neither looks for love, will the reckless Wyatt and spitfire Meadow realize love has found them and will flourish, given the chance?Find the answer in Deflecting the Duke, Book 2 in Dukes Done Wrong.Each book in Dukes Done Wrong is a standalone story that can be enjoyed out of order and can be read for free in Kindle Unlimited.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Audiobook",
    "M F Romance",
    "Fiction"
  ],
  "author": "Alexa Aston",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/58507440-deflecting-the-duke"
}