{
  "title": "Silvermist: Lady of the Lakes",
  "description": "Romantic Fantasy, Arthurian Fantasy, High Fantasy, Historical Fantasy, Fantasy Romance, Epic Fantasy, YA Fantasy, YA Fantasy RomanceJess Lochlen is on a double mission – to recover her captured infant cousin, and to determine if treachery is stalking the Rogrovian throne. With their divided loyalties to different princes, her cousins turn out to be more hindrance than help. So when a young fugitive attaches himself to her, she is not as quick to be rid of him as she might.But as his feelings for her grow, and their journey across his homeland becomes a race against time – to save not just her cousin but an heir to the throne – can she trust him to be who he claims to be? For otherworldly creatures accosting them along the way are strangely wary of him. Will he turn out to be the support she desperately needs, or an error of judgment that will have disastrous consequences for the entire realm and beyond?Excerpt:Just a song. Just another sad, love song, that was all, naught more.But a song that made a grown man’s color fade from his face. A song that made his lady cry. A song that spoke of love and loss, and more, of worlds where time was a factor gone astray. Where a traveling stranger went away for a hand of years and returned to find half a century gone by.Different worlds kept different times, he supposed that was the moral behind the tale. As if there were truly worlds and worlds, as natural as lands and lands.He ran his fingers through his hair, thinking and thinking himself to sleep. Dreams assailed him throughout that long night, dreams of him and his lady separated, rent apart by the vagaries of time and space.And in his dreams, he kept losing her, following and searching the heavens from afar. And in his dreams, the Argentene no longer shone, less the one significant star.And in his dreams, his lady’s footsteps faded into the Lakes, the unhallowed lakes through which he could not follow. And in his dreams, the seasons slowly passed, till the fertile earth turned fallow. And still, still, he found her not.And in his dreams, he feared he would grow old while searching his world for her. Till he threw himself in one unhallowed lake, and passaged his way to the stars.",
  "genres": [
    "Fantasy"
  ],
  "author": "Cassia Hall",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/58512412-silvermist"
}