{
  "title": "The Last Hero",
  "description": "The flame of rebellion burns across the solar system in this dazzling conclusion to Linden A. Lewis’s stunning First Sister trilogy perfect for fans of Red Rising, The Handmaid’s Tale, and The Expanse.\nAstrid is finally free of the Sisterhood, yet her name carries on. She’s called the Unchained by those she’s inspired and the Heretic by those who want her voiceless once more. Now Astrid uses knowledge of the Sisterhood’s inner workings against them, aiding the moonborn in raids against abbeys and Cathedrals, all the while exploring the mysteries of her forgotten past. However, the Sisterhood thrives under the newly appointed Mother Lilian I, who’s engaged in high-stakes politics among the Warlords and the Aunts to rebuild the Sisterhood in her own image. But the evil of the Sisterhood can’t be purged with anything less than fire.... Meanwhile, Hiro val Akira is a rebel without an army, a Dagger without a Rapier. As protests rock the streets of Cytherea, Hiro moves in the shadows, driven by grief and vengeance, as they hunt the man responsible for all their pain: their father.... Transformed by the Genekey virus, Luce navigates the growing schism within the Asters on Ceres. Hurting in her new body, she works to bridge two worlds seemingly intent on mutual destruction. All while mourning her fallen brother, though Lito sol Lucius’s memory may yet live on. Yet Souji val Akira stands in judgment on them all, plotting the future for all of humanity, and running out of time before war erupts between the Icarii and Geans. But can even the greatest human intellect outwit the Synthetics? The emotional First Sister trilogy comes to a sensational climax in this final installment, and is a must-read for science fiction fans everywhere.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Queer",
    "Adult",
    "LGBT",
    "Fiction",
    "Audiobook"
  ],
  "author": "Linden A. Lewis",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/58509068-the-last-hero"
}