{
  "title": "The Partnership: George Marshall, Henry Stimson, and the Extraordinary Collaboration That Won World War II",
  "description": "On September 1, 1939, the day World War II broke out in Europe, Gen. George Marshall was sworn in as chief of staff of the U.S. Army. Ten months later, Roosevelt appointed Henry Stimson secretary of war. For the next five years, from adjoining offices in the Pentagon, Marshall and Stimson headed the army machine that ground down the Axis. Theirs was one of the most consequential collaborations of the twentieth century. A dual biography of these two remarkable Americans, The Partnership tells the story of how they worked together to win World War II and reshape not only the United States, but the world.The general and the secretary traveled very different paths to power. Educated at Yale, where he was Skull and Bones, and at Harvard Law, Henry Stimson joined the Wall Street law firm of Elihu Root, future secretary of war and state himself, and married the descendant of a Founding Father. He went on to serve as secretary of war under Taft, governor-general of the Philippines, and secretary of state under Hoover. An internationalist Republican with a track record, Stimson ticked the boxes for FDR, who was in the middle of a reelection campaign at the time. Thirteen years younger, George Marshall graduated in the middle of his class from the Virginia Military Institute (not West Point), then began the standard, and very slow, climb up the army ranks. During World War I he performed brilliant staff work for General Pershing. After a string of postings, Marshall ended up in Washington in the 1930s and impressed FDR with his honesty, securing his appointment as chief of staff.Marshall and Stimson were two very different men who combined with a dazzling synergy to lead the American military effort in World War II, in roles that blended politics, diplomacy, and bureaucracy in addition to warfighting. They transformed an outdated, poorly equipped army into a modern fighting force of millions of men capable of fighting around the globe. They, and Marshall in particular, identified the soldiers, from Patton and Eisenhower to Bradley and McNair, best suited for high command. They helped develop worldwide strategy and logistics for battles like D-Day and the Bulge. They collaborated with Allies like Winston Churchill. They worked well with their cagey commander-in-chief. They planned for the postwar world. They made decisions, from the atomic bombs to the division of Europe, that would echo for decades. There were mistakes and disagreements, but the partnership of Marshall and Stimson was, all in all, a bravura performance, a master class in leadership and teamwork.In the tradition of group biographies like the classic The Wise Men, The Partnership shines a spotlight on two giants, telling the fascinating stories of each man, the dramatic story of their collaboration, and the epic story of the United States in World War II.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Biography"
  ],
  "author": "Edward Farley Aldrich",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/58518251-the-partnership"
}