{
  "title": "Adult Survivors of Toxic Family Members: Tools to Maintain Boundaries, Deal with Criticism, and Heal from Shame After Ties Have Been Cut",
  "description": "Cutting ties with a toxic family member is a crucial step away from a legacy of dysfunction and toward healing and happiness. This compassionate guide will help you embrace your decision with a sense of pride, validation, and faith in yourself; and provides powerful tools for creating boundaries, coping with judgment, and overcoming self-doubt. Do you have a toxic family member? Do you feel like cutting ties with this person—even as painful and scary as that may sound—would dramatically increase your well-being and improve your life? You're not alone. Severing ties with a family member can be devastating; and cutting this toxic person out of your life may bring up feelings of guilt and uncertainty—especially if you feel judged by others regarding your decision. Fortunately, you can free yourself from this toxic family member in a healthy, responsible, and liberating way. In Adult Survivors of Toxic Family Members, psychologist and toxic-family survivor Sherrie Campbell offers effective strategies for setting strong boundaries after ending contact with a toxic family member, and provides powerful tools to help you heal from shame, self-doubt, and stigma. You'll find the validation you need to embrace your decision with pride and acknowledgement of your self-worth. You'll learn how to let go of negative thoughts and feelings. And finally, you'll develop the skills needed to rediscover self-care, self-love, self-reliance, and healthy loving relationships. Whether you're ready to sever ties with a toxic family member, or already have, this book will help guide you, every step of the way.",
  "genres": [
    "Self Help",
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Audiobook",
    "Relationships",
    "Family"
  ],
  "author": "Sherrie Campbell",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/58527303-adult-survivors-of-toxic-family-members"
}