{
  "title": "Woman, Eating",
  "description": "A young, mixed-race vampire must find a way to balance her deep-seated desire to live amongst humans with her incessant hunger in this stunning debut novel from a writer-to-watch.Lydia is hungry. She's always wanted to try Japanese food. Sashimi, ramen, onigiri with sour plum stuffed inside - the food her Japanese father liked to eat. And then there is bubble tea and iced-coffee, ice cream and cake, and foraged herbs and plants, and the vegetables grown by the other young artists at the London studio space she is secretly squatting in. But, Lydia can't eat any of these things. Her body doesn't work like those of other people. The only thing she can digest is blood, and it turns out that sourcing fresh pigs' blood in London--where she is living away from her vampire mother for the first time - is much more difficult than she'd anticipated.Then there are the humans--the other artists at the studio space, the people at the gallery she interns at, the strange men that follow her after dark, and Ben, a boyish, goofy-grinned artist she is developing feelings for. Lydia knows that they are her natural prey, but she can't bring herself to feed on them. In her windowless studio, where she paints and studies the work of other artists, binge-watches Buffy the Vampire Slayer and videos of people eating food on YouTube and Instagram, Lydia considers her place in the world. She has many of the things humans wish for--perpetual youth, near-invulnerability, immortality--but, she is miserable; she is lonely; and she is hungry--always hungry.As Lydia develops as a woman and an artist, she will learn that she must reconcile the conflicts within her--between her demon and human sides, her mixed ethnic heritage, and her relationship with food, and, in turn, humans if she is to find a way to exist in the world. Before any of this, however, she must eat.",
  "genres": [
    "Horror",
    "Fantasy",
    "Fiction",
    "Vampires",
    "Literary Fiction",
    "Contemporary",
    "Adult"
  ],
  "author": "Claire Kohda",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/58536037-woman-eating"
}