{
  "title": "The Summer Place",
  "description": "From the #1 New York Times bestselling author of That Summer comes another heartfelt and unputdownable novel of family, secrets, and the ties that bind. When her twenty-two-year-old stepdaughter announces her engagement to her pandemic boyfriend, Sarah Danhauser is shocked. But the wheels are in motion. Headstrong Ruby has already set a date (just three months away!) and spoken to her beloved safta, Sarah’s mother Veronica, about having the wedding at the family’s beach house on Cape Cod. Sarah might be worried, but Veronica is thrilled to be bringing the family together one last time before putting the big house on the market. But the road to a wedding day usually comes with a few bumps. Ruby has always known exactly what she wants, but as the wedding date approaches, she finds herself grappling with the wounds left by the mother who walked out when she was a baby. Veronica ends up facing unexpected news, thanks to her meddling sister, and must revisit the choices she made long ago, when she was a bestselling novelist with a different life. Sarah’s twin brother, Sam, is recovering from a terrible loss, and confronting big questions about who he is—questions he hopes to resolve during his stay on the Cape. Sarah’s husband, Eli, who’s been inexplicably distant during the pandemic, confronts the consequences of a long ago lapse from his typical good-guy behavior. And Sarah, frustrated by her husband, concerned about her stepdaughter, and worn out by challenges of life during quarantine, faces the alluring reappearance of someone from her past and a life that could have been. When the wedding day arrives, lovers are revealed as their true selves, misunderstandings take on a life of their own, and secrets come to light. There are confrontations and revelations that will touch each member of the extended family, ensuring that nothing will ever be the same. From “the undisputed boss of the beach read” (The New York Times), The Summer Place is a testament to family in all its messy glory; a story about what we sacrifice and how we forgive. Enthralling, witty, big-hearted, and sharply observed, this is Jennifer Weiner’s love letter to the Outer Cape and the power of home, the way our lives are enriched by the people we call family, and the endless ways love can surprise us.",
  "genres": [
    "Fiction",
    "Romance",
    "Audiobook",
    "Chick Lit",
    "Contemporary",
    "Adult",
    "Adult Fiction"
  ],
  "author": "Jennifer Weiner",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/58532615-the-summer-place"
}