{
  "title": "All My Friends Are Invisible",
  "description": "*A mesmeric, harrowing and uplifting childhood memoir that will open up much-needed conversations about identity and mental health*It was an ordinary day in 2016. In Gatwick Airport, Jonathan and his wife Anna were having breakfast with their two little children while waiting for their flight to be called. And then it happened, a familiar sensation that Jonathan hadn't had for decades: an out-of-body experience that transported him to another place, the safe place he used to escape to in his mind when he was a boy.Because growing up in conservative 1980s Dublin, where there was little tolerance for children who were 'different', Jonathan Joly was, indeed, a different sort of child: creative, expressive, and - on the inside - a girl. The limitations of the people around him to understand his differences led to years of tyrannical bullying and abuse, forcing him to withdraw within himself to the point of clinical absence. His only chance for survival was the inner world he created for himself, rich with loving and supportive friends and playmates, that only he could see. Jonathan's invisible friends were his lifeline, and on that day at the airport, they came flooding back, and have remained with him to this day.This extraordinary and beautifully-written childhood memoir is not only an important, thought-provoking and exhilarating read, it provides hope and community for all those who have ever felt 'other', and proves how vital it is to provide children with the safe space to be themselves, the absence of which can have dire consequences.In All My Friends are Invisible, Jonathan Joly, known widely as one of social media's most successful content creators, shares the secret he's kept hidden these many years. He shows the beautiful world he retreated to time and time again when life was unbearable for his 'skin machine'. Most importantly, he introduces us to his invisible friends, and in so doing you may be transported back to the friends you had as a child that no one else could see, and who may have saved you, too.\"When you find yourself living in a world that doesn't understand you, and you lack any connection to anyone or any place, you are faced with few options. You can choose to leave this world and hope whatever lies beyond ends up being better, or you can create your own. It will require grit, hardship, pain and suffering, but the rewards will be great, and the journey will be greater, and the adventures will be endless. So, at a very young age and faced with these options, I chose the latter.\"All My Friends are Invisible will be one of the most talked about books of 2022.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Mental Health",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Jonathan Joly",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/58526933-all-my-friends-are-invisible"
}