{
  "title": "Y/N",
  "description": "Y/Na novel about a Korean American woman living in Berlin whose obsession with a K-pop idol sends her to Seoul on a journey of literary self-destruction.It’s as if her life only began once Moon appeared in it. The desultory copywriting work, the boyfriend, and the want of anything not-Moon quickly fall away when she beholds the idol in concert, where Moon dances as if his movements are creating their own gravitational field; on live streams, as fans from around the world comment in dozens of languages; even on skincare products endorsed by the wildly popular Korean boyband, of which Moon is the youngest, most luminous member. Seized by ineffable desire, our unnamed narrator begins writing Y/N fanfic—in which you, the reader, insert [Your/Name] and play out an intimate relationship with the unattainable star.Then Moon suddenly retires, vanishing from the public eye. As Y/N flies from Berlin to Seoul to be with Moon, our narrator, too, journeys to Korea in search of the object of her love. An escalating series of mistranslations and misidentifications lands her at the headquarters of the Kafkaesque entertainment company that manages the boyband until, at a secret location, together with Moon at last, art and real life approach their final convergence.Surreal, hilarious, and shrewdly poignant, Y/N is a provocative literary debut about the universal longing for transcendence and the tragic struggle to assert one’s singular story amidst the amnesiac effects of globalization. Esther Yi’s prose unsettles the boundary between high and mass art, exploding our expectations of a novel about “identity” and offering in its place a sui generis picture of the loneliness that afflicts modern life.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Audiobook",
    "Thriller",
    "Adult",
    "Novels"
  ],
  "author": "Esther Yi",
  "average_rating": "2.92",
  "url": "https://www.goodreads.com/book/show/58523626-y-n"
}