{
  "title": "Lost and Found in Paris",
  "description": "“Fast-paced and colorful, with hints of The Goldfinch and Malibu Rising, and more than one pitch-perfect love story—Lost and Found in Paris sparkles like the City of Light itself and will have you flipping the pages quickly as you’re drawn deeply into its mysterious world of art, intrigue, and redemption.” —Kristin Harmel, New York Times bestselling author of The Book of Lost Names The ultimate escapist adventure in Paris, told with wit, style, and a touch of intrigue, by the popular and dynamic author of The Sweeney Sisters.Joan Blakely had an unconventional childhood: the daughter of a globe-trotting supermodel and a world-famous artist. Her artist father died on 9/11, and Joan—an art historian by training—has spent more than a decade maintaining his legacy. Life in the art world is beginning to wear on her—and then one fateful afternoon her husband drops a bombshell: he’s fathered twins with another woman.Furious but secretly pleased to have a reason to blow up her life, Joan impulsively decides to get out of town, booking a last-minute trip to Paris as an art courier: the person museums hire to fly valuable works of art to potential clients, discreetly stowed in their carry-on luggage. Sipping her champagne in business-class, she chats up her seatmate, Nate, a good-looking tech nerd who invites her to dinner in Paris. He doesn’t know she’s carrying drawings worth hundreds of thousands of dollars.But after a romantic dinner and an even more romantic night together, Joan wakes up next to her new lover to discover the drawings gone. Even more shocking is what’s been left in their place: a sketch from her father’s journals, which she thought had been lost when he died on 9/11, and a poem that reads like a treasure hunt.With Nate as a sidekick, Joan will follow the clues all over Paris—from its grand cathedrals to the romantic bistros to the twisty side streets of Montmartre—hoping to recover the lost art, and her own sense of adventure. What she finds is even better than she’d expected.",
  "genres": [
    "Fiction",
    "Romance",
    "Mystery",
    "France",
    "Audiobook",
    "Contemporary",
    "Travel"
  ],
  "author": "Lian Dolan",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/58536000-lost-and-found-in-paris"
}