{
  "title": "Seducing the Sorcerer",
  "description": "Homeless and jobless, Fenn Todd has nearly run out of hope. All he has left is his longing for horses and the strength of his own two hands. But when he’s cheated into accepting a very ugly sackcloth horse, he’s catapulted into a world of magic, politics and desire.Fenn’s invited to stay at the black tower, home of the most terrifying man in the Morgrim, the court sorcerer. Morgrim has a reputation as a scheming villain, but he seems surprisingly charming—and sexy—and Fenn falls hard for him.However, nothing is as it seems and everyone at the tower is lying about something. Beset by evil hexes, violent political intrigue and a horse that eats eiderdowns, Fenn must make the hardest choices of his life.Can a plain man like Fenn ever find true love with a scheming sorcerer?***“Seducing the Sorcerer is a book that wears its heart on its sleeve, and I loved every minute of it. Beyond being a beautifully written romance, this is a story about kindness, compassion, and what we owe one another as human beings, that will stay with you long after the last page. Outstanding.” - Jordan L. Hawk, author of the Whyborne & Griffin series.“If you're looking for fainting pretty boys, this book is not for you. Fenn and Morgrim are grown worn, world weary, stronger than they know, and scared to reach for what they want—for a while. The world is tangible, often beautiful, the story complex and engrossing, by turns dark, gritty, humorous, tragic, and rough. It's the kind of story that stays with you after you've devoured the final page.” - Lynn Flewelling, author of the Nightrunner Series and the Tamír Triad.“Seducing the Sorcerer is tender, sharp, and funny all at once. I was immediately drawn into the magical world that Lee Welch deftly creates and happily stayed up well into the night reading.” – Cat Sebastian, author of The Queer Principles of Kit Webb and the Seducing the Sedgwicks series.“Seducing the Sorcerer is a classic ‘grumpy one falls for…extremely grumpy one’ romance, featuring two middle-aged cynics who might just be each other’s sunshine. Throw in some magical mysteries, a gothic tower, and a healthy dose of skullduggery. Add libraries, kittens and magical horses. It all adds up to a bracing hug of a book that’s full of heart.” – Dr Sam Hirst, Romancing the Gothic.",
  "genres": [
    "Fantasy",
    "Romance",
    "M M Romance",
    "Magic",
    "Queer",
    "LGBT",
    "Audiobook"
  ],
  "author": "Lee  Welch",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/58526936-seducing-the-sorcerer"
}