{
  "title": "Gates of Eden: Starter Library",
  "description": "Six thrilling adventures begin in this one of a kind urban fantasy box setIncludes... Druid's Dance (The Druid Legacy, Book 1) I always loved mythology. I never realized that the legends of old were all about me.When Elijah Wadsworth manifests strange abilities that he neither understands nor can control he discovers that he's at the center of a legend that has been unfolding for centuries. Wyrmrider Ascending (The Fomorian Wyrmriders, Book 1) Dragon riders? Please. You ain't seen nothin' yet. Joni Campbell returned to the merkingdom of her ancestors hoping to find peace. But when the bokors open a portal to the void, and the wyrms break through into the world, she must learn to harness the power of these beasts if she hopes to save her home, and the world, from an even greater threat. Voodoo Academy (The Voodoo Legacy, Book 1) Being possessed has its advantages... Annabelle Mulledy and her soul-bound familiar didn't always get along. But their connection gave her unique abilities. When an insidious Loa discovers her power he seeks to claim her for himself. Her only hope? Join the Voodoo Academy and learn to master her powers. But are the Loa who brought her to the Academy really allies, or are they also trying to use her for their own nefarious purposes?Bloody Hell (The Legacy of a Vampire Witch, Book 1) Because you can't stake a heartless vampire. Mercy Brown has avoided the Order of the Morning Dawn for centuries. But the quasi-religious organization, dedicated to the elimination of all vampires and witches, has found her. The only way to defeat them? She'll have to go to \"bloody hell.\" Scared Shiftless (The Legend of Nyx, Book 1) A stiletto heel through a vampire's heart. Whoever said you had to sacrifice fabulous for functional?After being bitten by a vampire, Nicky--a shapeshifting water elemental--lost her powers. Now, she's stuck in a male body. After hunting vampires for years, she finally has a lead on the one who attacked her. Will she be able to face her nemesis and regain her powers, or will she lose what's left of herself in the process? Rise of the Morrigan (pre-quel to the Gates of Eden universe) Not even the god who made her could tame her. When the Dagda takes three sisters and combines them into what he thinks will make his ideal wife the Morrigan rises up to defy him. What is the Gates of Eden Universe? A lot of religions and traditions had some kind of “other” world, a primeval world, unmarred and unstained by human corruption. In the Judeo-Christian tradition it was the Garden of Eden. For the Druids and Celts it is Annwn. For Louisiana vodouisants it is Guinee. What if there really was such a place–a place that put us into touch with something “original” to our nature, something that was lost, something that made us more than we currently are? This is the “genesis” (pun intended) of the idea that under-girds these books! All of the Gates of Eden books are based on a particular mythological or spiritual tradition. While the magical systems are fictional, they are based on rites, lore, and mythologies unique to these traditions. There is a lot of overlap between traditions in these books–what the Druids call one thing, the Voodoo Mambos call something else. In the end, however, we see in these books a magical system that transcends the differences in religion and myth and unifies us all under a common force, a power, something uniquely human but nonetheless absent from our magic-less world. There may be many “Gates,” but ultimately there is one Eden, one Annwn, one Guinee. One humanity.",
  "genres": [
    "M M Romance"
  ],
  "author": "Theophilus Monroe",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/58521289-gates-of-eden"
}