{
  "title": "The Thicket",
  "description": "‘Memorable, engaging, and chilling . . . this novel will stay with you long after you have read it’ – Anthony Avina***Everyone will hear you scream. No one will listen.Norah can’t stop thinking about the night her brother died.She was supposed to stay with him at the Halloween carnival. He’d begged her to stay. But they fought and Norah left him alone in the woods. That was before she realized there was a real killer lurking among the costumes and macabre props.When the carnival reopens just weeks later amid media controversy, Norah decides to retrace her brother’s last steps in a desperate attempt to unravel what really happened that night. But the woods hold more than just traumatic memories.Before long, Norah begins to suspect that the killer's choice of hunting ground was no coincidence – and that this nightmare is far from over.The Thicket is a pulse-pounding thriller from bestselling BookTok sensation Noelle W. Ihli, author of Ask for Andrea.***Praise for Noelle W. ‘Hands down one of my favourite reads of the year’ – Freida McFadden, Sunday Times bestselling author of The Housemaid on \nAsk for Andrea\n‘An immersive, spine-tingling, deeply visceral experience. I recommend reading it with the lights blazing’ – Heather Gudenkauf, New York Times bestselling author of The Overnight Guest on Room for Rent‘Ihli’s voice is magical and absorbing. It’s easy to get lost in this atmospheric and utterly claustrophobic story’ – Kiersten Modglin, bestselling author of The Arrangement on Room for Rent‘What a thrill ride!’ – Steph Nelson, author of The Final Scene on Room for Rent‘A no-holds-barred gut-punch of a book that had me gritting my teeth as I read. This remarkable tale of survival is one I won't soon forget’ – Caleb Stephens, award-winning author of The Girls in the Cabin on Gray After Dark‘This heart-pounding thriller will grip you from the first sentence and won't let you go until the last. Settle in and get comfy, because it's the very definition of unputdownable’ – Faith Gardner, author of The Slaying Game on Room for Rent‘Riveting and heart-wrenching’ – Deborah J. Ledford, award-winning author of Redemption on None Left to Tell",
  "genres": [
    "Horror",
    "Thriller",
    "Mystery",
    "Halloween",
    "Fiction",
    "Young Adult",
    "Horror Thriller"
  ],
  "author": "Noelle W. Ihli",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/58535807-the-thicket"
}