{
  "title": "The Complete Undead Apocalypse Series",
  "description": "Get the entire Undead Apocalypse series now in one complete edition. If he could cure the big diseases… …it would advance humanity. Why would someone try to stop him? Dr. Saunders skyrocketed to the precipice of immortality when his brainchild, Project Starlight, was green-lit by his company. He would be remembered forever, but not for the reason he hoped. There was a dark side. Was his technology being used for another purpose? Someone at their parent company has a secret. Without his knowledge, his science was being perverted through genetics. They’ve been testing on human subjects. The poor souls strapped to the injectors have suffered. What is Trans Global Pharmaceuticals plan? Do they want to wipe out humanity… …or had something gone horribly wrong? In an unknown lab, Mike and the other test subjects struggle to survive in a scientifically engineered hell-on-Earth. With the aid of those left to linger, Mike and his companions must find their way deep into the heart of the facility and escape before it’s too late. And so, the race against time begins. You’ll love all four books in the Complete Undead Apocalypse Series, because the battle against a world-wide disaster will keep you turning the pages. The Complete Undead Apocalypse series is an action-packed story of surviving the end at all costs. If you like spine-crawling suspense and rugged adventure stories, then you'll love this post-apocalyptic tale. Perfect for fans of Mark Tufo, Shawn Chesser, and Peter Meredith. Grab all three full-length thrillers, plus the Novella (Genesis), and start binge reading the series today! BOOKS INCLUDED IN THE BOX THE COMPLETE UNDEAD APOCALYPSE SERIES Genesis (Prequel) Deadfall RipTide Dead Reckoning Scroll up and grab your copy now! FREE with Kindle Unlimited!",
  "genres": [
    "Horror"
  ],
  "author": "Derek Shupert",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/58550828-the-complete-undead-apocalypse-series"
}