{
  "title": "The Experiment",
  "description": "*** A fake relationship, neighbors, small-town romance ***WANTED: a dating coach. I’m thirty years old and have no clue what a healthy, committed relationship is like. It doesn’t help that I have the social skills of a pineapple and coping mechanisms that veer toward avoidance. Enter my hot new neighbor.Jess Caldwell—the gorgeous green-eyed man next door—might be perfectly content with short-term flings, consisting mostly of sweaty, salacious, clothing-optional fun, but his family is not. He needs a girlfriend to get them off his back.I propose a mutually beneficial—regrettably platonic—dating arrangement. He’ll be my dating coach, and I’ll be his fake girlfriend.Jess has his work cut out for him trying to turn a painfully awkward relationship novice like me into a flirty, seductive siren. But my side of the arrangement isn’t exactly easy either. I can look at his broad-shouldered, glistening runner’s body every morning, but I can’t touch. I can’t attack him with my lips. I can’t climb him like a tree and press my eager body to his.And I definitely can’t let my love-deprived heart fall for the man who is quickly making me feel… everything. No matter how much I want to.Because not only is our relationship pretend, but our time together has an expiration date. Jess is leaving this town—and me—in just a few months.___________THE EXPERIMENT is a 100,000 word small-town, steamy, slow-burn romance, with no cheating, no cliffhangers, and a HEA.The Landry Love Series is a set of interconnected, standalone, small-town romance novels.Landry Love SeriesBook One: The ExperimentBook Two: The Denial GameBook Three: The Forever PlanBook Four: The Love Words — Coming Fall 2021",
  "genres": [
    "Romance",
    "Small Town Romance",
    "Contemporary",
    "Contemporary Romance",
    "Slow Burn",
    "Friends To Lovers",
    "Chick Lit"
  ],
  "author": "Amy Alves",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/58541825-the-experiment"
}