{
  "title": "China's Wings: War, Intrigue, Romance, and Adventure in the Middle Kingdom During the Golden Age of Flight",
  "description": "From the acclaimed author of Enduring Patagonia comes a dazzling tale of aerial adventure set against the roiling backdrop of war in Asia. The incredible real-life saga of the flying band of brothers who opened the skies over China in the years leading up to World War II—and boldly safeguarded them during that conflict—China’s Wings is one of the most exhilarating untold chapters in the annals of flight.   At the center of the maelstrom is the book’s courtly, laconic protagonist, American aviation executive William Langhorne Bond. In search of adventure, he arrives in Nationalist China in 1931, charged with turning around the turbulent nation’s flagging airline business, the China National Aviation Corporation (CNAC). The mission will take him to the wild and lawless frontiers of commercial aviation: into cockpits with daredevil pilots flying—sometimes literally—on a wing and a prayer; into the dangerous maze of Chinese politics, where scheming warlords and volatile military officers jockey for advantage; and into the boardrooms, backrooms, and corridors of power inhabited by such outsized figures as Generalissimo and Madame Chiang Kai-shek; President Franklin Delano Roosevelt; foreign minister T. V. Soong; Generals Arnold, Stilwell, and Marshall; and legendary Pan American Airways founder Juan Trippe.    With the outbreak of full-scale war in 1941, Bond and CNAC are transformed from uneasy spectators to active participants in the struggle against Axis imperialism. Drawing on meticulous research, primary sources, and extensive personal interviews with participants, Gregory Crouch offers harrowing accounts of brutal bombing runs and heroic evacuations, as the fight to keep one airline flying becomes part of the larger struggle for China’s survival. He plunges us into a world of perilous night flights, emergency water landings, and the constant threat of predatory Japanese warplanes. When Japanese forces capture Burma and blockade China’s only overland supply route, Bond and his pilots must battle shortages of airplanes, personnel, and spare parts to airlift supplies over an untried five-hundred-mile-long aerial gauntlet high above the Himalayas—the infamous “Hump”—pioneering one of the most celebrated endeavors in aviation history.   A hero’s-eye view of history in the grand tradition of Lynne Olson’s Citizens of London, China’s Wings takes readers on a mesmerizing journey to a time and place that reshaped the modern world.",
  "genres": [
    "History",
    "Aviation",
    "China",
    "Nonfiction",
    "World History",
    "Military History",
    "India"
  ],
  "author": "Gregory Crouch",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/12790991-china-s-wings"
}