{
  "title": "What Became of Little Jackie Smith?: A True Story Continued",
  "description": "In 1950, Victoria Smith leaped to her death in Fresno, California, leaving many to wonder about the 10-year-old son she left behind. “What Became of Little Jackie Smith?: A True Story Continued” is a sequel to Victoria’s Smith’s life story, “Victoria’s A Conspiracy of Silence” (recipient of an honorable mention award in the Writer’s Digest Self-Published Book Awards in 2001). In this follow-up biography, Vickie Smith Odabashian describes how Little Jackie Smith handled his mother’s tragic death and the struggles he encountered from childhood through his many adventures in far-flung locations in his adulthood. This story is the author’s loving tribute to her father, his courage to move forward, and his hard work and dedication to making the world a better place.“This is a riveting book which I found difficult to put down. It chronicles the life of a child who was abandoned and often left to parent himself, and the many challenges he overcame in his quest to become a man. Despite a child with few consistent role models, he was a loving father, a compassionate and courageous law enforcement officer, and a devoted friend. As a therapist who has worked for many years with abused children, I am in awe of Jack’s resilience and his lifelong commitment and concern for the welfare of others. This book will serve as hope to many who wonder how to rise above and find meaning in situations that often feel overwhelming. This is a story of the resilience of the human spirit and finding faith in humanity.” - Ann C. Leber, LMFT“Vickie has written an inspiring story of how her father grew from an abandoned and abused child who conquered every obstacle to become a gentleman who served his country in the military and his community as a peace officer, treating everyone with dignity and respect along the journey.” - Perry L. Reniff, Retired Butte County SheriffVickie Smith (Foston) Odabashian began working as an educator in 1993. In 1999, she earned a Master’s Degree in Sociology, and in 2001, self-published her first book, Victoria’s A Conspiracy of Silence . Vickie and her husband, Glen, reside in Northern California near their immediate family–including five adult children and ten grandchildren (some of whom are pictured in the group photo that follows). Learn more about her books at Vlahabooks.com .",
  "genres": [],
  "author": "Vickie Smith Odabashian",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/58568836-what-became-of-little-jackie-smith"
}