{
  "title": "Jinx, You're It",
  "description": "New York Times and USA Today bestselling author Cynthia Eden brings a red-hot tale of second chance romance between two unlikely lovers.Life is too short not to have one hell of a good time.Jinx lives for his good times. With a ready smile and quick joke, his charm carries him through most rough situations. And when his grin doesn’t work, he just uses the down and dirty skills he acquired working Special Forces to get the job done. Life is easy, his luck is perfect, and nothing will slow him down. Except maybe…her. It was a one-night stand she should forget.Allison “Ali” Carter does not have time for handsome playboys—not even the ones with killer blue eyes and abs that last for days. Sure, she might have given in just one time and let her desire for Jinx take over, but she is not about to repeat that mistake, no matter how great the night was. She’s down on the Gulf Coast for a week of sun and relaxation. Jinx isn’t part of the plan. Until he is the only plan.Trouble has followed Ali down to the coast. On her last classified mission, she acquired a most dangerous stalker. The kind of guy that you can’t ditch, no matter how hard you try. The kind of guy who can scare a woman to death. And to help Ali deal with him? A most unlikely hero offers up his services. He wants his second chance.When Ali walked away from Jinx, it shouldn’t have hurt. He should have forgotten her and moved on. But since that fateful night, she’s been in his head. Been tormenting his dreams. So when she appears in his PI office and she’s in danger? Jinx immediately leaps into action. He’ll show Ali that he’s more than just a fast grin. This time, it’s not about being lucky. This time, it’s about protecting Ali and maybe, just maybe…winning her heart. Author’s Note: Jinx is about to get lucky. He’s getting a second chance with the woman who slipped through his fingers, and he isn’t about to let her vanish again. Ali thinks he doesn’t take life seriously, and she may just be right. But, when it comes to Ali’s safety, Jinx will go all in to prove that he’s the man she needs. Danger doesn’t scare him. Behind his grin, he’s ice cold and willing to do whatever it takes to protect the one woman who slipped past his guard. Action, romance, danger, and fun are waiting in JINX, YOU’RE IT. (Stand-alone read, guaranteed happy ending!)",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Contemporary",
    "Second Chance Romance",
    "Mystery",
    "Contemporary Romance"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/58564982-jinx-you-re-it"
}