{
  "title": "Juneteenth: The History and Legacy of the Holiday that Commemorates the End of Slavery in the South",
  "description": "Celebrants of the first Independence Day took little time to ponder the status of equality between the races. Primarily, their attention was taken up with the overthrow of a foreign colonial power, one not accomplished through the will of an overwhelming majority. The bold move shaped by colonial legislators and promoted to the colonies by the founding fathers represented a first-of-its kind emancipation, as no European colony had so completely faced down its mother country in a test of wills. John Adams wrote to his wife Abigail that he hoped to see such a day solemnized with “Pomp and parade, with Shews, Games, Sports, Guns, Bells, Bonfires, and Illuminations from one End of this Continent to the other from this Time forward forevermore.” Americans have lived up to Adam’s vision, and the Independence Day celebration has remained vigorous through the centuries.However, while July 4, 1776 signifies American independence from British rule, its leaders fell short in addressing racial equality within the new country. Most grievously, they failed to eradicate the most grievous wound of the infant nation’s first days, a social fracture running through a partisan argument over race. black Americans were neither culturally nor constitutionally protected from slavery and would not be so for nearly another century. Slavery would lead directly to the Civil War, and the Emancipation Proclamation that Abraham Lincoln issued at the start of 1863 was only intended to serve as a starting point for specific regions of the country controlled by Union forces. In the rebellious states of the Deep South, the Emancipation Proclamation loomed as a threat in the eventuality of a Union triumph, and it represented a clear war aim that hoped to compel slaves to rise up against their masters or flee towards Union lines.Inevitably, for many across the South, the news of the Emancipation Proclamation arrived slowly, and in other locales, the new was withheld entirely, sometimes by years. Slaveowners were not simply going to give up slaves, and in the wake of the Civil War and Reconstruction, others created statewide legislation to preserve the old order under a different system of semantics. Credible African American citizenship did not come in a single wave, but intermittently through various regions and to varying degrees over the decades since.As of June 19, 2021, Independence Day has been joined by a second federal holiday, a bookend to Lincoln’s Emancipation Proclamation that gives rise and adds a voice to the 13th Amendment and celebrates the freedoms and equal citizenship of all black citizens of the United States. In future years, “Juneteenth” will be marked alongside Independence Day as a celebration to include those who were barred from the benefits of the original event and intent. Viewed as an enhancement to and a completion of the original independence movement, Juneteenth merits the same community reverence and celebration based on the belief, in the words of Opal Lee, that “none of us [is] free till we’re all free.”While Lee was described by President Joseph Biden as the “Grandmother of the Juneteenth movement,” she and others continue to worry that Juneteenth will become only a “black” holiday rather than a national one. Michael Erikson of Deseret News asserted that abolition of slavery is in itself “a profoundly religious event,” and should therefore remain free of political rancor or social partisanship.”",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Charles River Editors",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/58562030-juneteenth"
}