{
  "title": "Hauling Ashe",
  "description": "Life might be a highway but the last thing this grumpy silver fox expected was a cross-country road trip with a ray of sunshine.\"My sister is driving to California. She could give you a ride.\"\"What?\" Tucker Ashe and I say in unison.Mae FoxSurely, my older sister has lost her mind. There is no way I'm driving her insufferable – albeit sexy silver fox – boss two thousand miles. This is my spirit trip. The Mother Road is intended to help me reclaim myself. Letting go of my past, I'm only looking forward to the path ahead of me.But my gaze keeps wandering to the rearview mirror, wondering what secrets my grouchy passenger keeps and how that silver scruff might feel blazing a trail on hidden parts of me.+ + +Tucker AsheDriving me from Chicago to California might be the least this ray of sunshine can do after ruining my new suit. However, being confined with her for seven days in a car named Louie is the last thing I need. Because I don't want to think about kissing those lips singing off-key or the way she beams every time we stop for a photo-op along Route 66.And I definitely shouldn't consider asking her to pull over and join me in the backseat for a bit on this crazy journey where memories haunt and every mile hints at a second chance.+ + +Join Mae and Tucker on a road trip where an eclectic soundtrack and unusual highlights along the most iconic road in the U.S. bring together two souls in need of a second chance at revving their engines, recharging their batteries, and rebuilding their dreams.From L.B. Dunbar comes a new series of feisty vixens and the sexy silver foxes they attract.**NOTE: The Fox sisters (Road Trips & Romance) are the siblings of Garrett Fox from Wine&Dine, an original sexy silver fox. Each book can be read as a stand-alone.",
  "genres": [
    "Romance",
    "Road Trip",
    "Contemporary",
    "Contemporary Romance",
    "Second Chance",
    "Forced Proximity",
    "Audiobook"
  ],
  "author": "L.B. Dunbar",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/58555782-hauling-ashe"
}