{
  "title": "Keeping Two",
  "description": "20 years in the making, the long-awaited graphic novel masterpiece from acclaimed cartoonist Jordan Crane. A young couple is stuck in traffic, reading a book aloud to each other to pass the time. The relationship is already strained, but between the encroaching road rage, and a novel that hits way too close to home, tensions are running especially high by the time they arrive back at their apartment. When one of them leaves to get takeout and a movie, each of the young lovers is individually forced to confront loss, grief, fear, and insecurities in unexpected and shocking ways.Crane's formal use of the comics medium ― threading several timelines and the interior and exterior lives of its protagonists together to create an increasing, almost Hitchcockian sense of dread and paranoia ― is masterful. But as the title hints, there are dualities at its core that make it one of the most exciting works of graphic literary fiction in recent memory, a brilliant adult drama that showcases a deep empathy and compassion for its characters as well as a visually arresting showcase of Crane's considerable talents. Keeping Two is ostensibly a story about loss, but by the end, it just might also be about finding something along the way ― something that had seemed irredeemable up to that point. In that way, it's also a deeply romantic book.Cartoonist Jordan Crane has been one of the most quietly influential comics-makers of the past quarter-century – in multiple senses of the as a cartoonist, a designer, an editor, a publisher, a printmaker, an advocate, an archivist, and more. But Keeping Two is his biggest project in close to two decades and will be one of the most anticipated graphic novels of 2022.Full-color illustrations throughout",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Fiction",
    "Graphic Novels Comics",
    "Romance",
    "Adult",
    "Bande Dessinée"
  ],
  "author": "Jordan Crane",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/58558352-keeping-two"
}