{
  "title": "Heyday",
  "description": "Heyday is a brilliantly imagined, wildly entertaining tale of America’s boisterous coming of age–a sweeping panorama of madcap rebellion and overnight fortunes, palaces and brothels, murder and revenge–as well as the story of a handful of unforgettable characters discovering the nature of freedom, loyalty, friendship, and true love.In the middle of the nineteenth century, modern life is being born: the mind-boggling marvels of photography, the telegraph, and railroads; a flood of show business spectacles and newspapers; rampant sex and drugs and drink (and moral crusades against all three); Wall Street awash with money; and giddy utopian visions everywhere. Then, during a single amazing month at the beginning of 1848, history lurches: America wins its war of manifest destiny against Mexico, gold is discovered in northern California, and revolutions sweep across Europe–sending one eager English gentleman off on an epic transatlantic adventure. . . .Amid the tumult, aristocratic Benjamin Knowles impulsively abandons the Old World to reinvent himself in New York, where he finds himself embraced by three restless young Americans: Timothy Skaggs, muckraking journalist, daguerreotypist, pleasure-seeker, stargazer; the fireman Duff Lucking, a sweet but dangerously damaged veteran of the Mexican War; and Duff’s dazzling sister Polly Lucking, a strong-minded, free thinking actress (and discreet part-time prostitute) with whom Ben falls hopelessly in love.Beckoned by the frontier, new beginnings, and the prospects of the California Gold Rush, all four set out on a transcontinental race west–relentlessly tracked, unbeknownst to them, by a cold-blooded killer bent on revenge.A fresh, impeccable portrait of an era startlingly reminiscent of our own times, Heyday is by turns tragic and funny and sublime, filled with bona fide heroes and lost souls, visionaries (Walt Whitman, Charles Darwin, Alexis de Tocqueville) and monsters, expanding horizons and narrow escapes. It is also an affecting story of four people passionately chasing their American dreams at a time when America herself was still being dreamed up – an enthralling, old-fashioned yarn interwoven with a bracingly modern novel of ideas.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "New York",
    "American",
    "19th Century",
    "American History"
  ],
  "author": "Kurt Andersen",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/58558.Heyday"
}