{
  "title": "Ancestor Trouble: A Reckoning and a Reconciliation",
  "description": "An acclaimed writer goes searching for the truth about her wildly unconventional Southern family–and finds that our obsession with ancestors opens up new ways of seeing ourselves.Maud Newton’s ancestors have vexed and fascinated her since she was a girl. Her mother’s father, who came of age in Texas during the Great Depression, was said to have married thirteen times and been shot by one of his wives. Her mother’s grandfather killed a man with a hay hook and died in a mental institution. Mental illness and religious fanaticism percolated through Maud’s maternal lines, to an ancestor accused of being a witch in Puritan-era Massachusetts. Maud’s father, an aerospace engineer turned lawyer, was a book-smart man who extolled the virtues of slavery and obsessed over the “purity” of his family bloodline, which he traced back to the Revolutionary War. He tried in vain to control Maud’s mother, a whirlwind of charisma and passion given to feverish projects: thirty rescue cats, and a church in the family’s living room where she performed exorcisms. Their divorce, when it came, was a relief. Still, the meeting of her parents’ lines in Maud inspired an anxiety that she could not shake; a fear that she would replicate their damage. She saw similar anxieties in the lives of friends, in the works of writers and artists she admired. As obsessive in her own way as her parents, Maud researched her genealogy—her grandfather’s marriages, the accused witch, her ancestors’ roles in slavery and genocide–and sought family secrets through her DNA. But sunk in census archives and cousin matches, she yearned for deeper truths. Her journey took her into the realms of genetics, epigenetics, and the debates over intergenerational trauma. She mulled modernity’s dismissal of ancestors along with psychoanalytic and spiritual traditions that center them.  Searching, moving, and inspiring, Ancestor Trouble is one writer’s attempt to use genealogy–a once-niche hobby that has grown into a multi-billion-dollar industry—to expose the secrets and contradictions of her own ancestors, and to argue for the transformational possibilities that reckoning with our ancestors has for all of us.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Biography",
    "Biography Memoir",
    "Family",
    "Audiobook"
  ],
  "author": "Maud Newton",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/58558175-ancestor-trouble"
}