{
  "title": "Folk Around and Find Out",
  "description": "He needs to get her out of his system. Just once...Hank Weller doesn’t help people. He leaves that do-gooder nonsense to his best friend, Beau Winston. Hank does what he wants, when he wants, with whomever he wants—and Hank does not want to hire Charlotte Mitchell to be an exotic dancer at his club, The Pink Pony. Sure, he can’t help noticing the dips and curves of her, how shrewd, smart, and funny she is, the fire in her hazel eyes. He's always noticed. She’d probably draw a crowd and entice the regulars. But after Charlotte's messy, public divorce made Hank’s club out to be the culprit—and made her the single mother of four kids—he doesn’t need or want any additional bad press courtesy of Charlotte Mitchell. Or the distraction. Unfortunately for him, the town’s prettiest charity case doesn’t seem to understand the meaning of the words nope, no, and never.Charlotte Mitchell doesn’t much like Hank Weller. Once upon a time, she used to. Years ago, she liked him a whole heckofalot despite other folks in town labeling him as “eccentric” and “nonconformist,” which were polite southern alternatives to \"filthy rich\" and \"self-centered douchebag.\" Her opinion of him changed dramatically after he volunteered to be her date to junior prom and then promptly stood her up. They haven't so much as acknowledged each other in over a decade. But a sudden family emergency means Charlotte needs access to Hank’s club ASAP. Unfortunately for her, the narcissistic fancy-pants doesn’t seem to understand the meaning of the words help, generosity, and compassion.But he’s about to find himself schooled. Charlotte is going to teach Hank a lesson once and for all about basic human decency, whether he likes it or not.Spoiler alert. . . he likes it. ;-)",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Fiction",
    "Chick Lit",
    "Small Town Romance"
  ],
  "author": "Penny Reid",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/58597663-folk-around-and-find-out"
}