{
  "title": "Fortune: How Race Broke My Family and the World--and How to Repair It All",
  "description": "A Word & Way 2022 Book of the YearSojourners' 2022 Book Roundup to Inspire Faith and Justice\"Extraordinary. . . . Let this story of family, race, and resistance create anger in your spirit and ultimately inspire your heart to join the work to heal our nation and eventually our world.\"--Otis Moss III (from the foreword)Drawing on her lifelong journey to know her family's history, leading Christian activist Lisa Sharon Harper recovers the beauty of her heritage, exposes the brokenness that race has wrought in America, and casts a vision for collective repair.Harper has spent three decades researching ten generations of her family history through DNA research, oral histories, interviews, and genealogy. Fortune, the name of Harper's first nonindigenous ancestor born on American soil, bore the brunt of the nation's first race, gender, and citizenship laws. As Harper traces her family's story through succeeding generations, she shows how American ideas, customs, and laws robbed her ancestors--and the ancestors of so many others--of their humanity and flourishing.Fortune helps readers understand how America was built upon systems and structures that blessed some and cursed others, allowing Americans of European descent to benefit from the colonization, genocide, enslavement, rape, and exploitation of people of color. As Harper lights a path through national and religious history, she clarifies exactly how and when the world broke and shows the way to redemption for us all. The book culminates with a powerful and compelling vision of truth telling, reparation, and forgiveness that leads to Beloved Community. It includes a foreword by Otis Moss III, illustrations, and a glossy eight-page black-and-white insert featuring photos of Harper's family.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Race",
    "History",
    "Audiobook",
    "Biography",
    "Christian"
  ],
  "author": "Lisa Sharon Harper",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/58597732-fortune"
}