{
  "title": "Unsolved Serial Killers: 10 Frightening True Crime Cases of Unidentified Serial Killers (The Ones You've Never Heard of) Volume 1",
  "description": "Discover the chilling true stories of killers who stalked their victims undetected and remain free to this day…When you hear the word \"monsters\", you probably conjure visions of gruesome and otherworldly creatures -- vampires, spirits, demons, and more.Yet the most terrifying monsters in history aren't the ones you see on the big screen.No horror movie music cues when you cross paths with them or when they spot their first victim.No, these vicious killers are much subtler. These monsters are people.These are the killers who will walk away from a murder scene completely unphased by what they've done. The ones who pitilessly dump or hide bodies and then go about their day as usual.While you're likely familiar with the famous serial killers who have had their faces plastered on every television screen, that's only a part of the picture.One reason that people find these criminals so compelling is because they can rest easy at night knowing justice has been served, and the world has been made a little safer.Yes, these killers are shocking and perverse, yet there's a sense of comfort in knowing they won't be hunting for victims any time soon.But what about those who go undetected?In Unsolved Serial Killers, here is just a fraction of what you will Explorations of the cities and historical contexts of the killings, so you understand the atmosphere when they were taking placeIn-depth profiles of the victims of each killer and what happened to themComprehensive looks at the investigations, suspects, and actions of law enforcement while trying to identify the perpetratorsThe conspiracy theories and lasting legacies that surround these unknown predatorsThe methodology of the killers and what those distinct patterns might reveal about their twisted inner psycheHow gangs of serial killers like the Mad Killers of Belgium enthralled communities with fear and paranoiaPublic reactions to the murder sprees and the surprising ways that public opinion influenced investigationsAnd much more.If you're a true crime junkie you may think you know the world of serial killers inside and out -- but prepare to be surprised by what you find within these pages.Many of these criminals' stories have been nearly lost to time, discarded amongst the drama and pace of the modern news cycle. Others have been eclipsed by even more horrific crimes that took place after their reign of terror.Yet their impact on the families and friends of the victims will never fade. These accounts are both thorough and compelling and will have you on the edge of your seat.If you're ready for the best true crime stories you've never heard before, then scroll up and click the “Add to Cart” button right now.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime"
  ],
  "author": "D.R. Werner",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/58577060-unsolved-serial-killers"
}