{
  "title": "Monarch",
  "description": "The cryptic worlds of Hanna and Stranger Things mingle with the dark humor of Dare Me in this debut novel about a teen beauty queen who discovers she's been a sleeper agent in a deep state government program, and whose love for a fellow pageant girl sparks an underworld journey to the truth of her being.After waking up with a strange taste in her mouth and mysterious bruises, former child beauty queen Jessica Clink unwittingly begins an investigation into a nefarious deep state underworld. Equipped with the eccentric education of her father, Dr. Clink (a professor of Boredom Studies and the founder of an elite study group on idleness, affect, and crime known as “The Devil’s Workshop”), Jessica uncovers a disquieting connection between her former life as a pageant queen and an offshoot of Project MKUltra known as MONARCH. As Jessica moves closer to the truth, she begins to suspect the involvement of everyone around her, including her own mother, Grethe (a beauty queen turned spokesperson for a Norwegian cryochamber device built to halt the aging process for suburban housewives). With the help of Christine (a black-lipsticked riot grrrl babysitter and confidante), Jessica sets out to take down Project MONARCH and the operatives who programmed her. More importantly, she must discover if her first love, fellow teen queen Veronica Marshall, was genuine or yet another deep state plant. Iconic true crime stories of the ’90s (Lorena Bobbitt, Nicole Brown Simpson, and JonBenét Ramsey) merge with Jessica’s own past, triggering traumatic revelations and the radical potential of feminist vengeance. Drawing on theories of human consciousness, folklore, and a perennial cultural fixation with dead girls, Monarch questions the shadow sides of self-concept: Who are you if you don't know yourself?",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Science Fiction",
    "Mystery Thriller",
    "Queer",
    "LGBT"
  ],
  "author": "Candice Wuehle",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/58597258-monarch"
}