{
  "title": "In Every Mirror She's Black",
  "description": "An AMAZON Best of the Month PickGood Morning America (GMA) Book Club Buzz PickShortlist - 2021 Outstanding Works of Literature (OWL) AwardShortlist - 2021 Bad Form Book of the Year--------------------------------------------------A timely and arresting debut for anyone looking for insight into what it means to be a Black woman in the world.Three Black women are linked in unexpected ways to the same influential white man in Stockholm as they build their new lives in the most open society run by the most private people.Successful marketing executive Kemi Adeyemi is lured from the U.S. to Sweden by Jonny von Lundin, CEO of the nation's largest marketing firm, to help fix a PR fiasco involving a racially tone-deaf campaign. A killer at work but a failure in love, Kemi's move is a last-ditch effort to reclaim her social life.A chance meeting with Jonny in business class en route to the U.S. propels former model-turned-flight-attendant Brittany-Rae Johnson into a life of wealth, luxury, and privilege—a life she's not sure she wants—as the object of his unhealthy obsession.And Somali refugee Muna Saheed, who lost her entire family, finds a job cleaning the toilets at Jonny's office as she works to establish her residency in Sweden and, more importantly, seeks connection and a place she can call home.Told through the perspectives of each of the three women, In Every Mirror She's Black is a fast-paced, richly nuanced yet accessible contemporary novel that touches on important social issues of racism, classism, fetishization, and tokenism, and what it means to be a Black woman navigating a white-dominated society.Lola Akinmade Åkerström is an African-American (Nigerian-American) award-winning author, speaker, and photographer based in Sweden. This is her first novel.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Race",
    "Book Club",
    "Literary Fiction",
    "Audiobook",
    "Sweden"
  ],
  "author": "Lola Akinmade Åkerström",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/58596034-in-every-mirror-she-s-black"
}