{
  "title": "The Law Says What? Stuff You Didn't Know About the Law",
  "description": "There’s some important stuff you don’t know about the law (but really should)!What happens if Roe v. Wade is overturned? When can you legally use self-defense? How the hell does the Electoral College work, and who came up with it anyway? We hear about the law everywhere, from our social media feeds to 24/7 news coverage, and even during heated debates with friends and family. But do the people we’re listening to really understand the law, or how it works?The Law Says What? offers a crash course on some of the most bizarre, infuriating, and vitally important legal topics of today. Using real-world cases as a guide, you’ll explore laws that affect your everyday life and analyze the rationales behind the ones that might make your head spin. Your mind will be blown and you’ll even find yourself laughing as you learn about the weird quirks of criminal law, civil law, contract law, property law, tort law, international law, and courtroom procedure.You’ll discover things like:Why the police don’t actually have a legal duty to protect youHow marijuana is both legal and illegal at the same timeWhen you can be charged for murder without actually killing anyoneWhat someone has to do to legally steal your propertyAnd much more!Harvard Law School graduate and practicing attorney Maclen Stanley has already studied all the boring laws so you don’t have to, condensing the real-world legal cases into fascinating stories with valuable information. Designed to be easily digestible for all readers, you’ll feel like you’re having a casual conversation with a friend, rather than reading your mortgage disclosures.This book will help you make better decisions and have deeper conversations about the most important laws that affect you, your family, and your friends on a daily basis. Along the way, you’ll see that, in practice, the law—much like the human beings that create and enforce it—is actually pretty weird.The Law Says What? is perfect for fans of books like Freakonomics and Outliers, and anyone else who’s looking to engage with modern political discussions, educate themselves about the curiosities of our legal system, or even attend law school.You’ll also love this book if you’re curious about:Current eventsPoliticsThe U.S. legal systemThe ConstitutionThe justice system",
  "genres": [
    "Law",
    "Nonfiction"
  ],
  "author": "Maclen Stanley",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/58590657-the-law-says-what-stuff-you-didn-t-know-about-the-law"
}