{
  "title": "Experimental Magics",
  "description": "After four centuries of absence, magic has returned. But people have forgotten about it. They have moved on, a new religion has destroyed old grimoires, and humankind now lives by coal, steel and science. In this age of machines, there is no place for old legends. But now magic is back, why not use it for profit? Scientists open laboratories to study this mysterious energy. Soon, everybody is talking about it, the loudest being those who understand little about its principles: politicians, entrepreneurs, religious leaders or fashion icons.Professor Adrienne Imlay is one of the new researchers. Born an outcast in the crumbling old city of Gandarah, she spent her childhood evading the terrible Guardians and hiding the secret of her shamanic gift. She has cheated death more times than she cares to remember while scouring the mysterious Ruins for any relic to sell. Now a brilliant scientist, she wants only one thing: to work in peace, away from politics. But with elections looming, magic suddenly becomes the chief topic of the debate. In her lab, strange things start to happen: she has to rescue the soul of one of her colleagues, trapped in a railway timetable. Another scientist wants to build a banned machine whose blueprints are buried in Adrienne’s childhood memories. This project attracts unhealthy interest. Soon, she is pursued by a charismatic politician, a magic enforcer, a sinister pack of werewolves and even an ancient god.But just like physics, magics have laws of their own. The first one is: everything has a price.This immersive novel depicts a unique world where magic is not static but cyclical, providing a stunning backdrop for adventure in the opening book of this epic series. If you have enjoyed the Lady Trent series by Marie Brennan, the unusual magic of the Powder Mage, and the treasure hunts of Tomb Raider, this epic tale is for you.",
  "genres": [
    "Fantasy",
    "Mystery"
  ],
  "author": "Alex   Evans",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/58587452-experimental-magics"
}