{
  "title": "The Valancourt Book of ​Victorian Christmas Ghost Stories: Volume Five",
  "description": "It's the most wonderful time of the year - time for more rare ghostly tales of Yuletide terror from Victorian England!For this fifth Valancourt volume of Christmas ghost stories, editor Christopher Philippo has dug deeper than ever before, delving into the archives of Victorian-era newspapers and magazines from throughout the British Isles to find twenty-one rare texts for the Christmas season - seventeen stories and four poems - most of them never before reprinted.Featured here are gems by once-popular but now-forgotten 19th-century masters of the supernatural like Amelia Edwards, Barry Pain, and Florence Marryat, alongside contributions by totally obscure authors like James Skipp Borlase, a writer of penny dreadfuls who specialized in lurid Christmas horror stories, and Harry Grattan, who made history by writing the first ghost story recorded by Edison for the phonograph. Also included are an introduction and bonus materials, such as 19th-century news articles and advertisements related to Christmas ghosts.\"I endeavoured to call out; I could not utter a sound. As I gasped and panted, there stole into my nostrils a deadly, terrible, overpowering stench . . . It was the dread odour of decomposing mortality . . . I felt that I must break the spell, or die.\" - John Pitman, \"Ejected by a Ghost\"\"It was a coach made of dead men's bones . . . Behind the awful vehicle stood two fleshless skeletons in place of footmen, the driver was a horned and tailed fiend, and the six coal--black steeds that he drove had eyes of fire, and snorted flame from their nostrils as they tore madly along.\" - James Skipp Borlase, \"The Wicked Lady Howard\"",
  "genres": [
    "Horror",
    "Short Stories",
    "Christmas",
    "Anthologies",
    "Ghosts",
    "Classics",
    "Ghost Stories"
  ],
  "author": "Christopher Philippo",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/58615807-the-valancourt-book-of-victorian-christmas-ghost-stories"
}