{
  "title": "Kissed",
  "description": "What happens after she is woken by his kiss?Lady Adelina Halifax has never been kissed, which honestly is the second worst thing that can happen to a young lady. Apart from being left at the altar, of course. And publicly losing her reputation.Adelina might just have ruined her first Season, earning the reputation of a fast and spoiled debutante, and ending up being jilted by her own bridegroom. But before she can accept the hated fate of a spinster she is determined to do one thing right: She will be kissed before the Season ends. But by whom?Enter Lord Burns. Golden-haired. Rich. Loyal. Kind. A war hero. Has the face and stature of Apollo. Is desperately in love with Adelina. There is just one problem: She hates the very sight of him.But it can’t be helped. She will try to swallow her distaste of the man and his proper, gentlemanly ways that force him to always want to rescue her. He will be perfect to practice kissing with, since no one else wants to.Here are the \"kissing game\" rules:• Lord Burns is absolutely forbidden to transform her into a proper lady.• He is absolutely forbidden to ask her to marry him.• He is absolutely forbidden to stop kissing her (until she says so).There. Now she is completely safe. What are the chances that she will end up falling desperately in love with Lord Burns while he learns to loathe the very sight of her? The very idea! Impossible.And then, the kissing begins.Emma meets The Taming of the Shrew in this hot new Regency romance. It might be more Georgette Heyer than Jane Austen, more Bridgerton than Perrault, but never fear: It will break your heart into a thousand pieces. The best books always do.Kissed is a hate-to-love-to-hate-to... Regency romance that will melt like chocolate in your mouth.",
  "genres": [
    "Historical Romance",
    "Historical Fiction",
    "Fantasy",
    "Retellings",
    "Regency",
    "Historical",
    "Enemies To Lovers"
  ],
  "author": "M.C. Frank",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/58609619-kissed"
}