{
  "title": "The Edge of In Between",
  "description": "A spellbinding, twisty, magical retelling of The Secret Garden that takes readers on a journey through what separates the living and the dead.Lottie lives in Vivelle, a vibrant city where life exists in brilliant technicolor and nearly everyone is born with magic, including Lottie. But when tragedy strikes, color is stripped from Lottie’s heart and from the world around her. Taken in by her reclusive uncle, Lottie moves into Forsaken, a vast manor located in the gray wasteland between the Land of the Living and the Land of the Dead.There, Lottie discovers more secrets and mysteries than she ever dreamed possible. Even so, she is filled with nothing but despair. But when splintered magic threatens to consume everyone and everything she still holds dear, Lottie must find a way to thaw both the world and the hearts of those around her—before time runs out.In this stunning portrait of love, loss, magic, and hope, one girl finds the strength to overcome tragedy—and finds a way to embrace the gifts that make life worth living.Praise for The Edge of In “A lyrical, graceful conjuring of the landscape of grief [that] doesn't just reimagine a children's classic, but does it with great love.”—Jacqueline West, author of The Books of Elsewhere series and Long Lost“Brilliant and empowering…a book that belongs in the hands of every middle-grade reader.” —Lindsay Currie, author of What Lives in the Woods \"Richly layered with emotional truths, The Edge of In Between embraces all the fragile elements of grief and sorrow, hope and love—as well as the strength (so very much like magic) that resides inside us all.\" —Heather Kassner, author of The Plentiful Darkness",
  "genres": [
    "Middle Grade",
    "Fantasy",
    "Magical Realism",
    "Retellings",
    "Fiction",
    "Childrens",
    "Young Adult"
  ],
  "author": "Lorelei Savaryn",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/58608032-the-edge-of-in-between"
}