{
  "title": "Agatha the Beloved Queen",
  "description": "\"Agatha the Beloved Queen\" includes medieval fantasy, philosophical fiction, and erotic fiction. It is an adult fairy story, not a children's fairy story. The target audience is adults 18+ who admire strong women, sympathize with the common people in preference to the fabulously wealthy, and for whom occasional fantasy, a fairy godmother and an evil sorcerer, and a few explicit adult scenes will enliven a story. People who are socially and politically conservative probably won't like it.Queen Julia rules the mystical and medieval land of Xana in which fabulous wealth is concentrated in a tiny aristocracy and most of the common people are very poor. Her daughter, Princess Agatha, is champion of the commoners but does not have the power to correct the imbalance. The evil sorcerer Magi comes to Xana, kills the queen, and ravages aristocrats and commoners alike.Her fairy godmother comes to Agatha and says that if she identifies her handsome prince incognito in the crowd on her very first try and makes love to him (just kissing is not enough), Magi will be destroyed. But she will not have a second chance.Agatha succeeds, and now as queen devotes her entire reign to devising economic and social methods to bring prosperity to all. She must deal with corruption on her own council of advisers, a vicious usurer, the school bully, brutal bandits on the frontier, and invasion by an army much larger than her own. She nurtures several children with humble backgrounds into adult greatness.In Agatha we discover an inspired princess who becomes a wise queen with a destiny, a mission to bring prosperity to every person in her medieval land. Agatha has infinite compassion for the downtrodden, a work ethic that inspires work ethic in her people. She loves children and children love her. She has zero tolerance for abusive behavior; when it happens she stops it real fast.To put the proverbial icing on the cake, Agatha and her handsome prince are both sexually insatiable - with each other.The methods used by Queen Agatha in the fifteenth century to bring prosperity to all may also work in our 21st century. However, some readers may disagree that her methods were wise and wholesome. The author leaves that decision to you.",
  "genres": [
    "Fantasy"
  ],
  "author": "Fred Pilcher",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/58614877-agatha-the-beloved-queen"
}