{
  "title": "What To Do When You Don't Know What To Do Volume 1: How To Overcome Storms In Your Life",
  "description": "Have you ever felt as if the harsh rapids and tall waves of a monster storm are crashing down on your life? Do you currently have an unwanted package of pain at your doorstep wrecking your life?What kind of life storms are you currently facing that puts you in a position that you don’t know what to do?It is wise to choose a battle when you can, but what do you do when the battle chooses you? Dr. Frank Mwakasisi knows how it feels like to be caught in the depths of hurt, pain, and confusion, where it seems as if there is no way out after the loss of his beautiful wife Elizabeth, a house, and a car. But he also knows from experience that through the guidance of the Lord Jesus Christ, there’s a way out . Yes, like a lighthouse, God is waiting to get you safely to shore. Authored by Evangelist Frank Mwakasisi, a passionate and dynamic teacher and preacher, What to Do When You Don’t Know What to Do Volume 1 exceptionally blends personal experiences, firsthand accounts of tragedy and triumph, divine revelations, and principles of God’s kingdom with contemporary stories and examples to provide its readership with answers to life’s biggest questions. You will learn from a man who is acquainted with God’s saving might even in troubled seas. With an engaging and conversational style, this book unravels mysteries and offers illumination into divine secrets that empower you to thrive beyond tribulations and weather the storms of life. In the first volume of What to Do When You Don’t Know What to Do , Dr. Mwakasisi presents seven foundational principles of God’s kingdom to help you understand the calming revelation that your battles are not yours, but God’s . Dr. Mwakasisi has created this powerful guide to help you beat the storms in your life if you allow God to fight your battles . As you navigate the maze of life, get ready to learn, and relearn several life skills and divine Whether you’re a devoted believer or a non-Christian, these principles will shift the mindset with which you tackle the hardships of your life whenever they pop up. Trust God and master how to conquer your storms and vanquish the monsters within. Learn the secret of what to do when you don’t know what to do!",
  "genres": [],
  "author": "Frank Mwakasisi",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/58606493-what-to-do-when-you-don-t-know-what-to-do-volume-1"
}