{
  "title": "America, Goddam: Violence, Black Women, and the Struggle for Justice",
  "description": "A powerful account of violence against Black women and girls in the United States and their fight for liberation. Echoing the energy of Nina Simone's searing protest song that inspired the title, this book is a call to action in our collective journey toward just futures.America, Goddam explores the combined force of anti-Blackness, misogyny, patriarchy, and capitalism in the lives of Black women and girls in the United States today. Through personal accounts and hard-hitting analysis, Black feminist historian Treva B. Lindsey starkly assesses the forms and legacies of violence against Black women and girls, as well as their demands for justice for themselves and their communities. Combining history, theory, and memoir, America, Goddam renders visible the gender dynamics of anti-Black violence. Black women and girls occupy a unique status of vulnerability to harm and death, while the circumstances and traumas of this violence go underreported and understudied. America, Goddam allows readers to understand  How Black women—who have been both victims of anti-Black violence as well as frontline participants—are rarely the focus of Black freedom movements.How Black women have led movements demanding justice for Breonna Taylor, Sandra Bland, Toyin Salau, Riah Milton, Aiyana Stanley-Jones, and countless other Black women and girls whose lives have been curtailed by numerous forms of violence.How across generations and centuries, their refusal to remain silent about violence against them led to Black liberation through organizing and radical politics.America, Goddam powerfully demonstrates that the struggle for justice begins with reckoning with the pervasiveness of violence against Black women and girls in the United States.",
  "genres": [
    "Nonfiction",
    "Race",
    "Feminism",
    "History",
    "Politics",
    "Social Justice",
    "Gender"
  ],
  "author": "Treva B. Lindsey",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/58636788-america-goddam"
}