{
  "title": "The White House Plumbers",
  "description": "NOW A FIVE-PART HBO SERIES, STARRING WOODY HARRELSON AND JUSTIN THEROUXThe true story of The White House Plumbers, a secret unit inside Nixon's White House, and their ill-conceived plans stop the leaking of the Pentagon Papers, and how they led to Watergate and the President's demise.On July 17, 1971, Egil “Bud” Krogh was summoned to a closed-door meeting by his mentor―and a key confidant of the president―John Ehrlichman. Expecting to discuss the most recent drug control program launched in Vietnam, Krogh was shocked when Ehrlichman handed him a file and the responsibility for the Special Investigations Unit, or SIU, later to be notoriously known as “The Plumbers.”The Plumbers’ work, according to Nixon, was critical to national they were to investigate the leaks of top secret government documents, including the Pentagon Papers, to the press. Driven by blind loyalty, diligence, and dedication, Krogh, along with his co-director, David Young, set out to handle the job, eventually hiring G. Gordon Liddy and E. Howard Hunt, who would lead the break-in to the office of Dr. Fielding, a psychiatrist treating Daniel Ellsberg, the man they suspected was doing the leaking. Krogh had no idea that his decisions would soon lead to one of the most famous conspiracies in presidential history and the demise of the Nixon administration.The White House Plumbers is Krogh’s account of what really happened behind the closed doors of the Nixon White House, and how a good man can make bad decisions, and the redemptive power of integrity. Including the story of how Krogh served time and later rebuilt his life, The White House Plumbers is gripping, thoughtful, and a cautionary tale of placing loyalty over principle.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Audiobook",
    "True Crime",
    "Memoir",
    "Crime"
  ],
  "author": "Egil “Bud” Krogh",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/58624089-the-white-house-plumbers"
}