{
  "title": "God of Clocks",
  "description": "Alan Campbell has set the new standard for epic fantasy. Now the highly acclaimed author of Scar Night and Iron Angel returns with a new novel of a mythic struggle between man and angel, demon and god—an Armageddon of survival and annihilation that will play out on the fields of time itself.War, rebellion, betrayal—but the worst is still to come. For in the cataclysm of the battle of the gods, a portal to Hell has been opened, releasing unnatural creatures that were never meant to be and threatening to turn the world into a killing field. And in the middle, caught between warring gods and fallen angels, humanity finds itself pushed to the brink of extinction. Its only hope is the most unlikely of heroes.Former assassin Rachel Hael has rejoined the blood-magician Mina Greene and her devious little dog, Basilis, on one last desperate mission to save the world from the grip of Hell. Carried in the jaws of a debased angel, they rush to the final defensive stronghold of the god of time—pursued all the while by the twelve arconites, the great iron-and-bone automatons controlled by King Menoa, the Lord of the Maze. Meanwhile, in the other direction, the giant John Anchor, still harnessed to his master’s skyship, descends into Hell itself to meet Menoa on his own ground.But neither Heaven nor Hell is anything they could ever expect. Now old enemies and new allies join a battle whose outcome could be the end of them all. Rachel’s ally, the god Hasp, finds himself in the grip of a parasite and struggles against conflicting orders to destroy his own friends; and a dangerous infant deity comprised of countless broken souls threatens to overcome them all. As Rachel travels to the final confrontation she has both sought and feared, she begins to realize that time itself is unraveling. And so she must prepare herself for a sacrifice that may claim her heart, her life, her soul—and even then it may not be enough.",
  "genres": [
    "Fantasy",
    "Steampunk",
    "Dark Fantasy",
    "Fiction",
    "Science Fiction",
    "Horror",
    "Angels"
  ],
  "author": "Alan                Campbell",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/5863627-god-of-clocks"
}