{
  "title": "Junie B. Jones Collection",
  "description": "Junie B. Jones is back on audio with a collection of books that began the well-loved series.Junie B. Jones and the Stupid Smelly BusRemember when it was scary to go to school? 'Cause it was your first day and you didn't know anything. Meet Junie B. Jones, kindergartner. She's so scared of the school bus and the meanies on it that when it's time to go home, she doesn't.Junie B. Jones and a Little Monkey BusinessIt's pooey on B-A-B-I-E-S until Junie B. finds out that her new dumb old baby brother is a big fat deal. Her two bestest friends are giving her everything they own just to see him. And guess what else? Maybe she can bring him to school on Pet Day.Junie B. Jones and Her Big Fat MouthJunie B.'s having a rough week. First she got punishment for shooting off her mouth in kindergarten. And now she's in big trouble again! 'Cause Monday is Job Day, and Junie B. told her class that she's got the bestest job of all. Only, what the heck is it?Junie B. Jones and Some Sneaky Peeky SpyingJunie B. is the bestest spier in the whole world. That's 'cause she has sneaky feet. And her nose doesn't whistle when she breathes. But guess what? Junie B. might be real sneaky. And real peeky. But when she spies on Mrs., she could get into real trouble!Junie B. Jones and the Yucky Blucky FruitcakeIn this audio, Junie B. wins the Carnival Night Cake Walk and chooses the bestest cake of all. How was she to know it was lethal weapon?Junie B. Jones and that Meanie Jim's BirthdayJunie B. is NOT invited to Jim's birthday party in this great story.Junie B. Jones Loves Handsome WarrenJunie B. has to figure out how she can get the handomest guy she's ever seen to love her.Juine B. Jones Has a Monster Under Her BedJunie B. worries that Paulie Allen Puffer is right and she really does have monster under her bed.",
  "genres": [
    "Childrens",
    "Realistic Fiction",
    "Fiction",
    "Audiobook",
    "Chapter Books",
    "Kids",
    "Juvenile"
  ],
  "author": "Barbara Park",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/586308.Junie_B_Jones_Collection"
}