{
  "title": "Tainted",
  "description": "Former Navy SEAL sniper Matthew Kessler thought his life was charmed. He was wrong. He thought his father had amassed the family’s wealth through hard work. He was wrong again. He thought the battlefield had taught him everything he needed to know about strength and courage. He was absolutely wrong. In the blink of an eye, everything he thought he knew about his family became a lie. Every penny of his family’s fortune was tainted. A betrayal so crippling it nearly crushed him under the weight of mounting deceit. With his life crumbling around him, he shouldn’t fall for the beautiful cowgirl. But he couldn’t resist her determination. He couldn’t turn away from her strength. And it was a damn good thing because, in the end, she was the only thing keeping him standing.Chelsea Sullens grew up knowing she wasn’t good enough. Or so said her father. She knew she was hardheaded and stubborn. Or so said her brothers. At eighteen, she’d found herself alone, broke, with nothing but the fire in her belly and her dream of becoming a bull rider. She turned rejection into resolve and put the stubbornness she’d been accused of having to good use. Her father’s insults fueled her determination to ride with the best. With her dream within reach, it was the wrong time to fall in love. The former SEAL was the distraction she didn’t need, yet he was the man she couldn’t let walk away.So close to having it all. So close to getting forever. A phone call changes everything. Chelsea has vanished. No leads. A slew of suspects. And Matt is fresh out of patience, his control is gone, and the person who’s taken the woman he loves is about to find out his vengeance has a price: blood.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Military Romance",
    "Military Fiction",
    "Found Family",
    "Friends To Lovers"
  ],
  "author": "Riley Edwards",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/58621513-tainted"
}