{
  "title": "The Search for Nefertiti: The True Story of an Amazing Discovery",
  "description": "Her power was rivaled only by her beauty. Her face has become one of the most recognizable images in the world. She was an independent woman and thinker centuries before her time. But who was Egypt's Queen Nefertiti? After years of intense research, Dr. Joann Fletcher has answered the questions countless researchers before her could not. While studying Egyptian royal wigs, she read a brief mention of an unidentified and mummified body, discovered long ago and believed to belong to an Egyptian of little importance. This body happened to have a wig, which Dr. Fletcher knew was a clear sign of power. After examining the hairpiece and the woman to which it belonged, to the astonishment of her colleagues she identified this body as the missing remains of Queen Nefertiti. The search for Nefertiti had ended. She had been found. But the questions were just beginning. Nefertiti first rose to prominence in Egyptology in 1912, when a three-thousand-year-old bust of the queen was unearthed and quickly became a recognizable artifact around the world. But pieces of Nefertiti's life remained missing. The world had seen what she looked like, but few knew about her place in history. Virtually nothing is recorded about Nefertiti's early years. What is known about her life starts with her rise to power, her breaking through the sex barrier to rule as a virtual co-Pharaoh alongside her husband, Akhenaten. Upon his death she took full control of his kingdom. The Egyptian people loved her and celebrated her beauty in art, but the priests did not feel the same way. They believed Nefertiti's power over her husband was so great that she would instill her monotheistic beliefs upon him, rendering their own power obsolete. Egyptologists concur that it was these priests who, upon Nefertiti's death, had her name erased from public record and any likeness of her defaced. This ultimately led to her being left out of history for three thousand years. In The Search for Nefertiti Dr. Fletcher, an esteemed Egyptologist, traces not only her thirteen-year search for this woman, whose beauty was as great as her power, but also brings to the forefront the way Egypt's royal dead have been treated over time by people as varied as Agatha Christie and Adolf Hitler. She also explores how modern technology and forensics are quickly changing the field of archaeology and, in turn, what we know about history.",
  "genres": [
    "History",
    "Nonfiction",
    "Egypt",
    "Archaeology",
    "Biography",
    "Egyptology",
    "Historical"
  ],
  "author": "Joann Fletcher",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/586334.The_Search_for_Nefertiti"
}