{
  "title": "Love Stories: A Novella Collection",
  "description": "A collection of contemporary romance novellas from New York Times Bestselling Author Samantha Young.\nThis volume includes novellas previously only available exclusively to newsletter subscribers. They have now been collated into this romantic collection of modern love stories.Includes:The Forbidden Christmas Gift:It’s Christmas at Shaw’s Department store in Edinburgh! Reid Shaw should feel nothing but gratified by his success. But he’s not satisfied because the sexy Scot wants forbidden fruit for Christmas: Evan Munro. Reid’s Evan’s boss. He’s thirteen years older than her. Oh … and she’s his best friend’s little sister. New Year's Eve:After Ryan drunkenly kisses the object of her crush, Joe—her sister’s father-in-law— at his son’s birthday party, all she wants to do is avoid Joe for the rest of eternity. But when they find themselves stranded alone together on New Year’s Eve, Ryan discovers Joe most definitely doesn’t want to avoid Ryan…Loving Valentine:Micah Green has loved Valentine Fairchild for over ten years; ever since they were kids brought together by Micah's difficult family life. Too many outside factors have gotten in their way, pushing them further apart over the years. But Micah, no matter how hard he tries, can't forget her. When he finds a way to see her again, he realizes he's wasted too much time loving Valentine from afar. Now he just has to convince her to let go of their past so they can move on with their future. Together.Ember in the Heart:When Ember Bonet overhears her sister’s fiancé’s best friend uttering rude remarks about the Bonet sisters at the engagement party, she instantly dismisses him as a pretentious man-child. Then said man-child, Foster Darwin, moves into the house next door along with his five-year-old daughter, making him hard to ignore.Foster can’t believe his best friend, Colt, omitted to tell him the spinsterish Bonet sisters live in the house next door to his new home. Problem is, Ember Bonet is anything but spinsterish. From the moment they met, Foster has fought an overwhelming attraction to her. An attraction he has no time for. Not only is he determined to prioritize his daughter Georgie, he can’t fail his own father again. And Edward Darwin has made it clear that Foster must settle down with the right woman. Unfortunately, his family’s idea of ‘right’ isn’t the sexy massage therapist next door who’s eleven years his senior. Determined to keep her distance from Foster, Ember fails when it becomes clear he and Georgie need support in their new life together. But proximity to one another is too great a temptation, and physical chemistry soon turns into so much more. If only Ember could get over their age difference and Foster his family pride…",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "Christmas",
    "Anthologies",
    "Novella"
  ],
  "author": "Samantha Young",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/58620906-love-stories"
}