{
  "title": "Dare to Risk It All",
  "description": "A Magnet for Trouble...\nWhen Greer Cadogan goes to her sister’s Christmas House party, she is all agog to meet the wicked Raphe Coote, Baron de Ligne. Raphe is her brother-in-law, the Viscount Roxborough’s best friend. The sinfully handsome baron is rusticating in the countryside at Rowsley Hall after sinking into a pit of vice so deep he nearly didn’t climb out again.Much to Greer’s disappointment, the baron has turned over a new leaf, sworn off his wicked lifestyle and isn’t half so dreadful as she hoped he would be.\nA Reformed Rake...\nRaphe knows he has escaped a disgusting and ignoble end, carousing and drinking himself to death in London’s most sinful whore houses and gambling clubs, and has experienced a long overdue change of heart. His mentor, and the man he admires most in the world, Lord Rothborn, has given him an ultimatum—sort his life out, or Rothborn will wash his hands of him. Lord and Lady Rothborn are among the only people who ever gave a damn for Raphe, and for once in his misbegotten life, he will not let them down.Intent on keeping him on the path to redemption, Rothborn has warned Raphe to keep his hands—and every other part of his anatomy—off his host’s sister-in-law, who will spend the Christmas season with the rest of her family at Rowsley Hall.\nAn Irresistible Temptation...\nGreer, however, has other plans. Though she admires Raphe’s desire to take himself in hand and become a useful human being, she sees no reason they ought not to be friends.No matter how Raphe tries to keep away from the beguiling and mischievous Miss Cadogan, the dreadful creature hunts him down, and Raphe has never been much good at resisting temptation.Greer truly did not intend to lead Baron de Ligne into just the sort of trouble he’d been trying so hard to avoid, but now she’s gone and done it.And in the end, she really might have to risk it all for the man she has come to love.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Regency",
    "Regency Romance",
    "Historical Fiction",
    "Adult"
  ],
  "author": "Emma V. Leech",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/58656774-dare-to-risk-it-all"
}