{
  "title": "The Lost Sister",
  "description": "The truth will set you free.For FBI Agent Blake Wilder the price of that truth requires the ultimate sacrifice.Blake Wilder lives with reoccurring nightmares from her grim and mysterious past.Fourteen years ago, her entire family was taken from her.Her parents murdered, and her sister taken.At the age of 22, Blake joined the FBI in hopes of one day discovering the truth behind the mysteries of her own past.Since joining the Bureau, Blake has witnessed and solved many gruesome and terrible cases. Yet, the one case that changed the course of her life seems to have a way of evading the light.When a new clue about her past is uncovered, and she finds that the sister she lost hope in ever finding might be alive. For the first time, Blake feels hopeful.But with the organization that murdered her parents after her, and powerful figures aligning against her. Blake has only one choice, to face her trauma and the monsters head on.As she’s dealing with that, SPD Deputy Chief Torres is on a warpath, seemingly willing to stop at nothing to indict Blake for murder.And with a new enemy entering the ring—one who is more dangerous than everybody else. The Đavole. A mysterious assassin who is legendary and has never failed to eliminate a target.The only question is… Who is he in town to kill?With more questions than answers about her sister’s return from the dead and a host of enemies at the gates looking to destroy her career or outright kill her, Blake doesn’t know where to turn, or who she can turn to.With so many uncertainties in the air.The only thing Blake can be certain of is that there is no where that’s safe when you're being hunted down by monsters.There’s no where left to run. No where left to hide.You just have to do whatever it takes to survive.",
  "genres": [
    "Thriller",
    "Crime",
    "Mystery",
    "Suspense",
    "Fiction"
  ],
  "author": "Elle Gray",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/58652591-the-lost-sister"
}