{
  "title": "Katarina's Dark Shadow",
  "description": "Historical fiction with a twisted mystery. This coming-of-age series portrays the true heroic struggle of the German Mennonites before Ukraine became a country, during one of the most tragic times of the early twentieth century. First Came the Horses.Book One: Katarina's Dark Shadow: As the civil war erupts in the shadow of the Great War. Katarina discovers that faith is more than a badge and a belief system. During war-time, it requires resilience.1951:Peter stumbles on Katarina's diaries from the Russian Revolution. What happened during those early years that prompted Katarina to go back to Ukraine during WW2? What secrets lie behind the Iron Curtain?1915-1917: While the winds of the great war circle Ukraine, the country seeks independence from mother Russia. But for fifteen-year-old Katarina, war is still too far away to feel real. She dreams of a exotic future as a missionary school teacher in foreign lands.Then a rebel attack at the family farm changes everything. Injured and fearful, Katarina seeks guarantees of safety. Her sister Anna’s wealthy estate with its security detail offers freedom and promises of dreams fulfilled. But after the Czar is overthrown and the separatist army grows, suspicion lurks at every corner. Even the servants can’t be trusted.As the solid foundations of faith and family are threatened, Katarina’s world unravels. She faces the ultimate decision that will determine her future. Will she depend on her peaceful Mennonite faith to fight the forthcoming evil? Or, will she abandon all hope and emigrate with the others?Is life a journey or a destination?Set during the darkest days of Ukraine’s history, Katarina’s Dark Shadow portrays the courageous human struggle inside a distinct faith during violent political times. Like the book of Job in the Bible, the story portrays the quest for meaning during troubling times.If you like intrigue, complex characters, and strong women of faith, you'll enjoy this spine-chilling Christian historical fiction series.Inspired by true stories and actual events based on the harrowing tales of the author's ancestors, this book will particularly interest those with German-Prussian, Ukrainian, or Russian Mennonite ancestry.If you enjoyed Tears of Amber and The Girl with the Silver Star, you’ll enjoy stepping into this intriguing and unusual world with its unique cultural dynamics. Witness the Russian revolution from an entirely different perspective.***** “A chillingly realistic, yet fictional account of what happened to ordinary people in Russian Ukraine when their world was overthrown by social unrest, war, and then a revolution. I couldn’t put it down.” *****Author P.C. James.***** “A gripping historical fiction and true to its time. Highly recommended for those interested in a different viewpoint from WWI.” ***** Author Nola Li Barr.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "M.J. Krause-Chivers",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/58650360-katarina-s-dark-shadow"
}