{
  "title": "After: The Graphic Novel",
  "description": "Fall in love all over again in volume one of the graphic novel adaptation of the global phenomenon AFTER!Anna Todd’s original story comes to life with breathtaking illustrations by Pablo Andres. Featuring 12 pages of behind-the-scenes and character profile bonus content, The Graphic Novel is a great introduction to the bestselling series for new readers and the ultimate collector’s item for fans everywhere!There was the time before Tessa met Hardin, and then there’s everything AFTER . . .Tessa is a good girl with a sweet, reliable boyfriend back home. She’s got direction, ambition, and a mother determined to keep her on course. But she’s barely moved into her freshman dorm when she runs into Hardin, with his tousled brown hair, cocky British accent, and tattoos. Good looking, confident . . . and rather rude, even a bit cruel. For all his attitude and insults, Tessa should hate Hardin. And she does―until she finds herself alone with him in his room. Something about his dark mood grabs her, and when they kiss it ignites a passion she’s never known before.He'll call her beautiful, then insist he isn’t the one for her, making excuses and disappearing, again and again. He’ll turn away, yet every time when she pushes back, he’ll only pull her in deeper. Despite the reckless way Hardin treats her, Tessa is drawn to his vulnerability, determined to unmask the real Hardin beneath all the lies.A good girl . . . a bad boy . . . something undeniable . . . and everything AFTER .Series THE GRAPHIC NOVEL (Volume One) will be the first in a multi-title collection that presents the entire AFTER fiction series in graphic novel format. Volume Two is tentatively planned for late 2022/early 2023 and one to two books will be published each year.",
  "genres": [
    "Graphic Novels",
    "Romance",
    "New Adult",
    "Contemporary",
    "Comics",
    "Young Adult",
    "Fiction"
  ],
  "author": "Véronique Grisseaux",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/58654210-after"
}