{
  "title": "Rake I'd Like to F...",
  "description": "He's a legend in the raking . . .The Last Crimes of Peregrine Hind - Sierra SimonePeregrine Hind, known to all as the bloodiest highwayman ever to bedevil the road, seeks only one thing—revenge against the Dartham family. And so when a robbery sends the second Dartham son and notorious rakehell Alexander Dartham tumbling to Peregrine’s feet, it seems like fate has given Peregrine his vengeance at last. Except then Alexander offers him a desperate to kidnap him instead, so Peregrine can harvest a generous ransom from Alexander’s family first. Peregrine agrees, but he’s in no way prepared for a captive like Alexander, who insists only on the softest beds and the finest wines…and who enjoys being tied up a little too much…Two Rakes for Mrs. Sparkwell - Eva LeighThe last thing Mrs. Vivian Sparkwell wants is to tie her life to another stifling husband. But thanks to the surprise terms of her last marriage contract, if she refuses any reasonable offer to wed again, she loses her widow’s portion. What she needs is a thorough and public ruining to make her would-be suitors cry off. Who better to provide the necessary scandal than notorious rake Rushton Cantley? Yet when Rush proposes that his friend, gaming hell bruiser Jack Morgan, join in on the ruination, Vivian can’t decide if she’s shocked—or aroused. How far is too far when infamy is on the line?A Rake, His Patron, & Their Muse - Nicola DavidsonLondon playwright and notorious rake Lennox Townsend is renowned for bold melodrama and bolder pleasures. When he loses interest in both, his shy yet devoted patron Lord Jonathan Grant escorts him to a country boarding house managed by repressed widow, Mrs. Viola Prescott. The trio soon surrender to sizzling—and forbidden—passion, made sweeter as each share their deepest secrets and find acceptance of their true self. Yet cold reality is ever ready to intrude, and they know happiness is fleeting. Or is it?Monsieur X - Adriana HerreraJoseph Cantor Marshall never imagined reaching the pinnacle of artistic success would be so… uninspiring. Desperate for a spark of excitement he attends the notorious masked soirée at the most exclusive sex club in Paris. The moment he walks in he’s entranced by the mysterious X, the embodiment of the painter’s darkest fantasies. But X is as slippery as he is tempting, and soon Marshall’s days and nights are consumed by growing desire for his elusive lover. Will falling for X prove to be Marshall’s undoing or his greatest masterpiece?Sold to the Duke - Joanna ShupeThough she once lived a life of privilege, Lady Eliza is now destitute and desperate to care for her ill sister. She decides to sell the one thing of value she has her virginity. At the auction, a shocked Duke of Blackwood recognizes Eliza and refuses to allow her to fall into the clutches of a depraved bidder. But his role of noble rescuer is upended when the proud beauty insists on giving him his money’s worth…",
  "genres": [
    "Romance",
    "Historical Romance",
    "Anthologies",
    "Historical",
    "LGBT",
    "Historical Fiction",
    "Novella"
  ],
  "author": "Sabrina Darby",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/58657455-rake-i-d-like-to-f"
}