{
  "title": "The Vanishing Type",
  "description": "Entertainment Weekly hails the Secret, Book, and Scone Society series by the beloved New York Times bestselling author as “a love letter to reading.” In this entrancing new story, bookshop owner, bibliotherapist, and occasional sleuth Nora Pennington must enlist the help of her brilliant, brassy librarian friend to unravel the connection between The Scarlet Letter, an obscure 19th century writer, and a dead hiker…While January snow falls outside in Miracle Springs, North Carolina, Nora Pennington is encouraging customers to cozy up indoors with a good book. Even though the shop and her bibliotherapy sessions keep Nora busy during the day, her nights are a little too quiet—until Deputy Andrews pulls Nora into the sci-fi section and asks her to help him plan a wedding proposal. His bride-to-be, Hester, loves Little Women, and Nora sets to work arranging a special screening at the town’s new movie theater. But right before the deputy pops the question, Nora makes an unsettling discovery—someone has mutilated all her store’s copies of The Scarlet Letter, slicing angrily into the pages wherever Hester Prynne’s name is mentioned. The coincidence disturbs Nora, who’s one of the few in Miracle Springs who knows that Hester gave up a baby for adoption many years ago. Her family heaped shame on her, and Hester still feels so guilty that she hasn’t even told her future husband. But when a dead man is found on a hiking trail just outside town, carrying a rare book, the members of the Secret, Book, and Scone Society unearth a connection to Hester’s past. Someone is intent on bringing the past to light, and it’s not just Hester’s relationship at stake, but her life…",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Audiobook",
    "Books About Books",
    "Romance"
  ],
  "author": "Ellery Adams",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/58668273-the-vanishing-type"
}