{
  "title": "The Blacker the Berry",
  "description": "\"For Love's Sake Only\" The last thing Charlotte Sane expects to find at a Rodeo is her dream man, but even she can't deny the instant attraction that leads her straight into the arms of a handsome cowboy named Ty Wilcox. The two have nothing in common. Nothing except insane, inexplicable, but undeniable desire.Ty knows from the instant they first kiss that he and Charlotte are meant to be together. Proving it to strong-willed Charlotte? A whole different bull-ride. The headstrong beauty is running scared, but she's got another thought coming if she thinks Ty will let her walk away.\"The Blacker the Berry\"Tamara Holifield could never have guessed one little favor would change her entire world, but it does. When her best friend Charlotte's husband Ty asks her to come out to visit and cheer up the homebound pregnant woman, she readily agrees. The only problem with Ty's plan is Tamara's lack of a car. Luckily for her, he has a solution, in the form of his best friend, lawyer Russell Crichton.Russell could never have imagined doing a favor for Ty would alter his perception of beauty or disrupt his entire life, but it does. Starting up a new venture is going to take time and focus and the last thing he needs is the distraction of his sexy carpooler.Russell never believed he would be attracted to a plus-size woman, nor did city-slicker Tamara think she would ever have anything in common with a white cowboy, but sizzling sex soon changes both their minds. Now, if they can look past their obvious differences, they might just find out that the blacker the berry, the sweeter the juice.\"Publisher's This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable.\"",
  "genres": [
    "Romance",
    "Interracial Romance",
    "Erotica",
    "Contemporary",
    "Contemporary Romance",
    "Erotic Romance",
    "Westerns"
  ],
  "author": "Lena Matthews",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/5867344-the-blacker-the-berry"
}