{
  "title": "Wicked Prey",
  "description": "Danger stalks Lucas Davenport at work and all too close to home, in the superlative new thriller by the #1 \"New York Times\"-bestselling author. For twenty years, John Sandford's novels have been beloved for their \"ingenious plots, vivid characters, crisp dialogue and endless surprises\" (\"The Washington Post\"), and nowhere are those more in evidence than in the sudden twists and shocks of \"Wicked Prey.\" The Republicans are coming to St. Paul for their convention. Throwing a big party is supposed to be fun, but crashing the party are a few hard cases the police would rather stayed away. Chief among them is a crew of professional stickup men who've spotted several lucrative opportunities, ranging from political moneymen with briefcases full of cash to that armored-car warehouse with the weakness in its security system. All that's headache enough for Lucas Davenport-but what's about to hit him is even worse. A while back, a stray bullet put a pimp and petty thief named Randy Whitcomb in a wheelchair, and, ever since, the man has been nursing his grudge into a full head of psychotic steam. He blames Davenport for the bullet, but it's no fun just shooting him. That wouldn't be painful enough. Not when Davenport has a pretty fourteen-year-old adopted daughter that Whitcomb can target instead. . . . And then there's the young man with the .50 caliber sniper rifle and the right- wing-crazy background, roaming through a city filled with the most powerful politicians on earth. . . . Rich with his brilliant trademark suspense and some of the best characters in suspense fiction, \"Wicked Prey\" is further proof that \"Sandford is one of the most consistently entertaining crime writers working today\" (\"Booklist\").",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "John Sandford",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/5867331-wicked-prey"
}