{
  "title": "Şahitler Kulübü",
  "description": "New York Times’ın çok satan yazarı Tami Hoag bu son ve en heyecan verici romanında Kapalı Kutu’da yarattığı karakteri Elena Estes’i bir kez daha yaşama geçirirken Palm Beach’in ultra zenginlerinin baştan çıkartıcı yaşamlarındaki ahlaki çöküntüyü gözler önüne serip okurlarının yüreğini öfkeyle doldurmayı başarıyor. Bu varlıklı insanların görünüşteki parıltılı yaşamları, pahalı oyuncakları ve dünya çapındaki Polo müsabakaları yanında işledikleri günahlar ve bir grup güçlü adamın birbirlerini kollamak için bir araya gelerek…Kadın bir rüyaydı. Bir kabus. Ölmüştü artık.Şimdi tek yapması gereken cesedi ortadan kaldırmaktı. Ve bunu nasıl yapacağını da gayet iyi biliyordu.Palm Beach’in seçkinleri kendilerini korumak için bir araya gelmişlerdi. Ve Elena Estes’i de artık kendilerinden biri olarak görmüyorlardı. Bir zamanlar zengin ve ayrıcalıklı bir çocuk olan Elena o yaşama sırtını dönmüştü. En yakınında olması gereken kişi tarafından aldatılıp, gözden çıkartılan, bu yüzden de yaşamını dedektif olarak sürdürmeye karar veren Elena’nın başına gelen trajik bir olayla meslek yaşamı da sona ermişti. Artık Elena eski bir dostunun çiftliğinde at eğiterek hayatını kazanıyordu. Ama unutmak için çok çabaladığı geçmişiyle de bağlantılı korkunç bir olayla tüm yaşamı allak bullak olacaktı.Önce kanalda, bir kadın cesedi bulmuştu. Saldırıya uğramış ve öldürülmüş kadın sadece bir cinayet kurbanı değildi, aynı zamanda arkadaşıydı. Elena arkadaşının ölümünü araştırırken hem güçlü bir Rus Mafya babasıyla hem de birbirlerinin günahlarını örtmek için bir araya gelmiş Palm Beach’li bir grup kötü çocukla karşı karşıya kalmıştı. Üstelik bu grupta Elena’nın eski nişanlısı ve kadının adaletin elinden en az bir kere kaçmayı başardığını gayet iyi bildiği Bennett Walker da vardı.Arkadaşının katilini bulma çabası Elena’nın eski yaşamındaki çekişmeleri de su yüzüne çıkaracaktı. Ama o gerçeği açığa çıkarmaya kararlıydı. Palm Beach sosyetesini derinden sarsacak ama sonunda öldürülmesine bile neden olabilecek gerçeği.Tami Hoag’ın romanları, basıldığı 1988 yılından beri düzenli olarak çok satanlar listesinde yer almaktadır. Yazar yaşamını Los Angeles’ta sürdürmektedir.“Merak uyandırmayı en iyi bilenlerden.”People“Zamanımızın en iyi gerilim yazarı.”Chicago Tribune",
  "genres": [
    "Mystery",
    "Suspense",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Romance"
  ],
  "author": "Tami Hoag",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/12796010-ahitler-kul-b"
}