{
  "title": "Her Country: How the Women of Country Music Became the Success They Were Never Supposed to Be",
  "description": "The full and unbridled inside story of the last twenty years of country music through the lens of Maren Morris, Mickey Guyton, and Kacey Musgraves—their peers and inspirations, their paths to stardom, and their battles against a deeply embedded boys’ club, as well as their efforts to transform the genre into a more inclusive place for all (and not just white men in trucker hats), as told by award-winning Nashville journalist Marissa R. Moss.It was only two decades ago, but, for the women of country music, 1999 seems like an entirely different universe. With Shania Twain, country’s biggest award winner and star, and The Chicks topping every chart, country music was a woman’s world: specifically, country radio and Nashville’s Music Row.Cut to 2021, when women are only played on country radio 16% of the time, on a good day, and when only men have won Entertainer of the Year at the CMA Awards for a decade. To a world where artists like Kacey Musgraves sell out arenas but barely score a single second of airplay. But also to a world where these women are infinitely bigger live draws than most male counterparts, having massive pop crossover hits like Maren Morris’s “The Middle,” pushing the industry to confront its deeply embedded racial biases with Mickey Guyton’s “Black Like Me,” winning heaps of Grammy nominations, banding up in supergroups like The Highwomen and taking complete control of their own careers, on their own terms. When the rules stopped working for the women of country music, they threw them out and made their own: and changed the genre forever, and for better.Her Country is veteran Nashville journalist Marissa R. Moss’s story of how in the past two decades, country’s women fought back against systems designed to keep them down, armed with their art and never willing to just shut up and sing: how women like Kacey, Mickey, Maren, The Chicks, Miranda Lambert, Rissi Palmer, Brandy Clark, LeAnn Rimes, Brandi Carlile, Margo Price and many more have reinvented the rules to find their place in an industry stacked against them, how they’ve ruled the century when it comes to artistic output—and about how women can and do belong in the mainstream of country music, even if their voices aren’t being heard as loudly.",
  "genres": [
    "Nonfiction",
    "Music",
    "History",
    "Audiobook",
    "Feminism",
    "Womens",
    "Book Club"
  ],
  "author": "Marissa R. Moss",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/58673072-her-country"
}