{
  "title": "Genealogy Online For Dummies",
  "description": "Researching our roots has become a top national pastime, and with the advent of the Internet, it's also become much faster and easier than before. Rather than hop in the car and hope you can find the courthouse of the county where your great-grandmother grew up before it closes, you can relax and research in the comfort of your own home, at your convenience. The only problem is where--and how--do you start? Genealogy Online For Dummies, 4th Edition is a great starting point. Written by genealogists who manage and maintain several online genealogy services, this guide helps you make sense of the vast array of resources on the Web. It shows you how toSearch online databases Explore genealogical societies Use geographic tools Research ethnic roots Validate your findings Share your research So you don't waste time and effort wandering all over the Web, Genealogy Online For Dummies, 4th Edition shows you how to set up your own personal database first, using information you already have from family members. Then it helps you make your search productive byChoosing the right government resources to help locate your ancestors Fleshing out the statistics with personal information from geographical, ethnic, and religious sources Cooperating with other researchers, sharing information, and coordinating efforts with societies and research groups Providing proven tips, reminders, suggestions, and lists of online databases Offering suggestions for developing your own genealogical Web site, and more To get you started in style, the bonus CD-ROM includes the full version of Family TreeMaker and Legacy Family Tree freeware, a tryout version of Adobe(R) Photoshop(R) Elements 2.0 for preserving treasured family photos, and lots of other valuable techno-tools. And it all comes with a warning: genealogical research can become addictive!",
  "genres": [
    "Nonfiction",
    "Reference",
    "Self Help",
    "Gardening"
  ],
  "author": "Matthew L. Helm",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/1279599.Genealogy_Online_For_Dummies"
}