{
  "title": "Delicious Disney: Walt Disney World: Recipes & Stories from The Most Magical Place on Earth",
  "description": "Walt Disney World honors its fiftieth anniversary with \" The World's Most Magical Celebration,\" an incredible 18-month event that begins October 1, 2021. As part of the festivities, Delicious Walt Disney World is a holistic look at the Florida resort's culinary past, present, and future―all organically woven around diverse recipes from the Disney Chefs and fit for home chefs of varying skill levels.After the success of Disneyland, Walt Disney wanted to build something more elaborate and with more room. Ultimately, it was Walt's brother and business partner, Roy O. Disney, who brought forth his sibling's dream―and made it a reality―when the Magic Kingdom opened in 1971. More than fifty years later, we still celebrate Walt's dream, Roy's vision and commitment, plus the dedication of those who serve up a world of magic. And all of it is deliciously Disney.Filled with a heartfelt narrative and behind-the-scenes anecdotes, mouth-watering food photos, gorgeous Walt Disney Imagineering concept artwork, nostalgic restaurant menus and ephemera, and a little Disney magic, this cookbook-meets-culinary-history coffee table book enchants with more than sixty recipes. Including an assortment of appetizers, main courses, sides, desserts, and even joyful libations, these dishes come from fine-dining and quick-service establishments across the resort. Each has been tested by home chefs to help you bring your cherished vacation memories to life . . . and inspire new ones for years to come.Here’s just a sampling of what awaits Searching for ways to celebrate the Walt Disney World Resort? Explore more books from Disney Editions :",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Travel",
    "Food",
    "Culinary"
  ],
  "author": "Pam Brandon",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/58684448-delicious-disney"
}