{
  "title": "The Memory Librarian: And Other Stories of Dirty Computer",
  "description": "In The Memory Librarian: And Other Stories of Dirty Computer, singer-songwriter, actor, fashion icon, activist, and worldwide superstar Janelle Monáe brings to the written page the Afrofuturistic world of one of her critically acclaimed albums, exploring how different threads of liberation—queerness, race, gender plurality, and love—become tangled with future possibilities of memory and time in such a totalitarian landscape…and what the costs might be when trying to unravel and weave them into freedoms.Whoever controls our memories controls the future.Janelle Monáe and an incredible array of talented collaborating creators have written a collection of tales comprising the bold vision and powerful themes that have made Monáe such a compelling and celebrated storyteller. Dirty Computer introduced a world in which thoughts—as a means of self-conception—could be controlled or erased by a select few. And whether human, A.I., or other, your life and sentience was dictated by those who’d convinced themselves they had the right to decide your fate.That was until Jane 57821 decided to remember and break free.Expanding from that mythos, these stories fully explore what it’s like to live in such a totalitarian existence…and what it takes to get out of it. Building off the traditions of speculative writers such as Octavia Butler, Ted Chiang, Becky Chambers, and Nnedi Okorafor—and filled with the artistic genius and powerful themes that have made Monáe a worldwide icon in the first place—The Memory Librarian serves readers tales grounded in the human trials of identity expression, technology, and love, but also reaching through to the worlds of memory and time within, and the stakes and power that exists there.",
  "genres": [
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "LGBT",
    "Fantasy",
    "Queer",
    "Audiobook"
  ],
  "author": "Janelle Monáe",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/58677491-the-memory-librarian"
}