{
  "title": "In the Face of the Sun",
  "description": "Go On Girl Book Club 2021 New Author of the Year | She Reads Best Literary Historical Fiction Coming in 2022 | BookRiot 2022 Historical Fiction to Add to Your TBR Right Now | We are Bookish Historical Fiction Novels You’ll Want in Your Future | BiblioLifestyle Most Anticipated Books of 2022 | BookBub Best Books of Spring 2022 & Best Historical Fiction Books of 2022 | BookTrib Top Ten Historical Fiction Books for the Spring 2022In this haunting novel, the author of Wild Women and the Blues weaves together two stories as they unfold decades apart, as a woman on the run from an abusive husband joins her intrepid aunt as they head across the country from Chicago to Los Angeles, and confront a painful and shadowy past that has reverberated across generations.1928, Los Angeles: The newly-built Hotel Somerville is the hotspot for the city's glittering African-American elite. It embodies prosperity and dreams of equality for all—especially Daisy Washington. An up-and-coming journalist, Daisy anonymously chronicles fierce activism and behind-the-scenes Hollywood scandals in order to save her family from poverty. But power in the City of Angels is also fueled by racism, greed, and betrayal. And even the most determined young woman can play too many secrets too far . . . 1968, Chicago: For Frankie Saunders, fleeing across America is her only escape from an abusive husband. But her rescuer is her reckless, profane Aunt Daisy, still reeling from her own shattered past. Frankie doesn't want to know what her aunt is up to so long as Daisy can get her to LA—and safety. But Frankie finds there’s no hiding from long-held secrets—or her own surprising strength. Daisy will do whatever it takes to settle old scores and resolve the past—no matter the damage. And Frankie will come up against hard choices in the face of unexpected passion. Both must come to grips with what they need, what they’ve left behind—and all that lies ahead . . .",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "African American",
    "Book Club",
    "Mystery",
    "Cultural"
  ],
  "author": "Denny S.  Bryce",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/58688127-in-the-face-of-the-sun"
}