{
  "title": "I'll Be You",
  "description": "11 hours, 41 minutes Two identical twin sisters and former child actors have grown apart--until one disappears, and the other is forced to confront the secrets they've kept from each other in this twisty thriller from the New York Times bestselling author of Pretty Things.\n\"You be me, and I'll be you,\" I whispered.\nAs children, Sam and Elli were two halves of a perfect whole: Gorgeous identical twins whose parents sometimes couldn’t even tell them apart. They fell asleep to the sound of each other’s breath at night, holding hands in the dark. And once Hollywood discovered them, they became B-list child TV stars, often inhabiting the same role.But as adults their lives have splintered. After leaving acting, Elli reinvented herself as the perfect homemaker: Married to a real-estate lawyer, in a house two blocks from the beach. Meanwhile, Sam has never recovered from her failed Hollywood career, or from her addiction to the pills and booze that have propped her up for the last 15 years.Sam hasn't spoken to her sister since her destructive behavior finally drove a wedge between them. So when her father calls out of the blue, Sam is shocked to learn that Elli’s life has been in turmoil: Her husband moved out, and Elli just adopted a two-year-old girl. Now she’s stopped answering her phone and checked in to a mysterious spa in Ojai. Is her sister just decompressing, or is she in trouble? Could she have possibly joined a cult? As Sam works to connect the dots left by Elli’s baffling disappearance, she realizes that the bond between her and her sister is more complicated than she ever knew.I’ll Be You shows Janelle Brown at the top of her game: a story packed with surprising revelations and sharp insights about the choices that define our families and our lives — and could just as easily destroy them.",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Suspense",
    "Adult"
  ],
  "author": "Janelle Brown",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/58678420-i-ll-be-you"
}