{
  "title": "Sin Like Flynn",
  "description": "From USA Today Bestselling author Kathryn Le Veque and #1 Amazon Bestselling author Alexa Aston, the Regency Duet you've been waiting for... meet the sensual, handsome, and naughty Sinning Flynns.London will never be the same...Mad King George III shocks Polite Society when he awards Cornish smuggler Sean Flynn, descended from an Irish pirate, an earldom and lands in Cornwall. Sean finds his mate in Lady Amy, the Duke of Savernake’s only daughter, who jilts her betrothed for the handsome and wealthy Earl of Sinbrook. The couple, favored by the king, become entrenched in the ton and have four sinfully handsome sons.The eldest sons follow in their father’s footsteps in the thriving smuggling industry, which eventually becomes a legitimate shipping business. They make their fortunes and find proper English brides. But the younger sons, Rory and Aidan, want to be their own men and are determined to find their mates their way—by hook, crook, or scandal.Enter the night of nights, the annual event Polite Society anticipates—the dazzling Stag Ball given by the Duke of Savernake himself.Now, the Sinning Flynns have their hunting grounds... and the games begin.The Sin Commandments by Kathryn Le VequeRory Flynn is embittered by the Sinning Flynn’s reputation as a wealthy family from Irish stock, hated by the Ton but accepted because of their links to the Duke of Savernake.The worst offender against his family is none other than the man his mother jilted those years ago, the Earl of Exford. He’s never forgiven Lady Sinbrook for her offense against him even though he managed to marry well. Knowing the earl and his daughter will be at the Stag Ball, Rory is determined to compromise the daughter to punish the earl for his sins against Lady Sinbrook. But what he didn’t count on was a chance encounter with a sweet, beautiful woman who pulls him off his quest.As he goes in pursuit of Lady Edith “Edie” Rissington, Rory finds himself entrenched in a world where her secrets are darker than his own, and sins are something that can never be forgiven. Will Edie forgive him his family’s past—or can Rory forgive her for withholding hers?One Magic Night by Alexa AstonAidan Flynn isn’t a rogue, instead modeling himself after his grandfather, the Duke of Savernake, who will leave Larkhaven to Aidan—if he weds in the next two weeks.Lady Larissa Warren’s amoral family has prevented her from making a suitable match. Now, her father has told her to find a husband at tonight’s annual Savernake Stag Ball—or she must wed the ancient Lord Langdon.Aidan decides Larissa is the one, but she has no interest in marrying an infamous Sinning Flynn. Will Aidan convince Larissa he is nothing like his rakehell brothers and win the auburn-haired beauty’s hand?Regency Historical Romance has never been so sinful—or so fun!",
  "genres": [
    "Historical",
    "Historical Romance"
  ],
  "author": "Kathryn Le Veque",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/58675994-sin-like-flynn"
}