{
  "title": "The High Auction",
  "description": "In the near future, a machinist, a monk, and a mesmerizer are looking for the Source of the universe, but among the ancient scriptures, they only find the devil …Few humans in the future find the secrets of what words and sounds can do, for the Apocalypse and war have led them to evolve in mind and physique. Two of them end World War III with just a four-minute speech. Some say they did mass hypnosis. Others say it was their voice and will. Fifty years later in South Asia, KUSHA, a twenty-three-year-old machine-geek with social awkwardness and amnesia, tries to get the Devil’s Book with secrets of voice. But her idol of voice and everyone's beloved war heroes, YUAN and RUEM, are also after it for power.Series BlurbIn a society that worships the evolved High Grades with voice, how you speak and which words you talk with is important. As someone who finds all solutions in books, Kusha thinks the secrets in the three-foot-long ancient book will teach her to speak mesmerizingly. She believes it will help her evolve. So, she decides to attend the auction where the book will be sold. But there's a problem; powerful High Grades want the book too. They want to code fate, rewriting the material world. They are undead, immortal mesmerizers. And being a philosopher, Kusha admires their ethics while she must fight them—the fight that starts with the book, the fight that creates a chain reaction leading her to an epic journey.THE HIGH AUCTION: WISDOM REVOLUTION is a book of genre-bending Adult Sci-fi-Fantasy series \"The Machinist, Monk, & Mesmerizer Chronicles.\" Here, you'll find Metaphysical magic built around philosophy and spirituality. You'll find ancient mysteries, archaeological adventures, and, most importantly, you will meet some characters. You’ll find the theme similar to The Matrix or Westworld while the story will feel like an epic-fantasy in a fully built world.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Science Fiction Fantasy",
    "Post Apocalyptic",
    "Adventure",
    "Adult",
    "Dark"
  ],
  "author": "Misba",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/58695928-the-high-auction"
}