{
  "title": "Read Between the Stars",
  "description": "BenThey say love can happen again after loss.I’ve seen it, and I’ve heard of it, yet it still seems like a myth to me.Maybe because I’ve never opened myself to itBut now after a friend has pulled me out of the dark void, I’m seeing signs and feelings I thought were long dead are awakening.And I’m feeling them for Kasey.So many things about her set her far apart from all the rest but it’s her strength I love most about her. That and her little girl, Luna.She deals with her own struggles like a champ but do I want to add the complication of loving a widower to her life?While I’m skeptical at first, with each passing day, the more I believe that there’s nothing she can’t do.KaseyMen sure have a way of making me regret trusting them.Besides, I have enough to deal with being a single mother while battling my own demons.So it’s just me and my daughter. It’s better that way. She’s my best buddy and she’s enough.Would I like her to have a father and maybe even someone to love me too?Definitely.So I go on dates, hoping one will lead to someday meeting my daughter, but none of them have proven themselves worth the risk of shaking the foundation of the stable lifestyle I’ve built for her.But I’m faced with an unexpected challenge when I start to fall for a guy that’s already been introduced to her. A great guy, with a past of his own. Can he rebuild his broken soul and see me and Luna as his future?I want to believe he can.This story is intended for readers aged 18 and up.Certain scenes contain situations involving sensitive issues such as addiction and trauma that may be triggering for some individuals.Can be read as a stand alone but does contain spoilers from Where You Are (Book 4 in the series; Matt and Melanie's story).",
  "genres": [
    "Sports",
    "Contemporary",
    "Friends To Lovers",
    "Second Chance"
  ],
  "author": "Natalie  Parker",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/58706716-read-between-the-stars"
}