{
  "title": "Triumph's Ashes",
  "description": "The war between the Terran Federation and the Union of Artemis has been dragging on for almost two years, running hot and cold by turns. Each side has had their victories, and each side has had their setbacks. But now all the pieces are in place for a knockout blow; the only question is who will deliver it first?They'll find out there is no triumph without sacrifice.Meet the players: Admiral Kendra Cassidy, founder and leader of the Terran Federation, she's a dreamer at heart who wants nothing more than to explore the stars with her wife and family.Commander Aiyana Cassidy, genius physicist and now Executive Officer aboard the TFS Enterprise. Spends almost as much time shooting down Kendra's crazy ideas as she does figuring out how to make them work.The Primus, Vasilia Newling, unelected leader of the Union of Artemis but no less powerful for that. Fiercely protective of her Family's standing on Luna and committed to the preservation of the Union.Daniela Garcia-Kay, called 'Double Dip' and the commander of the Nymeria Squadron of Direwolf space superiority fighters. Captain Jennifer 'Alley' Martinez, commander of the TFS Enterprise. She brings a wealth of professional naval knowledge into the Federation.First Councillor Tal Phalkon, an ambitious member of the ruling Council. She's worked her steadily upward, using an agile mind and a total lack of scruples to get where she wants to be.Autumn Newling, Vasilia's cousin and leader of Free Luna and the revolution. Disgusted by the corruption within her home nation she's finally done something about it. Will it cost her all she holds dear?Mikki Stone, retired SEAL and honorary aunt to the Cassidy's daughters. All she wanted to do was have a quiet retirement, but she finds herself on the pointy end once again.Amanda 'Mac' McAllister's a technician's technician, a genius at computers, and is getting better about dealing with humans. So what is she doing on a commando raid on Luna?Come along for the stunning conclusion to the Artemis War!",
  "genres": [],
  "author": "Adam Gaffen",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/58701706-triumph-s-ashes"
}