{
  "title": "The Mind Invaders",
  "description": "THE COLD WAR FOR PSYCHIC DOMINION HEATS UP! Ken Inman experienced an exhilaration beyond his wildest imagination. He had made contact! Excitedly he “We’ve been watching your development—we’re here to help you take the next step. Open up. There’s nothing to fear.” Spine-tingling action follows this incredible breakthrough in mind research. Opening doors to the unlimited vistas of the mind, the Archons share their gift of psychic power, promising a new era of peace. But then governments get involved... Discovering the CIA and Russian Intelligence’s battle for psychic control, famed journalist Carla Bertelli delves into the power behind the Archons. Convinced they are benevolent, she is devastated when Ken renounces the paranormal and embraces Christianity. Torn between her love for Ken and her contempt for his “demons theory,” Carla plunges into a search for the truth that becomes a desperate race against time... Reader “I couldn’t put this book down. Dave Hunt does a wonderful job with this fictional book, originally written as a screenplay. It presents some [fascinating factual ideas] within a fictional setting. The explanation Dave Hunt provides...for UFOs and Aliens is actually quite reasonable and believable.... Well done. It has remained my favorite book since I first picked it up. Good Job Dave Hunt!” —IW “First published in 1989 but perhaps more up to date than today’s newspaper. I seldom read fiction but I got into this. The best fiction book I have ever read.” —TG “A great book to learn about aliens and UFO invasions. The Mind Invaders gets down to the truth about physics and fortune tellers.... One of Dave Hunt’s best!” —EY “The Mind Invaders is a must read! I picked up this book by accident. However after I began reading it I simply could not put it down! Dave Hunt weaves a tale of intrigue, suspense and super-reality that may give answers to the complex question of UFOs, ascended masters, and the netherworld that surrounds us. This is simply quite a compelling work of fiction that is more reality and truth than one may want to admit. I highly recommend it to all.” —DF “An excellent novel, a must read, a hard book to put down! This is the best fiction novel that I have ever read.... A very realistic book—something that could happen, or may be happening now. Thanks, Dave Hunt for such a good book.” —AR (Originally The Archon Conspiracy)",
  "genres": [
    "Fiction",
    "Fantasy",
    "Christian",
    "Science Fiction",
    "Thriller",
    "Christian Fiction",
    "Audiobook"
  ],
  "author": "Dave  Hunt",
  "average_rating": "2.95",
  "url": "https://www.goodreads.com/book/show/587007.The_Mind_Invaders"
}