{
  "title": "Filthy Crown",
  "description": "JACKTragedy strikes, again.Four years after suffering the loss of our parents, our brother is murdered right alongside his beautiful wife, the devastation leaving their three children orphaned.Not only have I lost my brother but now I’m forced to take on his two kids and seventeen-year-old stepdaughter, Penelope.But Pen is far from the little girl I remember. No. She’s all woman, with soft curves and plush lips—all things I shouldn’t be noticing.I have three months before she turns eighteen. Three months before she leaves for college. And three months to make sure whatever threat against her life has been thwarted.Too bad for me, those three months will be nothing but torture laced with temptation, threatening to break my resolve.Can I come out of this unscathed, or will this lust drag me into the pits of hell where I belong?PENELOPELies, deceit, and death. It’s all I’ve ever known.And trusting someone? Out of the question.Unfortunately, teenager me didn’t get the memo and I stupidly gave my crush-riddled heart to Jack Crown.He was older, wiser, and apparently a manwhore.I was his brother’s stepdaughter and way too young. Not on his radar, and justifiably so.But that didn’t stop me from falling for the only man who’d ever shown me real affection. No. I let myself trust him, thinking he’d always be there. The one constant in my crappy life.I was wrong.Now, four years later, tragedy strikes again. By life’s irony I’ve landed on his doorstep with only one thing to prove.I’m not the little girl he remembers, and I sure as f*ck don’t need him anymore.Filthy Crown is a spin on the single dad age gap trope where Jack finds himself a new daddy after inheriting his brother's kids and strong-willed stepdaughter. Here's what to expect:♛ Single Dad♛ Steam♛ Age Gap♛ Forbidden Romance♛ Happily Ever After",
  "genres": [
    "Romance",
    "Dark",
    "Dark Romance",
    "Contemporary Romance",
    "Contemporary",
    "Forced Proximity",
    "Erotica"
  ],
  "author": "Eleanor Aldrick",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/58705578-filthy-crown"
}