{
  "title": "Every Good Boy Does Fine: A Love Story, in Music Lessons",
  "description": "A beautifully written, witty memoir that is also an immersive exploration of classical music--its power, its meanings, and what it can teach us about ourselves--from the MacArthur Genius Grant-winning pianist\n\"Jeremy Denk has written a love letter to the music, and especially to the music teachers, in his life.\"--Conrad Tao, pianist and composerIn Every Good Boy Does Fine,  renowned pianist Jeremy Denk traces an implausible journey. His life is already a little tough as a precocious, temperamental six-year-old piano prodigy in New Jersey, and then a family meltdown forces a move to New Mexico. There, Denk must please a new taskmaster, an embittered but devoted professor, while navigating junior high school. At sixteen he escapes to college in Ohio, only to encounter a bewildering new cast of music teachers, both kind and cruel. After many humiliations and a few triumphs, he ultimately finds his way as a world-touring pianist, a MacArthur \"Genius,\" and a frequent performer at Carnegie Hall.Many classical music memoirs focus on famous musicians and professional accomplishments, but this book focuses on the everyday: neighborhood teacher, high school orchestra, local conductor. There are few writers capable of so deeply illuminating the trials of artistic practice--hours of daily repetition, mystifying advice, pressure from parents and teachers. But under all this struggle is a love letter to the act of teaching.In lively, endlessly imaginative prose, Denk dives deeply into the pieces and composers that have shaped him--Bach, Mozart, and Brahms, among others--and offers lessons on melody, harmony, and rhythm. How do melodies work? Why is harmony such a mystery to most people? Why are teachers so obsessed with the metronome?In Every Good Boy Does Fine,  Denk shares the most meaningful lessons of his life, and tries to repay a debt to his teachers. He also reminds us that we must never stop asking questions about music and its purposes: consolation, an armor against disillusionment, pure pleasure, a diversion, a refuge, and a vehicle for empathy.",
  "genres": [
    "Music",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Jeremy Denk",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/58690857-every-good-boy-does-fine"
}