{
  "title": "The High Auction",
  "description": "In the near future, a machinist, a monk, and a mesmerizer are looking for the Source of the universe, but among the ancient scriptures, they only find the devil …Few humans in the future find the secrets of what words and sounds can do, for the Apocalypse and war led them to evolve in mind and physique. Two of them end World War III with just a speech. Some say they did a mass hypnosis. Others say it was their voice and will. Fifty years later in South Asia, KUSHA, a twenty-three-year-old machine-geek with social awkwardness and amnesia, tries to get the Devil’s Book with secrets of voice. In a society that worships the evolved High Grades with voice, how you speak and which words you talk with is important. As someone who finds all solutions in books, Kusha thinks the secrets in the three-foot-long ancient book will teach her to speak mesmerizingly. She believes it will help her evolve. So, she decides to attend the auction where the book will be sold. But there's a problem. Her idol of voice and everyone's beloved war heroes, YUAN and RUEM, are also after it for power. Series BlurbThey want to code fate, rewriting the material world. When they are not camping near the temples that rose from beneath the oceans after the Apocalypse, they are playing classical orchestra or Himalayan Thumri or ... maybe, reciting Bedouin or Bengali poetry. They are undead, immortal mesmerizers. And being a philosopher, Kusha admires their ethics as she fights them—the fight that starts with the book. The fight that creates a chain reaction leading her to an epic journey.She faces an unfair system, and if she wants to change it, she has to be a Goddess. And no drugs, hypnosis, or codes can help her to become what she needs to be. There’s no shortcut to evolution. It’s about love with no rules, friendship in the veil of enmity, and a war in the name of secret wisdom.About the Series:THE HIGH AUCTION: WISDOM REVOLUTION is a book of genre-bending Adult Sci-fi-Fantasy series \"The Machinist, Monk, & Mesmerizer Chronicles.\" Here, you'll find Metaphysical magic built around philosophy and spirituality. You'll find ancient mysteries, archaeological adventures, and, most importantly, you will meet some characters. You’ll find the theme similar to The Matrix or Westworld while the story will feel like epic fantasy in near future with a fully built world. Its inspiration was from myths/truth (read the word you prefer) of all religions where humans evolved to Sufis, Rishis, Sannashis, Monks, and sometimes, Gods. Example: Shiva Purana in Hindu epics where Sati evolved to Goddess Parvati and splits into Kali to destroy the evil is a prominent example. You'll find diverse cultures, sexuality, and faith in this series. Enjoy.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Science Fiction Fantasy",
    "Post Apocalyptic",
    "Adventure",
    "Adult",
    "Dark"
  ],
  "author": "Misba",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/58695931-the-high-auction"
}