{
  "title": "Pride",
  "description": "Genius. Billionaire. Arrogant. Vigilante. Liar. There are many words to describe Parker Lazarus. Some call him stubborn. Some call him impossible. Some call him a liar. He doesn’t care what anyone calls him, as long as he fulfills his destiny to rid the world of the fanatical Syndicate and leads his family to victory. Of his seven siblings, six have found their lifemate. But it should have been him first. He battles the deadly sin of pride, and he accepts no failure. Especially his own. When Parker finds out his mate has been under his nose for years, an assassin masquerading as his assistant, his controlled world is thrown into chaos. Not only does he lose his arm because of his unwillingness to accept this truth, but he loses himself when she challenges him in ways he’d never thought possible. How did this woman slip past his defenses? How does she continue to defy him at every turn? Why does he risk everything – even his secret identity – to keep her safe? Pride becomes more than another word to describe him. It becomes his downfall. And if he can’t learn to open himself up to failure, and to trust the help of loved ones, then his pride will pave the road to destruction. Not just for the Syndicate, but for all mankind.♥Multi award-nominated series. ♥Finalist in the ARRA Award for Best Ongoing Paranormal Romance Series. ♥Each book can be read as a standalone, but is best read in order to appreciate the overarching plot.The Deadly Seven is a paranormal/scifi romance featuring genetically modified heroes who must find a lifemate or become the deadly sin they are destined to destroy. Perfect for fans of superhero shows like Batman, Arrow, The Flash and Superman... but with more heartfelt and hot romance from the hero and his love interest. If you like reading about fated mates, second chances, genetically modified band of warriors, alpha heroes and strong heroines, then you'll fall head over heels for the Deadly Seven. For mature audiences only. Read FREE in Kindle Unlimited.",
  "genres": [
    "Paranormal",
    "Romance",
    "Fantasy",
    "Urban Fantasy",
    "Contemporary",
    "Science Fiction",
    "Paranormal Romance"
  ],
  "author": "Lana Pecherczyk",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/58711181-pride"
}