{
  "title": "Lily in the Snow and Other Elemental Tales",
  "description": "Four tales of Elemental beings weave together to craft this whimsical anthology filled with love, magic, and courage.Lily in the Snow ~ Mica Schist, a Rock Elemental, has lived all her life in the mountains with Pierson, her melancholy guardian. When Jewett, an Earth Elemental, visits their cave, Mica’s world is turned upside-down—as is her heart. She longs for a life outside the cave, and soon, an approaching enemy grants this wish. But even the gentle forests of Jewett’s world cause Mica to lose her fragile crystals, her life source. Can Mica save herself and live the life she’s always dreamed?The Story-Teller ~ Eleesa’s gift is that of story-telling. She has no problem embellishing the truth now and then; after all, she’s never noticed the same consequences that befall the other Imps who misuse their gifts. However, through an old friend who mysteriously reappears, she will discover that the consequences are much more severe than she could have ever imagined.Labyrinth: Heart of Stone ~ Gargoyles, Druids, haughty dragon fairies, a seductive Noelani, a mansion housing an endless maze of stairs—and not to mention, a handsome, brooding man made of stone. These magical elements combine to create the perfectly scandalous tale of Catherine, an Earth Elemental who sets out seeking freedom and discovers it in the most unexpected ways.Spyral ~ A coming-of-age tale in which a Rock Elemental chooses to defy the unjust traditions of her people. Setting out on a journey to save herself and the one she loves, she ends up embarking on a much more personal journey of self-discovery.The Amielian Legends is a collection of stand-alone young adult books, all set in the same fantastic universe, that can be read in any order. Read Lily in the Snow to discover new worlds filled with magic, adventure, and diverse characters today!",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction"
  ],
  "author": "Christine E. Schulze",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/12797734-lily-in-the-snow-and-other-elemental-tales"
}