{
  "title": "Science Fiction: The Science Fiction Research Association Anthology",
  "description": "Science Fiction: The Science Fiction Research Association Anthology. A great collection from 1843-1984. The 26 stories in this anthology were selected during 1984 and 1985 by the members of the Science Fiction Research Association. For years, those bringing SF into the classroom have had to improvise their course materials from anthologies and collections not designed for classwork. Now here is presented a carefully selected reading anthology reflecting the SF field in all its modern diversity. Cover by Maria Carella.Collection of 26 chronologically-arranged stories by 25 authors (H. G. Wells is represented twice) that illustrate the historical development of the genre from Nathaniel Hawthorne into the 1980s. All three of the editors are academics, and each story is followed by commentary from another academic critic; the sponsoring organization is dedicated to the study of science fiction, and the collection is intended as a college textbook. Come along for a fascinating glance into...Science FictionContents:* Preface (Science Fiction: The Science Fiction Research Association Anthology) • essay by editors* The Birthmark (1854) / short story by Nathaniel Hawthorne (variant of The Birth-Mark 1843); Afterword to \"The Birthmark\" • essay by Francis J. Molson* The Star (1897) / short story by H. G. Wells; Afterword to \"The Star\" • essay by James E. Gunn [as by James Gunn]* The Country of the Blind (1904) / novelette by H. G. Wells;Afterword to \"The Country of the Blind • essay by Jack Williamson* The Machine Stops (1909) / novelette by E. M. Forster; Afterword to \"The Machine Stops\" • essay by Charles L. Elkins [as by Charles Elkins]* A Martian Odyssey [Tweel • 1] (1934) / novelette by Stanley G. Weinbaum; Afterword to \"A Martian Odyssey\" • essay by Frederik Pohl* Who Goes There? (1938) / novella by John W. Campbell Jr.; Afterword to \"Who Goes There?\" • essay by Sam Moskowitz* Nightfall (1941) / novelette by Isaac Asimov; Afterword to \"Nightfall\" • essay by Donald M. Hassler* No Woman Born (1944) / novella by C. L. Moore; Afterword to \"No Woman Born\" • essay by Mary S. Weinkauf* Thunder and Roses (1947) / novelette by Theodore Sturgeon; Afterword to \"Thunder and Roses\" • essay by H. Bruce Franklin* Private Eye (1950) / novelette by Henry Kuttner, C. L. Moore [as by Henry Kuttner]; Afterword to \"Private Eye\" • essay by Merritt Abrash* There Will Come Soft Rains [The Martian Chronicles] (1950) / short story by Ray Bradbury; Afterword to \"There Will Come Soft Rains\" • essay by Patrick G. Hogan, Jr.* The Sentinel [A Space Odyssey] (1951) / short story by Arthur C. Clarke; Afterword to \"The Sentinel\" • essay by Thomas D. Clareson* Common Time (1953) / short story by James Blish; Afterword to \"Common Time\" • essay by Willis E. McNelly* The Game of Rat and Dragon [The Instrumentality of Mankind] (1955) / short story by Cordwainer Smith; Afterword to \"The Game of Rat and Dragon\" • essay by Muriel R. Becker* The Men Who Murdered Mohammed (1958) / short story by Alfred Bester; Afterword to \"The Men Who Murdered Mohammed\" • essay by Russell Letson* Flowers for Algernon (1959) / novelette by Daniel Keyes; Afterword to \"Flowers for Algernon\" • essay by Martin H. Greenberg* A Rose for Ecclesiastes (1963) / novelette by Roger Zelazny; Afterword to \"A Rose for Ecclesiastes\" • essay by Carl B. Yoke* Driftglass (1967) / short story by Samuel R. Delany; Afterword to \"Driftglass\" • essay by David N. Samuelson* Faith of Our Fathers (1967) / novelette by Philip K. Dick; Afterword to \"Faith of Our Fathers\" • essay by Patricia S. Warrick* I Have No Mouth, and I Must Scream (1967) / short story by Harlan Ellison; Afterword to \"I Have No Mouth, and I Must Scream\" • essay by Richard D. Erlich* Nine Lives (1969) / novelette by Ursula K. Le Guin; Afterword to \"Nine Lives\" • essay by Veronica M. S. Kennedy* When It Changed [Whileaway] (1972) / short story by Joanna Russ; Afterword to \"When It Changed\" • essay by Mary Kay Bray* Of Mist, and Grass, and Sand [Snake] (1973) / novelette by Vonda N. McIntyre; Afterword to \"Of Mist, and Grass, and Sand\" • essay by Mary Kay Bray* Houston, Houston, Do You Read? (1976) / novella by James Tiptree Jr.; Afterword to \"Houston, Houston, Do You Read?\" • essay by Thomas P. Dunn* Options [Eight Worlds] (1979) / novelette by John Varley; Afterword to \"Options\" • essay by John Clute* Bloodchild (1984) / novelette by Octavia E. Butler; Afterword to \"Bloodchild\" • essay by Elizabeth Anne Hull* Select Bibliography (Science Fiction: The Science Fiction Research Association Anthology) • essay by editors* General Bibliography (Science Fiction: The Science Fiction Research Association Anthology) • essay by editorsThere is an additional index that rearranges the chronological list by Thematic Contents, broken down into the interest categories of biological, environmental, psychosocial, and technological (with several stories appearing in more than one category). Each story is followed by several paragraphs of editorial commentary (by college professors other than the trio of editors) that explains things about the author and the story's place in the history of science fiction.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Reference",
    "School",
    "Fiction"
  ],
  "author": "Patricia S. Warrick",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/587202.Science_Fiction"
}