{
  "title": "Galveston: A History of the Island (Chisholm Trail Series)",
  "description": "Galveston—a small, flat island off the Texas Gulf coast—has seen some of the state's most amazing history and fascinating people. First settled by the Karankawa Indians, long suspected of cannibalism, it was where the stranded Cabeza de Vaca came ashore in the 16th century. Pirate Jean Lafitte used it as a hideout in the early 1800s and both General Sam Houston and General James Long (with his wife, Jane, the “Mother of Texas”) stayed on its shores. More modern notable names on the island include Robert Kleberg and the Moody, Sealy and Kempner families who dominated commerce and society well into the twentieth century.Captured by both sides during the Civil War and the scene of a devastating sea battle, the city flourished during Reconstruction and became a leading port, an exporter of grain and cotton, a terminal for two major railroads, and site of fabulous Victorian buildings—homes, hotels, the Grand Opera House, the Galveston Pavilion (first building in Texas to have electric lights). It was, writes Cartwright, “the largest, bawdiest, and most important city between New Orleans and San Francisco.”This country's worst natural disaster—the Galveston hurricane of 1900—left the city in shambles, with one sixth of its population dead. But Galveston recovered. During Prohibition rum-running and bootlegging flourished; after the repeal, a variety of shady activities earned the city the nickname “The Free State of Galveston.”In recent years Galveston has focused on civic reform and restoration of its valuable architectural and cultural heritage. Over 500 buildings are listed on the National Register of Historic Places, and an annual \"Dickens on the Strand\" festival brings thousands of tourists to the island city each December. Yet Galveston still witnesses colorful incidents and tells stories of descendants of the ruling families, as Cartwright demonstrates with wry humor in a new epilogue written specially for this edition of Galveston . First published in 1991 by Atheneum.",
  "genres": [
    "History",
    "Historical",
    "Nonfiction"
  ],
  "author": "Gary Cartwright",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/587150.Galveston"
}