{
  "title": "Corrections in Ink: A Memoir",
  "description": "“Brave, brutal . . . a riveting story about suffering, recovery, and redemption. Inspiring and relevant.”―The New York TimesAn electric and unforgettable memoir about a young woman's journey―from the ice rink, to addiction and a prison sentence, to the newsroom―and how she emerged with a fierce determination to expose the broken system she experienced.Keri Blakinger always lived life at full throttle. Growing up, that meant throwing herself into competitive figure skating with an all-consuming passion that led her to nationals. But when her skating career suddenly fell apart, that meant diving into self-destruction with the intensity she once saved for the ice.For the next nine years, Keri ricocheted from one dark place to the living on the streets, selling drugs and sex, and shooting up between classes all while trying to hold herself together enough to finish her degree at Cornell. Then, on a cold day during her senior year, the police caught her walking down the street with a Tupperware full of heroin.Her arrest made the front page of the local news and landed her behind bars for nearly two years. There, in the Twilight Zone of New York’s jails and prisons, Keri grappled with the wreckage of her missteps and mistakes as she sobered up and searched for a better path. Along the way, she met women from all walks of life―who were all struggling through the same upside-down world of corrections. As the days ticked by, Keri came to understand how broken the justice system is and who that brokenness hurts the most.After she walked out of her cell for the last time, Keri became a reporter dedicated to exposing our flawed prisons as only an insider could. Written with searing intensity, unflinching honesty, and shocks of humor, Corrections in Ink uncovers that dark, brutal system that affects us all. Not just a story about getting out and getting off drugs, this galvanizing memoir is about the power of second chances; about who our society throws away and who we allow to reach for redemption―and how they reach for it.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "Mental Health",
    "Book Club"
  ],
  "author": "Keri Blakinger",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/58724915-corrections-in-ink"
}