{
  "title": "True: The Four Seasons of Jackie Robinson",
  "description": "Winner of the CASEY Award for Best Baseball Book of the YearTrue is a probing, richly-detailed, unique biography of Jackie Robinson, one of baseball's―and America's―most significant figures.For players, fans, managers, and executives, Jackie Robinson remains baseball’s singular figure, the person who most profoundly extended, and continues to extend, the reach of the game. Beyond Ruth. Beyond Clemente. Beyond Aaron. Beyond the heroes of today. Now, a half-century since Robinson’s death, letters come to his widow, Rachel, by the score. But Robinson’s impact extended far beyond baseball: he opened the door for Black Americans to participate in other sports, and was a national figure who spoke and wrote eloquently about inequality.True: The Four Seasons of Jackie Robinson by Kostya Kennedy is an unconventional biography, focusing on four transformative years in Robinson's athletic and public life: 1946, his first year playing in the essentially all-white minor leagues for the Montreal Royals; 1949, when he won the Most Valuable Player Award in his third season as a Brooklyn Dodger; 1956, his final season in major league baseball, when he played valiantly despite his increasing health struggles; and 1972, the year of his untimely death. Through it all, Robinson remained true to the effort and the mission, true to his convictions and contradictions.Kennedy examines each of these years through details not reported in previous biographies, bringing them to life in vivid prose and through interviews with fans and players who witnessed his impact, as well as with Robinson's surviving family. These four crucial years offer a unique vision of Robinson as a player, a father and husband, and a civil rights hero―a new window on a complex man, tied to the 50th anniversary of his passing and the 75th anniversary of his professional baseball debut.",
  "genres": [
    "Baseball",
    "Biography",
    "Sports",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Kostya Kennedy",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/58725042-true"
}