{
  "title": "Black Skinhead: Reflections on Blackness and Our Political Future",
  "description": "**A New York Times Editors' Choice Pick****One of Kirkus Reviews ' Best Nonfiction Books of 2022**\"Political activist Collins-Dexter’s essay collection is timely as well as pointed. In it, she argues that Democrats have taken Black voters for granted, and that the consequences of this mistake have already begun ― and will accelerate.\"― The New York Times ,\" 15 Works of Nonfiction to Read This Fall\"For fans of Bad Feminist and The Sum of Us , Black Skinhead sparks a radical conversation about Black America and political identity.In Black Skinhead , Brandi Collins-Dexter, former Senior Campaign Director for Color Of Change, explores the fragile alliance between Black voters and the Democratic party. Through sharp, timely essays that span the political, cultural, and personal, Collins-Dexter reveals decades of simmering disaffection in Black America, told as much through voter statistics as it is through music, film, sports, and the baffling mind of Kanye West.While Black Skinhead is an outward look at Black votership and electoral politics, it is also a funny, deeply personal, and introspective look at Black culture and identity, ultimately revealing a Black America that has become deeply disillusioned with the failed promises of its country.----------------------------------------------------We had been told that everything was fine, that America was working for everyone and that the American Dream was attainable for all. But for those who had been paying attention, there had been warning signs that the Obamas’ version of the American Dream wasn’t working for everyone. That it hadn’t been working for many white Americans was immediately and loudly discussed, but the truth―and what I set out to write this book about―was that it hadn’t been working for many Black Americans either. For many, Obama’s vision had been more illusion than reality all along.When someone tells you everything is fine, but around you, you see evidence that it’s not, where will the quest to find answers lead you? As I went on the journey of writing this book, I found a very different tale about Black politics and Black America, one that countered white America’s long-held assumption that Black voters will always vote Democrat―and even that the Democratic party is the best bet for Black Americans.My ultimate question was this: how are Black people being led away―not towards―each other, and what do we lose when we lose each other? What do we lose when, to quote Kanye West, we feel lost in the world.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Race",
    "Audiobook",
    "Essays",
    "Social Justice"
  ],
  "author": "Brandi Collins-Dexter",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/58724771-black-skinhead"
}