{
  "title": "Boundless: The Rise, Fall, and Escape of Carlos Ghosn",
  "description": "The unprecedented rise and catastrophic fall of one of the world's most feared and admired business executives--Carlos Ghosn--a remarkable story of innovation, hubris, alleged crimes, and daring international escape, as chronicled by two Wall Street Journal reporters.Carlos Ghosn always wanted more. Born in the Amazon, raised by a well-off--if scandalized--family in Beirut, and educated in Paris, Ghosn rose to prominence at Michelin in the United States, Renault in France, and Nissan in Japan. Along the way he earned monikers of Le Cost Killer, for his incisive business savvy, and Mr. 7-Eleven, for the hours he devoted to his work.Initially Ghosn thrived, becoming a poster boy for globalization and multinational corporations. Employees believed him to be among the greatest business minds of his generation, and the press hailed him a financial genius. The trouble started when Ghosn began to believe them. His power rose in tandem with an increasing certainty that he was underpaid and undervalued at his multiple posts. Executives grew unhappy with Ghosn's talk of a merger with Renault, calling his loyalty to Nissan into question. Resentments brewed, enough so that a group of Nissan executives set out to uncover the truth about the man who many throughout Nissan and Japan perceived as a savior. Eventually, Ghosn was accused of financial misconduct and arrested for a bevy of alleged crimes--all of which he vehemently denied.Yet even as he insisted his financial transactions were above board, Ghosn was planning an astounding escape, one that would either smuggle him out of Tokyo and back to his ancestral homeland of Lebanon; or land him in a Japanese prison for life.Drawing from intensive investigative reporting, and including never-before-seen insider details from key players in Ghosn's life and the investigations into him, Nick Kostov and Sean McLain piece together this fallen icon's life and actions across the globe. Their sensational globetrotting adventure reveals the complexity of a man who watched for decades as contemporaries with far less talent amassed far greater wealth, and who took drastic measures to ensure he would finally get his due.",
  "genres": [
    "Nonfiction",
    "Business",
    "Biography",
    "History",
    "Audiobook",
    "Japan",
    "Lebanon"
  ],
  "author": "Nick Kostov",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/58733668-boundless"
}