{
  "title": "Hatchet Island",
  "description": "An eerie, windswept island off the coast of Maine becomes the site of a double murder and a disappearance in Hatchet Island, the next thriller in Paul Doiron's bestselling Mike Bowditch series.A call for help from a former colleague leads Maine game warden investigator Mike Bowditch and his girlfriend Stacey Stevens on a sea kayaking trip to a research station far off the coast. Stacey spent summers interning on the island, a sanctuary for endangered seabirds, and they are shocked by what they hear when they come ashore. The biologists are being threatened by local fishermen and stalked by a mysterious boatman who seems intent on trespassing on the refuge. Even worse, their leader, whose mind is slowly unraveling after the unexplained suicide of a young intern, has now gone missing.Camped on a nearby islet for the night, Mike and Stacey waken to the sound of a gunshot. When they return to the refuge at dawn, their darkest fears are confirmed: two of the three researchers have been brutally murdered and the third has disappeared, along with the island skiff. Mike’s quest to find the missing man reveals new suspects including a Marine Patrol officer with a history of violence and the sanctuary's enigmatic founder, who conveniently reappears after the killings. The search expands to a nearby island owned by a world-renowned photographer with a scandalous reputation. The artist and his equally brilliant wife wield a powerful hold over the inhabitants of their private kingdom, and Mike increasingly comes to believe that someone in the village knows more about the killings than they dare admit.With no one to trust and miles from shore, Mike Bowditch must stop a ruthless murderer determined to make sure a terrifying secret never sees the light of day.",
  "genres": [
    "Mystery",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Thriller",
    "Audiobook",
    "Crime"
  ],
  "author": "Paul Doiron",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/58724854-hatchet-island"
}