{
  "title": "The Last Paladin",
  "description": "Winner of the 2023 W.Y. Boyd Literary Award for Excellence in Military A gripping tale of anti-submarine warfare in the World War II Pacific Theater, by a master of military adventure fiction.The Last Paladin by P.T. Deutermann is based on the true story of the USS Holland (DE-24), a World War II Atlantic Fleet destroyer escort which has spent the past two years in the unforgiving battle for survival against the German U-boats of the North Atlantic.Summoned to relieve destroyers that are bogged down by escort duty in the escalating Pacific Theater, the Holland is met with a rather cold reception. In the eyes of Pacific Fleet sailors, North Atlantic convoy duty pales in comparison to the bloody, carrier-sinking battles of Savo Island and Guadalcanal. However, Atlantic Fleet ships have had to specialize in one anti-submarine warfare.The Holland is sent off into remote South Pacific operating areas with orders to find and destroy Japanese submarines―but with little expectation of success. Her commanders take the mission literally; using radio intercepts that are being ignored at higher levels, they determine that the Japanese have set up a 1000-mile-long picket line of six submarines, an entire squadron's worth, to act as a moveable barrier against the expected American advance into the next set of islands. These submarines are poised to sink every American aircraft carrier and destroyer and to change the course of the war.What happens next is one of the legendary stories of the US Navy. The Last Paladin is high stakes naval warfare at its best, told with utter authenticity and a former ship captain's understanding of dramatic, intense combat. P. T. Deutermann continues his acclaimed series of WWII thrillers in this unforgettable novel.",
  "genres": [
    "Historical Fiction",
    "Military Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "War",
    "Thriller"
  ],
  "author": "P.T. Deutermann",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/58724866-the-last-paladin"
}