{
  "title": "Honey Trap",
  "description": "THE GUILD is a new series born from the Shadow Grove world. While some characters have been met in the existing MADISON KATE and HADES series, their cameos were not crucial to THE GUILD storyline. ◆◆◆honeytrapnouna stratagem in which an attractive person entices another person into revealing information or doing something unwise.Those who have reached a certain level within the mercenary guild, know that it’s not merely a job. It isn’t a hobby or a career or a fun pastime. It’s a calling. A fucking honor. Being in the Guild is our life.... Or death. Not everyone is created equal, and not everyone is truly cut out for the work we do. It’s not pretty, it's not glamorous, and it’s sure as shit not moral or good. The weight of the sins we carry can become too much for some, and they crack. When they do, they become a threat.No one quits the Guild. Not really. Either they cut a deal to make themselves useful in another capacity, or they get eliminated.But who, you might ask, can kill a killer? Who scares the boogeyman into running and hiding?Men like me.The Guild is my life. My love. My very existence.Anyone who poses a threat to that, is eliminated. No questions, no hesitations, no mercy. Until her.◆◆◆The Guild series is a dark romance and contains scenes that may be uncomfortable or disturbing to some readers. Please use your own discretion as to whether this is the right series for you. None of the main characters are the \"good guys\" and their moral code does differ greatly from your usual romance heroes. Please don't attempt to hold them to heroic standards, as they will fall short. HONEY TRAP is book ONE of THREE in The Guild trilogy. Recommended Reading Order for Shadow Grove interconnected series: MADISON KATE #1 Hate#2 Liar#3 Fake#4 KateHADES#1 7th Circle#2 Anarchy#3 Club 22 #4 TimberMADISON KATE NOVELLA #4.5 VAULT THE GUILD#1 Honey Trap#2 Dead Drop#3 Kill Order This is the chronological order of linked series, but it's not necessary to read prior series before THE GUILD.",
  "genres": [
    "Dark Romance",
    "Reverse Harem",
    "Romance",
    "Dark",
    "Enemies To Lovers",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Tate James",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/58747484-honey-trap"
}