{
  "title": "Demons of the Rich and Famous",
  "description": "Supernatural possession is the new “disease” and teen exorcist Caden Butcher is the cure…Caden Butcher, known as the whiz-kid exorcist to the stars, loves the Hollywood limelight. Or at least that’s what he wants people to believe so he can earn enough cash from his high profile exorcisms to take care of his ailing father. The problem is, not everyone’s happy with Caden’s star status, particularly Remy Martin, a high ranking member of the International Order of Exorcists, who suspects the truth, that these Hollywood exorcisms are staged with the help of Caden’s demon BFF, Dan.So when a real exorcism goes bad and a nasty demon jumps bodies, the crap hits the supernatural fan. The Order strips Caden of his exorcism license right before he discovers the unleashed demon is one he knows well, very well. This demon is hell bent on destroying Caden’s life and everyone else who gets in his way. Now with the help of his demon buddy, and Caden’s girlfriend Aspen Spencer, a necromancer in training, Caden must defy the Order, track down the rogue demon and send him back to hell before it’s too late.Praise for Demons of the Rich and “Tawny Stokes has created a brilliant paranormal world within our own. There are demons, witches, zombies, and all sorts of crazy creatures that occupy our world. The mythology Stokes has created for Demon Whisperer blew me away, and I simply cannot wait to read more about Caden, since I want to visit this world again, as soon as I can!” – Alex, Electrifying Reviews“The Demon Whisperer by Tawny Stokes, is now one of my new favorite books.” – 4.5 Stars, Jasmin, Alaskan Bookie Blog“I wasn't expecting to like this book that much, but boy, did I LOVE it! Who doesn't like a book in a boy's POV? And what a voice did Caden have!” – Ella, The Clock Monkey blog“Action junkies and fans of The Mortal Instruments will love this book. I'd put it right up there on the shelf with them. I predict good things for this book, especially when focusing on the storyline and amazing plot elements. Most of all, the action; this is definitely a book driven mostly by action, and ready to give you the ride of your life.” – Mariella, The Escapism Project",
  "genres": [
    "Young Adult",
    "Paranormal",
    "Demons",
    "Urban Fantasy",
    "Teen",
    "Young Adult Paranormal"
  ],
  "author": "Tawny Stokes",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/12798827-demons-of-the-rich-and-famous"
}