{
  "title": "The Bookbinder's Daughter",
  "description": "The song surrounded her now, the murmuring of the library insistent, and her foot took the first step on the winding stairs. She knew it wasn’t entirely a dream. It was the library calling her, its magic driving her.When Sophie is offered a job at the Ayredale Library – the finest collection of rare books in the world, and the last place her bookbinder mother was seen when Sophie was just a teenager – she leaps at the chance. Will she finally discover what happened to the woman she’s always believed abandoned her?Taking in the endless shelves of antique books, the soaring stained-glass windows, and the grand sweeping staircase, usually shy Sophie feels strangely at home, and is welcomed by her eccentric fellow binders. But why is the Keeper of the Library so reluctant to speak about Sophie’s mother? And why is Sophie the only person who can read the strange spells in the oldest books on display, written in a forgotten language nobody else understands?The mysteries of the library only deepen when Sophie stumbles upon an elaborately carved door. The pattern exactly matches the pendant her mother left behind years ago, engraved with a delicate leaf. As the door swings open at her touch, Sophie gasps at the incredible sight: an enormous tree, impossibly growing higher than the library itself, its gently falling golden leaves somehow resembling the pages of a book. Amidst their rustling, Sophie hears a familiar whisper…‘There you are, my Sophie. I knew you’d come back for me.’An absolutely spellbinding read about long-hidden family secrets and the magic that lurks between the pages of every ancient book. Perfect for fans of The Ten Thousand Doors of January, The Night Circus and The Binding.",
  "genres": [
    "Fantasy",
    "Books About Books",
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Mystery",
    "Magic"
  ],
  "author": "Jessica Thorne",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/58748529-the-bookbinder-s-daughter"
}