{
  "title": "Wash Day Diaries",
  "description": "From writer Jamila Rowser and artist Robyn Smith comes a captivating graphic novel love letter to the beauty and endurance of Black women, their friendships, and their hair.Wash Day Diaries tells the story of four best friends—Kim, Tanisha, Davene, and Cookie—through five connected short story comics that follow these young women through the ups and downs of their daily lives in the Bronx.The book takes its title from the wash day experience shared by Black women everywhere of setting aside all plans and responsibilities for a full day of washing, conditioning, and nourishing their hair. Each short story uses hair routines as a window into these four characters' everyday lives and how they care for each other.Jamila Rowser and Robyn Smith originally kickstarted their critically acclaimed, award-winning slice of life mini comic, Wash Day, inspired by Rowser's own wash day ritual and their shared desire to see more comics featuring the daily lived experiences of young Black women. Wash Day Diaries includes an updated, full color version of this original comic—which follows Kim, a 26-year-old woman living in the Bronx—as the book's first chapter and expands into a graphic novel with short stories about these vibrant and relatable new characters.In expanding the story of Kim and her friends, the authors pay tribute to Black sisterhood through portraits of shared, yet deeply personal experiences of Black hair care. From self-care to spilling the tea at an hours-long salon appointment to healing family rifts, the stories are brought to life through beautifully drawn characters and different color palettes reflecting the mood in each story.At times touching, quiet, triumphant, and laugh out loud funny, the stories of Wash Day Diaries pay a loving tribute to Black joy and the resilience of Black women.",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Fiction",
    "Contemporary",
    "LGBT",
    "Queer",
    "Adult"
  ],
  "author": "Jamila Rowser",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/58739572-wash-day-diaries"
}