{
  "title": "Refugee High: Coming of Age in America",
  "description": "Lit Hub 's Most Anticipated of 2021A year in the life of a Chicago high school that has one of the highest proportions of refugees of any school in the nation“A wondrous tapestry of stories, of young people looking for a home. With deep, immersive reporting, Elly Fishman pulls off a triumph of empathy. Their tales and their school speak to the best of who we are as a nation—and their struggles, their joys, their journeys will stay with you.” —Alex Kotlowitz, author of There Are No Children HereWinner of the Studs and Ida Terkel AwardFor a century, Chicago’s Roger C. Sullivan High School has been a home to immigrant and refugee students. In 2017, during the worst global refugee crisis in history, its immigrant population numbered close to three hundred—or nearly half the school—and many were refugees new to the country. These young people came from thirty-five different countries, speaking among themselves more than thirty-eight different languages.For these refugee teens, life in Chicago is hardly easy. They have experienced the world at its worst and carry the trauma of the horrific violence they fled. In America, they face poverty, racism, and xenophobia, but they are still teenagers—flirting, dreaming, and working as they navigate their new life in America.Refugee High is a riveting chronicle of the 2017–8 school year at Sullivan High, a time when anti-immigrant rhetoric was at its height in the White House. Even as we follow teachers and administrators grappling with the everyday challenges facing many urban schools, we witness the complicated circumstances and unique education needs of refugee and immigrant children: Alejandro may be deported just days before he is scheduled to graduate; Shahina narrowly escapes an arranged marriage; and Belenge encounters gang turf wars he doesn’t understand.Equal parts heartbreaking and inspiring, Refugee High raises vital questions about the priorities and values of a public school and offers an eye-opening and captivating window into the present-day American immigration and education systems.",
  "genres": [
    "Nonfiction",
    "Education",
    "History",
    "Sociology",
    "Book Club",
    "Social Issues",
    "Politics"
  ],
  "author": "Elly Fishman",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/58741291-refugee-high"
}