{
  "title": "Find Your People: Building Deep Community in a Lonely World",
  "description": "The New York Times bestselling author of Get Out of Your Head offers practical solutions for creating true community, the kind that's crucial to our mental and spiritual health.\"My dear friend Jennie Allen shows us how to make true emotional connections with the right people so that our authentic relationships can be healthy for all.\"--Lysa TerKeurst, author of It's Not Supposed to Be This WayIn a world that's both more connected and more isolating than ever before, we're often tempted to do life alone, whether because we're so busy or because relationships feel risky and hard. But science confirms that consistent, meaningful connection with others has a powerful impact on our well-being. We are meant to live known and loved. But so many are hiding behind emotional walls that we're experiencing an epidemic of loneliness.In Find Your People,  bestselling author Jennie Allen draws on fascinating insights from science and history, timeless biblical truth, and vulnerable stories from her own life to help you:- overcome the barriers to making new friends and learn to initiate with easy-to-follow steps- find simple ways to press through awkward to get to authentic in conversations- understand how conflict can strengthen relationships rather than destroy them- identify the type of friend you are and the types of friends you need- learn the five practical ingredients you need to have the type of friends you've always longed forYou were created to play, engage, adventure, and explore--with others. In Find Your People,  you'll discover exactly how to dive into the deep end and experience the full wonder of community. Because while the ache of loneliness is real, it doesn't have to be your reality.",
  "genres": [
    "Nonfiction",
    "Christian",
    "Self Help",
    "Faith",
    "Audiobook",
    "Relationships",
    "Christian Living"
  ],
  "author": "Jennie Allen",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/58735075-find-your-people"
}