{
  "title": "Bittersweet: How Sorrow and Longing Make Us Whole",
  "description": "In her new masterpiece, the author of the bestselling phenomenon Quiet reveals the power of a bittersweet outlook on life, and why we’ve been so blind to its value.With Quiet, Susan Cain urged our society to cultivate space for the undervalued, indispensable introverts among us, thereby revealing an untapped power hidden in plain sight. Now she employs the same mix of research, storytelling, and memoir to explore why we experience sorrow and longing, and the surprising lessons these states of mind teach us about creativity, compassion, leadership, spirituality, mortality, and love. Bittersweetness is a tendency to states of longing, poignancy, and sorrow; an acute awareness of passing time; and a curiously piercing joy when beholding beauty. It recognizes that light and dark, birth and death—bitter and sweet—are forever paired. A song in a minor key, an elegiac poem, or even a touching television commercial all can bring us to this sublime, even holy, state of mind—and, ultimately, to greater kinship with our fellow humans. But bittersweetness is not, as we tend to think, just a momentary feeling or event. It’s also a way of being, a storied heritage. Our artistic and spiritual traditions—amplified by recent scientific and management research—teach us its power. Cain shows how a bittersweet state of mind is the quiet force that helps us transcend our personal and collective pain. If we don’t acknowledge our own sorrows and longings, she says, we can end up inflicting them on others via abuse, domination, or neglect. But if we realize that all humans know—or will know—loss and suffering, we can turn toward each other. And we can learn to transform our own pain into creativity, transcendence, and connection. At a time of profound discord and personal anxiety, Bittersweet brings us together in deep and unexpected ways.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Audiobook",
    "Mental Health",
    "Personal Development",
    "Philosophy"
  ],
  "author": "Susan Cain",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/58734811-bittersweet"
}