{
  "title": "Celtic Folklore Cooking",
  "description": "A treasury of delectable recipes,  Celtic Folklore Cooking by Joanne Asala will help you select foods to serve at your celebrations of the Sabbats and Esbats: the festivals and ritual times for Witches and Wiccans. It is also a terrific introduction to Celtic culture. The recipes in this book were gathered during four trips the author took to Ireland and Britain, as well as visits to Scotland and Wales. She searched for people who still cooked in the traditional of their ancestors, passing down recipes from generation to generation. The result is a book that is rich in Celtic tradition. And the foods are delicious any time, too!Like a well-stocked larder, Celtic Folklore Cooking offers plenty of tempting choices for daily meals or special celebrations. Pick from more than 200 tasty traditional dishes, all nestled among colorful food-related proverbs, poems, tales, customs, and other nuggets of folk wisdom. Each recipe lists ancient and modern holidays associated with the dish so you can select the perfect fare to complement the season. Recipes include: - Mushroom and Scallop Pie - Heather Wine - Pratie Oaten - Beestings Pancakes - Hot Cross buns - Figgy Pudding - Boxty on the Griddle - Barm Brack - Sweet Scones - Scotch Eggs - Colcannon - Cockle Soup - Flower Pudding - Flummery - MeadThe ancient Celts celebrated their Sabbats with music, dance, games, food, and drink. Whether you are a solitary practitioner or a part of a larger group, food and drink should always be a part of your festivities, rituals, and ceremonies. This book can be the key to a wide variety of foods that will make you the talk of the town!If you are involved in Celtic traditions, this book is a must. If you simply like unique recipes for foods that are as tasty today as they were hundreds, even thousands of years ago, you'll want this book, too.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Paganism",
    "Folklore",
    "Spirituality"
  ],
  "author": "Joanne Asala",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/587406.Celtic_Folklore_Cooking"
}