{
  "title": "Summer Love",
  "description": "Old secrets come to light when four friends gather on Nantucket for a life-changing reunion in this heartwarming novel of love and self-discovery by New York Times bestselling author Nancy Thayer.When four strangers rent bargain-basement rooms in an old hotel near the beach, they embark on the summer of their lives. First there's Ariel Spencer, who has big dreams of becoming a writer and is looking for inspiration in Nantucket's high society. Her new friend Sheila Murphy is a good Catholic girl from Ohio whose desire for adventure is often shadowed by her apprehension. Then there's small-town Missourian Wyatt Smith, who's immediately taken with Ariel. The last of the four, Nick Volkov, is looking to make a name for himself and have a blast along the way. Despite their differences, the four bond over trips to the beach, Wednesday-night dinners, and everything that Nantucket has to offer. But venturing out on their own for the first time, with all its adventure and risks, could change the course of their lives.Twenty-six years after that amazing summer, Ariel, Sheila, Wyatt, and Nick reunite at the hotel where they first met. Now it's called The Lighthouse and Nick owns the entire operation with his wife and daughter. Ariel and Wyatt, married for decades, arrive with their son, and Sheila's back too, with her daughter by her side. Life hasn't exactly worked out the way they had all hoped. Ariel's dreams have since faded and been pushed aside, but she's determined to rediscover the passion she once had. Nick has the money and reputation of a successful businessman, but is it everything he had hoped for? And Sheila has never been able to shake the secret she's kept since that summer. Being back together again will mean confronting the past and finding themselves. Meanwhile, the next generation discovers Nantucket: Their children explore the island together, experiencing love and heartbreak and forging lifelong bonds, just as their parents did all those years ago. It's sure to be one unforgettable reunion.This delightful novel from beloved storyteller Nancy Thayer explores the potential of dreams and the beauty of friendship.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Womens Fiction",
    "Adult Fiction",
    "Adult"
  ],
  "author": "Nancy Thayer",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/58735045-summer-love"
}