{
  "title": "House of Eclipses",
  "description": "Capture his heart. Steal his crown. Free my kingdom. Noor is the unwanted, unloved third born of the Aten, chosen vessel of the sun goddess, Sol. While she has no chance at inheriting her father’s title, what she truly longs for is peace from his unrelenting hatred. Hope builds that she may finally be able to claim that reprieve when a missive arrives from the House of the Moon.The new Lumin, chosen of the moon god, Lumos, seeks to broker peace with the Kingdom of Helios for the first time in ages. He envisions open trade routes and an end to archaic rivalries. His dedication to this cause extends to visions of a union between the two families by marrying one of Aten’s daughters, if one of the matches is a fit.Driven by his own twisted agenda, Noor’s father is willing to sacrifice his daughters as pawns to steal the crown for him to further his despotic reign. But Noor has other ideas. For whomever wears the crown of moonlight, holds the power of the moon itself. With such strength at her command, she could finally defeat her tyrannical father.Yet this endeavor cannot be accomplished without great sacrifice. As Noor learns more about Lumin Caelum, guilt over her betrayal consumes her, burning hot as the sun itself. If only he wasn’t kind, and selfless, and exactly what she wanted. If only she had greater dominion over her heart…Can Noor carry out her plan and end her father’s vile reign? Or will unlikely alliances allow a new day to dawn?House of Eclipses is a Young Adult fantasy romance perfect for fans of We Hunt the Flame by Hafsah Faizal, House of Salt & Sorrows by Erin A. Craig, and Danielle Jensen's The Bridge Kingdom. Praise for House of \"A gorgeous journey you'll want to take again and again.\" - New York Times bestselling author, Wendy Higgins“Stunning world-building, a fierce heroine, gorgeous writing, and a storyline unlike anything you've ever read. House of Eclipses will pull you in until the very last page.” - Celia McMahon, author of The Unspoken Series“House of Eclipses is full of compelling characters, beautiful worlds full of whimsy and wonder, an edge-of-your-seat storyline, a love story for the ages, and an ending that packs an incredible punch.” - Ethan Gregory, One Guy’s Guide to Good Reads",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Young Adult Fantasy",
    "Mythology",
    "Fantasy Romance",
    "Magic"
  ],
  "author": "Casey L. Bond",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/58755395-house-of-eclipses"
}