{
  "title": "The Trouble with Whiskey",
  "description": "From New York Times bestselling author Melissa Foster comes The Whiskeys: Dark Knights at Redemption Ranch, a new small-town, big-family series of standalone romance novels featuring fiercely loyal, insanely sexy bikers who give horses—and people—a second chance. Buckle up for a wild ride in Hope Valley, CO, as these big-hearted badasses and their sassy sisters wrangle in their forever loves. No cliffhangers, no cheating, and always a happily ever after.She’s the only woman he’s ever loved, and the one he could never have…Years after losing one of their best friends to a dare gone wrong, Devlin “Dare” Whiskey continues to live up to his name, endlessly testing fate, while Billie Mancini buried the best parts of herself. Billie is beautiful and tough, and battling demons Dare has no idea exist. But Dare is done watching her pretend to be something she’s not and takes on his most important challenge yet—showing the woman he loves that some dares are worth the risk.**More Whiskeys at Redemption Ranch coming soon:The Trouble with WhiskeyFor the Love of WhiskeyGet to know the Whiskey cousins:The Whiskeys: Dark Knights at Peaceful Harbor.Tru BlueTruly Madly WhiskeyDriving Whiskey WildWicked Whiskey LoveMad About MoonTaming My WhiskeyThe Gritty TruthIn for A PennyRunning on DieselThe Wickeds: Dark Knights at BaysideA Little Bit WickedThe Wicked AftermathCrazy, Wicked LoveThe Wicked Truth**Don't miss \nRiver of Love\n (The Bradens at Peaceful Harbor), the first story in which the Whiskeys at Peaceful Harbor were introduced, and \nSearching for Love\n (The Bradens & Montgomerys), the first story in which the Whiskeys at Redemption Ranch were introduced.",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Second Chance",
    "Contemporary Romance",
    "Contemporary",
    "Westerns",
    "Small Town Romance"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/58754487-the-trouble-with-whiskey"
}