{
  "title": "Lake News",
  "description": "With this powerful story, Barbara Delinsky, the bestselling and acclaimed author of Coast Road and Three Wishes, has written her richest and most exciting novel yet. At its center is Lily Blake, a talented singer who shuns the limelight and cherishes her privacy. Tricked by a devious reporter into unwittingly giving an interview about her friendship with a distinguished churchman -- a newly appointed Cardinal -- she finds herself accused of having had an affair with him. Shocked and dismayed, Lily becomes a pariah and suffers the brutal, ultimate violation of her privacy as headlines all across the country proclaim her guilt. Hounded by the press, fired from her job, deprived of all public freedom, Lily has no choice but to flee. She returns in secret to her hometown of Lake Henry, in a remote, beautiful part of New Hampshire. But, idyllic as it may look, Lake Henry, too, has its secrets. Some were the cause of her leaving home in the first place, so returning to her birthplace and her family is not without its own stress and pain. Driven by the need to exact justice -- and, for herself, some kind of closure -- from the media that changed her life forever, Lily forms an uneasy alliance with John Kipling, a journalist who was born and raised in Lake Henry's poorest neighborhood. His successful career as a big-city reporter has ended disastrously, and John has come back home to edit the local newspaper, Lake News. At first he sees Lily as a victim, as well as a subject for the book he hopes to write. But soon she becomes someone whose appeal -- and cause -- he cannot deny, even at the risk of taking on his former colleagues in her defense. Set against the physical beauty of New Hampshire and against the complex web of family life and relationships in a small town, Lake News moves triumphantly toward a surprising and deeply satisfying conclusion. Barbara Delinsky's bestselling Three Wishes was praised by Publishers Weekly for its \"spare, controlled, and poignant prose that evokes the simplicity and joys of small-town life.\" Those same qualities are abundant in Lake News, which offers an intimate look at the complex relationship between an enigmatic man and a vulnerable, besieged woman, both struggling to find a new sense of community in a strange place they once called home.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary Romance",
    "Contemporary",
    "Womens Fiction",
    "Adult"
  ],
  "author": "Barbara Delinsky",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/587588.Lake_News"
}