{
  "title": "Eliot After \"The Waste Land\"",
  "description": "Young From St. Louis to \"The Waste Land\" was hailed as “exceptional” and “assiduous” ( The New York Times ). Robert Crawford’s meticulous, incisive scholarship continues in Eliot After \"The Waste Land\" , an invaluable record of the revolutionary modernist, visionary poet, and troubled man.After being kept from the public for more than fifty years, the letters between T. S. Eliot and his longtime love and muse Emily Hale were unsealed in 2020. Drawing on these intimate exchanges and on countless interviews and archives, as well as on Eliot’s own poetry and prose, the award-winning biographer Robert Crawford completes the narrative he began in Young Eliot . Eliot After “The Waste Land” , the long-awaited second volume of Crawford’s magisterial, meticulous portrait of the twentieth century’s most significant poet, tells the story of the mature Eliot during his years as a world-renowned writer and intellectual, including his complex interior life.Chronicling Eliot’s time as an exhausted bank employee after the publication of The Waste Land through the emotional turmoil of the 1920s and 1930s and his years as a firewatcher in bombed wartime London, Crawford shows us the public and personal experiences that helped inspire Eliot’s later masterpieces. Crawford describes the poet’s conversion to Anglo-Catholicism, his separation from Vivien Haigh-Wood and his happy second marriage to Valerie Fletcher, his editorship at Faber and Faber, his Nobel Prize, his great work Four Quartets , and his adventures in the theater.Crawford presents this complex and remarkable man not as a literary monument but as a human as husband, lover, and widower; as banker, editor, playwright, and publisher; and most of all as an epoch-shaping poet struggling to make art amid personal disasters.",
  "genres": [
    "Biography",
    "Poetry",
    "Nonfiction",
    "History",
    "Literature",
    "Literary Criticism",
    "Biography Memoir"
  ],
  "author": "Robert Crawford",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/58772702-eliot-after-the-waste-land"
}