{
  "title": "Rebel's Firecracker",
  "description": "Rebel:He never knew being away for months would change more than one thing at his club. When he returns to find the co-owner of his club’s bakery drives him wild, he doesn’t know what to do. Why? Because his brother Joker appears to have dibs. Rebel fights to stay away. He won’t dishonor himself or his brother like that. He’ll just have to find a way to cope.When a fire alerts the club to danger, to Madisen, and Rebel to his mistake, he’s determined that this little baker will be his in every way—old lady, wife, and mother of his children. All he has to do is convince her. Her past isn’t going to be easy. It’s come back to haunt her and put her in danger.Madisen:She was familiar with betrayal of the most devastating kind. She’s alone. Not even her beloved great aunt is here anymore for her. She’s shocked and excited when approached by the Warriors to help them start a bakery. Not only start it, but own a piece of it. For a girl born in the trailer park with the dregs of society, it’s her dream.Only she’s knocked for a loop when she meets Rebel, the club member who will be the co-manager with her. She can’t seem to stop thinking about him. She knows he wouldn’t look at her twice. Besides, she’s clueless about men, anyway.Imagine the surprise when she realizes he’s looking, and he realizes she’s looking back. Soon, danger, steamy encounters, and romance erupt. Now, all Rebel, his club, and their allies have to do is take out more than one danger to her, so they can have their happily ever after. This will be despite old enemies, new enemies, and bunnies. Just another day for the Archangel’s Warriors. Rebel is going to win his Firecracker, so he’s never without fireworks again.WARNING: This book is intended for adult readers. It contains coarse language, adult situations, discusses events such as stalkers, assault, torture and murder that may trigger some readers. Sexual situations are graphic. There is no cheating, no cliffhanger and it has a HEA.",
  "genres": [
    "Romance",
    "Contemporary",
    "M F Romance",
    "Amazon"
  ],
  "author": "Ciara St. James",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/58789194-rebel-s-firecracker"
}