{
  "title": "Dormia",
  "description": "Introducing Alfonso Perplexon, hero of the epic fantasy tale Dormia!Alfonso Perplexon is an unusual sleeper. He climbs trees, raises falcons, even shoots deadly accurate arrows, all in his sleep. No one can figure out why.Then one evening a man arrives at Alfonso’s door, claiming to be Alfonso’s long-lost uncle Hill. This uncle tells a fantastical tale: Alfonso’s ancestors hail from Dormia—an ancient kingdom of gifted sleepers—which is hidden in the snowy peaks of the Ural Mountains. According to Hill, Dormia exists thanks to a tree known as the Founding Tree, with roots that pump life into the frozen valley. But the Founding Tree is now dying, and in a matter of days, Dormia faces an icy apocalypse.Dormia’s salvation lies with the Great Sleeper, who possesses the special powers to enter a sleep trance and grow a new Founding Tree. Hill suspects that Alfonso is just such a person. In fact, Alfonso’s sleeping-self has already hatched this tree. Now the question is: Can Alfonso and his uncle deliver it in time? They must hurry, but they also must be careful not to be followed by Dormia’s age-old enemy, the Dragoonya, who are always hunting for one of the secret entryways into Dormia.Alfonso agrees to take the tree to Dormia, and thus begins one of the greatest adventures a twelve-year-old boy could ever wish for.As he woke up from a late afternoon nap, Alfonso blinked open his eyes and discovered that he was perched at the top of a gigantic pine tree – some two-hundred feet above the ground. The view was spectacular. Alfonso could see for miles in every direction and he could even make out his house in the distant hamlet of World’s End, Minnesota. Unfortunately, there was no time to enjoy the view. The small branch that Alfonso stood upon was covered with gleaming snow and creaked dangerously under the pressure of his weight. Icy gusts of wind shook the entire treetop. Alfonso looked down grimly at the ground far below. If he fell, he would most certainly die.“Oh brother,” muttered Alfonso to himself. “Not again.”",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Middle Grade",
    "Adventure",
    "Fiction",
    "Childrens",
    "Magic"
  ],
  "author": "Jake Halpern",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/5877213-dormia"
}