{
  "title": "What a Godly Privilege to Be Born a Man",
  "description": "This book is inspired by true events.Chosen from among the mob of her boyfriend's girlfriends, married in the most secure, respectful, and honourable way known to the people, Nyayang Jock, a girl born without a brother, won the race, defeating her top co-girlfriend, Sarah, by being the youngest over Sarah born with brothers. At the least, unlike ninety-nine percent of the girls of her generation and how they were married, it is safe for Nyayang to say she was married for love to Chuol Malual, a businessman who was born into a big, rich family.Nonetheless, unlike the expectation of her in-laws, the unattended attitude of the nature secretly stabbed Nyayang in the back, leaving her to fail and creating the family Chuol and his family fundamentally paid the forty cows for. After waiting for what seemed like a decade for her to get pregnant, she gave birth to a girl, a thing that only fueled the resultant ager. Taking a long time to get pregnant and only giving birth to a girl when she should have birthed a boy called for a quick search for another wife. For Chuol's parents, this was a search for a working womb, but for Chuol it was just a search for wife number two, which he found hard now that he realized most girls showed many of the characteristics Nyayang had shown; however, eventually all displayed some problem.But that all changed when he accidentally stumbled upon Sarah again, who instantly restored his manhood. Sarah not only filled Chuol's life with the boys he had been looking for, but she had her chance one more time to not only show Nyayang that it is the woman born with brothers who wins, but that the woman who has the ability to birth boys is the ultimate winner. But values-setting, worth-determining, and love are all weaknesses in society. There is only one true winner, and that is the neighbor, the seasonal enemy, the chaff buyer, the Murlen man.",
  "genres": [],
  "author": "Tabitha Biel Luak",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/58776605-what-a-godly-privilege-to-be-born-a-man"
}