{
  "title": "The High Sierra: A Love Story",
  "description": "A “sublime” and “radically original” exploration of the Sierra Nevadas, the best mountains on Earth for hiking and camping, from New York Times bestselling novelist Kim Stanley Robinson (Bill McKibben, Gary Snyder).Kim Stanley Robinson first ventured into the Sierra Nevada mountains during the summer of 1973. He returned from that encounter a changed man, awed by a landscape that made him feel as if he were simultaneously strolling through an art museum and scrambling on a jungle gym like an energized child. He has returned to the mountains throughout his life—more than a hundred trips—and has gathered a vast store of knowledge about them. The High Sierra is his lavish celebration of this exceptional place and an exploration of what makes this span of mountains one of the most compelling places on Earth.Over the course of a vivid and dramatic narrative, Robinson describes the geological forces that shaped the Sierras and the history of its exploration, going back to the indigenous peoples who made it home and whose traces can still be found today. He celebrates the people whose ideas and actions protected the High Sierra for future generations. He describes uniquely beautiful hikes and the trails to be avoided. Robinson’s own life-altering events, defining relationships, and unforgettable adventures form the narrative’s spine. And he illuminates the human communion with the wild and with the sublime, including the personal growth that only seems to come from time spent outdoors.The High Sierra is a gorgeous, absorbing immersion in a place, born out of a desire to understand and share one of the greatest rapture-inducing experiences our planet offers. Packed with maps, gear advice, more than 100 breathtaking photos, and much more, it will inspire veteran hikers, casual walkers, and travel readers to prepare for a magnificent adventure.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Memoir",
    "Travel",
    "History",
    "Audiobook",
    "Science"
  ],
  "author": "Kim Stanley Robinson",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/58786858-the-high-sierra"
}