{
  "title": "The Noh Family",
  "description": "A sparkling K-drama inspired debut teen novel by Grace Shim, THE NOH FAMILY introduces irrepressibly charming teen Chloe Kang, who is reunited with her deceased father's estranged family via a DNA test, and is soon whisked off to Seoul to join them... When her friends gift her a 23-and-Me test as a gag, high school senior Chloe Kang doesn't think much of trying it out. She doesn't believe anything will come of it--she's an only child, her mother is an orphan, and her father died in Seoul before she was even born, and before her mother moved to Oklahoma. It's been just Chloe and her mom her whole life. But the DNA test reveals something Chloe never expected--she's got a whole extended family from her father's side half a world away in Korea. Her father's family are owners of a famous high-end department store, and are among the richest families in Seoul. When they learn she exists, they are excited to meet her. Her mother has huge reservations, she hasn't had a great relationship with her husband's family, which is why she's kept them secret, but she can't stop Chloe from travelling to Seoul to spend two weeks getting to know the Noh family.Chloe is whisked into the lap of luxury, but something feels wrong. Chloe wants to shake it off--she's busy enjoying the delights of Seoul with new friend Miso Dan, the daughter of one of her mother's grade school friends. And as an aspiring fashion designer, she's loving the couture clothes her department store owning family gives her access to. But soon Chloe will discover the reason why her mother never told her about her dad's family, and why the Nohs wanted her in Seoul in the first place. Could joining the Noh family be worse than having no family at all?",
  "genres": [
    "Contemporary",
    "Young Adult",
    "Romance",
    "Fiction",
    "Audiobook",
    "Family",
    "Mystery"
  ],
  "author": "Grace K. Shim",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/58784518-the-noh-family"
}