{
  "title": "The Facemaker: A Visionary Surgeon's Battle to Mend the Disfigured Soldiers of World War I",
  "description": "Lindsey Fitzharris, the award-winning author of The Butchering Art, presents the compelling, true story of a visionary surgeon who rebuilt the faces of the First World War’s injured heroes, and in the process ushered in the modern era of plastic surgery.From the moment the first machine gun rang out over the Western Front, one thing was clear: humankind’s military technology had wildly surpassed its medical capabilities. Bodies were battered, gouged, hacked, and gassed. The First World War claimed millions of lives and left millions more wounded and disfigured. In the midst of this brutality, however, there were also those who strove to alleviate suffering. The Facemaker tells the extraordinary story of such an individual: the pioneering plastic surgeon Harold Gillies, who dedicated himself to reconstructing the burned and broken faces of the injured soldiers under his care.Gillies, a Cambridge-educated New Zealander, became interested in the nascent field of plastic surgery after encountering the human wreckage on the front. Returning to Britain, he established one of the world’s first hospitals dedicated entirely to facial reconstruction. There, Gillies assembled a unique group of practitioners whose task was to rebuild what had been torn apart, to re-create what had been destroyed. At a time when losing a limb made a soldier a hero, but losing a face made him a monster to a society largely intolerant of disfigurement, Gillies restored not just the faces of the wounded but also their spirits.The Facemaker places Gillies’s ingenious surgical innovations alongside the dramatic stories of soldiers whose lives were wrecked and repaired. The result is a vivid account of how medicine can be an art, and of what courage and imagination can accomplish in the presence of relentless horror.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Medicine",
    "Audiobook",
    "Biography",
    "Medical"
  ],
  "author": "Lindsey Fitzharris",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/58772742-the-facemaker"
}