{
  "title": "Ways of Being: Animals, Plants, Machines: The Search for a Planetary Intelligence",
  "description": "Artist, technologist, and philosopher James Bridle's Ways of Being is a brilliant, searching exploration of different kinds of intelligence--plant, animal, human, artificial--and how they transform our understanding of humans' place in the cosmos.What does it mean to be intelligent? Is it something unique to humans, or shared with other beings--beings of flesh, wood, stone, and silicon? The last few years have seen rapid advances in \"artificial\" intelligence. But as it approaches, it also gets weirder: rather than a friend or helpmate, AI increasingly appears as something stranger than we ever imagined, an alien invention that threatens to decenter and supplant us.At the same time, we're only just becoming aware of the other intelligences which have been with us all along, even if we've failed to recognize or acknowledge them. These others--the animals, plants, and natural systems that surround us are slowly revealing their complexity, agency, and knowledge, just as the technologies we've built to sustain ourselves are threatening to cause their extinction, and ours. What can we learn from them, and how can we change ourselves, our technologies, our societies, and our politics, to live better and more equitably with one another and the non-human world?Artist and maverick thinker James Bridle drawn on biology and physics, computation, literature, art, and philosophy, to answer these unsettling questions. Startling and bold, Ways of Being explores the fascinating, strange and multitudinous forms of knowing, doing, and being which are becoming evident in the present, and which are essential for our survival.Includes illustrations",
  "genres": [
    "Nonfiction",
    "Science",
    "Philosophy",
    "Nature",
    "Technology",
    "Ecology",
    "Environment"
  ],
  "author": "James Bridle",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/58772732-ways-of-being"
}