{
  "title": "River of the Gods: Genius, Courage and Betrayal in the Search for the Source of the Nile",
  "description": "From the New York Times bestselling author of RIVER OF DOUBT and DESTINY OF THE REPUBLIC, the stirring story of one of the great feats of exploration of all time, and its complicated legacyThe Nile River is the longest in the world. Its fertile floodplain allowed for rise to the great civilization of ancient Egypt, but for millennia the location of its headwaters was shrouded in mystery. Pharaonic and Roman attempts to find it were stymied by a giant labyrinthine swamp, and subsequent expeditions got no further. In the 19th century, the discovery and translation of the Rosetta Stone set off a frenzy of interest in ancient Egypt. At the same time, European powers sent off waves of explorations intended to map the unknown corners of the globe - and extend their colonial empires.Two British men - Richard Burton and John Hanning Speke - were sent by the Royal Geographical Society to claim the prize for England. Burton was already famous for being the first non-Muslim to travel to Mecca, disguised as an Arab chieftain. He spoke twenty-nine languages, was a decorated soldier, and literally wrote the book on sword-fighting techniques for the British Army. He was also mercurial, subtle, and an iconoclastic atheist. Speke was a young aristocrat and Army officer determined to make his mark, passionate about hunting, Burton's opposite in temperament and beliefs.From the start the two men clashed, Speke chafing under Burton's command and Burton disapproving of Speke's ignorance of the people whose lands through which they traveled. They would endure tremendous hardships, illness, and constant setbacks. Two years in, deep in the African interior, Burton became too sick to press on, but Speke did, and claimed he found the source in a great lake that he christened Lake Victoria. When they returned to England, Speke rushed to take credit, disparaging Burton. Burton disputed his claim, and Speke launched another expedition to Africa to prove it. The two became venomous enemies, with the public siding with the more charismatic Burton, to Speke's great envy. The day before they were to publicly debate, Speke shot himself.Yet there was a third man on both expeditions, his name obscured by imperial annals, whose exploits were even more extraordinary. This was Sidi Mubarak Bombay, who was enslaved and shipped from his home village in East Africa to India. When the man who purchased him died, he made his way into the local Sultan's army, and eventually traveled back to Africa, where he used his resourcefulness, linguistic prowess and raw courage to forge a living as a guide. Without his talents, it is likely that neither Englishman would have come close to the headwaters of the Nile, or perhaps even survived.In RIVER OF THE GODS Candice Millard has written another peerless story of courage and adventure, set against the backdrop of the race to exploit Africa by the colonial powers.",
  "genres": [
    "History",
    "Nonfiction",
    "Africa",
    "Biography",
    "Audiobook",
    "Adventure",
    "Travel"
  ],
  "author": "Candice Millard",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/58777696-river-of-the-gods"
}