{
  "title": "A Mysterious Knight",
  "description": "When a Shaw falls in love, win or lose, it's forever!Darkness is merely the absence of light, and Alexander Shaw's world no longer had any light. He would have no light, peace, or love if he did not have her. The day she had sent him away had almost completely destroyed him. It was the day he had utterly failed to keep her safe. It was the day he fell into this dark vast hole that seemed to have no end in sight. It was the day that started him on this mission to end those that had hurt her. Mysteries, secrets, and lies were all around him and Alex hated them. Those things only led to emotional hurts, physical pain, and destruction. And this was where Alex was. His hurt and pain was great for the mysteries and secrets had her trapped. And he would risk his own life just to free hers.Could Alex truly vanish all this darkness and find his way back to the light so that he could love her forever?The mysteries, secrets, and lies that circled around Emily Spencer's life long before she was ever born was not all that she had to deal with, and she truly had many of those. She now had to add mistakes to that long list. A bad decision could last for an entire lifetime and she had just made one of her worst decisions. She had sent him away. He was safer away from her and she had spent years trying to keep him safe. He was the one thing she wanted most in the world but he was just out of her reach. The more she tried to break free, the more the world she was trapped in tightened around her. Would there ever be a way that she could have a different life? A life with him? Or would she always have to love him from a far?Don't wait! Get your copy of A Mysterious Knight, Book Seven, in the ♥ For the Love of a Shaw ♥ series today!You will hope, laugh, cry, and most importantly, love along with the Shaw children as their lives unfold. Somewhere along the way, may you too, fall in love with a Shaw. ♥A Mysterious Knight is the final book in the For the Love of a Shaw series. ♥",
  "genres": [],
  "author": "Debbie Hyde",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/58803648-a-mysterious-knight"
}