{
  "title": "Twentymile",
  "description": "When wildlife biologist Alex Lowe is found dead inside Great Smoky Mountains National Park, it looks on the surface like a suicide. But Tsula Walker, Special Agent with the National Park Service’s Investigative Services Branch, isn’t so sure.Tsula’s investigation will lead her deep into the park and face-to-face with a group of lethal men on a mission to reclaim a historic homestead. The encounter will irretrievably alter the lives of all involved and leave Tsula fighting for survival – not only from those who would do her harm, but from a looming winter storm that could prove just as deadly.A finely crafted literary thriller, Twentymile delivers a propulsive story of long-held grievances, new hopes, and the contentious history of the land at its heart.PRAISE FOR TWENTYMILE:\"[A] taut, page-turning thriller . . .\" --Atlanta Journal-Constitution\"In C. Matthew Smith’s engrossing novel Twentymile, a park service biologist turns up dead in the Great Smoky Mountains National Park, and discord regarding annexed land fuels a treacherous chase....a disturbing, potent thriller about ownership and trespassing, as well as unrealized dreams and aggression.\" --Foreword Reviews\"Twentymile is packed with everything I love: A strong, female character; a wilderness setting; gripping storytelling; masterful writing. . . I loved every word. A beautiful and brutal and extraordinary debut.\" --Diane Les Becquets, bestselling author of Breaking Wild and The Last Woman in the Forest\"Original, intelligent. . . Twentymile is an accomplished first novel from a talented and fully-formed writer.\" --James McLaughlin, Edgar Award winning author of Bearskin“Twentymile is a moody, atmospheric tale of family, vengeance, and anger too-long held, all set in the heart of the Great Smoky Mountains. Ultimately, it is the story of reaching for- discovering and recovering- home, and how such a complicated yearning can play out on both sides of the law.\"  --Steph Post, author of Miraculum, Lightwood, and A Tree Born Crooked​\"Smith’s spellbinding debut takes readers on a murderous journey through the backwoods of Great Smoky Mountains National Park. . . A thrilling and evocative tale.\" --Scott Graham, National Outdoor Book Award-winning author of Canyonlands Carnage\"A highly enjoyable read suited best to those who like their thrillers to simmer for awhile before erupting in a blizzard of action and unpredictability with a future promise of grander adventures.\" --Kashif Hussain, Best Thriller Books\"C. Matthew Smith's gripping tale centers around the history of our public lands and the people who use and protect them. Twentymile is a tremendously entertaining first novel from a writer who knows how to spin a good yarn.\" --Rob Phillips, bestselling author of The Cascade Killer, Cascade Vengeance, and Cascade Predator",
  "genres": [
    "Mystery Thriller",
    "Thriller",
    "Crime",
    "Mystery",
    "Fiction"
  ],
  "author": "C. Matthew Smith",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/58801931-twentymile"
}