{
  "title": "Hangin' by a Moment",
  "description": "He just wants to erase his past.The day Jack—formerly Winston Stewart—walked out of jail, he vowed to keep his conviction a secret. After all, it wasn’t like he’d committed a murder. Just a terrible mistake, and he did his time. Now he wants a new life in a sleepy town where no one knows his name. Deep Haven is the perfect place to start over as a chef. The last thing the former pararescue jumper wants is to get involved. But when Boone Buckam—his friend and the one guy he owes for getting him out of the slammer—asks for help, how can Jack refuse?She can’t seem to escape hers.Colleen Decker has already escaped evil once—as a teenager, she was kidnapped by a murderer. But she’s put all that behind her as a trauma nurse in Minneapolis. Or maybe not, because a freak mistake in the ER sends her past crashing down on her. She needs a timeout in her hometown of Deep Haven. She doesn’t plan to stay—even when she’s roped into the job of flight nurse for the town’s Crisis Response Team chopper. Colleen’s not sure why she’s drawn to danger, but she’ll be safe enough. After all, she’ll need training, and her teacher is a handsome former pararescue jumper. What could go wrong?But facing the past might put their future together in jeopardy.When Jack said he didn’t want to get involved, he especially meant his heart—but being with Colleen feels like a fresh start. He’ll even climb aboard a chopper again, despite his vows. They’re headed for a happy ending…But secrets never stay buried in a small town. And when disaster strikes one snowy night, they’ll both have to decide if the past will destroy them…or if it just might lead them home.Cozy up to this perfect Deep Haven drama about discovering a season of second chances.",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Contemporary",
    "Fiction",
    "Christian Romance",
    "Christian",
    "Audiobook"
  ],
  "author": "Andrea Christenson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/58797370-hangin-by-a-moment"
}