{
  "title": "Diagnosis Prediabetes: Your Guide to Reboot Your Lifestyle & Stop Prediabetes During the Pandemic &",
  "description": "The Centers for Disease Control estimates that over 88 million American adults have prediabetes: that’s 1 in 3 adults in the United States!If you have learned that you have prediabetes, consider it news that must be taken seriously. While many people feel devastated to receive a prediabetes diagnosis, it can be a blessing in disguise.A diagnosis of prediabetes is a wake-up call, and a call to take action. A person with prediabetes should understand what this condition is, and what to do about it even if they have no symptoms. When you take action at the early stages of prediabetes, it is potentially reversible. Ignoring the signs of prediabetes can result in negative health consequences later.This e-book provides up to date information to halt the progression of prediabetes and help on you on your journey towards better health. The information covered includes diagnosis, symptoms and risk factors, and how to prevent diabetes. You will learn how to start a weight loss plan, what to do about exercise, what you can eat, how to organize your kitchen, and how to manage dining out.Throughout this e-book you will find helpful discussions for dealing with the challenges posed by the Covid-19 pandemic: lifestyle changes at home or work, telehealth and doctor visits, home exercise, ordering online or takeout food, and staying safe.At the end of the e-book you will be able to create an action plan to put everything in place. Along the way you’ll receive helpful tips and links to resources.Bonuses in the e-book include:Emotional Eating and Behavior ChangeHealthy Foods Shopping List 2021Hunger ScaleSample Walking ProgramTips For A Good Night’s SleepTips For Fitting In FitnessFood JournalPlan Your Shopping TripTips For Eating Well",
  "genres": [],
  "author": "Gretchen Scalpi",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/58796781-diagnosis-prediabetes"
}