{
  "title": "In the Shadow of Demeter",
  "description": "The daughter of King Zeus of Olympus lived a small life. The least of his sons and daughters, hers was not the moon, or love, or battle…so low that she should have more rightly been numbered among his demigod children. Kore lingered at the edge of the feast hall, watching the great gods and goddesses revel. Too useless to sprout the grain with the nymphs, she followed her mother, Demeter, through the fields and made the flowers bloom, and she wasn't even too good at that. But what she liked best was when she was allowed to wander the woodlands and towns of the mortal world alone.It was there she found her destiny, one that would shake the world from the top of Olympus to the depths of Hades. Kore does not belong in the shadows, and she is not the Goddess of Flowers, spring or otherwise. But things never start out that way. It started, as many stories do, with a boy and a girl in a meadow.This is not the story passed down from Demeter's priests and priestesses. It is not the song sung for Demeter by her nymphs as her tears make the seasons turn. But it was never Demeter's story to tell at all.Grab your copy today to hear Persephone's side of the tale!“In the Shadow of Demeter is broadly a captivating addition to the world of Greek mythology fiction, but at its core (no pun intended) is a story about never fitting in and the desire of wanting to belong and finding your place. Although I’m not incredibly familiar with a lot of Greek mythology beyond the most well known, Vic Malachi did a great job of telling the story in a way that everyone could follow, and included such a rich history to go with it that I was able to be fully immersed in the world.\" - Four Stars\"I found this an entertaining twist on a classic myth, and I feel like I added a little more to my knowledge of Greek mythology. I enjoyed the story of Persephone coming into her own. I also really liked the descriptions of the various realms of the gods, they made me wish I had the talent to paint a picture of them. Recommended, even if you know nothing about Greek myths.\"-Five Stars",
  "genres": [
    "Greek Mythology",
    "Mythology",
    "Retellings",
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Romance"
  ],
  "author": "Vic Malachai",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/58801323-in-the-shadow-of-demeter"
}