{
  "title": "A Duel with the Vampire Lord",
  "description": "On the night of the blood moon, the Vampire Lord must die. Floriane's position as the forge maiden of Hunter's Hamlet is one of reverence, for it is her skill that arms and protects the vampire hunters. She knows her place and is a faithful servant to the Master Hunter and her community... until the night of the blood moon. Until her brother is dying at the hands of the Vampire Lord Ruvan. Wanting to defend her home at all costs, Floriane fights the vampire lord, ready to give her life if it means taking his. But Ruvan doesn't want to take her life... he wants her. Kidnapped and brought to the vampire castle, Floriane is now blood sworn to the vampire lord. She is bound in mind and body to her worst enemy. But Ruvan isn't the fiend she thought he was. She learns the truth of the vampires: They are not mindless monsters, but a proud people, twisted and tortured by an ancient curse. Ruvan believes that Floriane might be the key to ending his people's suffering. All Floriane wants is to defend her home. Loyalties are tested and the lines between truth and lie, hate and passion, are blurred. When her dagger is at his chest, will she be able to take the heart of the man who has claimed hers? A darkly-reimagined Snow White meets inspiration from Beauty and the Beast in an epic fantasy world of hunters, vampires, and curses that run deeper than blood. This stand alone is complete with a \"happily ever after\" ending. It's perfect for fantasy romance fans looking for just the right amount of steam and their next slow-burn and swoon worthy, enemies to lovers story. While it is set in the Married to Magic universe, readers can start with this book.",
  "genres": [
    "Fantasy",
    "Romance",
    "Vampires",
    "Fantasy Romance",
    "Romantasy",
    "Enemies To Lovers",
    "Paranormal"
  ],
  "author": "Elise Kova",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/58830475-a-duel-with-the-vampire-lord"
}