{
  "title": "Who the Hell Is Ralphy?",
  "description": "\"Who the hell is Ralphy?\"Have you ever had a night out with a yowie? Have you ever worn a homemade kangaroo skin coat into your local pub or maybe had a near-death experience with a wild boar? How about been kicked in the head by a horse? Or ridden home on your four-wheeler knowing an Eastern Brown snake's on board with you. Did you ever stand in the middle of a paddock with a mad cow charging you? Ever flown double in a one seater? You ever played three football grand finals in a week?I have.This is a book of tales about my life: a country boy who once set fire to his parents' hay shed;a young lad on the up of his professional football career; a man producing world-class ultra-fine merino wool for the fashion industry; and the ongoing struggle to maintain relationships through stress, drought and distance. Each life-stage filled with fun, mischief, mistakes and heartbreaks.I am telling these stories before they are forgotten because they reflect so many values, skills and ways of life which are eroding or already lost. I hope to inform those of other walks of life of something different and close the gap of time while making you laugh about a few amusing yarns and the occasional joke. However, not all is beer and skittles, with a history of family murders, bushrangers and rebellions. Not to mention ancestors riding with William Lawson the explorer, and others working with Governor Macquarie.This is my story of life, love and loss told through a bit of laughter (and the occasional whinge).Who the Hell is Ralphy? is a book of true anecdotes and short stories reflecting an existence some might never see or experience. The book provides a funny and entertaining insight into Australian life on the land over the lifespan of one lucky(?) man: Ralphy. So, who the hell is he? Come join me and find out...I was not born to the land but spent many happy years as a child and then a teenager living on its fringe in a small country town I call home, Mudgee.Ralph cover grew up in this district and his book takes me back to the sweet smell of freshly cut lucerne hay, rain on a parched paddock, woolsheds, utes, amazing men and women of the land, larrikins with big hearts and a generosity of spirit I treasure.Ralph the son of a grazing family with a rich colourful heritage, captures the very essence of a beautiful life on the land, its humour ups and downs, in a life well-lived.Ken Sutcliffe.",
  "genres": [],
  "author": "Ralph Cover",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/58817764-who-the-hell-is-ralphy"
}