{
  "title": "Forbidden Honor",
  "description": "In my world, dragon shifters rule. Dragon shifters are always royals. They’re always male. They’re always assholes.An orphaned servant like me? Everyone assumes on first shift, I’ll turn into a squirrel.Instead, I grow wings. Breathe fire. Throw the world into chaos.No one wants a girl in the Royal Dragon Guard. So I’m disguised as a man and sent off to military training.The Dragon Royals are not a welcoming bunch. These princely scions of the four ruling families have been training to fight the plague-crazed Scourge since they were toddlers. Every girl in the city dreams of winning the heart of one of the dragon nobles, but they only care about each other.Jaik, the cold-hearted hero who never smiles and never falters. Arren, who kills without mercy and guards his friends fiercely. Lynx and Branick, the twin spymasters with deadly swords. Talisyn, with the beautiful cruel mouth and endless bravery. By night, I’m the servant they flirt with. I’m the one stealing Jaik’s heart and kissing Talisyn and antagonizing Arren. All the while, Branick and Lynx fret that I’m a spy, sent to destroy the Royals.By day, I’m Lucien Finn, the man they despise and the dragon shifter they have to fight alongside.These royals are determined to make me fall, and the princes play dirty. Can I ignore the pull they have on my heart and kick them off their thrones?Or will they break the maid... or kill the man? What will it do to us all when they finally discover the truth about who I truly am?If cocky dragon shifters, steamy scenes, and snarky heroines who refuse to choose anything less than ALL their heart's desires offend...then back away. Otherwise, scroll up and dive into the adventure alongside Honor.",
  "genres": [
    "Fantasy",
    "Reverse Harem",
    "Dragons",
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "Fae"
  ],
  "author": "May Dawson",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/58831274-forbidden-honor"
}