{
  "title": "Loving Her Highland Thief",
  "description": "Stay? Lose all she’s ever known. Go? Lose the love of a lifetime.As a struggling, 21st century farmer, Kenzie MacMartin knows if she doesn’t recover that registered ram that cost her a bundle, her dog won’t be the only one howling in the Highlands. And to make matters worse, when she chases that fool sheep through a cave, she discovers a troupe of trespassing re-enactors mucking up her land with some kind of clan skirmish complete with realistic weapons, monstrous warhorses, and a restless herd of Highland cows. The only upside is their strikingly handsome leader—until he kidnaps her.Mathias Stronach questions his sanity in laying claim to the strangely dressed woman and her vicious wee dog. Perhaps he should have let the MacPhersons take her prisoner. Then, she would’ve distracted them instead of him. Such daring and fire in this feisty lass. He’d bet his best dagger; her passions burn just as fiercely. And that fine round backside of hers nestled between his thighs as they ride. Makes a man think twice about choices he’s made. Like promising to marry a woman he’s never loved so he can be the next chieftain of Clan Stronach.When Kenzie realizes she’s barged into the thirteenth century, her priority is getting back to that cave and hoping if she retraces her steps, she’ll find her way back home. But vengeful clans, a medieval sociopath, and the mesmerizing warrior who draws her in like a bee to sweet clover thwarts that priority at every turn. Her head knows better. Her heart refuses to listen.\nShe misses her family, is worried about her farm, and would kill for coffee and a toothbrush. But those aren’t the worst things about traveling back several centuries. The worst thing is loving a man who, once she returns to her time, will have been dead for over eight hundred years.",
  "genres": [
    "Time Travel",
    "Historical Romance",
    "Romance",
    "Historical Fiction",
    "Historical",
    "Fantasy",
    "Medieval"
  ],
  "author": "Maeve Greyson",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/58808169-loving-her-highland-thief"
}