{
  "title": "The Girl from Purple Mountain: Love, Honor, War, and One Family's Journey from China to America",
  "description": "A family memoir set against the shifting tides of twentieth-century China, The Girl from Purple Mountain begins with a the Chai family matriarch, Ruth Mei-en Tsao Chai, dies unexpectedly and her grieving husband discovers that she had secretly arranged to be buried alone―rather than in the shared plots they had purchased together years ago.For many years, Ruth's family remained shocked by her decision and could not begin to fathom her motivations. Over time, they would fully understand her extraordinary story. Ruth was born in China at the beginning of the 20th century, during the reign of the last emperor. Educated by American missionaries, she was one of the first women admitted into a Chinese university, during an era when most Chinese women were illiterate and had bound feet. She would defy tradition and refuse to marry the man her family had chosen for her, instead choosing his younger brother as her husband. Later, as the Japanese Army advanced across China during World War II, her foresight and quick thinking kept her family alive as she, her husband, and their three sons were forced to flee from city to city. In war-torn Chungking, she was Lady Mountbatten's interpreter as the Allies struggled to help China. After the war, the Chais immigrated to the U.S. to what seemed, until Ruth's death, a happier and more peaceful life.In this extraordinary family epic, Ruth's first-born son, Winberg, and his daughter May-lee explore family history to reconstruct her life as they seek to understand her fateful decision. As Winberg \"It is my duty to try to understand my mother, to seek answers. To ignore the past is too much like forgetting . . . I hope my memories are enough to fulfill a son's obligations.\"",
  "genres": [
    "China",
    "Biography",
    "Memoir",
    "Nonfiction",
    "History"
  ],
  "author": "May-lee Chai",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/588243.The_Girl_from_Purple_Mountain"
}