{
  "title": "Extremely Online: the untold story of fame, influence, and power on the internet",
  "description": "Acclaimed Washington Post reporter Taylor Lorenz reveals the untold story of online influence and the real social history that we’ve already forgotten of the internet—and how it has reshaped our world.For over a decade, Taylor Lorenz has helped us understand internet culture, showing how it’s inextricable from our daily lives. Her reporting is serious yet entertaining—and illuminating about ourselves and the lives we increasingly create online. In her debut book, Extremely Online, she uncovers how these internet moments are rarely the result of founders, Silicon Valley geniuses, or marketers. Instead, the sweeping trends of culture both online and off have been shaped by average people.  Extremely Online is a satisfying, enlightening journey through the brief but packed years of the digital age, through the experiences of the people—the content creators, the bloggers, the everyday users—who made it what it is. By tracing our socialization online over the last two decades—how we’ve shared information, consumed content, and built connections—Lorenz presents the authoritative social and cultural history of the internet age. Lorenz takes a forensic look at how social platforms and power users have dismantled legacy systems, giving rise to a decentralized power that allows access to many more people. She documents how moms at home who started blogging were among the first to monetize their personal brands online; how bored teens who began posting videos reinvented fame as we know it; and how young creators on TikTok are leveraging opportunities to opt out of the traditional career pipeline. It's the people’s recent history of the internet, one we need to know so that we can help set the course for the future. This uprising on the internet continually changes—it is by us and for us, and it is ours to decide what we want it to be. Extremely Online is the inside, untold story of what we have done to the internet, we are the ones creating—and recreating—it daily. We have the power to shape its future.",
  "genres": [
    "Nonfiction",
    "Audiobook",
    "Technology",
    "History",
    "Sociology",
    "Internet",
    "Business"
  ],
  "author": "Taylor Lorenz",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/58818667-extremely-online"
}