{
  "title": "Anatomy of Injustice: A Murder Case Gone Wrong",
  "description": "The book that helped free an innocent man who had spent twenty-seven years on death row. In January 1982, an elderly white widow was found brutally murdered in the small town of Greenwood, South Carolina. Police immediately arrested Edward Lee Elmore, a semiliterate, mentally retarded black man with no previous felony record. His only connection to the victim was having cleaned her gutters and windows, but barely ninety days after the victim’s body was found, he was tried, convicted, and sentenced to death. Elmore had been on death row for eleven years when a young attorney named Diana Holt first learned of his case. After attending the University of Texas School of Law, Holt was eager to help the disenfranchised and voiceless; she herself had been a childhood victim of abuse. It required little scrutiny for Holt to discern that Elmore’s case—plagued by incompetent court-appointed defense attorneys, a virulent prosecution, and both misplaced and contaminated evidence—reeked of injustice. It was the cause of a lifetime for the spirited, hardworking lawyer. Holt would spend more than a decade fighting on Elmore’s behalf. With the exemplary moral commitment and tenacious investigation that have distinguished his reporting career, Bonner follows Holt’s battle to save Elmore’s life and shows us how his case is a textbook example of what can go wrong in the American justice system. He reviews police work, evidence gathering, jury selection, work of court-appointed lawyers, latitude of judges, iniquities in the law, prison informants, and the appeals process. Throughout, the actions and motivations of both unlikely heroes and shameful villains in our justice system are vividly revealed. Moving, suspenseful, and enlightening, Anatomy of Injustice is a vital contribution to our nation’s ongoing, increasingly important debate about inequality and the death penalty.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Law",
    "Crime",
    "History",
    "Race",
    "Social Justice"
  ],
  "author": "Raymond Bonner",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/12802037-anatomy-of-injustice"
}