{
  "title": "Courting Darkness",
  "description": "My whole life has been characterized by fighting. Fighting my family. And fighting for my life. Trust me—the first one is completely voluntary, and a lot of fun. The second? Not so much. To say my family dynamic is weird is the understatement of the century. I held my first sword when I was only five years old, and I learned how to dispose of a body before I turned ten. I may have a penchant for pink and sparkles…but that doesn’t mean I don’t know how to kick major ass as well. As if my life isn't complicated enough, my body is being ravaged by a chronic, mystery illness. Seizures? Check. Passing out? Check. Agonizing pain? Check. A host of other unexplainable ailments? Double check. After a change in my parents’ job takes us across the country, I find myself doing something I’ve never done before—attend an actual high school, despite my sickness. But this school? Well…it’s a little weird...I'm always turned around, and there's something happening I just can't put my finger on. And don’t even get me started on my sexy as sin teacher and his equally as gorgeous twin brother. Or Tristan, who kind of reminds me of an energetic puppy. Or Kian, who has a harem of girls at his beck and call, despite seemingly unhappy with his entire life. Or Foster and Gage, who are revered and feared in equal measure. With a serial killer stalking the streets of this odd, little town, my new friends and family are on high alert. One thing becomes clear…Humans aren’t the only beings who walk this earth. And if I don’t uncover the secrets of my new school, I may be the killer’s next victim.Courting Darkness is a reverse harem paranormal romance, meaning the main character will end up with more than one love interest by the end of the series. This is book ONE in the series. It will end with a cliffhanger.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Fae",
    "Fantasy",
    "Romance",
    "Paranormal Romance",
    "Magic"
  ],
  "author": "Katie May",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/58823779-courting-darkness"
}