{
  "title": "Kiss of the Selkie",
  "description": "A Little Mermaid Retelling\nA handsome fugitive seeking a marriage of convenience.A selkie with a lethal kiss sent to seal his fate…To evade a vicious sea queen’s clutches, selkie Maisie hides on land surviving as a thief. But when she rescues a human from drowning and illegally brings him to shore, she must answer for breaking fae law. As punishment, she’ll have to hunt down the man she saved…and kiss him. But with a kiss that can kill, Maisie’s mission means more than seduction. It means murder.Son of a notorious fae-killer, Dorian was never meant to survive the shipwreck that was orchestrated to assassinate him. Now that he’s on the forbidden fae isle, he’ll do anything to gain citizenship—even marry a fae bride. Desperate for a hasty marriage, he holds a bridal competition in the isle’s most theatrical city, where displays of frivolity aren’t just encouraged—they’re expected. And if Maisie can act like a proper debutante and join the pageantry, she’ll get near enough to deliver her fatal kiss. But getting close to her target brings complications she didn’t expect. As she pretends to compete for Dorian’s heart, it starts to feel less like an act…and more like falling in love. If Maisie doesn’t deliver her kiss by sunrise on the last day of the competition, she forfeits her life. But if she succeeds, Dorian dies. When the pageant ends, will there be a true victor? Or only death and broken hearts?ACOTAR meets Bridgerton and The Selection in this standalone fairytale retelling of The Little Mermaid. If you like enemies-to-lovers romance, bridal contests, and snarky fae royals, then you’ll love this swoon-worthy story in the Entangled with Fae series.*NOTE this book is upper YA/NA featuring mature situations and some adult language. The romance is slow burn but leads to moderate steam.\nKiss of the Selkie\n is a complete stand-alone novel set in the same world as The Fair Isle Trilogy. Journey back to Faerwyvae or begin your adventure for the first time with this enchanting tale. Each book in the \nEntangled with Fae\n series can be read on its own and in any order. Happily ever after guaranteed!",
  "genres": [
    "Fantasy",
    "Romance",
    "Retellings",
    "Fantasy Romance",
    "Fae",
    "Romantasy",
    "Mermaids"
  ],
  "author": "Tessonja Odette",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/58835130-kiss-of-the-selkie"
}