{
  "title": "Spring Song",
  "description": "Spring Song is a High Fantasy Sweet Slow-Burn Romance.A lush and lyrical tale of myth and magick to delight all your senses!-------------------------------------Heinregard has come to the House of Silveria for their famous Spring Song festival, but when he hears the voice of Clayten, Aunt Viraya’s best tenor, he’s overthrown in more ways than one. Is this the real reason he’s here, called from across the worlds? But can he risk letting down his guard for someone who could easily be his downfall?Viraya is responsible for a big part of the Spring Song celebrations. This year, the Karenys are their guests, including a formidable Capitán who has the gall to set his cap at her. Can she tame the ‘savage’ Karenys, keep the children away from her precious blossoms, and ensure a good showing for Spring Song?--------------------------------------Spring Song is a High (Medieval) Romantic Fantasy novella that follows two couples (one M/F and one M/M) as they come together and fall in love at a Noble House that is preparing for Spring Song festivities.If you enjoy sweet, slow-burn romance with your fantasy, or some fantasy with your romance; if you like to read fairy-tales, myths and legends; if you love lyrical story-telling that is both beautiful and bittersweet; if you love poetry and literature, beautiful music, characters that make you swoon, then you may want to read Spring Song.The main characters from this novella have inspired poems and songs (composed by the author and already released on her Lake Traveler youtube channel). Be sure to check out the original music accompanying this novella.Two of Spring Song's protagonists happen to be gay. Spring Song is the first novella in the Seasons Cycle, an LGBTQ+ friendly series, but can be read as a standalone.Tropes: True Love, Forbidden Love, Love at First Sight, Nobility & Stable-hand, Fated Mates, Past Lives, Magick and Music (original songs composed for MCs now on Lake Traveler youtube channel)Themes: Prejudice, Abuse of Power, Suppression and Oppression, Coming of AgeHeat Rating: 1 flame (Sweet, Slow-Burn Romance)High Fantasy; Medieval Fantasy; Romantic Fantasy; Fantasy Romance; Gay Fantasy; LGBTQ+ Fantasy; Mythological Fantasy; Magical Realism; Epic Fantasy; Sweet Romance; Clean Romance; Wholesome Romance; Slow-Burn Romance",
  "genres": [
    "Fantasy"
  ],
  "author": "Cassia Hall",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/58835024-spring-song"
}