{
  "title": "Part of Your World",
  "description": "A refreshingly modern fairy tale and instant New York Times bestseller that Love Hypothesis author Ali Hazelwood hails as \"an uplifting, feel-good, romantic read.\"  After a wild bet, gourmet grilled-cheese sandwich, and cuddle with a baby goat, Alexis Montgomery has had her world turned upside down. The Daniel Grant, a ridiculously hot carpenter who’s ten years younger than her and as casual as they come—the complete opposite of sophisticated city-girl Alexis. And yet their chemistry is undeniable. While her ultra-wealthy parents want her to carry on the family legacy of world-renowned surgeons, Alexis doesn’t need glory or fame. She’s fine with being a “mere” ER doctor. And every minute she spends with Daniel and the tight-knit town where he lives, she’s discovering just what’s really important. Yet letting their relationship become anything more than a short-term fling would mean turning her back on her family and giving up the opportunity to help thousands of people. Bringing Daniel into her world is impossible, and yet she can’t just give up the joy she’s found with him either. With so many differences between them, how can Alexis possibly choose between her world and his?\"Abby Jimenez’s words are like fairy dust... they sprinkled humor and warmth all over my life. Pick up Part of Your World if you’re looking for an uplifting, feel-good, romantic read—and for a beautiful reminder that we should always try to live the life that makes us the happiest.\" --Ali Hazelwood, New York Times bestselling author of The Love Hypothesis   Book of the Month Club Best Book of the Year finalistGoodreads Choice Awards finalistBookPage Magazine Best Books of the YearBooklist Best Romances of the YearSheReads Romance Book of the Year Award nomination",
  "genres": [
    "Audiobook",
    "Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Adult",
    "Chick Lit",
    "Book Club"
  ],
  "author": "Abby Jimenez",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/58832103-part-of-your-world"
}