{
  "title": "I Hate, I Bake, and I Don’t Date!",
  "description": "Yeah, my billionaire boss did it to me in his office twice in one day.I even screamed when it happened. The whole office heard me.No, not that.He fired me.Yep.Beck Svensson fired me right before rent was due and in the middle of a rainstorm.That’s why he’s at the top of my hate list, along with pickles, people who steal other people’s lunches out of the office fridge, and trying to fold a fitted sheet.But you know what? It’s fine—totally fine. It’s freedom! I could do anything! I could start a bakery or farm the mushrooms growing in my soggy apartment carpet.Or I could just show up at the temp office at hate o’clock in the morning for a new assistant job.I hope my new boss will be less of a buzzkill than the last.Except guess who is waiting for me when I show up in the lobby of a swanky office building.That’s right, Mr. Grumpy Boss himself.Beck is appalled that I’m back in his life. Again.I can tell he wants to fire me. Again.Except now he has two little surprise sisters bouncing around him and no one to watch them except yours truly.While I strongly dislike kids and actively hate my boss, I’m willing to abandon my principles for a big paycheck and a hefty expense account.But when Beck needs me to pretend to be the love of his life to keep from losing his sisters, I’m not sure a big windfall is going to cut it.After all, I bake, and I don’t date. Ever.Besides, I hate Beck. No way am I pretending to be his girlfriend.…but I love the little girls.I also love the huge kitchen in Beck’s swanky penthouse that I claim as mine when I move in.And I really love running my hands over his washboard abs and that thing he does with his tongue.Wait! No! I hate it, totally absolutely hate it, right? Right? This is a full-length, enemies-to-lovers romantic comedy, complete with hot, snarly guys with hearts of gold, a heroine who you’ll want to be besties with, and a happily ever after better than a giant slice of chocolate cake! Though this is intended to be a stand-alone book, it does take place after the recently completed Svensson Brothers series.",
  "genres": [
    "Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Humor",
    "Fiction",
    "Workplace Romance"
  ],
  "author": "Alina Jacobs",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/58842499-i-hate-i-bake-and-i-don-t-date"
}