{
  "title": "My Take",
  "description": "Take That was the original and the best British boy band ever. Their records sold millions, and they sold out arenas in less time than it took to play one of their singles. Gary Barlow was the band's secret their gifted, down-to-earth front man who not only wrote most of their greatest hits - \"Back for Good\", \"Never Forget\", and \"A Million Love Songs\" - but sang them too. But the band decided to quit at the height of their fame. What followed for Gary is an inspiring journey of highs and from the promising start of his solo career to his crisis in confidence. The public who had once worshipped him almost seemed to forget he existed. Much has been said about Gary but he himself has remained silent until now. For the first time, Gary tells his full story from his childhood in Cheshire to life after Take the early start at thirteen working in a social club; a career as a teenager working the northern clubs; and the life-changing moment when he met Nigel Martin-Smith, a Manchester modeling agent who wanted to put together a boy-band. Gary will reveal what life on the road with Take That was really like and the truth behind the rumours of their petty feuding. He will also finally settle the speculation around his painfully public fall-out with Robbie. Throughout his experiences Gary has remained as determined and as positive as he was when he was given his first keyboard at eleven. It is this determination and spirit that has helped him bounce back. He has established himself as a successful songwriter writing for the likes of Blue, Delta Goodrem, and Charlotte Church. And now he's made one of pop's great comebacks with the Take That reunion tour, ten years after the band split up. Gary Barlow and Take That are back centre stage once again - where they belong.",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "Autobiography",
    "Memoir"
  ],
  "author": "Gary Barlow",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/588342.My_Take"
}