{
  "title": "The Diviner's Tale: A Novel",
  "description": "“In addition to scaring the daylights out of us, The Diviner’s Tale stands up for the offbeat and unconventional in human nature” (The Boston Globe).   Cassandra Brooks is a diviner, what used to be called a water-witch. Hired by a developer to dowse some land in upstate New York, she is walking a lonely forested valley one spring morning when she comes upon the shocking vision of a young girl hanged from a tree. When she returns with authorities to the site, the body has vanished, leaving in question Cassandra’s credibility, if not her sanity. The next day, during a return visit with the sheriff to have another look, a dazed, mute missing girl emerges from the woods—alive, and the very picture of Cassandra’s hanged girl.   What follows is the narrative of ever-deepening and increasingly bizarre divinations that will lead this gifted young woman, the struggling single mother of twin boys, hurtling toward a past she’d long since thought was behind her. The Diviner’s Tale is at once a journey of self-discovery and an unorthodox murder mystery, a tale of the fantastic and a family chronicle told by an otherwise ordinary woman who is about to be locked in a mortal chess match with a real-life killer who has haunted her since before she can remember.   “[A] splendidly written mystery . . . A compelling story. A.” —The Plain Dealer   “An astonishing writer.” —Joyce Carol Oates, New York Times–bestselling author of Double Delight   “Beautifully written, tight as a tripwire, The Diviner’s Tale isn’t quite like any ghost story I’ve read before.” —Boing Boing   “Morrow quietly drops clues as he guides you deeper into the mystery of the dead girl—and into Cass’s own mind.” —The New York Times",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Paranormal",
    "Contemporary",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Bradford Morrow",
  "average_rating": "3.22",
  "url": "https://www.goodreads.com/book/show/10297838-the-diviner-s-tale"
}