{
  "title": "Little Monarchs",
  "description": "This graphic novel adventure tells the story of 10-year-old Elvie and her crucial mission to save humanity from extinction after a sun shift has changed life on earth as we know it.It's been fifty years since a sun shift wiped out nearly all mammal life across the earth.Towns and cities are abandoned relics, autonomous machines maintain roadways, and the world is slowly being reclaimed by nature. Isolated pockets of survivors keep to themselves in underground sites, hiding from the lethal sunlight by day and coming above ground at night.10-year-old Elvie and her caretaker, Flora, a biologist, are the only two humans who can survive during daylight because Flora made an incredible discovery - a way to make an antidote to sun sickness using the scales from monarch butterfly wings. Unfortunately, it can only be made in small quantities and has a short shelf life.Free to travel during the day, Elvie and Flora follow monarchs as they migrate across the former Western United States, constantly making new medicine for themselves while trying to find a way to make a vaccine they can share with everyone. Will they discover a way to go from a treatment to a cure and preserve what remains of humanity, or will their efforts be thwarted by disaster and the very people they are trying to save?Little Monarchs is a new kind of graphic novel adventure--one that invites readers to take an intimate look at the natural world and the secrets hidden within. Elvie and Flora's adventures take place in real locations marked panel-by-panel with coordinates and a compass heading. Curious readers can follow their travel routes and see the same landscapes--whether it be a secluded butterfly grove on the California coast or a hot-springs in the high desert. Through both comic narrative and journal entries, readers learn the basics of star navigation, how to tie useful knots, and other survival skills applicable in the natural world.Creator Jonathan Case acquired the fact-based portion of Little Monarchs through intensive research and several expeditions to study monarchs across the western United States. Scientific support also came from the Xerces Society, the world leaders in monarch preservation.A Junior Library Guild Gold Standard SelectionAn NPR Book We Love",
  "genres": [
    "Graphic Novels",
    "Middle Grade",
    "Science Fiction",
    "Dystopia",
    "Adventure",
    "Childrens",
    "Comics"
  ],
  "author": "Jonathan Case",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/58845991-little-monarchs"
}