{
  "title": "Wanderlost: The Montgomerys",
  "description": "2023 CONTEMPORARY ROMANCE WRITERS READER'S CHOICE AWARD WINNER!2023 HOLT Medallion Award Finalist2023 Carolyn Reader's Choice Award Finalist2023 Contemporary Romance Writers Stiletto FinalistLove wasn't worth the pain of disappointment and rejection that followed, so Harper Collingswood locked up her heart and swore she would never allow another man to break it.But rules were meant to be broken, especially with the enigmatic, broody, and way too gorgeous for his own good, Bennett McIntyre.Bennett used to have dreams. He used to laugh and be the center of attention. Mr. Popular who had women clamoring to catch his eye and his attention. He was a rising star in baseball with a bright future ahead of him. But he wasn't that person anymore.Some would call it fate. Some would claim serendipity. Others would say it was destiny. Whatever it was called, it was terrifying. Harper and Bennett had barely survived one tragedy. Would they be able to survive falling in love?From award-winning romance author Jennilynn Wyer comes a small-town romance of two beautifully broken people who were destined to be soulmates.\"If I could give this book 10 stars, I absolutely would.\" - Carissa\"Absolutely beautifully written.\" - My Book Filled Life\"I rarely use this word, but this was a beautiful book.\" - Saryas\"This book deserves the 5 stars times 100!\" - SaraReader's Note: Wanderlost is a steamy, college, friends to lovers, small town, sports romance and contains mature themes. Please check TW/CWs in the front matter of the book. Wanderlost is an interconnected stand-alone in the Fallen Brook: The Montgomerys Series and is Harper and Bennett’s love story. Recommended for mature readers.The Montgomerys Stand-alonesThat Girl [Aurora + JD]Wanderlost [Harper + Bennett]About That Night [Jordan + Douglass]",
  "genres": [
    "Romance",
    "Contemporary",
    "Sports",
    "College",
    "Friends To Lovers"
  ],
  "author": "Jennilynn Wyer",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/58836475-wanderlost"
}