{
  "title": "Born for Trouble: The Further Adventures of Hap and Leonard",
  "description": "In Edgar Award winner Joe R. Lansdale's newest Hap and Leonard story collection, the boys are back, with more righteous ass-kickings, highly improbable adventures, and disastrous fishing trips. These never before collected tales showcase the popular not-so dynamic duo who are little bit older, but not a whole lot wiser--Hap and Leonard were truly born for trouble. \n\"A folklorist's eye for telling detail and a front-porch raconteur's sense of pace.\"--New York Times Book ReviewWhen you meet him, Hap Collins seems just like a good ol' boy. But even in his misspent youth, his best pal was Leonard Pine: black, gay, and the ultimate outsider. Together, they have sort of found their way as partners in crime-solving--and at least as often, as hired muscle.As Hap wrestles with his new identity as a husband and father, and Leonard finds love in a long-term relationship, the boys continue their crime-solving shenanigans. They grapple with a stolen stuffed dog, uncover the sordid secret of a missing bookmobile, compete in a warped version of the Most Dangerous Game, regroup after Hap's visit to the psychologist goes terribly awry, and much more.So sit yourself back and settle in--Born for the Trouble is East Texas mayhem as only the master mojo storyteller Lansdale could possibly tell.About the Hap and Leonard short story seriesHap and LeonardHap and Leonard: Blood and LemonadeThe Big Book of Hap and Leonard (digital only)Of Mice and MinestroneThe classic Hap Collins and Leonard Pine mystery series began in in 1990 with Savage Season. Hap and Leonard made their screen debuts in the three season Hap and Leonard TV series, starring Michael K. Williams (The Wire), James Purefoy (The Following), and Christina Hendricks (Mad Men).",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Short Stories",
    "Thriller",
    "Horror",
    "Action"
  ],
  "author": "Joe R. Lansdale",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/58841705-born-for-trouble"
}