{
  "title": "Regenesis: Feeding the World Without Devouring the Planet",
  "description": "\"This remarkable book, staring curiously down at the soil beneath our feet, points us convincingly in one of the directions we must travel. I learned something on every page.\" --Bill McKibbenFor the first time since the Neolithic, we have the opportunity to transform not only our food system but our entire relationship to the living world.Farming is the world's greatest cause of environmental destruction - and the one we are least prepared to talk about. We criticise urban sprawl, but farming sprawls across thirty times as much land. We have ploughed, fenced and grazed great tracts of the planet, felling forests, killing wildlife, and poisoning rivers and oceans to feed ourselves. Yet millions still go hungry.Now the food system itself is beginning to falter. But, as George Monbiot shows us in this brilliant, bracingly original new book, we can resolve the biggest of our dilemmas and feed the world without devouring the planet.Regenesis is a breathtaking vision of a new future for food and for humanity. Drawing on astonishing advances in soil ecology, Monbiot reveals how our changing understanding of the world beneath our feet could allow us to grow more food with less farming. He meets the people who are unlocking these methods, from the fruit and vegetable grower revolutionising our understanding of fertility; through breeders of perennial grains, liberating the land from ploughs and poisons; to the scientists pioneering new ways to grow protein and fat. Together, they show how the tiniest life forms could help us make peace with the planet, restore its living systems, and replace the age of extinction with an age of regenesis.",
  "genres": [
    "Nonfiction",
    "Environment",
    "Science",
    "Nature",
    "Food",
    "Climate Change",
    "Sustainability"
  ],
  "author": "George Monbiot",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/58838928-regenesis"
}