{
  "title": "The Curse of Broken Shadows",
  "description": "An assassin, a powerful dagger, and a magic that shouldn’t exist.Shadow magic is extinct. The Veil Worshippers who honor the shadow god’s wall are hunted for their artifacts, including the Veil shards that break off the wall in Valisea.Brela vows to steal it all back. With the dagger of her people and a Veil shard embedded in her collarbone that has infected her with shadow-cursed magic, she is determined to keep her secrets or suffer a fate worse than death. That was a lot easier when the uptight and infuriatingly handsome Captain Cason Valkip wasn’t hunting her.Cason has spent his entire life hiding—from the raids on Valisea, from his emotions, and from his multiple gods-blessed magics that everyone is afraid of… everyone except Brela. The chaotic, non-magic wielding assassin who drives him insane is also the only person who has never looked at his tainted magic without any ounce of fear. Which is why being forced to work with her to discover the source of the breaking wall sets his already uncontrollable fire magic ablaze.With tension growing in the remaining kingdoms and mythical beasts threatening her at every turn, Brela’s secrets might not remain hidden for much longer. To survive, she will have to work with the one man who could burn her.Because if shadow hell is released, no one will be safe.For fans of Sarah J. Maas's Throne of Glass series, Leigh Bardugo's Shadow and Bone, and Shelby Mahurin's Serpent & Dove series. Dive into this epic, enemies to lovers fantasy with magic, found family, and knives. Lots and lots of knives.TW: This book contains explicit content and dark elements, including language, violence and torture, mature romantic scenes, and mentions of abuse.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fantasy Romance",
    "Enemies To Lovers",
    "Magic",
    "Fiction",
    "Romantasy"
  ],
  "author": "Laura   Winter",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/58847729-the-curse-of-broken-shadows"
}