{
  "title": "Lipstick Traces: A Secret History of the Twentieth Century",
  "description": "Greil Marcus, author of Mystery Train, widely acclaimed as the best book ever written about America as seen through its music, began work on this new book out of a fascination with the Sex Pistols: that scandalous antimusical group, invented in London in 1975 and dead within two years, which sparked the emergence of the culture called punk. \"I am an antichrist!\" shouted singer Johnny Rotten--where in the world of pop music did that come from? Looking for an answer, with a high sense of the drama of the journey, Marcus takes us down the dark paths of counterhistory, a route of blasphemy, adventure, and surprise.This is no mere search for cultural antecedents. Instead, what Marcus so brilliantly shows is that various kinds of angry, absolute demands--demands on society, art, and all the governing structures of everyday life--seem to be coded in phrases, images, and actions passed on invisibly, but inevitably, by people quite unaware of each other. Marcus lets us hear strange yet familiar voices: of such heretics as the Brethren of the Free Spirit in medieval Europe and the Ranters in seventeenth-century England; the dadaists in Zurich in 1916 and Berlin in 1918, wearing death masks, chanting glossolalia; one Michel Mourre, who in 1950 took over Easter Mass at Notre-Dame to proclaim the death of God; the Lettrist International and the Situationist International, small groups of Paris--based artists and writers surrounding Guy Debord, who produced blank-screen films, prophetic graffiti, and perhaps the most provocative social criticism of the 1950s and '60s; the rioting students and workers of May '68, scrawling cryptic slogans on city walls and bringing France to a halt; the Sex Pistols in London, recording the savage \"Anarchy in the U.K.\" and \"God Save the Queen.\"Although the Sex Pistols shape the beginning and the end of the story, Lipstick Traces is not a book about music; it is about a common voice, discovered and transmitted in many forms. Working from scores of previously unexamined and untranslated essays, manifestos, and filmscripts, from old photographs, dada sound poetry, punk songs, collages, and classic texts from Marx to Henri Lefebvre, Marcus takes us deep behind the acknowledged events of our era, into a hidden tradition of moments that would seem imaginary except for the fact that they are real: a tradition of shared utopias, solitary refusals, impossible demands, and unexplained disappearances. Written with grace and force, humor and an insistent sense of tragedy and danger, Lipstick Traces tells a story as disruptive and compelling as the century itself.",
  "genres": [
    "Music",
    "History",
    "Nonfiction",
    "Art",
    "Punk",
    "Philosophy",
    "Cultural"
  ],
  "author": "Greil Marcus",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/58849.Lipstick_Traces"
}