{
  "title": "Knot My Type",
  "description": "He doesn’t do relationships.She doesn’t do flings.Everything they thought is about to unravel…FrankieWhen you say you're a sexologist, people imagine Marilyn Monroe. They don't expect a woman who uses a wheelchair. As the host of the All Access Podcast, I'm breaking barriers, crushing stigmas, and creating sexual connections that are fulfilling for my fans. I'm like cupid, but with pink hair and fewer diapers.Only, I've hit a snag. A lovely listener wants some advice about accessible rope play and I'm drawing a big fat blank. Which leaves me with no option but to get out there and give it a go.Which is how I meet Jay Wood—rigger, carpenter, and all-round hottie.I'd be open to letting him wine and dine me—only Jay isn't my type. He's not a one-girl kind of guy. Monogamy isn't even in his vocab, and I'm not a woman who'll settle for being second choice.But the closer we get, the more Jay has me tied up in knots.And it's making me think, maybe I could compromise and accept a little Wood in my life. Even if it's only temporary.JayFrankie's funny, intelligent, and ridiculously sexy. This should be a no-brainer. A little fun in the sheets, and a little romp with some ropes—simple.Only the infuriating woman is asking for more. I'm not that kind of guy. I wouldn't even know how to be that kind of guy. I'm the definition of easy.It'll be fine. We'll be friends. Just friends.So, why does my heart feel frayed? And why is it I can't help but consider taking the ultimate leap of faith—tying myself to Frankie. Permanently.Warning: This is an instalove piece of goodness that is too cute for words. Get thee some rope, a partner, and settle in for a delicious little romp!P.S. THERE ARE NO WEREWOLVES IN THIS BOOK!",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Disability",
    "Adult",
    "BDSM"
  ],
  "author": "Evie Mitchell",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/58865631-knot-my-type"
}