{
  "title": "Hitchers",
  "description": "Two years ago, on the same day but miles apart, Finn Darby lost two of the most important people in his his wife Lorena, struck by lightning on the banks of the Chattahoochee River, and his abusive, alcoholic grandfather, Tom Darby, creator of the long-running newspaper comic strip Toy Shop . Against his grandfather’s dying wish, Finn has resurrected Toy Shop , adding new characters, and the strip is more popular than ever, bringing in fan letters, merchandising deals, and talk of TV specials. Finn has even started dating again.When a terrorist attack decimates Atlanta, killing half a million souls, Finn begins blurting things in a strange voice beyond his control. The voice says things only his grandfather could know. Countless other residents of Atlanta are suffering a similar bizarre affliction. Is it mass hysteria, or have the dead returned to possess the living? Finn soon realizes he has a hitcher within his skin... his grandfather. And Grandpa isn’t terribly happy about the changes Finn has been making to Toy Shop . Together with a pair of possessed friends, an aging rock star, and a waitress, Finn races against time to find a way to send the dead back to Deadland... or die trying!Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a New York Times bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors.",
  "genres": [
    "Horror",
    "Fantasy",
    "Science Fiction",
    "Paranormal",
    "Fiction",
    "Ghosts",
    "Romance"
  ],
  "author": "Will McIntosh",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/12804197-hitchers"
}