{
  "title": "Wild Obsession",
  "description": "Mountain cabins. Desert dunes. Ocean waves.\n\n\nThese short and steamy instalove stories have wild settings and even wilder heroes. Are you feeling brave?\n\nThe Wild Obsession box set includes:\n\n\nMountain Captive\n\nThe Volkovs took everything from me. They destroyed my family when I was a boy.So when the pretty little Volkov heiress stumbles past my cabin in the mountains, I can’t believe my eyes.She’s sweet. Innocent. Her father should know better than to let her roam the mountains unprotected.There are beasts out here in the wild.Beasts and wicked men.And none of them worse than me.\nDesert Target\n\nThey hired me to kill the queen of the underworld. But when I track my target into the desert, she’s… a hairdresser?I need to get out of this life. But first, I need money, so I take one last job--a hit on the notorious Viper.The Viper is evil. Unhinged. She’s killed hundreds of innocents. But when I track her to the desert, she’s… on vacation?This isn’t the Viper. It’s some poor gorgeous doppelganger who floors me with a single blink of her doe eyes.But I’m not the only one with a case of mistaken identity. And the desert is a dangerous place.I hope the hairdresser likes big, brutal hitmen. Because I’m her ticket to survive.\nOcean Jewel\n\nMy older brother means the world to me. I owe him everything.But if he knew the filthy daydreams I have of his best friend… he’d never look at me the same way.Damian is steady. Rugged and manly. Tailor-made to make me sigh. So when my brother invites me on a sailing trip and says Damian will be there…I can’t resist. I need him near.It’s silly. Because when Damian looks at me, he still sees a little girl. So I’m stuck out on the ocean with only my sketchbook to console me, drawing us together as I wish it could be.Desperate. Primal. Nothing between us but skin.Except I’m careless with my sketchbook. I leave it lying around on deck. And soon Damian looks at me differently, too.Like I’m forbidden.But too tempting to resist.\nArctic Star\n\nI live in the wilderness by choice. I’m no good with people.But when a terrified young woman knocks on my cabin door, I have no choice but to offer her shelter.She’s a puzzle. Lost and exhausted in the Arctic circle, with nothing but a ratty backpack and a torn winter coat.And it takes me way too long to notice—she doesn’t speak. She can’t speak. My sweet little runaway is mute.That’s fine. She has no reason to fear me. And no reason to be ashamed.We’ll be outcasts together.Because she’s not leaving. It’s not safe out there.And she’s mine.",
  "genres": [
    "Romance"
  ],
  "author": "Cassie Mint",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/58861340-wild-obsession"
}