{
  "title": "Keeper of the Lost Cities Series Volume 1 - 8 Collection Books Box Set",
  "description": "Please Note That The Following Individual Books As Per Original ISBN and Cover Image In this Listing shall be Dispatched  Keeper of the Lost Cities Series Volume 1 - 8 Collection Books Set by Shannon  Keeper of the Lost Cities (Volume 1): Twelve-year-old Sophie Foster has a secret. She is a Telepath, and has the power to hear the thoughts of everyone around her – something that she's never spoken about. Exile (Volume 2): In the second book in the Keeper of the Lost Cities series, Sophie must uncover hidden memories as long-buried secrets rise to the surface . . . Everblaze (Volume 3): Sophie uncovers shocking secrets—and faces treacherous new enemies—in this electrifying third book in the Keeper of the Lost Cities series. Sophie Foster is ready to fight back. Neverseen (Volume 4): Her closest friends from the Lost Cities have gone with her to join the Black Swan. They still have doubts about the shadowy organization, but the only way to find answers is to start working with them. Lodestar (Volume 5): The threat of war hangs heavy over her glittering world, and the Neverseen are wreaking havoc. The lines between friend and enemy have blurred. Nightfall (Volume 6): Sophie Foster is struggling. Grieving. Scrambling. But she knows one she will not be defeated. The Neverseen have had their victories – but the battle is far from over. Flashback (Volume 7): Sophie Foster doesn’t know what—or whom—to believe. And in a game with this many players, the worst mistake can be focusing on the wrong threat. Legacy (Volume 8): But after a lifetime of lies, sometimes the truth is the most dangerous discovery. Even the smallest secret comes with terrifying new responsibilities.",
  "genres": [
    "Fantasy"
  ],
  "author": "Shannon Messenger",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/58862632-keeper-of-the-lost-cities-series-volume-1---8-collection-books-box-set"
}