{
  "title": "Orphan of Asia",
  "description": "Born in Japanese-occupied Taiwan, raised in the scholarly traditions of ancient China by his grandfather but forced into the Japanese educational system, Hu Taiming, the protagonist of Orphan of Asia, ultimately finds himself estranged from all three cultures. Wu's autobiographical novel, completed in 1945, is widely regarded as a classic of modern Asian literature and a groundbreaking expression of the postwar Taiwanese national consciousness. Originally written in Japanese and now translated into English for the first time, Orphan of Asia offers a powerful depiction of the political, cultural, and psychological impact of colonialism. Orphan of Asia begins during Taiming's childhood in Taiwan, which has been annexed to Japan only recently. Taiming eventually makes his mark in the colonial Japanese educational system and graduates from a prestigious college. However, he finds that his Japanese education and his adoption of modern ways have alienated him from his family and native village. He becomes a teacher in the Japanese colonial system but soon realizes that there is something seriously wrong with the status quo. He quits his post but finds that, having repudiated his roots, he doesn't seem to belong anywhere. Thus begins Taiming's long journey for his rightful place. But neither in Japan, where he goes to study physics in the belief that technology represents the future, nor in mainland China, where he marries and has a daughter, does he ever come to feel at home or find his calling. Although he assiduously avoids politics, Taiming can't help being caught up in the conflicts that shaped modern East Asian history. He is accused of spying for both China and Japan after hostilities breakout between the two countries, and he witnesses the effects of Japanese imperial expansion, the horrors of war, and the sense of anger and powerlessness felt by those living under colonial rule.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Asia",
    "China",
    "Chinese Literature",
    "Asian Literature",
    "Japanese Literature"
  ],
  "author": "Wu Zhuoliu",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/588624.Orphan_of_Asia"
}