{
  "title": "Dirty Blonde",
  "description": "New York Times bestselling author Lisa Scottoline delivers a gripping stand-alone thriller that features a female judge who gets into trouble when the defendant in a high-profile lawsuit is killed Lawyer Cate Fante, who is attractive, sexy, and tough-minded, has just been appointed to the federal bench in Philadelphia. With her new status in the elite meritocracy that is the federal judiciary, she often feels like an imposter because of her working-class background. For instance, at a fancy dinner, she’s more likely to joke with the waiters than her colleagues. Divorced, Cate also has a secret sex life. She’s attracted to bad boys and working-class men, like the ones she grew up with in the former coal-mining town of Centralia in northeastern Pennsylvania. Cate is presiding over a high-profile multi-million dollar breach-of-contract lawsuit in which a former Philly ADA is suing the producer of a highly successful TV series for stealing his ideas. All true, but the verbal contract isn’t enforceable. As difficult as it is, this means that Cate has to make a ruling that ends the lawsuit in the sleazy TV guy’s favor. Cate learns that being a judge doesn’t always mean that she can do justice. Upset over the ruling she had to make, Cate heads for a bar and there meets a good-looking rough-hewn leather-jacketed hunk and goes off with him to a nearby motel. Cate quickly realizes she’s made a mistake, apologizes and turns to leave, but the guy becomes aggressive and Cate barely manages to get out of the room. At home, she turns on the local news to learn that the TV producer from her court case has been shot to death outside a local restaurant. Not only that, but she soon also finds out that a man has been found dead after a fall from a motel’s exterior staircase. A stricken Cate recognizes instantly the pictures of the leather-jacketed man who’d attacked her at the hotel. Things go from bad to worse in a hurry, and amazingly Cate finds her private life splashed all over the papers and her job in jeopardy. Her only hope is to clear her name and find a murderer.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Mystery Thriller",
    "Audiobook",
    "Crime"
  ],
  "author": "Lisa Scottoline",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/58872.Dirty_Blonde"
}