{
  "title": "A Crown of Dark and Dragons",
  "description": "Orphaned. Raised in secret to protect a dragon-princess. But when fate takes a cruel twist, I must seize the princess’s destiny and make it my own… including her betrothed.Born with Dark magic, my life belongs to the crown. I was raised in secret by my Queen for one purpose only – to serve the cruel Dragon Princess and help her fight the terrible Darkness that is invading our world.My life is devoted to servitude and duty, never passion or adventure or love. I made my peace with that. Right up until Dark magic shattered the future I was expecting. The one where our terrible princess saves the world…And now I must take her place, marry the dangerous fae prince, Mikkael Almassy, and persuade him and his bond-brothers that I really am the vile Dragon-Princess who they despise. I must journey to the fae Queendom to sit on a throne of deadly silver, all while denying a growing yearning in my heart for forbidden temptations I must never succumb to.Because these fae warriors know how to blur the lines between love and hate better than I do. And in this game of crowns, I am a mere pawn. One whose Dark magic has marked her for death.If Prince Mikkael and his bond-brothers discover what I truly am, they will hunt and destroy me. And I must survive this journey to fulfil a promise to my dead Dragon Queen.Can I find a way to fulfil the destiny of a dragon, even if it means sacrificing everything my heart desires?Heart-wrenching and addictive, this epic fantasy romance for adults is filled with passion, intrigue, danger and unstoppable love. If you adore Jennifer L. Armentrout, Sarah J. Mass or Elise Kova, this lush tale of fae and dragons will leave you breathless for more. This medium burn romance features one woman and her four fae warriors. Expect the simmering to sizzling romance to increase as the series progresses. Dive in and enjoy!",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Dragons"
  ],
  "author": "Defiance Sand",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/58869636-a-crown-of-dark-and-dragons"
}