{
  "title": "Not My Neighbor",
  "description": "A Steamy Standalone Instalove Romance KRYSTALNothing like an unexpected airport run to soothe the mind and calm the nerves.Right?Dad’s out of town on business and I’ve only just set my bags down home from a trip myself when I get the call.His newest neighbor is due back from overseas, so would I be a doll and pick him up?Gas money’s under the fruit bowl.Dad explains the guy’s an editor at a major magazine, and I just finished majoring in photography, so…It could be a foot in the door, maybe even a job prospect but most likely just a good place to start picking a professional’s brain about how to get ahead.Dad tells me his name, Jake Casey.Or was it Chet Basie?I can’t tell, his phone’s cutting in and out.Drake Lacy? No, that’s not it either.Dammit. Now I’m thinking of ‘baked pastries’.I forget his name, but it doesn’t matter. Dad says I can’t miss the guy, joking that he’s so tall, dark, and handsome he’d stand out in any crowd.Plus he’ll be looking lost and expecting me, so I tell myself it’s no biggie if I can’t remember his name just now.Dad’s not kidding. I spot Mr. Dreamboat at the airport and swallow hard.Almost just as hard as I’ve just fallen for the guy before he even looks at me.Blake Mason. His name rings in my mind clearly when he tells me. Like a huge, swinging bell.My last boss was a complete A-hole, but if I play my cards right, will Blake Mason give this inexperienced curvy young girl a chance?Looking into his dark, brooding eyes for the first time, do I stand any chance against this obscenely handsome older guy?A man who truly knows what he wants. A man who has it all at his fingertips and the world at his feet.I’m sure he’s just being polite when he seems interested in me, but I’ll do anything he wants to get ahead. Not just with a job offer either.I mean anything he wants.BLAKEI’ve got an hour to kill before my flight, may as well check out the new extension on the airport.Try and get my head around the ‘new architecture’ that costs a truckload but always looks like there are pieces left over.Something I don’t expect to see is what I really like.But I know what I like when I see it. I always know what I want when it presents itself.It’s not so much what I like either, but rather who.Seeing her from behind, watching her curves without her seeing me, I suddenly forget all about my trip.Suddenly forget everything including my age and my reason for doing anything from now on that doesn’t involve me and her.Together, alone.She finally spots me, surprising me by apologizing for being late.Saying sorry for taking so long to get here to pick me up.To take me home.She’s right on time if you ask me, but who is she really waiting for?Who does she really think I am?I introduce myself, bowled over by her sweet looks, her thick curves and an innocence only a younger girl could have.I’m Blake Mason. A man who knows what he wants and thought he had it all until he realized he has nothing.Nothing until I vow to claim her as my own.A prize beyond anything else, and the only thing worth keeping.Trouble is, can I keep the secret, I’m not her neighbor, long enough to keep her as well?I’m about to risk everything to find out.* Not My Neighbor is an insta-everything standalone instalove romance with a HEA, no cheating, and no cliffhanger.",
  "genres": [
    "Romance"
  ],
  "author": "Flora Ferrari",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/58876532-not-my-neighbor"
}