{
  "title": "The Struggle: Striving to Survive",
  "description": "Avery Johnson, a bright teenager living in Memphis, Tennessee, has hopes of making it out of a bad neighborhood and going to college. Avery shares a small home with his family in the city’s most dangerous and poorest neighborhood. When Avery is just one school year shy of graduating from high school, his usual problems begin to get even worse. At home, Avery’s mother Sophia is struggling to pay the bills and keep food in the refrigerator. It pains Avery to see his mother struggle to take care of him and his younger brother Cameron all by herself. He wants to help out at home, but Avery can’t find a part-time job. Also, he is forced to be more careful while out in the neighborhood after witnessing a crime and later becoming a victim of one himself.While watching his mother become more stressed and their problems getting worse, Avery decides to start selling drugs with his friend Derek to make money. In a short amount of time, their newly adopted hustle is thriving, providing Avery with the money he needs to help his mother take care of things at home. At times, Avery finds himself contemplating on whether he should continue hustling or stop altogether. Before he knows it, one bad decision by Derek changes everything. At one point, Avery takes a break from selling drugs, but occurring problems drive him to start back hustling. The Bluff City Mob, the neighborhood’s rising gang, becomes irritated by Avery and Derek’s activity on the streets. The leader of BCM warns Avery to stop selling drugs with Derek on his turf. When Avery and Derek continue to sell drugs in the neighborhood, BCM shows them both that not complying with the warning that was given comes with major repercussions. Will Avery make it to graduation? Will his family survive hard times? In the ghetto, the struggle is real.",
  "genres": [],
  "author": "Johnny Franklin Jr.",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/58876786-the-struggle"
}