{
  "title": "Before the Lights Go Out: Conquering the Energy Crisis Before It Conquers Us",
  "description": "What you need to know now about America's energy future\"Hi, I'm the United States and I'm an oil-oholic.\" We have an energy problem. And everybody knows it, even if we can't all agree on what, specifically, the problem is. Rising costs, changing climate, peaking oil, foreign oil, public safety--if the fears are this complicated, then the solutions are bound to be even more confusing. Maggie Koerth-Baker--science editor at the award-winning blog BoingBoing.net--finally makes some sense out of the madness. Over the next 20 years, we'll be forced to cut 20 quadrillion BTU worth of fossil fuels from our energy budget, by wasting less and investing in alternatives. To make it work, we'll need to radically change the energy systems that have shaped our lives for 100 years. And the result will be neither business-as-usual, nor a hippie utopia. Koerth-Baker explains what we can do, what we can't do, and why \"The Solution\" is really a lot of solutions working together. This isn't about planting a tree, buying a Prius, and proving that you're a good person. Economics and social incentives got us a country full of gas-guzzling cars, long commutes, inefficient houses, and coal-fired power plants out in the middle of nowhere, and economics and incentives will be the things that build our new world. Ultimately, change is inevitable.Argues we're not going to solve the energy problem by convincing everyone to live like it's 1900 because that's not a good thing. Instead of reverting to the past, we have to build a future where we get energy from new places, use it in new ways, and do more with less.Clean coal? Natural gas? Nuclear? Electric cars? We'll need them all. When you look at the numbers, you'll find that we'll still be using fossil fuels, nuclear, and renewables for decades to come. Looks at new battery technology, smart grids, passive buildings, decentralized generation, clean coal, and carbon sequestration. These are buzzwords now, but they'll be a part of your world soon. For many people, they already are.Written by the cutting edge Science Editor for Boing Boing, one of the ten most popular blogs in America",
  "genres": [
    "Nonfiction",
    "Science",
    "Politics",
    "Business",
    "Environment",
    "Climate Change",
    "Sustainability"
  ],
  "author": "Maggie Koerth-Baker",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/12804807-before-the-lights-go-out"
}