{
  "title": "Dirty Blonde: The Diaries of Courtney Love",
  "description": "A multi-textual memoir chronicling the life of one of our most potent pop icons.Groundbreaking rock musician. Award-winning actress. Perceptive songwriter and author. Mother. Wife of a rock god. Fashionista and trendsetter. Provocateur. In each and every one of these roles Courtney Love has demonstrated a wholehearted commitment to her art, and an intense drive and a lust for life that have made her a star and a celebrity icon—but have also led her into some unwise, uncharted, and even dangerous territory. Simultaneously candid and enigmatic, Love has a mordant wit and vivid intelligence matched in intensity only by the extraordinary life she has led, from a bleak early childhood through great fame and terrible heartbreak to the present day. By turns exhilarating and unsettling, this is a story told for the first time in Dirty Blonde.Composed of an astonishing and eclectic collection of deeply personal artifacts including personal letters, childhood records, poetry, diary entries, song lyrics, fanzines, show flyers, other original writings, and never-before-seen photographs, Dirty Blonde leads us through the unimaginable highs and the despairing lows of one of the most compelling and creative figures in the world of popular culture. Through these diaries we see Love’s accomplishments, her mistakes, her history, and her bright future in a whole new light. From her upbringing in Oregon through her years living in Japan, New Zealand, and London, from her career highs with Hole and as a Hollywood leading lady to her personal heartbreak and struggle, Dirty Blonde is Love laid bare—a wholly fascinating portrait of a fierce and insightful woman with an unblinking worldview and a determination to express herself no matter the cost.",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Journal",
    "Autobiography"
  ],
  "author": "Courtney Love",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/58871.Dirty_Blonde"
}