{
  "title": "Relic and Ruin",
  "description": "The Banshee and the Wraith. They have the power to save the world—or destroy it.In a place unlike any other, two brothers set off an ancient, epic, and never-ending battle. This world is controlled by the Necromancers and Reapers—one side pulls people back up through the earth, and the other cuts them down again. One ancient family, the Laheys, have been tasked again and again with keeping the balance between the worlds. And Nyx Lahey, born a Necromancer, but raised a Reaper, is on the front lines. Lately, though, Nyx is wrestling with her identity as she’s thrown into an adventure filled with prophecies and the kind of danger you can cut down with a giant scythe.While chasing a creature that’s killing young girls, Nyx runs headlong—and gun drawn—into Erebus Salem. A hunter who has the ability to turn into a raven to escape danger, Erebus also harbors a he’s not alive. He lives in Dewmort, a world in-between, where the souls of the dead reside, and where memory is all but erased. With no memory of who he is, his only connection to the past is a locket which ends up in Nyx’s hands. Determined to get it back, Erebus and his friends set watch on the Laheys, but they aren’t the only ones.Other beings are lurking in the shadows. They know the truth about Erebus and Nyx. They know that the pair are the Relics, the only two powerful beings in the world capable of taking down the greatest evils known to any kind. Soon, Nyx and Erebus become the hunted, and must try and escape the evil plans of the war lord, Bellum.Bellum wants the Relics for his own purposes. He needs them to raise his father, the original Necromancer, Neco. With his father by his side, Bellum believes he can rule the world—all of them—and destroy the Reapers once and for all.Can Nyx and Erebus master their new found powers, and even if they do, can they survive?",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Paranormal",
    "Fiction",
    "Magic",
    "Young Adult Fantasy"
  ],
  "author": "Wendii McIver",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/58880881-relic-and-ruin"
}