{
  "title": "The Lighthouse",
  "description": "Enchanting, mysterious, and deeply romantic, The Lighthouse follows a young woman's breathtaking journey far from home to discover where she truly belongs.Something strange is happening in Seabrook. The town's lighthouse–dormant for over thirty years and famously haunted–has inexplicably started shining, and its mysterious glow is sparking feverish gossip throughout the spooked community.Amy Tucker is only visiting for the night and has no plans to get caught up in the hysteria, but that changes when she meets Ryan, the loyal, hard-working son of a ranch owner who lives on the outskirts of town.Their chance encounter turns into an unforgettable weekend, and against the backdrop of the lighthouse-obsessed town, the two of them forge a deep connection, opening their hearts, baring their souls, and revealing secrets long kept hidden.But as they grow closer, and as the lighthouse glows ever brighter, a startling discovery about Ryan leaves Amy questioning everything she thought she knew. To uncover the truth about her new friend, Amy will need to enter Seabrook’s ominous tower, where waiting inside she will not only find the reason why fate has brought them together… but a shocking secret that will change the course of their lives forever.\"...smart, suspenseful, and briskly paced work... Parker offers plenty of heart, including messages about how love can conquer the unknown.\" - Kirkus Reviews\"Bloody amazing. The Lighthouse will have you laughing then weeping. I couldn't put it down.\" - Tina Shaw, author of The Children's Pond\"A meditative look at moving through grief. Parker's debut novel is a work of character-driven magical realism dealing with themes of filial love, grief, and existence in the liminal space between life and death. Readers who follow its mysterious light will be rewarded with intriguing twists and lovable characters.\" - Booklife",
  "genres": [
    "Mystery",
    "Romance",
    "Fiction",
    "Magical Realism",
    "Fantasy",
    "Audiobook",
    "Paranormal"
  ],
  "author": "Christopher      Parker",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/58870477-the-lighthouse"
}