{
  "title": "Paper Stars Rewritten",
  "description": "It’s funny how life plays out sometimes. I think the ancient Greeks had it right with their belief that the Fates controlled everyone’s destinies. Those fickle Fate b*tches. They’ve been pulling the strings of my life and tying them into twisted knots, then setting them on fire.I used to be a selfish girl. I used to want everything without having to give up anything. Funny how Fate stepped in and in one horrific night, altered my destiny and the lives of my best friends, Jayson, Ryder, and Julien, in ways we could never imagine.It’s been over a year since I saw my guys. A year after everything was taken from me. But I’m not the same girl I was before. I’m not the same girl Jayson, Ryder, and Julien remember. I’m something new. Tragedy remade me into someone stronger, fiercer.I just wish the Fates would stop messing with me. But you know what they say? Be careful what you wish for. Jayson struggled with his jealous anger because I was no longer the girlfriend he knew. Julien struggled with his guilt because he thought he failed me. Then there was Ryder and Fallon. My two bad boys who would do anything to protect me.If life offered you a second chance at love, how hard would you fight to claim it? Everyone’s story can be rewritten.RyderIt has always been the four us: me, Elizabeth, Jayson, and Julien. We grew up together. Shared our lives together. We were best friends. We were a family. Until we weren’t. Until my best friend betrayed me.I have loved Elizabeth since I was nine years old. She was everything I ever wanted but couldn’t have because my best friends, Jayson and Julien, were in love with her too. So, I was relegated to watch from the sidelines, stuck in the role of best friend, as the girl I loved gave her heart to someone else. I loved her enough to let her go because loving her meant I would sacrifice what I wanted for her to find happiness—even if it wasn’t with me.Then one horrific night changed everything, and Elizabeth was gone. Taken from us. Taken from me. It’s been over a year since Jayson, Julien, and I last saw her. Every day has been a struggle without her, and all we want, all we wish for, is to have her back.But the woman who returns to us is not the Elizabeth we once knew.Perhaps this new Elizabeth can be mine.Reader’s Warning: Paper Stars Rewritten is Book 2 in the Fallen Brook Series. It is a steamy romance full of angst, emotion, and suspense, and told in multiple POVs. Book 2 takes place in college and contains scenes that may be triggering (violence and reference to assault and abuse, foul language, suspense, and references Book 1’s shocking cliffhanger). Sex/sexual intimacy in the book is consensual. Recommended for mature readers aged 18+. Please note that even though there are multiple love interests, it is not a RH.New coverThe Fallen Brook SeriesBook 1: All Our Next TimesBook 2: Paper Stars RewrittenBook 3: Broken Butterfly",
  "genres": [
    "Romance"
  ],
  "author": "Jennilynn Wyer",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/58875141-paper-stars-rewritten"
}