{
  "title": "His Name Is George Floyd: One Man's Life and the Struggle for Racial Justice",
  "description": "A landmark biography by two prizewinning Washington Post reporters that reveals how systemic racism shaped George Floyd's life and legacy--from his family's roots in the tobacco fields of North Carolina, to ongoing inequality in housing, education, health care, criminal justice, and policing--telling the singular story of how one man's tragic experience brought about a global movement for change.The events of that day are now tragically familiar: on May 25, 2020, George Floyd became the latest Black person to die at the hands of the police, murdered outside of a Minneapolis convenience store by white officer Derek Chauvin. The video recording of his death set off a series of protests in the United States and around the world, awakening millions to the dire need for reimagining this country's broken systems of policing. But behind a face that would be graffitied onto countless murals, and a name that has become synonymous with civil rights, there is the reality of one man's stolen life: a life beset by suffocating systemic pressures that ultimately proved inescapable.This biography of George Floyd shows the athletic young boy raised in the projects of Houston's Third Ward who would become a father, a partner, a friend, and a man constantly in search of a better life. In retracing Floyd's story, Washington Post reporters Robert Samuels and Toluse Olorunnipa bring to light the determination Floyd carried as he faced the relentless struggle to survive as a Black man in America. Placing his narrative within the larger context of America's deeply troubled history of institutional racism, His Name Is George Floyd examines the Floyd family's roots in slavery and sharecropping, the segregation of his Houston schools, the overpolicing of his communities, the devastating snares of the prison system, and his attempts to break free from drug dependence--putting today's inequality into uniquely human terms. Drawing upon hundreds of interviews and extensive original reporting, Samuels and Olorunnipa offer a poignant and moving exploration of George Floyd's America, revealing how a man who simply wanted to breathe ended up touching the world.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Race",
    "Social Justice",
    "Politics",
    "Audiobook"
  ],
  "author": "Robert Samuels",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/58890953-his-name-is-george-floyd"
}