{
  "title": "The Tenth Unknown",
  "description": "Traversing across genres like mythology, fiction, and historical facts, The Tenth Unknown by Jvalant Nalin Sampat is a World War II thriller that stretches across ages. The book starts during the reign of Emperor Ashoka and ends in 1947, when India gains independence.The core of The Tenth Unknown revolves around a race between different individuals to acquire a set of nine books. The books are some of the world’s best kept secrets, and it is believed that the person who gets the entire set will gain information that can lead to unlimited power and wealth.The books mentioned in this novel have been protected down the ages by a secret society of men appointed by Emperor Ashoka. They are scattered around the world and hidden, and the clues about their location are hidden in the ruins of the ancient Nalanda University.The attempts to trace the books take on a new pace when the Nazi leader Adolf Hitler manages to lay his hands on one of the books. This causes panic across the world. The British are worried at the prospect of empowering the dictator with unlimited wealth and power.The task of tracing the remaining books and ensuring their safety falls on Prithvi Rathore, who is more English than Indian. Prithvi is quite happy with his comfortable existence and his regular game of cricket. However, his grandfather, who was a member of the secret society formed to protect the books, insists that it is Prithvi’s duty to trace the remaining books and keep them safe. A reluctant Prithvi agrees to take up the task. His main opponent in this task is Joseph Heidler, a rather untypical Nazi officer who has been ordered by Adolf Hitler to get the remaining books.As the two men try to fulfill their assigned tasks, the race becomes intensely action packed. Will the good men win over the bad? Who will be able to decrypt the clues hidden amidst the broken ruins of Nalanda?",
  "genres": [
    "Fiction",
    "Adventure",
    "Thriller"
  ],
  "author": "Jvalant Nalin Sampat",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/12805712-the-tenth-unknown"
}