{
  "title": "Hate You Forever",
  "description": "I, Tara Mangal, take thee, Marnix Taylor, to have and to hold from this day forward.For better, for worse, for richer, poorer, in sickness, and in health.To love and to cherish, till death do us part.Or at least that’s the story we’re spinning to the world...My new husband is an infuriating, stubborn man with no remorse, no sense of humor, and no idea of what love or marriage is supposed to be about.Good thing I didn’t pick him because I actually wanted to marry him.The only reason I agreed to his ridiculous terms was to escape being married off to another man. A man my parents had chosen, not knowing he was dead set on destroying me.I barely escaped a life with the monster of a man from my past, only to have three new ones dropped into my lap.Marnix Taylor, my savage husband who can take anyone down with one look.Cohutta Reilly, the sweet, playful jokester who also happens to be my husband's best friend.And Rushton Bergman, the quiet, brooding bodyguard, determined to protect me at all costs.The three of them may think they can control me, but they will soon learn that Tara Mangal can’t be tamed. Not even by the three hottest men in Craibridge.Hate You Forever is book one in the Hate Series. It is a reverse harem novel with themes like marriage of convenience, enemies-to-lovers, and bodyguard romance. This series takes place in the same fictional city of Craibridge as Love in Sight and Love Triggered, and will contain some character cross over, but is a standalone series. You don't have to read the others to read this series!TW: Book contains material only appropriate for 18+. May contain situations or talk concerning abuse, r@pe, drugs, violence,",
  "genres": [
    "Reverse Harem",
    "Enemies To Lovers",
    "Dark Romance",
    "Romance",
    "Dark",
    "Abuse",
    "Contemporary"
  ],
  "author": "Denver Rose",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/58900809-hate-you-forever"
}