{
  "title": "Moonstruck",
  "description": "Atticus Mulvaney is the eldest son of eccentric billionaire, Thomas Mulvaney—a role he takes very seriously. Atticus takes everything seriously. Like his brothers, Atticus is a psychopath, raised to right the wrongs of a broken justice system. Unlike his brothers, he’s not very good at it.Jericho Navarro is no psychopath, but he is a vicious killer. Like Atticus, he also has a secret life. To most, he’s just a mechanic. But to a ragtag group of social misfits, he’s Peter Pan, teaching them to eliminate those who prey on the weak with extreme prejudice.When Atticus and Jericho come face to face over a shared enemy, their accidental meeting ends in an explosively hot hookup neither can forget. But they have nothing in common. Atticus is a buttoned-up closeted scientist and Jericho is a man on a mission, determined to find and punish those responsible for the death of his sister. Still, Jericho can’t stay away. And, truthfully, Atticus doesn’t want him to.As Jericho’s mission begins to bleed into Atticus’s life, two separate but equally brutal families will need to learn how to fight together to take out a common enemy. But no amount of brute force can show Jericho how to scale the walls of a psychopath’s heart. Can Jericho convince Atticus that, sometimes, the couple who kills together stays together?Moonstruck is a high heat, intense psychopath romance with an HEA and no cliffhangers. It features a fumbling, sexually confused maniac and the dominating, unapologetic gang leader who can’t stop tormenting him. As always, there’s gratuitous violence, very dark humor, more killers than you can count, and enough explosive chemistry to level a city block. This is book three in the Necessary Evils series. Each book follows a different couple.",
  "genres": [
    "M M Romance",
    "Romance",
    "Dark Romance",
    "Dark",
    "LGBT",
    "Contemporary",
    "Crime"
  ],
  "author": "Onley James",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/58896221-moonstruck"
}