{
  "title": "The Underdog",
  "description": "Anders:There once was a guy who told a little white lie. That didn’t turn out so well. I would know. I’m the guy.Once upon a time, I told my brother and sister that my dream was to do a triathlon. I never expected them to sign me up for one! Now I’m forced to deal with my very cantankerous personal trainer. Wells Montgomery is an angry, rude, judgmental bastard. Frankly, I’m surprised the chip on his shoulder hasn’t crushed him yet.But the more time I spend with him, the more I realize that the anger is just a facade that conceals a man who is more than a little lost.The more time I spend with him, the more I start to think that maybe somebody should find him.The more time I spend with him, the more I start to think that maybe, just maybe, that person could be me?Wells:There once was a guy who flew unimaginably high. That didn’t turn out so well. I would know. I’m the guy.A year ago I was on top of the world. It only took a handful of seconds for my life to irreversibly change course. Needless to say, I’m not happy. Neither am I happy when my dad and one of my so-called friends trick me into becoming a personal trainer for some guy who wants to do a triathlon. Now I need to get this Anders Kelly to fire me.It’s a good plan, if only Anders wasn’t so unbelievably stubborn. And too nice for his own good. Annoyingly fun. Irritatingly kind. His faults just keep piling up.But the more time I spend with him, the harder it becomes to keep my distance.The more time I spend with him, the more I start to see the possibilities life still offers.The more time I spend with him, the more I start to think that maybe, just maybe, Anders might not be an unattainable dream after all.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Sports",
    "Enemies To Lovers",
    "Disability",
    "Sports Romance"
  ],
  "author": "Briar Prescott",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/58900775-the-underdog"
}