{
  "title": "Princes and Kings",
  "description": "In the year 1240 AD, the land of Gwynedd Wales found themselves without a leader when their king, Llywelyn the Great, died at a ripe old age. The natural successor to the king was his son Dafydd, who took on the job of ruler after his death. Soon after taking on the job he was forced to sign a treaty with the king of England and send his brother Gruffudd and his nephew Owain to England to be imprisoned in the Tower of London in exchange for keeping his land and title. His other nephew, Llywelyn, became the new head warrior after his father's imprisonment, travelling the country and patrolling the borders to the north and the south. After four years imprisonment in the Tower of London, Gruffudd died while attempting to escape from his tower cell, and his son Owain was released by the king himself. He wanted Owain to help him start a civil war in Gwynedd. Meanwhile, after finding out about his brother's death from a letter sent by his nephew Owain, Dafydd declared war on England, prompting Owain to escape Winchester Castle, where he had been recovering from his time in prison to find his brother Llywelyn and help him in the war between England and Gwynedd. During the course of the war, Dafydd was killed in battle, leaving the Welsh army without a leader. Being the brave and noble man that he was, Llywelyn called the men to him and, with his leadership, they managed to send the English packing. With the new weight of responsibility thrust upon his shoulders, Llywelyn rode home at the head of the army to find that his world had changed. Now not only was his father gone but his mother as well, and the land of Gwynedd was once again without a leader. It became clear that the best man for the job was Llywelyn himself, and he decided that there was nothing else to do but become the new ruler. He would do anything to keep his people safe, even if that meant taking on a responsibility that he felt he was too young for. He would never abandon his people for anything and let the English take everything from him.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Sydney   Williams",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/58889820-princes-and-kings"
}