{
  "title": "All the Comfort Sin Can Provide",
  "description": "With raw, lyrical ferocity, All the Comfort Sin Can Provide delves into the beguiling salve that sin can promise—tracing those hidden places most of us are afraid to acknowledge. In this collection of brutally unsentimental short stories, Grant Faulkner chronicles dreamers, addicts, and lost souls who have trusted too much in wayward love, the perilous balm of substances, or the unchecked hungers of others, but who are determined to find salvation in their odd definitions of transcendence.Taking us from hot Arizona highways to cold Iowa hotel rooms, from the freedoms of the backwoods of New Mexico to the damnations of slick New York City law firms, Faulkner creates a shard-sharp mosaic of desire that careens off the page—honest, cutting, and wise.PRAISESomewhere between sinister and gleeful the characters in Grant Faulkner’s story collection All the Comfort Sin Can Provide blow open pleasure—guilty pleasure, unapologetic pleasure, accidental pleasure, repressed pleasure. Really, at the heart of all identity is the reach for pleasure, and then what actually comes, all those moments of slippage where we do the wrong thing, take a ridiculous risk, double down on failure, land in a forsaken place, slip the mainstream of things enough to change and become. These characters exude beauty from their flaws. These stories are lit.–Lidia YuknavitchFull of bad behavior and a ferocious desire for escape, All the Comfort Sin Can Provide is a catalog of longing. Faulkner’s arresting characters broadcast their worst decisions from grimy motel rooms, greasy kitchens, and sprawling American highways, each of them hellbent on the promise of something better.”–Kimberly King ParsonsAll the Comfort Sin Can Provide delivers on the promise of Grant Faulkner’s daring debut with a follow-up collection of stories that excavates possibility, salvation, and the deceptive comforts one finds in so many pleasures.–Adam Johnson",
  "genres": [
    "Short Stories"
  ],
  "author": "Grant Faulkner",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/58898664-all-the-comfort-sin-can-provide"
}