{
  "title": "Stitched",
  "description": "About StitchedSophie is desperate to stitch her life back together.Quirky. De-railed. Unhinged. Untamed. And ultimately hanging on by a thread, after a life changing car crash changes the direction of her life as she knew it. Navigating losing the love of her life she sets out on a journey to fall back in love, with life.Between sewing sarcastic cross-stitches, sexual tension, and spiritual revelations Sophie finds herself new friendships, traveling, and herself in limbo between worlds. Foreign worlds. Haunted by her past. And stuck in present.Enter Chris, the seductive Australian backpacker who just might help her come back to the reality of life. Helping her connect all the tiny threads of fate that lead us to live it.Welcome to Sophie’s awkward world, and how it unravelled…Praise for Stitched★★★★★ \"Eat, Pray, Love, meets 13 Reasons Why. I’m officially hooked on this book.\" ~ Stacey, Goodreads Reviewer★★★★★ “Stitched is one way to truly travel in 2022. This book transports you to new worlds, romantic, dead, and foreign. Sophie is a girl in pieces we can all relate to.” - Publishers Weekly★★★★★ \"Stitched was loaded with sexual tension and subjects we all live through. Entertaining, relatable, sad, sexy, liberating!” ~ Selena, Goodreads Reviewer★★★★★“The best YA book I've read this year. A real journey for the reader.” ~ Young Lover Book Club★★★★★“This book already has its own Stitched cult following. If you vibe with anything cross-stitch, travel, sarcasm, or spirituality – you’ll fit right in.” ~ Book Club Review★★★★★ \"Finally, equally entertaining and enlightening fiction books for the next generation of soul searchers. Romantic and loaded with revelation.” ~ Amazon Bestselling Author of The Soul Searcher’s Handbook.★★★★★ \"Stitched was an addictivepage turner from start to finish. An easy read that delivered on romantic reader escapism.\" ~ Jennifer, Goodreads Reviewer★★★★★ \"Quirky gold.” ~ Zoe, Goodreads Reviewer★★★★★ \"What the young adult and teen readers of the world need right now.\" ~ Hailey, Goodreads Reviewer★★★★★ \"I cannot wait for this to become an Amazon Prime Original series. A girl can hope!\" ~ Gia, Goodreads Reviewer★★★★★ \"Thank you for helping me feel like I could still travel and soul search, even when the world is in lock down!\"~ Reader★★★★★ \"Sophie in Stitched is relatable and beautifully quirky. A protagonist every young woman can connect with.”~ Rachel, Goodreads Reviewer",
  "genres": [],
  "author": "Emma Mildon",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/58902078-stitched"
}