{
  "title": "Listen To Me",
  "description": "Rizzoli & Isles are back! Jane and Maura are investigating a brutal murder with dire implications, and this time, with Jane's intrepid mother, Angela, looking into a mystery of her own.Mothers know best . . . But who will listen?Boston homicide detective Jane Rizzoli and medical examiner Maura Isles are newly plagued by what seems like a completely senseless murder. Sofia Suarez, a widow and nurse who was universally liked by her neighbors, lies bludgeoned to death in her own home. But anything can happen behind closed doors, and Sofia seemed to have plenty of secrets in her last days, making covert phone calls to traceless burner phones. When Jane finally makes a connection between Sofia and the victim of a hit-and-run from months earlier, the case only grows more blurry. What exactly was Sofia involved in? One thing is clear: The killer will do anything it takes to keep their secret safe.Meanwhile, Angela Rizzoli hasn't had a decent night's sleep in all the years since her daughter became a homicide detective. Maybe the apple didn't fall too far from the tree: Nothing in Angela's neighborhood gets by her--not the gossip about a runaway teenager down the block and definitely not the strange neighbors who have just moved in across the street. Angela's sure there's no such thing as coincidence in her sleepy suburb. If only Jane would listen--instead she writes off Angela's concerns as the result of an overactive imagination. But Angela's convinced there's a real wolf in her vicinity, and her cries might now fall on deaf ears.With so much happening on the Sofia case, Jane and Maura already struggle to see the forest for the trees, but will they lose sight of something sinister happening much closer to home?",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Audiobook",
    "Suspense"
  ],
  "author": "Tess Gerritsen",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/58885794-listen-to-me"
}