{
  "title": "HunGr: Two Different Worlds, One Amazing Life",
  "description": "When you have a thirst for success and a hunger for happiness, nothing can stop you. This book is a testament to just that, offering a candid and often humorous insight into the life of Karoly Vamos – dancer, choreographer and cancer survivor.Growing up in the suffocating communist-led Hungary of the 60s and 70s, Karoly had no idea what twists and turns fate had in store for him.Suffering from unimaginable physical and emotional abuse by his parents, he turned to gymnastics for refuge, eventually discovering his hidden talents along the way. After finding his feet in the world of dance, he embarked on a new life in the Greece of the 90s, only to find that not all fairytales have a happy ending.Refusing to ever give up, Karoly was fuelled by his passion, talent, and dreams. A combination of hard work and good fortune finally brought him the success he craved, rising to stardom as a celebrity choreographer and dancer in the country’s top TV shows. While his career took off, Karoly was still lacking the one thing in life that meant the most to him – someone to love him for who he was.Traumatized by painful memories of his upbringing in Hungary and struggling with his sexual identity, he yearned to experience real love in his personal relationships, Karoly eventually found what he had been searching for, despite all of the difficulties he met along the way. But it wasn’t long before he would have to face one of the greatest challenges of his life as the dark spectre of cancer knocked on his door.This book is an inspiration to all those who have suffered hardship, pain, and loneliness. Karoly is not only a survivor, but also a reminder that if you truly believe in yourself and have a hunger for life, your dreams will eventually come true. He doesn’t say it is ever going to be easy, but on reading this book, you will perhaps find the courage to continue your own personal fight, no matter where you are.From small-town boy to celebrity choreographer, HunGr proves that life can be amazing, for everyone.",
  "genres": [],
  "author": "Karoly Vamos",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/58917297-hungr"
}