{
  "title": "The Reindeer Falls Collection: Volume 2",
  "description": "Welcome back to Reindeer Falls! Bundle two containers books 4, 5 & 6Elves with Benefits, Book 4My name is Ryan Sheppard and I don’t care about Christmas. I’m only returning to my over-the-top Christmas-themed hometown to sell the house I inherited from my late uncle so I can get back to the city and the promotion I’m chasing at work.Unfortunately, there’s a flaw in my plan.Because according to the town Christmas cop, there’s a moratorium on selling houses during December. She says it’s bad for the aesthetic. She’s also slapping an alarming number of tickets on my front door. For being in violation of holiday décor. And I swear on Rudolph himself, one is for ‘unsportsmanlike Christmassing.’To top it all off, this Christmas cop looks like a red-headed elf.A sexy red-headed elf…One Night with a Nutcracker, Book 5My name is Jake Sheppard and I’m ambivalent about Christmas and the Christmas-themed town I grew up in. But when I find out my late uncle left me an old barn and acres of land, the decision to return home to build my dream golf course is an easy one. Imagine my surprise when I arrive and find out I have a squatter.An incredibly sexy squatter, with wavy blonde hair, green eyes, a free spirit… and a herd of goats.Lexi hates my guts. Apparently evicting a non-paying non-tenant and her goats weeks before Christmas is grounds for war.Except Lexi’s version of war includes flinging her clothing at me and, as it turns out, I might be in way over my head with this girl…The Bachelor on the Shelf, Book 6My name is Carter Sheppard and I actually like Christmas and my Christmas-themed hometown of Reindeer Falls. In fact, when I learn I have to return home in order to collect an inheritance—my uncle’s dog—it puts life into perspective for me.Sure, playing professional baseball is great. But it won’t last forever and every player needs a long-term game plan.And I just found mine. Wrapped up in the feisty, bespectacled package of the town librarian.Unfortunately, she thinks I’m a player in all aspects of the word, but I’ve got a plan to win her over. Starting with a fake engagement… Christmas in Reindeer Falls is more naughty than nice. These stories are over-the-top festive with merrily-ever-afters guaranteed. Novella length for quick holiday binge reading. Enjoy!",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Audiobook",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Small Town Romance"
  ],
  "author": "Jana Aston",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/58913494-the-reindeer-falls-collection"
}