{
  "title": "Always the Almost",
  "description": "A trans pianist makes a New Year's resolution on a frozen Wisconsin night to win regionals and win back his ex, but a new boy complicates things in Edward Underhill's heartfelt debut YA rom-dram, Always the Almost.Sixteen-year-old trans boy Miles Jacobson has two New Year’s resolutions: 1) win back his ex-boyfriend (and star of the football team) Shane McIntyre, and 2) finally beat his slimy arch-nemesis at the Midwest’s biggest classical piano competition. But that’s not going to be so easy. For one thing, Shane broke up with Miles two weeks after Miles came out as trans, and now Shane’s stubbornly ignoring him, even when they literally bump into each other. Plus, Miles’ new, slightly terrifying piano teacher keeps telling him that he’s playing like he “doesn’t know who he is”—whatever that means.Then Miles meets the new boy in town, Eric Mendez, a proudly queer cartoonist from Seattle who asks his pronouns, cares about art as much as he does—and makes his stomach flutter. Not what he needs to be focusing on right now. But after Eric and Miles pretend to date so they can score an invite to a couples-only Valentine’s party, the ruse turns real with a kiss, which is also definitely not in the plan. If only Miles could figure out why Eric likes him so much. After all, it's not like he’s cool or confident or comfortable in his own skin. He’s not even good enough at piano to get his fellow competitors to respect him, especially now, as Miles. Nothing’s ever been as easy for him as for other people—other boys. He’s only ever been almost enough.So why, when he’s with Eric, does it feel like the only person he’s ever really not been enough for...is himself?",
  "genres": [
    "Romance",
    "LGBT",
    "Young Adult",
    "Queer",
    "Contemporary",
    "Transgender",
    "Fiction"
  ],
  "author": "Edward  Underhill",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/58915924-always-the-almost"
}