{
  "title": "My Wild Highlander",
  "description": "Lady Angelique Drummagan, a half-Scottish, half-French countess, has suffered much pain and betrayal in her past. She wants nothing to do with the sensual Scottish warrior that the king has ordered her to marry because the rogue could never be a faithful husband, but she has little choice in the matter. Dangerous, greedy enemies threaten her from all sides and she’s in dire need of his protection. Sir Lachlan MacGrath, known as Seducer of the Highlands, possesses a charming wickedness and canny wit which has earned him much popularity. After the king decrees that he wed the fiery hellion in an arranged marriage, Lachlan discovers there is one woman who can resist him—Angelique. Can he break through her icy façade and melt her heart, or will the dark secrets lurking in her past not only cost them their future together, but their very lives? National Readers' Choice Award Winner \"My Wild Highlander was a great read.\" 5 Stars, Top Pick, Night Owl Reviews \"This author truly is a master of the written word and I look forward to reading her work for many years to come.\" Kindle Reader  After taking another corner too quickly, the coach drew to an abrupt halt and the door opened. Lachlan now held a torch aloft. \"Come, both of you. Hold this.\" He handed the torch to Rebbinglen. \"Where are we going?\" Angelique asked. \"No time for questions now.\" He motioned her forward. Again, he lifted Angelique into his arms and carried her across an alley as if she weighed no more than an infant. Amid the chaos, he seemed an island of strength and protection. She was finding, of a sudden, that she liked this feeling. She had not experienced true safety for a long time. And besides, he smelled appealing, like clean male blended with leather. In the torchlight, their gazes mingled for a moment. He was not the seductive charmer now. No twinkle of humor danced in his eyes, no smirk upon his lips. He'd transformed into a formidable warrior with a firm mouth and dark, indomitable eyes—a side of him she'd never fully seen. They slipped through a narrow doorway, Dirk carrying Camille behind them. \"What is this place?\" The scents of tallow and musty books irritated her nose. The passage opened up and they moved through a large dim church filled with empty pews. Only a couple of candles lit the plain interior. Five of King James's retainers wearing royal livery waited near the pulpit along with a dour Protestant minister. \"What is happening?\" Angelique asked. \"We are to be married, as you ken.\" Lachlan set her on her feet at the front of the church. She pulled him aside. \"Have you lost your mind? We cannot marry now. Not like this,\" she whispered loudly. \"Aye, 'tis necessary to marry in secret. Someone wishes to kill us. They are wanting your estate through any means, fair or foul.\" His harsh expression told her of the seriousness of the matter. \"King James bid us to go ahead and marry. Now. We have the special license.\" \"But I must wear my wedding gown and I did not bring it. I will not marry in my shift and a blanket. Barefoot.\" \"No time.\" Lachlan dragged her before the minister. \"Please begin.\" The Highland Adventure Series My Fierce Highlander My Wild Highlander My Brave Highlander My Daring Highlander My Notorious Highlander My Rebel Highlander My Captive Highlander Highlander Unbroken Highlander Entangled The Scottish Treasure Series Stolen by a Highland Rogue Defended by a Highland Renegade",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Medieval",
    "Scotland",
    "Fiction"
  ],
  "author": "Vonda Sinclair",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/12806986-my-wild-highlander"
}