{
  "title": "How to Be an Adult in Love: Letting Love in Safely and Showing It Recklessly",
  "description": "How to let love into our lives, and how to express that love to the world at large--the latest from a best-selling author.We were made to love and be loved. Loving ourselves and others is in our genetic code. It’s nothing other than the purpose of our lives—but knowing that doesn’t make it easy to do. We may find it a challenge to love ourselves. We may have a hard time letting love in from others. We’re often afraid of getting hurt. It is also sometimes scary for us to share love with those around us—and love that isn't shared leaves us feeling flat and unfulfilled. David Richo provides the tools here for learning how to love in evolved adult ways—beginning with getting past the barriers that keep us from loving ourselves, then showing how we can learn to open to love others. The first challenge is that we have a hard time letting love in: recognizing it, accepting it from others. We're afraid of it, of getting hurt. The second, related problem is that we're unable to share love with those around us--and love that isn't shared isn't truly love. The first step to learning to love and be loved, according to Richo's model, is to identify the different levels of love so that you can hit each one separately. He breaks it down to three:   • Level One: Positive Connection. As simple as being courteous, respectful, helpful, and honest, and decent in all our dealings. Pretty basic, but it makes the world a better place, and it's the essential foundation for growing in love.    • Level Two: Caring and Personal Connection. Intimacy and commitment to friends, family, partners, lovers. Commitment to others.    • Level Three: Unconditional and Universal. Transcending the love of individuals to the love of all beings; self-sacrificing. The love expressed in the Sermon on the Mount and the Bodhicharyavatara. This level of love isn't for a heroic few, it's everyone's calling. He then shows us how to incorporate these varieties of love into our lives. It's a relief to know that even just aspiring to incorporate them really changes things. He also provides exercises and guided meditations for identifying and getting through the things that keep you from getting and giving love at each of these three levels.Through the lens of these types of love, Richo covers topics such as: how to still be yourself while loving another; how to embrace your dark side; what to do when the one who loves you dies; need versus fear; clinging; healthy sexuality, including fantasies and how to experience pleasure without guilt; how to break distructive patterns in your relationships; and how to have safe conversations with your loved one.Richo provides wisdom from Buddhism, psychology, and a range of spiritual traditions, along with a wealth of practices both for avoiding the pitfalls that can occur in love relationships and for enhancing the way love shows up in our lives. He then leads us on to love’s inevitable outcome: developing a heart that loves universally and indiscriminately. This transcendent and unconditional love isn’t just for a heroic few, Richo shows, it’s everyone’s magnificent calling.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Relationships",
    "Psychology",
    "Personal Development",
    "Love",
    "Audiobook"
  ],
  "author": "David Richo",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/58930024-how-to-be-an-adult-in-love"
}