{
  "title": "The Wedding Dress Sewing Circle",
  "description": "Three plucky women lift the spirits of home-front brides in wartime Britain, where clothes rationing leaves little opportunity for pomp or celebration—even at weddings—in this heartwarming novel based on true events, from the bestselling author of The Chilbury Ladies' Choir.After renowned fashion designer Cressida Westcott loses both her home and her design house in the London Blitz, she has nowhere to go but the family manor house she fled decades ago. Praying that her niece and nephew will be more hospitable than her brother had been, she arrives with nothing but the clothes she stands in, at a loss as to how to rebuild her business while staying in a quaint country village.Her niece, Violet Westcott, is thrilled that her famous aunt is coming to stay—the village has been interminably dull with all the men off fighting. But just as Cressida arrives, so does Violet's conscription letter. It couldn't have come at a worse time; how will she ever find a suitably aristocratic husband if she has to spend her days wearing a frumpy uniform and doing war work?Meanwhile, the local vicar's daughter, Grace Carlisle, is trying in vain to repair her mother's gown, her only chance of a white wedding. When Cressida Westcott appears at the local Sewing Circle meeting, Grace asks for her help—but Cressida has much more to teach the ladies than just simple sewing skills.Before long, Cressida's spirit and ambition galvanizes the village group into action, and they find themselves mending wedding dresses not only for local brides, but for brides across the country. And as the women dedicate themselves to helping others celebrate love, they might even manage to find it for themselves.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "World War II",
    "Historical",
    "Audiobook",
    "Book Club"
  ],
  "author": "Jennifer    Ryan",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/58936392-the-wedding-dress-sewing-circle"
}