{
  "title": "Fallon",
  "description": "\"'A secret for a secret.' If I could give Fallon more than 5 stars I definitely would. J.L. Wyer writes an emotionally gripping story of a girl who is broken and lost.\" - Kelchick Book Blogger\n\"Fallon is the highly anticipated book 3 to the amazing Fallen Brook High School YA Romance Series!! It is one of the best YA series I have ever read.\" - Rita Book Addict Book BloggerMy name is Fallon Montgomery and I have a problem. That problem just landed on my front doorstep. Literally. My problem’s name is Elizabeth Fairchild. What is a guy to do when the girl he’s obsessed with comes to him for help?He kidnaps her. Well, not in the illegal sense, but hopefully you get my drift.How does that children’s fairytale go?This is the story of a girl and four boys.Elizabeth. Jayson. Julien. Ryder. And Fallon.Elizabeth may have fallen in love with my best friend, but that was before.Before her memories came back. Before she ran. Before she came to me. Before she asked for my help.Every fairytale needs a villain. Perhaps I’m the villain in Elizabeth’s love story.Reader’s Note: This part of the story deals with sensitive topics that may be triggering to some readers (discussions about physical abuse and self-harm). If you are sensitive to these topics, please proceed with caution.The Fallen Brook High School YA Romance Series is written by romance author Jennilynn Wyer under her pen name, J.L. Wyer. The Fallen Brook High School YA Romance Series is a reimagining of the adult Fallen Brook Series and is suitable for a Young Adult audience. It does contain some minor bad language and reference to underage drinking, intimacy, and certain social situations. Books 1, 2, and 3 end on a cliffhanger. The series ends with an HEA. Whoever Elizabeth finally chooses, I hope you enjoyed the unusual, unconventional friendship and love the five main characters shared.The Fallen Brook High School YA Romance Series#1 Jayson#2 Ryder#3 Fallon#4 Elizabeth#5 Hailey (standalone)",
  "genres": [],
  "author": "J.L. Wyer",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/58923685-fallon"
}