{
  "title": "galà: Adventures of the Most Well-Traveled Filipinos",
  "description": "What does it take to travel around the world? What surprises await you as you dream, discover and uncover your next great adventure?This book explores, for the first time, the Filipino wanderlust from the perspective of twenty of the most well-traveled Filipinos as they take you on their journeys around the world, sharing their colorful stories as well as their best travel tips and recommendations in a well-curated manner. It is as entertaining as much as it is informative. This travel book is like no other.If you’re looking for inspiration to re-ignite your love for travel during these unprecedented times, then this is what you’ve been waiting for.--------------------------------------------------------------------------------------------------------------------------------‘In this thoroughly-researched and lovingly written compendium, Donalito Bales Jr. does what has never been done before - celebrating a diverse group of people who share one thing their love of travel. Both a who's who and simultaneously an intimate portrait of the colourful traveller community of the Philippines, this unique book makes me wonder why there isn't such a guide to the travellers of every country. An absolute must!’- Harry Mitsidis, The World’s Most Traveled Person, founder of NomadMania, and author of ‘The Curious Case of William Baekeland’‘Galà is the ultimate introduction to who is who among Filipino hard-core travellers. The author has managed to piece together a treasure trove of exciting, inspiring, and sometimes outright scary experiences from outstanding storytellers with a variety of backgrounds. If their worldwide tales don't encourage you to hit the road, I don't know what will.’- Gunnar Garfors, 1st person to visit every country twice, multiple Guinness World Record holder, and author of ‘198: How I Ran Out of Countries’‘Inspiring! Masterfully written with a variety of gold nuggets on world travel experiences.’- Jhet Torcelino-van Ruyven, world traveler, speaker and bestselling author of ‘The Tale of You Have the Power to Change Your Life’",
  "genres": [
    "Travel"
  ],
  "author": "Donalito Bales Jr.",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/58927814-gal"
}