{
  "title": "This Is Not a Book About Benedict Cumberbatch: The Joy of Loving Something--Anything--Like Your Life Depends On It",
  "description": "Why We Can't Sleep meets Furiously Happy in this hilarious, heartfelt memoir about one woman's midlife obsession with Benedict Cumberbatch, and the liberating power of reclaiming our passions as we age, whatever they may be. Tabitha Carvan was a new mother, at home with two young children, when she fell for the actor Benedict Cumberbatch. You know the guy: strange name, alien face, made Sherlock so sexy that it became one of the most streamed shows in the world? The force of her fixation took everyone--especially Carvan herself--by surprise. But what she slowly realized was that her preoccupation was not about Benedict Cumberbatch at all, as dashing as he might be. It was about finally feeling passionate about something, anything, again at a point in her life when she had lost touch with her own identity and sense of self.In This Is Not a Book About Benedict Cumberbatch,  Carvan explores what happens to women's desires after we leave adolescence...and why the space in our lives for pure, unadulterated joy is squeezed ever smaller as we age. She shines a light onto the hidden corners of fandom, from the passion of the online communities to the profound real-world connections forged between Cumberbatch devotees. But more importantly, she asks: what happens if we simply decide to follow our interests like we used to--unabashedly, audaciously, shamelessly? After all, Carvan realizes, there's true, untapped power in finding your \"thing\" (even if that thing happens to be a British-born Marvel superhero) and loving it like your life depends on it.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Self Help",
    "Humor",
    "Fandom",
    "Pop Culture"
  ],
  "author": "Tabitha Carvan",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/58936417-this-is-not-a-book-about-benedict-cumberbatch"
}