{
  "title": "The Chaos Machine: The Inside Story of How Social Media Rewired Our Minds and Our World",
  "description": "From a New York Times investigative reporter and Pulitzer Prize finalist, “an essential book for our times” (Ezra Klein), tracking the high-stakes inside story of how Big Tech’s breakneck race to drive engagement—and profits—at all costs fractured the worldWe all have a vague sense that social media is bad for our minds, for our children, and for our democracies. But the truth is that its reach and impact run far deeper than we have understood. Building on years of international reporting, Max Fisher tells the gripping and galling inside story of how Facebook, Twitter, YouTube, and other social networks, in their pursuit of unfettered profits, preyed on psychological frailties to create the algorithms that drive everyday users to extreme opinions and, increasingly, extreme actions. As Fisher demonstrates, the companies’ founding tenets, combined with a blinkered focus maximizing engagement, have led to a destabilized world for everyone. Traversing the planet, Fisher tracks the ubiquity of hate speech and its spillover into violence, ills that first festered in far-off locales to their dark culmination in America during the pandemic, the 2020 election, and the Capitol Insurrection. Through it all, the social-media giants refused to intervene in any meaningful way, claiming to champion free speech when in fact what they most prized were limitless profits. The result, as Fisher shows, is a cultural shift toward a world in which people are polarized not by beliefs based on facts, but by misinformation, outrage, and fear. His narrative is about more than the villains, however. Fisher also weaves together the stories of the heroic outsiders and Silicon Valley defectors who raised the alarm and revealed what was happening behind the closed doors of Big Tech. Both panoramic and intimate, The Chaos Machine is the definitive account of the meteoric rise and troubled legacy of the tech titans, as well as a rousing and hopeful call to arrest the havoc wreaked on our minds and our world before it’s too late.",
  "genres": [
    "Nonfiction",
    "Technology",
    "Psychology",
    "Politics",
    "Sociology",
    "Audiobook",
    "Science"
  ],
  "author": "Max Fisher",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/58950736-the-chaos-machine"
}