{
  "title": "Are Women Human?: And Other International Dialogues",
  "description": "More than half a century after the Universal Declaration of Human Rights defined what a human being is and is entitled to, Catharine MacKinnon Are women human yet? If women were regarded as human, would they be sold into sexual slavery worldwide; veiled, silenced, and imprisoned in homes; bred, and worked as menials for little or no pay; stoned for sex outside marriage or burned within it; mutilated genitally, impoverished economically, and mired in illiteracy--all as a matter of course and without effective recourse? The cutting edge is where law and culture hurts, which is where MacKinnon operates in these essays on the transnational status and treatment of women. Taking her gendered critique of the state to the international plane, ranging widely intellectually and concretely, she exposes the consequences and significance of the systematic maltreatment of women and its systemic condonation. And she points toward fresh ways--social, legal, and political--of targeting its toxic orthodoxies. MacKinnon takes us inside the workings of nation-states, where the oppression of women defines community life and distributes power in society and government. She takes us to Bosnia-Herzogovina for a harrowing look at how the wholesale rape and murder of women and girls there was an act of genocide, not a side effect of war. She takes us into the heart of the international law of conflict to ask--and reveal--why the international community can rally against terrorists' violence, but not against violence against women. A critique of the transnational status quo that also envisions the transforming possibilities of human rights, this bracing book makes us look as never before at an ongoing war too long undeclared.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Essays",
    "Politics",
    "Law",
    "Philosophy",
    "Feminist Theory"
  ],
  "author": "Catharine A. MacKinnon",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/589530.Are_Women_Human_"
}