{
  "title": "Drowning in Fire (Volume 48)",
  "description": "Josh Henneha has always been a traveler, drowning in dreams, burning with desires. As a young boy growing up within the Muskogee Creek Nation in rural Oklahoma, Josh experiences a yearning for something he cannot tame. Quiet and skinny and shy, he feels out of place, at once inflamed and ashamed by his attraction to other boys. Driven by a need to understand himself and his history, Josh struggles to reconcile the conflicting voices he hears—from the messages of sin and scorn of the non-Indian Christian churches his parents attend in order to assimilate, to the powerful stories of his older Creek relatives, which have been the center of his upbringing, memory, and ongoing experience. In his fevered and passionate dreams, Josh catches a glimpse of something that makes the Muskogee Creek world come alive. Lifted by his great-aunt Lucille’s tales of her own wild girlhood, Josh learns to fly back through time, to relive his people’s history, and uncover a hidden legacy of triumphs and betrayals, ceremonies and secrets he can forge into a new sense of himself. When as a man, Josh rediscovers the boyhood friend who first stirred his desires, he realizes a transcendent love that helps take him even deeper into the Creek world he has explored all along in his imagination. Interweaving past and present, history and story, explicit realism and dreamlike visions, Craig Womack’s Drowning in Fire explores a young man’s journey to understand his cultural and sexual identity within a framework drawn from the community of his origins. A groundbreaking and provocative coming-of-age story, Drowning in Fire is a vividly realized novel by an impressive literary talent.",
  "genres": [
    "Fiction",
    "Indigenous",
    "LGBT",
    "Novels",
    "Queer",
    "Magical Realism",
    "Native American"
  ],
  "author": "Craig S. Womack",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/589425.Drowning_in_Fire_Volume_48_"
}