{
  "title": "Message in a Bullet",
  "description": "Raymond Mackey is a struggling crime writer. His friends call him Mack. But friends are in short supply these days. Mack’s thirty years as a homicide detective came to the kind of abrupt, ignominious end that tends to make friends dry up and blow away. It matters little that Mack was never actually a mole working for a shadowy, seemingly omnipresent mob boss. Somehow, the evidence was there anyway and the scandal ended everything for him overnight. Lucky to stay out of prison, Mack lives in a netherworld of forced retirement, spinning his memories of old homicide cases into pulp fiction and working part time as a shopping mall cop. His wife Marlo, the greatest criminal investigator Mack has ever known, has been dead of pancreatic cancer for nearly five years. That leaves his ancient Smith-Corona Corsair, a pack of Camels, a bottle of Old Forester, and Marlo’s bourbon-loving cat, Phil, as Mack’s only company. Almost. Because Mack also keeps himself company. The psychiatrists call it Depersonalization-Derealization Disorder. Mack calls it Triple-D. But crazy also works. It means he watches himself, usually from an overhead perspective, as though someone has tied a floating camera to a back beltloop on a long string. It makes him feel watched, and not by someone inclined to judge him kindly. So Raymond Mackey comes complete with his own Greek chorus. “Watch yourself, Mack,” people tell him. He has no choice.When one of Mack’s old informants goes missing and Mack’s face turns up in a dead man’s camera, his past comes roaring painfully back to life. Now the police want him for questioning, the mob want him dead and it’s increasingly difficult to tell who, exactly, is working for whom. As a mercilessly hot Chicago summer finally breaks and it starts to rain bodies, Mack finds himself past his prime for this kind of action. Retirement has added weight and subtracted agility. He hasn’t fired a weapon in years. His antiquated cell phone will not stop ringing with a mysteriously blocked number. In the end, as Mack watches himself from above, it is razor-sharp instinct, cheap consumer electronics and his dead wife that offer his only hope.",
  "genres": [
    "Novels"
  ],
  "author": "Owen Thomas",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/58950609-message-in-a-bullet"
}