{
  "title": "Ballad & Dagger",
  "description": "Best-selling author Rick Riordan presents Daniel José Older's music-and-magic-filled YA urban fantasy about two teens who discover each other and their powers during a political battle within a unique diaspora community.\n\n\"Brimming with mystery, mayhem, and heart, Ballad and Dagger gives us wondrous new magic steeped in deep traditions. It's a gorgeous romance, a wild adventure, and a powerful story that unravels not only the pain of diaspora, but the strength of community and the ways we provide refuge for one another.\"--Leigh Bardugo, New York Times #1 best-selling author of Shadow and BoneAlmost sixteen years ago, Mateo Matisse's island homeland disappeared into the sea. Weary and hopeless, the survivors of San Madrigal's sinking escaped to New York.While the rest of his tight-knit Brooklyn diaspora community dreams of someday finding a way back home, Mateo--now a high school junior and piano prodigy living with his two aunts (one who's alive, the other not so much)--is focused on one thing: getting the attention of locally-grown musical legend Gerval. Mateo finally gets his chance on the night of the Grand Fete, an annual party celebrating the blended culture of pirates, Cuban Santeros, and Sephardic Jews that created San Madrigal all those centuries ago.But the evil that sank their island has finally caught up with them, and on the night of the celebration, Mateo's life is forever changed when he witnesses a brutal murder by a person he thought he knew.Suddenly Mateo is thrust into an ancient battle that spans years and oceans. Deadly secrets are unraveled and Mateo awakens a power within himself--a power that not only links him to the killer but could also hold the key to unlocking the dark mystery behind his lost homeland.From the author of the award-winning Shadowshaper Cypher series comes the first novel in the Outlaw Saints duology--a brilliant story that will transport readers to a world where magic, myth, and gods reign over the streets of Brooklyn.Don't miss these other Rick Riordan Presents titles for all ages:Sal and Gabi Break the Universe by Carlos HernandezDragon Pearl by Yoon Ha LeeTristan Strong Punches a Hole in the Sky by Kwame MbaliaPaola Santiago and the River of Tears by Tehlor Kay Mejia",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Mythology",
    "Urban Fantasy",
    "Young Adult Fantasy",
    "Fiction",
    "Romance"
  ],
  "author": "Daniel José Older",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/58950848-ballad-dagger"
}