{
  "title": "Find Me in the Dark",
  "description": "She’d been running for so long, it felt like her legs were on fire. Her heart was pounding so hard, she was sure it would give out. Around her, the snow was falling, casting an eerie silence over the town. A crack behind her, a foot snapping a branch, it warned her that he was still coming. She whipped around and saw the knife gleaming in his hand…As the snow begins to melt across Plattsburgh, New York, the body of a young woman is found buried in a snowbank. When Detective Harlow Durant arrives at the scene she discovers that the victim has lain there for months: her arresting beauty, brightly-coloured nails and a distinctive gold bracelet perfectly preserved in the ice.Searching missing person reports, Harlow soon identifies the victim as college student Alyssa Trent. Her grieving family describe her as someone who had no enemies and was a dedicated student. But Alyssa’s tutor has a different view: they claim Alyssa had another life that she kept hidden. But who would want her dead?Harlow knows all about secret lives. She has spent years running from her past and from her father, a convicted serial killer. As the only female detective at the Bureau of Criminal Investigation, Harlow has vowed to bring killers to justice. Now she needs to find justice for Alyssa.When another female student is found in the thawing snow, Harlow knows that she is hunting a twisted killer. The victims knew each other but what dark secret connects them? With the small-town reeling in shock and more snow coming, Harlow knows she needs to stop a killer dead in their tracks before another innocent life is lost.From the bestselling author of Next Girl To Die comes an addictive crime thriller perfect for fans of Melinda Leigh, Kendra Elliot and Robert Dugoni’s Tracy Crosswhite series.",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "The United States Of America"
  ],
  "author": "Dea Poirier",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/58942529-find-me-in-the-dark"
}