{
  "title": "Angel In The Rain",
  "description": "After two years of finishing school, Angel Clayton is determined to redeem herself and become a lady like the mother she never knew. But her wild Texas legacy returns to haunt her when she finds herself the unwilling pawn in a battle of wills between her father's enemy and a sexy pistolero whose reputation makes hers look positively angelic.Rane Mantorres is a gunfighter with a big reputation and an even bigger score to settle. When he learns his enemy plans to kidnap a wealthy rancher's daughter, he foils the plot and kidnaps her himself. Now he must dare far more than he bargained as he's caught between his thirst for justice and a burning desire for his spirited hostage. Will he risk all--his revenge, even his life--for one night of unforgettable passion with an angel in the rain.*****“Where are you going, Angel?”He spoke softly, as he might to a child who’d accidentally picked up a loaded gun.“Home,” she replied with conviction. “I’m going home, Rane.”His gaze lifted, and the hard as flint expression she had come to recognize settled in his eyes. “I can’t let you do that.”Angel tried hard to mask the dread surging through her. “You can’t stop me this time.”Again, his dark eyes flickered over the Colt in her hand. “Do you intend to shoot me? If so, it might be easier if you cock the gun.”Was he daring her? Or trying to distract her? Perhaps both. Her pounding heart sped even more and echoed in her ears. Did she dare call his bluff?Deliberately, she lifted her other trembling hand to the wooden butt to steady it. She moved her thumb over the hammer and slowly levered it back. One click. Two. It seemed a long way, but it only brought the gun to half cock.Ticklish sweat seeped between her breasts. Her hands felt wet, slippery. She exerted more pressure, hoping, praying her thumb didn’t slip off the oily mechanism and let it discharge. Another sickening double click and the gun was fully cocked.Call and raise, Rane.With grim satisfaction, she watched him, gauging his reaction. The maddening smirk was still on his lips. He took a step forward.Rather than retreat, she lifted the gun higher and locked her elbows. “Stay back or, I swear, I’ll shoot.”He shook his head as he dared another step. “No. I don’t think you will. If you wanted me dead, I wouldn’t be standing here now.”“I started to leave you that first night.”“Then why didn’t you?”Because she was afraid he would die. Because she couldn’t bear the thought of him lying there, suffering and alone. Because she simply couldn’t bring herself to leave him... “I stayed with you. Took care of you. You owe it to me to let me go.”He canted his head, as if considering her words. “I thought you understood. There are men out there looking for you. Hard men. Men without conscience, who simply take what they want. You’re asking me to throw you to the wolves.”“I can make it through.”“No. When we leave here, we go together.”He moved toward her again, another slow, measured step. She whimpered, knowing he wouldn’t stop. He would never stop, not until he accomplished what he’d set out to do. Or until he was dead.Her finger twitched against the trigger. The instinctive reaction frightened her so badly sick panic flooded her stomach. She wanted to drop the gun, but couldn’t force herself to release her death grip on the accursed thing. He stood right in front of her, so close the end of the gun barrel prodded the center of his chest.",
  "genres": [
    "Western Romance",
    "Historical",
    "Historical Romance"
  ],
  "author": "Devon Matthews",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/12807760-angel-in-the-rain"
}