{
  "title": "Masks of Desire",
  "description": "Childhood sweethearts become forbidden lovers in this Shakespearean-esque second chance romance where secrets and lies throw two opposing families into turmoil.Romeo and Juliet, meet Henry and Caroline...Caroline Gardner has always had her very own white knight. Her childhood sweetheart, Henry Gardner, is handsome, kind, and passionately in love with her. Or so she believes, until one day she is told everything she knows about Henry is a lie. In an instant, their long-time engagement is broken and Caroline's world is shattered.Henry Gardner has been told that the girl he's loved all his life has cruelly betrayed him. But no matter what she may have done, his love for her will not dim. The only problem? She's about to marry someone else.\nLess than twenty-four hours until he’ll lose her for good...\nStealing an earl's bride on the eve of her wedding might be an insurmountable challenge for some men, but Henry is determined to make sure Caroline knows that forever is a promise he means to keep. Even if doing so comes at a perilous price.\nOne boy. One girl. One future they must fight for together.\nHer one true love may have returned, but after all he's put her through, Caroline has no intention of falling back into his arms. But when she stumbles onto a terrible family secret, Caroline must make a leap of faith and put her heart in the hands of the one man she swore she'd never trust again.\nBook Details\nPlease Note: Masks of Desire was previously released as a free short story of five-thousand words. This fifty-thousand-word-plus novel contains many revisions as well as new revelations and insights for readers of the Gardner Girls series. It may be read as a prequel or a final sequel to the series.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Adult",
    "Fiction",
    "Historical Fiction",
    "Regency"
  ],
  "author": "Fenna Edgewood",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/58946296-masks-of-desire"
}