{
  "title": "Fierce Love: Creating a Love that Lasts―One Conversation at a Time",
  "description": "New York Times bestselling author Susan Scott guides couples through eight must-have conversations to create a fierce love that stands the test of time and grows stronger over the years.Often in our romantic relationships, we long for deep connection, but we don't know how to communicate well and sometimes withhold what we're really thinking and feeling. This can lead to fighting, resentment, or, worse, complacency--where you are just going through the motions, more like roommates than two people in love. As Susan writes, \"It's as if we've pulled off our own wings.\" As couples, we don't stop to think how important our conversations are. And we certainly don't understand that what we talk about and how we talk about it determine whether our relationships will thrive, flatline, or fail.In Fierce Love, New York Times bestselling author Susan Scott guides couples through eight must-have conversations that lead to deep connection and lasting commitment. Through the use of true stories and hands-on exercises, Susan helps usunderstand that the conversation is the relationship;identify and dispel five relationship myths that mislead and derail us;learn eight conversations that are critical to enriching relationships; andstop fighting or ignoring issues and start connecting in a deep and meaningful way.After a season where many relationships were tested and tried, where some relationships thrived and others have exposed cracks couples didn't even realize were there, or realized but didn't acknowledge, now is the best time to learn to communicate well. By having honest, compelling conversations with our partners, we can foster true connection and a fierce love that will withstand the test of time and grow stronger over the years.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Relationships",
    "Inspirational",
    "Personal Development",
    "Productivity"
  ],
  "author": "Susan Scott",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/58944475-fierce-love"
}