{
  "title": "The Mountain of Marvels: A Celtic Tale of Magic, Retold from the Mabinogion",
  "description": "A thousand years ago, in the Celtic kingdoms of Wales, great lords gave great feasts for their fighting men and courtiers. In timbered halls, for days on end, heaps of meat and bread were washed down with gallons of beer and mead. And in between the meals, when bellies were stuffed and spirits high, the storyteller rose and spun his tales of times long past.He told of lords, bold and generous. He told of ladies, grand and glorious. He told of friends, brave and faithful. But of all he told about, no friend was more reliable than Manawydan, son of Llyr. No lady was more admirable than Rhiannon. And no lord was more honorable than Pwyll, King of Dyfed.The halls are now long gone -- yet some tales were written down and gathered in a book we call today The Mabinogion. And so the tales live on. . . .For ages 10 and up. Not illustrated!/////////////////////////////////////////////////Aaron Shepard is the award-winning author of \"The Baker's Dozen,\" \"The Sea King's Daughter,\" \"The Monkey King,\" and many more children's books. His stories have appeared often in Cricket magazine, while his Web site is known internationally as a prime resource for folktales, storytelling, and reader's theater. Once a professional storyteller, Aaron specializes in lively retellings of folktales and other traditional literature, which have won him honors from the American Library Association, the New York Public Library, the Bank Street College of Education, the National Council for the Social Studies, and the American Folklore Society./////////////////////////////////////////////////\"Highly recommended . . . . A brief yet exciting and exotic fable of heroes striving to make their mark and protect those most dear to them in a fantastic world.\" -- Children's Bookwatch (Midwest Library Review), Jan. 2007\"Written in a lyrical voice that channels the ghosts of storytellers past. . . . Great for a librarian or teacher to read to a class.\" -- Sheila Ruth, Wands and Worlds, Jan. 2007\"A clear, simple, beautiful retelling. Those familiar with the source material will recognise how masterly a piece of work Shepard has crafted from notoriously challenging material. . . . Best of all, the language has retained the full richness of the underlying Celtic music.\" -- Louise Owen, Celtic Cafe/////////////////////////////////////////////////SAMPLEThe next day, after the midday meal, Pwyll said to Manawydan, \"Let us walk again on the mount. But this time, we'll bring my horse along.\"So once more they climbed the mount. And they had not sat long when they saw the same lady, in the same dress and veil, on the same horse, on the same road, coming at the same slow, steady pace.Pwyll speedily mounted his horse, but as he reached the foot of the mount, she was already riding past the spot. Then he let his horse prance after, thinking to easily overtake her. When he did not, he gave his horse the rein. It began to trot, yet fell even farther behind. Then he spurred it to a gallop -- but at its greatest speed, it lost more ground than ever. And still the lady rode no faster than a walk.At last his horse began to fail, and he called out, \"Lady, in the name of the man you hold dearest, please halt.\"\"I will,\" she said. \"And for the sake of your horse, you could have asked it sooner.\"",
  "genres": [
    "Fantasy",
    "Fiction",
    "Mythology",
    "Folklore",
    "Picture Books",
    "Fairy Tales",
    "Ireland"
  ],
  "author": "Aaron Shepard",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/589481.The_Mountain_of_Marvels"
}