{
  "title": "A Royal Christmas Fairy Tale",
  "description": "From \"A holiday publishing darling\" (Entertainment Weekly) and Emmy Award-winning writer of Netflix's hit rom-com A Christmas Prince comes this heartwarming, feel-good Christmas romance about the power of believing in yourself to find your happily ever after...A charming Christmas village, a storybook castle, a royal ball, and a gorgeous prince are the last things New York City reporter Kaylie Karlyle expects to find on her holiday freelance assignment to Europe. But when the family she's interviewing turns out to be the royal family of Tolvania, Kaylie has a meltdown when the quirky queen wants her to write a Christmas fairy tale for the spunky, young princess. Kaylie must battle the princess's father, who doesn't trust the media, and her own insecurities about writing anything beyond the news.To spark inspiration for the fairy tale, the queen recruits the prickly Prince Alexander to show Kaylie the family's most spectacular royal holiday traditions. And sparks definitely fly when the only thing Kaylie and the prince agree on is that they're both more \"bah humbug\" than \"ho, ho, ho.\"But somewhere between sleigh rides and snow angels, merrymaking and mistletoe, upside-down Christmas trees, and a legendary Christmas crown, Kaylie and the prince open their hearts to Christmas and start believing in themselves and each other. It's a real-life fairy tale in the making until Kaylie discovers a secret about a royal Christmas heirloom that jeopardizes everyone's happily ever after. Can the magic of the season save this holiday happy ending?Bonus Content: Includes delicious royal Christmas recipes and holiday activities.A Royal Christmas Fairy Tale is an uplifting, inspiring Christmas romance that's filled with heart and hope and will appeal to fans of Debbie Macomber, Susan Mallery, and RaeAnne Thayne.",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Contemporary",
    "Fiction",
    "Contemporary Romance",
    "Chick Lit"
  ],
  "author": "Karen Schaler",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/58967713-a-royal-christmas-fairy-tale"
}