{
  "title": "Lone Wolf",
  "description": "TiffanyI know what I want and how I want it. My life is neat, orderly and all mapped out. I love the high octane, mile-a-minute hustle. My career as a stockbroker consumes me. I don’t mind because I’m great at what I do. Some days it’s like printing money. If I want something, I buy it. I work hard and party even harder.Then my grandmother dies, and I’m left reeling. Although Nana was eighty-nine, it still comes as a shock. There was a part of me that thought she would live forever. Maybe that same part thinks that I will live forever, too. All of a sudden, my life isn’t feeling as full anymore. I’ve changed. I find I want more. I want something different.My gran left me a little slice of heaven in the middle of nowhere. Okay, not quite nowhere; it borders the little town of Hope Ridge. I do something crazy. I give it all up and make a new start. This city girl is leaving the flashing lights and bustle. I’m going to build my dream home at the foot of the mountains, next to a crystal blue lake. Then I’m taking up horseback riding. I’m going to learn to smell the flowers. To admire the sunset. I’m going to pen that romance novel I’ve had sitting growing cobwebs in my head. It’s time to live my life for the first time…and I can’t wait.GraysonI was exiled by my pack over ten years ago. Why? Because I’m different and different is apparently bad. They are dead to me. I’m better off without them. I know the feeling is mutual.I built a cabin in the woods, away from humans…away from everyone and everything. Some might say I’m a hermit, but I like it just fine. The whole world can go to hell for all I care. I’ve carved out a place where I can just be. I’m at peace.That’s when she blunders onto my land. The silly human has a stupid piece of paper, insisting that I’m trespassing on her property. This city slicker is full of BS. I’m not listening to anything she has to say. I was kicked out once; it isn’t happening a second time. I know if I ignore her long enough, she’ll go away. This is no life for someone like her. Except, she doesn’t leave. Instead, she pitches a tent right outside my front door. It’s a stand-off…and I intend to win.Authors note: Lone Wolf is a standalone shifter romance. It features a sassy heroine who knows exactly what she wants. Pity there’s an ornery wolf shifter standing her way of getting it. Beware, this book contains super-hot, growly scenes and naughty language that will make you blush!",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Shapeshifters",
    "Romance"
  ],
  "author": "Charlene Hartnady",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/58967444-lone-wolf"
}