{
  "title": "Wyrmrider Boxed Set",
  "description": "You mess with this southern belle... and she'll ring yours all the way to dinner. Joni Campbell was raised on faith, family, and chicken fried steak. But when she falls under a dragon's curse she has only one option. She must seek her ancestors in the merkingdom of Fomoria. But is she the one who needs saving, or do they need her, curse and all, if they hope to save their world? Includes: Wyrmrider Ascending (Book 1) - Larger than dragons. Nastier than snakes. Terrifying as hell. The wyrms have escaped the void. They threaten the underwater mer-kingdom of Fomoria and the city of New Orleans. But are the wyrms the biggest threat to emerge from the void? Will Joni be able to tame the wyrms? It may be the only chance she has to take down the voidbringer. Wyrmrider Vengeance (Book 2) - Zombie sharks! What the...? When the animate zombie corpses, the newly crowned Fomorian Queen, Joni Campbell, has to find the caplata behind it all. Can she stop the sea-zombie apocalypse before the ocean falls or, worse, the pandemic spreads to the land? Wyrmrider Justice (Book 3) - Time traveling ghost-pirates... just when you thought you'd seen it all. These are more than cursed pirates aboard Jack Sparrow's Black Pearl. They are commanded by a caplata and they have their sights on more than Fomoria. They want to unmake the world. But how can Joni and the wyrmriders possibly stop them when everything the ghost-pirate fleet encounters gets absorbed into their world-devastating armada? Wyrmrider Academy (Book 4) - NEW ADVENTURE EXCLUSIVE TO THIS BOXED SET - With a new brood of wyrms coming of age more wyrmriders need to be trained. But as a half-human and an outsider, not all of the Fomorian Wyrmriders accept Joni's rule. Now, it's not a threat from without that threatens Fomoria but one from within. Can Joni and the wyrmriders quell the rebellion or will they depose her and unleash their plan to conquer the other Fomorian outposts and dominate the sea? The Fomorian Wyrmriders is a thrilling adventure into a world of mermaids with dragons, vampires, voodoo witches, and other supernatural threats. This one-of-a-kind boxed set dives into an enthralling world, includes time-travel, and is chalk full with action and suspense. It also includes an unlikely slow-burn romance between the heroine and a demigod. Readers of Theophilus Monroe's Druid Legacy met Joni Campbell before--but now she's coming into her own as a snarky, powerful, kick butt, heroine who rides sea dragons. If you like dragon fantasy books, this series adds an interesting spin on the dragon rider epic. And yes, there are vampires in these books.",
  "genres": [
    "Collections"
  ],
  "author": "Theophilus Monroe",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/58970197-wyrmrider-boxed-set"
}