{
  "title": "Within Obsession and Lies",
  "description": "Within Obsession and Lies is the sexy, action-packed first book in A Court of Gilt and Shadow Series by bestselling authors Stacy Jones and Harper Wylde.Power. Obsession. Lies.Other people dream of being special. They wouldn’t, if they knew what a nightmare it is.Arawyn would give anything to be ordinary and rid herself of the power that lives inside her. Dangerous and alluring, it’s caused nothing but pain and horror, making her the dark obsession of anyone who gets too close.After years of barely containing it, Arawyn thought she had control… until the night it bursts free and pulses like a beacon.As threats emerge from the shadows, each one more fixated on her than the last, she finds her life infiltrated by three mysterious men.A mafia boss, a psychopath, and a killer.Rathe, Viper, and Fear are much more than they seem. They taste of power and feel impossibly familiar. They call to her soul in a way she’s never experienced and might have answers to questions she’s been asking her entire life.But darkness and secrets surround them, ones covered in blood and mire.When the monsters stalking her endanger not only her power but her life, she’ll have to make a decision: take a risk and let these dangerous men in, or do what she’s always done—walk away and try to survive on her own.Trusting them would be a mistake. Yet, she may not have a choice.The monsters hunting her aren’t human and they’re out for blood. Rathe, Viper, and Fear might be her only chance of making it through this alive.There’s only one problem. They aren’t human either…From bestselling authors, Stacy Jones and Harper Wylde, comes a darkly seductive new series that blends romance, danger, and the supernatural into an unforgettable read.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Fae",
    "Romance",
    "Paranormal",
    "Fantasy Romance",
    "Paranormal Romance"
  ],
  "author": "Stacy  Jones",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/58974274-within-obsession-and-lies"
}