{
  "title": "That Girl: The Montgomerys",
  "description": "That Girl is a Contemporary Romance Writers 2021 Stiletto Finalist and a Chesapeake Romance Writers 2021 Rudy Finalist!I was that girl; the one from a broken home who lived on the poor side of town. He was that guy; NFL football quarterback and Mr. Popular. He told me he would never leave. He lied. Now he’s back. But I’m not that girl anymore.Aurora St. Claire is that girl. The one who excels at academics. The one from a broken home who lives on the bad side of town. The one with an alcoholic mother who couldn’t care less if she existed. The one with an abusive older sister who would give her bruises instead of hugs. The one who keeps to the shadows, trying not to be seen.Sometimes the best families are the ones you create, not the ones you are born into. Aurora never knows what a true family is like until she has one suddenly thrust upon her at the age of eighteen. It takes a single revelation from a stranger to change her life forever.Then, JD Hallstead comes barreling into her life. He is everything she never thought she wanted, but everything she craves. That is, until the day he destroys her and leaves her heart to burn to ashes in his wake. What is the adage? The flip side of love is hate. Well, her hate burns bright, and it has a name: Jackson Dillon Hallstead.JD Hallstead is that guy. The one who is Mr. Popular and Quarterback King of Highland High. The one voted class president and most likely to succeed. The one who girls go crazy over and guys want to be. The one with a controlling, abusive father who will go to any lengths to keep his son in check. The one with the secrets.Aurora is the girl JD has secretly crushed on for years. It takes a friend’s tragic death to bring Aurora and JD together. It takes JD’s secrets to tear them apart. Aurora tells JD everybody leaves. He promises her he never will.He lied.Now, JD will do anything, fight anyone, give up everything, to get Aurora back. Aurora said JD broke her heart. Who better than him to put it back together?But the thing about secrets is that they always come back to haunt you. The question is: How far will JD go to protect the woman he loves before those secrets destroy them all?Reader’s Warning: That Girl is an enemies-to-lovers, second chance romance with scorching heat that will melt your Kindle and enough twists and turns to keep you guessing what will happen next. It takes place after the conclusion of Broken Butterfly, Fallen Brook Series, Book 3. Even though the book can be read on its own, fans of the Fallen Brook Series will love seeing some of their favorite characters return! That Girl touches upon topics that may be triggering to some readers such as flashbacks to an attempted sexual assault, child neglect and abuse, and violence. The story also contains foul language and sex. Any sexual intimacy between the main characters is consensual. For these reasons, the book is recommended for readers aged 17+.",
  "genres": [
    "Romance",
    "Second Chance",
    "Second Chance Romance",
    "Sports",
    "Contemporary Romance",
    "Sports Romance",
    "Contemporary"
  ],
  "author": "Jennilynn Wyer",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/58958155-that-girl"
}