{
  "title": "Land of the Dead",
  "description": "Book 3 in the Stoker's Wilde series!Booklist on the first book in this series, Stoker's Wilde: \"Pass this volume on to readers who are hungry for more historical stories with a supernatural frame.\"Science and the supernatural collide in this terrifying tale of witches, reanimated corpses and spirits invading our world from beyond the grave.Bram Stoker and Oscar Wilde have returned to their lives in London after their adventures in the American West. Bram is managing a theatre and Oscar is rising to fame and planning his upcoming wedding when they are once again called upon to battle supernatural evil.Grief-crazed scientist Victor Mueller needs Bram’s unusual blood for his mad quest to bring his dead wife back to life, and he’ll resort to kidnapping to get it. Meanwhile, a young medium named Lorna Bow runs fake séances in London under the thumb of an abusive uncle. When her mother Endora returns, Lorna learns the truth: they come from a long line of witches, and soon Endora has awakened Lorna’s dormant powers.When the scientist and the witches combine forces, all Hell breaks loose. Long-dead souls find themselves back in the land of the living, and some of them have scores to settle with our heroes. But as Mueller’s ambition and her mother’s desire for vengeance against the men who imprisoned her become clear, Lorna soon finds herself questioning the morality of their work.Bram and Oscar must team up with American secret agent Cora Chase to protect all they hold dear. Only a mission into the Land of the Dead can stop Mueller and Endora from bringing back more souls.Bram’s wife Florence must call on the monster-fighting skills she honed in America, and even Oscar’s bride Constance has to face new challenges as she learns how the supernatural has shaped her own history.In an adventure that spans continents – and even other worlds – they confront old enemies and unknown dangers. Teaming up with old friends Teddy Roosevelt and Richard Burton and new allies like Arthur Conan Doyle and Nicola Tesla, they too must harness both science and magic to protect our world from intruders from the Land of the Dead.",
  "genres": [
    "Horror",
    "Vampires",
    "Paranormal"
  ],
  "author": "Steven Hopstaken",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/58962953-land-of-the-dead"
}