{
  "title": "The Lost Book of Eleanor Dare",
  "description": "Based on real history and alternating between the story of war widow Alice searching for identity in the 1940s and excerpts from Eleanor Dare’s Commonplace Book and the tale of her harrowing survival, The Lost Book of Eleanor Dare explores the meaning of female history and the sacrifices every mother makes for her daughter.\n\nThe fate of the world is often driven by the curiosity of a girl.\nIn 1937, a large stone covered in strange markings made headlines. Scholars quickly determined it was a message written hundreds of years ago and signed by “EWD,” presumably Eleanor White Dare, the daughter of the colonial governor of Roanoke. The entire Roanoke colony had vanished in the late sixteenth century and \"The Dare Stone,\" as it came to be called, seemingly revealed the sorry fate of the colonists as well as that of Eleanor, who miraculously survived.War widow Alice Young knew the secret of the Dare Stone long before the carved rock became frontpage news because the stone had sat, for centuries, at Evertell, her family’s estate outside of Savannah, until it disappeared during the summer she turned thirteen. The story of Eleanor Dare’s miraculous survival is Young family lore, long preserved in both a singsong verse Alice learned as a child and in a book passed down through the generations of women descended from Eleanor and her daughter, Agnes. Alice had been next in line to receive the book that long-ago summer, but everything changed when the stone and book vanished. Her mother became gripped by a mania that hurtled her toward a tragic death, and rambling old Evertell, a too-painful reminder for Alice’s father, was abandoned and sold and they moved away.When her father dies, Alice, now thirty-two, learns that Evertell was never sold and the deed to it is hers. Her own thirteen-year-old daughter, Penn, is enamored with the idea of exploring the family history she never knew she had, and Alice decides they will visit the estate just long enough to sell it and start over. But soon Alice learns that leaving one’s past behind isn’t nearly as important as embracing one’s truth.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Audiobook",
    "Historical",
    "Books About Books",
    "Family"
  ],
  "author": "Kimberly Brock",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/58983785-the-lost-book-of-eleanor-dare"
}