{
  "title": "Deep Tech and the Amplified Organisation: How to elevate, scale and amplify your business through the New 4Ps of platforms, purpose, people and planet",
  "description": "Deep technology is changing our world. The challenge is how to adapt.A new digital economy is emerging, driven by advances in artificial intelligence, quantum computing and biotechnology. The challenge now for businesses and organisations is to understand how to reach their full potential by integrating their strategy, platform, digital operations, human resources and deep analytical capabilities into a single systemic operating model.Deep Tech and the Amplified Organisation is an indispensable guide for leaders, designers, technologists, entrepreneurs and changemakers who are seeking to rise to the challenge of creating transformation that matters. The book introduces a visual and systemic blueprint of the amplified organisation which aligns and integrates platform capabilities, digital systems and data analytics with an organisation’s strategy, value proposition and digital operating model.The result is a transdisciplinary approach to Deep Tech that integrates innovative and new approaches to enterprise architectures, design methodologies and purpose-driven leadership which enables organisations to become future-fit by: Amplifying business through the New 4Ps framework of platforms, purpose, people and planet; Designing scalable platform-based business models and elevated value propositions; Creating open, networked and highly extensive platform architectures; Achieving organisational agility through implementing a systemic approach to strategy; Capturing the power of data through deep sensemaking and networked intelligence; Engaging people meaningfully though deeper customer and employee experiences; and Integrating universal human values into organisational culture, ecosystem relationships and leadership consciousness.This book has the key to revolutionise the way you do business and allow you to thrive in the most technologically important era since the industrial revolution. Read Deep Tech and the Amplified Organisation today and start adapting now to the new business environment.",
  "genres": [
    "Business"
  ],
  "author": "Simon Robinson",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/58987673-deep-tech-and-the-amplified-organisation"
}