{
  "title": "Dele Weds Destiny",
  "description": "The story of three once-inseparable college friends in Nigeria who reunite in Lagos for the first time in thirty years--a sparkling debut novel about mothers and daughters, culture and class, sex and love, and the extraordinary resilience of female friendship.Funmi, Enitan, and Zainab first meet at university in Nigeria and become friends for life despite their differences. Funmi is beautiful, brash, and determined; Enitan is homely and eager, seeking escape from her single mother's smothering and needy love; Zainab is elegant and reserved, raised by her father's first two wives after her mother's death in childbirth. Their friendship is complicated but enduring, and over the course of the novel, the reader learns about their loves and losses. How Funmi stole Zainab's boyfriend and became pregnant, only to have an abortion and lose the boyfriend to police violence. How Enitan was seduced by an American Peace Corps volunteer, the only one who ever really saw her, but is culturally so different from him--a Connecticut WASP--that raising their daughter together put them at odds. How Zainab fell in love with her teacher, a friend of her father's, and ruptured her relationship with her father to have him.Now, some thirty years later, the three women are reunited for the first time, in Lagos. The occasion: Funmi's daughter, Destiny, is getting married. Enitan brings her American daughter, Remi. Zainab travels by bus, nervously leaving her ailing husband in the care of their son. Funmi, hosting the weekend with her wealthy husband, wants everything to go perfectly. But as the big day approaches, it becomes clear that something is not right. As the novel builds powerfully, the complexities of the mothers' friendship--and the private wisdom each has earned--come to bear on a riveting, heartrending moment of decision. Dele Weds Destiny is a sensational debut from a dazzling new voice in contemporary fiction.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Africa",
    "Literary Fiction",
    "African Literature",
    "Audiobook",
    "Nigeria"
  ],
  "author": "Tomi Obaro",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/58985535-dele-weds-destiny"
}