{
  "title": "Taming Her Highland Legend",
  "description": "The hottest fires meld the most indestructible bonds.When a 21st century woman struggling with anger management clashes with a 13th century Highlander who considers himself invincible, passionate infernos ignite.“Take thirty days off or you’re fired.” To 21st century Dr. Evie Wortham, confirmed Londoner and obsessively driven surgeon; her hospital’s ultimatum of thirty days leave in the calming wilderness of the Scottish Highlands so she can get a handle on her anger issues means one thing: unbearable boredom. But she agrees out of pity for her best friend who Human Resources nominated to pass out the punishment. That and the fact that she did massively overstep her bounds this time—even by her standards. So, she heads to her friend’s cottage on the outskirts of Inverness for a month of hiking, biking, and becoming one with nature. But a climb behind a waterfall to rescue a kitten with an odd fondness for water permanently strikes the word boredom from her vocabulary. Instead of finding the cat when she emerges on the other side, she discovers a man with a bloody gash in his head floating face down in the pool below.When Chieftain Quinn MacTaggart opens his eyes to the lovely, but strangely dressed Englishwoman, he’s certain the enemy has captured him. He’d put nothing past Edward I’s arrogance and determination to break Scotland, especially after the sacking of Berwick. But when the sharp-tongued lass turns out to be an extraordinary healer and confesses England has banished her, honor demands he not only offer her the protection of his clan, but the added safety of taking his name. After all, she did save his life. And not only is she fearless, canny, and filled with fire, but bonny as a prize filly. What better choice for a wife? The arrangement could serve them both.Finding herself trapped in 13th century Scotland, Evie has no choice but to accept Quinn’s offer of protection. While she had always thought to marry for love, marrying to stay alive seems a good enough reason, too. What she didn’t count on was falling in love. Or how hard it would be to hide the truth of her past from Quinn. And then there’s the assassin intent on killing her new husband. Who knew there could be so many obstacles to wedded bliss?\nLooking for a romantic page turner that will make you laugh, cry, and stay up entirely too late to find out what happens? Then this Scottish historical time travel romance by award-winning author Maeve Greyson is the one for you. Alpha male Highlanders, fiercely independent females, and loves that ignore the boundaries of time. Escape to the Highlands. Leave reality behind!",
  "genres": [
    "Time Travel",
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Paranormal",
    "Scotland"
  ],
  "author": "Maeve Greyson",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/58980266-taming-her-highland-legend"
}