{
  "title": "Tracy Flick Can't Win",
  "description": "Soon to be a major motion picture starring Reese Witherspoon“Tom Perrotta is…one of the great writers that we have today. I love this book.” —Harlan CobenAn “engrossing and mordantly funny” ( People ) novel about ambition, coming-of-age in adulthood, and never really leaving high school politics behind—featuring New York Times bestselling author Tom Perrotta’s most iconic character of all time.Tracy Flick is a hardworking assistant principal at a public high school in suburban New Jersey. Still ambitious but feeling a little stuck and underappreciated in midlife, Tracy gets a jolt of good news when the longtime principal, Jack Weede, abruptly announces his retirement, creating a rare opportunity for Tracy to ascend to the top job.Energized by the prospect of her long-overdue promotion, Tracy throws herself into her work with renewed zeal, determined to prove her worth to the students, faculty, and School Board, while also managing her personal life—a ten-year-old daughter, a needy doctor boyfriend, and a burgeoning meditation practice.But nothing ever comes easily to Tracy Flick, no matter how diligent or qualified she happens to be. Her male colleagues’ determination to honor Vito Falcone—a star quarterback of dubious character who had a brief, undistinguished career in the NFL—triggers memories for Tracy and leads her to reflect on the trajectory of her own life. As she considers the past, Tracy becomes aware of storm clouds brewing in the present. Is she really a shoo-in for the principal job? Is the Superintendent plotting against her? Why is the School Board President’s wife trying so hard to be her friend? And why can’t she ever get what she deserves?A sharp, darkly comic, and pitch-perfect chronicle of the second act of one of the most memorable characters of our time, Tracy Flick Can’t Win “delivers acerbic insight about frustrated ambition” ( Esquire ).",
  "genres": [
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Humor",
    "Literary Fiction",
    "Adult Fiction",
    "Novels"
  ],
  "author": "Tom Perrotta",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/58977852-tracy-flick-can-t-win"
}