{
  "title": "Walk the Vanished Earth",
  "description": "In the tradition of Station Eleven, Severance and The Dog Stars, a beautifully written and emotionally stirring dystopian novel about how our dreams of the future may shift as our environment changes rapidly, even as the earth continues to spin.The year is 1873, and a bison hunter named Samson travels the Kansas plains, full of hope for his new country. The year is 1975, and an adolescent girl named Bea walks those very same plains; pregnant, mute, and raised in extreme seclusion, she lands in an institution, where a well-meaning psychiatrist struggles to decipher the pictures she draws of her past. The year is 2027 and, after a series of devastating storms, a tenacious engineer named Paul has left behind his banal suburban existence to build a floating city above the drowned streets that were once New Orleans. There with his poet daughter he rules over a society of dreamers and vagabonds who salvage vintage dresses, ferment rotgut wine out of fruit, paint murals on the ceiling of the Superdome, and try to write the story of their existence. The year is 2073, and Moon has heard only stories of the blue planet--Earth, as they once called it, now succumbed entirely to water. Now that Moon has come of age, she could become a mother if she wanted to-if only she understood what a mother is. Alone on Mars with her two alien uncles, she must decide whether to continue her family line and repopulate humanity on a new planet. A sweeping family epic, told over seven generations, as America changes and so does its dream, Walk the Vanished Earth explores ancestry, legacy, motherhood, the trauma we inherit, and the power of connection in the face of our planet's imminent collapse. This is a story about the end of the world--but it is also about the beginning of something entirely new. Thoughtful, warm, and wildly prescient, this work of bright imagination promises that, no matter what the future looks like, there is always room for hope.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "Fantasy",
    "Speculative Fiction",
    "Adult",
    "Post Apocalyptic"
  ],
  "author": "Erin    Swan",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/58988398-walk-the-vanished-earth"
}