{
  "title": "The Coven of Deeds",
  "description": "Following the mysterious disappearance of her mother. Maya, a determined and clever Scottish teenager, discovers the strange truth behind her mother's double life as a witch. Now, under the often less than helpful guidance, of her know-it-all cat Mischief, she sets out on an epic adventure to rescue her mum, from a trap like no other. Enlisting the help of another young witchling, Evaline and some very special magical friends along the way, she must pass increasingly challenging initiation tests, to join the fearsome Coven of Deeds in order to secure her mother's release. All is not what it seems however, someone is out to thwart her at every turn. Who can Maya really trust? When her mysterious foe is finally revealed, and the breath-taking extent of the ingenious deception is revealed. One question still remains unanswered... what could have driven them to such extreme measures? The answer, when it comes, is more devastating for Maya and her friends than anyone could have imagined. Their fate and perhaps even the existence of magic itself, is under threat. Now, forced to flee by a seemingly invincible foe, they are led to Threave Castle. An ancient family residence, where the whole story is finally revealed and Maya must face the ultimate test of her courage and wits.Be warned, this is a highly original, imaginative and surprising adventure, an emotional rollercoaster of a book. Maya faces more challenges and unexpected plot twists and turns, than a fat hamster, stuck in a treacle filled labyrinth, complete with hidden trap doors and the occasional crocodile thrown in, just for fun. If you like a fast moving, original and surprising mystery, with a good heart, positive values and a quirky sense of humour, then congratulations, you've just found a hidden gem. If not, consult your doctor and check for a pulse. Most physicians advise at least two chapters every night, before bedtime. Excessive indulgence can lead to over excitement, so please read responsibly!",
  "genres": [
    "Fantasy"
  ],
  "author": "Malcolm McCoard",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/58990727-the-coven-of-deeds"
}