{
  "title": "The Family Roe: An American Story",
  "description": "Finalist for the 2022 Pulitzer Prize for General NonfictionFinalist for the J. Anthony Lukas Book PrizeFinalist for the National Book Critics Circle Award for NonfictionOne of NPR's Best Books of 2021A New York Times Notable Book of 2021One of TIME's 100 Must-Read Books of 2021\"The scope is sweeping, the writing is beautiful. It’s an epic story worthy of the impact this one case has had on the American psyche.\" —Michel Martin, NPR\"Stupendous…. If you want to understand Roe more deeply before the coming decision, read it.\" —Peggy Noonan, Wall Street JournalA masterpiece of reporting on the Supreme Court’s most divisive case, Roe v. Wade, and the unknown lives at its heart.Despite her famous pseudonym, “Jane Roe,” no one knows the truth about Norma McCorvey (1947–2017), whose unwanted pregnancy in 1969 opened a great fracture in American life. Journalist Joshua Prager spent hundreds of hours with Norma, discovered her personal papers—a previously unseen trove—and witnessed her final moments. The Family Roe presents her life in full. Propelled by the crosscurrents of sex and religion, gender and class, it is a life that tells the story of abortion in America.Prager begins that story on the banks of Louisiana’s Atchafalaya River where Norma was born, and where unplanned pregnancies upended generations of her forebears. A pregnancy then upended Norma’s life too, and the Dallas waitress became Jane Roe.Drawing on a decade of research, Prager reveals the woman behind the pseudonym, writing in novelistic detail of her unknown life from her time as a sex worker in Dallas, to her private thoughts on family and abortion, to her dealings with feminist and Christian leaders, to the three daughters she placed for adoption.Prager found those women, including the youngest—Baby Roe—now fifty years old. She shares her story in The Family Roe for the first time, from her tortured interactions with her birth mother, to her emotional first meeting with her sisters, to the burden that was uniquely hers from conception.The Family Roe abounds in such revelations—not only about Norma and her children but about the broader “family” connected to the case. Prager tells the stories of activists and bystanders alike whose lives intertwined with Roe. In particular, he introduces three figures as important as they are feminist lawyer Linda Coffee, who filed the original Texas lawsuit yet now lives in obscurity; Curtis Boyd, a former fundamentalist Christian, today a leading provider of third-trimester abortions; and Mildred Jefferson, the first black female Harvard Medical School graduate, who became a pro-life leader with great secrets.An epic work spanning fifty years of American history, The Family Roe will change the way you think about our enduring American the right to choose or the right to life.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Feminism",
    "Biography",
    "Audiobook",
    "Law"
  ],
  "author": "Joshua Prager",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/58977846-the-family-roe"
}