{
  "title": "Deadly Thanksgiving",
  "description": "The Foster sisters had inherited Grizzly Gulch Guest Ranch at an age when most sensible women contemplated retirement. No one ever called them sensible.In Book 2 of The Senior Sleuth Mystery Series, events manager Clara Foster must ensure the success of a week-long getaway for lonely retirees—a Boomers' Thanksgiving Festival. Too bad the arrival of a mini-coach loaded with tipsy seniors gets the event off to a shaky start, especially when one of the guests turns out to be a corpse. Worse, the Mountie assigned to the case is none other than one Hawk McDougall, the man Clara dumped via text message.Tensions mount when the death appears to be deliberate and the prime murder suspect is Clara’s cousin.As more suspects emerge, mysterious “accidents” force Clara to join forces (and possibly more) with Hawk to find a killer on the rampage.Non-stop action bounces from a cantankerous cat named Snuggles to an unfortunate goat yoga incident, a perilous nature walk to a mechanical bull gone rogue, a disastrous wardrobe malfunction to a spitting llama, all culminating in a memorable takedown followed by a Thanksgiving feast the guests will never forget. This book may contain nuggets of naughty boomer humor.EXCERPTBy then, the purple mini-coach was hurtling toward us at warp speed. Off-key singing and screeches of laughter floated out into the crisp, bright October air.“What’s that driver doing? I hope he doesn’t take out our hydro post—whoa!” Sudden fear laced Abby’s voice. “He’s heading straight for us. Watch out!” She pushed me behind a concrete pillar supporting the loading area portico.I closed my eyes and waited for sudden death. Would I see a white light or what?The squeal of brakes and the acrid stench of burning rubber signaled the vehicle had screeched to a halt in front of our entrance.With great caution, I opened my eyes and blinked. Swimming into my field of vision was a picture adorning the mini-coach’s purple side panel. It showed a white-haired couple, matured to perfection, displaying alarmingly white teeth and suspiciously few wrinkles. Ornate pink lettering announced Lifestyle Manor Retirement Retreat . Yeah, the last guests had arrived.Abby eyed the picture and snickered. “I bet that couple’s about to enjoy some afternoon delight. I hope he remembered his Viagra.” Every now and again, my sister proved she owned a sense of humor.Finally relaxing into the unseasonably warm breeze, I released a shaky laugh. “I can’t wait to meet the passengers. They sound enthusiastic.”Every window on the mini-coach was open. Slurred voices belted out an off-key rendition of Ding Dong! The Witch is Dead from The Wizard of Oz .Abby grimaced. “More like royally hammered, if you ask me.”",
  "genres": [],
  "author": "Maureen Fisher",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/58980625-deadly-thanksgiving"
}