{
  "title": "American Royalty",
  "description": "In this dangerously sexy rom-com that evokes the real-life romance between Prince Harry and Duchess Meghan Markle, a prince who wants to live out of the spotlight falls for a daring American rapper who turns his life, and the palace, upside down.Sexy, driven rapper Danielle “Duchess” Nelson is on the verge of signing a deal that’ll make her one of the richest women in hip hop. More importantly, it’ll grant her control over her life, something she’s craved for years. But an incident with a rising pop star has gone viral, unfairly putting her deal in jeopardy. Concerned about her image, she’s instructed to work on generating some positive publicity… or else.A brilliant professor and reclusive royal, Prince Jameson prefers life out of the spotlight, only leaving his ivory tower to attend weddings or funerals. But with the Queen’s children involved in one scandal after another, and Parliament questioning the viability of the monarchy, the Queen is desperate. In a quest for good press, she puts Jameson in charge of a tribute concert in her late husband’s honor. Out of his depth, and resentful of being called to service, he takes the advice of a student. After all, what’s more appropriate for a royal concert than a performer named “Duchess”?Too late, Jameson discovers the American rapper is popular, sexy, raunchy and not what the Queen wanted, although he’s having an entirely different reaction. Dani knows this is the good exposure she needs to cement her deal and it doesn't hurt that the royal running things is fine as hell. Thrown together, they give in to the explosive attraction flaring between them. But as the glare of the limelight intensifies and outside forces try to interfere, will the Prince and Duchess be a fairy tale romance for the ages or a disaster of palatial proportions?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "Audiobook",
    "Adult",
    "Interracial Romance"
  ],
  "author": "Tracey Livesay",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/58986617-american-royalty"
}