{
  "title": "If Only in My Dreams",
  "description": "'Tis the season to … be freshly divorced at twenty-six and moving back into your parents' house?Because that’s my reality this Christmas. As if it isn’t bad enough that my entire hometown is buzzing with the news of my failed marriage, who is the first person I bump into at the grocery store? The guy who treated me like his personal booty call in high school just happens to be looking at spices while I’m trying to pick up cinnamon for my mother.And get this; Porter Kelly, the broody, mysterious recluse who exposed his own secrets to the world by writing a book about his family years ago, is the one who acts like I wronged him. His rude remarks on aisle nine are the final straw as my exhausted unhappiness breaks, and I’m officially calling off the most wonderful time of the year.Too bad it’s literally impossible for the woman whose parents own a railroad that specializes in Christmas train rides to ignore the holiday season. Because I’m back under their roof, it’s mandatory to work in the middle of the red and green merriment, Santa himself, and wait for it …Porter serenading us with the greatest festive hits of all time. That’s right, apparently my teenage heartthrob turned nemesis not only works for my parents, but can strum a guitar like he’s trying to get every soccer mom on board pregnant. As we’re forced to spend more time together than ever, his past baggage and my marital rejection make their way to the surface, bonding us in ways neither of us knew possible.I thought I was heartbroken about my ex-husband wanting to end our marriage, but that pain is nothing compared to what Porter could inflict. He seems like a changed man, one on the precipice of a new chapter, which is exactly where I find myself. Would it be crazy to think we could turn the page together?Returning home was the only option I had. But as I come dangerously close to counting on the first man who broke my heart, I wonder if all of my future dreams are too good to be true.",
  "genres": [
    "Christmas",
    "Enemies To Lovers",
    "Romance",
    "Second Chance",
    "Second Chance Romance",
    "Holiday",
    "Contemporary"
  ],
  "author": "Carrie Aarons",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/58990463-if-only-in-my-dreams"
}