{
  "title": "21st Century Monetary Policy: The Federal Reserve from the Great Inflation to COVID-19",
  "description": "The winner of the 2022 Nobel Prize in Economics and former chair of the Federal Reserve explains the transformation of one our most powerful and consequential institutions.In response to the COVID-19 pandemic, the Federal Reserve deployed an extraordinary range of policy tools that helped prevent the collapse of the financial system and the U.S. economy. Chair Jerome Powell and his colleagues lent directly to U.S. businesses, purchased trillions of dollars of government securities, pumped dollars into the international financial system, and crafted a new framework for monetary policy that emphasized job creation. These strategies would have astonished Powell’s late-20th-century predecessors, from William McChesney Martin to Alan Greenspan, and the advent of these tools raises new questions about the future landscape of economic policy. In 21st Century Monetary Policy , Ben S. Bernanke―former chair of the Federal Reserve and one of the world’s leading economists―explains the Fed’s evolution and speculates on its future. Taking a fresh look at the bank’s policymaking over the past seventy years, including his own time as chair, Bernanke shows how changes in the economy have driven the Fed’s innovations. He also lays out new challenges confronting the Fed, including the return of inflation, cryptocurrencies, increased risks of financial instability, and threats to its independence. Beyond explaining the central bank’s new policymaking tools, Bernanke also captures the drama of moments when so much hung on the Fed’s decisions, as well as the personalities and philosophies of those who led the institution.",
  "genres": [
    "Economics",
    "History",
    "Finance",
    "Nonfiction",
    "Business",
    "Politics",
    "Money"
  ],
  "author": "Ben S. Bernanke",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/58999217-21st-century-monetary-policy"
}