{
  "title": "All Worlds Wayfarer: Issue 10",
  "description": "Explore Evocative Imagined RealitiesAll Worlds Wayfarer is a quarterly literary magazine specializing in character-and-theme-driven speculative fiction. We celebrate stories that take readers on tours through wonderful and terrifying realms, evocative visions, and eye-opening new lives. When our readers come home, they should return ever so slightly changed for having made the journey. After all, the most powerful stories transcend, enlighten, and entertain at once.“Books give a soul to the universe, wings to the mind, flight to the imagination, and life to everything.” -PlatoOur autumnal equinox 2021 issue includes 15 stories spanning the speculative fiction spectrum:Biological Conflict by K.T. Roth\"I was born shortly before my eighteenth birthday, and I'll die soon, a decrepit man at thirty-five.\"The Meaning of Isolation by Josh Warriner\"On that day, he was afraid, perhaps terrified, of what it really meant to be alone.\"The Lady of Rêver by Shelby Cohen\"Rêver and all her secrets now belong to me.\"Ascension by Gwen Montealto\"Other churches didn't need to feed their gods.\"After Death by Elizabeth Davis\"She remembered her own sleepover rumors whispered under the radio, of poor drowned Ophelia.\"Terrible Tilly Hunts the Cadborosaurus by Laurel Beckley\"There were rules. She needed a living monster. Actual, undeniable proof that the cadborosaurus existed.\"Dead Eyes by M.E. Proctor\"Maybe evil spirits get impatient, just like us.\"A Simulation by Philip Charter\"Going one level deeper was surely the key to exponential human potential.\"Riding with Euripides by Laura J. Campbell\"'A lot of truth can be found in nothingness,' Sarah replied to the ghost.\"Blood Brothers by Tom Howard\"'You're too young to remember what vampires are really like.'\"Widow's Walk by Shannon Frost Greenstein\"We chose the house, but the widow's walk chose me.\"Joy Ride by Rowan Rook (Kindle Edition Bonus Story)\"'There are bloodstains in the back. Didn't think they were still fresh.'\"Upper G by Maya Djurisic\"The voice sounds like yours, and so you obey.\"What Ye Sow by Joshua Keown\"We wonder how he'd react if we were to tell him that these superstitious rituals are worthless.\"The Necromancer's Husband by Ali LaForce\"Since then, Necromancy began creeping into respectability inch by inch, along with the steam engine train and dresses short enough to reveal women’s ankles.\"Venture beyond the mundane with the best of fantasy, science fiction, horror, and magical realism with this especially haunting issue.",
  "genres": [],
  "author": "Rowan Rook",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/59007960-all-worlds-wayfarer"
}