{
  "title": "Sex While Camping is in Tents: Love Me Ten Times",
  "description": "Get cozy with promiscuous, bisexual, horny Glenda Love in her first smut collection in a single edition! Get off on fem-led sexual adventures with couples, threesomes, foursomes, orgies, outdoor exhibitionism, voyeurism and cannabis freedom in Cascadia, in an era of less surveillance, inspired by true stories.A Hot Night with a Cool Lover (previously entitled “Two”): Glenda finds herself pursued by a hot musician. Everyone is aroused. How far will the dirty dancers go? How many men does Glenda kiss? No shame, no regrets, just pure, vibrant loving and sex.Hot! Hot! Hot!: Glenda arrives at a reggae festival on her own, but is quickly surrounded by horny lovers. Dive into her psychedelic mind and ride waves of pleasure into the infinite cosmos of love, blurring lines of fantasy and reality. How does Glenda make her vivid wet dreams come true? What does she use for sexual healing? Who sees them doing what on the beach and does she care? Come with Glenda in her first real foursome, and more-some.Three Times Three - He’s Your Man Now: Glenda knows her actor boyfriend kisses women on stage, but she didn't know it went beyond rehearsal. While dancing her troubles away, she embraces the new woman in her man's life. Break-up sex taken to the next level, she passes the torch in the hottest way imaginable in this story of unconditional love. How does Glenda go from jealousy and heartbreak to excitement and arousal? Come with Glenda and her look-alike, and the man who gets them both.Hot Night at Hot Springs (Previously entitled “Three(some)”): Glenda is a guest at Katrina and Matt's place, and soon discovers that she is considered much more than a friend . . . Is it true that Katrina thinks of Glenda when she makes love? Is Matt ready for two hot women? Come on an unforgettable trip to the hot springs with two horny women and the lucky boyfriend.Foreplay for Daze: Glenda enjoys her last month of summer vacation on the road; flirting with, tempting, watching and loving her companions. Set in the 1990s, when they found the party by word of mouth, Glenda opens herself to her heart's desires.Slingshot to Desire: Glenda finds herself in the lap of a lover on the road to Desire. Is anywhere too risky to f*ck for our exhibitionist? Come with Glenda to satisfy of her impressive sexual appetite.Big, Big, Love: Glenda Love is going on the road with man with a giant . . . libido. She prepares and expands her repertoire of juicy skills with her girlfriend. Wide-open to a world of possibility, what does she find in the XXX Store? What does she see in the mirror? How does she handle the biggest lover she's ever had?He Likes it When You Call Him Daddy: Glenda is in the loving arms of her sweetheart, Jonny, and his new girlfriend, Marissa. Glenda is treated to deep pleasure, explicit role-play and un ménage-à-trois. She enjoys the tender touch of a kinky woman and the penetrative ecstasy of an attentive man. What could possibly shock Glenda? Who can restrain our free and independent woman?TW: mild spanking, man-of-the-house role-play, bondage, (consensual)A Cold Night with a Warm Stranger: Wintry weather and a job at 4:00 AM can't stop Glenda's ignited passion. Join Glenda on a cold night with a warm stranger. Why is she camping in the winter? Will she neglect her duties to follow her heart? How does an experienced woman deal with an unexpected twist?Barn to be Wild: Glenda turns a barn dance into a frenzied orgy with her magical touch, turning friends into lovers, sending a ripple effect through time. What was she dreaming of when her girlfriend woke her up? How does she turn all the women into confident pleasure seekers at the party? What happens when two couples merge in the dance?",
  "genres": [],
  "author": "Glenda Love",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/59007919-sex-while-camping-is-in-tents"
}