{
  "title": "The Wish Trees: How Planting Trees Can Help Make the World a Better Place",
  "description": "A Nonfiction Children’s Book Celebrating Tree Planting — A Perfect Read for Earth Day and Every Day! \"Planting a tree is an act of hope. And that is a message our children need to hear now more than ever.\"— Andrea Koehle JonesInspiring and uplifting, The Wish Trees is rooted in the idea that every child can help make the world a better place. This whimsical children's book introduces young readers to the fun of tree planting as they meet kids around the globe planting Wish Trees and making wishes.Kids will discover the wonder of trees and enjoy searching for different animals and tree names with each new page. Thoughtful, empowering and beautifully written by journalist and children's environmental education advocate Andrea Koehle Jones, The Wish Trees features illustrations by New York Times best-selling illustrator Alicia Padrón. The Wish Trees: How Planting Trees Can Help Make the World a Better Place is inspiring little tree planters and wishers everywhere.Children's nonfiction tree planting book teaches kids how to plant a tree and help others.Young children will fall in love with trees, learn how trees can help our planet and begin to understand that they are never too little to help the world. This second edition of The Wish Trees includes a bonus: “How to Plant a Wish Tree.”100% of profits from this book will be donated to children's environmental education and tree planting non-profits including The ChariTree Foundation.Discover how to plant a treeYoung children will fall in love with trees, learn how trees can help our planet and begin to understand that they are never too little to help the world. This second edition of The Wish Trees children's tree planting book includes a bonus: “How to Plant a Wish Tree.”100% of profits from this nonfiction STEM book will be donated to The ChariTree Foundation and other children's environmental education and tree planting projects.",
  "genres": [
    "Picture Books",
    "Environment"
  ],
  "author": "Andrea Koehle Jones",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/59009389-the-wish-trees"
}