{
  "title": "Don't Just Fly, SOAR: The Inspiration and tools you need to rise above adversity and create a life by design",
  "description": "Are you struggling to rise above adversity?Looking for the deeper purpose for your life?Don’t Just Fly, tells a deeply personal account of an immigrant conqueror. Markey unveils her own fractured heart, coherent to the sound of humanities cries and painted by her own tears. Cultured calligraphy glides from her quill to depict traces of humankind and specifically where real victory dwells. Only you can define the tapestry of your character and the fashion that it spills into our world.This testimony is more than words, it is life changing motivation to live better. It is a witness that you can achieve professional success, change the narrative dished out to you, harness meaningful relationships, ignite your self-worth and find peace in the most intense storms of life. Drenched with palatable experience and insightful gleans Kelly shows that the power to change your life depends on you despite unfavourable circumstances. A book that’s ignites you to find your goodness guide.In this book, Kelly draws on her life experience wisdom intended to supply guidance and daily help, with all the pitfalls and possibilities to benefit you towards understanding how Define your purpose and vision for lifeUnderstand the lessons & blessings of your past Create authentic & meaningful relationships Thrive in a world that sometimes feels unfair Design the future that inspires youDon’t Just Fly, SOAR includes 25 powerful self-help tools for transforming your life and creating a future by design. Each points you toward a better and robust custom of living.This book will guide you to the healing power of empathy and complement the incredible influence of resilience that lurks within you. It will inspire you to shoot for the stars and leave your legacy in the world!_______________________________________________________________________ ‘This book is powerful, it will teach you, it will equip you and it will shape you for a healthier walk in life...what an extraordinary journey and experience that turned out an exceptional woman of our era.’ - Liz Naidoo. Editor. Woman of Faith Magazine‘I believe our personal stories are sources of transformation for others...This book will transform your life and birth a new you. Congratulations on picking it up.’ - Dr Samuel Ekundayo",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Education",
    "Book Club"
  ],
  "author": "Kelly Markey",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/59013666-don-t-just-fly-soar"
}