{
  "title": "Dear William: A Father's Memoir of Addiction, Recovery, Love, and Loss",
  "description": "PUBLISHERS WEEKLY BESTSELLERFEATURED ON CBS MORNINGS WITH GAYLE KINGA BEST BOOK OF THE SOUTH (reckon)2022 NATIONAL INDIE EXCELLENCE AWARDS FINALIST — MEMOIR\"Shot through with hope, purpose and an unflinching love, it's a story that must be read.\" —Newsweek\"Essential, poignant, and insightful reading.\" —Kirkus Reviews, starred reviewAward-winning columnist and author David Magee addresses his poignant story to all those who will benefit from better understanding substance misuse so that his hard-earned wisdom can save others from the fate of his late son, William.The last time David Magee saw his son alive, William told him to write their family's story in the hopes of helping others. Days later, David found William dead from an accidental drug overdose.Now, in a memoir suggestive of Augusten Burroughs meets Glennon Doyle, award-winning columnist and author David Magee answers his son's wish with a compelling, heartbreaking, and impossible to put down book that speaks to every individual and family.With honesty and heart, Magee shares his family's intergenerational struggle with substance abuse and mental health issues, as well as his own reckoning with family secrets—confronting the dark truth about the adoptive parents who raised him and a decades-long search for identity. He wrestles with personal substance misuse that began at a young age and, as a father, he sees destructive patterns repeat and develop within his own children. While striving to find a truly authentic voice as a writer despite authoring nearly a dozen previous books, Magee ultimately understands that William had been right and their own family's history is the story he needs to tell.A poignant and uplifting message of hope translates unimaginable tragedy into an inspirational commitment to saving others, as David founded the William Magee Institute for Student Wellbeing at the University of Mississippi. His mission to share solutions to self-medication and addiction, particularly as it touches America's high school and college students, emphasizes that William's story is about much more than a tragic addiction—it's an American story of a family broken by loss and remade with love.Dear William inspires readers to find purpose, build resilience, and break the cycles that damage too many individuals and the people who love them. It's a life-changing book revealing how voids can be filled, and peace—even profound, lasting happiness—is possible.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Adult",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "Family"
  ],
  "author": "David  Magee",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/59020902-dear-william"
}