{
  "title": "Full Hart",
  "description": "Christmas, a time for family, cheer and Joy getting her groove back.It’s nearly Christmas and the Hart brothers and their families are getting ready for another loud, crazy and wonderful holiday. But when they show up at their mother’s house with a freshly cut tree in tow, they’re in for a surprise nobody ever expected.After losing her husband thirty years ago, Joy Hart raised her four sons on her own, got her doctorate, and became an accomplished sex and relationship therapist. As much as she loves being a nana, a mom, and a mother-in-law, she’s far from dead and wants more in her life. For a long time, she pretended she was satisfied with the flings she had while away at conferences. Love was not on her radar. But a chance meeting with a dashing man has opened this Hart’s heart to new possibilities.Too bad her sons aren’t on board with the new man in their mother’s life. They’re giving Grant the gears and think he’s all wrong for their mother—for their family. He has no place at their Christmas dinner table, and the Harty Boys are determined to get the dirt on Grant before the timer on the oven says the turkey is done.Will Brock, Chase, Rex and Heath take things too far and ruin Christmas for everyone with their stubborn, meddling, alpha ways? Or will Grant save the day, save Christmas and prove to everyone that Joy deserves a happily ever after just like the rest of them?Trigger warning: miscarriagePOV: All (Brock, Krista, Chase, Stacey, Rex, Lydia, Heath, Pasha, Joy and Grant)**Note: This is the fifth book in the Harty Boys Series. It’s highly recommended to read the Harty Boys quartet first. But not every Hart found their soulmate, so I thought why not give Joy the happily ever after she deserves too? So grab your rum and eggnog, put your fuzzy slippers up, get cozy by the fire and dive into a fun, read featuring your favorite family at Christmas time.**Note: The political views represented in this book do not necessarily reflect those of the author. This is fiction and characters are given their own thoughts, ideas, morals, ethics, religious and political opinions to make them seem more realistic.",
  "genres": [],
  "author": "Whitley Cox",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/59021203-full-hart"
}