{
  "title": "My Money My Way: Taking Back Control of Your Financial Life",
  "description": "The self-made budgeting expert who has helped millions of women transform their relationship with money reveals her secret to guilt-free living and financial fulfillment.\nWe all want to get in control of our money, but what happens when we don't feel like we're good enough?In My Money My Way, financial counselor and creator of The Budget Mom Kumiko Love inspires and equips you to end the cycle of self-doubt and make confident money decisions. Previous budgeting methods haven't worked because they weren't designed by you or for you. Love's original strategies will help you define your goals and achieve them on your own terms. You will learn foundational practices such as:- How to harness your emotions to make authentic money decisions, instead of letting your emotions control you - How to create a budget based on what you need to spend, not what you think you should be spending - How to create a motivating debt pay-off plan that fits your life, not a plan that's too strict to succeedLove knows this better than anyone because she's lived it. Only a few years ago, she struggled to pay her $77,000 dollar debts down while making $24,000 per year as a single mom. Every financial plan she tried failed, so she made one that prioritized her family and her sanity. Today, she's living debt-free in her dream home, which she paid for in cash, and spends stress-free time with her son every day.Love has motivated millions of women to get in control of their financial futures. Her revolutionary yet practical and accessible approach will unlock the secrets of financial fulfillment so you never have to sweat living your best life ever again.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Finance",
    "Audiobook",
    "Money",
    "Psychology",
    "Personal Development"
  ],
  "author": "Kumiko Love",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/59019552-my-money-my-way"
}