{
  "title": "All Roads Lead to Nowhere",
  "description": "In a distant, dystopian future, the United States has fallen. The rich and elite live in the domed Paradise Cities, told what to think and how to live by narcissistic corporations that have formed a nefarious alliance with the government – no longer a democracy, secretly controlled by one man. The less fortunate are forced out into the barren wastelands. The remnants of the nuclear holocaust, where the environment has collapsed, referred to as Nowhere. Six desperate figures, each with different political motivations, struggle to survive. Hunted by the President’s robot army and the dangerous members of the Wright Gang, divided by their own opposing viewpoints, they must come together and fight as one, or become more forgotten, lost souls.But even as they come to grips with their own human weaknesses, and try to overcome the obstacles thrown into their paths, the truth they must face is…All Roads Lead to Nowhere.\"Alex Skikos' book 'All Roads Lead to Nowhere' was an engaging journey through a grim but interesting future that feels inevitable due to our current fascination with nationalism and divisive politics. The technology is advanced but has a gritty post-war realism to it, and does little in the way of providing comfort. This is a phenomenal story about prejudice and fear, about 'us' and 'them'. A story about where all this anger in our culture is leading us. When you pick it up, you won't be able to put it down. Enjoy your stay in Paradise.\" — Avery Lockland, author of Festival of Storm\"A thrilling dystopian read that beautifully balances gripping narrative and with political commentary, All Roads Lead to Nowhere will draw you in and leave you wondering how close or far the world Skikos crafted is from our own.\" —Emily VanderBent, author of Crimson Time\"Skikos masterfully portrays the stakes of political, social, economic polarization and beckons us as readers to be cognizant of how stratification and scarcity can deteriorate into the dehumanization of others and ourselves if we aren't careful.\" —Kyra Ann Dawkins, author of The We and the They\"Alex's debut is nothing short of fantastic ... it's a breath of fresh air introducing an entirely new and suspenseful twist to the post-apocalyptic genre.\" —Ananya Mallik, author of Endless: A Villain's Love Story",
  "genres": [],
  "author": "Alexander Skikos",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/59021208-all-roads-lead-to-nowhere"
}