{
  "title": "Moonlight Rocks: Murder and Magic",
  "description": "\"A Wild and Crazy Ride.\" \"... if you're not used to the writer, buckle up.\"\"This book has very great character development with a plot so great that you can’t ignore nor get enough...\"\"The author’s use of religion to push the plot forward and develop characters is so masterfully crafted and unique – I’ve personally never seen in done in a novel like it is portrayed in Moonlight Rocks.\"Amazon 5-star ReviewersWhat would you do if God fell into your lap?Jessy Ascher and her friends set up camp near Moonlight Rocks in the California desert to watch the Leonid meteor shower. After darkness falls, a stunningly bright meteor suddenly flashes across the sky blinding the friends to the approaching danger.The meteorite blasts into their camp site knocking everyone unconscious but Jessy quickly regains her senses. Her friends however, cannot be roused. Instinctively she grabs the still smoking meteorite and stumbles downhill toward the jeep she arrived in, desperate to get help for her friends...But, Jessy isn't alone in that rough, cactus-filled landscape... two dark figures who also saw the meteor flashing down to Earth are frantically searching the same area and they are ready to do anything... even murder to get their hands on a meteorite they could sell to the highest bidder. And what about the meteorite? Others have been waiting for its arrival. Cultists, fanatical members of nearby religious or supernatural factions - some good, some evil - believe that the meteor heralds the birth of a new Messiah and they, too, are ready to do anything to gain control of the blessed rock.Jessy wants help for her friends, others want the meteorite for their own end, but the Meteorite, it wants something too... Is this the dawn of a new spiritual age, or just a bunch of psychos raging in the desert?Scroll Up And Grab Your Copy Today!",
  "genres": [],
  "author": "Yurie Kiri",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/59012638-moonlight-rocks"
}