{
  "title": "Run and Hide",
  "description": "\"Pankaj Mishra transforms a visceral, intimate story of one man’s humble origins into a kaleidoscopic portrait of a society bedazzled by power and wealth―what it means on a human level, and what it costs. Run and Hide is a spectacular, illuminating work of fiction.\" ―Jennifer Egan, author of Manhattan BeachGrowing up in a small railway town, Arun always dreamed of escape. His acceptance to the prestigious Indian Institute of Technology, enabled through great sacrifice by his low-caste parents, is seemingly his golden ticket out of a life plagued by everyday cruelties and deprivations.At the predominantly male campus, he meets two students from similar backgrounds. Unlike Arun―scarred by his childhood, and an uneasy interloper among go-getters―they possess the sheer will and confidence to break through merciless social barriers. The alumni of IIT eventually go on to become the financial wizards of their generation, working hard and playing hard from East Hampton to Tuscany―the beneficiaries of unprecedented financial and sexual freedom. But while his friends play out Gatsby-style fantasies, Arun fails to leverage his elite education for social capital. He decides to pursue the writerly life, retreating to a small village in the Himalayas with his aging mother.Arun’s modest idyll is one day disrupted by the arrival of a young woman named Alia, who is writing an exposé of his former classmates. Alia, beautiful and sophisticated, draws Arun back to the prospering world where he must be someone else if he is to belong. When he is implicated in a terrible act of violence committed by his closest friend from IIT, Arun will have to reckon with the person he has become.Run and Hide is Pankaj Mishra’s powerful story of achieving material progress at great moral and emotional cost. It is also the story of a changing country and global order, and the inequities of class and gender that map onto our most intimate relationships.",
  "genres": [
    "Fiction",
    "India",
    "Contemporary",
    "Novels",
    "Literary Fiction",
    "Indian Literature",
    "Literature"
  ],
  "author": "Pankaj Mishra",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/59025094-run-and-hide"
}