{
  "title": "Inside The Maelstrom: Part One",
  "description": "It started when I tried to kill a magnolia tree. With my car. While I was driving it. Okay, maybe it wasn’t just the tree I was trying to kill. But that wasn’t the end of it. No, I wasn’t even halfway through the spiralling vortex that would consume my life. When a dangerous driving charge gets me put in a fancy rehab for rich kids and socialites with eating disorders, I intended to do my time and then leave. I was going to leave behind the sports star who was addicted to uppers, the coke-head lawyers, the cutters and the space cadets. I was going to leave behind him. Bored, listless, and filthy dirty rich. If there was a waste of oxygen, it was Hendrick Kenley. Although I wasn’t sure why he was in rehab, because he was special (read rich) enough to not have to do group therapy with the rest of us. Didn’t matter, I avoided him and his beautiful cruel smirk, and read until my sentence was over. Fate, that glorious bitch, had other plans though. Days before my release, I pick up a book. Jules Verne’s Twenty-Thousand Leagues Under the Sea. I’d read through the rest of the Sunny Outlook Center’s meagre library. But in the margins of that tatty paperback was my future. Words from a past inmate of this institution that spoke to my soul and begged me to come find him. Problem was, unlike the rest of the people in the Sunny Outlook, my parents had taken out a second mortgage to pay for my stay. My mystery beau was calling me to Europe, France to be exact. So I had to make a deal with the Devil, and by Devil I mean Hendrick Kenley and his cohort of disenchanted fools. But they offered me a deal I couldn’t refuse; they’d pay for everything for the trip, travelling on a private plane at that, but I had to let them come along. There was a reason for the adage that if something sounds too good to be true, it probably is. I’d learn the truth of that the hard way. Inside the Maelstrom is an enemies to lovers contemporary reverse harem romance. May contain possibly triggering themes around mental health.",
  "genres": [
    "Reverse Harem",
    "Contemporary",
    "M M Romance",
    "Romance",
    "Contemporary Romance",
    "M M F",
    "Dark Romance"
  ],
  "author": "Grace McGinty",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/59041705-inside-the-maelstrom"
}