{
  "title": "The Change",
  "description": "In the Long Island oceanfront community of Mattauk, three different women discover that midlife changes bring a whole new type of empowerment…After Nessa James’s husband dies and her twin daughters leave for college, she’s left all alone in a trim white house not far from the ocean. In the quiet of her late forties, the former nurse begins to hear voices. It doesn’t take long for Nessa to realize that the voices calling out to her belong to the dead—a gift she’s inherited from her grandmother, which comes with special responsibilities.On the cusp of 50, suave advertising director Harriett Osborne has just witnessed the implosion of her lucrative career and her marriage. She hasn’t left her house in months, and from the outside, it appears as if she and her garden have both gone to seed. But Harriett’s life is far from over—in fact, she’s undergone a stunning and very welcome metamorphosis.Ambitious former executive Jo Levison has spent thirty long years at war with her body. The free-floating rage and hot flashes that arrive with the beginning of menopause feel like the very last straw—until she realizes she has the ability to channel them, and finally comes into her power.Guided by voices only Nessa can hear, the trio of women discover a teenage girl whose body was abandoned beside a remote beach. The police have written the victim off as a drug-addicted sex worker, but the women refuse to buy into the official narrative. Their investigation into the girl’s murder leads to more bodies, and to the town’s most exclusive and isolated enclave, a world of stupendous wealth where the rules don’t apply. With their newfound powers, Jo, Nessa, and Harriett will take matters into their own hands…",
  "genres": [
    "Fantasy",
    "Fiction",
    "Mystery",
    "Magical Realism",
    "Audiobook",
    "Thriller",
    "Book Club"
  ],
  "author": "Kirsten Miller",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/59030015-the-change"
}