{
  "title": "My First Animal Moves: A Children's Book to Encourage Kids and Their Parents to Move More, Sit Less and Decrease Screen Time",
  "description": "Nathan loves to play, but he loves his video games more.Can a trip to Animal Moves land convince him there's more fun outdoors? Best-selling author and speaker Darryl Edwards has created this fun adventure inspired by his passion for encouraging kids to move in an ever-increasing sedentary environment.MY FIRST ANIMAL MOVESDiscover the joys of animal moves with your little cubs in this first book of movement. Join Nathan and his cute, but sometimes lazy, dog as they crawl, jump and balance their way through the animal kingdom re-enacting moves designed to emphasise fun. It's all in this exercise for kids book that focuses on family fun boredom busters.HELPING KIDS MOVE AND GETTING KIDS OFF SCREENS THROUGH FUN ANIMAL PLAY✓ Do you want to make physical activity for kids fun?✓ Are you looking for ways to help your children develop strength, coordination and balance?✓ Do your children love learning about animals?✓ Are you worried about too much TV and screen time?✓ Do you want to teach young children about the importance of physical activity?✓ Would you like easy and fun fitness games to include in your day?My First Animal Moves is your answer. Play along together, keeping everyone healthier and happier, promoting physical, mental and emotional well-being. You'll all release more mood-enhancing hormones as a result, which help you feel good every day.It's written by professional movement coach and award-winning author Darryl Edwards who is best known for his groundbreaking TED Talk \" Why working out isn't working out \", viewed over a million times worldwide. My First Animal Moves distils the ideas in his bestselling Animal Moves book and Animal Moves Fitness Decks into a colourful picture book for children.A Children's Book to Encourage Kids and Their Guardians to Move More, Sit Less and Decrease Screen Time.This unique story takes a different stance to many popular titles in this arena, with a fun activity that encourages children's active play while aiming to get families moving and reading together. It takes the humour and colour in kids' yoga books such as Breathe Like a Bear by Kira Willey , Yoga Bug by Sarah Jane Hinder , and You Are a Lion by Taeeun Yoo to a whole new energy level with active play for the entire family.Get My First Animal Moves to help your family thrive through movement today.",
  "genres": [
    "Picture Books",
    "Childrens",
    "Education"
  ],
  "author": "Darryl Edwards",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/59034547-my-first-animal-moves"
}