{
  "title": "The Last Resort: A Chronicle of Paradise, Profit, and Peril at the Beach",
  "description": "A captivating exploration of beach resort culture—from its roots in fashionable society to its undervalued role in today’s world economy—as the industry approaches a climate reckoningWith its promise of escape from the strains of everyday life, the beach has a hold on the popular imagination as the ultimate paradise. In The Last Resort, Sarah Stodola dives into the psyche of the beachgoer and gets to the heart of what drives humans to seek out the sand. At the same time, she grapples with the darker realities of resort culture: strangleholds on local economies, reckless construction, erosion of beaches, weighty carbon footprints, and the inevitable overdevelopment and decline that comes with a soaring demand for popular shorelines.The Last Resort weaves Stodola’s firsthand travel notes with her exacting journalism in an enthralling report on the past, present, and future of coastal travel. She takes us from Monte Carlo, where the pursuit of pleasure first became part of the beach resort experience, to a village in Fiji that was changed irrevocably by the opening of a single resort; from the overdevelopment that stripped Acapulco of its reputation for exclusivity to Miami Beach, where extreme measures are underway to prevent the barrier island from vanishing into the ocean.In the twenty-first century, beach travel has become central to our globalized world—its culture, economy, and interconnectedness. But with sea levels likely to rise at least 1.5 to 3 feet by the end of this century, beaches will become increasingly difficult to preserve, and many will disappear altogether. What will our last resort be when water begins to fill the lobbies?",
  "genres": [
    "Nonfiction",
    "Travel",
    "History",
    "Audiobook",
    "Economics",
    "Environment",
    "Nature"
  ],
  "author": "Sarah Stodola",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/59039926-the-last-resort"
}