{
  "title": "Top 10 Chicago",
  "description": "Admire Impressionist masterpieces at the Art Institute of Chicago, window shop on the Magnificent Mile, get a bird's eye view of four states from the Skydeck of Willis Tower, or cruise along the river for a great view of Chicago's landmark everything you need to know is clearly laid out within color-coded chapters. Discover the best of Chicago with this indispensable travel guide.Located on the shores of Lake Michigan, Chicago offers both urban and natural wonders in abundance – think soaring skyscrapers, art-filled parks, world-class museums, and beautiful beaches. Make the most of your trip to the Windy City with DK Eyewitness Top 10 Chicago. Planning is a breeze with our simple lists of ten, covering the very best that Chicago has to offer and ensuring that you don’t miss a thing. Best of all, the pocket-friendly format is light and easily portable; the perfect companion while out and about. DK Eyewitness Top 10 Chicago is your ticket to the trip of a lifetime.Inside DK Eyewitness Top 10 Chicago you will  - Detailed Top 10 lists of Chicago’s must-sees including Millennium Park, the Art Institute of Chicago, Field Museum, and Chicago Riverwalk- Easy-to-follow itineraries including ideas for day trips, weekends, and a week’s worth of plans to make the most out of each and every day- Expert honest recommendations on Chicago’s most interesting areas, with the best places for shopping, eating out, and sightseeing, with top tips on getting ready, getting around and staying safe- Themed lists including the best skyscrapers, parks and beaches, niche museums, blues, and jazz joints, and much more- Practical Inspiration for different things to enjoy during your trip, including family activities and things to do for free- Detailed maps including a laminated pull-out map of Chicago, plus five full-color area maps- Chicago Highlights, Willis Tower and Its Views, The Art Institute of Chicago, Field Museum, Museum of Science and Industry, Navy Pier, John G. Shedd Aquarium, Chicago Riverwalk, Magnificent Mile, Millenium Park, Frank Lloyd Wright’s Oak Park, Moments in History, Skyscrapers, Niche Museums, Film Locations, Parks and Beaches, Off the Beaten Path, Kid’s Chicago, Performing Arts, Blues and Jazz Joints, Bars and Clubs, Places to Eat, Shopping Destinations, Chicago for Free, Festivals and Events, The Loop, Near North, Northside, South Loop, and Far South. Looking for more on Chicago’s culture, history, and attractions? Don’t forget to check out DK Eyewitness Chicago.About DK At DK Eyewitness, we believe in the power of discovery. We make it easy for you to explore your dream destinations. DK Eyewitness travel guides have been helping travellers to make the most of their breaks since 1993.Filled with expert advice, striking photography and detailed illustrations, our highly visual DK Eyewitness guides will get you closer to your next adventure. We publish guides to more than 200 destinations, from pocket-sized city guides to comprehensive country guides. Named Top Guidebook Series at the 2020 Wanderlust Reader Travel Awards, we know that wherever you go next, your DK Eyewitness travel guides are the perfect companion.",
  "genres": [
    "Travel",
    "Nonfiction"
  ],
  "author": "DK Eyewitness Travel",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/59040358-top-10-chicago"
}