{
  "title": "Medical Miracles: Doctors, Saints, and Healing in the Modern World",
  "description": "Modern culture tends to separate medicine and miracles, but their histories are closely intertwined. The Roman Catholic Church recognizes saints through canonization based on evidence that they worked miracles, as signs of their proximity to God. Physicianhistorian Jacalyn Duffin has examined Vatican sources on 1400 miracles from six continents and spanning four centuries. Overwhelmingly the miracles cited in canonizations between 1588 and 1999 are healings, and the majority entail medical care and physician testimony.These remarkable records contain intimate stories of illness, prayer, and treatment, as told by people who rarely leave traces: peasants and illiterates, men and women, old and young. A woman's breast tumor melts away; a man's wounds knit; a lame girl suddenly walks; a dead baby revives. Suspicious of wishful thinking or naïve enthusiasm, skeptical clergy shaped the inquiries to identify recoveries that remain unexplained by the best doctors of the era. The tales of healing are supplemented with substantial testimony from these physicians.Some elements of the miracles change through time. Duffin shows that doctors increase in number; new technologies are embraced quickly; diagnoses shift with altered capabilities. But other aspects of the miracles are stable. The narratives follow a dramatic structure, shaped by the formal questions asked of each witness and by perennial reactions to illness and healing. In this history, medicine and religion emerge as parallel endeavors aimed at deriving meaningful signs from particular instances of human distress -- signs to explain, alleviate, and console in confrontation with suffering and mortality.A lively, sweeping analysis of a fascinating set of records, this book also poses an exciting methodological challenge to historians: miracle stories are a vital source not only on the thoughts and feelings of ordinary people, but also on medical science and its practitioners.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Jacalyn Duffin",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/5902815-medical-miracles"
}