{
  "title": "Crossworld: One Man's Journey into America's Crossword Obsession",
  "description": "Sixty-four million people do it at least once a week. Nabokov wrote about it. Bill Clinton even did it in the White House. The crossword puzzle has arguably been our national obsession since its birth almost a century ago. Now, in Crossworld , writer, translator, and lifelong puzzler Marc Romano goes where no Number 2 pencil has gone before, as he delves into the minds of the world’s cleverest crossword creators and puzzlers, and sets out on his own quest to join their ranks.While covering the American Crossword Puzzle Tournament for the Boston Globe , Romano was amazed by the skill of the competitors and astonished by the cast of characters he came across—like Will Shortz, beloved editor of the New York Times puzzle and the only academically accredited “enigmatologist” (puzzle scholar); Stanley Newman, Newsday ’s puzzle editor and the fastest solver in the world; and Brendan Emmett Quigley, the wickedly gifted puzzle constructer and the Virgil to Marc’s Dante in his travels through the crossword inferno.Chronicling his own journey into the world of puzzling—even providing tips on how to improve crosswording skills—Romano tells the story of crosswords and word puzzles themselves, and of the colorful people who make them, solve them, and occasionally become consumed by them.But saying this is a book about puzzles is to tell only half the story. It is also an explanation into what crosswords tell us about ourselves—about the world we live in, the cultures that nurture us, and the different ways we think and learn. If you’re a puzzler, Crossworld will enthrall you. If you have no idea why your spouse send so much time filling letters into little white squares, Crossworld will tell you – and with luck, save your marriage.CROSSWORLD | by Marc RomanoACROSS1. I am hopelessly addicted to the New York Times crossword puzzle.2. Like many addicts, I was reluctant to admit I have a problem.3. The hints I was heading for trouble came, at first, only occasionally.4. The moments of panic when I realized that I might not get my fix on a given day.5. The toll on relationships.6. The strained friendships.7. The lost hours I could have used to do something more productive.8. It gets worse, too.DOWN1. You’re not just playing a game.2. You’re constantly broadening your intellectual horizons.3. You spend a lot of time looking at and learning about the world around you.4. You have to if you want to develop the accumulated store of factual information you’ll need to get through a crossword puzzle.5. Puzzle people are nice because they have to be.6. The more you know about the world, the more you tend to give all things in it the benefit of the doubt before deciding if you like them or not.7. I’m not saying that all crossword lovers are honest folk dripping with goodness.8. I would say, though, that if I had to toss my keys and wallet to someone before jumping off a pier to save a drowning girl, I’d look for the fellow in the crowd with the daily crossword in his hand.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Puzzles",
    "Pop Culture",
    "Games"
  ],
  "author": "Marc Romano",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/59035.Crossworld"
}