{
  "title": "A Sanctuary for Soulden",
  "description": "He wasn't meant for a quiet life.Philip Winthrop, Viscount Soulden, is a fop. An idle popinjay with nothing more on his mind than how to best knot his cravat. He definitely doesn’t spy against the French. Or arrange hasty weddings. Or occasionally commandeer the navy. And he certainly doesn’t seek out mortal danger in order to combat his pervasive ennui. It’s all just a big misunderstanding when he’s shot by a French intelligence officer during a merry riverside chase. And what a wonderful bit of quick thinking to pretend to be a corpse in order to get himself taken to the local surgeon's autopsy cellar. The French will never find him there. If the French are even looking for him. Which they’re not. Now he just needs to locate a way out before this surgeon fellow attempts to dissect him.He'd rather deal with the dead than the living.Surgeon Edmund Fernside does his best to heal the living, but in truth, he'd much rather look into the gaping chest cavity of a corpse than into the startling blue eyes of a...corpse that just climbed off his autopsy table. Well then. Lord Soulden is clearly a man with some complicated secrets. But with the French in hot pursuit and a rather brutal gunshot wound, Soulden’s not going anywhere anytime soon, and Fernside discovers that he enjoys the pleasure of his company. In more ways than one. Now, trusting each other could mean the difference between life and death.As Soulden learns to be still for the first time in his life, Fernside wonders if perhaps it’s time to spread his wings a little. They can only hide from the outside world—and from their pasts—for so long before the secrets they’ve uncovered about each other strain the growing attraction between them. Each man must decide whether a life of comfortable lies is preferable to one full of difficult truths. And whether the sanctuary they’ve created together is something worth fighting for.A Sanctuary for Soulden is the fourth book in the Lords of Bucknall Club series, where the Regency meets m/m romance. The Lords of Bucknall Club can be read in any order.",
  "genres": [
    "Historical",
    "M M Romance",
    "Romance",
    "Historical Fiction",
    "Regency",
    "LGBT",
    "Queer"
  ],
  "author": "J.A. Rock",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/59026379-a-sanctuary-for-soulden"
}