{
  "title": "Forced Conversion",
  "description": "Everyone can have heaven, any heaven they want, but some people don’t want to go.  \"Visceral, bloody -- and one hell of a page turner! Bingle tackles the philosophical issues surrounding uploaded consciousness in a fresh, exciting way. This is the debut of a major novelist -- don't miss it.\" Robert J. Sawyer, Hugo and Nebula Award-Winning Author.  Mankind has largely retreated to the realms of virtual reality, where resources are unlimited and the problems of the real world--violence, conflict, sickness, and pain--can all be avoided. Unfortunately, those who stay behind in the real world pose the only risk to the immortality of those who have converted to virtual existence.  Derek, a soldier in the Conversion Forces (ConFoes), seeks to enforce the Mandatory Conversion Act on the remaining mals (malcontent Luddites, gangbangers, and religious fanatics). He just wants to put in his time and join his family on one of the virtual worlds. But until then, he is forced to deal with his psychotic squad-mates, the increasingly brutal tactics of the ConFoes, and a mal ambush. And that's just the beginning of his journey.  While most speculative and science fiction deals with worlds transformed by technological advance, Forced Conversion highlights the troubling and chaotic process of that transformation, itself. It combines the adrenaline-soaked action of military fiction with the extrapolation of current scientific trends of the best speculative fiction, while dealing with the moral and religious implications of both war and technology.  If large scale transcendence could occur, this novel explains how it would come about and what the real world would be like in the aftermath.  When Moore’s Law meets God’s Law, the result is forced conversion.  Says Ed Greenwood, Creator of The Forgotten Realms and Author of the bestselling Elminster \"I loved it! Many writers have explored hard-hitting and brutal possible futures for Earth, and told colorful tales of people trying to stay alive in them, but few have brought such imagined futures as vividly to life as Don Bingle -- and no other book I can think of examines how and why such a future might just happen as well as FORCED CONVERSION does -- or provides half the breath-catching twists and turns of Bingle's yarn. A 'good read' of the old school, coupled with all-too-plausible reasons for everything. A grim warning and a fast action adventure tale, all in one! Highly recommended!\"  Best known as the world's top-ranked player of classic role-playing games for fifteen years, Donald J. Bingle is an oft-published author in the science fiction, fantasy, horror, thriller, steampunk, romance, and comedy genres, with six books (Forced Conversion; GREENSWORD; Net Impact; Frame Shop; The Love-Haight Case Files; Wet Work), and more than fifty shorter stories, primarily in DAW themed anthologies and tie-in anthologies, including stories in Carnage & Consequences, The Crimson Pact, Steampunk'd, Imaginary Friends, Fellowship Fantastic, Zombie Raccoons and Killer Bunnies, Time Twisters, Front Lines, Slipstreams, Gamer Fantastic, Transformers Legends, Search for Magic (Dragonlance), If I Were An Evil Overlord, Civil War Fantastic, Future Americas, All Hell Breaking Loose, The Dimension Next Door, Sol's Children, Historical Hauntings, and Fantasy Gone Wrong. Many of thsese stories and others appear in his Writer on Demand TM story collections by Tales of Gamers and Gaming; Tales of Humorous Horror; Tales Out of Time; Grim, Fair e-Tales; Tales of an Altered Past Powered by Romance, Horror, and Steam; Not-So-Heroic Fantasy; and Shadow Realities.  Donald J.",
  "genres": [
    "Amazon",
    "Science Fiction"
  ],
  "author": "Donald J. Bingle",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/12812050-forced-conversion"
}