{
  "title": "A Natural History of the Piano: The Instrument, the Music, the Musicians - from Mozart to Modern Jazz and Everything in Between",
  "description": "A beautifully illustrated, totally engrossing celebration of the piano, and the composers and performers who have made it their own. With honed sensitivity and unquestioned expertise, Stuart Isacoff—pianist, critic, teacher, and author of How Music Became a Battleground for the Great Minds of Western Civilization —unfolds the ongoing history and evolution of the piano and all its myriad how its very sound provides the basis for emotional expression and individual style, and why it has so powerfully entertained generation upon generation of listeners. He illuminates the groundbreaking music of Mozart, Beethoven, Liszt, Schumann, and Debussy. He analyzes the breathtaking techniques of Glenn Gould, Oscar Peterson, Vladimir Ashkenazy, Arthur Rubinstein, and Van Cliburn, and he gives musicians including Alfred Brendel, Murray Perahia, Menahem Pressler, and Vladimir Horowitz the opportunity to discuss their approaches. Isacoff delineates how classical music and jazz influenced each other as the uniquely American art form progressed from ragtime, novelty, stride, boogie, bebop, and beyond, through Scott Joplin, Fats Waller, Duke Ellington, Bill Evans, Thelonious Monk, Chick Corea, Herbie Hancock, Cecil Taylor, and Bill Charlap. A Natural History of the Piano distills a lifetime of research and passion into one brilliant narrative. We witness Mozart unveiling his monumental concertos in Vienna’s coffeehouses, using a special piano with one keyboard for the hands and another for the feet; European virtuoso Henri Herz entertaining rowdy miners during the California gold rush; Beethoven at his piano, conjuring healing angels to console a grieving mother who had lost her child; Liszt fainting in the arms of a page turner to spark an entire hall into hysterics. Here is the instrument in all its complexity and beauty. We learn of the incredible craftsmanship of a modern Steinway, the peculiarity of specialty pianos built for the Victorian household, the continuing innovation in keyboards including electronic ones. And most of all, we hear the music of the masters, from centuries ago and in our own age, brilliantly evoked and as marvelous as its most recent performance. With this wide-ranging volume, Isacoff gives us a must-have for music lovers, pianists, and the armchair musician.",
  "genres": [
    "Music",
    "History",
    "Nonfiction",
    "Art",
    "Historical"
  ],
  "author": "Stuart Isacoff",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/12811728-a-natural-history-of-the-piano"
}