{
  "title": "Love Immortal: Antique Photographs and Stories of Dogs and Their People",
  "description": "An artfully designed compendium of 200 antiquarian photographs, all published here for the first time—including daguerrotypes, ambrotypes, tintypes, cartes de visite, and sepia and black-and-white images—culled from the private collection of longtime antiques collector, dealer, and appraiser Anthony Cavo, accompanied by an entertaining mix of historical anecdotes, true stories, excerpts from literature, letters, quotes, and fun facts.“Until one has loved an animal, a part of one’s soul remains unawakened.”—Anatole France Dogs have been beloved companions since the dawn of humankind. With the advent of photography in the nineteenth century, this love was immortalized for the first time on film. While the clothing and the hairstyles of yesteryear may be very different—and intriguing to the modern eye—in these photos, the evident love between pet and owner is unmistakable, and remains as poignant today as when these images were taken.  An avid collector of nineteenth- and early twentieth-century photographs for more than fifty years, Anthony Cavo has amassed an enormous catalog of antique photography, including hundreds of shots of people and their dogs. From this huge array, he has carefully curated 200 extraordinary pictures. These photos were taken from approximately 1840 to 1930 and offer a wide display of both candid and formal studio poses. Cavo arranges his subjects thematically and combines different photographic formats and images from different eras to create visual interest—whether the mix features a particular breed, a selection of images in shadow, or two images identical in pose but taken decades apart or in vastly different locations. In his introduction, Cavo offers a personal overview of this incredible treasury, which provides background on his lifelong experience as a collector and dog lover as well as touches briefly on photography’s birth and various forms in its earliest years. Hehas gathered not only a fascinating array of facts, history, quotes, and anecdotes about dogs which he sprinkles among these charming and fascinating photographs, but enhances the viewing experience for the reader through pointing out details, such as style trends, that help identify when an image was taken Here, too, are delightful anecdotes, from kidnapped pups who escaped and found their way home to devoted dogs who saved their owners’ lives. Cavo offers fun insights into the history of our association with pets, information on a range of breeds, and tips about animal care throughout the ages. Here are touching true stories, quotes from famous historical figures, and a cornucopia of miscellaneous trivia, such as:  The ultimate companion book on humans’ favorite animal companion, Love Immortal is essential for all devoted to dogs, animal lovers, those with an interest in photography , and miscellany buffs.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Photography",
    "History",
    "Dogs"
  ],
  "author": "Anthony J. Cavo",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/59028608-love-immortal"
}