{
  "title": "Please Don't Tell Cooper That Jack is a Rabbit",
  "description": "* 2021 Mom's Choice Awards® Gold Award Recipient* 2021 New York City Big Book Award, Distinguished Favorite* 5-Star Reviews from Readers' Favorite and LitPick* 2021 Royal Dragonfly 1st Place Winner (tie), Picture Books 5 & YoungerA kind-hearted dog and rabbit who are best friends learn that differences are what make us special.Cooper the affable and friendly dog is back, and he’s looking to make a buddy. In this second title in the award-winning Cooper the Dog series, Please Don’t Tell Cooper That Jack is a Rabbit, Cooper and his best friend rejoice in silly escapades together and learn that having differences is the best part of friendship. When Uncle Stephen takes Cooper out in the yard, the winsome hound bounds after a rabbit outside of the fence. It isn’t long before the rabbit realizes he has nothing to fear; this playful pup is looking for a friend. Jack the Rabbit and Cooper become inseparable chums.Whether it’s blazing through parks and playgrounds, visiting museums and bookstores, or hunting for sticks, Cooper and Jack don’t realize that some may think they make an unlikely pair, they just know that they like being around each other. “Cooper and Jack are so much alike. They love to explore, on foot or by bike. Playing inside or out, it depends on the weather. Either way, they have fun just being together.”Through masterfully written rollicking rhymes by author Michelle Lander Feinberg paired with vibrant painterly illustrations by Anna Mosca, young readers will delight in the spreads of Jack and Cooper romping around and doing the things that good friends do together. The sprightly story conveys a subtle and sweet message that celebrates differences, kindness, and friendship.“It’s no big deal that they aren’t the same. A bunny and hound? A name is just a name.”“Light, charming fare for animal lovers…” – Kirkus Reviews",
  "genres": [
    "Childrens"
  ],
  "author": "Michelle Lander Feinberg",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/59079106-please-don-t-tell-cooper-that-jack-is-a-rabbit"
}