{
  "title": "Born Innocent: Protecting the Dependents of Accused Caregivers",
  "description": "Over seven percent of all children in the United States--more than 5 million children--have experienced a parental incarceration, and an estimated 2.7 million children currently have a parent who is incarcerated. An additional 5 million children under age 18 live with at least one parent who is unauthorized to be in the United States and faces deportation. Children and other dependents suffer the collateral consequences of \"preventive justice\" measures increasingly used by liberal democratic countries to combat a broad range of suspected crime and anti-state activities. But what does the state owe to the innocent dependents of accused caregivers?In Born Innocent , Michael J. Sullivan explores the impact of vicarious punishment on children, with a particular focus on children in socioeconomically disadvantaged and racialized communities that are disproportionately subject to family separation based on their identity, allegiances, and immigration status. Sullivan advocates a turn from retribution to rehabilitation for convicted offenders, with a view towards helping them to become more effective caregivers who can continue to support their dependents during their sentence.Born Innocent goes beyond the children's rights literature on the collateral consequences of punishment to consider how \"punishment drift\" creates problems for both retributive and utilitarian theories of punishment. He draws on care ethics theory to widen our understanding of the range of collateral victims of punishment as well as possible rehabilitative and restorative measures. Sullivan also considers the limits of this approach, especially where it pertains to offenders who victimize their families, and those who resist rehabilitation and persist in anti-state actions that harm others. Original and compelling, Born Innocent provides one of the first unified treatments of state-sponsored family separation and its impact on disadvantaged citizens and immigrants.",
  "genres": [],
  "author": "Michael J. Sullivan",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/128125982-born-innocent"
}