{
  "title": "Protecting America's Health: The FDA, Business, and One Hundred Years of Regulation",
  "description": "Emerging out of the era of the robber barons and Theodore Roosevelt’s desire to “civilize capitalism,” the Food and Drug Administration was created to stop the trade in adulterated meats and quack drugs. In the almost one hundred years since, it has evolved from a squad of eleven inspectors dogging dishonest tradesmen into America’s most important regulatory agency, keeping tabs on the products of about 95,000 businesses and more than $1 trillion worth of goods annually.This book shows how the agency combats self-serving political and industrial interests and protects Americans from hazardous medicines, medical devices, and foodstuffs while enforcing rigorous scientific standards. Hilts takes us back to the FDA’s beginnings, when it confronted businesses that acknowledged no limitations on what could be brought to market or on the claims they could make for a product. With the coming of the FDA, our government, for the first time, was able to force the removal of toxic elixirs from the shelves and to insist on accurate labeling.We see the subsequent fights the FDA waged, and won, for mandatory testing, and against such conservatives as—in our own time—Ronald Reagan and Newt Gingrich, who tried to curtail regulation. We see how the FDA protected the American consumer from thalidomide and other lethal pharmaceuticals, how it took on the tobacco industry, and how it stumbled in confronting the deadly mysteries of AIDS. And we are given, as well, a litany of extraordinary corporate excesses that the FDA has exposed and successfully battled.Protecting America’s Health shows society adapting to both the burgeoning of science and technology and the ascendancy of the capitalist market. It makes startlingly clear the essential role the FDA has played in maintaining and protecting the quality of life—and health—to which the American public has long been accustomed.",
  "genres": [
    "Nonfiction",
    "Food",
    "Science",
    "Health Care",
    "History"
  ],
  "author": "Philip J. Hilts",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/590638.Protecting_America_s_Health"
}