{
  "title": "Not a Chance in Hell",
  "description": "From USA Today bestselling author A. M. Madden comes a strangers-to-lovers stand-alone novel about a woman whose father leaves her a building in New York—along with an impossible-to-resist co-owner.Do you know that feeling when life is moving along without incident, but in your gut you sense something is coming? Yeah… me too.That something turned out to be property I inherited from my estranged father. One small problem: my father lived in New York City, while I live in California. Oh, another thing… my dad thought it’d be a good idea to split the building he owned in SoHo between me and his tenant, the undeniably maddening Brad Navarro.An interesting thing about Brad, though—he is an identical triplet. Yes, there are three of these gorgeous specimens walking the earth. Another fun fact—he owns a successful bar on the ground floor of the address we now share, as well as the entire first floor… but I own floors two, three, and four. Nice and complicated, right?I simply can’t be tied to this man. Besides the fact I happen to love my life in California, I want no connection to the cocky, arrogant, ridiculously gorgeous, sexy-as-sin, thinks he’s God’s gift to women, walking orgasm who can rock my world with that damn smirk—Um, I digress. Anyway, I just can’t.Of course I suggested that we sell, which earned me the nickname She-Devil, and I believe his exact words were “not a chance in hell.”So now I need to figure out a way to make hell freeze over. My chances of that happening are slim. Plan B would be to simply ignore him, go back to my life, and pretend he hadn’t crashed into it.But try telling that to my libido, because ignoring Brad Navarro is easier said than done.Not a Chance in Hell is book 3 in the stand-alone novel series, Navarro Triplets.Not According to Plan - Max's bookNot Happening Again - Nate's bookNot a Chance in Hell - Brad's bookWarning: This book is meant for mature readers 18+. It contains explicit language and graphic sexual content.",
  "genres": [
    "Enemies To Lovers"
  ],
  "author": "A.M. Madden",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/59067227-not-a-chance-in-hell"
}