{
  "title": "Mistress in the Making",
  "description": "For Jane Austen fans who always wished her fun and witty books had more heat.The sweet and spicy Mistress in the Making historical romance bundle is a fun, “sexy Jane Austen styled”, emotionally satisfying tale told in three parts: Seductive Silence, Lusty Letters, and Daring Declarations. This digital box set contains the complete series and a heart warming HEA.Seductive Silence (Book 1) – Pestered by a persistent stammer, a regency lord with a keen interest in orreries and boxing—but not in talking—must find a way to woo his new mistress without words.Recently widowed and increasingly poor, Thea’s been reduced to sharing her rented room with rodents and arguing over every morsel (the mice usually win). So when a friend suggests Thea consider a scandalous alliance, she cannot help but be intrigued…though given the lackluster nature of her tepid marriage, she doubts her ability to tempt—much less please—an experienced man.Lusty Letters (Book 2) – Hampered by his traitorous mouth, Daniel takes to writing letters to woo his new mistress, little realizing how their fun, flirty exchanges will quickly become the light of his day. Or how wretched he’ll feel when the charming Thea suggests they banter in person, possibly pen poetry—together. Blazing ballocks! Is she insane?Thea’s fascinating new protector has secrets—several. Hesitant to destroy her newfound circumstances, she stifles her longing to know everything about the powerfully built—and frustratingly quiet—Marquis. But then his naughty notes start to appear, full of humor and wit, and Thea realizes she’s about to break the cardinal rule of mistressing—that of falling for her new protector. Egad.Daring Declarations (Book 3) – Thea’s fallen under the enticing spell of her new protector. How could she not when his very presence, every kindness and sensual touch has utterly seduced her senses? Yet her mind insists on knowing more, such as why must he pummel his face in boxing matches and be so abrupt in person?An evening at the opera could prove Lord Tremayne’s undoing… Introducing one’s socially unacceptable strumpet to his stunned family is never done. But Daniel does it anyway. And it might just be the best decision he’s ever made, for Thea’s quickly become much more than a mistress—and it’s time he told her so.",
  "genres": [
    "Regency"
  ],
  "author": "Larissa Lyons",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/59089593-mistress-in-the-making"
}