{
  "title": "Bone Deep: Untangling the Betsy Faria Murder Case",
  "description": "The explosive, first-ever insider’s account of the case that’s captivated millions--the murder of Betsy Faria and the wrongful conviction of her husband--told by Joel J. Schwartz, the defense attorney who fought for justice on behalf of Russell Faria, and New York Times bestselling author Charles Bosworth Jr.On December 27th, 2011, Russell Faria returned to his Troy, Missouri, home after his weekly game night with friends to an unthinkable, grisly scene: His wife, Betsy, lay dead, a knife still lodged in her neck. She’d been stabbed fifty-five times. First responders concluded that Betsy had been dead for hours when Russ discovered her. No blood was found implicating Russ, and surveillance video, receipts, and friends’ testimony all supported his alibi--yet incredibly, police and the prosecuting attorney ignored the evidence. In their minds, Russ was guilty, but prominent defense attorney Joel J. Schwartz quickly recognized the real killer. The motive was clear. Days before her murder, the terminally ill Betsy replaced her husband with her friend, Pamela Hupp, as her life insurance beneficiary. Still, despite the prosecution’s flimsy case and Hupp’s transparent lies, Russ was convicted--leaving Hupp free to kill again. Bone Deep takes readers through the perfect storm of miscalculations and missteps that led to an innocent man’s conviction, and recounts Schwartz’s successful battle to have that conviction overturned. Written with Russ Faria’s cooperation, and filled with chilling new revelations and previously undisclosed evidence, this is the story of what can happen when police, prosecutor, judge, and jury all fail in their duty to protect the innocent and let a killer get away with murder.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "History",
    "Mystery",
    "Contemporary"
  ],
  "author": "Charles Bosworth Jr.",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/59090300-bone-deep"
}