{
  "title": "Patricia Wants to Cuddle",
  "description": "The contestants of a reality television dating show compete for love—and their lives—in this pulse-pounding and viciously funny fiction debut from the GLAAD Award-winning author of Real Queer America.When the final four women in competition for an aloof, if somewhat sleazy, bachelor's heart arrive on a mysterious island in the Pacific Northwest, they mentally prepare themselves for another week of extreme sleep deprivation, invasive interviews, and of course, the salacious drama that viewers nationwide tune in to eagerly devour. Each woman came on 'The Catch' for her own reasons—brand sponsorships, followers, and yes, even love—and they've all got their eyes steadfastly trained on their respective prizes.Enter Patricia, a temperamental, but woefully misunderstood local, living alone in the dark, verdant woods and desperate to forge a connection of her own. As the contestants perform for the cameras that surround them, Patricia watches from her place in the shadows, a queer specter haunting the bombastic display of heterosexuality before her. But when the cast and crew at last make her acquaintance atop the island's tallest and most desolate peak, they soon realize that if they're to have any hope of making it to the next Elimination Event, they'll first have to survive the night.A whirlwind romp careening toward a last-girl-standing conclusion and a scathing indictment of contemporary American media culture, Patricia Wants to Cuddle is also a love story: between star-crossed lesbians who rise above their intolerant town, a deeply ambivalent woman and her budding self-actualization, and a chosen family of misfit islanders forging community against all odds.",
  "genres": [
    "Horror",
    "Fiction",
    "LGBT",
    "Queer",
    "Audiobook",
    "Lesbian",
    "Romance"
  ],
  "author": "Samantha  Allen",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/59093587-patricia-wants-to-cuddle"
}