{
  "title": "A Mind That Found Itself: A Memoir of Madness and Recovery",
  "description": "Clifford Beers tells what it was like to be institutionalized at a time when mental illness received little attention or respect. A Mind that Found Itself is Beers’ own story, as one of five children who all suffered psychological distress and were all confined to mental institutions at one time or another. Beers, who wrote the book after his own confinement, gained the support of the medical profession and was a leader in the mental hygiene movement. A Mind that Found Itself has been an inspiration to many mental health professionals in their choice of a profession. It also did much to help the rest of the world see mental health issues as a serious disease.Clifford Whittingham Beers (1876-1943) was the founder of the American mental hygiene movement. Beers was born in New Haven, Connecticut to Ida and Robert Beers on March 30, 1876. He was one of five children, all of whom would suffer from psychological distress and would die in mental institutions, including Beers himself (see “Clifford W. Beers, Advocate for the Insane”). He graduated from the Sheffield Scientific School at Yale in 1897. In 1900 he was first confined to a private mental institution for depression and paranoia. He would later be confined to another private hospital as well as a state institution. During these periods he experienced and witnessed serious maltreatment at the hands of the staff. After the publication of A Mind That Found Itself (1908), an autobiographical account of his hospitalization and the abuses he suffered during, he gained the support of the medical profession and others in the work to reform the treatment of the mentally ill. In 1909 Beers founded the National Committee for Mental Hygiene, now named Mental Health America, in order to continue the reform for the treatment of the mentally ill. He also started the Clifford Beers Clinic in New Haven in 1913, the first outpatient mental health clinic in the United States. He was a leader in the field until his retirement in 1939.",
  "genres": [
    "Psychology",
    "Mental Health",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "History"
  ],
  "author": "Clifford Whittingham Beers",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/590877.A_Mind_That_Found_Itself"
}