{
  "title": "Masaru",
  "description": "“Be like wheat whereas the taller you grow,the lower you bow your head to the ground.”~Japanese ProverbIn the mid-16th century AD, Christianity arrived in Japan. Heralded by daring Jesuits from Spain and Portugal zealous to bring the Gospel of Jesus Christ to the four corners of the earth, Christianity soon took root in that distant land. At that time, Japan was fractured among warring states as feudal lords known as daimyo vied for supremacy. From the first day, the Catholic faith found surprising acceptance among Japanese of all social status and within fifty years, Japanese converts known as Kirishitans numbered in the hundreds of thousands.But with the advent of a unified Japan under the powerful Tokugawa shogunate in the early 17th century, things began to change. While the Tokugawa shoguns appreciated European weapons and trade goods, they had little use for the foreign religion, whose success came to be viewed with increasing suspicion and hostility.Shiro Nakagawa comes from a family of recent converts living near Hitoyoshi castle on the island of Kyushu. A young man of the samurai class, Shiro studies to be a healer, but has also heard the call to become a Catholic priest. His plans for the future, however, are disrupted when the Shogun in Kyoto orders all churches closed throughout Japan. All gaijin priests are to be expelled from the country. All Christian practices and images are summarily banned. This order leads to widespread persecution, abuse and even slaughter of Christians throughout the islands.When the small church of Saint Michael in Hitoyoshi is closed, its priest Fr. Olivera arrested, and his friend Kumiko brutally attacked, Shiro knows he must take action. Along with his boyhood friend, Tomi, Shiro embarks on a mission to rescue Fr. Olivera and defend the helpless Kirishitans of southern Kyushu. Along with an army of ronin and outraged villagers, Shiro captures the castle at Yatsushiro, sheltering tens of thousands of Christian refugees. But even as the spark of justified resistance begins to burn, Shiro and his comrades realize that it's only a matter of time before the Shogun’s army descends upon Yatsushiro in full force deploying new and terrifying European weapons.Masaru is an historical novel which paints the travails of the first Japanese Christians in brilliant colors. Author Michael T. Cibenko utilizes his expert knowledge of Japanese culture and language to create a memorable and authentic epic of early Christian Japan which entertains the reader while effortlessly conveying a lesson on this fascinating and complex period of history.\"In a manner reminiscent of Clavell’s Shogun, Masaru transports the reader to medieval Japan with realism that delights the senses, offering up a blend of history, philosophy and adventure. Based on events little known to those in the West, Masaru artfully presents the faith with a compelling synthesis of action and dialog. Calling upon his own heritage and experiences living in Japan, the author brings to life with vivid textures the characters and settings of the tale. Timeless truths of the faith are presented with fidelity, yet in a manner that is both refreshing and provocative. This is a must-read for anyone who appreciates Japanese culture, lovers of history and philosophy, or those who simply enjoy an exceptionally well-told story.\"—Jeffrey Bond, PhD, The University of Chicago",
  "genres": [
    "Historical"
  ],
  "author": "Michael T. Cibenko",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/59083715-masaru"
}