{
  "title": "Welcome, Silence",
  "description": "This is the amazing true story of one woman's journey deep into mental illness and her return to sanity -- and to a successful life and career. Carol North was diagnosed with schizophrenia in college. The story of her life is traced from her early life in a middle class small-town family in the Midwest. For many years, Carol struggled against overwhelming odds to achieve in school in spite of her illness and was finally admitted to medical school to pursue her hopes and dreams of becoming a doctor. In medical school, however, she slid further into psychosis and finally succumbed the inexorable incapacitation so often characteristic of the illness. Carol was fortunate enough, however, to find a skilled psychiatrist who understood her dedication to becoming a physician and who worked with her to stay well enough to remain in school. When all hope seemed lost, her doctor enrolled her in an experimental dialysis program, similar to the treatment given to patients with kidney failure. With this treatment, her illness went away and she no longer required medication for it. This engrossing and ultimately triumphant story of courageous struggle against mental illness will inspire anyone who has ever had to battle for achievement against overwhelming odds. After recovering from her illness, Carol returned to school and received her medical degree from Washington University School of Medicine in St. Louis, Missouri in 1983. She then completed her internship and residency at Barnes Hospital/Washington University, and subsequently obtained a masters degree in psychiatric epidemiology (the study of psychiatric disorders in populations) while simultaneously pursuing a NIMH fellowship in psychiatric epidemiology at Washington University. Dr. Carol North is currently a board-certified psychiatrist and full Professor of Psychiatry at Washington University School of Medicine. She treats patients with schizophrenia and a range of psychiatric illness, trains young physicians and psychiatrists, and pursues federally funded research in psychiatric epidemiology. She is the recipient of numerous national awards and has appeared on many national television and radio programs.",
  "genres": [
    "Memoir",
    "Psychology",
    "Nonfiction",
    "Biography",
    "Mental Health",
    "Mental Illness",
    "Health"
  ],
  "author": "Carol S. North",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/590919.Welcome_Silence"
}