{
  "title": "Her Majesty's Royal Coven",
  "description": "If you look hard enough at old photographs, we're there in the background: healers in the trenches; Suffragettes; Bletchley Park oracles; land girls and resistance fighters. Why is it we help in times of crisis? We have a gift. We are stronger than Mundanes, plain and simple.At the dawn of their adolescence, on the eve of the summer solstice, four young girls--Helena, Leonie, Niamh and Elle--took the oath to join Her Majesty's Royal Coven, established by Queen Elizabeth I as a covert government department. Now, decades later, the witch community is still reeling from a civil war and Helena is now the reigning High Priestess of the organization. Yet Helena is the only one of her friend group still enmeshed in the stale bureaucracy of HMRC. Elle is trying to pretend she's a normal housewife, and Niamh has become a country vet, using her powers to heal sick animals. In what Helena perceives as the deepest betrayal, Leonie has defected to start her own more inclusive and intersectional coven, Diaspora. And now Helena has a bigger problem. A young warlock of extraordinary capabilities has been captured by authorities and seems to threaten the very existence of HMRC. With conflicting beliefs over the best course of action, the four friends must decide where their loyalties lie: with preserving tradition, or doing what is right.Juno Dawson explores gender and the corrupting nature of power in a delightful and provocative story of magic and matriarchy, friendship and feminism. Dealing with all the aspects of contemporary womanhood, as well as being phenomenally powerful witches, Niamh, Helena, Leonie and Elle may have grown apart but they will always be bound by the sisterhood of the coven.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Witches",
    "LGBT",
    "Queer",
    "Audiobook",
    "Adult"
  ],
  "author": "Juno  Dawson",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/59088433-her-majesty-s-royal-coven"
}