{
  "title": "Mercury Pictures Presents",
  "description": "The epic tale of a brilliant woman who must reinvent herself to survive, moving from Mussolini's Italy to 1940s Los AngelesLike many before her, Maria Lagana has come to Hollywood to outrun her past. Born in Rome, where every Sunday her father took her to the cinema instead of church, Maria immigrates with her mother to Los Angeles after a childhood transgression leads to her father's arrest.Fifteen years later, on the eve of America's entry into World War II, Maria is an associate producer at Mercury Pictures, trying to keep her personal and professional lives from falling apart. Her mother won't speak to her. Her boss, a man of many toupees, has been summoned to Washington by congressional investigators. Her boyfriend, a virtuoso Chinese-American actor, can't escape the studio's narrow typecasting. And the studio itself, Maria's only home in exile, teeters on the verge of bankruptcy.Over the coming months, as the bright lights go dark across Los Angeles, Mercury Pictures becomes a nexus of European émigrés: modernist poets trying their luck as B-movie screenwriters, once-celebrated architects becoming scale-model miniaturists, and refugee actors finding work playing the very villains they fled. While the world descends into war, Maria rises through a maze of conflicting politics, divided loyalties, and jockeying ambitions. But when the arrival of a stranger from her father's past threatens Maria's carefully constructed facade, she must finally confront her father's fate--and her own.Written with intelligence, wit, and an exhilarating sense of possibility, Mercury Pictures Presents spans many moods and tones, from the heartbreaking to the ecstatic. It is a love letter to life's bit players, a panorama of an era that casts a long shadow over our own, and a tour de force.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Literary Fiction",
    "Historical",
    "Audiobook",
    "Italy",
    "Book Club"
  ],
  "author": "Anthony Marra",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/59109471-mercury-pictures-presents"
}