{
  "title": "Hidden Hands: The Lives of Manuscripts and Their Makers",
  "description": "A stunning book about significant medieval manuscripts; their authors, their histories and the moments that mark their lifetimes.---Mary Wellesley studied English Language and Literature at Lincoln College, Oxford, before gaining a PhD from University College, London in 2017. She is now a full time free-lance writer but continues to teach courses on medieval language and literature as part of the British Library's Adult Learning programme. Her work has appeared in The London Review of Books, The New York Review of Books and The Times Literary Supplement, amongst others.---This is an engaging and beautiful book - the engagement arising from the author's deep commitment to understanding the lives of medieval women and men, and the beauty from her ability to make us see and hear them talking about and living their experiences. It isn't just an introduction to literary manuscripts but also a series of glimpses of the extraordinary diversity of medieval lives. Mary Wellesley has taken jewels from our bibliographic treasures and placed them, carefully and with love, in the palm of the reader's hand -- Ian MortimerMary Wellesley is a born storyteller and Hidden Hands is as good as historical writing gets. Wellesley draws on her deep scholarly knowledge of medieval manuscripts to weave a captivating tale, told through generations of 'tremulous hands' and forgotten artistic geniuses, whose works inform so much of what we know today about the Middle Ages. This is a sensational debut by a wonderfully gifted historian. -- Dan Jones, bestselling author of The Plantagenets and The Templars.Their creators being largely anonymous, Medieval manuscripts tell their own stories in this Decameron of devotion and obsession, encryption and skullduggery, extravagance, destruction, and survival. The result is an unexpectedly swift page-turner on the era when pages were turned slowly. -- Eliot Weinberger, author of Angels & SaintsHidden Hands shines with 'bibliophilic feeling.' With care forensic and literary, Wellesley reveals the traces of their history legible in the pores of the page and in the process provides a page-turner of her own. ― Amaranth Borsuk, author of The BookMary Wellesley has written a most original book which is at once a vivid personal account of scholarly detective work and a model of how history might be taught now that there is easy electronic access to ancient manuscripts. She traces the precarious survival of the the earliest books, expounds with clarity the methods and purposes of authors, scribes, patrons, annotators and illustrators and speculates with sympathy on their motives. Hands (especially female ones) assume personalities, indeed voices which are recognisable even when alien - and often urgently appealing. -- Nicholas PennyAuthors may write their books, but they don''t make them. Here is the chance to meet the women and men who actually made the cathedrals and palaces of medieval English literature, from the St Cuthbert Gospel to the Luttrell Psalter, from Beowulf to Chaucer. Mary Wellesley tells us about the authors, but more important, she introduces us to the artists, the ink-makers, vellum preparers and pigment grinders - and all the others who contributed their different gifts to these great communal achievements. To read this book is to meet the makers of the English literary middle ages. -- Neil MacGregorHidden Hands is a delight - immersive, conversational, and intensely visual, full of gorgeous illustrations and shimmering description. Mary Wellesley explores the lives of medieval manuscripts, and the men and - importantly - women who made them, with deep learning and unmistakable love.― Helen CastorIt is very seldom you read a book which offers gifts on every page, every paragraph, every sentence. I learned more, and was more delighted, reading Hidden Hands that the last dozen books I read. Her book brings you into the heart's core of literature and I loved it.-- Andrew O'HaganIn an age moving ever more quickly away from the physical book, Hidden Hands conjures up in vivid detail the pleasures of reading and making manuscripts. Mary Wellesley's joy in telling the stories of books long lost and found, and voices forgotten and recovered, is palpable on every page. I finished this book with a burning desire to get back to the archives.-- Ramie Targoff, author of Renaissance WomanMary Wellesley brings early Britain alive with this exciting account of the hidden world of old manuscripts. Far from an arid examination of dusty parchments this is an exhilarating journey of discovery, full of new insights not least, as the title implies , the important but unrecognised role women played in political and religious life. A refreshing and original vision of who we once were.-- David DimblebyWith her richly detailed, personal, multi-layered and unexpected stories about manuscripts and their makers - scribes and patrons, illuminators and parchment-makers - Mary Wellesley brings vividly before us anonymous and forgotten figures, several of them women. Writing con amore, she celebrates the sensuous processes involved and chronicles the vicissitudes of the works' survival: this is a warm, enthralling and original contribution to the history of the book.-- Mariner Warner",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Art",
    "Historical",
    "Art History"
  ],
  "author": "Mary Wellesley",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/59125668-hidden-hands"
}