{
  "title": "House of Daemon",
  "description": "My name is Ady. I’ve been running, hiding in the open, for as long as I can remember. My goal has always been to appear normal, mundane, so I was left alone.I had accomplished that for more than a decade but life was calling now. I was finishing my degree and facing what every person faces: life. Consequences. Responsibility.University had given me a taste of things I’d never had before. Stability. Friends to miss me if I stop showing up. The promise of a future I wasn’t sure I’d ever see.But it had also shown me what I didn’t have and likely wouldn’t ever get. Anonymity to live this life that I was preparing for. To have a job and an apartment. To keep my friends. To find someone to love me - to build a life with me.The week before graduation, I was handed a brochure at the career fair advertising something called ‘The Harem Project’ in which you can opt to tie into a family. A group of men. A group of women. A mix. Whatever you’re interested in. Through a series of tests and questions, I was given a tablet with a list of the harems that I would fit in with, based on our compatibility.That’s where I met the five gloriously gorgeous men of the House of Daemon.And my life has never been the same. Most days, I’m sure it's for the better. I thought I might actually get everything I never dreamed of wanting.But other days I was sure my death was going to be much quicker. Because the men - they’re not normal. And what’s been hunting me has now teamed up with what’s hunting them.They’re not human.But then, neither am I.**This is a story in which the female main character does not have to choose between love interests. Story contains violence, dark pasts, briefs glimpses of torture, and explicit sex scenes. Intended for mature audiences.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Demons",
    "Paranormal Romance",
    "Magic"
  ],
  "author": "Crea Reitan",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/59115404-house-of-daemon"
}