{
  "title": "Fighting Identity: Sacred War and World Change",
  "description": "This work highlights a national ethos infused by a sacred narrative of divine mission. This deep association leads to a narrow approach to conflict relationships, built around an Us vs. Them distance from the enemy, in which their submission is achieved through kinetic effects and their subsequent redemption through our good works (reconstruction). Vlahos contends that America's difficult engagement in the Muslim world demonstrates urgently that different operational approaches and tactics (like counterinsurgency) are not enough. Alternative paradigms of strategic engagement are needed, but their very consideration requires deeper cultural rethinking about how we assess world change and other cultures, and how our national ethos makes war.Why are terrorists and insurgents we fight so formidable? Their strength - and our vulnerability - is in identity. Clausewitz knew that geist (spirit) was always stronger than the identity is power in war. But how can non-state actors face up to nation states? The answer is in globalization. This is the West's 3rd globalization. Two centuries of intense mixing has torn down old ways of life and created a growing demand for new belonging. There is also a decline in US universalism. America's vision as history's anointed prophet and manager is now competing head-to-head with renewed universal visions. Like Late Antiquity and the High Middle Ages our globalization begins to subside. We may be in the later days of American modernity. We can see this worldwide, as emerging local communities within states and meta-movements find their voice - through conflict and war. Identities struggling for realization are always the most powerful. Add the diffusion of new technology and new practice, and even the poorest and seemingly most primitive group can now make war against those on high. They are successful because of a symbiotic fit between old states and new identities. Increasingly, old societies no longer find identity-celebration in war - while non-state identities embrace the struggle for realization. Hence non-state wars with America become a mythic narrative for them. Our engagement actually helps them realize identity - and we become the midwife. This book offers another path to deal with non-state challenges, one that does not further weaken us.",
  "genres": [
    "Military Fiction"
  ],
  "author": "Michael Vlahos",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/5911280-fighting-identity"
}