{
  "title": "Social (In)justice: Why Many Popular Answers to Important Questions of Race, Gender, and Identity Are Wrong--and How to Know What's Right: A Reader-Friendly Remix of Cynical Theories",
  "description": "This is a book about ideas. Specifically, this is a book about the evolution of a certain set of ideas, and how these ideas have come to dominate every important discussion about race, gender, and identity today. Have you heard someone refer to language as literal violence, or say that science is sexist? Or declare that being obese is healthy, or that there is no such thing as biological sex? Or that valuing hard work, individualism, and even punctuality is evidence of white supremacy? Or that only certain people—depending on their race, gender, or identity—should be allowed to wear certain clothes or hairstyles, cook certain foods, write certain characters, or play certain roles? If so, then you’ve encountered these ideas. As this reader-friendly adaptation of the internationally acclaimed bestseller Cynical Theories explains, however, the truth is that many of these ideas are recent inventions, are not grounded in scientific fact, and do not account for the sheer complexity of social reality and human experience. In fact, these beliefs often deny and even undermine the very principles on which liberal democratic societies are built—the very ideas that have allowed for unprecedented human progress, lifted standards of living across the world, and given us the opportunity and right to consider and debate these ideas in the first place! Ultimately, this is a book about what it truly means to have a just and equal society—and how best to get there.Cynical Theories is a Wall Street Journal, USA Today, and Publishers Weekly bestseller. Named a 2020 Book of the Year by The Times, Sunday Times, and Financial Times, it is being translated into more than fifteen languages.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Sociology",
    "Philosophy",
    "Psychology"
  ],
  "author": "Helen Pluckrose",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/59113013-social-in-justice"
}