{
  "title": "Annihilate Me, Baby",
  "description": "#1 International bestselling author Christina Ross returns with a laugh-out-loud romantic comedy in her wildly popular Annihilate Me series, which has sold over 3.5 million copies in six different languages. This book is a love letter to the fans of the series—but it also can easily be read as a stand-alone novel.In Annihilate Me, Baby, the pressure on Jennifer isn’t just significant—it’s overwhelming. Crushing. Annihilating…First, nanny Helga needs to rush to Moscow to be with her ailing sister, Manya, thus leaving Jennifer and Alex without childcare while they still must find time to run their conglomerate, Wenn Enterprises. So what to do with Aiden, who is now two-and-a-half years old—and who apparently has a rocket attached to his back? Second, before Helga left, Jennifer and Alex decided to get pregnant again. Despite Helga’s absence, Alex is as determined as ever to get that done. Since Jennifer doesn’t want to disappoint him simply because they don't have a nanny, they start having sex everywhere—literally everywhere (!)—and at the most inopportune of times. With so much going on, it’s not long before Jennifer is sexed-up to the point of exhaustion.Finally, there’s Dame Hélène Mirage, the two-time Academy Award-winning actress who is hired to be the face of Wenn Cosmetic’s new skincare line, Age Perfected. She’s seventy-five, her next film is a remake of the camp classic ‘Whatever Happened to Baby Jane?’, and in no time, she lives up to her storied reputation for being a full-on diva. Her weird demands and bizarre behavior become so much for Jennifer to handle that soon Alex is brought in to temper the situation. But does he even stand a chance when there’s an unhinged diva on the loose?Annihilate Me, Baby brings Alex and Jennifer closer than they’ve ever been—all while Blackwell and Tank choose to do a little sleuthing on the sly when they decide that getting Mirage in line can only be done with a threat that could end her career…In Annihilate Me, Baby, readers will find all of their favorite characters reconnecting two years after Lisa and Tank’s wedding in Unleash Me: Wedding. It’s the Annihilate Me series at its best!",
  "genres": [],
  "author": "Christina Ross",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/59115760-annihilate-me-baby"
}