{
  "title": "Yesterday's Gone: Season One",
  "description": "Start the first season of the groundbreaking post-apocalyptic Yesterday's Gone; the breakout horror/sci-fi series with over 1000 5-star reviews!They thought they were alone. But they were wrong...On October 15th, humanity went missing, leaving only a handful of scattered survivors behind. The world is now empty of friends, family, and neighbors.Among them, an eight-year-old child searches for his family, only to find a nightmare he never expected.A special agent turned enemy of the state survives a fiery plane crash with no way to reach his daughter. But is he who he says, or even thinks he is?A reporter will do anything to reconnect with his son, even if he has to wander the empty streets of Manhattan to find him, and even if those streets aren't really so empty.A mother and daughter are desperate to survive with their two remaining neighbors, on the run but with nowhere to go.A teenage boy who spent his life bullied and who might be the only person in the world that's happy to see it gone.And a brilliantly brutal serial killer who will do anything he can to stay at the top of the food chain.Now, these strangers must find the strength to survive in the new world.But they are not alone.In the absence of civilization, a new threat emerges. In the stillness, it waits and watches, preying on their weakness. Their only hope is to find more survivors, rise above their fear, and face the oncoming darkness.But can they unite before they too are lost? And can they all be trusted?Get Yesterday’s Gone now and see what thousands of readers like you have already discovered!★★★★★ \"I started reading this book and COULD. NOT. STOP. I read it at work. I read it in the bathroom. I admit it - I even read it a little while driving - during every stop light and every parking lot imitation I sat through on I-84. I couldn't put it down until I was done.\" -- Sidney von Katzendame★★★★★ \"So, first star is for creating the mystery. Second star is for the writing which sets the scene without weighing down the action with irrelevant and excessively detailed descriptions. Third star is for neatly balancing action with story so that neither outweighs the other. Fourth star is for the array of characters whose personalities and personal stories are built along the way. Fifth star is for making me want to continue the story and buy the next season.\" -- Tammy★★★★★ \"When Dickens wrote in serialized format he was paid by the word. This led to lengthy chapters that came to define the modern novel. If Platt & Wright could get paid per tense moment, they'd make serious bank.\" -- WMG★★★★★ \"I absolutely LOVE 'Yesterday's Gone', and although I haven't hit the explanation yet (and trust me, thinking of the possibilities of an explanation during Season 1 and 2 will drive you absolutely crazy), My time for me and my husband to read this series together every night is the best spent time in my day.\" -- Micah HarkinsSeason One of Yesterday’s Gone by Sean Platt and David W. Wright is a tense post-apocalyptic serialized thriller that will leave you guessing to the end. Combining TV’s thrilling, episodic nature with the in-depth character only found in novels, Yesterday’s Gone created a new wave in fiction.",
  "genres": [
    "Horror",
    "Post Apocalyptic",
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "Apocalyptic",
    "Fantasy"
  ],
  "author": "Sean Platt",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/12814430-yesterday-s-gone"
}