{
  "title": "Moonlight Legacy : (Book 3)",
  "description": "Reviews for the series so Moonlight Secrets (#1)\"A wonderful paranormal fantasy with a love triangle that will have you hooked.\"\"This book had me hooked from the first chapter, straight away the writing draws you in and before you know it you’ve read the whole book in a few hours.\"\"Amberly is feisty and I loved her character. She is my ideal female lead. Troy is hilarious and Logan is dreamy. And where to begin with Julian who falls hard for Amberly and there is no denying their connection.\"\"This was a really interesting story and the author is very imaginative to create the world she did! It's an enjoyable book, especially for anyone interested in the mystical. If you enjoyed Twilight, you'll enjoy this!\"Moonlight Changes (#2)\"After reading book 1 of this series, I picked up book 2 immediately and, like book 1, I couldn't put it down. The continuation of the story kept me interested and on the edge of my seat, but rolling in emotional turmoil right alongside Amberly.\"\"It’s a great story, captivating and engaging, definitely leaving you with wanting more.\"\"The book ends with a battle and a cliffhanger with lives hanging in the balance! Need book 3 asap!\"And now Moonlight Legacy (#3)’s all happening as I’ve seen in my dreams. Amberly learned who she was. Was united with those she should have known her entire life. Met her true mate.And then was torn from us all.But hope still springs, because in being lost, Amberly will find answers and learn the true strength of her heart.The last battle might have been lost, but the war has only just begun. And Amberly’s choices from here on will send out ripples that will shape the future of our world.But can an eighteen year old choose the right path when darkness and grief obscures every way forward?This is book 3 in the Dark Inheritance Series and should be read in order.",
  "genres": [
    "Fantasy"
  ],
  "author": "Laura Lukasavage",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/59121051-moonlight-legacy"
}