{
  "title": "Up from the Depths: Herman Melville, Lewis Mumford, and Rediscovery in Dark Times",
  "description": "Finalist for the National Book Critics Circle Award in BiographyA double portrait of two of America’s most influential writers that reveals the surprising connections between them—and their uncanny relevance to our age of crisisUp from the Depths tells the interconnected stories of two of the most important writers in American history—the novelist and poet Herman Melville (1819–1891) and one of his earliest biographers, the literary critic and historian Lewis Mumford (1895–1990). Deftly cutting back and forth between the writers, Aaron Sachs reveals the surprising resonances between their lives, work, and troubled times—and their uncanny relevance in our own age of crisis.The author of Moby-Dick was largely forgotten for several decades after his death, but Mumford helped spearhead Melville’s revival in the aftermath of World War I and the 1918–1919 flu pandemic, when American culture needed a forebear with a suitably dark vision. As Mumford’s career took off and he wrote books responding to the machine age, urban decay, world war, and environmental degradation, it was looking back to Melville’s confrontation with crises such as industrialization, slavery, and the Civil War that helped Mumford to see his own era clearly. Mumford remained obsessed with Melville, ultimately helping to canonize him as America’s greatest tragedian. But largely forgotten today is one of Mumford’s key insights—that Melville’s darkness was balanced by an inspiring determination to endure.Amid today’s foreboding over global warming, racism, technology, pandemics, and other crises, Melville and Mumford remind us that we’ve been in this struggle for a long time. To rediscover these writers today is to rediscover how history can offer hope in dark times.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "American History",
    "Literary Criticism",
    "Nature",
    "Literature"
  ],
  "author": "Aaron Sachs",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/59149225-up-from-the-depths"
}