{
  "title": "My Monticello",
  "description": "* Duration: 07:36:04 *In a daring and fierce debut work of fiction - the likes of which comes along once in a generation - Virginia's landscapes, emblems, and Thomas Jefferson's historic plantation set the. stage for a cast of unforgettable characters fighting for their right to exist in America.A young woman descended from Thomas Jefferson and Sally Hemings driven from her neighborhood by a white militia. A university professor studying racism by conducting a secret social experiment on his own son. A single mother desperate to buy her first home even as the world hurtles toward catastrophe. Each fighting to survive in America.Tough-minded, vulnerable, and brave, Jocelyn Nicole Johnson’s precisely imagined debut explores burdened inheritances and extraordinary pursuits of belonging. Set in the near future, the eponymous novella, “My Monticello,” tells of a diverse group of Charlottesville neighbors fleeing violent white supremacists. Led by Da’Naisha, a young Black descendant of Thomas Jefferson and Sally Hemings, they seek refuge in Jefferson’s historic plantation home in a desperate attempt to outlive the long-foretold racial and environmental unravelling within the nation.In “Control Negro,\" a university professor devotes himself to the study of racism and the development of ACMs (average American Caucasian males) by clinically observing his own son from birth in order to “painstakingly mark the route of this Black child too, one whom I could prove was so strikingly decent and true that America could not find fault in him unless we as a nation had projected it there.” Johnson’s characters all seek out home as a place and an internal state, whether in the form of a Nigerian widower who immigrates to a meager existence in the city of Alexandria, finding himself adrift; a young mixed-race woman who adopts a new tongue and name to escape the landscapes of rural Virginia and her family; or a single mother who seeks salvation through “Buying a House Ahead of the Apocalypse.”United by these characters’ relentless struggles against reality and fate, \n'MY MONTICELLO'\n is a formidable book that bears witness to this country’s legacies and announces the arrival of a wildly original new voice in American fiction.©2021 Jocelyn Nicole Johnson (P)2021 Macmillan Audio",
  "genres": [
    "Short Stories",
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Race",
    "Literary Fiction",
    "Book Club"
  ],
  "author": "Jocelyn Nicole Johnson",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/59128878-my-monticello"
}