{
  "title": "The Four-Part Key",
  "description": "An ancient proverb holds the key to restoring the long-awaited wizard fortress of Aero’set.Sitting in the front room of his family’s cottage, TY listens intently as Nyalis conveys the urgency of his upcoming quest. Having agreed to search out the four missing pieces of an age-old relic, Ty soon discovers how unprepared he is for a mission of this importance. Not only must he find the missing pieces and assemble them, he must survive long enough to figure out how to use them before the White Tower closes in.Desperate to reach Rhowynn ahead of Chief Inquisitor Sylas, FERRIN pushes his small band of convicts to their limits—his twin sister’s life depends on it. On foot, they fight their way through the harsh winter countryside of Sidara, hoping to find someone willing to help. But the help they find is not what they expect, and the battle that ensues will likely mean the end of them all.Still struggling with the loss of his memories, AYRION and his companions travel north, eager to find a safe haven in the rugged mountain community of Wellhollow. Instead, they find an army of Black Watch purging the town of wielders. And when a local seer reveals a disturbing prophecy that directly links his fate to hers, Ayrion finds himself donning his black leather coat and twin blades once again.Meanwhile, in Easthaven, ADARRA makes a shocking discovery. Not only were the Tallosians who attacked her home part of Mangora’s scheme, it seems they are also part of a much larger invasion—an invasion Easthaven isn’t prepared to withstand.The third book in this award-winning epic fantasy saga continues where the second left off, with a world in desperate need of saving, as powers beyond their control threaten to bring the Five Kingdoms to its knees.",
  "genres": [
    "Fantasy",
    "Audiobook",
    "Magic",
    "Science Fiction Fantasy",
    "Epic Fantasy",
    "Fiction"
  ],
  "author": "Michael Wisehart",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/59148039-the-four-part-key"
}