{
  "title": "Under the Skin: The Hidden Toll of Racism on American Lives and on the Health of Our Nation",
  "description": "PULITZER PRIZE FINALIST • \"A stunning exposé of why Black people in our society 'live sicker and die quicker'—an eye-opening game changer.\"— Oprah DailyFrom an award-winning writer at the New York Times Magazine and a contributor to the 1619 Project comes a landmark book that tells the full story of racial health disparities in America, revealing the toll racism takes on individuals and the health of our nation.In 2018, Linda Villarosa's New York Times Magazine article on maternal and infant mortality among black mothers and babies in America caused an awakening. Hundreds of studies had previously established a link between racial discrimination and the health of Black Americans, with little progress toward solutions. But Villarosa's article exposing that a Black woman with a college education is as likely to die or nearly die in childbirth as a white woman with an eighth grade education made racial disparities in health care impossible to ignore.Now, in Under the Skin , Linda Villarosa lays bare the forces in the American health-care system and in American society that cause Black people to “live sicker and die quicker” compared to their white counterparts. Today's medical texts and instruments still carry fallacious slavery-era assumptions that Black bodies are fundamentally different from white bodies. Study after study of medical settings show worse treatment and outcomes for Black patients. Black people live in dirtier, more polluted communities due to environmental racism and neglect from all levels of government. And, most powerfully, Villarosa describes the new understanding that coping with the daily scourge of racism ages Black people prematurely. Anchored by unforgettable human stories and offering incontrovertible proof, Under the Skin is dramatic, tragic, and necessary reading.",
  "genres": [
    "Nonfiction",
    "Race",
    "History",
    "Science",
    "Health",
    "Politics",
    "Social Justice"
  ],
  "author": "Linda Villarosa",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/59148724-under-the-skin"
}