{
  "title": "Invisible Things",
  "description": "A sharp allegorical novel about a hidden human civilization, a crucial election, and a mysterious invisible force that must not be named, by one of our most imaginative comic novelistsWhen sociologist Nalini Jackson joins the SS Delany for the first manned mission to Jupiter, all she wants is a career opportunity: the chance to conduct the first field study of group dynamics on long-haul cryoships. But what she discovers instead is an entire city encased in a bubble on Europa, Jupiter's largest moon.Even more unexpected, Nalini and the rest of the crew soon find themselves abducted and joining its captive population, forced to start new lives in a place called New Roanoke.New Roanoke is a city riven by wealth inequality and governed by a feckless, predatory elite, its economy run on heedless consumption and income inequality. But in other ways it's different from the cities we already know: it's covered by an enormous dome, it's populated by alien abductees, and it happens to be terrorized by an invisible entity so disturbing that no one even dares acknowledge its existence.Albuquerque chauffeur Chase Eubanks is pretty darn sure aliens stole his wife. People mock him for saying that, but he doesn't care who knows it. So when his philanthropist boss funds a top-secret rescue mission to save New Roanoke's abductees, Chase jumps at the chance to find her. The plan: Get the astronauts out and provide the population with the tech they need to escape this alien world. The reality: Nothing is ever simple when dealing with the complex, contradictory, and contrarian impulses of everyday earthlings.This is a madcap, surreal adventure into a Jovian mirror world, one grappling with the same polarized politics, existential crises, and mass denialism that obsess and divide our own. Will New Roanoke survive? Will we?",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Fantasy",
    "Speculative Fiction",
    "Space",
    "Science Fiction Fantasy"
  ],
  "author": "Mat Johnson",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/59149030-invisible-things"
}