{
  "title": "What WE Lost: Inside The Attack on Canada’s Largest Children’s Charity",
  "description": "WE Charity had changed the game. In its 25 years, the international development charity and youth empowerment movement impacted lives the world over. Innovation was at its core: while most charities focus on making the world a better place for our children, WE Charity focused on making better children for our world. Founded by the ubiquitous Kielburger brothers, WE Charity operated more like a Silicon Valley start-up than a traditional NGO. From creating stadium-filling events with A-list celebrity ambassadors to building schools, infrastructure, a hospital and even a university at lightning speed, the organization was always full-throttle.Its for-profit partner, ME to WE, filled shelves with socially-conscious products that allowed consumers to track the impact of their spending, invited young people and families to visit and work in communities WE Charity supported, and channelled proceeds back into the charity to make it self-sustaining.Unique and disruptive, WE generated energy, engagement, and accolades. But it also bred misunderstanding and, in some quarters, resentment. With a long history of propelling youth to act in support of myriad causes—making “doing good doable,” the slogan went—WE Charity was the ideal candidate to administer the Canada Student Services Grant (CSSG) program. The program, if it had happened, involved matching students within non-profits in a summer in which Covid had stolen most job opportunities. And then, WE Charity in Canada was gone. It didn’t crumble. It crashed. Unwittingly caught in the crosshairs of a partisan fight that reflects the increasing “Americanization” of Canadian politics, WE Charity was forced to shutter its doors in Canada.Once a media darling with politicians of all stripes clamouring to appear at its events, the charity was suddenly a pariah accused (falsely) of a litany of wrongdoings: political cronyism; governance failures; heavy-handed decision-making by executives; lining the pockets of the founders; manipulating children; mistreating donors; racism and international corruption. Many were shocked. Detractors were delighted. Led by fringe commentators, the media quickly piled on. Allies who spoke out were castigated and forced to take cover. But while most Canadians have heard of the so-called “WE Charity Scandal”—at times forming strong views—few are able to recount the true facts.Misperceptions and confusion have ruled the day. And many of the most important voices—including those of educators and young people—have gone unreported and unheard. In this book, former WE board member and lawyer Tawfiq Rangwala unpacks the evidence and provides the critical context around the headline-grabbing controversies that have shaped the narrative. Drawing on the factual record, his personal experiences inside the organization, and extensive interviews with supporters and critics,Rangwala cuts through the fog and explains what really happened, why it happened, and who should be held to account. The author goes even deeper with insightful, compassionate and heartbreaking interviews with WE supporters, benefactors and the politicians that used the awarding of the contract during the global pandemic crisis to paint a picture of conflicts of interest and special favours by the Prime Minister. The world needs to have a balanced perspective on what this International charity has achieved while coming to terms with how the two founders handled the controversy in front of the cameras during testimony. Along the way, we learn what has been lost and the personal cost to Canadians and people around the world.More than just a story of the rise and fall of an iconic global charity, this is a cautionary tale of the collateral damage that can be levelled by unchecked partisan politics, social media pundits, and sensationalist headlines. In the end, Canadians are left to ponder whether the real “scandal” is the demise of WE Charity and the values of fair play and due process that most of us hold dear.",
  "genres": [
    "Nonfiction",
    "History",
    "Audiobook"
  ],
  "author": "Tawfiq S. Rangwala",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/59128861-what-we-lost"
}