{
  "title": "Murder Most Foul: The Killer and the American Gothic Imagination",
  "description": "Confronting murder in the newspaper, on screen, and in sensational trials, we often feel the killer is fundamentally incomprehensible and morally alien. But this was not always the popular response to murder. In Murder Most Foul , Karen Halttunen explores the changing view of murder from early New England sermons read at the public execution of murderers, through the nineteenth century, when secular and sensational accounts replaced the sacred treatment of the crime, to today's true crime literature and tabloid reports.The early narratives were shaped by a strong belief in original sin and spiritual redemption, by the idea that all murders were natural manifestations of the innate depravity of humankind. In a dramatic departure from that view, the Gothic imagination--with its central conventions of the fundamental horror and mystery of the crime--seized upon the murderer as a moral monster, separated from the normal majority by an impassable gulf. Halttunen shows how this perception helped shape the modern response to criminal transgression, mandating criminal incarceration, and informing a social-scientific model of criminal deviance.The Gothic expression of horror and inhumanity is the predominant response to radical evil today; it has provided a set of conventions surrounding tales of murder that appear to be natural and instinctive, when in fact they are rooted in the nineteenth century. Halttunen's penetrating insight into her extraordinary treasure trove of creepy popular crime literature reveals how our stories have failed to make sense of the killer and how that failure has constrained our understanding and treatment of criminality today.",
  "genres": [
    "True Crime",
    "History",
    "Nonfiction",
    "Crime",
    "Literary Criticism",
    "American History",
    "Religion"
  ],
  "author": "Karen Halttunen",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/591386.Murder_Most_Foul"
}