{
  "title": "Traitor to the Blood",
  "description": "Born a half-breed to an elven mother and human father, Leesil was raised in the Warlands as assassin, spy, and slave to Lord Darmouth, ruler to one of its independent provinces. But Leesil's mother trained him too well, and he used his skills to escape, leaving his parents to suffer Darmouth's wrath for all such traitors and their kin. Now, with newfound purpose in the company of his beloved Magiere, Leesil returns to confront the sins of his past and uncover his parents' fate.Unable to turn him from this dangerous course, Magiere follows Leesil into the darkness of his past in the Warlands. Knowing what may happen should Darmouth learn of Leesil's return, she is prepared to slaughter any who may try to take him from her. But Magiere's own past may well pose a more deadly threat. Two creatures of unfathomable power continue to stalk her — one who believes she's the key to his salvation, and one who seeks to destroy her... and all those she loves.\"This is one of those books for which the term 'dark fantasy' was definitely intended.\"    —Chronicle\"...the Hendees' Saga of the Noble Dead features generous helpings of blood-sucking horror and whodunit mystery elements. Literally overflowing with nonstop action, this cool amalgam of genres will appeal to readers — alive and undead — who enjoy taking that occasional literary walk on the wild side.\"    —Paul Goat Allen, Barnes & Noble Review\"The Hendees' bestselling Noble Dead series makes the leap from mass market to hardcover with this winning fourth novel... Fans of the series are sure to be pleased, while the novel stands well enough on its own to attract new readers.\"    —Publishers Weekly\"The personal conflicts of the heroes mirror the larger struggles in their world and provide a solid foundation for this tale of love and loyalty in a world of betrayal.\"    —Jackie Cassada, \"SF/Fantasy column\", Library Journal",
  "genres": [
    "Fantasy",
    "Vampires",
    "Fiction",
    "Paranormal",
    "Horror",
    "Dark Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Barb Hendee",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/591821.Traitor_to_the_Blood"
}