{
  "title": "Blood for Dignity: The Story of the First Integrated Combat Unit in the U.S. Army",
  "description": "Meticulously researched and wonderfully suspenseful, Blood for Dignity is the tale of a fascinating and little-known piece of World War II American history, seen through the eyes of 5th Platoon, K Company, 394th Regiment, 99th Division--the first black unit integrated with a white infantry company since the Revolutionary War. David P. Colley paints an absorbing, combat-heavy portrait of these African American and white men fighting together for their country—an historical event whose resonance would be felt for generations, and whose lesson would be transposed onto American society, shattering myths and destroying assumptions that had haunted blacks for years.The integration of African American platoons with white combat units at the tail end of World War II almost didn’t happen. With the pressing need for more troops and the vision of men such as Dwight Eisenhower, black soldiers who only wanted to fight for their country were finally given the opportunity in March of 1945. The performance of these soldiers laid to rest the accepted white attitude of a century and a half that African Americans were cowardly and inferior fighters. In fact, they proved to be just the opposite.From basic training in the deep south, to hard labor in Europe, these men traveled a long and difficult road before they could take up arms for their country. The 5th of K finally saw combat at the Remagen Bridgehead as they fought side-by-side with white soldiers, driving back a dangerous German army in 1945.Thanks to in-depth interviews with many of those who fought in and alongside the 5th of K, author David P. Colley mixes the horrors of war with the intensely personal in a way that brings us closer to the brave men of this Platoon—a group of soldiers whom readers will come to know and admire and not soon forget.",
  "genres": [
    "History",
    "World War II",
    "American History",
    "War",
    "American"
  ],
  "author": "David P. Colley",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/5918525-blood-for-dignity"
}