{
  "title": "Margot Mertz for the Win",
  "description": "Veronica Mars meets Moxie in the hilarious and thought-provoking sequel to Margot Mertz Takes it Down. Margot faces senior year working on a campaign for local election while helping a fellow student run for class president—but when a mysterious blackmail plot emerges, and a loathesome opponent rises in the class race, Margot might have to return to the cleanup job she thought she’d left behind.It’s senior year. And Margot’s on a mission to be a better Margot. Which means saying goodbye to her old cleanup ways— and their inherent moral ambiguities— and saying hello to… more yoga maybe? (Probably not, Margot hates exercise.)  To fill her time and round out her college application, Margot volunteers for Shep Green’s state senate campaign and in a twist, finds she actually enjoys being part of a team. She loves her new boss/mentor Priya. And of course it doesn’t hurt that the candidate is Avery Green’s dad. Yes, Avery and Margot are just friends, but it’s still nice to see his too perfect face from time to time.  Meanwhile at Roosevelt High, Margot finds herself roped into a second election, this one for school president. Melanie Jenkins is running against one of the monsters who created the revenge porn site Margot took down last year. Needless to say, Margot is #teamMelanie.  With Margot rocking both campaigns and maybe even making friends, it seems like she’s well on her way to being a better person. But when Priya asks her to look into an anonymous email threatening Shep Green, one that could potentially torpedo his entire election, Margot finds herself slipping back into her old habits.  She’s tried to keep her hands clean. But politics is a dirty job.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Audiobook",
    "Realistic Fiction",
    "Mystery",
    "Humor",
    "Fiction"
  ],
  "author": "Carrie McCrossen",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/59222466-margot-mertz-for-the-win"
}