{
  "title": "Blood, Fire and Gold: The story of Elizabeth I and Catherine de Medici",
  "description": "'A story told with verve and passion' The Times, Book of the Week'An alternative and engaging biography...accessible and unpretentious' The Telegraph' A stunning portrayal of two of the most powerful women in European history' Tracy Borman'Exciting and compelling, packed full of tantalising details of diplomacy and court life, Paranque succeeds both in bringing history to life, but also in putting flesh on the bones of these two extraordinary women and rival queens' Kate Mosse'A smart and stylish portrait of two of Europe's most remarkable rulers, a compelling profile of female power and - that rarest of things - a truly original book about the Tudor period' Jessie ChildsIn sixteenth-century Europe, two women came to hold all the power, against all the odds. They were Elizabeth I and Catherine de Medici.One a Virgin Queen who ruled her kingdom alone, and the other a clandestine leader who used her children to shape the dynasties of Europe, much has been written about these iconic women. But nothing has been said of their complicated thirty years of friendship, competition and conflict that changed the face of Europe.This is a story of two remarkable a story of blood, fire and gold. It is also a tale of ceaseless calculation, of love and rivalry, of war and wisdom - and of female power in a male world. Shining new light on their legendary kingdoms Blood, Fire and Gold provides a new way of looking at two of history's most powerful women, and how they shaped each other as profoundly as they shaped the course of history. Drawing on their letters and brand new research, Estelle Paranque writes an entirely new chapter in the well-worn story of the sixteenth century.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "Historical",
    "Audiobook",
    "France"
  ],
  "author": "Estelle Paranque",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/59220143-blood-fire-and-gold"
}