{
  "title": "Never Stay Gone",
  "description": "Six bodies in a single grave… in the same West Texas country where Dakota left everything behind. Every beat of my heart belongs to you. Thirteen years ago, Dakota Jennings thought he'd found his forever when he fell in love with Shane Carson. But one afternoon shattered their love story, and both Dakota and Shane left Rustler, Texas, with broken hearts. Even now, Dakota is still feeling the agony of losing Shane. Sure, he's a Texas Ranger, but that's not how he wanted to live his life. All he ever wanted was to love Shane. Loving you is the only time I feel alive. Shane's life was supposed to be different than this. There'd been a plan, ever since he was knee-high to his father. But falling for Dakota spun Shane's world upside down, and for years, Shane has had nothing but the memories of all that he lost: Dakota's gentle touch, and the sweetness of his lips, and the star-strewn nights they spent wrapped in each other's arms. West of the Pecos, there is no law. When the Rangers get the call about six bodies being pulled out of a mass grave in West Texas, the governor sends Dakota to run the investigation. Dakota heads back to his hometown and comes face-to-face with the last man he ever expected to see again: only now, he’s Deputy Shane Carson… Dakota's local partner assigned to the case. There's nothing Dakota wants more than a second chance with Shane, but so much is stacked against them: six corpses, a murderer on the loose, and history that refuses to stay buried. And the bodies keep piling up as Dakota and Shane try to run the killer down across the West Texas plains. In a moment, everything changes: the hunters become the hunted, the past fractures, and all Dakota thought he knew comes tumbling down. Secrets break wide open as Dakota remembers-- This is West Texas, and out here, nothing is as it seems. Big Bend County is a place of beauty and desolation, of secrets and small towns. Where the past and the present collide, and where nothing stays hidden forever. This MM romantic suspense is the first in the new Big Bend Texas Rangers series. Come along for the West Texas sunsets, the heart-pounding thrills, and the hard-won Happy Ever Afters.",
  "genres": [
    "M M Romance",
    "Mystery",
    "Romance",
    "Second Chance",
    "Contemporary",
    "Crime",
    "Suspense"
  ],
  "author": "Tal Bauer",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/59223355-never-stay-gone"
}