{
  "title": "Principles of Evolutionary Medicine",
  "description": "Evolutionary science is critical to an understanding of integrated human biology and is increasingly recognized as a core underpinning discipline by medical and public health professionals. Advances in the fields of genomics, epigenetics, developmental biology and epidemiology have led to thegrowing realization that incorporating evolutionary thinking is essential for medicine to achieve its full potential. This is the first integrated and comprehensive textbook to explain the principles of evolutionary biology from a medical perspective and to focus on how medicine and public healthmight utilize evolutionary biology. It is written in a style which is accessible to a broad range of readers, whether or not they have had formal exposure to evolutionary science.Principles of Evolutionary Medicine is divided into three the first provides a systematic approach to the principles of evolutionary biology as they apply to human health and disease, using examples specifically relevant to medicine. It incorporates chapters on evolutionary processes,molecular evolution, the evolution of humans, life history theory, and evolutionary-developmental biology. The second part illustrates the application of these principles to our understanding of nutrition and metabolism, reproduction, combatting infectious disease and stress, and human behaviour.The final section provides a general framework to show in practical terms how the principles of evolutionary medicine can be applied in medical practice and public health.This novel textbook provides the necessary toolkit for doctors and other health professionals, medical students and biomedical scientists, as well as anthropologists interested in human health, to gain a better understanding of the evolutionary processes underlying human health and disease.",
  "genres": [
    "Medicine",
    "Science",
    "Health",
    "Evolution",
    "Nonfiction",
    "Textbooks",
    "Medical"
  ],
  "author": "Peter Gluckman",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/5921590-principles-of-evolutionary-medicine"
}