{
  "title": "These Impossible Things",
  "description": "A razor‑sharp debut novel of three best friends navigating love, sex, faith, and the one night that changes it all. It’s always been Malak, Kees, and Jenna against the world. Since childhood, under the watchful eyes of their parents, aunties and uncles, they’ve learned to live their own lives alongside the expectations of being good Muslim women. Staying over at a boyfriend's place is disguised as a best friend’s sleepover, and tiredness can be blamed on studying instead of partying. They know they’re existing in a perfect moment. With growing older and the stakes of love and life growing higher, the delicate balancing act between rebellion and religion is becoming increasingly difficult to navigate. Malak wants the dream: for her partner, community, and faith to coexist happily, and she wants this so much she's willing to break her own heart to get it. Kees is in love with Harry, a white Catholic man who her parents can never know about. When he proposes, she must decide between her future happiness and the life she knows and family she loves. Jenna is the life of the party, always ready for new pleasures, even though she’s plagued by a loneliness she can’t shake. Through it all, they have always had each other. But as their college years come to a close, one night changes everything when harsh truths are revealed. As their lives begin to take different paths, Malak, Kees, and Jenna—now on the precipice of true adulthood—must find a way back to each other as they reconcile faith, family, and tradition with their own needs and desires. These Impossible Things is a paean to youth and female friendship—and to all the joy and messiness love holds. A Marie Claire Book Club Pick for June 2022 and a Most Anticipated Book by: Bustle, theSkimm, Fortune, Apartment Therapy, and BookRiot",
  "genres": [
    "Fiction",
    "Contemporary",
    "Romance",
    "Book Club",
    "Audiobook",
    "Literary Fiction",
    "Adult"
  ],
  "author": "Salma El-Wardany",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/59228196-these-impossible-things"
}