{
  "title": "The Wedge of Truth",
  "description": "A 2001 ECPA Gold Medallion Award winner! A 2001 Christianity Today Award of Merit winner! Science is the supreme authority in our culture. If there is a dispute, science arbitrates it. If a law is to be passed, science must ratify it. If truth is to be taught, science must approve it. And when science is ignored, stroms of protest are heard in the media, in the university--even in local coffee shops. Yet a society ruled by science (and the naturalistic philosophy that undergirds much of it) faces major problems. Science speaks so authoritatively in our culture that many are tempted to use its clout to back claims that go beyond the available evidence. How can we spot when such ideological slight of hand has taken place? More important, while we may learn a great deal from science, it does not offer us unlimited knowledge. In fact, most scientists readily acknowledge that science cannot provide answers to questions of ultimate purpose or meaning. So to what authority will we turn for these? The deficiencies in science and the philosophy (naturalism) that undergirds it call for a cognitive revolution--a fundamental change in our thinking habits. And it all begins with a wedge of truth. This wedge of truth does not \"wedge out\" a necessary foundation of rational thought. But it does \"wedge in\" the much-needed acknowledgment that reason encompasses more than mere scientific investigation. Phillip E. Johnson argues compellingly for an understanding of reason that brings scientific certainty back into relational balance with philosophical inquiry and religious faith. Applying his wedge of truth, Johnson analyzes the latest debates between science and religion played out in our media, our universities and society-at-large. He looks to thinkers such as Newbigin, Polanyi and Pascal to lay a foundation for our seeing the universe in a totally different way. And from that base he then considers the educational programs and research agendas that should be undertaken--and have already begun in some earnest--during this new century. In the end, Johnson prophetically concludes that the walls of naturalism will fall and that the Christian gospel must play a vital role in building a new foundation fro thinking--not just about science and religion but about everyhting that gives human life hopeand meaning.",
  "genres": [
    "Philosophy",
    "Science",
    "Nonfiction",
    "Evolution",
    "Christianity",
    "Theology",
    "Christian"
  ],
  "author": "Phillip E. Johnson",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/592305.The_Wedge_of_Truth"
}