{
  "title": "Didn't Nobody Give a Shit What Happened to Carlotta",
  "description": "In this “dangerously hilarious” novel ( Los Angeles Time s), a trans woman reenters life on the outside after more than twenty years in a men’s prison, over one consequential Fourth of July weekend—from the author of the PEN/Faulkner Award winner Delicious Foods .Carlotta Mercedes has been misunderstood her entire life. When she was pulled into a robbery gone wrong, she still went by the name she’d grown up with in Fort Greene, Brooklyn—before it gentrified. But not long after her conviction, she took the name Carlotta and began to live as a woman, an embrace of selfhood that prison authorities rejected, keeping Carlotta trapped in an all-male cell block, abused by both inmates and guards, and often placed in solitary.In her fifth appearance before the parole board, Carlotta is at last granted conditional freedom and returns to a much-changed New York City. Over a whirlwind Fourth of July weekend, she struggles to reconcile with the son she left behind, to reunite with a family reluctant to accept her true identity, and to avoid any minor parole infraction that might get her consigned back to lockup.Written with the same astonishing verve of  Delicious Foods , which dazzled critics and readers alike, Didn’t Nobody Give a Shit What Happened to Carlotta  sweeps the reader through seemingly every street of Brooklyn, much as Joyce’s Ulysses does through Dublin. The novel sings with brio and ambition, delivering a fantastically entertaining read and a cast of unforgettable characters even as it challenges us to confront the glaring injustices of a prison system that continues to punish people long after their time has been served.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Contemporary",
    "Audiobook",
    "Literary Fiction",
    "Transgender"
  ],
  "author": "James Hannaham",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/59227943-didn-t-nobody-give-a-shit-what-happened-to-carlotta"
}