{
  "title": "Pillsbury: Best of the Bake-off Cookbook: 350 Recipes from Ameria's Favorite Cooking Contest",
  "description": "The Pillsbury Bake-Off® Contests began the tradition of bringing great dishes to the American table.  Nearly fifty years, thirty-seven contests, and thousands of recipes later, the Bake-Off® Contest has grown to become the most beloved and anticipated cooking contest in the world.   PILLSBURY: BEST OF THE BAKE-OFF® COOKBOOK: 350 Recipes from America's Favorite Cooking Contest celebrates this amazing competition and the thousands of contestants who have participated in it over the years.PILLSBURY: BEST OF THE BAKE-OFF® COOKBOOK shares all of the ingredients that go into the contest itself: prize-winning recipes, exciting culinary talent, and inspirational stories from the contestants themselves. These components, combined with more than 120 full-color photographs, 100 sidebars featuring helpful cooking tips, anecdotes about the contest, and ten profiles of previous contest winners including this year's million dollar winner, Kurt Wait make the book a true reflection of the Bake-Off® Contest.With nine chapters ranging from Soups, Salads and Sandwiches to Coffee Cakes, Cookies and Bars, PILLSBURY: BEST OF THE BAKE-OFF® COOKBOOK includes 350 of the grand-prize recipes (chosen from more than 3,500) from each of the thirty-seven contests -- the most comprehensive collection of prize-winning recipes ever published.  \"The special thing about the Bake-Off® recipes is that they are a reflection of how Americans are living and eating,\" says Pillsbury.  \"These are not recipes created by a master chef, or the thoughts of a single company, but are the accumulated wisdom and experience of thousands of cooks who live real lives.\"The \"best of the best\" recipes, gathered from cooks around the country, reveal a true sense of Americana.  \"The Bake-Off® Contest is an American institution.  It is an achievement of national stature, accomplished by real, average Americans who have won in an absolutely upright, thorough, and principled contest,\" says Pillsbury.  The million dollar recipe from the 1996 Bake-Off® Contest, Macadamia Fudge Torte, is included as well as hundreds of other mouthwatering winning recipes, savory and sweet, that range from Cookie Dough Brownies and Choco-Nut Sweet Treats to Savory Mashed Potato Pie and Southwest Tortellini Chowder.The cooking contest's splendid history is almost as appealing as the recipes themselves. From learning the rules, understanding the judging process, and making long-lasting friendships to entering the hall to \"When the Saints Go Marching In,\" and, finally, awaiting the announcement of the winner, we learn everything there is to know about this cooking contest, and we share with the contestants their emotions and the fond memories they have of being a prize winner at the Pillsbury Bake-Off® Contest.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food"
  ],
  "author": "Pillsbury",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/1281629.Pillsbury"
}