{
  "title": "Uśmiech Pol Pota. O pewnej szwedzkiej podróży przez Kambodżę Czerwonych Khmerów",
  "description": "W 1975 roku, po pięciu latach bezmyślnych rządów wojskowej kliki generała Lon Nola, władzę w Kambodży zdobywają Czerwoni Khmerzy. Mają ogromne poparcie ludu i lewicujących środowisk europejskich. Zniszczony amerykańskimi nalotami i wojną domową kraj przedzierzga się w Demokratyczną Kampuczę, w której hasła chłopskiej rewolucji mają zbudować nową, lepszą przyszłość. Peter Fröberg Idling zabiera czytelników w przerażającą i fascynującą podróż do serca tego kraju. Niczym detektyw śledzi sprzeczne doniesienia, ze strzępów informacji buduje prawdziwy obraz życia w obłąkańczej utopii i odsłania tajemnice jednej z najkrwawszych dyktatur XX wieku.Odkrywa też niechlubną kartę z przeszłości. Szwedzcy entuzjaści rewolucji Pol Pota, głusi na relacje uchodźców, niezachwianie wierzyli, że czerwony terror to tylko konieczny etap na słusznej drodze do wyzwolenia. Fröberg Idling pyta, w jaki sposób udało się Khmerom zamydlić oczy szwedzkiej delegacji, która w 1978 roku odwiedziła Kampuczę. Dlaczego w sprawozdaniach, na zdjęciach i w filmie nie widać zagłodzonych i zastraszonych ludzi, o których mówili uciekinierzy?Pragnie również zrozumieć, co sprawiło, że Saloth Sar, wykształcony w Paryżu młody fan piłki nożnej i francuskiej poezji romantycznej, stał się Pol Potem, krwawym tyranem, pod którego rządami zginęła prawie jedna czwarta ludności całego kraju. Odpowiedzi szuka zarówno w dokumentach, jak i w rozmowach ze świadkami terroru Czerwonych Khmerów. Z relacji tych buduje literacki reportaż przejmujący do szpiku kości.\"To prawdopodobnie jedna z najlepszych dokumentalnych książek tego roku. (…) Materiałów na temat Kambodży i rządów Pol Pota opublikowano wiele, ale Peter Fröberg Idling przedstawia tę dramatyczną historię w całkiem nowy sposób. I choć temat jest przerażający, to naszkicowany przez Idlinga portret kraju i ludzi jest przede wszystkim poetycki. Kojarzy się ze stylem Svena Lindqvista, szwedzkiego mistrza podróżniczego reportażu, lub jego duńskiego odpowiednika, Carstena Jensena. (…) A ponieważ świat jest zły, zróbmy dobry uczynek: pomóżmy tej książce wypchnąć z listy bestsellerów wszystkich bohaterów wojennych, uzdrowicieli i nawiedzonych dietetyków\".\"Dagbladet\"\"To powieść dokumentalna najwyższej klasy, sięgająca po najlepsze techniki literackie. Otrzymujemy świeże, wnikliwe spojrzenie połączone z zapierającym dech w piersiach doświadczeniem czytelniczym\".\"Potemkinreisen\"\"Uśmiech Pol Pota to subtelna i mimo swej tematyki niemal piękna książka, stawiająca niezwykle ważne pytanie: Jak chronić się przed politycznymi marzycielami i fanatykami, tak by nie zniszczyć jednocześnie możliwości stworzenia lepszego świata? Żyjemy w czasach, w których nie wszystkim idealistom udaje się odróżnić totalitaryzm od ruchów demokratycznych. Uśmiech Pol Pota to książka, która zwraca się do jednych i do drugich\".\"Dagens Næringsliv\"\"Idling stworzył przenikliwą i dramatyczną opowieść o tym, jak zagłodzono i wymordowano 1,7 miliona ludzi, nie pokazując międzynarodowej opinii publicznej nawet jednego ciała. Długo i uważnie przyglądał się uśmiechowi Pol Pota, który – gdy się mu przypatrzeć – okazuje się grymasem drwiny\".\"Bergensavisen\"\"Uśmiech Pol Pota to nie tylko świetny reportaż, ale także bardzo dobra powieść. Być może nie wypada polecać jej jako wciągającej narracji, ale temu, kto da się ponieść samemu tekstowi, trudno będzie zapomnieć o dramatycznym kontekście historycznym i pozostać wobec niego obojętnym\".\"Studvest\"\"Tę bezstronną, wnikliwą książkę po prostu trzeba przeczytać. Idling, który przez kilka lat mieszkał w Kambodży, z niezwykłym wyczuciem, subiektywnie, a jednak bez uprawiania polityki, pokazuje, jak rażąca niekompetencja i niedające się opisać zło mogą na wiele lat zniszczyć cały kraj\".",
  "genres": [
    "Nonfiction",
    "History",
    "Asia",
    "Politics",
    "Journalism",
    "Swedish Literature",
    "Historical"
  ],
  "author": "Peter Fröberg Idling",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/10299693-u-miech-pol-pota-o-pewnej-szwedzkiej-podr-y-przez-kambod-czerwonych"
}