{
  "title": "Letters From 1969",
  "description": "A time travel romance with a Christian bent.\"Just know... it is the best ending to a book I have ever read and you will think so too.\"“OUTSTANDING”!!!!!!!!! Best Time travel romance I’ve read in years\"\"A beautiful story which has been perfectly written. Needed a box of tissues for this one.\"Right person. Wrong Time.An Army officer visits a mysterious antique shop and is given a hope chest containing love letters written more than fifty years prior by a nurse in Vietnam.Mike Falco is a young Army lieutenant and 1960s aficionado. When Mike visits the new antique shop in town, the eccentric proprietors insist that he’s the rightful owner of an old dust-covered hope chest.Reluctantly, he accepts the piece, despite the caveat that, “Once you touch what’s inside this chest, it will touch you back.\" He quickly discovers that the sole contents are love letters written in 1969 by a twenty-two-year-old Army nurse serving in Vietnam.As Mike reads the letters, he finds himself deeply moved by them. And by the young woman who’d penned them more than a half-century before. He sets out on a quest to track her down, hoping she’s still alive so he can return them. But what he discovers when he finally unlocks the Secret of the Letters From 1969 propels him on an odyssey that spans not only continents, but across Time itself. It’s a journey fraught with risk and danger. But Mike’s willing to go as far as necessary for love, even if that means finding his future in the past.So, put on your bell-bottoms, tie-dye, and love beads because Letters From 1969 will take you back to the Age of Aquarius, to the music, the culture, and the events that embodied that tumultuous time. And to all the joy—and heartache—that shaped both a nation and a generation.",
  "genres": [
    "Time Travel",
    "Romance"
  ],
  "author": "Arthur Archambeau",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/59223842-letters-from-1969"
}