{
  "title": "Pounce de Leon",
  "description": "\"Pounce found Mrs. Florida Brown on a bad, bad night on the rainy side of town . . . \" Pounce de Leon, a mischievous, loving cat, adopts Mrs. Florida Brown as his constant companion. Pounce's job is to look after the aging Mrs. Brown. If her knuckles ache, he lets her pat him for a good long time. When her tummy acts up, he sits on her until she feels better. And if she's lonely at night, he lets her curl up right there beside him. Most of all, Pounce is fascinated by the view from the jumbled house into the jungle-like garden filled with overgrown plants and trees. When Mrs. Brown speaks of a mysterious, beautiful girl and a lost fountain of youth, Pounce sets out on a quest to find it for his loving owner. In this delightfully whimsical story, the award-winning Tim Wynne-Jones, author of the classic \"Zoom\" series, takes us on a cat's journey of discovery and adventure. Mexican painter Alfredo Tapia's art beautifully conveys the lush world of the garden where Pounce de Leon might just find the means to rejuvenate Mrs. Florida Brown and rekindle her zest for life. Tim Wynne-Jones was born in England, grew up in British Columbia and Ontario, and studied at the University of Waterloo and York University. His writing career began when he won the $50,000 Seal First Novel Award for \"Odd's End.\" Since then he has written dozens of books, numerous radio dramas, a children's musical, an opera libretto, short stories and songs for television's \"Fraggle Rock.\" He has received the Governor General's Award, the Horn Book Award, The Vicky Metcalf Award and the Canadian Library Association Book of the Year Award, among others. Tim and wife, Amanda Lewis, reside outside Perth, Ontario. Alfredo Tapia is a leading talent among a group of artists from Guerrero, Mexico, whose work is distinguished by its realistic and detailed portrayal of the beautiful people, land and sea of the coastal fishing town of Zihuatanejo. He worked amidst the flourishing art community of Guadalajara before returning to Zihuatanejo to open his studio to share his vision with young artists at his popular art classes. His works are displayed at El Museo Arqueologio de la Costa Grande and the prestigious Galeria Galart.",
  "genres": [],
  "author": "Tim Wynne-Jones",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/5922939-pounce-de-leon"
}