{
  "title": "Through Illusions and Deceit",
  "description": "Through Illusions and Deceit is the much-anticipated continuation of the A Court of Gilt and Shadow Series by bestselling authors Stacy Jones and Harper Wylde.Danger. Illusions. Deceit.Fairy tales and monsters exist... and Arawyn is one of them.After years of trying to control the strange power living inside her, Arawyn knows she's different. She just couldn't have guessed how different. She's the lost Fae Heir, the rightful Queen of Faery, and the first to ever hold the power of both the Light and Night Courts.But uncovering the secrets of her past leaves her with more questions than answers.How did she end up in the mortal realm? If she's so powerful, why can't she control the wild magic churning inside her? And why does that magic respond so intensely to the three enigmatic men who've vowed to protect her?A devilish Fae Prince, a psychotic assassin, and a monstrous warrior.Learning her identity changes everything between them. The suspicion in Rathe's eyes is turning into possession. Viper treats her like a leper, yet stares at her with a hunger that borders on madness. And Fear looks at her with a certainty that scares her more than any mercenary ever could.As the threats surrounding her grow more deadly, and the men she's come to care for are caught in the crosshairs alongside her, time is running out for Arawyn to learn to harness her power.But the last time she tapped into it ended in disaster.What if this time it isn't just Rathe, Viper, and Fear's blood on her hands... but their deaths?From bestselling authors, Stacy Jones and Harper Wylde, comes the second book in the darkly seductive new series, A Court of Gilt and Shadow, blending romance, danger, and the supernatural into an unforgettable read.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Fae",
    "Romance",
    "Paranormal Romance",
    "Paranormal",
    "Magic"
  ],
  "author": "Stacy  Jones",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/59250089-through-illusions-and-deceit"
}