{
  "title": "Jasmine in Autumn: A Tale of Snow White",
  "description": "As the only daughter of Moorestowe’s wealthiest merchant, Celia Darrington has lived a life of luxury and loneliness. Shortly after her father’s death, Celia is attacked and barely escapes the port city, having no idea why someone would want to take her life. When night falls, she stumbles upon a grange and takes shelter in an old storage shed, only to awaken hours later to a group of men standing over her. Frightened at first, Celia soon realizes that no one at the grange intends to harm her. On the contrary, after noticing the bruises on her neck, the owner offers her a job in exchange for sanctuary.Jack Hardy never wanted to run a perfumery, but after years of bad luck and circumstances out of his control, he now spends his days at Chicory Harrow, working the fields and trying not to think about the grange’s dwindling profits. Despite his desire to help his father, Jack can’t help but feel trapped—crushed by the pressure to create scents that will entice their customers and earn the money needed to restore the perfumery to its former glory. When his father gives shelter to a desperate woman, Jack is reluctant to welcome her. He soon begins to realize, however, that behind all her hard work and her pretty face, Celia has a mind for business as well as a knowledge of high-society ladies and their preferences. She just may be the key to bringing the perfumery back to life.As the jasmine harvest approaches and her feelings for him grow, Celia entrusts Jack with the secret of her identity and the reason she fled Moorestowe. Battling demons from his own past, Jack is determined to help Celia while keeping her at a distance. He isn’t eager to risk the pain that comes with love. Little does he know that Celia is everything he needs to heal his broken heart.",
  "genres": [
    "Historical",
    "Historical Romance",
    "Fantasy",
    "Romance",
    "Fairy Tales",
    "Amazon"
  ],
  "author": "Penelope Daniels",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/59247033-jasmine-in-autumn"
}