{
  "title": "Discovered",
  "description": "Five broken alphas. One lost wolf. A fate she never expected.My life had been irreversibly changed by coming to Silver Falls University. Although I don’t truly realize just how much until we visit the Whitepaw pack. I wish I could say that the most upsetting part was reuniting with a pack that had no problem expressing their dislike of me. No, instead I find myself remembering something about my past that I’d completely forgotten.That realization comes with the knowledge that my mates and I are in so much more danger than ever before. Especially now that Dr. Haistain has taken drastic action to force our hand on creating a mating bond by shaming my mates…At least that was what we assumed when he invited all of their families to campus.Instead, he suggests something so drastic it brings someone completely unexpected into our lives.What they tell me, what I discover about my past . . . changes everything. - - - - -Join Effie Harlow on the third part of her journey at Silver Falls University. This slow-burn reverse harem paranormal romance features five protective and possessive shifter mates that are bound and determined to keep Effie by their side, no matter what. To prove to her that she is so much more than anyone has ever tried to tell her she was. Will they be able to convince her of her place at Silver Falls and in their life? Or will Effie get lost in the university crowds like she did back home?Find out in this third installment (of five) in M. Sinclair's series, Silver Falls University.Warning: This PNR university-style RH will contain swearing, adult sexual content +18, elements of PTSD and mention of prior emotional, sexual, and physical abuse, violence, and additional darker themes. Minor cliff-hanger warning.Read the Silver Falls Universityseries in proper order:Book #1: Lost (also, book #2 in Kingdom of Wolves collection)Book #2: ForgottenBook #3: DiscoveredBook #4: PursuedBook #5: Found",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Shapeshifters",
    "Fantasy",
    "Romance",
    "Paranormal Romance",
    "College"
  ],
  "author": "M. Sinclair",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/59253869-discovered"
}