{
  "title": "A Little Harmless Submission",
  "description": "For a tough as nails Dom hunting a sadistic serial killer is nothing compared to losing his heart.Rome Carino is hunting a predator. One who likes to hurt submissives and the most popular BDSM club’s patrons are being targeted. With each fresh kill, he gets more brazen. Rome knows he just needs one little break, but before he can make headway, the FBI shows up. Worse, the uptight, buttoned-down Special Agent Maria Callahan suggests a plan that is dangerous, but worth it because it might just catch the killer. If Rome can keep his mind on the case and off the beautiful FBI agent, he'll be just fine.Maria is still trying to step out of her legendary father's shadow and knows just how to do it. Luring the killer by posing as Rome's new sub seems like a good idea. That is, until undercover becomes real life and she finds herself tangled up with a man who amazes and scares her at the same time. Her growing attraction to the Honolulu Police Detective is a little too much to handle. Even knowing that, she can't help falling in love with the tough Dom and losing herself in the games they play in the bedroom. Rome is overwhelmed by his need for Maria. He has never had a sub respond to him the way she does and no matter what he does, he feels himself slipping off that cliff into love. As their relationship starts to unfold, he realizes that he will do anything to win her heart, to convince her to become his sub for a lifetime. But before he can do anything, the killer turns his attention on Rome and the one thing he holds dear: Maria.WARNING: The following book contains: A Dom who thinks he can do no wrong, a new sub who is about to teach him he can, palm trees, a trip or two to Rough ‘n Ready, a flirty Aussie Dom with questionable motives, old friends, and a new enemy. Yeah, it might be called Harmless, but you Addicts know it’s anything but.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Suspense",
    "Erotic Romance",
    "Romantic Suspense"
  ],
  "author": "Melissa Schroeder",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/12818440-a-little-harmless-submission"
}