{
  "title": "Sister Mother Warrior",
  "description": "Acclaimed author of Island Queen Vanessa Riley brings readers a vivid, sweeping novel of the Haitian Revolution based on the true-life stories of two extraordinary women: the first Empress of Haiti, Marie-Claire Bonheur, and Gran Toya, a West African-born warrior who helped lead the rebellion that drove out the French and freed the enslaved people of Haiti. Gran Toya: Born in West Africa, Abdaraya Toya was one of the legendary minos--women called \"Dahomeyan Amazons\" by the Europeans--who were specially chosen female warriors consecrated to the King of Dahomey. Betrayed by an enemy, kidnapped, and sold into slavery, Toya wound up in the French colony of Saint Domingue, where she became a force to be reckoned with on its sugar plantations: a healer and an authority figure among the enslaved. Among the motherless children she helped raise was a man who would become the revolutionary Jean-Jacques Dessalines. When the enslaved people rose up, Toya, ever the warrior, was at the forefront of the rebellion that changed the course of history.Marie-Claire: A free woman of color, Marie-Claire Bonheur was raised in an air of privilege and security because of her wealthy white grandfather. With a passion for charitable work, she grew up looking for ways to help those oppressed by a society steeped in racial and economic injustices. Falling in love with Jean-Jacques Dessalines, an enslaved man, was never the plan, yet their paths continued to cross and intertwine, and despite a marriage of convenience to a Frenchman, she and Dessalines had several children.When war breaks out on Saint Domingue, pitting the French, Spanish, and enslaved people against one another in turn, Marie-Claire and Toya finally meet, and despite their deep differences, they both play pivotal roles in the revolution that will eventually lead to full independence for Haiti and its people.Both an emotionally palpable love story and a detail-rich historical novel, Sister Mother Warrior tells the often-overlooked history of the most successful Black uprising in history. Riley celebrates the tremendous courage and resilience of the revolutionaries, and the formidable strength and intelligence of Toya, Marie-Claire, and the countless other women who fought for freedom.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Adult",
    "Race",
    "Feminism",
    "19th Century"
  ],
  "author": "Vanessa Riley",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/59314696-sister-mother-warrior"
}