{
  "title": "The Unhallowed Horseman",
  "description": "In a town enamored with its Unhallowed Horseman legend, a distraught teenage boy must come to terms with his personal demons, and perhaps the Horseman himself. Set on All Hallows’ Eve, psychological thriller The Unhallowed Horseman takes place against the backdrop of a seemingly peaceful, picturesque American small town with an iconic past. The story follows Vincent, a distraught and troubled high schooler, and his descent into the demons that plague his mind. Some things about the town and its inhabitants aren’t quite as they seem. Generations of families have been living there with a deep and dark secret, one on the verge of reincarnating itself once again. With the help of his newfound love for classmate Lorraine, Vincent navigates the treacherous obstacles in his life. Whether it be the overbearing no-holds-barred sheriff, his tempestuous mother, or the holier-than-thou townsfolk, Vincent seems to be under constant bombardment from prying eyes. What's more, Lorraine's overprotective father, Deputy Constance, suspects Vincent of having committed some heinous crimes. Only after uncovering the town's history does Vincent begin to unravel its complex mystery and that of the people living there, including his own ancestors. Can he solve the mystery in time to save the people he truly loves, or will he, like others before him, fall prey to an age-old curse passed down through the centuries. The town prepares for the return of a killer legend, while one young man prepares to take on his innermost demons. The Unhallowed Horseman is a contemporary reimagining based on characters in the American classic \"The Legend of Sleepy Hollow\" by Washington Irving, the Father of American Literature.Content Warning: adult and derogatory language, gore, substance abuse (drugs and alcohol), uncomfortable sexual situations (one is non-consensual assault), death, child abuse, mention of pedophilic tendencies, mention of suicide",
  "genres": [
    "Horror"
  ],
  "author": "Jude S. Walko",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/59316303-the-unhallowed-horseman"
}