{
  "title": "Truth: A Guide",
  "description": "The author of the highly popular book Think , which Time magazine hailed as \"the one book every smart person should read to understand, and even enjoy, the key questions of philosophy,\" Simon Blackburn is that rara avis --an eminent thinker who is able to explain philosophy to the general reader. Now Blackburn offers a tour de force exploration of what he calls \"the most exciting and engaging issue in the whole of philosophy\"--the age-old war over truth.The front lines of this war are well defined. On one side are those who believe in plain, unvarnished facts, rock-solid truths that can be found through reason and objectivity--that science leads to truth, for instance. Their opponents mock this idea. They see the dark forces of language, culture, power, gender, class, ideology and desire--all subverting our perceptions of the world, and clouding our judgement with false notions of absolute truth. Beginning with an early skirmish in the war--when Socrates confronted the sophists in ancient Athens--Blackburn offers a penetrating look at the longstanding battle these two groups have waged, examining the philosophical battles fought by Plato, Protagoras, William James, David Hume, Hans-Georg Gadamer, Jacques Derrida, Michel Foucault, Richard Rorty, and many others, with a particularly fascinating look at Nietzsche. Among the questions Blackburn considers is science mere opinion, can historians understand another historical period,and indeed can one culture ever truly understand another.Blackburn concludes that both sides have merit, and that neither has exclusive ownership of truth. What is important is that, whichever side we embrace, we should know where we stand and what is to be said for our opponents.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Metaphysics",
    "British Literature",
    "Academic",
    "20th Century",
    "Logic"
  ],
  "author": "Simon Blackburn",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/593067.Truth"
}