{
  "title": "Tales of a Mermaid Gone Over The Deep End",
  "description": "Advance praise (payback) for Teresa \"Well, this is a little embarrassing. I didn't actually read the WHOLE book, but it's probably pretty good. I'm not sure what she said about me, but you should know—SHE shot me in the back on my 19th birthday!\"– Ronny Fischtner (author's son)\"I love my mom and I love MOST of this book. It should be noted that my bowling has improved, I've given up hockey, accounting is for nerds, pancakes is food for super heroes and no one needs to count how many boyfriends I've had.\"– Malyn Fischtner (author's daughter)\"I'm pleased to be the source of so much humour for my wife. I just wish she didn't feel the need to publish it.\"– Ron Fischtner (author's husband)\"It was the last class of the evening that I was teaching, and we were doing our stretches, and at the surface of the water I noticed a single floating nipple happily bobbing away on its own. Unsure if its owner was still in the water, I quietly asked the nearest lady, \"Excuse me, could you just pass me that nipple over your right shoulder?\"There I held a lovely C-cup breast that went rogue. I made posters for the lost breast (seriously, I made missing boob posters). No one claimed her. I introduced her to all the instructors, but no one recognized her (honestly, they all look the same after a few years at the pool). No one ever claimed Betty (yes, we gave her a name). Betty stayed on the teachers' table in our special little box for a long time. Eventually, like all good boobs, she wrinkled up, lost her bounce, and sagged lower and lower in the box until we all forgot how much fun she was when we first found her.\"This is a feel-good book of true short stories about me, my family, friends, and my aquafit business, Over the Deep End. We all have stories to share, and the true ones are always the best. I'm sharing some of my most vulnerable moments, some of my greatest moments, and some of my saddest. Hopefully, in one story or another, you find something way better than me—you might find you. We all have a story and a different way to tell it. I hope telling my stories helps you tell some of your own.",
  "genres": [],
  "author": "Teresa Fischtner",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/59333636-tales-of-a-mermaid-gone-over-the-deep-end"
}