{
  "title": "Teacher's Pet: The Complete Series",
  "description": "They’re off-limits… but impossible to resist.\n\n\nThese short and steamy instalove stories are packed with heat and forbidden longing. Are you ready? Class is in session…\n\nThe Teacher’s Pet box set includes:\n\n\nLove Lessons\n\nOne year ago, I saw her in my class.One year ago, the ground opened up beneath me.Avery Jennings. She’s my student. My secret longing. My kryptonite.After I taught her for one semester, I was clear: she needs to stay away. My restraint is wearing thin.But the first day of class in her second year, who do I find in my lecture hall?Avery is sweet. Determined. She looks at me with hearts in her eyes.And I’m a monster. A wicked man.Because with her… I can’t resist.\nBallet Master\n\nHe’s a legendary dancer. A man of unmatched skill.And he won’t stop staring at me.It’s a huge opportunity when the famous dancer visits our class. I know that we’re lucky, but it sure doesn’t feel like that when I keep tripping and missing the music.I’m just so nervous. A jittery wreck. And every second his eyes stay on me makes it worse.He doesn’t bother watching the rest of the dancers.Only me.Am I really messing up that badly? Or does the older man with the dark eyes want something else from me…Something wicked.\nLife Model\n\nIt’s terrifying enough modeling for an art class in the city.Then my professor walks in.I’ve wanted my art professor since the day I met him. He’s so calm, so assured, so stern.But he’s only ever been distant. Polite and professional. That all changes the minute I drop my white robe.We shouldn’t be here. He shouldn’t see me like this.But I don’t turn back.And neither does he.\nThe Dean\n\nYou know what’s worse than crushing on your boss?When he’s also your dad’s best friend.I moved across the country to get a fresh start. To see what I can make of myself away from my overbearing parents.It was only supposed to be temporary--staying in Dean Gibson’s spare room. I’d get a job, get my own place, and start my shiny new life.But the Dean is so addicting. His calm presence makes my heart pound. And even though he’s determined to keep his distance, he can’t seem to let me go either.Between his house and his office, we’re barely apart.And he’s cracking under the tension...",
  "genres": [
    "Romance"
  ],
  "author": "Cassie Mint",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/59341590-teacher-s-pet"
}