{
  "title": "Umbra's Return",
  "description": "Nova CarmichaelEver since my father’s murder, the Carmichael and Birchwood Families have been bitter enemies living under the shadow of what Umbra did to us all. Every time I see him, it's like all those feelings return at once.In a world where superheroes are integrated into society and trained to be the ultimate weapons, SUPE Universities are the final stop before joining the SUPE Force. While most of the future generation of heroes are upstanding citizens, doing their part in contributing to society, I’m getting kicked out of school for setting things on fire.This is my final chance, so the last thing I should do is waste time on things like friends and love. Especially when it's a Birchwood that’s appealing in both categories. My mother always told me to beware the Birchwood family. They can’t be trusted, and they won’t protect anyone but their own. But as a dangerous threat puts one of us at risk, the person who’s supposed to be my sworn enemy becomes someone I'm terrified to lose.________________________________________________________________________________________________Umbra's Return is an M/M, enemies-to-lovers, romance with a Genderfluid AMAB main character and an angry, possessive and protective ex-bestfriend who hates him. Their attraction rages hotter than a supernova, yet when chaos erupts, they might be the only people each of them can trust.__________________________________________________________________________________________________***There is some content which can be triggering for some folks, particularly the trans community, stemming from a cis character with little to no understand or respect for a persons gender identity and pronouns. Though this topic and event in the pages of the story is handled with grace, courage and support, the author felt it important to warn folks ahead. As a whole, this story is meant as a representation of and not the be all and end all when it comes to trans and non binary gender identities, feelings of dysphoria, etc. every gender identity and journey is personal. Always ask your trans and/or enby friends for clarification of their pronouns.",
  "genres": [
    "Paranormal",
    "LGBT",
    "Fantasy"
  ],
  "author": "Jamie Luther",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/59343939-umbra-s-return"
}