{
  "title": "Stewards of Humanity: Lighting the Darkness in Humanitarian Crisis",
  "description": "When the world turns away from the horrors of war, genocide, famine, and natural disasters, the stewards of humanity run toward the suffering. They stand as a thin line between life and death for thousands of people who will never know their stories. These stewards are neither heroes nor saints-they are ordinary people with ordinary struggles who rise to extraordinary challenges. They are beacons of light in the darkness of humanitarian crisis. With an unflinching view into some of the worst humanitarian crises of our lifetime, author Robert Macpherson-US Marine combat veteran turned aid worker-tells the stories of the men and women who have courageously confronted evil and injustice from Somalia to Bosnia, Rwanda, Iraq and Afghanistan. Throughout his narrative, Robert challenges us to consider our place in humanity and our own role as stewards. \"I look for light, and on occasion, find it, but too often it is clouded by the skulls of Murambi. I am reminded by those I've met that all is not lost. Even in the fog of wicked brutality, humans emanate brilliant and cosmic bursts of decency, caring, and kindness. I know this because I continue to meet the women and men who are the keepers of this light.\" -From Stewards of Humanity Robert Macpherson has been a writer, aid worker, and career infantry officer in the U.S. Marines with service in Vietnam, Iraq, and Somalia. After retiring as a Colonel, he enjoyed a second career with the humanitarian organization CARE, where he directed global risk mitigation for staff and vulnerable populations and led humanitarian response missions worldwide. These efforts often required engaging with foreign governments and the United Nations, but as frequently with non-traditional actors such as the Taliban in Afghanistan, warlords in Sudan and Somalia, local militias, and kidnappers. Stewards of Humanity is his debut book. He lives in Charlotte, NC with his wife, Veronica and service dog, Blue. Those who've read Chasing Chaos by Jessica Alexander, Ghosts of the Tsunami by Richard Lloyd Perry, and Mountains Beyond Mountains by Tracy Kidder will savor the rich, complex narratives in Stewards of Humanity.",
  "genres": [],
  "author": "Robert Séamus Macpherson",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/59342960-stewards-of-humanity"
}