{
  "title": "Sirens & Muses",
  "description": "Four artists are drawn into a web of rivalry and desire at an elite art school and on the streets of New York in this “gripping, provocative, and supremely entertaining” (BuzzFeed) debut“Captures the ache-inducing quality of art and desire . . . a deeply relatable and profoundly enjoyable read, one drenched in prismatic color and light.”—Kristen Arnett, New York Times bestselling author of With TeethIt’s 2011: America is in a deep recession and Occupy Wall Street is escalating. But at the elite Wrynn College of Art, students paint and sculpt in a rarefied bubble. Louisa Arceneaux is a thoughtful, observant nineteen-year-old when she transfers to Wrynn as a scholarship student, but she soon finds herself adrift in an environment that prizes novelty over beauty. Complicating matters is Louisa’s unexpected attraction to her charismatic roommate, Karina Piontek, the preternaturally gifted but mercurial daughter of wealthy art collectors. Gradually, Louisa and Karina are drawn into an intense sensual and artistic relationship, one that forces them to confront their deepest desires and fears. But Karina also can’t shake her fascination with Preston Utley, a senior and anti-capitalist Internet provocateur, who is publicly feuding with visiting professor and political painter Robert Berger—a once-controversial figurehead seeking to regain relevance.  When Preston concocts an explosive hoax, the fates of all four artists are upended as each is unexpectedly thrust into the cutthroat New York art world. Now all must struggle to find new identities in art, in society, and among each other. In the process, they must find either their most authentic terms of life—of success, failure, and joy—or risk losing themselves altogether.  With a canny, critical eye, Sirens & Muses overturns notions of class, money, art, youth, and a generation’s fight to own their future.",
  "genres": [
    "Fiction",
    "Contemporary",
    "LGBT",
    "Queer",
    "Literary Fiction",
    "Dark Academia",
    "Lesbian"
  ],
  "author": "Antonia Angress",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/59336344-sirens-muses"
}