{
  "title": "When We Were Bright and Beautiful",
  "description": "The acclaimed, bestselling author of This Could Hurt returns with her biggest, boldest novel yet--an electrifying, twisty, and deeply emotional family drama, set on Manhattan's glittering Upper East Side, that explores the dark side of love, the limits of loyalty, and the high cost of truth.You can have everything, and still not have enough. Cassie Quinn may only be twenty-three, but she knows a few things. One: money can't buy happiness, but it's certainly better to have it. Two: family matters most. Three: her younger brother Billy is not a rapist.When Billy, a junior at Princeton, is arrested for assaulting his ex-girlfriend, Cassie races home to Manhattan to join forces with her big brother Nate and their parents, Lawrence and Eleanor. The Quinns scramble to hire the best legal minds money can buy, but Billy fits the all-too-familiar sex-offender profile--white, athletic, and privileged--that makes headlines and sways juries.Meanwhile, Cassie struggles to understand why Billy's ex Diana would go this far, even if the breakup was painful. And she knows how the end of first love can destroy someone: Her own years-long affair with a powerful, charismatic man left her shattered, and she's only recently regained her footing.As reporters converge outside their Upper East Side landmark building, the Quinns gird themselves for a media-saturated trial, and Cassie vows she'll do whatever it takes to save Billy. But what if that means exposing her own darkest secrets to the world?Lightning-paced and psychologically astute as it rockets toward an explosive ending, When We Were Bright and Beautiful is a dazzling novel that asks: who will pay the price when the truth is revealed?",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Contemporary",
    "Audiobook",
    "Mystery Thriller",
    "Book Club"
  ],
  "author": "Jillian Medoff",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/59362046-when-we-were-bright-and-beautiful"
}