{
  "title": "Cluck Buddies",
  "description": "A full length romantic comedy set in the world of Crown Creek!Since I started hooking up with with Wesley Maxwell, I have learned the following:He is good at making people comfortable.He is good at home repairs.He is really, really good with his tongue.And after seven years… that’s all I know.Except for one more thing....What a bad idea it would be to fall for him.Things between us are easy. Uncomplicated. I come home to Crown Creek once a month. I have brunch with my hot-mess mother and finicky grandmother. I nod and smile as they fret over why a competent, capable woman like me is still single.And then I go over to Wesley’s house and let him rock my world.He’s honest with me and I’m honest with him. He doesn’t want a relationship.And all I want is good sex.Things are fine just the way they are.The girls in my book club think I'm in love with him, but I’m not. He’s not the right guy for me. I need a grown up, and he has a pinball machine instead of a door, for heaven’s sake.I can’t be with someone like that.Not even when he rescues the world’s tiniest dog.Not even when he saves me from a total work disaster.Not even when he shows up at my door in the middle of the night… naked.We are not a couple. We are something else. And that something rhymes with duck-muddies.And damn his blue eyes, it's going to stay that way....Cluck Buddies is a silly, sexy spin-off set in the small town of CROWN CREEK. Expect a raunchy book club meeting interrupted by a confused rooster, lots of pun-based dirty talk, a sexy hero who only has eyes for the heroine (if she'd just look up and notice. Make that way up... he's really tall), and a tiny dog with a massive attitude. You can also expect cameos from some of your favorite Crown Creek characters as no one in this small town knows how to mind their own business... especially where love is concerned",
  "genres": [
    "Romance",
    "Contemporary",
    "Friends To Lovers"
  ],
  "author": "Theresa Leigh",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/59350281-cluck-buddies"
}