{
  "title": "Switchboard Soldiers",
  "description": "From New York Times bestselling author Jennifer Chiaverini, a bold, revelatory novel about one of the great untold stories of World War I--the women of the U.S. Army Signal Corps, who broke down gender barriers in the military and battled a pandemic as they helped lead the Allies to victory. \"An eye-opening and detailed novel about remarkable female soldiers. . . Chiaverini weaves the intersecting threads of these brave women's lives together, highlighting their deep sense of pride and duty.\"--Kirkus Reviews In June 1917, General John Pershing arrived in France to establish American forces in Europe. He immediately found himself unable to communicate with troops in the field. Pershing needed telephone operators who could swiftly and accurately connect multiple calls, speak fluent French and English, remain steady under fire, and be utterly discreet, since the calls often conveyed classified information.At the time, nearly all well-trained American telephone operators were women--but women were not permitted to enlist, or even to vote in most states. Nevertheless, the U.S. Army Signal Corps promptly began recruiting them.More than 7,600 women responded, including Grace Banker of New Jersey, a switchboard instructor with AT&T and an alumna of Barnard College; Marie Miossec, a Frenchwoman and aspiring opera singer; and Valerie DeSmedt, a twenty-year-old Pacific Telephone operator from Los Angeles, determined to strike a blow for her native Belgium.They were among the first women sworn into the U.S. Army under the Articles of War. The male soldiers they had replaced had needed one minute to connect each call. The switchboard soldiers could do it in ten seconds.Deployed throughout France, including near the front lines, the operators endured hardships and risked death or injury from gunfire, bombardments, and the Spanish Flu. Not all of them would survive.The women of the U.S. Army Signal Corps served with honor and played an essential role in achieving the Allied victory. Their story has never been the focus of a novel...until now.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "World War I",
    "Book Club",
    "War"
  ],
  "author": "Jennifer Chiaverini",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/59361487-switchboard-soldiers"
}