{
  "title": "Dukes of Ruin",
  "description": "The crowns of Forsyth Royalty aren’t built with jewels. They’re forged in blood and sacrifice.\nThey say a parent should never pick favorites, but my d*ck of a father, Lionel Lucia, is no Ward Cleaver. He's a Count—a King of Forsyth—and all he ever wanted was a daughter to marry off and a son to secure his legacy. My sister's marriage to the leader of the Counts would keep him in control of his house. If he'd had a son, things would have been perfect.Instead, he got me.Too wild. Too rash. Too rebellious. I'm half as pretty as my sister, and twice as stubborn. I grew up under the brutal force of our father's fist, but it didn't break me. If anything, it just made me more determined to strike back. And I would have, too.If my sister hadn't disappeared.I’ve spent the last year at the mercy of the Kings, caged and tormented. But the three thugs who arrive in the night, masked and vicious, decide to take me for their own.There's the Maniac, with his razor-sharp smile and frantic eyes, thrashing around me in a hurricane of hard touches and whispered words. By the time Remy's done marking me, I'm not sure there'll be anything left to call my own.The Lurker, with his malevolent stare and bitter tongue, hates me the most. It's easier with him, knowing that he could never want me. If being the object of Sy's resentment is bad, then being the object of his desire just might be my undoing.The Creep is the worst of all three. Not because he's meaner or harsher, but because he's neither. Two hundred pounds of inked, imposing muscle, Nick Bruin has been following me since I first became a pawn. Now, he means to make me his.The Dukes are known for winning with their fists, but transforming Lavinia Lucia from the Kings’ captive to their unwilling Duchess will be their biggest match yet.The saga continues in book 4 of the contemporary, dark romance, Royals of Forsyth series, where the Duke’s reign will be one of Ruin, Madness and Peril.",
  "genres": [
    "Dark Romance",
    "Reverse Harem",
    "Dark",
    "Romance",
    "Enemies To Lovers",
    "College",
    "Contemporary"
  ],
  "author": "Angel Lawson",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/59356154-dukes-of-ruin"
}