{
  "title": "The Queen's Enforcer",
  "description": "The Church of Rome rules the human population of the Continent with an iron hand. Beyond the borders of its influence are night children: vampires, werewolves, shifter, nymphs, incubi, djinn, and others. As steam engines begin to chug across new-laid track, demons appear.In the shadow of the Church, young Queen Amillia of Albion clings to power, relying on her enforcer Jarvis to keep her advisors satisfied and her enemies at bay. But as each day marches forward, the powers around her demand she marry, and give away her cousin Elizabeth to be wed.Driven to the edge by dreams of his dead lover, Shane, Jarvis exists only to carry out his orders from Church and Crown, to kill all non-human beings on sight. Resistant to magics, he brings battle against the demons and night children other soldiers dare not face, including the blood-thirsty Blue Death pirates. But sneers and whispers are building behind his back as he defeats enemies no human man should be able to survive.The dragon Damascus, summoned by Zapheal, flies to Aquitaine. The Church is moving against her people, ready to eliminate the last bastion of night children. Abandoned by the other elder vampires, Zapheal contemplates a final stand with the remnants of her allies.Captured into slavery, Telos, a snow leopard shifter, struggles to survive. Until the day that the Lord Inquisitor Melchizedek murders his owner and takes him to Albion, planning to lure Telos’s adopted father, the Admiral of the Blue Deaths to his doom. Fighting for the man who saved him as a child, the best that Telos can hope for is a quick death.That is, until he meets Jarvis. On the edge of destruction, Telos asks the question that will shake thrones and awaken legends, leaving Jarvis no choice but to face the answers.For mature audiences only. This is a full 740 page epic fantasy novel.A prequel novella is also available now, A General’s Claim.Some parts of this book and characters therein originally appeared in the now unpublished Terms Series by the same author.",
  "genres": [
    "Fantasy"
  ],
  "author": "Ciara Darren",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/59350175-the-queen-s-enforcer"
}