{
  "title": "Laughing Hearts",
  "description": "One mistaken kiss with my brother’s best friend, and all I can think about is kissing him again.Nothing would make Leann happier than finding the love of her life. She knows what she wants in a man, but it doesn’t seem to exist in the small town she calls home.She doesn’t risk her heart easily, either. Especially not after her last serious boyfriend left her when her dad unexpectedly died.But when she mistakenly enters the wrong blind kissing booth and kisses the wrong man, everything she thought she knew about that man changes.A blind kissing booth isn’t exactly something Sam would normally do. But when his best friend begs him to take his place, Sam reluctantly agrees.She shouldn’t have entered Sam’s booth. Leann is his best friend’s sister, which means she’s off-limits. When he realizes who she is, he should have stopped her.But he doesn’t.And it’s the best kiss of his life.Now faced with an unexpected attraction, Sam and Leann struggle to accept their growing feelings for each other. Sam could lose everything if things don’t work out between them—his best friend, his job, and his ability to care for his family. Can Leann prove to him that she’s worth the risk?Laughing Hearts is a steamy full-length STANDALONE romance filled with lots of sexy times in the bedroom (or next to a campfire), profanity, and love with a HEA ending!Author Notes: Fans of Claire Kingsley, Melanie Harlow, and Catherine Cowles will love this new series by Aria Bliss. Get ready to stay up all night laughing, crying, and swooning. A kind, funny cowboy who will do anything for his family and a hopeless romantic who’s a little terrified of falling in love. A brother’s best friend, secret dating, best friend’s sister, boss’s sister romance about two unsuspecting people find love where they least expected. This one has all the feels and enough steam to fog up your windows. This fictional small town and all the families that built it will steal your heart and keep you coming back for more.The books in Hearts of Watercress Falls are all standalone novels and can be read in any order. But if you love family drama and the subtle build of future romances, I suggest you read them in order, starting with Healing Hearts.",
  "genres": [
    "Romance",
    "Westerns"
  ],
  "author": "Aria Bliss",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/59360638-laughing-hearts"
}