{
  "title": "Rethinking Misrecognition and Struggles for Recognition: Critical Theory Beyond Honneth",
  "description": "The need for justice for individuals, groups, and society as a whole has perhaps never been more pressing. The presence or absence of social recognition plays a vital role in both social injustices and efforts to overcome and prevent them. Critical theory philosopher Axel Honneth’s influential accounts of recognition and struggles for recognition contain important insights about injustice and social justice movements. Unfortunately, some of Honneth’s concepts are narrow and need expansion for them to be useful in considering social injustices and responses to those injustices. This is especially true if we are to understand and respond to current social justice issues such as Black Lives Matter and the climate crisis. Douglas Giles presents an important corrective and addition to Axel Honneth’s view of recognition that gives the concepts of recognition, misrecognition, and struggles for recognition more explanatory power. He first critiques Honneth’s portrayal of misrecognition as being a simple lack of recognition and provides an alternative view of misrecognition as complex and multidimensional, helping us better understand the causes and effects of injustices. He then engages in a critical examination of Honneth’s account of struggles for recognition—the emancipation from injustice. The American civil rights movement and women’s suffrage movements are archetypal political struggles for recognition, but Honneth, like Charles Taylor and others, sees struggles for recognition only as political struggles, leaving out much of the story of struggles for recognition. In response, Giles presents a more robust picture of struggles for recognition that decentralizes struggles for recognition by including individual experience and agency. This contribution to recognition studies expands the reality of recognition and misrecognition beyond theoretical concepts into the daily lives of individuals. Recognition is essential for affirming one’s identity and one’s place in community and society. Misrecognition is at the heart of many injustices from interpersonal relations to structural socioeconomic inequalities. Struggles for recognition are ubiquitous for everyone because people’s need for recognition extends far beyond political recognition. Giles crafts a view of recognition and misrecognition that identifies some important problems in critical theory’s approach to social justice and offers new conceptualizations to assist future research in various fields of critical social theories.",
  "genres": [],
  "author": "Douglas Giles",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/59347474-rethinking-misrecognition-and-struggles-for-recognition"
}