{
  "title": "Lunar Witch",
  "description": "No man would ever own me again.A simple promise I’d made to myself after escaping a brutal childhood of abuse and being trained to enact violence on unblessed witches. Since that moment, I had managed to survive on the streets by successfully pickpocketing.Unfortunately, after years of hiding, the monster who starred in all of my nightmares was closer than ever and I was faced with only one option - seeking refuge at the Dark Imaginarium Academy.Filled with the elite witches of our society, I should have expected to run into some of my previous targets and that normally wouldn’t have been a problem. It wasn’t like they’d known I’d stolen from them.Except for my last hit.What I stole from him was something I would never forget because it was literally embedded in my chest. Yeah, he was a bit upset about that one... as in acting absolutely psychotic. Except he's not the only one...A blood witch who has an addiction to my taste.A lunar witch who takes pleasure in trying to scare me into submission.An unblessed that wants to dissect me, literally.A shadow witch that relishes in marking up my body to show ownership.These men want to claim me, own me, and the treasure that I now possess, but I would never break the promise I made to myself.But when my past follows me right into the place I considered a safe haven, I find that these psychos may be the exact key to getting rid of my problem forever. The only problem? These men are convinced that I've never experienced the type of horror that would be required for that to happen, that they have to protect me from it. What they don’t realize?Killing left a stain on the soul and mine was pitch black.Lunar Witch features characters that are all 18+. This is not a high school academy book and the contents are intended for mature audiences. This book includes violence, mature content, PTSD, flashbacks of abuse, and sex. There is no bullying from the harem, just psychotic men trying to claim their girl.Lunar Witch is book one of three in the Phases of the Moon series, which is set within the shared universe of Dark Imaginarium Academy. All series can be read independently, but characters have crossovers and it is highly encouraged to read all within the universe to understand the world in its entirety.Series within the universe:Phases of the Moon by M. SinclairThe Creatures We Crave by R.L. CaulderThe Storm Dragons’ Mate by M. Sinclair (Coming soon)Blood Oath by R.L. Caulder (Coming soon)",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Paranormal",
    "Magic",
    "Romance",
    "Witches",
    "Paranormal Romance"
  ],
  "author": "M. Sinclair",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/59366787-lunar-witch"
}