{
  "title": "Water Ghosts",
  "description": "A mesmerizing story of a community of Chinese immigrants in a small California town in 1928, weaving history and mythology around the lives of the townspeople and the ghosts who haunt themLocke, CA, 1928— Three bedraggled Chinese women suddenly appear out of the mist one afternoon in a small Chinese farming town on the Sacramento River, and their arrival throws the community into confusion. Two of the women are unknown to the townspeople, while the third is the long-lost wife of Richard Fong, the handsome manager of the local gambling parlor, who had left her behind in China many years earlier and had not yet returned for her. Richard’s wife’s unexpected arrival complicates his life in no small way—not least with two prostitutes at the local brothel he frequents. One, the beautiful young Chloe, depends on him but has eyes for someone else, someone even more forbidden—the local preacher’s daughter. The other, Poppy, the psychic madam of the brothel, is desperately in love with him, and she begins to sink into despair as he grows further and further away from her. As the lives of the townspeople become inextricably intertwined with the newly arrived women, Poppy’s premonitions begin to foretell a deep unhappiness for all involved. And when a flood threatens the livelihood of the entire town, the frightening power of these mysterious women who arrived in the mist will be revealed. Shawna Yang Ryan’s melodic first novel is a passionate, sophisticated intertwining of fact and fiction that examines mingling cultures, modern myths, and forgotten history. Locke 1928 beautifully chronicles separation and betrayal, loneliness and longing, and what happens when a Chinese ghost story begins to come true.",
  "genres": [
    "Horror",
    "Historical Fiction",
    "Fiction",
    "Magical Realism",
    "China",
    "Ghosts",
    "Adult"
  ],
  "author": "Shawna Yang Ryan",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/5936880-water-ghosts"
}