{
  "title": "Entanglements",
  "description": "Praise for the writing of Patricia Mason***** 5 out of 5 stars for \"Engaging and gripping... This book will delightfully knock you off your seat with its constant wicked encounters and then sweep you off your feet with the romance.\" -- The Bornean Bookworm***** \"A wonderful book... I totally fell in love with the hero...Entanglements captivated me.\" -- The Anipal Times OverviewEntanglements (full-length urban fantasy/paranormal romance)-- Accidentally opening a vortex sucks!Teen KIZZY TAYLOR is just hoping for an evening of fun when she joins her friends in a spelunking expedition through an under-city tunnel. But fun turns bizarre when Kizzy accidentally opens a vortex and her stepsister is swept through to an evil alternate dimension. The only way to rescue her stepsister is to reopen the vortex and go in after her. But is her new boyfriend, ROM CALIXO, going to help Kizzy or try to stop her? And if she can get past Rom, will she be able to get back home?More Acclaim for P.R. Mason\"Ms. Mason blends the paranormal...into a world I was sucked into.\" - Jess Macallan, ParaYourNormal (about Entanglements).\"...The writing pace was fast, and that the book sucked me in from the very beginning... I would recommend it to all people who enjoy young adult paranormal romance novels.\"- I Heart Reading (about Entanglements).\"This book was fantastic...a must read\" -- The Romance Studio (about A Girl, A Guy and A Ghost).\"An intriguingly beautiful paranormal romance that will have readers longing for more.\" --Night Owl Reviews (about A Girl, A guy and A Ghost).\"This is a wonderful story and I hope to read more from Ms. Mason and soon!\" -- The Pen & Muse (about Sacrifice in Stone)\"What an awesome story!\" -- JER Reviews (about Undisclosed Desires).More Kindle eBooks by P.R. Young Adult Paranormal RomanceTHE BANSHEE AND THE LINEBACKER (Paranormal Romance Novella)Could she betray him...to save his life?Always the good-girl, TARA is a typical high-school cheerleader dating a nice-guy football player. She's typical, that is, except for the fact that she's a Banshee who gets premonitions of other people's deaths. When Tara sees her boyfriend LIAM's death in an upcoming game, Tara vows to do anything she can to save his life...even if it means cheating on him with his bad-boy twin brother, KEAGAN. Can she change Liam's fate? And if she does, will her own change with it?FATED HEARTS (a paranormal romance novella) -- Will his love mean her end?EVE has always played by the rules, afraid to take chances. HOLDEN wants to change that. She's certain they've never met before...or have they? Holden seems so familiar, but who is he? What is he? Yesterday her biggest challenge was trying not to bomb on her SATs. Today, paranormal forces have transformed an ordinary high school dance into a test of fate vs. free will and loving Holden could cost Eve everything..",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Paranormal Romance",
    "Paranormal",
    "Fiction",
    "Urban Fantasy"
  ],
  "author": "Patricia Mason",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/12820759-entanglements"
}