{
  "title": "The Jigsaw Assassin (4)",
  "description": "NEW IN THE MAJOR BHAAJAN A TOUGH FEMALE PI NOVEL WITH NOIR OVERTONES AGAINST THE BACKDROP OF INTERSTELLAR POLITICSSelei City is the capital of the Imperialate and one of the most desired locales in all of the Skolian Empire. But its thin veneer of civilization is cracked when a series of brutal crimes implicates those in political power in a vast conspiracy. Three prominent scientists have lost their lives to a serial killer—and notes at the scenes of the crimes lead to a connection to the Royalist political party.Major Bhaajan, former military officer turned private detective, is called back to Selei City to solve the crime. Bhaaj and her crew of Undercity Dust Knights plunge into the Byzantine world of Imperial politics—a jigsaw world where none of the pieces seem to fit. As the assassination plot becomes more and more convoluted, Bhaaj is kidnapped and threatened with death and must fight for her life against the growing number of people threatened by her investigation. Bhaaj has faced all this and more, but now she must deal with something far deadlier—interstellar politics.About The Vanished Seas :“Catherine Asaro continues exploring the underbelly of her baroque, decadent Skolian Empire with this latest adventure of Major Bhaajan, private eye to the highest nobility. . . . It’s a story full of intrigue, mystery, and action. Along with Asaro’s trademark deeply human characters and intricate politics comes a noir-flavored plot that drips with menace and secrets. Major Bhaajan is a compelling character, smart and sympathetic, and both the squalid Undercity and the decadent City of Cries are engrossing. Those who are familiar with the Skolian Empire will find much to like here. For those who aren’t, the Major Bhaajan books make a fine jumping-on point to this vast and convoluted universe.”— AnalogAbout the Major Bhaajan “. . . riveting. . . . The world is rich and vivid, with two distinct cultures in the Undercity and the aboveground City of Cries. This exciting novel stands alone for anyone who enjoys science fiction adventure.”— Publishers Weekly starred review“Asaro plants herself firmly into that grand SF tradition of future history franchises favored by luminaries like Heinlein, Asimov, Herbert, Anderson, Dickson, Niven, Cherryh, and Baxter . . . They don't write em like that anymore! Except Asaro does, with . . . up-to-the-minute savvy!” —Locus“Baahjan, who starts out keeping an emotional distance from the people in the Undercity soon grows to think of them as her community once more. Asaro . . . returns to the Skolian empire's early history to tell Bhaajan's story.” —Booklist“Asaro delivers a tale rich with the embedded history of her world and bright with technical marvels. Her characters are engaging and intriguing and there is even a bit of romance. What really touched my heart was Bhaaj's interaction with the children of the aqueducts. I spent the last fifty pages of the book sniffling into a tissue.” —SFcrowsnest“I‘m hooked, both on her writing and her Skolian universe. This book had everything I strong characters, a new and unique world, and a plot that isn't as simple as it first appears.” —TerryTalkAbout the Skolian “Entertaining mix of hard SF and romance.” —Publishers Weekly“ Asaro’s Skolian saga is now nearly as long and in many ways as compelling as Dune, if not more so, featuring a multitude of stronger female characters.” —Booklist“Rapid pacing and gripping suspense.” —Publishers Weekly",
  "genres": [
    "Science Fiction",
    "Mystery",
    "Science Fiction Fantasy",
    "Fantasy",
    "Suspense",
    "Space Opera"
  ],
  "author": "Catherine Asaro",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/59366273-the-jigsaw-assassin-4"
}