{
  "title": "As They See 'Em: A Fan's Travels in the Land of Umpires",
  "description": "Millions of American baseball fans know, with absolute certainty, that umpires are simply overpaid galoots who are doing an easy job badly. Millions of American baseball fans are wrong. \n  As They See 'Em is an insider's look at the largely unknown world of professional umpires, the small group of men (and the very occasional woman) who make sure America's favorite pastime is conducted in a manner that is clean, crisp, and true. Bruce Weber, a New York Times reporter, not only interviewed dozens of professional umpires but entered their world, trained to become an umpire, and then spent a season working games from Little League to big league spring training.  As They See 'Em is Weber's entertaining account of this experience as well as a lively exploration of what amounts to an eccentric secret society, with its own customs, its own rituals, its own colorful vocabulary. (Know what a \"whacker\" is? A \"pole bender\"? \"Rat cheese\"? Think you could \"strap it on\" or \"take the stick\"?) He explains the arcane set of rules by which umps work and details the exasperating, tortuous path that allows only a select few to graduate from the minor leagues to the majors. He describes what it's like to work in a ballpark where not only the fans but the players, the managers and coaches, the announcers, the team owners, and even the league presidents, resent them -- and vice versa. And he asks, quite sensibly, why anyone would do a job that offers the chance to earn only blame and never credit.  Weber reveals how umps are tutored to work behind the plate, what they learn to watch for on the bases, and how proper positioning for every imaginable situation on the field is drilled into them. He describes how they're counseled to respond -- or not -- to managers who are screaming at them from inches away with purposeful inanity, and tells us exactly which \"magic\" words result in an automatic ejection. Writing with deep knowledge of and affection for baseball, he delves into such questions as: Why isn't every strike created equal? Is the ump part of the game or outside of it? Why doesn't a tie go to the runner? And what do umps and managers say to each other during an argument, really?  In addition to professional umpires, Weber spoke to current and former players including Alex Rodriguez, Barry Bonds, Tom Glavine, Barry Zito, Paul Lo Duca, Kenny Lofton, Ron Darling, and Robin Yount, as well as former baseball commissioner Fay Vincent, Atlanta Braves manager Bobby Cox, Chicago White Sox manager Ozzie Guillen, Detroit Tigers manager Jim Leyland, and many others in the professional game. He attended the 2006 and 2007 World Series, interviewing the umpire crews who called those games and who spoke candidly about the pressure of being scrutinized by millions -- maybe billions! -- of fans around the world, all of them armed with television's slo-mo, hi-def instant replay. As fans know, in 2008, a rash of miscalled home run balls led baseball, for the first time, to use replay to help big league umps make their decisions.Weber discusses these events and the umpires' surprising reaction to them.  Packed with fascinating reportage that reveals the game as never before and answers the kinds of questions that fans, exasperated by the clichés of conventional sports commentary, pose to themselves around the television set, Bruce Weber's As They See 'Em is a towering grand slam.",
  "genres": [
    "Baseball",
    "Sports",
    "Nonfiction",
    "Audiobook",
    "Memoir",
    "Biography",
    "History"
  ],
  "author": "Bruce Weber",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/5936792-as-they-see-em"
}