{
  "title": "The Gotti Wars: Taking Down America's Most Notorious Mobster",
  "description": "“Riveting…an electrifying true crime story of the Mafia-smitten eighties and nineties. Suspenseful and multifaceted, The Gotti Wars can’t be missed.” — Esquire , The Best Nonfiction Books of the YearA “meticulous chronicle of good triumphing over evil” ( The Washington Post ) from the determined young prosecutor who, in two of America’s most celebrated trials, managed to convict famed mob boss John Gotti—and ultimately took down the Mafia altogether.John Gotti was without a doubt the flashiest and most feared Mafioso in American history. He became the boss of the Gambino Crime Family in spectacular fashion—with the brazen and very public murder of Paul Castellano in front of Sparks Steakhouse in midtown Manhattan in 1985. Not one to stay below law enforcement’s radar, Gotti instead became the first celebrity crime boss. His penchant for eye-catching apparel earned him the nickname “The Dapper Don;” his ability to beat criminal charges led to “The Teflon Don.”This is the captivating story of Gotti’s meteoric rise to power and his equally dramatic downfall. Every step of the way, Gotti’s legal adversary—John Gleeson, an Assistant US Attorney in Brooklyn—was watching. When Gotti finally faced two federal racketeering prosecutions, Gleeson prosecuted both. As the junior lawyer in the first case—a bitter seven-month battle that ended in Gotti’s acquittal—Gleeson found himself in Gotti’s crosshairs, falsely accused of serious crimes by a defense witness Gotti intimidated into committing perjury.Five years later, Gleeson was in charge of the second racketeering investigation and trial. Armed with the FBI’s secret recordings of Gotti’s conversations with his underboss and consigliere in the apartment above Gotti’s Little Italy hangout, Gleeson indicted all three. He “flipped” underboss Sammy the Bull Gravano, killer of nineteen men, who became history’s highest-ranking mob turncoat—resulting in Gotti’s murder conviction. Gleeson ended not just Gotti’s reign, but eventually that of the entire mob.A spellbinding, page-turning courtroom drama, The Gotti Wars “tells us in electrifying detail how the good guys finally won, how justice triumphed over evil, and how Gleeson himself was transformed by his long war” (Nelson DeMille).",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Crime",
    "History",
    "Biography",
    "Audiobook",
    "Memoir"
  ],
  "author": "John Gleeson",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/59366248-the-gotti-wars"
}