{
  "title": "Butts: A Backstory",
  "description": "Whether we love them or hate them, think they’re sexy, think they’re strange, consider them too big, too small, or anywhere in between, humans have a complicated relationship with butts. It is a body part unique to humans, critical to our evolution and survival, and yet it has come to signify so much more: sex, desire, comedy, shame. A woman’s butt, in particular, is forever being assessed, criticized, and objectified, from anxious self-examinations trying on jeans in department store dressing rooms to enduring crass remarks while walking down a street or high school hallways. But why? In Butts: A Backstory, reporter, essayist, and RadioLab contributing editor Heather Radke is determined to find out. Spanning nearly two centuries, this “whip-smart” (Publishers Weekly, starred review) cultural history takes us from the performance halls of 19th-century London to the aerobics studios of the 1980s, the music video set of Sir Mix-a-Lot’s “Baby Got Back” and the mountains of Arizona, where every year humans and horses race in a feat of gluteal endurance. Along the way, she meets evolutionary biologists who study how butts first developed; models whose measurements have defined jean sizing for millions of women; and the fitness gurus who created fads like “Buns of Steel.” She also examines the central importance of race through figures like Sarah Bartmann, once known as the “Venus Hottentot,” Josephine Baker, Jennifer Lopez, and other women of color whose butts have been idolized, envied, and despised. Part deep dive reportage, part personal journey, part cabinet of curiosities, Butts is an entertaining, illuminating, and thoughtful examination of why certain silhouettes come in and out of fashion—and how larger ideas about race, control, liberation, and power affect our most private feelings about ourselves and others.",
  "genres": [
    "Nonfiction",
    "History",
    "Audiobook",
    "Science",
    "Feminism",
    "Sociology",
    "Book Club"
  ],
  "author": "Heather Radke",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/59366123-butts"
}