{
  "title": "Blood Orange Night: My Journey to the Edge of Madness",
  "description": "Brain on Fire meets High Achiever in this “page-turner memoir chronicling a woman’s accidental descent into prescription benzodiazepine dependence—and the life-threatening impacts of long-term use—that chills to the bone” ( Nylon ).As Melissa Bond raises her infant daughter and a special-needs one-year-old son, she suffers from unbearable insomnia, sleeping an hour or less each night. She loses her job as a journalist (a casualty of the 2008 recession), and her relationship with her husband grows distant. Her doctor casually prescribes benzodiazepines—a family of drugs that includes Xanax, Valium, Klonopin, Ativan—and increases her dosage regularly.Following her doctor’s orders, Melissa takes the pills night after night until her body begins to shut down. Only when she collapses while holding her daughter does Melissa learn that her doctor—like so many others—has over-prescribed the medication and quitting cold turkey could lead to psychosis or fatal seizures. Benzodiazepine addiction is not well studied, and few experts know how to help Melissa as she begins the months-long process of tapering off the pills without suffering debilitating, potentially deadly consequences.Each page thrums with the heartbeat of Melissa’s struggle—how many hours has she slept? How many weeks old are her babies? How many milligrams has she taken? Her propulsive writing crescendos to a fever pitch as she fights for her health and her ability to care for her children. “Propulsive, poetic” ( Shelf Awareness ), and immersive, this “vivid chronicle of suffering” ( Kirkus Reviews ) and redemption shines a light on the prescription benzodiazepine epidemic as it reaches a crisis point in this country.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Mental Health",
    "Audiobook",
    "Biography Memoir",
    "Biography",
    "Psychology"
  ],
  "author": "Melissa   Bond",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/59366254-blood-orange-night"
}