{
  "title": "Cold, Cold Bones",
  "description": "“Reichs has written her masterpiece—smart, scary, complicated, and engrossing.” —Michael Connelly“This page-turning series never lets the reader down.” —Harlan Coben“The crowning achievement of a master storyteller.” —Nelson DeMille#1 New York Times bestselling thriller writer Kathy Reichs’s twenty-first novel of suspense featuring forensic anthropologist Temperance Brennan who uncovers a series of gruesome killings eerily reenacting the most shocking of her prior cases.Winter has come to North Carolina and, with it, a drop in crime. Freed from a heavy work schedule, Tempe Brennan is content to dote on her daughter Katy, finally returned to civilian life from the army. But when mother and daughter meet at Tempe’s place one night, they find a box on the back porch. a very fresh human eyeball.GPS coordinates etched into the eyeball lead to a Benedictine monastery where an equally macabre discovery awaits. Soon after, Tempe examines a mummified corpse in a state park, and her anxiety deepens.There seems to be no pattern to the subsequent killings uncovered, except that each mimics in some way a homicide that a younger Tempe had been called in to analyze. Who or what is targeting her, and why?Helping Tempe search for answers is detective Erskine “Skinny” Slidell, retired but still volunteering with the CMPD cold case unit—and still displaying his gallows humor. Also pulled into the Andrew Ryan, Tempe’s Montreal-based beau, now working as a private detective.Could this elaborately staged skein of mayhem be the prelude to a twist that is even more shocking? Tempe is at a loss to establish the motive for what is going on…and then her daughter disappears.At its core, Cold, Cold Bones is a novel of revenge—one in which revisiting the past may prove the only way to unravel the present.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Thriller",
    "Mystery Thriller",
    "Audiobook",
    "Suspense"
  ],
  "author": "Kathy Reichs",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/59366257-cold-cold-bones"
}