{
  "title": "Keya Das's Second Act",
  "description": "A poignant, heartwarming, and charmingly funny debut novel about how a discovered box in the attic leads one Bengali American family down a path toward understanding the importance of family, even when splintered.Shantanu Das is living in the shadows of his past. In his fifties, he finds himself isolated from his traditional Bengali community after a devastating divorce from his wife, Chaitali; he hasn’t spoken to his eldest daughter Mitali in months; and most painfully, he lives each day with the regret that he didn’t accept his teenaged daughter Keya after she came out as gay. As the anniversary of Keya’s death approaches, Shantanu wakes up one morning utterly alone in his suburban New Jersey home and realizes it’s finally time to move on.This is when Shantanu discovers a tucked-away box in the attic that could change everything. He calls Mitali and pleads with her to come home. She does so out of pity, not realizing that her life is about to shift.Inside the box is an unfinished manuscript that Keya and her girlfriend were writing. It’s a surprising discovery that brings Keya to life briefly. But Neesh Desai, a new love interest for Mitali with regrets of his own, comes up with a wild idea, one that would give Keya more what if they are to stage the play? It could be an homage to Keya’s memory, and a way to make amends. But first, the Dases need to convince Pamela Moore, Keya’s girlfriend, to give her blessing. And they have to overcome ghosts from the past they haven’t met yet.A story of redemption and righting the wrongs of the past, Keya Das’s Second Act is a warmly drawn homage to family, creativity, and second chances. Set in the vibrant world of Bengalis in the New Jersey suburbs, this debut novel is both poignant and, at times, a surprising hilarious testament to the unexpected ways we build family and find love, old and new.",
  "genres": [
    "Fiction",
    "Contemporary",
    "LGBT",
    "Audiobook",
    "India",
    "Queer",
    "Literary Fiction"
  ],
  "author": "Sopan Deb",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/59366241-keya-das-s-second-act"
}