{
  "title": "The Tea Dragon Society Box Set",
  "description": "\"This book is wonderfully inclusive, and depicts a distinct and expressive cast of LGBTQIA characters and people of color.\" — School Library JournalIn the bewitching Tea Dragon Society series, two-time Eisner Award-winning creator K. O’Neill offers three stories featuring the enchanting world of Tea Dragons. Now collected in a beautiful box set with brand-new box cover art, readers can experience The Tea Dragon Society, The Tea Dragon Festival, and The Tea Dragon Tapestry from start to finish. This charming and peaceful trilogy is heartwarming, inclusive, and absolutely magical.   \nThe Tea Dragon Society\n After discovering a lost tea dragon in the marketplace, Greta learns about the dying art form of tea dragon caretaking from the kind tea shop owners, Hesekiel and Erik. As she befriends them and their shy ward, Minette, Greta sees how the craft enriches their lives—and eventually her own. \nThe Tea Dragon Festival\n Rinn has grown up with the Tea Dragons that inhabit their village, but stumbling across a real dragon turns out to be a different matter entirely! Aedhan is a young dragon who was appointed to protect the village, but fell asleep in the forest eighty years ago. With the aid of Rinn’s adventuring uncle Erik and his partner Hesekiel, they investigate the mystery of his enchanted sleep... But Rinn’s real challenge is to help Aedhan come to terms with feeling that he cannot get back the time he has lost.  The Tea Dragon Tapestry Join Greta and Minette once more for the heartwarming conclusion of the award-winning Tea Dragon series! Over a year since being entrusted with Ginseng's care, Greta still can't chase away the cloud of mourning that hangs over the timid Tea Dragon. Meanwhile, Minette receives a surprise package from the monastery where she was once training to be a prophetess. Told with the same care and charm as the previous installments of the Tea Dragon series, The Tea Dragon Tapestry welcomes old friends and new into a heartfelt story of purpose, love, and growth.",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "Comics",
    "Middle Grade",
    "LGBT",
    "Dragons",
    "Cozy"
  ],
  "author": "Kay O'Neill",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/59365380-the-tea-dragon-society-box-set"
}