{
  "title": "The Foundling",
  "description": "From the New York Times bestselling author of The Good House , the story of two friends, raised in the same orphanage, whose loyalty is put to the ultimate test when they meet years later at a controversial institution—one as an employee; the other, an inmate.It’s 1927 and eighteen-year-old Mary Engle is hired to work as a secretary at a remote but scenic institution for mentally disabled women called the Nettleton State Village for Feebleminded Women of Childbearing Age . She’s immediately in awe of her employer—brilliant, genteel Dr. Agnes Vogel.Dr. Vogel had been the only woman in her class in medical school. As a young psychiatrist she was an outspoken crusader for women’s suffrage. Now, at age forty, Dr. Vogel runs one of the largest and most self-sufficient public asylums for women in the country. Mary deeply admires how dedicated the doctor is to the poor and vulnerable women under her care.Soon after she’s hired, Mary learns that a girl from her childhood orphanage is one of the inmates. Mary remembers Lillian as a beautiful free spirit with a sometimes-tempestuous side. Could she be mentally disabled? When Lillian begs Mary to help her escape, alleging the asylum is not what it seems, Mary is faced with a terrible choice. Should she trust her troubled friend with whom she shares a dark childhood secret? Mary’s decision triggers a hair-raising sequence of events with life-altering consequences for all.Inspired by a true story about the author’s grandmother, The Foundling offers a rare look at a shocking chapter of American history. This gripping page-turner will have readers on the edge of their seats right up to the stunning last page…asking themselves, “Did this really happen here ?”",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Mystery",
    "Audiobook",
    "Thriller"
  ],
  "author": "Ann Leary",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/59366094-the-foundling"
}