{
  "title": "Everyone in This Room Will Someday Be Dead",
  "description": "In this “fun, page-turner of a novel” (Sarah Haywood, New York Times bestselling author) that’s perfect for fans of \nMostly Dead Things\n and Goodbye, Vitamin, a morbidly anxious young woman stumbles into a job as a receptionist at a Catholic church and soon finds herself obsessed with her predecessor’s mysterious death. Gilda, a twenty-something, atheist, animal-loving lesbian, cannot stop ruminating about death. Desperate for relief from her panicky mind and alienated from her repressive family, she responds to a flyer for free therapy at a local Catholic church, and finds herself being greeted by Father Jeff, who assumes she’s there for a job interview. Too embarrassed to correct him, Gilda is abruptly hired to replace the recently deceased receptionist Grace. In between trying to memorize the lines to Catholic mass, hiding the fact that she has a new girlfriend, and erecting a dirty dish tower in her crumbling apartment, Gilda strikes up an email correspondence with Grace’s old friend. She can’t bear to ignore the kindly old woman who has been trying to reach her friend through the church inbox, but she also can’t bring herself to break the bad news. Desperate, she begins impersonating Grace via email. But when the police discover suspicious circumstances surrounding Grace’s death, Gilda may have to finally reveal the truth of her mortifying existence. With a “kindhearted heroine we all need right now” (Courtney Maum, New York Times bestselling author), Everyone in This Room Will Someday Be Dead is a crackling and “delightfully weird reminder that we will one day turn to dust and that yes, this is depressing, but it’s also what makes life beautiful” (Jean Kyoung Frazier, author of Pizza Girl).",
  "genres": [
    "Fiction",
    "Contemporary",
    "LGBT",
    "Queer",
    "Mental Health",
    "Lesbian",
    "Audiobook"
  ],
  "author": "Emily R. Austin",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/59366182-everyone-in-this-room-will-someday-be-dead"
}