{
  "title": "Love or Perish: A Holocaust Survivor’s Vision for Interfaith Peace",
  "description": "In the hope that our earth would never again be soaked with blood, Harold Kasimow has dedicated his life to spreading hope and goodwill through interreligious dialogue. Kasimow’s latest book leads with the heart-wrenching personal story of how he and his family survived the Holocaust by hiding under a cowshed for over nineteen months. He follows with tributes to his mentor, Abraham Joshua Heschel, and other eminent theologians and philosophers.Kasimow explores and expands our knowledge of the power of interfaith dialogue and the people who’ve made it their life’s work. Within these pages, you will explore: ~How rabbis view the Holocaust and how this differs from the views of Jewish academics ~The deep friendship that developed between Rabbi Heschel and Dr. Martin Luther King ~How Buddhism has enriched the faith of many Christians and JewsKasimow’s latest book discusses the heart of many of the world’s religions to foster a community of love and respect. He holds an MA and Ph.D. in Religion from Temple University. He help found the Grinnell College's Department of Religious Studies and had a 1998 audience with Pope John Paul II to honor the publication of John Paul II and Interreligious Dialogue.Among many other scholars, Kasimow summons the spirit of his mentor and fellow Holocaust survivor Rabbi Abraham Heschel in noting “We must believe that, morally speaking, there is no limit to the concern one must feel for the suffering of human beings, that indifference to evil is worse than evil itself, that in a free society some are guilty, but all are responsible.”Kasimow successfully joins the tenets of moral responsibility, of remembering, and of education, all central values of Judaism. And, he notes, for all mankind. Never again is a direct result of never forget.If you’ve ever wondered about the meaning of monstrous horrors such as the Holocaust. right and wrong, good and evil, or how such incredible evil can find a foothold in this world, this book provides a means to begin understanding these questions.",
  "genres": [],
  "author": "Harold Kasimow",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/59388711-love-or-perish"
}