{
  "title": "A Monument To The End Of Time: Alchemy, Fulcanelli, & The Great Cross",
  "description": "A Monument to the End of Alchemy, Fulcanelli and the Great Cross reveals the deepest secret of western occultism – that the alchemical transformation of base metal into gold is also the transformation of Iron Age into Golden Age. The secret of alchemy is also the secret of the apocalypse, the catastrophic unveiling of the cosmic mystery. Beginning with the work of Fulcanneli, the 20th century’s most enigmatic alchemist and his intriguing message of this approaching apocalypse, the book ranges from the small Basque resort town of Hendaye, where the Cross still stands a few feet from the village square, to the western front of Notre Dame de Paris, the Pyrenees, ancient Egypt, the origin of Atlantis in South America and beyond, to the center of our galaxy and the secret of time. With its wealth of multi-disciplinary scholarship, A Monument to the End of Time provides a completely new insight on the ancient wisdom of alchemy. Decoding the message held by the Cyclic Cross of Hendaye, provided for posterity by a secretive group of initiates hidden in the Pyrenees, this loose thread on the tapestry of history points to a \"fatal season\" when a \"double catastrophe\" will try the northern hemisphere with fire – Judgment Day, in other words. Exploring in depth the history of alchemy’s involvement with eschatology and illuminated astronomy, A Monument to the End of Time follows the secret from Alexandria to the façade of the Gothic cathedrals, where Fulcanelli demonstrates that the secret has always been hidden in plain sight. The Cross at Henadaye’s message reveals that we are now living in that \"fatal season.\" It also reveals that this season is intimately connected to our solar system’s alignment with the center of the galaxy. Drawing upon the work of John Major Jenkins, Wilhelm Reich and Paul La Violette, A Monument to the End of Time suggests that these periodic alignments may in fact be the harbinger or origin of the earth’s precessionally timed, cyclic catastrophes. Part of the Cross’ message points to Peru, where evidence exists that the ancient culture of the Altiplano was actually that of Atlantis, and in a small valley near Cuzco an indigenous culture still lives in a mythical galactic Cross. From \"Atlantis\" the book returns to ancient Egypt, and places the fragments of astro-alchemy back into its original context as part of the ancient sacred science, before the concluding chapter ties up the loose ends by returning to the riddle of Fulcanelli and the mysterious alchemists in the Pyrenees with their message of approaching catastrophe.",
  "genres": [],
  "author": "Jay Weidner",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/59380.A_Monument_To_The_End_Of_Time"
}