{
  "title": "Adventures in Time and Space with Max Merriwell",
  "description": "Cruise into murder, mayhem, and alternate realities.Award-winning author Pat Murphy takes us aboard a luxury cruise ship and into the strange confluence of time and space known as the Bermuda Triangle, in an engaging science fiction romp that recalls the work of Kate Wilhelm.Susan Galina and her friend Pat have escaped their normal lives into the elegant, isolated world of the Odyssey , a luxury cruise ship heading from NY to Europe via Bermuda. Pat is working on her doctoral thesis in quantum physics, and Susan is recovering from a recent and unhappy divorce.To Susan's delight, she discovers that her favorite author, Max Merriwell, is also aboard ship, teaching writers' workshop. Susan's life becomes even more interesting when she meets Tom Clayton, the handsome chief of security. This cruise looks very promising indeed.But the pleasant shipboard vacation turns dark as the Odyssey passes into the Bermuda Triangle. Each year, Max Merriwell writes three a science fiction novel under his own name, a fantasy novel under the pseudonym Mary Maxwell, and a mystery novel under the pseudonym Weldon Merrimax. The trouble begins when Max receives a threatening note that appears to come from Weldon Merrimax, Max's own pseudonym. Susan hears wolves howling in the night, the ship's passengers are seized with a dancing mania, and monsters lurk in the ship's corridors. An eyewitness reports a murder—but the victim of the crime is not on the passenger list and the body is nowhere to be found. While others struggle to understand these strange events, Pat seeks the explanation in quantum theory.Out of these elements, Murphy builds a suspenseful, funny, fast-paced novel of shifting and intersecting realities that is a joy to read.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Mystery",
    "Audiobook",
    "Time Travel",
    "Adventure"
  ],
  "author": "Pat Murphy",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/593792.Adventures_in_Time_and_Space_with_Max_Merriwell"
}