{
  "title": "Life Lessons",
  "description": "Willowmead Academy - where taboo, tests, and trauma go to learn a thing or two.AbbieWhen I enrolled in sixth form at Willowmead Academy, I wasn't expecting much. I'd already experienced the worst pain imaginable, what's the point in living after that?But then I started to make friends, to stand up for myself again, to laugh. I finally started to live, and it's all because of the one man I should never want. The one man who pushes my buttons and makes me feel alive. It's ironic that for me to feel alive, he has to risk everything.After all, you aren't allowed to fall for your teacher.JettI pride myself on living by one rule: emotional ties are for the weak. The needy. Those who need constant reassurance to feel worthy. Well, not me.Once Willowmead’s most prestigious maths professor, the novelty of moulding eighteen-year-olds died the same day my reason for becoming a teacher did. Now the nearest bar is where you’ll find me, where the local women are desperate and my students don’t seem like such pricks.I know I’m an asshole, and I don’t need to justify the way I live with anyone else. Until she shows up.Defiant, infuriating, feisty. I find myself pushing her away as much as pulling her closer. The need to break her, ruin her, have her, consumes me.There will be no happy ending here. Only one of us can come out on top, and for once, I hope it’s not me.Trigger warningThis full length standalone novel contains strong references to mental ill-health including grief, self-harm, suicidal ideation and intent. It also features strong language and scenes of sexual content, which are not suitable for anyone under the age of eighteen. All characters are above the legal age of consent in this student-teacher, age gap, taboo romance.Now fill your wine glass, fetch your shatterproof ruler, and prepare to learn some Life Lessons.",
  "genres": [
    "Contemporary",
    "Romance",
    "New Adult"
  ],
  "author": "Emma Luna",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/59413396-life-lessons"
}