{
  "title": "The Terror and Other Stories",
  "description": "Arthur Machen produced some of the most evocative weird fiction in all literary history. Written with impeccably mellifluous prose, infused with a powerful mystical vision, and imbued with a wonder and terror that he felt with every fiber of his being, his novels and tales will survive when works of far greater technical accomplishment fall by the wayside. The Terror is a short novel that inspired a host of imitations of its basic plot—animals turning against human beings—ranging from Philip Macdonald’s brief tale “Our Feathered Friends” to Daphne du Maurier’s much better-known (but sadly mediocre) novelette, “The Birds.” The Terror reveals several features characteristic of Machen’s later fiction. The first, perhaps, is frank autobiography. The first-person narrative voice not only seems to be Machen himself, but he plays upon his own role as a journalist and reporter. There is no deliberate intent to deceive; but the circumstantiality of his account, and its generally reportorial tone, suggests that Machen is hoping to convey a deeper truth—the truth that the brief, fitful, and ultimately temporary “revolution” of the animals against humanity’s reign over the earth is a signal that human morals are collapsing as a result of the hideous and unprecedented warfare that had broken out two years earlier. The other feature that distinguishes The Terror is its mystery or even detective element. On the basis of several stories included here, one could easily imagine Machen writing an accomplished detective novel; but of course he would never have done so, for the notion of resolving all loose ends, and thereby emphasizing the rational intellect’s understanding of the world, was anathema to Machen, the religious mystic. For him, something of mystery must remain as a bulwark against the relentless march of science, which Machen felt was tearing away all the wonder and beauty of existence. And yet, in its way The Terror is nothing more than a logical working out of all possibilities, so that, by a process of elimination, a single explanation—even if it is supernatural—remains as the only viable solution to the case. Several other tales in this volume do indeed involve nothing supernatural—“The Islington Mystery” (1927), a murder tale pure and simple; “The Cosy Room” (1928), a conte cruel about the guilty conscience that plagues a murderer; “The Children of the Pool” (1936), a story that suggests the supernatural but proves to be one of psychological horror. Machen's witchery of words makes these works something more than mere crime stories; his vision, which always looks over the horizon of the known to the impenetrable mysteries beyond.",
  "genres": [
    "Horror",
    "Short Stories",
    "Weird Fiction",
    "Fantasy",
    "Fiction",
    "Cthulhu Mythos",
    "Classics"
  ],
  "author": "Arthur Machen",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/59395.The_Terror_and_Other_Stories"
}