{
  "title": "The Hunted One",
  "description": "Will this growly protector break her book-loving heart . . . or become her second chance at love?Savanna Vasquez lost her Navy SEAL husband years ago to terrorists, and she doesn’t think she’s capable of falling in love again. So, she busies herself by running her café and buries her face in the pages of fiction for a romantic escape.But when her late husband’s brother finds his way into her life, bringing a world of danger with him, Savanna is protected by a group of tough former Army guys. She feels like she’s inside one of her favorite novels, but she’s not so sure if her happily-ever-after will be guaranteed, especially when she finds herself alone with one of the dangerously handsome Delta operators.After twenty years of serving his country in the Army, Griffin Andrews now works for an elite security team. When he’s sent on a mission to protect a friend of the firm, he never expects to meet a woman who will bring his dead heart back to life. In Griffin’s eyes, Savanna’s still married, even if only in her heart—which means she’s off-limits. Forget the fact she’s also his assignment. With her being hunted by an unknown number of threats, he needs to focus on her safety and not the way she feels in his arms.Griffin’s resolve begins to slip the more time they spend together and his self-control snaps. The unexplainable connection between them has them both wondering if maybe they were brought together for another reason.And as Griffin does everything in his power to save Savanna, he discovers there’s a chance she just might save him too.From Wall Street Journal bestselling author, Brittney Sahin, comes a thrilling new series, full of sizzle and suspense. The Falcon Falls Security team will take you on exciting adventures around the globe as the heroes fall in love in these standalone romance military novels.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Romantic Suspense",
    "Military Romance",
    "Suspense",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Brittney Sahin",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/59416789-the-hunted-one"
}