{
  "title": "Begin Again Again",
  "description": "A sexy and emotional Sports, Soulmate, Love at First sight romance from critically acclaimed author Eve Dangerfield.Bethany Myers is looking for a fresh start. When the newly assertive and determined former #girlboss sees Byron Thomas, the hottest guy she has ever laid eyes on, she can’t help but catcall him on the street. But she never expects the former footballer to agree to a date with her, let alone give her the time of day.Beth meets Byron for drinks, hoping for a scorching one-night stand—or at least to feel his biceps. What she finds rather, to her shock, is a meaningful connection that her heart and her soul can’t deny. He is her One and the man she can’t live without.Byron is more than just a pretty face and a beautiful mind. But his heart has been broken and he still nurses scars from his past. Beth has sworn off wounded men, but she can’t stay away from this man and how he makes her feel. Will she be able to convince her One to take a chance on them and begin again?\"A breath of fresh air romance that cuts right through the haze.\" NYT Bestseller, Tessa Bailey\"Begin Again Again is yet another reminder that Eve Dangerfield is one of the most unique voices in the romance world.\" NYT Bestseller, L.J. Shen﻿“I love this book! A new mega-treasure for my keeper shelf!” NYT Bestseller, Annika Martin\"I adored this book. It is warm, funny, sexy, and unflinchingly human.\" USA Today bestseller, Andie J. Christopher\"All the things an Eve Dangerfield book is- sexy, funny, and insightful. Just loved it!\" USA Today Bestseller, Amy Andrews\"One of those books you can’t put down and don’t stop thinking about!\" Adriana Anders, Award-winning author of Whiteout“This is one of the sexiest books we’ve read this year while being relatable and beautifully optimistic.” Make Out Already Podcast",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Sports",
    "Sports Romance",
    "Contemporary",
    "M F Romance",
    "Humor"
  ],
  "author": "Eve Dangerfield",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/59428428-begin-again-again"
}