{
  "title": "Saving Abby",
  "description": "For those who believe in true love and love at first sight.When Abby Knight’s promising start as a family physician is cut short by an abusive relationship, she flees a painful past, trading the hustle and bustle of city living for the more sedate pace of country life.Her introduction to Peace Springs begins with a freak May snowstorm, a near collision with a moose, a marauding pack of wolves, a mountain man savior, a trek through the snow and spitting llamas.She’s not sure what to think of her choice to join her uncle’s family practice in Peace Springs. All in all, it’s not a very auspicious beginning.But leaving her old life, and starting over, is exactly what Abby needs. Meeting Drake, her savior, makes her feel something she hasn't felt in years. Peace. But she’s not interested in a new relationship. The only thing she cares about is establishing her medical practice and maybe finding a little bit of peace along the way.Coming off an abusive relationship makes her wary, but there’s no denying the simmering attraction between her and Drake. Only through facing her fears, and living in the moment, will Abby find happiness in the small town of Peace Springs.But when her past catches up to her, Abby’s perfect new life is in jeopardy. Is she strong enough to fight for what she wants and find true love after all?Saving Abby, is a steamy, second chance, contemporary romantic suspense, about love at first sight. It features a protective hero and the smart, feisty heroine who steals his heart.Get your copy today and let the binge-reading begin.(Saving Abby: previously published—in part—as 'Finding Peace, a novella,' the story tripled in size to a full novel with significant additions to the storyline. Appeared in the Desire After Dark Anthology published in Jan 2022.)",
  "genres": [
    "Contemporary",
    "Romance",
    "Military Romance",
    "Romantic Suspense",
    "Amazon"
  ],
  "author": "Ellie Masters",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/59422570-saving-abby"
}