{
  "title": "Payback's a Witch",
  "description": "THE NEW YORK TIMES BESTSELLER!A spellbinding, bewitching rom com . . .'The book I've been waiting for all my life' Emily Henry, author of Beach Read'Like if Casey McQuiston wrote paranormal' GoodreadsEmmy Harlow is a witch in exile. She hasn't been home to the magical town of Thistle Grove in years, which has a lot to do with a complicated family history and a desire to forge her own way in the world, and only the very tiniest bit to do with Gareth Blackmoore, heir to the most powerful magical family in town, casual breaker of hearts and destroyer of dreams.But when a spellcasting tournament approaches, it turns out the pull of tradition (or the truly impressive parental guilt trip that comes with it) is strong enough to bring Emmy back. She's determined to do her familial duty; spend some quality time with her best friend, Linden Thorn; and get back to her real life in Chicago.On her first night home, Emmy runs into Talia Avramov - an all-around badass adept in the darker magical arts - who is fresh off a bad breakup . . . with Gareth Blackmoore. Talia had let herself be charmed, only to discover that Gareth was also seeing Linden - unbeknownst to either of them. And now she and Linden want revenge. Only one question Is Emmy in?But most concerning of Why can't she stop thinking about the terrifyingly competent, devastatingly gorgeous, wickedly charming Talia Avramov?The perfect witchy autumn read to get you in the mood for Halloween . . .'A queer rom com that bewitches from the very first page' Publishers Weekly' John Tucker Must Die but with queer witches' Goodreads'Compulsively fun' Jacqueline Carey, New York Times bestselling author'S exy, charming and completely magical!' Kerry Winfrey'The perfect autumnal witchy romance!' Goodreads'Hilariously funny and glue-you-to-the-page engrossing' Bookpage'I want to go to Thistle Grove' Seanan McGuire, New York Times bestselling author'It's basically John Tucker Must Die meets The Craft, with an extra serving of queer relationships' The Lesbrary'Charming, sweet, and magical, the perfect book to enjoy on a cosy autumn night' The Nerd Daily'The kind of book that you just sort of ache to step inside . . . a perfect fall read' Goodreads' The witchy, sapphic, revenge romcom I've been dreaming of' Goodreads",
  "genres": [
    "Romance",
    "Fantasy",
    "LGBT",
    "Witches",
    "Queer",
    "Lesbian",
    "Fiction"
  ],
  "author": "Lana Harper",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/59422441-payback-s-a-witch"
}