{
  "title": "Rootless",
  "description": "A provocative debut novel about a marriage in crisis that asks the question: Can you ever be rooted in a home that’s on the brink of collapse?“Beautiful, gripping, and tender . . . a powerful and unforgettable meditation on love, belonging, and motherhood.”—Emilia Hart, author of Weyward On a Spring afternoon in London, Sam hops the stairs of his flat two at a time. There’s £1,300 missing from his and his wife, Efe’s, shared bank account and his calls are going straight to voicemail. When he finally reaches someone, he learns Efe is nearly 5,000 miles away as their toddler looks around and asks, “Where’s Mummy?”When Efe and Sam met as teens headed for university, it seemed everyone knew they were meant to be. Efe, newly arrived in the UK from Ghana and sinking under the weight of her parents’ expectations, found comfort in the focused and idealistic Sam. He was stable, working toward a law career, and had an unwavering vision for their future. A vision Efe, now a decade later, finds slightly insufferable. From the outside, they’re the picture-perfect couple everyone imagined, but there are cracks in the frame. When Efe and Sam are faced with an unplanned pregnancy, they find themselves on opposing sides. Fatherhood is everything he has dreamed of, but Efe feels stuck in a nightmare. And when a new revelation emerges, they are forced to confront just how radically different they want their lives to be. Already swallowed by the demands of motherhood and feeling the dreams she had slipping away once again, Efe disappears. Rootless is a heartrending love story about motherhood and sacrifice, providing an intimate look at what happens after a marriage collapses, leading two people to rediscover what they ultimately want—and if it’s still each other. As Efe says, “Love and regret aren’t mutually exclusive.”",
  "genres": [
    "Fiction",
    "Romance",
    "Contemporary",
    "Literary Fiction",
    "Audiobook",
    "Africa",
    "Adult Fiction"
  ],
  "author": "Krystle Zara Appiah",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/59441151-rootless"
}