{
  "title": "Say It Like You Mane It",
  "description": "What happens when a hellraiser turned hot cop is stuck with a headstrong heiress he’s determined to protect...and resist?\nA run-away bride, wearing a freakin’ tiara, and carrying a stolen lion cub, of all things. This was not how rowdy, bad-boy-turned-small-town-cop, Zander Landry expected his day to go.He really didn’t expect his night to end with her sleeping in his bed after her near-kidnapping.But his intense attraction to her and the feelings of protectiveness she stirs up? Oh, yeah, he knew those were coming.She’s stunning, whip-smart, and trouble with a capital T.Which means, he needs her to head right back the way she came. ASAP.His town is exactly the way he wants it . . . crazy and trouble free.Well, the crazy trouble he’s not related to anyway.Stranded in a tiny town in her half-million-dollar wedding gown with no money and no place to go . . . today is going pretty much exactly the way Caroline Holland expected it to.But the grumpy, tattooed, oh-my-god hot cop being the answer to all her problems isn’t at all what she expected.Now that she’s turned all the criminal (and obnoxious) info about her exotic-animal-dealing ex-fiance over to Zander, she can kick back in a hammock with some sweet tea and relax.Or not.Turns out Caroline’s not the spoiled heiress Zander thinks she is. The gorgeous hellion wants in on the action and soon discovers just how dirty things can get in the bayou. And the bedroom.More and more, Zander just wants her safe on the sidelines. But Caroline isn’t going anywhere until justice is done.It’s a clash of wills that’s gonna get hotter than a crawfish boil in July. And the most fun the Landry family has had watching sparks fly since . . . well, the last book.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Small Town Romance",
    "Contemporary",
    "Animals",
    "Audiobook",
    "Fiction"
  ],
  "author": "Erin Nicholas",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/59432169-say-it-like-you-mane-it"
}