{
  "title": "The Daughter of Doctor Moreau",
  "description": "NEW YORK TIMES BESTSELLER • From the bestselling author of Mexican Gothic and Velvet Was the Night comes a lavish historical drama reimagining of The Island of Doctor Moreau set against the backdrop of nineteenth-century Mexico.“This is historical science fiction at its a dreamy reimagining of a classic story with vivid descriptions of lush jungles and feminist themes. Some light romance threads through the heavier ethical questions concerning humanity.”—Library Journal (starred review)“The imagination of Silvia Moreno-Garcia is a thing of wonder, restless and romantic, fearless in the face of genre, embracing the polarities of storytelling—the sleek and the bizarre, wild passions and deep hatreds—with cool equanimity.”—The New York Times (Editors’ Choice)FINALIST FOR THE HUGO AWARD • ONE OF THE BEST BOOKS OF THE The New York Times Book Review, Time, NPR, Polygon, Tordotcom, Paste, CrimeReads, BooklistCarlota A young woman growing up on a distant and luxuriant estate, safe from the conflict and strife of the Yucatán peninsula. The only daughter of a researcher who is either a genius or a madman.Montgomery A melancholic overseer with a tragic past and a propensity for alcohol. An outcast who assists Dr. Moreau with his experiments, which are financed by the Lizaldes, owners of magnificent haciendas and plentiful coffers.The The fruits of the doctor’s labor, destined to blindly obey their creator and remain in the shadows. A motley group of part human, part animal monstrosities.All of them live in a perfectly balanced and static world, which is jolted by the abrupt arrival of Eduardo Lizalde, the charming and careless son of Dr. Moreau’s patron, who will unwittingly begin a dangerous chain reaction.For Moreau keeps secrets, Carlota has questions, and, in the sweltering heat of the jungle, passions may ignite.The Daughter of Doctor Moreau is both a dazzling historical novel and a daring science fiction journey.",
  "genres": [
    "Historical Fiction",
    "Horror",
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Historical",
    "Gothic"
  ],
  "author": "Silvia Moreno-Garcia",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/59445236-the-daughter-of-doctor-moreau"
}