{
  "title": "Beyond Innocence: The Life Sentence of Darryl Hunt",
  "description": "A deeply reported, gripping narrative of injustice, exoneration, and the lifelong impact of incarceration, Beyond Innocence is the poignant saga of one remarkable life that sheds vitally important light on the failures of the American justice system at every levelIn June 1985, a young Black man in Winston-Salem, N.C. named Darryl Hunt was falsely convicted and sentenced to life in prison for the rape and murder of a white copyeditor at the local paper. Many in the community believed him innocent and crusaded for his release even as subsequent trials and appeals reinforced his sentence. Finally, in 2003, the tireless efforts of his attorney combined with an award-winning series of articles by Phoebe Zerwick in the Winston-Salem Journal led to the DNA evidence that exonerated Hunt. Three years later, the acclaimed documentary, The Trials of Darryl Hunt, made him known across the country and brought his story to audiences around the world.But Hunt’s story was far from over. As Zerwick poignantly reveals, it is singularly significant in the annals of the miscarriage of justice and for the legacy Hunt ultimately bequeathed. Part true crime drama, part chronicle of a life cut short by systemic racism, Beyond Innocence powerfully illuminates the sustained catastrophe faced by an innocent person in prison and the civil death nearly everyone who has been incarcerated experiences attempting to restart their lives. Freed after nineteen years behind bars, Darryl Hunt became a national advocate for social justice, and his case inspired lasting reforms, among them a law that allows those on death row to appeal their sentence with evidence of racial bias. He was a beacon of hope for so many—until he could no longer bear the burden of what he had endured and took his own life.Fluidly crafted by a master journalist, Beyond Innocence makes an urgent moral call for an American reckoning with the legacies of racism in the criminal justice system and the human toll of the carceral state.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Race",
    "Crime",
    "True Crime"
  ],
  "author": "Phoebe Zerwick",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/59439395-beyond-innocence"
}