{
  "title": "The Purveli",
  "description": "Ava has always been different. Born with strong telepathic abilities, she lives a very isolated life until she is offered a job with an obscure network that aids powerful Immortal Guardians in their quest to protect humanity from the psychotic vampires who prey upon them. Suddenly, she doesn't feel so different. For the first time in her life, Ava has found a place where she belongs. She's happy. Life is good. And when her employers invite her to join a group of other gifted ones and a handful of Immortal Guardians on a journey to another planet, it becomes absolutely fantastic.In no time at all, she is speeding across the galaxy aboard a Lasaran warship manned by two amazing alien races. It's the dream of a lifetime... until a vicious attack by a mutual enemy of Lasara and Earth lands her alone in an escape pod with no habitable planet in sight and only one ship within range: one that carries the enemy who wants to know why the bioengineered virus they released on Earth long ago didn't exterminate humanity and leave the planet ripe for their claiming.Jak'ri doesn't know how long he has been a prisoner aboard the Cebaun, but he fears the enemy's twisted experiments will soon lead them to a virus that will eradicate the Purveli people. Despair grips him until a female from Earth is taken captive and reaches out to him telepathically. The gift that Ava said caused her such misery in the past soon becomes his salvation as the two of them form a fast friendship. Determined to distract each other from the horrors of their existence, they immerse themselves in telepathic communion during the day, then seek solace and adventure together in shared dreams. As their friendship deepens into love, the two hatch a daring plot to escape their captors. But the enemy will not let them go without a fight.Can Ava and Jak'ri stand against so many and emerge victorious?",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Paranormal",
    "Science Fiction Romance",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Dianne Duvall",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/59433182-the-purveli"
}