{
  "title": "The Lost Summers of Newport",
  "description": "From the New York Times bestselling team of Beatriz Williams, Lauren Willig, and Karen White--a novel of money and secrets set among the famous summer mansions of Newport, Rhode Island, spanning over a century from the Gilded Age to the present day.2019: Andie Figuero has just landed her dream job as a producer of Mansion Makeover, a popular reality show about restoring America's most lavish historic houses. Andie has high hopes for her latest project: the once glorious but gently crumbling Sprague Hall in Newport, Rhode Island, summer resort of America's gilded class--famous for the lavish \"summer cottages\" of Vanderbilts and Belmonts. But Andie runs into trouble: the reclusive heiress who still lives in the mansion, Lucia \"Lucky\" Sprague, will only allow the show to go forward on two conditions: One, nobody speaks to her. Two, nobody touches the mansion's ruined boathouse.1899: Ellen Daniels has been hired to give singing lessons to Miss Maybelle Sprague, a naive young Colorado mining heiress whose stepbrother John has poured their new money into buying a place among Newport's elite. John is determined to see Maybelle married off to a fortune-hunting Italian prince, and Ellen is supposed to polish up the girl for her launch into society. But the deceptively demure Ellen has her own checkered past, and she's hiding in plain sight at Sprague Hall.1958: Lucia \"Lucky\" Sprague has always felt like an outsider at Sprague Hall. When she and her grandmother--the American-born Princess di Conti--fled Mussolini's Italy, it seemed natural to go back to the imposing Newport house Nana owned but hadn't seen since her marriage in 1899. Over the years, Lucky's lost her Italian accent and found a place for herself among the yachting set by marrying Stuyvesant Sprague, the alcoholic scion of her Sprague stepfamily. But one fateful night in the mansion's old boathouse will uncover a devastating truth...and change everything she thought she knew about her past.As the cameras roll on Mansion Makeover, the house begins to yield up the dark secrets the Spragues thought would stay hidden forever....",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Audiobook",
    "Mystery",
    "Historical",
    "Romance",
    "Book Club"
  ],
  "author": "Beatriz Williams",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/59445992-the-lost-summers-of-newport"
}