{
  "title": "The Nurse's Secret",
  "description": "The unflinching, spellbinding new book from the acclaimed author of The Second Life of Mirielle West. Based on the little-known story of America’s first nursing school, a young female grifter in 1880s New York evades the police by conning her way into Bellevue Hospital’s training school for nurses, while a spate of murders continues to follow her as she tries to leave the gritty streets of the city behind… Based on Florence Nightingale’s nursing principles, Bellevue is the first school of its kind in the country. Where once nurses were assumed to be ignorant and unskilled, Bellevue prizes discipline, intellect, and moral character, and only young women of good breeding need apply. At first, Una balks at her prim classmates and the doctors’ endless commands. Yet life on the streets has prepared her for the horrors of injury and disease found on the wards, and she slowly gains friendship and self-respect.  Just as she finds her footing, Una’s suspicions about a patient’s death put her at risk of exposure, and will force her to choose between her instinct for self-preservation, and exposing her identity in order to save others. Amanda Skenandore brings her medical expertise to a page-turning story that explores the evolution of modern nursing—including the grisly realities of nineteenth-century medicine—as seen through the eyes of an intriguing and dynamic heroine.Just as she finds her footing, Una's suspicions about a patient's death put her at risk of exposure, and will force her to choose between her instinct for self-preservation, and exposing her identity in order to save others.Amanda Skenandore brings her medical expertise to a page-turning story that explores the evolution of modern nursing--including the grisly realities of nineteenth-century medicine--as seen through the eyes of an intriguing and dynamic heroine.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Book Club",
    "Historical",
    "Audiobook",
    "Suspense"
  ],
  "author": "Amanda Skenandore",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/59438276-the-nurse-s-secret"
}