{
  "title": "Actively Unwoke: The Ultimate Guide for Fighting Back Against the Woke Insanity in Your Life",
  "description": "The woke have taken over every major institution in this country—the schools and universities, corporate America, the media, and the government. It’s time to fight back. Actively Unwoke will show you how.For the last several years, we’ve watched as woke political activists have staged destructive protests, destroyed businesses, hurled accusations of racism and white supremacy around as if those terms mean nothing, and publicly bullied and canceled anyone who disagrees with them.These authoritarians claim to represent social justice, but they are about one power. Their goal is nothing short of cultural revolution. So what do we do about it?Actively Unwoke explains what’s going on and decodes the language the woke are using so that you can understand what we’re up against.To inspire you and explore actionable strategies you can take, Karlyn Borysenko looks at ways real people have fought back in the real world. This includes fighting back in the schools, knowing how to act when the woke come to work, taking a stand with your elected leaders, and even a few subversive strategies just for fun.This book also reveals how to survive cancelation (yes, it’s possible) and how to take care of yourself as you join a ragtag group of misfits to do battle with the greatest existential threat of our time.If you ever wondered what you would have done during the Civil Rights movement or in 1930s Germany, the answer to that question lies in what you are doing now. This fight isn’t about left or right, Democrat or Republican. It’s not about liberal values or conservative values.It’s about protecting American values.This book will give you everything you need to join the unwoke army. It’s not enough to just be unwoke anymore—it’s time to be actively unwoke.",
  "genres": [
    "Audiobook",
    "Politics"
  ],
  "author": "Karlyn Borysenko",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/59441833-actively-unwoke"
}