{
  "title": "Moonlight and the Pearler’s Daughter",
  "description": "For readers of The Light Between Oceans and The Island of Sea Women, a feminist adventure story set against the backdrop of the dangerous pearl diving industry in 19th-century Western Australia, about a young English woman who sets off to uncover the truth about the disappearance of her eccentric father.Western Australia, 1886. After months at sea, a slow boat makes its passage from London to the shores of Bannin Bay. From the deck, young Eliza Brightwell and her family eye their strange, new home. Here is an unforgiving land where fortune sits patiently at the bottom of the ocean, waiting to be claimed by those brave enough to venture into its depths. An ocean where pearl shells bloom to the size of soup plates, where men are coaxed into unthinkable places and unspeakable acts by the promise of unimaginable riches.Ten years later, the pearl-diving boat captained by Eliza’s eccentric father returns after months at sea—without Eliza’s father on it. Whispers from townsfolk point to mutiny or murder. Headstrong Eliza knows it’s up to her to discover who, or what, is really responsible.As she searches for the truth, Eliza discovers that beneath the glamorous veneer of the pearling industry, lies a dark underbelly of sweltering, stinking decay. The sun-scorched streets of Bannin Bay, a place she once thought she knew so well, are teeming with corruption, prejudice, and blackmail. Just how far is Eliza willing to push herself in order to solve the mystery of her missing father? And what family secrets will come to haunt her along the way?A transporting feminist adventure story based on Lizzie Pook’s deep research into the pearling industry and the era of British colonial rule in Australia, Moonlight and the Pearler’s Daughter is ultimately about the lengths one woman will travel to save her family.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Mystery",
    "Australia",
    "Fantasy",
    "Adult"
  ],
  "author": "Lizzie Pook",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/59436274-moonlight-and-the-pearler-s-daughter"
}