{
  "title": "Nothing but the Truth",
  "description": "In this sparkling, page-turning debut, Lucy Green learns that when you make a wish, you can’t always get what you want…but you might just get what you need.It’s the eve of Hollywood publicist Lucy Green’s thirtieth birthday, a day she hopes will bring the promotion she deserves and a proposal from her boyfriend. But he stands her up for a date, not for the first time, leaving Lucy alone at the bar—or at least, alone with the handsome bartender on the other side of the counter—so she makes a rueful wish over her cocktail for a perfect birthday. But when Lucy’s wish is granted in the most unexpected way, things go terribly awry, as things often do when wishes come true…. When Lucy wakes up on her big day, she can’t seem to force herself to go through her rigorous fitness and beauty routines—things she usually tells herself she likes. She has no desire to eat only a spoonful of yogurt for breakfast and she simply can’t bear to put on the uncomfortable shapewear needed for the power outfit she had planned for work.  When Lucy arrives at the office, she realizes that not only can she no longer lie to herself, she can’t lie to anyone else, either. Not her clients, not her boyfriend, not her creep of a boss. Now that she can’t hide how she feels, Lucy must confront all the injustices—small and large—she’s faced on a daily basis at work, in her relationship, and in every other aspect of her life...and the truth is going to come out in a big way. This sharp, bighearted, and magical novel tackles all the lies women are encouraged to tell just to get by in today’s world—in life, in love, and in the workplace—and the liberation that can come from telling nothing but the truth.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Chick Lit",
    "Audiobook",
    "Adult",
    "Contemporary Romance"
  ],
  "author": "Holly   James",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/59447597-nothing-but-the-truth"
}