{
  "title": "Headcase",
  "description": "Asa Mulvaney is half of a psychopathic whole. He and his twin brother live together, party together…kill together. In the Mulvaney family, murder is the family business and business is good. When an experiment separates Asa and his brother, Asa is forced to navigate the world on his own for the first time in his life.Zane Scott is a small-time crime blogger and amateur sleuth, but he dreams of a byline in a major paper someday. When he winds up at a boring fundraiser beside Asa Mulvaney, they share an intensely passionate encounter that leaves Zane with an ache in his chest and a story idea that could make his career dreams a reality.At a nearby college, a cluster of suicides isn’t what it seems. When Asa’s father asks him to look into it, he sees the perfect opportunity to see his little crime reporter again. And Asa needs to see him again. Zane’s suspicious of Asa’s motives, but he won’t say no to a chance to peek behind the Mulvaney family curtains. As the two unravel a sinister plot, Asa’s obsession with Zane grows and Zane finds being Asa’s sole focus outweighs almost anything, maybe even his career--which is good for Asa because loving a Mulvaney is a full-time job. Can he convince Zane that he’s worth navigating a family of psychopaths and his pathologically jealous twin, or will Zane learn the hard way that the Mulvaney boys always get what they want? Always. Headcase is a high heat, intense, lovers-to-frenemies, psychopath romance with an HEA and no cliffhangers. It features an obsessive, calculating psychopath and a wannabe reporter who will stop at nothing to earn himself a major byline. As always, there’s gratuitous violence, very dark humor, enough killers to fill an auditorium, and enough heat to melt your kindle. This is book 4 in the Necessary Evils series. Each book follows a different couple. TAGS: psychopath romance, Asa is bored, Avi is jealous, Zane is pretty, Adam is still a dick, August is... August, Aiden’s still missing, Lucas is concerned, Atticus plays den mother to a gaggle of murderous young adults, Asa wants Zane but knows he suspects he's a killer, Zane wants a story but can't keep from falling into bed with his target, extra dark humor, found family, So. Many. Murderers, mysteries abound, bad boys doing bad things and each other, high non-relationship angst, low relationship angst, shmoop, fluff, smut.",
  "genres": [
    "M M Romance",
    "Romance",
    "Dark Romance",
    "Dark",
    "Contemporary",
    "LGBT",
    "BDSM"
  ],
  "author": "Onley James",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/59442558-headcase"
}