{
  "title": "Revenge of the Rose",
  "description": "Welcome to a world of intrigue of the most intriguing kind, where emperors and popes desperately vie for power, even as their subjects and servants engage in behind-the-scenes machinations of their own. \"The Holy Roman Empire circa 1200 A.D.\"Impoverished young knight Willem of Dole believed he would spend his life in rural Burgundy, struggling to provide for his widowed mother and younger sister, Lienor. And so it's with surprise--and apprehension--that he obeys a summons to the magnificent court of Konrad, Holy Roman Emperor, whose realm spans half of Europe. Willem's mischievous friend Jouglet, Konrad's favorite minstrel, is no doubt behind it somehow . . . but what's in it for Jouglet?Court life is overwhelming to the idealistic young Willem, who is shocked by the behavior of his fellow knights, for whom chivalry is a mere game. Yet under Jouglet's witty, relentless tutelage, the naive knight quickly rises in Emperor Konrad's esteem--until suddenly his sister, Lienor, becomes a prospect for the role of Empress. This unexpected elevation of the sibling \"nobodies\" delights Jouglet, but threatens three powerful--and dangerous--men at the court: the Emperor's brother, Cardinal Paul, who has in mind a different bride for Konrad; the Emperor's uncle, Alphonse, Count of Burgundy, who would keep secret certain things that only Willem can reveal; and most especially the Emperor's own steward Marcus, who is hopelessly in love with Konrad's cousin Imogen. For if Willem's star keeps rising, Imogen will be betrothed to the knight by royal decree--and Willem's star will surely continue to rise, unless Marcus figures out a way to stop it. But that would entail outscheming cleverJouglet, ablest of schemers.Gossip, secrets, and lies are the fuel of daily life in Konrad's court. As Konrad edges closer to proclaiming Lienor his bride, those around Willem play a perilous game of cat-and-mouse as they attempt to secure their own fortunes, knowing that even the slightest move can shift the playing field entirely. And through it all, Jouglet remains Willem's most maddening yet staunchest ally. But what, really, does Jouglet stand to gain . . . or lose?Transporting the reader to the brilliant, conniving heart of the largest empire of medieval Europe, \"Revenge of the Rose\" is a novel rich in irony and tongue-in-cheek wit, and reveals all the grit and color, politics and passion, of court life in the Holy Roman Empire.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Medieval",
    "France",
    "13th Century",
    "Novels"
  ],
  "author": "Nicole Galland",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/594583.Revenge_of_the_Rose"
}