{
  "title": "The Widow of Windsor",
  "description": "Albert was dead and the Queen, stricken with grief, prepared to spend the rest of her life mourning. Her Government and her family sought to bring her out of seclusion but she was determined to remain the Widow of Windsor.The years which followed were some of the most momentous in British history, some of the Queen's ministers the most famous. There was the great Palmerston who managed to keep a mocking ascendancy over her; Mr. Gladstone, Grand Old Man and People's William, who prowled the streets at night in an attempt to lead prostitutes back to a life of respectability, and who was no favorite of the Queen, unlike the witty Disraeli, who charmed her completely.She was surrounded by the colorful members of her family - sons, daughters, their wives and husbands, her grandchildren. There was the censorious Vicky, Crown Princess of Prussia and Empress-to-be who suffered great domestic tragedy; Louise who married outside royalty; Lenchen and baby Beatrice; there was Alfred whose amorous adventures caused his mother such concern and Leopold whose ill health was an even greater anxiety; there was Arthur who had inherited his father's goodness; and above all there was Bertie, Prince of Wales and heir to the throne. Suppressed in his father's lifetime he was determined to pursue pleasure for the rest of his life and his passions were racing and fascinating women. His adventures twice brought him into the witness box to give evidence in famous trials which created the scandals of the decade, and brought sorrow and humiliation to Alexandra, whose happy childhood in the Yellow Palace had ill prepared her for life with the gay and charming philanderer whom she discovered her husband to be.But Queen Victoria at Windsor, Balmoral, Osborne or Buckingham Palace cannot fail to dominate the scene. Her relationship with John Brown, the rough Highlander, gave rise to speculation, but she was impervious to scandal. All the fascinating characters of an unforgettable age rotate about her like planets round the sun; and she remained the great Queen until the moment of her death and the passing of an era.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Victorian",
    "British Literature",
    "19th Century",
    "Historical Romance"
  ],
  "author": "Jean Plaidy",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/59461.The_Widow_of_Windsor"
}