{
  "title": "Breaking Boundaries",
  "description": "Matt:I’ve never had a complicated love life. I’ve always known what I want. I want Lyric Sharpe. Enter Captain DJ Rens and one drunken night that I can’t forget. Not for lack of trying. And just to complicate my life more, I had to go and add Mariah Carter to the mix. But I don’t really have a chance to sort my feelings out before all of us are put into serious danger.Lyric:I’d resigned myself long ago to the single life. I’m far too sassy, and too much of a brat for men, apparently. I guess being a cop who knows what she likes is wrong. So when I meet Matt, my direct commanding officer, I’m thrown totally off my game when he shows interest. The problem? I have a serious thing for my roommate, Mariah, and my Captain, DJ. Feelings I don’t get to explore before we all start receiving threats to our lives.DJ:The idea of being a Captain who sits behind his desk has never been appealing to me. When I got my promotion, I did it with the stipulation that I was still allowed to patrol the streets of Gainesville like I loved. But when Mariah enters my life, I regret everything about that decision. I wish I’d never met her because now she’s all I want. Everything I can’t have. To complicate my life more, I fall for Lieutenant Matt Chance and Lyric, another patrol officer. When all of our lives are on the line, I must figure out a way to protect those I love.Mariah:I fell hard for DJ when I first met him. I didn’t know my partner was my Captain, though, and the blow was heartbreaking, knowing he’d never be mine. It’s totally forbidden to date my boss. The feelings never go away, though. Even after a drunk night of mindblowing passion with Lyric, my roommate. When we all start being threatened by a large gang, Matt comes to the rescue like an Avenger. But sorting out my heart will have to wait. The focus is our lives because we might not make it out of this one breathing.",
  "genres": [],
  "author": "Melony Ann",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/59464853-breaking-boundaries"
}