{
  "title": "The Siege",
  "description": "Stephen White, author of over a dozen New York Times bestsellers, returns with a relentlessly propelled thriller that will remind readers of his acclaimed Kill Me. Stephen White's, Alan Gregory novels are beloved by both fans and critics, the most recent, Dead Time, was a USA Today and Book-Sense bestseller. In The Siege, Gregory's longtime friend Sam Purdy takes center stage in a story that feels ripped from tomorrow's headlines. From the first page on, readers need to be buckled in for a nonstop ride full of terror and pathos. As a lovely weekend approaches on the Yale campus it appears that a number of students, including the sons of both the Secretary of the Army and newest Supreme Court justice, may have gone missing. Kidnapping? Terrorism? The authorities aren't sure. But the high-profile disappearances draw the attention of the CIA and the FBI's vaunted Hostage Rescue Team. Attention quickly focuses on the fortress-like tomb of one of Yale's secret societies. Suspended Boulder police detective, Sam Purdy, soon finds himself in New Haven, where he is quickly snared by an unlikely pair of Feds: FBI agent Christopher Poe and CIA analyst Deirdre Drake. Sam, Poe, and Dee join together, desperately trying to solve the riddle of what is going on inside the windowless stone tomb on the edge of campus. The clock is pounding in their ears. The unknown enemy is playing by no known rules . . . is making no demands . . . is refusing to communicate with the hostage negotiator . . . is somehow anticipating every FBI move . . . is completely unconcerned about getting away . . . And . . . is sending students, one by one, out of the building's front door to die.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Mystery Thriller",
    "Audiobook",
    "Psychological Thriller"
  ],
  "author": "Stephen White",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/5945506-the-siege"
}