{
  "title": "Son of Neverland",
  "description": "NEVERLAND. EVOLVED. One hundred years have passed since Peter defeated Captain Hook and was crowned the Savior of Neverland. Under his reign, Neverland has entered an age of peace, and life for all is abundant and joyful. Tinker Bell has become a famous inventor for discovering how to make fairies human size, a few of the lost boys have become neverwood film stars, and Peter and Tiger Lily are engaged to be married on one of their private islands. It is truly an eternal paradise.But all that is about to change when Tiger Lily’s father sees a vision from the void… something dark has been watching Neverland for all these centuries… something ancient and timeless… gathering its strength on the fringes of space and time… waiting for the opportunity to return to Neverland once again…Join Peter, Tinker Bell, Tiger Lily, and the lost boys as they embark on an epic journey to save Neverland from a terrible fate. Friendships will be tested as together they face forces beyond anything they could have ever previously imagined, including goblins, pirates, demonic crocodiles, evil spirits, a temperamental enchantress, and the greatest enemy eternity has ever faced — Time itself.In the darkest night of the soul, Peter will discover that the greatest light of all, is the love he has for his friends.CHARITABLE FUNDTrue to the spirit of J.M. Barrie’s legacy, his pure love of the imagination, and his unyielding support of children’s charities, 10% of the net proceeds from this book will go directly towards supporting children’s hospitals, charities, organizations, institutions, and causes worldwide that are designed to keep children safe, healthy, creative, imaginative, and ultimately make their lives better. By purchasing this book, you are literally helping to make the world a better place.",
  "genres": [],
  "author": "Cal R. Barnes",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/59469333-son-of-neverland"
}