{
  "title": "A Duke, the Spy, an Artist, and a Lie",
  "description": "Critically acclaimed author Vanessa Riley infuses the ballroom settings of Regency England with Jamaican flair her Rogues & Remarkable Women series featuring a secret society of widows battling society to regain their money and a chance at love everlasting. In this sweeping, swoon-worthy final installment, an English spy must follow his neglected wife through the streets of London as she investigates her sister’s death with the aid of the Widow’s Grace. Can they find common ground and learn to work together? This vibrant and inclusive historical romance is perfect for Bridgerton binge-watcher!Founded by the ton 's most ingenious countess, the secret society The Widow’s Grace comes to the aid of ill-treated widows and wives and helps them regain their fortunes, their families, and sometimes discover true love…For adventurous Jamaican heiress Cecilia Thomas, marrying charming military lieutenant Lord Gantry to save him from danger—and herself from mercenary suitors—was a painful mistake. Instead of a passionate life together, she's stranded at his chilly Mayfair mansion with his unaccepting family. Worse, she finds he is actually a spy dedicated to duty over wedlock—and secrets over trust. So when she hears her sister has been driven to her death, Cecilia is determined to expose the powerful man responsible. Assisted by The Widow's Grace, she flees to Covent Garden with a new identity. But can she elude her formidable husband—even as the desire between them continues to flare even hotter?Always calm, forever controlled, Gantry has put everything aside to hunt down the traitor who nearly killed him. It’s only when Cecilia leaves that he realizes his real duty should have been to her. As she continually outwits him through London's most perilous streets, Gantry realizes his wife is a resourceful, courageous woman he longs to truly know. But when her pursuit threatens influential enemies, will his and Cecilia's only chance to gain justice separate them once and for all?",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical Fiction",
    "Historical",
    "Audiobook",
    "Fiction",
    "Regency"
  ],
  "author": "Vanessa Riley",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/59469218-a-duke-the-spy-an-artist-and-a-lie"
}