{
  "title": "Beautiful Little Fools",
  "description": "USA Today bestselling author Jillian Cantor reimagines and expands on the literary classic The Great Gatsby in this atmospheric historical novel with echoes of Big Little Lies, told in three women’s alternating voices.On a sultry August day in 1922, Jay Gatsby is shot dead in his West Egg swimming pool. To the police, it appears to be an open-and-shut case of murder/suicide when the body of George Wilson, a local mechanic, is found in the woods nearby.Then a diamond hairpin is discovered in the bushes by the pool, and three women fall under suspicion. Each holds a key that can unlock the truth to the mysterious life and death of this enigmatic millionaire. Daisy Buchanan once thought she might marry Gatsby—before her family was torn apart by an unspeakable tragedy that sent her into the arms of the philandering Tom Buchanan.Jordan Baker, Daisy’s best friend, guards a secret that derailed her promising golf career and threatens to ruin her friendship with Daisy as well.Catherine McCoy, a suffragette, fights for women’s freedom and independence, and especially for her sister, Myrtle Wilson, who’s trapped in a terrible marriage.Their stories unfold in the years leading up to that fateful summer of 1922, when all three of their lives are on the brink of unraveling. Each woman is pulled deeper into Jay Gatsby’s romantic obsession, with devastating consequences for all of them.Jillian Cantor revisits the glittering Jazz Age world of F. Scott Fitzgerald’s The Great Gatsby, retelling this timeless American classic from the women’s perspective. Beautiful Little Fools is a quintessential tale of money and power, marriage and friendship, love and desire, and ultimately the murder of a man tormented by the past and driven by a destructive longing that can never be fulfilled.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Historical",
    "Retellings",
    "Book Club",
    "Audiobook"
  ],
  "author": "Jillian Cantor",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/59477802-beautiful-little-fools"
}