{
  "title": "The Fitzgeralds of Dublin: Books 4-6",
  "description": "This Kindle box set contains the novels A Forlorn Hope, A Cruel Mischief and A Hidden Motive.A Forlorn Hope: The Fitzgeralds of Dublin Book 4Dublin, Ireland, September 1883. The rift between the Fitzgeralds deepens when Will’s father threatens legal action to gain visiting rights to his three grandchildren. But Will, Isobel and John are brought unexpectedly together by Will’s mother when Sarah’s increasingly erratic behaviour spirals beyond their control.Isobel is reunited with a ghost from her past unearthing memories she would rather have kept buried while the fragile marriage of convenience orchestrated by John becomes more and more brittle before it snaps with horrifying consequences.Please note that this novel contains sensitive content and is intended for readers aged eighteen and over.A Cruel Mischief: The Fitzgeralds of Dublin Book 5Dublin, Ireland, October 1885. The fragile peace within the Fitzgerald family is threatened when Dr Jacob Smythe becomes one of Will’s patients, angering his mother. But in attending to the elderly gentleman’s needs, Will inadvertently reunites Sarah with an old adversary and Isobel discovers she and Dr Smythe have an unexpected and tragic connection.When Alfie receives a card on his twenty-ninth birthday, the recognisable handwriting and cryptic message shatters his hard-won personal contentment. Has a figure hoped long gone from his life returned to Dublin to wreak a cruel mischief on all those who banished him? Is Alfie’s ambition of becoming a doctor about to be derailed when he has less than a year left at Trinity College?A Hidden Motive: The Fitzgeralds of Dublin Book 6Dublin, Ireland, September 1886. Will is reacquainted with his former fiancée when his father’s close friend Dr Ken Wilson dies suddenly. On finding they have received the only invitation to the Wilson residence after the funeral, the Fitzgeralds witness the tensions between Cecilia, her mother and her in-laws and discover her hidden motive for wanting them present.When Isobel is reunited with an old friend from Ballybeg, his shame at what he has done to survive hampers her attempts to bring him and Alfie together again. With an empty life and low expectations, can Peter regain his self-respect or are he and Alfie destined to be alone?Please note that this novel contains medical terminology of the time.",
  "genres": [
    "Ireland",
    "Historical Fiction",
    "Victorian"
  ],
  "author": "Lorna Peel",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/59479749-the-fitzgeralds-of-dublin"
}