{
  "title": "Sapphic Soulmates Trilogy",
  "description": "Three sizzling stories of immortal Greek goddesses and the women they love today.Soulmates, magic, and loyalty.HESTIASuppose you were seduced by an immortal Goddess today.And discover she has devoted herself faithfully to you for centuries, but you don’t remember past life details. What would you do?Eighteen-year-old Lauren has survived school in her small town, just about. She’s never had a girlfriend, and she doesn’t have a life plan. She does have the devotion of an immortal Goddess.Hestia might well be the first of the Olympian gods, but her job has been to keep the home fires burning, which means she doesn’t get out much. She doesn’t mind staying in, but it wasn’t the same when her soulmate went missing for hundreds of years.When they reunite, their passion and desire are enough to light more fires.CORBYIn her dreams, Corby has no inhibitions. When she meets the woman of her dreams, she has the confidence to do all those things and more.Corby is not afraid of taking risks, but to give up everything for a new life in a strange land all for the love of a woman may be a step too far.Blessed by the ancient gods of Olympus, Vick is the raven princess.Her people, the Corax, have a long history and many traditions. They also have huge black wings for when they need to fly.Vick didn’t expect to find love through a chance encounter, but she can’t argue with the pull toward her soulmate.AEGLEA sizzling enemies to lovers lesbian romance.Jade is a flirt. She can’t help it. She doesn’t even realize she’s doing it most of the time. Eventually, she’d like to find her soulmate, but right now she’s young and still in college.Cocky and sure of herself. Angie is hot, sexy, rich, and ten years older. She’s an arrogant landowner who won’t listen to reason or crazy arguments about protecting the forest.Development around the small town of Beaumont threatens the woods with destruction. Jade knows the danger in the forest. It’s all too easy for someone to slip through to another dimension and disappear from our world completely.When Jade tries to bargain with Angie, things go very wrong.Both women find out more about ancient Olympia than they bargained forAegle is a Sizzling HOT steamy erotic F/F lesfic fantasy with a happy ending and no cheating and no cliffhanger.It is book three in the Sapphic Soulmates series featuring powerful women and the ladies who love them.Aegle can be read as a standalone but will make more sense if read after the other two books as there is a continuing story.The three stories were first published as separate volumes in 2018.",
  "genres": [
    "Fantasy",
    "Lesbian",
    "Romance",
    "LGBT",
    "Erotica"
  ],
  "author": "Helen Jayne",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/59476945-sapphic-soulmates-trilogy"
}