{
  "title": "Quiet Houses",
  "description": "THE HOUSES ARE QUIET. IT IS THEIR RESIDENTS WHO ARE SCREAMING... \"No-one could be that unhappy and be alive...\" A chambermaid's seemingly innocent request is granted, an act of kindness that has dire consequences for the guest at THE ELMS, MORECAMBE. Human despair has a power of its own after death, and it is contagious... \"I wish I had been right; I wish that it had been a man, or death alone, that had found her...\" An unearthly light in an abandoned bungalow resolves the mystery of a missing child, but no human force has taken her. An entity that fishes for children is in THE MERRY HOUSE, SCALE HALL. But will it remain there? \"Go beyond the graves, and they will come to you.\" An invitation to a clifftop graveyard leads to a harrowing chase by burrowing things that remain unseen, their hunger unknown and never satisfied, BEYOND ST PATRICK'S CHAPEL. \"The great delight in being part of the Save Our Shit crew was that sometimes they could persuade those designers of the present and the future to save or incorporate the past into their designs.\" There is no need in THE OCEAN GRAND, NW COAST, because the original artists created a living work of art for the hotel. Art that celebrates the triumph of the natural world over the man-made. A life force that transcends - and brings death... \"Something white came out. Something white, screaming and screaming...\" Homes fit for heroes, they were promised after the Great War. They were given something else in THE TEMPLE OF RELIEF AND EASE. There is a hidden agenda to paranormal researcher Richard Nakata's investigations into these houses. A commission that witnesses cattle lowing in the cowsheds of STACK'S FARM long after they've been slaughtered, and a reckoning in the showhouse of 24 GLASSHOUSE, as he and his colleagues pay the price for creating their own ghost... Simon Kurt Unsworth reinvents the classic English ghost story with a portmanteau collection that takes the haunted house genre and makes it scream...quietly. Because the most terrifying screams are the silent ones. \"A major new talent in the horror genre.\" - Pete Tennant",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Ghosts",
    "Paranormal",
    "Ghost Stories",
    "Contemporary"
  ],
  "author": "Simon Kurt Unsworth",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/12824411-quiet-houses"
}