{
  "title": "Pretend You Want Me",
  "description": "She fixes problems.There is no problem that Aspen Gray can’t handle. No case that is too hard. No challenge too great. She’s a rising star criminal defense attorney, and she intends to have the world at her feet…until a ghost from her past comes back to wreck her carefully designed plans. A ghost who should have been in the ground. And when a dead man comes stalking you, what’s a woman to do?Let things get Wilde.As soon as she sets foot in the elite protection and security firm known as Wilde, Aspen knows that she must tread carefully. Her life is on the line, and everything that she has worked so hard to achieve can be destroyed…unless one very talented and dangerous Wilde agent can help her out. She needs a man with exceedingly deadly skills—and she needs him now.He can practically see the secrets dripping from her…It should have been a standard undercover operation. Gideon Ranier knew the drill. He was supposed to play the role of his new client’s boyfriend so that he could slip into her world, keep her safe, and unmask the jerk screwing around with her. Standard work. No big deal. Former Delta Force, he could do that type of job in his sleep. Except…he doesn’t count on actually falling for his client. But he does. Hard, fast, and deep, and soon…there is nothing that he won’t do for her.It’s personal.Lines are crossed. Desire grows too strong. Their need won’t be denied. But the attacks on Aspen are mounting. As an obsessed killer plays a deadly game, Gideon will have no choice but to fight harder and dirtier than he’s ever fought in his life in order to protect Aspen from a stalker hellbent on vengeance.Author’s Note: He’s dangerous. She’s devious. They shouldn’t want each other so badly, but they do. Close proximity, a deadly threat…adrenaline is pumping and the desire between Aspen and Gideon will not be controlled. He’ll walk through hell to keep her safe…and, yes, he’s pretty much gonna have to do just that. Sexy times, dangerous deeds, and a happy ending are guaranteed in this stand-alone read. Be on the lookout for secrets, because there sure are plenty of those coming your way!",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Contemporary",
    "Suspense",
    "Mystery",
    "Contemporary Romance",
    "Military Fiction"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/59483761-pretend-you-want-me"
}