{
  "title": "The Bookworm's Guide Boxset",
  "description": "Dating - it's a little out of their depth for these bookworms...The Bookworm's Guide to Dating:What I wanted for my birthday: Books.What I got for my birthday: my brother’s best friend playing matchmaker.Let it be known that I, Kinsley Lane, am one hundred percent against being set up with somebody.And I’m one thousand percent sure that Josh Carter is not the man to find me a boyfriend.I mean, if I’m so great, why isn’t he the one dating me? (For the record, I don’t know the answer. That’s just what the guy on the internet asked.)Still, I’ll humor him. If I go on his little dates, he’ll teach my bookish, introverted self how not to be totally, completely, utterly, unforgivably awkward on every single one of them.And all I have to do is fall in love with one of the lovely gentlemen he’s serving up for me on a silver platter—all of whom fit my very specific guidelines.Simple, right?It would be.If only I could stop falling for Josh.The Bookworm's Guide to Faking It:What I expected on Saturday morning: Books.What I got on Saturday morning: my ex-best friend and first crush in front of me.Let it be known that I, Holley Stuart, do not give a single rat's behind about pro baseball's star pitcher Sebastian Stone.I definitely don't care that he's standing in my bookstore.Nor do I care that he seems to have forgotten about the last time we saw each other--senior prom, when he both humiliated me and broke my heart, albeit unknowingly.Now, he needs a date to his sister's wedding.Don't ask me how I ended up being it, because I have no idea. But that's the least of my problems.His grandfather is adamant we're dating, and Seb isn't in a hurry to convince him otherwise, so I have no choice but to go along with it.The problem? The only thing I've ever faked is... well, you know.I've definitely never faked my feelings for someone.And judging by the way I feel whenever Seb looks at me, it doesn't look like I'm starting now...The Bookworm's Guide to Flirting:What I thought I’d get on Valentine’s Day: a card.What I got on Valentine’s Day: a blind date with my brand new roommate.Let it be known that I, Saylor Green, am wholeheartedly against blind dating. I think it’s superficial, unnecessary, and designed wholly to force people into relationships they aren’t ready for.It’s me. I’m people.So when Dylan Parker takes the seat across from me, I’m ready to dismiss him at one glance.The problem? He’s hot and funny and sweet and the exact kind of guy I read about in the romance novels I sell like hotcakes in my bookstore.He’s also my new roommate.Who likes to walk around in his sweatpants and peer over my shoulder and comment on all my online dating escapades.When he offers to help me flirt my way to dating success, I’m all for it.But what am I supposed to do when the only person I want to flirt with is... Dylan?",
  "genres": [
    "Contemporary"
  ],
  "author": "Emma Hart",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/59491979-the-bookworm-s-guide-boxset"
}