{
  "title": "The Kingdom of This World",
  "description": "\"The Kingdom of This World packs literary dynamite. There can be no disputing the fact [that] Carpentier is equipped with an elegant perception and a distinctive style.\"—San Francisco Chronicle\"Magical realism ... lives and thrives in past and present Haiti, just as it does in this novel. It is in the extraordinary and the mundane, the beautiful and the repulsive, the spoken and the unspoken. It is in the enslaved African princes who knew the paths of the clouds and the language of the forests of their homelands but could no longer recognize themselves in the so-called New World. It is in Damballah, the snake god; in Ogoun, the god of war. It is in the elaborate cornmeal drawings sketched in the soil at Vodou ceremonies to seek help from these loas or spirits. From Haiti's fertile communal imagination sprang a fantastic sense of possibility, which certainly contributed to bondmen and -women defeating the most powerful armies of the time.\"—from the introduction by Edwidge DanticatA few years after its liberation from the brutality of French colonial rule in 1803, Haiti endured a period of even greater brutality under the reign of King Henri Christophe, who was born a slave in Grenada but rose to become the first black king in the Western Hemisphere. His rule is observed through the eyes of the elderly slave Ti Noël, who endures abuse from masters both white and black and who looks, with his charismatic fellow slave Macandal, for a release from the endless cycle of suffering through the practice of animal magic. In prose of often dreamlike coloration and intensity, Alejo Carpentier records the destruction of the black regime—built on the same corruption and contempt for human life that brought down French rule while embodying its same hollow grandeur of false elegance attained only through slave labor—in an orgy of voodoo, race hatred, madness, and erotomania.",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Historical Fiction",
    "Classics",
    "Spanish Literature",
    "Latin American",
    "Literature"
  ],
  "author": "Alejo Carpentier",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/59496.The_Kingdom_of_This_World"
}