{
  "title": "Unholy Terrors",
  "description": "Seriously? You’re back again? It’s clear you don’t value your own life.Look, last time, I threatened to kill you. That was rude; I’ll admit it. But you read through my story anyway, so you must be dying of curiosity.Or maybe you’re like me, and it’s the adrenaline that gets you, the thrill. You want your foot on the throttle, the wind in your hair, and a sturdy f*ckboy … or two or three.But what if there are four? Four unholy terrors. Four men to warm your bed … or wait beneath it, watching from the shadows. And what if you had to pick one to die?Ash Kelly. Who knew I’d be dating a dead boy? He might be wearing someone else’s skin, but it’ll always be Ash for me. Ash, the obsessive one, the one with the most to lose, the one I can’t trust. My biggest secret.Kellin Bohnes is always there for me, but he keeps a bulldozer-turned-tank in his warehouse. He has eyes everywhere, but mostly he has eyes for me. Also, he brought me a severed head as a present. His love for me is escalating.There’s always Adrian Lawless aka Widow to fall back on. He reads romance and strums a guitar, but he isn’t the type to give up on a woman. Not when he’s already claimed her. Not even when he has to help bury the evidence.Did I mention my cold prince, Alexei Grove? With his father gone, he has nothing left to lose. Piece by piece, his sanity falls apart in my hands, and I love every minute of it. Touch me with your black-gloved hands, sir … Don’t stop.And of course, you know me—Scarlett Motherf*cking Force.I’m your only friend: remember that.Let me warn you one last time; I really don’t want to write your epitaph.So hit the gas and get the hell out of here.Just … remember to check the back seat first.Someone might be waiting for you there.Love, MeUNHOLY TERRORS is a 120,000 word mature high school/new adult romance with enemies-to-lovers/love-hate themes. This book contains a lot of foul language and sexual scenes; any sex featured is consensual. This is a reverse harem novel, meaning the main character has more than one love interest. The Scarlett Force series will conclude with a happy ending. This is book two in the series.",
  "genres": [
    "Reverse Harem",
    "Dark",
    "Romance",
    "Dark Romance",
    "High School",
    "Contemporary",
    "Enemies To Lovers"
  ],
  "author": "C.M. Stunich",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/59511838-unholy-terrors"
}