{
  "title": "حكاية بلا بداية ولا نهاية",
  "description": "مجموعة قصصية\"قال الرجل ذلك وذهب. وقف الشاب والفتاة يتبادلان النظر سألها: أأنت مترددة مثل أبيك. فقالت بهدوء عذب: أنت تعرف رأيي تماماً. أترغبين أن أنتظر حتى يتكشف لي الماضي. لا يهمني أن تهتدي إلى ماضيك أو أن يهتدي ماضيك إليك. أنا سعيد ولكن القلق يطاردني. وتحبني أليس كذلك. لا يربطني بهذا المكان إلا حبك. حسبنا ذلك. سأعمل وأتزوج ولكن والدك متردد. كلا، إني أعرف والدي تماماً. يخيّل إليّ أني نلت ثقته. أنت أهل للثقة. لندع الله يهيء لنا السعادة. لندعه من صميم قلوبنا. وفي شرفة الفيلا، فوق الجبل، جرى الحديث في ظلام دامس، سأل الشيخ الجالس فوق الكرسي الهزاز: ما وراءك. فأجاب الشيخ الماثل بين يديه: أواه صاحب الفندق. رجل طيب وداهية ماكر، وعمل كل ما يمكن عمله للاهتداء إلى هوايته. ولو لم ينظر الفتى في نفسه مباشرة! إنهم يفضلون الوسائل غير المباشرة. وثار فضول الناس. لم يعد يثيرني فضولهم. حسن، وظل مجهولاً كاللغز. تعني في نظر نفسه. طبعاً.. وكيف مضت القصة. ظهر الحب. من جديد\".فندق ونزلاء وخيال نجيب محفوظ يحلق باحثاً عن حكاية هي بلا بداية ولا نهاية. ولا ريب في أن نجيب محفوظ في حكايته تلك لم يغب الواقع عنه، إذ أنه، كان يكتب قصصه بعد تلمسها حقيقة على أرض الواقع، إذ أنه كان يعيش قصته في مناخاتها الحقيقية. لينسج وبشيء من الخيال إبداعاته التي تستمد أهميتها وانتشارها من واقعيتها. ونجيب محفوظ في حكايته هذه لم يبتعد عن منهجيته هذه، وما أبطال تلك القصة إلا أشخاص حقيقيون، وما الأحداث إلا أحداث جرت على أرض الواقع.لذا ومن خلال أسلوبه البسيط يشدك نجيب محفوظ لتتابع أحداث تلك القصة مركزاً على شخصياتها زينب علي عويس الشيخ محمود الشيخ عمار.. وغيرهم تلك الشخصيات التي وظفها نجيب محفوظ لتصوير المجتمع المصري في تلك الآونة، ليحاول من خلالها ومن خلال حواراتهم واسترسالاتهم تقديم نقد لما كان يخيم على ذلك المجتمع من أفكار وعادات وسلوكيات (عقدية اجتماعية سلوكية). وقد نجح الكاتب إلى حدّ كبير في حكايته تلك التي على الرغم من كونها بلا بداية ولا نهاية، فإنها أقحمت القارئ في ما بين سطورها متصوراً بداية ونهاية يحددها هو بنفسه.",
  "genres": [
    "Novels",
    "Short Stories",
    "Fiction",
    "Literature",
    "Africa"
  ],
  "author": "Naguib Mahfouz",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/5948888"
}