{
  "title": "Glimmers in the Ravine",
  "description": "In the near future, megacorporations own everything. It is the era of the advanced gig economy, where desperation runs rampant among the roaming contractor companies that serve the united conglomerates.Jules Romero, a college student in need of tuition money, signs on with a crew of freelance surveyors as they delve beneath Lonesome Bluff in the service of a mining megacorporation.The crew discovers a majestic, mysterious ancient city buried beneath the mountain, but their mission is paramount: They must continue their search for valuable mineral resources. As they delve deeper underground at the behest of their corporate clients, they are slowly overtaken by a horrifying illness that inflicts psychosis and mania in its victims, pitting the crew against each other.Jules, a passionate student of archaeology, must explore the ruins of the lost city and unravel the mystery of this illness as his crewmembers begin their descent into madness. But he cannot imagine the unsettling horrors that lurk in the labyrinthian tunnels, or the maddening lifeform that awaits him far below, deep within the earth.Experience pure cosmic terror in this gut-wrenching horror novel from debut author Stanton Polk.Praise for Glimmers in the Ravine from Readers' Favorite:★★★★★ \"Author Stanton Polk's hair-raising horror novel feels like a cross between the hit movie franchises Alien and Annihilation. A fast-moving plot, compelling characters, thrills, suspense, and plenty of gore make Glimmers in the Ravine a riveting read that you will find hard to put down.\"- Pikasho Deka★★★★★ \"Polk has crafted a classic cosmic horror scenario that will please any Lovecraft fan, but with a modern take. The characters are multi-faceted and believable, the plot convincing, and some parts are downright horrifying but well-executed; not overly done.\"- Tammy Ruggles★★★★ \"Jules and his crew are well-written characters with extremely relatable struggles and ambitions. Stanton Polk's Glimmers in the Ravine is a suspenseful horror story that serves as a great reminder to sometimes let sleeping dogs lie.\"- JC Minnaar★★★★★ \"His writing has the pristine tone that you will also find in the works of Stephen King and Dean Koontz... This is a powerful story in the horror genre, and I highly recommend it. It not only scares you, but it also makes you think and gives you the unsettling sensation that some things are inescapable.\"- Vincent Dublado",
  "genres": [],
  "author": "Stanton Polk",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/59535129-glimmers-in-the-ravine"
}