{
  "title": "On the Trinity",
  "description": "Augustine of Hippo (November 13, 354 – August 28, 430), also known as St. Augustine, was Bishop of Hippo Regius. He was a Latin-speaking philosopher and theologian who lived in the Roman Africa Province. His writings were very influential in the development of Western Christianity.According to his contemporary, Jerome, Augustine \"established anew the ancient Faith\" In his early years he was heavily influenced by Manichaeism and afterward by the Neo-Platonism of Plotinus. After his conversion to Christianity and baptism (AD 387), Augustine developed his own approach to philosophy and theology, accommodating a variety of methods and different perspectives. He believed that the grace of Christ was indispensable to human freedom, and he framed the concepts of original sin and just war.When the Western Roman Empire was starting to disintegrate, Augustine developed the concept of the Church as a spiritual City of God (in a book of the same name), distinct from the material Earthly City. His thought profoundly influenced the medieval worldview. Augustine's City of God was closely identified with the church, the community that worshipped God. In the Catholic Church and the Anglican Communion, he is a saint and pre-eminent Doctor of the Church, and the patron of the Augustinian religious order; his memorial is celebrated 28 August, the day of his death. He is the patron saint of brewers, printers, theologians, the alleviation of sore eyes, and a number of cities and dioceses. Many Protestants, especially Calvinists, consider him to be one of the theological fathers of Reformation due to his teaching on salvation and divine grace. In the Eastern Orthodox Church he is blessed, and his feast day is celebrated on 15 June. Among the Orthodox, he is called \"Blessed Augustine\", or \"St. Augustine the Blessed\".On the Trinity, written around A.D. 400, was written to discuss the Trinity in context of the logos. After Judaism came under Hellenistic influence, Philo (ca. 20 BC–AD 40) adopted the term into Jewish philosophy. The Gospel of John identifies the Logos, through which all things are made, as divine (theos), and further identifies Jesus as the incarnation of the Logos.",
  "genres": [
    "Theology",
    "Philosophy",
    "Religion",
    "Christianity",
    "Christian",
    "Classics",
    "Catholic"
  ],
  "author": "Augustine of Hippo",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/12826712-on-the-trinity"
}