{
  "title": "Lost Stars",
  "description": "There is something wicked about the Greywick triplets. Vivian, Marion, and Timothée Greywick’s father told them one thing before he died: stay away from the Celestial Academy for Fallen Stars. And they’ve done just that, becoming perfectly respectable members of society, with no use for star magic. Never mind that Vivian has a mysterious affliction that her siblings call an illness and she calls a curse. Never mind that Marion works at a leech shop and hoards blood for… some reason. Never mind that Timothée looks exactly like an ancient god who tormented the world thousands of years ago.Never mind that on moonless nights, the Greywick siblings glow.When the triplets accidentally save a prince from a vampire attack, they’re not just the Greywicks anymore. They’re the Lost Stars: descendants of the gods, harboring unforetold magic. Now they’re bound for the Celestial Academy for Fallen Stars, whether they like it or not.A university in the sky. Clouds that rain starlight. Students with terrible magic and worse intentions. The Academy will test not only the triplets' ability to survive, but their loyalty to each other. Vivian falls for a prince and keeps trying to kill him.Marion discovers a plot that can topple kingdoms and unseat even a god’s power if she claims it for herself.And Timothée delves into magic so dark, it has been forbidden for thousands of years. As the triplets unravel the secrets of the school, they begin to realize their father didn’t want to protect them from the Celestial Academy. He wanted to protect the Academy from them.One will become a monster. The other, a queen. The last, a god. Anything is possible at the Celestial Academy for Fallen Stars. Wicked Academia: Lost Stars is a new adult fantasy romance perfect for fans of A Court of Thorns and Roses, Blood and Ash, and Zodiac Academy. It has magic, adventure, swoon-worthy romance, and spice! If you've graduated from Hogwarts, it's time to attend the Celestial Academy for Fallen Stars!",
  "genres": [
    "Fantasy",
    "Romance",
    "LGBT",
    "Young Adult",
    "Queer",
    "Magic",
    "New Adult"
  ],
  "author": "Jasmine  Jenkins",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/59522159-lost-stars"
}