{
  "title": "Josh and Gemma Make a Baby",
  "description": "New Year’s Resolution:Have a babyPreferably with Josh LewenthalMeet Gemma Jacobs. She’s driven, energetic, and a positive thinker. She has a great career working for famed self-help guru Ian Fortune, she lives in a cute studio apartment in Manhattan, and her family is supportive and loving (albeit a little kooky). Her life is perfect. Absolutely wonderful. Except for one tiny little thing.After a decade of disastrous relationships and an infertility diagnosis, Gemma doesn’t want a Mr. Right (or even a Mr. Right Now), she just wants a baby.And all she needs is an egg, some sperm, and IVF.So Gemma makes a New Year’s resolution: have a baby.Josh Lewenthal is a laid back, relaxed, find-the-humor-in-life kind of guy. The polar opposite of Gemma. He’s also her brother’s best friend. For the past twenty years Josh has attended every Jacobs’ family birthday, holiday, and event – he’s always around. Gemma knows him. He’s nice (enough), he’s funny (-ish), he’s healthy (she thinks) and he didn’t burn any ants with a magnifying glass as a kid. Which, in Gemma’s mind, makes him the perfect option for a sperm donor.So Gemma wants to make a deal. An unemotional, businesslike arrangement. No commitments, just a baby.To Gemma’s surprise, Josh agrees.They have nothing in common, except their agreement to make a baby and their desire to keep things businesslike.But the thing about baby-making…it’s hard to keep it businesslike, it’s nearly impossible to keep it unemotional, and it’s definitely impossible to keep your heart out of the mix. Because when you’re making a baby together, things have a way of starting to feel like you’re making other things too – like a life, and a family, and love. And when the baby-making ends, you wish that everything else didn’t have to end too.",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary",
    "Contemporary Romance",
    "Friends To Lovers",
    "Chick Lit",
    "Adult"
  ],
  "author": "Sarah Ready",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/59534877-josh-and-gemma-make-a-baby"
}