{
  "title": "The Third Pole: My Everest climb to find the truth about Mallory and Irvine",
  "description": "Veteran climber Mark Synnott never planned on climbing Mount Everest, but a hundred-year mystery lured him into an expedition--and an awesome history of passionate adventure, chilling tragedy, and human aspiration unfolded.On June 8, 1924, George Mallory and \"Sandy\" Irvine set out to stand on the roof of the world, where no one had stood before. They were last seen eight hundred feet shy of Everest's summit. A century later, we still don't know whether they achieved their goal, decades before Sir Edmund Hillary and Tensing Norgay did, in 1953. Irvine carried a Kodak camera with him to record their attempt, but it, along with his body, had never been found. Did Mallory and Irvine reach the summit and take a photograph before they fell to their deaths?Mark Synnott made his own ascent up the infamous North Face along with a filmmaker using drone technology higher than any had previously flown. His goal: to find Irvine's body and the camera he carried that might have held a summit photo on its still-viable film. Synnott's quest led him from oxygen-deprivation training to archives and museums in England, to Kathmandu, the Tibetan High Plateau, and up the North Face into a storm during a season described as the one that broke Everest. An awful traffic jam of climbers at the very summit resulted in tragic deaths. Sherpas revolted. Chinese government agents turned adversarial. An Indian woman crawled her way to safety and survival. Synnott himself went off the safety rope--if he had slipped, no one would have been able to save him--desperate to solve the mystery.A magnificent story a la The Lost City of Z, The Third Pole conveys the miracle of a mountain the world wants to own, and the first explorers who may have done so.",
  "genres": [
    "Nonfiction",
    "History",
    "Adventure",
    "Mountaineering",
    "Travel",
    "Memoir",
    "Sports"
  ],
  "author": "Mark Synnott",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/59525603-the-third-pole"
}