{
  "title": "One Beautiful Spring Day",
  "description": "A mesmerizing, mind-bending, wordless 400 page comics odyssey by a contemporary master of the form. The New Yorker, Best Books of 2022 The Washington Post,  Best Graphic Novels of 2022 The Guardian , Best Graphic Novels of 2022 Jim Woodring has been chronicling the adventures of his cartoon Everyman, Frank, for almost 30 years. These stories are a singular rarity in the comics form ― both bone-chillingly physical in their depictions of Frank’s travails and profoundly metaphysical at the same time. Not since George Herriman’s Krazy Kat has the comics language been so exquisitely distilled into pure, revelatory aesthetic expression. Designed as a luxe paperback with vellum jacket, One Beautiful Spring Day combines three previously published volumes ― Congress of the Animals , where Frank embarked upon a life-changing voyage of discovery, Fran , where he learned, then forgot, that things are not always what they seem, and Poochytown in which Frank demonstrated his dizzying capacity for both nobility and ignominy ― along with 100 dazzling new pages conceived and drawn by the author. The result is a seamless, 400 page graphic narrative that forges a new and even more poignantly realized single story that takes readers deep into the hidden meanings of the previous stories and offers the most full, complete, astonishing exposition of Frank and his supercharged world to date. Frank’s curiosity and risk-taking mixed with a dose of, let’s face it, wanton recklessness, takes him on a series of terrifying peregrinations that often leave his soul and body shattered, and the reader in a state of creative exaltation. Suffice to say that if you are a friend to Frank you will find One Beautiful Spring Day to be a thousand-course feast of agonizing bliss, soul-stirring mystery and luminous depth. This is undoubtedly one of the great novels of the 21st century, graphic or otherwise. Black-and-white illustrations throughout",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Surreal",
    "Fantasy",
    "Fiction",
    "Graphic Novels Comics",
    "Art"
  ],
  "author": "Jim Woodring",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/59542961-one-beautiful-spring-day"
}