{
  "title": "Sandy Hook",
  "description": "Based on hundreds of hours of research, interviews, and access to exclusive sources and materials, Sandy Hook is Elizabeth Williamson’s landmark investigation of the aftermath of a school shooting, the work of Sandy Hook parents who fought to defend themselves, and the truth of their children’s fate against the frenzied distortions of online deniers and conspiracy theorists. On December 14, 2012, a gunman killed twenty first-graders and six educators at Sandy Hook Elementary School in Newtown, Connecticut. Ten years later, Sandy Hook has become a foundational story of how false conspiracy narratives and malicious misinformation have gained traction in society. One of the nation’s most devastating mass shootings, Sandy Hook was used to create destructive and painful myths. Driven by ideology or profit, or for no sound reason at all, some people insisted it never occurred, or was staged by the federal government as a pretext for seizing Americans’ firearms. They tormented the victims’ relatives online, accosted them on the street and at memorial events, accusing them of faking their loved ones’ murders. Some family members have been stalked and forced into hiding. A gun was fired into the home of one parent. Present at the creation of this terrible crusade was Alex Jones’s Infowars, a far-right outlet that aired noxious Sandy Hook theories to millions and raised money for the conspiracy theorists’ quest to “prove” the shooting didn’t happen. Enabled by Facebook, YouTube, and other social media companies’ failure to curb harmful content, the conspiracists’ questions grew into suspicion, suspicion grew into demands for more proof, and unanswered demands turned into rage. This pattern of denial and attack would come to characterize some Americans’ response to almost every major event, from mass shootings to the coronavirus pandemic to the 2020 presidential election, in which President Trump’s false claims of a rigged result prompted the January 6, 2021, assault on a bastion of democracy, the U.S. Capitol.The Sandy Hook families, led by the father of the youngest victim, refused to accept this. Sandy Hook is the story of their battle to preserve their loved ones’ legacies even in the face of threats to their own lives. Through exhaustive reporting, narrative storytelling, and intimate portraits, Sandy Hook is the definitive book on one of the most shocking cultural ruptures of the internet era.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Politics",
    "Crime",
    "Audiobook",
    "Sociology"
  ],
  "author": "Elizabeth  Williamson",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/59546340-sandy-hook"
}