{
  "title": "Spy for nobody",
  "description": "The book: \"Spy for nobody!: Sixteen Years in the Syrian Intelligence \"by Basel Saneebvery important book, which includes an explanation of the espionage process for the benefit of the Syrian people and against the intelligence services of the Syrian regime that lasted for eighteen years.It is a very interesting book and has popularity around the world.The book contains very important information about the massacres of the city of Hama in /1982 / carried out by the regime of the criminal Assad in Syria, which was classified information and with details for the first time revealing to people .It has been chosen by nine of the world's leading universities and USA universities, as well as the Library of Congress of all Arabic and Syrian books as a reference for research and studies About international intelligence services, the Middle East and About Syria, and other topics and addresses . .The author of this book is from Syria , He is an activist and supporter of the Syrian revolution that demanded freedom, which started in 2011. He is a freelance journalist, political analyst, and military and security intelligence expert..The Book : Spy for nobody .wonderful , distinct, different, the story is very strange and exciting .This book is very interesting and strange. A strange and dangerous and very interesting events passed by the author.During his lifetime. He was always in danger, and he had an unprecedented spy experience, and the writer had broken into one of the most evil intelligence agencies in the world. I advise everyone to read this book, ... It is available in Arabic and English. . It is worth reading.Fantastic book and awesome intelligence adventure with important information.The book : spy for nobodyBy : .Basel Saneeb .AL SANNIB.. I hope someone will turn the book into a movie ..This writer has two famous editions in two different languages, not just one!  The two books are:1 - جاسوس من أجل لا أحد . ستة عشر عاماً في المخابرات السورية \"الكاتب :باسل محمد روحي صنيبPublished 2017 by darelnokhbaISBN13 - 9789776580879Edition Language : Arabic .And :2_ \" Spy... for Nobody!: Sixteen Years in the Syrian Intelligence \"by Basel Saneeb (Goodreads Author)Paperback, English Edition, 192 pagesPublished September 27th 2020 by E-KUTUB LtdISBN13 - 9781780585420Edition Language : English.3_ The Book :\" Spy_For_Nobody\" By: Basel_Saneeb. The second English Edition from USA Available now around the World through Amazon & Google & world's libraries .Publisher:Blurb (27Aug2021)ISBN-10\t/1006590846ISBN-13/‎978-1006590849By the same Person and author.I think and hope that one day we will see that book turned into a wonderful action movie.",
  "genres": [],
  "author": "Basel Saneeb",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/59538794-spy-for-nobody"
}