{
  "title": "The Year of the Horses",
  "description": "As seen on The Today Show A Good Morning America, Vanity Fair , TODAY , NYLON and PureWow Best Book of May and a Publishers Weekly  and Boston.com Best Book of Summer An Amazon Best Book of 2022 So Far (Biography & Memoir Category) Sharp, heartfelt, and cathartic, The Year of the Horses captures a woman’s journey out of depression and the horses that guide her, physically and emotionally, on a new path forward.  At the age of thirty-seven, Courtney Maum finds herself in an indoor arena in Connecticut, moments away from stepping back into the saddle. For her, this is not just a riding lesson, but a last-ditch attempt to pull herself back from the brink even though riding is a relic from the past she walked away from. She hasn’t been on or near a horse in over thirty years.         Although Maum does know what depression looks like, she finds herself refusing to admit, at this point in her life, that it could look like a woman with a privileged past, a mortgage, a husband, a healthy child, and a published novel. That she feels sadness is undeniable, but she feels no right to claim it. And when both therapy and medication fail, Courtney returns to her childhood passion of horseback riding as a way to recover the joy and fearlessness she once had access to as a young girl. As she finds her way, once again, through the world of contemporary horseback riding―Courtney becomes reacquainted with herself not only as a rider but as a mother, wife,  daughter,  writer, and woman. Alternating timelines and braided with historical portraits of women and horses alongside history’s attempts to tame both parties, The Year of the Horses is an inspiring love letter to the power of animals―and humans―to heal the mind and the heart.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Horses",
    "Animals",
    "Biography",
    "Mental Health",
    "Biography Memoir"
  ],
  "author": "Courtney Maum",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/59551334-the-year-of-the-horses"
}