{
  "title": "Aceste jurăminte goale",
  "description": "Prințul nemilos își dă mâna cu Regatul spinilor și al trandafirilor în acest roman fantasy plin de pasiuneși de acțiune în care o fată este prinsă între două regateale zânelor, conduse de doi prinți periculos de seducători!Brie urăște zânele și refuză să aibă de-a face cu ele, chiar dacă asta înseamnă să sufere de foame pe străzi. Însă când sora îi este vândută sadicului stăpânitor al Regatului Unseelie ca să plătească o datorie, tânăra va face orice îi va sta în puteri ca să o salveze – inclusiv să cadă la o înțelegere cu suveranul, angajându-se să fure trei artefacte magice de la curtea Reginei Seelie.Dar să primească acces neîngrădit la Curtea Seelie este mai ușor de zis, decât de făcut. Singura șansă a lui Brie este să pretindă că vrea să intre în cursă pentru a deveni mireasa prințului Ronan, de care se îndrăgostește pe nesimțite. Nedorind să-și lase inima să îi distragă atenția, fata acceptă ajutor de la o bandă de rebeli Unseelie, care au ticluit un plan secret. În vreme ce petrece tot mai mult timp alături de misteriosul lor conducător, Finn, tânăra încearcă din răsputeri să se împotrivească farmecelor lui irezistibile.Captivă între două regate în care primejdiile pândesc la tot pasul, Brie va trebui să aleagă cui anume îi va oferi loialitatea sa. Și inima.„Sexy, surprinzător și plin de secrete! Aceste jurăminte goale se aseamănă în multe privințe cu tărâmul zânelor – seducător,captivant și periculos. Cu două intrigi amoroase diferite, o mulțimede momente încinse și un final spectaculos, aceasta e povestea dedragoste fantasy pe care mi-am dorit-o din toată inima.” STEPHANIE GARBER, autoarea seriei „Caraval”„O abordare nouă și sexy a poveștilor cu zâne, Aceste jurăminte goale m-a cucerit de la prima pagină […]. Brie este o eroină iscusită și inteligentă, pe care cititorii o vor urmări cu sufletul la gură printr-o lume absolut splendidă, plină de magie și de romantism. Pregătiți-vă să vă îndrăgostiți de această nouă carte!” LISA MAXWELL, autoarea seriei „ The Last Magician”„Lexi Ryan a scris o poveste fantasy plină de răsturnări de situație, care m-a lăsat fără cuvinte. Asezonat cu zâne malefice, triunghiuri amoroase care îți fac inima să o ia la goană și o lume excepțional de bine construită, romanul Aceste jurăminte goale este o lectură obligatorie pentru toți fanii autoarelor Sarah J. Maas sau Jennifer L. Armentrout.” CARRIE ANN RYAN, autoarea seriei „Elements of Five”",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Fae",
    "Romantasy",
    "Fantasy Romance",
    "Young Adult Fantasy"
  ],
  "author": "Lexi Ryan",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/59553013-aceste-jur-minte-goale"
}