{
  "title": "Beneath the Trees: Winter Chills",
  "description": "Winter is here, and snow covers the woods like a cold blanket. Mr. Fox has his enormous scarf to keep him warm, but it is almost TOO big -- he can't help but trip over it and get caught on tree branches all the time. But as embarrassing as that is, it is even more humiliating when trying to catch the eye of a beautiful lady!This new series paints a tender and colorful portrait of everyday Life, showing that behind every flaw or weakness can lie charm and strength. Readers will recognize their own neighbors, friends, and family members in the endearing animal characters within this forest community. In this second volume, a self-assured fox tries to stay warm with his ridiculously log scarf, but winds up having to deal with the embarrassment of getting caught up in everything… especially embarrassing in front of the pretty lady fox he’s trying to impress! A warm-hearted and simple romance tale suitable for all ages.The stories in this four-book series take place in the same forest over the course of four seasons. Each can be read independently, exploring the complexity and richness of relationships with family, friends, and loved ones. As both writer and illustrator, the author doesn’t rely on text to convey emotions, oscillating between a clever dose of dialogue and wordless passages to makes these stories accessible to young readers starting as young as 5 years old.Presenting a graphic universe somewhere between Michel Plessix’s adaptations of THE WIND IN THE WILLOWS and the cartoons of Walt Disney (in particular those created by Don Bluth, such as THE RESCUERS and ROBIN HOOD), Dav gently conveys each season through a changing palette of colors and rounded designs.",
  "genres": [
    "Graphic Novels",
    "Animals",
    "Picture Books",
    "Childrens",
    "Romance",
    "Bande Dessinée",
    "Juvenile"
  ],
  "author": "Dav",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/59572723-beneath-the-trees"
}