{
  "title": "Journeys",
  "description": "A barracks full of beautiful boys. A girl in disguise, living among them.It’s the 14th century, and the longbow is king. But in the northern European principality of Ardennes, archery isn’t just the nation’s defense. It’s the national obsession.MEET THE JOURNEYS12 young Journeyman archers, the best in the country2 years of public competitions, in which looks count almost as much as ability6 will win a coveted membership in the Archers’ Guild of St. Sebastian1 will become the prince’s new GuardsmanMEET MARIEKE15-year-old Marieke is as obsessed with St. Sebastian’s as everyone else in Ardennes. Only it’s the middle ages, and girls just don’t become elite archers. Except Marieke's prospects as a girl aren't promising either, after a well-timed kick from a mule has left her with a face that’s badly scarred and ruined for marriage. But when circumstances force her to leave her old life behind and flee to the guild for refuge, there are only two things Marieke really knows about the place. One is that a mysterious accident ended her own father’s time as a Journey. The other?There are no women allowed inside St. Sebastian’s.Marieke knows disguising herself as a boy and infiltrating the guild means embarking on a dangerous deception. But it may be her only chance to find out the truth about her father’s past and to stop a murderous plot from coming to fruition. When the dashing young Journeyman Tristan takes her under his wing as his squire, she’s got to stay – at least long enough to help him beat out his brutal arch-rival to win the competitions.Keeping her identity a secret will be hard. Living in close quarters with a pack of gorgeous boys? That will be harder still. But the hardest thing of all will be keeping the vow she makes for herself: to see Tristan become the next Guardsman, without ever letting him find out she’s a girl - a girl, who loves him.Part Robin Hood and part Princess Bride, with a pinch of Mulan and a dash of Cyrano de Bergerac in the mix, The Archers of St. Sebastian I: Journeys is a humorous action and adventure saga inspired by late medieval/early Renaissance Belgium and packed with romance, wit, and longbow archery. Perfect for adults who love young adult themes, Journeys is an escape into the past that reads more like romantic historical fantasy than pure historical fiction.Unrequited love? Ugly heroines who stay ugly? Friendship, coming of age, romance, adventure, and plenty of archery competitions? A unique setting inspired by the glorious city of Bruges, with a richly imagined, immersive world set within the walls of a male-only archers' guild? Journeys: The Archers of Saint Sebastian has it all, so if you're looking for a great escape, don your disguise and join Marieke as she enters the forbidden world of Saint Sebastian's, and prepare to fall in love with the Journeys - that is, the twelve best and most beautiful archers in all of Ardennes, the Journeyman archers of St. Sebastian's.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Historical",
    "Medieval",
    "Fiction",
    "Young Adult",
    "Historical Romance"
  ],
  "author": "Jeanne Roland",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/59568060-journeys"
}