{
  "title": "Prince of Ash and Shadow",
  "description": "***THIS BOOK is being rewritten and reformatted at this time. Perfect for fans of Ilona Andrews and Raven Kennedy, this book about a sassy necromancer and her surprise marriage to a Faerie Prince is impossible to put down.A life for a life.I didn’t expect a dying prince and his guard to wind up on my doorstep—but when you run an underground healing ring for the Fae, expectations go out the window.As a necromancer with a price on my head, I keep a low profile by doing favors for the Fae: healing the outcasts and criminals in exchange for information on my pursuer. Keeping my feet planted firmly on the wrong side of the law is what’s kept me safe. Hidden. I heal whoever walks through my door, and they pay me in something far more valuable than gold. That strategy worked for years—until a princeling with an attitude problem finds me. A soul for a soul.Prince Rayden Darkbringer claims that he was sent by my former best friend—that she knew I could help him. When I refuse, he offers me a deal: save his life, and he’ll do whatever it takes to keep me safe from the man I’m running from.A man that happens to be his older brother. A death for a death.The problem? The only way to save Rayden is to bind our souls together—permanently. With the bond forcing us to remain together and enemies at our heels, we soon find ourselves embroiled in Court politics and an assassination plot that spans the entirety of Faerie. Somehow, we must survive long enough to depose his brother and reclaim Rayden’s throne.But Rayden isn’t the only one with a dark past and hidden powers, and the real question isn’t whether we can survive in the wake of his brother’s deceit. It’s if we can survive each other.PRINCE OF ASH AND SHADOW is a sexy New Adult fantasy novel that will appeal to fans of a fast-paced plot, the reluctant-allies-to-lovers trope, and snarky heroines. Come for the brooding prince, stay for the flirty werewolf—and the hilarious gnome.",
  "genres": [
    "Fantasy",
    "Fae",
    "Magic",
    "Romance",
    "Fantasy Romance",
    "Urban Fantasy",
    "Paranormal Romance"
  ],
  "author": "K.A. Erickson",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/59562715-prince-of-ash-and-shadow"
}