{
  "title": "The Lick of Love: How dogs changed my life",
  "description": "From one of Britain's best-loved comedians comes this wonderfully funny, sharp and touching memoir and a celebration of the bond between man and dog - an autobi dog raphy, if you will.'I loved The Lick of Love . It's often insightful, sometimes hilarious, frequently filthy - I'm a cat person, but if anything were ever to convince me to get a dog, it would be this' Joanne Harris'. . . wise and perceptive, and funny and moving. Each dog you meet marks a different chapter of your life and Julian writes about it so BEAUTIFULLY' Joanna Cannon'A quirky and witty excavation of memory lane in the company of his furry canine friends' Dame Joan CollinsThe Lick of Love takes us on a tour of Julian's colourful life - and wherever life has taken him, Julian has had a dog by his side. Fanny the Wonder Dog, who came into Julian's life when he was somewhat adrift, propelled him up the ranks of the alternative comedy circuit and onto television. Valerie, the whippet cross-breed escorted Julian through his forties, the Germaine Greer to his Bernard Manning. Albert, a jaunty geezer type who was sent to acclimatise Julian to middle age and helped him seduce his now husband, before being joined by naughty but nice Gigi, an unpredictable fur bullet of a dog. These canine characters have been there, bearing witness, on and off stage.Whether writing about encounters in seedy London nightclubs, finding success on television with Sticky Moments , the death of his partner, that Normant Lamont joke, a narrow squeak with a thwarted eastern European plot to kidnap him, his move to the country, or finally settling down, falling in love and getting married, Julian's unique voice bounces off the page. Ultimately, The Lick of Love is the story of a fascinating life and a love letter to the dogs that have played a loving and near constant part of it. Told with humour and great honesty, this promises to be one of the best memoirs of the year.'Whatever else is going on, it is the water bowl in the kitchen, the dog hair on my jumper, the knowing gaze from the dog in the basket beside me that comforts me and tells me that all is well.' JC",
  "genres": [
    "Nonfiction",
    "Biography",
    "Animals",
    "Comedy",
    "LGBT",
    "Audiobook"
  ],
  "author": "Julian Clary",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/59568600-the-lick-of-love"
}