{
  "title": "Normal Family: On Truth, Love, and How I Met My 35 Siblings",
  "description": "\"One of the maddest memoirs you'll read this year... This beautiful, warm, funny book is a testament to human resilience, forgiveness and humour. It is also a love letter to an extraordinary mother.\" — The Times​What is a “normal family,” and how do you go about making one? Chrysta Bilton’s magnetic, larger-than-life mother, Debra, yearned to have a child, but as a single gay woman in 1980s California, she had few options. Until one day, while getting her hair done in a Beverly Hills salon, she met a man and instantly knew he was the one she’d been looking for. Beautiful, athletic, artistic, and from a well-to-do family, Jeffrey Harrison appeared to be Debra’s ideal sperm donor.  A verbal agreement, a couple of thousand in cash, and a few squirts of a turkey baster later, and Chrysta was conceived. Over the years, Jeffrey would make regular appearances at the family home, which grew to include Chrysta’s baby sister. But how much did Debra really know about the man she’d chosen to father her daughters? And as a single mother torn between ferocious independence and abject dependence—on other women, alcohol, drugs, and the adrenaline of get-rich-quick schemes—what secrets of her own was she keeping? It wasn’t until Chrysta was a young adult that she discovered just how much her parents had hidden from their daughters—and each other—including a shocking revelation with far-reaching consequences not only for Debra, Chrysta, and her sister, but for dozens and possibly hundreds of unsuspecting families across the country. After a lifetime of longing for a “normal family,” can Chrysta face the reality of her own, in all its complexity? Bringing us into the fold of a deeply dysfunctional yet fiercely loving clan that is anything but “normal,” this emotional roller coaster of a memoir will make you cry, laugh, and rethink the meaning of family.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "LGBT",
    "Book Club"
  ],
  "author": "Chrysta Bilton",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/59568382-normal-family"
}