{
  "title": "The End of the Beginning: Lessons of the Soviet Collapse",
  "description": "The Union of Soviet Socialist Republics (USSR) – a workers' and peasants' state – lasted a mere seventy years. It has been gone for a quarter of a century.  Existing socialist states face many of the same external pressures that the Soviet Union faced; future socialist states will too. In addition to interference from the imperialist world, the socialist experiments thus far have faced a number of internal problems: how to maintain economic growth in the face of constantly changing needs and expectations; how to maintain revolutionary momentum through the second, third and fourth generations of the revolution; how to balance a revolutionary internationalist foreign policy with the need to maintain peaceful coexistence with the capitalist world; how to avoid economic and diplomatic isolation and to take advantage of the latest global developments in science and technology.  In trying to locate solutions to such problems, the details of the Soviet collapse constitute some of the most important historical data we have available. The more our movement can learn about the Soviet experience, the better prepared we will be to prevent historic reverses and defeats in future, and the better equipped we will be to develop a compelling, convincing vision of socialism that is relevant in the here and now.  Carlos Martinez goes back to the legacy of the USSR, traces the lessons to be learned from this crucial socialist experiment and provides a challenging narrative of its collapse.  CARLOS MARTINEZ is an activist, writer and musician based in London. He runs the political history blog Invent the Future. His major interests are the history of 'actually existing socialism' and strategies for challenging imperialism and building socialism in the 21st century.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Soviet Union",
    "Russia"
  ],
  "author": "Carlos Martínez",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/59561279-the-end-of-the-beginning"
}