{
  "title": "The Mistletoe Motive",
  "description": "From the author of THE BERGMAN BROTHERS series comes a slow-burn, enemies-to-lovers holiday romance, perfect for fans of THE HATING GAME and YOU'VE GOT MAIL.He loathes the holidays. She loves them. She’s full of festive cheer. He’s brimming with Bah, Humbugs. Besides unreasonably seasonable names, the only thing Jonathan Frost and Gabriella Di Natale have in common is a healthy dose of mutual contempt. Well, that and the same place of employment at the city’s most beloved independent bookstore, Bailey’s Bookshop. But when the store’s owners confess its dire financial state, Jonathan and Gabby discover another unfortunate commonality: the imminent threat of unemployment.With the Baileys’ requests to minimize expenses, win new customers, and make record sales dancing in their heads, Jonathan and Gabby conclude—barring a financial Christmas miracle—one of them will soon be cut from the payroll. Neither are willing to step down from their position, so they strike a bargain: whoever has more sales in December gets to stay on in the new year; the loser will resign. With a lifetime's worth of festive tricks up her sleeve, Gabby should easily outsell her nemesis, except the unreadable Mr. Frost’s every move seems purely designed to throw her off her game.As if that wasn’t bad enough, Gabby's deceptive ex won't quit pursuing her, and her anonymous online friend suggests they take a break. Worst of all, as the pressure mounts to save the bookshop and her job, Gabby meets a new, tender side of Jonathan. Is this the same man she's called her cold-hearted enemy?Maybe he’s got a motive she just can’t figure out—or maybe Jonathan Frost isn’t as chilly as she once thought. Maybe Jonathan and Gabby already know—and love—each other in ways they never thought possible.This is an #OwnVoices story for its portrayal of autism by an autistic author.",
  "genres": [
    "Romance",
    "Christmas",
    "Holiday",
    "Enemies To Lovers",
    "Contemporary",
    "Contemporary Romance",
    "Novella"
  ],
  "author": "Chloe Liese",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/59567857-the-mistletoe-motive"
}