{
  "title": "Armageddon: A Spiritual Battle",
  "description": "Many people envisage Armageddon as a series of physical, cataclysmic occurrences that will occur at the close of the age. However, Antichrist was already active in the early Church. The apostle John wrote, \"you have heard that the Antichrist is coming, even now many antichrists [or people controlled by Antichrist] have come, by which we know that it is the last hour.\" 1 John 2:18. Since then, the Church has been subjected to attacks against her doctrinal truth and integrity by the intrusion of false doctrines, false ministries, lying signs and wonders, and all manner of deceit and deception, that has left her beset by apostasy and worldliness. This has left the Church spiritually dead and powerless as in the valley of dry bones in the thirty-seventh chapter of Ezekiel.However, the final chapter of the Church's history is not one of dismal defeat. In the fourteenth chapter of Zechariah, the prophet says that the Lord, [by His Spirit] will enter the conflict or Battle of Armageddon. He is pictured in Revelation 19, riding forth with the sword of truth in His mouth, with which to slay His enemies. Other prophecies portray the Two Witnesses [or the ministry of prophetic teaching] being restored, the glory of the Lord returning to the Church, Ezikiel's valley of dry bones coming to life, the latter rain of the Holy Spirit falling on the Church, cleansing the Church from all apostasy, and the utter defeat of Antichrist and the False Prophet.We are now beginning to see these signs of the Lord's intervention to restore His Church, and Isaiah beckons us to anticipate having a part in this coming time of restoration.Arise, shine; for your light has come! and the glory of the Lord is risen upon you. For behold, the darkness shall cover the earth, and deep darkness the people; but the Lord will arise over you, and His glory will be seen upon you. The Gentiles [unbelievers] shall come to your light, and kings to the brightness of your rising. Isa 60:1-3.",
  "genres": [
    "Nonfiction"
  ],
  "author": "John     Holland",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/59580409-armageddon"
}