{
  "title": "The Dark Flood",
  "description": "From internationally acclaimed crime writer Deon Meyer, a new thriller featuring superstar detectives Benny Griessel and Vaughn Cupido in the wake of their impulsive pursuit of state corruption that has left their reputations hanging in the balanceHaving jeopardized their careers in an unauthorized investigation that threatened to reveal the corruption in South Africa's halls of power, Benny Griessel and Vaughn Cupido have been demoted from the elite Hawks police unit. While waiting to be transferred from Cape Town to seemingly mundane duty in Stellenbosch, Griessel receives a disturbing, anonymous letter: \"I can only trust you and Captain Cupido. There is an adder in our bosom. Be careful of phone calls.\"Assigned to investigate the disappearance of Callie de Bruin, a young university student and brilliant computer programmer, they hit dead ends until the trail, including the death of a fellow officer, leads to a series of gun heists and the alarming absence of certain weapons from the police registry, the ramifications of which could be devastating.As Griessel and Cupido intensify their search for de Bruin, real estate agent Sandra Steenberg confronts her own crisis: state corruption has caused the real estate market to crash, exacerbating the dire financial straits facing her family. When billionaire Jasper Boonstra contacts her to represent a major property he wants to sell, she pushes aside her concerns about his notorious reputation as playboy and swindler. And then Boonstra himself disappears, and Griessel is forced to juggle between Boonstra's bitter wife, protective lawyer, and Steenberg, the last person to see him alive.With propulsive and intricate plotting, sharp prose, and an ending that takes one's breath away just when the dust seems to have settled, The Dark Flood spotlights the state capture and corruption that has overtaken the country, lending political weight to a powerful story.",
  "genres": [
    "Mystery",
    "Thriller",
    "Crime",
    "Fiction",
    "Africa",
    "South Africa",
    "Mystery Thriller"
  ],
  "author": "Deon Meyer",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/59577174-the-dark-flood"
}