{
  "title": "Why Didn't You Tell Me?",
  "description": "An immigrant mother’s long-held secrets upend her daughter’s understanding of her family, her identity, and her place in the world in this powerful and dramatic memoirMy mother carried a powerful secret. A secret that shaped my life and the lives of everyone around me in ways she could not have imagined.Carmen Rita Wong has always craved a sense of belonging: First as a toddler in a warm room full of Black and brown Latina women, like her mother, Lupe, cheering her dancing during her childhood in Harlem. And in Chinatown, where her immigrant father, “Papi” Wong, a hustler, would show her and her older brother off in opulent restaurants decorated in red and gold. Then came the almost exclusively white playgrounds of New Hampshire after her mother married her stepfather, Marty, who seemed to be the ideal of the white American dad.As Carmen entered this new world with her new family—Lupe and Marty quickly had four more children—her relationship with her mother became fraught with tension, suspicion, and conflict, explained only years later by the secrets her mother had kept for so long.And when those secrets were revealed, bringing clarity to so much of Carmen’s life, it was too late for answers. When her mother passed away, Carmen wanted to shake her soul by its shoulders and demand: Why didn’t you tell me?A former national television host, advice columnist, and professor, Carmen searches to understand who she really is as she discovers her mother’s hidden history, facing the revelations that seep out. Why Didn’t You Tell Me? is a riveting and poignant story of Carmen’s experience of race and culture in America and how they shape who we think we are.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography Memoir",
    "Autobiography",
    "Biography",
    "Race"
  ],
  "author": "Carmen Rita Wong",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/59575956-why-didn-t-you-tell-me"
}