{
  "title": "Acceptance: A Memoir",
  "description": "A luminous, generation-defining memoir of foster care and homelessness, Harvard and Big Tech, examining society's fixation on resilience--and its cost\nAs a homeless teenager writing college essays in her '92 Toyota Corolla, Emi Nietfeld was convinced that an elite school was the only path away from her dysfunctional childhood. But upward mobility required crafting the perfect resilience narrative, proving that she was an \"overcomer,\" made stronger by all that she had endured.The truth was far murkier. Emi's mom was a charming hoarder who had her put on antipsychotics, but believed in her daughter's brilliance--unlike the Minnesotan foster family who banned her \"pornographic\" art history flash cards (of Michelangelo's David). Emi's other parent's departure from her life was tied up in a gender transition that few in the mid-2000s understood. Her own past was filled with facts that she needed to hide: mental health struggles, Adderall addiction, and the unbecoming desperation of a teenager fending for herself. The obstacles Emi claimed she had transcended still defined her life; even though she would go on to graduate from Harvard and become a software engineer at Google, she found that success didn't necessarily mean safety.Told with an incisive storyteller's eye, this searing memoir exposes the cost of trading a troubled past for the promise of a bright future. Having experienced the American Dream firsthand, Emi speaks truth to the high cost of upward mobility, the hypocrisy of elite spaces, and the harsh standards set by societal ideals of grit and resilience. Candid and often harrowing, with a ribbon of dark humor, Acceptance is an electrifying read that challenges our ideas of what it means to overcome--and find contentment on your own terms.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Mental Health",
    "Audiobook",
    "LGBT",
    "Biography Memoir"
  ],
  "author": "Emi Nietfeld",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/59576065-acceptance"
}