{
  "title": "Bend Toward the Sun",
  "description": "Jen Devon's Bend Toward the Sun is a gorgeous, emotional love story about taking unexpected paths, accepting loss, and finding strength in the transformative power of love.Rowan McKinnon believes love isn’t real. With a botany PhD, two best friends who embrace her social quirkiness, and some occasional no-strings sex, she thinks she has everything she needs. But she hides deep wounds from the past—from an emotionally negligent mother, and a fiancé who treated her like a pawn in a game. The only love she’s ever known came from her grandmother Edie, who taught her to care for all things that grow.After a chance encounter at a future winery, Rowan takes on the restoration of the property’s abandoned vineyard, immersing herself in nurturing the grapes back to their former glory—and trying not to think about Harrison Brady.An obstetrician profoundly struggling after losing a patient, Harry Brady no longer believes he is capable of keeping people safe. Reeling from the loss and his crumbled romantic relationship, Harry leaves Los Angeles to emotionally recover at his parents’ new vineyard in Pennsylvania. He’ll work to get the place ready to open, and try to pick up the pieces of his heart.As soon as he meets Rowan, sunlight begins to crack through the darkness smothering Harry’s soul. He’s compelled to explore the undeniable pull between them. After spending a lifetime protecting herself from feeling anything, for anyone, Rowan tries to keep things casual.But even she can’t ignore their explosive connection.A powerful, emotional novel about the ways love can change your life, Bend Toward the Sun is an unforgettable romance and a feast for the senses and the soul.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Fiction",
    "Adult",
    "Chick Lit"
  ],
  "author": "Jen Devon",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/59594684-bend-toward-the-sun"
}