{
  "title": "Where the Wandering Ends",
  "description": "Northern Corfu, 1947—In a community of poor families ten-year-old Marco’s is perhaps the poorest, but it wasn’t always that way. His grandmother once worked for the royal family in the grand villa of Mon Repos where Marco’s mother toddled her first steps beside her playmate, young Prince Phillip himself. Now Greece is on the brink of civil war, and his mother still clings to the desperate hope that somehow Princess Alice will save her family.As the war turns deadlier, Greece’s Queen Frederica takes a defiant stand against the communists, announcing that she will save the children of Greece by opening children’s villages. The communist partisans continue their campaign, countering the Queen’s villages with children’s camps of their own. Entire villages are emptied, thousands of children are taken by the truckload, ripped from their mothers’ arms and transported to communist countries across the border.Having suffered their own set of tragedies, Marco and his mother are desperate for help. Marco turns to his best friend, Katerina, for distraction and scraps from her family’s table. His mother knows there is only one way to save what remains of her family.When communists reach the village, loyalties are tested as devastating secrets threaten to emerge. Marco is sent to the queen’s village while Katerina and her family flee on foot. But before their final tearful goodbye, Marco and Katerina make a promise, vowing to find their way back home to their tiny village and to one another, setting into motion events that will take decades to unravel.Set among Corfu’s picturesque cobblestone lanes, villages, and villas, Where the Wandering Ends is layered with the history of the Greek royal family and Greek mythology and reminds us of the power and magic of a mother’s love. Peasant. Goddess. Queen. Whether she is born in a palace or in poverty, there is no sacrifice or sin a mother wouldn’t commit to save her child.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Greece",
    "Audiobook",
    "Historical",
    "Book Club",
    "Family"
  ],
  "author": "Yvette Manessis Corporon",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/59609071-where-the-wandering-ends"
}