{
  "title": "Daughter of Smoke and Stars",
  "description": "Forbidden romance, heart-stopping action, and the will of a girl slated to become a Goddess collide in this novella about defying destiny. Told from alternating viewpoints between the antagonist and the heroine, it connects the dots between the past and present in the  Prince of Ash and Shadow Universe A goddess… Celestia Oriana is known as the Necromancer Queen, a ruthless goddess that has no interest in the affairs of mortals or their wars. When a Faerie prince dares to pray to her, however, that changes—because the prince doesn’t seek conquest or power.He wants her hand.Soon, Celestia and Prince Tristan Darkbringer find themselves in a dangerous courtship that has untold ramifications for both Faerie and the heavens. When her fellow Gods betray their secret to her father, the King of Gods, everything Celestia loves is ripped away. Now, with her heart turned toward revenge, Celestia will do anything to regain what she has lost.Even if she must destroy the world itself and rebuild her life from its ashes.A priestess… Talia Knightwalker is the last necromancer alive. As a Priestess of the Necromancer Queen, it’s her duty to yield her body to her goddess so that she might walk among mortals once more—and rejoin her lover, Prince Darkbringer, in ruling the Fae. Dedicated to Celestia, Talia has never questioned her duty: until her friend Sharra Khal-Baatar intervenes, and the Goddess nearly compels Talia to kill her.With Celestia’s thoughts virtually indistinguishable from her own, Talia realizes that she deserves better than a life sidelined in her own mind: and if she can stop a vengeful Goddess from wreaking havoc on Faerie, all the better.But how can she run from a goddess when the goddess is within her?***THIS BOOK IS RECOMMENDED TO READ AFTER BOOK ONE and is only for dedicated readers that want to grab everything in the universe. It is not a stand-alone novel.",
  "genres": [
    "Fantasy"
  ],
  "author": "K.A. Erickson",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/59604270-daughter-of-smoke-and-stars"
}