{
  "title": "Chop Suey: A Cultural History of Chinese Food in the United States",
  "description": "In 1784, passengers on the ship Empress of China became the first Americans to land in China, and the first to eat Chinese food. Today there are over 40,000 Chinese restaurants across the United States—by far the most plentiful among all our ethnic eateries. Now, in Chop Suey Andrew Coe provides the authoritative history of the American infatuation with Chinese food, telling its fascinating story for the first time. It's a tale that moves from curiosity to disgust and then desire. From China, Coe's story travels to the American West, where Chinese immigrants drawn by the 1848 Gold Rush struggled against racism and culinary prejudice but still established restaurants and farms and imported an array of Asian ingredients. He traces the Chinese migration to the East Coast, highlighting that crucial moment when New York Bohemians discovered Chinese cuisine—and for better or worse, chop suey. Along the way, Coe shows how the peasant food of an obscure part of China came to dominate Chinese-American restaurants; unravels the truth of chop suey's origins; reveals why American Jews fell in love with egg rolls and chow mein; shows how President Nixon's 1972 trip to China opened our palates to a new range of cuisine; and explains why we still can't get dishes like those served in Beijing or Shanghai. The book also explores how American tastes have been shaped by our relationship with the outside world, and how we've relentlessly changed foreign foods to adapt to them our own deep-down conservative culinary preferences. Andrew Coe's Chop Suey: A Cultural History of Chinese Food in the United States is a fascinating tour of America's centuries-long appetite for Chinese food. Always illuminating, often exploding long-held culinary myths, this book opens a new window into defining what is American cuisine.",
  "genres": [
    "Food",
    "History",
    "Nonfiction",
    "China",
    "Food History",
    "Cooking",
    "American History"
  ],
  "author": "Andrew     Coe",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/5962225-chop-suey"
}