{
  "title": "Escape from Mr. Lemoncello's Library: The Graphic Novel",
  "description": "Can twelve 12-year-olds escape from the most ridiculously brilliant library ever created?Escape from Mr. Lemoncello’s Library plunks a dozen sixth-graders into the middle of a futuristic library for a night of nonstop fun and adventure.In a nod to Roald Dahl’s Charlie and the Chocolate Factory, this fast-paced new novel features an eccentric billionaire who welcomes a group of children into a fantasy setting full of weird, wondrous touches.Kyle is a game fan—board games, word games, and especially video games! Kyle’s hero, the famous game maker Luigi Lemoncello, is the genius behind the design of the town’s new public library, which contains not only books, but an IMAX theater, an electronic learning center, instructional holograms, interactive dioramas and electromagnetic hover ladders that float patrons up to the books they want.Lucky Kyle wins a spot as one of the first twelve kids invited to a gala, overnight library lock-in filled with lots of fun and games. But the next morning, when the lock-in is supposed to be over, the doors remain locked. Kyle and the others must follow book-related clues and unravel all sorts of secret puzzles to find the hidden escape route if they want to win Mr. Lemoncello’s most fabulous prize ever.Escape from Mr. Lemoncello’s Library is more than a rib-tickling novel full of humor and suspense. It’s a game in itself, in which readers can have fun solving clues and answering riddles while learning how to navigate the Dewey Decimal system. Eagle-eyed kids—not to mention their parents, teachers, and librarians—can also hunt for the names of authors and classic books sprinkled throughout the fast-moving story.Rumor has it there is even one puzzle that is in the book but not in the story. Can you find and solve it?",
  "genres": [
    "Graphic Novels",
    "Middle Grade",
    "Mystery",
    "Adventure",
    "Childrens",
    "Fiction",
    "Books About Books"
  ],
  "author": "Chris Grabenstein",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/59627475-escape-from-mr-lemoncello-s-library"
}