{
  "title": "Choosing Honor: An American Woman's Search for God, Family, and Country in an Age of Corruption",
  "description": "''An unpredictable tonic for what ails America.'' -- Kirkus Discoveries Recipient of the Mom's Choice Award in 2009. Choosing Honor has been out for a while and the world is just now catching up to what this book has to say. 'It's as if author Mary T. Ficalora had a crystal ball,' said radio host Phil Mikan on his Talk of Connecticut program in December. Agoura Hills librarian Grace Bernard concurs with Mikan. Bernard helped Ficalora find some of the economic research she needed while writing Choosing Honor and Bernard remembers thinking Ficalora was 'off-base' at the time. Not anymore. Bernard is amazed by how right on the money, both figuratively and literally, Choosing Honor is. In Choosing Honor , Ficalora details how corruption has and is forcing a reconfiguration of our monetary system. Honor, Ficalora says, requires us to be fearless in the face of these forces we have no control over. Choosing honor, Ficalora tells us, requires us to stand for the way money is supposed to work per Constitutional law. A constitutional monetary system has not been a part of our lives since 1913 when the Federal Reserve System was enacted. This reality has festered in the roots of our economy, because the precedent for bad law is that once the law is in place you can not undo that law unless you show that said law is causing more harm to keep then it would cause to undo. As Ficalora rightly points out, the high standard of living we enjoy in the United States can be directly attributed to the Federal Reserve System. Bad law or not United States citizens have thrived over the last century. 'We are at a crossroads,' Ficalora says in the pages of Choosing Honor . 'It is up to us, We the People, to choose who we are as a nation.' Our nation's honor was entrusted to a select cartel of bankers who betrayed the trust. Now, Ficalora tells us, it is up to 'We the People' to take back our honor and be who we say we are. Choosing Honor , one Amazon.com reader says, 'is full of good information! It's a self-help book, but it's also like taking a fascinating class about the human condition all in one.' We at Avail Press could not agree more. Choosing Honor is an important book. Choosing Honor offers sound solutions that readers can use to take positive action in their lives and community that will help them to triumph in the face of today's social and economic crisis. For more information about Choosing Honor , including downloadable picture files and reviews, please visit availpress.com.",
  "genres": [],
  "author": "Mary T. Ficalora",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/5962434-choosing-honor"
}