{
  "title": "The Gap and The Gain: The High Achievers’ Guide to Happiness, Confidence, and Success",
  "description": "As he did in WHO NOT HOW, Dr. Benjamin Hardy shares one of Dan Sullivan’s simple yet profound teachings that until now has been known only to his Strategic Coach clients: unsuccessful people focus on “The Gap,” but successful people focus on “The Gain.”\" [T]his one simple concept is a masterclass on positive psychology, healthy relationships, mental well-being, and high-performance. Everything that psychologists know about how to create a high-functioning and successful person can be achieved using The GAP and the GAIN.\"- Dr. Benjamin HardyMost people, especially highly ambitious people, are unhappy because of how they measure their progress. We all have an \"ideal,\" a moving target that is always out of reach. When we measure ourselves against that ideal, we're in \"the GAP.\" However, when we measure ourselves against our previous selves, we're in \"the GAIN.\"That is where the GAP and the GAIN concept comes in. It was developed by legendary entrepreneur coach Dan Sullivan and is based on his work with tens of thousands of successful entrepreneurs. When Dan's coaching clients periodically take stock of all that they've accomplished-both personally and professionally-they are often shocked at how much they have actually achieved. They weren't able to appreciate their progress because no matter how much they were getting done, they were usually measuring themselves against their ideals or goals.In this book you will learn that measuring your current self vs. your former self has enormous psychological benefits. And that's really the key to this deceptively simple yet multi-layered concept that will have you feeling good, feeling grateful, and feeling like you are making progress even when times are tough, which will in turn bolster motivation, confidence, and future success.If you're finding that happiness eludes you no matter how much you've achieved, then learning this easy mindset shift will set you on a life-changing path to greater fulfillment and success.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Business",
    "Personal Development",
    "Psychology",
    "Productivity",
    "Audiobook"
  ],
  "author": "Dan  Sullivan",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/59610840-the-gap-and-the-gain"
}