{
  "title": "Fiery But Mostly Peaceful: The 2020 Riots and the Gaslighting of America",
  "description": "“Fiery, but mostly peaceful protests after police shooting.”“It’s Not, Generally Speaking, Unruly.”“CHOP was an Important Experiment in Democracy.”In the summer of 2020, America was under siege by radical ANTIFA actors across the country. But if you were only reading mainstream headlines, you probably have no idea just how bad it really was. As homes and businesses were being burned to the ground and livelihoods were being destroyed, corporate media engaged in a full-scale attempt to gaslight the American people, pushing Orwellian narratives about the violent riots by mislabeling them as peaceful, democratic demonstrations, all seemingly to bolster their biased political views. But one intrepid reporter was on the ground at all the major riots and witnessed what really happened — and is telling the full story for the first time.In his explosive new book, Julio Rosas presents the definitive account of what really happened that summer, exposing the truth behind countless misleading headlines and taking readers inside the shocking and heartbreaking destruction the media refused to cover. Rosas’ groundbreaking reporting of the biggest and most destructive riots that gripped the nation in recent memory — including Kenosha, Minneapolis, Portland, Seattle, and more — decisively uproots the prevailing bogus narratives about destructive woke mobs and sheds much-needed light on the truth about what happened. Small businesses and citizens of targeted cities are still sifting through the rubble left behind by rioters while the media continues to turn a blind eye. Rosas’ shocking account highlights the ways in which this fallout continues to haunt and devastate communities even to this day. Thrilling, suspenseful, and packed cover-to-cover with jaw-dropping facts and never-before-told eyewitness accounts, Fiery but Mostly Peaceful pulls back the curtain and sets the record straight on a series of radical events across the country that, despite the media’s attempts to convince Americans otherwise, were anything but peaceful.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Journalism",
    "American History",
    "American"
  ],
  "author": "Julio Rosas",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/59647257-fiery-but-mostly-peaceful"
}