{
  "title": "Isaiah Light and the Sea of Darkness",
  "description": "Isaiah felt so naive. All this time, the common thread of all the hurt people. Rebecca’s instinct was right. The dreams of children turning to ash was leading him. The Sea of Darkness showed him where to stand. It was right in front of him, but he didn’t see it.He underestimated the evil in the world, never thinking it would come for him or his wife or the youth of his church. This was evil in human form, not sinful human nature of greed or jealousy or lust; this was beyond that. And it was taking lives.It was 1962. Isaiah Light and his wife Rebecca have built a small, yet steadily growing church in the North Florida area and live a quiet life worshiping God. Their lives change on the day Isaiah’s father, Michael, passes down the family Bible that holds an ancient secret. A book that Isaiah doesn’t know has been protected by his family for thousands of years.On the day Isaiah receives his inheritance, a promising young leader shows up to youth group drunk, searching for a girl who didn’t show up that night. Isaiah follows him as he runs from the house and soon begins to pull on the web of lies that is leaving car crashes, arrests, and a body count of innocent young women in its wake.You don’t have to be a Christian to enjoy the Light of the Ark series. It is perfect for fans of Thrillers, Mystery and Suspense, Supernatural, and of course Christian Fiction. Pick up your copy today!Isaiah Light and the Sea of Darkness is a prequel and can be read separately (stand-alone) from the other books in the Light of the Series.Light of the Ark SeriesPrequel - Isaiah Light and the Sea of Darkness (Set in the early 1960s)Book 1 - Light of the Ark (Set in the 2020s)Book 2 - Shadows of the Ark (Picks up from Book 1) - Coming early 2022!Book 3 - Light of the World (Picks up from Book 2) - Coming in 2022!",
  "genres": [],
  "author": "James Bonk",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/59634855-isaiah-light-and-the-sea-of-darkness"
}