{
  "title": "The Prodigious Muse: Women's Writing in Counter-Reformation Italy",
  "description": "Winner, 2012 Book Award, Society for the Study of Early Modern WomenHonorable Mention, Literature, 2012 PROSE Awards, Professional and Scholarly Publishing Division of the Association of American Publishers In her award-winning, critically acclaimed Women’s Writing in Italy, 1400–1650 , Virginia Cox chronicles the history of women writers in early modern Italy―who they were, what they wrote, where they fit in society, and how their status changed during this period. In this book, Cox examines more closely one particular moment in this history, in many ways the most remarkable for the richness and range of women’s literary output. A widespread critical notion sees Italian women’s writing as a phenomenon specific to the peculiar literary environment of the mid-sixteenth century, and most scholars assume that a reactionary movement such as the Counter-Reformation was unlikely to spur its development. Cox argues otherwise, showing that women’s writing flourished in the period following 1560, reaching beyond the customary \"feminine\" genres of lyric, poetry, and letters to experiment with pastoral drama, chivalric romance, tragedy, and epic. There were few widely practiced genres in this eclectic phase of Italian literature to which women did not turn their hand. Organized by genre, and including translations of all excerpts from primary texts, this comprehensive and engaging volume provides students and scholars with an invaluable resource as interest in these exceptional writers grows. In addition to familiar, secular works by authors such as Isabella Andreini, Moderata Fonte, and Lucrezia Marinella, Cox also discusses important writings that have largely escaped critical interest, including Fonte’s and Marinella’s vivid religious narratives, an unfinished Amazonian epic by Maddalena Salvetti, and the startlingly fresh autobiographical lyrics of Francesca Turina Bufalini. Juxtaposing religious and secular writings by women and tracing their relationship to the male-authored literature of the period, often surprisingly affirmative in its attitudes toward women, Cox reveals a new and provocative vision of the Italian Counter-Reformation as a period far less uniformly repressive of women than is commonly assumed.",
  "genres": [],
  "author": "Virginia Cox",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/12832117-the-prodigious-muse"
}