{
  "title": "House of Wolves",
  "description": "Hunt the shadow. Guard the flame.Noor is the new Aten of Helios, having wrenched the kingdom of the sun from her treacherous father’s hands. Citali stood with her sister against him, and rejoiced when he died at Noor’s hand… But he did not go quietly.He poisoned the thoughts of their older sister, Zarina, who believes that Noor is not who she claims and was never supposed to be Aten. As Zarina flees the temple to determine her next step, she encounters, then attacks, Citali.Beaten and left for dead, Citali’s cries are heard by the Wolven of Lumina. In a flurry of fur and fang, Beron rushes to her aid yet fears he arrived too late. With what would have been her dying breath, Citali whispers a secret that changes everything.Pleading to Lumos – the god of the moon – for a way to save her, Beron is provided an answer that comes at a steep price. Citali will become Wolven. The two bonded together for a lifetime. Despite their tumultuous past, Beron helps hone her new strength and senses, a primal passion now surging through her veins. But can the two stop fighting one another and work together to hunt and destroy the darkness spreading over the sands like a plague of locusts? Or will the sands of time run out for them both?House of Wolves is book two of the House of Eclipses Duology. House of Wolves is perfect for anyone who loves enemies to lovers, young adult fantasy romance books like We Hunt the Flame by Hafsah Faizal and morally gray characters as in A Court of Silver Flames by Sarah J. Maas.\nExcerpt taken from the book \n Shadow spreads over the land of Helios, threatening the secret I’ve tried so hard to protect. Anubis, god of the dead, creator of lies, says I’m meant for him. But I belong only to myself. With the Wolven and his pack, the Lumen and Aten at my side, and the hope of two kingdoms, I will hunt the shadow and guard the flame.",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Fiction",
    "Mythology",
    "Young Adult Fantasy"
  ],
  "author": "Casey L. Bond",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/59647439-house-of-wolves"
}