{
  "title": "Return All",
  "description": "A sweet and deliciously kinky, second-chance, first love, sports romance by critically acclaimed romance author, Eve Dangerfield.Derek Hardman is a man on top of the world. A professional football player, six-foot five and all muscle with the world at his fingerprints. That is until his high school sweetheart, Mara Kennedy comes to mind. The woman he left behind in order to turn his dream of turning pro into a reality and a regret he has lived with ever since.After dealing with the devastation of Derek leaving, Mara reinvented herself and built the perfect life traveling Europe. A powerful and successful businesswoman in her own right, she has returned home with a designer wardrobe, an adorable puppy and a new last name. She has nothing holding her to her past but painful memories of Derek and the love they once shared. For this reason, Mara has sworn off dating and refuses to risk her heart ever again.But with Derek determined to make Mara his again, he returns to her a changed man. Donning a suit, a shaved head, sexy tattoos, and an illicit request straight out of her wildest Daddy fantasies, will Mara be able to say no? Or will she risk her new life for another chance at true love?“Return All is one of my top reads of the year. Soooooo wickedly good.” NYT bestselling author Annika Martin“Nobody does Daddy kink quite like Eve Dangerfield. A fantastic read every time!” USA Today bestselling author Ainsley Booth​​​​​​​\"Kink, heart, and sass all in one delightful package!\" USA Today Bestseller, Amy Andrews.\"Return All is the book you need right now. Deliciously dirty, sweet, and so real it hurts.\" Adriana Anders, Award-winning author of Whiteout",
  "genres": [
    "Romance",
    "Second Chance",
    "Contemporary Romance",
    "Second Chance Romance",
    "Sports",
    "Contemporary",
    "Sports Romance"
  ],
  "author": "Eve Dangerfield",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/59653808-return-all"
}