{
  "title": "Grim, Fair e-Tales",
  "description": "Best known as the world's top-ranked player of classic role-playing games for fifteen years, Donald J. Bingle is an oft-published author in the science fiction, fantasy, horror, thriller, steampunk, romance, and comedy genres. Many of these stories have been written on short deadlines to required specifications of wordcount and topic, making Don a veritable Writer on Demand TM. While some of his stories are electronically available in the themed anthologies in which they first appeared, they are being collected and offered here by genre, with new collections coming out periodically.Writer on Demand TM Vol. 4: Grim, Fair e-Tales includes four dark or downbeat stories, two of which are set are fairs or carnivals:\"Suburban Legend\" (approximately 6,400 words) rips from the headlines and twists the classic tale of a suburban husband accused of murdering his beautiful wife. This story originally appeared in \"Imaginary Friends,\" edited by John Marco and Martin H. Greenburg (DAW Books. Inc. 2008).\"Artists Only\" (approximately 3,500 words) tells the tale of a little girl who goes unwillingly with her brother to the local traveling carnival, tires of the garish distractions, and becomes lost. This story originally appeared in compact disc format in \"Carnival/Circus,\" edited by Jean Rabe (Lone Wolf Productions 2004).\"Stew\" (approximately 3,900 words) deals with a boy who decides it is right to go to war, but later regrets his decision. This story originally appeared in \"Civil War Fantastic,\" edited by Martin H. Greenberg (DAW Books, Inc. 2000) and was later reprinted in \"Stalking the Wild Hare,\" edited by John Helfers, Chris Pierson, Marc Tassin, and Jean Rabe (Walkabout Publishing 2010).\"Grok\" (approximately 4,000 words)is a the story of the mud-man of the local Renaissance Faire. It originally appeared, appropriately enough, in \"Renaissance Faire,\" edited by Andre Norton and Jean Rabe (DAW Books, Inc. 2005).Also available: Writer on Demand Vol. 1: Tales of Gamers and Gaming, Writer on Demand Vol. 2: Tales of Humorous Horror, and Writer on Demand Vol 3: Tales Out of Time. Watch for more Writer on Demand TM Collections, coming soon.",
  "genres": [],
  "author": "Donald J. Bingle",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/12833132-grim-fair-e-tales"
}