{
  "title": "And They All Sang: Adventures of an Eclectic Disc Jockey",
  "description": "The Pulitzer Prize–winning historian talks with some of twentieth century’s most iconic musicians―“Riveting . . . Just about every interview has a revelation” ( San Francisco Chronicle ). Through the second half of the twentieth century, Studs Terkel hosted the legendary radio show “The Wax Museum,” presenting Chicago’s music fans with his inimitable take on music of all kinds, from classical, opera, and jazz to gospel, blues, folk, and rock. Featuring more than forty of Terkel’s conversations with some of the greatest musicians of the past century, And They All Sang is “a tribute to music’s universality and power” ( Philadelphia Inquirer ). Included here are fascinating conversations with Louis Armstrong, Leonard Bernstein, Big Bill Broonzy, Bob Dylan, Dizzy Gillespie, Mahalia Jackson, Janis Joplin, Rosa Raisa, Pete Seeger, and many others. As the esteemed music critic Anthony DeCurtis wrote in the Chicago Tribune , “the terms ‘interview’ or ‘oral history’ don’t begin to do justice to what Terkel achieves in these conversations, which are at once wildly ambitious and as casual as can be.” Whether discussing Enrico Caruso’s nervousness on stage with opera diva Edith Mason or the Beatles’ 1966 encounter in London with revered Indian sitar player Ravi Shankar, “Terkel’s singular gift for bringing his subjects to life in their own words should strike a chord with any music fan old enough to have replaced a worn-out record needle” ( The New York Times ). “Whether diva or dustbowl balladeer, Studs treats them all alike, with deep knowledge and an intimate, conversational approach . . . as this often remarkable book shows, Studs Terkel has remained mesmerized by great music throughout his life.” ― The Guardian “[Terkel’s] expertise is evident on every page, whether debating the harmonic structure of the spirituals or discerning the subtleties of Keith Jarrett’s piano technique . . . As ever, he is the most skillful of interviewers.” ― The Independent “What makes And They All Sang a rousing success isn’t just Terkel’s phenomenal range and broad knowledge, it’s his passionate love of the music and his deep humanity.” ― San Francisco  Chronicle",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Memoir",
    "Biography",
    "Journalism"
  ],
  "author": "Studs Terkel",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/59654.And_They_All_Sang"
}