{
  "title": "Pint of Contention",
  "description": "They’ve both got good reasons to fight falling in love, but they can’t resist the overpowering attraction pulling them together… MAGGIEWicked Witch. Ballbuster. The Terminator. Those are just a few of the nicknames I’ve earned in my professional life. As the executive consultant King’s Creamery has brought in to save them from financial ruin, I have to decide which employees get the ax. I can’t afford to make friends or get chummy with my new neighbors.Try telling that to the enormous, hunky fireman next door who’s annoyingly determined to make friends with me. It’s not enough that the guy saves kittens, tosses tree trunks around while wearing a kilt, and has a body that makes Thor look puny. He also works out shirtless in full view of my kitchen window. I might be secretly obsessed.When a newspaper exposé turns the whole town against me, my hot fireman neighbor steps up to act as my protector, and my secret obsession threatens to turn into a case of serious feelings. But I can’t allow that to happen when I’m only here temporarily. I’ve got to keep my walls up to protect the heart everyone thinks I don’t have.RYANMy new neighbor might act like she wants nothing to do with me, but I’ve seen her watching me from her window. I can tell she likes what she sees, and I love pushing her buttons—a little too much. I’ve got no restraint when it comes to this woman. Now I’m screwed because I can’t get her out of my head. The more time I spend with Maggie, the more I suspect she might be the soul mate I’ve been waiting for all my life.Of course I’d find her now when I can’t risk letting her get too close. If she does, she might discover the secret I’ve been keeping from everyone.Soul mate or not, I’ve got to let her go. Even if it kills me.PINT OF CONTENTION is book #3 in the King Family series set in the small town of Crowder, Texas, home of the King’s Creamery ice cream company. Each book is a standalone, full-length contemporary romance that follows one of the six King siblings as they find and fight for love.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Small Town Romance",
    "Chick Lit",
    "Fiction",
    "Forced Proximity"
  ],
  "author": "Susannah Nix",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/59651841-pint-of-contention"
}