{
  "title": "Atmosphere, CO2 on my mind",
  "description": "How does our changing atmosphere affect the human body and mind? The direct impact of a changing atmosphere on humans and life, in general, is the central subject of this book.The climate change talk mainly revolves around rising temperatures, more violent weather, melting glaciers, and rising levels of the oceans. But how will our bodies and minds react to this change in the air that we breathe?To understand how life and our atmosphere are intertwined, we start by looking at our past. The first atmosphere of our Earth was very much like that of Mars and Venus. But life itself terraformed our planet into a habitable place for numerous lifeforms. From time to time, this change in the atmosphere caused extinctions. But the extinction events also drove evolution forward to new heights. Without change, there is no incentive to explore new radically different solutions. The same also holds for the evolution of us, homo sapiens. During our evolutionary development, which resulted in us giving ourselves the title “sapiens”, translated to “wise”, we have experienced a very stable composition of the atmospheric composition. Simplistically speaking, evolution is the process of adaptation to the environment. Can we evolutionarily adapt fast enough to the extremely rapid change in our environment caused by climate change?To understand the task at hand, we must first understand what a changing composition of the air we breathe does to our bodies. The crews of spaceships and submarines already today experience a different mixture of the air they inhale. Scientists have documented the effects that a spacecraft and a submarine have on the passengers of these vehicles. Medical science has in great detail explained how our pulmonary system (our breathing cycle) works. We are missing the link towards the change in the air we breathe, however. What are the long-term effects of higher CO2 levels and lower O2 levels? What are the effects on infants?It is easy to avoid catastrophe, and we just need to do the right things right. And herein lies the challenge. What are the right things? We know that we have to stop using fossil fuels. The path forward, however, is not that clear. The currently broken scheme of accounting for our emissions needs fixing. The electricity demand will increase, potentially by a factor as high as ten. Fossil fuels are not only used to produce energy. Fossil fuels are components of numerous daily live objects, such as toys, wrapping materials, detergents, perfumes, and many more. We need replacements for all the things that today require fossil fuels, and maybe mother nature can contribute in the form of microalgae?Climate change is highly unfair. The nations that caused our calamities are not the ones feeling the most brutal impact. We cannot solve our challenges if we keep working with a “them and us” mindset. Working in collaboration with developing countries might, however, solve multiple challenges in the most efficient way. Large areas in developing countries are turning uninhabitable, and we need to change this development. Coincidentally the same regions have abundant resources in solar energy, heat, and relatively cheap labor. Developing countries are part of the solution, and if we help them, we help everyone on Earth.",
  "genres": [],
  "author": "Daniel Lux",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/59681728-atmosphere-co2-on-my-mind"
}