{
  "title": "Villain I'd Like to F...",
  "description": "Lady Viper and the Bastard by Eva LeighLady Violet “Viper” Hampton is infamous for her ferocity in the ballroom and the bedroom, but her vicious reputation is nearly matched by her rakish rival, Ian “the Bastard” Molineaux. When Violet and Ian are separately hired by families seeking to tear a loving couple apart, the two enemies must work together. The bastard and the viper use every weapon in their seductive arsenal to emerge the victor, yet the passion between them is as explosive as it is dangerous...Seven Sinful Nights by Nicola DavidsonAs the jaded, lowborn owner of London’s most notorious gaming hell, Blake Evans relishes tormenting his aristocratic debtors. When an errant peer offers one night with his sister-in-law Estelle, Dowager Duchess of Tolwick, Blake counters with impossible terms: the oh-so-proper widow must spend a week in his bed, submitting to his every desire. Shockingly, she agrees. But far more surprises are ahead, for this young beauty has a wild heart, a taste for wickedness, and might just be the woman of his dreams. If only she wasn’t promised to another…The Gangster’s Prize by Joanna ShupeFrom a good upstanding family, Isabelle Kelly is dedicated to righting the city’s wrongs. Just like her father, who is one of New York’s most powerful men and currently leading a crusade to rid the city of its violent street gangs. But when her father goes missing, Isabelle knows who is responsible . . . and she will get answers from the devil one way or another.As the leader of the Hell’s Kitchen Gang, Billy Baxter always gets what he wants. And he’s had his eye on the beautiful Miss Kelly for months. She doesn’t know it yet, but she’s fallen into his world now.And he has no intention of ever letting her go.The Bootlegger’s Bounty by Adriana HerreraRosalía Ferrer dreams of leaving her island behind and sailing north to sing in a New York City nightclub. Unfortunately, the only way to escape her father’s suffocating clutches is to align herself with a man who is as ruthless as he is lawless. Putting her fate in the hands of a villain like the Rogue of Rum Row is a very risky gamble, but Rosalía will do whatever it takes to get what she wants…even if it means striking a deal with the devil himself.After ten years, Camden McCullough is finally poised to pull off his last rum run. If he can keep the brown-eyed hellion he brought on to his schooner from getting them both killed, he might sail into the sunset with everything he’s ever wanted: the loot and the girl.The Conquering of Tate the Pious by Sierra SimoneEngland is burning with Norman fires, and Tate—the youngest ever abbess of Far Hope Abbey—is determined to guard the abbey’s ancient secrets with her very life. Her life may be what it takes, however, for a Norman warlord known only as The Wolf is pillaging his way right to the abbey’s doors. But when The Wolf arrives, Tate finds not the brutal warrior she was expecting, but his even more brutal widow in his place, a cruel and beautiful woman who leads her dead husband’s men with a ferocity to rival that of her Viking ancestors. And after she sets eyes on Tate, it becomes clear that gold and silver aren’t the only things The Wolf wants to carry off into the night…",
  "genres": [
    "Romance",
    "Historical Romance",
    "Anthologies",
    "Historical",
    "Erotica",
    "Enemies To Lovers",
    "Short Stories"
  ],
  "author": "Sabrina Darby",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/59684500-villain-i-d-like-to-f"
}