{
  "title": "Lisa",
  "description": "The long-awaited memoir of one of Australia's most enduring and inspiring sporting icons. Triple Olympian and wellness entrepreneur Lisa Curry has lived her life in the public eye for six decades. In this very personal memoir, she shares the untold story of being Lisa.A swimming prodigy who became one of Australia's first fitness entrepreneurs, Lisa Curry swam to Olympic fame in the '80s and '90s. With celerity and celebrity, she became in equal parts the darling of women's magazines and tabloid fodder, until, at 58, a family tragedy nearly consumed her. From the golden girl of Australian swimming to a 'super mum' and now a proud grannie, Lisa Curry has a powerful story to tell of endurance and enduring.In 1972, ten-year-old Lisa escaped the heat of a hot and muggy Brisbane day in the local pool when she was spotted by Dawn Fraser's legendary swim coach, Harry Gallagher. Within two years of joining his swim squad, Lisa would be one of the fastest swimmers of her age in the world.Over the next 23 years, Lisa honed her natural talent with a legendary work ethic and a punishing training ritual of 5 am starts. Countless hours of long, unbroken swimming of up to 60km a week in solitary union with the black lines of the pool would take Lisa to three Olympic Games: Moscow 1980, Los Angeles 1984, and Barcelona 1992; three Commonwealth Games; and two World Championships. By the time Lisa called time on her sporting career, she had become the only Australian to hold Commonwealth and Australian records in every stroke except backstroke, and from 50 to 400 metres, a feat that has not been repeated to this day.In this funny, heartbreaking but always life-affirming memoir, Lisa Curry reflects on a life well lived and the experiences that shaped her: swimming, family, marriage, divorce, and love found again. It is a powerful story of resilience, of highs and lows, and of starting out and starting again.",
  "genres": [
    "Nonfiction",
    "Book Club",
    "Audiobook",
    "Biography",
    "Womens",
    "Biography Memoir"
  ],
  "author": "Lisa Curry",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/59684890-lisa"
}