{
  "title": "Another Chance: A Pale Rider Time Travel, Alternate History Book",
  "description": "Jack Reacher meets the American Revolution in this exhilarating time travel alternate history series! (updated cover!)Thomas Nelson has traveled back in time to help George Washington survive the beginning of the American Revolution and change the course of history for the better. And he accomplishes that mighty task.But he’s not finished.Instead of riding off into anonymity to live with the woman he’s fallen in love with in 1777, General Washington has a request for Thomas, the Pale Rider, one that would alter the outcome of the war for the better. The French, and their support of the colonists, is at stake.If the French support England in the war, then the colonists have lost the war before it’s barely begun. But if they can convince the French to send money and ships to aid the colonists instead, as Lafayette believes they will, then the tides could easily turn in the colonists’ favor.To accomplish this, with a new rank as Major and command of a ship under Captain John Paul Jones, Thomas follows Washington’s directive to do the impossible – assassinate the man who has King George’s ear and is advising the King to stop the French support of the colonies.If Thomas can do this, then French support for the colonists is assured.If . . .Never one to back down from the impossible, Thomas takes on this charge, overcomes insurmountable obstacles, and sails to England. With the help of Lafayette and a few other notable and influential men, he sets his sights on sneaking into Windsor Place to assassinate the King’s closest adviser.Can the Thomas, the elusive Pale Rider, pull off the impossible again, and set the American Revolution on a course for victory?Continue the exciting adventure with Another Chance, the sweeping Alternative American History Time Travel Novel today! Another Chance is the second book in the Second Chance series, an alternate American Revolutionary War retelling. For fans of AG Riddle, Andrew Hastie, and Ed Nelson! If you like American history, time travel, and alternate historical fiction, then discover Another Chance today!",
  "genres": [],
  "author": "Michael Roberts",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/59682903-another-chance"
}