{
  "title": "Yellow Blue Bus Means I Love You",
  "description": "The night at the weekly dance in the Old Gym, she came up to him with a can of what he thought at the time was Coke, lifted her elbows slightly, and said, \"Ya lyublyu vas.\" In case you don't speak Russian, it means I love you. That night at the weekly dance in the Old Gym she came up to him with a can of what he thought at the time was Coke, lifted her elbows slightly, and said, \"Ya lyublyu vas.\" In case you don't speak Russian, it means I love you. In this poignant novel, a young man discovers the secrets of first love, sex, and heartbreak at an exclusive New England boarding school. Four years after moving to the United States from Russia, Timur Vorobyov is awarded a scholarship to a prestigious New England boarding school, an American dream come true for Tim's parents. But Aviary Prep becomes a nightmare of alienation until rich, beautiful Phoebe Sayornis shows more than a passing interest in him at a school dance, and he experiences both love and sex for the first time.That night at the weekly dance in the Old Gym she came up to him with a can of what he thought at the time was Coke, lifted her elbows slightly, and said, \"Ya lyublyu vas.\" In case you don't speak Russian, it means I love you. In this poignant novel, a young man discovers the secrets of first love, sex, and heartbreak at an exclusive New England boarding school. Four years after moving to the United States from Russia, Timur Vorobyov is awarded a scholarship to a prestigious New England boarding school, an American dream come true for Tim's parents. But Aviary Prep becomes a nightmare of alienation until rich, beautiful Phoebe Sayornis shows more than a passing interest in him at a school dance, and he experiences both love and sex for the first time.",
  "genres": [
    "Fiction",
    "Young Adult"
  ],
  "author": "Morse Hamilton",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/596768.Yellow_Blue_Bus_Means_I_Love_You"
}