{
  "title": "Flawed Creatures: A Monster Romance",
  "description": "Some creatures are fatally flawed. I'm a thrill-seeker, a gambler, and a thief--playing whim to my Greed. However, my sins aren't what I have to fight right now... it's theirs.Three men deemed too powerful and wrong to let live by our Council. They're too devious, too strong, too evil. An unhinged crazy incubus, an obsessive shape-shifting beast, and the Dullahan himself--scars, steed, and all.Tricked, captured, captive. They plan to use my power, wield it as their own. I'm their golden ticket, their pot of gold. Kings, gods, and creatures have tried to use my kind and these three monsters are exactly the same. They know that when luck is on your side, the odds are never even.There's an unstoppable hitman on their back and they need something that gives them the upper hand, a guarantee of success. And that something is me.Author Notes: This is a STAND-ALONE urban fantasy romance with lots of love all around.Additional Content Information: \"MMMF\" polyam relationships, headless horseman “decapitation” during sexy/nonsexy times, talk of the consumption of human flesh, obsession/stalking, dubcon, incubus, villains, violence/light gore, teased vore, zombies, gambling/addiction, magic drug use, a whip made from a human spine, PIV/ANAL/ETC, comfortable confinement, complicated people & their messy relationships, biting, light somniphilia, murder, forced submission, three ways, orgies, magic lust, guns, bombs, size difference, pierced cock, scarred hero, unique peen, gods, MF/MM/MMF/MMM/MMMF scenes, rope restraints, chains, pleasure dom, dream sex, adult swing, car racing, shifted sex, Vague ex-guardian x adult ward relationship, DP, boat explosions",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Paranormal",
    "Monsters",
    "Dark",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "Beatrix Hollow",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/59685115-flawed-creatures"
}