{
  "title": "Notes from the Underwire: Adventures from My Awkward and Lovely Life",
  "description": "\"Erma Bombeck with an edge.\"-- U.S.A. Today \"Quinn Cummings is a master story-teller and her book is nothing short of delightful. Her insights into topics like celebrity, parenting, and cats with a taste for homicide are pithy and uproarious and not to be missed. Notes from the Underwire is charming, hilarious, and just snarky enough to be ultimately satisfying.\"--Jen Lancaster, bestselling author of Bitter is the New Black and Such a Pretty Fat \"I hadn't laughed out loud while reading a book for years, but Quinn Cumming's struggles nearly did me in. Although she describes herself as a woman who constantly blurts out exactly the wrong thing, she says everything exactly right in the brilliantly overwrought Notes from the Underwire.\"--Bob Tarte, author of Enslaved by Ducks and Fowl Weather Meet Quinn Cummings. Former child star, mother, and modern woman, she just wants to be a good person. Quinn grew up in Los Angeles, a city whose patron saint would be a sixteen year-old with a gold card and two trips to rehab under her belt. Quinn does crossword puzzles, eats lentils without being forced, and longs to wear a scarf without looking like a Camp Fire Girl. And she tries very hard to be the Adult--the one everybody calls for a ride to the airport--but somehow she always comes up short. In Notes from the Underwire , Quinn's smart and hilarious debut, she tackles the domestic and the delightfully absurd, proving that all too-often they're one and the same. From fighting off a catnip-addled cat to mortal conflict with a sewing machine, Quinn provides insight into her often chaotic, seldom-perfect universe--a universe made even less perfect when the goofy smile of past celebrity shows its occasional fang. The book, like the author herself, is good hearted, keenly observant, and blisteringly funny. In other words, really good company.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Essays",
    "Unfinished"
  ],
  "author": "Quinn Cummings",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/5966605-notes-from-the-underwire"
}