{
  "title": "First Lensman: Annotated Edition, Includes Triplanetary (Revised)",
  "description": "If you are looking for paperback editions of EE 'Doc' Smith's Lensman series, please stop scrolling and see if mine are right for you. You'll be glad you did. Since the Lensman series has gone into the public domain there are a lot of enterprising folks out there taking the manuscripts and generating copies, mainly eBooks for re-sale that are straight out of Project Gutenburg. Well, nothing wrong with that except those who want to enjoy a quality reading experience are probably going to be disappointed. Maybe just use Project Gutenburg. The books are from another era and their context is different. Arguably the best paperback editions were put out by Panther Science Fiction imprint in the early 1970s. You can still acquire those used, although the supply is finite. Mine are worn out. The original books published in limited hardback by Fantasy Press in the 1950's - I've never even seen those. My solution to this problem of diminishing supply has been to go back and put in the work to publish a clean edition. I am working with Ingram Spark because unlike Amazon they can generate POD with groundwood paper - as close as I could get to trade-paperback paper. Which is what I'm after, I want to deliver the authentic paperback experience like the one I had as a kid in the 1970s. More important, I think, has been giving the stories an edit. I have focused mainly on grammar, not with a heavy hand, but just to improve the flow for a contemporary reader. The manuscripts are formatted in such a way as to use a heavy arsenal of italics, capitalization, capitalization with italics, exclamations, double and triple exclamations, ellipses, dashes, and more. The purpose was clearly to create emphasis and tension, but often it impedes the flow. So these things were revisited. I considered removing all italics completely at one stage - but relented. It is Space Opera after all. I have provided annotations as a value-add proposition. These are not necessarily scholastic - some are - but mainly my thoughts about how certain aspects of the stories reflect in other works, stuff like Star Trek, which owes a heavy debt. The thing about these stories is they come at the beginning of classic science fiction and had a huge impact - certainly on my generation - and others as well. So, we know how science fiction \"worked out\". Smith did not know that. He had no idea. For all he knew his stories could easily have been forgotten long ago, but they weren't. That's because in the main, they're still worth reading. But the books need to be accessible in a form that does them justice. The Panther books were printed in Linotype Times and Linotype Plantin. The closest matching font available to me is Palatino Linotype, but it looks quite clean in a 9-point face. With respect to the cover art, well, I don't have the wherewithal to do something of the unforgettable quality of Chris Foss. But the Hubble Space Telescope has provided something that EE 'Doc' Smith himself would have found amazing; I am sure. I became aware of the renewed popularity of the Science Fiction \"Space Opera\" genre when I uploaded a YouTube video about reading the E.E. 'Doc' Smith Lensman series - and discovered it was my most popular video. It still gets daily views after two years. So evidently there is a market for the \"classic\" period of science fiction in general, and Lensman series, and good reasons why people what to go back and re-read something they experienced as a young person, or to discover for the first time what it's all about. But they cannot do that without a quality product. Enjoy this voyage back to the classic age of science fiction. ... Then word came to Earth, inexplicably but 'GO TO ARISIA!'...",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Audiobook",
    "Classics",
    "Speculative Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "E.E. \"Doc\" Smith",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/59679804-first-lensman"
}