{
  "title": "The Blood of Lambs: A Former Terrorist's Memoir of Death and Redemption",
  "description": "Memoirs of a Terrorist reveals the true inside story of the life and mindset of a radical muslim terrorist who finally came to renounce his murderous mission and embrace freedom.Some radical Muslims believe that non-Muslims who refuse to convert must die. Memoirs of a Terrorist is the true account of the life of such a terrorist who has since renounced his deadly participation in jihad, or “holy war.” His memoir conveys an urgent message to Americans to wake up to the dangers of the terrorists who are still executing their harmful and destructive schemes.Kamal Saleem was born under a different name into a Sunni Muslim family in Lebanon. From a young age he was taught that the loftiest accomplishment he could achieve in life was to be martyred while killing infidels, namely Christians, Jews, and Americans. At age seven, he was recruited by the Muslim Brotherhood and entered an assault camp where members of al-Assifa, the armed branch of Fatah, trained for terror missions against Israel. After years of training, Saleem operatedin successful terror campaigns funded by the Muslim Brotherhood, the Palestinian Liberation Organization, and wealthy oil sheikhs. He infiltrated the United States with the sole purpose of converting others to radical Islam.However, a life-changing event caused him to reevaluate his worldview. Kamal came to know three kind Christian men, and through them he saw the love of God—eventually coming to know their God as well. As a result of their love andsacrificial giving, Kamal acknowledged his need for Christ as Savior. Memoirs of a Terrorist is his riveting story that attests to the power of love and freedom.",
  "genres": [
    "Biography",
    "Terrorism",
    "Islam",
    "Nonfiction",
    "Christian",
    "History",
    "Memoir"
  ],
  "author": "Kamal Saleem",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/5968512-the-blood-of-lambs"
}