{
  "title": "Rex: A Mother, Her Autistic Child, and the Music that Transformed Their Lives",
  "description": "The inspiring story of Rex, a boy who is not only blind and autistic, but who also happens to be a musical savant.How can an 11-year old boy hear a Mozart fantasy for the first time and play it back note-for-note perfectly-but struggle to navigate the familiar surroundings of his own home? Cathleen Lewis says her son Rex's laugh of total abandon is the single most joyous sound anyone could hear, but his tortured aversion to touch and sound breaks her heart and makes her wonder what God could have had in mind. In this book she shares the mystery of Rex and the highs, lows, hopes, dreams, joy, sorrows, and faith she has journeyed through with him.Endorsements\"This memoir documents a musical savant in a way we have not seen before, allowing us to reconsider the limits we place on people with disabilities. Highly recommended for all public libraries and academic libraries with autism and special needs collections.\" -- Library Journal, 11/25/2008\"Two of the most extraordinary and uplifting people I have ever known. Their story shows the amazingly moving struggle and success that proves love and faith can achieve miracles.\" -- Jane Seymour, actress, artist, author, and entrepreneur\"The remarkable story of a mother's love and a child's indomitable spirit, told in a writer's style that riveted me to the page, is singularly the most important work ever written on the relationship between a parent and a child with disability. For me, as a person who happens to be blind, the experience of reading Rex was an eye-opener I will never forget. Bravo, Cathleen! Bravo, Rex. Your work and your lives will forever change the future of disability in America. -- Tom Sullivan, author of Adventures in Darkness and Together",
  "genres": [
    "Nonfiction",
    "Autistic Spectrum Disorder",
    "Memoir",
    "Biography",
    "Music",
    "Autobiography",
    "Parenting"
  ],
  "author": "Cathleen Lewis",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/5968060-rex"
}