{
  "title": "Hollywood Ending: Harvey Weinstein and the Culture of Silence",
  "description": "Twenty years ago, Ken Auletta wrote one of the iconic New Yorker profiles for which he is famous, of the Hollywood mogul Harvey Weinstein, who was then at the height of his powers. The profile created waves for exposing how volatile, even violent, Weinstein was to his employees and collaborators. But there was a much darker story that was just out of reach: rumors had long swirled that Weinstein was a sexual predator, but no one was willing to go on the record, and in the end Auletta and the magazine concluded they couldn’t close the case. But the story always nagged at him, and many years later, he was able to share his reporting notes and all that he knew with Ronan Farrow, and to cheer him along with Jodi Kantor and Megan Twohey as all of them broke pioneering stories and wrote bestselling books.But the story continued nagging him. Farrow, Twohey, and Kantor did a brilliant job of exposing the trail of assaults and their cover-up, but the larger questions remained: what was at the root of Weinstein’s monstrousness? How and why was it never checked? How does a man run the day-to-day operations of a company with hundreds of employees and revenues in the hundreds of millions of dollars and at the same time live a shadow life of sexual predation without ever being caught, for years and years? How much is this a story about Harvey Weinstein, and how much is this a story about Hollywood and power?Ken Auletta has spent the last three years in pursuit of the answers, uncovering the mysteries beneath a film career unparalleled in Hollywood history for its combination of extraordinary business and creative success and a personal brutality and viciousness that left a trail of ruined lives in its wake. Hollywood Ending is an unflinching examination of Weinstein’s life and career. Not simply a prosecutor’s litany of crimes, it embeds them in the context of his overall business, his failures but also his outsized successes. To understand how Weinstein could behave as he did, we have to understand the power he wielded. Iconic film stars, Miramax employees and board members, old friends and family, and even the person who knew him best—Harvey’s brother Bob—all talked to Auletta at length. The result is not simply the portrait of a predator, it is a portrait of the power that allowed Weinstein to operate with such impunity for so many years, the spider web in which his victims found themselves trapped. To face the truth of the Weinstein story is to understand how many other spider webs no doubt still remain.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Biography",
    "Crime",
    "Audiobook",
    "History",
    "Business"
  ],
  "author": "Ken Auletta",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/59691392-hollywood-ending"
}