{
  "title": "Unruly Women: The Politics of Social and Sexual Control in the Old South (Gender and American Culture)",
  "description": "In this richly detailed and imaginatively researched study, Victoria Bynum investigates \"unruly\" women in central North Carolina before and during the Civil War. Analyzing the complex and interrelated impact of gender, race, class, and region on the lives of black and white women, she shows how their diverse experiences and behavior reflected and influenced the changing social order and political economy of the state and region. Her work expands our knowledge of black and white women by studying them outside the plantation setting.Bynum searched local and state court records, public documents, and manuscript collections to locate and document the lives of these otherwise ordinary, obscure women. Some appeared in court as abused, sometimes abusive, wives, as victims and sometimes perpetrators of violent assaults, or as participants in ilicit, interracial relationships. During the Civil War, women freqently were cited for theft, trespassing, or rioting, usually in an effort to gain goods made scarce by war. Some women were charged with harboring evaders or deserters of the Confederacy, an act that reflected their conviction that the Confederacy was destroying them.These politically powerless unruly women threatened to disrupt the underlying social structure of the Old South, which depended on the services and cooperation of all women. Bynum examines the effects of women's social and sexual behavior on the dominant society and shows the ways in which power flowed between private and public spheres. Whether wives or unmarried, enslaved or free, women were active agents of the society's ordering and dissolution.",
  "genres": [
    "History",
    "American History",
    "Feminism",
    "Gender",
    "Womens",
    "Sexuality",
    "Politics"
  ],
  "author": "Victoria E. Bynum",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/1283472.Unruly_Women"
}