{
  "title": "United States of Fear: How America Fell Victim to a Mass Delusional Psychosis",
  "description": "Psychiatrist Mark McDonald diagnoses our country as suffering from a mass delusional psychosis, driven by a pandemic of fear in response to COVID-19.As the COVID-19 pandemic unfolded, LA-based psychiatrist Mark McDonald grew increasingly concerned by the negative mental health effects he witnessed among his patients—and Americans nationwide. These negative effects—stress, anxiety, depression, addiction, domestic violence, suicidal ideation—were all directly traceable to the climate of fear being stoked by public health authorities and irresponsibly amplified by national media. These fears in turn drove a hysterical overreaction from government in the form of draconian lockdowns and mask and vaccine mandates of questionable value. But the fear did not abate and quickly took on a life of its own, becoming an unstoppable force in all our lives. At last McDonald began to speak out, explaining that America is actually suffering from two a viral one and a psychological one, a “pandemic of fear” that is in many ways more dangerous and damaging than the virus itself. Rooted in the natural anxieties of women on behalf of their children and families, inflamed and amplified by sensationalistic media, and driven over the top by hamfisted authoritarian measures from those in power, McDonald diagnoses the country at large as suffering from a mass delusional psychosis. This is not a metaphor. The malady itself is very real. Whether we can regain our collective sanity as a society remains to be seen.“Mark McDonald has been a consistent voice of calm and reasoned thinking about the terrible effects of heavy-handed lockdowns on the nation's mental health. The toxic wave of fear produced by the media, public health experts, and government officials may turn out to be more dangerous and deadly than the pandemic itself. Dr. McDonald's illuminating book is must reading for all Americans concerned about the future of our country.”—Simone Gold M.D., J.D., Founder, America's Frontline Doctors“This book is a brilliant encapsulation of the dystopian world in which we have all been living since January 2020. Dr. McDonald writes with great clarity and substance. He accurately diagnoses that which is ailing our country. This book is accurate, eye opening, and entertaining - don't plan on putting it down until you are finished turning the pages. Purchase an extra copy to give away to your fear-based friends and family.”—Dr. Jeffrey Barke, author of A Physician’s Take on the Exaggerated Fear of the Coronavirus“A tour de force of scientific diagnosis, logic, detail and delightful/terrifying anecdote. There are places where (miraculously, given the subject) you made me laugh. Best of all is your notion of a pandemic of fear. It's concise and exact—and therefore...elegant.”—Will Swaim, President, California Policy Center",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Politics",
    "Society",
    "Philosophy",
    "Health"
  ],
  "author": "Mark   McDonald",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/59686636-united-states-of-fear"
}