{
  "title": "The Games that Break Us",
  "description": "Rule #1: Don’t fuck with la Jefa.Rule #2: Don’t get caught.Rule #3, and most importantly: DON’T fall in love with your boss—especially when he’s the faceless, elusive mastermind behind the international and highly covert organization known as the Upper Echelon.Arcángel might have chosen to forego some of that anonymity when it came to me, but the man still had secrets he refused to share. Secrets that came back to haunt us when he suddenly wanted to whisk me away and rescind the terms of our “no strings attached” relationship for something more.I considered it, warring between rationality and my heart’s desires.Until the Feds stepped in and I found myself trapped in tight, shiny cuffs.Now, I’m paying the price, rotting away at the hands of the judicial system and facing possible deportation after serving his time. After all these years, Ángel should be nothing more than a ghost from my past, and yet he’s ever-present, popping up at the most random and inopportune times.My heart can’t take much more of this maddening game, but fate seems to have other plans…Enter Andrés Bala, the new CO who can’t keep his eyes off me. I shouldn’t encourage him, knowing damn well anything between us is considered forbidden, illegal, but there’s this inexplicable pull between us neither one of us can ignore—and being bad always did taste so much sweeter.The question now is: despite Andrés vowing to wait for me, can he handle la Jefa and all of her baggage outside the confines of her cage, or are we doomed to crumble before I even step foot into freedom?AUTHOR NOTE: The Games that Break Us was originally published as \"Birdy: Upper Echelon #1\" in 2020. It has been revised, rewritten to a certain extent, and contains over 25k in new content.",
  "genres": [
    "Dark Romance",
    "Romance",
    "Contemporary",
    "Suspense",
    "Mafia Romance"
  ],
  "author": "Dee Garcia",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/59696176-the-games-that-break-us"
}