{
  "title": "After the Rain",
  "description": "RYLANDI planned to avoid Sycamore Mountain for a lot longer than ten years, but when my dad dies, I have to go back. Hammond Whiskey Distillery isn’t the only thing waiting for me in my hometown.Magnolia’s the girl I always wanted and could never have because she’s my sister’s best friend and too young for me. Now, she’s all grown up and even more captivating than I remember. The fire in her eyes tells me I have a lot of work ahead of me to make her mine.I hope I’m not too late and have enough time to settle in and get through the annual Earth Day Fair. Her devotion to my family’s distillery is humbling. I should hand it over to her; maybe I will after her last name is Hammond. She thinks I’m not going to stay, but this time I’m not running. I’ll get her in my arms, in my life, permanently…after the rain.MAGNOLIAPining for a man who I never thought would come home has left me bitter and sad, no matter how much I try and hold onto the sunshine. I don’t know why he’s stayed away so long, but I can only hope it’s not because of me.I’ve given so many years to Hammond Whiskey Distillery trying to feel closer to Ryland, but time still passes and I’m still alone. No one was prepared for Mr. Hammond’s death, least of all me. It’s the only reason Ryland comes back to Sycamore Mountain, but who is to say he’ll stay?Seeing him again reminds me that pieces of my heart are still jagged even though Harmony, my best friend and Ryland’s sister, tried to help me smooth them out over the years. Working together gives me hope I’m not sure I can trust. Maybe a little rain will wash away the past. When the clouds part, I don’t know what path I’ll be on, but Ryland will know he’s not the only one who has changed.**If you like alpha heroes and an insta-love story that is sweet but isn’t necessarily simple, then this is for you. No cheating with a guaranteed HEA. It is a standalone but is related to my Denver Family series (Banks Ink., Suburban Outcasts and Higgins Security). Meet Ryland in Finding Luck Again (Get Lucky Series)—more information on that coming soon.The MAN OF THE MONTH CLUB is a steamy small-town collection featuring a new hottie (or two!) every month. In 2022, escape to Sycamore Mountain, North Carolina and celebrate ALL the holidays with your favorite group of romance authors and their delicious mountain men. Can’t wait to see you there!",
  "genres": [
    "Contemporary",
    "Romance",
    "Workplace Romance"
  ],
  "author": "Ember Davis",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/59690218-after-the-rain"
}