{
  "title": "Brother Alive",
  "description": "An astonishing debut novel about family, sexuality, and capitalist systems of control, following three adopted brothers who live above a mosque in Staten Island with their imam fatherIn 1990, three boys are born, unrelated but intertwined by circumstance: Dayo, Iseul, and Youssef. They are adopted as infants and live in a shared bedroom perched atop a mosque in one of Staten Island’s most diverse and precarious neighborhoods, Coolidge. The three boys are an inseparable if conspicuous trio: Dayo is of Nigerian origin, Iseul is Korean, and Youssef indeterminately Middle Eastern. Nevertheless, Youssef is keeping a secret: he sees a hallucinatory double, an imaginary friend who seems absolutely real, a shapeshifting familiar he calls Brother.The boys’ adoptive father, Imam Salim, is known for his radical sermons, but at home he is often absent, spending long evenings in his study with whiskey-laced coffee, writing letters to his former compatriots back in Saudi Arabia. Like Youssef, he too has secrets, including the cause of his failing health and the truth about what happened to the boys’ parents. When Imam Salim’s path takes him back to Saudi Arabia, the boys will be forced to follow. There they will be captivated by an opulent, almost futuristic world, a linear city that seems to offer a more sustainable modernity than that of the West. But they will have to change if they want to survive in this new world, and the arrival of a creature as powerful as Brother will not go unnoticed.Stylistically brilliant and intellectually acute, Brother Alive is a remarkable novel of family, capitalism, power, sexuality, and the possibility of reunion for those who are broken.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "LGBT",
    "Queer",
    "Magical Realism",
    "Novels"
  ],
  "author": "Zain  Khalid",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/59695076-brother-alive"
}