{
  "title": "Between Wrath and Mercy",
  "description": "A mother will do anything to save her child, no matter the cost.After her daughter is kidnapped, Emmeline Highclere—a thirty-four-year-old mother living in isolation with memories and grief her only companion—must do everything in her limited power and divine abilities to get the girl back.Emmeline believes that her daughter, Elora, is the Beloved—the conduit with goddess-granted divine abilities prophesied to bring peace to the Three Kingdoms. Because the last person thought to be the Beloved was brutally murdered by the enemy kingdom of Folterra, Emmeline has dedicated the last sixteen years to hiding her daughter and keeping her safe. When Elora is kidnapped by a Folterran prince, Emmeline must leave her place of hiding, resolving to do anything to rescue her daughter. But to have any chance against those who took the girl, Emmeline must call upon one of the most powerful conduits in the Three Kingdoms, the Crown Prince of Vesta—the man who broke her heart—and hope he helps her despite their estrangement.With the weight of his father’s impending death hanging over his head, Crown Prince Rainier has begun to make moves to prove his dedication to assume the role of king. When he is visiting the estate that was once a second home to him, the woman who has long haunted his dreams and consumed his thoughts appears before him, asking for his help to find the child she had with another man. Now, he must decide: does he drop what he is doing to help Emmeline, or does he maintain his unwavering duty to the Crown?Now, Emmeline and Rainier must work together to find the Beloved—to save the girl from the Folterrans and fulfill the prophecy of peace—while they both battle feelings of remorse and heartbreak, trying to ignore the heated desire and simmering attraction between them that never left.From relative isolation to the capital city of Vesta and onwards to Folterra, Emmeline must find out exactly where her daughter has been taken—seeking out help along the way—and bring her home before it is too late.",
  "genres": [
    "Fantasy",
    "Fantasy Romance",
    "Romance",
    "Romantasy",
    "Fae",
    "Adult",
    "Magic"
  ],
  "author": "Jess Wisecup",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/59692061-between-wrath-and-mercy"
}