{
  "title": "The Blue Sweater: Bridging the Gap Between Rich and Poor in an Interconnected World",
  "description": "For the first 5,000 copies of The Blue Sweater purchased, a $15 donation per book will be made to Acumen Fund, a nonprofit that invests in transformative businesses to solve the problems of poverty.The Blue Sweater is the inspiring story of a woman who left a career in international banking to spend her life on a quest to understand global poverty and find powerful new ways of tackling it. It all started back home in Virginia, with the blue sweater, a gift that quickly became her prized possession―until the day she outgrew it and gave it away to Goodwill. Eleven years later in Africa, she spotted a young boy wearing that very sweater, with her name still on the tag inside. That the sweater had made its trek all the way to Rwanda was ample evidence, she thought, of how we are all connected, how our actions―and inaction―touch people every day across the globe, people we may never know or meet.From her first stumbling efforts as a young idealist venturing forth in Africa to the creation of the trailblazing organization she runs today, Novogratz tells gripping stories with unforgettable characters―women dancing in a Nairobi slum, unwed mothers starting a bakery, courageous survivors of the Rwandan genocide, entrepreneurs building services for the poor against impossible odds.She shows, in ways both hilarious and heartbreaking, how traditional charity often fails, but how a new form of philanthropic investing called \"patient capital\" can help make people self-sufficient and can change millions of lives. More than just an autobiography or a how-to guide to addressing poverty, The Blue Sweater is a call to action that challenges us to grant dignity to the poor and to rethink our engagement with the world.",
  "genres": [
    "Nonfiction",
    "Africa",
    "Memoir",
    "Economics",
    "Business",
    "Biography",
    "Social Justice"
  ],
  "author": "Jacqueline Novogratz",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/5969770-the-blue-sweater"
}