{
  "title": "The Rebound",
  "description": "A newly single girl. A tall dark handsome stranger. What could go wrong?It’s 7 a.m. on a Monday morning and Abby Reynolds isn’t where she wants to be. She wants to be in her beautiful loft apartment in Manhattan, drinking a coffee with her fiancé.Instead, she’s heading back to the childhood home in rural Ireland she swore she’d never return to, with some big old secrets. Namely that she’s suddenly found herself unemployed, homeless, and absolutely 100% single.She’s feeling all out of luck. Until the first person she meets after she touches down is an absurdly hot guy called Luke, who offers her a lift home. Gazing deep into his sparkling emerald-green eyes, Abby knows instantly that he’s exactly what she needs to take her mind off everything. The perfect rebound.It’s a flawless plan. Until the next day, when Abby realizes who he actually is. Not just a stranger. He is, in fact, Luke Bailey, aka the boy next door. Luke Bailey who—so help her God—she’s pretty sure she once shared baths with, back when they were kids. Not that she can allow herself to imagine him in a bath now, not without blushing from head to foot.And judging by the smirk on his face, the same Luke Bailey who’s known exactly who she was the whole time… And who, like everyone in the village, still thinks she’s a high-flying New Yorker… who’s getting married next year.Abby is certain getting under Luke will help her get over her ex. But the truth is stopping her. Can she admit to everyone back home that she’s single and has lost everything? Because, if she wants the boy next door, she may just have to…The perfect feel-good romantic comedy that will make you laugh until you cry and fall completely in love. Fans of Sophie Kinsella, Marian Keyes, and Emily Henry won’t be able to put this down!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Fiction",
    "Friends To Lovers",
    "Ireland"
  ],
  "author": "Catherine  Walsh",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/59688701-the-rebound"
}