{
  "title": "Endless Referrals: Network Your Everyday Contacts into Sales",
  "description": "The definitive guide to turning casual contacts into solid sales opportunitiesIn this fully revised edition, Bob Burg builds on his proven relationship-building principles to bring even more clients to your door and helps you attract only those who are interested in what you sell. He shows how to maximize your daily contacts, utilize your tools both online and off, leverage your relationships, and generate ongoing sales opportunities. \"If you're serious about your sales career, whether you are selling a product, service, or yourself, master the contents of this book and you will practically guarantee your future success.\"             --Tom Hopkins, author of How to Master the Art of Selling \"Bob Burg has long been the authority on connecting with clients and building win-win relationships. Endless Referrals should be required reading for sales professionals and entrepreneurs everywhere.\" -- Gary Keller, Founder and Chairman of the Board of Keller Williams Realty Intl. and author of The Millionaire Real Estate Investor \"I've found that acquiring business is the toughest challenge for professional services providers. Thankfully, Bob Burg provides pragmatic and effective techniques to smash that challenge to bits, whether using mail, phone, email, or a polite tap on the shoulder.\" --Alan Weiss, Ph.D., author Million Dollar Consulting \"Bob Burg opens the floodgates to Fort Knox with this book. I like the simple, easy to understand, practical way he outlines the exact way to find endless referrals. A treasure.\"             --Dottie Walters, author of Speak & Grow Rich \"A no-nonsense approach to building your business through relationships.\"             --Jane Applegate, syndicated Los Angeles Times columnist",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Buisness",
    "Communication",
    "Leadership"
  ],
  "author": "Bob Burg",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/597151.Endless_Referrals"
}