{
  "title": "This Republic of Suffering: Death and the American Civil War",
  "description": "An illuminating study of the American struggle to comprehend the meaning and practicalities of death in the face of the unprecedented carnage of the Civil War. During the war, approximately 620,000 soldiers lost their lives. An equivalent proportion of today's population would be six million. This Republic of Suffering explores the impact of this enormous death toll from every angle: material, political, intellectual, and spiritual. The eminent historian Drew Gilpin Faust delineates the ways death changed not only individual lives but the life of the nation and its understanding of the rights and responsibilities of citizenship. She describes how survivors mourned and how a deeply religious culture struggled to reconcile the slaughter with its belief in a benevolent God, pondered who should die and under what circumstances, and reconceived its understanding of life after death. Faust details the logistical challenges involved when thousands were left dead, many with their identities unknown, on the fields of places like Bull Run, Shiloh, Antietam, and Gettysburg. She chronicles the efforts to identify, reclaim, preserve, and bury battlefield dead, the resulting rise of undertaking as a profession, the first widespread use of embalming, the gradual emergence of military graves registration procedures, the development of a federal system of national cemeteries for Union dead, and the creation of private cemeteries in the South that contributed to the cult of the Lost Cause. She shows, too, how the war victimized civilians through violence that extended beyond battlefields-from disease, displacement, hardships, shortages, emotional wounds, and conflicts connected to the disintegration of slavery.",
  "genres": [
    "History",
    "Nonfiction",
    "Civil War",
    "American History",
    "War",
    "American Civil War",
    "Death"
  ],
  "author": "Drew Gilpin Faust",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1283566.This_Republic_of_Suffering"
}