{
  "title": "Knotty or Nice",
  "description": "Did you make his list?Nick Kringle is one of the most inventive designers of adult toys. He's also a demanding taskmaster and wants to work through the holidays to have his newest creation ready to hit the store shelves. It's just his luck when he finds one lone toy reviewer left lingering in the break room before the Christmas Eve holiday party. If this hot little bombshell gives his new toy a glowing review, he knows it's ready to go into production.Most people might think working as an adult toy reviewer is a dream job. But Muriel Geist is just faking her way through it. Still, she's shocked when she's denied the holiday bonus due to a poor performance review from her supervisor at Kringle Knotty or Nice Intimates. She can't go home to her younger siblings, empty-handed for another Christmas. Luckily, when she turns to head out the door, she finds she's standing face to face with tall, dark, and hot Mr. Saint Nick, himself.Nick offers Muri triple the Christmas bonus to do a little overtime with his newest creation. For that amount of money, Muri's prepared to write him a glowing review, take the money and run to the department store before it closes. Yet to her horror, her hot boss enters the review lab with her, insisting on instant feedback. It doesn't take Nick Kringle long to figure out Muri's deception. But the fact that she fakes her… reviews… intrigues him and makes him want to show her that not only can his toys give her pleasure, but he can as well.Welcome to a filthy dirty Christmas! Forget sugar and spice and everything nice … this year we want to show off our naughty side. Taboo, dangerous, and over-the-top, we’re bringing you everything you were too scared to ask Santa for.**Don’t worry, loves, these are still packed with the heroes you crave and the HEA’s you deserve!",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Novella",
    "Erotica",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Ines Johnson",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/59710291-knotty-or-nice"
}