{
  "title": "The Giants of Stonehenge and Ancient Britain",
  "description": "Stories of giants being involved in the construction of megalithic sites, earthworks and other ancient monuments have been alive in the consciousness of the British for millennia. Legends and creation stories hark back to an earlier age of elemental beings, high magic and giant kings ruling the land. Religious documents, medieval chronicles, oral traditions and origin stories all recount converging tales of giants being an integral part of the founding of the British Isles. Giant effigies are still paraded around many cities and towns, keeping this ancient memory alive. Mystics, sages and esoteric sources all speak of giants as a literal reality, often originating in a lost sunken realm off the coast of Ireland. Even Stonehenge’s creation is attributed to remarkably tall and powerful builders. These were not only giant in stature, but also giants in intelligence, skill and wisdom. Collating hundreds of historical accounts of massive bones and skeletons being found in the vicinity of sites such as Stonehenge, adds some credence to the idea that age-old myths encoded detailed histories and insights from many thousands of years ago. These were often linked with the secret arts, forgotten sciences and magic from a fabled “Golden Age.\" The once-lost epic annals of Ireland, secret Scottish archives, old manuscripts of Wales and Druidic traditions of England have revealed a lost timeline, a missing chapter in human history that provides evidence of giant human beings inhabiting, ruling and building the megalithic master works of Albion. The reality of giants existing in prehistoric times is put under the microscope in this book, with the investigation of obscure newspaper accounts, antiquarian diaries, archaeological reports, local history records, newly-translated ancient texts, academic papers, and written evidence from hundreds of sources going back over a 2000 year period. It seems that the giants were also ‘geomancers’, having a mastery of surveying, astronomy and landscape knowledge to an extremely high degree. Many were remembered as high-kings and rulers of the country, often inhabiting mountain-tops or hillforts. The origins of all four countries of the British Isles are intimately connected to ruling giants. We hope this book can bring this obscure but fascinating story to life and highlight what a truly immense mystery this is.",
  "genres": [],
  "author": "Hugh Newman",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/59708074-the-giants-of-stonehenge-and-ancient-britain"
}