{
  "title": "Relative Justice",
  "description": "Unabridged, 11 hours 22 minutes__________An impossible son. An impossible murder. The honeymoon is definitely over. When Emery Hazard and his husband, John-Henry Somerset, arrive home from their honeymoon, they’re shocked (understatement of the year) to find a boy waiting for them on their doorstep. Colt, fifteen and eager to pick a fight, claims to be Hazard’s son. It’s almost a relief, then, for Hazard and Somers to be called out to assist the Dore County Sheriff’s Department with what seems to be an impossible murder: a man has been found stabbed to death in a stretch of woods, and the only set of footprints in the soft ground belong to the victim. The more Hazard and Somers learn about the dead man, the more confusing the case becomes. While searching his home, they discover a secure room from which several high-end computers have been stolen. A woman makes a daring theft as the house is being secured and escapes with valuable documents. The dead man’s neighbor, who found the body, is obviously lying about how she discovered him. And something very strange is going on with the victim’s sons, who are isolated at school and seem to have found their few friends through the youth group at a local church--and in a close relationship with the hip, young, attractive pastor. An attempt on Colt’s life leaves Hazard’s (possible) son in the hospital. When Hazard and Somers learn that the attack came after Colt tried to investigate the murder on his own, they realize he is now in the killer’s crosshairs, and Hazard and Somers must race to uncover the truth. The results from the paternity test aren’t back yet, but father or not, Emery Hazard isn’t going to let anyone harm a child.",
  "genres": [
    "M M Romance",
    "Mystery",
    "Romance",
    "Crime",
    "Contemporary",
    "LGBT",
    "Suspense"
  ],
  "author": "Gregory Ashe",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/59717457-relative-justice"
}