{
  "title": "Enter Ghost",
  "description": "A bold, evocative new novel from the Sue Kaufman, Betty Trask and Plimpton Prize Award winner Isabella Hammad that follows actress Sonia as she returns to Palestine and takes a role in a West Bank production of HamletAfter years away from her family’s homeland, and reeling from a disastrous love affair, actress Sonia Nasir returns to Haifa to visit her older sister Haneen. This is her first trip back since the second intifada and the deaths of their grandparents: while Haneen made a life here commuting to Tel Aviv to teach at the university, Sonia stayed in London to focus on her acting career and now dissolute marriage. On her return, she finds her relationship to Palestine is fragile, both bone-deep and new.At Haneen’s, Sonia meets the charismatic and candid Mariam, a local director, and finds herself roped into a production of Hamlet in the West Bank. Sonia is soon rehearsing Gertude’s lines in classical Arabic and spending more time in Ramallah than in Haifa, along with a dedicated group of men from all over historic Palestine who, in spite of competing egos and priorities, each want to bring Shakespeare to that side of the wall. As opening night draws closer it becomes clear just how many violent obstacles stand before a troupe of Palestinian actors. Amidst it all, the life Sonia once knew starts to give way to the daunting, exhilarating possibility of finding a new self in her ancestral home.A stunning rendering of present-day Palestine, Enter Ghost is a story of diaspora, displacement, and the connection to be found in family and shared resistance. Timely, thoughtful, and passionate, Isabella Hammad’s highly anticipated second novel is an exquisite feat, an unforgettable story of artistry under occupation.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Historical Fiction",
    "Audiobook",
    "Book Club",
    "Politics"
  ],
  "author": "Isabella Hammad",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/59725231-enter-ghost"
}