{
  "title": "Stolen English",
  "description": "Almost ten years ago Andrea escaped an abusive husband to a life she'd never imagined. Being protected and anonymous, and living on a luxury yacht as crew saved her. It also came with one very bossy, hot, thorn in her side: Head of Security, Evan Roark. But now Andrea has had enough of hiding and letting her past dictate her every move. The problem is Evan is also on her every move and it’s driving her dilly. Even more so because she’s had a massive crush on him that’s now getting a little too intense with him being in her space all the time. He’s always been there, her protector and her beacon, and always looking so damn fine, but she needs to get out and meet more people stat—the attraction is obviously totally situational. However, she hasn’t been with someone in so long, she feels panicked and frigid, and only Evan seems capable of touching her in a way that makes her body crave more rather than shut down. He’d be the perfect practice on this new journey of freedom she’s taken. It’s a pity he’s never given any indication he might be open to that. ... Until he accidentally does.What will it take to have them both give in to what has been there for longer than either of them knew? Unfortunately, it might be that Andrea has painted a target on herself by filing for divorce and a panicked Evan will now not let her out of his sight. Which means he’s having to come to terms with the fact that his feelings for her run deeper than he ever dared admit. And he’s having to face the inevitable—she’s going to make him break all of his rules, break down all of his walls, and tell her a truth he’s been hiding for almost ten years. And in the process, probably break his own heart. Set against the back drop of Southern France, in and around a tiny village reminiscent of Belle’s in Beauty and The Beast, rather than out at sea, STOLEN ENGLISH, is about Andrea, with Evan’s help, trying to recapture a life that was stolen from her a long time ago, a life he may know more about than he’s letting on.",
  "genres": [
    "Romance",
    "Contemporary",
    "Friends To Lovers",
    "Contemporary Romance",
    "Forced Proximity",
    "Audiobook",
    "Slow Burn"
  ],
  "author": "Natasha Boyd",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/59732034-stolen-english"
}