{
  "title": "Marriage and the Family in the Middle Ages",
  "description": "From bestselling historians Frances and Joseph Gies, authors of the classic “Medieval Life” series, comes this compelling, lucid, and highly readable account of the family unit as it evolved throughout the Medieval period—reissued for the first time in decades.“Some particular books that I found useful for Game of Thrones and its sequels deserve mention. Life in a Medieval Castle and Life in a Medieval City, both by Joseph and Frances Gies.” —George R. R. Martin, author of Game of ThronesThroughout history, the significance of the family—the basic social unit—has been vital. In Marriage and the Family in the Middle Ages, acclaimed historians Frances and Joseph Gies trace the development of marriage and the family from the medieval era to early modern times. It describes how the Roman and barbarian cultural streams merged under the influence of the Christian church to forge new concepts, customs, laws, and practices. Century by century, the Gies follow the development—sometimes gradual, at other times revolutionary—of significant components in the history of the family including:The basic functions of the family as a production unit, as well as its religious, social, judicial, and educational roles.The shift of marriage from private arrangement between families to public ceremony between individuals, and the adjustments in dowry, bride-price, and counter-dowry.The development of consanguinity rules and incest taboos in church law and lay custom.The peasant family in its varying condition of being free or unfree, poor, middling, or rich.The aristocratic estate, the problem of the younger son, and the disinheritance of daughters.The Black Death and its long-term effects on the family.Sex attitudes and customs: the effects of variations in age of men and women at marriage.The changing physical environment of noble, peasant, and urban families.Arrangements by families for old age and retirement.Expertly researched, master historians Frances and Joseph Gies—whose books were used by George R.R. Martin in his research for Game of Thrones—paint a compelling, detailed portrait of family life and social customs in one of the most riveting eras in history.",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Medieval History",
    "Gender",
    "Historical",
    "Research"
  ],
  "author": "Frances Gies",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/597256.Marriage_and_the_Family_in_the_Middle_Ages"
}