{
  "title": "Simply Mexican: [A Cookbook]",
  "description": "From Chile-Glazed Pork Chops to Dos Leches Flan, Lourdes Castro offers authentic, no-fuss Mexican meals with clean, vibrant flavors that are the essence of great Mexican food.In Simply Mexican , Castro presents authentic recipes that don’t require a fortnight to prepare or extended shopping forays to find rare ingredients. Castro honed her knowledge of traditional south-of-the-border dishes by teaching the fundamentals to adults and children at her Miami cooking school, and now she’s introducing real Mexican fare that works for busy cooks every night of the week.Simply Mexican  features easy-to-prepare, fun-to-eat favorites with big flavors, such as Chicken Enchiladas with Tomatillo Sauce and Crab Tostadas. Once you have mastered the basics, Castro will guide you through more advanced Mexican mainstays such as adobo and mole, and show you how to make the most effortless savory and sweet tamales around. With cooking notes that highlight useful equipment, new ingredients, shortcut techniques, and instructions for advance preparation,  Simply Mexican demystifies authentic Mexican meals so you can make them at home in a snap.“With this book Lourdes Castro has added a spark of creativity and simplicity to Mexican food that up until now had not yet been realized. It gives me a huge sense of pride and honor to know that this book exists, as it will help a large audience re-create these gems in a simple and straightforward way.”—Aarón Sánchez, chef/owner of Paladar and chef/partner of Centrico, author of La Comida del Barrio , and former cohost of Food Network’s Melting Pot“Here, at last, are real Mexican recipes that are authentic, creative, and fun to prepare. Lourdes Castro creates an atmosphere that makes learning about enchiladas, tacos, and salsas exciting and interesting, and her precise methodology with Mexican cookery is refreshing and very entertaining. Highly recommended.”—Jonathan Waxman, chef/owner of Barbuto and West County Grill and author of A Great American Cook",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Reference",
    "Nonfiction"
  ],
  "author": "Lourdes  Castro",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/5972073-simply-mexican"
}