{
  "title": "5 Stars",
  "description": "_CAN YOU BEAT THE NEON GOD'S ALGORITHM?\nFive days before the end of the world, a mother and her baby struggle to beat the Neon God’s Algorithm in order to secure a seat on the last shuttle leaving the planet.\nSYNOPSISFrom the bestselling author of the Vivian Amberville® series comes the NEON SCIENCE-FICTION survival story of a mother and her baby facing impossible odds midst a global apocalypse. Set in a mad world overseen by “The Neon God”, the deceitful and ubiquitous digital hive-mind A.I. controlling the metropolis of New Vega, five people are made to compete for “Gold Stars” in hope of escaping their impending doom.ABOUT THE BOOKFive days before the inevitable end of humanity, five unlikely heroes find themselves on an impossible quest to outlive the apocalypse.Aurora, Stella, Rolf, Tümay and Sorano must challenge themselves to beat the Neon God’s Algorithm in a crumbling, totalitarian, surveillance state complicated by crime, technology and civil unrest. Under the ubiquitous eye of the Neon God, they set out to collect “Gold Stars” – an elusive, difficult to obtain, merit-based currency – and secure a seat on the last shuttle to Luna.In a desperate attempt to save her baby daughter, Aurora must navigate the Dark and do her utmost to survive the last technological remnants of a dying civilization.GENRE: neon science-fiction, survival thriller;SUBJECT: nature and technology, digital totalitarianism, meta-reality, social commentary, the nature of reality;THEMES: inner and outer self, ideology vs. identity, will to survive, darkness and light, escapism, motherhood, love, sacrifice and redemption;WORLD: futuristic totalitarian dystopia, global apocalypse, crumbling civilization.Want to uncover more stories from the mind of Louise Blackwick? Visit her on her website! louiseblackwick.com",
  "genres": [
    "Science Fiction",
    "Cyberpunk"
  ],
  "author": "Louise Blackwick",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/59726028-5-stars"
}