{
  "title": "The Final Masquerade",
  "description": "The winter solstice. The darkest day, the longest night.Every year the solstice heralds the return of the masquerade ball. Fae and human dance and drink and make merry, so long as they remain masked. But there's a darker side to this night. Should a guest lose their mask, their life is forfeit, cursed to dance forever for the entertainment of the masquerade's cold and cruel fae host.Ever since he was a boy, Brice LeChoix's mother had warned him of the terrible fae. But it wasn't the fae who took his parents from him. Madness did that. Years later, now Lord of the crumbling LeChoix estate and buckled by debt, he has more important things to think about than fairytales. Until the masquerade comes to town. Every year on the solstice it appears, and every year the townsfolk frolic with the fae. Some never return. Brice warned his brother not to go. And when the masquerade vanishes like mist at dawn, it takes Charon with it.Now Brice must return to the masquerade, the very place he vowed never to set foot in again. The fae know his desires, they know his weaknesses. Forbidden lust will lure Brice from his world, into theirs. To save his brother, he must survive the masquerade's beautiful lies and avoid the host's wicked ways.But the fae have other ideas. One in particular has his eye on Brice... The trickster, Raoul, will stop at nothing to seduce Brice because he knows, more than anyone, that the masquerade is a trap from which no soul truly ever escapes.The longest night is upon us. Can you hear their call? Take my hand, come with me, to the masquerade ball... A stunning adult MM dark fairytale standalone novel of 115,000 words. Warning: this book contains devious fae, dubious consent, coercive rape, sex with multiple partners, suicide, and violent punishment, and is advised for readers aged 18+",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Fae",
    "Romance",
    "LGBT",
    "Dark",
    "Paranormal"
  ],
  "author": "Ariana Nash",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/59739580-the-final-masquerade"
}