{
  "title": "Ravaged by Monsters",
  "description": "Monsters own the world. And now, they own me.There are two roles for a human—either you’re a monster’s pet or you’re dead.When I’m ripped from my family and the resistance at the age of eighteen, I think my life is over.One second, I’m fighting against the monsters who enslaved us for years, and the next, I’m on a stage, waiting to be bid on by the very beasts I hunted and killed.Everything changes when I’m bought by four of the most terrifying monsters in all of existence and the kings of our world—The Four Terrors.The Empty Man, who has no corporeal body of his own. As such, he possesses everything and everyone within his sights. He’s the light that flickers, the doll that speaks, the sink that bubbles over.The Grotesque, someone I’ve never seen with my own two eyes before. Rumor has it, if you set sight upon his face, you’ll die a horrible and painful death. But he whispers to me, his seductive voice promising of all the sinful things he plans to do with me—and to me—if I open myself up.The Devourer, who needs to feast on human flesh to survive. He has claws for hands, horns erupting from his head, and bright red eyes that lure me in.And finally, The Creeper, who travels through portals in closets—the definition of the monster in the closet. Sometimes, he’ll sit in my room, a silent shadow, watching me. Wanting me.I’m nothing but a pet to these dangerous, malicious beasts. But maybe…Maybe I want to be ravaged by the monsters.This is a reverse harem romance with protective, possessive, psychotic monsters and the female they all love. If you like your men a little deranged and one hundred percent monstrous, your female a badass, and panty-melting heat, then this is the book for you. The things these monsters can do with their tongues…and claws…and horns…and tails…",
  "genres": [
    "Reverse Harem",
    "Monsters",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Dark",
    "Dark Romance"
  ],
  "author": "Katie May",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/59738904-ravaged-by-monsters"
}