{
  "title": "Strengths Based Leadership",
  "description": "From Gallup: a landmark study of great leaders, teams and the reasons why people follow.More than a decade ago, Gallup unveiled the results of a landmark 30-year research project that ignited a global conversation on the topic of strengths. Since then, more than 23 million people have taken Gallup’s CliftonStrengths (formerly StrengthsFinder) assessment, which forms the core of several books on this topic, including the #1 international bestseller StrengthsFinder 2.0 .In recent years, while continuing to learn more about strengths, Gallup scientists have also been examining decades of data on the topic of leadership. They studied more than 1 million work teams, conducted more than 20,000 in-depth interviews with leaders, and even interviewed more than 10,000 followers around the world to ask exactly why they followed the most important leader in their life.Gallup reveals the results of this research in Strengths Based Leadership . Based on Gallup’s discoveries, the book identifies three keys to being a more effective leader: knowing your strengths and investing in others’ strengths, getting people with the right strengths on your team, and understanding and meeting the four basic needs of those who look to you for leadership.As you read Strengths Based Leadership , you’ll hear firsthand accounts from some of the most successful organizational leaders in recent history, from the founder of Teach For America to the president of The Ritz-Carlton, as they discuss how their unique strengths have driven their success. Filled with novel research and actionable ideas, Strengths Based Leadership will give you a new road map for leading people toward a better future.A unique access code allows you to take a leadership version of Gallup’s CliftonStrengths assessment. The leadership version provides you with specific strategies for leading with your top five strengths and enables you to plot the strengths of your team based on the four domains of leadership strength revealed in the book.",
  "genres": [
    "Leadership",
    "Business",
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Management",
    "Psychology"
  ],
  "author": "Tom Rath",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/5973885-strengths-based-leadership"
}