{
  "title": "A Light Beyond the Trenches",
  "description": "A WW1 Novel of Betrayal and Resilience From the USA Today bestselling author of Churchill’s Secret Messenger comes a WWI novel based on little-known history, as four very different lives intertwine across Europe from Germany to France—a German Red Cross nurse, a Jewish pianist blinded on the battlefield, a soldier tortured by deadly secrets of his own, and his tormented French mistress. This life-affirming tale of heroism and resilience will stay with you long after turning the final page.By April 1916, the fervor that accompanied war’s outbreak has faded. In its place is a grim reality. Throughout Germany, essentials are rationed. Hope, too, is in short supply. Anna Zeller, whose fiancé, Bruno, is fighting on the western front, works as a nurse at an overcrowded hospital in Oldenburg, trying to comfort men broken in body and spirit. But during a visit from Dr. Stalling, the director of the Red Cross Ambulance Dogs Association, she witnesses a rare spark of optimism: as a German shepherd guides a battle-blinded soldier over a garden path, Dr. Stalling is inspired with an idea—to train dogs as companions for sightless veterans. Anna convinces Dr. Stalling to let her work at his new guide dog training school. Some of the dogs that arrive are themselves veterans of war, including Nia, a German shepherd with trench-damaged paws. Anna brings the ailing Nia home and secretly tends and trains her, convinced she may yet be the perfect guide for the right soldier. In Max Benesch, a Jewish soldier blinded by chlorine gas at the front, Nia finds her person. War has taken Max’s sight, his fiancée, and his hopes of being a composer. Yet despite all he’s given for his country, the tide of anti-Semitism at home is rising, and Max encounters it first-hand in one of the school’s trainers, who is determined to make Max fail. Still, through Anna’s prompting, he rediscovers his passion for music. But as Anna discovers more about the conflict’s escalating brutality—and Bruno’s role in it—she realizes how impossible it will be for any of them to escape the war unscathed . . .",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "World War I",
    "Romance",
    "War",
    "Germany"
  ],
  "author": "Alan Hlad",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/59748631-a-light-beyond-the-trenches"
}