{
  "title": "Group Therapy",
  "description": "From the Wall Street Journal bestselling author of 44 Chapters About 4 Men (inspiration for the 4th Most-Watched Netflix Original Series of all time, Sex/Life) comes a fun, forbidden romantic comedy about an inexperienced psychologist and her ultra-famous client.I am thiiiiis close to finally becoming a full-fledged psychologist. PhD? Check. Prestigious postdoc position, providing therapy to entitled millionaires and C-list celebrities whose pumpkin spice lattes cost more than my Converse and make excellent projectiles during their reality TV–worthy tantrums? Check. Letter of recommendation from my velociraptor-like supervisor? That’s going to take a miracle. Not only because my boss said I have to cure our most-prized client’s writer’s block in time for him to meet his insane deadline, but also because that client just so happens to be …Thomas F*@%ing O’Reardon. Yeah, that Thomas O’Reardon. The wickedly brilliant, achingly beautiful, devastatingly British best-selling author whose psychological thrillers line my bookshelf at home and whose face I might or might not picture while I … you get the point. Sitting in a confined space with him; inhaling the crisp, clean scent of his cologne; gazing into his broody blue eyes while trying to remember to nod and listen and come up with suggestions that don’t involve taking our clothes off … it’s torture. So, when Thomas casually asks me out at the end of a therapy session, I’m forced to make an impossible choice: say yes and risk losing my dream job, or say no and risk losing my dream guy. In a panic, I blurt out a third option—the only solution I can think of that will allow me to see this man after hours without it being considered a career-ending ethics violation: Group therapy.The only problem? I’ve never actually done group therapy. And side problem: my other clients are heathens. But what’s the worst that could happen? I mean, it’s not like I’m going to lose all control of the group and let it devolve into a chaotic, bloodthirsty, topless fight club.Right?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "Chick Lit",
    "Humor",
    "Adult"
  ],
  "author": "B.B. Easton",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/59747737-group-therapy"
}