{
  "title": "Nacida para seducir",
  "description": "Dean Robillard, jugador de los Chicago Stars, es el hombre más afortunado del mundo: es una auténtica estrella deportiva y acaba de iniciar una prolífica carrera como modelo de ropa interior. Pero el camino a la gloria ha comenzado su declive, y Dean decide hacer un viaje por carretera en un intento por comprender qué es lo que no marcha bien en su vida. Pero lo que no sabe es que muy pronto conocerá a alguien que pondrá su mundo del revés.Blue Bailey sólo tiene un objetivo en la vida: vengarse de su ex. Para ello cuenta con la ayuda de un auténtico dios griego, el jugador de fútbol americano más famoso de América, que se ofrece a llevarla en su Aston Martin. Sin embargo, Dean no es el deportista descerebrado que ella había imaginado…Una novela en la que la popular autora de Toscana para dos y Tenías que ser tú hace nuevamente gala de todo su ingenio y humor.Cuando el millonario Dean Robillard conoce a Blue Bailey, a la muchacha no pueden irle peor las cosas. Su ex le ha robado todo su dinero y no tiene adónde ir. Dean, una estrella del fútbol americano, está de vacaciones mientras se recupera de una lesión.El quaterback estrella de los Chicago Stars sufre una grave lesión en el hombro que le obliga a replantearse su vida una vez que abandone su carrera deportiva. Decide tomarse unas pequeñas vacaciones para recuperarse y aclarar sus ideas. Mientras conduce su Aston Martin ve a una mujer que camina por la carretera, por lo que para para ofrecerse a llevarla.Blue Bailey está destrozada, sin empleo y se ha quedado tirada después de que su ex le robara todo su dinero de modo que cuando le para un guaperas con un cochazo no duda en aceptar irse con él. Pronto se dirigen juntos a la nueva granja, donde Blue pondrá la vida del deportista patas arriba. Y, aunque la atracción es mutua, ¿podrá sobrevivir su relación cuando lo único que tienen en común es que no creen en el amor?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Sports",
    "Sports Romance",
    "Fiction"
  ],
  "author": "Susan Elizabeth Phillips",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/5974569-nacida-para-seducir"
}