{
  "title": "Penis Politics: A Memoir of Women, Men and Power",
  "description": "“A vivid, clear-eyed glimpse into American politics from a woman who grew up in the hinterlands of Mississippi and against all odds propelled herself into the rooms of power in Washington and New York City. Disarmingly honest, Hinton has invited us into her extraordinary life, from her complicated relationship with the Mississippi Delta of her youth, to the famous—too often, infamous—men she met along the way in her career in Democratic politics. Hinton’s first book is brimming with the steady perseverance, relentless ambition and maddening frustrations of a talented woman who found her way in a world dominated by men less talented than she. Now, it’s her turn to tell her story. And Hinton, a longtime keeper of secrets, spares no one.”—Mara Gay, New York Times editorial board member and MSNBC political analyst.Penis A Memoir of Women, Men and Power is a compelling coming-of-age story, set both in small-town Mississippi and big-city New York, with a long layover in the nation’s capital. Karen Hinton chronicles her life from tiny Soso, Mississippi (pop. 408), to the University of Mississippi (Ole Miss), where she played on the Lady Rebels basketball team, had embarrassing encounters with literary luminaries such as William Styron and Willie Morris, and received a degree in journalism . . . to stints at two newspapers, where she worked as a reporter—the Jackson Daily News and the Rocky Mountain News—to working on the political campaigns of two Black political candidates, one of whom was elected to Congress, thus becoming the first Black representative from Mississippi since Reconstruction.Hinton went on to become one of the most colorful and outspoken political communications professionals in Washington and New York. Best known for her role as press secretary to both former Housing Secretary Andrew Cuomo and New York Mayor Bill De Blasio, Karen played what Politico dubbed the “Helen of Troy role” in the clash between the former Governor of New York and the Mayor that the New York Times called “one of America’s ugliest political feuds.” The Wall Street Journal described “the wisdom she dispensed in a Southern twang” in dealing with the strutting and chest pounding of New York’s two most powerful leaders. At the center of Hinton’s incredible rise to the pinnacle of success was an undercurrent of men behaving badly. The role that “penis politics” played in Hinton’s life began in childhood with a male school employee who demanded sexual favors from her female classmates—and extended throughout her life as she bore witness to the struggles that she and her friends and colleagues have undergone to deal with sexual abuse, sexual harassment and gender discrimination.Known for never ducking a fight, Karen was at the peak of her career when a catastrophic brain injury from a freak accident confronted her with the battle of her life. Emerging from a coma, learning to walk and talk again, as documented in a CBS News broadcast, Karen was determined to “speak up, not shut up” on issues involving women, men and power in politics.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Biography"
  ],
  "author": "Karen  Hinton",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/59741120-penis-politics"
}