{
  "title": "How I Survived a Chinese \"Reeducation\" Camp: A Uyghur Woman's Story",
  "description": "The first and only memoir about the reeducation camps by a Uyghur woman. “I have written what I lived. The atrocious reality.”— Gulbahar Haitiwaji to Paris MatchSince 2017, more than one million Uyghurs have been deported from their homes in the Xinjiang region of China to “reeducation camps.” The brutal repression of the Uyghurs, a Turkish-speaking Muslim ethnic group, has been denounced as genocide, and reported widely in media around the world. The Xinjiang Papers, revealed by the New York Times in 2019, expose the brutal repression of the Uyghur ethnicity by means of forced mass detention­—the biggest since the time of Mao. Her name is Gulbahar Haitiwaji and she is the first Uyghur woman to escape from these camps who has dared to speak out. For three years Haitiwaji endured hundreds of hours of interrogations, torture, hunger, police violence, brainwashing, forced sterilization, freezing cold, rats, and nights under blinding neon light in her prison cell. These camps are to China what the Gulags were to the USSR. The Chinese government denies that they are concentration camps, seeking to legitimize their existence in the name of the “total fight against Islamic terrorism, infiltration and separatism,” and calls them “schools.” But none of this is true. Gulbahar only escaped thanks to the relentless efforts of her daughter. Her courageous memoir is a terrifying portrait of the atrocities she endured in the Chinese gulag and how the treatment of the Uyghurs at the hands of the Chinese government is just the latest example of their oppression of independent minorities within Chinese borders. The Xinjiang region where the Uyghurs live is where the Chinese government wishes there to be a new “silk route,” connecting Asia to Europe, considered to be the most important political project of president Xi Jinping.",
  "genres": [
    "Nonfiction",
    "China",
    "Memoir",
    "Biography",
    "Asia",
    "Politics",
    "History"
  ],
  "author": "Gulbahar Haitiwaji",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/59747897-how-i-survived-a-chinese-reeducation-camp"
}