{
  "title": "House of Darakai",
  "description": "BEHIND THE MASK OF WAR AND VALOR, BETRAYAL REIGNS WHERE IT BLEEDS…Orynthia’s young king grievously takes his throne in the wake of regicide. From the city’s underbelly, unrest brews for the cross-caste convicted, while the haidrens hastily depart Bastiion to embark on the coronation tour for the realm’s new sovereign: Dmitri Korbin Thoarne.Now the seated haidren for his House, Zaethan Kasim returns to the brutal mountains of his youth, where competition and conquest eagerly await his homecoming, unlike his dismissive father. There, Zaethan swiftly uncovers a Darakai radically changing. Committed to doing whatever it takes to protect Dmitri’s regime, he fights to remain alpha zà as Wekesa—his favored rival—prepares his challenge. To ensure he is named champion, Zaethan presents another deal to the highlander witch he despises. Yet in balancing fealty to both king and countrymen, Zaethan begins to doubt Darakai’s loyalties, as well as his own.Luscia Darragh Tiergan is no stranger to the brutality of the south. However, after a harrowing attack, it is the shadows lurking behind it that slashes her dreams into a waking nightmare. Plagued by whispering omens, Luscia wrestles to silence her uncontrolled Sight. And as she is stalked out of Bastiion from within the Other, she must conceal the volatile manifestations from her Boreali guard but, most especially, the Darakaian haidren Luscia’s sworn to help. Hosted by the House of War, the Quadren confronts an enemy more dangerous than the last. For where treachery stirs, it is not the crown that reigns, but the bloodshed encircling it.The SeriesHouse of Darakai is the second installment in the epic fantasy series, The Haidren Legacy. An immersive adventure armed with dark politics, sharp objects, and bickering characters, this treacherous saga packs a legendary punch for adult and NA readers alike. Thrilling fans of Brandon Sanderson, George R.R. Martin, and Sabaa Tahir, this savage sequel is out for blood.Content Advisory detailed on the THL website. Direct link provided under \"Questions\" below.",
  "genres": [
    "Fantasy",
    "High Fantasy",
    "Adult",
    "Slow Burn",
    "Fiction",
    "Young Adult",
    "New Adult"
  ],
  "author": "K.L. Kolarich",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/59736794-house-of-darakai"
}