{
  "title": "Some of It Was Real",
  "description": "A psychic on the verge of stardom who isn’t sure she believes in herself and a cynical journalist with one last chance at redemption are brought together by secrets from the past that also threaten to tear them apart.Psychic-medium Sylvie Young starts every show with her origin story, telling the audience how she discovered her abilities. But she leaves out a lot—the plane crash that killed her parents, an estranged adoptive family who tend orchards in rainy Oregon, panic attacks, and the fact that her agent insists she research some clients to ensure success.After a catastrophic reporting error, Thomas Holmes’s next story at the L.A. Times may be his last, but he’s got a great personal pitch. “Grief vampires” like Sylvie who prey upon the loved ones of the deceased have bankrupted his mother. He’s dead set on using his last-chance article to expose Sylvie as a conniving fraud and resurrect his career. When Sylvie and Thomas collide, a game of cat and mouse ensues, but the secrets they’re keeping from each other are nothing compared to the mysteries and lies they unearth about Sylvie’s past. Searching for the truth might destroy them both—but it’s the only way to find out what’s real.—“Fresh, surprising, and compulsively readable, Some of It Was Real sucked me right in with its rich characters, sparkling wit, and captivating story arc. This debut is more than a page-turner; it's an unflinching exploration of identity, trauma, and transcending the past, and it kept me riveted all the way up to its jaw-dropping conclusion.\"— New York Times bestselling author Andrea Bartz\"Some of It Was Real had everything I love—characters I was rooting for and an intriguing premise that kept me guessing. The ending had me turning the final pages at a breakneck speed. You will simply love this book.\"—Tracey Garvis Graves, New York Times bestselling author of The Girl He Used to Know\"The perfect blend of mystery and love story, Some of It Was Real kept me guessing and turning pages way past my bedtime, all the way to its shocking denouement. An absolute must-read.\"— USA Today bestselling author Colleen Oakley",
  "genres": [
    "Romance",
    "Fiction",
    "Mystery",
    "Contemporary",
    "Fantasy",
    "Contemporary Romance",
    "Paranormal"
  ],
  "author": "Nan  Fischer",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/59741203-some-of-it-was-real"
}