{
  "title": "The Mortal Immortal: The Complete Supernatural Short Fiction of Mary Shelley",
  "description": "This vibrant collection contains all five of Mary Shelley's supernatural stories, and sheds much needed light on an author often credited with writing the first science fiction novel. Here you will find the secrets of eternal youth, souls that exchange bodies, and ancient Englishmen and Romans newly thawed out of ice. In addition to several stories by Mary Shelley, this volume also features a brand new story by renowned science fiction author Michael Bishop, which serves as a narrative introduction for this collection. Mary Shelley's considerable reputation rests squarely on the shoulders of her one great novel - Frankenstein, or the Modern Prometheus, published anonymously in 1818 and revised under her own byline in 1831. Her powerful tale of blasphemous creation is perhaps more familiar to modern readers through its many film adaptations as it is from the book itself. From Boris Karloff's electrifying performance as Frankenstein to Kenneth Branaugh's latest directorial rendering, the story has received numerous interpretations which have renewed interest in the book time and time again. However, Shelley's other works have not fared as well as Frankenstein. She wrote just a handful of novels, of which only The Last Man (1826) has remained sporadically in print. A precursor to such disaster novels as George R. Stewart's Earth Abides and Richard Jeffries' After London, The Last Man follows its protagonist Lionel Verney through a distant future world which has been depopulated by plague. The shorter works of Mary Shelley have remained difficult to find. During her lifetime, she published just over two-dozen stories, only three of which were of interest to readers of science fiction and fantasy. In addition to these three supernaturally-themed stories, two additional stories were published after Shelley's death. \"Roger Dodsworth: The Reanimated Englishman,\" was printed in a volume of reminisces by a magazine editor who had commissioned the story thirty years earlier. \"Valerius: The Reanimated Roman,\" a story in a similar vein to \"Roger Dodsworth,\" remained unpublished until 1976, when both stories were discovered by Charles E. Robinson, a Shelley scholar and professor of English at the University of Delaware.Contents\"The Unexpected Visit of a Reanimated Englishwoman\": Introduction by Michael Bishop\"The Mortal Immortal: A Tale\"\"Transformation\"\"Roger Dodsworth: The Reanimated Englishman\"\"The Dream\"\"Valerius: The Reanimated Roman\"",
  "genres": [
    "Classics",
    "Short Stories",
    "Horror",
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Gothic"
  ],
  "author": "Mary Wollstonecraft Shelley",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/59756.The_Mortal_Immortal"
}