{
  "title": "Murderfuckers at the End of Internet",
  "description": "The last book about AI - before AIOld Seattle 2069.The Internet has been dead for thirty-one years.North America is an ecological hellscape.The USA is a patchwork of hyper-political city-states and rogue nations.The police have disbanded.And somebody's killing Nobodies.In a searing cyberpunk vision of the future, the sinister Black Devilfish walks the endless rainy streets of an overpopulated megalopolis searching for his own soul.The bizarre Devilfish power suit belies a hard-pressed insomniac struggling to find meaning in his aimless existence. He spends his nights drowning his sorrows in Lysol sponges, calling a wife he can't remember, and stalking the streets for other ultra-famous Nobodies.But who are the Nobodies?Nobodies of 2069 are a ridiculous and lethal mix of psychotic Pokemon characters, self-righteous movie stars, ultra-entitled billionaires, real-life superheroes, and unarrestable war criminals—all at once.After the brutal execution of ultra-famous mute pop singer Zarathustra Kardashian, a new street drug hits the scene—Pfixion—a transcendental substance said to make the user feel they are a fictional character in a book or novel.Before long, the Devilfish is dragged into the multi-faceted world of Pfixion and the Nobodies. He soon spirals, losing all hold on his identity, his life, and his sanity.In the end, the Devilfish's sense of honor and family will clash with the Nobody's world of lies and deceit—transforming him into a deadly harbinger of the truth.The real truth._____________________________________________________________No one knew what to do the day the Internet died.It was not unlike what happens to a family when the matriarch, the mother, dies. Everything was disrupted. Everything was forgotten. Everything was up for grabs. The same thoughts raced through everyone's 'What happens now? Who will hold everything together? Who will comfort me against the chaos? Who will fix my broken dreams?'Like Pandora's box, the inception of the Internet brought about actual changes in the human brain that once unleashed now raged outside the bounds of landlines, wifi routers, and server farms. All the darkness, terrible ideas, and unconscious thoughts that migrated from user's minds to the Web, now spilled out onto the street like an open sewer.Even thirty-one years later, in 2069, no one knows who turned the Internet off.Or do they?_____________________________________________________________“Equal parts Pokemon GO, Philp K. Dick, and a neutron bomb welded to the accelerator.” - S. Nakamoto“This is one wild ride. The conflict between love, tech, and identity is real and arresting, especially in these super dark times.",
  "genres": [],
  "author": "Dae D. Shields",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/59762092-murderfuckers-at-the-end-of-internet"
}