{
  "title": "Mexico Wall 132 (edition française)",
  "description": "Jesús Ramiro a perdu son emploi dans l'usine de fabrication de balles et a besoin d'un peu d'argent pour payer ses prêts étudiants. Un individu fragmentaire s'approche de lui en lui offrant de l'argent en échange des moules de balles et des plans des balles. Jesús Ramiro vole les moules de balles et les plans de balles. Maintenant, la police le poursuit alors qu'il essaie de garder une longueur d'avance sur eux. Le 28 février est le début de l'épidémie de grippe aux États-Unis d'Amérique. Le gouvernement prend rapidement des mesures pour vacciner tout le monde avec des vaccins gratuits contre la grippe. Les gens commencent à mourir quelques jours après avoir reçu les vaccins gratuits contre la grippe. Jesús Ramiro est convaincu que les vaccins contre la grippe ont quelque chose à voir avec tout cela après que ses parents sont morts de la grippe. Il est maintenant en difficulté depuis que les balles ont été déclarées illégales par le décret du président Kris Kitty Kleptomaniac. Le président Kris Kitty Kleptomaniac du parti Gouvernement des riches (G. O. P.) déclare la loi martiale dans le pays. Maintenant le président Kris Kitty Kleptomaniac est en mesure de décider qui se trouve légalement et illégalement dans le pays. Il crée un décret pour retirer la citoyenneté des États-Unis d'Amérique à toute personne qui a moins de 1 000 $ sur son compte bancaire. Accomplissant ainsi sa promesse de campagne de «Make America 4 the Rich Again» à ses fidèles partisans parmi les riches un pour cent. Ceux qui n'ont pas le montant minimum requis sont étiquetés illégaux et peuvent être expulsés par les services de déportation des décharges d'eau vers le Mexique. Les survivants de l'épidémie de grippe vivent maintenant dans des camps de réfugiés le long de la frontière nord du Mexique.",
  "genres": [],
  "author": "I.D. Oro",
  "average_rating": "4.96",
  "url": "https://www.goodreads.com/book/show/59750119-mexico-wall-132-edition-fran-aise"
}