{
  "title": "D.R.T. (Dead Right There)",
  "description": "With characters who are multilayered rather than caricatures of good and evil, D. R. T.: Dead Right There exposes the raw truth that even the most righteous have sinned and that it is human nature to see one sin, especially someone else's, as worse than others. —T. L. Cooper, Author of All She Ever Wanted“Ray Ellis’s DRT or Dead Right There is one of those rare crime novels that not only keeps you teetering on the edge of your chair, but reminds you that the jagged line between good and evil is as narrow and painful as the razor’s edge. Penned with blood red imagery and the haunting grace of an old poet, this young author is sure to thrill legions of fans for years to come.” —Vincent Zandri, bestselling author of The Innocent and Scream CatcherRegistered sex offenders in the valley have started showing up dead, killed with apparent violence and forethought; and Detective Nate Richards finds himself pitted against a psychotic killer set on ridding the valley of the unclean.When Chrystal Johansson, the only female on the killer’s list, barely escapes the attempt on her life, Richards takes her into protective custody. Driven by a voice he calls God and a group of men he calls the Uncles, the killer sets a deadline of two weeks to complete the valley’s cleansing.Around him, the community divides about the actions of the vigilante. Some hail the killer as a modern day knight, only doing what they wish they could; while others curse him as being part of the sickness he claims to fight.In the midst of the chaos, Nate finds his faith tested when he discovers a sympathetic link in his own heart for the killer’s ideas, if not his actions. Will he find the strength to keep his own path from falling into darkness and bring the killer in, or will he succumb to the powerful sway of street justice?With the deadline quickly approaching, and the city threatening to tear itself apart, will the killer fulfill his calling or will Nate stop the killings before another victim turns up D.R.T.",
  "genres": [],
  "author": "Ray Ellis",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/12838029-d-r-t-dead-right-there"
}