{
  "title": "Buffy the Vampire Slayer / Angel: Heat",
  "description": "From L.A. Times best-selling author Nancy Holder comes a new, original adventure featuring the cast of both Buffy the Vampire Slayer and Angel. In his first year in Los Angeles, Angel, the vampire with a soul, came across an inter-dimensional hunter named Jhiera. The seductive woman was only trying to protect other females in her culture from being stripped of their emotions -- intense emotions that gave them dominance over men. Angel fell victim to her heat, but Jhiera had to return to her own dimension. Now \"She\" is back and searching for a lost young woman who may be the key to unleashing an inter-dimensional war -- a war that will be led by a powerful sorcerer, determined to free China's terra-cotta army of fierce samurai from their long imprisonment.... There exists a hell dimension that is very much like the Ninth Circle of Hell that Dante Alighieri described in The Inferno. It is a frozen, desolate place, and the souls of the damned are buried in vast sheets of ice. Evil beings from many different dimensions have been sent there. The descendants of the imprisoned are chipping away at the barriers that separate the dimensions, hoping to free those trapped in the ice, so that they may return and claim this world for their own. One of these demons is in L.A. searching for Jhiera, hoping to strike a deal that will persuade her to thaw his soldiers -- and dragons -- in exchange for their help overthrowing the Vigories of Oden Tal. But what form will this demonic army take when it arrives in our world? In Sunnydale, Buffy Summers is casting about in her new life -- as school counselor, guardian of Dawn, best friend, keeper of Spike's sanity, and of course as Slayer -- hoping to find something, anything, that will give her back that \"finished\" feeling. A demonic army with a dragon at its head is so not what she needs right now. And in L.A., Angel and Gunn -- each man pining for a woman he can never have, for a time that will never be what it was -- stumble across a raging battle at a museum. Angel is astonished to see the inter-dimensional fugitive Jhiera again...and to have the same feelings for her come rushing back to the surface. Jhiera escapes, and the Angel Investigations gang starts poking around, trying to discover why the Oden Tal woman was at the museum -- a museum featuring an archaeological exhibit of the terra-cotta army of samurai figurines that were found in a Chinese emperor's tomb. They are a marvel to behold, and both Los Angeles and Sunnydale are lucky enough to host the exhibit. That can't be a coincidence...can it? When the frozen hell dimension is thawed and opened, a demonic army will enter this world through the Hellmouth. The various creatures will occupy the forms of the ready-made army, and a war will be waged.",
  "genres": [
    "Buffy The Vampire Slayer",
    "Fantasy",
    "Vampires",
    "Horror",
    "Young Adult",
    "Paranormal",
    "Fiction"
  ],
  "author": "Nancy Holder",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1283842.Buffy_the_Vampire_Slayer_Angel"
}