{
  "title": "How to Buy a Love of Reading",
  "description": "To Carley Wells, words are the enemy. Her tutor's innumerable SAT flashcards. Her personal trainer's \"fifty-seven pounds overweight\" assessment. And the endless assignments from her English teacher, Mr. Nagel. When Nagel reports to her parents that she has answered the question \"What is your favorite book?\" with \"Never met one I liked,\" they decide to fix what he calls her \"intellectual impoverishment.\" They will commission a book to be written just for her - one she'll have to love - that will impress her teacher and the whole town of Fox Glen with their family's devotion to the arts. They will be patrons - the Medicis of Long Island. They will buy their daughter the love of reading.Impossible though it is for Carley to imagine loving books, she is in love with a young bibliophile who cares about them more than anything. Anything, that is, but a good bottle of scotch. Hunter Cay, Carley's best friend and Fox Glen's resident golden boy, is becoming a stranger to her lately as he drowns himself in F. Scott Fitzgerald, booze, and Vicodin.When the Wellses move writer Bree McEnroy - author of a failed meta-novel about Odysseus's journey home through the Internet - into their mansion to write Carley's book, Carley's sole interest in the project is to distract Hunter from drinking and give them something to share. But as Hunter's behavior becomes erratic and dangerous, she finds herself increasingly drawn into the fictional world Bree has created, and begins to understand for the first time the power of stories - those we read, those we want to believe in, and most of all, those we tell ourselves about ourselves. Stories powerful enough to destroy a person. Or save her.",
  "genres": [
    "Fiction",
    "Books About Books",
    "Young Adult",
    "Contemporary",
    "Adult",
    "Literature",
    "Adult Fiction"
  ],
  "author": "Tanya Egan Gibson",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/5975766-how-to-buy-a-love-of-reading"
}