{
  "title": "Gonzalez & Daughter Trucking Co.: A Road Novel with Literary License",
  "description": "From the author of L.A. Weather comes “a whimsical, humorous, and passionate mystery that explores the love and hurt of a father and daughter on the run” (Jorge Ramos, News Anchor for Univision).“1,001 nights in a Mexicali women’s prison . . . González and Daughter Trucking Co. is about our compulsion to make events into stories and stories into bridges of understanding.”—John Sayles, Screenwriter and DirectorServing a sentence in a prison in Mexico, Libertad González finds a clever way to pass the time with the weekly Library Club, reading to her fellow inmates from whatever books she can find in the prison’s meager supply. The story that emerges, though, has nothing to do with the words printed on the pages. She tells of a former literature professor and fugitive of the Mexican government who reinvents himself as a trucker in the United States. There he falls in love with a wild woman with whom he shares his truck and his life—that is until Joaquín González unexpectedly finds himself alone on the road with a baby girl and González & Daughter Trucking Co. is born. Joaquín and his daughter make the cab of an 18-wheeler their home, sharing everything—adventures, books, truck-stop chow, and memories of the girl’s mother—until one day the girl grows into a woman, and a chance encounter with one man causes her to rebel against another.With her stories, Libertad enthralls a group of female prisoners every bit as eccentric as the tales she tells. In González and Daughter Trucking Co ., bestselling author María Amparo Escandón seamlessly blends together these elements into one compelling and unexpected conclusion that will have you cheering for Libertad and filled with joy.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Young Adult",
    "Travel",
    "Latino",
    "Friendship"
  ],
  "author": "María Amparo Escandón",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/59751.Gonzalez_Daughter_Trucking_Co_"
}