{
  "title": "Beauty and Misogyny: Harmful Cultural Practices in the West",
  "description": "Should western beauty practices, ranging from lipstick to labiaplasty, be included within the United Nations understandings of harmful traditional/cultural practices? By examining the role of common beauty practices in damaging the health of women, creating sexual difference, and enforcing female deference, this book argues that they should.In the 1970s feminists criticized pervasive beauty regimes such as dieting and depilation, but some new feminists argue that beauty practices are no longer oppressive now that women can choose them. However, in the last two decades the brutality of western beauty practices seems to have become much more severe, requiring the breaking of skin, spilling of blood and rearrangement or amputation of body parts. Beauty and Misogyny seeks to make sense of why beauty practices are not only just as persistent, but in many ways more extreme. It examines the pervasive use of makeup, the misogyny of fashion and high-heeled shoes, and looks at the role of pornography in the creation of increasingly popular beauty practices such as breast implants, genital waxing and surgical alteration of the labia. It looks at the cosmetic surgery and body piercing/cutting industries as being forms of self-mutilation by proxy, in which the surgeons and piercers serve as proxies to harm women s bodies, and concludes by considering how a culture of resistance to these practices can be created.This essential work will appeal to students and teachers of feminist psychology, gender studies, cultural studies, and feminist sociology at both undergraduate and postgraduate levels, and to anyone with an interest in feminism, women and beauty, and women s health.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Womens",
    "Sociology",
    "Gender",
    "Feminist Theory",
    "Psychology"
  ],
  "author": "Sheila Jeffreys",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/597663.Beauty_and_Misogyny"
}