{
  "title": "The Cheat Code",
  "description": "After the terrible encounters with the war heroes, the Intuitionist, Kusha, is on the verge of breaking all promises she gave to her friends and family. Worse: both the war heroes might become aware of her power—her intuition, for she is their shortcut, for she is their cheat code. Both the Mesmerizer and the Monk need cheat codes to win at their games. The Devil’s Book awakened the spirit of the Dancing Goddess. While the Monk, Yuan, might discover Prachin Nritya—the oldest of the oldest dance, which he thinks is the first language of humanity—the Intuitionist, Kusha, sees the dancing goddess in her dreams. Her purpose calls her, but she has her life to deal with. She gave her adoptive father a word that she will focus on her Career Exam. She told her friend, Haley, that she would join her in the race that’d help Haley be a citizen. She also has her promises to keep with Magic Mama. In a world of voice where High Grades are proud to never lie, a promise made verbally is stronger than a red seal on handmade paper. Being not evolved, being an improper human, in a very proper world, making promises might become a burden. Kusha wants to keep her promises. She wants to have a normal life, staying a citizen with a good job at Alphatech—a tech industry that offered sponsorship for her Career Exam. But it’s also the Alphatech that the Monk owns. The Alphatech that the Mesmerizer, Ruem, founded with the Monk decades ago. The Alphatech with era’s best research labs that Ruem now wants back for his larger goals. A mess awaits Alphatech, but Kusha needs the job. Even though she doesn’t want to encounter the war heroes again, she might. She can’t let her power fall into the wrong hands. So the Intuitionist must make good use of her situation and get the best outcome.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Science Fiction Fantasy",
    "Post Apocalyptic",
    "Adventure",
    "Dark",
    "Adult"
  ],
  "author": "Misba",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/59784480-the-cheat-code"
}