{
  "title": "Paola Santiago and the Sanctuary of Shadows",
  "description": "Best-selling author Rick Riordan presents Tehlor Kay Mejia's third chilling story based on Mexican folklore. This time Paola Santiago faces El Cucuy, aka the Boogeyman.\n\n\"Paola Santiago is a whip-smart Latina who dares to explore the shadows between folklore and middle-school friendship. A thrilling adventure.\"--Nina Moreno, author of Don't Date Rosa SantosPaola Santiago has recently returned from Oregon, where she defeated the Hitchhiker ghost and saved her father from the vengeful spirit that was possessing him. The poor girl deserves a rest! But first she has to rescue Dante from the void, where he’s been imprisoned by some unknown force. Even though Dante has turned against Pao, she can’t just leave him there--they’ve been friends for too long.Paola’s prophetic dreams seem to have dried up, so she has to find other ways to locate a new rift where she can enter the void. Signs point to Texas--but how is she going to get there from Arizona? It just so happens that Emma’s new group of politically active friends, the Rainbow Rogues, are planning a field trip to San Antonio. It’s the perfect ruse for Paola, if she can stand being with the judgmental girls for that many days. . . .Relying on her wits, training from the Ninos de la Luz, and the emotional support of her best friend Emma, Pao makes it into the void. Once there she must face down not just one but two enemies: El Cucuy, the bogeyman . . . and someone even scarier who looks a lot like Pao herself.This third exciting journey into Mexican folklore has our lovable, intrepid protagonist making discoveries both wonderous and fearsome.Complete your middle grade fantasy collection with:Rick Riordan Presents: Paola Santiago and the River of Tears by Tehlor Kay MejiaRick Riordan Presents: Paola Santiago and the Forest of Nightmares by Tehlor Kay MejiaRick Riordan Presents: The Last Fallen Star by Graci KimRick Riordan Presents: City of the Plague God by Sarwat ChaddaRick Riordan Presents: Race to the Sun by Rebecca Roanhorse",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Mythology",
    "Fiction",
    "Adventure",
    "LGBT",
    "Young Adult"
  ],
  "author": "Tehlor Kay Mejia",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/59801915-paola-santiago-and-the-sanctuary-of-shadows"
}