{
  "title": "Slenderman: Online Obsession, Mental Illness, and the Violent Crime of Two Midwestern Girls",
  "description": "The first full account of the Slenderman stabbing, a true crime narrative of mental illness, the American judicial system, the trials of adolescence, and the power of the internetThe Slenderman stabbing of May 31, 2014, in the Milwaukee suburb of Waukesha, Wisconsin, shocked the local community and the world. The violence of Morgan Geyser and Anissa Weier, two twelve-year-old girls who attempted to stab their classmate to death, was extreme, but what seemed even more frightening was that they had done so under the influence of a figure born by the internet: the so-called “Slenderman.” Yet the even more urgent aspect of the story, that the children involved were suffering from undiagnosed mental illness, was often overlooked in coverage of the case.Slenderman: Online Obsession, Mental Illness, and the Violent Crime of Two Midwestern Girls tells that full story for the first time in deeply researched detail, using court transcripts, police reports, individual reporting, and exclusive interviews. Morgan and Anissa were bound together by their shared love of geeky television shows and animals, and their discovery of the user-uploaded scary stories on the Creepypasta website could have been nothing more than a brief phase. But Morgan was suffering from early-onset childhood schizophrenia. She believed that she had been seeing Slenderman for many years, and the only way to stop him from killing her family was to bring him a sacrifice: Morgan’s best friend Payton “Bella” Leutner, whom Morgan and Anissa planned to stab to death on the night of Morgan’s twelfth birthday. Bella survived the attack, but was deeply traumatized, while Morgan and Anissa were immediately remanded into jail, and the severity of their crime meant that they would be prosecuted as adults. There, as Morgan continued to suffer from worsening mental illness after being denied antipsychotics, her life became more and more surreal.Slenderman is both a page-turning true crime story and a search for justice.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Psychology",
    "Mental Health",
    "Audiobook",
    "Horror"
  ],
  "author": "Kathleen  Hale",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/59788674-slenderman"
}