{
  "title": "Bound to Fall",
  "description": "Featuring characters from Pamela Clare’s acclaimed I-Team series.She barely survived.Sasha Dillon, a five-time world champion climber, moved to Scarlet Springs to join the Rocky Mountain Search & Rescue Team. She loves the tiny mountain town and its quirky residents and finds happiness using her climbing skills to save lives. But her sense of safety is shattered when two unknown attackers in an SUV run her down, destroying her shot at her sixth world championship title. As the town rallies around her and she begins to heal, the sheriff brings in a big-city detective with experience handling celebrity stalkers. As unemotional and cold as he is good-looking, Darius Silva both irritates her and tempts her, tying her in knots. She doesn’t know whether to tell him off—or kiss him.He’s done with celebrities.Darius knows firsthand what happens when cops arrest the wrong person. He’ll carry those scars forever. That’s why he’s always careful to remain detached on the job and why he never, ever bends the rules. The last thing he wants is another case involving a demanding, self-centered celebrity. But Sasha makes her mark on him the first time he looks into her beautiful blue eyes. Down-to-earth, genuine, and full of life, she’s nothing like the shallow stars he’s known. Something about her gets under his skin, threatening to unravel his self-control and undermine his focus. And the only way to catch the men who hurt her and get back to his life in the city is to keep his mind—and his hands—off her and on the job.To claim their future, they must face his past.As they come closer to exposing her hidden foe, their desire for one another explodes, and Sasha learns that his cold exterior masks deep passion—and terrible pain. Now she will do all she can to heal his jaded heart and show him that the life—and love—he’s secretly longing for is here with her in Scarlet Springs.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Romantic Suspense",
    "Contemporary",
    "Suspense",
    "Sports",
    "Small Town Romance"
  ],
  "author": "Pamela Clare",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/59799015-bound-to-fall"
}