{
  "title": "First Chorus",
  "description": "Protect her at all costs…The last thing I was looking for when I left the facility was a new woman, a new relationship, and a new cause. I found all three in a dark alley. Saving her life was the best choice I’ve ever made.Now, Vienna is the center of my world. I’ve never met anyone so perfect for me and for whom I am perfect. Where others see flaws, she finds strength. When my demands and needs drove others away, she drew boundaries. In protecting her, I’ve found my purpose in life and I won’t let anything come between us.That goal required me to deal with flirty Fletcher with his irritating concepts and desire to live dangerously. The past he was on the run from could come for him. That would make them her problem. Not acceptable. Yet as long as she wants him with us, then I’ll protect him and protect her from him. Keeping them safe will take everything I know how to do and the things I’m still learning.Never has it been more important than now.Because we have a new problem. I don’t know what we’re supposed to do with him. Vienna’s work demands that she hunt monsters. But when one hunts monsters, don’t those same monsters begin to hunt or at least haunt you? What does that make this latest interloper? Is he a man? Or a monster? I’m personally hoping for a monster. I know exactly what to do with those.At least Fletcher seems to agree with me. Hopefully our first chorus won’t be our last.FIRST CHORUS is a full length dark adult romance and psychological thriller with suspenseful themes. Any trigger warnings will be included in the foreword. Some situations may be uncomfortable for readers. This is a reverse harem novel, meaning the main character has more than one love interest. This is book two in the series.",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Dark",
    "Contemporary",
    "Dark Romance",
    "Enemies To Lovers",
    "Polyamorous"
  ],
  "author": "Heather Long",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/59798514-first-chorus"
}