{
  "title": "Criminal (In)Justice: What the Push for Decarceration and Depolicing Gets Wrong and Who It Hurts Most",
  "description": "In his impassioned-yet-measured book, Rafael A. Mangual offers an incisive critique of America's increasingly radical criminal justice reform movement, and makes a convincing case against the pursuit of \"justice\" through mass-decarceration and depolicing. After a summer of violent protests in 2020—sparked by the deaths of George Floyd, Breonna Taylor, and Rayshard Brooks—a dangerously false narrative gained mainstream Criminal justice in the United States is overly punitive and racially oppressive . But, the harshest and loudest condemnations of incarceration, policing, and prosecution are often shallow and at odds with the available data. And the significant harms caused by this false narrative are borne by those who can least afford black and brown people who are disproportionately the victims of serious crimes. In Criminal (In)Justice , Rafael A. Mangual offers a more balanced understanding of American criminal justice, and cautions against discarding traditional crime control measures. A powerful combination of research, data-driven policy journalism, and the author's lived experiences, this book explains what many reform advocates get wrong, and illustrates how the misguided commitment to leniency places America's most vulnerable communities at risk.  The stakes of this moment are incredibly high. Ongoing debates over criminal justice reform have the potential to transform our society for a generation—for better or for worse. Grappling with the data—and the sometimes harsh realities they reflect—is the surest way to minimize the all-too-common injustices plaguing neighborhoods that can least afford them.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Sociology",
    "Law",
    "Crime",
    "True Crime",
    "Cultural"
  ],
  "author": "Rafael A. Mangual",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/59802047-criminal-in-justice"
}