{
  "title": "Shuggie Bain",
  "description": "Romance de estreia do autor escocês Douglas Stuart, Shuggie Bain foi o grande vencedor do Man Booker Prize, um dos mais reputados prémios literários internacionais.Uma história comovente sobre o heroísmo e os limites do amor.Livro do Ano nos British Book Awards * Finalista do National Book AwardFinalista do Orwell Prize * Finalista do Pen Hemingway Award *Finalista do Kirkus PrizePlano Nacional de LeituraLiteratura - Maiores de 18 anos1981, Glasgow. A outrora próspera cidade mineira sufoca sob o jugo férreo das políticas de Margaret Thatcher, lançando milhares de famílias para a miséria. A epidemia do álcool e das drogas aproveita para capturar os mais vulneráveis.Agnes Bain esperava mais da vida. Sonha com uma casa só sua e folheia catálogos de compras a crédito, na vã tentativa de alegrar a existência precária a que fica condenada quando o marido, um taxista mulherengo, a abandona, sem emprego e com três filhos. Com cabelos negros sedosos e ondulados, maquilhagem esmerada e dentes falsos perfeitos, parece a Elizabeth Taylor de Glasgow, mas, por baixo da aparência orgulhosa, as malhas do vício enredam Agnes, que mês após mês gasta o abono de família em latas de cerveja e maços de tabaco. Os filhos fazem o melhor que podem para cuidar de si e da mãe, mas, um a um, vêem-se obrigados a abandonar a casa materna, para tentar pelo menos salvar-se.Fica Shuggie, o mais novo, que adora a mãe e não perde a esperança de a salvar. Mas, aos oito anos, o rapaz tem a sua própria luta pessoal para delicado, sensível, comporta-se como um príncipe e destoa da dureza da escola e das ruas devassadas pela pobreza. Anseia apenas ser normal e encaixar, mas é o último a perceber que carrega um segredo e nunca poderá ser igual aos outros.Com ecos de autores como Frank McCourt, D. H. Lawrence e James Joyce, Shuggie Bain é um magnífico romance de estreia de um autor que tem uma história importante para contar, inspirada na sua própria. Uma história dilacerante de dependência, carência e afecto, um retrato épico de uma cidade, um quadro íntimo de uma família destroçada e, sobretudo, uma extraordinária história de amor.Os elogios da crí«É um livro desafiante, íntimo, envolvente, corajoso. Acredito que todos os que o lerem nunca mais se sentirão da mesma forma.»Margaret Busby, presidente do Júri do Booker Prize«Deixa-nos destroçados e a a vida pode ser curta, mas demora uma eternidade.»Leah Hager Cohen, The New York Times«Um romance de estreia que é uma obra-prima.»Bethanne Patrick, The Washington Post«Um romance que disseca o coração humano… com cenas realistas de amor, perda, sobrevivência e tristeza.»Scott Simon, NPR«Douglas Stuart escreveu um primeiro romance de uma beleza rara e duradoura.»Alex Preston, The Guardian«Shuggie Bain é um romance que quer chegar ao coração e consegue. Uma excelente estreia.»John Self, The Times«O talento de Stuart é tal, que a sua história - dolorosa, por vezes lancinante - consegue, muitas vezes, ser bela.»Barbara Lane, San Francisco Chronicle«A qualidade evocativa do livro nasce da capacidade do autor para criar um lugar, um tempo e a textura da emoção.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Literary Fiction",
    "Scotland",
    "LGBT",
    "Audiobook"
  ],
  "author": "Douglas   Stuart",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/59804433-shuggie-bain"
}