{
  "title": "Doctor Heartless",
  "description": "He’s cruel. Insufferably attractive. And broken beyond redemption.After the nightmare I just ran from, those details should have made him the perfect storm of do not touch. Except I didn’t know any of this—other than the attractive part—when I met him.Our story started on a lie.He pretended to be someone else, and I didn't ask a lot of questions. Nor did I try to stop him when he snuck out of my hotel room in the wee hours of the morning. I was determined to start my new life on an uptick and a wild one-night with a hot stranger felt like just the ticket.Only I should have known something that good wouldn't end that easy.On my first night in my new house, our paths cross again when I discover he's my new neighbor. No longer the charming man I met in the bar, he's a grump, completely unfriendly, and utterly intolerable. As if this couldn't get any worse, I quickly learn I'm also his daughter’s new teacher.A wonderful daughter I can't help but fall in love with.Something I refuse to do with him. Our button-pushing back and forth never fails to get under my skin. If anything, his sudden off-limits status makes resisting this devil of a single dad that much easier.Regardless of the temptation he presents. How searing his heated gaze is when I catch him staring. Or how breathless our stolen moments leave us.After all, this is the fresh start I so desperately need, and I will not let anything get in my way.No. I can’t give in to Doctor Heartless. No matter how hard he tries to change my mind. DOCTOR HEARTLESS is a 95k word deliciously STEAMY, grumpy/sunshine, enemies-to-lovers romance that will hit you straight in the feels! It is a standalone in the bestselling Boston's Billionaire Bachelors series featuring Boston's hottest billionaire doctors and the women they fall head over heels for!",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Doctors",
    "Billionaire Romance",
    "Medical",
    "Contemporary"
  ],
  "author": "J. Saman",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/59796035-doctor-heartless"
}