{
  "title": "The Great Reset: Joe Biden and the Rise of Twenty-First-Century Fascism",
  "description": "In The Great Joe Biden and the Rise of Twenty-First-Century Fascism, New York Times bestselling author and nationally syndicated radio host Glenn Beck argues that the American way of life will not survive the Great Reset and warns us to stop it before it's too late to reverse course. An international conspiracy between powerful bankers, business leaders, and government officials; closed-door meetings in the Swiss Alps; and calls for a radical transformation of every society on earth—the Great Reset sounds like it is one henchman-with-an-eyepatch away from being the plot for the next James Bond movie.But the Great Reset is not a work of fiction. It is a highly influential movement among the world’s elite to “reset” the global economy using banks, government programs, and environmental, social, and governance metrics. If they are successful and the Great Reset is finalized, it would put substantially more economic and social power in the hands of large corporations, international institutions, banks, and government officials, including Joe Biden, the United Nations, and many of the members of the World Economic Forum.In The Great Joe Biden and the Rise of Twenty-First-Century Fascism, Glenn Beck uses his trademark blend of humor, storytelling, and detailed analysis to reveal for the first time the unbelievable truth about the Great Reset, tying together nearly two decades of groundbreaking research about authoritarian movements and their efforts to fundamentally transform the United States.The roadmap to stopping the Great Reset begins with fully understanding what the free peoples of the world are up against, and no resource provides more information about this radical movement than Glenn Beck’s The Great Joe Biden and the Rise of Twenty-First-Century Fascism.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Economics",
    "Political Science",
    "Audiobook",
    "Conspiracy Theories"
  ],
  "author": "Glenn Beck",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/59797879-the-great-reset"
}