{
  "title": "Raising Lazarus",
  "description": "A “deeply reported, deeply moving” (Patrick Radden Keefe) account of everyday heroes fighting on the front lines of the overdose crisis, f rom the New York Times bestselling author of Dopesick (inspiration for the Peabody Award-winning Hulu limited series) and Factory Man .Nearly a decade into the second wave of America's overdose crisis, pharmaceutical companies have yet to answer for the harms they created. As pending court battles against opioid makers, distributors, and retailers drag on, addiction rates have soared to record-breaking levels during the COVID pandemic, illustrating the critical need for leadership, urgency, and change. Meanwhile, there is scant consensus between law enforcement and medical leaders, nor an understanding of how to truly scale the programs that are out there, working at the ragged edge of capacity and actually saving lives.Distilling this massive, unprecedented national health crisis down to its character-driven emotional core as only she can, Beth Macy takes us into the country’s hardest hit places to witness the devastating personal costs that one-third of America's families are now being forced to shoulder. Here we meet the ordinary people fighting for the least of us with the fewest resources, from harm reductionists risking arrest to bring lifesaving care to the homeless and addicted to the activists and bereaved families pushing to hold Purdue and the Sackler family accountable. These heroes come from all walks of life; what they have in common is an up-close and personal understanding of addiction that refuses to stigmatize—and therefore abandon—people who use drugs, as big pharma execs and many politicians are all too ready to do. Like the treatment innovators she profiles, Beth Macy meets the opioid crisis where it is—not where we think it should be or wish it was. Bearing witness with clear eyes, intrepid curiosity, and unfailing empathy, she brings us the crucial next installment in the story of the defining disaster of our era, one that touches every single one of us, whether directly or indirectly. A complex story of public health, big pharma, dark money, politics, race, and class that is by turns harrowing and heartening, infuriating and inspiring,  Raising Lazarus  is a must-read for all Americans.",
  "genres": [
    "Nonfiction",
    "Audiobook",
    "Politics",
    "History",
    "Health",
    "Science",
    "Sociology"
  ],
  "author": "Beth Macy",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/59801793-raising-lazarus"
}