{
  "title": "The Secret Wife of Louis XIV: Françoise d'Aubigné, Madame de Maintenon",
  "description": "Françoise d’Aubigné, marquise de Maintenon and secret wife of the Sun King, Louis XIV, was born in a bleak French prison in 1635, her father a condemned traitor and murderer, her mother the warden’s seduced daughter. A timely pardon and a hopeful Caribbean colonial venture failed to mend the family’s fortunes, and Françoise was reduced to begging in the streets. Yet, armed with beauty, intellect, and shrewd judgment, she was to make her way to the center of power at Versailles, the most opulent and ambitious court in all Europe. At fifteen, she was married off to the forty-two-year-old satirical poet Paul Scarron, a former roué now grievously deformed by rheumatism—“a sort of human Z,” as he described himself. Despite his ailments, Scarron presided over the liveliest and most scandalous literary salon in Paris, and Françoise quickly became its most prized ornament. After Scarron’s death, she enjoyed a merry widowhood in the fashionable Marais district, in the company of the courtesan Ninon de Lenclos and the King’s splendid mistress, Athénaïs de Montespan, who made the young widow governess to her brood of illegitimate children. The appointment transformed Françoise’s life, but was fatal to the temperamental Athénaïs herself, with the King soon turning his attentions to the graceful governess. Françoise was raised to the nobility as Madame de Maintenon—and, unofficially, “Madame de Maintenant,” the lady of the moment. The acclaimed biographer Veronica Buckley traces the extraordinary story of Françoise’s progress from pauper child to salonnière to the compromised position of Louis’s secret wife and uncrowned Queen. An absolute ruler, Louis turned away his many other mistresses to live with Françoise only, trusting her as his closest confidante and remaining in love with her for forty years.Sparkling with the irresistible wit of contemporary chroniclers such as Madame de Sévigné, this exactingly researched biography is a pinnacle of the form. In vibrant colors, The Secret Wife of Louis XIV paints a portrait of Europe in an age of violent change, and the Sun King’s France in the process of becoming its modern self.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "France",
    "17th Century",
    "Historical",
    "Biography Memoir"
  ],
  "author": "Veronica Buckley",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/5980841-the-secret-wife-of-louis-xiv"
}