{
  "title": "Of Cages and Crowns",
  "description": "For goddess-touched girls, there is only one destiny: the CullingFrom the moment Monroe Benson is born with a mark on her hand and the ability to summon fire from her fingertips, her life will never be her own. She’s goddess-touched, which means she’s destined to participate in the Culling, an age-old competition to determine the next queen of Erydia. For most of her seventeen years, her family has managed to keep Monroe--and her powers--hidden. But now, as Queen Viera calls for the Culling to start, and war looms on the horizon, Monroe can no longer hide. She must face her destiny whether she wants to or not.For the ten goddess-touched girls, all with different powers, the inevitably of this fight to the death has always ruled their lives. The tradition is both barbaric and cruel, but to make matters worse--Monroe isn’t prepared. She hasn’t trained her whole life for this day. She doesn’t want to be in the spotlight. She doesn’t want the crown.While Monroe struggles with her fate, a rebellion is brewing in the castle and in the country. A group called the Culled are banding together; their goal--to topple the monarchy. And the more they rise, the more merciless Viera is with her kingdom, recruiting younger and younger people from poorer and poorer places to fight in a war no one wants to be waging.When Monroe finds herself on the front lines of the rebellion’s inner circle, only one thing stands in her way: Cohen. The queen’s son and the man who will be king. The pair grows close, yet Cohen’s dedication to duty, to family, to tradition stands in stark contrast to the boy Monroe sees at night in the kitchens, secretly making the two of them a snack.As the fight crescendos around them, and the death of innocents is a force to bear, the choices Monroe makes will reverberate through the kingdom . . . and her heart forever.",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Fiction",
    "Dystopia",
    "Fantasy Romance",
    "Young Adult Fantasy"
  ],
  "author": "Brianna Joy Crump",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/59808387-of-cages-and-crowns"
}