{
  "title": "An Affair of Spies",
  "description": "From the winner of the National Jewish Book Award--A spy mission to rescue a defector from Germany and prevent the Nazis from creating an atomic bomb.Nathan Silverman grew up in Berlin in the 1920s, the son of a homemaker and a theoretical physicist. His idyllic childhood was soon marred by increasing levels of bigotry against his family and the rest of the Jewish community, and after his uncle is arrested on Kristallnacht, he leaves Germany for New York City with only his mother's wedding ring to sell for survival.While attending an evening course at Columbia in 1941, Nathan notices a recruitment poster on a university wall and decides to enlist in the military and help fight the Nazi regime. To his surprise, he is quickly selected for a special assignment; he is trained as a spy, and ordered to report to the Manhattan Project. There he learns that the Allies are racing to develop a nuclear weapon before the Nazis, and a German theoretical physicist is hoping to defect. The physicist was a friend of his father's, and Nathan's mission is to return to Berlin via France and smuggle him out of Europe.Nathan will be accompanied by Dr. Allison Fisher, a brilliant young scientist who can speak French; he travels to her lab at the University of Chicago for a crash course in nuclear physics, then they embark on their adventure. Nathan and Allison soon develop feelings for one another, but as their relationship deepens they move ever closer to their dangerous goal. Will they be able to escape Europe with the defector and start a new life together, or will they fail their mission and become two more casualties of war?An Affair of Spies is an action-packed tale of heroism and love in the face of unspeakable evil. Author Ronald H. Balson has applied his unmatched talent for evocative and painstakingly authentic storytelling to the high-stakes world of espionage and created his most thrilling novel yet.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Thriller",
    "Historical",
    "Holocaust",
    "Germany"
  ],
  "author": "Ronald H. Balson",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/59808336-an-affair-of-spies"
}