{
  "title": "Hester",
  "description": "Isobel Gamble is a young seamstress carrying generations of secrets when she sets sail from Scotland in the early 1800s with her husband, Edward. An apothecary who has fallen under the spell of opium, his pile of debts have forced them to flee Edinburgh for a fresh start in the New World. But only days after they've arrived in Salem, Edward abruptly joins a departing ship as a medic––leaving Isobel penniless and alone in a strange country, forced to make her way by any means possible.When she meets a young Nathaniel Hawthorne, the two are instantly drawn to each other: he is a man haunted by his ancestors, who sent innocent women to the gallows––while she is an unusually gifted needleworker, troubled by her own strange talents. As the weeks pass and Edward's safe return grows increasingly unlikely, Nathaniel and Isobel grow closer and closer. Together, they are a muse and a dark storyteller; the enchanter and the enchanted. But which is which?In this sensuous and hypnotizing tale, a young immigrant woman grapples with our country's complicated past, and learns that America's ideas of freedom and liberty often fall short of their promise. Interwoven with Isobel and Nathaniel's story is a vivid interrogation of who gets to be a \"real\" American in the first half of the 19th century, a depiction of the early days of the Underground Railroad in New England, and atmospheric interstitials that capture the long history of \"unusual\" women being accused of witchcraft. Meticulously researched yet evocatively imagined, Hester is a timeless tale of art, ambition, and desire that examines the roots of female creative power and the men who try to shut it down.A vivid reimagining of the woman who inspired Hester Prynne, the tragic heroine of Nathaniel Hawthorne's The Scarlet Letter, and a journey into the enduring legacy of New England's witchcraft trials.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Romance",
    "Book Club",
    "Audiobook",
    "Retellings"
  ],
  "author": "Laurie Lico Albanese",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/59807978-hester"
}