{
  "title": "The Make-Up Test",
  "description": "ONE TO WATCH meets BEACH READ in this smart, swoony, romantic comedy, in which two college exes find themselves battling against each other—and their unresolved feelings—for a spot in a prestigious literature Ph.D. program.Allison Avery loves to win. After acing every academic challenge she’s come up against, she’s finally been accepted into her dream Ph.D. program at Claymore University, studying medieval literature under a professor she’s admired for years. Sure, grad school isn’t easy—the classes are intense, her best friend is drifting away, and her students would rather pull all-nighters than discuss The Knight's Tale—but she’s got this. Until she discovers her ex-boyfriend has also been accepted. Colin Benjamin might be the only person who loves winning more than Allison does, and when they're both assigned to TA for the same professor, the game is on.What starts as a personal battle of wits (and lit) turns into all-out war when their professor announces a career-changing research trip opportunity—with one spot to fill. Competing with Colin is as natural as breathing, and after he shattered her heart two years ago, Allison refuses to let him come out on top. But when a family emergency and a late night road trip—plus a very sexy game of Scrabble—throw them together for a weekend, she starts to wonder if they could be stronger on the same team. And if they fall for each other all over again, Allison will have to choose between a once-in-a-lifetime opportunity and what could be a twice-in-a-lifetime love.Charmingly bookish and unequivocally fat positive, The Make-Up Test embraces the truth that people can sometimes change and grow, even when you least expect it.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Adult",
    "Fiction",
    "Enemies To Lovers"
  ],
  "author": "Jenny L. Howe",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/59808330-the-make-up-test"
}