{
  "title": "Skirts: Fashioning Modern Femininity in the Twentieth Century",
  "description": "In a sparkling, beautifully illustrated social history, Skirts traces the shifting roles of women over the twentieth century through the era’s most iconic and influential dresses.While the story of women’s liberation has often been framed by the growing acceptance of pants over the twentieth century, the most important and influential female fashions of the era featured skirts. Suffragists and soldiers marched in skirts; the heroines of the Civil Rights Movement took a stand in skirts. Frida Kahlo and Georgia O’Keeffe revolutionized modern art and Marie Curie won two Nobel Prizes in skirts. When NASA put a man on the moon, “the computer wore a skirt,” in the words of one of those computers, mathematician Katherine G. Johnson. As women made strides towards equality in the vote, the workforce, and the world at large, their wardrobes evolved with them. They did not need to \"wear the pants\" to be powerful or progressive; the dress itself became modern as designers like Mariano Fortuny, Coco Chanel, Jean Patou, and Diane von Furstenberg redefined femininity for a new era.Kimberly Chrisman-Campbell's Skirts looks at the history of twentieth-century womenswear through the lens of game-changing styles like the little black dress and the Bar Suit, as well as more obscure innovations like the Taxi dress or the Pop-Over dress, which came with a matching potholder. These influential garments illuminate the times in which they were first worn―and the women who wore them―while continuing to shape contemporary fashion and even opening the door for a genderfluid future of skirts. At once an authoritative work of history and a delightfully entertaining romp through decades of fashion, Skirts charts the changing fortunes, freedoms, and aspirations of women themselves.",
  "genres": [
    "Nonfiction",
    "History",
    "Fashion",
    "Feminism",
    "Audiobook",
    "Art",
    "Womens"
  ],
  "author": "Kimberly Chrisman-Campbell",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/59808346-skirts"
}