{
  "title": "The Game Master's Book of Legendary Dragons: Epic new dragons, dragon-kin and monsters, plus dragon cults, classes, combat and magic for 5th Edition RPG adventures",
  "description": "Experience the wonder and terror of dragons as they were meant to be!- New and expanded edition of Legendary Dragons from the award-winning fantasy art studio Jetpack7- Includes more than two dozen world-shattering dragons, including 6 new dragons exclusive to this edition- Dragon cults, dragon riders, aerial combat, magic items and much more- Completely reedited and redesigned, plus 3 exciting one-shots adventures!Game Masters and players alike are familiar with dragons and the threat they present in the world’s most popular tabletop roleplaying game. They’ve become so well-known, however, that some might say the magic has worn off them a bit. Even with the benefit of high-profile gaming supplements, they've become generic monsters, making the dragons in “Dungeons & Dragons” a shadow of their former imposing selves.In The Game Master’s Book of Legendary Dragons , readers will find more than two dozen truly epic beasts, each of which comes with a complete backstory, a history, motivations, lair actions, legendary combat actions and more. These creatures are designed to be a worthy focus to any campaign, whether as a mind-blowing BBEG for an unforgettable, high-level climax, or as a motivating force that runs in the background of a lower level adventure.Game Masters will also find new dragon-kin, drakes, kobolds and dragon races, plus new dragon-related organizations, skills, classes and magic, including dragon riders, dragon hunters, enhanced spells, aerial combat and airship options, dragon cults, magic items and more.The Game Master's Book of Legendary Dragons will provide endless ideas for Game Masters and countless hours of epic-level fun for adventurers willing to test their mettle against the baddest beasts the game has to offer.",
  "genres": [
    "Role Playing Games",
    "Dungeons and Dragons",
    "Fantasy",
    "Gaming",
    "Reference",
    "Fiction"
  ],
  "author": "Aaron Hübrich",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/59808342-the-game-master-s-book-of-legendary-dragons"
}