{
  "title": "Christmas at the Ranch",
  "description": "Filled with Christmas cheer, and the magic that can only be found in Jackson Hole, Wyoming under the shadow of the Tetons, Anita Hughes's Christmas at the Ranch is a love story that is sure to enchant, and warm your heart like a cup of hot apple cider.It’s days before Christmas and Samantha Morgan is in her Brooklyn apartment when her editor, Charlie, shows up. Her publisher Arthur Wentworth is throwing a Christmas party and wants Samantha to be the guest of honor. Samantha tries to come up with an excuse to miss it. She writes a series of books featuring a female James Bond-type heroine named Sloane Parker and Charlie is the only person who knows that Samantha is the opposite of Sloane, though the marketing team has built up an entire social media presence for her claiming that she is just as adventurous. In reality, Samantha rarely leaves her neighborhood and does her research online. She is afraid of almost everything and is only happy when she’s sitting in her apartment and writing.Samantha reluctantly agrees to go. But instead of taking her to Arthur’s house in Connecticut, the driver goes to the airport. On the phone, Charlie admits that the party is at Arthur’s new ranch in Jackson Hole, Wyoming. For a person who hates even walking around the block when it snows, this is her worst nightmare.But when a handsome stranger sits next to her on the plane, things begin to look up. She feels comfortable enough to spill all her secrets to him, including all of her fears and the truth about her fake Instagram account. However, when she shows up at the house, it turns out that this man, Drew, is Arthur’s son. Now Samantha is worried that Drew will tell his father about her lies.Over the course of Christmas week, Samantha grows closer to Drew. But when his fiancée, Beatrix (who recently gave him an ultimatum about settling down), shows up, things get more complicated. As Samantha’s fears of bison and giant icicles subside, and her feelings for Drew grow deeper, new fears develop…Will she leave this Christmas adventure broken-hearted? Or will true love prevail?",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Anita Hughes",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/59808018-christmas-at-the-ranch"
}