{
  "title": "How Not to Age: The Scientific Approach to Getting Healthier as You Get Older",
  "description": "Uncover the evidence-based science to slowing the effects of aging, from the New York Times bestselling author of the How Not to Die seriesWhen Dr. Michael Greger, dove into the top peer-reviewed anti-aging medical research, he realized that diet could regulate every one of the most promising strategies for combating the effects of aging. We don’t need Big Pharma to keep us feeling young—we already have the tools. In How Not to Age , the internationally renowned physician and nutritionist breaks down the science of aging and chronic illness and explains how to help avoid the diseases most commonly encountered in our journeys through life.Physicians have long treated aging as a malady, but getting older does not have to mean getting sicker. There are eleven pathways for aging in our bodies’ cells and we can disrupt each of them. Processes like autophagy, the upcycling of unusable junk, can be boosted with spermidine, a compound found in tempeh, mushrooms, and wheat germ. Senescent “zombie” cells that spew inflammation and are linked to many age-related diseases may be cleared in part with quercetin-rich foods like onions, apples, and kale. And we can combat effects of aging without breaking the bank. Why spend a small fortune on vitamin C and nicotinamide facial serums when you can make your own for up to 2,000 times cheaper?Inspired by the dietary and lifestyle patterns of centenarians and residents of “blue zone” regions where people live the longest, Dr. Greger presents simple, accessible, and evidence-based methods to preserve the body functions that keep you feeling youthful, both physically and mentally. Brimming with expertise and actionable takeaways, How Not to Age lays out practical strategies for achieving ultimate longevity.",
  "genres": [
    "Health",
    "Nonfiction",
    "Science",
    "Nutrition",
    "Self Help",
    "Food",
    "Audiobook"
  ],
  "author": "Michael Greger",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/59808041-how-not-to-age"
}