{
  "title": "Jasmine Zumideh Needs a Win",
  "description": "Most Anticipated YA by Buzzfeed, BookRiot, Epic Reads, Publishers Weekly , and more!A fresh spin on the cult-classic Election meets Darius the Great Is Not Okay in Jasmine Zumideh Needs a Win when an international incident crashes into a high school election, and Jasmine is caught between doing the right thing and chasing her dream.It’s 1979, and Jasmine Zumideh is ready to get the heck out of her stale, Southern California suburb and into her dream school, NYU, where she’ll major in journalism and cover New York City’s exploding music scene.There’s just one teeny Due to a deadline snafu, she maaaaaaybe said she was Senior Class President-Elect on her application―before the election takes place. But honestly, she’s running against Gerald Thomas, a rigid rule-follower whose platform includes reinstating a dress code―there’s no way she can lose. And she better not, or she’ll never get into NYU.But then, a real-life international incident turns the election upside down. Iran suddenly dominates the nightly news, and her opponent seizes the opportunity to stir up anti-Iranian hysteria at school and turn the electorate against her. Her brother, Ali, is no help. He’s become an outspoken advocate for Iran just as she’s trying to downplay her heritage.Now, as the white lie she told snowballs into an avalanche, Jasmine is stuck between claiming her heritage or hiding it, standing by her outspoken brother or turning her back on him, winning the election or abandoning her dreams for good.Told with biting insight and fierce humor, Susan Azim Boyer's Jasmine Zumideh Needs a Win is a fresh, unforgettable story of one Iranian-American young woman’s experience navigating her identity, friendship, family, her future, and a budding romance, all set against life-changing historical events with present-day relevance.",
  "genres": [
    "Young Adult",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Contemporary",
    "Romance",
    "Realistic Fiction"
  ],
  "author": "Susan Azim Boyer",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/59808231-jasmine-zumideh-needs-a-win"
}