{
  "title": "American Caliph: The True Story of a Muslim Mystic, a Hollywood Epic, and the 1977 Siege of Washington, DC",
  "description": "One of Publishers Weekly’ s Best Nonfiction Books of 2022 | A New York Times Book Review Editors' ChoiceThe riveting true story of America’s first homegrown Muslim terror attack, the 1977 Hanafi siege of Washington, DC.On March 9, 1977, Washington, DC, came under attack. Seven men stormed the headquarters of B’nai B’rith International, quickly taking control of the venerable Jewish organization’s building and holding more than a hundred employees hostage inside. A little over an hour later, three more men entered the Islamic Center of Washington, the country’s biggest and most important mosque, and took hostages there. Two others subsequently penetrated the municipal government’s District Building, a few hundred yards from the White House. When the gunmen there opened fire, a reporter was killed, and city councilor Marion Barry, later to become the mayor of Washington, DC, was shot in the chest. The deadly standoff brought downtown Washington to a standstill.The attackers belonged to the Hanafi movement, an African American Muslim group based in DC. Their leader was a former jazz drummer named Hamaas Abdul Khaalis, who had risen through the ranks of the Nation of Islam before feuding with the organization’s mercurial chief, Elijah Muhammad, and becoming Kareem Abdul-Jabbar’s spiritual authority. Like Malcolm X, Khaalis paid a price for his in 1973, seven of his family members and followers were killed by Nation supporters in one of the District’s most notorious murders. As Khaalis and the hostage takers took control of their DC targets four years later, they vowed to begin killing their hostages unless their demands were the federal government must turn over the killers of Khaalis’s family, the boxer Muhammad Ali, and Elijah’s son Wallace so that they could face true justice. They also demanded that the American premiere of Messenger of God ―a Hollywood epic about the life of the prophet Muhammad financed and supported by the Libyan leader Muammar Gaddhafi―be canceled and the film destroyed. Shahan Mufti’s American Caliph gives the first full account of the largest-ever hostage taking on American soil and of the tormented man who masterminded it. Informed by extensive archival research and hundreds of declassified FBI files, American Caliph tracks the battle for control of American Islam, the international politics of religion and oil, and the hour-to-hour drama of a city facing a homegrown terror assault. The result is a riveting true-crime story that sheds new light on the disarray of the 1970s and its ongoing reverberations.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Religion",
    "American History",
    "Crime",
    "Politics"
  ],
  "author": "Shahan Mufti",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/59808585-american-caliph"
}