{
  "title": "Come Back in September: A Literary Education on West Sixty-seventh Street, Manhattan",
  "description": "Critic and writer Darryl Pinckney recalls his friendship and apprenticeship with Elizabeth Hardwick and Barbara Epstein and the introduction they offered him to the New York literary world.Darryl Pinckney arrived at Columbia University in New York City in the early 1970s and had the opportunity to enroll in Elizabeth Hardwick's creative writing class at Barnard. It changed his life. When the semester was over, he continued to visit her, and he became close to both Hardwick and Barbara Epstein, Hardwick's best friend and neighbor and a fellow founder of The New York Review of Books. Pinckney was drawn into a New York literary world where he encountered some of the fascinating contributors to the Review, among them Susan Sontag, Robert Lowell, and Mary McCarthy. Yet the intellectual and artistic freedom that Pinckney observed on West Sixty-seventh Street could conflict with the demands of his politically minded family and their sense of the unavoidable lessons of black history.Pinckney's education in Hardwick's orbit took place in the context of the cultural movements then sweeping New York. In addition, through his peers and former classmates--such as Felice Rosser, Jim Jarmusch, Jean-Michel Basquiat, Lucy Sante, Howard Brookner, and Nan Goldin--Pinckney witnessed the coming together of the New Wave scene in the East Village. He experienced the avant-garde life at the same time as he was discovering the sexual freedom brought by gay liberation. It was his time for hope.In Come Back in September, Pinckney recalls his introduction to New York and to the writing life. The critic and novelist intimately captures this revolutionary, brilliant, and troubled period in American letters. Elizabeth Hardwick was not only his link to the intellectual heart of New York but also a source of continuous support and of inspiration--in the way she worked, her artistry, the beauty of her voice. Through his memories of the city and of Hardwick, we see the emergence and evolution of Pinckney himself as a writer.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Books About Books",
    "Biography",
    "New York",
    "LGBT",
    "Biography Memoir"
  ],
  "author": "Darryl Pinckney",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/59808575-come-back-in-september"
}