{
  "title": "The Sultana Odyssey: A Civil War Novel Based on America's Worst Maritime Tragedy",
  "description": "\"This disaster, of which I am writing, was the greatest accident that ever happened during the war, and neither pen nor tongue can describe it.\" -Jacob Horner, Sultana Survivor The worst maritime accident in American history killed 1,600 steamship passengers, many starving just released Union prisoners returning north after the Civil War. Explosion of faulty boilers onboard the Sultana early morning on April 27, 1865 sent hundreds of men and women into the frigid Mississippi River near Memphis. Inspired by actual events, The Sultana Odyssey chronicles the tragedy of 2,300 travelers packed on a steamship built for 400 and the perseverance to survive against nearly impossible probabilities. It follows the journey of young Chicago doctor Finley Horne through the south and his efforts to return his sister from Alabama. Mistakenly tossed into a confederate prison camp, he experiences the atrocities and savagery of southern captivity before escaping and accompanying U.S. Colored Troops transporting their wounded by pushing an abandoned rail boxcar. The graphic and raw narrative captures the country's mood, greed, passion, values, and all against an historic backdrop of war and prejudice. Included are realities of an indelible blemish on American rampant death, starvation, abuses, and exposure to deadly diseases responsible for most Civil War fatalities. The doctor's journey concludes aboard the Sultana when explosion catapults sleeping passengers hundreds of yards into the Mississippi River and toward watery graves. Actual reminiscences of survivors reveal graphic and catastrophic efforts treading dark murky water toward a distant shoreline - all shadowed by a raging inferno consuming the steamboat's wood construction and burning alive helpless emaciated prisoners and amputees. Because it occurred days following the assassination of Abraham Lincoln, the tragic story of the Sultana remains to this day a little-known footnote of The War Between the States. This book contains graphic content some readers may find disturbing.",
  "genres": [],
  "author": "Paul Brennan",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/59813576-the-sultana-odyssey"
}