{
  "title": "Off With Her Head: Three Thousand Years of Demonizing Women in Power",
  "description": "New York Times  bestseller Eleanor Herman, author of  Sex with Kings  and  Sex with Presidents,  returns with another work of popular history, exploring the history of misogyny against women with power from Cleopatra to Kamala Harris.Imagine Donald Trump as a woman, called Donna. Would Donna Trump have been viewed as blunt, honest, and refreshing? Would she have won the election? Imagine Hillary Clinton as a man. Howard Clinton says and does the exact same things as Hillary. Would Howard Clinton have been portrayed in a thousand Pinterest images as a witch, stirring a cauldron or riding a broomstick? Would he have been called a bitch on countless T-shirts? Would his thoughtful, circumspect answers to media questions have been seen as inauthenticity, secretiveness, and untrustworthiness? There is a particular kind of rage—let’s call it unadulterated bloodlust—usually reserved for women, especially women in power or vying for it. From the ancient world, through the European Renaissance, up to the most recent U.S. elections, the Misogynist’s Handbook, as Eleanor Herman calls it, has been wielded to put uppity women in their place. In a story that is shocking, eye-opening, and a powerful force for change, Eleanor Herman’s signature wit and humor explores the patterns that have been operating for more than three thousand years—and are still operating today—against powerful women across the globe, including Cleopatra, Anne Boleyn, Marie Antoinette, Catherine the Great, Hillary Clinton, Kamala Harris, and more. Each chapter analyzes a tried-and-true misogynistic method to keep women down, Her Overweening Ambition, Why Doesn’t She Do Something About Her Hair?, The Dangers of Female Hormones, The Alarming Shrillness of Her Voice, The Mysterious Unlikability of Female Candidates, She’s a Bitch and Other Animals, She’s a Witch and Other Monsters, and Her Sexual Depravity. Herman ends the book by looking forward, examining ways to rip up the Misogynist’s Handbook once and for all.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Politics",
    "Womens",
    "Historical",
    "Audiobook"
  ],
  "author": "Eleanor Herman",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/59811263-off-with-her-head"
}