{
  "title": "The Fairest Maidens Medieval Romance Collection: Sweet Medieval Romance",
  "description": "In a land where being the fairest maiden is a curse . . .Inspired by three classic fairy tales, this ebook collection by best-selling author Jody Hedlund takes readers back to the time of castles, brave knights, and daring damsels. Beholden is inspired by Cinderella, Beguiled is a Snow White retelling, and Besotted is based upon Sleeping Beauty.BeholdenA beautiful noblewoman with a terrible secret, and a prince subjected to slavery.Upon the death of her wealthy father, Lady Gabriella is condemned to work in Warwick’s gem mine. As she struggles to survive the dangerous conditions, her kindness and beauty shine as brightly as the jewels the slaves excavate. While laboring, Gabriella plots how to avenge her father’s death and stop Queen Margery’s cruelty.BeguiledA princess rejected and hunted by her mother, and a prince who lives as a shunned outcast.Princess Pearl flees for her life after her mother, Queen Margery, tries to have her killed during a hunting expedition. Pearl finds refuge on the Isle of Outcasts among criminals and misfits, disguising her face with a veil so no one recognizes her. She lives for the day when she can return to Warwick and rescue her sister, Ruby, from the queen’s clutches.BesottedA young queen trying to stay alive until she comes of age to rule, and a prince turned into a pauper.Queen Aurora of Mercia has spent her entire life deep in Inglewood Forest, hiding from Warwick’s Queen Margery, who seeks her demise. As the time draws near for Aurora to take the throne, she happens upon a handsome woodcutter. Although friendship with outsiders is forbidden and dangerous, she cannot stay away from the charming stranger.For a complete list of Jody's YA and Historical Romance novels, visit her Amazon page or website - jodyhedlund.com",
  "genres": [
    "Fantasy"
  ],
  "author": "Jody Hedlund",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/59815371-the-fairest-maidens-medieval-romance-collection"
}