{
  "title": "Until We Break",
  "description": "Dance like everyone's watching. Because they are.As the only Black student at her ballet academy, Naomi Morgan knows her feelings of isolation and artistic sacrifice are the price she has to pay in order to win the Youth American Grand Prix, the country’s most prestigious dance competition. Winning means access to a spot in a top ballet school and, ultimately, a place with The New York City Ballet. Nothing else matters.But when Naomi’s dance instructor assigns her Odette’s variation from Swan Lake, Naomi’s world begins to fall apart. She doesn’t think she can dance the part—and her doubts become the loudest voice in her head. Her best friend, Jessica, used to be her sounding board, her support, her co-star—and even though Jessica died in a freak car accident, Naomi still sees and hears her everywhere.She’s been burying her grief by focusing on her dancing. But when an injury steals that refuge, Naomi’s mental health deteriorates and she starts to seek answers outside of her carefully constructed reality. Then one night, she meets Saint, a street artist, and he opens up an entirely new world for her. A world that’s not connected to dance.Saint spends his nights creating brilliant and beautiful messages of social change that the world needs to hear. In their sleepy California town, he wants to mix it up—to force the world to see him as he is—he’s got a voice and isn’t afraid to use it. Even if his family life is tough. Even if the same avenues that are open to Naomi are not open to him.Together they both learn that there’s no one right way to be in the world. For Naomi, this means that maybe dance isn’t the only choice for her. Maybe her voice can be louder off stage, and she can shine in a different kind of spotlight. Maybe she and Saint will shine together and everything will be different in the best possible way.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Realistic Fiction",
    "Mental Health",
    "Sports",
    "Young Adult Contemporary"
  ],
  "author": "Matthew   Dawkins",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/59808507-until-we-break"
}