{
  "title": "The Grand Affair: John Singer Sargent in His World",
  "description": "A Wall Street Journal and Times Literary Supplement B ook of the Year | Long-listed for the Plutarch AwardA bold new biography of the legendary painter John Singer Sargent, stressing the unruly emotions and furtive desires that drove his innovative work and defined the transatlantic, fin de siècle culture he inhabited.A great American artist, John Singer Sargent is also an abiding enigma. While dressing like a businessman and crafting a highly respectable persona, he scandalized viewers on both sides of the Atlantic with the frankness and sensuality of his work. He charmed the nouveaux riches as well as the old money, but he reserved his greatest sympathies for Bedouins, Spanish dancers, and the gondoliers of Venice. At the height of his renown in Britain and America, he quit his lucrative portrait-painting career to concentrate on allegorical murals with religious themes―and on nude drawings of male models that he kept to himself.In The Grand Affair , the historian Paul Fisher offers a vivid life of the buttoned-up artist and his unbuttoned work. Sargent’s nervy, edgy portraits exposed illicit or dark feelings in himself and his sitters―feelings that high society on both sides of the Atlantic found fascinating and off-putting. Fisher traces Singer’s life from his wandering trans-European childhood to the salons of Paris, and the scandals and enthusiasms he caused, and on to London. There he mixed with eccentrics and aristocrats, and the likes of Henry James and Oscar Wilde, while at the same time forming a close relationship with a lightweight boxer who became his model, valet, and traveling partner. In later years, Sargent met up with his friend and patron Isabella Stewart Gardner around the world and devoted himself to a new model, the African American elevator operator and part-time contortionist Thomas McKeller, who would become the subject of some of Sargent’s most daring and powerful work.Illuminating Sargent’s restless itinerary, Fisher explores the enigmas of fin de siècle sexuality and art, fashioning a biography that grants the man and his paintings new and intense life.",
  "genres": [
    "Biography",
    "Art",
    "Nonfiction",
    "Art History",
    "History",
    "Biography Memoir",
    "American History"
  ],
  "author": "Paul Fisher",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/59808580-the-grand-affair"
}