{
  "title": "Back to the Garden",
  "description": "A fifty-year-old cold case involving California royalty comes back to life—with potentially fatal consequences—in this gripping standalone novel from the New York Times bestselling author of the Mary Russell and Sherlock Holmes seriesThe Gardener Estate is one of the most storied and beloved places on the West Coast: a magnificent house in vast formal grounds, home to a family that shaped California—and fought hard to conceal the turmoil and eccentricities within their walls.  And now, just as the turmoil seems buried and the Estate prepares to move into a new future, construction work unearths a grim relic of the estate’s history: a skull, hidden away some fifty years ago. Inspector Raquel Laing of the SFPD Cold Case Unit has her work cut out for her. Back in the '70s, the Estate was a commune, when its young heir, Rob Gardener, turned the palatial setting into a counterculture Eden of peace, love, and equality. But the '70s were also a time when serial killers preyed on such innocents—monsters like The Highwayman, whose case has just assumed a whole new urgency. Could these bones belong to one of his victims? For Raquel Laing—a woman who knows all about hidden turmoil and eccentricities—the Gardener bones seem clearly linked to The Highwayman. But as she dives into the Estate’s archives for evidence of his presence, what she finds there begins to take on a dark reality of its own. Everything brings her back to Rob Gardener himself—now a gray-haired recluse, then a troubled young Vietnam vet whose girlfriend vanished after a midsummer festival at the Estate, fifty years ago. But a lot of people seem to have disappeared from the Gardener Estate that summer, when the commune fell apart and its residents scattered: a young woman, her child, Rob’s brother Fort… The pressure is on, and Raquel needs to solve this case—before The Highwayman slips away, or another Gardener vanishes.",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Thriller",
    "Adult"
  ],
  "author": "Laurie R. King",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/59816908-back-to-the-garden"
}