{
  "title": "Shirley Hazzard: A Writing Life",
  "description": "The first biography of Shirley Hazzard, the author of The Transit of Venus and a writer of “shocking wisdom” and “intellectual thrill” ( The New Yorker ).Shirley A Writing Life tells the extraordinary story of a great modern novelist. Brigitta Olubas, Hazzard’s authorized biographer, has drawn, with great subtlety and understanding, on her fiction (itself largely based on Hazzard’s own experience); on an extensive archive of letters, diaries, and notebooks; and on the memories of surviving friends and colleagues to create this resonant portrait of an exceptional woman.This biography explores the distinctive times of Hazzard’s life, from her youth and middle age to her widowhood and years of decline, and traces the complex and intricate processes of self-fashioning that lay beneath Hazzard’s formidable, beguiling presence. Olubas shows us the places of Hazzard’s life, of which she wrote with characteristic her childhood in Depression-era Sydney; her youth in postwar Hong Kong, New Zealand, and London; her years in New York in the 1950s, working at the United Nations and The New Yorker . Olubas also describes Hazzard’s long marriage to the writer Francis Steegmuller and their deep involvement in postwar Naples and Capri. Rare photographs from Hazzard’s collection and elsewhere accompany the text.Hazzard was the last of a generation of self-taught writers, devotees of a great literary tradition, and her depth of perception and expressive gifts have earned her iconic status. Brigitta Olubas has brought her brilliantly alive, enhancing and deepening our understanding of the singular woman who created some of the most enduring fiction of the past sixty years.As Dwight Garner wrote in The New York Times , “Hazzard’s stories feel timeless because she understands, as she writes in one of ‘We are human beings, not rational ones.’” Here, in Shirley Hazzard , is the story of a remarkable human being.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Australia",
    "Biography Memoir",
    "Writing",
    "Memoir"
  ],
  "author": "Brigitta Olubas",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/59808581-shirley-hazzard"
}