{
  "title": "Direwood",
  "description": "In this velvet-clad 1990s gothic horror, Aja encounters a charming vampire who wants to lure her into the woods—just like her missing sister.No one ever pays attention to sixteen-year-old Aja until her perfect older sister Fiona goes missing. In the days leading up to Fiona’s disappearance, Aja notices some extraordinary things: a strange fog rolling through their idyllic suburban town, a brief moment when the sky seems to rain blood, and a host of parasitic caterpillars burrowing their way through the trees. Aja’s father, the neighbors, and even her ex-friend Mary all play down this strange string of occurrences, claiming there must be some natural explanation. It seems everyone is willing to keep living in denial until other teens start to go missing too.Aja is horrified when she meets Padraic, the vampire responsible for all the strange occurrences. His hypnotic voice lures her to the window and tells her everything she’s longed to hear—she’s beautiful and special, and he wants nothing more than for Aja to come with him. Aja knows she shouldn’t trust him, but she’s barely able to resist his enthrallment. And following him into the woods may be the only way to find Fiona, so she agrees on one condition: He must let her leave alive if she is not wooed after one week. Though Aja plans to kill him before the week is out, Padraic has his own secrets as well.In the misty woods, Aja finds that Padraic has made his nest with another vampire in a dilapidated church infested by blood-sucking butterflies. Within its walls, the vampires are waited on and entertained by other children they’ve enthralled, but there is no sign of Fiona. Before her bargain is up, Aja must find a way to turn her classmates against their captors, find her sister, and save them all—or be forced to join the very monsters she wants to destroy.",
  "genres": [
    "Horror",
    "Vampires",
    "Fantasy",
    "Young Adult",
    "Gothic",
    "Paranormal",
    "Audiobook"
  ],
  "author": "Catherine  Yu",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/59808501-direwood"
}