{
  "title": "Waging a Good War: A Military History of the Civil Rights Movement, 1954-1968",
  "description": "#1 New York Times bestselling author and Pulitzer Prize winner Thomas E. Ricks offers a new take on the Civil Rights Movement, stressing its unexpected use of military strategy and its lessons for nonviolent resistance around the world.“Ricks does a tremendous job of putting the reader inside the hearts and souls of the young men and women who risked so much to change America . . . Riveting.” ―Charles Kaiser, The GuardianIn Waging a Good War , the bestselling author Thomas E. Ricks offers a fresh perspective on America’s greatest moral revolution―the civil rights movement of the 1950s and 1960s―and its legacy today. While the Movement has become synonymous with Martin Luther King, Jr.’s ethos of nonviolence, Ricks, a Pulitzer Prize–winning war reporter, draws on his deep knowledge of tactics and strategy to advance a surprising but revelatory idea: the greatest victories for Black Americans of the past century were won not by idealism alone, but by paying attention to recruiting, training, discipline, and organization―the hallmarks of any successful military campaign.An engaging storyteller, Ricks deftly narrates the Movement’s triumphs and defeats. He follows King and other key figures from Montgomery to Memphis, demonstrating that Gandhian nonviolence was a philosophy of active, not passive, resistance―involving the bold and sustained confrontation of the Movement’s adversaries, both on the ground and in the court of public opinion. While bringing legends such as Fannie Lou Hamer and John Lewis into new focus, Ricks also highlights lesser-known figures who played critical roles in fashioning nonviolence into an effective tool―the activists James Lawson, James Bevel, Diane Nash, and Septima Clark foremost among them. He also offers a new understanding of the Movement’s later difficulties as internal disputes and white backlash intensified. Rich with fresh interpretations of familiar events and overlooked aspects of America’s civil rights struggle, Waging a Good War is an indispensable addition to the literature of racial justice and social change―and one that offers vital lessons for our own time.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Race",
    "American History",
    "Military History",
    "Military Fiction"
  ],
  "author": "Thomas E. Ricks",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/59808602-waging-a-good-war"
}