{
  "title": "Toad",
  "description": "A previously unpublished novel of the reflections of a deeply scarred and reclusive woman, from the cult icon Katherine Dunn, the author of Geek Love. Sally Gunnar has been in love, has been mad, has been an agent of destruction, has been spurned; and now she has retreated from the world. She lives in isolation in her small house, where her only companions are a vase of goldfish, a garden toad, and the door-to-door salesman who sells her cleaning supplies once a month. From her comfortable perch, she broods over her deepest regrets: her wayward, weed-hazy college days; her blighted romance with a scornful poet; a tragically comic accident involving a paper cutter; a suicide attempt; and her decision to ultimately relinquish a conventional life.Colorful, crass, and profound, Toad is Katherine Dunn’s ode to her time as a student at Reed College, filled with the same keen observations, taboo-shirking verve, and singular characters that made Geek Love a cult classic. Through the perceptive Sally, a fish out of water among a cadre of eccentric, privileged young people, we meet Sam, an unwashed collector of other people’s stories; Carlotta, a free spirit who nevertheless fails to escape the deception of marriage; and Rennel, a shallow, self-obsessed philosophy student. With sly self-deprecation and mordant wit, Sally recounts their misadventures, up to the tragedy that tore them apart.Through it all, Toad demonstrates Dunn’s genius for black humor and irony, her ecstatic celebration of the grotesque. Daring and bizarre, Toad is a brilliant precursor to the book that would make Dunn a misfit hero—even fifty-some years after it was written, it’s a refreshing take on the lives of young outsiders treading the delicate lines between isolation and freedom, love and insanity, hatred and friendship.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Audiobook",
    "Adult",
    "Mental Health",
    "Novels"
  ],
  "author": "Katherine Dunn",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/59808588-toad"
}