{
  "title": "Trusting Fate",
  "description": "For the first time in her life, Grace Wells had no idea what the future held. After being offered partner at the law firm she’d worked at for the past decade she surprised even herself when she handed in her resignation, packed up her life, put her condo up for sale, and jumped in her Range Rover to head for Hope Falls.She was already questioning her sanity when she found herself stranded on the side of a mountain road, in a snowstorm, with a flat tire. Things went from bad to worse when headlights shone in her rearview mirror, and her first thought was a psycho was coming to kill her. When she rolled down the window and saw the face of the most perfect male specimen on the planet, she was no longer in fear for her life...but her heart was another story.For the first time in his life, Easton Bishop knew exactly what the future held. After nearly fifteen years of nomadic living across the globe, he was finally putting down roots. His plan was to spend the next year of his life writing the novel he’d been putting off for the past three years, and more importantly, reconnecting with his family who he’d barely seen over the past decade and a half. That plan was immediately sidetracked when he showed up to surprise his parents only to find out they were on a three-week vacation in Palm Springs.Always one to roll with the punches, he hopped in his 1989 Ford pickup truck and decided to make the three-hour drive to Hope Falls where his brothers lived. He found himself sidetracked once again when he saw a white SUV on the side of the road with its hazards on. When the driver turned out to be a knockout blonde with eyes bluer than the Mediterranean and lips that made him sweat in below-freezing temperatures, he knew that his plans might need to be expanded to include her.Author’s Note: Trusting Fate is an opposites-attract, lust-at-first sight, fake(ish) relationship, small-town Hope Falls romance. This HEA includes (but is not limited to): a competition reality show, a type-A control-freak heroine, a unicorn go-with-the-flow Alpha (with a capital A) hero, meddling siblings, a colorful cast of townspeople, an extremely jealous rescue cat, cold days and very hot nights. Side effects of reading this book may include swooning, sighing, falling in love, and a strong desire to move to and/or visit Hope Falls (which, full disclosure, is a fictional town). Read at your own risk.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Melanie Shawn",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/59824802-trusting-fate"
}