{
  "title": "صور وخواطر",
  "description": "نظرت من النافذة فإذا كل شيء أراه نائم، هذه النخلة التي تقوم حيال شباكي، وقبة الأعظمية التي تبدو من ورائها في عظمة وجلال ودجلة التي تجري صامتة مهيبة، والقمر الذي يغسل ماءها بشعاعه... وإذا على الطريق شيخ يسير منهوكاً! على الطريق الذي يمتد في سهل ولا وعر، ولا يسير على سفح جبل، ولا شاطئ ولا بحر، ولا يسلك صحراء، ولا يخترق البساتين.. ولكنه يلف السهل والوعر، والجبل والبحر، والصحراء والبساتين وكل ما تحتويه، ومن يكون فيها.. على الطريق الطويل الذي يلوح كخط أبيض، يغيب أوله في ظلام الأزل، ويختفي آخره في ضباب الأبد... رأيت شبحاً يسير على.. طريق الزمان! وسمعت صائحاً بالدنيا النائمة: تيقظي أن العالم يرحل الآن! ففتحت النخلة عينيها ونظرت، فلما رأته قالت: قد رأيت عشرات مثله تأتي وتذهب، فلم تبدل شيئاً... الفأس لا تزال باقية، وهذا الوحش البشري لا يزال ينتظر تمري ليسلبنيه، ثم إذا قنط مني كافأني بلذع النار... فمالي وللعالم الراحل؟ وأغمضت عينيها فنامت، ولم تكترث! ونظرت القبة، فلما أبصرته قالت: قد رأيت مئات مثله تجيء، وتروح ولم تبدل شيئاًفهذا النخيل قائم حولي كما كان، والشمس تطلع عليَّ كل يوم وتغيب، والنجوم تسطع فوقي كل ليلة، والأرض تنتظرني، تريد أن أهرم فتجذب أحجاري إليها وتأكلني... وكل شيء على حاله، لم يتبدل إلا الإنسان: كان الخليفة يمشي تحت، ويخطر بين أساطين في حلل المجد وأردية الجلال، إن أمر أطاعت الدنيا، وإن نادى لبَّى الدهر، وإن مال مالت الأرض، وكان الناس يطيفون بي أجلة أمجاداً، عباداً أذلاء لله، وملوكاً أعزه على الناس.. فأصبحت وحيدة بعزلة، لا أرى إلا هذه الفئات من العامة المساكين الذين تعرّوا من كل جاه إلا جاه العبادة، ومجد إلاّ مجد الآخرة... فمالي وللعام الراحل؟ وأغمضت عينيها، وعادت تحلم، ولم تكترث!... وأنصت القمر وأطلّ ينظر، فلما رأى العام الراحل قال: لقد رأيت ملايين مثله وقد مللت مرّ السنين وكرّ العصور، فمالي وله؟ وعاد يفيض نوره على الكون ولم يكترث! وبقيت وحدي! بقيت وحيداً...في هذا النص المقتبس من كتابه صور وخواطر والذي جاء تحت عنوان بيني وبين نفسي لمحات إنسانية فلسفية أودعها الكاتب هذا النص كما باقي نصوصه التي شكلت مادة هذه المجموعة من مؤلفات المبدع علي الطنطاوي. يأخذ الشيخ الدكتور الطنطاوي القارئ على حيث يجد ذاته أحياناً أو يجد آخرين شكلوا أحياناً شخصيات بعض قصصه أو بعض خواطره. تنوعت كتابات الطنطاوي في مجموعته هذه لتشكل عملاً أدبياً جرى في نفسه حكمة الكاتب فلسفته وشفافيته وإبداعه الأدبي بالإضافة إلى ناحية لا يجب إغفالها وهي أن الطنطاوي قدّم مادة عكس من خلالها صورة مجتمعة بكافة جوانبه الإنسانية والحياتية، من هنا كان لا بد من إيحاء أعمال الراحل الطنطاوي من خلال إعادة نشر هذه المجموعة صور وخواطر، قصص من الحياة، قصص من التاريخ، مع الناس.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Essays",
    "Philosophy",
    "Islam",
    "Literature",
    "History"
  ],
  "author": "علي الطنطاوي",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/12841602"
}