{
  "title": "Everything for You",
  "description": "Gear up for an all-the-feels, steamy slow-burn in this enemies-to-lovers sports romance about fighting for love when life’s taught you it’s a losing game.GavinWe’ve been teammates for two years, but it feels like a lifetime that Oliver Bergman’s been on my last nerve. A demanding captain and veteran player, I’m feared and friendless, while he’s the beloved rising star, all sunshine smiles and upbeat team spirit. To make matters worse, he’s obscenely attractive. In short: he’s genetically designed to get under my skin.Avoiding Oliver has been my survival tactic on and off the field. But when Coach drops the bomb that we’re now co-captains, avoiding him becomes impossible, and keeping the truth from him–let alone my distance–is harder than ever.OliverLife was great until soccer legend Gavin Hayes joined the team and proved he’s nothing like the guy I grew up idolizing. Instead, he’s a giant–albeit gorgeous–grump who lives to rain on my parade. I’ve sworn off pranks since entering the public eye, so rather than settle our differences the Bergman way, I’ve had to settle for killing Gavin with kindness. There’s just one problem: killing him with kindness is killing me.To make matters worse, Coach gives us an ultimatum: put an end to our enmity or say goodbye to being captains. I’m prepared to be miserable while we meet her demands and make nice, but the last thing I expect is to discover an explosive attraction we can’t help but act on, and worse yet, to realize the man hiding beneath Gavin’s gruff exterior is all I’ve ever wanted.​Everything for You is a grumpy-sunshine, enemies-to-lovers, age gap sports romance about an upbeat rising soccer star with anxiety and his curmudgeonly veteran teammate who lives with chronic pain. Complete with nosy senior citizens, nosier siblings, and a meddling coach, this standalone slow burn is the fifth in a series of novels about a Swedish-American family of five brothers, two sisters, and their wild adventures as they each find happily ever after.",
  "genres": [
    "Romance",
    "Sports Romance",
    "Enemies To Lovers",
    "LGBT",
    "Sports",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Chloe Liese",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/59824159-everything-for-you"
}