{
  "title": "If All Else Fails...",
  "description": "A collection. The pages reek with despair at the loss of Native American culture. With an Introduction by Jorge Luis Borges. Craig Strete, one of the few Native American SF authors, picked up three Nebula Award nominations for short SF, two of which are included in this collection of his excellent work. The television, an embodiment of the white man's control of mass culture, declares the Native American is a figment of the past, not of the present. Original authors such as Craig Strete, with distinct and diverse voices, who tackle tough themes such as oppression, the effects of technology, and Native American myth in a literary and experimental manner, are too often neglected in the grand narratives of SF’s past.Contents: Saturday Night at the White Woman Watching Hole (1980) / short fiction by Craig Kee Strete All My Statues Have Stone Wings (1980) / short fiction by Craig Kee Strete Ten Times Your Fingers and Double Your Toes (1980) / short fiction by Craig Kee Strete Piano Bird (1980) / short fiction by Craig Kee Strete To See the City Sitting on Its Buildings (1975) / short fiction by Craig Kee Strete A Horse of a Different Technicolor (1975) / short fiction by Craig Kee Strete Time Deer (1974) / short fiction by Craig Kee Strete Where They Put the Staples and Why She Laughed (1980) / short fiction by Craig Kee Strete A Place to Die on the Photograph of Your Soul (1980) / short fiction by Craig Kee Strete With the Pain It Loves and Hates (1976) / short fiction by Craig Kee Strete When They Go Away (1980) / short fiction by Craig Kee Strete Who Was the First Oscar to Win a Negro? (1976) / short fiction by Craig Kee Strete Every World with a String Attached (1980) / short fiction by Craig Kee Strete Why Has the Virgin Mary Never Entered the Wigwam of Standing Bear? (1976) / short fiction by Craig Kee Strete Your Cruel Face (1976) / short fiction by Craig Kee Strete Just Like Gene Autry: A Foxtrot (1976) / short fiction by Craig Kee Strete Old, So Very Old, and in That Wisdom, Ageless (1980) / short fiction by Craig Kee Strete When They Find You (1977) / short fiction by Craig Kee Strete The Bleeding Man (1974) / short fiction by Craig Kee Strete.",
  "genres": [],
  "author": "Craig Kee Strete",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/598232.If_All_Else_Fails_"
}