{
  "title": "Den of Monsters",
  "description": "I woke to the soothing sound of a peaceful serenade.Except there’s nothing peaceful about being kidnapped after being sold to the Devils of Sin.This never should have happened, because I did everything right. I accepted the invitation, attended the masquerade in the depth of the forsaken forest, and danced with whomever requested. The longer one remains, the more debt is cleared from the family name, so I danced through the night.I survived to the final note — and let me emphasize the “survive” part — but I’m starting to realize where the real problem lies. I didn’t dance with one suitor...I danced with five Devils, and each immediately laid a claim on me.Joaquin. Talon. Dagger. Croix. Creed.Now here I am, kidnapped and held for ransom by sick men with bigger debts and troubles than my bankrupt family and their dark organization combined, but I’m no damsel in distress.I’m actually stalling.There’s a rumor that the Devils of Sin are dangerous men of royal stature during the day and ruthless monsters at the peak of the night. I want to see them again…to touch and enjoy the illusions that left me panting for more.I’m willing to enter the den of monsters to escape the true demons lurking in the shadows of desperation.All in exchange for my freedom.DEN OF MONSTERS is a steamy 187,000+ words STANDALONE. This reverse harem monster romance is filled with possessive monsters with a hint of psychosis, a badass FMC who may be even crazier, and loads of \"bump in the dark\" heated scenes that will make one blush in public - literally. Note that these den of sinister monsters can do various \"things\" with their bodies, so be warned. All sexual encounters are consensual.",
  "genres": [
    "Reverse Harem",
    "Monsters",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Demons"
  ],
  "author": "Avery Song",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/59826418-den-of-monsters"
}