{
  "title": "Specters of the Atlantic: Finance Capital, Slavery, and the Philosophy of History",
  "description": "In September 1781, the captain of the British slave ship Zong ordered 133 slaves thrown overboard, enabling the ship’s owners to file an insurance claim for their lost “cargo.” Accounts of this horrific event quickly became a staple of abolitionist discourse on both sides of the Atlantic. Ian Baucom revisits, in unprecedented detail, the Zong atrocity, the ensuing court cases, reactions to the event and trials, and the business and social dealings of the Liverpool merchants who owned the ship. Drawing on the work of an astonishing array of literary and social theorists, including Walter Benjamin, Giovanni Arrighi, Jacques Derrida, and many others, he argues that the tragedy is central not only to the trans-Atlantic slave trade and the political and cultural archives of the black Atlantic but also to the history of modern capital and ethics. To apprehend the Zong tragedy, Baucom suggests, is not to come to terms with an isolated atrocity but to encounter a logic of violence key to the unfolding history of Atlantic modernity. Baucom contends that the massacre and the trials that followed it bring to light an Atlantic cycle of capital accumulation based on speculative finance, an economic cycle that has not yet run its course. The extraordinarily abstract nature of today’s finance capital is the late-eighteenth-century system intensified. Yet, as Baucom highlights, since the late 1700s, this rapacious speculative culture has had detractors. He traces the emergence and development of a counter-discourse he calls melancholy realism through abolitionist and human-rights texts, British romantic poetry, Scottish moral philosophy, and the work of late-twentieth-century literary theorists. In revealing how the Zong tragedy resonates within contemporary financial systems and human-rights discourses, Baucom puts forth a deeply compelling, utterly original theory of one that insists that an eighteenth-century atrocity is not past but present within the future we now inhabit.",
  "genres": [
    "History",
    "Nonfiction",
    "Literary Criticism",
    "Economics",
    "Theory",
    "Philosophy",
    "Sociology"
  ],
  "author": "Ian Baucom",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/598192.Specters_of_the_Atlantic"
}