{
  "title": "Dead Things",
  "description": "Dead Things is an amalgam of Clerks and everything Crichton and Zombieland. It's an homage to Romero and fan boys everywhere.Nearly two decades have passed since the fall of the United States and the rise of the church to fill the void. Science is heresy, and the dead must be decapitated to avoid an unholy resurrection. When a plane crash strands Ian Sumner and a band of survivors miles from the fortified walls of the church state, survival depends on secrets too dangerous to speak aloud.“Matt Darst is a truly original talent. His quick pacing, encyclopedic grasp of literature and history, and spellbinding mix of social commentary and jaw-dropping action make Dead Things a first-rate triumph. With a dash of Bradbury, hints of Huxley and Orwell, and heavy dollops of smart pop culture, Darst is taking the zombie novel in a really cool new direction, and you’re going to love every page of it. Hang on, if you can, because this guy has written a future history that will rattle every nerve you’ve got.”- Joe McKinney, author of Dead City and Apocalypse of the Dead“A first-class zombie story which takes place in a beautifully realized post-apocalyptic world. In many ways a spiritual cousin to Matheson’s classic I am Legend, this is a fantastic and surprising horror tale. Highly recommended.”- David Moody, author of Them or Us and Autumn“Matthew Darst is a writer who shares my Romero-esque love of zombies. Ever true to the vision of the zombie holocaust brought to us by Night of the Living Dead, Darst brings the collapse of civilization up to date. Darst brings us a startling real glimpse of the cause of the zombie contagion.”-Iain McKinnon, author of Domain of the Dead and Remains of the Dead“Darst effortlessly weaves conflicting views of science and religion into this futuristic wasteland of embattled survivors. He dives into subjects of biology, mythology, astronomy, history, and the natural order of the universe, creating something that lives and breathes of its own volition. I thoroughly enjoyed this book, and I’d recommend it to any horror fan, especially those with big thirsty brains.”-Eric Dimbleby, author of Please Don’t Go and A Beast in Spring“Matt Darst…writes masterfully in the genre and fine art of zombie horror, and Dead Things is the zombie novel for the rest of us. You know…the readers who do not really ‘get’ the deep dark obsession with the ghouls? Well, even if you have a subtle disdain for anything flesh-eating, do yourself a favor and pick up Dead Things. It— in a word — is brilliant. The plot line is perfect, the characters flawless and the solution is so simple that it is entirely plausible. Even zombie-purists cannot help but enjoy this book that takes the reader off the beaten path of zombification.”- Sylvia Cochran, The Deepening World of Fiction“This book is a breath of fresh air within a very busy genre. Darst's writing style can be incredibly fervent at times, his expansion on ideas, fresh ideas, is intelligent moving, and in places funny. His creation of a complete post apocalyptic society based on fundamental Christian ideals is a master-stroke, and makes the divide between them and us a far bigger chasm.”- Paul Huggins, ZombieJunky.com“A fabulous debut novel. Darst excels in creating a unique vision of the aftermath of America after the dead begin to rise. The characters are well written, and I found myself getting emotionally invested. Darst took special care with this book, and it absolutely shows. The zombie action is used with razor sharp efficiency. This is a great read, and I cannot recommend it highly enough.”- Chip Fehd, BuyZombie.com\"Darst uses a number of nifty maneuvers to keep this a fresh offering. The dialogue is smart and witty. The science behind the story is very well thought out. A well-written, smartly entertaining debut.\" - John Boden, ShockFinalist for the 2012 eFestival of Words Best of Independent Books Award for Horror",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction",
    "Post Apocalyptic",
    "Apocalyptic",
    "Dystopia",
    "Mystery"
  ],
  "author": "Matt Darst",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/12841935-dead-things"
}