{
  "title": "Otto Preminger: The Man Who Would Be King",
  "description": "The first full-scale life of the controversial, greatly admired yet often underrated director/producer who was known as “Otto the Terrible.”Nothing about Otto Preminger was small, trivial, or self-denying, from his privileged upbringing in Vienna as the son of an improbably successful Jewish lawyer to his work in film and theater in Europe and, later, in America.His range as a director was romantic comedies ( The Moon Is Blue ); musicals ( Carmen Jones ; Porgy and Bess ); courtroom dramas ( The Court-Martial of Billy Mitchell; Anatomy of a Murder ); adaptations of classic plays (Shaw's Saint Joan , screenplay by Graham Greene); political melodrama ( Advise and Consent ); war films ( In Harm's Way ); film noir ( Laura; Angel Face; Bunny Lake Is Missing ). He directed sweeping sagas (from The Cardinal and Exodus to Hurry Sundown ) and small-scale pictures, adapting Françoise Sagan's Bonjour Tristesse with Arthur Laurents and Nelson Algren's The Man with the Golden Arm.Foster Hirsch shows us Preminger battling studio head Darryl F. Zanuck; defying and undermining the Production Code of the Motion Picture Association of America and the Catholic Legion of Decency, first in 1953 by refusing to remove the words \"virgin\" and \"pregnant\" from the dialogue of The Moon Is Blue (he released the film without a Production Code Seal of Approval) and then, two yeras later, when he dared to make The Man with the Golden Arm, about the then-taboo subject of drug addiction. When he made Anatomy of a Murder in 1959, the censors objected to the use of the words \"rape,\" \"sperm,\" \"sexual climax,\" and \"penetration.\" Preminger made one concession (substituting \"violation\" for \"penetration\"); the picture was released with the seal, and marked the beginning of the end of the Code.Hirsch writes about how Preminger was a master of the \"invisible\" studio-bred approach to filmmaking, the so-called classical Hollywood style (lengthy takes; deep focus; long shots of groups of characters rather than close-ups and reaction shots).He shows us Preminger, in the 1950s, becoming the industry's leading employer of black performers—his all-black Carmen Jones and Porgy and Bess remain landmarks in the history of racial representation on the American screen—and breaking another barrier by shooting a scene in a gay bar for Advise and Consent , a first in American film.Hirsch tells how Preminger broke the Hollywood blacklist when, in 1960, he credited the screenplay of Exodus to Dalton Trumbo, the most renowed of the Hollywood Ten, and hired more blacklisted talent than anyone else.We see Preminger's balanced style and steadfast belief in his actors' underacting set against his own hot-tempered personality, and finally we see this European-born director making his magnificent films about the American criminal justice system, Anatomy of a Murder , and about the American political system, Advise and Consent .Foster Hirsch shows us the man—enraging and endearing—and his brilliant work.",
  "genres": [
    "Film",
    "Biography",
    "Nonfiction"
  ],
  "author": "Foster Hirsch",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/598246.Otto_Preminger"
}