{
  "title": "Naughty Nooners Anthology",
  "description": "Indulge Me by Kaenar LangfordKeane Daniels has received an anonymous note summoning him to Indulgence, one of the largest gay spa and bathhouses in Toronto. Since he's in unrequited lust with his boss, Keane thinks a clandestine tryst might just take his mind off his gorgeous colleague.Rayche Marquette has wanted Keane since hiring him, but being his boss means Keane's off limits...until Rayche decides he can wait no longer and reserves the Wet Area of the spa so the two of them can spend a Naughty Nooner together.Rayche and Keane meet in the elegant shower area, but when Keane discovers the sender of the note is his boss, his reaction is not what Rayche expects. Keane rebuffs him, thinking the lunch hour adventure is a lark for Rayche, a meaningless liaison. For Keane, that can never be enough with this man. How can he convince Rayche to turn their Naughty Nooner into a lifetime commitment?Dalton's Awakening by Carol LynneAfter weathering a bitter divorce amongst rumours of his sexual preference, Dalton Montgomery finds solace at his favourite new restaurant Bella Lucina's. His lunches spent talking to the restaurant's bartender, Sal, get him through the lonely days and nights. When Dalton begins to feel attracted to the hunky bartender, his world spins out of control. Had his ex-wife been right?Lunches in Laguna by J.P. BowieScott is intrigued by an art collection in a Laguna gallery, but it's the gallery manager, Michael, who gets his full attention!By his own admission, Scott Stevenson is a rough and ready kind of guy, but even he can appreciate art on occasion, especially when it comes in the form of Michael Taylor, the manager of a Laguna Beach art gallery. Invited to spend a lunch hour with Michael, Scott doesn't hesitate to let his new friend know he considers him a perfect work of art.The attraction is mutual and the two men start seeing each other regularly for 'lunch'. But when Michael fails to show up at the gallery one day Scott discovers that his perfect man may have an imperfect past, and if Scott wants lunch to progress to dinner he'd better ensure that those who are threatening Michael aren't around for dessert!Raven by Dakota RebelIn a club owned by vampires that feed on lust, it may end up being more than your neck on the line.Raven is the hottest gay club in Detroit. It is owned by Patrick and Kennedy, two vampires who emit so much sexual energy the club could run itself for days on it. They had always enjoyed smoking, drinking, and grabbing as much action as they could from their patrons so they could brag to each other about their conquests.But lately, Patrick has had enough. And when a young, hot blond shows up vying for Kennedy's attention, it's time for Patrick to teach him a lesson, and take his rightful place at his partner's side.Lust in the Afternoon by Cian FeySometimes all it takes is one afternoon.Ted Wayne is the IT manager at a gay online magazine and bookstore that also provides live streaming peep shows. During a fierce snowstorm, the on-air talent can't make it in for the \"Lust in the Afternoon\" show, and only Ted is around to fill the void.Art director Grayson Jeffries talks Ted into fifteen minutes in front of the camera, Ted agrees partly because he thinks Gray is the hottest thing going. He's reluctant to masturbate in front of Gray, but at least with Gray in the room, he has no worries about getting it up.Gray has wanted Ted for months - now he has this one chance to make all his fantasies come true.Lunch is Served by Jude MasonAdmitting you're gay is difficult enough. Can Philip Sands go even farther and admit he wants to be dominated?Philip Sands needs a job. When he finds one at The Gate Room, a gay BDSM club owned and run by the sexy Mark Freeman, he's faced with a dilemma. He'd admitted to being gay years ago, but had hidden his submissive side, even from himself. Dressed in the sexy leather gear required for his new job, Philip finds himself drawn into the lifestyle and lusting after Mark. Constantly aroused by the scenes taking place in the club, the duties he's asked to perform are more than a little frustrating.An evening meeting, which turns out to be so much more, only adds to his torment. When Mark invites him to come in for lunch the following day, Philip jumps at the chance. Will their meeting turn into more? Will he finally find the courage to tell Mark his feelings? And what does the handsome Mark have in mind?",
  "genres": [
    "M M Romance",
    "Anthologies",
    "Romance",
    "Erotica",
    "BDSM",
    "Vampires",
    "LGBT"
  ],
  "author": "Kaenar Langford",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/5982636-naughty-nooners-anthology"
}