{
  "title": "Blitz",
  "description": "Three dominant dragon alphas who seemingly have it all... except the one thing they want: me.My life hasn’t been typical. All I remember is waking up in an alley when I was ten, scrounging for scraps to survive until I was taken to the Bronzeheart estate.That’s where my life began, where I’ve lived for the past eight years with the ruling family, the Blitz Clan. It’s where I found my best friend Gage, the future leader of this clan.At the time, I didn’t question my good fortune because I was happy to know I wasn’t alone in this world anymore. But maybe I should have.After landing a shocking invite to the prestigious Dark Imaginarium Academy, I realized how much of a safe haven the estate was.The students at this school are out for my blood because somehow I have the attention of not just one, but all three Storm Dragon Clan heirs: Gage Bronzeheart, Breaker Firespell, and Jagger Silvershade.None of them should have an interest in me, seeing as I’m the only shifter at this academy who hasn’t, you know…shifted. They should want someone powerful at their side. But it doesn’t stop me from wanting them as well.That is until I find out they’ve been hiding a life-changing secret from me. And now that I know…\nNothing will be the same.\nBlitz is book 1 in the Storm Dragons’ Mate trilogy that features a slightly naive but sassy MFC, possessive dragon alphas, and a secret that will change everything. This is not a high school academy book and the contents are intended for mature audiences, with characters who are all 18+. This book includes violence and mature sexual content.\nAuthor Note:\nBlitz is set in the shared universe of Dark Imaginarium Academy. All series can be read independently, but characters have crossovers and it is highly encouraged to read all within the universe to understand the world in its entirety.\nSeries within the universe:\nPhases of the Moon by M. SinclairThe Creatures We Crave by R.L. CaulderThe Storm Dragons’ Mate by M. SinclairBlood Oath by R.L. Caulder",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Dragons",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Paranormal Romance"
  ],
  "author": "M. Sinclair",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/59820529-blitz"
}