{
  "title": "Waiting for Forever",
  "description": "I’ve dedicated my life to saving others, but I couldn’t save my family.After losing my wife and unborn daughter both in a matter of seconds, I was done with it all: love, happily ever after, a family.Then I met her—Stephanie Hartman. 5’10” of pure perfection.For over a year I’ve sat back and watched her tend bar at my local watering hole.I’ve witnessed the way she cares for others.The way she listens to their sob stories.The sincere smile she offers them when they break down after a few too many.I’ve even stolen a few flirty moments of her time.A wink here, a lingering glance there—The connection was instant.The chemistry between us could melt diamonds.I tried to resist. Told myself she deserves more than a broken man.But neither of us wanted to fight it any longer, so I gave in…we both did.The moment my lips tasted her I was done and she was mine.She made me come alive. She made me feel things I thought had died years ago.But there’s something lurking behind her beautiful eyes and I’ll be dammed if I let it destroy us before we even get a chance.Just when it seems we finally got it right.He shows up and drags her back to Wyoming with threats of ruining her life.He’s not just a bitter ex, he’s a dangerous felon with a secret so dark and a sheriff in his pocket, he’s willing to kill to keep it safe.She’s made it more than clear though: she doesn’t need saving.But I’m a firefighter and when I see danger approaching, instinct kicks in.I don’t have a choice.I lost everything once before, I won’t lose her too.But the harder I try to save her, the more it seems like she’s slipping away.Maybe after everything that life has put her through, I’m not the man she needs.Even if I lose her.Even if she chooses him.Even if this is all I’ll ever have with her.She was worth it.",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Contemporary Romance",
    "Small Town Romance",
    "Suspense",
    "Slow Burn",
    "Second Chance"
  ],
  "author": "Alexis Winter",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/59822207-waiting-for-forever"
}