{
  "title": "Paperback Romance",
  "description": "BESTSELLING & AWARD-WINNING AUTHOR SELENA KITTOVER A MILLION BOOKS SOLD Maya's heart yearns for romance and adventure, so that's what she writes about - but James Reardon, her college creative writing professor, insists she's wasting both time and talent. Determined to prove him wrong, Maya stumbles onto the fact that her professor's been keeping secrets - not the least of which is his attraction to her. Faced with a choice, she will have to decide whether or not to reveal his secret to the world-and her own desire for a man nearly twice her age. This title contains erotic situations, graphic language, and sex between a co-ed and her sexy professor hot enough to earn everyone an A!She heard him come in, and she found herself hesitating to go back out, staring at herself in the mirror. Her eyes were bright, her cheeks flushed, and her whole body tingling, like a limb that had gone to sleep and was just waking up.What was happening seemed so out of character for both of them--it seemed too fantastic to be real. Was she really sitting in her Ancient History class right now, looking out the window, chewing on a pen cap, and dreaming all of this? Part of her thought that must be the case. When she opened the door, he was standing by the open window, looking out at the lake. He smiled at her and held out a hand. She took it, still marveling at his touch, and joined him. The sun was brilliant on the water as it rippled toward shore.\"Look.\" He pointed toward the mallards that were paddling toward the reeds. As she watched, she saw a mother duck leading her little downy ducklings all in a row for a swim out on the lake.She watched them in wonder, all too aware of James' body, his hip against her hip, his hand moving around her waist. \"I wonder which one is going to grow up to be a swan?\"He smiled down at her, his attention shifting, his eyes falling to her mouth. \"This one.\" He tilted her chin up and kissed her. This wasn't like the tentative kiss in the car. This one was full of passion and an eager longing that matched her own. She whimpered against his lips, seeking his center with her tongue.He breathed her in--she could feel the expanding of his chest as he pulled her in tight, his hands seeking the bare skin of her back under her t-shirt. The bed seemed miles away as they kissed and touched their way towards it, peeling off clothes and exploring each other as they went. His mouth seemed to want to devour her and she met him like a lifetime of pent-up breath until they were gasping, collapsed, his body pressing her to the floor still five feet short of the bed.Her t-shirt was pulled up, his jacket off, shirt unbuttoned, and they were pressed belly to belly, but it made the thickness of her jeans too much--she couldn't feel the heat of him like she wanted. Her fingers fumbled with the snap and zipper, wiggling out, and the writhing of her under him as she exposed her panties and bare thighs brought a growl from his throat that sent a shiver through her.She toed her jeans the rest of the way off, wrapping her legs around him when they were free, digging her heels into his lower back and arching. He fumbled with the front hook of her bra and she brushed his hands away, impatient, rolling on top of him and sitting. His eyes were full of lust as he looked up at her peeling off her t-shirt, unhooking her bra and letting her breasts spill out into his hands as she leaned forward to kiss him, her mouth hungry.She rocked her hips, her thin panties rubbing against the material of his trousers, the bite of his belt a shock as he grabbed her sides and slid her up so he could lick and suck at her nipples like a man who had never tasted flesh before. The eagerness of his mouth made her hips rock hard and she wanted more still.",
  "genres": [
    "Erotic Romance",
    "Erotica",
    "Romance"
  ],
  "author": "Selena Kitt",
  "average_rating": "3.04",
  "url": "https://www.goodreads.com/book/show/5982223-paperback-romance"
}