{
  "title": "Yippie Girl: Exploits in Protest and Defeating the FBI",
  "description": "“A welcome addition to the literature of radical activism.” \n—Kirkus Reviews\n“A fun read and a valuable political document, long overdue.” \n—Counterpunch \nLifelong activist Judy Gumbo, an original member of The Yippies, a 1960s anti-war satirical protest group, offers an insider feminist memoir of her involvement with the Yippies, Black Panthers, women's rights, environmental actions, and a life of activism. In 1968, a 24-year-old woman moved to Berkeley, California and immediately became enmeshed in the Youth International Party, aka The Yippies, an anti-war satirical protest group. In the next few years, Judy Gumbo (a nickname given her by Eldridge Cleaver), was soon at the center of counter-cultural activity—from protests in People’s Park, to meetings at Black Panther headquarters, to running a pig for President at the raucous Democratic National Convention in Chicago, a protest that devolved into violent attacks by the police and arrests that led to the notorious Chicago Conspiracy Trial. In this historical account, Gumbo reveals intimate details of—and struggles with—her fellow radicals Jerry Rubin, Anita & Abbie Hoffman, Eldridge Cleaver, Paul Krassner, Stew Albert, and more, detailing their experiences in radical protests and her own skirmishes with unwarranted FBI surveillance. This deep dive into her activism includes details of her organization of a national women's rights group, her visit to North Vietnam during the war, her travels around the globe to promote women's liberation and anti-war protest, and her environmental activism. It also includes extensive excerpts from illegal wiretaps and surveillance by the FBI.Yippie Girl explores Gumbo’s life as a protester to show that, while circumstances always change, protesters can stay loyal to the causes they believe in and remain true to themselves. She also reveals how dogmatism, authoritarianism, and interpersonal conflict can damage those same just causes, offering a timeless and strategic guide for activists today protesting against injustice in all its forms.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Memoir",
    "Biography Memoir",
    "Biography"
  ],
  "author": "Judy Gumbo",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/59829916-yippie-girl"
}