{
  "title": "Sixth of a Soul",
  "description": "It started with a blinding white light and a silver ring that would change everything, but it seems never ending.These people should've been dead two hundred years ago when this Empire ceased to exist, yet here I am standing amongst them like I've always been here. Like I belong.I don't.I've become an object of warped fixation for five men I know next to nothing about. Five men that are so clearly divided, two of them hate each other with enough passion to burn me alive right where I stand.Victor Ambrose, King of the Northern Kingdom, is a man so cold it sometimes pains me to look into his eyes. A man who somehow makes me feel protected still. A man that can cripple someone with his gaze alone.Matthias Carillion, King of the Southern Kingdom, is so opposite of everyone else, so gentle and caring that he makes me feel more capable of getting through anything, just by being in his presence.Elijah Black, Leader of the Militia of the Northern Kingdom, has never left me alone without impenetrable protection and clear instructions on his safety regulations. A man so overbearing I find myself disobeying his commands just to see his inflammable anger alight.And Emris Black, First Advisor to the King of the Southern Kingdom. Someone confusing enough to invite irritation from everyone around him. Cruel with his words, silent in everything else, a man who can command a person’s mind without moving an inch. Powerful enough to terrify even the worst monster.Then there’s Adrien Ashford. Spy. Assassin. Dead. Adrien Ashford is a man rumored to be dead, and he’s that fifth presence I’ve felt watching me since I’ve come here. Always there, lurking in shadows but refusing to reveal himself.They're all psychopaths. Tyrants. Killers, no matter how humane they could seem at times.Yet they couldn't have been more at odds with each other, any more different.And I've just found out that the one thing they truly have in common, the one thing that will bind the two Kingdoms and their leaders together once and for all… is me.My name is Amethyst Aphelion, and it seems I’m either about to change the course of history… or shatter everything.Because I’m only a sixth of a soul.Sixth of a Soul is a fantasy and time travel reverse harem novel recommended for readers 18+. The heroine has more than one love interest and isn’t made to choose.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Time Travel",
    "Paranormal",
    "Romance",
    "Magic",
    "Supernatural"
  ],
  "author": "Viyana Morrigan",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/59837512-sixth-of-a-soul"
}