{
  "title": "Comedy Comedy Comedy Drama",
  "description": "* Duration: 7 hours and 53 minutes *\nIn this hilarious, heartfelt memoir, the star of 'Mr. Show', 'Breaking Bad', 'Better Call Saul',  and 'Nobody' opens up about the highs and lows of showbiz, his legendary cult status as a comedy writer, and what it's like to reinvent himself as a no-holds-barred action film ass-kicker at fifty.\nBob Odenkirk's career is inexplicable. And yet he will try like hell to explain it here, because that is what memoirs are for. Charting a \"Homeric\" decades-long \"Odyssey\" from his origins in the seedy comedy clubs of Chicago all the way to a dramatic career that is baffling to his friends, it's almost like there are two or three Bob Odenkirks...but there is just one and one is enough, frankly. Bob embraced a life in comedy after a chance meeting with Second City's legendary Del Close, which eventually led to a job as a writer at 'SNL'. As he weathered the beast that is live comedy, he stashed away the secrets of sketch writing - employing them in the immortal \"Motivational Speaker\" sketch for his friend Chris Farley, honing them on 'The Ben Stiller Show',  and perfecting them on 'Mr. Show With Bob and David',  which inspired an entire generation of comedy writers and stars. Then his career met the hope-dashing machine that is Hollywood development. But when all hope was lost for the umpteenth time, Bob was more astonished than anyone to find himself on 'Breaking Bad'. His embrace of this strange new world of dramatic acting led him to working with Steven Spielberg, Alexander Payne, and Greta Gerwig, until finally re-re-inventing himself as a bona-fide worldwide action star for reasons that even he does not fully grasp! Read this and do your own psychoanalysis - it's fun!Throughout Bob's travels, his memoir preserves the voice he cultivated from years of comedy writing. Featuring humorous tangents, joyful interludes, never-before-seen photos, wild characters from his winding career, and his trademark upbeat but unflinching drive, \n'COMEDY COMEDY COMEDY DRAMA'\n is a classic showbiz tale - and a moving story about what it's like to risk everything you think you know to make a change.©2022 Bob Odenkirk (P)2022 Random House Audio",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Humor",
    "Comedy",
    "Biography Memoir"
  ],
  "author": "Bob   Odenkirk",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/59837891-comedy-comedy-comedy-drama"
}