{
  "title": "The Dixon Brothers Box Set: Complete Series: Books One to Four",
  "description": "Alpha PossessedBook OneWe came to this mountain town to start over.To keep the never-ending violence in our past.Our mercenary days were behind us.At least, I thought they were.Until she comes and starts poking her nose in where it doesn’t belong.She wants to yank all of the skeletons out of my closet.I should tell her to beat it.Chase her out of town.But I can’t.She’s possessed me and my bear.We can’t get enough of her.This girl is causing me nothing but trouble.But I want more.I want all of her.In every way.She’s my mate and she belongs by my side.So, when those skeletons escape my closet and threaten us both…I’ll be there to protect her.To keep her safe.And I’ll be thankful for every second of it.Alpha ConsumedBook TwoI know immediately when I see him.This all-consuming feeling can only mean one thing.Roman Dixon is my mate.I have no shifter inside me, but I know.He’s mine and I’m his.I know all about mates because my brother is one too.A brother who Roman knows.Not only knows, but hates.They’re mortal enemies.And if I can’t keep their bears from killing each other…I’ll have nothing left.No mate. No family. No reason to live.Why do men have to be so damn stubborn?Alpha DominatedBook ThreeI’ve been waiting for my mate for a long time.So, when I see Ivy trapped, vulnerable, and easy pickings for this possessive bear shifter, I take her.But Ivy got her name for a reason…She’s like poison ivy even though she looks like an innocent flower.She bites and snaps.And won’t easily be tamed.That’s okay.I’ve never shied away from a fight or stepped down from a challenge.And making this feisty girl fall in love with me will be my biggest challenge yet.Alpha UnhingedBook FourThey call me the hot headed brother.Mean. Fierce. Disgruntled. Prick.It’s easy for them to judge.They’re not the only one on the ranch left without their mate.They’re not tormented by a furious Kodiak bear.With the heat barreling down on us from our past,They need a vicious bastard like me.And when my mate finally comes into my life,At the same time as enemies from our past,I’ll need to be as vicious as ever to protect her.And that’s just what I’m going to do.I’ll earn the title of the fierce brother.Or, I’ll die trying.",
  "genres": [],
  "author": "Olivia T. Turner",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/59842542-the-dixon-brothers-box-set"
}