{
  "title": "A Rainha Suprema",
  "description": "A Rainha Suprema é a belíssima Gwenhwyfar, que vive dividida entre a fidelidade que deve ao Rei Supremo, o rei Arthur, com quem se casou, e a enorme paixão que sente por Lancelet, cavaleiro invencível, capitão de cavalaria dos exércitos e o amigo mais íntimo do seu marido. E não sabe, Gwenhwyfar, se é o respeito pelo juramento que fez no dia do seu casamento ou o temor de pecar contra os mandamentos de Cristo - de quem é fervorosa seguidora - ou ambos, o que a impede de consumar por actos o que em pensamentos, não consegue evitar. É tão ardente o seu desejo de que Cristo triunfe na Terra que não hesitará em persuadir o rei Arthur a trair o juramento que fizera de lutar sob o estandarte real de Pendragon, tudo fazendo para que a decisiva batalha contra os saxões seja travada unicamente sob o estandarte da Cruz de Cristo, que ela mesma bordou.Mas maior do que a angústia de uma paixão impossível é o sofrimento em que vive, por não conseguir consumar o seu casamento oferecendo um filho ao rei. Nem os mistérios insondáveis de Deus são conforto suficiente para tanta dor e sofrimento.E é nesta angústia, ou, quem sabe, na secreta esperança de, sem pecar, poder consumar a sua paixão ardente dando à luz um herdeiro ao reino, que a bela Gwenhwyfar decide entregar-se nas mãos da Deusa. Mas, se são difíceis de compreender os caminhos de Deus, o que poderá acontecer quando se procura modificá-los com encantamentos e magias?Neste segundo volume da mítica saga As Brumas de Avalon, Marion Zimmer Bradley continua a maravilhar-nos através de um imaginário ancestral, de uma visão do mágico, do místico, do fantástico, de eras perdidas do mito, só ao alcance dos grandes escritores.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Audiobook",
    "Arthurian",
    "Science Fiction Fantasy"
  ],
  "author": "Marion Zimmer Bradley",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/5983210-a-rainha-suprema"
}