{
  "title": "The Edokas' Destiny: A Mate Index Alien Romance",
  "description": "**please note that this book has a temporary cover I created. I am still waiting on the professional cover credited in my book, so I decided to use a temporary cover for the time being**  Destiny Delaine has had enough. As daughter of a former high ranking general who now served as the Ambassador of Earth, and a socialite mother, she has been reared to be the proper young woman and helpmate. Her parents had her life all planned out, right down to her arranged marriage with one of the planetary representatives under her father. No one asked her what she wanted. Determined as too fat and too old at a curvy plus size age of thirty-four for the Mate Index, she decided to take her own destiny into her hands. She never expected that stowing away on a trade vessel would put her face to face with her mate. She is not impressed that it is the pervert she saw fucking a woman in an alley while making her big escape, but he is determined to show her the kind of mate he can be. Not only him, but two other brothers who would form a mated family unit, called a clannid, with her. They are sexy, sweet and viciously protective each in their own unique way. And she has never wanted anything more.  A’Jular is a trader known to be an aggressive male, one who doesn’t tip-toe around a problem, or feminine sensibilities, but goes for whatever he wants--whether that be a good quick fuck or a steady profit. What he and his brothers want more than anything, however, is a mate. When he is frozen out of the family accounts for trying to purchase mate-hunting rights from the Earth authorities, he thinks that his plans have been thwarted. Thankfully, the gods of love and pleasure are with him. He finds himself in possession of a stowaway. And not just any stowaway, but his mate which instantly triggers the maturation of his body from possessing juvenile to breeding sexual organs. To make matters complicated, their mate is feisty, independent, and thinks he is a pervert. He is determined for her to see that even a male such as he can be so, so good.  Sha’melor is the eldest hatch-mate between himself and his two brothers. This meant he was landed with all the responsibility and pressure. As a member of the Council of Clans, and ambassador on behalf of the Clans for the Intergalactic Union, he has more responsibility than one male could want. Enough to attract every power-hungry unmated female of the upper-clans. With a mother desperate for him to find a good match and sire hatchlings, he is relieved when A’Jular reports that he has found their mate and successfully matured for. He is instantly relieved of one huge burden, and looks forward to the embrace of a offworlder mate who won’t care who is among the clans, but will just love him for who he is. When he meets her, he is determined to do anything, fight anyone, to keep her.  E’budar is the laid back, friendly part of their clannid, and as it happens--the family trouble-maker. He doesn’t do it intentionally, his history amorous pursuits just seem to follow him like a bad smell, usually accompanied with very angry females due to one misunderstanding or another. It seems like his brothers are always having to bail him out of trouble. What he needs and wants more than anything in the world is a mate. The one female not threatening his cock, or life. Not that he distinguishes much between the two. He wants a female to dote on, to love, who won’t sneer at his affectionate gestures or silly jokes. And he dreams of having hatchlings running through the nest. What more could a male want? When he sees his mate, it is love at first sight. He would give up any object, any dream, just to have her at his side and make their clannid whole.",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Reverse Harem",
    "Romance",
    "Science Fiction Romance",
    "Erotica",
    "Menage"
  ],
  "author": "S.J. Sanders",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/59843531-the-edokas-destiny"
}