{
  "title": "The Final Salute: Together We Live on",
  "description": "The Final Salute A novel by Kathleen M. Rodgers In my debut novel, The Final Salute, I write about the aftermath of plane crashes, the tight bond between military pilots, and how crewmembers and military families cope after terrible tragedies. The story is based on the years I spent as a military wife married to an Air Force fighter pilot. I was twenty-one years old when I married into the world of military aviation. A world I thought was full of parties at the Officer s Club, the roar of jet engines, and a place where my husband and the other pilots lived on the edge of the envelope at a speed faster than the rest of us. Early in my marriage, I learned about the other side of military aviation. The side that nobody likes to talk about when a plane goes down. When a hush goes over a squadron of men like a black pall because earth and sky have collided and one of their brothers isn t coming home. A young wife is widowed, a child left fatherless, an older couple s hopes for their son destroyed in a fireball. In one year alone, my husband and I lost eleven friends in air mishaps. And this was during peacetime. But the crashes kept coming, and the death toll rose. We toasted the dead and partied on. I learned to accept two things about my husband s career choice: His job could kill him, and he loved every minute of it. When I started writing The Final Salute sixteen years ago, my goal was to give a voice to the men who perished flying for their country and the women and children they left behind. \tBut my novel s not all doom and gloom. \tIn the story, seasoned fighter pilot Tuck Westerfield, a Vietnam Vet and father of three, must deal with a devious commander, an animal-crazy neighbor whose husband hates pilots, a beautiful but suspicious wife, and a rebellious teenage daughter. The last thing he needs is another war. But when Iraq invades Kuwait in the middle of a muggy Louisiana summer, duty calls.",
  "genres": [
    "Historical Fiction",
    "Military Fiction"
  ],
  "author": "Kathleen M. Rodgers",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/5985331-the-final-salute"
}