{
  "title": "The History of Now",
  "description": "Small. almost imperceptible changes are rippling through the New England village of Grandville, altering it in ways its inhabitants cannot yet imagine. Laced through a narrative of one recent year in Grandville's history are stories that reach back to a 17th century family in Rotterdam, and 18th century migration by a farmer's lonely son in the Massachusetts Bay Colony, and a 19th century underground railway journey by a gifted runaway slave. Each episode comes to bear on Grandville now.Klein frames this multi-layered story with some fundamental questions in Does every event, no matter how small or distant in the past influence all events that follow? Is life merely a drama we dispassionately observe? Does it take courage to live in the \"eternal now?\"In Grandville, Wendell DeVries, the 65-year-old projectionist at the local movie theater, meets an attractive divorcee and an unexpected love affair blooms; Franny, Wendell's daughter and leader of the town's drama group, is confronted by a newcomer from New York City who insists that her politically correct play be produced, sending Franny into a spiral of self-doubt; Lila, Franny's teenage daughter hears a lecture at her high school that convinces her she has African blood in her veins, leading her to discover long lost black relatives living nearby; the high school's guidance counselor, is contacted by a man claiming to be a recruiter from Harvard who dubiously persuades him that his daughter is a shoe-in for acceptance if he follows his advice, a false promise that enrages him; while thousands of miles away, in a mountain village in Columbia, a young man named Hector begins a journey that will lead him to Grandville where he will alter the lives of everyone he meets.As a portrayal of small town life, The History of Now is reminiscent of Richard Russo's glorious novels about rural America. Its everyday encounters ring true, its dialogue glitters with wit, and its seamlessly integrated storylines create a consummate picture of one small place ineluctably connected to all places.",
  "genres": [
    "Fiction",
    "Philosophy",
    "Theatre",
    "Audiobook"
  ],
  "author": "Daniel Klein",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/5984516-the-history-of-now"
}