{
  "title": "How to Think Like Leonardo da Vinci: Seven Steps to Genius Every Day",
  "description": "This inspiring and inventive guide teaches readers how to develop their full potential by following the example of the greatest genius of all time, Leonardo da Vinci.Acclaimed author Michael J. Gelb, who has helped thousands of people expand their minds to accomplish more than they ever thought possible, shows you how. Drawing on Da Vinci's notebooks, inventions, and legendary works of art, Gelb introduces Seven Da Vincian Principles—the essential elements of genius—from  curiosità,  the insatiably curious approach to life to  connessione,  the appreciation for the interconnectedness of all things. With Da Vinci as your inspiration, you will discover an exhilarating new way of thinking. And step-by-step, through exercises and provocative lessons, you will harness the power—and awesome wonder—of your own genius, mastering such life-changing abilities as:•Problem solving•Creative thinking•Self-expression•Enjoying the world around you •Goal setting and life balance •Harmonizing body and mindDrawing on Da Vinci's notebooks, inventions, and legendary works of art, acclaimed author Michael J. Gelb, introduces seven Da Vincian principles, the essential elements of genius, from curiosita, the insatiably curious approach to life, to connessione, the appreciation for the interconnectedness of all things. With Da Vinci as their inspiration, readers will discover an exhilarating new way of thinking. Step-by-step, through exercises and provocative lessons, anyone can harness the power and awesome wonder of their own genius, mastering such life-changing skills as problem solving, creative thinking, self-expression, goal setting and life balance, and harmonizing body and mind.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Art",
    "Personal Development",
    "Biography",
    "Philosophy"
  ],
  "author": "Michael J. Gelb",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/598506.How_to_Think_Like_Leonardo_da_Vinci"
}