{
  "title": "2 A.M. in Little America",
  "description": "From \"an important writer in every sense\" (David Foster Wallace), a novel that imagines a future in which sweeping civil conflict has forced America's young people to flee its borders, into an unwelcoming world.One such American is Ron Patterson, who finds himself on distant shores, working as a repairman and sharing a room with other refugees. In an unnamed city wedged between ocean and lush mountainous forest, Ron can almost imagine a stable life for himself. Especially when he makes the first friend he has had in years--a mysterious migrant named Marlise, who bears a striking resemblance to a onetime classmate.Nearly a decade later--after anti-migrant sentiment has put their whirlwind intimacy and asylum to an end--Ron is living in \"Little America,\" an enclave of migrants in one of the few countries still willing to accept them. Here, among reminders of his past life, he again begins to feel that he may have found a home. Ron adopts a stray dog, observes his neighbors, and lands a repairman job that allows him to move through the city quietly. But this newfound security, too, is quickly jeopardized, as resurgent political divisions threaten the fabric of Little America. Tapped as an informant against the rise of militant gangs and contending with the appearance of a strangely familiar woman, Ron is suddenly on dangerous and uncertain ground.Brimming with mystery, suspense, and Kalfus's distinctive comic irony, 2 A.M. in Little America poses several questions vital to the current moment: What happens when privilege is reversed? Who is watching and why? How do tribalized politics disrupt our ability to distinguish what is true and what is not? This is a story for our time--gripping, unsettling, prescient--by one of our most acclaimed novelists.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Audiobook",
    "Dystopia",
    "Literary Fiction",
    "Speculative Fiction",
    "Novels"
  ],
  "author": "Ken Kalfus",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/59849183-2-a-m-in-little-america"
}