{
  "title": "Phyllis Schlafly and Grassroots Conservatism: A Woman's Crusade",
  "description": "Longtime activist, author, and antifeminist leader Phyllis Schlafly is for many the symbol of the conservative movement in America. In this provocative new book, historian Donald T. Critchlow sheds new light on Schlafly's life and on the unappreciated role her grassroots activism played in transforming America's political landscape.Based on exclusive and unrestricted access to Schlafly's papers as well as sixty other archival collections, the book reveals for the first time the inside story of this Missouri-born mother of six who became one of the most controversial forces in modern political history. It takes us from Schlafly's political beginnings in the Republican Right after the World War II through her years as an anticommunist crusader to her more recent efforts to thwart same-sex marriage and stem the flow of illegal immigrants.Schlafly's political career took off after her book A Choice Not an Echo helped secure Barry Goldwater's nomination. With sales of more than 3 million copies, the book established her as a national voice within the conservative movement. But it was Schlafly's bid to defeat the Equal Rights Amendment that gained her a grassroots following. Her anti-ERA crusade attracted hundreds of thousands of women into the conservative fold and earned her a name as feminism's most ardent opponent. In the 1970s, Schlafly founded the Eagle Forum, a Washington-based conservative policy organization that today claims a membership of 50,000 women.Filled with fresh insights into these and other initiatives, Phyllis Schlafly and Grassroots Conservatism provides a telling profile of one of the most influential activists in recent history. Sure to invite spirited debate, it casts new light on a major shift in American politics, the emergence of the Republican Right.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Religion",
    "Feminism",
    "School"
  ],
  "author": "Donald T. Critchlow",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/598466.Phyllis_Schlafly_and_Grassroots_Conservatism"
}