{
  "title": "All That's Left Unsaid",
  "description": "For fans of Everything I Never Told You and The Mothers, a deeply moving and unflinching debut following a young Vietnamese-Australian woman who returns home to her family in the wake of her brother’s shocking murder, determined to discover what happened—a dramatic exploration of the intricate bonds and obligations of friendship, family, and community.Just let him go. These are the words Ky Tran will forever regret. The words she spoke when her parents called to ask if they should let her younger brother Denny out to celebrate his high school graduation with friends. That night, Denny—optimistic, guileless, brilliant Denny—is brutally murdered inside a busy restaurant in the Sydney suburb of Cabramatta, a refugee enclave facing violent crime, an indifferent police force, and the worst heroin epidemic in Australian history. Returning home to Cabramatta for the funeral, Ky learns that the police are stumped by Denny’s case: a dozen people were at Lucky 8 restaurant when Denny died, but each of the bystanders claim to have seen nothing. Desperately hoping that understanding what happened might ease her suffocating guilt, Ky sets aside her grief and determines to track down the witnesses herself. With each encounter, she peels back another layer of the place that shaped her and Denny, exposing trauma and seeds of violence that were planted well before that fateful celebration dinner: by colonialism, by the war in Vietnam, and by the choices they’ve all made to survive. Alternating between Ky’s voice and the perspectives of the witnesses, Tracey Lien’s extraordinary debut is at once heart-pounding and heart-rending as it probes the intricate bonds of friendship, family, and community through an unforgettable cast of characters, all connected by a devastating crime. Combining evocative family drama and gripping suspense, All That’s Left Unsaid is a profound and moving page turner, perfect for readers of Liz Moore, Brit Bennett, and Celeste Ng.",
  "genres": [
    "Fiction",
    "Mystery",
    "Contemporary",
    "Australia",
    "Audiobook",
    "Book Club",
    "Literary Fiction"
  ],
  "author": "Tracey Lien",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/59856071-all-that-s-left-unsaid"
}