{
  "title": "Pinocchio",
  "description": "Lauréat du Fauve d’or 2009 ― prix du meilleur album ― du 36ème Festival International de la bande dessinée d''Angoulême.À travers des séquences souvent muettes, Winshluss livre dans Pinocchio un véritable opéra dessiné en nous faisant partager des émotions fortes et contradictoires, d''une richesse exceptionnelle. Un sommet d''inventions graphiques qui parvient à faire rire et réfléchir.Pré-publié en partie dans la revue Ferraille Illustré de 2003 à 2005 et interrompu par Winshluss pour se consacrer avec Marjane Satrapi à la réalisation du film d''animation Persepolis (primé au Festival de Cannes et aux Césars et nominé aux Oscars), Pinocchio narre les (més)aventures de la célèbre marionnette, revues et corrigées par ce bon petit diable de Winshluss. La trame y est globalement la même que dans le célèbre roman de Collodi, cependant l''intrigue y est largement modernisée : on retrouve ici un Pinocchio bien loin du gentil petit garçon de Walt Disney ! Le pantin de bois devient là un simple androïde conçu par un ingénieur en mal de reconnaissance. Tandis que « le grillon qui parle » (ici un cafard) connaît un sort plus enviable que celui du roman originel, puisqu''il s''agit d''un SDF qui trouve à squatter bien confortablement dans « la boite cranienne » du petit robot en question.Winshluss maltraite les codes de la bande dessinée populaire et les références cinématographiques avec virtuosité. Des clichés les plus éculés il invente des formes narratives des plus modernes. Mais toute la force du travail de l’auteur réside dans son traitement graphique. Outre un dessin très expressif, Winshluss fait preuve ici d’une maîtrise insolente du récit muet. Car ce Pinocchio ne contient quasiment aucun dialogue ni texte off. Avec Pinocchio, Winshluss s''ébat joyeusement dans l''univers des enfants pour le plaisir des plus grands … un peu comme si Bruno Bettelheim avait écrit pour Tex Avery !Ce livre imposant prouve que Winshluss est sans conteste l''un des auteurs de bande dessinée les plus virtuoses et passionnants de sa génération. Et même s''il est resté bien discret jusqu’à présent sous son pseudonyme de dessinateur de bande dessinée, nul doute que ce livre va enfin le révéler au plus large des publics !",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Bande Dessinée",
    "Fantasy",
    "Graphic Novels Comics",
    "Fiction",
    "Horror"
  ],
  "author": "Winshluss",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/5985244-pinocchio"
}