{
  "title": "Inflection Point",
  "description": "As the gunfire and explosions of the Somme ring in his ears, Nathan Bishop finds himself staring death in the face. But when a mysterious figure offers him a way out, he can't help but be intrigued. The catch? It means traveling back in time to ancient history on a mission to save the future.On the eve of World War I, Nathan is a man with a keen mind for science, forced to work as an electrician converting Oxford's colleges to electric light. But his true dream is to work on experimental projects that push the boundaries of logic and reason. So when Professor Felix Schneider offers him the chance of a lifetime, Nathan is ready to grab it with both hands.But what is the secret behind Schneider's research in his private lab? Is it a threat to national security? As Nathan delves deeper, he realizes that the truth is beyond even his wildest expectations and will shake the foundations of everything he thought he knew.As the events of 1914 unfold and the country calls on its able-bodied men, including Nathan, to fight, he must choose between Clara, the woman who has always supported his ambitions, and his duty to his country. But the decision he makes will have consequences that ripple throughout time, impacting not only those closest to him, but the entire galaxy.Can Nathan find the courage to fully embrace his dreams, even if it means sacrificing his own life and the lives of his friends? Find out in this compelling tale of love, duty, and the ultimate power of choice.Inflection Point is part of the Multiverse Chronicles, an epic series of interlinked stories that includes the Earth Song series, and the Fractured Light and Cloud Riders trilogies, that follow humanity’s struggle to survive across parallel universes.Author  For my friends across the Pond please note that this book is written in UK English and uses single quotes rather than double ones. Yes, Brits are weird like that!",
  "genres": [
    "Science Fiction",
    "Time Travel"
  ],
  "author": "Nick   Cook",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/59855377-inflection-point"
}