{
  "title": "Blaze Me a Sun",
  "description": "#1 INTERNATIONAL BESTSELLER A serial killer in a small Swedish town commits his first murder the same night the prime minister is assassinated—a “thrilling and profoundly poignant” (Angie Kim) novel by one of the country’s top criminologists, hailed as “the finest crime writer we have in Sweden” (David Lagercrantz, author of The Girl in the Spider’s Web and other novels in Stieg Larsson’s Millennium Series)“Christoffer Carlsson is to the police procedural what Cormac McCarthy is to the Western.”—Anthony Marra, author of Mercury Pictures Presents and A Constellation of Vital PhenomenaA CRIMEREADS AND KIRKUS REVIEWS BEST BOOK OF THE YEARIn February 1986, the Halland police receive a call from a man who claims to have attacked his first victim. I’m going to do it again, he says before the line cuts off. By the time police officer Sven Jörgensson reaches the crime scene, the woman is taking her last breath. For Sven, this will prove a decisive moment. On the same night, Sweden plunges into a state of shock after the murder of the prime minister. Could there possibly be a connection?As Sven becomes obsessed with the case, two more fall victim. For years, Sven remains haunted by the murders he cannot solve, fearing the killer will strike again. Having failed to catch him, Sven retires from the police, passing his obsession to his son, who has joined the force to be closer to his father.Decades later, the case unexpectedly resurfaces when a novelist returns home to Halland amid a failed marriage and a sputtering career. The writer befriends the retired police officer, who helps the novelist—our narrator—unspool the many strands of this engrossing tale about a community confronting its shames and legacies.A #1 bestseller in Sweden, Blaze Me a Sun marks the American debut of the youngest winner of the Best Swedish Crime Novel of the Year award, the top prize for Swedish crime writers whose past winners include Stieg Larsson and Henning Mankell.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Thriller",
    "Mystery Thriller",
    "Audiobook",
    "Sweden"
  ],
  "author": "Christoffer Carlsson",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/59856893-blaze-me-a-sun"
}