{
  "title": "You've Been Chosen: Thriving Through the Unexpected",
  "description": "A relentlessly optimistic memoir by one of the most influential Black business leaders in America today, offering hope and practical guidance for navigating life's most difficult challengesCynt Marshall has spent her entire life beating personal and professional odds, while also helping everyone she meets see how they are uniquely equipped to thrive. Through it all, this self-described \"people person\" never stopped reaching out, and built a reputation as an inspiring motivator and mentor in business and beyond.Cynt grew up in a Northern California housing project with a violent father who once broke her nose, but also with a strong, devoted mother who kept her family fed and focused, reminding them \"It's not where you live, but how you live.\" Heeding her mother's advice, Cynt excelled first at school and then in her professional life, overcoming overt and subtle racism to become, at forty, one of the first Black, female officers at AT&T, while also navigating both grief and joy as she started a family of her own.All of that life experience prepared Cynt for the day when, at fifty-one, she was diagnosed with Stage 3 colon cancer, just one lymph node from Stage 4. Overnight, her life changed, but her commitment to serve others did not.You've Been Chosen offers what Cynt calls \"the good, the great, the bad, and the ugly\" of her journey through both cancer and everything that led up to it. Along the way, she tackles the tough questions we all face: What will I do with what I have been given? How will I respond to this challenge with both grace and grit? Where will this new path take me if I keep moving? And how can I offer something good back to the world as a result?Cynt Marshall's deep faith and positivity will inspire you and encourage you. She shows you how to find your own \"voice of power\" and encourages you to remember--and believe--that you, too, have been equipped to walk your unique path with purpose. That you, too, have been chosen.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Self Help",
    "Leadership",
    "Audiobook",
    "Business",
    "Biography"
  ],
  "author": "Cynt Marshall",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/59883579-you-ve-been-chosen"
}