{
  "title": "Prisoners of the Castle: An Epic Story of Survival and Escape from Colditz, the Nazis' Fortress Prison",
  "description": "The definitive and surprising true story of one of history’s most notorious prisons—and the remarkable cast of POWs who tried relentlessly to escape their captors, from the New York Times bestselling author of The Spy and the TraitorIn this gripping narrative, Ben Macintyre tackles one of the most famous prison stories in history and makes it utterly his own. During World War II, the German army used the towering Colditz Castle to hold the most defiant Allied prisoners. For four years, these prisoners of the castle tested its walls and its guards with ingenious escape attempts that would become legend.But as Macintyre shows, the story of Colditz was about much more than escape. Its population represented a society in miniature, full of heroes and traitors, class conflicts and secret alliances, and the full range of human joy and despair. In Macintyre’s telling, Colditz’s most famous names—like the indomitable Pat Reid—share glory with lesser known but equally remarkable characters like Indian doctor Birendranath Mazumdar whose ill treatment, hunger strike, and eventual escape read like fiction; Florimond Duke, America’s oldest paratrooper and least successful secret agent; and Christopher Clayton Hutton, the brilliant inventor employed by British intelligence to manufacture covert escape aids for POWs.Prisoners of the Castle traces the war’s arc from within Colditz’s stone walls, where the stakes rose as Hitler’s war machine faltered and the men feared that liberation would not come soon enough to spare them a grisly fate at the hands of the Nazis. Bringing together the wartime intrigue of his acclaimed Operation Mincemeat and keen psychological portraits of his bestselling true-life spy stories, Macintyre has breathed new life into one of the greatest war stories ever told.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Audiobook",
    "Historical",
    "Biography"
  ],
  "author": "Ben Macintyre",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/59883560-prisoners-of-the-castle"
}