{
  "title": "Murder for Christmas: 26 Tales of Seasonal Malice",
  "description": "Although the themes of Christmas and crime might seem to be diametrically opposed, the Yuletide season has always brought out the best in mystery writers, who find endless inspiration in the trappings of the holiday. A stocking stuffed with 26 entertaining stories, this anthology samples the delicious wares of such noted masters of mystery as Arthur Conan Doyle, Agatha Christie, Rex Stout, Ngaio Marsh, Ellery Queen, and John Dickson Carr. It also includes some unexpected tidbits from authors outside the crime canon: Thomas Hardy, Damon Runyon, Baroness Emmuska Orczy, Charles Dickens, Robert Louis Stevenson, even Woody Allen!Celebrate the holidays with tales of murder, deceit, shoplifting, kidnapping, and murder 'round the wassail bowl! Illustrated with wonderfully malevolent black and white line drawings and cartoons by the ghoulish Gahan Wilson, this collection of holiday mysteries will chill the cockles of a crime lover's heart.Contents: \tBack for Christmas / John Collier --Mr. Big / Woody Allen --The adventure of the blue carbuncle / Arthur Conan Doyle --The adventure of the Christmas pudding / Agatha Christie --Dancing Dan's Christmas / Damon Runyon --Cambric tea / Marjorie Bowen --Death on Christmas Eve / Stanley Ellin --A Christmas tragedy / Baroness Orczy --Silent night / Baynard Kendrick --The stolen Christmas box / Lillian de la Torre --A chaparral Christmas gift / O. Henry --Death on the air / Ngaio Marsh --Inspector Ghote and the miracle baby / H.R.F. Keating --Maigret's Christmas / Georges Simenon --To be taken with a grain of salt / Charles Dickens --The adventure of the Dauphin's doll / Ellery Queen --Markheim / Robert Louis Stevenson --The necklace of pearls / Dorothy L. Sayers --Blind man's hood / Carter Dickson --Christmas is for cops / Edward D. Hoch --The thieves who couldn't help sneezing / Thomas Hardy --The case is altered / Margery Allingham --Christmas party / Rex Stout --The flying stars / G.K. Chesterton --Mother's milk / James Mines --Boxing Day bonus : Ring out, wild bells / D.B. Wyndham Lewis.",
  "genres": [
    "Mystery",
    "Christmas",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Holiday",
    "Crime"
  ],
  "author": "Thomas Godfrey",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/598764.Murder_for_Christmas"
}