{
  "title": "The Genius Killer",
  "description": "The dark heart of a brilliant and ruthless psychopathA celebrated but haunted detectiveA determined young reporter hunting for justice - and the big storyKarl Jackson is a particularly vengeful sociopath with his unique way of 'problem-solving’. DCI Tex Deacon suffers from the trauma of his beloved wife's death and finds it immensely difficult to come to terms with it. As a Detective Chief Inspector specialising in murder and killer profiling, Tex has a relentless workload from his base on the edges of the mountains of the Lake District.Tex is under pressure from his superiors to take a step back to grieve properly. It’s clear that Susan’s death has ripped out part of his soul. There is no doubt that Tex is suffering, but this DCI is a driven man. Tex’s welfare is the responsibility of his boss Chief Constable Barbara Bracewell, and she and Tex go back a very long way. However, Bracewell must do what is right for Tex and the Cumbrian police force.Despite falling into a mental abyss, Tex’s instincts for the hunt never leave him. A hyper-intelligent and devious murderer appears in his crosshairs – the self-styled ‘Genius Killer’. So what will Tex do? What can he get away with doing with the Chief Constable monitoring his every move?And then there’s Debbie Pilkington, a tenacious and hugely ambitious cub reporter at the local paper – The Rimpton Chronicle. Debbie has big stories and a big future in her own sights. A young journalist, a craggy and vastly experienced detective, and one of the most dangerous serial killers Britain has even seen. Their lives were about to intertwine. The chase to stop a cunning killer begins. Tex is a master at breaking down the thinking processes of those he hunts but with Tex enduring his own psychological meltdown, can he penetrate the mind of this supremely malevolent psychopath?Order Now!",
  "genres": [],
  "author": "Mark  Robson",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/128439226-the-genius-killer"
}