{
  "title": "Street Fight: The Chicago Taxi Wars of the 1920s",
  "description": "Bricks and bottles of acid through the windshield. Bullets shot from the running boards of racing cabs, passengers screaming in the backseat. Bombs exploding in garages, beneath parked cars, on the front porches of jurors’ homes. Accusations of favoritism and collusion with city leaders and law enforcement; bribery and extortion and grand jury investigations. Mysterious accidents and brutal attacks and devastating fires, leaving a trail of widows in their wake. These were Chicago’s Taxi Wars, a violent and deadly battle for supremacy of the city’s new and lucrative taxi industry during the Jazz Age. In 1915, at the dawn of the automobile era, visionary car salesman John D. Hertz (better remembered today for his successful foray into rental cars) and his partner, Walden W. Shaw, founded Chicago’s Yellow Cab Company. This wildly successful venture would go on to inform and inspire the modern taxi industry as we know it today in Chicago and throughout the United States. But as the Roaring Twenties glamorized lawlessness on the city’s streets, Yellow Cab’s meteoric rise invited increasingly aggressive competitors. Cab drivers battled each other in the streets over fares, allegiances and turf claims, their skirmishes escalating from sophomoric pranks to cold-blooded murder, mass shootings, and acts of domestic terrorism. In the 1920s, one rival in particular ascended to pose a threat to Yellow Cab’s the Checker Taxi Company. Behind the scenes, pulling the strings at Checker, was Morris Markin, who was desperate to expand his influence even as Chicago’s gangsters attempted to wrest his control away. Working from extensive research and interviews with descendants and experts, author Anne Morrissy vividly recreates Chicago’s Taxi Wars, bringing to print for the first time this deeply compelling but nearly forgotten story. Buffeted by a supporting cast of colorful combatants and larger-than-life Jazz Age characters — including Johnny Torrio, Al Capone, Joe Kennedy, Gene Tunney, Jack Dempsey, and Chicago mayor William Hale “Big Bill” Thompson — Street The Chicago Taxi Wars of the 1920s restores to history these deadly wars that played out on the city’s streets a century ago, endangering the lives of passengers and passersby, while at the same time forming the regulatory foundation that still governs cab, limo and rideshare transportation in the 21 st century.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Anne Morrissy",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/59864199-street-fight"
}