{
  "title": "Platonic: How the Science of Attachment Can Help You Make—and Keep—Friends",
  "description": "A lively, data-driven guide to finding your people from psychologist Dr. Marisa G. Franco about the (sometimes surprising) science behind making friends, maintaining them, and building connections of ALL sorts in an era of social fragmentation and rampant loneliness.\nLoneliness is an epidemic, in part due to a culture that prioritizes romance at the expense of all other relationships. But in fact, science shows that platonic friendships are a crucial--possibly THE crucial--key to shaping who we are and how we can become our happiest, most fulfilled selves. So how do we nurture meaningful relationships in an era of distraction, burnout, and chaos?Just as economist Emily Oster (Crib Sheet) breaks down the science of child-rearing by countering fables with facts, psychologist and professor Marissa G. Franco unpacks the latest (often counterintuitive) findings about friendship--for example, why your friends aren't texting you back (it's not because they hate you!), and the myth of \"just showing up\" (you need to bring more than your mere presence to the table to make real friends!). Forging lasting bonds with other people isn't rocket science...but it does take work, and there are research-based ways to improve the number and quality of your connections. The good news: the benefits can be massive to not just our sense of wellbeing but also to our physical health.With vivid, relatable storytelling bolstered by the latest psychological research, Platonic provides a clear and actionable blueprint for understanding and conquering the barriers that keep you from forging strong, lasting connections with others. In short, Platonic will give you permission to hold friendship in the highest regard--because it deserves to be.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Relationships",
    "Friendship",
    "Audiobook",
    "Personal Development"
  ],
  "author": "Marisa G. Franco",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/59883574-platonic"
}