{
  "title": "The Hummingbird's Sayang",
  "description": "From the award-winning author comes a luxuriously descriptive, decadently dark, and lusciously erotic novel about obsession, sensual freedom, sexuality, and the incredibly beautiful, often misunderstood relationship between a Dom and a Sub – entirely inspired by a true story. He’s the Arab heir to a multi-million-dollar global corporation. She’s a hopelessly shy, iron-willed strawberry-blonde computer science nerd who grew up in the cornfields of the Midwest. If you looked up the definition of night and day in a dictionary, you might just see a photograph of them. As fate would have it, they land in the same programming course. And then he ghosts her – for a year and a half. So, what could she do, but fall in love with a 27-year-old Vietnamese car salesman instead? That is … until he promises her a white picket fence and forgets to mention the Peet’s barista fondling his coffee beans on the weekend. Cue the soul-crushing agony of first love. And who should swoop into her match pile of potential rebounds, but her black-eyed Arab Dom from Dubai?The euphoria of his touch sets her free, but his aloofness towards the women of his ‘harem’ casts her on a downward spiral into obsession’s claws, chasing the love he refuses to give in the arms of three other men and one woman – Minjoon, the puppy-eyed Korean cuddle bug, Jin, the war-torn Balenciaga poster boy, Ling, her Japanese math genius of a TA, and Anna, the striking Colombian voice actress. How far will the lines of identity and misidentify blur down a darkly twisted road of obsession for one unreachable man? How far will obsession lead the men who fall for her? Inspired by real events, comes an evocative examination of the line between metamorphosis and loss of self, the non-idealized realities of BDSM, and our endless obsession with temptations of the flesh.",
  "genres": [],
  "author": "Faith Twardzik",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/59883922-the-hummingbird-s-sayang"
}