{
  "title": "The Whalebone Theatre",
  "description": "Cristabel Seagrave has always wanted her life to be a story, but there are no girls in the books in her dusty family library. For an unwanted orphan who grows into an unmarriageable young woman, there is no place at all for her in a traditional English manor. But from the day that a whale washes up on the beach at the Chilcombe estate in Dorset, and twelve-year-old Cristabel plants her flag and claims it as her own, she is determined to do things differently.With her step-parents blithely distracted by their endless party guests, Cristabel and her siblings, Flossie and Digby, scratch together an education from the plays they read in their freezing attic, drunken conversations eavesdropped through oak-panelled doors, and the esoteric lessons of Maudie their maid.But as the children grow to adulthood and war approaches, jolting their lives on to very different tracks, it becomes clear that the roles they are expected to play are no longer those they want. As they find themselves drawn into the conflict, they must each find a way to write their own story...This is the story of an old English manor house by the sea, with crumbling chimneys, draping ivy and a library full of dusty hardbacks. It's the story of the three children who grow up there, and the adventures they create for themselves while the grown-ups entertain endless party guests: the worlds they imagine from books they aren't supposed to read, and the lessons they learn from eavesdropping through oak-panelled doors.This is the story of a whale that washes up on a beach, whose bones are claimed by a twelve-year-old girl with big ambitions and an even bigger imagination. An unwanted orphan who grows into an unmarriageable young woman, chafing under the confines of her traditional upbringing and fiercely determined to do things differently.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Audiobook",
    "World War II",
    "War"
  ],
  "author": "Joanna   Quinn",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/59900661-the-whalebone-theatre"
}