{
  "title": "Under the Stars",
  "description": "Why is he making it so hard to hate him?ChapmanThere are few things I enjoy more than messing with Taylor Palmer. She’s such a priss with her tight, corporate skirts and her high heels. Someone’s got to bring her down to Earth. She glares at me and parades her dates into my bar like she thinks it’ll bother me. She’s on the hunt for a husband, but she’s doing it all wrong. She’s never going to be into one of these nerds. She really wants a man like me, but I’m not on the market.I can help her find a guy she can stomach. And if she decides to break her celibacy streak with me in the meantime, good for her…and me. But she better not get attached. She also needs to quit making me feel things I don’t understand.TaylorI’ll never forgive John Chapman for what he did to my best friend. I don’t care that she’s forgiven him, is close friends with him now, and even seems to be pushing me toward him. It’s because he and I are the last two single people in our friend group. All will be right in the world if he and I just connect. Forget it. He fancies himself some kind of dating coach. He says he can find me the right guy. He certainly couldn’t do worse than I’ve been doing. I guess it won’t hurt to let him help. The only problem is he won’t quit making his own moves on me, and they are working, impressively. I can’t fall for him. He’s made that crystal clear. But as we grow closer, I have to wonder if I’m chipping away at his cement walls, just a little bit.Welcome to Destiny Dunes, where the only thing hotter than the Florida sun is the romance between this resort's employees. Each book in this steamy series focuses on your favorite romance tropes. Once you enter the gates of Destiny Dunes, you'll never want to leave!",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Contemporary"
  ],
  "author": "Melissa  Chambers",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/59903207-under-the-stars"
}