{
  "title": "The Village Idiot",
  "description": "A Publishers Weekly Best Book of 2022\"A frothy picaresque that ... vibrates to the “sweet celestial confusion” of Soutine’s delirious and earthy, reverent and irreligious.\" -- The New York Times Book ReviewA wild, effervescent, absinthe-soaked novel that tells of the life of the extraordinary artist Chaim SoutineSteve Stern’s astonishing new novel The Village Idiot begins on a glorious spring day in Paris 1917. Amid the carnage of World War I, some of the foremost artists of the age have chosen to stage a boat race.  At the head of the regatta is Amedeo Modigliani, seated regally in a bathtub pulled by a flock of canvasback ducks.  But unbeknownst to the competition, he has a secret his young friend, the immigrant painter Chaim Soutine, is hauling the tub from underwater.  Soutine, an unwashed, misfit artist (who incidentally can’t swim) has been persuaded by the Italian to don a ponderous diving suit and trudge along the floor of the river Seine.  Disoriented and confused by the artificial air in his helmet Chaim stumbles through the events of his past and future life. It’s quite an extraordinary life.  From his impoverished beginnings in an East European shtetl to his equally destitute days in Paris during the Années Folles, the Crazy Years, from the Cinderella patronage of the American collector Albert Barnes, who raises him from poverty to international attention, to his perilous flight from the Nazi occupation of France, Chaim Soutine remains driven by his unrelenting passion to paint.  To be sure, there are notable distractions, such as his unlikely friendship with Modigliani, who drags him from brothels to midnight felonies to a duel at dawn; there are the romances with remarkable women who compete with and sometimes salvage his obsession. But there is also, always on the horizon, the coming storm that threatens to sweep away Chaim and a generation of gifted Jewish refugees from a tradition that would outlaw their longing to make art. Wildly inventive, as funny as it is heart-breaking, The Village Idiot is a luminous fever-dream of a novel, steeped in the heady atmosphere of a Paris that was the cultural capital of the universe, a place where anything seemed possible.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "France",
    "Jewish",
    "Historical"
  ],
  "author": "Steve Stern",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/59891820-the-village-idiot"
}