{
  "title": "Defending the Damned: Inside Chicago's Cook County Public Defender's Office",
  "description": "Chicago was the nation's deadliest city in 2001, recording 666 homicides. For lawyers in the Cook County Public Defender's Office Murder Task Force, that meant a steady flow of new clients. Eight out of ten people arrested for murder in Chicago are represented by public defenders. They're assigned the most challenging and seemingly hopeless cases, yet they always fight to win. One of those lawyers is Marijane Placek, a snakeskin boot-wearing, Shakespeare-quoting nonconformist whose courtroom bravado and sharp legal skills have made her a well-known figure around the courthouse. When an ex-convict was arrested on charges of killing a Chicago police officer that deadly year, Placek got the high-profile case, and her defense forms the hub around which the book's narrative revolves.Veteran journalist Kevin Davis reveals the compelling true story of a team of battle-scarred lawyers fighting against all odds. Unflinching, gripping, and full of surprises, \"Defending the Damned\" is an unforgettable human story and engaging courtroom drama where life and death hang in the balance. Davis explores the motives that compel these lawyers to come to work in this dark corner of the criminal justice system and exposes their insular and often misunderstood world.This groundbreaking work comes at a time when the country has seen how wrongful convictions have slipped through the system, that innocent people have been sent to death row, and that some police have lied or coerced suspects into confessing to crimes they did not commit. Such flaws drive these public defenders even harder to do their jobs, providing scrutiny to a long ignored and often broken system.Davis's reporting offers an unvarnished account of public defenders as never seen before. A powerful melding of courtroom drama and penetrating truecrime journalism, \"Defending the Damned\" is narrative nonfiction at its finest.",
  "genres": [
    "Nonfiction",
    "Law",
    "True Crime",
    "Crime",
    "History",
    "Sociology",
    "Mystery"
  ],
  "author": "Kevin   Davis",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/598868.Defending_the_Damned"
}