{
  "title": "Back to the Garden",
  "description": "A fifty-year-old cold case involving California royalty comes back to life--with potentially fatal consequences--in this gripping standalone novel from the New York Times bestselling author of the Mary Russell and Sherlock Holmes series.A magnificent house, vast formal gardens, a golden family that shaped California, and a colorful past filled with now-famous artists: the Gardener Estate was a twentieth-century Eden.And now, just as the Estate is preparing to move into a new future, restoration work on some of its art digs up a grim relic of the home's past: a human skull, hidden away for decades.Inspector Raquel Laing has her work cut out for her. Fifty years ago, the Estate's young heir, Rob Gardener, turned his palatial home into a counterculture commune of peace, love, and equality. But that was also a time when serial killers preyed on innocents--monsters like The Highwayman, whose case has just surged back into the public eye.Could the skull belong to one of his victims?To Raquel--a woman who knows all about colorful pasts--the bones clearly seem linked to The Highwayman. But as she dives into the Estate's archives to look for signs of his presence, what she unearths begins to take on a dark reality all of its own.Everything she finds keeps bringing her back to Rob Gardener himself. While he might be a gray-haired recluse now, back then he was a troubled young Vietnam vet whose girlfriend vanished after a midsummer festival at the Estate.But a lot of people seem to have disappeared from the Gardener Estate that summer when the commune mysteriously fell apart: a young woman, her child, and Rob's brother, Fort.The pressure is on, and Raquel needs to solve this case--before The Highwayman slips away, or another Gardener vanishes.",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Thriller",
    "Adult"
  ],
  "author": "Laurie R. King",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/59900687-back-to-the-garden"
}