{
  "title": "Of War and Ruin",
  "description": "Solian ata'yar. Dauv ata'yar. Nur temen vie'ryn valana.Live as one. Die as one. For those we've lost.The city of Kingspass burns, and Calen Bryer's world has been shaken to its core. With Valerys at his side, Calen must battle his demons and push forward. There are people who need him, people who need what he must become, and he will not let them stand alone.In Loria, Ella struggles to understand the ancient power that flows through her veins. The world is changing around her and she is changing with it. Her journey has only just begun.Thousands of miles away, beneath the mountains of Lodhar, assassins move in the dark as the kingdoms of the Dwarven Freehold ready themselves for war. Not everything is as it seems. Dahlen Virandr and Belina Louna have no choice but to unravel the mysteries of the mountain before everything crumbles around them.Meanwhile, in Al'Nasla, Rist Havel learns the true cost of becoming an Imperial Battlemage. He will question every truth he has ever been told. He has never been a fighter, never been the one people look to, but he will fight for those he loves no matter what it takes.With the Uraks ravaging the towns and villages of the North, Alina and Dayne Ateres prepare their people for war. They have been beneath a Lorian boot for too long. Valtara will be free. The wyvern of House Ateres will fly again, by blade and by blood.As the continent of Epheria descends into war and chaos, Kallinvar struggles to come to terms with an immense loss. Despite the hole in his heart, he has no choice but to stand and fight. The Shadow is coming, and the Knights of Achyron are the only ones powerful enough to hold back the tide.Unbeknownst to all, another force is rising - a force long thought tamed.The balance of power is about to shift, and Epheria will never be the same.​​​​​​​The Blood Moon is rising.",
  "genres": [
    "Fantasy",
    "Dragons",
    "Epic Fantasy",
    "High Fantasy",
    "Fiction",
    "Audiobook",
    "Adult"
  ],
  "author": "Ryan  Cahill",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/59919045-of-war-and-ruin"
}