{
  "title": "Savage Princess",
  "description": "One strong-willed woman set on revenge.Three childhood friends who are now her enemies.Get ready for Alexandria to create chaos.My name is Alexandria Donatella McCarthy, daughter of the don of the Rossi syndicate. Abused. Neglected. Underestimated. I’m about to unleash hell on this town. Keane Agosti, Rafael Ortiz, and Jaxson West don’t know it yet, but I am the devil who will bring that hell to their doorsteps—and take my father down right along with them.I was born into a life that showed me nothing but pain. A toy, a pawn, to be used by my father, Maximillian Rossi. My brother, Kellan, was the only bright light in my dark world. Then one day, he was gone. Taken from me. And it’s their fault. My brother’s three best friends. Keane, the leader of the group whose quest for power will be his undoing. Jax, the twisted psycho who lost his soul a long time ago. And Rafe, my ex-boyfriend who shattered my heart and left me when I needed him the most.Now it’s my turn to descend into the darkness. I will destroy them all, burn the Rossi house to the ground, and then rise from the ashes.Are you ready for me, boys? This savage princess is coming for you.Reader’s Warning: Savage Princess is a dark, enemies to lovers, mafia, reverse harem romance and contains scenes that may be triggering to sensitive individuals such as blood, violence, scenes depicting torture, foul language, consensual sexual content, and references to past sexual abuse/trauma. If you are not familiar with reverse harem romances, this troupe is where the female protagonist has more than one love interest and is in an intimate relationship with more than one man. Savage Princess is book 1 in the Savage Kingdom three-book series and ends with a cliffhanger. Recommended for mature readers.Savage Kingdom Series#1 Savage Princess#2 Savage Kings#3 Savage Kingdom",
  "genres": [
    "Reverse Harem",
    "Dark Romance",
    "Dark",
    "Enemies To Lovers",
    "Romance",
    "Mafia Romance",
    "Contemporary"
  ],
  "author": "Jennilynn Wyer",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/59931169-savage-princess"
}