{
  "title": "The Creator and the Cosmos: How the Greatest Scientific Discoveries of the Century Reveal God",
  "description": "\"THE HEAVENS ARE TELLING THE GLORY OF GOD; AND THE FIRMAMENT PROCLAIMS HIS HANDIWORK.\"-Psalm 19:1 Few of us can venture outside on a clear, dark night and not pause for a silent, reflective look at the stars. For countless centuries people have felt a sense of wonder about the heavens. How did our universe come into being? Has it always been here? Is our existence due to random chance or supernatural design? Is God \"out there\"? If so, what is He like? Traditionally, the church has answered such questions with Scripture, while science has contributed theories and formulas of its own. Torn between a deep respect for church doctrines and an intellectual need for answers that support what their senses are telling them, many Christians have avoided such discussions altogether. Actually, the two sides are no longer that far apart. In The Creator and the Cosmos, astrophysicist Dr. Hugh Ross explains how recent scientific measurements of the universe have clearly pointed to the existence of God. Whether you're looking for scientific support for your faith or new reasons to believe, The Creator and the Cosmos will enable you to see the Creator for yourself. \"A compelling summary of scientific evidence that supports belief in God and the Word of God, written on a level even the non-technically trained lay person can understand.\"-Walter L. Bradley, professor and head of the Department of Mechanical Engineering, Texas A&M University \"In The Creator and the Cosmos, Dr. Hugh Ross shows how recent cosmological discoveries clearly indicate the universe was created with many characteristics fine-tuned for our life. Though many scientists may resist the logical conclusion, the Creator implied by the scientific evidence is exactly consistent with the God revealed in the Bible.\"-Dr. Kyle M. Cudworth, Yerkes Observatory, University of Chicago \"The Creator and the Cosmos constitutes a remarkable journey through the most recent scientific findings, providing overwhelming support for design in our universe. Dr. Ross has documented the evidence for design in our universe in such a thorough yet readable style that it will prove to be of great value both to the science student as well as to the interested layperson.\"-Dr. David H. Rogstad, physicist, Caltech Jet Propulsion Laboratory TABLE OF Chapter 1: The Awe-Inspiring Night Sky Chapter 2: My Skeptical Inquiry Chapter 3: The Discovery of the Century Chapter 4: The Matter Mystery Chapter 5: The Beautiful Fit Chapter 6: Einstein's Challenge Chapter 7: Closing Loopholes-Round One Chapter 8: Closing Loopholes-Round Two Chapter 9: Science Discovers Time Before Time Chapter 10: A God Outside of Time, But Knowable Chapter 11: A Brief Look at A Brief History of Time Chapter 12: A Modern-Day Goliath Chapter 13: The Divine Watchmaker Chapter 14: A \"Just Right\" Universe Chapter 15: Earth-The Place for Life Chapter 16: Building Life Chapter 17: Extra-Dimensional Power Chapter 18: The Point",
  "genres": [
    "Science",
    "Christian",
    "Nonfiction",
    "Christianity",
    "Religion",
    "Theology",
    "Philosophy"
  ],
  "author": "hugh-ross",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/599299.The_Creator_and_the_Cosmos"
}