{
  "title": "Buckskin Mose, Or, Life from the Lakes to the Pacific: As Actor, Circus-rider, Detective, Ranger, Gold-digger, Indian Scout, and Guide",
  "description": "\"Captain Perrie, who was known to his contemporaries as 'Buckskin Mose,' wrote an account of his adventures as an Indian scout under the title 'Buckskin Mose---or Life from the Lakes to the Pacific.'\" - Santa Rosa Republican, Sept. 27, 1938\"Buckskin Mose reported the discovery of horse thieves who were expelled from his wagon train.\" - The Schuyler Sun, Feb. 26, 2004\"A curious mixture of desperate exploits and sentiment, one of the singular characters that belong to the past.\" - Bibliography of the History of California (1914)“Buckskin Mose is a plain and truthful, but very interesting, account of life and adventure in the far West.\" - The Home Journal\"He picked up all the stories about the Indian fights that had taken place in this section.\" - Fairfield's Pioneer History of Lassen County, California (1916)Known as \"Buckskin Mose\" by the Pah-utes, George Perrie (1811-1879) was an actor, trapper, scout, gold-digger, Ranger, detective, circus-rider, and guide. His life, very unlike that of most readers, was one of plenty of change and adventure, having been spent as a wanderer on the western frontier of the North American continent.As detailed in his 1873 book \"Buckskin Mose,\" much of the author's adventure had its place among the mines and Native Americans of Nevada and the country east of the Rocky Mountains. His observations of the Indians and the effects on them of the policy pursued by the Government give a value to the book beyond its interest as a narrative.In describing his time as a Pinkerton detective in frontier Wisconsin, Perrie \"In those days, in the West, justice was far shorter and sharper than it has recently been in New York. There was more pride in the detection of crime, and considerably readier justice in its punishment. Red-handed murder had especially little chance of escaping the prompt retribution of the Law, and it will, I think, be granted by the inhabitants of the metropolis that the consequent fear was a tolerably fair degree of preservation for human life, considering the character of the various elements from which life in that portion of the States was then composed.\"In describing his capture by a band of Cheyennes near Laramie, Perrie \"My desperate struggles were in vain. I was torn from my horse, and in a few moments more found myself weaponless, with my arms pinioned behind me, and lashed on the back of one of their ponies. The animal was then turned loose, and followed with whoop and yell by the savages as if they had been nothing else than a band of devils. The Cheyenne who was probably their chief had appropriated my horse. How madly I wished that Charlie would throw the red demon as he galloped after me, shouting and whooping like an incarnate fiend…\"Another time he was captured by Flat-head braves near Walla Walla who \"after somewhat wearying of their share in this cheerful pandemonium, would squat upon the earth and rest, while their squaws subjected me to more horrible torture than the mind of the white could conceive without personal experience….\"After a life of high adventure and numerous close 'scapes, eventually Perrie would settle down and engaged in mining and other peaceful pursuits, residing for some length of time in Salt Lake City.",
  "genres": [],
  "author": "George A. Perrie",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/59923748-buckskin-mose-or-life-from-the-lakes-to-the-pacific"
}