{
  "title": "Please Don't Say You're Sorry: An Empowering Perspective on Marriage, Separation, and Divorce from a Marriage-Loving Divorce Attorney",
  "description": "In Please Don’t Say You’re Sorry, marriage-loving divorce attorney, Nicole Sodoma shows up with empowering advice to help you sustain a real and happy marriage, recognize when that’s just not possible, and know what to expect and do from there. What’s more, she does it with a generous dose of humor to remind you that you can and will laugh again. When marriage-loving divorce attorney Nicole Sodoma ended her thirteen-year marriage, she found herself seated in a symphony of sympathies and quickly began to question why people say “congratulations” when we marry and “I’m sorry” when we divorce.  There’s no denying that divorce sucks. You've invested years in a relationship. Then it what feels like the blink of an eye, everything has changed and you are faced with more resolution options than New Year's Eve. The journey can be wholly overwhelming, but it doesn’t have to be the worst thing that’s ever happened to you. Choice will be your ally.  As the child of a blended family of divorced parents, a now \"unmarried\" woman, and a veteran family law attorney, Nicole Sodoma knows divorce. In Please Don't Say You're Sorry, she serves up both humorous and decidedly unfunny realities of marriage and divorce alongside empowering insights for finding your way through either. From hard truths about the unintended consequences of ending a marriage to relatable tales from divorces past, Nicole's communication style will help you feel deeply understood as you try to render those seemingly impossible decisions.   Whether you are looking for advice on how to better your marriage, are considering separation, or find yourself knee-deep in divorce, this book has something for you. Today is the first day of the rest of your life, and now you’ve got a badass no-holds-barred divorce attorney by your side.",
  "genres": [
    "Nonfiction",
    "Relationships",
    "Self Help",
    "Education",
    "Inspirational",
    "Book Club"
  ],
  "author": "Nicole Sodoma",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/59916180-please-don-t-say-you-re-sorry"
}