{
  "title": "Bedlam Moon",
  "description": "This is a fated mate, reverse harem paranormal romance. Expect a fast-paced instalove with one harem member, and a slow burn for the others.Sexy vampire royalty, curses, an evil cult, and ancient prophecies all stand in the way of Lana figuring out why her mom vanished twenty-six years ago. Do her answers lie in the fae realm? She thought she had seen the world. She had no idea the fae have a world of their own…Thirty-four-year-old Lana Chapman-Sawyer has an MBA, zero student loan debt, a successful travel blog, and curves for days.What she doesn’t have is a family…Lana’s mother vanished when she was only eight, her father was never in the picture, and her adoptive parents died in a car accident when she was thirty, leaving her orphaned once again.When Lana receives a strange package with a magical key in the mail, she decides to take it to her cabin deep in the Northern woods of Minnesota, the very place where her mother abandoned her.Little does she know, the neighborhood is not exactly as she remembers it…Osgood \"Oz\" Finlandian is your average next-door multi-billionaire humanitarian and businessman. He just so happens to be a 5,500-year-old vampire.And not just any vampire. He’s the first vampire ever created. The King of Vampires who rules over the royal court.He’s also the one to tell Lana about Bedlam, the fae realm, and the locked witch powers she never knew she had.But unbinding her powers is only the beginning …Oz, who has a dark past of his own, promises to help Lana uncover the mystery behind her mother’s disappearance, and the two of them take on several quests, all the while facing ancient prophecies, recurring dreams, an obsessed witch, and an evil cult hot on Lana’s tail. Too bad Lana also has to navigate her way through irresistible desires in the process…This is a reverse harem, paranormal romance with witches, vampires, fae, and time travel. Other members of the harem will join in subsequent books of the series.",
  "genres": [
    "Fantasy",
    "Reverse Harem",
    "Romance",
    "Paranormal",
    "Vampires",
    "Fae",
    "Paranormal Romance"
  ],
  "author": "Kathy Haan",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/59917603-bedlam-moon"
}