{
  "title": "Perdendo Tempo Com Deus: Por Que Sou Ateu",
  "description": "★ ★ ★ ★ ★ “Os melhores livros sobre Ateísmo são os escritos por Paulo Bittencourt, porque, diferentemente de Richard Dawkins, Christopher Hitchens e Sam Harris, que nunca foram religiosos, ele foi criado na igreja, estudou Teologia e, portanto, fala por experiência.” (D. Barker) ★ ★ ★ ★ ★ “Argumentos tão radicalmente minuciosos, afiados e esmagadores que embasbacam até alguns ateus e os fazem sentir vontade de defender religiosos.” (M. Shermer) Entre argumentos teológicos, filosóficos e históricos, em “Perdendo Tempo Com Deus” Paulo Bittencourt, que foi adventista devoto, ativo na igreja, estudante de Teologia e quase se tornou pastor, revela as razões por que não acredita em seres invisíveis, inclusive os celestiais, e demonstra por a + b que Ateísmo é o único posicionamento intelectualmente honesto. Você tem fé em Deus? Ela é inabalável? Como você sabe, se não a põe à prova? Faça um teste: leia este livro até ao fim. Se não fizer você duvidar de nenhuma das coisas em que você acredita, nada mais fará. Ficará provado que você realmente é firme na fé. Temas abordados: Alá, Ateísmo, Bíblia, Ceticismo, Céu, Ciência, Comunismo, Cristianismo, Deus, Diabo, Evolução, Filosofia, Gospel, Igreja Adventista, Batista, Católica, Evangélica, Pentecostal, Universal, Inferno, Islã, Jesus, Judaísmo, Livre Pensamento, Maomé, Protestantismo, Satanás, Socialismo, etc. Paulo Bitencourt nasceu em Castro, Paraná, passou a infância no Rio de Janeiro e estudou Teologia em São Paulo. Perto de se tornar pastor, aventurou-se pela Europa e acabou se radicando na Áustria. O livro “Ética”, de Bento de Espinosa, transformou-o num naturalista, humanista e livre-pensador. Paulo Bitencourt dedica sua vida a ajudar pessoas a se libertar da religião. Paulo Bittencourt é autor também dos livros “Liberto da Religião” e “Com Zeus Não Se Brinca”. “Não quero crer, quero saber.” — Paulo Bittencourt Visite: ateismohumanismo . wordpress . com",
  "genres": [
    "Spirituality",
    "Science"
  ],
  "author": "Paulo Bitencourt",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/100366328-perdendo-tempo-com-deus"
}