{
  "title": "The Hidden Palace",
  "description": "An island of secrets. A runaway. And a promise…A rebellious daughter1925. Among the ancient honey-coloured walls of the tiny island of Malta, strangers slip into the shadows and anyone can buy a new name. Rosalie Delacroix flees Paris for a dancer’s job in the bohemian clubs deep in its winding streets.A sister with a secret1944. Running from the brutality of war in France, Florence Baudin faces a new life. But her estranged mother makes a desperate request: to find her vanished sister, who went missing years before.A rift over generationsBetrayals and secrets, lies and silence hang between the sisters. A faded last letter from Rosalie is Florence’s only clue, the war an immovable barrier – and time is running out…Praise for The Hidden Palace“Completely swept me away to another place and time. Dinah is the queen of sumptuous settings, transporting the reader effortlessly from chocolate-box Devonshire to the cabaret clubs of 1920s Paris and war-torn Malta. A marvellous, multi-layered story, populated with characters to really care for”—HAZEL GAYNOR“Dinah Jefferies wields her storytelling magic on the island of Malta . . . It’s engrossing and sensual, full of the heat of the Mediterranean sun”—GILL PAUL“Powerful, passionate and profoundly moving . . . this compelling mix of love and tragedy vibrates with warmth and pain, and captures the intense dislocation of war”—KATE FURNIVALL“Sweeping and sumptuous with a gorgeously described sense of place. A marvellous adventure”—TRACY REESPraise for Daughters of War“A wonderfully evocative and sensual writer”—SANTA MONTEFIORE“A warm and engrossing tale of passion and courage. I loved it”—RACHEL HORE“Love, grief, abandonment, betrayal and secrets … I adored it”—LIZ NUGENT",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Romance",
    "World War II",
    "War",
    "France"
  ],
  "author": "Dinah Jefferies",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/59947623-the-hidden-palace"
}