{
  "title": "Big Boys: Books 1-4",
  "description": "Big men do it better!\n\n\nThey’re bulky. They’re burly. These plus size heroes are here to sweep you off your feet.\n\nThe Big Boys box set includes four short and steamy instalove stories:\n\n\nBig Boss\n\nHe’s older than me. A big-time boss. My secret crush.And my best friend’s dad.Jacob Callahan is nothing like the guys I know from college. He’s powerful. Stern. And most of all, he’s big.Every time I crane my neck to meet his eye, every time I see his bulk fill a doorway… I melt.But Mr Callahan is off limits, and more than that, he doesn’t even know I’m alive.So I can stay in his house for the holidays. Keep out of his way. Keep my crush to myself. It’s only for six days.I’ll be as quiet as a church mouse. He probably won’t even notice I’m here.\nBig Biker\n\nI’m used to princes and stockbrokers. The ruthless elite.But it’s the burly biker who catches my eye.All my life, I’ve been a pawn in my family’s games. But this is a new low--an engagement to the son of my father’s business rival.It’s not a marriage, it’s a freaking merger, and there’s no way out for me. I’m trapped. Staring out of the window of this luxury restaurant, wishing I could be anywhere but here.Then I see him.He’s rough. Tattooed and bearded. Clad all in leathers--and bigger than any man I’ve ever seen.The burly biker wakes something in me. Something needy. Something reckless.There must be more to life than stuffy dinners and dollar signs.The biker knows--and I want him to teach me.\nBig Boxer\n\nI don’t mean any harm when I call the boxer past his prime.But my blog piece goes viral--and the boxer comes knocking.It’s bad enough meeting someone you’ve written about. Someone you hero-worshipped as a kid; whose poster used to hang on your wall.But it’s worse when your piece was less than kind… and the man turns your legs to jelly with a single glance.Okay. I messed up here. And Lucas Scott is not afraid to let me know it. But once tempers have cooled, he’s not ready to leave.That thing I wrote about his stamina?…Yeah. The boxer’s got something to prove.\nBig Baker\n\nChef Ballard is world famous. His pastries make grown men weep.And he’s been leaving them in my hotel staff locker.I never meant to get the Head Baker’s attention. Not consciously, anyway. I’m a shy nobody, a hotel cleaner--the last thing I need is scrutiny.Not with the murals I splash through the city at night.But I couldn’t help it. Once I saw where he lived, I had to bring color to his life the way his pastries light up mine.Now the baker is watching. He suspects me. And he doesn’t seem angry, in fact he seems... charmed.Chef Ballard had better stop leaving me pastries. My heart can’t resist someone sweet.",
  "genres": [
    "Novella",
    "Romance",
    "Contemporary Romance",
    "Collections"
  ],
  "author": "Cassie Mint",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/59938489-big-boys"
}