{
  "title": "Snowed in at the Concert Hall",
  "description": "How do you tell the guy you love, the most honest guy you've ever met, that you're a con artist?You wait until you get snowed in together and let him figure it out for himself.Candace Williams grew up with a con artist who pulled her into the life. At twenty-seven, Candy decided she'd had enough and reinvented herself in Granite Springs, Colorado.She thought she could start over. She wanted to start over with Jack Hoffman, a property attorney with ocean deep blue eyes, ready wit, and an angel and no devil on his shoulder.The only problem is, the life isn't giving her up.Jack Hoffman broke up with Candy over a year ago, and it about killed him, but he couldn't take the drama, the lies, and the disappearances anymore. A few weeks after their break up, she left and he hasn't seen her since.Until tonight. At the Christmas concert Jack attends with his best friends Mila and Freddie every year. Candy's on the arm of a very wealthy, very mean, and much older man suspected of criminal ties.Jack barely recognizes her. Her red locks are now blond, and she's dripping in diamonds.That is until halfway through the concert when he sees her trying to sneak out the back of the building in a waitress uniform, with her hair magically transformed to brown.To bad for her the snow's been piling up and they're trapped. Again. But good news for Jack, who's determined to get to the bottom of this.And his desire to do so has nothing to do with the fact that just the sight of her makes his heart race, makes him feel alive, and hopeful like he hasn't in a year.And he's certainly not going to listen to Mila, who swears Candy's reappearance is a Christmas miracle, or Freddie telling him to man up and get her back.Nope, he's done. But . . . who knows how long they'll be snowed in?A second-chance romance that will have you giddy for Christmas music, hijinks, and miracles.",
  "genres": [
    "Romance",
    "Christmas"
  ],
  "author": "Ellie Thornton",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/59957963-snowed-in-at-the-concert-hall"
}