{
  "title": "Royal Valentine",
  "description": "Molly Graham doesn't believe in love at first sight or fairy tales. She's been burned too many times before. When her best friend, Brianna Cho, challenges her to aim high and go for men who are out of her league, Molly can't imagine a worse way to spend Valentine's Day. When she stumbles across a very handsome British professor, Albert George, seeking refuge in her office during the Museum of Literature's Valentine's Day gala for the opening of their Austen exhibit, Molly can't help but be drawn to the fellow introverted academic. Together they ghost out of the event and embark upon a month long love affair. Molly is rethinking her stance on happily ever afters and plans to tell Al how she feels, but he disappears. Afraid something bad has happened, Molly searches for him only to discover there is no Albert George affiliated with the university. She's been played for a fool!Molly is devastated. As registrar for the Museum of Literature, she is tasked with a trip to England to return the Jane Austen exhibition materials on loan from the Whitmore Estate in Bath. It's the only thing she has to look forward to and even this dream trip is a struggle. When she and Brianna arrive at Whitmore Manor, they are introduced to Earl Whitmore and his grandson Lord Insley, or as Molly knows him Albert George. She is shocked and dismayed to discover she has fallen in love with a viscount in line to be an earl. James Albert George Insley Whitmore, called Jamie by his friends and family, arranged for Molly to bring the materials back. He had to leave her unexpectedly, but he hasn't been able to forget her and he wants to win her back. Molly isn't having it. She refuses to be taken in twice. Jamie will have to channel his inner Fitzwilliam Darcy to prove to her that love conquers all and win her heart for good.",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary",
    "Novella",
    "Contemporary Romance",
    "Fiction",
    "Chick Lit"
  ],
  "author": "Jenn McKinlay",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/59960488-royal-valentine"
}