{
  "title": "The Means of Reproduction: Sex, Power, and the Future of the World",
  "description": "In this groundbreaking work of investigative journalism by the author of the New York Times bestseller Kingdom Coming, Michelle Goldberg exposes the global war on women's reproductive rights and its disastrous and unreported consequences for the future of global development Women's rights are often treated as mere appendages to great questions of war, peace, poverty, and economic development. But as networks of religious fundamentalists, feminists, and bureaucrats struggle to remake sexual and childbearing norms worldwide, the battle to control women's bodies has become a high-stakes enterprise, with the United States often supporting the most reactionary forces. In a work of incisive cultural analysis and deep reporting, Michelle Goldberg shows how the emancipation of women has become the key human rights struggle of the twenty-first century. The Means of Reproduction travels through four continents, examining issues such as abortion, female circumcision, and Asia's missing girls to show how the battle over women's bodies has been globalized and how, too often, the United States has joined sworn enemies such as Iran and Sudan in an axis of repression. Reporting with unique insight from both the rarefied realm of international policy and from individual women's lives, Goldberg elucidates the economic, demographic, and health consequences of women's oppression, which affect more than half the world's population. As The Means of Reproduction reveals, the conflict between self-determination and patriarchal tradition has come to define pressing questions of global development. Empowering women is the key to retarding the progress of AIDS, curbing overpopulation, and helping the third world climb out of poverty, but attempts to improve women's status elicit fierce opposition from conservatives who see women's submission as key to their own national or religious identity. From the anticommunist genesis of America's attempts to stem population growth in poor countries to the current worldwide attack on women's rights as a decadent Western imposition, Goldberg explores the interplay between the great issues of our time and the politics of sex and childbearing. Finally, The Means of Reproduction shows how women, strengthened by a solidarity that transcends borders, are fighting for freedom.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Politics",
    "History",
    "Sexuality",
    "Gender",
    "Womens"
  ],
  "author": "Michelle Goldberg",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/5997693-the-means-of-reproduction"
}