{
  "title": "Seventy-five Years on the Border",
  "description": "\"In 1912, James Williams…published…'Seventy Five Years on the Border'…wrote of early life in Missouri…encounters with…lynx, panthers, and wolves…biographies.\" - Cameron Sun, Aug. 27, 1970\"According to Seventy-five Years on the Border by James Williams, the year 1860 was the greatest drought that Western Kansas and Eastern Kansas had seen to that day.\" - Cameron Sun, July 18, 1955\"James Williams of Cameron, Mo….is now the oldest citizen of Clinton county, having moved…to…his present home near Cameron, 1842…very interesting book, 'Seventy-five Years on the Border.'\" - Word and Way (KCMO), July 2, 1914What did early pioneers of Clinton County, Missouri, do to survive frequent encounters with panthers, lynx, and wolves when the area was wilderness in the 1800s?Northwest Missouri pioneer James Williams describes how the early settlers made their homes, reared their families, raised their produce, milled their grain, hunted, trapped, held social meetings, and conducted business in 19th century Missouri.Seventy-Five Years on the Border, by James Williams (1834-1923) of Cameron, Missouri, was published in 1912. Williams was born in 1834 at Boonville, Missouri, and his book is a collection of reminiscences of pioneer days in northwestern Missouri. Many interesting and valuable incidents and tales are related that throw light on the social and economic conditions existing in the early days.The recollections of pioneers are valuable source material for the historian. They furnish first hand information on those subjects that today are difficult to trace. When properly interpreted they open new fields for the research worker. The pioneer's memory rarely errs in describing how the early settlers made their homes, reared their families, raised their produce, milled their grain, hunted, trapped, held social meetings, and conducted business.",
  "genres": [],
  "author": "James Williams",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/59981932-seventy-five-years-on-the-border"
}