{
  "title": "An Affair for Aumont",
  "description": "All he wants is the love he lost.Four years ago, Louis-Charles Aumont, the Marquis de Montespan, chose duty over the man he loved. And then the man he loved chose death in service to England. Now, after finally cutting ties with his king, Aumont is living in a slum in Seven Dials–and intending to die there too. But when Bow Street Runner George Darling shows up at his door with a strange proposition, Aumont is intrigued by the prospect of something–anything–that might make him feel alive again. Or at least provide the funds he needs to drink himself to death.All he wants is the love he couldn’t have.George Darling joined the Bow Street Runners out of a belief in order. He accepts no bribes, indulges in no vices, and tries very hard not to dream above his station. If only Lord Christmas Gale hadn’t put that last one to such a test. Now that turning his thoughts from Lord Christmas only lands them instead on the handsome Frenchman with whom he recently crossed paths, Darling is more determined than ever to keep his head down and focus on his duty–until a knock on his door sends his life into disarray. Teddy Honeyfield, a former companion of Lord Christmas’s, is in need of a temporary bodyguard. Darling would never pass as the sort of gentleman Teddy requires…but he knows someone who might.Neither wants to take a chance on a love that can never be.When Aumont and Darling join forces to help Teddy, they’re not expecting to risk their hearts as well as their lives. Darling’s striking looks remind Aumont quite painfully of the man he’s lost, and Aumont’s title reminds Darling he has no right to desire a nobleman. But the rising threat soon drives them to flee with Teddy to the country–a journey that puts them face-to-face with their pasts while showing them a chance for happiness is within reach, if only they’re courageous enough to grab it.An Affair for Aumont is the fifth book in The Lords of Bucknall Club series, where the Regency meets m/m romance. The Lords of Bucknall Club books can be read as standalones but are best enjoyed in order.",
  "genres": [
    "Historical",
    "Romance",
    "M M Romance",
    "Historical Fiction",
    "Historical Romance",
    "Queer",
    "LGBT"
  ],
  "author": "J.A. Rock",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/59968552-an-affair-for-aumont"
}