{
  "title": "La filosofía y el barro de la historia",
  "description": "En este libro esencial Jose Pablo Feinmann aborda los grandes nombres de la filosofia occidental, Descartes, Hegel, Marx, Nietzsche, Heidegger, Sartre, Foucault, Adorno y Horkheimer Derrida no como cristalizados héroes del pensamiento sino como representantes de cada época en la que les toco vivir. La convicción que ha motivado este trabajo es que la filosofía tiene que ayudar a comprender la historia ya que cada filosofía es hija de una época que a la vez expresa refleja e ilumina. La de Feinmann es una mirada critica y reclama que la filosofía vuelva a pensar en el sujeto en la historia y en la política que salga a la calle al riesgo a participar activamente en los tumultuosos problemas del ser humano.Como dice en el prologo el filosofo y traductor de Ser y Tiempo al italiano Franco Volpi: Lo que encontramos en estas paginas apasionantes es un inagotable tanque de ideas un formidable gimnasio para pensar un ejercicio de lucidez e inteligencia critica. Dialogar con los filósofos que Feinmann presenta nos entrena a pensar a plantear problemas a poner en cuestión y a averiguar la consistencia de las convicciones según las cuales vivimos. Nos ensena a vigilar a luchar contra la resistencia tenaz de los prejuicios a liberarnos de la tiranía de lo obvio y de lo habitual. Dialogar con los grandes filósofos que Feinmann nos presenta entrar en sus teorías seguir sus argumentaciones es una excelente escuela de pensamiento pues nos obliga a enfrentarnos con lo que nosotros mismos no habíamos pensado. Son los mejores maestros con los que podemos aprender los mejores interlocutores con los que podemos dialogar los libros que debemos leer. En suma un patrimonio inestimable de sabiduría. Por eso estas paginas no son neutrales: nos dejan mas fuertes o mas débiles mas felices o mas tristes mas seguros o mas inciertos nunca como antes. Desde sus primeras paginas La filosofía y el barro de la historia nos interpela: En estos tiempos de reinado del sujeto absoluto comunicacional, en los que resulta difícil descifrar los sofisticados métodos del poder para dominar la existencia, es hora de volver a la filosofía, para que su lucidez y su relación crítica nos vuelvan a iluminar. Y Feinmann nos contagia su pasión con admirable claridad expositiva.",
  "genres": [
    "Philosophy",
    "History",
    "Nonfiction"
  ],
  "author": "FEINMANN",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/5997852-la-filosof-a-y-el-barro-de-la-historia"
}