{
  "title": "I Love a Man in Uniform: A Memoir of Love, War, and Other Battles",
  "description": "An all-American love story about a former punk-rock stripper and her unlikely marriage to an officer in the U.S. Army.In this brave, eloquent, and often funny memoir, critically acclaimed author Lily Burana writes about love, war, and the realities of military marriage with an honesty few writers would dare.A former exotic dancer who once had a penchant for anarchist politics and purple hair dye, Lily's rebellious past never would have suggested a marriage into the military. But then she met Mike, a Military Intelligence officer, and fell hopelessly in love, resulting in a most unorthodox romance-poignant, passionate, and utterly unpredictable.After Lily and Mike said \"I do\" in a brief, pre-deployment City Hall ceremony, Mike left for Operation Iraqi Freedom, and Lily was left in a strange town to endure his absence alone, with no support system and little knowledge of the vast and confusing military world into which she had married.Upon Mike's return from the war, the couple moved to historic West Point, where Lily found that life on base had its own challenges. As the war continued and the past intruded unexpectedly into the present, Lily and Mike found themselves plunged into the nightmare of Post Traumatic Stress Disorder. Struggling to cope in a community where admitting weakness is the ultimate tabooand \"suck it up\" is the suggested response to emotional pain, Lily suffered from depression so severe, it almost ended their marriage. With the help of a revolutionary therapeutic technique, the couple made their way out of the darkness and back to each other. Through it all, Lily wrangled with her preconceptions about the military and found her place within the uniquely supportive sisterhood of military wives.From harrowing emotion to the dishy details of life on base, Lily Burana bares her heart and soul as a modern military spouse. I Love a Man in Uniform is a profoundly moving story of how a woman can locate, and heal, her true self as a dedicated Army wife, free spirit, and freedom-loving American.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Military Fiction",
    "Biography Memoir",
    "Romance",
    "Relationships",
    "Biography"
  ],
  "author": "Lily Burana",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/5997536-i-love-a-man-in-uniform"
}