{
  "title": "Not For Me",
  "description": "A Fake Dating Romantic ComedyIt’s a fake arrangement.Two weeks with me. A free vacation and one very convincing date with her. What could possibly go wrong?♥ ♥ ♥To avoid going on blind dates arranged by my mother, I agree to pretend-date my sister’s best friend. Imagine my surprise when she turns out to be the beautiful, dirty-talking woman who caught my attention while running in Central Park.She’s fun, flirty, everything I’m missing in life, and everything I can never have.I had my chance at love and lost big time. Love isn’t in the cards for me, and I’m fine with that. Running a business with my three siblings gives me all the love and purpose I need. ♥ ♥ ♥After two weeks with her, she challenges everything I’d come to accept. I want more than she’s willing to give, and I can’t risk getting hurt a second time. To protect my heart, I’ll have to work overtime to keep this relationship fake.Not For Me is a dual POV steamy full-length STANDALONE romance filled with lots of sexy times in the bedroom, profanity, and love with a HEA ending!♥ ♥ ♥Author Notes: Fans of Claire Kingsley, Melanie Harlow, Lauren Landish, and Amy Daws will love this new series by Aria Bliss. Get ready to stay up all night laughing, crying, and swooning because this series has it all. A fake dating, sister’s best friend, opposites attract, forced proximity romance with a sexy, grumpy bar manager who’s given up on love and a career-driven woman who only has eyes for her laptop. This one has all the feels and enough steam to fog up your windows.The books in A Drunk Love Romantic Comedy series are all standalone novels and can be read in any order. But if you love family drama and the subtle build of future romances, I suggest you read them in order, starting with Not For Me.",
  "genres": [
    "Romance",
    "Contemporary",
    "Forced Proximity"
  ],
  "author": "Aria Bliss",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/59963456-not-for-me"
}