{
  "title": "Where Spirit Touches Matter: a journey toward wholeness",
  "description": "Inspired by his immigrant physician mother, who surmounted multiple obstacles in her forty-five year-career, Dr. Friedman worked through a twenty-year battle with depression to realize the life-saving power of committing himself to love, spirit, and service. This story of his personal journey toward wholeness offers thoughtful advice for those who suffer and encouragement for those aspiring to careers in the healing arts. Where Spirit Touches Matter: A journey toward wholeness is a book about health, healing, and hope by a physician who has spent more than thirty-five years helping patients find relief from pain and suffering. Dr. Friedman writes: \"On a journey to Tibet, while circling what is widely considered the holiest mountain on Earth, Mount Kailash, which sources the five great rivers of Asia with its runoff, I heard the myth that one of the rivers, the Saraswati, existed only in nonmaterial form. In this form, it contributed a spiritual and vitalistic energy to the holy Ganges, which arises at the convergence of four rivers in the Himalayan region of India.\"Eight years later, on my last journey to India, I stood in front of the gorge where the Saraswati River originates, and I wept. I wept because I saw that the nonmaterial had become material, and that the chasm between the mythological and the physically real had been bridged. This is the meeting place of spirit and matter that I have pursued in endless forms throughout my life.\"This book chronicles a sampling of my experiences of that space between. It honors the continuously moving stream running through all of time and space, filled wholly with the presence of a loving consciousness. I am grateful to have been a participant in the flow of that stream and to have been given the opportunity to return whatever love I can into that current.\"",
  "genres": [
    "Nonfiction",
    "Medicine"
  ],
  "author": "Melvin R. Friedman",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/59963279-where-spirit-touches-matter"
}