{
  "title": "Good Wine & Bad Decisions",
  "description": "I’m a hot mess.My life is defined by one bad decision after another.Unfortunately, running away from home won’t fix the disaster that is me.♥ ♥ ♥I’ve been called a pushover, a people pleaser, and my personal favorite a doormat. My doormat tendencies are how I got myself into my current mess in the first place. I’m too nice and too trusting. I trusted my roommate—and former best friend—and look where that got me.Finding her in bed with my boyfriend, riding him like a bucking bronco was the final straw. Roommates slash best friends don’t jump in bed with their other friends’ dates, boyfriends, significant others, spouses, and everything in between. That’s not how this is done.Girl code, bitch. Girl code.So, I left.And hopped on the first plane to Italy.♥ ♥ ♥Then I met Jaxon. The American from Boston with a sexy accent and panty-melting grin. He’s exactly the kind of man I’d hit on, and consider making more bad decisions with.He’s tall, dark, and handsome with killer biceps. Plus, I see a hint of a tattoo peeking out from under his shirt sleeve that I really want to examine closer. I’m a sucker for tattoos.Just when I think things are looking up, Jaxon reprimands me like I’m an unruly child for—get this—drinking my wine wrong.Forget Jaxon and his drop-dead gorgeous body, and panty-melting smile. This guy just got downgraded to Jackass.♥ ♥ ♥When one night turns into two weeks, Lily and Jaxon struggle to keep their relationship out of the bedroom. Jaxon’s past continues to haunt him, and Lily can’t escape the constant reminders of her mistakes. They both have to learn how to forgive themselves and accept that they deserve happiness before there’s any hope for the love forming between them.Good Wine & Bad Decisions is a dual POV, steamy full-length STANDALONE romance filled with lots of sexy times in the bedroom (and on the beach), profanity, and love with a HEA ending!",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Aria Bliss",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/59979385-good-wine-bad-decisions"
}