{
  "title": "The Woman in the Zoot Suit: Gender, Nationalism, and the Cultural Politics of Memory",
  "description": "The Mexican American woman zoot suiter, or pachuca, often wore a V-neck sweater or a long, broad-shouldered coat, a knee-length pleated skirt, fishnet stockings or bobby socks, platform heels or saddle shoes, dark lipstick, and a bouffant. Or she donned the same style of zoot suit that her male counterparts wore. With their striking attire, pachucos and pachucas represented a new generation of Mexican American youth, which arrived on the public scene in the 1940s. Yet while pachucos have often been the subject of literature, visual art, and scholarship, The Woman in the Zoot Suit is the first book focused on pachucas. Two events in wartime Los Angeles thrust young Mexican American zoot suiters into the media spotlight. In the Sleepy Lagoon incident, a man was murdered during a mass brawl in August 1942. Twenty-two young men, all but one of Mexican descent, were tried and convicted of the crime. In the Zoot Suit Riots of June 1943, white servicemen attacked young zoot suiters, particularly Mexican Americans, throughout Los Angeles. The Chicano movement of the 1960s–1980s cast these events as key moments in the political awakening of Mexican Americans and pachucos as exemplars of Chicano identity, resistance, and style. While pachucas and other Mexican American women figured in the two incidents, they were barely acknowledged in later Chicano movement narratives. Catherine S. Ramírez draws on interviews she conducted with Mexican American women who came of age in Los Angeles in the late 1930s, 1940s, and 1950s as she recovers the neglected stories of pachucas. Investigating their relative absence in scholarly and artistic works, she argues that both wartime U.S. culture and the Chicano movement rejected pachucas because they threatened traditional gender roles. Ramírez reveals how pachucas challenged dominant notions of Mexican American and Chicano identity, how feminists have reinterpreted la pachuca, and how attention to an overlooked figure can disclose much about history making, nationalism, and resistant identities.",
  "genres": [
    "History",
    "Nonfiction",
    "Gender",
    "Queer",
    "Fashion",
    "American History",
    "LGBT"
  ],
  "author": "Catherine S. Ramírez",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/6000358-the-woman-in-the-zoot-suit"
}