{
  "title": "Theories of Interval Arithmetic: Mathematical Foundations and Applications",
  "description": "Reviews\"This new book by Hend Dawood is a fresh introduction to some of the basics of interval computation. It stops short of discussing the more complicated subdivision methods for converging to ranges of values, however it provides a bit of perspective about complex interval arithmetic, constraint intervals, and modal intervals, and it does go into the design of hardware operations for interval arithmetic, which is something still to be done by computer manufacturers.\"- Ramon E. Moore , (The Founder of Interval Computations)Professor Emeritus of Computer and Information Science, Department of Mathematics, The Ohio State University, Columbus, U.S.A .\"A popular math-oriented introduction to interval computations and its applications. This short book contains an explanation of the need for interval computations, a brief history of interval computations, and main interval computation techniques. It also provides an impressive list of main practical applications of interval techniques.\"- Vladik Kreinovich , (International Journal of Uncertainty, Fuzziness and Knowledge-Based Systems)Professor of Computer Science, University of Texas at El Paso, El Paso, Texas, U.S.A .\"I am delighted to see one more Egyptian citizen re-entering the field of interval mathematics invented in this very country thousands years ago.\"- Marek W. Gutowski ,Institute of Physics, Polish Academy of Sciences, Warszawa, PolandBook DescriptionScientists are, all the time, in a struggle with uncertainty which is always a threat to a trustworthy scientific knowledge. A very simple and natural idea, to defeat uncertainty, is that of enclosing uncertain measured values in real closed intervals. On the basis of this idea, interval arithmetic is constructed. The idea of calculating with intervals is not completely new in the concept has been known since Archimedes, who used guaranteed lower and upper bounds to compute his constant Pi. Interval arithmetic is now a broad field in which rigorous mathematics is associated with scientific computing. This connection makes it possible to solve uncertainty problems that cannot be efficiently solved by floating-point arithmetic. Today, application areas of interval methods include electrical engineering, control theory, remote sensing, experimental and computational physics, chaotic systems, celestial mechanics, signal processing, computer graphics, robotics, and computer-assisted proofs. The purpose of this book is to be a concise but informative introduction to the theories of interval arithmetic as well as to some of their computational and scientific applications.",
  "genres": [
    "Mathematics"
  ],
  "author": "Hend Dawood",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/12848098-theories-of-interval-arithmetic"
}