{
  "title": "Isle of The Immortal",
  "description": "A land plagued in darkness. One woman who carries the weight of the sun. In her twenty-three years of life, Shailin Srijan has never ventured past the mortal confines of her remote Scottish village. Working solely as her brother’s keeper and avoiding the small-town gossip of villagers, she’s never thought to question the mundane reality of her existence – until her brother’s condition suddenly worsens and all hope seems lost. Reeling at the thought of losing the only family she’s ever known, Shailin hastily agrees to her mother’s farfetched proposal: enter into the Immortal realm to face the greatly feared and equally mysterious Vampire King, who happens to owe the Srijans a life debt. The Immortal is just as enigmatic as it is ethereally alluring, and left without any other viable options, Shailin has no choice but to honor her mother’s wishes and make for the magical lands. Only once there, she finds herself thrust into a dying world of indefinite darkness and legendary monsters that have taken permanent residence in a kingdom without daylight. Even more unexpected than the realm’s unconventional nocturnal splendor is the presence of Axton, a masked vigilante also traveling to the ruler’s castle. Though Shai knows better than to trust a man with a secret, she can’t help the budding attraction that only heightens as an unlikely relationship forms between the two. Upon facing King Ezrium, Shailin will have to unravel a startling truth that upends the life she’s always known and decide whether she wishes to conform or pave her own way in a world of magic and mayhem. \"Isle of The Immortal\" is an adult fantasy romance that contains content suitable for readers 18+ older.",
  "genres": [
    "Fantasy",
    "Romance",
    "Vampires",
    "Fantasy Romance",
    "New Adult",
    "Paranormal",
    "Paranormal Romance"
  ],
  "author": "S.M. Estrada",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/59985680-isle-of-the-immortal"
}