{
  "title": "Fringe Dwellers",
  "description": "Fringe Dwellers - reviewed by Donna Langevin, author of In the Cafe Du Monde and other books of poetry and winner of the Ray Burrell Award for PoetryImmigrants, businessmen, professors, librarians, computer wizards, tradespeople, panhandlers, alcoholics, victims of incest, two ghosts who meet in the cemetery: what do these members of the enormous cast of author Shane Joseph’s characters have in common? Highly readable and suspenseful, there is a common quest for well-being and happiness that unifies the cast. However, it is the individual journeys that make this book of short stories fascinating. Each character is a “fringe dweller” not necessarily because of economic status, social class or being a newcomer to Canada, but because he or she often has a past that has shut others out. The consequences are lives in which loneliness and isolation are paramount. Thus, each character must seek a kind of “personal redemption” by confronting the past in order to move on in positive ways. Sound familiar? Dostoevsky, Conrad and many other writers have wrestled with a similar theme as their protagonists engaged in life’s struggles.Shane Joseph who obviously draws on his own experience as an immigrant and his many career stints to create a sense of reality, dares to offer some plausible solutions. One’s fate is never changed by anything as momentous as a lightning bolt, miracle, winning a lottery or grand religious enlightenment. On the pilgrimage toward redemption the only “angels” in Fringe Dwellers are the flawed but kindly strangers encountered by chance. In Virtual Guy, a software consultant offers to share his hotel room with a business man when their flight is cancelled due to a snowstorm. Their interaction enables the latter to move on after his divorce and to revamp his career. In the title story, Vinod, an immigrant from India befriends Sid, an embittered war veteran. He drives him to a hospital where the staff is so caring that Sid ends up working at a hospice after his recovery. In Silence, Andrew a busy executive who had neglected his wife goes to a weekend retreat. As he holds the hand of a dying old man, he realizes “at that moment it was a good proxy” for his wife who passed away while he was on a business trip. Thus, simple acts of kindness and compassion allow the characters to atone and to reach out again. In the powerful Let My People Stay, this theme is played out on a grander scale. When her congregation of elderly white people becomes excluded by a Chinese congregation using her church, Rev. Julia Styles holds an outdoor service where all immigrant groups are welcome. Sound preachy or simplistic? Shane Joseph is too thoughtful a writer to fall into the trap of formulaic writing. Sometimes a character is beyond salvation. In Rage, the woman suffering from incest finds release rather than redemption by murdering her brother. In many other stories the secondary characters fall by the wayside because they lack insight and the compassion that make change possible.The well-crafted Fringe Dwellers is an appealing read because of the reliable and relevant theme of “second chances.”Fringe Dwellers can be purchased online at Amazon or via the publisher’s website at www.hiddenbrookpress.com",
  "genres": [],
  "author": "Shane Joseph",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/5998757-fringe-dwellers"
}