{
  "title": "Cupid Calamity",
  "description": "One cupid, two calamities, four uproarious lovers.From the minds of Evie Alexander and Kelly Kay, comes a disastrously perfect blind date and a wild night out. Insta-love meets insta-disaster in these laugh-out-loud Valentine’s day novellas.Animal Attraction - By Evie AlexanderOverworked, underpaid, and perpetually single, Laurie is stuck in a rut. A birthday on Valentine’s day is bad enough, but when her insensitive colleagues drag her to a secret Safari dining experience, her day hits rock bottom - she’s terrified of animals.Workaholic Ben has just swapped the States for Somerset. He’s on track to fulfil a childhood dream, and the only date he wants on Valentine’s day is a business one. But when his fantasy woman approaches with an offer he can’t refuse, his priorities start to change.Laurie and Ben have an instant connection and their chemistry is wild. Unfortunately so are the animals. When the menagerie goes into meltdown they’re thrown into a Darwinian Hunger Games, fighting for their lives as well as love. Can Businessman Ben unleash his inner Tarzan and save Laurie? Or has this survival of the fittest reached the point of no return?Stupid Cupid - by Kelly KayResourceful Sabrina always puts others' needs first. She never thought she’d be abandoning a blind date to run off with a stranger. But now she’s got the chance to face her demons and choose happiness – even if it’s just for one night.Charmer Patrick can make any situation work in his favor. But snark and humor won’t be enough to win Sabrina’s heart. He’s got to dig deep, open up, and take on fate as well as New York City.Armed with a fire extinguisher, a cobbler’s hammer, and an EpiPen, can Patrick and Sabrina survive the worst-best date of their lives and find true love? Or will they lose each other as well as the plot?Perfect for fans of Kayley Loring, Tara Sivec, Lyssa K Adams, Talia Hibbert, Annika Martin, Vi Keeland, Lucy Score, Pippa Grant and Heather M. Orgeron.COMING UP IN 2022:Cookout Carnage, featuring 'Up in Smoke' & 'Off with a Bang'Cute farm boy Jonathan clings to a love ideal, blissfully ignoring what the universe has planned, while keeping track of a pig... Posh Brit Tristan follows his heart into the American Midwest in search of the bottom half of his digital dream love.Christmas Chaos, featuring 'No Way in a Manger' & 'No Crib and No Bed'From Highland and Hollywood Games; Zoe and Rory attempt to have a civilized and respectable rite of passage. But straightforward is not their style. From Over The Bus & Under The Bus; Bax and Tabi attempt to throw a meaningful Christmas celebration. But there are too many people involved and it’s nothing like they expect.",
  "genres": [
    "Romance",
    "Contemporary",
    "Novella",
    "Christmas",
    "Holiday",
    "Chick Lit",
    "Contemporary Romance"
  ],
  "author": "Kelly  Kay",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/59983387-cupid-calamity"
}