{
  "title": "All about Me!: My Remarkable Life in Show Business",
  "description": "At 95, the legendary Mel Brooks continues to set the standard for comedy across television, film, and the stage. Now, for the first time, this EGOT (Emmy, Grammy, Oscar, Tony) winner shares his story in his own words. “I hope fans of comedy will get a kick out of the stories behind my work, and really enjoy taking this remarkable ride with me.”—Mel Brooks For anyone who loves American comedy, the long wait is over. Here are the never-before-told, behind-the-scenes anecdotes and remembrances from a master storyteller, filmmaker, and creator of all things funny.All About Me! charts Mel Brooks’s meteoric rise from a Depression-era kid in Brooklyn to the recipient of the National Medal of Arts. Whether serving in the United States Army in World War II, or during his burgeoning career as a teenage comedian in the Catskills, Mel was always mining his experiences for material, always looking for the perfect joke. His iconic career began with Sid Caesar’s Your Show of Shows, where he was part of the greatest writers’ room in history, which included Carl Reiner, Neil Simon, and Larry Gelbart. After co-creating both the mega-hit 2000 Year Old Man comedy albums and the classic television series Get Smart, Brooks’s stellar film career took off. He would go on to write, direct, and star in The Producers, The Twelve Chairs, Blazing Saddles, Young Frankenstein, Silent Movie, High Anxiety, and Spaceballs, as well as produce groundbreaking and eclectic films, including The Elephant Man, The Fly, and My Favorite Year. Brooks then went on to conquer Broadway with his record-breaking, Tony-winning musical, The Producers. All About Me! offers fans insight into the inspiration behind the ideas for his outstanding collection of boundary-breaking work, and offers details about the many close friendships and collaborations Brooks had, including those with Sid Caesar, Carl Reiner, Gene Wilder, Madeleine Kahn, Alfred Hitchcock, and the great love of his life, Anne Bancroft. Filled with tales of struggle, achievement, and camaraderie (and dozens of photographs), readers will gain a more personal and deeper understanding of the incredible body of work behind one of the most accomplished and beloved entertainers in history.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Humor",
    "Audiobook",
    "Autobiography",
    "Comedy"
  ],
  "author": "Mel Brooks",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/60009478-all-about-me"
}