{
  "title": "The Black Mongrel",
  "description": "“The Light Enthralled by the Darkness” is a story of hate and obsession, full of emotions and sensitivity, set in a fantasy world. The first part tells about the birth and the beginning of something that has never happened before, and which will have a significant impact on the fate of the whole world.\"The Black Mongrel\" is a prologue to a seven-volume story full of forbidden feelings, suffering, passions, struggling with own desires in a world full of hatred, which at all costs wants to destroy sensitivity and uniqueness. In a world that will at all costs try to destroy him for what he is and what he can do ... but even in the deepest darkness, an unexpected light can shine forth, despite being trapped and enchanted by even greater darkness.\"He's not a human being. He's a demon.\"**********His name is Darren, or at least they told him so. He lives in a shelter and in a society divided into castes, he belongs to the worst of them - to the caste of the Black Mongrels - the poorest, the filthiest scrubs living in the lands of Helion. Though even among others like him, he is a misfit and an outcast - because of his demonic eyes and the curse he carries within himself.He shouldn’t exist at all but somehow they let him live, although he spent part of his life in the darkness. He learned to breathe with it and to live in it. The darkness became part of his existence and he knows he should stay in it forever, because he has no right to live after what he’d done.He is the Cursed One. The spawn of the Evil One. The seed of Tenebrae - the Lord of Darkness and Evil.Though on his way he will meet a man who is the true embodiment of evil and who will make his life even more harsh and difficult. Darren will have to learn how to fight to be able to live in this world that wants to crush him at all costs, and to find out the truth about his past.**********He took the black material of the cloak in his hand and brought it to his face. The aroma of musk and herbs burst into his nostrils. He closed his eyes, absorbing these new, unknown sensations when suddenly he heard the grinding, slightly hoarse voice of his Master above him.“Look at me.”He looked up, through knee-high leather boots, through black pants, tunic, wide belt, an endless row of the tiny buttons, through pressed tightly, wet lips as if just moistened until he saw a breathtaking, piercing gaze.Fighting with the monster struggling inside him, the monster who only wanted to attack this man and sink his claws into those piercing eyes, tear them out and not let them look at him like that ever again – he raised the edge of the man’s cloak to his lips and kissed it.It was as sudden as being hit by a training stick. Master Varis’ scent penetrated his nostrils as much as the man’s eyes flashed. Darren had a strange feeling as if that one second had faded into eternity; as if it was going to last, in an endless loop of the eyes that were immersed into each other – Master Varis’ obsidian dark eyes and Darren’s diamond eyes. The ones burning with fire, the other ones – with ice… but the flames were too blinding, and the overflowing feelings too overwhelming to clarify which were which.The silence soaked with sparks was broken by a low murmur.“Exactly, Hayden. This is your place, remember it.”",
  "genres": [
    "LGBT"
  ],
  "author": "Paula Najman",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/60015075-the-black-mongrel"
}