{
  "title": "Pill Head: The Secret Life of a Painkiller Addict",
  "description": "This compelling, honest book investigates the growing epidemic of prescription painkiller abuse among today's Generation Rx. Through gripping profiles and heartbreaking confessions, this memoir dares to uncover the reality--the addiction, the withdrawal, and the recovery--of this newest generation of pill poppers.Joshua Lyon was no stranger to substance abuse. By the time he was seventeen, he had already found sanctuary in pot, cocaine, Ecstasy, and mushrooms--just to name a few. Ten years later, on assignment for Jane magazine, he found himself with a two-inch-thick bottle of Vicodin in his hands and only one decision to make: dispose of the bottle or give in to his curiosity. He chose the latter. In a matter of weeks he'd found his perfect drug.In the early half of this decade, purchasing painkillers without a doctor was as easy as going online and checking the spam filter in your inbox. The accessibility of these drugs--paired with a false perception of their safety--contributed to their epidemic-like spread throughout America's twenty-something youth, a group dubbed Generation Rx. Pill Head is Joshua Lyon's harrowing and bold account of this generation, and it's also a memoir about his own struggle to recover from his addiction to painkillers. The story of so many who have shared this experience--from discovery to addiction to rehabilitation--Pill Head follows the lives of several young people much like Joshua and dares to blow open the cultural phenomena of America's newest pill-popping generation.Marrying the journalist's eye with the addict's mind, Joshua takes readers through the shocking and often painful profiles of recreational users and suffering addicts as they fight to recover. Pill Head is not only a memoir of descent, but of endurance and of determination. Ultimately, it is a story of encouragement for anyone who is wrestling to overcome addiction, and anyone who is looking for the strength to heal.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Psychology",
    "Mental Health",
    "Mental Illness",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Joshua Lyon",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/6001372-pill-head"
}