{
  "title": "The Last Folk Hero: The Life and Myth of Bo Jackson",
  "description": "By the New York Times bestselling author of Showtime—the source for HBO’s Winning Time—the definitive biography of mythic multi-sport star Bo Jackson.From the mid-1980s into the early 1990s, the greatest athlete of all time streaked across American sports and popular culture. Stadiums struggled to contain him. Clocks failed to capture his speed. His strength was legendary. His power unmatched. Video game makers turned him into an invincible character—and they were dead-on. He climbed (and walked across) walls, splintered baseball bats over his knee, turned oncoming tacklers into ground meat. He became the first person to simultaneously star in two major professional sports, and overtook Michael Jordan as America’s most recognizable pitchman. He was on our televisions, in our magazines, plastered across billboards. He was half man, half myth.Then, almost overnight, he was gone.He was Bo Jackson.Drawing on an astonishing 720 original interviews, New York Times bestselling sportswriter Jeff Pearlman captures as never before the elusive truth about Jackson, Auburn University’s transcendent Heisman Trophy winner, superstar of both the NFL and Major League Baseball and ubiquitous “Bo Knows” Nike pitchman. Did Bo really jump over a parked Volkswagen? (Yes.) Did he actually run a 4.13 40? (Yes.) During the 1991 flight that nearly killed every member of the Chicago White Sox, was he in the cockpit trying to help? (Oddly, yes. Or no. Or … maybe.)Bo Jackson isn’t Jim Thorpe.He’s not Deion Sanders, either. No, Bo Jackson is Paul Bunyan. The Last Folk Hero is the true tale of Bo Jackson that only “master storyteller” (NPR) Jeff Pearlman could tell.",
  "genres": [
    "Sports",
    "Biography",
    "Baseball",
    "Nonfiction",
    "Football",
    "Biography Memoir",
    "History"
  ],
  "author": "Jeff Pearlman",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/60012371-the-last-folk-hero"
}