{
  "title": "A Place Called Home",
  "description": "PORCHLIGHT BESTSELLERZibby Owens 2022 Book of the YearA galvanizing, stirring memoir about growing up homeless and in foster care and rising to become a leading advocate for child welfare, recognized by President Obama as an American Champion of Change.  “You will fall in love with David Ambroz, his beautifully-told, gut-wrenching story, and his great big heart.” (Jeanette Walls, author of The Glass Castle )“It's impossible to read A Place Called Home and not want to redouble your efforts to fight the systems of poverty that have plagued America for far too long. In this book, David shares his deeply personal story and issues a rousing call to make this a more humane and compassionate nation.”— HILLARY RODHAM CLINTONThere are millions of homeless children in America today and in A Place Called Home , award-winning child welfare advocate David Ambroz writes about growing up homeless in New York for eleven years and his subsequent years in foster care, offering a window into what so many kids living in poverty experience every day.           When David and his siblings should be in elementary school, they are instead walking the streets seeking shelter while their mother is battling mental illness. They rest in train stations, 24-hour diners, anywhere that’s warm and dry; they bathe in public restrooms and steal food to quell their hunger. When David is placed in foster care, at first it feels like salvation but soon proves to be just as unsafe. He’s moved from home to home and, in all but one placement, he’s abused. His burgeoning homosexuality makes him an easy target for other’s cruelty.                David finds hope and opportunities in libraries, schools, and the occasional kind-hearted adult; he harnesses an inner grit to escape the all-too-familiar outcome for a kid like him. Through hard work and unwavering resolve, he is able to get a scholarship to Vassar College, his first significant step out of poverty. He later graduates from UCLA Law with a vision of using his degree to change the laws that affect children in poverty. Told with lyricism and sparkling with warmth, A Place Called Home depicts childhood poverty and homelessness as it is experienced by so many young people who have been systematically overlooked and unprotected.  It’s at once a gripping personal account of deprivation—how one boy survived it, and ultimately thrived—and a resounding call for readers to move from empathy to action.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Book Club",
    "Audiobook",
    "Social Justice",
    "Biography Memoir"
  ],
  "author": "David Ambroz",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/60021178-a-place-called-home"
}