{
  "title": "The Red Wolf Conspiracy",
  "description": "Already a publishing sensation in England, The Red Wolf Conspiracy marks the debut of a remarkably gifted young writer. Robert V. S. Redick has been compared to Philip Pullman, George R. R. Martin, and China Miéville, among others, and like them he is a spellbinding storyteller, unafraid to sail his imagination into uncharted waters. With The Red Wolf Conspiracy he launches the first book of a trilogy destined to take its place among the classics of epic fantasy.The Imperial Merchant Ship Chathrand is the last of her kind. Six hundred years old, the secrets of her construction long forgotten, the massive vessel dwarfs every other sailing craft in the world. It is a palace with sails, a floating outpost of the Empire of Arqual. And it is on its most vital mission to deliver a young woman whose marriage will seal the peace between Arqual and its mortal enemy, the secretive Mzithrin Empire. But the young woman in question-Thasha, the daughter of the Arquali ambassador-has no intention of going meekly to the altar. For the ship's true mission is not peace but war-a war that threatens to unleash an ancient, all-consuming evil.As the dark conspiracy at the heart of the voyage unfurls, Pazel Pathkendle, a lowly tarboy with an uncanny gift, will find himself in an unlikely alliance with Thasha and her Hercól, a valet who is more than he appears; Dri, the queen of a race of tiny stowaways who have their own plans for the great ship; and Ramachni, a powerful sorcerer from another world. Arrayed against them are the Chathrand's brutal captain, Nilus Rose; the Emperor's spymaster and chief assassin, Sandor Ott; and the enigmatic Dr. Chadfallow, a longtime friend to Pazel's family whose kind words may hide a vicious betrayal.As the Chathrand navigates treacherous waters to complete its mission, Pazel, Thasha, and their allies-including a singularly heroic rat-must also navigate a treacherous web of intrigue to uncover the secret of the legendary Red Wolf.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "Audiobook",
    "Adventure",
    "High Fantasy",
    "Pirates"
  ],
  "author": "Robert V.S. Redick",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/6001686-the-red-wolf-conspiracy"
}