{
  "title": "Never Gonna Happen",
  "description": "EMILY HAS SWORN OFF LOVE. BUT MAYBE IT'S TIME TO GET BACK IN THE SADDLE . . . ?__________________________Emily Wilkinson has lost everything. Literally. In a hair straightener fire, which has sent her entire flat up in flames. Oh, and her boyfriend (and, incidentally, boss) has just announced he's going back to his wife. So, she needs a new job, a new wardrobe and somewhere to live that isn't her former childhood bedroom, which is experiencing a hostile takeover by the entire contents of Hobbycraft.Early dotcom millionaire Charles Hunter is looking for a live-in PA to help run Bowford Manor and it seems Emily may be the perfect fit. Well, she's spent ten years propping up demanding men, so it's not like she's not qualified. And, most importantly, it's tucked away in the Norfolk countryside, so there's little to no chance of a blossoming romance . . .She is quickly sucked into the whirlwind of the Hunter family and finds herself fending off a difficult housekeeper and Leon, Mr Hunter's driver, who has a crush on her the size of East Anglia. Not to mention Charles's eldest son, Adam, who seems set on turning the estate into a theme park the second his father pops his clogs.But no one mentioned the dashing stable hand, Jamie, who just so happens to be the youngest Hunter. But she's not about to make that mistake again. Definitely not. No, really.A hugely uplifting and totally irresistible romantic comedy that will make you snort with laughter. If you love Sophie Kinsella, Mhairi McFarlane and Sophie Ranald, you don't want to miss this unforgettable page-turner. ___________________________DISCOVER WHY EVERYONE LOVES HEIDI STEPHENS!'Beautifully written, full of charm and a story that will capture your heart, this is the perfect read!' 5* Reader Review'I ABSOLUTELY loved this book! It made me laugh and cry and I am already excited for what Heidi produces next. An excellent debut!' 5* Reader Review 'I LOVED this book! I can't believe it's a debut and can't wait to see what's next for Heidi Stephens' 5* Reader Review'Brilliant! Just Brilliant! Consumed it in a day as I just couldn't put it down. Hilariously funny and sums up life in lockdown perfectly' 5* Reader Review'I read it in one sitting and highly recommend it to anyone looking for a new, wonderful romance to read' NetGalley Reader 'A gorgeous, romantic book, that will whisk you away to sunnier happier times' NetGalley Reader",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Chick Lit"
  ],
  "author": "Heidi Stephens",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/60021399-never-gonna-happen"
}