{
  "title": "Flush: The Remarkable Science of an Unlikely Treasure",
  "description": "For readers of Giulia Enders’ Gut and Bill Bryson’s The Body, a surprising, witty and sparkling exploration of the teeming microbiome of possibility in human feces from microbiologist and science journalist Bryn Nelson.The future is sh*t: the literal kind. For most of human history we’ve been, well, disinclined to take a closer look at our body’s natural product—the complex antihero of this story—save for gleaning some prophecy of our own health. But if we were to take more than a passing look at our poop, we would spy a veritable cornucopia of possibilities. We would see potent medicine, sustainable power, and natural fertilizer to restore the world’s depleted lands. We would spy a time capsule of evidence for understanding past lives and murderous ends. We would glimpse effective ways of measuring and improving human health from the cradle to the grave, early warnings of community outbreaks like Covid-19, and new means of identifying environmental harm—and then reversing it.Flush is both an urgent exploration of the world’s single most squandered natural resource, and a cri de coeur (or cri de colon?) for the vast, hidden value in our “waste.” Award-winning journalist and microbiologist Bryn Nelson, PhD, leads readers through the colon and beyond with infectious enthusiasm, helping to usher in a necessary mental shift that could restore our balance with the rest of the planet and save us from ourselves. Unlocking poop’s enormous potential will require us to overcome our shame and disgust and embrace our role as the producers and architects of a more circular economy in which lowly byproducts become our species’ salvation. Locked within you is a medicine cabinet, a biogas pipeline, a glass of drinking water, a mound of fuel briquettes; it’s time to open the doors (carefully!). A dose of medicine, a glass of water, a gallon of rocket fuel, an acre of soil: sometimes hope arrives in surprising packages.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Audiobook",
    "Biology",
    "Humor",
    "Ecology"
  ],
  "author": "Bryn Nelson",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/60021127-flush"
}