{
  "title": "Nation of Victims: Identity Politics, the Death of Merit, and the Path Back to Excellence",
  "description": "The New York Times bestselling author of Woke Inc. makes the case that the essence of true American identity is to pursue excellence unapologetically and reject victimhood culture.Hardship is now equated with victimhood. Outward displays of vulnerability in defeat are celebrated over winning unabashedly. The pursuit of excellence and exceptionalism are at the heart of American identity, and the disappearance of these ideals in our country leaves a deep moral and cultural vacuum in its wake.   But the solution isn’t to simply complain about it. It’s to revive a new cultural movement in America that puts excellence first again.   Leaders have called Ramaswamy “the most compelling conservative voice in the country” and “one of the towering intellects in America,” and this book reveals why: he spares neither left nor right in this scathing indictment of the victimhood culture at the heart of America’s national decline. Following the success of his instant bestseller Woke Inc., Ramaswamy explains in his new book that we’re a nation of victims now. It’s one of the few things we still have left in common—across black victims, white victims, liberal victims, and conservative victims. Victims of each other, and ultimately, of ourselves.   This fearless, provocative book is for readers who dare to look in the mirror and question their most sacred assumptions about who we are and how we got here. Intricately tracing history from the fall of Rome to the rise of America, weaving Western philosophy with Eastern theology in ways that moved Jefferson and Adams centuries ago, this book describes the rise and the fall of the American experiment itself—and hopefully its reincarnation.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Philosophy",
    "Cultural",
    "American History",
    "Audiobook"
  ],
  "author": "Vivek Ramaswamy",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/60021492-nation-of-victims"
}