{
  "title": "The Yards Between Us: A Memoir of Life, Love, and Football",
  "description": "A groundbreaking memoir from professional NFL player, writer, and advocate R.K. Russell, who made history by becoming the first out active NFL player to identify as bisexual.In 2019, R.K. Russell broke the mold when he came out as bisexual in an essay for ESPN that ignited the sports world. Now, in his powerful memoir, THE YARDS BETWEEN US, he shares his story and explores his love of football, men and women, walking the devastating tightrope of keeping his sexuality secret, the tension between his private and public lives, and the importance of crashing through barriers. One part inspirational journey and one part coming of age as an athlete struggling to break a mold, THE YARDS BETWEEN US follows in the footsteps of moving, impactful sports memoirs like Agassi's OPEN, Misty Copeland's LIFE IN MOTION, and Megan Rapinoe's ONE LIFE.Told through the people and moments that have shaped him, Russell traces the highs and lows of his life in and out of football, from his early life as a shy kid struggling with the expectations on a Black boy and the pull between his quiet nature and his athletic ability, to being drafted by his hometown team the Dallas Cowboys, and then on to seasons with the Tampa Bay Buccaneers and Buffalo Bills. And as his time in the sport comes into full bloom, Russell realizes that keeping his secret in the NFL is easier than in college when life and football are so much more connected to social worlds.Through being cut, injured, and frustrating setbacks, Russell's confidence lags as the secret of his sexuality weighs heavier and heavier. And when that frustration is combined with the devastating loss of his best friend and sole confidant, the darkness that follows also brings a deep understanding that perhaps it's time to make a change. In Los Angeles, against the backdrop of the swaying palm trees and warm sands of Malibu, Russell falls in love and it's the final push he needs to stand up for every part of himself—a professional athlete, a writer, a son, a friend, a lover, a bisexual Black man. In THE YARDS BETWEEN US, R.K. Russell shows us the life-changing power of embracing who you are and fighting to make space so others can do the same.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "LGBT",
    "Sports",
    "Audiobook",
    "Bisexual",
    "Football"
  ],
  "author": "R.K. Russell",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/60021329-the-yards-between-us"
}