{
  "title": "From strength to strength",
  "description": "In From Strength to Strength, Sara Henderson tells her life story, from her birth in September of 1936 up through September of 1991, 55 remarkable years later. It's a life worth telling, and worth reading about. And though the events of Henderson's life are by turns dramatic, tragic, and inspiring, her personality comes through as down-to-earth, straightforward, and sincere. She could be any one of us, a normal person caught up in a whirlwind of a life that demanded more than she thought she had to give, but who ultimately surprised herself and her community with her tenacity and resolve. As the title indicates, Sara sees strength and perseverance as important themes in her life, and much of her autobiography is spent detailing events that helped develop or exhibited those essential characteristics. With four older brothers, she had ample opportunities to learn how to stick up for herself. Other formative tenacity-building experiences included her short but successful tennis competition career (at 14 she was picked to represent New South Wales in the under-15 schoolgirls team) and the car crash at 19 that curtailed her dream of winning Wimbledon. She lay flat on her back for eight months while her bones healed, and then confounded the doctors' predictions by not only learning to walk again but resuming tennis, too. Sara got a job and for a few years lived a sedately rewarding life. Then Charles English Henderson III entered her world, and everything changed. Swept off her feet by his charm, charisma, and attentions, she wed him within the year, and her life became a tempest of romantic champagne and strawberry evenings, furious recriminations over slights and broken promises, and near-death sailing trips through the eye of a hurricane. They lived for a while on a yacht in Hong Kong's harbor, and their first two girls were born in Manila. Then, after five years abroad, Charlie decided to close his failing overseas business and open a cattle station in Australia's Northern Territory. \"The station,\" writes Sara, \"was two hundred miles southwest of Darwin by air, a staggering five hundred by road, if you could call it a road. Our nearest neighbours were about one hundred miles away.\" Throughout her memoir, Henderson's tone is from the heart rather than polished or sophisticated. The prose is not honed, and it is clear that the woman behind the words is not a professional writer. However, her humor and personality come through as clearly as the story she sets out to tell. What she refers to as the \"madcap happenings of my life\" would be deemed tragic by most, while to her, they seem in retrospect to have been the means by which she achieved her character and stature. Unlike other adventure tales, From Strength to Strength will not make you long to experience all that the author experienced. But she does emerge as a remarkable woman, and the components of her autobiography make for a compelling story and an inspirational read, if not necessarily an enviable life. --Stephanie Gold",
  "genres": [
    "Nonfiction",
    "Australia",
    "Autobiography",
    "Memoir",
    "Biography",
    "Book Club",
    "Biography Memoir"
  ],
  "author": "Sara Henderson",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/12849793-from-strength-to-strength"
}