{
  "title": "Prodigal Son",
  "description": "When she was a little girl, Remy Archer fell in love with Hyde Fuller at first sight. In fact, he was the only thing she could see for a very long time. For Remy, it never mattered to her that Hyde was always too serious and always seemed so sad. To her, he was the very best, and the center of her entire world. She never dreamed he would let her down when she needed him the most.Now Remy is a semi-reasonable adult, one with a better understanding of why her intense feelings scared Hyde away when she was at her lowest point. She’s moved on, and if anyone asks she's perfectly happy with the chaotic and hectic life she's built. She’s also really proud that she's still around to experience all the best and worst that surviving something deeply traumatic has to offer. The last thing she needs or wants, is Hyde coming back and taking over her every thought and feeling the way he once did. Unfortunately, they picked the exact same time to come home to search for a little redemption.When he was a little boy, the instant they met, Hyde Fuller wanted nothing more than to protect Remy Archer from everything, including herself. She gleefully took up every moment of his free time, and every ounce of his patience, as they grew alongside one another. He was so intent on keeping her safe, he didn't realize how deeply Remy had worked her way into his heart.Now that Hyde’s facing the biggest challenge and biggest change of his entire life, he deeply regrets walking away from Remy. She was always the one person who always had his back, no matter what. The way Remy loved him used to terrify him, but now, it’s the way he loves her that scares him to death.Hyde knows he needs Remy in his life, so he can finally figure out how to be the man she always believed him to be. History has a bad habit of repeating itself, and Remy has a knack for turning even the most simple of situations end over end. This time Hyde is determined to stay by her side no matter what, even though his love for Remy is going to change more than his life this time around.",
  "genres": [
    "Romance",
    "Audiobook",
    "Second Chance",
    "Contemporary Romance",
    "Friends To Lovers",
    "Contemporary",
    "New Adult"
  ],
  "author": "Jay Crownover",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/60039478-prodigal-son"
}