{
  "title": "Phoenix Code",
  "description": "Book one of the New Beginnings Trilogy. An exhilarating all-male dystopian science fiction. Discover the birth of an advanced human race, their discoveries of new technologies like artificial wombs to grow babies, and anti-aging technologies. A whole new society with advanced technology is born while new laws are written and an infrastructure, devoid of ethnic, religious, or any other components that have steered the human race thus far, is now history.Colonel Dr. McCormick leads the men of Phoenix, with the help of a carefully selected group of brilliant men who, by their ingenuity create a new code of conduct, transforming a civilization of men, who live in harmony without the restrictive pointless rules of the old world.The story begins three years after Doomsday when Colonel Dr. McCormick noticed the men of Phoenix have worked through their grief and loss and is now faced with the sexuality dilemma of almost two thousand men. All with different letters of the rainbow alphabet. The plot is dripping buckets full of humor, sexy man love, romance, a wedding, and a “Quik-Fix Hall”, only geniuses can design and make it sound like you are taking a trip to the mall. Antarctica turned out to be the best place on earth during the apocalypse. And, if you are gay and locked up with only men, well, then life at the bottom of the world, (PUN absolutely intended) inside a glass-domed city sounds like a dream vacation spot. Written with a multi-POV approach to the primary characters, their struggles, triumphs, and sexuality are only the tip of the iceberg, because a nuclear winter is coming...will Phoenix survive?This content was written with high knowledge of science and medical procedures and will be a treat to those who love correct medical jargon and lingo.WARNING: This book contains graphic male/male hardcore sex between consenting adults, all eighteen years of age or older. Chapter nineteen is explicitly bondage roleplay with dubious consent. Sensitive readers triggered by this kind of role-play language may skip this chapter. This book is not intended for people under eighteen years of age or for anyone offended by gay male sex.© January 2022 Stefan Pride and Kashel Char. All rights reservedSecond Edition",
  "genres": [
    "Science Fiction",
    "M M Romance",
    "Fantasy",
    "Post Apocalyptic",
    "Time Travel",
    "Gay",
    "Aliens"
  ],
  "author": "Stefan Pride",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/60022949-phoenix-code"
}