{
  "title": "A Heart of Bitter Poison",
  "description": "The second book in the dark, sexy, and wickedly funny bestselling Shadow Realm paranormal romance series for readers of Laura Thalassa, Sarah J Maas, Kerri Maniscalco, and Jennifer L Armentrout.An executioner and a bounty. A soldier and a weapon.The hunter and the prey that won’t go down. After centuries in hiding, the last of the original sirens took a chance on love.And it blew up in her face.Imprisoned by the Shadow Realm, Lu's days now pass in a haze of torture and tears. She's the most ancient vampire siren, the weapon they can't work out. Halfway to a hybrid of immortal creatures, she could be the key to their plans for war against the Realm of Light... if only they could figure out how to finish the transformation. After a daring escape, Lu finds herself on the run with an unlikely set of allies. Their enemies have a head start in the race to find the oldest vampires, and Lu will stop at nothing to keep them safe from a fate worse than death. If they can't find them in time, it will end in the war of the ultimate superpowers. But every move she makes, Ashen is there. The demon that she trusted. The executioner she loved. The Reaper that poisoned her heart with his betrayal. And as secrets of the Shadow Realm and her own history start to collide, Lu begins to question everything she knows... including the motives of the enigmatic demon she can't seem to escape.She's promised herself she'll never go back. She's determined not to fall in love.If only she knew whom to trust...Praise for A Shadow In The Reaping (Book 1 of the Shadow Realm series): \"This book had me hooked from the first paragraph. If you are looking for a fresh voice in the world of paranormal romance, pick up this one! Brynne Weaver's humor, imagination, and glittering prose will captivate you, and Ashen and Lu will keep you coming back for more.\"  ~Stephanie Fournet, bestselling contemporary romance author of Dream House, Leave A Mark, and Someone Like Me~~ This is a DARK ROMANCE intended for an 18+ audience. Contains mature themes, including violence, trauma, torture, pregnancy loss/infertility, references to suicidal ideation, explicit language, sexual content (consensual but includes S&M, blood, knife play, violence) ~~",
  "genres": [
    "Fantasy",
    "Romance",
    "Dark Romance",
    "Paranormal",
    "Fantasy Romance",
    "Romantasy",
    "Vampires"
  ],
  "author": "Brynne Weaver",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/60031035-a-heart-of-bitter-poison"
}