{
  "title": "Martinis at Midnight",
  "description": "Other worlds exist and they’re just as messed up as ours.So that’s alright, then.Time’s moved on since the afterlife was opened and Vlad isn’t well. For a moment, he finds himself at the mercy of his depression and the terrible darkness in his veins, howling his sorrow at the stars. That is, until a dangerous encounter with creatures from another world alters his perspective and sets him on course for a new and chaotic adventure, changing him in ways not thought possible. But the old orders are not forgotten – the dead do not take kindly to vampires transforming.Yet even through torment and devilish voices in his head, Vlad finds time for the Supernatural Support Group. Their emotional souls and everyday issues are as important as ever as curses are revealed, blood is finally identified, and the mysteries of the castle are driven deeper into anarchy.The sequel to the celebrated, epic dark fantasy is here, and delighting in all its madness. From terrible magics to memories worth dying for, from astonishing new powers to campfires and ghost stories, from secret vampire societies to fun with defibrillators, Martinis at Midnight is not just an evening cocktail: It’s the full event.All it takes is the emerald fire.The Supernatural Support Group series shows what happens when an ancient vampire suffering with depression opens a mental health meeting on Monday nights for the undead, to discuss their issues and treat them exactly as they want to be treated: like people. This epic, wildly strange, deeply affecting, and hugely surprising series will subvert and shake up everything you think you know of vampires and beyond, questioning humanity, psychology, meta-physics, para-physiology, bio-enchantments, magic, and the sheer destructive and healing power of conversation.You've never read a series like this.",
  "genres": [],
  "author": "C.M.     Allen",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/60033569-martinis-at-midnight"
}