{
  "title": "Shanghai Baby",
  "description": "The gap that divides those of us born in the 1970s and the older generation has never been so wide.Dark and edgy, deliciously naughty, an intoxicating cocktail of sex and the search for love, Shanghai Baby has already risen to cult status in mainland China. The risque contents of the breakthrough novel by hip new author Wei Hui have so alarmed Beijing authorities that thousands of copies have been confiscated and burned. As explicit as Henry Miller's Tropic of Cancer, as shocking as Trainspotting, this story of a beautiful writer and her erotically charged affairs jumps, howls, and hits the ground running as it depicts the new generation rising in the East.Set in the centuries-old port city of Shanghai, the novel follows the days, and nights, of the irrepressibly carnal Coco, who waits tables in a café when she meets her first lover, a sensitive Chinese artist. Defying her parents, Coco moves in with her boyfriend and enters a frenzied, orgasmic world of drugs and hedonism. But, helpless to stop her gentle lover's descent into addiction, Coco becomes attracted to a boisterous Westerner, a rich German businessman with a penchant for S/M and seduction. Now, with an entourage of friends ranging from a streetwise madame to a rebellious filmmaker, Coco's forays into in the territory of love and lust cross the borders between two cultures -- awakening her guilt and fears of discovery, yet stimulating her emerging sexual self. Searing a blistering image into the reader's imagination, Shanghai Baby provides an alternative travelogue into the back streets of a city and the hard-core escapades of today's liberated youth. Wei Hui's provocative portrayal of men, women, and cultural transition is an astonishing and brave exposure of the unacknowledged new China, breaking through official rhetoric to show the inroads of the West and a people determined to burst free.",
  "genres": [
    "China",
    "Fiction",
    "Romance",
    "Asia",
    "Chinese Literature",
    "Contemporary",
    "Asian Literature"
  ],
  "author": "Wei Hui",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/600526.Shanghai_Baby"
}