{
  "title": "A Taste of Poison: A Snow White Retelling",
  "description": "A Snow White Retelling\nA runaway princess wanted for murder.A deadly huntsman who’s after her heart…Half-fae Astrid Snow is used to being disliked. With magic that makes her mirror back one’s worst qualities, she has more enemies than friends. And when she’s accused of poisoning her father, her stepmother—the formidable Spring Queen—becomes her greatest enemy yet. Forced into hiding, she finds solace at the Seven Sins Hotel. It provides the perfect subterfuge she needs. For who could ever find an outlaw in a hotel famed for sin?Bear shifter Torben Davenport lost everything to the gambling halls. To pay off his debts, he serves the fae royals as their personal Huntsman, locating hard-to-find fugitives with his scent-based magic. When the Spring Queen offers him a bargain that will erase his debts for good, he’s willing to do what it takes—even if it means finding the queen’s runaway stepdaughter and cutting out her heart.Astrid won’t go down without a fight, even if her assailant is a strikingly handsome Huntsman. If she can evade the bear-shifter’s claws, maybe she can make him an ally. It’s easier said than done, especially after she accidentally gets herself handcuffed to her infuriating captor.Can Astrid cut through Torben’s icy demeanor and convince him to help her find the real killer? Or will she lose her heart in more ways than one?ACOTAR meets Kingdom of the Wicked in this standalone fairytale retelling of Snow White. If you like brooding heroes, just one bed, and grumpy sunshine romances, then you’ll love this swoon-worthy story in the Entangled with Fae series.*NOTE this book is upper YA/NA featuring mature situations, moderate violence and gore, substance abuse, and some adult language. The romance is slow burn but leads to moderate steam.\nA Taste of Poison\n is a complete stand-alone novel set in the same world as The Fair Isle Trilogy. Journey back to Faerwyvae or begin your adventure for the first time with this enchanting tale. Each book in the \nEntangled with Fae\n series can be read on its own and in any order. Happily ever after guaranteed!",
  "genres": [
    "Fantasy",
    "Romance",
    "Retellings",
    "Fae",
    "Romantasy",
    "Fantasy Romance",
    "Enemies To Lovers"
  ],
  "author": "Tessonja Odette",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/60051592-a-taste-of-poison"
}