{
  "title": "Lords of the Deccan : Southern India from the Chalukyas to the Cholas",
  "description": "The history of the vast Indian subcontinent is usually told as a series of ephemeral moments when a large part of modern-day India was ruled by a single sovereign. There is an obsession with foreign invasions and the polities of the Gangetic plains, while the histories of the rest of the subcontinent have been reduced to little more than dry footnotes. Now, in this brilliant and critically acclaimed debut book, Anirudh Kanisetti shines a light into the darkness, bringing alive for the lay-reader the early medieval Deccan, from the sixth century CE to the twelfth century CE, in all its splendour and riotous glory.Kanisetti takes us back in time to witness the birth of the Chalukyas, a dynasty that shaped southern India for centuries. Beginning at a time when Hinduism was still establishing itself through the Deccan, when the landscape was bereft of temples, he explores the extraordinary transformation of the peninsula over half a millennium. In vivid and colourful detail, Kanisetti describes how the mighty empires of medieval India were made: how temple-building and language manipulation were used as political tools; how royals involved themselves in religious struggles between Jains and Buddhists, Shaivas and Vaishnavas; and how awe-inspiring rituals were used to elevate kings over their rivals and subjects. In doing so, he transforms medieval Indian royals, merchants and commoners from obscure figures to complex, vibrant people. Kanisetti takes us into the minds of powerful rulers of the Chalukya, Pallava, Rashtrakuta and Chola dynasties, and animates them and their world with humanity and depth.It is a world of bloody elephant warfare and brutal military stratagems; of alliances and betrayals; where a broken king commits ritual suicide, and a shrewd hunchbacked prince founds his own kingdom under his powerful brother’s nose. This is a world where a king writes a bawdy play that is a parable for religious contestation; where the might of India’s rulers and the wealth of its cities were talked of from Arabia to Southeast Asia; and where south Indian kingdoms serially invaded and defeated those of the north. This painstakingly researched forgotten history of India will keep you riveted and enthralled. You will never see the history of the subcontinent the same way again.",
  "genres": [
    "History",
    "Nonfiction",
    "India",
    "Indian Literature",
    "World History"
  ],
  "author": "Anirudh Kanisetti",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/60051983-lords-of-the-deccan"
}