{
  "title": "The Motion of the Ocean: 1 Small Boat, 2 Average Lovers, and a Woman's Search for the Meaning of Wife",
  "description": "The humorous true story of a woman who abandons her tidy life to honeymoon across the Pacific on a leaky, old boat—only to find that sailing 17,000 miles is easier than keeping her relationship off the rocks.“Somewhere fifty miles off the coast of Oregon I realize the skipper of this very small ship is an asshole. He also happens to be my husband.”While most thirty-somethings are climbing the corporate ladder or popping out babies, Janna Cawrse and her boyfriend Graeme take a different tack: they quit their jobs, tie the knot, and embark on a most unusual honeymoon cruise—813 days across the Pacific Ocean on a beat-up old sailboat. Their goal? Relaxation and relationship therapy. But the passage from First Date to First Mate is anything but smooth sailing. From the craggy Pacific Northwest coast to the tropical isles of Polynesia to the bustling ports of Asia, Janna and Graeme must share everything: rations of Top Ramen, sailboat sewage duty, a boat the size of a bedroom, and every minute of every day. They realize: If their marriage can survive this, it can survive anything! Like all great love stories, Janna and Graeme encounter storms and disasters along the way—and plenty of reasons for make-up sex. And they discover intimate secrets about each other, difficult truths about love, and skills they’ll need to keep their boat—and their relationship—afloat.Written in the style of popular travelogues by J. Maarten Troost (The Sex Lives of Cannibals) and Elizabeth Gilbert (Eat, Pray, Love), Janna Cawrse Esarey gives readers a satisfying mix of soul-searching and romantic comedy while she seeks to answer this crucial question: When the waters get rough, will she—a novice sailor and spouse—abandon ship? Or will she learn to navigate the world—and the one relationship that will teach her about sex, love, and the meaning of “wife”?",
  "genres": [
    "Travel",
    "Memoir",
    "Nonfiction",
    "Book Club",
    "Marriage",
    "Travelogue"
  ],
  "author": "Janna Cawrse Esarey",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/6005167-the-motion-of-the-ocean"
}