{
  "title": "A Sword from Red Ice",
  "description": "J.V. Jones made her impressive fantasy debut with the Book of Words trilogy (“Wonderful… J.V. Jones is a striking writer.”—Robert Jordan). A Sword from Red Ice is the latest in the Sword of Shadows, a uniquely powerful epic fantasy series of enormous scope, peopled by fascinating, compelling characters whom readers will take to their hearts.This sharply observed saga makes utterly real the hope and heartbreak of a cold, splintered world on the brink of a terrible war. A thousand years earlier, the Unmade, souls of the dead, shook the land and decimated the Sull, a legendary ancient people. The Blindwall, breached by power unleashed by enigmatic, powerful young Ash March, no longer will hold back the Unmade from the land of the living, so the Sull are readying for a war that must inevitably come.Across the land, clans oblivious to the threat vie for dominance. Dangerous, arrogant clan chiefs urge their followers to frenzied battles, killing one another and plotting against rivals. And a darker threat comes from Spire Vanis, a city with a black heart of evil, whose rulers have long sought to control the outlying clanholds, and whose new protector, Marafice Eye, is bent on conquest.As Ash trains to become the great mystic warrior predicted by the Sull, Raif Sevrance, who loves her and has been exiled from his clan, seeks to discover where he belongs. The Rift, a deep crevice in the barren land of the Want, draws him. And that puts him in grave danger, for the Rift is said also to be a crack between the world of the living and that of the Unmade.Raif, Ash, and those whose fates are tied to them must follow their own paths with courage and faith in themselves and their goals, lest all be lost when the war with the Endlords is come.",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "High Fantasy",
    "Fiction",
    "Dark Fantasy",
    "Science Fiction Fantasy",
    "Epic"
  ],
  "author": "J.V. Jones",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/6004973-a-sword-from-red-ice"
}