{
  "title": "Cross My Heart",
  "description": "There are some cases you never forget.Former FBI agent Elijah Cross tried to put the past behind him. For years, he spent his days and his nights tracking some of the most brutal killers in the US. Now? He protects the rich and famous while working at Wilde. Less danger, more glamour…and a whole lot more cash. His latest gig has taken him to the sandy beaches of Florida’s Gulf Coast, and it’s on one of those gorgeous beaches where he comes face to face with the woman who haunts his dreams.There are some people you can’t leave behind.She was the last victim he saved at the Bureau. Penelope Kostas. The woman who survived a nightmare. He’d carried her out of hell in his arms, and Elijah had sworn to always protect her. But that promise had been given before his job at the Bureau had imploded. Before he’d broken every rule that mattered…for her. Only to have Penelope run from him.There are some promises you must keep.The serial killer who targeted Penelope was never apprehended, and Penelope fears that he could be hunting her once more. But this time, she will not be his victim. She wants Elijah to help her hunt him. To help her stop the killer before he can strike again. And she will pay any price for Elijah’s help. He’s the only man she trusts…and, once upon a time, Elijah had offered to do anything for her…even kill to keep her safe.There are some desires that can’t be controlled.Elijah still wants her just as badly. Penelope still needs him just as much. Lust, obsession—they always twisted together for them, and the longer that they are together, the more that dark and consuming need just grows and grows. Elijah will do whatever it takes to protect Penelope. She’s not the same woman he knew before. Not lost, not afraid. She’s determined to fight, and he will be at her side every step of the way. The killer won’t escape again. And Elijah will not lose the woman who owns his heart.Author’s Note: Once upon a time, Elijah saved Penelope, and, though she didn’t realize it, she saved him, too. She stopped him from giving into the darkness that wanted to consume him, and now, he is ready for his second chance with her. Danger, desire—sure, they’re part of the deal, but Elijah can handle any threat that comes their way. He will handle the threats because there is no way that he will ever lose Penelope again. Prepare for action, twists, and a love that will not be denied. Things are going to be Wilde, and that is just Elijah’s style…",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Suspense",
    "Contemporary Romance",
    "Second Chance",
    "Thriller"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/60064015-cross-my-heart"
}