{
  "title": "Clown horror 150",
  "description": "In a parallel universe the Government of the Racist (G. O. P.) Party wins the 2016 Presidential Election by forming the Fascist Coalition with other right-wing parties. President Führer Devil-Eggs fulfils his promise to the United States of America once elected as his “Made America 4 the Fascist Again,” arrives. President Führer Devil-Eggs thanks President Vladimir Putin for his help in winning the election by forming the Best Friends Forever Alliance. Officially known as the Molotov-Ribbentrop Pact sequel this new alliance will fight the North Atlantic Treaty Organization (N. A. T. O.) and its newest member China. Alternative facts are now scientific proofs by executive orders. Social Security pensions and Medicare health benefits for senior citizens disappear after an executive order arrives which eliminates the taxes that are collected to fund these programs. The A. C. A. (Affordable Care Act) or Obamacare is eliminated while President Führer Devil-Eggs replaces it with Devilcare Death Panels & Camps. The Devilcare Death Panels & Camps feature free healthcare, free death panels where accountants ration off healthcare to save money, and free concentration camps that use government mandated flu vaccines to eliminate citizens, political enemies, and criminals in the country.A cast of characters must now deal with their new reality. Irene has always been the supporting character in the school play and she wants to be the star for once. Osvaldo is trying to fool the government to make money for his retirement. Shmuel is a government worker who is trying to serve his country and fulfil the mission of his department. Anthony knows everything even if his family think that he is just going crazy. Riya is stuck in a dead-end job and finds an opportunity to escape her boring life. Courtney welcomes the challenge of a new job opportunity in the Devilcare Death Panels & Camps. Aryanna knows that she must lead the fight against the fascist in her city. Jurnee is a pastor in the End Racism Church who leads her flock in the fight against evil. Naya is a French spy trying to pass information to her country before they catch her.(Word Count 59,116)",
  "genres": [],
  "author": "I.D. Oro",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/60062866-clown-horror-150"
}