{
  "title": "Pleyn Delit: Medieval Cookery for Modern Cooks",
  "description": "This is a completely revised edition of the classic cookbook that makes genuine medieval meals available to modern cooks. Using the best recipes from the first edition as a base, Constance Hieatt and Brenda Hosington have added many new recipes from more countries to add depth and flavour to our understanding of medieval cookery. All recipes have been carefully adapted for use in modern kitchens, thoroughly tested, and represent a wide range of foods, from appetizers and soups, to desserts and spice wine. They come largely from English and French manuscripts, but some recipes are from sources in Arabia, Catalonia and Italy. The recipes will appeal to cordon-bleus and less experienced cooks, and feature dishes for both bold and timourous palates. The approach to cooking is entirely practical. The emphasis of the book is on making medieval cookery accessible by enabling today's cooks to produce authentic medieval dishes with as much fidelity as possible. All the ingredients are readily available; where some might prove difficult to find, suitable substitutes are suggested. While modern ingredients which did not exist in the Middle Ages have been excluded (corn starch, for example), modern time and energy saving appliances have not. Authenticity of composition, taste, and appearance are the book's main concern. Unlike any other published book of medieval recipes, Pleyn Delit is based on manuscript readings verified by the authors. When this was not possible, as in the case of the Arabic recipes, the best available scholarly editions were used. The introduction provides a clear explanation of the medieval menu and related matters to bring the latest medieval scholarship to the kitchen of any home. Pleyn Delit is a recipe book dedicated to pure delight - a delight in cooking and good food.",
  "genres": [
    "Cookbooks",
    "History",
    "Food",
    "Cooking",
    "Medieval",
    "Nonfiction",
    "Food and Drink"
  ],
  "author": "Sharon Butler",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/600636.Pleyn_Delit"
}