{
  "title": "The Forerunner, Books 1-2-3",
  "description": "THREE NOVELS IN ONE! Like history and legends? Enjoy the gritty realism of Viking Age dramas or multi-character epic fantasy? Norse legends and lore, unforgettable characters and authentic history combine in an exciting series!Thorfinn and the Witch’s Curse: WINNER of the 2020 Wishing Shelf Book and Readers’ Favorites 2021 Fantasy Awards! When a witch’s curse comes alive, a mishap turns young Finn into a vardoger, haunted by his own forerunner ghost. Suddenly thrust into a new realm beyond Midgard, Finn struggles to be a boy by day and a ghost at night. His own clan fears him, he overhears murder plots, he learns the truth of giants and the hidden folk, and the witch still hunts revenge… Will Finn find the courage to defeat his enemies and save his uncle?The Vardoger Boy: Danish forces assemble for war on Wessex and the loyal Agneson Clan heeds the call to join the Great Viking Horde, but while honorable men gather in the midlands, a blood feud draws mercenaries to their undefended homestead for murderous revenge. Sailing his Viking crew to fulfill an oath, Karl harbors suspicions over strange occurrences that bedevil his nephew Thorfinn, while far to the north their sworn enemy werebear and his dark elf master strike back. And young forerunner Thorfinn learns the Nine Realms are full of surprising hidden folk, but to earn his place aboard the Viking’s ship he must accept a mast troll’s quest….On Viking Seas: With the fall of the Danish army at the battle of Ethandun, historical events scatter the Agneson family—Cub is enslaved in the Devonshire tin mines while Sorven stalks retribution in Jorvik; Kara is unwillingly propelled toward a convenient Saxon marriage while Karl and his crew are castaway on a mythic floating island. Separated and marooned, each is forced to tackle their challenges alone while the forerunner Thorfinn faces supernatural revenge, a battle to lift a Jarl’s curse and the release of his Jotunhiem wyrm in Midgard!Based on actual historical events and authentic legends, this epic fantasy follows the paths of the sons and daughters of Agne, Son of Ironfist in the Viking Era circa the year 880. Don’t miss this award-winning grand panoramic tale of over 300,000 words, 3 maps and ancestral lineage trees, with character glossaries and notes on key norse legends.",
  "genres": [],
  "author": "Jay Veloso Batista",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/60062870-the-forerunner-books-1-2-3"
}