{
  "title": "The Confidence Men: How Two Prisoners of War Engineered the Most Remarkable Escape in History",
  "description": "The astonishing true story of two World War I prisoners who joined together to pull off one of the most ingenious escapes of all time.Imprisoned in a remote Turkish prison camp during World War I, having survived a two-month forced march and a terrifying shootout in the desert, two British officers, Harry Jones and Cedric Hill, join forces to bamboozle their iron-fisted captors. To stave off despair and boredom, Jones takes a handmade Ouija board and fakes elaborate séances for his fellow prisoners. Word gets around camp, and one day, a Turkish officer approaches Jones with a query: Could Jones contact the spirit world to find a vast treasure rumored to be buried nearby? Jones, a trained lawyer, and Hill, a brilliant magician, use the Ouija board--and their keen understanding of the psychology of deception--to build a trap for the Turkish officers that will ultimately lead them to freedom.The Confidence Men is the story of the only known con game played for a good cause--and of a profound but unlikely friendship. Had it not been for \"the Great War,\" Jones, the Oxford-educated son of a British lord, and Hill, a mechanic from an Australian sheep farm, would never have met. But in pain, loneliness, hunger, and isolation, they formed a powerful emotional and intellectual alliance that saved both of their lives.Margalit Fox brings her \"nose for interesting facts, the ability to construct a taut narrative arc, and a Dickens-level gift for concisely conveying personality\" (Kathryn Schulz, New York) to this gripping tale of psychological strategy that is rife with cunning, danger, and moments of high farce that rival anything in Catch-22.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "World War I",
    "Audiobook",
    "Historical",
    "Military Fiction"
  ],
  "author": "Margalit Fox",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/60072358-the-confidence-men"
}