{
  "title": "Feed Me!: Writers Dish About Food, Eating, Weight, and Body Image",
  "description": "In our appearance-obsessed society, eating is about much more than hunger and sustenance. Food inspires pleasure and anxiety, shame and obsession. We are constantly judged on how we look, so we’ve come to judge ourselves (and others) on what and how we eat.Joyce Maynard writes about learning to make pie with her complex but adored mother. Caroline Leavitt’s chilling piece describes the overlap between power and eating. Ophira Edut explains how an outspoken “body outlaw” wound up on Jenny Craig. Diana Abu-Jaber writes about abandoning her Bedouin customs for America’s silverware and table manners–and missing the physical, hands-on connection with food.Exploring the bonds between appetite and remorse, hunger and longing, satisfaction and desire, this anthology is for every woman who’s ever felt guilty about eating dessert, or gushed over a friend’s weight loss, or wished she had a different body.Feed Me! features the following “He Called Me Fat; It Set Me Free” by Sari Botton“The Grief Diety” by Caroline Leavitt“With Hands” by Diana Abu-Jaber“Seconds” by Jenny Allen“My Worst Excess” by Amity Gaige“Sisi, You’re Getting Fat” by Courtney E. Martin“My Ten Plagues” by Harriet Brown“Top Model” by Magali Amadei“Reader, I Ate Him” by Brenda Copeland“The Twin Paradox” by Susan O’Doherty“Attack of the XL Girl” by Laurie Notaro“Sugar Plum Fairy” by Dana Kinstler“Sky Girl” by Ann Hood“Plus What?” by Lisa Romeo“Ess, Ess” by Rochelle Jewel Shapiro“In the House of Jean Nidetch” by Whitney Otto“You’re Not Fat” by Kate Harding“My Binge Year” by Jane E. Brody“Day One” by Wendy McClure“Quacks” by Kathi Kamen Goldmark“Battle of the Notes from a Decade of Body Activism” by Ophira Edut“Take this Cake and Shove it” by Joan Fischer“Pie” by Joyce Maynard",
  "genres": [
    "Nonfiction",
    "Essays",
    "Feminism",
    "Health",
    "Anthologies",
    "Food",
    "Short Stories"
  ],
  "author": "Harriet  Brown",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/6006098-feed-me"
}