{
  "title": "The Holiday Plan",
  "description": "\"...exactly the feel-good, cozy mental retreat I needed.\" --First for Women magazine\"I can’t begin to tell you how much I love this read!\" ⭐️⭐️⭐️⭐️⭐️ --KT Book ReviewsFrom one of the freshest voices in clean and wholesome romantic fiction, The Holiday Plan is the perfect escape for fans of Debbie Macomber, Annie Rains, and Debbie Mason.Native New Yorker Verona Scott is battling heartbreak, both personally and professionally. Coming off a disastrous split with her ex, she’s struggling for inspiration to write her next book.Hoping for a new start and to avoid the holiday completely, she’s planned a Valentine's a luxurious trip alone to the historic Courtington Castle hotel, tucked into a picturesque valley in the Adirondacks, near the adorably quaint town of Camelot Creek.But escaping the heart-shaped balloons and red roses isn’t as easy as she thought.This won’t be the restful retreat she’d imagined. Instead, she’s just walked into one of the biggest matchmaking events of the year. Not to mention, the incredibly attractive single dad and dating coach Troy Turner is heading the whole thing up, and he’s on a mission to include Verona in the festivities.Will Troy change Verona’s mind about the most romantic day of the year? Just when sparks begin to fly, an unexpected visitor checks into the castle, stirring up the past. No matter what, for Verona, Valentine’s Day is the day where everything changes.A heartwarming, sweet romance that will whisk you away to a magical winter wonderland, and have you reaching for the hot cocoa and box of chocolates long after the holidays. \nPraise for The Holiday Plan\n“This book is guaranteed to leave you with a warm, fuzzy feeling that will carry you well beyond the holiday and into the next one!” ⭐️⭐️⭐️⭐️⭐️ --USA Today Bestselling Author, Jenny Hale \"...sweet, cozy, and full of snowy moments and romantic tension.\" --Lu's Book Reviews\"An absolutely sparkling debut! Visually stunning writing, full of heart and hope. Emma Lynden is a wonderful new force in sweet romance. I can't wait to see what she writes next.\" --USA Today Bestselling Author Teri Wilson",
  "genres": [
    "Romance",
    "Christmas",
    "Contemporary",
    "Holiday",
    "Fiction",
    "Contemporary Romance",
    "Chick Lit"
  ],
  "author": "Emma Lynden",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/60066969-the-holiday-plan"
}