{
  "title": "I'll Be Watching You: Inside the Police, 1980-83",
  "description": "The insider: The Police on tour photographed by guitarist Andy Summers Just announced: The Police Reunion Tour starts in Summer 2007! In the early 1980s, The Police went on tour accompanied by a photographer who documented the band behind the scenes in a series of candid and striking black and white photos. This talented photographer also happened to be the band's guitarist, Andy Summers. Yes, it's true?the man responsible for the guitar lick from ?Every Breath You Take? was not only the backbone of one of the most popular bands of all time, he also possessed a visual gift for composition and mood that allowed him to capture the spirit of The Police better than anyone else could have. This book, somewhere between photojournalism and an illustrated diary, follows The Police around the globe between 1980 and 1983. From the American West to Australia to Japan, Summers recorded not only the band members rehearsing and partying?the proverbial sex, drugs, and rock and roll?he also photographed fans, landscapes, still lifes, and passersby in a reportage style reminiscent of Henri Cartier-Bresson and Robert Frank. Containing over 600 photos and filled with diary-style entries, I?ll Be Watching You is a sumptuous volume beating with musical energy, nostalgia, and atmospheric beauty. A must for photo buffs and Police fans alike. Collector's edition features: ? Limited to 1500 copies, each numbered and signed by the artist ? Packaged in a slipcase ? Contains over 600 photographs personally selected from the photographer's archive of over 25,000 negatives (1980-83) ? Most photos are previously unpublished, and many of them have never even been printed prior to this project Highlights include: ?Rehearsals and recording sessions with band-mates Sting and Stewart Copeland ? Exclusive back-stage and on-stage footage from concerts including Plaza de Toros (Barcelona, 1980), Budokan (Tokyo, 1981), Wembley Stadium (London, 1981), and Shea Stadium (New York, 1983) ? Inside the tour busses, limousines, helicopters, private planes, parties, and hotel rooms ? Behind the scenes on music video shoots, at press conferences, and in-store appearances ? Life on the road with other bands including The Go-Go?s, XTC, and The B-52's ? Rain-soaked train windows, trashed hotel rooms, island retreats, over-capacity stadiums, and thousands of screaming, singing, sobbing, fans Countries covered in the book: America, Argentina, Australia, Brazil, Canada, Chile, Denmark, Egypt, France, Germany, Greece, Japan, Mexico, Netherlands, New Zealand, Portugal, Spain, Sweden, United Kingdom The artist: While Andy Summers is best known as the guitarist of The Police (1977-86), he has since forged a successful and acclaimed solo career with contemporary instrumental music that, like his work with Sting and Stewart Copeland, draws on his love of jazz, world, classical music, and his fascination with creating sonic textures. His post-Police years have produced more than two dozen solo albums, soundtracks, and collaborations, plus hundreds of international concerts, and induction to both the Guitar Player Hall of Fame and the Rock and Roll Hall of Fame. Summers's parallel passion for photography has led him to document subjects ranging from rural communities throughout Southeast Asia to timeless noir-style street scenes in cities around the world. His photographs have been shown in galleries in New York, Los Angeles, Tokyo, Amsterdam, Paris and London, and his books include Throb (1983), the Ralph Gibson collaboration Light Strings: Impressions of the Guitar (2004), and the memoir One Train Later (2006).",
  "genres": [
    "Music",
    "Photography"
  ],
  "author": "Andy Summers",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/600710.I_ll_Be_Watching_You"
}