{
  "title": "A Haunted History of Invisible Women: True Stories of America's Ghosts",
  "description": "From the notorious Lizzie Borden to the innumerable, haunted rooms of Sarah Winchester's mysterious mansion this offbeat, insightful, first-ever book of its kind explores the history behind America's female ghosts, the stereotypes, myths, and paranormal tales that swirl around them, what their stories reveal about us--and why they haunt us...\nSorrowful widows, vengeful jezebels, innocent maidens, wronged lovers, former slaves, even the occasional axe-murderess--America's female ghosts differ widely in background, class, and circumstance. Yet one thing unites them: their ability to instill fascination and fear, long after their deaths. Here are the full stories behind some of the best-known among them, as well as the lesser-known--though no less powerful.Tales whispered in darkness often divulge more about the teller than the subject. America's most famous female ghosts, like New Orleans voodoo priestess Marie Laveau, and Bridget Bishop, the first person executed during the Salem witchcraft trials, mirror each era's fears and prejudices. Yet through urban legends and campfire stories, even ghosts like the nameless hard-working women lost in the infamous Triangle Shirtwaist Factory fire --achieve a measure of power and agency in death, in ways unavailable to them as living women.Riveting for skeptics and believers alike, with humor, curiosity, and expertise, A Haunted History of Invisible Women offers a unique lens on the significant role these ghostly legends play both within the spook-seeking corners of our minds and in the consciousness of a nation.Foreword by Bram Stoker Award-winning author Linda D. Addison",
  "genres": [
    "Nonfiction",
    "History",
    "Paranormal",
    "Feminism",
    "Ghosts",
    "Horror",
    "Audiobook"
  ],
  "author": "Leanna Renee Hieber",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/60098288-a-haunted-history-of-invisible-women"
}