{
  "title": "Arribada",
  "description": "WINNER OF THE INTERNATIONAL LATINO BOOK AWARD AND THE EDMUND WHITE LGBT BOOK AWARDFinalist, Louise Meriwether First Book PrizeMariana Sánchez Celis has traveled the world as a pianist trained at the Juilliard School of Music. But when her mother has a stroke and her beloved uncle suddenly disappears, Mariana must put her life on hold to return to her home in Ayotlan, Mexico.She soon discovers her town is no longer the place she remembers. Ayotlan's beaches, sea turtle colonies, and historic center are decimated under decades of neglect and abuse. What part did her late father have in this? And could it be related to her uncle's disappearance?When Fernanda Lucero, a member of the indigenous Concáac people, convinces Mariana to join her sea turtle and architectural conservation projects, the deepening love between Mariana and Fernanda threatens to put them both further in harm's way. This, together with the web of secrets Mariana unravels, stands to radically transform her and her family's fate.Arribada is the story of a well-to-do woman pushed to confront her role in environmental and social injustice. It is the saga of a family faced with the realization that their comfortable position rests, beyond a strong work ethic, on crimes against what they hold dearest: the natural world, their town, and their loved ones.\"Themes of environmental justice, queer love, and Indigenous rights intersect in González's mystery. Mariana and Luisa Sánchez Celis, grew up in a household with a mother disabled by a stroke, their uncle Alonso, and caretaker Amalia. The novel, set in 1990 and 1991, filters the events of the story through the colorism, racism, and patriarchy of their society as 22-year-old Mariana falls in love with Fernanda, an Indigenous Seri woman who's passionate about protecting the turtles of the Sinaloa coast from extinction. After leaving Mexico to attend Juilliard, Mariana returns to find that Alonso has gone missing, and anti-poaching laws are harming local fisherman while industrial development hurts the wildlife and beaches. She, Luisa, Fernanda, and othersstart a business to preserve the livelihoods of locals while speaking up against powerful family friends. As the mystery of Alonso's disappearance is resolved, a truth about Mariana is revealed. The second part of the novel focuses on Clavel Celis Coulson, Luisa and Mariana's mother, as a high-society 16-year-old forced to marry a man twice her age; Amalia's dark past also comes to light. The final part ties up a mystery while exploring themes of family conflict and queer relationships. González's characters feel simultaneously archetypal and individual. On one level, they represent changing attitudes of various segments of Mexican society from the 1970s to the 2000s—enthusiastic, money-hungry land developers; an Indigenous conservationist; and an uncomfortable elite clinging to traditionalism. Yet the first-person perspectives of Mariana and Clavel showcase the specific desires, hopes, and dreams of each person as they try to find their place in a complex and dynamic social setting. González shines at exploring the effects of racist discrimination against Indigenous Mexicans without ever reducing characters to mere pawns. Her prose style is simple yet poignant and emotive, particularly when describing human desire and natural beauty: \"Nothing relaxed me more than Bach combined with the aromas of the ocean and the sight of beauty. If only music could bend life to its rules.\" González's closing notes provide the story's critical real-world origins.A suspenseful but tender tale that exemplifies the power of intersectionality\"-- Starred Kirkus Review\"Arribada is romantic, poetic, elegiac, and fascinating. Gonzalez has created a whole world of love and mystery. Word to word, event to event, this novel is beautiful. It begs to be savored.\"--SANDRA SCOFIELD, author of Swim: Stories of the Sixties, and The Last Draft.\"Arribada is a novel about how even the most painful truths can bring power and freedom.\"--EILEEN GONZALEZ, Foreword ReviewsIn Arribada \"North Americans who travel to Mexico to enjoy its beaches and nightlife may be unaware of the destructive histories and effects of the resorts they enjoy. This novel will open their eyes.\" --AMY HOFFMAN, author of The Off Season\" and Lies About My Family",
  "genres": [
    "Fiction"
  ],
  "author": "Estela González",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/60098217-arribada"
}