{
  "title": "The Taking of Jemima Boone: Colonial Settlers, Tribal Nations, and the Kidnap That Shaped America",
  "description": "\"A rousing tale of frontier daring and ingenuity, better than legend on every front.\" -- Pulitzer Prize-winning author Stacy SchiffA Goodreads Most Anticipated Book In his first work of narrative nonfiction, Matthew Pearl, bestselling author of acclaimed novel The Dante Club,  explores the little-known true story of the kidnapping of legendary pioneer Daniel Boone's daughter and the dramatic aftermath that rippled across the nation. On a quiet midsummer day in 1776, weeks after the signing of the Declaration of Independence, thirteen-year-old Jemima Boone and her friends Betsy and Fanny Callaway disappear near the Kentucky settlement of Boonesboro, the echoes of their faraway screams lingering on the air.A Cherokee-Shawnee raiding party has taken the girls as the latest salvo in the blood feud between American Indians and the colonial settlers who have decimated native lands and resources. Hanging Maw, the raiders' leader, recognizes one of the captives as Jemima Boone, daughter of Kentucky's most influential pioneers, and realizes she could be a valuable pawn in the battle to drive the colonists out of the contested Kentucky territory for good.With Daniel Boone and his posse in pursuit, Hanging Maw devises a plan that could ultimately bring greater peace both to the tribes and the colonists. But after the girls find clever ways to create a trail of clues, the raiding party is ambushed by Boone and the rescuers in a battle with reverberations that nobody could predict. As Matthew Pearl reveals, the exciting story of Jemima Boone's kidnapping vividly illuminates the early days of America's westward expansion, and the violent and tragic clashes across cultural lines that ensue.In this enthralling narrative in the tradition of Candice Millard and David Grann, Matthew Pearl unearths a forgotten and dramatic series of events from early in the Revolutionary War that opens a window into America's transition from colony to nation, with the heavy moral costs incurred amid shocking new alliances and betrayals.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "True Crime",
    "Biography",
    "Historical",
    "Audiobook"
  ],
  "author": "Matthew Pearl",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/60091354-the-taking-of-jemima-boone"
}