{
  "title": "Hortus Curious: Discover the World's Most Weird and Wonderful Plants and Fungi",
  "description": "Celebrate the weird, wacky, and wonderful world of plants with a book that revels in the diversity of the botanical world.Plants are truly awe-inspiring. They can be vast, minute, smelly, or spectacularly ugly. Some plants live on their own, or by growing off others; some live by air and water; others are carnivorous, eating the creatures around them; some plants look remarkably like animals; while others have unusual symbolism; and some have special cultural significance. This book explores them all, bringing together the most peculiar and most fascinating plants on the planet - celebrating them in all their diverse splendor.Split into five chapters, covering everything from poisonous plants to painkilling ones, Michael Perry explains exactly what makes each plant special. With exquisitely detailed illustrations of all the different species, this is an informative, humorous, and beautiful gift for all those who love plants - whether they want to grow them or not. Hortus Curious delivers a different way to view the plant world and enjoy it for its bonkers and bizarre.The book is split into five chapters, covering: - Plants Behaving Badly - the criminal world of plants such as poisonous plants, insect catching\n\n plants, and plants that do risky thing- Mistaken Identity - plants that look like other things, e.g. flowers that look like monkeys, bees, or even dead man's fingers- Greater Good - did you know that aspirin comes from a plant? This chapter explores the plants that make up our everyday products- Superheroes - find out about the plants that can disguise themselves, changing color, shape or even moving themselves- X-rated Plants - a selection of the rudest plants out there!A humorous and quirky gift book for people interested in plants and gardening, Hortus Curious is sure to delight.",
  "genres": [
    "Nonfiction",
    "Science",
    "Plants",
    "Gardening",
    "Nature"
  ],
  "author": "Michael Perry",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/60097864-hortus-curious"
}