{
  "title": "Nights of Plague",
  "description": "From the the winner of the Nobel Prize in Literature: Part detective story, part historical epic--a bold and brilliant novel that imagines a plague ravaging a fictional island in the Ottoman Empire.It is April 1900, in the Levant, on the imaginary island of Mingheria--the twenty-ninth state of the Ottoman Empire--located in the eastern Mediterranean between Crete and Cyprus. Half the population is Muslim, the other half are Orthodox Greeks, and tension is high between the two. When a plague arrives--brought either by Muslim pilgrims returning from the Mecca or by merchant vessels coming from Alexandria--the island revolts.To stop the epidemic, the Ottoman sultan Abdul Hamid II sends his most accomplished quarantine expert to the island--an Orthodox Christian. Some of the Muslims, including followers of a popular religious sect and its leader Sheikh Hamdullah, refuse to take precautions or respect the quarantine. And then a murder occurs.As the plague continues its rapid spread, the Sultan sends a second doctor to the island, this time a Muslim, and strict quarantine measures are declared. But the incompetence of the island's governor and local administration and the people's refusal to respect the bans doom the quarantine to failure, and the death count continues to rise. Faced with the danger that the plague might spread to the West and to Istanbul, the Sultan bows to international pressure and allows foreign and Ottoman warships to blockade the island. Now the people of Mingheria are on their own, and they must find a way to defeat the plague themselves.Steeped in history and rife with suspense, Nights of Plague is an epic story set more than one hundred years ago, with themes that feel remarkably contemporary.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Turkish",
    "Turkish Literature",
    "Historical",
    "Mystery",
    "Literature"
  ],
  "author": "Orhan Pamuk",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/60097027-nights-of-plague"
}