{
  "title": "Coen",
  "description": "Coen Highsmith was a league star, but he lost more than his team the day the Pittsburgh Titans’ plane crashed. Can he be saved from his downward spiral of guilt and regret to become the man he once was?I had it all—a successful hockey career, the respect and adoration of the fans, a rotation of beautiful women warming my bed, and a feeling of self-worth and contentment with the direction of my life. But that all changed the day the team plane went down, taking my only chance of redemption with it. Now I’m left with the daily reminder of all my failures and my inability to correct them. My new teammates are tired of my attitude and following my suspension, I hole up in a mountain cabin to get away from all of it. The isolation is exactly what I need to get out of my own head, and I’m beginning to think I could be content in this quiet forever.Tillie Marshall isn’t the type of woman who would usually catch my attention, yet she manages to do so for all the wrong reasons. I’m here for the peace and seclusion but the quirky artist is hell-bent on destroying that by cutting down the trees that separate our properties so she can open a pottery studio. If it’s a fight she wants, it’s a fight she’ll get. I have the money and the time and no issues bringing her down through the court system. While I see flashes of steely determination within her, I’ve found that being a jerk comes naturally these days and she won’t be hard to intimidate. Unfortunately, that gorgeous and somewhat odd neighbor who has been causing me grief is creating another type of feeling within me. And once that spark is lit, Tillie displays a faith in me that for the first time since the crash I desperately want to believe. Now it’s time for me to step up and become the man—no, a better man than I once was.",
  "genres": [
    "Romance",
    "Sports",
    "Sports Romance",
    "Enemies To Lovers",
    "Hockey",
    "Contemporary Romance",
    "Audiobook"
  ],
  "author": "Sawyer Bennett",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/60104725-coen"
}