{
  "title": "Mad Man",
  "description": "Avi Mulvaney is many things. Son. Twin. Owner of the fashion label, Gemini. Murderous psychopath. Together, he and his brother, Asa, make one brutally efficient monster, ridding the world of predators who victimize the innocent. History proves Avi and Asa don’t do well apart, but their father has decided to test that theory.Felix Navarro knows exactly who he is. Baby brother. Fashionista. Vigilante. While he’s not happy that his big brother married a Mulvaney, the union has its perks. Like a paid internship with Gemini. But all good things come with a cost and, for Felix, that’s enduring Avi Mulvaney each day, which inevitably leads to thinking about him every night.Felix doesn’t like Avi. He’s cocky, condescending, overbearing, and inappropriate. He’s also sexy, brilliant, and twice as lethal as Felix. Still, Felix loathes him. Even if he keeps letting him kiss him. And touch him. Even if he slipped just once. It was still hate sex, and it would never happen again. Ever.Except, Avi’s being sent to help take down a dangerous crime ring and he’s ordered Felix to come along. Felix has vowed to stay strong. To remember he hates Avi. But they’re trapped together and there’s only one bed, and it’s so hard to hate Avi in the dark when he’s whispering how Felix belongs to him. Felix belongs to no man, but Avi is determined. He has one week to prove to Felix that he’s the exception to his rule. After all, who says no to a Mulvaney?Mad Man is a scorchingly hot, intense, enemies to lovers, psychopath romance with an HEA and no cliffhangers. It features a dirty talking, brutally vicious killer and a sharp tongued murderous fashionista who are both too stubborn for their own good. As always, there’s gratuitous violence, very dark humor, enough blood to film the final scene in the movie Carrie, and enough heat to melt your panties. This is book 5 in the Necessary Evils series. Each book follows a different couple.TAGS: psychopath, enemies-to-loves, dark humor, much violence, jealousy, bad boys doing bad things, long distance snark, only one bed, hate sex, more hate sex, hate sex that becomes apathetic sex then maybe something like love, if two killers are better than one what's three killers, Avi is jealous, Asa is preoccupied, August is still August, Lucas is frazzed, Archer is still drunk, Thomas is at his wits end, Aiden is still in denial, Noah is still the psychopath whisperer and Adam is still a dick.",
  "genres": [
    "M M Romance",
    "Romance",
    "Dark Romance",
    "Dark",
    "Contemporary",
    "LGBT",
    "Enemies To Lovers"
  ],
  "author": "Onley James",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/60110602-mad-man"
}