{
  "title": "Shelter from Our Secrets, Silence, and Shame: How Our Stories Can Keep Us Stuck or Set Us Free",
  "description": "AS a mental health clinician, Rebecca Brown has been a safe place for many to seek shelter from their secrets, silence and shame. Inspired to finally slow down, stop running from herself and share her own story, she found ways to seek and savour her own shelter.Rebecca's personal journey takes us through sadness, tragedy, self-sabotage, the impossible pursuit of perfection, distorted thinking and eating, engaging with her shadow self, divorce, and numbing with alcohol, all in an attempt to avoid the story needing to be shared.Dispelling the limiting beliefs we hold about ourselves can unlock our limitless potential to reach goals we never dared to dream. From the Boston Marathon to working with horses, Rebecca sets out to prove to herself that anything is possible when you don't listen to the negative stories you tell yourself.Everyone has a story. We become who we are because of what has happened to us, and because of the stories we tell ourselves. But do our stories continue to serve us well, or keep us stuck? Are our stories fact or fiction? Is it time to rewrite the versions we have been telling ourselves?Shelter provides strategies to help reframe the thinking patterns we have developed, and offers tools to recognize when we are suffering from our own thoughts, feelings and actions. Resilience-building techniques are woven through the pages, and encouragement for the lifelong journey of collecting moments of awe and happiness.Seeking and reading Shelter is a gift of self-compassion and self-discovery. Rebecca's hope is that it will be read with a highlighter in hand, pages folded down, re-read, recommended to a friend, and used as a guide to start sharing our own stories with those we love.We may not have written our beginnings, but we have the ability to write every word from this point forward and just imagine where our stories can take us when we are free of secrets, silence and shame.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Rebecca L.   Brown",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/60105705-shelter-from-our-secrets-silence-and-shame"
}