{
  "title": "Barracuda: The Unauthorized Biography of Sarah Palin",
  "description": "Award-winning author Aladdin Elaasar released his latest book, -Barracuda: The Unauthorized Biography of Sarah Palin: What You Do Not Know and Should Know about America-s Potential Vice President-.  This timely book describes how McCain-s choice of -the Barracuda-, a.k.a. Sarah Palin, as his running mate, opened the flood gates of the media to controversy and speculations.  While Radio host Rush Limbaugh and former Bush adviser Karl Rove hailed Palin, some Republicans were dismayed, who felt the choice underscored McCain's weaknesses. Palin is facing an investigation in Alaska for alleged abuse of power involving her former brother-in-law.   McCain-s choice of Palin could not have been more timely and savvy. Palin managed to steal all the attention and the limelight from Senator McCain who could not be happier!  American media has quickly turned its attention from JoeBama to McPalin - but more so to Republican VP and Alaska Governor Sarah. Where does Palin buy her eyewear?  Will Oprah ever have Palin on her show?  She-s been in the spotlight for few days and has given plenty of news for the media to talk about   McCain-Palin Republican presidential campaign buttons now read -The Hottest Chick,- -Our mama is better than your Obama,- -Read my Lipstick,- -She proved you can throw a punch with a French manicure.-      -Though Sarah Palin is clearly a powerful speaker, I kept thinking it was a monologue on Saturday Night Live and Palin was \"news roaster\" Tina Fey, says one commentator.   -Will the media test her on substance or let her play \"Ms. Congeniality?\" It is up to the public to see through the fact-free diet we're being fed. Despite Campaign Spin, McCain Would Be a Disaster on Women's Rights-, claims columnist Laura Flanders.  Columnist Kimberly Gadette describes Palin pick as -The Bikini Car Wash: One Sexist Tradition- -in selecting Alaska Governor Sarah Palin as his running mate, John McCain is dusting off an old GOP tool: the estrogen guard. Slap a friendly, female face on a hard core-conservative political platform, and pray that the pundits will only take pot-shots and talk about gender. It worked for George W. Bush and it just may work for Palin-.   The choice of Sarah Palin, as it seems, is a high risk bet that could bring high rewards, but there are no guarantees. Many wonder whether she is ready to be vice-president and lead the US, should something happen to McCain if he is elected president.  Democrats said they felt insulted that McCain thought he could woo women by just putting any woman on his ticket, with one sentence making the rounds: \"Palin, you are no Hillary Clinton\".  Aladdin Elaasar-s -Barracuda- is a must-read for all American voters and those following American elections and politics. The result of this year-s election will not only impact the USA, but many nations around the globe.   In this timely book, Aladdin Elaasar investigates: Who is the real Sarah Palin? Palin-s Political Records; Palin-s connections with Big Business and Big Oil. Is Sarah Palin- an Extremist? Is she a Zombie Republican or a Right Wing Feminist? How Populist is Sarah Palin? Can Sarah Palin's faux-feminist machismo and her handlers succeed in using purely symbolic appeals and Culture Wars to camouflage her actual record and the plain contradictions in her story? Will the Slogan of the McCain/Palin Administration- in their quest for oil- be: Drill, Baby, Drill?",
  "genres": [],
  "author": "Aladdin Elaasar",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/6011754-barracuda"
}