{
  "title": "The Broken One",
  "description": "Fake marry her brother’s best friend to catch a killer . . . sure, what could go wrong?Growing up on a ranch with four older brothers, Ella Mae Hawkins is no stranger to rugged and tough men. But her heart has always belonged to the one man she can’t have.After a secret romantic weekend three years ago with him leaves her broken-hearted, Ella Mae accepts an opportunity to go to Paris and pursue her fashion dreams. It’s supposed to be her chance to get away and start over. Instead, she’s going there with the same stubborn man who claimed he was too dangerous for her—as his fake wife.Jesse McAdams, a former Army Ranger, has spent half his life away from his small hometown, but one thing has always remained true: one woman owns his heart. The problem? She can never know how he really feels.But after their hot weekend in New York, it’s been harder than ever to resist the sassy, headstrong Ella Mae. Especially when they can’t share a room without arguing, which often leads to desire.Joining the team at Falcon Falls Security was supposed to bring the redemption he needs so he can finally be the man Ella Mae deserves. Instead, the fabric of lies he’s woven over time quickly unravels, exposing his secrets, and places a target on the heads of everyone he cares about.Despite her shock over his past, Ella Mae finds herself falling for her brother’s best friend all over again. But this time, the stakes are higher. This time she’s in danger. And the man who put her there is now her husband.Can Jesse protect her and piece Ella’s heart back together . . . or will he shatter it for good?From Wall Street Journal bestselling author, Brittney Sahin, comes a thrilling new standalone romance military novel with no cliffhanger and a happily-ever-after.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Romantic Suspense",
    "Second Chance",
    "Military Romance",
    "Friends To Lovers",
    "Suspense"
  ],
  "author": "Brittney Sahin",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/60116631-the-broken-one"
}