{
  "title": "Happily Ever After Cookbook: Original Recipes for Book Lovers",
  "description": "Immerse yourself in the world of romance with book-inspired recipes! Bestselling authors of your favorite novels teamed up with private chefs to develop original dishes. Now you can cook your way to a happily ever after...Enjoy New Orleans Gumbo from Kennedy Ryan's RITA-Award Winner Long Shot. Then bite into Texas BBQ Tacos from USA Today bestselling author K.A. Linde's The Wright Brother. Follow it up with Diablo Cookies from Dangerous Temptation by Wall Street Journal bestselling author Giana Darling. Finish your evening with an Underworld Cocktail inspired by New York Times bestselling author Katee Robert's Wicked Villains series.This sensual journey will surprise and delight readers!Billionaire heroes and strong heroines come to life with these recipes...The Happily Ever After Cookbook contains exclusive appetizers, soups, main dishes, desserts, cocktails, breakfast, and bakery recipes. Bring romance novels to life with these literary dishes. It will look great on your keeper shelf next to your favorite books.FULL LIST OF AUTHORS INCLUDED: Cora Reilly, Laurelin Paige, Adriana Locke, Meghan Quinn, K. Webster, Amelia Wilde, Giana Darling, Katee Robert, Kylie Scott, Alta Hensley, Amo Jones, Sara Ney, K.A. Linde, Jenika Snow, Q.B. Tyler, Corinne Michaels, Maya Hughes, Melanie Harlow, Kelly Elliott, Kandi Steiner, Susan Stoker, Kennedy Ryan, M. O'Keefe, Fiona Cole, Willow Winters, AM Hargrove, L.B. Dunbar, Terri E. Laine, Monica Murphy, Jana Aston, Susannah Nix, A.L. Jackson, Teagan Hunter, M. Robinson, Pepper Winters, Sienna Snow, Emma Scott, Skye Warren, Mia Sheridan, Kate Canterbary, Tasha Boyd, Danielle Romero, Louise Bay, Aleatha Romig",
  "genres": [
    "Cookbooks",
    "Nonfiction",
    "Cooking",
    "Romance",
    "Reference",
    "Anthologies",
    "Food"
  ],
  "author": "Jana Aston",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/60118143-happily-ever-after-cookbook"
}