{
  "title": "The Sundance Revenge: A Mystery Thriller",
  "description": "A #1 Bestselling Mystery Series New Release!On the \"Best Crime and Mystery Series\" and \"Best Women Sleuth Series\" on Goodreads.\"In Belle Bannon, Mike Pace has created a female Pike Logan, Scot Harvath, or Mitch Rapp. A heroine who can kick the ass of anyone or anything, except the demons haunting her.\" - Jon Land, USA Today bestselling author of the Caitlin Strong seriesDeaths are mounting at the Sundance Film Festival...January in Park City, Utah means the streets and ski runs are jammed with Hollywood celebrities. Belle Bannon is a former combat Marine with anger issues and currently works as a bow-hunting guide and a member of the Ski Patrol to make a few extra bucks. On a normal day that quickly turns terrifying, the power goes out in a heavy windstorm, stranding skiers in chairs dangling high in the air on the ski lifts. During Belle’s harrowing attempt to extract a stranded skier, he resists, screams, “Rover!”, head-butts her, then executes a perfect back dive to the rocky ravine far below. Watching from the trees, a woman who calls herself “The Sword of Justice” is ecstatic and whispers to herself, “It begins...”Over the next few days, more “accidents” occur, including an eighteen-year-old girl whom Belle considered a little sister. Angry and suspicious, Belle sets out to find a link connecting the accident victims in hope of proving the deaths were homicides. The search eventually leads to an event that occurred almost a hundred and fifty years earlier. The efforts trigger the killers to take aim at her and the entire town.With a target on her back, she must race a ticking clock to both rescue the next victim, before it's too late, and save the residents and visitors of the town from a deadly catastrophe.The Sundance Revenge is book one of the \"engrossing\" and \"thrilling\" Belle Bannon series and is perfect for fans of Lee Child, Brad Thor, and Vince Flynn.\"A fast-paced, engaging saga that's hard to put down.\" - Midwest Book Review\"Double the trouble, twice the action, and quadruple the fun. A rousing tale.\" - Steve Berry, NYT Bestselling Author of the Omega Factor",
  "genres": [
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "Mike Pace",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/60106489-the-sundance-revenge"
}