{
  "title": "Before Prozac: The Troubled History of Mood Disorders in Psychiatry",
  "description": "Psychiatry today is a barren tundra, writes medical historian Edward Shorter, where drugs that don't work are used to treat diseases that don't exist. In this provocative volume, Shorter illuminates this dismal landscape, in a revealing account of why psychiatry is \"losing ground\" in the struggle to treat depression.Naturally, the book looks at such culprits as the pharmaceutical industry, which is not inclined to market drugs once the patent expires, leading to the endless introduction of new--but not necessarily better--drugs. But the heart of the book focuses on an unexpected the FDA, the very agency charged with ensuring drug safety and effectiveness. Shorter describes how the FDA permits companies to test new products only against placebo. If you can beat sugar pills, you get your drug licensed, whether or not it is actually better than (or even as good as) current medications, thus sweeping from the shelves drugs that may be superior but have lost patent protection. The book also examines the FDA's early power struggles against the drug industry, an influence-grab that had little to do with science, and which left barbiturates, opiates, and amphetamines all underprescribed, despite the fact that under careful supervision they are better at treating depression, with fewer sideeffects, than the newer drugs in the Prozac family. Shorter also castigates academia, showing how two forms of depression, melancholia and nonmelancholia--\"as different from each other as chalk and cheese\"--became squeezed into one dubious classification, major depression, which was essentially a political artifact born of academic infighting.An astonishing and troubling look at modern psychiatry, Losing Ground is a book that is sure to spark controversy for years to come.",
  "genres": [
    "Psychology",
    "Psychiatry",
    "Nonfiction",
    "History",
    "Mental Health"
  ],
  "author": "Edward Shorter",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/6011219-before-prozac"
}