{
  "title": "Pieternella: Daughter of Eva",
  "description": "Pieternella, Daughter of Eva opens in the early days of the first white settlement at the Cape of Good Hope, beneath the shadow of Table Mountain, with the Dutch East India Company clinging precariously to a little piece of land - Robben Island - in Table Bay.Eva was one of the first interpreters and intermediaries between her Goringhaicona tribe and the Dutch, and Pieternella's father was Pieter van Meerhoff, the Company surgeon who was murdered by slave dealers in Madagascar. Pieternella and her siblings were among the first mixed-race children born at the Cape and their lives are a manifestation of a sentiment often expressed by Matthee in this novel - that life can consist of heaven and hell rolled up together in one bundle.After her mother's sudden and untimely death, the orphaned Pieternella and her brother Salomon are sent to the hurricane- and drought-afflicted Mauritius, a penal colony at the time, to work as 'slaves' to foster parents. Pieternella barely survives the exhausting sea voyage and a premature marriage becomes her salvation.Pieternella remains attached to the memory of her mother and is full of turbulent emotions about how she is both brown and white in the same body. What will her children look like? Is she really only half-human, as she has so scornfully been told? Will she ever come to terms with who she is and find the peace and comfort she yearns for?Through this remarkable true story, which took three years of intensive research into old journals, diaries and historical records. Matthee has resurrected and breathed new life into the early history of the Cape, and Robben Island and Mauritius - the isles of banishment. She skillfully balances the elements of Pieternella's love and shame for her mother, the impersonal might of the Company versus one individual, and a slave who is freer than a free woman. She allows the historically misunderstood Eva finally to come into her own through the eyes of her clever, sensitive daughter.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Africa",
    "South Africa",
    "Historical",
    "Mauritius",
    "Drama"
  ],
  "author": "Dalene Matthee",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/6012608-pieternella"
}