{
  "title": "Jenkins at the Majors: Sixty Years of the World's Best Golf Writing, from Hogan to Tiger",
  "description": "Six decades of classic stories on the Masters, U.S. Open, British Open, and PGA Championship by the legendary Dan JenkinsDan Jenkins has long been considered one of the premier sportswriters in America. Honored and imitated by generations of his peers, Jenkins’s wit, fearlessness, and inimitable style set the tone for Sports Illustrated during his years there and are in full display in classic novels like Semi-Tough and Dead Solid Perfect . But it is his golf journalism—for the Fort Worth Press , Dallas Times-Herald , Sports Illustrated, and in recent years, Golf Digest —that sets him above and apart.In this masterful collection, Jenkins has selected the best of his original dispatches from the past sixty years—from Ben Hogan’s great final-round 67 to win the 1951 U.S. Open at torturous Oakland Hills to Tiger Woods's grimacing playoff win against Rocco Mediate fifty-eight years later—all written with his colorful humor and unmatched insight. His wry reportage on golf's most iconic players, thrilling finishes, historic moments, and heartbreaking collapses have brought legions of fans intimately close to the action and the larger-than-life personalities of the game. The stories in Jenkins at the Majors remain as vivid and thrilling as the days he wrote them, • Ben Hogan besting Sam Snead in an epic battle in the 1953 U.S. Open at Oakmont• The legendary 1960 U.S. Open at Cherry Hills, where three eras clashed as Arnold Palmer, Ben Hogan, and Jack Nicklaus battled it out in the final round• Greg Norman’s cringe-worthy collapse at the 1996 Masters• Tiger Woods’s record-shattering victory in the 2000 U.S. Open at Pebble BeachJenkins was there, immortalizing these and many other great moments in golf history—under deadline, no less—with his signature style and encyclopedic knowledge of the game in this nostalgic and highly entertaining ride. A must-read for every golf fan.",
  "genres": [
    "Sports",
    "Nonfiction"
  ],
  "author": "Dan Jenkins",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/6012229-jenkins-at-the-majors"
}