{
  "title": "In Hiding we Seek",
  "description": "In a universe of pawns, knights, kings and queens,With swords and crystals, threes and thirteens,A web of mystery and magic joins the strong and the weak,In this twisted tale of hide and seek.Lucid dreams, job opportunities, and the latest installment of CatGirl were only some of the things that greeted seventeen-year-old Kim on her birthday. Most of those things were relatively normal, just like her magical crystal and the masked man in her mirror. The assassination attempt was new, though.Fresh-faced and equipped with a mysterious unopenable letter after a night battling skeletons in an otherworldly graveyard, Kim leaves her village in search of employment. She soon discovers Crysterria's secret magical underbelly and its penchant for preventing her from earning a single gilded penny.As a blue-haired orphan with so many unique qualities, Kim inevitably finds herself entwined with a plot to save the world. Blue swords and runaway royals become a staple of her quest, as well as triplets, monsters, the look, and a whole bunch of unexpected adventure.If you enjoy:- Childhood sweethearts- Pancakes with a side of impending doom- A mystery involving things that aren't jellybeans- Unique magical races facing (or running from) their first world problems- A mystical blue sword that everyone seems to want- A backpack full of baked goods, and a tent that unfolds to be the size of a bedroom – choking hazard label attached- Sarcastic banter- Found family- Monsters with feelings- Morally grey areas- Silent reflection ghosts with attitude problems... then In Hiding we Seek is for you! Take a chance on a debut book from an Australian indie author. With full-page illustrations, smaller drawings for scene breaks and chapter headers, as well as a world map, the paperback option is sure to make for an immersive and unique reading experience for young adults and adults alike. Alternatively, the Kindle ebook experience offers a streamlined, illustration-free option.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "Keko V",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/60127264-in-hiding-we-seek"
}