{
  "title": "Political Prisoner: Persecuted, Prosecuted, but Not Silenced",
  "description": "A WALL STREET JOURNAL, USA TODAY, and PUBLISHERS WEEKLY NATIONAL BESTSELLER NEW BOOK CLAIMS DONALD TRUMP WILL RUN AND WIN IN 2024! A riveting account of the HOAX that sent a presidential campaign chairman to solitary confinement because he wouldn’t turn against the President of the United States.   The chief weapon deployed by the government-corporate-media Establishment against the Trump presidency was propaganda. Time and again, allegations from anonymous sources were disseminated by a partisan media, promoted by a dishonest Democrat Party leadership, and ultimately debunked when the facts surfaced. But by the time the truth came out, it was too late. There had already been casualties.    One of the highest profile casualties was Paul Manafort.   Desperate to defeat Donald Trump—or hamper his presidency after he won—Democrats and their Establishment allies colluded with foreign operatives to concoct a completely false narrative about Paul’s supposed conspiracy with pro-Russian elements in Ukraine to further Vladimir Putin’s efforts to influence the 2016 presidential election. But it wasn’t just defamation of Paul’s character. They took the unprecedented step of enlisting the US intelligence and law enforcement communities in using their power against President Trump and his campaign team.  Political Prisoner finally exposes the lies left unchallenged by media who pronounced Paul guilty long before his case ever saw the inside of a courtroom. Not only is it untrue that Victor Yanukovych or any of Paul’s clients were “pro-Putin,” it is the opposite of the truth. Paul’s work in Ukraine and throughout his career was 100 percent aligned with US interests in the countries he worked in, sometimes even acting as a back channel for the White House itself.   Neither was Paul guilty of laundering money, evading taxes, or deliberately deceiving the US government by failing to register as a foreign agent—which he wasn’t. These were all politically motivated charges manufactured by the Special Counsel’s team for one reason and one reason to get Paul to testify against Donald Trump about a conspiracy that never existed. When they hear the basis of these spurious charges, Americans will wonder what country they are living in and what has happened to our system of justice.  Political Prisoner tells the real story of Paul’s life and career, exploding the lies about his work in Ukraine, his previous work with foreign governments and business interests in other countries, his involvement with the Trump campaign, and the “process crimes” for which he was wrongly convicted and sent to prison. It is no exaggeration to say that everything most Americans think they know about Paul Manafort is false.",
  "genres": [
    "Politics"
  ],
  "author": "Paul Manafort",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/60127104-political-prisoner"
}