{
  "title": "The Mongoliad: Book One",
  "description": "The first novel to be released in The Foreworld Saga, The Mongoliad: Book One, is an epic-within-an-epic, taking place in 13th century. In it, a small band of warriors and mystics raise their swords to save Europe from a bloodthirsty Mongol invasion. Inspired by their leader (an elder of an order of warrior monks), they embark on a perilous journey and uncover the history of hidden knowledge and conflict among powerful secret societies that had been shaping world events for millennia.But the saga reaches the modern world via a circuitous route. In the late 19th century, Sir Richard F. Burton, an expert on exotic languages and historical swordsmanship, is approached by a mysterious group of English martial arts aficionados about translating a collection of long-lost manuscripts. Burton dies before his work is finished, and his efforts were thought lost until recently rediscovered by a team of amateur archaeologists in the ruins of a mansion in Trieste, Italy. From this collection of arcana, the incredible tale of The Mongoliad was recreated.Full of high adventure, unforgettable characters, and unflinching battle scenes, The Mongoliad ignites a dangerous quest where willpower and blades are tested and the scope of world-building is redefined.A note on this edition: The Mongoliad began as a social media experiment, combining serial story-telling with a unique level of interaction between authors and audience during the creative process. Since its original iteration, The Mongoliad has been restructured, edited, and rewritten under the supervision of its authors to create a more cohesive reading experience and will be published as a trilogy of novels. This edition is the definitive edition and is the authors' preferred text.Reviews:“This off-beat alternate history of Eurasia could be your new obsession.” –i09.com“This story is pure adventure, with much swordplay and swashbuckling.” –Kirkus Reviews“A terrifically engaging book that pulled me along at least as quickly as The Hunger Games. Think Lord of the Rings without all that pesky fantasy…Five frighteningly accurate historical sword fights out of five.” –Fanboy Comics",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Alternate History",
    "Science Fiction",
    "Audiobook"
  ],
  "author": "Neal Stephenson",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/12853147-the-mongoliad"
}