{
  "title": "Intervention",
  "description": "New York Times -bestselling author Robin Cook returns with another ripped-from-the-headlines medical thriller, where DNA science, biotechnology, and religion collide.I t's been more than thirty years since New York City medical examiner Jack Stapleton's college graduation and almost as long since he'd been in touch with former classmates Shawn Doherty and Kevin Murray. Once a highly regarded ophthalmologist, Jack's career took a dramatic turn after a tragic accident that destroyed his family. But that, too, is very much in the Jack has remarried-to longtime colleague and fellow medical examiner Laurie Montgomery-and is the father of a young child. But his renegade, activist personality can't rest, and after performing a postmortem on a young college student who had recently been treated by a chiropractor, Jack decides to explore alternative medicine. What makes some people step outside the medical establishment to seek care from practitioners of Eastern philosophies and even faith healers?Jack's classmate Shawn Doherty is now a renowned archeologist and biblical scholar at the Metropolitan Museum of Art, whose taste for good wine and generally deteriorating health are taking a toll on his career. He has recently obtained permission for a final dig beneath Saint Peter's, and despite his long-standing grudge against the Catholic Church, begins his research-which eventually takes him to Jerusalem and Venice -only to make a startling discovery with ecclesiastical and medical implications. And when James O'Rourke, now Bishop of the Archdiocese of New York, gets wind of Shawn's findings, he's desperate to keep them from the public. James has strong political ambitions within the Church, but his association with Shawn threatens to undermine them. James turns to his old friend Jack to help protect an explosive secret-one with the power to change lives forever.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Medical",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Robin Cook",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/6013077-intervention"
}