{
  "title": "True Surrender",
  "description": "When U.S. Army officer Aaron Bricewick is rescued from Afghanistan terrorists, he thinks the worst is over. Little does he know his personal journey is just beginning...  The first surprise is the amputation of one of his legs. The second is the woman he left behind, now a widow with a 4-year-old son - and his new prosthetist.  He vows that losing his leg won't derail his military career, but adjusting to life as an amputee is harder than he anticipated; it would be all too easy to become addicted to painkiller drugs…  Maintaining his outward appearance as a got-it-together military officer becomes increasingly difficult as he struggles with post traumatic stress disorder (PTSD), even while denying he needs help.  And though he has no intention of expanding his life to include a woman (let alone a widow and a young child), reuniting with his lost love leads his heart in another direction. Will he get a second chance at love, or will the possibility of long-term separation scare Holly away?  When another Army officer goes missing in Afghanistan, and Aaron uncovers a military conspiracy, he finds himself questioning the very foundation of his personal beliefs. His life is further shaken when his friend and fellow veteran with PTSD commits suicide.  But when a promise of redemption comes from an unexpected source, Aaron must make a stand. Which will he choose: duty or love?  True Surrender is a medical drama and soldier love story with inspirational themes that explore the inner struggle with Christian faith - especially when everything goes wrong. Note: It also has sensual situations and references to sex.  Gold Medalist, Military Writers Society of America: War and its aftermath is a deep, deep well for stories about devotion to duty, sacrifice, strength of character, friendship and love as well as violence, betrayal and loss.  Tracey Cramer-Kelly successfully weaves these emotions together in her poignant book, True Surrender, where we enter the world of Major Aaron Bricewick. After enduring capture and torture by terrorists in Afghanistan, and ultimate rescue by his fellow soldiers, Bricewick returns to the states wounded both physically and mentally. As may be typical of combat veterans, his stubbornness and outward self-confidence mask his vulnerability.  Perhaps it’s because of the author’s Army Reserve medic experience, but I found the descriptive side story of Bricewick’s leg amputation with its phantom pain, adjustment to prosthetics, acceptance of the reality of a lost limb and the limits it places on career and personal life, to offer raw insight into a world too many of our war wounded face and so few of us civilians can imagine.  Bricewick’s amputation brings him together with his former lover, Holly Rossiter, a prosthetist (artificial limb maker) at Holbrook Medical Center in California. But the amputation also serves as a metaphor for his life at this point: cut off emotionally from those around him, caught off balance by the betrayal of those he trusted, and in need of support from loved ones, no matter how painful it is for his independent self to admit.  Mix this with a mystery to be solved, an endearing and sensual love story, and a renewal of faith that had been long forgotten and True Surrender becomes a compelling and entertaining story. I couldn’t put it down.  “Mere words cannot express how impressed I am with this novel. Tracey Cramer-Kelly has out done herself on this military romance. This author has fully convinced me that she is a voice that will quickly earn her high marks in the book world.” ~ romancejunkies.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Contemporary"
  ],
  "author": "Tracey Cramer-Kelly",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/12853067-true-surrender"
}