{
  "title": "A Merry Little Meet Cute",
  "description": "Cowritten by #1 New York Times bestselling author Julie Murphy and USA Today bestselling author Sierra Simone—a steamy plus-size holiday rom-com about an adult film star who is semi-accidentally cast as a lead in a family-friendly Christmas movie, and the former bad-boy pop star she falls in love with.Bee Hobbes (aka Bianca Von Honey) has a successful career as a plus-size adult film star. With a huge following and two supportive moms, Bee couldn’t ask for more. But when Bee’s favorite producer casts her to star in a Christmas movie he’s making for the squeaky-clean Hope Channel, Bee’s career is about to take a more family-friendly direction.Forced to keep her work as Bianca under wraps, Bee quickly learns this is a task a lot easier said than done. Though it all becomes worthwhile when she discovers her co-star is none other than childhood crush Nolan Shaw, an ex-boy band member in desperate need of career rehab. Nolan’s promised his bulldog manager to keep it zipped up on set, and he will if it means he’ll be able to provide a more stable living situation for his sister and mom.But things heat up quickly in Christmas Notch, Vermont, when Nolan recognizes his new co-star from her ClosedDoors account (oh yeah, he’s a member). Now Bee and Nolan are sneaking off for quickies on set, keeping their new relationship a secret from the Hope Channel’s execs. Things only get trickier when the reporter who torpedoed Nolan’s singing career comes snooping around—and takes an instant interest in mysterious newcomer Bee.And if Bee and Nolan can’t keep their off-camera romance behind the scenes, then this merry little meet cute might end up on the cutting room floor.",
  "genres": [
    "Romance",
    "Christmas",
    "Holiday",
    "Audiobook",
    "Contemporary",
    "Fiction",
    "Contemporary Romance"
  ],
  "author": "Julie   Murphy",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/60121411-a-merry-little-meet-cute"
}