{
  "title": "New Kids on the Rock",
  "description": "Star athlete Josh and computer prodigy Madison are recruited by the mysterious Mr. Crux to attend a special summer camp. The two elementary school kids then begin the adventure of a lifetime. They discover that the Small World Global Protection Agency is a network of talented and skilled children in countries all over the world. Their mission is to help other kids and save the day when adults can’t.In Case File: 001-A, New Kids on the Rock, Josh and Madison start their adventure with the Global Protection Agency. Their first mission takes them to Australia to help teen pop singer Ja-Naya and discover what her evil manager, Feeble Bix is up to. Their counterparts, Mick and Kim, are ready for action as they head across the Outback.The Small World Global Protection Agency is an adventure serial aimed at third through fifth grade readers. Each volume will take Josh and Madison to a different country. The stories will be entertaining, sometimes suspenseful, sometimes humorous. Each story will introduce facts about other countries and cultures, educating the reader through the eyes of children their own age while having fun.Mark currently resides in Florida with his family. He strives to follow in the footsteps of his namesake, Mark Twain.His father was a newspaper writer and editor for both the Kansas City Star and Kansan. Mark received his Bachelor’s Degree in Film from the University of Kansas. He has been influenced by great stories from C.S. Lewis, and Tolkien and Star Wars.Mark is the author of The Empyrical Tales. Book I: The Fourth Queen and Book II: The Lost Queen are available now. Book III: The Secret Queen is coming Spring 2012. Mark is also the creator of the spiritual eBook series “Mark Miller’s One”. The first story, “Meant To Be”, tells how he met his wife.Mark believes being a father of four makes him uniquely qualified to write his stories. He also has spent time in the classroom with third, fourth and fifth graders.",
  "genres": [
    "Childrens",
    "Science Fiction",
    "Middle Grade",
    "Young Adult"
  ],
  "author": "Mark  Miller",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/12853211-new-kids-on-the-rock"
}