{
  "title": "Winter Stars: An elderly mother, an aging son, and life's final journey",
  "description": "\"Winter Stars is a gift - a modern classic of frontier literature documenting the uncertain journey into the country of caregiving.\" -Michael J. Fox Dave Iverson was a busy broadcast journalist recently diagnosed with Parkinson's disease when he decided to do something he'd never quite imagined: He moved in to take care of his 95-year-old mom. Winter Stars is the moving story of their ten-year caregiving journey.\"The resulting memoir is a love story you won't soon forget,\" writes Elizabeth Farnsworth, former chief correspondent for The PBS NewsHour and author of A Train Through Time. By the end of this decade, 74 million Americans will be over the age of 65, including every member of the Baby Boom generation. The pandemic prompted more Americans to consider caring for their parents at home, but as Iverson learned, the gritty, life-changing reality caregiving delivers requires more than good intentions. He didn't know that his mom's dementia would pose more challenges than his Parkinson's. He didn't know he'd be capable of getting so angry. He didn't know that becoming a caregiver means experiencing love and loss, anger and insight - usually when exhausted and often on the same day. And he didn't know that moving in with his mom would challenge and change him more than any other life experience.\"A deeply moving memoir, Winter Stars is still more than that - it is a guide to finding the help we all need, in one way or another, as life poses new and different challenges,\" praises Ron Elving, Senior Editor and Correspondent, NPR For the vast number of families who are confronting--or will soon confront - the journey of eldercare, Winter Stars offers an intimate, unvarnished portrait of the challenges, choices, and life lessons that lie ahead.\"Honest, comforting, and true, Winter Stars is a testament to the power of family love,\" says Ann Packer, best-selling author of The Dive from Clausen's Pier and Songs Without Words. All royalties from the sale of Winter Stars go to support: The Michael J. Fox Foundation for Parkinson's Research; Dance for PD; and Avenidas, a San Francisco Bay Area organization providing caregiver support.",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Dave Iverson MS",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/60132923-winter-stars"
}