{
  "title": "FDR's Folly: How Roosevelt and His New Deal Prolonged the Great Depression",
  "description": "The Great Depression and the New Deal. For generations, the collective American consciousness has believed that the former ruined the country and the latter saved it. Endless praise has been heaped upon President Franklin Delano Roosevelt for masterfully reining in the Depression’s destructive effects and propping up the country on his New Deal platform. In fact, FDR has achieved mythical status in American history and is considered to be, along with Washington, Jefferson, and Lincoln, one of the greatest presidents of all time. But would the Great Depression have been so catastrophic had the New Deal never been implemented?In FDR’s Folly, historian Jim Powell argues that it was in fact the New Deal itself, with its shortsighted programs, that deepened the Great Depression, swelled the federal government, and prevented the country from turning around quickly. You’ll discover in alarming detail how FDR’s federal programs hurt America more than helped it, with effects we still feel today, including:• How Social Security actually increased unemployment• How higher taxes undermined good businesses• How new labor laws threw people out of work• And much moreThis groundbreaking book pulls back the shroud of awe and the cloak of time enveloping FDR to prove convincingly how flawed his economic policies actually were, despite his good intentions and the astounding intellect of his circle of advisers. In today’s turbulent domestic and global environment, eerily similar to that of the 1930s, it’s more important than ever before to uncover and understand the truth of our history, lest we be doomed to repeat it.From the Hardcover edition.",
  "genres": [
    "History",
    "Politics",
    "Economics",
    "Nonfiction",
    "American History",
    "Audiobook",
    "Presidents"
  ],
  "author": "Jim  Powell",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/10303.FDR_s_Folly"
}