{
  "title": "Nijura: Das Erbe der Elfenkrone",
  "description": "Über den Marschen von Korr liegt dichter Nebel. So kommt es, dass die Moorelfen den verhüllten Besucher ihres Dorfes erst spät erkennen. Der rätselhafte Mann gibt sich als Gesandter der Freien Elfen der Dunklen Wälder aus, und so schöpft niemand Verdacht, als der Fremde -- wenn auch in gebrochenem Elfisch -- eine Unterredung mit dem König der Moorelfen verlangt. Warum auch? Der König der Moorelfen ist im Besitz der Krone Elrysjar, die ihn unverwundbar macht. Also lassen seine Untertanen den Unbekannten in die Hütte treten. Als er heraustritt, lässt er die Kapuze fallen. Es ist ein Mensch, und er trägt Elrysjar auf seinem ein ungeheuerlicher Frevel! Die Moorelfen aber sind verdammt, dem neuen Herrscher bedingungslos zu folgen. Schon scharrt der Mensch in seiner Vermessenheit ein Heer Grauer Krieger um sich, um die Macht über die gesamte Welt zu erlangen. Nur eine Waffe kann ihm Einhalt ein merkwürdiges Messer, dass im Wald auf die Halbelfe Nill gewartet hat. Als \"Nijura\" ist Nill bestimmt, dem grausamen Menschen entgegenzutreten. Gemeinsam mit dem Menschenjungen Scapa und dem Elfenprinzen Kaveh nimmt sie die Herausforderung an .... Das Romandebüt Nijura. Das Erbe der Elfenkrone der deutsch-vietnamesischen Autorin Jenny-Mai Nuyen ist ein Phänomen. Denn seine Autorin ist gerade einmal 18 Jahre alt. Zwei Jahre hat Nuyen, die inzwischen an der New York University Film studiert, an ihrem Epos geschrieben, und die brillante Reife des Buchs ist wohl nur darauf zurück zu führen, dass das Fantasy-Genre eines ist, das mit allerlei tradierten Mustern, Versatzstücken von Mythen und einem festgelegten Repertoire an Figuren die bestmögliche Wirkung zu erzielen vermag. Natürlich hat sich auch Nuyen durch die ganze Parallelwelt der Elfen, Irrlichter, Gnomen, Riesen und Drachen hindurch gelesen. Und trotzdem besteht die Kunst ja gerade darin, wieder etwas völlig neues aus dem Hexenkessel bekannter Zutaten zu zaubern. Mit Nijura. Das Erbe der Elfenkrone ist Nuyen dies auf jeden Fall gelungen. Andere Vertreter des Genres mögen älter sein. Aber Nuyen ist deutlich besser als ein Großteil von ihnen. Für Leser ab zwölf Jahren. --Isa Gerck",
  "genres": [
    "Fantasy",
    "Young Adult",
    "High Fantasy",
    "German Literature",
    "Fiction",
    "Romance",
    "Young Adult Fantasy"
  ],
  "author": "Jenny-Mai Nuyen",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6014612-nijura"
}