{
  "title": "My People: Five Decades of Writing About Black Lives",
  "description": "From the legendary Emmy Award-winning journalist, a collection of ground-breaking reportage from across five decades which vividly chronicles the experience of Black life in America today.At just eighteen years old, Charlayne Hunter-Gault made national news when she mounted a successful legal challenge that culminated in her admission to the University of Georgia in January 1961--making her one of the first two Black students to integrate the institution. As an adult, Charlayne switched from being the subject of news to covering it, becoming one of its most recognized and acclaimed interpreters.Over more than five decades, this dedicated reporter charted a course through some of the world's most respected journalistic institutions, including The New Yorker and the New York Times,  where she was often the only Black woman in the newsroom. Throughout her storied career, Charlayne has chronicled the lives of Black people in America--shining a light on their experiences and giving a glimpse into their community as never before. Though she has covered numerous topics and events, observed as a whole, her work reveals the evolving issues at the forefront of Black Americans lives and how many of the same issues continue to persist today.My People showcases Charlayne's lifelong commitment to reporting on Black people in their totality, \"in ways that are recognizable to themselves.\" Spanning from the Civil Rights Movement through the election and inauguration of America's first Black president and beyond, this invaluable collection shows the breadth and nuance of the Black experience through trials, tragedies, and triumphs and everyday lives.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Biography",
    "Memoir",
    "Journalism",
    "Politics"
  ],
  "author": "Charlayne Hunter-Gault",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/60141387-my-people"
}