{
  "title": "Heavy Is the Crowne",
  "description": "He needed help. He never expected it to come from her…Cade’s MC was in shambles. Thanks to their ongoing war with the cartel and the police, most of his guys were either locked up, or in the hospital. But he was not giving up. Far from it. He’d bring the fight to their door. And if he had to partner with the strong, sexy-as-hell FBI Agent to finish the job, so be it…FBI agent Murphey Flynn came to Austin with one purpose. Revenge. But her daddy issues would have to wait, because the things that were going down in this city were huge—and it was her job to stop it. She never thought she’d end up working with the enemy, but you know what they said; the enemy of my enemy is my friend. Falling for him wasn’t in her plans. But here she was…In the end, they both knew a fed and a biker could never be together. But if they failed in their mission, finding a happily ever after together would be the least of their concerns. Because if their true enemies have their way, Cade and Flynn might not even make it out alive…Heavy Is The Crowne, is book seven of The Vikings MC Series, is a dark, steamy, angsty, biker romantic suspense read full of action, adventure, and sexy times. This is the final book in the Austin Chapter, but don't worry, there's more to come in another city!*** Be Forewarned:These books contain violence and descriptions of illicit activities. If you enjoy sexy anti-heroes, fast-paced and action-packed storylines, and steamy love scenes, then these are the books for you. There are guaranteed HEAs or HFN for each couple at the end of each book, but the underlying storyline does continue from book to book, and they end in cliffhangers. It is recommended you begin reading with book one, Heart of Steel.",
  "genres": [
    "Romance",
    "Suspense",
    "Dark",
    "Dark Romance"
  ],
  "author": "Cathleen   Cole",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/60141152-heavy-is-the-crowne"
}