{
  "title": "الحياة هي في مكان آخر",
  "description": "آه حدثوني عن التي أفكر بها دائماً (كان هذا البيت يعود كلازمة). أخبروني كيف كانت تشيبها الأعوام (كان من جديد يريد أن يمتلكها بأسرها مع خلودها البشري) وأخبروني كيف كانت في طفولتها (لم يكن يريدها مع مستقبلها فحسب، بل ومع ماضيها أيضاً). واجعلوني أشرب ماء دموعها القديمة (وخاصة كان يريدها بحزنها الذي كان يحرّره من حزنه)... كان جاروميل متحمساً لكتاباته، إذ أنه كان قد وجد مكان خيمة الانسجام الزرقاء الواسعة والمساحة الاصطناعية التي تُزال فيها جميع التناقضات، وحيث تجلس الأم مع ابنها وكنتها على طاولة السلام المشتركة، جود منزلاً آخر للمطلق، لمطلق أكثر قساوة وصدقاً، لأنه إذا لم يكن مطلق النقاء والسلام موجوداً، فهناك مطلق للعاطفة اللامتناهية التي يذوب داخلها، كما هو في محلول كيماوي، كل ما هو متسخ وغريب. كان متحمساً لهذه القصيدة، فيما كان يدري أن أية صحيفة لن تقبل نشرها، إذ أن لا علاقة لهذا الشعر بعهد الاشتراكية السعيد. غير أنه كان يكتب لنفسه ولصاحبة الشعر الأحمر. وعندما قرأ لها هذه الأشعار، تأثرت حتى الدموع، لكن في الوقت نفسه، انتابها الخوف من جديد لأن الموضوع تناول أيضاً بشعتها، وشخصاً كان قد تحسسها، وشيخوخة ستأتي. ولم تكن شكوك الفتاة تقلق جاروميل البتة. على العكس، كان يرغب في رية تلك الشكوك والتلذذ بها. كان يرغب في أن يتوقف عندها ويدحضها مطوّلاً. لكن أسوأ ما في الأمر هو أن الفتاة، التي لم تكن تنوي مناقشة موضوع القصيدة أطول مما ينبغي، أخذت تتكلم عن موضوع آخر\".يتعرض كونديرا من خلال أحداث روايته هذه لتاريخ تشيكوسلوفاكيا السياسي بين الثلاثينات والسنات الت تلت ربيع براغ. ويمثل \"سقوط لادفيك جاهن\" بمعنى ما، خيبة جيل بأكمله كان قد آمن \"بانقلاب براغ\" عام 1948 وانتظر عشرين عاماً لكي يضحك قليلاً قبل أن يرغم على الصمت من جديد. لذلك يشكل هذا العمل لكونديرا مع أعماله الأخرى أكثر التشهيرات حدّة ضد السياسة \"الستالينية\" التي تفكك بشراسة أجهزتها وتفضح خداعها الهائل. بالإضافة إلى ذلك، فإنه يمكن أن تأخذ هذه الرواية بعداً آخر إلى جانب صنعتها عملاً جدلياً سياسياً، ويمكن للقارئ استرجاعها وتحليلها بوصفها هجاءً للشعر، السيء فحسب، ويمكن المضي إلى أبعد من ذلك فإن موضوع النقد في هذا العمل لا يتناول الشعر السيء بل يتناول أي شعر، أي شكل من أشكال النظم الشعري الغنائي.",
  "genres": [
    "Fiction",
    "Czech Literature",
    "Novels",
    "Literature",
    "Classics",
    "Philosophy",
    "Literary Fiction"
  ],
  "author": "Milan Kundera",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/6014536"
}