{
  "title": "The New Guys: The Historic Class of Astronauts That Broke Barriers and Changed the Face of Space Travel",
  "description": "The never-before-told story of NASA’s 1978 astronaut class, which included the first American women, the first African Americans, the first Asian American, and the first gay person to fly to space. With the exclusive participation of the astronauts who were there, this is the thrilling, behind-the-scenes saga of a new generation that transformed space exploration The story of NASA’s Astronaut Class 8, or “The F*cking New Guys,” as their military predecessors nicknamed them, is an unprecedented look at these extraordinary explorers who broke barriers and blasted through glass ceilings. Egos clashed, ambitions flared, and romances bloomed as the New Guys competed with one another and navigated the cutthroat internal politics at NASA for a chance to rocket to the stars. Marking a departure from the iconic military test pilots who had dominated the space program since its inception, the New Guys arrived at the dawn of a new era of space flight. Teardrop-shaped space capsules from Mercury, Gemini, and Apollo gave way to the space shuttle, a revolutionary space plane capable of launching like a rocket, hauling cargo like a truck, and landing back on Earth like an airliner. They mastered this new machine from its dangerous first test flights to its greatest achievements: launching hundreds of satellites, building the International Space Station, and deploying the Hubble Space Telescope. The New Guys depicts these charismatic young astronauts and the exuberant social and scientific progress of the space shuttle program against the efforts of NASA officials who struggled to meet America’s military demands and commercial aspirations. When NASA was pressured to fly more often and at greater risk, lives were lost in the program’s two biggest disasters: Challenger (1986) and Columbia (2003). Caught in the crosshairs of this battle are the shuttle astronauts who gave their lives in those catastrophes, and who gave their lives’ work pursuing a more equitable future in space for all humankind. Through it all they became friends, rivals, lovers, and ultimately, family.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Space",
    "Biography",
    "Audiobook",
    "Travel"
  ],
  "author": "Meredith Bagby",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/60141389-the-new-guys"
}