{
  "title": "Mirror Made of Rain",
  "description": "A The Millions Most Anticipated of 2022 BookAn NPR Book of The Day\"The writing is sharp, beautiful, very evocative. The characters pop off the page and are instantly recognizable. Noomi is so achingly human and alive. I love the subtlety of Patel's hand in the way she depicts Noomi and her world in Mirror Made of Rain. Everything feels so lush and gorgeous as the story at the heart of the novel emerges and eventually coheres to devastating effect.\" ―Brandon Taylor, author of Real Life and Filthy Animals\"Patel is undaunted, as she dares to write about unlikable women, a far cry from the demure females that have long featured in Indian fiction... [She] has given us a dark, moody, brooding novel that explores the fissures of family with delicacy and conviction.\" —Anandi Mishra, Los Angeles Review of Books Despite an embarrassing, alcoholic mother, Noomi Wadia is loathe to change her own hard-partying ways simply because it's what's expected in Kamalpur high society. As her peers begin to marry and her social obligations become more fraught, she finds herself under constant scrutiny at summer parties of the city's upper crust.With her options in her hometown growing increasingly limited, Noomi leaves for Mumbai and quickly becomes a successful journalist. There she falls in love with Veer, who appreciates her for exactly who she is. When Noomi and Veer decide to marry, Noomi must observe a host of patriarchal wedding rituals at the behest of her new in-laws, whose cultural customs deviate from her own. Soon, Noomi realizes that her worst fears have come to pass--she is trapped in the same cycle of self-destructiveness as her mother, and she must battle her impulses or risk losing it all.A riveting exploration of class and tradition in contemporary India, Noomi is as quick-witted as she is quick-tempered. At times funny and tragic, taking place over many years of Noomi's life, Naheed Phiroze Patel's exhilarating debut novel shows how society encourages us to see ourselves through the eyes of others.“A personal, empathetic view on mothers who society has deemed ‘failures’” ―NPR “Patel succeeds in depicting the ways the upper class can be a gilded cage for women” —Publishers Weekly“A graceful descriptive style” —KirkusMirror Made of Rain is a testament to the journey we all take from adolescence to finding ourselves in adulthood.\" —BOMB Magazine“Patel’s novel traces the deep connections between our society’s cruel treatment of women and the catastrophic turns women take in their lives.” —Electric Literature“An immersive debut” —Ms. Magazine“A beautifully written book” —Debutiful“Told with achingly beautiful prose and razor sharp wit” —Book Culture Blog",
  "genres": [
    "Fiction",
    "India",
    "Contemporary",
    "Book Club",
    "Literary Fiction",
    "Adult"
  ],
  "author": "Naheed Phiroze Patel",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/60163836-mirror-made-of-rain"
}