{
  "title": "How the Beatles Destroyed Rock 'n' Roll: An Alternative History of American Popular Music",
  "description": "There are no definitive histories, writes Elijah Wald, in this provocative reassessment of American popular music, because the past keeps looking different as the present changes. Earlier musical styles sound different to us today because we hear them through the musical filter of other styles that came after them, all the way through funk and hip hop.As its blasphemous title suggests, How the Beatles Destroyed Rock 'n' Roll rejects the conventional pieties of mainstream jazz and rock history. Rather than concentrating on those traditionally favored styles, the book traces the evolution of popular music through developing tastes, trends and technologies--including the role of records, radio, jukeboxes and television --to give a fuller, more balanced account of the broad variety of music that captivated listeners over the course of the twentieth century. Wald revisits original sources--recordings, period articles, memoirs, and interviews--to highlight how music was actually heard and experienced over the years. And in a refreshing departure from more typical histories, he focuses on the world of working musicians and ordinary listeners rather than stars and specialists. He looks for example at the evolution of jazz as dance music, and rock 'n' roll through the eyes of the screaming, twisting teenage girls who made up the bulk of its early audience. Duke Ellington, Benny Goodman, Frank Sinatra, Elvis Presley, Chuck Berry, and the Beatles are all here, but Wald also discusses less familiar names like Paul Whiteman, Guy Lombardo, Mitch Miller, Jo Stafford, Frankie Avalon, and the Shirelles, who in some cases were far more popular than those bright stars we all know today, and who more accurately represent the mainstream of their times.Written with verve and style, How the Beatles Destroyed Rock 'n' Roll shakes up our staid notions of music history and helps us hear American popular music with new ears.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Pop Culture",
    "Biography",
    "Sociology",
    "Cultural"
  ],
  "author": "Elijah Wald",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/6015333-how-the-beatles-destroyed-rock-n-roll"
}