{
  "title": "A Stem full of Thorns",
  "description": "We forge relationships for many reasons. When we seek soul-mates, we’re willing to step out of our comfort zones in hope that the love we seek is mutual. What price are you willing to pay for love?Finding someone to care for and love unconditionally, while receiving the same comes at a cost most peoples are not pay, and at the end of that relationship it leaves us broken, bitter and harden.What price would you be willing to pay for love? –The Steaks has raisin, and the cost has become unbearable for all those who remains connected to William. The charming, sexy, lovable William R. Green has pushed everyone beyond their limits, and become the man who must be stop. William recent events have forced the Heavens to respond, and Yvonne is ordered to kill her husband of 25 years, but will she? Can her love for William be stronger than a commandment of God?The jilted lover Robert brings William’s temper to a boil when he put his hands on Yvonne. This taboo sets chaos into motion. Robert takes things too far when he tried to force his well upon the center of his world, Yvonne, which brings forth a long awaited show down between him and William.Dana has been bewitched and fights to regain her soul. That fight is hampered because the source of her trouble is the former wife, and mother of her fiancé two children. She need the guidance of her former lover William, but Kevin had issued an ultimatum, end her relationship with William, or end her relationship with him.Her terrifying dreams and horrible visions has left Andrea to divorce her husband and move back to NYC to reconnect with William, but in doing so, her husband refuse to give up without a fight and is sent on a mission by his church to slay William.--And the sweet home-wrecker, Joann has spent the night on the dark-side, and was damned. The Evil on left her with a choice to join them and reign supremely, but if she choose to keep her faith and love in William, she will lose all she cherish.Lines with be drawn, love will be tested, and blood will spill.",
  "genres": [],
  "author": "Lord' Williams",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/6015571-a-stem-full-of-thorns"
}