{
  "title": "The Mammoth Book of Sorcerers' Tales : The Ultimate Collection of Magical Fantasy from Tom Holt, Ursula K. LeGuin, Michael Moorcock, Peter Crowther, Louise Cooper, and many more",
  "description": "Sorcery is all around us. From a child's struggles to control magical powers for the first time, to the epic clashes of forces of good and evil on a titanic scale, here are more than twenty of the finest in contemporary and classic wizardry tales. Ranging from Michael Moorcock's \"Master of Chaos,\" the story of a knight traveling to a castle on the edge of the world to face the ultimate sorcerer, to Peter Crowther's \"The Eternal Altercation,\" in which a man is forced into the eternal battle between hope and despair on a sorcerer-controlled train, The Mammoth Book of Sorcerers' Tales also includes stories from Ursula Le Guin, Steve Rasnic Tem, James Bibby, Robert Weinberg, A. C. Benson, Michael Kurland, and Louise Cooper.Contains:Ten Things I Know About the Wizard by Steve Rasnic TemVillaggio Sogno by Richard A. LupoffThe Game of Magical Death by Doug HornigThe Infestation by Tom HoltThe Witch's Bicycle by Timm PrattThe Sage of Theare by Diana Wynne JonesTimekeeper by John MorressyThe Double Shadow by Clark Ashton SmithThe Rite Stuff by Michael KurlandMaster of Chaos by Michael MoorcockSeven Drops of Blood by Robert WeinbergTo Become a Sorcerer by Darrell SchweitzerNo. 252 Rue M. le Prince by Ralph Adams CramThe Bones of the Earth by Ursula K. Le GuinThe Closed Window by A.C. BensonDisillusioned by Lawrence Schimel and Mike ResnickIn the Realm of Dragons by Esther M. FriesnerForever by Tim LebbonThe Wizard of Ashes and Rain by David SandnerThe Walker Behind by Marion Zimmer BradleyThe Last Witch by James BibbyLast Rites by Louise CooperThe Eternal Altercation by Peter Crowther",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Unfinished",
    "Horror",
    "Magic"
  ],
  "author": "Mike Ashley",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/60159.The_Mammoth_Book_of_Sorcerers_Tales_"
}