{
  "title": "Amanda Gorman",
  "description": "In this book from the critically acclaimed, multimillion-copy bestselling Little People, BIG DREAMS series, discover the incredible life of Amanda Gorman, America's astounding young poet and activist. From an early age, Little Amanda read everything she could get her hands on, from books to cereal boxes. Growing up with an auditory processing disorder and a speech impediment, Amanda had to work hard, but ultimately she took great strength from her experiences. After hearing her teacher read aloud to the class, she knew that she wanted to become a poet, and nothing would stand in her way. At the age of 19, she became America's first-ever National Youth Poet Laureate. And, after performing her inspiring poem 'The Hill We Climb' at the Presidential Inauguration in January 2021, she became an icon across the world. This inspiring book features stylish and quirky illustrations and extra facts at the back, including a biographical timeline with historical photos and a detailed profile of the incredible young poet and activist’s life so far.Little People, BIG DREAMS is a bestselling series of books and educational games that explore the lives of outstanding people, from designers and artists to scientists and activists. All of them achieved incredible things, yet each began life as a child with a dream. This empowering series offers inspiring messages to children of all ages, in a range of formats. The board books are told in simple sentences, perfect for reading aloud to babies and toddlers. The hardback versions present expanded stories for beginning readers. Boxed gift sets allow you to collect a selection of the books by theme. Paper dolls, learning cards, matching games and other fun learning tools provide even more ways to make the lives of these role models accessible to children.Inspire the next generation of outstanding people who will change the world with Little People, BIG DREAMS!",
  "genres": [
    "Picture Books",
    "Nonfiction",
    "Biography",
    "Childrens",
    "Poetry",
    "Biography Memoir",
    "History"
  ],
  "author": "Maria Isabel Sanchez Vegara",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/60154754-amanda-gorman"
}