{
  "title": "Control: The Dark History and Troubling Present of Eugenics",
  "description": "How did an obscure academic idea pave the way to the Holocaust within just fifty years? Control is a book about eugenics, what geneticist Adam Rutherford calls \"a defining idea of the twentieth century.\" Inspired by Darwin's ideas about evolution, eugenics arose in Victorian England as a theory for improving the British population, and quickly spread to America, where it was embraced by presidents, funded by Gilded Age monopolists, and enshrined into racist American laws that became the ideological cornerstone of the Third Reich. Despite this horrific legacy, eugenics looms large today as the advances in genetics in the last thirty years—from the sequencing of the human genome to modern gene editing techniques—have brought the idea of population purification back into the mainstream. Eugenics has \"a short history, but a long past,\" Rutherford writes. The first half of Control is the history of an idea, from its roots in key philosophical texts of the classical world all the way into their genocidal enactment in the twentieth century. The second part of the book explores how eugenics operates today, as part of our language and culture, as part of current political and racial discussions, and as an eternal temptation to powerful people who wish to improve society through reproductive control. With disarming wit and scientific precision, Rutherford explains why eugenics still figures prominently in the twenty-first century, despite its genocidal past. And he confronts insidious recurring questions—did eugenics work in Nazi Germany? And could it work today?—revealing the intellectual bankruptcy of the idea, and the scientific impossibility of its realization.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Politics",
    "Sociology",
    "Race",
    "Eugenics"
  ],
  "author": "Adam Rutherford",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/60165430-control"
}