{
  "title": "The Fight for Privacy: Protecting Dignity, Identity, and Love in the Digital Age",
  "description": "Privacy is disappearing. From our sex lives to our workout routines, the details of our lives once relegated to pen and paper have joined the slipstream of new technology. As a MacArthur fellow and distinguished professor of law at the University of Virginia, acclaimed civil rights advocate Danielle Citron has spent decades working with lawmakers and stakeholders across the globe to protect what she calls intimate privacy—encompassing our bodies, health, gender, and relationships. When intimate privacy becomes data, corporations know exactly when to flash that ad for a new drug or pregnancy test. Social and political forces know how to manipulate what you think and who you trust, leveraging sensitive secrets and deepfake videos to ruin or silence opponents. And as new technologies invite new violations, people have power over one another like never before, from revenge porn to blackmail, attaching life-altering risks to growing up, dating online, or falling in love.A masterful new look at privacy in the twenty-first century, The Fight for Privacy takes the focus off Silicon Valley moguls to investigate the price we pay as technology migrates deeper into every aspect of our lives: entering our bedrooms and our bathrooms and our midnight texts; our relationships with friends, family, lovers, and kids; and even our relationship with ourselves.Drawing on in-depth interviews with victims, activists, and advocates, Citron brings this headline issue home for readers by weaving together visceral stories about the countless ways that corporate and individual violators exploit privacy loopholes. Exploring why the law has struggled to keep up, she reveals how our current system leaves victims—particularly women, LGBTQ+ people, and marginalized groups—shamed and powerless while perpetrators profit, warping cultural norms around the world.Yet there is a solution to our toxic relationship with technology and privacy: fighting for intimate privacy as a civil right. Collectively, Citron argues, citizens, lawmakers, and corporations have the power to create a new reality where privacy is valued and people are protected as they embrace what technology offers. Introducing readers to the trailblazing work of advocates today, Citron urges readers to join the fight. Your intimate life shouldn’t be traded for profit or wielded against you for power: it belongs to you. With Citron as our guide, we can take back control of our data and build a better future for the next, ever more digital, generation.",
  "genres": [
    "Nonfiction",
    "Technology",
    "Science",
    "Audiobook",
    "Law",
    "Sociology",
    "Womens"
  ],
  "author": "Danielle Keats Citron",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/60165396-the-fight-for-privacy"
}