{
  "title": "This Is What It Sounds Like: What the Music You Love Says About You",
  "description": "This Is What It Sounds Like is a journey into the science and soul of music that reveals the secrets of why your favorite songs move you. But it’s also a story of a musical trailblazer who began as a humble audio tech in Los Angeles to became Prince’s chief engineer for Purple Rain, and then create other No. 1 hits (including Barenaked Ladies' \"One Week\") as one of the most successful female record producers of all time.Now an award-winning professor of cognitive neuroscience, Susan Rogers leads readers to musical self-awareness. She explains that we each possess a unique “listener profile” based on our brain’s natural response to seven key dimensions of any song. Are you someone who prefers lyrics or melody? Do you like music “above the neck” (intellectually stimulating), or “below the neck” (instinctual and rhythmic)? Whether your taste is esoteric or mainstream, Rogers guides readers to recognize their musical personality, and offers language to describe one's own unique taste. Like most of us, Rogers is not a musician, but she shows that all of us can be musical—simply by being an active, passionate listener.While exploring the science of music and the brain, Rogers also takes us behind the scenes of record-making, using her insider’s ear to illuminate the music of Prince, Frank Sinatra, Kanye West, Lana Del Rey, and many others. She shares records that changed her life, contrasts them with those that appeal to her coauthor and students, and encourages you to think about the records that define your own identity.Told in a lively and inclusive style, This Is What It Sounds Like will refresh your playlists, deepen your connection to your favorite artists, and change the way you listen to music.",
  "genres": [
    "Nonfiction",
    "Music",
    "Science",
    "Audiobook",
    "Psychology",
    "Art",
    "History"
  ],
  "author": "Susan Rogers",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/60165381-this-is-what-it-sounds-like"
}