{
  "title": "Orchid Muse: A History of Obsession in Fifteen Flowers",
  "description": "The epitome of floral beauty, orchids have long fostered works of art, tales of adventure, and scientific discovery. Tenacious plant hunters have traversed continents to collect rare specimens; naturalists and shoguns have marveled at orchids’ seductive architecture; royalty and the smart set have adorned themselves with their allure. In Orchid Muse, historian and home grower Erica Hannickel gathers these bold tales of the orchid-smitten throughout history, while providing tips on cultivating the extraordinary flowers she features.Consider Empress Eugenie and Queen Victoria, the two most powerful women in nineteenth-century Europe, who shared a passion for Coelogyne cristata, with its cascading, fragrant white blooms. John Roebling, builder of the Brooklyn Bridge, cultivated thousands of orchids and introduced captivating hybrids. Edmond Albius, an enslaved youth on an island off the coast of Madagascar, was the first person to hand-pollinate Vanilla planifolia, leading to vanilla’s global boom. Artist Frida Kahlo was drawn to the lavender petals of Cattleya gigas and immortalized the flower’s wilting form in a harrowing self-portrait, while more recently Margaret Mee painted the orchids she discovered in the Amazon to advocate for their conservation.The story of orchidomania is one that spans the globe, transporting readers from the glories of the palace gardens of Chinese Empress Cixi to a seedy dime museum in Gilded Age New York’s Tenderloin, from hazardous jungles to the greenhouses and bookshelves of Victorian collectors. Lush and inviting, with radiant full-color illustrations throughout, Orchid Muse is the ultimate celebration of our enduring fascination with these beguiling flowers.",
  "genres": [
    "Nonfiction",
    "History",
    "Gardening",
    "Nature",
    "Science",
    "Travel",
    "Audiobook"
  ],
  "author": "Erica Hannickel",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/60165388-orchid-muse"
}