{
  "title": "The Prince & the Apocalypse",
  "description": "An American teen stranded in London is forced to team up with the British crown prince if she wants to make it back home before the end of the world in this delightfully rompy high-stakes rom-com.Wren Wheeler has flown five thousand miles across the ocean to discover she’s the worst kind of traveler: the kind who just wants to go home. Her senior-year trip to London was supposed to be life-changing, but by the last day, Wren’s perfectly-planned itinerary is in tatters. There's only one item left to check off: breakfast at The World’s End restaurant. The one thing she can still get right.The restaurant is closed for renovations—of course—but there's a boy there, too. A very cute boy with a posh British accent who looks remarkably like the errant Prince Theo, on the run from the palace and his controlling mother. When Wren helps him escape a pack of tourists, the Prince scribbles down his number and offers her one favor in return. She doesn’t plan to take him up on it—until she gets to the airport and sees cancelled flights and chaos. A comet is approaching Earth, and the world is ending in eight days. Suddenly, that favor could be her only chance to get home to her family before the end of the world.Wren strikes a bargain with the runaway prince: if she’ll be his bodyguard from London to his family’s compound in Santorini, he can charter her a private jet home in time to say goodbye. Traveling through Europe by boat, train, and accidentally stolen automobile, Wren finds herself drawn to the dryly sarcastic, surprisingly vulnerable Theo. But the Prince has his own agenda, one that could derail both their plans. When life as they know it will be over in days, is it possible to find a happy ending?",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Dystopia",
    "Audiobook",
    "Contemporary Romance"
  ],
  "author": "Kara McDowell",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/60171963-the-prince-the-apocalypse"
}