{
  "title": "The Complete Oz",
  "description": "BEFORE NARNIA...BEFORE MIDDLE EARTH...BEFORE HOGWARTS...THERE WAS OZThe Wizard of Oz: A Polychrome Omnibus is a collection of five novels featuring everyone's favorite daughter of the Rainbow - Polychrome.In The Road to Oz (1909), L. Frank Baum introduces us to the Rainbow's Daughter. Along with Dorothy, Button Bright and the Shaggy man, Polychrome must make her way through a wonderous series of magical lands in order to reach the Emerald City in time for Ozma's birthday party.Then, in Sky Island (1912) Polychrome comes to the assistance of Button Bright, Trot and Cap'n Bill when a magical umbrella whisks them to a fantastic yet dangerous land in the sky.Polychrome makes her third appearance in Tik Tok of Oz (1914), joining her old friend the Shaggy Man and new friends like Betsy Bobbin and Queen Ann Soforth in the exciting search for Shaggy's long-lost brother.In The Tin Woodman of Oz (1918) Polychrome helps Nick Chopper and the Scarecrow search for the Woodman's lost love - a woman the Tin Man hasn't seen since before Dorothy found him rusted in the forest and rescued him.Finally, in Rainbow's Emissary (2011) Mike LaMontagne gives us a Polychrome that is faithful to Baum's vision while at the same time written in an exciting style that will appeal to the Harry Potter Generation. Polychrome has returned to the Emerald City with a warning for Dorothy. The Sky Fairy's cousin has descended upon Oz and he's picking up where the Wicked Witch of the West left off. He's stolen her magics. He's rebuilt her armies. He wants revenge and he doesn't care if he has to destroy all of Oz to get it. With the help of Dorothy, the Scarecrow, the Cowardly Lion and the Hungry Tiger, Polychrome must rescue the Tin Man and stop her cousin before time runs out.",
  "genres": [
    "Fantasy",
    "Classics",
    "Fiction",
    "Childrens",
    "Adventure",
    "Young Adult",
    "Literature"
  ],
  "author": "L. Frank Baum",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/60166.The_Complete_Oz"
}