{
  "title": "Survival of the Richest: Escape Fantasies of the Tech Billionaires",
  "description": "The tech elite have a plan to survive the apocalypse: they want to leave us all behind.Five mysterious billionaires summoned theorist Douglas Rushkoff to a desert resort for a private talk. The topic? How to survive the “Event”: the societal catastrophe they know is coming. Rushkoff came to understand that these men were under the influence of The Mindset, a Silicon Valley–style certainty that they and their cohort can break the laws of physics, economics, and morality to escape a disaster of their own making—as long as they have enough money and the right technology.In Survival of the Richest, Rushkoff traces the origins of The Mindset in science and technology through its current expression in missions to Mars, island bunkers, AI futurism, and the metaverse. In a dozen urgent, electrifying chapters, he confronts tech utopianism, the datafication of all human interaction, and the exploitation of that data by corporations. Through fascinating characters—master programmers who want to remake the world from scratch as if redesigning a video game and bankers who return from Burning Man convinced that incentivized capitalism is the solution to environmental disasters—Rushkoff explains why those with the most power to change our current trajectory have no interest in doing so. And he shows how recent forms of anti-mainstream rebellion—QAnon, for example, or meme stocks—reinforce the same destructive order.This mind-blowing work of social analysis shows us how to transcend the landscape The Mindset created—a world alive with algorithms and intelligences actively rewarding our most selfish tendencies—and rediscover community, mutual aid, and human interdependency. In a thundering conclusion, Survival of the Richest argues that the only way to survive the coming catastrophe is to ensure it doesn’t happen in the first place.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Economics",
    "Technology",
    "Audiobook",
    "Sociology",
    "Business"
  ],
  "author": "Douglas Rushkoff",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/60165391-survival-of-the-richest"
}