{
  "title": "The Sylvia Browne Book Collection: Boxed Set Includes Sylvia Browne's Book of Angels, If You Could See What I See, and Secrets & Mysteries of the World",
  "description": "Sylvia Browne’s Book of AngelsSylvia talks about her personal experiences with angels, presents extensive research on the subject, and offers heartwarming stories by numerous contributors.Today, as the nightly news reports one disaster after another, books, TV shows, and movies are filled with tales of angels. Is it mere coincidence, or are angels making their presence more actively known? In these chaotic times, this work makes sense of it all—offering us reassuring messages from these beings of light who surround us each day. Secrets & Mysteries of the Worldusing a combination of information from her spirit guide Francine as well as her own incredible psychic powers, Sylvia augments current scientific research to provide us with detailed explanations about seemingly inexplicable concepts. From the Great Pyramid to Stonehenge, Sylvia reveals amazing facts about some of the world’s most mysterious sites. The truth behind sacred and controversial topics such as the Shroud of Turin, the Holy Grail, and the lost years of Jesus are also brought to light; and fascinating and mystifying subjects such as crop circles, vampires, voodoo, Atlantis, extraterrestrials, Easter Island, and many more are examined and clarified.Sylvia tears away the obscure and timeworn explanations that hide the underlying truths about these phenomena, taking us on a fabulous journey that unlocks the secrets and mysteries that surround us in this \"wonder-full\" world. If You Could See What I SeeThis enlightening book contains the Gnostic tenets of Sylvia’s church, the Society of Novus Spiritus, and is a map of our charts—regardless of what spiritual path we follow.It has taken many years of research to put together this information, but as we go deeper, we can see that this book carries within it the very heart of humankind’s search for our own spirituality. Sylvia has also included many details from her own personal journey, which she feels is comparable to the quest that each of us follows to find our own God-center. As we travel on this road, we can realize that long-forgotten yet inherent goal of viewing our life on Earth as our path to God.",
  "genres": [],
  "author": "Sylvia Browne",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/601773.The_Sylvia_Browne_Book_Collection"
}