{
  "title": "Rebel Magic",
  "description": "A Fast Urban Fantasy Series with a Badass Female Bounty HunterMy name is Rebel Weston and I'm going to hunt you down...My talent for tracking has made me a damn good bounty hunter for the past decade, but it's also gotten me solidly under the thumb of notorious casino boss, Kai Warcloud.I need to break free before I kill him or he kills me. The solution? I have to help Kai track down the notorious con artist Laurent Moreau from Texas to New Orleans and drag him back to pay his debts. Just one last job... and I'm finally free.The catch? Moreau looks like an angel but has the soul and fangs of a vampire with an entourage of bloodthirsty friends to match. Until I catch him, Kai is happy to use my brother as leverage.But I have an edge: I'm a Spirit Walker, able to commune with the dead. Since vamps are already halfway there, this should be a piece of cake, right?WRONG.It's one hell of a leap to go from bail bonds and bounties to dragging supernaturals back to Texas on the back of a chain, but I'm up for it. My back may be against the wall, but I'm the kind of girl who comes out swinging.Ready for a fast, fun adventure with a snarky heroine who doesn't pull punches? This one's for you. This is BOOK 1 in an episodic/serialized urban fantasy with new books coming out each month! So go ahead.... binge a little.Perfect for fans of K.F. Breene, Ilona Andrews, Patricia Briggs, Devon Monk, Seana Kelly, Michael Anderle, Shannon Mayer, Annette Marie, BR Kingsolver, and Debra Dunbar.The Rebel Magic series features action, magic, mystery deep in the heart of New Orleans. If you're a fan of vampires, werewolves, witches, demons, mages, and love a hint of romance, this these stories are for you!",
  "genres": [
    "Urban Fantasy",
    "Vampires",
    "Fantasy",
    "Magic",
    "Paranormal",
    "Witches",
    "Ghosts"
  ],
  "author": "Alex    Fox",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/60169150-rebel-magic"
}