{
  "title": "The Cowboy",
  "description": "The hunky cowboy roars into my life and turns things upside down but I won’t go down without a fight.\nIs he smoking hot? Heck yes.Does staring at his muscular body make my girly parts sing? Oh, yes.Does the arrogant jerk make my blood boil? You know it.Did he step into my floral shop and steal my heart? I’m trying to ignore that little tidbit.So why am I making him work for it? Because I refuse to roll over and let the big jerk have his way without a little fight. He’s going to have to put in the effort to win me.If the hot, wealthy biker is going to catch me, he’s going to have to learn a few lessons along the way.\nThe little sassy-pants florist is going to run me insane. \nDo I have time to chase after her? No way. Between my club and my busy ranch, I’m catching myself coming and going.Does that matter to my heart? Not in the least. The first time I laid eyes on the curvy little doll, she owned me. Lock, stock and barrel.Am I going to let a rival club hurt the only woman I’ll ever love? Not in this lifetime.Kyra might want to fight what’s happening between us but there’s no way I’ll let my soulmate slip through my fingers. After I prove to her how good things can be between us, I’ll tie my curvy little sassy-pants to me for life.These wealthy Texans have it all—Money, looks, power, their MC and brothers. The only thing missing is someone to share it all with. There’s a shortage of eligible ladies in town but these determined men won’t let that slow them down. These MC brothers are going to turn the town of Silver Spoon Falls, Texas, on its ear looking for their curvy, soulmates.Nichole Rose and Loni Ree are bringing you the Silver Spoon MC Series and these aren’t your typical MC romance stories. Nichole and Loni like to keep things light. Come along with us on this wild instalove ride.",
  "genres": [
    "Romance",
    "Westerns",
    "Contemporary Romance",
    "Novella",
    "Contemporary",
    "Short Stories"
  ],
  "author": "Loni Ree",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/60169072-the-cowboy"
}