{
  "title": "The Discovery of Magic",
  "description": "Welcome to Elementals Academy, where magic is the only hope of survival, forbidden romance beckons, and an ancient secret threatens to end it all.Summer Donovan thinks paying her way through her expensive private college is her biggest problem.She's about to find out how wrong she is.Because when the president of the most exclusive sorority on campus goes off the rails and bullies her, Summer defends herself with something she never knew she had.Magic.It turns out she's a witch. But that's only the start of the surprises in store for her.Soon after her magical breakthrough, Summer learns she's destined to attend Elementals Academy-an exclusive school dedicated to witches descended from the Greek gods.At Elementals Academy, Summer finally finds the thing she's wanted her whole life: a place where she fits in. Although that doesn't last long, thanks to her magic not working the way it's supposed to, and no one knowing why.But her biggest challenge isn't schoolwork. Or magic. It's Zane Caldwell-the iciest, most attractive, and most mysterious student at the school. Despite the way Zane's warm to her one minute and cold the next, Summer feels an irresistible draw to him.While struggling to understand her feelings for Zane, Summer soon discovers she has another problem-one far more dangerous. There are secrets lurking within the hallowed halls of Elementals Academy, and she may hold the key to unraveling them. If she can survive long enough... and figure out who to trust.Praise for the Elementals series: \"A must read!\"-USA Today\"Michelle Madow has a flair for keeping you enthralled, no matter what your age.\"-Robert Schofield, Amazon Reviewer\"Elementals is one of the best in the YA genre!\"-Ziggy, Amazon Reviewer\"Michelle Madow dares to refresh our views on magic and storytelling.\"-Dave Wilson, Amazon Reviewer\"Watch out, Percy Jackson! The Elementals are on the rise.\"-DebBlove, Amazon ReviewerBegin the long-anticipated series by USA Today bestselling author Michelle Madow-an adventure full of magic, romance, and mythology that's perfect for fans of Harry Potter and Percy Jackson.",
  "genres": [
    "Fantasy",
    "Magic",
    "Romance",
    "Young Adult",
    "Paranormal",
    "Mythology",
    "Urban Fantasy"
  ],
  "author": "Michelle Madow",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/60184977-the-discovery-of-magic"
}