{
  "title": "Eternal Temptation",
  "description": "Alternate/new cover for ASIN B005UGCD9UFierce, troubled brother, Darien Kategan now leads his life in solitude. Shut off from his family, he lives only in a past that haunts his every breathing moment. But on the path to recover himself and move on with his life, he finds a woman hurt on his land. Something about this woman will not allow him to walk away. Instead he takes her in, even against his better judgment.A woman running from a horrible secret, Cassie Wilks has no place to run to and no family to help her. When she passes out on a troubled lykaen’s land, she decides she wants to learn more about this dark giant of a man. But time ticks by, bringing her dangerous secret closer and closer. Her attraction to the dark lykaen brings sensual passion into play and brings forth new experiences for both of them. As Cassie’s secret draws near, her passion pushes Darien to release his demons and embrace love. But will Darien be able to accept Cassie’s salvation before time is up?-------------Excerpt-------------She searched his eyes and tried to read his thoughts. His eyes were dark but with anger or was it something else? She wished she knew.“Sorry,” she mumbled and started to scoot back to her seat. Hard, strong hands grabbed her. Her eyes shot to his and she had no choice but to move closer to him. His eyes were no longer dark, they smoldered. He didn’t stop dragging her until she was half in his big lap.“You have no idea what you mess with,” he growled and then he slammed his mouth down on hers.Other Books Available By T. A. Grey:-Breeding Cycle: The Kategan Alphas 1-Dark Awakening: The Kategan Alphas 2-Wicked Surrender: The Kategan Alphas 3-Eternal Temptation: The Kategan Alphas 4-Midnight Sex Shop-Capturing Jeron -Chains of Frost: The Bellum Sisters 1-Bonds of Fire: The Bellum Sisters 2-One Last Chance-Evernight Romance Anthology",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters",
    "Werewolves",
    "Vampires",
    "Erotica",
    "Romance"
  ],
  "author": "T.A. Grey",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/12855659-eternal-temptation"
}