{
  "title": "Loving the Dead and Gone",
  "description": "A freak car crash in 1960s rural North Carolina puts in motion moments of grace that bring redemption to two generations of women and the lives they touch. A Mariel Hemingway Book Club pick, LOVING THE DEAD AND GONE won the 2023 Independent Publisher Book Awards Gold Medal in Southern Regional Fiction. The North Carolina Society of Historians recognized the novel with the 2023 Historical Novel Award. Shortlisted for the 2023 Eric Hoffer Book Awards Grand Prize, the book was also honorable mention in General Fiction and finalist for the First Horizon Award for Debut Fiction. For forty years Aurilla Cutter has tended a clutch of secrets that have turned her mean. A fatal accident becomes the catalyst for the release of the passions, needs, and hurts in everyone affected by her hidden past. Darlene, a seventeen-year-old widow, struggles to reconnect with her dead husband while proving herself still alive. Soon loss and death work their magic, drawing Darlene into an unlikely affair that threatens to upend Aurilla’s family, and sets loose Aurilla’s own memories of longing and infidelity.As Aurilla’s forbidden and heartbreaking story of love, death, and repeated loss alternates with Darlene’s, the divide of generations and time narrows and collapses, building to the unlikely collision of two women’s yearnings, which will free them both from the past. Loving the Dead and Gone is a lyrical novel that explores how both grief and love are the ties that bind. Jill McCorkle, author of Hieroglyphics, says \"Loving the Dead and Gone is a rich and skillfully rendered portrait of a place that explores the generational effects of love and loss and the fragile connections within a family. Judith Turner-Yamamoto gives us a complex and memorable cast of characters and a vivid setting filled with stunning detail.” Margot Livesey, Author of The Boy in The Field, says, “How well Turner-Yamamoto understands the complexities of passion, the necessity of work, and the limits of small towns. This beautifully written novel, with its complicated, stubborn characters, will haunt you long after the last page.” Gina Millsap, library consultant and former CEO, Topeka & Shawnee County Public Library, says, “Beautifully written, fully developed characters, and a compelling story from the first page. I’m convinced Loving the Dead and Gone will engage many readers, excite book club members, and that the quality of the writing will impress reviewers. A must purchase for public libraries.”",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Historical",
    "Southern"
  ],
  "author": "Judith Turner-Yamamoto",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/60182427-loving-the-dead-and-gone"
}