{
  "title": "Calling for a Blanket Dance",
  "description": "Winner of the PEN America/Hemingway Award for Debut Novel * Finalist for the 2023 Aspen Words Literary Prize * Finalist for the L.A. Times Book Prize/Art Seidenbaum Award for First Fiction  “A profound reflection on the intergenerational nature of cultural trauma… Hokeah’s characters exist at the intersection of Kiowa, Cherokee and Mexican identity, which provides a vital exploration of indigeneity in contemporary American letters.” —The New York Times Book ReviewA moving and deeply engaging novel about a young Native American man as he learns to find strength in his familial identity. ​ Oscar Hokeah’s electric debut takes us into the life of Ever Geimausaddle, whose family—part Mexican, part Native American—is determined to hold onto their community despite obstacles everywhere they turn. Ever’s father is injured at the hands of corrupt police on the border when he goes to visit family in Mexico, while his mother struggles both to keep her job and care for her husband. And young Ever is lost and angry at all that he doesn’t understand, at this world that seems to undermine his sense of safety. Ever’s relatives all have ideas about who he is and who he should be. His Cherokee grandmother, knowing the importance of proximity, urges the family to move across Oklahoma to be near her, while his grandfather, watching their traditions slip away, tries to reunite Ever with his heritage through traditional gourd dances. Through it all, every relative wants the to remind Ever of the rich and supportive communities that surround him, there to hold him tight, and for Ever to learn to take the strength given to him to save not only himself but also the next generation. How will this young man visualize a place for himself when the world hasn’t made room for him to start with? Honest, heartbreaking, and ultimately uplifting, Calling for a Blanket Dance is the story of how Ever Geimausaddle finds his way home. \"STUNNING.\" —Susan Power, author of The Grass Dancer",
  "genres": [
    "Fiction",
    "Indigenous",
    "Native American",
    "Literary Fiction",
    "Contemporary",
    "Historical Fiction",
    "Audiobook"
  ],
  "author": "Oscar Hokeah",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/60185868-calling-for-a-blanket-dance"
}