{
  "title": "Stiker Kota",
  "description": "“Stiker di ruang publik barangkali adalah ungkapan paling polos tentang manusia, dari beragama hingga bersenggama. Buku ini wajib bagi yang ingin tahu dorongan dasar penghuni kota.”— Ayu Utami, novelis“Kerja mengumpulkan stiker kota ini seperti memulung yang terbuang dan tak dipedulikan, tapi sesungguhnya menjadi penanda ingatan bersama tentang kota. Sebuah sumbangan besar, bukan hanya pada khazanah seni grafis, tapi juga sejarah sosial Jakarta.”— Hilmar Farid, dosen Fakultas Ilmu Budaya, Universitas Indonesia ---ANDA masih ingat dengan stiker-stiker seperti stiker Soekarno, Iwan Fals, stiker bergambar elang “Highway Patrol”, kepala macan “Tiger”, bayi gemuk “No Problem” sampai “Gadis Jujur” berambut tajam? Atau stiker seperti “Bebas tapi Sopan” atau “Yang Cakep Duduk di Muka (Dekat Mas Sopir)”? Stiker kota marak sejak 1970-an di berbagai kota besar di Indonesia. Ia ada di mana-mana: tertempel di angkutan umum, mobil, motor, pintu rumah, dan bahkan selalu hidup dalam kenangan masa kecil kita. Bagaimana fenomena ini berkembang dan apa yang kemudian terlihat dari perubahan stiker ini seiring pertumbuhan kota besar dan perubahan masyarakat kota? Ditulis dalam dua bahasa, Indonesia dan Inggris, buku ini diterbitkan oleh Divisi Penelitian & Pengembangan dari ruangrupa, sebuah organisasi seni rupa kontemporer di Jakarta. Selain membahas fenomena stiker kota, buku ini juga memuat ribuan stiker dari berbagai era dalam halaman warna, serta sejumlah foto yang menunjukkan betapa stiker sangat lekat dalam kehidupan masyarakat di kota-kota besar.---“Sebuah kajian menarik, yang selama ini dilupakan karena dianggap remeh-temeh dan tidak penting, yang memaksa kita untuk memikirkan kembali apa makna budaya rakyat.”— Antariksa, peneliti pada KUNCI Cultural Studies Center, Yogyakarta“Ide yang menarik dan kuat. Sebuah usaha mengabadikan ingatan di zaman yang serba singkat dan padat. Saya terbayang usaha keras mengumpulkannya...”— Herry Nurdi, pemimpin redaksi Sabili",
  "genres": [
    "Indonesian Literature"
  ],
  "author": "Ugeng T. Moetidjo",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/6018111-stiker-kota"
}