{
  "title": "Black Cloud Rising",
  "description": "Already excerpted in the New Yorker, Black Cloud Rising is a compelling and important historical novel that takes us back to an extraordinary moment when enslaved men and women were shedding their bonds and embracing freedomBy fall of 1863, Union forces had taken control of Tidewater Virginia, and established a toehold in eastern North Carolina, including along the Outer Banks. Thousands of freed slaves and runaways flooded the Union lines, but Confederate irregulars still roamed the region. In December, the newly formed African Brigade, a unit of these former slaves led by General Edward Augustus Wild—a one-armed, impassioned Abolitionist—set out from Portsmouth to hunt down the rebel guerillas and extinguish the threat.From this little-known historical episode comes Black Cloud Rising, a dramatic, moving account of these soldiers—men who only weeks earlier had been enslaved, but were now Union infantrymen setting out to fight their former owners. At the heart of the narrative is Sergeant Richard Etheridge, the son of a slave and her master, raised with some privileges but constantly reminded of his place. Deeply conflicted about his past, Richard is eager to show himself to be a credit to his race. As the African Brigade conducts raids through the areas occupied by the Confederate Partisan Rangers, he and his comrades recognize that they are fighting for more than territory. Wild’s mission is to prove that his troops can be trusted as soldiers in combat. And because many of the men have fled from the very plantations in their path, each raid is also an opportunity to free loved ones left behind. For Richard, this means the possibility of reuniting with Fanny, the woman he hopes to marry one day.With powerful depictions of the bonds formed between fighting men and heartrending scenes of sacrifice and courage, Black Cloud Rising offers a compelling and nuanced portrait of enslaved men and women crossing the threshold to freedom.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Civil War",
    "War",
    "Race",
    "Historical",
    "Literary Fiction"
  ],
  "author": "David Wright Faladé",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/60185269-black-cloud-rising"
}