{
  "title": "A Billion Years: My Escape From a Life in the Highest Ranks of Scientology",
  "description": "One of the highest-ranking defectors from Scientology exposes the secret inner workings of the powerful organization in this remarkable memoir.Mike Rinder’s parents began taking him to their local Scientology center when he was five years old. After high school, he signed a billion-year contract and was admitted into Scientology’s elite inner circle, the Sea Organization. Brought to founder L. Ron Hubbard’s yacht and promised training in Hubbard’s most advanced techniques, Mike was instead put to work swabbing the decks.Still, Rinder bought into the doctrine that his personal comfort was secondary to the higher purpose of Hubbard’s world-saving mission, swiftly rising through the ranks. In the 1980s, Rinder became Scientology’s international spokesperson and the head of its powerful Office of Special Affairs. He helped negotiate Scientology’s pivotal tax exemption from the IRS and engaged with the organization’s prominent celebrity members, including Tom Cruise, Lisa Marie Presley, and John Travolta.Yet Rinder couldn’t shake a nagging feeling that something was amiss—Hubbard’s promises remained unfulfilled at his death, and his successor, David Miscavige, was a ruthless and vindictive man who did not hesitate to confine many top Scientologists, Mike among them, to a makeshift prison known as the Hole.In 2007, at the age of fifty-two, Rinder finally escaped Scientology. Overnight, he became one of the organization’s biggest public enemies. He was followed, hacked, spied on, and tracked. But he refused to be intimidated and today helps people break free of Scientology.In A Billion Years, the dark, dystopian truth about Scientology is revealed as never before. Rinder offers insights into the religion that only someone of his former high rank could provide and tells a harrowing but fulfilling story of personal resilience.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Biography",
    "Cults",
    "Religion",
    "True Crime"
  ],
  "author": "Mike Rinder",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/60209478-a-billion-years"
}