{
  "title": "Black Women Will Save the World: An Anthem",
  "description": "In this long-overdue celebration of Black women’s resilience and unheralded strength, the revered, trailblazing White House correspondent reflects on “The Year That Changed Everything”—2020—and African-American women’s unprecedented role in upholding democracy. “I am keenly aware that everyone and everything has a story,” April D. Ryan acknowledges. “Also, I have always marveled at Black women and how we work to move mountains and are never really thanked or recognized.” In Black Women Will Save the World, she melds these two truths, creating an inspiring and heart-tugging portrait of one of the momentous years in America, 2020—when America elected its first Black woman Vice President—and celebrates the tenacity, power, and impact of Black women across America. From the beginning of the nation to today, Black women have transformed their pain into progress and have been at the frontlines of the nation’s political, social, and economic struggles. These “Sheroes” as Ryan calls them, include current political leaders such as Maxine Waters, Valerie Jarrett, and Kamala Harris; LaTosha Brown, and other activists. Combining profiles and in-depth interviews with these influential movers and shakers and many more, Ryan explores the challenges Black women endure, and how the lessons they’ve learned can help us shape our own stories. Ryan also chronicles her personal journey from working-class Baltimore to the elite echelons of journalism and speaks out about the hurdles she faced in becoming one of the most well-connected members of the Washington press corps—while raising two daughters as a single mother in the aftermath of a messy divorce. It is time for everyone to acknowledge Black women’s unrivaled contributions to America. Yet our democracy remains in peril, and their work is far from done. Black Women Will Save the World presents a vital kaleidoscopic look at women of different ages and from diverse backgrounds who devote their lives to making the world a better place—even if that means stepping out of their “place.”",
  "genres": [
    "Nonfiction",
    "Race",
    "History",
    "Womens",
    "Politics",
    "Feminism",
    "Audiobook"
  ],
  "author": "April Ryan",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/60204282-black-women-will-save-the-world"
}