{
  "title": "Waves of Hope",
  "description": "Book #1 from the series: The Sanderling Cove Inn<>/i>🎧Listening Length = 8 hours and 30 minutesHope and determination can bring results…Ellie Weatherby and the four other grandmothers living at Sanderling Cove decide with only two great-grandchildren, it’s time to swing into action. They invite their grandchildren to spend the summer at the cove, hoping to encourage romance between them. Ellie invites all three of her granddaughters to take over the management of the Sanderling Cove Inn so that she and her bridegroom can spend the time traveling in Europe for their honeymoon.Charlotte Bradford, Olivia Winters, and Brooke Weatherby are all at a point in their lives where they have the time to do as she asks. For Charlotte, it’s an excuse to leave her marketing career and life in New York City. After realizing her partner was never going to step up and do her share of work, Livy has just sold her bakery store in Virginia. Brooke is more than eager to leave her job as an accountant in upstate New York and, more importantly, escape the lonely life of keeping an eye on her mother who suffers from fibromyalgia and depression.When Shane Ensley is sailing with Charlotte and another “cove kid”, Eric Simon, the boom knocks him into the water unconscious. When Charlotte rescues him, it changes everything for them. And starts the summer exactly as the grandmothers had hoped.Grandmothers can be very determined when it comes to seeing their grandchildren happy. A family saga full of love. Be sure to read all the books in the series – Waves of Hope, Sandy Wishes, Salty Kisses.Another of Judith Keim’s series books celebrating love and families, strong women meeting challenges, and clean women’s fiction with a touch of romance—beach reads for all ages with a touch of humor, satisfying twists, and happy endings. Be sure to check out her other delightful books and series that readers adore.",
  "genres": [
    "Romance",
    "Fiction",
    "Audiobook",
    "Womens Fiction"
  ],
  "author": "Judith Keim",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/60196670-waves-of-hope"
}