{
  "title": "Angel's Bend",
  "description": "“A compelling story, I literally couldn’t put it down.” ~ Author Michelle Dennis“I really enjoyed reading Angel's Bend, a story about a small town with a dark underbelly. L.A Dale's talent is for character and the main character here, Lacy, has a strong and engaging voice.” ~ Reviewer Tahlia Newland“Again L.A has produced something different. A YA paranormal story, this is far from the woman's fiction that Dale usually writes but what a delight Angels Bend is!” ~ #1 Bestselling author of Spoilt, Joanne Ellis.Two lovers… a difficult choice …. a secret long buried.When 17 year old, Lacey Green arrives in Angel’s Bend to live with her aunt, all she wants to do is work hard and finish high school. The past year hasn’t been that great for Lacey, she’s failed her exams and driven her father to despair with her wild behaviour. A stint in Angel’s bend is her last hope at getting her life back on track.But everything is not what it seems in the tiny town. A band of demons have immersed themselves in the community and they've been eagerly awaiting Lacey's arrival. For Lacey is to be the final part of the plan - one that will see Lucifer rise again to take over the world.Zac, the leader of a popular gang at school, can’t wait to make Lacey a member. Dark and charismatic, he has minions that emulate his every move and when he gazes at her with those eyes of his, Lacey feels a pull of attraction. She's just not sure she wants to give up her independence to be his girlfriend.Cam, the town outcast, appears to be stalking Lacey. With his shining halo of hair and alabaster skin, he's almost irresistible and he and Lacey soon strike up a friendship. But Cam has secrets he's afraid to let Lacey in on. He's been sent to protect her from the danger that’s heading her way. And Lacey doesn’t believe in the supernatural or the occult, so he has no idea how she’ll react.Then there’s Aunt Beth and Dad. Just what have they been keeping from Lacey all these years? And what does it have to do with the strange birthmark on her neck; the one that Cam says is Lucifer’s Mark.Lacey has until her 18th birthday to find a solution that will prevent her from becoming the next Satanic sacrifice. And the only person who can save her is the one she cant have.This is Book 1 of a series. The second book, Lucifer's Mark has been put on hold while the author recovers from serious illness and has an expected release in late 2014Check out L.A. Dale's other booksOr did you want to read something fun and witty? Try L.A Dale’s The Taming of the BastardWhat about a tale of love where you least expect it? The bestselling Perhaps... Perhapsshould fit the bill.For a tear-jerker you won’t be able to put down try L.A. Dale’s Heart of Glass",
  "genres": [],
  "author": "Lindy Dale",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/12856288-angel-s-bend"
}