{
  "title": "Ted and Ann: The Mystery of a Missing Child and Her Neighbor Ted Bundy",
  "description": "\"This is the ONLY book to read to learn the full story of the disappearance of Ann Marie Burr in August 1961. Fascinating!\" —Ann Rule, New York Times Bestselling Author\"While Ted Bundy might be the greatest evil enigma ever, author Rebecca Morris strips away the layers of the greatest mystery of his life—what was his connection to the disappearance of Ann Marie Burr? This is an astonishing achievement, the missing piece that readers of crime have long sought. Bravo for Morris!\" —Gregg Olsen, New York Times Bestselling AuthorAt age three he was using knives to frighten his teenage aunt. By fourteen he was a thief, animal abuser, and peeping tom who liked to pull little girls into the woods to scare them.Ted Bundy killed at least thirty-five girls and women, and possibly hundreds. Was his first victim eight-year-old Ann Marie Burr who disappeared from their Tacoma, Washington, neighborhood in 1961?Her body was never found and there were no clues, just two tenacious detectives who spent the rest of their lives trying to solve the case.Was Bundy telling the truth when he told a hypothetical story about killing Ann and dumping her into a muddy pit?With new information about Ted Bundy's childhood, interviews with those who knew him best, and the memories of the Burr family, Ted and Ann is the story of one the 20th century's most fascinating cold cases.Rebecca Morris is an award-winning journalist who has worked in radio and television news in New York City; Portland, Oregon; and Seattle, Washington. A native Oregonian, her reporting has appeared in The Seattle Times, The Oregonian, People, Entertainment Weekly, New York Newsday, American Theatre, and many other publications. She lives in Seattle.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Serial Killer",
    "Mystery",
    "Audiobook",
    "History"
  ],
  "author": "Rebecca  Morris",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/12856638-ted-and-ann"
}