{
  "title": "The Escape Artist: The Man Who Broke Out of Auschwitz to Warn the World",
  "description": "In a book that is part thrilling adventure, part exploration of some of the darkest secrets of the Holocaust, award-winning journalist and best-selling novelist Jonathan Freedland uncovers the extraordinary story of the first Jew to break out of Auschwitz, a man who was determined to warn the world—and pass on a truth too few were willing to hear.In April 1944, Rudolf Vrba became the first Jew to break out of Auschwitz—one of only four who ever pulled off that near-impossible feat. He did it to reveal the truth of the death camp to the world—and to warn the last Jews of Europe what fate awaited them at the end of the railway line. Against all odds, he and his fellow escapee, Fred Wetzler, climbed mountains, crossed rivers and narrowly missed German bullets until they had smuggled out the first full account of Auschwitz the world had ever seen—a forensically detailed report that would eventually reach Franklin Roosevelt, Winston Churchill and the Pope. And yet too few heeded the warning that Vrba—then just nineteen years old—had risked everything to deliver. Some could not believe it. Others thought it easier to keep quiet. Vrba helped save 200,000 Jewish lives—but he never stopped believing it could have been so many more. This is the story of a brilliant yet troubled man—a gifted “escape artist” who even as a teenager understand that the difference between truth and lies can be the difference between life and death, a man who deserves to take his place alongside Anne Frank, Oskar Schindler and Primo Levi as one of the handful of individuals whose stories define our understanding of the Holocaust.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Holocaust",
    "World War II",
    "Audiobook",
    "War"
  ],
  "author": "Jonathan Freedland",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/60194141-the-escape-artist"
}