{
  "title": "Aquarian Dawn",
  "description": "In the middle of the 1960s counterculture movement in the US, Ada--a lonesome teen forced by impending civil war to flee her native West African birthplace with her mother--discovers an ability to connect with nature spirits as she joins other nonconformist youth to become an activist for her homeland, then discovers family secrets that impact her destiny forever. Nigerian-American Ebele Chizea's debut young adult novel is perfect for fans of Ibi Zoboi, Chibundu Onuzo, and Chimamanda Ngozi Adichie.In the 1960s, Nabuka, a fictional Afrikan country is on the fringe of a civil war. The counterculture movement is gaining momentum in the United States, and teenage Ada has just relocated from sweltering Nabuka to the fictional small town of Greensberg, Pennsylvania with her elitist and overbearing mother. Ada is somewhat lonesome, but she has an uncanny ability to connect with nature spirits. Then comes Stacey, a boisterous hippie who ignites Ada's rebellious side, and Sal, a philosophical wanderlust who challenges Ada to share her inner world and surrender her heart. Will trauma and distance get in the way of their love?After the war, Ada drops out of college and returns to Nabuka to find answers about the identity of her birth father. While there, she discovers crippling secrets about her lineage and falls for Obinna, a charismatic Harvard educated man who has just built a counseling center for former child soldiers. But when Sal, now a Sociologist, ends up in Nabuka on a work assignment, and Obinna is arrested for treason, Ada is left to forge a new path that will impact her destiny forever.Author Ebele Chizea was born in Nigeria and moved to the United States at age sixteen. Since graduating with honors in 2004 from Thiel Colege in Greenville, PA, she has published fiction, poetry, and essays in various publications including The African, The Sentinel, The Nigerian Punch, Sahara Reporter, as well as her own online publication, Drumtide Magazine, which featured interviews with prominent figures in the entertainment and literary fields including Afro-punk pioneer Lunden DeLeon, afrobeat musician Seun Kuti, and award-winning Nigerian Belgian novelist, Chika Unigwe. She is the author of How to Slay in Life: A Book of Proverbial Wisdom. AQUARIAN DAWN is her debut novel. She lives in Santa Monica, CA.",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Historical",
    "Fiction"
  ],
  "author": "Ebele Chizea",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/60197222-aquarian-dawn"
}