{
  "title": "The Sewing Girl's Tale: The Sewing Girl's Tale: A Story of Crime and Consequences in Revolutionary America",
  "description": "New York Times\n Editors’ ChoiceWinner of the Bancroft PrizeWinner of the Francis Parkman Prize Winner of the Gotham Book PrizeWinner of the New York Society Library's New York City Book AwardJournal of the American Revolution Book of the YearWinner of the David J. Langum, Sr. Prize in American Legal History A riveting Revolutionary Era drama of the first published rape trial in American history and its long, shattering aftermath, revealing how much has changed over two centuries—and how much has notOn a moonless night in the summer of 1793 a crime was committed in the back room of a New York brothel—the kind of crime that even victims usually kept secret. Instead, seventeen-year-old seamstress Lanah Sawyer did what virtually no one in US history had done she charged a gentleman with rape. Her accusation sparked a raw courtroom drama and a relentless struggle for vindication that threatened both Lanah’s and her assailant’s lives. The trial exposed a predatory sexual underworld, sparked riots in the streets, and ignited a vigorous debate about class privilege and sexual double standards. The ongoing conflict attracted the nation’s top lawyers, including Alexander Hamilton, and shaped the development of American law. The crime and its consequences became a kind of parable about the power of seduction and the limits of justice. Eventually, Lanah Sawyer did succeed in holding her assailant accountable—but at a terrible cost to herself.Based on rigorous historical detective work, this book takes us from a chance encounter in the street into the sanctuaries of the city’s elite, the shadows of its brothels, and the despair of its debtors’ prison. The Sewing Girl's Tale shows that if our laws and our culture were changed by a persistent young woman and the power of words two hundred years ago, they can be changed again.Includes photographs",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "American History",
    "Crime",
    "Audiobook",
    "Feminism"
  ],
  "author": "John Wood Sweet",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/60212957-the-sewing-girl-s-tale"
}