{
  "title": "What's Age Got to Do With It?: Living Your Healthiest and Happiest Life",
  "description": "Though it's her husband, Dr. Phil, who has his own nationally-syndicated talk show, Robin McGraw's appearances on the show draw thousands of questions from viewers of all ages who want to know how she looks and feels so fabulous at the age of fifty-five. In What's Age Got to Do with it?, Robin shares her journey, including the ups and downs, and the secrets for staying healthy and in shape.She also provides insider information from a panel of top experts in the areas of Fitness, Nutrition, Skin Care, Menopause, Hair, Makeup, and Fashion.Robin says, \"To me, aging gracefully isn't accepting what aging does to you. It means taking care of your health, wanting to look your best, and knowing that it is not conceited, egotistical, or selfish to do so.\"All rights reserved. No portion of this book may be reproduced, stored in a retrieval system, or transmitted in any form or by any means---electronic, mechanical, photocopy, recording, or any other---except for brief quotation in printed reviews, without the prior written permission of the publisher.This publication is intended to provide authoritative information in regard to the subject matter covered. The publisher and author are not engaged in rendering medical or other professional services and do not have financial or commericial interest in any of the products, services, or professionals mentioned in this book. If you require medical advice or other expert assistance, you should seek the services of a competent professional.If you've had these or similar thoughts, you're not alone. Robin McGraw receives thousands of emails from women asking her what she does to look and feel so vibrant, energetic, and healthy at the age of fifty-five. It all started back in Robin's twenties and thirties when pivotal moments made her realize that if she did not put her health and well-being first, no one else would. In her early thirties, Robin experienced the sudden death of her mother, a wonderful woman who put the needs of her family above her own and, as result, didn't know that her health was ailing. This tragedy made Robin realize that in order to be the best wife, mother, and woman possible, she had to take care of herself as if her life depended on it.Robin says, \"I wrote this book, not only to answer questions about what I do to stay healthy and in shape, but to remind women that it's time to move yourself to the top of your list of priorities. It's never too early to start taking care of yourself, but it's also never, ever too late.\"",
  "genres": [
    "Health",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Robin McGraw",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/6022078-what-s-age-got-to-do-with-it"
}