{
  "title": "The Twelve Quickies of Christmas: Volume 2",
  "description": "12 Quickies of Christmas series, Volume 2. Brighten the season with books 7 to 12 of this second omnibus of festive romantic (and hot!) tales ...Book 7: Passion and A Pear Tree by Tawny TaylorWhat does a prudish, self-proclaimed loner do when a nearly naked man jumps out of an oversized Christmas gift, sings a slightly racy version of the Twelve Days of Christmas, and promises to make her deepest desires come true? She goes for it, of course, and has the best twenty-four hours of her life. But at the stroke of midnight, the spell ends, and her happy holidays take an unexpected turn. Alone again, there's only one thing she wishes for: a little Christmas magic to bring back the man who taught her the joy of giving.Book 8: \nA Christmas Phantasie by Kit Tunstall\nAfter a bad marriage, Jakarta finds it difficult to commit to a future with the man she's now seeing. Teague has grown frustrated with her hesitation, believing she doesn't trust him. On their Christmas trip to Castle Phantasie, things come to a head. Jakarta must prove her trust in Teague by submitting to him, or their relationship will end. She loves him, but what he's asking for might be more than she can give.Book 9: Snow Angel by Joey W. HillIn her misspent youth, Constance used sex as a shallow substitute for the intimacy and love she craved. Fifteen years later, she whispers her deepest wish into Santa's ear at a Christmas benefit, only to discover he is someone who was part of that unfortunate and embarrassing time of her life. Mortified, she plans an early exit from the party, but Santa has different ideas. Sam Coble always wanted to get to know the girl behind the reputation, and now that she is an accomplished, independent woman, that determination spurs him to action. Constance is going to discover this particular Santa has a soft spot for naughty girls. He plans to give her everything she ever put on a Christmas list...and then some.Book 10: Hot For Santa by Lacey AlexanderAmy Finnegan has been attracted to Cole Bradshaw for years, but when he dons a Santa suit at the local mall and asks her to be his elf, her attraction turns into full blown lust. Yet when the entire holiday season passes with no response to her flirtations (leaving the lacy undies she's been wearing beneath her elf dress untouched), Amy resolves to give up the chase. Cole's Christmas Eve invitation (a thrilling night of eggnog and movies), is the wake up call Amy needs to get over her crush. Little does she know that Cole has planned a seduction (complete with erotic Christmas gifts) that will turn her into his willing holiday slave. Before the night is over, the sexy man wearing nothing but a Santa hat will prove to Amy that it's more rewarding to be naughty than nice.Book 11: Elf Song by Samantha WinstonThough he is in great demand at the court, Branagh, the Nutcracker Prince, has sought no mate and found no one to fill his needs. Melflouise Fairnight, once an archer in the elf militia, now a kitchen maid in the palace of the Sugar Plum Fairy wanted only to catch a glimpse of the secretive Nutcracker Prince. She never dreamed he'd desire her, or that his loving could free the elf song she'd kept caged since her husband's death. Their unexpected passion forces Branagh to make a terrible choice, between his kingdom and his woman.Book 12: Christmas Angel by Lisa Marie RiceNicole Caron lost the love of her life on Christmas Eve. Now only the Christmas Angel can help her.",
  "genres": [
    "Anthologies",
    "Erotica",
    "Erotic Romance",
    "Romance",
    "Christmas",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Joey W. Hill",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1285709.The_Twelve_Quickies_of_Christmas"
}