{
  "title": "Murder of a Medici Princess",
  "description": "In Murder of a Medici Princess , Caroline Murphy illuminates the brilliant life and tragic death of Isabella de Medici, one of the brightest stars in the dazzling world of Renaissance Italy, the daughter of Duke Cosimo I, ruler of Florence and Tuscany.Murphy is a superb storyteller, and her fast-paced narrative captures the intrigue, the scandal, the romantic affairs, and the violence that were commonplace in the Florentine court. She brings to life an extraordinary woman, fluent in five languages, a free-spirited patron of the arts, a daredevil, a practical joker, and a passionate lover. Isabella, in fact, conducted numerous affairs, including a ten-year relationship with the cousin of her violent and possessive husband. Her permissive lifestyle, however, came to an end upon the death of her father, who was succeeded by her disapproving older brother Francesco. Considering Isabella's ways to be licentious and a disgrace upon the family, he permitted her increasingly enraged husband to murder her in a remote Medici villa. To tell this dramatic story, Murphy draws on a vast trove of newly discovered and unpublished documents, ranging from Isabella's own letters, to the loose-tongued dispatches of ambassadors to Florence, tocontemporary descriptions of the opulent parties and balls, salons and hunts in which Isabella and her associates participated. Murphy resurrects the exciting atmosphere of Renaissance Florence, weaving Isabella's beloved city into her story, evoking the intellectual and artistic community that thrived during her time. Palaces and gardens in the city become places of creativity and intrigue, sites of seduction, and grounds for betrayal.Here then is a narrative of compelling and epic proportions, magnificent and alluring, decadent and ultimately tragic.",
  "genres": [
    "History",
    "Italy",
    "Biography",
    "Nonfiction",
    "Historical",
    "16th Century",
    "True Crime"
  ],
  "author": "Caroline P. Murphy",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/6022917-murder-of-a-medici-princess"
}