{
  "title": "Love You Again",
  "description": "An unexpected rescue rekindles an old romance between a single dad widower and a woman caught in a small town scandal that made her flee the one place where she belongs. Can a second chance at first love end in a happily ever after?Luke Luview has given up on love. Finally ready to let go of his late wife’s clothes, the grieving small-town police officer and single dad thinks he’s hearing things when he opens the charity box door. Who knocks from the inside of a donation bin?The raccoon he assumes is in there turns out to be way prettier – and very familiar. Rescuing the first girl he ever kissed means life has dealt him a wild card with Kylie Hood, his late wife’s best friend who left town suddenly fifteen years ago under a cloud of scandal.Kylie Hood will never depend on a man again. Dumped by her boyfriend and fired by his parents from her children’s programming job at their ski resort in rural Maine, she hits rock bottom while throwing out her ex’s clothes — along with her phone and car keys.Being rescued by Luke Luview, of all people, is a gift and a curse. The boy she once loved is now all grown up, everything her ex wasn’t – and absolutely off limits.Accepting his offer to be his temporary nanny while she job searches in New York City, Kylie falls hard for his sweet daughter, and even harder for Luke. A clause in her employment contract means they can’t fraternize, but fate has other plans, and forbidden fruit is twice as sweet.As the town she reluctantly left years ago accepts her more and more, and Luke makes it clear he wants a second chance with her in their close-knit community, Kylie has to an exciting new career in Manhattan on her own, or an instant family and a sense of belonging in her small hometown?And as Luke wrestles with the pain of being left behind by his wife’s accidental death, he has to balance his responsibilities to his daughter with his own needs. Needs he’s ignored for far too long.Needs only Kylie can meet.But not if she leaves.Can Luke and Kylie rekindle their first love and find a new future together in a place where love conquers all?If you’re looking for a fun read about first kisses and second chances, featuring a hot single-dad police officer and his accidental nanny, set in a small town in New England, with a golden retriever named Jester, a heroine whose dream in life is to run a fairy camp, and a hero who wants to build a place where everyone belongs–then this is your book.Grab a cup of coffee or tea, and maybe some edible glitter, and get your happy meter ready as you read the second book in the Love You, Maine, series–where love isn’t just a feeling… it’s a way of life.✓Standalone✓Slow burn✓Single dad widower✓Nanny/police officer✓Second chance… and a golden retriever named Jester",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Second Chance",
    "Contemporary",
    "Small Town Romance",
    "Second Chance Romance",
    "Audiobook"
  ],
  "author": "Julia Kent",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/60223461-love-you-again"
}