{
  "title": "Wedlock",
  "description": "Moore resurrects history from dry names and dates, and vividly recreates this eerily familiar era with a historian's love for detail and a storyteller's passion for a good yarn.With the death of her fabulously wealthy coal magnate father when she was just eleven, Mary Eleanor Bowes became the richest heiress in Britain. An ancestor of Queen Elizabeth II, Mary grew to be a highly educated young woman, winning acclaim as a playwright and botanist. Courted by a bevy of eager suitors, at eighteen she married the handsome but aloof ninth Earl of Strathmore in a celebrated, if ultimately troubled, match that forged the Bowes Lyon name. Yet she stumbled headlong into scandal when, following her husband’s early death, a charming young army hero flattered his way into the merry widow’s bed. Captain Andrew Robinson Stoney insisted on defending her honor in a duel, and Mary was convinced she had found true love. Judged by doctors to have been mortally wounded in the melee, Stoney persuaded Mary to grant his dying wish; four days later they were married.Sadly, the “captain” was not what he seemed. Staging a sudden and remarkable recovery, Stoney was revealed as a debt-ridden lieutenant, a fraudster, and a bully. Immediately taking control of Mary’s vast fortune, he squandered her wealth and embarked on a campaign of appalling violence and cruelty against his new bride. Finally, fearing for her life, Mary masterminded an audacious escape and challenged social conventions of the day by launching a suit for divorce. The English public was horrified–and enthralled. But Mary’s troubles were far from over . . . Novelist William Makepeace Thackeray was inspired by Stoney’s villainy to write The Luck of Barry Lyndon, which Stanley Kubrick turned into an Oscar-winning film. Based on exhaustive archival research, Wedlock is a thrilling and cinematic true story, ripped from the headlines of eighteenth-century England.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Historical",
    "18th Century",
    "Book Club",
    "British Literature"
  ],
  "author": "Wendy Moore",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/6022200-wedlock"
}