{
  "title": "The Purity Myth: How America's Obsession with Virginity Is Hurting Young Women",
  "description": "There is no working medical definition for \"virginity.\"“Vaginal rejuvenation” – in which a woman’s labia is trimmed and vagina tightened or her hymen is completely replaced (a \"revirginization\")– is the fastest-growing form of plastic surgery in the U.S.Over 1,400 federally-funded Purity Balls, where young girls pledge their virginity to their fathers in a prom-like event, were held in 2006 across the United States.The United States is obsessed with virginity—from the media to schools to fantastical Purity Balls. This panic is ensuring that young women’s ability to be moral agents is absolutely dependent on their sexuality. Jessica Valenti, author of Full Frontal Feminism and executive editor of Feministing.com, addresses this poignant issue in her latest book, The Purity Myth. Valenti argues that the country’s intense focus on chastity is extremely damaging to young women. Through in depth analysis of cultural stereotypes and media messages, Valenti reveals that powerful messages—ranging from abstinence curriculum to “Girls Gone Wild” commercials—place a young woman’s worth entirely on her sexuality. Morals are therefore linked purely to sexual behavior, as opposed to values like honesty, kindness, and altruism.Valenti approaches the topic head-on, shedding light on chastity in a historical context, abstinence-only education, pornography, and public punishments for those who dare to have sex, among other critical issues. She also offers solutions that pave the way for a future without a damaging emphasis on virginity, including a call to rethink male sexuality and reframing the idea of “losing it.” With Valenti’s usual balance of intelligence and wit, The Purity Myth presents a powerful and revolutionary argument that girls and women, even in this day and age, are overly valued for their sexuality, and that this needs to stop.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Sexuality",
    "Gender Studies",
    "Sociology",
    "Politics",
    "Gender"
  ],
  "author": "Jessica Valenti",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/6022046-the-purity-myth"
}