{
  "title": "Odyssey's Child",
  "description": "For fans of Life of Pi and The Alchemist, an unforgettable, spellbinding literary epic, brimming with excitement and magic that will have you laughing and crying in the joy of being alive that is the Caribbean.When Ethan Carpenter fails to get help for his mother as she lays dying he is blamed for her death, cast out by a father who hates him, and finds himself adducted to a small sailboat in the Caribbean. The man who holds him descends to the darkest of evil with the boy his prey, as dangerous to Ethan as the tiger in Life of Pi. Like Pi, Ethan must find a way to avoid the man and his evil on an extended voyage, a two month, 1,500 mile sail the length of the Caribbean. But unlike Pi he must fight a second tiger within. Selfblame for his mother’s death has taken him so far into himself that the real world seems an illusion, suicide the only answer. As the evil increases he is pushed toward becoming part of the very evil he is fighting. Can he overcome the man while finding a way out of the darkness that is his life? The boy’s odds dim as the voyage becomes a frightening odyssey with the killer ocean storms, predators of the deep, and fantastical and deadly characters on shore as Homer told it of old.The boy’s only hope is a black sailor who befriends him and tries to protect him. A knock-down physical and psychological battle rages between the two men with the heart and soul of the boy the prize and murder at play. Even in the violence the sailor’s wisdom and humanity shine through, taking the story to an exploration of life’s deeper meaning. And like The Alchemist, the sailor leads the boy through a series of events, each with a life lesson, in a personal journey toward finding himself and his future, a narrative of inspiration and self-realization. Lush, evocative, and totally human the story reminds one that life is worth living and the search for one’s self is the most important search of all.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "John Lockton",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/60225656-odyssey-s-child"
}