{
  "title": "Whispers of Fate",
  "description": "From WSJ and USAT Bestselling Author Amelia Hutchins comes a story of betrayal and hope.Old acquaintances are gathering as events unravel and unmask new obstacles in war-torn Faery.Kahleena assumed the Fates had offered her a glimpse into her destiny. She expected the events to unfold as they had in her vision. How complicated could it be to convince one male that their futures are united and created for one another? She never anticipated he’d be the smug, arrogant sociopath who aimed to reclaim what was once his. It also doesn’t help that he’s the hottest man she’s ever clapped her sights on. Arius is carnality in its truest form. His touch ignites a fire within her that she’s unprepared to feel, and his lips are the tinder which set her soul ablaze with passion.The walls of the prison have fractured, and Arius is finally free to make those who slaughtered or imprisoned his people pay. Abducting the daughter of the high king and queen is only the first step. Kahleena Danann was supposed to be a mouthy, spoiled princess. She should have been on her knees, pleading for mercy. Instead, she stands toe-to-toe with him and savagely declares exactly where he can stick his intentions with voluptuous lips and brilliant eyes flickering with fury. The girl, who is full of innocence and exquisite beauty, is unlike any woman he’s encountered before and threatens all his carefully plotted revenge.Will Kahleena be capable of withstanding his savagery and heated lips?Can Arius stick to his plans for vengeance, or will one golden-eyed beauty ruin everything he’s been planning for the last millennium?Will Synthia and Ryder be able to face the truth of what is heading straight for their kingdom? Or will it force them to confront the enemies hell-bent on making them pay for the atrocities carried out in the past?Welcome back to Faery, where nothing is what it seems. With two factions about to collide, who will rise and become the true ruler of the Realm?This is a prequel to Kahleena’s story and not needed if following the storyline.Warning: This book consists of an antihero, and a sassy, savage beauty that refuses to tremble before his domination or wrath. If you don’t love fantasy worlds, dark fantasy aspects, with a scorching undertone, this might not be your thing.There’s graphic language because she’s going to put him in place. Polite words won’t get her point across. He’s obtusely hardheaded.There’s violence, because how else will he understand she means business?There’s intensity because who doesn’t love some escapades blended with sizzling undertones? Who am I kidding, there are no undertones. It’s going to be a wall-banging, bed-shaking, scorching fable of deceit, triumph, love-hate-ish (We don’t do that tender crude here) and endurance.If you're into this type of story, scroll up and click the buy link.This book has adult subject matter, graphic fighting scenes and is NOT meant for anybody under 18. But when you’re of age, come on back and check it out.",
  "genres": [
    "Fantasy",
    "Fae",
    "Romance",
    "Paranormal",
    "Fantasy Romance",
    "Magic",
    "Adult"
  ],
  "author": "Amelia Hutchins",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/60247271-whispers-of-fate"
}