{
  "title": "Cast in Eternity",
  "description": "Dead men tell no tales When Corporal Kaylin Neya is assigned front desk duty—a task hated by every Hawk—the only thing she can look forward to besides an endless stream of complaints is visits from a dotty old woman, because she always brings baked goods along with information passed on by her friends, who happen to be ghosts no one else can see. But then the old woman’s invisible friends have news about Severn his unusual weapon has caught their attention. Concerned, Kaylin accompanies the woman home because she has a few questions to ask these so-called ghosts. Sadly, Kaylin can also see them. And she can see other spirits in the woman’s house as well—four children who’ve been trapped there for decades. When Kaylin looks into the deaths in the records at the Halls of Law, something doesn’t add up. Factor in a building that isn’t supposed to exist, and nothing makes sense. But Kaylin is a Hawk, and she’s determined to free the trapped ghosts of the children, even if she’s suddenly landed in the middle of the bad kind of Barrani history. Someone doesn’t want the past to be uncovered, and they’re perfectly willing to destroy Kaylin if it preserves the secrets of the dead…“A satisfying combination of contemporary-feeling secondary world, city-based fantasy, and go-big-or-go-home epic.” —Tor.com on the Chronicles of Elantra seriesThe Chronicles of ElantraBook 1: Cast in ShadowBook 2: Cast in CourtlightBook 3: Cast in SecretBook 4: Cast in FuryBook 5: Cast in SilenceBook 6: Cast in ChaosBook 7: Cast in RuinBook 8: Cast in PerilBook 9: Cast in MoonlightBook 10: Cast in SorrowBook 11: Cast in FlameBook 12: Cast in HonorBook 13: Cast in FlightBook 14: Cast in DeceptionBook 15: Cast in OblivionBook 16: Cast in WisdomBook 17: Cast in ConflictBook 18: Cast in Eternity",
  "genres": [
    "Fantasy",
    "Dragons",
    "Magic",
    "Urban Fantasy",
    "Science Fiction Fantasy",
    "Fiction",
    "Adventure"
  ],
  "author": "Michelle Sagara",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/60243683-cast-in-eternity"
}