{
  "title": "Scoochie & Skiddles: Scoochie's Adoption Story",
  "description": "From the author of Scoochie & Skiddles in Fun at Gramma's - a #1 top reader voted book (Reedsy Discovery), comes the much anticipated next release in the Scoochie & Skiddles series.Scoochie was adopted by her two daddies through an open adoption. In Scoochie's Adoption Story, Scoochie takes you on the journey of her and her daddies’ adoption experience. She tells of the many distinct processes related to adoption such as the \"match\" process between her birth mom and daddies, the hospital and post-hospital experience, and the adoption hearing that legalized her adoption. Most importantly, she expresses her respect and positivity for her birth mom and birth family, while exuding immense pride and endless love for her two daddies and soon to be adopted sister. While the book's theme is Scoochie's adoption, it honors and celebrates families of all types and structures. The story is an uplifting story about the bond family.Narrated by the book's main character, Scoochie's Adoption Story is told in child-friendly language with adoption concepts presented in a manner that are easy for children to understand. It is a celebration of family, regardless of family composition or how a family has been created. Through text and illustration, the story represents a wide variety of families and sends a strong message of diversity and inclusion. A perfect reading book for all families and especially for children of LGBT parents, diverse families, and families touched by adoption.Those who may enjoy the book include:All families and all childrenParents looking for books on diversityBirth parentsAdoptive parentsAdopted childrenLGBT parents and LGBT alliesDiverse families / mixed race familiesAdoption agencies / Adoption case workersAdoption attorneysAdoption facilitatorsIndividuals and couples considering adoptionSocial Workers and CounselorsTeachers and Guidance CounselorsChild Protective Services / Family PreservationDiversity, Equity and Inclusion (DE&I) advocates",
  "genres": [
    "Picture Books"
  ],
  "author": "Tom  Tracy",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/60243712-scoochie-skiddles"
}