{
  "title": "A Pawn for a Queen",
  "description": "Fiona Buckley, acclaimed for her precisely researched and richly nuanced historical mysteries, returns with a magnificent new Ursula Blanchard novel set at the court of Queen Elizabeth I. Widowed once again, Ursula, a sometime waiting woman and spy for Elizabeth, intends to live quietly with her small daughter, Meg, at Withysham, their country home. But word comes that her devoutly Catholic cousin, Edward Faldene, has set off for Scotland, carrying a secret list of families loyal to Elizabeth's rival, Mary, Queen of Scots. If caught, Edward could be tried for treason. His family begs Ursula to go after him and try to bring him home before it's too late.Ursula agrees. She wants to help her cousin, but she also wants to retrieve the list before it can be used to hurt Elizabeth. The families named there could help raise an army to topple her from her throne.It's a dangerous mission. Before, Ursula had worked for the Queen or for her Secretary of State, Sir William Cecil. As an emissary of the Queen, even a secret emissary, she had power. This time she's on her own. To reveal her plans to the Queen would be disastrous for Edward. When she finally gets to Edinburgh, after long days on the road, she's too late. Edward is dead and the list of Mary's supporters is missing.Whom can she trust? Nothing goes quite as planned, not even her meeting with the Queen of Scots. Ursula's loyalty is to Elizabeth, but Mary, the enemy, is kind and charming. And what about the quaint, middle-aged Thursbys? Are they what they seem to be, or is their Puckish air a cover for something more sinister?Then there's Sir Brian Dormbois. When Ursula enlists the Scottish-French aristocrat's help, she never dreams that he will fall violently in love with her, with potentially disastrous results.To find the answers to her questions, save her own life, and protect Elizabeth, Ursula must make some difficult choices. Worst of all, she learns that friend and foe can sometimes be the same person...and for queens, everyone is a pawn.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "British Literature",
    "Crime"
  ],
  "author": "Fiona Buckley",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/60262.A_Pawn_for_a_Queen"
}