{
  "title": "Wormhole",
  "description": "An eighty year old cold case murder investigation that stretches across light years and risks the future of mankind's new home. A hard SF/crime crossover from two respected and well-liked names in SF. 2110. Earth is suffering major resource shortages, and the impact of climate change is peaking, with much of the planet's equatorial regions turned to lifeless desert and populations displaced. Colonies have been established on Mars and the Moon, but these cannot hope to sustain any more than a scant population of hundreds of citizens. Attention has turned to the need to discover an extra-solar colony world. European scientists, using discoveries made at CERN, have identified the means of creating a wormhole in the space-time continuum, which would allow interstellar travel. However, to do so they must first physically transport one end of the wormhole to where they want it to be, so setting up a wormhole will always rely on physical travel first of all. A ship is sent to Mu Arae, earth-like planet discovered 10 years before. It is a journey that will take 80 years, the crew, who will eventually set up the wormhole on the planet, kept in suspended animation. But only a few years into the trip, catastrophe strikes and the ship blows up en route, killing all aboard. 2190, eighty years after the starship set out. Gordon Kemp is a detective working in the cold case department in London. Usually he works on cases closed ten, twenty-five years earlier. Now, however, he has been assigned a murder investigation closed, unsolved, over eighty years ago. What he unearths will change history and threatens everything we know about what the powers that be have planned for Earth. The tragedy that befell the ship 80 years before is not what it seems and the past and the present are radically different to what everyone on Earth believes. We made the journey. Why has it been kept a secret? File Under:  Science Fiction [ Who wants to live forever? Old caps New Worlds Believe no one ]",
  "genres": [
    "Science Fiction",
    "Mystery",
    "Fiction",
    "Thriller",
    "Space Opera",
    "Crime",
    "Murder Mystery"
  ],
  "author": "Eric Brown",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/60255193-wormhole"
}