{
  "title": "Jewel Hinged Jaw: Notes on the Language of Science Fiction",
  "description": "From the four-time Nebula Award–winning author, an indispensable work of science fiction criticism, revised and expanded.Samuel R. Delany’s The Jewel-Hinged Jaw appeared originally in 1977, and is now long out of print and hard to find. The impact of its demonstration that science fiction was a special language, rather than just gadgets and green-skinned aliens, began reverberations still felt in science fiction criticism. This edition includes two new essays, one written at the time and one written about those times, as well as an introduction by writer and teacher Matthew Cheney, placing Delany’s work in historical context. Close textual analyses of Thomas M. Disch, Ursula K. Le Guin, Roger Zelazny, and Joanna Russ read as brilliantly today as when they first appeared. Essays such as “About 5,750 Words” and “To Read The Dispossessed” first made the book a classic; they assure it will remain one.“Delany’s first work of non-fiction, The Jewel Hinged Notes on the Language of Science Fiction , remains a benchmark of sf criticism thirty-three years after its initial publication in 1977. . . . Extensively revised and reissued in 2009, JHJ has become even stronger, containing twelve essays in ten chapters and two appendixes.” —Isiah Lavender, Science Fiction Studies“I re-read The Jewel-Hinged Jaw every year as a source of guidance, as a measure of what all criticism and literature should aspire to be, and as a challenge for those of us who want to write.” —Junot Díaz, Pulitzer Prize–winning author of The Brief Wondrous Life of Oscar Wao“What a joy it is to have The Jewel-Hinged Jaw back in print! These essays glitter with insights into writing, reading, society, and the multiple relationships of the three.” —Reginald Shepherd, author of Orpheus in the Bronx",
  "genres": [
    "Nonfiction",
    "Essays",
    "Writing",
    "Criticism",
    "Literary Criticism",
    "Reference",
    "Language"
  ],
  "author": "Samuel R. Delany",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/602463.Jewel_Hinged_Jaw"
}