{
  "title": "Refined",
  "description": "Tracie was fifteen when she ran away from an abusive father. At the end of her first day of freedom, she was running from two men with a rope. Blazing through the forest, she felt the papers in her shoes she had spent years scribbling her hopes and dreams on. Since the age of eight, she had written down her dreams, trusting the words would rewrite her future. Every day after school she sprinted-shoes full of hope-to the local oil refinery, gawking through fence fabric at the flickering lights, as though they were beacons of promise. Her father was distrustful of other men, so public life was limited for Tracie. The windows inside the home were tacked with trash bags to block out any view of her mother. Violence permeated inside the home. Accusations were made daily. When Tracie was old enough, she grabbed a bag and left. That night two men watched her make camp in a forest and tried to capture her, but she escaped. The two men chasing her frightened her so much, she scrambled into a school the next morning for help. Tracie was placed in foster care with a loving family. The words in her shoes were coming to life. As an adult, she questioned her father's violent nature, so she sent off a tube of bubbling saliva to a DNA test site, hoping for answers. She was connected to dozens of relatives she never knew existed, grilling them for answers. She ended up going down a hole as deep and winding as a rabbit's warren. She discovered many twists, including the murder of her great-grandfather. Violence was handed down to each generation of males like an Olympic torch. Refined is a testament to the strength of young women, a heartbreaking coming-of-age story, and a surprising twist of DNA patterns handed down systematically from generation to generation. With words that are rich with life, Breaux has crafted a story that reminds us that we are forever shaped by our ancestors, and each of us has the power to refine our future into something beautiful.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Abuse",
    "Biography Memoir"
  ],
  "author": "Tracie Breaux",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/60232569-refined"
}