{
  "title": "Kings of Desire",
  "description": "*re-edited versionI ran as fast as I could, escaping the monster, escaping my personal hell.I wanted freedom, a ray of precious sunlight, yet all I found was darkness. Pitch black consuming darkness. That’s until when an opportunity arrived, maybe the most dangerous of them all, but the only one that could save me- The Pleasure Room. Heaven and hell dancing in mesmerizing circles.That’s how I found them.The three kings.My three kings.That’s how they bond me to them, tying me with invisible ropes and turning me into a slave of their wicked desires.Cole - The King of Echo Millenium Academy. Always playing a game of lust and uncomposed primal urges.Brax- The King of the underworld. A collector who craves to turn me into his centerpiece.Ferris- The King of wealth. A king with true royal origins, yet the blood running through his veins is far from being blue. Darkness and madness intertwine in this man in their sublimest form. A tempter and a psychopath, reaching to crush much more than my body. Reaching for my soul!Three Kings. My Kings of Desire!The Kings of Desire is a dark college bully reverse harem romance and is Book1 of The Pleasure Room series.This book contains material that may be sensitive to some readers and it's addressed to a mature audience.No angels allowed between these lines, no Prince Charming, just sinful desires.The Kings of Desire is not recommended for the weak of heart or for those who are looking for a perfect love story. This book is dark, twisted, pushing boundaries and imagination.With three different kings, this book has it dystopian romance reverse harem, reverse harem mafia dark romance, reverse harem academy bully dark romance, dark reverse harem royal romance.Please, read the trigger warning inside the book!This is the kind of book you hide under a pillow when someone comes into the room. You will either need a glass of wine or holy water to read Kings of Desire.Enjoy!",
  "genres": [
    "Dark Romance",
    "Reverse Harem",
    "Dark",
    "Romance",
    "College",
    "Enemies To Lovers",
    "Dystopia"
  ],
  "author": "M.O. Absinthe",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/60232477-kings-of-desire"
}