{
  "title": "The Fugitive Queen",
  "description": "It's 1568, and Mary, Queen of Scots, is Queen Elizabeth's captive. Forced to flee Scotland after her husband, Lord Darnley, dies mysteriously, Mary is now a \"guest\" at Bolton Castle in northern England, where she plots her escape and covertly pursues her claim to her cousin's crown. Rarely have the historical stakes been so high, and rarely has Mistress Ursula Blanchard been caught in such dangerous territory. Herself an illegitimate daughter of King Henry VIII and half sister to Elizabeth, Ursula has served in the past as a lady of the bedchamber and, more important, as a spy for the Queen.Now, Elizabeth once again sends Ursula on a perilous and secret mission. She must carry a confidential message from Elizabeth to Mary, who is a woman of legendary charm and charisma. Will Ursula, too, fall under Mary's spell? Can Ursula trust Mary's promises? Did Mary have her husband killed? Ursula travels north with her young daughter, Meg, and her ward, Penelope Mason. Penelope has disgraced herself at Elizabeth's court, making advances to a married man, and now Ursula must take her young charge to the girl's Yorkshire estate -- located conveniently close to Bolton Castle and Mary -- and help her find a husband.There's no shortage of candidates for the wealthy young woman, but will Penelope become a pawn in the royal chess game? In confronting Mary and her supporters, Ursula discovers that she's inherited more than just her father's royal blood. Surrounded by possible traitors, Ursula must make difficult and poignant choices to serve her Queen and to save herself and those she loves.Set in some of the most turbulent years of English history, \"The Fugitive Queen\" takesreaders on an enchanting journey filled with authentic period color and riveting suspense. Ursula Blanchard's lively mind and courage make her a heroine to remember in a historical series that ranks with the best.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "British Literature",
    "Medieval"
  ],
  "author": "Fiona Buckley",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/60264.The_Fugitive_Queen"
}