{
  "title": "Find Him Where You Left Him Dead",
  "description": "AT DAWN HE’LL BE GONE AND YOU’LL BE HERE FOREVER.Kristen Simmons's masterful breakout horror novel that's \"Jumanji but Japanese-inspired\" (Kendare Blake) about estranged friends playing a deadly game in a nightmarish folkloric underworld.“A nightmare I didn’t want to end.” —Terry J. Benton-Walker • “Absorbing.” —C. L. Herman • “Bone-chilling.” —Lauren Shippen • “Unforgettable.” —Margaret Rogerson• “Twisted.” —Lish McBride • “Won't let me sleep!” —Chelsea Mueller • \"Full of surprises.\" —C. J. Redwine • “Intense.” —Kendare Blake Four years ago, five kids started a game. Not all of them survived.Now, at the end of their senior year of high school, the survivors—Owen, Madeline, Emerson, and Dax—have reunited for one strange and terrible they’ve been summoned by the ghost of Ian, the friend they left for dead.Together they return to the place where their friendship ended with one find Ian and bring him home. So they restart the deadly game they never finished—an innocent card-matching challenge called Meido. A game without instructions.As soon as they begin, they're dragged out of their reality and into an eerie hellscape of Japanese underworlds, more horrifying than even the darkest folktales that Owen's grandmother told him. There, they meet Shinigami, an old wise woman who explains the \nThey have one night to complete seven challenges or they'll all be stuck in this world forever.\nOnce inseparable, the survivors now can’t stand each other, but the challenges demand they work together, think quickly, and make sacrifices—blood, clothes, secrets, memories, and worse.And once again, not everyone will make it out alive.At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [
    "Horror",
    "Young Adult",
    "Fantasy",
    "Thriller",
    "Mythology",
    "Paranormal",
    "Audiobook"
  ],
  "author": "Kristen Simmons",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/60290717-find-him-where-you-left-him-dead"
}