{
  "title": "Loveboat Forever",
  "description": "Return to the sparkling world of Loveboat, this time with Pearl Wong, on an entirely new, romantic, whirlwind adventure from Abigail Hing Wen, New York Times bestselling author of Loveboat, Taipei!Don't miss the movie adaptation of Loveboat, Taipei (called Love in Taipei), starring Ashley Liao (Physical, Fresh Off the Boat), Ross Butler (To All the Boys I’ve Loved Before franchise, Shazam!), Nico Hiraga (Booksmart), and Chelsea Zhang (Daybreak), now available on multiple streaming platforms, including Paramount+, Amazon Prime, and Apple TV!Pearl was ready for a worldwide stage. Instead, she needs to stage a comeback.Seventeen-year-old music prodigy Pearl Wong had the summer of her dreams planned—until a fall from grace leaves her in need of new plans…and a new image.Where better to revamp her “brand” than at Chien Tan, the Taipei summer program for elite students that rocketed her older sister, Ever, on a path to romance and self-fulfillment years ago.But as the alumni know, Chien Tan is actually Loveboat—the extravagant world where prodigies party till dawn—and there’s more awaiting Pearl there than she could have ever imagined, like a scandalous party in the dark, a romantic entanglement with a mysterious suitor...and a summer that will change her forever.Sweeping, glamorous, and deeply soulful, this companion to the New York Times bestselling novel Loveboat, Taipei and Loveboat Reunion will reunite readers with their favorite characters, in a thrilling new journey of romance, self-discovery, and empowerment. Perfect for fans of Jenny Han and Sarah Dessen.  \"What a sheer delight it is to be back in Taipei, this time as classical musician Pearl Wong recovers from social media catastrophe at the same summer program that so radically transformed her sister, Ever. Full of familiar faces and new friends, revelry, romance, and self-discovery, Abigail Hing Wen has crafted another confection you’ll want to devour in a single sitting.\" —Gayle Forman, #1 New York Times bestselling author of If I Stay\"What a fun romance with breathtaking destinations, hilarious mishaps, and heartwarming surprises. Another winner in Abigail Hing Wen’s enchanting Loveboat book series!\" —Melissa de la Cruz, #1 New York Times bestselling author",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Audiobook",
    "Asian Literature",
    "Young Adult Romance"
  ],
  "author": "Abigail Hing Wen",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/128579024-loveboat-forever"
}