{
  "title": "Why We Fight: The Roots of War and the Paths to Peace",
  "description": "“ Why We Fight  reflects Blattman’s expertise in economics, political science, and history… Blattman is a great storyteller, with important insights for us all.” —Richard H. Thaler, winner of the Nobel Memorial Prize in Economic Sciences and coauthor of Nudge“Engaging and profound, this deeply searching book explains the true origins of warfare, and it illustrates the ways that, despite some contrary appearances, human beings are capable of great goodness.”—Nicholas A. Christakis author of The Evolutionary Origins of a Good SocietyWhy did Russia attack Ukraine? Will China invade Taiwan and launch WWIII? Why has the number of civil wars reached their highest level in decades? Why are so many cities in the Americas plagued with violence? And finally, what can any of us do about it?It feels like we’re surrounded by violence. Each conflict seems unique and insoluble. With a reason for every war and a war for every reason, what hope is there for peace? Fortunately, it’s simpler than that. Why We Fight boils down decades of economics, political science, psychology, and real-world interventions, giving us some counterintuitive answers to the question of war. The first is that most of the time we don’t fight. Around the world, there are millions of hostile rivalries, yet only a fraction erupt into violence. Most enemies loathe one another in peace. The reason is war is too costly to fight. It’s the worst way to settle our differences.In those rare instances when fighting ensues, that means we have to ask What kept rivals from the normal, grudging compromise? The answer is always the It’s because a society or its leaders ignored those costs of war, or were willing to pay them.Why We Fight shows that there are just five ways this happens. From warring states to street gangs, ethnic groups and religious sects to political factions, Christopher Blattman shows that there are five reasons why violent conflict occasionally wins over compromise.Through Blattman’s time studying Medellín, Chicago, Liberia, Northern Ireland, and more, we learn the common logics driving vainglorious monarchs, dictators, mobs, pilots, football hooligans, ancient peoples, and fanatics. Why We Fight shows that war isn’t a series of errors, accidents, and emotions gone awry. There are underlying strategic, ideological, and institutional forces that are too often overlooked.So how to get to peace?Blattman shows that societies are surprisingly good at interrupting and ending violence when they want to—even gangs do it. The best peacemakers tackle the five reasons, shifting incentives away from violence and getting rivals back to dealmaking. And they do so through tinkering, not transformation.Realistic and optimistic, this is a book that lends new meaning to the adage “Give peace a chance.”",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Economics",
    "War",
    "Military Fiction",
    "Political Science"
  ],
  "author": "Christopher Blattman",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/60281667-why-we-fight"
}