{
  "title": "The Ruin of All Witches: Life and Death in the New World",
  "description": "*A TIMES, SUNDAY TIMES AND BBC HISTORY HISTORY BOOK OF THE YEAR 2021*'The best and most enjoyable kind of history writing' Hilary Mantel'A bona fide historical classic' Sunday TimesSimply one of the best history books I have ever read' BBC HistoryIn the frontier town of Springfield in 1651, peculiar things begin to happen. Precious food spoils, livestock ails and property vanishes. People suffer fits and are plagued by strange visions and dreams. Children sicken and die. As tensions rise, rumours spread of witches and heretics, and the community becomes tangled in a web of spite, distrust and denunciation. The finger of suspicion falls on a young couple struggling to make a home and feed their children: Hugh Parsons the irascible brickmaker and his troubled wife, Mary. It will be their downfall.The Ruin of All Witches tells the dark, real-life folktale of witch-hunting in a remote Massachusetts plantation. These were the turbulent beginnings of colonial America, when English settlers' dreams of love and liberty, of founding a 'city on a hill', gave way to paranoia and terror, enmity and rage. Drawing on uniquely rich, previously neglected source material, Malcolm Gaskill brings to life a New World existence steeped in the divine and the diabolic, in curses and enchantments, and precariously balanced between life and death.Through the gripping micro-history of a family tragedy, we glimpse an entire society caught in agonized transition between supernatural obsessions and the age of enlightenment. We see, in short, the birth of the modern world.'A great story, exquisitely told. This book is history at its illuminative best' The Times'As compelling as a campfire story ... Gaskill brings this sinister past vividly to life' Erica Wagner, Financial Times",
  "genres": [
    "History",
    "Nonfiction",
    "Witches",
    "American History",
    "Historical",
    "Witchcraft",
    "Religion"
  ],
  "author": "Malcolm Gaskill",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/60286332-the-ruin-of-all-witches"
}