{
  "title": "Last Lion: The Fall and Rise of Ted Kennedy",
  "description": "No figure in American public life has had such great expectations thrust upon him, or has responded so poorly. But Ted Kennedy -- the youngest of the Kennedy children and the son who felt the least pressure to satisfy his father's enormous ambitions -- would go on to live a life that no one could have predicted: dismissed as a spent force in politics by the time he reached middle age, Ted became the most powerful senator of the last half century and the nation's keeper of traditional liberalism.As Peter S. Canellos and his team of \"Boston Globe\" reporters show in this revealing and intimate biography, the gregarious, pudgy, and least academically successful of the Kennedy boys has witnessed greater tragedy and suffered greater pressure than any of his siblings. At the age of thirty-six, Ted Kennedy found himself the last brother, the champion of a generation's dreams and ambitions. He would be expected to give the nation the confidence to confront its problems and to build a fairer society at home and abroad.He quickly failed in spectacular fashion. Late one night in the summer of 1969, he left the scene of a fatal automobile accident on Chappaquiddick Island. The death there of a young woman from his brother's campaign would haunt and ultimately doom his presidential ambitions. Political rivals turned his all-too-human failings -- drinking, philandering, and divorce -- into a condemnation of his liberal politics.But as the presidency eluded his grasp, Kennedy was finally liberated from the expectations of others, free to become his own man. Once a symbol of youthful folly and nepotism, he transformed himself in his later years into a symbol of wisdom and perseverance. He built a deeply loving marriage with his second wife, Victoria Reggie. He embraced his role as the family patriarch. And as his health failed, he anointed the young and ambitious presidential candidate Barack Obama, whom many commentators compared to his brother Jack. The Kennedy brand of liberalism was rediscovered by a new generation of Americans.Perceptive and carefully reported, drawing heavily from candid interviews with the Kennedy family and inner circle, \"Last Lion\" captures magnificently the life and historic achievements of Ted Kennedy, as well as the personal redemption that he found.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Politics",
    "History",
    "American History",
    "Memoir",
    "American"
  ],
  "author": "Peter S. Canellos",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/6030598-last-lion"
}