{
  "title": "Peril in Paris",
  "description": "Lady Georgiana Rannoch and her dashing husband, Darcy, are awaiting a bundle of joy, but an unexpected trip to Paris will thrust them straight into a tangled web of international intrigue in this all-new mystery in the New York Times bestselling Royal Spyness series from Rhys Bowen.What a delight it is to finally be able to enjoy a simple meal again! I have been in the throes of morning sickness for the last few months as Darcy and I prepare to welcome a brand-new addition to our little family. Now that I am feeling better, I have realized I am dreadfully bored! It seems that all my nearest and dearest are off leading their own busy lives while I sit at home and attempt to train our two adorably naughty puppies. Fun as it may be, it is hard not to long for a little adventure, a change of pace, before my true confinement begins when the baby comes.Happily, it seems that Darcy has read my mind. When I receive a letter from my glamorous best friend, Belinda, Darcy suggests we take a trip to Paris to visit her. It seems he also has a spot of business of which to take care, so I will be staying in Belinda’s flat as she works feverishly on Coco Chanel’s fall collection. I happen to know Coco from a disastrous encounter in Nice years ago, and I am hoping this visit will go much more smoothly. But I soon learn that nothing about my time in Paris is going to be simple . . . or safe for that matter.Darcy has asked me to take on a small chore as a part of his latest assignment. I am to covertly retrieve something from an attendee of Coco’s show. It seems easy enough, but I discover that this little errand could have terrifying consequences for a world on the brink of war. When things go horribly wrong, I am left to find a killer all while trying to fend off a French policeman who is certain that I am a criminal mastermind. But I have no plans to deliver my darling little one in a prison cell, and so I will muster every ounce of my courage to save the day . . . and, quite possibly, the world!",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Cozy Mystery",
    "Historical",
    "Historical Mystery",
    "Audiobook"
  ],
  "author": "Rhys Bowen",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/60301121-peril-in-paris"
}