{
  "title": "Safe and Sound",
  "description": "As the lead singer of popular pop-rock band, Gen Y, Ruby Bright has always hidden her struggles with fame and oppressive management behind flashy outfits and feigned confidence for the sake of the fans, but when her tour bus crashes and her best friend, bandmate, and, according to the public, boyfriend, is killed, she loses her only pillar of support and everything is turned upside down. It’s only made worse when her security team believe that a crazed stalker who has been sending cryptic letters for over a year is at the root of it all. The elevated threat to a grief-stricken and recovering Ruby leaves them no choice but to send her to a secluded safe house in Cumbria, where she can be protected twenty-four hours a day until her best friend’s killer is brought to justice.When entitled celebrity, Ruby Bright, walks through retired witness protection officer Shea O’Connor’s doors, though, Shea is less than impressed with the new guest seeking refuge in the farmhouse she now offers out to people in need of security – especially when cabin-fevered and traumatised Ruby proves a challenge in every aspect. As Ruby navigates her grief through reckless behaviour though, Shea begins to realise that she may have more in common with the pop star than she once thought. Nobody is more surprised than her, then, when an unexpected connection begins to develop between them.All sense of security is broken when Ruby receives a new threat from her stalker. When Ruby is taken from the house by her security team, a chilling discovery is made. With Shea the only person Ruby can truly trust, the two embark on a thrilling game of cat and mouse with the people trying to take Ruby down — but can Shea fix past mistakes and protect Ruby, or are the people behind all of Ruby’s recent misfortunes too powerful to stop?",
  "genres": [
    "Lesbian",
    "LGBT",
    "Music",
    "Romance"
  ],
  "author": "Rachel Bowdler",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/60316404-safe-and-sound"
}