{
  "title": "zombies scare me 100",
  "description": "Zombies do not exist in our world everyone reasons. Until each discovers that, there are real zombies in the United States! Society collapses as rule of law is missing. Members of the Alternative Right or Alt-Right group assassinate our President Barack Obama and Vice President Joe Biden. John Boehner resigns from the position of Speaker of the House of Representatives for not doing Congresses bidding. The new Speaker of the House takes over on Halloween going by the name of President Buttercup. The government transfers its operations to Hawaii the only safe place in the United States from the zombies. The lies continue to pile on while the Muslims earn blame for the zombie outbreak, caused by a government mandated flu shot.A group of characters now must deal with the consequences of the zombie outbreak in the United States. Each of them will struggle to survive. Diana a baseball player lives with her grandparents and is afraid of zombies especially the kid zombies. Jose “Axe” will end up deported to Mexico the day after Halloween if everything goes as planned. John “Ax Murderer” resides at the Leavenworth, Kansas prison serving a life sentence for the killing on Black Friday at Wal-Mart. Pepe “Judas Thaddeus” is a five year old celebrating his birthday at Chuck E. Cheese with his family. Joan works at the Oak Park Mall while she prepares for her friend’s surprise birthday party. Ascelina is from Winnipeg, Canada and loves watching each of the episodes of the Walking Dead with her two sisters. Peter is a doctor at Solara Hospital in Brownsville, Texas who ends up landing in a mental hospital after a suicide attempt. Angelic is running away from her stepson who is trying to kill her. Abban a Gringo is a professional wrestler in Mexico who needs to fly into Chicago to see his mother who is in a coma in the hospital.Our government censors the media by creating the Only Channel to control the information that we receive in the United States. The Only Channel begins to broadcast false propaganda to garner support for a new battle in the Middle East. Operation Zombies Scare Me will earn our country more sympathy worldwide than September 11. Finally leading the United Nations (U. N.) to approve of President Buttercup’s plan to exterminate all the Muslims from the Middle East in order to give all of the Middle East to the state of Israel. Israel will give the United States free oil and we will gain a more powerful ally in the world.",
  "genres": [],
  "author": "I.D. Oro",
  "average_rating": "4.97",
  "url": "https://www.goodreads.com/book/show/60311875-zombies-scare-me-100"
}