{
  "title": "The Corset Maker",
  "description": "WWII-era novel celebrates female friendships and the resilience of the human spiritTHE CORSET MAKER a historical novelThe master planner of rebuilding Ground Zero, world-renowned architect Daniel Libeskind, has created a new piece of art for the cover of “The Corset Maker,” the forthcoming historical fiction novel by his sister, author Annette Libeskind Berkovits. The novel–loosely inspired by their mother’s real life story–is a powerful addition to the genre of 20th century historical fiction, and is slated for release on International Women's Day, March 8, 2022.In Warsaw, Poland, the young Rifka Berg, raised in an ultra Orthodox home, asks her father why girls don’t have bar mitzvahs. Eventually, his answer provokes Rifka to riskeverything. In a bold move, unheard of at the time, teenage Rifka and her close friend, Bronka, open their own business–a corset shop on the most fashionable street in Warsaw. Rifka yearns to read forbidden literature and to explore the world beyond the confines of her small community. Her wishes come true, albeit harrowingly, when the tumultuous events of the 20th century take her on a journey for survival. A Parisian Count, a Moroccan arms smuggler, and an orphaned Spanish boy will test the convictions and tug at Rifka's heart. Faced with life and death situations, Rifka will have to take immense risks. She will have to decide if there is ever a time to abandon her principles for a higher purpose. What decisions will she make? Will circumstances choose for her?In this unforgettable journey, Rifka becomes embroiled in some of the most violent events of the century: the Jewish-Arab conflict in Palestine, the Spanish Civil War and the Nazi occupation of Southern France. As her involvement deepens, she sees firsthand how autocratic rule deprives people of even the simplest freedoms.Rifka's personal struggles and dilemmas go to the heart of the major ethical issues and challenges of our time.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical"
  ],
  "author": "Annette Libeskind Berkovits",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/60299161-the-corset-maker"
}