{
  "title": "Pa negre",
  "description": "A mig camí entre la memòria i la ficció, en una barreja de gèneres, Pa negre gira a l’entorn de l’Andreu, un vailet de la Plana de Vic en els anys més crus de la postguerra. Ell pertany a la banda dels perdedors: el seu pare, home de ferms ideals republicans, ha estat empresonat per roig. De resultes d’això, la mare s’ha hagut de posar a treballar a la fàbrica i el confia a uns parents que viuen a pagès. Tot i viure lluny dels pares, en un clima de por que es palpa arreu, el temps a la masia estarà farcit de sentiments i descobertes. Hi descobrirà el misteriós món dels adults, la intuïció rere les paraules dels grans, farà tentines en els viaranys del sexe. És, també, un temps d’amistats valentes, de contes explicats a la vora del foc, de jocs a l’aire lliure, de plantar barraques a les branques dels arbres, de farinetes de blat de moro, de pa amb vi i sucre... de pa negre.En temps de guerra –i de postguerra- tots els sentiments són abrandats, van a l’essència: o tot o res, perquè no hi ha gairebé res a perdre. L’amor, l’odi, la passió, la rancúnia, la venjança, la hipocresia, la humiliació... res no s’escapa de la vida dels personatges d‘aquesta obra, en què Emili Teixidor aconsegueix transportar-nos a una època de repressió i de missa obligada. L’autor recrea amb total precisió l’ambient rural de la Catalunya de postguerra amb una llengua vivíssima, rica, plena de matisos, i un ple domini de la tensió narrativa.De mica en mica, el lector assistirà a un canvi substancial en l’Andreu, que aprendrà de cada cosa que li passa i que, de perdedor passa a sentir-se guanyador, en una metàfora del país que assimila la derrota i accepta, amb passivitat, una victòria que no és la seva.I s’adonarà també d’una lliçó molt important: a més estimació, més perills de tota mena. L’amor crema.",
  "genres": [
    "Fiction",
    "Spain",
    "Coming Of Age",
    "Historical Fiction",
    "War",
    "Novels",
    "Spanish Civil War"
  ],
  "author": "Emili Teixidor",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/6031654-pa-negre"
}