{
  "title": "The Spice Gate",
  "description": "Delve into this debut fantasy and journey through the Spice Gates as Amir, a young man born with the ability to travel between the eight kingdoms, unravels the power that keeps the world in balance, perfect for readers of Ken Liu’s Dandelion Dynasty, S.A. Chakraborty’s Daevabad Trilogy, and Andrea Stewart’s The Drowning Empire.The weight of spice is more than you know.Relics of a mysterious god, the Spice Gates connect the eight far-flung kingdoms, each separated by a distinct spice and only accessible by those born with a special mark. This is not a caste of distinction, though, but one of subjugation: Spice Carriers suffer the lashes of their masters, the weight of the spices they bear on their backs, and the jolting pain of the Gates themselves.Amir is one such Spice Carrier, and he dreams of escaping his fate of being a mule for the rich who gorge themselves on spices like the addicted gluttons they are. More important than relieving his own pain, though, is saving his family, especially his brother, born like him with the unfortunate spice mark that designates him for a life of servitude.But while Amir makes his plans for freedom, something stirs in the inhospitable spaces between the kingdoms. Fate has designs of its own for Amir, and he soon finds himself drawn into a conspiracy that could disrupt the delicate dynamics of the kingdoms forever.The more Amir discovers truth and myth blurring, the more he realizes that his own schemes are insignificant compared to the machinations going on around him. Forced to chase after shadows with unlikely companions, searching for answers that he never even thought to question, Amir’s simple dream of slipping away transforms into a grand, Spice Gate–hopping adventure. Gods, assassins, throne-keepers, and slaves all have a vested interest in the spice trade, and Amir will have to decide—for the first time in his life—what kind of world he wants to live in…if the world survives at all.",
  "genres": [
    "Fantasy",
    "Adult",
    "Fiction",
    "High Fantasy",
    "Science Fiction",
    "Epic Fantasy",
    "Adventure"
  ],
  "author": "Prashanth Srivatsa",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/60305959-the-spice-gate"
}