{
  "title": "D!ckhead",
  "description": "“He says I’m the dumbest hostage he’s ever had. But I’m also the hottest.”Hammer. Enforcer for the Demon Brethren MC. Sociopath. Butcher. Weapon of choice: SledgehammerDex. Shameless. Perpetually horny. No impulse control. Weapon of choice: Dumb jokesFrom the moment Dex saw Hammer smash a man’s head open like it was a watermelon, he was obsessed. No, really, obsessed.He is thrilled when life offers him the opportunity to introduce himself to the bloodthirsty biker god. So maybe it’s not so perfect that Hammer is his prisoner, but beggars can’t be choosers.Standing guard at a secret junkyard prison is serious business, but Dex’s horny brain still gets the best of him. One thing leads to another and—oops—now he’s Hammer’s hostage, they’re going God knows where, and Dex lands in a cage next to a… tiger?Oh well, he’s here for a good time, not a long time.Hammer isn’t letting anyone jail him. Not even his club brothers. He’s not a traitor, and he will prove it if it kills him.His ticket out of captivity appears in the form of a gay, tattooed, blond ball of chaos who seems to have a crush on him. Hammer might be straight but seduction isn’t beneath him if it gets him what he wants.To Hammer’s bewilderment, even as a hostage, Dex doesn’t stop hitting on him. Strangely, the brat’s silly smiles and motormouth begin to chip Hammer’s armor, awakening feelings he never thought himself capable of.Add to that Dex’s surprising talent for dismembering bodies, and it turns out Hammer might be the one in over his head.POSSIBLE SPOILERS:Themes: bi-awakening, grumpy/sunshine, abduction, size difference, brat, first love, revenge, enemies to lovers, betrayal, coming out, forced proximity, partners in crime, biker gang, first gay relationship, antihero, opposites attract, dark humorGenre: Scorching hot M/M dark romanceLength: ~135,000 words (Standalone)WARNING: This story contains scenes of violence, abduction, gore, offensive language and morally ambiguous characters.(Occasional attendance and participation at adult parties)",
  "genres": [
    "M M Romance",
    "Dark",
    "Dark Romance",
    "Romance",
    "BDSM",
    "Enemies To Lovers",
    "Contemporary"
  ],
  "author": "K.A. Merikan",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/60313253-d-ckhead"
}