{
  "title": "The Song of the Cell: An Exploration of Medicine and the New Human",
  "description": "Winner of the 2023 PROSE Award for Excellence in Biological and Life Sciences and the 2023 Chautauqua Prize!N amed a New York Times Notable Book and a Best Book of the Year by The Economist , Oprah Daily, BookPage, Book Riot, the New York Public Library, and more!In The Song of the Cell , the extraordinary author of the Pulitzer Prize–winning The Emperor of All Maladies and the #1 New York Times bestseller The Gene “blends cutting-edge research, impeccable scholarship, intrepid reporting, and gorgeous prose into an encyclopedic study that reads like a literary page-turner” ( Oprah Daily ).Mukherjee begins this magnificent story in the late 1600s, when a distinguished English polymath, Robert Hooke, and an eccentric Dutch cloth-merchant, Antonie van Leeuwenhoek looked down their handmade microscopes. What they saw introduced a radical concept that swept through biology and medicine, touching virtually every aspect of the two sciences, and altering both forever. It was the fact that complex living organisms are assemblages of tiny, self-contained, self-regulating units. Our organs, our physiology, our selves—hearts, blood, brains—are built from these compartments. Hooke christened them “ cells. ”The discovery of cells—and the reframing of the human body as a cellular ecosystem—announced the birth of a new kind of medicine based on the therapeutic manipulations of cells. A hip fracture, a cardiac arrest, Alzheimer’s dementia, AIDS, pneumonia, lung cancer, kidney failure, arthritis, COVID pneumonia—all could be reconceived as the results of cells, or systems of cells, functioning abnormally. And all could be perceived as loci of cellular therapies.Filled with writing so vivid, lucid, and suspenseful that complex science becomes thrilling, The Song of the Cell tells the story of how scientists discovered cells, began to understand them, and are now using that knowledge to create new humans. Told in six parts, and laced with Mukherjee’s own experience as a researcher, a doctor, and a prolific reader, The Song of the Cell is both panoramic and intimate—a masterpiece on what it means to be human.“In an account both lyrical and capacious, Mukherjee takes us through an evolution of human from the seventeenth-century discovery that humans are made up of cells to our cutting-edge technologies for manipulating and deploying cells for therapeutic purposes” ( The New Yorker).",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Medicine",
    "History",
    "Health",
    "Audiobook"
  ],
  "author": "Siddhartha Mukherjee",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/60321392-the-song-of-the-cell"
}