{
  "title": "Life after Capitalism: The Meaning of Wealth, the Future of the Economy, and the Time Theory of Money",
  "description": "Author of national bestseller Life After Google and generation-defining Wealth and Poverty , venture capitalist, futurist, and pioneering thinker extraordinaire George Gilder pinpoints how the clash of creativity with power at the heart of economic systems leads to global cognitive dissonance and argues that the creation of the novel taps capitalism's infinite promise and is humanity's only path of escape from stagnation and tyranny. Gilder once more rocks the archetypes of modern information theory and economics with a paradigm-shifting salvo of sheer brilliance.The capitalist era is over—get ready for life after capitalism.For more than two hundred years, capitalism spread wealth around the globe, bringing unprecedented prosperity and progress, liberating human potential. But something has gone terribly wrong in the world economy.Creativity and faith in the future—capitalism’s crucial ingredients—seem to have run out. The elites think they can maintain a nation’s wealth by printing money and investing it in favored industries. Their trust in bureaucratic experts, their cautionary paranoia, and their delusional belief that they can “control” everything from the spread of a virus to the weather, are sucking the life out of the economy. Ordinary people, their freedoms restricted, their prospects dim, are losing their faith in their institutions.Such misguided corporatism and pride, confusion and despair, are the result of a deep misunderstanding of capitalism itself.The bestselling futurist and venture capitalist George Gilder explains why economics is not an incentive system to be manipulated but an information system to be freed. Material resources are essentially as plentiful as the atoms of the universe. What drives economic growth in a free market is our limitless human ingenuity and creativity.Prophetic, inspiring, and paradigm-shifting, Life after Capitalism is a once-in- a-generation classic.",
  "genres": [
    "Economics",
    "Politics",
    "Business",
    "Nonfiction",
    "Finance",
    "Personal Development"
  ],
  "author": "George Gilder",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/60321119-life-after-capitalism"
}