{
  "title": "Gilded Mountain",
  "description": "This “stellar read” (Los Angeles Times) is an exhilarating tale of an unforgettable young woman who bravely exposes the corruption that enriched her father’s employers in early 1900s Colorado.In a voice infused with sly humor, Sylvie Pelletier recounts leaving her family’s snowbound mountain cabin to work in a manor house for the Padgetts, owners of the marble-mining company that employs her father and dominates the town. Sharp-eyed Sylvie is awed by the luxury around her; fascinated by her employer, the charming “Countess” Inge, and confused by the erratic affections of Jasper, the bookish heir to the family fortune. Her fairy-tale ideas take a dark turn when she realizes the Padgetts’ lofty philosophical talk is at odds with the unfair labor practices that have enriched them. Their servants, the Gradys, formerly enslaved people, have long known this to be true and are making plans to form a utopian community on the Colorado prairie.Outside the manor walls, the town of Moonstone is roiling with discontent. A handsome union organizer, along with labor leader Mary Harris “Mother” Jones, is stirring up the quarry workers. The editor of the local newspaper—a bold woman who takes Sylvie on as an apprentice—is publishing unflattering accounts of the Padgett Company. Sylvie navigates vastly different worlds and struggles to find her way amid conflicting loyalties. When the harsh winter brings tragedy, Sylvie decides to act.Drawn from true stories of Colorado history, Gilded Mountain is a tale of a bygone American West seized by robber barons and settled by immigrants, and is a story imbued with longing—for self-expression and equality, freedom and adventure.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Adult",
    "Book Club",
    "Adult Fiction"
  ],
  "author": "Kate Manning",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/60321424-gilded-mountain"
}