{
  "title": "Terror's Sword, A Kyle McEwan Novel",
  "description": "2023 GOLD MEDAL WINNER - Military Writers Society of America AMAZON #1 BESTSELLERTwo dangerous weapons barrel toward each other: an anonymous revenge-fueled terrorist determined to destroy America and the only man who can stop him.An attacker known as Terror’s Sword is heading for the U.S. with an undetermined bioweapon. When intelligence agencies fail to identify the terrorist or his bioagent, the president taps elite counterterrorism operative Kyle McEwan to hunt down the terrorist and eliminate the threat.Tracking the terrorist across multiple continents, McEwan and U.S. special operations forces execute raids yielding crucial evidence that unmasks the terror mastermind and identifies his bioagent. Despite these discoveries, scientists conclude the genetically altered virus cannot be defeated.Embedded terror cells and obstructive deep-state factions impede McEwan’s search, increasing the likelihood of an attack on America, leaving the world to face an unprecedented pandemic threatening untold millions. Global survival rests on McEwan’s shoulders with the mastermind on the loose and his bioweapon strike imminent. Who prevails?Following in the footsteps of iconic characters such as Clancy’s Jack Ryan, Child’s Jack Reacher, Ludlum’s Jason Bourne, and Thor’s Scot Harvath, Kyle McEwan confronts the evil forces threatening his nation and the world.AWARDS:Amazon #1 Bestseller in Espionage Thrillers, Political Thrillers & Suspense, and Action ThrillersMilitary Writers Society of America – 2023 Gold Medal Winner Mystery/ThrillerKiller Nashville Silver Falchion Award – Finalist, Best ThrillerReaders Favorite – Award Winner, Fiction Terrorism ThrillerNational Indie Excellence Awards – Finalist, ThrillerGlobal Thriller High Stakes Fiction – Finalist, Chanticleer International Book AwardInternational Adventure Writers/Clive Cussler – Semi-Finalist, AdventureKindle Book Awards – Semi-Finalist, ThrillerParis Book Festival – Honorable Mention, FictionNew York Book Festival – Honorable Mention, General FictionNew England Book Festival – Honorable Mention, General FictionClue Mysteries Award – Shortlist, Thriller & Suspense AwardTerror’s Sword “definitely satisfies as the pace never falters, the cutting-edge timely plot never stumbles and the ending delivers. A romp of a read.”—Steve Berry, New York Times and International #1Bestselling Author“A powerful saga that blends high-octane action, psychological interplays, and acts of political desperation that probe presidential actions, traps, moves and countermoves, and special ops processes…” —Midwest Book Review “…A fast-paced, spellbinding plot that takes readers on suspense-filled missions to save the world. Readers will love this breathtaking action-packed thriller!” —San Francisco Book Review“…The story will appeal to fans of international spy thrillers. Because of the success of authors like Clancy, the bar in this genre is set very high, but Kuhens met the challenge.” —Writer’s Digest“Terror’s Sword is a counterterrorism espionage thriller that goes into the deep state, politics at its absolute worst, and the heroism of those trying to do what’s right inside government. Kuhens knocks it out of the park with this one.” —Grant Stinchfield, Four-time Emmy Award-winning investigative reporter/national podcaster“…Terror’s Sword is a highly distinctive work with memorable characters, fast-paced storyline, and superb combination of suspense and intrigue that will keep readers on the hook until the very end.” —BookLife",
  "genres": [
    "Thriller",
    "Suspense"
  ],
  "author": "Kevin Kuhens",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/60317940-terror-s-sword-a-kyle-mcewan-novel"
}