{
  "title": "The Minus-One Club",
  "description": "From the Coretta Scott King and Printz Honor-winning author of How It Went Down , Light It Up , and Revolution In Our Time comes a moving contemporary YA novel about the bonds between a group of teens whose lives have been upended by tragedy.Fifteen-year-old Kermit Sanders knows grief and its all-encompassing shadows. After losing his beloved older sister in a tragic car accident, nothing quite punctures through the feelings of loss. Everywhere Kermit goes, he is reminded of her.But then Kermit finds a mysterious invitation in his locker, signed anonymously with \"-1.\" He has no idea what he's in for, but he shows up to find out. Dubbed the \"Minus-One Club,\" a group of his schoolmates has banded together as a form of moral support. The members have just one thing in common―they have all suffered the tragic loss of someone they loved.The usual dividing lines between high school classes and cliques don’t apply inside the Minus-One Club, and Kermit’s secret crush, the handsome and happy-go-lucky Matt (and only out gay student at school), is also a part of the group. Slowly, Matt's positive headstrong approach to life helps relieve Kermit of his constant despair.But as Kermit grows closer to Matt, the light of his new life begins to show the cracks beneath the surface. When Matt puts himself in danger by avoiding his feelings, Kermit must find the strength to not only lift himself back up but to help the rest of the group from falling apart.Praise for The Minus-One Club\"This evocative exploration of grief, sexual identity, and personal spirituality will be a boon to any teen grappling with these issues.\" – Horn Book\"Magoon thoughtfully includes themes relating to depression, suicide, identity and religious expression as she compassionately builds Kermit's complicated, sensitive inner life and depicts the various ways people might respond to the loss of a loved one.\" - Shelf Awareness starred review",
  "genres": [
    "Young Adult",
    "LGBT",
    "Contemporary",
    "Romance",
    "Audiobook",
    "Realistic Fiction",
    "Grief"
  ],
  "author": "Kekla Magoon",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/60316977-the-minus-one-club"
}