{
  "title": "Tread of Angels",
  "description": "Celeste, a card sharp with a penchant for trouble, takes on the role of advocatus diaboli, to defend her sister Mariel, accused of murdering a Virtue, a member of the ruling class in the mining town of Goetia, in a new world of dark fantasy.High in the remote mountains, the town of Goetia is booming as prospectors from near and far come to mine the powerful new element Divinity. Divinity is the remains of the body of the rebel Abaddon, who fell to earth during Heaven's War, and it powers the world’s most inventive and innovative technologies, ushering in a new age of progress. However, only the descendants of those that rebelled, called Fallen, possess the ability to see the rich lodes of the precious element. That makes them a necessary evil among the good and righteous people called the Elect, and Goetia a town segregated by ancestry and class.Celeste and Mariel are two Fallen sisters, bound by blood but raised in separate worlds. Celeste grew up with her father, passing in privileged Elect society, while Mariel stayed with their mother in the Fallen slums of Goetia. Upon her father’s death, Celeste returns to Goetia and reunites with Mariel. Mariel is a great beauty with an angelic voice, and Celeste, wracked by guilt for leaving her sister behind, becomes her fiercest protector.When Mariel is accused of murdering a Virtue, the powerful Order of the Archangels that rule Goetia, Celeste must take on the role of Advocatus Diaboli (Devil’s Advocate) and defend her sister in the secretive courts of the Virtue. Celeste, aided by her ex-lover, Abraxas, who was once one of the rebels great generals, sets out to prove Mariel innocent. But powerful forces among the Virtues and the Elect mining barons don’t want Celeste prying into their business, and Mariel has secrets of her own. As Celeste is drawn deeper into the dark side of Goetia, she unravel a layer of lies and manipulation that may doom Mariel and puts her own immortal soul at risk, in this dark fantasy noir from the bestselling mastermind Rebecca Roanhorse.",
  "genres": [
    "Fantasy",
    "Mystery",
    "Novella",
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Adult"
  ],
  "author": "Rebecca Roanhorse",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/60321430-tread-of-angels"
}