{
  "title": "Lies My Gov't Told Me: And the Better Future Coming",
  "description": "A WALL STREET JOURNALNATIONAL BESTSELLER*AS SEEN ON TUCKER CARLSON TODAY AND THE JOE ROGAN EXPERIENCE*A guide for the times—breaking down the lies about COVID-19 and shedding light on why we came to believe them.    When he invented the original mRNA vaccine technology as a medical and graduate student in the late 1980s, Robert Malone could not have imagined that he would become a leader in a movement to expose the dangers of mRNA vaccines that billions of people have received—too often without being informed of the risks.   For voicing opposition to the “mainstream” narrative, Dr. Robert Malone was censored by Big Tech and vilified by the media. But he continues to speak out and alert the world to the web of lies that we have all experienced. From vaccine safety and effectiveness to early treatments like ivermectin, to lockdowns, masks, and more, Dr. Malone is the signature dissident voice telling the other side of the story about COVID, the role of corporate media, censorship, propaganda, and the brave new world of transhumanism promoted by the World Economic Forum and its acolytes.   What effect did the COVID policies have on lives, livelihoods, and democracies? How is it possible that the lies spread by governments would persist, and that our institutions would fail to correct them? Lies My Gov’t Told Me takes a hard look at these questions and illustrates how data, information, and psychology have been distorted during the pandemic.    Governments intentionally weaponized fear to mold behavior. The media smeared anyone who objected to the narrative. And Big Pharma—aligned with larger globalist interests exemplified by the likes of Bill Gates and the World Economic Forum—had captured the agencies that are supposed to regulate it long before the pandemic began. Dr. Malone explores these perverse connections between Pharma, government, and media, and tells us what can be done about it.   With contributed chapters from other leading thinkers, such as Dr. Paul Marik and Professor Mattias Desmet, and drawing upon history, psychology, and economics, Lies My Gov’t Told Me looks at COVID from numerous angles. Never satisfied with a simple answer or easy solution, Dr. Malone proposes multiple action plans for a better future.   Dr. Malone calls on each of us to find our own solutions, our own ways to resist the control of fascist, corporatist, and totalitarian overlords. If we are to step out of the darkness—toward a world that defends the principles of the Constitution, upholds individual rights, and honors free speech—we all must play a part in the transition.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Health",
    "History",
    "Science",
    "Conspiracy Theories",
    "Vaccines"
  ],
  "author": "Robert W. Malone",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/60317267-lies-my-gov-t-told-me"
}