{
  "title": "The Yankee Years",
  "description": "Twelve straight playoff appearances. Six American League pennants. Four World Series titles. This is the definitive story of a dynasty: the Yankee yearsWhen Joe Torre took over as manager of the New York Yankees in 1996, the most storied franchise in sports had not won a World Series title in eighteen years. The famously tough and mercurial owner, George Steinbrenner, had fired seventeen managers during that span. Torre's appointment was greeted with Bronx cheers from the notoriously brutal New York media, who cited his record as the player and manager who had been in the most Major League games without appearing in a World SeriesTwelve tumultuous and triumphant years later, Torre left the team as the most beloved and successful manager in the game. In an era of multimillionaire free agents, fractured clubhouses, revenue-sharing, and off-the-field scandals, Torre forged a team ethos that united his players and made the Yankees, once again, the greatest team in sports. He won over the media with his honesty and class, and was beloved by the fans.But it wasn't easy.Here, for the first time, Joe Torre and Tom Verducci take us inside the dugout, the clubhouse, and the front office in a revelatory narrative that shows what it really took to keep the Yankees on top of the baseball world. The high-priced ace who broke down in tears and refused to go back to the mound in the middle of a game. Constant meddling from Yankee executives, many of whom were jealous of Torre's popularity. The tension that developed between the old guard and the free agents brought in by management. The impact of revenue-sharing and new scouting techniques, which allowed other teams to challenge the Yankees' dominance. The players who couldn't resist the after-hours temptations of the Big Apple. The joys of managing Derek Jeter and Mariano Rivera, and the challenges of managing Alex Rodriguez and Jason Giambi. Torre's last year, when constant ultimatums from the front office, devastating injuries, and a freak cloud of bugs on a warm September night in Cleveland forced him from a job he loved.Through it all, Torre kept his calm, kept his players' respect, and kept winning.And, of course, The Yankee Years chronicles the amazing stories on the diamond. The stirring comeback in the 1996 World Series against the heavily favored Braves. The wonder of 1998, when Torre led the Yanks to the most wins in Major League history. The draining and emotional drama of the 2001 World Series. The incredible twists and turns of the epic Game 7 of the 2003 American League Championship Series against the Red Sox, in which two teams who truly despised each other battled pitch by pitch until the stunning extra-inning home run.Here is a sweeping narrative of Major League Baseball in the Yankee era, a book both grand in its scope and fascinating in its details.",
  "genres": [
    "Sports",
    "Baseball",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "New York"
  ],
  "author": "Joe Torre",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/6033465-the-yankee-years"
}