{
  "title": "Harm None",
  "description": "MURDEROUS SATAN WORSHIPPING WITCHES When a young woman is ritualistically murdered in her Saint Louis apartment with the primary clue being a pentacle scrawled in her own blood, police are quick to dismiss it as a cult killing. Not one for taking things at face value, city homicide detective Ben Storm calls on his long time friend, Rowan Gant-- a modern day practicing Witch-- for help. In helping his friend, Rowan discovers that the victim is one of his former pupils. Even worse, the clues that he helps to uncover show that this murder is only a prelude to even more ritualistic bloodletting for dark purposes. As the body count starts to rise, Rowan is suddenly thrust into an investigation where not only must he help stop a sadistic serial killer, but also must fight the prejudices and suspicions of those his is working with--including his best friend. About the Author: Born February 20, 1962, M. R. Sellars has studied many different religions and belief systems, both mainstream and obscure. To this day Sellars remains an avid student of the religious diversity which surrounds us, and often gives group lectures on request in order to help dispel the many myths and misconceptions that surround the practice of WitchCraft.An avid member of The Nature Conservancy and the World Wildlife Fund, Sellars resides in St. Louis with Kathy, his wife of twelve years, and their daughter Willow Ann. Locally, their home is known to be a haven for neglected and abused animals, and the ever changing population stands for the moment at one dog and eight cats. Currently, Sellars is collaborating on a cookbook, as well as researching the third novel in the Rowan Gant Investigation Series. M. R. Sellars is the recipient of the Linda White Literary Excellence and Silver Quill Awards for the short stories upon which Harm None, the first Rowan Gant Mystery novel is based.",
  "genres": [
    "Mystery",
    "Urban Fantasy",
    "Paranormal",
    "Fantasy",
    "Fiction",
    "Witches",
    "Paranormal Mystery"
  ],
  "author": "M.R. Sellars",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/603500.Harm_None"
}