{
  "title": "Children of Ragnarok",
  "description": "Sweeping adventure, breathtaking twists of fate, and immersive worlds based in Norse mythology are woven into this first volume of the Runestone Saga, from the New York Times bestselling author of the Seven Realms and Shattered Realms series.Ever since Ragnarok—the great war between the gods and the forces of chaos–the human realm of the Midlands has become a dangerous place, bereft of magic, where most lead lives of desperation.Sixteen-year-old Eiric Halvorsen is among the luckier ones. Between fishing, going vikingr, and working his modir’s farm, the family has remained prosperous. But Eiric stands to lose everything when he’s convicted by a rigged jury of murdering his modir and stepfadir. Also at risk is his half-systir, Liv, whose interest in seidr, or magic, has made her a figure of suspicion. Then a powerful jarl steps in: He will pay the blood price if Eiric will lead a mission to the fabled Temple at the Grove—the rich stronghold of the wyrdspinners, the last practitioners of sorcery.Spellsinger, musician, and runecaster Reggin Eiklund has spent her life traveling from town to town, performing at alehouses all for the benefit of her master, Asger, the fire demon she is desperate to escape. Then after one performance that amazes even Reggin herself, two wyrdspinners in the audience make her an irresistible offer: return with them to the temple to be trained in seidr, forever free of Asger.Eiric, Liv, and Reggin’s journeys converge in New Jotunheim, the site of the Temple at the Grove, a paradise fueled by magic. They soon realize that a great evil lurks beneath the dazzling surface, and that old betrayals and long-held grudges may fuel another cataclysmic war. It will require every gift and weapon at their command to prevent it.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Mythology",
    "Young Adult Fantasy",
    "Retellings",
    "Fiction",
    "Adventure"
  ],
  "author": "Cinda Williams Chima",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/60350090-children-of-ragnarok"
}