{
  "title": "Mountain Menace",
  "description": "Monsters come in all shapes and sizes. Some prefer to own you, some demand to chase you, others crave to destroy you in the most beautiful ways possible.Hardley (Lee) Denim WalshWhen you’re the evil daughter of the notorious Everglades Serial Killer, raised on abuse and the dark deeds done to seventeen innocent victims, the last thing you want to do is look backwards.I did my time, the therapy and was looking forward to a future where I could control my destiny. The misty peaks of the Appalachian Mountains seemed far enough removed for me to relax.But my dreams are shattered when an afternoon hike with my real estate agent turned into a violent and bloody hunt for revenge. Too bad these good old boys of “back woods justice” underestimated this out-of-shape Florida foreigner.Two of them fled wounded and bleeding, but my hand did not kill the third.Rescued by three mysterious mountain men, they took my broken body to their remote homestead… and healed more than just my carcass.Each obsessive, animalistic male filled the holes my treacherous upbringing gouged out of me. Daddy Bear is the affectionate and approving authority my childhood lacked.Caretaker Silas fills my soul the way my mother should have.Femboy Cassius is hilarious, passionate chaos in a world I take too seriously.Dominant Darius is… well, he’s the feral, punishing bully I secretly hunger for.As dysfunctional as they are, they might be a dream I never dared to imagine. I’m a powerful survivor, but I’ll need to be a brave warrior to get what I want. Lowering a lifetime of guarded walls takes trust I don’t possess, especially when they harbor secrets more horrific than mine.Dive into this paranormal “why choose” monster romance with dark and taboo themes today. Mature and adventurous readers who love a touch of murder and mystery with their steamy love scenes will devour Mountain Menace. Check the author’s website for specific trigger warnings and R rated content.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Shapeshifters",
    "Dark",
    "Dark Romance",
    "Romance",
    "Fae"
  ],
  "author": "A.M. Proctor",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/60348935-mountain-menace"
}