{
  "title": "The Marriage Portrait",
  "description": "An alternative cover edition for this ISBN can be found here.The author of award-winning Hamnet brings the world of Renaissance Italy to jewel-bright life in this unforgettable fictional portrait of the captivating young duchess Lucrezia de’ Medici as she makes her way in a troubled court.Florence, the 1550s. Lucrezia, third daughter of the grand duke, is comfortable with her obscure place in the palazzo: free to wonder at its treasures, observe its clandestine workings, and devote herself to her own artistic pursuits. But when her older sister dies on the eve of her wedding to the ruler of Ferrara, Modena and Reggio, Lucrezia is thrust unwittingly into the limelight: the duke is quick to request her hand in marriage, and her father just as quick to accept on her behalf. Having barely left girlhood behind, Lucrezia must now enter an unfamiliar court whose customs are opaque and where her arrival is not universally welcomed. Perhaps most mystifying of all is her new husband himself, Alfonso. Is he the playful sophisticate he appeared to be before their wedding, the aesthete happiest in the company of artists and musicians, or the ruthless politician before whom even his formidable sisters seem to tremble? As Lucrezia sits in constricting finery for a painting intended to preserve her image for centuries to come, one thing becomes worryingly clear. In the court’s eyes, she has one duty: to provide the heir who will shore up the future of the Ferranese dynasty. Until then, for all of her rank and nobility, the new duchess’s future hangs entirely in the balance. Full of the beauty and emotion with which she illuminated the Shakespearean canvas of Hamnet, Maggie O’Farrell turns her talents to Renaissance Italy in an extraordinary portrait of a resilient young woman’s battle for her very survival.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Audiobook",
    "Italy",
    "Literary Fiction"
  ],
  "author": "Maggie O'Farrell",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/60353768-the-marriage-portrait"
}