{
  "title": "I Might Be In Trouble",
  "description": "A suspenseful dark comedy about a struggling gay writer who wakes up to find his date from the night before dead—and must enlist the help of his literary agent to get rid of the body and spin the entire misadventure into his next big book.A few years ago, David Alvarez had it all: a six-figure book deal, a loving boyfriend, and an exciting writing career. His debut novel was a resounding success, which made the publication of his second book—a total flop—all the more devastating. Now, David is single, lonely, and desperately trying to come up with the next great idea for his third manuscript, one that will redeem him in the eyes of readers, reviewers, the entire publishing world…and maybe even his ex-boyfriend. The issue is, good ideas are hard to come by, and the mounting pressure of a near-empty bank account isn’t helping. But when David connects with a sexy stranger on a dating app, he figures a wild night out in New York City may be just what he needs to get his creative juices flowing. Lucky for him, his date turns out to be handsome, confident, and charming—everything David’s been looking for, really—not to mention the perfect distraction from yet another evening staring at a blank screen. After one of the best nights of his life, David wakes up hungover but giddy—only to find prince charming dead next to him in bed. Horrified, completely confused, and suddenly faced with the implausible-but-somehow-plausible idea that he may have actually killed his date, David calls the only person he can trust in a moment of crisis: his literary agent, Stacey. Together, David and Stacey must untangle the events of the previous night, cover their tracks, and spin the entire misadventure into David’s career-defining novel—if only they can figure out what to do with the body first.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "LGBT",
    "Mystery Thriller",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Daniel  Aleman",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/128616513-i-might-be-in-trouble"
}