{
  "title": "Relatos inquietantes",
  "description": "Relatos inquietantes incluye nueve relatos: sucesos extraordinarios, visitas fantasmales, odios, celos y venganzas surgen de la mano de Violet Hunt para embrujarnos.Los relatos incluidos en este volumen son:El telegrama: Un amante incondicional espera durante toda su vida que su amada le corresponda; cuando esta por fin lo invita a cenar con la idea de pedirle matrimonio, él se encuentra muy enfermo. Nada impedirá que acuda a la cita, ni siquiera la Muerte.La operación: narra la historia de una mujer aquejada de repentinos y extraños dolores. Su marido es un famoso actor que estuvo casado con anterioridad con una actriz, practicante del ocultismo. Esta, tras el divorcio, escribió a la nueva mujer para asegurarle de que siempre estaría con ellos.Las memorias: la venganza y las extrañas convenciones sociales son las protagonistas de esta historia sobre dos mujeres enamoradas del mismo hombre.La plegaria: Una mujer, cuyo marido acaba de morir de una enfermedad repentina, rezará pidiendo que no la abandone estando embarazada. De forma extraordinaria, el hombre vuelve a respirar, pero no será el mismo durante el resto de su no vida.El carruaje: Llueve a mares en los páramos del norte; un carruaje se acerca y recoge a un viajero. Dentro del coche, los extraños pasajeros hablarán sobre sus vidas y sus muertes.La boina azul: cuenta la posible historia de una de los últimos descendientes de la familia Daunet, Christina. La familia, de tradición católica, se vio envuelta en las diferentes rebeliones jacobinas. En la última de estas, Christina ha visto partir a su prometido; lo espera, mientras su casa se viene abajo.El testigo: Un perrito será testigo del accidente que culmina con la muerte de su ama. Los dos asesinos involuntarios se verán consumidos por una espiral de culpa y locura.El barómetro: Una sequía asola un pequeño pueblo. Los hijos del pastor intentan entretenerse con diferentes actividades, aunque no lo consiguen. Están inquietos, presienten que algo va a pasar. Durante la noche, la ansiada tormenta se desata, pero con terribles consecuencias.La piel de tigre: Una mujer pretende engendrar una prole perfecta, para lo cual necesita al hombre adecuado. Sus ideales eugenésicos la lleva defender el sacrificio de los débiles. Aunque su pasado esconde un secreto terrible.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Horror"
  ],
  "author": "Violet Hunt",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/60372924-relatos-inquietantes"
}