{
  "title": "Eva's Cousin",
  "description": "Berchtesgaden, Germany, is a beautiful place, set among the gentle meadow-clad hills rising to the sheer heights of bare Alpine peaks. It is here where an elderly woman arrives and recollects her past—and her peripheral role in a chapter of world history. She walks along a beaten path, which has come into being because so many tourists have ventured this way . . . to see something that exists only in her memory.In the summer of 1944, twenty-year-old Marlene is thrilled when her older, more glamorous cousin, Eva Braun, Adolph Hitler’s mistress, invites her to come to the Fuhrer’s Bavarian mountain retreat. Against her father’s wishes, Marlene accepts, and immediately sets forth to Berghof.There, while Hitler is away desperately trying to turn the tides of war, Marlene finds herself in a strange paradise, a world of opulence and imminent danger, of freedom and surveillance. The two women sneak off and skinny-dip in a nearby-lake, watch films in the Fuhrer’s private cinema, and flirt with the SS officers at the dinner table—one of whom will become Marlene’s first lover.Initially delighted by Eva’s attentions, Marlene later tries to understand the elusive connection between her cousin and the man she loves.In quiet defiance, she begins to commit her own acts of subversion, which include listening to BBC radio broadcasts, forbidden by the Fuhrer. But a clandestine mission of mercy will force her to question her allegiance to both her cousin and her country—and to face the chilling reality that exists outside her sheltered world.Based on the true experiences of Eva Braun’s cousin, Gertrude Weisker, who has shared her memories with Sibylle Knauss after more than fifty years of silence, Eva’s Cousin is a novel that illuminates the banality of the domestic face of evil. It casts a special light on the profound questions of innocence and complicity that still haunt much of the world today.",
  "genres": [
    "Historical Fiction",
    "Germany",
    "World War II",
    "Fiction",
    "War",
    "Book Club",
    "Adult Fiction"
  ],
  "author": "Sibylle Knauss",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/603605.Eva_s_Cousin"
}