{
  "title": "Getting It Wrong",
  "description": "A deeply emotional standalone romantic suspense duet by New York Times bestselling author Michelle Mankin ADDY FOOTIT is different from most seventeen-year-olds. She doesn’t have the luxury of dreaming about her future. She must plan for it. Abandoned by her father and living with a drug addicted mother, her number one priority is taking care of her younger sister Rachel. It isn’t easy. Nothing in Southside Seattle is easy. It’s a struggle to survive. Music is Addy’s only escape from her bleak world. When she listens to it, she can pretend she is anywhere and believe anything is possible. Her handsome best friend BARRY EVANS understands her predicament. It’s not much different from his own. He is a great source of comfort and strength for her. Addy has one indulgence. COLLIN MURPHY. Her number one crush is one of the most popular guys at Southside High. Collin can have any girl he wants, and he sets his sights on Addy when her younger sister joins his rock band. The gorgeous guitarist isn’t the only one who notices how pretty Addy is. Martin Skellin, the rich and powerful owner of the club where Collin’s band ABCR performs, becomes obsessed with Addy.One man wants to win her heart.The other wants to rule her.And another could be just who she needs, but she can’t cross that line. She can’t risk losing him. Will the band ABCR become a success? Will Addy and her sister escape Southside? Will her plans secure her future or destroy it? Getting it Wrong is book one in this standalone romantic suspense duet. You will want book two, Getting it Right, as soon as you finish book one. This book contains 56 angsty chapters. It’s a page-turning story that will make you want to throw your e-reader at times. Do not read if you want a boring book. You will cry. It’s one of the most emotional romances the author has written. You will be in a book hangover and desperate for book two at the end.",
  "genres": [
    "Contemporary"
  ],
  "author": "Michelle Mankin",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/60376236-getting-it-wrong"
}