{
  "title": "More Heat Than The Sun Box Set Vol. 1",
  "description": "This box set contains the first three novels in the bestselling More Heat Than The Sun M/M Thriller series. The complete series consists of NINE thrilling, addictive novels. Start your journey with Nik and Ben here: Book 1 - Love Is A Stranger Ex-SAS soldier Ben Rider falls in love with his enigmatic married boss Sir Nikolas Mikkelsen, but Nikolas is living a lie. A lie so profound that when the shadows are lifted, Ben realises he's in love with a very dangerous stranger. Ben has to choose between Nikolas and safety, but sometimes danger comes in a very seductive package. Book 2- Conscious Decisions of the Heart Ben Rider and Nikolas Mikkelsen learn that danger comes in all shapes and sizes and often in places you least expect it. Nikolas's dark past calls to him, inexorably dragging him back into its seductive embrace. While he goes on an errand of mercy to Russia, Ben travels to Denmark to learn Nikolas's language. Convinced Russia's vastness will swallow Nikolas, Ben doesn't see the enemy much closer to home. Thinking he has lost Nikolas, Ben then makes a terrible decision that threatens to destroy everything they have together. Focused on this very personal horror, bound by a new level of commitment, they have no idea that a greater threat is coming. And when it arrives, it changes everything—even the definition of commitment. Book 3 -The Bridge of Silver Wings Nikolas and Ben discover that bonds aren't forged with blood or scars, but in the hearts of men strong enough to love. Siberia in winter isn't a place for good men. There is nothing Nikolas won't do to keep Ben alive. Nikolas has exorcised his demons, but when they end up stranded in Russia, the monster inside needs to be let loose. Ben discovers the truth of the adage, 'be careful what you wish for'! Nikolas then faces an enemy he can't defeat: Ben Rider himself. Discovering a new family, Ben realizes he's been living too long in the shadows cast by Nikolas's all-consuming love. For the first time, life apart from Nikolas is possible. Is Nikolas strong enough to let Ben go?",
  "genres": [
    "M M Romance",
    "Romance",
    "Military Fiction"
  ],
  "author": "John  Wiltshire",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/60385385-more-heat-than-the-sun-box-set-vol-1"
}