{
  "title": "Viviana Valentine Gets Her Man",
  "description": "Life as a secretary in New York just got tougher when Viviana Valentine's boss winds up dead in this debut historical mystery, perfect for fans of Susan Elia MacNeal and Frances Brody.New York City, 1950. Viviana Valentine is Girl Friday to the city’s top private investigator, Tommy Fortuna. The clients can be frustrating, and none more maddening than fabulously wealthy Tallmadge Blackstone, who demands Tommy tail his daughter, Tallulah, and find out why she won’t marry his business partner, a man forty years her senior. Sounds like an open-and-shut case for a P.I. known for busting up organized crime—but the next day, Viviana opens the office to find Tommy M.I.A. and a lifeless body on the floor. The cops swoop in and Detective Jake Lawson issues a warrant for Tommy’s arrest. Desperate to clear Tommy’s name, Viviana takes on the Blackstone case herself. When she goes out for a night on the town with the heiress, she begins to learn the secrets behind Tallulah’s life and loves—and discovers that the body in the office is none other than Tallulah’s betrothed. Meanwhile, Lawson is itching to solve his murder case, and continues harassing Viviana for answers—until she’s the victim of an attack by a group of goons hooked up with a gangster named Santino Napolitano, a.k.a. Tino the Conderoga. Tino’s connected to the death of Tommy’s brother, and now he’s trying to get to Tommy through Viviana. But Tommy’s still missing, and Tino is still out for blood. As Viviana digs into the dirty history of the Blackstone empire, she suddenly realizes the true danger at hand. Now, it’s up to her to find her missing boss and make sure she doesn’t turn up D.O.A.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Audiobook",
    "Historical Mystery",
    "Mystery Thriller",
    "Adult"
  ],
  "author": "Emily J. Edwards",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/60394499-viviana-valentine-gets-her-man"
}