{
  "title": "Under a Veiled Moon",
  "description": "In the tradition of C. S. Harris and Anne Perry, a fatal disaster on the Thames and a roiling political conflict set the stage for Karen Odden’s second Inspector Corravan historical mystery.September 1878. One night, as the pleasure boat the Princess Alice makes her daily trip up the Thames, she collides with the Bywell Castle, a huge iron-hulled collier. The Princess Alice shears apart, throwing all 600 passengers into the river; only 130 survive. It is the worst maritime disaster London has ever seen, and early clues point to sabotage by the Irish Republican Brotherhood, who believe violence is the path to restoring Irish Home Rule.  For Scotland Yard Inspector Michael Corravan, born in Ireland and adopted by the Irish Doyle family, the case presents a challenge. Accused by the Home Office of willfully disregarding the obvious conclusion, and berated by his Irish friends for bowing to prejudice, Corravan doggedly pursues the truth, knowing that if the Princess Alice disaster is pinned on the IRB, hopes for Home Rule could be dashed forever.Corrovan’s dilemma is compounded by Colin, the youngest Doyle, who has joined James McCabe’s Irish gang. As violence in Whitechapel rises, Corravan strikes a deal with McCabe to get Colin out of harm’s way. But unbeknownst to Corravan, Colin bears longstanding resentments against his adopted brother and scorns his help. As the newspapers link the IRB to further accidents, London threatens to devolve into terror and chaos. With the help of his young colleague, the loyal Mr. Stiles, and his friend Belinda Gale, Corravan uncovers the harrowing truth—one that will shake his faith in his countrymen, the law, and himself.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Historical Mystery",
    "Victorian"
  ],
  "author": "Karen Odden",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/60394673-under-a-veiled-moon"
}