{
  "title": "Drizzle, Dreams, and Lovestruck Things",
  "description": "A Children's Book Council Young Adult Favorite of 2023!A Children's Book Council Librarian Favorite of 2023!Four seasons, four sisters, and four swoon-worthy love stories come together in this multi-POV YA rom-com set on an island off the coast of the Pacific Northwest.The Singh sisters grew up helping their father navigate the bustle of the Songbird Inn. Nestled on dreamy and drizzly Orcas Island in the Pacific Northwest, the inn's always been warm and cozy and filled with interesting guests—the perfect home. But things are about to heat up now that the Songbird has been named the Most Romantic Inn in America.Nidhi has everything planned out—until a storm brings a wayward tree crashing into her life one autumn . . . and along with it, an intriguing construction worker and a yearning for her motherland. Suddenly, she's questioning everything she thought she wanted.Avani can't sit still. If she does, her grief for Pop, their dad's late husband, will overwhelm her. So she keeps moving as much as she can, planning an elaborate Winter Ball in Pop's memory. Until a blizzard traps her in a barn with the boy she accidentally stood up and has been actively avoiding ever since.Sirisha loves seeing the world through her camera, but her shyness prevents her from stepping out from behind the lens. Talking to girls is such a struggle! When a pretty actress comes to the Songbird with her theater troupe, spring has sprung for Sirisha—if only she can find the words.Rani is a hopeless romantic through and through. After gently nudging her sisters to open their hearts, she is convinced it's finally her turn to find love. When two potential suitors float in on a summer breeze, Rani is swept up in grandeur to match her wildest Bollywood dreams. But which boy is the one she's meant to be with?Ultimately, the magic of the Songbird Inn leads the tight-knit Singh sisters to new passions and breathtaking kisses—and to unearth the truest versions of themselves.Perfect for fans of Jenny Han's To All the Boys I've Loved Before , this sparkling YA rom-com celebrates sisterhood, family, and the love all around us.",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "LGBT",
    "Fiction",
    "Lesbian",
    "Young Adult Romance"
  ],
  "author": "Maya Prasad",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/60382883-drizzle-dreams-and-lovestruck-things"
}