{
  "title": "Animal Prints on My Soul",
  "description": "Animals can be our heroes, our confidantes, our coaches, and our best examples of unconditional love. In Animal Prints on My Soul, we explore the human-animal bond through the experiences and stories of women. Featuring horses, dogs, cats, birds, and more, animal lovers will connect with these ordinary – yet extraordinary – stories of how animals impact our lives. Heartwarming, touching, and joyful, this book is a splendid gift for those who love animals. The stories of Healing, Connection, and Love & Loss also encourage us to pause and appreciate the wonderful gifts our animal friends bring us so we've provided deeper-dive prompts for those who would like to transform these blessings into inspiration for their own lives. Contributors to Animal Prints on My Soul: HealingThe Wisdom of Horses – Angie PayneWhispers from an Angel – Daphne McDonaghMy Healing Journey with Animals – Diane Rose-SolomonThe Unicorn Search – Beth Lauren ParrishHealing Beauty – Ginny JablonskiConnectionA Friend by My Side – Marla PatrickMy First Best Friend – Deb MatlockFor the Children – Lorie MurpheyA Horse, a Boy, and Undying Love – Naomi McDonaldLessons from a Red-Tailed Hawk – Linda RobertsA Divine Communication – Esta BernsteinWhat It Means to Be a Red Barn Horse – Alexis BraswellFarm Girl Memories – Abigail StimpertWhen God Says, \"Wait.\" – Hannah StimpertLetting Go and Holding On – Donna PalamarGabriel's Story – Sharon Dilley26 Marathons and My Trainer – Jo DibbleeLeadership in Flight – Haseena PatelLove and LossLead with Love – Kate NeliganSpirit Animals – Stef SkupinCountry Life – Joyce People vs. Dogs – Katherine JensenBecoming the Community Cat Lady – Kathy Lynn MackisonGrief, Death, and Dying – Tracy PierceHorse, Heart, and Home – Ley-Anne MountainWhen Fate Brings You Fur Kids – Jean Brannon",
  "genres": [],
  "author": "Candace Gish",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/60390321-animal-prints-on-my-soul"
}