{
  "title": "Breathless: The Scientific Race to Defeat a Deadly Virus",
  "description": "National Book Award finalist Breathless tells the story of the worldwide scientific race to decipher the coronavirus SARS-CoV-2, trace its source, and make possible the vaccines to fight the Covid-19 pandemic— a “l uminous, passionate account of the defining crisis of our time.” ( The New York Times ).Breathless is a “gripping” ( The Atlantic ) but “clear-eyed analysis” ( Time ) of SARs-CoV-2 and its fierce journey through the human population, as seen by the scientists who study its origin, its ever-changing nature, and its capacity to kill us. David Quammen expertly shows how strange new viruses emerge from animals into humans as we disrupt wild ecosystems and how those viruses adapt to their human hosts, sometimes causing global catastrophe. He explains why this coronavirus will probably be a “forever virus,” destined to circulate among humans and bedevil us endlessly, in one variant form or another. As scientists labor to catch it, comprehend it, and control it, with their high-tech tools and methods, the virus finds ways of escape.Based on interviews with nearly one hundred scientists, including leading virologists in China and around the world, Quammen explains -Infectious disease experts saw this pandemic coming-Some scientists, for more than two decades, warned that “the next big one” would be caused by a changeable new virus—very possibly a coronavirus—but such warnings were ignored for political or economic reasons-The precise origins of this virus may not be known for years, but some clues are compelling, and some suppositions can be dismissed-And much moreWritten by “one of our finest explainers of the natural world for decades” ( Chicago Tribune ), This “compelling and terrifying” ( The New York Times ) account is an unparalleled look inside the frantic international race to understand and control SARS-CoV-2—and what it might mean for the next potential global health crisis.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Health",
    "Medicine",
    "Biology",
    "Audiobook"
  ],
  "author": "David Quammen",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/60384070-breathless"
}