{
  "title": "Ward",
  "description": "Before she was his little one, she was his ward.GraceThe fire stole everything from me.I was orphaned and homeless, my family’s estate locked in a trust I couldn’t touch until my birthday. I didn’t know what to expect when my father’s estranged step-brother, my new guardian, came to collect me.Handsome, patient, brooding. Aidan was the opposite of the rage-filled monster who’d raised me. But I soon learned that my guardian harbored sadistic whims of his own.I listened at doors and peered behind curtains. I saw things I shouldn’t have, things that made my pulse race and my heart beat faster.Things I desperately want him to do to me.AidanMy desires are unconventional.Grace is too pure, too innocent for the things I would do to her untouched body. Yet a twisted part of me longs to see how she’d look on her knees, bound in leather, her silken skin bearing my marks. I’ll permit her to serve me if she promises to play by my rules.If only I could stop myself from breaking them.As her guardian, I’m charged with keeping her safe, and I take that responsibility to heart. But the devastating secrets I carry refuse to remain in the dark.This love will burn us alive, but I’ll walk through fire before I let the flames touch my little one.Author's Note: This title contains dark tropes and sensitive themes, including a highly taboo romance pairing, a 20+ year age gap, physical and domestic violence, suicide, and assault. This is NOT a safe romance, though it does end in a HEA. For a complete list of potentially troubling themes, please visit Margot Scott's website.Ward was originally published in the Killing Me Softly anthology. It is now available as a standalone novel with a new cover and a steamy bonus epilogue.",
  "genres": [
    "BDSM",
    "Dark Romance",
    "Romance",
    "Dark",
    "Contemporary",
    "Erotica",
    "Contemporary Romance"
  ],
  "author": "Margot Scott",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/60388190-ward"
}