{
  "title": "How to Sharpen Pencils: A Practical and Theoretical Treatise on the Artisanal Craft of Pencil Sharpening for Writers, Artists, Contractors, Flange Turners, Anglesmiths, & Civil Servants",
  "description": "A hilarious guide to the lost art of artisanal pencil sharpening\"...I am so thrilled David Rees is picking up the reins of the forgotten art of manual graphite-encased-in-wood point-crafting. I love my pencil!\"—AMY SEDARIS\"You may think that sharpening a pencil is easy, but David Rees makes it look hard, and that makes all the difference.\"—JOHN HODGMAN\"Truly, my life before I was presented with correctly sharpened pencils by an artisan was a dull and ill-sharpened void. Learn from my mistakes.\"—NEIL GAIMANHave you got the right kind of point on your pencil? Do you know how to achieve the perfect point for the kind of work you need out of that pencil?Deep in New York’s Hudson River Valley, craftsman David Rees—the world’s number one #2 pencil sharpener—still practices the age-old art of manual pencil sharpening. In 2010, he began offering his artisanal service to the world, to the jubilation of artists, writers, draftsmen, and standardized test takers.Now, Rees presents a book that is both a manifesto and a fully-illustrated walk-through of the many, many, many ways to sharpen a pencil. Including chapters on equipment, current practice, and modern technologies, it also points at new trends in sharpening, including \"Celebrity Impression Pencil Sharpening (CIPS),\" a warning about the “Psychological Risks Associated with Pencil Sharpening,” and a survey of \"Wines that tastes like pencils.\"As Rees \"Sharpening pencils should be an activity that enriches the senses.\"And if you think it’s a joke, why don’t you poke yourself with your newly sharpened pencil? Or better yet, don’t—because it’ll really hurt.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Comedy",
    "Art",
    "How To",
    "Writing",
    "Business"
  ],
  "author": "David Rees",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/12862903-how-to-sharpen-pencils"
}