{
  "title": "Origins of The Wheel of Time: The Legends and Mythologies that Inspired Robert Jordan",
  "description": "“Jordan has come to dominate the world Tolkien began to reveal.” ― The New York Times on The Wheel of Time® seriesExplore never-before-seen insights into the Wheel of Time, - A brand-new, redrawn world map by Ellisa Mitchell using change requests discovered in Robert Jordan's unpublished notes- An alternate scene from an early draft of The Eye of the World- The long-awaited backstory of Nakomi- 8 page, full color photo insertTake a deep dive into the real-world history and mythology that inspired the world of Robert Jordan's The Wheel of Time®. Origins of The Wheel of Time is written by Michael Livingston, Secretary-General of the United States Commission on Military History and professor of medieval literature at The Citadel, with a Foreword by Harriet McDougal, Robert Jordan's editor, widow, and executor of his estate.This companion to the internationally bestselling series delves into the creation of Robert Jordan’s masterpiece, drawing from interviews and an unprecedented examination of his unpublished notes. Michael Livingston tells the behind-the-scenes story of who Jordan was, how he worked, and why he holds such an important place in modern literature.The second part of the book is a glossary to the “real world” in The Wheel of Time. King Arthur is in The Wheel of Time. Merlin, too. But so are Alexander the Great and the Apollo Space Program, the Norse gods and Napoleon’s greatest defeat―and so much more.Origins of The Wheel of Time provides exciting knowledge and insights to both new and longtime fans looking to either expand their understanding of the series or unearth the real-life influences that Jordan utilized in his world building―all in one, accessible text.",
  "genres": [
    "Fantasy",
    "Mythology",
    "Reference",
    "Audiobook",
    "Books About Books",
    "Fiction",
    "Literary Criticism"
  ],
  "author": "Michael Livingston",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/60405297-origins-of-the-wheel-of-time"
}