{
  "title": "Taking Care of You: The Empowered Woman’s Guide to Better Health",
  "description": "A practical and extensive resource guide by Mayo Clinic Press for women who want to understand and take charge of their own health, presented in short, easy-to-digest chapters. Women do not always receive the same healthcare as men. In fact, for too long medicine has not recognized that numerous health conditions — like heart disease, stroke, stress, mental health and more — impact women differently than men. Orthopedic surgeon Mary I. O’Connor and medical anthropologist Kanwal L. Haq want to change that by empowering women with knowledge about the current landscape of women’s health, and showing them how to actively engage with their healthcare team. In a groundbreaking publication, Taking Care of The Empowered Woman’s Guide to Better Health , O’Connor and Haq have enlisted 111 leading women physicians and health experts from all across the country to create a practical resource guide for women to improve their health and obtain better healthcare. Taking Care of You is refreshingly supportive and jargon-free, with colorful illustrations to help the reader better understand what can often be dense medical information. Its unique approach includes three main WOMEN AND THE CURRENT HEALTH LANDSCAPE includes topics COMMON CLINICAL CONDITIONS IMPACTING WOMEN focuses on 55 non-reproductive clinical conditions that impact women more than men, or differently than men. They Each chapter is divided into subsections that   Taking Care of You focuses on activities women can do everyday — like eating well, sleeping and exercising — and how to effectively engage in these pillars of health to take better care of themselves.Taking Care of You is an easy-to-use and accessible guide to be shared between mother and daughter, sister, aunt, and grandmother — an essential resource for every woman, and those who love her.",
  "genres": [
    "Nonfiction",
    "Health"
  ],
  "author": "Mary I. O'Connor",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/60407667-taking-care-of-you"
}