{
  "title": "Now Is Not the Time to Panic",
  "description": "From the New York Times bestselling author of Nothing to See Here comes an exuberant, bighearted novel about two teenage misfits who spectacularly collide one fateful summer, and the art they make that changes their lives forever.Sixteen-year-old Frankie Budge—aspiring writer, indifferent student, offbeat loner—is determined to make it through yet another sad summer in Coalfield, Tennessee, when she meets Zeke, a talented artist who has just moved into his grandmother’s unhappy house and who is as lonely and awkward as Frankie is. Romantic and creative sparks begin to fly, and when the two jointly make an unsigned poster, shot through with an enigmatic phrase, it becomes unforgettable to anyone who sees it. The edge is a shantytown filled with gold seekers. We are fugitives, and the law is skinny with hunger for us.The posters begin appearing everywhere, and people wonder who is behind them. Satanists, kidnappers—the rumors won’t stop, and soon the mystery has dangerous repercussions that spread far beyond the town. The art that brought Frankie and Zeke together now threatens to tear them apart.Twenty years later, Frances Eleanor Budge—famous author, mom to a wonderful daughter, wife to a loving husband—gets a call that threatens to upend everything: a journalist named Mazzy Brower is writing a story about the Coalfield Panic of 1996. Might Frances know something about that? And will what she knows destroy the life she’s so carefully built?A bold coming-of-age story, written with Kevin Wilson’s trademark wit and blazing prose, Now Is Not The Time to Panic is a nuanced exploration of young love, identity, and the power of art. It’s also about the secrets that haunt us—and, ultimately, what the truth will set free.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Coming Of Age",
    "Literary Fiction",
    "Young Adult",
    "Book Club"
  ],
  "author": "Kevin    Wilson",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/60415700-now-is-not-the-time-to-panic"
}