{
  "title": "We Should Not Be Friends: The Story of a Friendship",
  "description": "A warm, funny, irresistible book that follows an improbable and life-changing college friendship over the course of forty years--from the best-selling author of The End of Your Life Book Club A \"searching, tender, insightful, and wise memoir...Reading this beautifully written and generous book, you will find yourself thinking of your own friendships\" --Dani Shapiro, author of Signal Fires By the time Will Schwalbe was a junior at college, he had already met everyone he cared to know: the theater people, writers, visual artists and comp lit majors, and various other quirky characters including the handful of students who shared his own major, Latin and Greek. He also knew exactly who he wanted to avoid: the jocks. The jocks wore baseball caps and moved in packs, filling boisterous tables in the dining hall, and on the whole seemed to be another species entirely, one Will might encounter only at his own peril.All this changed dramatically when Will collided with Chris Maxey, known to just about everyone as Maxey. Maxey was physically imposing, loud, and a star wrestler who was determined to become a Navy SEAL (where he would later serve for six years). Thanks to the strangely liberating circumstances of a little-known secret society at Yale, the two forged a bond that would become a mainstay of each other's lives as they repeatedly lost and found each other and themselves in the years after graduation.From New Haven to New York City, from Hong Kong and Panama to a remarkable school on an island in the Bahamas--through marriages and a divorce, triumphs and devastating losses--We Should Not Be Friends tracks an extraordinary friendship over decades of challenge and change. Schwalbe's marvelous new work is, at its heart, a joyful testament to the miracle of human connection--and how if we can just get past our preconceptions, we may find some of our greatest friends.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "Book Club",
    "LGBT"
  ],
  "author": "Will Schwalbe",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/60410729-we-should-not-be-friends"
}