{
  "title": "Heart of the Earth: A Fantastic Mythical Adventure of Courage and Hope, Bound by a Shared Destiny",
  "description": "A Celtic Tale of Myth and MagicWhere light and dark converge, and reality and fantasy blur, is there another world where mysterious forces can intervene and restore peace back to the earth? A cautionary tale that offers inspiration and hope in uncertain times.Peter Goodhope is a master of pen and ink, a painter of fairy-tale landscapes. Secret forests, hidden valleys and cloud-covered mountains become inhabited with animals he’d known as a child; owls under moonlight, badgers in the woods at dawn, foxes posturing on the evening hills—human-like in their pose, bringing a magical realism to his work. But when Peter returns home to his childhood village of Nemeton, he soon discovers the charming, once peaceful countryside he so fondly remembers, may be hiding something more maleficent.Looking for inspiration to begin writing his book, unlikely allies enter Peter's life in the form of woodland creatures, seeking his help to defeat evil poachers decimating the wildlife. Peter must enter their world, learn to speak their language, and prepare the wandering band for an unearthly, climactic battle. Can Peter find the key to their salvation? Does he have the resources to save the animals from their darkest hour and restore peace to the land? The boundary between what is real and what is imagined begins to blur.Weaving a subtle blend of Gaelic languages into the story (Cornish, Irish, Scottish and Welsh), mythological and mystical insights reveal the magical realm of nature and the natural life-healing power of the earth. These ancient languages unveil the secrets and hidden meanings of the origin of words and their connection to the very fabric of nature.A glossary (Insights) is included for easy reference to all places and character names that reference Celtic terminologies.One of the endearing qualities of Heart of the Earth is its sense of nostalgia, both for a closer relationship with nature and a simpler, old-time England—a land steeped in Celtic lore and legend.A timely allegorical novel on friendship, acceptance, and cooperation.AVAILABLE ON AMAZON",
  "genres": [
    "Magical Realism",
    "Fantasy"
  ],
  "author": "Robin Craig Clark",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/60420975-heart-of-the-earth"
}