{
  "title": "Sugar Street",
  "description": "Publishing for the first time with Grove Atlantic, Pulitzer Prize finalist and celebrated author of seven novels Jonathan Dee delivers a daring, tense, ticking time bomb of a novel about an anonymous white man on the run from his own identity.“This propulsive and furious book is as fun to read as it is relentless and unsparing. Deranged and faltering America, Jonathan Dee has your number.” —Joshua Ferris, author of The Dinner PartyIn Jonathan Dee’s elegant and explosive new novel, Sugar Street, an unnamed male narrator has hit the road. Rid of any possible identifiers, his possessions amount to $168,548 in cash stashed in an envelope under his car seat. Vigilantly avoiding security cameras, he drives until he hits a city where his past is unlikely to track him down, and finds a room to rent from a less-than-stable landlady whose need for money outweighs her desire to ask questions. He seems to have escaped his former self. But can he?In a story that moves with swift dark humor and insight, Dee takes us through his narrator’s attempt to disavow his former life of privilege and enter a blameless new existence. Having opted out of his material possessions and human connections, the pillars of his new self - simplicity, kindness, above all invisibility - grow shakier as he butts up against the daily lives of his neighbors in their politically divided working-class city. With the suspense of a crime thriller and the grace of our best literary fiction, Dee unspools the details of our unlikely hero’s former life and his developing new one in a drumbeat roll up to a shocking final act.Dee has been compared by the Wall Street Journal to authors such as Jonathan Franzen and Jennifer Egan for his expansive, contemporary, social novels; Sugar Street is a leaner, more personal, but still uncannily timely look at the volatile America of today. A risky, engrossing and surprisingly visceral story about a white man trying to escape his own troubling footprint and start his life over.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Crime",
    "Contemporary",
    "Novels",
    "Noir",
    "Mystery"
  ],
  "author": "Jonathan  Dee",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/60430268-sugar-street"
}