{
  "title": "Friends to Keep in Art and Life",
  "description": "From the author of the bestselling ballbuster Men to Avoid in Art and Life comes Friends to Keep in Art and Life, a hilarious and relatable celebration of female friendships.Pairing classical paintings with funny, irreverent captions, Nicole Tersigni honors all sorts of sacred female friendships and the miscellaneous nonsense that brings women closer together. Focusing on five major friend types (the Work Friend, the Nurturing Friend, the Hide a Body for You Friend, the Up for Anything Friend, and the Super Honest Friend), Tersigni's meme-style humor perfectly captures all of the weird-but-special, intimate, cherished, and often laugh-out-loud moments that define female friendship.BESTSELLING AUTHOR: Nicole Tersigni broke the Internet with her first book, the hit success Men to Avoid in Art and Life based on her hysterical Twitter feed. Still packed with the same whip-smart humor, Friends to Keep in Art and Life celebrates wholesome female friendships in a loving way.THE PERFECT GIFT: Friends to Keep in Art and Life covers the many different types of female friendships, making it the perfect present for any pal in your life! Whether they're your work wife, drinking buddy, or bluntly honest bestie, there’s something for everybody in this book. No matter the gifting moment—birthdays, holidays, or \"just because\" days—it's a surprise that’s sure to make them laugh!RELATABLE CONTENT: These universal kinds of friendships will delight any pal you gift it to! This book sparks nostalgic banter and will have you and your friends reminiscing in no time.Perfect for:Art history enthusiastsMeme loversFans of shows like Golden Girls, Broad City, and GirlsThose who loved Men to Avoid in Art and Life",
  "genres": [
    "Humor",
    "Art",
    "Nonfiction",
    "Feminism",
    "Adult",
    "Graphic Novels",
    "Comedy"
  ],
  "author": "Nicole Tersigni",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/60420661-friends-to-keep-in-art-and-life"
}