{
  "title": "My Good Man",
  "description": "BEST OF THE YEARKirkus • Boston GlobeA literary tour-de-force sure to turn the coming-of-age genre on its head from Printz honoree Eric GansworthBrian, a 20-something reporter on the Niagara Cascade’s City Desk, is navigating life as the only Indigenous writer in the newsroom, being lumped into reporting on stereotypical stories that homogenize his community, the nearby Tuscarora reservation. But when a mysterious roadside assault lands Tim, the brother of Brian’s mother’s late boyfriend in the hospital, Brian must pick up the threads of a life that he’s abandoned.The narrative takes us through Brian’s childhood and slice of life stories on the reservation, in Gansworth’s signature blend of crystal sharp, heartfelt literary realist prose. But perhaps more importantly, it takes us through Brian’s attempt to balance himself between Haudenosaunee and American life, between the version of his story that would prize the individual over all else and the version of himself that depends on the entire community’s survival.P R A I S E★”“Heartfelt. Lush. Perceptive. Gansworth candidly offers a complex look at Brian’s efforts to cultivate his own sense of self while navigating two seemingly separate his life growing up in Tuscarora and his life after leaving the reservation.”—Publishers Weekly (starred)★ “A masterwork of historical fiction. Rich, luxuriant, densely layered prose immerses readers in heartbreaking scenes and poignant dialogue as complex characters explore the confines and joys of male friendship. Riveting, timeless, and indispensable.”—Kirkus (starred)★ “A novel about strong medicines and powerful treaties.”—BCCB (starred)“A sprawling work, part commentary and chorus, part excavation of generational trauma, circling back and starting over as his protagonist stumbles toward adulthood. Gansworth drops gems of sharp dialogue as his story lurches toward big truths.”—Minneapolis Star Tribune“A triumph of storytelling.”—Buffalo News",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Short Stories",
    "Young Adult",
    "Indigenous",
    "Coming Of Age",
    "Audiobook"
  ],
  "author": "Eric Gansworth",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/60420454-my-good-man"
}