{
  "title": "Seen and Unseen: What Dorothea Lange, Toyo Miyatake, and Ansel Adams's Photographs Reveal About the Japanese American Incarceration",
  "description": "This important work of nonfiction features powerful images of the Japanese American incarceration captured by three photographers—Dorothea Lange, Toyo Miyatake, and Ansel Adams—along with firsthand accounts of this grave moment in history.Three months after Japan attacked Pearl Harbor in 1941, US President Franklin D. Roosevelt ordered the incarceration of all Japanese and Japanese Americans living on the West Coast of the United States. Families, teachers, farm workers—all were ordered to leave behind their homes, their businesses, and everything they owned. Japanese and Japanese Americans were forced to live under hostile conditions in incarceration camps, their futures uncertain.Three photographers set out to document life at Manzanar, an incarceration camp in the California desert:Dorothea Lange was a photographer from San Francisco best known for her haunting Depression-era images. Dorothea was hired by the US government to record the conditions of the camps. Deeply critical of the policy, she wanted her photos to shed light on the harsh reality of incarceration.Toyo Miyatake was a Japanese-born, Los Angeles–based photographer who lent his artistic eye to portraying dancers, athletes, and events in the Japanese community. Imprisoned at Manzanar, he devised a way to smuggle in photographic equipment, determined to show what was really going on inside the barbed-wire confines of the camp.Ansel Adams was an acclaimed landscape photographer and environmentalist. Hired by the director of Manzanar, Ansel hoped his carefully curated pictures would demonstrate to the rest of the United States the resilience of those in the camps.In Seen and Unseen, Elizabeth Partridge and Lauren Tamaki weave together these photographers' images, firsthand accounts, and original art to examine the history and injustice of the Japanese American incarceration.",
  "genres": [
    "Nonfiction",
    "History",
    "Middle Grade",
    "Photography",
    "Historical",
    "War",
    "World War II"
  ],
  "author": "Elizabeth Partridge",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/60420370-seen-and-unseen"
}