{
  "title": "About That Night",
  "description": "One night she can't forget. One night he can't remember.I can’t believe I slept with Jordan Hammond. My crush since junior high. The only man I have ever loved. The guy I compare every other guy to—who also happens to be my sister’s ex-fiancé.Funny story. Jordan doesn’t remember that night we shared. But I do. Every last detail.They say some people have it all. At first glance, Jordan Hammond would be considered one of those people. Handsome. Wealthy. Comes from a respected family. Good friends. Adoring younger sister. Carefree. Quick with a dimpled smile or a laugh. But first impressions can be deceiving, masking the pain and loneliness inside. Like heartbreak and a called-off wedding after catching his fiancée in bed with his best friend. The blackouts caused by too many bottles of tequila and vodka he would consume to drown his sorrows over his failed engagement. The empty family estate he still lives in by himself because he can’t find the strength to sell it after his mother and grandfather pass away. The helpless feeling that drowns him every day because he feels like he’s wasted his life and has nothing to show for it.It takes the sudden reappearance of one woman, Douglass Donnelly, to light a consuming fire within him. To make him want to live again. Risk love again. But there’s a problem. Two, actually. The first is that the beautiful auburn-haired Douglass is his ex-fiancée’s younger sister. But the biggest problem of all—Douglass absolutely hates his guts for reasons he can’t figure out. However, those reasons will not stop him from crashing through the almost impenetrable wall barricading her heart to claim the woman he realizes he can’t live without. The sister he should have chosen the first time. Jordan won’t stop until Douglass is his: heart, body, and soul—no matter how much she pretends to despise him.Douglass Donnelly has always felt like an outcast. Shy, awkward, picked on by her peers because of her weight. Continuously living in the shadow of her perfect, vivacious, gorgeous older sister, Amelia. Overlooked. Invisible. And absolutely head-over-heels in love with Jordan Hammond since she was fourteen years old. A man she continued to pine over even when he chose her sister and not her. Even when he was about to become her brother-in-law. Even after his engagement blew up because he caught her sister in bed with his best friend one week before the wedding.And then that night happens. The night that changes everything. The night Jordan Hammond finally sees her and not the little sister of his cheating ex. For a few brief hours, Jordan gives Douglass everything she has ever wanted and dreamed about… right before he rips it all away and shreds her fragile heart to pieces.It’s been five years since Douglass packed her bags and ran away from her hometown of Woodspire, Texas. Five years of painstakingly putting her broken pieces back together and remolding herself into a strong, resilient woman. One thousand, eight hundred, and twenty-five long days for her love of Jordan Hammond to turn into hatred. Years of hardening her heart, so no other man can break it ever again.What’s that overused adage? Time heals all wounds. Douglass knows better than anyone that even time itself won’t cure a broken heart or lessen the humiliation of what happened that night with Jordan.Unfortunately for Douglass, Jordan is determined to prove her wrong. But can he make amends for a night he can’t remember; a night, it turns out, Douglass can’t forget?",
  "genres": [
    "Contemporary",
    "Romance",
    "Second Chance",
    "Enemies To Lovers"
  ],
  "author": "Jennilynn Wyer",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/60423800-about-that-night"
}