{
  "title": "The Witches of Moonshyne Manor",
  "description": "A coven of modern-day witches. A magical heist-gone-wrong. A looming threat.Five octogenarian witches gather as an angry mob threatens to demolish Moonshyne Manor. All eyes turn to the witch in charge, Queenie, who confesses they've fallen far behind on their mortgage payments. Still, there's hope, since the imminent return of Ruby--one of the sisterhood who's been gone for thirty-three years--will surely be their salvation.But the mob is only the start of their troubles. One man is hellbent on avenging his family for the theft of a legacy he claims was rightfully his. In an act of desperation, Queenie makes a bargain with an evil far more powerful than anything they've ever faced. Then things take a turn for the worse when Ruby's homecoming reveals a seemingly insurmountable obstacle instead of the solution to all their problems.The witches are determined to save their home and themselves, but their aging powers are no match for increasingly malicious threats. Thankfully, they get a bit of help from Persephone, a feisty TikToker eager to smash the patriarchy. As the deadline to save the manor approaches, fractures among the sisterhood are revealed, and long-held secrets are exposed, culminating in a fiery confrontation with their enemies.Funny, tender and uplifting, the novel explores the formidable power that can be discovered in aging, found family and unlikely friendships. Marais' clever prose offers as much laughter as insight, delving deeply into feminism, identity and power dynamics while stirring up intrigue and drama through secrets, lies and sex. Heartbreaking and heart-mending, it will make you grateful for the amazing women in your life.",
  "genres": [
    "Fantasy",
    "Witches",
    "Fiction",
    "Audiobook",
    "Paranormal",
    "Magic",
    "Halloween"
  ],
  "author": "Bianca Marais",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/60421214-the-witches-of-moonshyne-manor"
}