{
  "title": "Robynne: Her sexperiences and sexventures",
  "description": "Robynne Wilderton written by Louise Lucy LockhartRobynne Roberta Wilderton is a ravishingly attractive brunette. As a Fine Artist, she has erotic 'sexperiences' with beautiful people in the worlds of modeling, ballet, hockey, horses, fashion, and haute-couture.Robynne’s romances retain a strong testosterone streak, with Roberta embedding a powerful estrogen rush, intertwined with Wilderton, a wild lust for adventure. Her desire for sexy pleasure opens new vistas, and being blessed with a beautiful, body, mind and soul, she seduces gorgeous men and glamorous women.Her desire for thrills comes her way with her longing for company and excitement. She lives a charmed life of luxury, filled with sex, elegance, stunning women and handsome men. Her thrilling gender-bender adventures reflect what a healthy liberated female enjoys among these young privileged classes.Robynne’s narrative will inform, educate and entertain those who wish to gain an insight into the erotic mores of these social strata. Robynne’s exhilarating escapades and sensual erotic experiences teach much about her feminist drive with no constraints on pursuing pleasure to find self-fulfilling love.Louise Lucy Lockhart is an artist, poet, and author. She was born and bred in Montreal and attended the best primary, junior, and high Schools. She read philosophy, politics, economics, and English literature at a renowned University on a scholarship, and is a frequent contributor to erudite social, economic, political journals, and top fashion magazines.She is well-traveled, speaks five languages, and lives her charmed, if not sophisticated life, attending concerts, plays, and cultured soirees. She is an accomplished cook and her culinary arts are the envy of many chefs. She is a liberated free spirit and with this novella, Robynne Wilderton; She adds an important comment to the new genre of feminist literature.",
  "genres": [],
  "author": "Louise Lucy Lockhart",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/60416409-robynne"
}