{
  "title": "Is It Hot in Here? Or Am I Suffering for All Eternity for the Sins I Committed on Earth?",
  "description": "In this debut collection of essays, lists, musings, and quips, New York-based comedian Zach Zimmerman delicately walks the fine line between tear-jerking and knee-slapping, and does so with aplomb.In this laugh-and-cry-out-loud, memoir-esque exploration of selfhood, Zimmerman dives into the pros and cons of retiring a Bible-Belt-dwelling, meat-eating, God-fearing identity in exchange for a new, metropolitan lease on life—one of vegetarianism, atheism, queerness, and humor. Whether learning to absolve instilled religious guilt or reminiscing over Tinder dates gone horribly wrong, this book is a candid and hysterical look at one person's journey toward making peace with the past and seeking hope in the future.HILARIOUS WRITING: The stories featured in this collection are an uproarious read with a strong and established tone of voice. Featuring pieces that were originally published in the New Yorker, Is It Hot in Here (Or Am I Suffering for All Eternity for the Sins I Committed on Earth)? is a literary gem.RELEVANT AND INCLUSIVE: Zimmerman navigates obstacles in the queer community with essays that are not only humorous and heartfelt, but also act as guiding anecdotes for young, queer community members.ESTABLISHED AUTHOR AND COMEDIAN: Zimmerman has written dozens of New Yorker humor pieces and essays, a Billboard Top Ten comedy album that debuted at #1, and has been featured in New York Magazine, The New York Times, TimeOut, Vulture, and more.Perfect for:Comedy and humor fansLiterary enthusiasts and fans of comedy writing like David SedarisShort story and essay collection readers",
  "genres": [
    "Nonfiction",
    "Essays",
    "Memoir",
    "Humor",
    "LGBT",
    "Audiobook",
    "Queer"
  ],
  "author": "Zach  Zimmerman",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/60420674-is-it-hot-in-here-or-am-i-suffering-for-all-eternity-for-the-sins-i-com"
}