{
  "title": "Ballad of Nightmares",
  "description": "She appeared in a breath of smoke.Her long heels ticked with each calculated step. Light caught in the gleam of the intricate silver claw on her finger. She held her chin high as she stalked through the crowd, and the people unknowingly parted ways. As though she were bending them to her silent will.He knew her. Or at least… he knew of her.She had toppled four monarchies already, and he knew his own was next on her list.She was a siren in the moonlight.An enchantress of desirous evils.To fall under her spell would mean to kneel before her.The corner of his lips twitched at the thought. He would kneel… He knew he would.But she’d have to beg him first.Synopsis:When the ravens and crows begin acting odd on the morning of Death’s Day, Samarius Cain knows someone dangerous has entered his kingdom. The witches’ texts warned him of this and warned him that he, Death, would meet his match when the ravens fell. After centuries of waiting, he’d begun to think the text was just a fairy tale…Until he spots the Tower of Chaos and Destruction herself, Deianira Bronfell, mingling with his people.Shadowmyer is the last domain on Deianira’s list. Death’s kingdom, if the rumors were true. Samarius Cain. No one knows what he looks like, and no one can get into his castle. But Deianira isn’t walking away without her final crown. She has a plan: climb the ladder. Get close. Seduce who she has to and kill the rest.Nothing will keep her from her final conquest… not even the man she finds herself entangled with and unable to stop herself from falling for.This book is not intended for persons younger than eighteen years of age. It is an adult, paranormal fantasy novel and features dark, adult themes and explicit content. Please see Author’s social sites for full content warnings once available.",
  "genres": [
    "Fantasy",
    "Dark Romance",
    "Romance",
    "Paranormal",
    "Dark",
    "Fantasy Romance",
    "Enemies To Lovers"
  ],
  "author": "Jack  Whitney",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/60443788-ballad-of-nightmares"
}