{
  "title": "Life Drawing",
  "description": "Born in Iowa to the sounds of Bob and Bing Crosby and the Dorsey brothers, Mickey grows up to the comforting images of his living room TV and the reassuring ruts of his parents’ life. During the restless summer of his senior year in high school, drifting away from the girlfriend he could never quite love, Mickey spends a night with another boy, and his world will never be the same. On a barge floating down the Mississippi, he falls in love with James, a black card player from New Orleans, and in time the two of them settle, bristling with sexual intensity, in the French Quarter – until a brief affair destroys James's trust and sends Mickey to the drugs and sordid life of Los Angeles.Originally published in 1991, it was Grumley’s only novel, completed in the months leading to his death from AIDS as he was cared for his lover Robert Ferro. This new edition contains the original foreword by Edmund White (A Saint from Texas) and afterword by George Stambolian (Gay Men’s Anthologies Men on Men), close friends of the couple.“A simple, classic, engaging, and beautifully written tale of a boy who ran away from home, a man who didn’t make it in the movies, an artist who found himself earlier than most and did it all west of the Mississippi, in places which, while very American, few Americans have ever been.” – Andrew Holleran“Life Drawing affirms the rich complexity of passion in the story of a small-town boy’s difficult journey to manhood. Michael Grumley’s crisp, direct language brings to life the demanding wonder of sexuality and the delicate tightrope of love between black men and white men.” – Melvin Dixon“Grumley’s graceful and telling memoir of a youth at first nearly idyllic then very nearly misspent is rooted as deeply in the American Midwest – its river-rich loam, its high moral soil – as any story by Mark Twain or Sherwood Anderson. Like their work, I expect it will continue to charm and surprise and provoke for some time to come.” – Felice Picano“Life Drawing is the work of a true writer. It’s the most physical book I’ve ever read this side of pornography. Not a word’s out of place.” – Ned Rorem“What a moving experience to have Michael Grumley with us again in the energy, shape, beauty, and wisdom of his first published novel. The economy of his line is remarkable, as is the powerful story he tells. Once I started the book I couldn’t put it down.” – Julia Markus",
  "genres": [
    "Gay",
    "Fiction",
    "LGBT"
  ],
  "author": "Michael Grumley",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/60446174-life-drawing"
}