{
  "title": "Crazy Little Thing",
  "description": "USA Today Bestselling Author Ellie Thornton welcomes you to the sunshine state! Looking for fun in the sun? Come to Diamond Cove, a beach community full of hilarious situations, meddling grandparents, and romance. Lose your heart to this sweet romantic comedy about a rockstar hiding his identity and the cute librarian who'll help him find his voice again.Kate has sworn off men--for good this time! No more being stood up, no more coming second, and definitely no more falling in love. No. Nope. She's done.Besides, she has bigger things to worry about, like taking care of her depressed dog, Bear, who's missing his best friend, Sweetie, the blind alligator, and getting the Diamond Cove library ready for a big contest, that if it wins, will land it smack dab on the front of a national magazine. Kate's beyond stoked, but first, she has to clean . . . everything. Removing 50,000 books from all the bookshelves in a three-story library? Shouldn't be too hard. Right?Wrong, according to her best friend, Samantha, the activities director at The Palms Retirement Community where the library is located. Samantha's done hauling books all over and determined to find Kate help. But why, oh, why, does the help have to be the gorgeous and extremely kind security guard Kate met in college over a decade ago at some concert? Doesn't matter. She won't be tempted, Kate can control herself. She can!When world-famous rock star, Axel Clayton, runs away from California to hide from his manager who's pushing him to write songs he has no interest in, he heads straight to Diamond Cove Retirement Community and into his grandparent's open arms.His, grandpa, Don, never liked his career, but during this visit, gramps seems more interested in other things, like this new group of friends he's always sneaking around with. Fine by Axel as long as he doesn't have to defend a career he's not sure he can do anymore.Now, all Axel needs is to stay hidden from fans until he gets lyrics on paper or finally makes the decision to retire. He just needs something to occupy his time. Like the cute librarian he met years ago, and her crazy \"clean everything\" assignation. He wants the job all right. Even more when he realizes that Kate still doesn't know he's famous.And that's not all she doesn't know. Like the fact that she practically inspired an entire album out of him in the fifteen minutes they were together back then. What could she do with him in weeks? He doesn't know, but he's willing to lug around thousands of books to find out.Don: Finally, I'm getting my oldest grandson married. Watch out, Axel, The Secret Seven are coming for you!",
  "genres": [
    "Romance",
    "Contemporary",
    "Clean Romance",
    "Small Town Romance",
    "Chick Lit",
    "Fiction"
  ],
  "author": "Ellie Thornton",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/60453102-crazy-little-thing"
}