{
  "title": "Forgiving Hearts",
  "description": "With desire and chemistry far greater than our shared hatred, nothing can stop the explosive reaction building between us.♥ ♥ ♥After painfully insulting me, I put Parker Hudson on my hate list for life. All we do is fight and make our mutual dislike for each other publicly known. Being cordial to each other is not something either of us will ever be capable of doing. But now I’m his son’s teacher, and I have no choice but to be respectful. I like his son and would never do anything to hurt him. Even if that means I have to be nice to Parker. When I’m nice, so is he. It’s confusing, and I’m starting to question my feelings for him. But he has secrets. Secrets that cause my feelings to shift to desire and want. Now, I can’t remember why it is I hate him so much. ♥ ♥ ♥Gracie Strong is the most infuriating woman I’ve ever met. She’s also stunningly gorgeous and makes my blood boil with lust. I don’t know what I ever did to make her hate me so much, but she can’t seem to say anything nice to me. That’s fine. I’ve never had much luck with women anyway. It’s easier if I hate her, too. But then I saw her interact with my son, and I realize I don’t really know her at all. I never pictured Gracie as a teacher or someone who’s great with kids. But she’s both of those things. It’s a side of her I’ll never be able to unsee. It’s a side that makes all the hateful things she says to me fade away like they never happen. My son adores her. I just might adore her, too. ♥ ♥ ♥Love is the last thing this grumpy, single dad is looking for, but Parker can’t seem to resist the smart-mouth, stubborn woman who goes out of her way to make his life miserable like it’s a contact sport. Gracie’s never been in love, and he’s been burned in unforgivable ways. Loving each other just might be the biggest mistake both of them make.Forgiving Hearts is a steamy full-length STANDALONE romance filled with lots of sexy times in the bedroom (or in the back room of a bar), profanity, and love with a HEA ending!♥ ♥ ♥Author Notes: Fans of Claire Kingsley, Melanie Harlow, Lucy Score, and Catherine Cowles will love books by Aria Bliss. Get ready to stay up all night laughing, crying, and swooning. A hate to love, single dad, grumpy hero, stubborn heroine, small-town romance with a slow burn to love. This one has all the feels and enough steam to fog up your windows. This fictional small town and all the families that built it will steal your heart and keep you coming back for more. The books in Hearts of Watercress Falls are all standalone novels and can be read in any order. But if you love family drama and the subtle build of future romances, I suggest you read them in order, starting with Healing Hearts.",
  "genres": [
    "Enemies To Lovers",
    "Romance",
    "Small Town Romance",
    "Contemporary"
  ],
  "author": "Aria Bliss",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/60458215-forgiving-hearts"
}