{
  "title": "Morgenthau: Power, Privilege, and the Rise of an American Dynasty",
  "description": "A monumental portrait of four generations of the Morgenthau family–a dynasty of power brokers whose outsized influence helped shaped New York City and the American Century.Since their arrival in the United States from Germany in 1866, the Morgenthaus have been a linchpin in American history–losing everything only to grow rich again, assimilating, and then climbing to the country’s highest ranks of power. In the words of former Mayor Ed Koch, they are “the closest thing we’ve got to royalty in New York City.” With unprecedented, exclusive access to family archives, award-winning journalist Andrew Meier chronicles this epic American story, revealing how the Morgenthaus amassed enormous wealth, advised presidents, shaped the New Deal, decried mass murder during the Armenian genocide and the Holocaust, waged war in the Mediterranean and Pacific, and built a dynasty that would remake the city of New York. Morgenthau begins with Lazarus, who arrived in New York City dreaming of rebuilding the fortune he had lost in his homeland of Germany. While Lazarus died destitute, in shame and alone, the family rose once again with the ascendance of Henry, who became a wealthy and powerful real estate baron, and one of the first to suggest to Woodrow Wilson that he run for president. From there, the Morgenthaus went on to influence the most consequential presidencies of the twentieth century, as Henry’s son Henry, Jr., became FDR’s longest-serving aide, his Treasury Secretary during the War, and his confidante of thirty years. Finally, there was Robert Morgenthau, a decorated World War II hero who went on to become the longest-tenured district attorney in the history of New York City. Known as “DA for life,” he oversaw some of the most important legal cases in New York of the last fifty years, from the war on the Mafia and the advent of white-collar prosecutions to the race wars of the 1970s–and, of course, the Central Park Five case.Public servants at heart, the Morgenthaus also propelled candidates into power. But they were often forced to stand loyally on the sidelines, even as they bore witness to the great moral and human cost of political expediency. The saga of the Morgenthaus has lain half-hidden in the shadows for too long. At heart a family history, drawn largely from private family records and including sixty archival photographs, Morgenthau is also an American epic, as big and improbable as the country itself.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "American History",
    "Business",
    "Historical"
  ],
  "author": "Andrew Meier",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/60474582-morgenthau"
}