{
  "title": "Idol, Burning",
  "description": "The novel that lit the Japanese publishing world on fire: From a breathtaking up-and-coming writer, a twenty-first century Catcher in the Rye that brilliantly explores toxic fandom, social media, and alienated adolescence.Akari is a high school junior obsessed with \"oshi\" Masaki Ueno, a member of the popular J-Pop group Maza Maza. She writes a blog devoted to him, and spends hours addictively scrolling for information about him and his life. Desperate to analyze and understand him, Akari hopes to eventually see the world through his eyes. It is a devotion that borders on the religious: Masaki is her savior, her backbone, someone she believes she cannot survive without--even though she's never actually met him.When rumors surface that her idol assaulted a female fan, social media explodes. Akari immediately begins sifting through everything she can find about the scandal, and shares every detail to her blog--including Masaki's denials and pleas to his fans--drawing numerous readers eager for her updates.But the organized, knowledgeable persona Akari presents online is totally different from the socially awkward, unfocused teenager she is in real life. As Masaki's situation spirals, his troubles threaten to tear apart her life too. Instead of finding a way to break free to save herself, Akari becomes even more fanatical about Masaki, still believing her idol is the only person who understands her.A blistering novel of fame, disconnection, obsession, and disillusion by a young writer not much older than the novel's heroine, Idol, Burning shines a white-hot spotlight on fandom and \"stan\" culture, the money-making schemes of the pop idol industry, the seductive power of social media, and the powerful emotional void that opens when an idol falls from grace, only to become a real--and very flawed--person.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Japan",
    "Japanese Literature",
    "Audiobook",
    "Literary Fiction",
    "Asian Literature"
  ],
  "author": "Rin Usami",
  "average_rating": "3.22",
  "url": "https://www.goodreads.com/book/show/60470072-idol-burning"
}