{
  "title": "Pauper Auction",
  "description": "A gorgeous and meticulously-researched historical fiction examining a young woman’s struggle to escape unexpected poverty and find autonomy and purpose in early New England.\nMankind are always seeking after happiness in some way or another.~ Leavitt’s Farmer’s Almanac, 1805The fall from beloved wife of the town blacksmith to widowed pauper was swift. Margery Turner sits in the Thorneboro, New Hampshire Meetinghouse on the second Tuesday of March, 1805. She and the other indigent town residents wait their turn to be auctioned out to the lowest bidder who will accept the paupers into their homes in return for town funds. The young widow and an abandoned child named Agnes find themselves taken in by farmer and ciderist Samuell Wheeler and his elderly mother, renowned bed rug maker Hannah Wheeler. Margery swears to herself that she will not forever remain a pauper in purse or purpose.Secrets and sorrows live on the prosperous farm. An itinerant Abenaki stonemason, Sozap Wzôkhilain, known as Joseph, joins the household and touches each of their lives in unexpected ways. The farm is the setting for danger and tragedy as well as simple joys and blossoming love. In Pauper Auction, strangers become friends, confidantes, and lovers. Tragedy becomes hope, and a family of the heart help each other find their futures, together and apart.Rich and atmospheric period description and a strong sense of New England enhance this immersive narrative. Meticulously researched details of early 19th century foodways, and the crafts of blacksmithing, traditional stone wall building, needlework, hearth cooking, and hard cider-making bring Margery’s world to life. The novel is a perfect bookclub pick with themes that transcend time. A significant Afterword and Discussion Questions are included in the book.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Mary Kronenwetter",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/60459305-pauper-auction"
}