{
  "title": "Toxic Effects",
  "description": "Don't forget to be afraid. Neuropsychiatrist Cristina Silva cannot escape her past. The voice in her head of her former identity won’t let her. Cristina also can’t quite manage to force herself to forget the ex-boyfriend she dumped: handsome police detective Gary Wilson. Soon after beginning her new job at the Longwood Memory Center, Cristina receives a startling phone call from her contact at the FBI: an assassin is crisscrossing the country, killing anyone connected to the now-defunct pharmaceutical company ReMind—people like Cristina. The shadowy criminal enterprise Zero Dark is back. Indeed, an assassin is tracking Cristina, a literal femme fatale known as Dama Branca. Like Cristina, DB’s memory was robbed by Zero Dark. Transfixed by the brilliant doctor, DB’s unsure what’s preventing her from killing Cristina. DB has memory glitches and longs to interpret them. Whether or not these have to do with Cristina, she doesn’t know, but she senses their fates are entwined—with any luck, not fatally. Danger lurks in the shadows. Cristina’s spurned lover, Wilson, is investigating the suspicious deaths of local teens, convinced they’re not accidents. Before their bewildering ends, all the victims exhibit bizarre behavior, and there are now terrified whispers among their friends of a hooded boogeyman called Sack Man. One exceptional young man, Reggie Horne, is clearly in the middle of this bedlam. Wilson vows to prevent Sack Man from claiming Reggie as his next casualty. And when Cristina’s in danger, Wilson is never far away. Just as it becomes apparent their two stories are entangled, the peril shoots sky-high. With at least one killer in their wake, they must quickly determine what’s real and what’s not. Unlocking Cristina’s memories could save many lives—her own included.",
  "genres": [
    "Crime",
    "Mystery",
    "Fiction",
    "Audiobook"
  ],
  "author": "Joel Shulkin",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/60490257-toxic-effects"
}