{
  "title": "Snakes! Guillotines! Electric Chairs!: My Adventures in The Alice Cooper Group",
  "description": "As the Rock & Roll Hall of Fame says, \"Before the world heard of KISS, the New York Dolls, Marilyn Manson or Ozzy Osbourne, there was Alice Cooper, the original shock-rock band.”When Alice Cooper became the stuff of legend in the early ‘70s, their shows were monuments of fun and invention. Riding on a string of hits like “I’m 18” and “School’s Out,” they became America’s highest-grossing act, producing four platinum albums and hitting number one on the U.S. and U.K. charts with Billion Dollar Babies in 1973. Their utterly original performance style and look, known as Shock Rock, was swiftly copied by countless bands, including David Bowie and Kiss. Dennis Dunaway, the bassist and co-songwriter for the band, tells a story just as over-the-top crazy as their shows; from struggling for recognition to topping the charts, the Alice Cooper Band was entertaining, outrageous, and one-of-a-kind.The wellspring of creativity was the creative union of two Phoenix teenagers, Dennis Dunaway and Vince Furnier, who would later change his name to Alice. With Dennis and Vince pushing the conceptual envelope, they became a hard-knuckles band that played prisons, cowboy bars and teen clubs. Their journey took them from Hollywood to the ferocious Detroit music scene, along the way adding new dimensions of rock theater, including guillotines, electric chairs and dramatic lighting.Heads Will Roll is the highly entertaining and remarkably detailed account of the band’s creation in the ‘60s, strange glory in the ‘70s, and the legendary scenes and vivid characters they met along the way.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Music Biography",
    "Biography Memoir"
  ],
  "author": "Dennis Dunaway",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/60490398-snakes-guillotines-electric-chairs"
}