{
  "title": "Marshall and His Generals: U.S. Army Commanders in World War II",
  "description": "General George C. Marshall, chief of staff of the U.S. Army during World War II, faced the daunting task not only of overseeing two theaters of a global conflict but also of selecting the best generals to carry out American grand strategy. Marshall and His Generals is the first and only book to focus entirely on that selection process and the performances, both stellar and disappointing, that followed from it. Stephen Taaffe chronicles and critiques the background, character, achievements, and failures of the more than three dozen general officers chosen for top combat group commands—from commanders like Dwight Eisenhower and Douglas MacArthur to some nearly forgotten.Taaffe explores how and why Marshall selected the Army's commanders. Among his chief criteria were character (including \"unselfish and devoted purpose\"), education, (whether at West Point, Fort Leavenworth, or the Army War College), and striking a balance between experience and relative youth in a war that required both wisdom and great physical stamina. As the war unfolded, Marshall also factored into his calculations the combat leadership his generals demonstrated and the opinions of his theater commanders.Taaffe brings into sharp focus the likes of Eisenhower, MacArthur, George Patton, Omar Bradley, Walter Krueger, Robert Eichelberger, Courtney Hodges, Lucian Truscott, J. Lawton Collins, Alexander \"Sandy\" Patch, Troy Middleton, Matthew Ridgeway, Mark Clark, and twenty-five other generals who served in the conflict. He describes their leadership and decision-making processes and provides miniature biographies and personality sketches of these men drawn from their personal papers, official records, and reflections of fellow officers.Delving deeper than other studies, this path-breaking work produces a seamless analysis of Marshall's selection process of operational-level commanders. Taaffe also critiques the performance of these generals during the war and reveals the extent to which their actions served as stepping stones to advancement.Ambitious in scope and filled with sharp insights, Marshall and His Generals is essential reading for anyone interested in World War II and military leadership more generally.",
  "genres": [
    "World War II",
    "History",
    "Military History",
    "Nonfiction",
    "American History",
    "Biography"
  ],
  "author": "Stephen R. Taaffe",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/12865534-marshall-and-his-generals"
}