{
  "title": "Roseanna's Reply",
  "description": "Women fly combat missions today in the military services. They were just as capable 70 years ago. In the early months of WWII an enigmatic bush pilot comes to the rescue of downed American ferry pilot Roseanna Kendell in the northern wilds of Canada. The daughter of Dutch Kendell, president of North American Aviation, Roseanna is strong willed and volatile and has inherited her father's love of aviation. And from her Mexican mother she has inherited uncommon beauty and a bond with an extended family and their culture south of the border. When Roseanna learns that her savior is not only a Battle of Britain veteran but a 'Merlin magician' as well, she concocts a scheme to bring her new friend Waldo to Los Angeles ostensibly to work for her father but in fact, to become her mentor. She has never seen or met anyone who can fly like Waldo. But a plot to disrupt WWII aircraft production, resulting in family tragedy, changes her plans. With the help of her aging sidekick as well as a reluctant FBI agent turned Air Corps Captain, Roseanna sets off on a mission to learn who was behind the plot. After a rocky start, the three begin working together to solve a mystery that will lead them to more murders and take them throughout Southern California, into Mexico, to Washington, D.C. and eventually to Europe. It is a journey that will see them cross paths...and occasionally swords...with the likes of Howard Hughes, General Jimmy Doolittle, Hap Arnold, Captain Ronald Reagan, William Randolph Hearst and J. Edgar Hoover. In the process, the three will learn more than they bargained for...about each other and about who would destroy the Kendell family. Finally, while flying in the guise of civilian technical advisors in the skies of war-torn Europe, Roseanna and Waldo will fulfill their destinies from the cockpit of one of the deadliest fighters of WWII, the Mustang. Roseanna's Reply is a story about flying. It is a murder mystery. It is a story about family and love and friendship and a young woman born half a century too soon.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Frank Johnson",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/6049153-roseanna-s-reply"
}