{
  "title": "Dokter Zjivago",
  "description": "In het eerste kwart van de twintigste eeuw komt Rusland in een draaikolk van veranderingen terecht: de Wereldoorlog kost aan vele mannen het leven, de grote Revolutie werpt het tsarenregime omver, de binnenlandse strijd tussen de Roden en de Witten zaait verdeeldheid onder de bevolking. Alles en iedereen wordt meegesleurd in deze maalstroom. Niets zal ooit meer hetzelfde zijn.Aanvankelijk is de geestdrift over de doorbraak van de socialistische Nieuwe Tijd vrij algemeen, maar al gauw dringt tot vele Russen het besef door dat de maatschappij ten prooi is gevallen aan een epidemische waanzin, en dat het leven een nachtmerrie dreigt te worden. De wereld is van alle zekerheden ontdaan, familieleden verdwijnen spoorloos en de burger is afhankelijk van de willekeur van steeds wisselende regeringen.Dit geldt met name voor een persoon als dokter Zjivago, de mens die altijd op zoek is naar de waarheid en voor wie geestelijke vrijheid een levensvoorwaarde is. Op zijn moeizame tocht door deze wereld, die beroofd is van elke vaste waarde, bevindt zich slechts één veilige haven: Lara. Maar ondanks alles wat hun hartstochtelijke liefde hem biedt, is deze vrije geest toch gedoemd ten onder te gaan in de totalitaire maatschappij.Vanwege het kritische beeld dat Pasternak in Dokter Zjivago van de Russische maatschappij schetst, werd publicatie van de roman direct na voltooiing door de Sovjet-autoriteiten verboden. De buitenlandse rechten waren toen evenwel al verkocht, zodat het Westen kennis kon nemen van dit werk van grote literaire en cultuur-historische betekenis. Er werd dan ook in 1958 de Nobelprijs aan toegekend. Pas in de tijd van glasnost en perestroika mocht de roman in de Sovjet-Unie verschijnen.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Russia",
    "Russian Literature",
    "Classics",
    "Romance",
    "Literature"
  ],
  "author": "Boris Pasternak",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/12865525-dokter-zjivago"
}