{
  "title": "Plenty Enough Suck to Go Around: A Memoir of Floods, Fires, Parades, and Plywood",
  "description": "The cliche \"New Orleans gets into people's blood\" happens to be very true—just not always convenient. For Cheryl Wagner, along with her indie-band boyfriend, a few eccentric pals, and two aging basset hounds, abandoning the city she loved wasn't an option.This is the story of Cheryl's disturbing surprise view from her front porch after she moved back home to find everything she treasured in shambles...and her determined, absurd, and darkly funny three-year journey of trying to piece it all back together.In the same heartfelt and hilarious voice that has drawn thousands of listeners to her broadcasts on Public Radio International's This American Life, Wagner shares her unique yet universal story of rebuilding a life after it's been flooded, dried, and died...The title comes, as if you can't guess, from those infuriating stories of comparative loss post-Katrina, when those who had lost everything were subjected to the litanies of minor inconvenience by the more fortunate. \"Everyone's loss is big to them,\" Wagner kept telling herself. And so it was. \"I was not interested in sifting and weighing suck on a bunch of tiny scales,\" she continued. \"Suck was too hard to quantify. There was plenty enough suck to go around. Sitting around measuring it wasn't going to fix anything.\" What makes this story uniquely memorable is Wagner's wise and wisecracking voice, the broken heart beneath the bravado. Working on a survey of gutted/non-gutted buildings, she writes, \"By the time you finished hearing people's problems, you wished you were a professional busybody or the mayor or the governor or a city inspector or anyone who could and would actually do something.\" And who hasn't had that feeling, way back then or as recently as yesterday? Finally, Wagner and her boyfriend end up with \"the dogs, sanity and each other.\" And we end up with this fine book, with its searing honesty, its gallows humor and its survivor spirit.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "History"
  ],
  "author": "Cheryl  Wagner",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/6048938-plenty-enough-suck-to-go-around"
}