{
  "title": "Sabotage",
  "description": "COLTONRaylee Lexington Adams is my stepsister and the one woman in the world who can make my blood boil. She’s vindictive, a lot of crazy, and absolutely stunning. I hate everything about her except for when she’s on her knees begging me to use her as my own personal toy. We’ve been playing a game of cat and mouse for far too long. We have used each other for our own sick pleasure. I’ve ruined every relationship my little princess has ever had. A sure way that she’ll come crawling back to me, begging me for what only I can give her when another man fails her. But I’m tired of watching others get a piece of what is mine. So, I did what any rational man would do—I staked my claim, showed the world that she belonged to me, and I’m going to do whatever it takes to make her believe it too. RAYLEEColton Remington Knox is a man I despise but can’t say no to. He’s what any girl would call a walking red flag. But I’ve never claimed to be a smart woman when it comes to men. Why should he be any different? I’ve always managed to hold my own against him. But this time, he’s gone too far. Posting a video of me on my knees for him, for what? To brag? Embarrass me? He’s acting like he doesn’t know me very well. Colt wants to play a game? I’ll do whatever it takes to make sure I win. No matter what it costs me. People already think I have no dignity, so why let them down now? Things to know about SabotageIt is MF with an MFMM scene (no MM interaction. They are focused on her)TW (Please see the WARNING/author's note posted at the beginning of the book. If you have no triggers and want to go in blind, please skip to the prologue.)OTT (over the top) HJ/P (jealous & possessive) HA dark college/stepbrother romanceTold in multiple POV's",
  "genres": [
    "Dark Romance",
    "Dark",
    "Romance",
    "Enemies To Lovers",
    "BDSM",
    "College",
    "Erotica"
  ],
  "author": "Shantel Tessier",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/60481939-sabotage"
}