{
  "title": "Life and Def: Sex, Drugs, Money, + God",
  "description": "Russell Simmons, the original and eternal hip-hop mogul, is one of the most innovative and influential figures in modern American business and culture. When no one outside of inner-city New York had even heard of hip-hop, Simmons saw the seeds of a global force that would change the way people talk, dress, listen to music, and choose the heroes they hang on their walls. Today, he oversees a sprawling, multimillion-dollar empire of culture-defining businesses in everything from music to fashion, advertising to film, and media to visual art. At the same time he’s broadened his interests and influence and pushed hip-hop to new plateaus of power and relevance. Life and Def is a one-of-a-kind tale that interweaves the remarkable journey of Russell Simmons with the story of the culture he’s transformed and been transformed by.In his own brash, compelling voice, Simmons chronicles his numerous business successes and occasional failures. He tells the story of the founding of the legendary Def Jam Records, whose roster stretches from original rap icons like L.L. Cool J, Public Enemy, and the Beastie Boys to today’s top stars, including Jay-Z and DMX. He traces the launching of Def Comedy Jam, the long-running hit television series that introduced a new generation of black comedic stars to America, from Martin Lawrence and Bill Bellamy to Bernie Mac and Chris Rock. He spins hilarious tales of his adventures in Hollywood, where he’s produced hit movies like Eddie Murphy’s The Nutty Professor and worked with quirky geniuses like Abel Ferrara. He also tells the story of Phat Farm, the wildly successful pioneering urban clothing label whose origins lay in Russell’s longtime fascination with fashion (and fashion models).Simmons’s story is also one of personal transformation, from the driven man who in the heady days of early success indulged himself with drugs, sex, and world-class decadence to the husband and father he is today, a man who has found meaning in activism, philanthropy, and spiritual practice while never losing his passion for the social, political, artistic, and commercial potential of hip-hop.Through it all he relates telling anecdotes about the characters he’s dealt models and gangsters, street poets and gurus, and major players like Donald Trump, Sean Combs, Jon Peters, and Tupac Shakur. Full of advice, opinions, and behind-the-scenes scoop, Life and Def is the story of the quintessential hip-hop life.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Hip Hop",
    "Biography Memoir",
    "Memoir",
    "Business"
  ],
  "author": "Russell Simmons",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/605.Life_and_Def"
}