{
  "title": "Savage Kings",
  "description": "Savage Kings is the heart-pounding second installment of the Savage Kingdom Series.One strong-willed woman set on revenge.Four men who were her enemies… until they were more.Get ready for Alexandria, Keane, Jax, Rafael, and Liam to bring the chaos.My name is Alexandria Donatella McCarthy, or Andie for short. Daughter of the don of the Rossi syndicate. Abused. Neglected. Overlooked. After five years in exile, I return home to avenge my brother’s death and to take down my father, Maximillian Rossi. But things didn’t work out as I’d planned. Especially when I come face to face once again with them.Keane Agosti, the leader and next in line to the Rossi throne. Jaxson West, my father’s enforcer with a lust for bloodshed. Rafael Ortiz, my ex-boyfriend and youngest son of the head of the Ortiz cartel. And Liam Connelly, the obsessed Irish hitman of my father’s sworn enemy, Declan Levine. Four men from my past who I thought were my enemies. Turns out, I was wrong about that, too.My life has been nothing but lies, manipulations, betrayal, and deeply buried secrets.My father despised and abused me.My dead brother lied to me.Julio Ortiz thinks he owns me.His oldest son, Alejandro Ortiz, wants to possess and control me.Rafael betrayed me.And Declan Levine, the enemy of my family?Let’s just say, secrets can only stay that way for so long.Keane, Jax, Rafe, and Liam. Four men who I swore to take down along with my father have now become my protectors. But they can’t protect me from what’s coming. From the enemies that surround me. Things are about to get so much worse than I could’ve ever anticipated.Let the blood flow red in the streets.Never underestimate a savage princess.Reader’s Note: Savage Kings is a dark, enemies to lovers, mafia, reverse harem romance. This book contains dark themes and possible triggers, so please read at your own discretion. Savage Kings is book 2 in the Savage Kingdom Series and ends with a cliffhanger. Recommended for mature readers.Savage Kingdom Series#1 Savage Princess#2 Savage Kings#3 Savage Kingdom",
  "genres": [
    "Reverse Harem",
    "Dark Romance",
    "Romance",
    "Dark",
    "Enemies To Lovers",
    "Mafia Romance",
    "Contemporary"
  ],
  "author": "Jennilynn Wyer",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/60501309-savage-kings"
}