{
  "title": "The Mysteries of Paris",
  "description": "This historic book may have numerous typos, missing text or index. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. 1903. Not illustrated. ... CHAPTER II. THE ARKEST. \"Good gracious! M. Rodolph,\" exclaimed Rigolette, running in, pale and trembling, \" a commissary of police and the guard have come here.\" \"Divine justice watches over me,\" said M. Pipelet, in a transport of pious gratitude. \"They have come to arrest Cabrion; unfortunately it is too late.\" A commissary of police, wearing his tricoloured scarf around his waist underneath his black coat, entered the lodge. His countenance was impressive, magisterial, and serious. \"M. le Commissaire is too late; the malefactor has escaped,\" said M. Pipelet, in a sorrowful voice; \"but I will give you his description,--villainous smile, impudent look, insulting --\" \"Of whom do you speak?\" inquired the magistrate. \"Of Cabrion, M. le Commissaire; but, perhaps, if you make all haste, it is not yet too late to catch him,\" added M. Pipelet. \"I know nothing about any Cabrion,\" said the magistrate, impatiently. \"Does one Jerome Morel, a working lapidary, live in this house?\" \"Yes, mon commissaire,\" said Madame Pipelet, putting herself into a military attitude. \"Conduct me to his apartment.\" \"Morel, the lapidary!\" said the porteress, excessively surprised;\" why, he is the mildest lambkin in the world. He is incapable of --\" \"Does Jerome Morel live here or not?\" \"He lives here, sir, with his family, in one of the attics.\" \"Lead me to his attic.\" Then, addressing himself to a man who accompanied him, the magistrate \"Let two of the municipal guard wait below, and not leave the entrance. Send Justing for a hackney-coach.\" The man left the lodge to put these orders in execution. \"Now,\" continued the magistrate, addressing himself to M. Pipelet, \" lead me to Morel.\" \"If it is all the same to you, mon commissaire, I will do that for Alfred; he is indisposed from Cabrion...",
  "genres": [
    "Classics",
    "Fiction",
    "France",
    "French Literature",
    "Mystery",
    "19th Century",
    "Literature"
  ],
  "author": "Eugène Sue",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/6051132-the-mysteries-of-paris"
}