{
  "title": "İnsan Geleceğini Nasıl Kurar?",
  "description": "“Bir hedef bulacaksınız, o uğurda çalışacaksınız, hedefinizi gerçekleştirmek için bir yol arayacaksınız, yol yoksa da o yolu yapacaksınız. Bir defa geçtiğiniz yoldan da bir daha geri dönmeyeceksiniz. Çünkü lüzumsuz geri dönüş başarısızlıktır, tekrara düşmektir, ufku kapatmaktır. Hedef bulmak, yol açmak ve aynı yoldan geri dönmemek… Hayattaki gayemiz budur.”İLBER ORTAYLIKendi kendinin mimarı olma ve hayata atılma… Yetenek, keşif, merak, potansiyel, heves, ayakta kalma güdüsü… Öğrenmenin, çalışmanın, düşünmenin yolları ve yöntemleri… Çalışacağız, okuyacağız, göreceğiz, planlayacağız, kendimize bir hayat kuracağız, tamam ama bunu hangi ölçüye göre yapacağız?İlber Ortaylı bu kitapta kişinin hayattaki gayesini nasıl belirleyeceğini, hedefini nasıl koyacağını, geleceğini nasıl planlayacağını, potansiyelini nasıl değerlendireceğini yüzyılların içinde dolaşarak, tarihin büyük düşünürlerinin binlerce yıla meydan okuyan görüşlerini de yanımıza katarak izah ediyor. Kendimize her gün sorduğumuz ve cevap bulmakta zorlandığımız soruları kendi deneyimleri ve engin bilgisi ışığında yanıtlıyor. · İnsan kendini nasıl inşa eder?· Potansiyelimizi değerlendirebilmek için hangi yeteneklere sahip olmalıyız?· İnsan hedefini nasıl koyar, geleceğe dönük planlarını nasıl yapar? · Yeteneğimizi, merakımızı nasıl keşfederiz ve nasıl geliştiririz?· Kendi talihimizin mimarı olabilir miyiz?· Etrafa bakma sanatı nedir, nasıl öğrenilir?· Mutluluk neden hem hakkımız hem de görevimizdir?· En zor zamanlarda direnme gücünü nerede bulacağız ve ilhamı nelerde arayacağız?İnsan Geleceğini Nasıl Kurar? yaşam tecrübesini paylaşmayı vazife bilen bir entelektüelden, İlber Hoca’dan, okurlar için bir yol açma, yol yapma, kendini inşa etme ve toplumu ayağa kaldırma rehberi. Platon, Seneca, Cicero, Farabi gibi bilgelerin ilhamı eşliğinde ve Yenal Bilgici’nin sorularıyla…",
  "genres": [
    "Self Help",
    "Personal Development",
    "Nonfiction",
    "Audiobook",
    "Turkish",
    "Roman"
  ],
  "author": "İlber Ortaylı",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/60496205-i-nsan-gelece-ini-nas-l-kurar"
}