{
  "title": "Shining the Light on PND: The Journey From Darkness To Healing From Post-Natal Depression",
  "description": "Have you had a baby and are just not feeling like yourself? Do you feel like you are in a dark fog, cannot think coherently and are riddled with anxiety and insomnia? Or is this your partner?Do you find yourself not connecting with motherhood or your beautiful baby?Are you having a baby soon and want to know what Post-Natal Depression looks and feels like so you can recognise it if it comes knocking on your door completely unannounced? Do you want to learn about insightful reflections and tools to help you survive it?Then this book is for you!Following the birth of both of her sons, instead of revelling in the most joyous time of her life, Namita fell into the darkest and heaviest of Post-Natal Depressions. She vowed that if she survived and healed through this most harrowing chapter in her life, she would rise up, break the stigma and hold that this has on women and share her story to inspire and create hope for others and their families navigating their way through this journey.Shining the Light on PND was created as a survival guide by allowing the reader to see exactly how she was thinking and feeling in hope that if you recognise this in yourself or your partner, you will gain the strength to reach out for help. It is an open recounting of her experience, reflections and learnings; perspectives on mindsets; and information about medications, hormones, strategies and healing tools for the mother to use, as well as her carer.Her hope is that it paves the path towards more understanding, universal compassion and awareness, so that women do not need to suffer in silence any longer.Namita draws upon her own heart-wrenching first hand experience as well as her professional knowledge as a pharmacist, studies in Eastern Ayurveda and infant massage, to provide practical tools to help hold the hands of any women suffering so they no longer feel alone along this path of healing.",
  "genres": [],
  "author": "Namita Mahanama",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/60495119-shining-the-light-on-pnd"
}