{
  "title": "Un chaval del barrio",
  "description": "Un chaval del barrio (Tenement Kid) es la autobiografía de Bobby Gillespie, referente indiscutible del rock británico independiente de finales de los ochenta y los noventa como frontman de Primal Scream, quienes con su álbum Screamadelica de 1991 —para muchos uno de los mejores de todos los tiempos— redefinieron las claves del rock de fin de siglo con su espíritu abiertamente hedonista, en consonancia con la escena rave de clubs británica y las drogas de diseño como el éxtasis, por entonces en su máximo apogeo.Nacido en el seno de una familia de clase trabajadora y militante de Glasgow en el verano de 1961, Gillespie creció en el conflictivo barrio de Springburn poco antes de que fuera desmantelado. A los dieciséis años abandonó la escuela y empezó a trabajar como aprendiz de litógrafo, y cuando descubrió a los Clash y a los Sex Pistols fue imbuido por el rock y el punk, que para el joven significaron una visión iconoclasta de la rebelión de clases y lo conminaron a forjarse como artista. Hizo sus pinitos con Altered Images —a quienes acompañó como roadie de teloneros de Siouxsie & The Banshees—, tocó los teclados en la primera formación de The Wake y la batería con los Jesus and Mary Chain durante la época del esencial Psychocandy, para luego liderar su propio Primal Scream.Estructurado en cuatro bloques, Un chaval del barrio está construido como un redoble de batería in crescendo que estalla en la última parte, con la llegada del Segundo Verano del Amor a finales de los ochenta y el advenimiento de la cultura de club y el acid house, espíritu del que se contagió Primal Scream para forjar uno de los álbumes más influyentes de los noventa y punta de lanza del prestigioso sello Creation Records de Alan McGee. A modo de colofón, el libro relata la desenfrenada gira de verano de 1991 que precedió al lanzamiento de Screamadelica.Un chaval del barrio es un libro lleno de gozo, asombro, pasión e ira de un apóstol del rock que contribuyó a reformular de forma radical el futuro del sonido de la música popular británica. Publicado treinta años después de este hito de la historia de la música, Gillespie cuenta los avatares de una década que arruinó Margaret Thatcher y salvó el acid house.«Un viaje honesto, una elegía del poder transformador del rock contada con el corazón y con el alma. El Evangelio según Bobby Gillespie.»Warren Ellis«Gillespie es el Oliver Twist del rock. Un cuento de hadas punk, muy agudo cuando habla de la lucha de clases, la música o el estilo, y un punto de vista único sobre el mundo que dio lugar a uno de los mejores grupos de todos los tiempos. No pude parar de leer.»Courtney Love«Si hubiera que sintetizar el espíritu del rock en una persona, esa sería Bobby Gillespie. Este libro no es solo un canto a una vida consagrada al rock sino también a la preciosa clase trabajadora que lo forjó. Mientras leía, sentí que se me caían las lágrimas de alegría, aunque también me entristeció constatar cuánto hemos perdido.»Irvine Welsh",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Scotland",
    "Pop Culture"
  ],
  "author": "Bobby Gillespie",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/60496743-un-chaval-del-barrio"
}