{
  "title": "Smart Mouth",
  "description": "The rockstarThere are lots of assumptions people make about rockstars. Shallow. Player. Addict. The truth? I’m none of those. The even bigger truth…the only opinion I care about is her’s and she hates me. Her as in Gwen Matthews, my twin brother’s best friend, the unrequited love of my life. She thinks I’m a liar and a jerk which is why I pretend to be my brother when she needs help one night. Except Gwen is a genius. Literally. So it doesn’t take her long to figure out it’s me and not my brother, but maybe, just maybe, she’s willing to give me a second chance. Because maybe when she looks at me, she only sees a rockstar with her best friend’s face, but when I look at her, I see my other half. She centers me in a way that no rhythm or line of lyric ever could. The scientistI have three priorities in life at the moment: finish my research, defend my dissertation, and get my Ph.D., so that I can actually figure out what I’m supposed to do with my life. Tom Mendoza won’t help me achieve any of those things. Yet I can’t help the sudden feeling that I’ve been completely wrong about him all this time. The day we first met when we were both teenagers, I saw a glimpse of a sweet, funny boy that felt very much like a kindred spirit; awkward and full of energy and dreams. But that guy seemed to disappear and in his place was this stereotypical stupidly hot rock star that did not make sense in my world. Being a scientist means being willing to admit when you’re wrong and reevaluating everything. I might not understand much about human behavior, but I can clearly see the tender underbelly that Tom protects. The subtle rituals he uses to stave off his anxiety. Yes, he’s ridiculously hot, but his soul just might be more beautiful than his face and I’m not sure what to do with that. Especially when I find out that he’s in love with me. 'Smart Mouth' is a full-length contemporary romance and can be read as a standalone. Book #4 in the Work For It series, Educated Romance World, Penny Reid Book Universe.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Friends To Lovers",
    "Adult",
    "Audiobook"
  ],
  "author": "Emma Lee Jayne",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/60533208-smart-mouth"
}