{
  "title": "Bookshop by the Bay",
  "description": "The Bookshop by the Bay is a breezy, escapist beach read from powerhouse bestselling women’s fiction author Pamela Kelley.Two lifelong friends. One bookshop by the beach. And the summer that could change everything.Jess loves her work as a high-profile lawyer in the respectable and austere city of Charleston. But when she finds her husband, Parker, has been cheating on her with his assistant, she retreats, with her thirty year-old daughter Caitlin for support, to her childhood home on Cape Cod, in Chatham. Caitlin has always been bright but directionless, looking for her passion but keeps coming up blank. And Jess needs to regroup with the help of good food and wine, the company of her best friend, Allison, and come up with a plan for the future.Allison’s career has hit a low. After twenty years as an editor for the Chatham magazine, circulation is dwindling and though her boss and long-time friend, Jim, does everything to keep her, she has no choice but to take a step back. With a career on hiatus and her main relationship being with Chris, her ex-husband who is still a good friend, Allison is at a pivotal point in life. Her daughter Julia opened her own artisanal jewelry shop a year prior, and she has the kind of day-to-day fulfillment Allison yearns for.When Allison stops into her beloved local bookstore one day and learns that the owner wants to sell, a long-held dream turns into a reality, thanks to Jess. Allison and Jess set a plan in motion and what was once a place that held warm childhood memories is now theirs to run. As the two friends, along with the help of their daughters, reopen the doors of the cherished bookstore and adjacent coffee shop to the community, they also open themselves up to the possibility of romance, the bonds of mothers and daughters, and the magic of second chances.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Books About Books",
    "Audiobook",
    "Womens Fiction"
  ],
  "author": "Pamela M. Kelley",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/60522619-bookshop-by-the-bay"
}