{
  "title": "Kill Order",
  "description": "THE GUILD is a new series born from the Shadow Grove world. While some characters have been met in the existing MADISON KATE and HADES series, their cameos were not crucial to THE GUILD storyline. ◆◆◆kill ordernouna document issued by the Circle allowing for the murder of a mercenary with no agency repercussions. A rarely-wielded tool, a kill order brings the Circle’s full wrath down on its target. Worthless, useless, waste of space. That’s what my father liked to remind me on a daily basis. I was a stain on his pristine reputation. We both were, Moana and I. He taught us that we were less than nothing, we were an inconvenience. Slugs on the cabbage of life. But he was wrong.Because of him, my sister and I dedicated our lives to helping others. Fighting for others who couldn’t fight for themselves. We took risks, gained ranks, and eventually discovered a purpose. My big sister, my best friend… her pain and loss gave us the direction we both so desperately needed. We were a unit. A family. A team. Dedicated to a purpose. My calling in life. Until I met her.How do I tame the deadliest of women? How can I prove myself to her, snaring her in the bonds that have lashed me to her? How do I navigate a partnership with a man I loathe, to whom I’d spent years wanting to destroy?Destroy the Guild. Take Danny home. Live our life.That had been my goal.Now?I want her back. I want the Guild out of her life. I’ll sell my soul and work with my enemy if I have to.Whatever it takes.◆◆◆The Guild series is a dark MFM romance and contains scenes that may be uncomfortable or disturbing to some readers. Please use your own discretion as to whether this is the right series for you. None of the main characters are the \"good guys\" and their moral code does differ greatly from your usual romance heroes. Please don't attempt to hold them to heroic standards, as they will fall short. KILL ORDER is book THREE of THREE in The Guild trilogy. Recommended Reading Order for Shadow Grove interconnected series: MADISON KATE #1 Hate#2 Liar#3 Fake#4 KateHADES#1 7th Circle#2 Anarchy#3 Club 22 #4 TimberMADISON KATE NOVELLA #4.5 VAULT THE GUILD#1 Honey Trap#2 Dead Drop#3 Kill Order This is the chronological order of linked series, but it's not necessary to read prior series before THE GUILD.",
  "genres": [
    "Reverse Harem",
    "Dark Romance",
    "Romance",
    "Dark",
    "M F M",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Tate James",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/60531751-kill-order"
}