{
  "title": "Perfectly Imperfect: A Life in Progress",
  "description": "“ You can tell a woman’s whole life story from the possessions in her jewelry box. Like reading a palm, you can trace the points where her life has intersected with memorable events, people, places, and loves. You can speculate on the essence of her personality, all from what she has accumulated in that box. ”—from Perfectly ImperfectIn her acclaimed first book, In an Instant, Lee Woodruff, along with her husband, ABC News anchor Bob Woodruff, wrote eloquently and honestly about the struggles they faced together as Bob recovered from a traumatic brain injury sustained in Iraq. Now, with the same candor and clarity, Lee Woodruff chronicles her life as wife, mother, daughter, sister, and friend.Woodruff’s deeply personal and, at times, uproariously funny stories highlight such universal topics as family, marriage, friends, and how life never seems to go as planned. On raising “Now with a boy and girl on the precipice of serious adolescence, the bathroom door is sealed tighter than a government nuclear testing ground.” On her changing “Over the last ten years my own knees had begun to form those dreaded smiley faces, sagging underneath.” How she copes with “Swimming surrounds me in the velvet wet of a bluish green world where I can dive deep down and sob with no trace.” Even her sense of “I’ve always been more Leave It to Beaver than Sex in the City .”In a voice that is fresh, irreverently funny, and irresistible, Lee Woodruff traces the quiet moments and memorable events that have shaped her life in progress.  Perfectly Imperfect is the testimonial of a woman who embraces the chaos of her surroundings, discovers the splendor of life’s flaws, and accepts that perfection is as impossible to achieve as a spotless kitchen floor.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Humor",
    "Inspirational",
    "Self Help",
    "Biography Memoir"
  ],
  "author": "Lee Woodruff",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/6051721-perfectly-imperfect"
}