{
  "title": "Not in the Cards",
  "description": "“Coming back to Beaufort was only supposed to be a touch-and-go. Check on my sister, empty my storage unit, and move on to whatever’s next… The minute I saw Mel again, roots sounded better than wings.” For Lieutenant Commander Jason McGrath, the military was his ticket out of Beaufort, North Carolina. A career flying fighter jets for the Navy taught him a thing or two about staying cool under pressure. All that training flew out the window when he rolled back into his hometown and fell head over heels for the girl next door.The reason he had to leave in the first place. Melissa Jacobsen is used to caring for everyone else. When the formidable emergency room nurse isn’t treating patients, she fills her days with every activity possible to keep from falling into a lonely pit of despair. For Mel, the dating pool is as lifeless as the apartment which she shares with zero people, plants, or pets. A freak accident turns into a chance meeting that throws Jason and Melissa back into each others’ orbits. Jase is ready to go after the one that got away, but secrets between the two people he loves most threaten his happily ever after. What will happen when everything Melissa has been hiding from the Poker Club comes to light? Will their friendships survive? Can love really conquer all? Not in the Cards is the fifth book in the Beaufort Poker Club series. This book is a best friend’s brother, roommate romance. Get ready for a feels-packed love story with a fairy tale happily ever after, and some moments that are so hot they’ll melt your Kindle! For a note regarding sensitive content in Not in the Cards, please see the preface at the beginning of the book.The Beaufort Poker Club Series is meant to be read in order.Start with book one, Poker Face!",
  "genres": [
    "Friends To Lovers",
    "Romance",
    "Found Family",
    "Small Town Romance",
    "Forced Proximity",
    "Military Fiction",
    "Doctors"
  ],
  "author": "Maggie C. Gates",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/60529324-not-in-the-cards"
}