{
  "title": "Beauty in Deception",
  "description": "“I’m a decoy, another woman’s double, and now her enemy has taken me.”A DARK MAFIA ROMANCEMy life is governed by three rules.Don’t get caught.If caught, play the role.Win time until rescue arrives.My life depends on playing the role convincingly. I’ve been trained for that role since the age of fifteen. For ten long years, I’ve been taught to be someone else, to respond to a different name, and to live in another woman’s shadow. Evie Warren is the most coveted mafia princess in the country, and I’m her double. I’m the decoy, her stunt girl, so to speak.So when I break the first rule, I know it’s bad. I know it’s going to get worse when the man who carjacked my convoy gives me two options, telling me he hopes I won’t choose the second one. And when he calls me Evie, he confirms my worst suspicion. The attack was premeditated.There can only be two reasons why he wants to take Evie. He wants her either for ransom or for revenge, and Bell Warren, her father, has more enemies than money. Beauty in Deception is a short standalone novel with no cliffhanger. The book is part of the Diamond Magnate collection. You don't need to read the other books to follow this story.Other books in the Diamond Magnate collection in Standalone Novel(Dark Arranged Marriage Romance)Beauty in the BrokenDiamonds are Forever Trilogy(Dark Mafia / Kidnapping Romance)Diamonds in the Dust (Book 1)Diamonds in the Rough (Book 2)Diamonds are Forever (Book 3)Beauty in the Stolen Trilogy(Dark Heist Romance)Stolen Lust (Book 1)Stolen Life (Book 2)Stolen Love (Book 3)Beauty in Imperfection Duology(Dark Arranged Marriage Romance)Imperfect Intentions (Book 1)Imperfect Affections (Book 2)",
  "genres": [
    "Dark Romance",
    "Dark",
    "Romance",
    "Enemies To Lovers",
    "Abuse",
    "Mafia Romance",
    "Crime"
  ],
  "author": "Charmaine Pauls",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/60522479-beauty-in-deception"
}