{
  "title": "Espada, hambre y cautiverio. La conquista islámica de Spania",
  "description": "La conquista islámica de la península ibérica, Spania, culminaba la expansión hacia Poniente del pujante islam, que había comenzado menos de cien años antes y que había llevado a los seguidores del Profeta a extender su fe y sus dominios desde el Atlántico hasta el corazón de Asia. Como cualquier conquista, se hizo por la espada y acarreó hambre y cautiverio. Yeyo Balbás, investigador experto en el periodo y autor de novelas históricas como El reino imposible, Pax romana o Pan y circo, escribe, con oficio de historiador y prosa de novelista, una documentada y completa narración del final de la Spania visigoda y de la implantación musulmana. Frente a los relatos tradicionales, a menudo ideologizados, lastrados por una lectura acrítica de las fuentes o con un foco muy cerrado en la península ibérica, esta obra integra la conquista en la expansión islámica por el Mediterráneo. Un análisis global que precede y proporciona muchas claves para entender lo que aconteció en la Península tras la –mal llamada– batalla de Guadalete y hace hincapié en las cuestiones bélicas, habitualmente ausentes en la historiografía, y cuyo estudio es necesario para explicar lo que fue una ocupación manu militari. Se analizan ejércitos y combatientes, estrategias y tácticas y aúna la renovada lectura de las fuentes con los aportes arqueológicos, para iluminar aspectos como el cruce del Estrecho, el derrumbe del reino godo cual castillo de naipes o la resistencia en las montañas asturianas, con la batalla de Covadonga, de la que acaso este año –dudas aparte de su datación– se cumplen mil trescientos años. Porque hasta allí llega este libro, hasta explicar cómo un «asno salvaje» llamado Pelayo pudo articular un foco de resistencia en el septentrión peninsular que constituyó el germen de lo que ha venido a llamarse Reconquista.",
  "genres": [],
  "author": "Yeyo Balbás",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/60536187-espada-hambre-y-cautiverio-la-conquista-isl-mica-de-spania"
}