{
  "title": "Stand For Ukraine",
  "description": "Protect the innocent.Provide for families.We stand with Ukraine.Across the globe authors have come together to provide stories filled with hope, heart and understanding, inspired by the events of February 2022.STAND FOR UKRAINE is a collection of romance, women’s fiction and poetry. Proceeds go to Save the Children’s efforts to provide Ukrainian children with food, warmth, shelter and psychological support.Authors:Aarti V Raman, Ally Vance, Amanda Cuff, A McCarty, Andie Bale, Pandora Snow, Anna Klein, Anna Volkin, Annee Jones, April A. Luna, April D. Berry, M.A. Lee, A.M. Roark, Sarah Stein, Riana Everly, Lesley Hoover, Bria James, C.A. Rene, Caraway Carter, Cassie Simon, Corinne M Knight, Dakota Willink, Danielle Pays, Dawn McGraw, D A Nelson, Debra Elise, Demelza Carlton, Diane Jones, Sharon A. Mitchell, Emily Rose, EmKay Connor,Eva Moore, Ginger Ring, Dylan Quinn, Gwen Dylan, Caia Daniels, Harlow Layne, Harper Michaels, Heather D’Agostino,Heather Scarlett, Helena Novak, Carol Van Den Hende,Iuliana Foos, Jakki Frances, Jane Suen, Jeanette Taylor Ford, Jen Stevens, Jennifer M. Miller, Jenny Fenshaw, JCC Downing, Tasha Blythe, J. P. Uvalle, K Leigh, Karigan Hale, Kasey Hill, Élodie Garroway, Katherine Moore, Katie Rae, Kimberly Halstead, Kristie Leigh, Olivia Rhymer, Kristin T. De La Garza, Dakota Star, Lisa Wells, M.Culler, S.C. Principale, Maida Malby, Mandy Bee, Margaret Madigan, Maria Macdonald, Megan Ryder, M Jameson, Melissa Riddell, Lissa Lynn Thomas, Merrie Destefano, Chele Maccabe, Michelle Iannarelli, Maya Lemaire, Leila Coltyn, Kathleen Ryder, N.J. Ember, A.R. Bell, Remy Reigns, Renee Dahlia, Leann Castellanos, RJ Gray, Robin Andrews, Cass K, Rosie Wylor-Owen, Rubi Jade, Liz Martinson, Candace Sams, Guinevere Jordan, Shannon O'Connor, Miranda Jameson, Simone Leigh, Skye MacKinnon, Skye Turner, Sofia Aves, Jo Seysener, J. T. Silver, Susan Horsnell, Suki McMinn, Tanya Dawson, Tanya Nellestein, Taya Rune, T.R. Weatherly, T Wells Brown, Tina Glasneck, Tracy Broemmer, Tracy Reed, Trinity Wood, Yolanda Olson, Zoey Indiana, Daniel Cade Quinn, Sabrina Silvers, Kari Ganske, Faith Justice, Nina Knight, Michelle L. De La Garza, Sloane Nicole",
  "genres": [
    "Anthologies",
    "Romance",
    "Fiction"
  ],
  "author": "Trinity Wood",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/60546251-stand-for-ukraine"
}