{
  "title": "Summer of the Wanderer",
  "description": "Five years ago, a girl fell from a tree, and the fate of an entire country was altered…As a young girl, Elena fell while climbing a tree with her best friend, Aleks. Thrown into the shore of the river of the dead, she found a boy named Evander Akti, who was there thanks to a terrible fall of his own…thousands of miles away in Arktos. Together, they turned their back on the river and went into the dark, holding each other tight as they escaped back to the land of the living. But that was only possible because Aleks, left behind to watch Elena fall, made a deal with Death. In return for saving Elena’s life, Aleks is bound to be a ferryman, guiding spirits to the other shore. While Elena dreams of the boy she met on the river and Evander holds his heart in reserve for Elena, Aleks takes the hands of the dead and leads them to whatever awaits in the beyond. When Elena declares her intent to go to Arktos, Aleks jumps at the chance to join her, hoping to change his fate and leave the ghosts behind with the snow. What Aleks finds in Arktos is not an escape from his duties as ferryman, but a country tipped out of balance, teeming with the restless dead. While Aleks struggles to right this imbalance without losing his humanity in the process, Elena learns that it’s one thing to leave home for a boy she’d met on the shores of the dead, and another to actually find him…especially when she learns that time doesn’t work quite the same way in the world beyond, and finds Evander much older and with children of his own. When Elena, Evander, and Aleks’s paths converge, sparks fly, and they learn that they each have a role to fill if they’re to set things right in Arktos. SUMMER OF THE WANDERER is a poly romance featuring a stern dom with a country to rule, a brave dominant who refuses to settle for anything less than her heart’s desire, and a submissive ferryman who just wants his two dominants to wreck him in the best way possible. (PLEASE BE ADVISED this title features explicit m/m/f, m/m and m/f sex scenes, polyamory, and natural power exchange.)",
  "genres": [
    "Fantasy",
    "Romance",
    "Polyamory",
    "M M F",
    "Transgender",
    "BDSM",
    "M M Romance"
  ],
  "author": "Iris Foxglove",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/60544180-summer-of-the-wanderer"
}