{
  "title": "Entmenschlicht - Warum wir Prostitution abschaffen müssen",
  "description": "Mit 17 flüchtet Huschke Mau aus ihrem gewalttätigen Elternhaus und weiß nicht aus noch ein. Mittellos und ohne Unterstützung rutscht sie in die Prostitution und damit einhergehend in eine Alkohol- und Drogenabhängigkeit. Ihr erster Zuhälter: ein Polizist. Zehn Jahre vergehen, bis sie sich aus diesem Teufelskreis befreien kann.Inzwischen hat Huschke Mau einen Studienabschluss, promoviert und fordert den gesellschaftlichen Ausstieg aus der Prostitution. Ihre These: Prostitution beinhaltet immer sexuelle Gewalt. Frauen in der Prostitution haben meist keine Wahl, weil sie sich in Abhängigkeiten oder Notlagen befinden. Freier hingegen schon. Niemand zwingt sie, Frauen zu kaufen. Nicht die Frauen sollten kriminalisiert werden oder beschämt sein, sondern die Männer.In ihrem Buch erklärt und beschreibt Huschke Mau das System Prostitution: wie Frauen hineingelangen, warum es so schwer ist, wieder auszusteigen, welche Traumata sie dort erleben und was an der Sicht unserer Gesellschaft und Medien auf Prostitution problematisch ist.„Ich glaube, mit dem Buch habe ich mich mehr ausgezogen als jemals während meiner Zeit als Prostituierte. Ich hätte diese Tür in die Vergangenheit einfach schließen können und nie mehr zurückschauen müssen. Aber ich kann nicht. Ich kann einfach nicht an all den Taxis vorbeigehen, die Bordellwerbung durch meine Stadt fahren. Ich kann die Zeitungsartikel über bei Bordellrazzien gefundene minderjährige Mädchen nicht nicht lesen. Ich kann einfach nicht ignorieren, dass so viele Frauen und Mädchen noch in der Prostitution sind, dass ihnen Gewalt angetan wird, Tag für Tag.“",
  "genres": [
    "Nonfiction",
    "Feminism",
    "German Literature",
    "Politics",
    "Prostitution",
    "Biography"
  ],
  "author": "Huschke Mau",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/60552141-entmenschlicht---warum-wir-prostitution-abschaffen-m-ssen"
}