{
  "title": "Untangled: Walking the Eightfold Path to Clarity, Courage, and Compassion",
  "description": "We live in a shallow “junk” pleasure-seeking culture, searching for connection in the wrong places, keeping our restlessness and anxiety at bay with unfulfilling distractions. The results of our junk pleasure culture are obvious: hundreds of articles have been published about the rise of loneliness and its detrimental effects on our mental, emotional, and physical health. Even those of us who have succeeded in the ways that society encourages—getting married, making money, and acquiring status—often feel unanchored, disengaged, and empty. What we want is to live a life of true pleasure—a life infused with meaning, marked by genuine relationship, and aligned with what matters most to us. How do we create a life of true pleasure, one that is worth living? Untangled is a welcoming guidebook to finding expansive ease and joy through what is traditionally called the eightfold path, one of Buddhism’s foundational teachings. Psychotherapist and Zen teacher Koshin Paley Ellison walks readers through this time-tested map for transformation and lasting happiness. Following the eight roads creates profound change inside and out, from everyday interactions to our most intimate relationships (especially the one with ourselves). With his signature mix of storytelling and unexpected humor, Koshin uses anecdotes from his own life as a young gay kid dealing with abuse and discrimination as well as tales and teachings from Eastern and Western wisdom traditions to introduce mainstream readers to the eight roads for the first time and rejuvenate it for those already familiar. It is an ancient cure that’s up to the challenge of addressing the dysfunction of our times.",
  "genres": [
    "Buddhism",
    "Nonfiction",
    "Spirituality",
    "Self Help",
    "Religion",
    "Philosophy",
    "Psychology"
  ],
  "author": "Koshin Paley Ellison",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/60568152-untangled"
}