{
  "title": "A Dark History of Sugar",
  "description": "A Dark History of Sugar delves into our evolutionary history to explain why sugar is so loved, yet is the root cause of so many bad things.Europe’s colonial past and Britain’s Empire were founded and fuelled on sugar, as was the United States, the greatest superpower on the planet – and they all relied upon slave labour to catalyse it.A Dark History of Sugar focusses upon the role of the slave trade in sugar production and looks beyond it to how the exploitation of the workers didn’t end with emancipation. It reveals the sickly truth behind the detrimental impact of sugar’s meteoric popularity on the environment and our health. Advertising companies peddle their sugar-laden wares to children with fun cartoon characters, but the reality is not so sweet.A Dark History of Sugar delves into our long relationship with this sweetest and most ancient of commodities. The book examines the impact of the sugar trade on the economies of Britain and the rest of the world, as well as its influence on health and cultural and social trends over the centuries.Renowned food historian Neil Buttery takes a look at some of the lesser-known elements of the history of sugar, delving into the murky and mysterious aspects of its phenomenal rise from the first cultivation of the sugar cane plant in Papua New Guinean in 8,000 BCE to becoming an integral part of the cultural fabric of life in Britain and the rest of the West – at whatever cost. The dark history of sugar is one of exploitation: of slaves and workers, of the environment and of the consumer. Wars have been fought over it and it is responsible for what is potentially to be the planet’s greatest health crisis.And yet we cannot get enough of it, for sugar and sweetness has cast its spell over us all; it is comfort and we reminisce fondly about the sweets, cakes, puddings and fizzy drinks of our childhoods with dewy-eyed nostalgia. To be sweet means to be good, to be innocent; in this book Neil Buttery argues that sugar is nothing of the sort. Indeed, it is guilty of some of the worst crimes against humanity and the planet.",
  "genres": [
    "History",
    "Nonfiction",
    "Food"
  ],
  "author": "Neil Buttery",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/60551674-a-dark-history-of-sugar"
}