{
  "title": "Natural Selection: Gary Giddins on Comedy, Film, Music, and Books",
  "description": "Long recognized as America's most brilliant jazz writer, the winner of many major awards--including the prestigious National Book Critics Circle Award--and author of a highly popular biography of Bing Crosby, Gary Giddins has also produced a wide range of stimulating and original cultural criticism in other fields. With Natural Selection , he brings together the best of these previously uncollected essays, including a few written expressly for this volume.The range of topics is spellbinding. Writing with insight, humor, and a famously deft touch, he offers sharp-edged perspectives on such diverse subjects as Federico Fellini and Jean Renoir, Norman Mailer and Ralph Ellison, Marlon Brando and Groucho Marx, Duke Ellington and Bob Dylan, horror and noir, the cartoon version of Animal Farm and the comic book series Classics Illustrated . Giddins brings to criticism an uncommon ability, long demonstrated in his music writing, to address in very few words an entire career, so that we get an in-depth portrait of the artist beyond the film, book, or recording under review. For instance, Giddins offers a stunning reappraisal of Doris Day, who he terms \"the coolest and sexiest female singer of slow ballads in film history.\" He argues eloquently for a reconsideration of the forgotten German-language novelist Soma Morgenstern. In a section on comedy, he offers fresh perspectives on the three great silent film stars--Chaplin, Keaton, andLloyd--while resurrecting the legendary Jack Benny and reevaluating the controversial Jerry Lewis. There's also a memorable look at Bing Crosby's film career (he calls Crosby's blockbuster Going My Way \"a neglected masterpiece\") and a close examination of Marcel Carne's beloved Children of Paradise . Of course, Giddins also supplies excellent commentary on major and underrated figures, and especially the uses of jazz in film.A wonderful gathering of little-known treasures, Natural Selection will broaden the perception of Gary Giddins as one of our most important cultural critics.",
  "genres": [
    "Film",
    "Music",
    "Literary Criticism"
  ],
  "author": "Gary Giddins",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/605542.Natural_Selection"
}