{
  "title": "Cancel Wars: How Universities Can Foster Free Speech, Promote Inclusion, and Renew Democracy",
  "description": "An even-handed exploration of the polarized state of campus politics that suggests ways for schools and universities to encourage discourse across difference.College campuses have become flashpoints of the current culture war and, consequently, much ink has been spilled over the relationship between universities and the cultivation or coddling of young American minds. Philosopher Sigal R. Ben-Porath takes head-on arguments that infantilize students who speak out against violent and racist discourse on campus or rehash interpretations of the First Amendment. Ben-Porath sets out to demonstrate the role of the university in American society and, specifically, how it can model free speech in ways that promote democratic ideals.In Cancel Wars , she argues that the escalating struggles over “cancel culture,” “safe spaces,” and free speech on campus are a manifestation of broader democratic erosion in the United States. At the same time, she takes a nuanced approach to the legitimate claims of harm put forward by those who are targeted by hate speech. Ben-Porath’s focus on the boundaries of acceptable speech (and on the disproportional impact that hate speech has on marginalized groups) sheds light on the responsibility of institutions to respond to extreme speech in ways that proactively establish conversations across difference. Establishing these conversations has profound implications for political discourse beyond the boundaries of collegiate institutions. If we can draw on the truth, expertise, and reliable sources of information that are within the work of academic institutions, we might harness the shared construction of knowledge that takes place at schools, colleges, and universities against truth decay. Of interest to teachers and school leaders, this book shows that by expanding and disseminating knowledge, universities can help rekindle the civic trust that is necessary for revitalizing democracy.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Sigal R. Ben-Porath",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/60557138-cancel-wars"
}