{
  "title": "Disability Pride: Dispatches from a Post-ADA World",
  "description": "A disabled journalist documents how the “ADA Generation” has grown up, the rise of neurodiversity, impact of identity politics and representation, and the state of a disability rights and justice agenda\nWeaving together interviews with reportage, Disability Pride traces the evolution of societal attitudes and activist agendas around disability from a fight for civil rights to a celebration of identity and heritage.Since the American with Disabilities Act (ADA) passed over thirty years ago, changes can be seen everywhere—wheelchair ramps, braille signs and menus, public transit lifts, closed captioning on TVs, \"reasonable accommodations\" by employers such as flextime and telecommuting, and myriad other measures. People under 30 have not lived in a world without the expectation that disabled people should fully participate in society. Journalist Ben Mattlin demonstrates how a new generation of young people and disabled activists have made diversity and inclusiveness hallmarks of today’s social justice movements and modern media. From a giant Times Square billboard featuring disabled model Jillian Mercado to paraplegic actor and singer Ali Stroker becoming the first wheelchair-using performer ever to win a Tony, the world is ready to see, even to celebrate, nontraditional images of beauty.Mattlin explores how this new wave of disability visibility and pride is furthering the cause of disability justice. Today, activists are fighting for long-term personal-assistance services and for mental-health support systems and it's coming from a broad spectrum of disability perspectives. Although this new generation of activism may be different from the protest actions of previous generations, Disability Pride demonstrates how to fearlessly push the movement forward.",
  "genres": [
    "Disability",
    "Nonfiction",
    "Social Justice",
    "Politics",
    "Sociology",
    "History",
    "Disability Studies"
  ],
  "author": "Ben Mattlin",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/60563931-disability-pride"
}