{
  "title": "The Curse of the Good Girl: Raising Authentic Girls with Courage and Confidence",
  "description": "Bestselling author of Odd Girl Out , Rachel Simmons exposes the myth of the Good Girl, freeing girls from its impossible standards and encouraging them to embrace their real selvesIn The Curse of the Good Girl , bestselling author Rachel Simmons argues that in lionizing the Good Girl we are teaching girls to embrace a version of selfhood that sharply curtails their power and potential. Unerringly nice, polite, modest, and selfless, the Good Girl is a paradigm so narrowly defined that it's unachievable. When girls inevitably fail to live up- experiencing conflicts with peers, making mistakes in the classroom or on the playing field-they are paralyzed by self-criticism, stunting the growth of vital skills and habits. Simmons traces the poisonous impact of Good Girl pressure on development and provides a strategy to reverse the tide. At once expository and prescriptive, The Curse of the Good Girl is a call to arms from a new front in female empowerment.Looking to the stories shared by the women and girls who attend her workshops, Simmons shows that Good Girl pressure from parents, teachers, coaches, media, and peers erects a psychological glass ceiling that begins to enforce its confines in girlhood and extends across the female lifespan. The curse of the Good Girl erodes girls' ability to know, express, and manage a complete range of feelings. It expects girls to be selfless, limiting the expression of their needs. It requires modesty, depriving the permission to articulate their strengths and goals. It diminishes assertive body language, quieting voices and weakening handshakes. It touches all areas of girls' lives and follows many into adulthood, limiting their personal and professional potential.Since the popularization of the Ophelia phenomenon, we have lamented the loss of self-esteem in adolescent girls, recognizing that while the doors of opportunity are open to twenty-first-century American girls, many lack the confidence to walk through them. In The Curse of the Good Girl , Simmons provides a catalog of tangible lessons in bolstering the self and silencing the curse of the Good Girl. At the core of Simmons's radical argument is her belief that the most critical freedom we can win for our daughters is the liberty not only to listen to their inner voice but also to act on it.Watch a Video",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Feminism",
    "Psychology",
    "Education",
    "Self Help",
    "Gender"
  ],
  "author": "Rachel Simmons",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6055995-the-curse-of-the-good-girl"
}