{
  "title": "The World Record Book of Racist Stories",
  "description": "From the New York Times bestselling authors of You’ll Never Believe What Happened to Lacey, comedian Amber Ruffin and her sister Lacey, a new collection of hilarious, intergenerational anecdotes full of absurd detail about everyday experiences of racism.Families may not always see eye to eye; we get on each other’s nerves, have different perspectives and lives—especially when we consider how we've grown up in different generations. But for the Ruffin family and many others, there has been one constant that connects them: racism hasn’t gone anywhere.From her raucous musical numbers to turning upsetting news into laughs as the host of The Amber Ruffin Show or in her Late Night with Seth Meyers segments, Amber is no stranger to finding the funny wherever she looks. With equal parts heart and humor, she and her sister Lacey Lamar shared some of the eye-opening and outrageous experiences Lacey had faced in Nebraska in their first book. Now, the dynamic duo makes it clear—Lacey isn’t the only one in the family with ridiculous encounters to share! Amber and Lacey have many more uproarious stories, both from their own lives and the entire Ruffin family.Recounting the wildest tales of racism from their parents, their siblings, and Amber’s nieces and nephews, this intergenerational look at ludicrous (but all too believable) everyday racism as experienced across age, gender, and appearance will have you gasping with shock and laughter in turn. Validating for anyone who has first-hand experience, and revealing for anyone who doesn’t, Amber and Lacey’s next book helps us all find the absurdity in the pervasive frustrations of racism. Illuminating and packed with love and laughter, this is a must-read for just about everyone.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Audiobook",
    "Memoir",
    "Race",
    "Essays",
    "Social Justice"
  ],
  "author": "Amber Ruffin",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/60568490-the-world-record-book-of-racist-stories"
}