{
  "title": "Occult Russia: Pagan, Esoteric, and Mystical Traditions",
  "description": "Explores how the search for meaning in the post-Soviet era has given rise to a revival of ancient spiritual traditions and a plethora of new movements• Reveals the survival of ancient Slavic deities, pagan practices, and folk medicine tradition in modern Russia, including the indigenous pre-Christian customs of the Mari people and the shamanic traditions of Siberia• Examines the precursors to modern spiritual movements in the “Silver Age” (1880-1920) and discusses the impact of the Russian Revolution on spiritual and esoteric groups• Offers a deep look at the controversial Book of Veles, branded by some as a forgery and hailed by others as an epic chronicle of the Slavic peopleIn this in-depth look at occult and esoteric traditions in Russia, Christopher McIntosh explores the currents of mysticism, myth, magic, and the spiritual to which the Russian soul has always been attuned. The author explains how the search for meaning in the post- Soviet era has given rise to a revival of ancient spiritual traditions and a plethora of new movements. He examines the precursors to these movements in the “Silver Age” (1880-1920) before the Revolution, when alternative forms of spirituality were finding new life as a reaction to the ongoing climate of violence, revolt, and repression. He discusses the impact of the Russian Revolution on spiritual and esoteric groups and shows how their activities were tolerated and even in some instances encouraged--until Stalin assumed power in 1924.Discussing the spiritual reawakening after the fall of communism in 1989, the author explores the survival of Slavic deities and pagan practices in modern Russia, including the indigenous pre-Christian customs of the Mari people and the shamanic traditions of Siberia. He examines the resurgence of the Orthodox Church and the burgeoning of alternative forms of spirituality. He offers a deep look at the controversial Book of Veles, branded by some as a forgery and hailed by others as an epic chronicle of the Slavic people. He also explores the interface between spirituality and the arts and the unique qualities of the Russian language as a medium for the sacred.Revealing the implications of the modern Russian spiritual and esoteric renaissance, McIntosh shows that it still remains to be seen whether Edgar Cayce’s prediction of Russia as the hope of the world will come true or if Russia will remain, as Churchill famously stated, “a riddle, wrapped in a mystery, inside an enigma.”",
  "genres": [
    "Occult",
    "History",
    "Russia",
    "Nonfiction"
  ],
  "author": "Christopher McIntosh",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/60560723-occult-russia"
}