{
  "title": "The Next Great Awakening",
  "description": "Ever since their parents’ disappearance, Gloria and Ignis have been living a quiet life with their father’s sister, Aunt Dottie. But as Gloria approaches her fifteen birthday, their quiet life is about to change. Gloria awakens from a nightmare of monsters, magic, and mayhem to find that the dreams are a premonition of what horror is to come.With their Aunt Dottie missing, their father’s younger brother, Dux, rescues Gloria and Ignis from death at the hands of a Fallen, a nearly indestructible race of monsters created by the great Lord of the Furnace, Lord Fornacem. Uncle Dux explains that Lord Fornacem has kidnapped their parents and is looking to capture the siblings, with uncertain motives and unknown intentions. Burning with questions of where their parents have gone, the siblings begin their journey through mystic lands and dangerous adventures, learning about the ancient powers of their ancestors. They travel to the Realm of Magic to rescue their parents and learn more about their past. Their first stop is the Fall Tree, where the tree spirit, Arbor, assists them in unleashing their unfathomable powers. The children must leave the safety of the Fall Tree with Uncle Dux in search of their lost parents. Along the way, they befriend Njord Pacificus, a half boy, half octopus, Cecaelian sorcerer with the powers of the seas. With Njord’s strength and help from Uncle Dux’s book of spells, the siblings travel the Magical Realm, grow their powers, and meet the inhabitants of the ten mighty kingdoms. Gloria masters the mystic powers of the Golden Ice to oppose the monstrous forces that confront her. Ignis ignites the power of the Second Sun to escape the terrible Forgotten. They plunge blindly through the chaos and mystery that is the Realm of Magic and together, they forge alliances that will aid them in times to come.On their journey, they discover how deep the roots of their family tree truly reach. They hear of a terrible curse that will soon besmirch their family. A curse of ancient origin, and devilish nature. They hear rumors of overlords, ancient powers, beings, and cataclysmic forces awakening. They see firsthand the downfall of Elementalists who have been outcast and are living in the streets. This is the next generation for the Factorems, this is the generation to change all that is broken. To untwist what is Forgotten, to reignite an old flame that has long lost its light. What powers shall awaken to oppose them, and why now? Gloria and Ignis join with their friends and work with their enemies, to change the future of their kind and save the Realm of Magic from cataclysmic downfall. This is it, The Next Great Awakening.",
  "genres": [],
  "author": "L Wolfram",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/60587767-the-next-great-awakening"
}