{
  "title": "Between Hello and Goodbye",
  "description": "She’s a city girl in Seattle. He’s a firefighter in a rainforest. This is never going to work… Faith Benson isn’t your emergency contact, she’s the party-girl friend you call for a good time. The gal-pal who loves mimosas at brunch and martinis at Happy Hour. But her carefree lifestyle threatens her job at a top Seattle ad agency. There’s no one better at landing big accounts (when she shows up) but her boss demands she take a leave of absence to get her head on straight.  Faith heads to the remote Hawaiian island of Kauai, far away from the vices that get her in trouble. But a twisted ankle on Day One requires rescuing by a man who is vice personified—a gorgeous firefighter who awakens feelings in her heart she never knew existed.  Asher Mackey doesn’t get involved with beautiful tourists beyond taking them to bed and then watching them leave his tiny island. He’s devoted his life to the safety and care of everyone around him…except himself. Until he meets Faith Benson, the city girl whose vibrant, inner beauty shines a light on the dark corners of his life, showing him how safe—but empty—it truly is.  Despite their best efforts to keep their distance, Faith and Asher fall hard and fast, but there’s an ocean between them. Both are building their lives on opposite sides of the Pacific while their feelings for each other grow more profound and undeniable by the day.  Something has to give.  When Asher receives devastating news, he and Faith have to decide once and for all to entrust their hearts fully to the other or return to their safe—but separate—worlds. Because neither can endure much longer, living somewhere between hello and goodbye.Between Hello and Goodbye is a contemporary romance about love, loss, and experiencing life in all its facets. It deals with sensitive topics that may be triggering for some readers.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Friends To Lovers",
    "Firefighters",
    "Slow Burn",
    "Fiction"
  ],
  "author": "Emma   Scott",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/60588266-between-hello-and-goodbye"
}