{
  "title": "Unbroken",
  "description": "All three of Maya Banks’s sexy novellas combined into one volume!UnderstoodJake Turner committed the ultimate mistake of falling in love with his best friend’s wife. The distance he puts between them costs both him and Ellie Matthews dearly. Jake will never forgive himself for not seeing what a bastard his friend was. Now that Ellie is free from her nightmare, Jake waits, needing and wanting. He’ll be there when Ellie is ready to spread her wings.OverheardGracie Evans is a woman tired of the men in her life not satisfying her in bed. She’s had a string of boyfriends, but none of them have come close to satisfying the vivid fantasies she has. Two weeks before Valentine’s Day, she breaks up with her latest boyfriend after a night of lackluster sex.When her best friend, Luke Forsythe, overhears her talking to their friend Michelle about what she really wants, he’s stunned. And very turned on. Gracie thinks there isn’t a man alive who can satisfy her in bed. Luke aims to prove her wrong.UndeniedWes Hoffman has a good life and good friends and firmly entrenched in his comfort zone. Until a blast from the past tilts his universe and gives him a healthy dose of something he isn’t used to experiencing. Insecurity.Payton Ricci is surprised but not the least bit unhappy when she spies Wes Hoffman across the bar at a bachelorette party. He was her first many years before but the two have very different recollections of the act.When Wes dodges Payton like a man with the hounds of hell at his heels, Payton realizes it’s going to take a whole lot more effort on her part to make him see the light. Better yet, see her. As a grown woman and not the teenage virgin he once made love to.",
  "genres": [
    "Erotica",
    "Romance",
    "Contemporary Romance",
    "Erotic Romance",
    "Anthologies",
    "Menage",
    "Contemporary"
  ],
  "author": "Maya Banks",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/6058249-unbroken"
}