{
  "title": "The Truth about Wuhan: How I Uncovered the Biggest Lie in History",
  "description": "Shocking new insider information that shows what really happened in Wuhan, China, at the start of the COVID-19 outbreak and in the ensuing cover-up. The day that Dr. Andrew G. Huff left his senior scientist and vice president role at EcoHealth Alliance was one of the happiest days of his life due to the corruption he had witnessed at the organization. However, he never thought working there would be of any great consequence to the future. He was wrong. Because, as an EcoHealth Alliance insider, Dr. Huff had had a ringside seat to one of the biggest cover-ups in history.  The Truth about Wuhan contains new research and a breakdown of how and why the development of COVID-19 in the United States and China was supported by the US government to collect intelligence on laboratories in China. Dr. Huff, an expert in the fields of bioterrorism and bio warfare, is a whistleblower who will show why the reasons the lab leak was covered up are incorrect. He worked on the classified research side of the program as a US government scientist. He knows the real how and why COVID-19 emerged. Besides exposing the conspiracy and cover-up, Dr. Huff also puts forth policy solutions and recommendations to prevent a lab leak virus from plaguing the world again. The Truth about Wuhan simply explains the complexity of the system that led to COVID-19’s emergence; how the medical industrial complex grew and became entrenched in gain of function work after 9/11; why EcoHealth Alliance was the (almost) perfect intelligence collection cover; the policy actions and decision-making process as to why the United States government engaged in the COVID cover-up; how and why the United States swapped biotechnology with China and biomedical corporations; and the incentives for each of the actors or governments to engage and coordinate a global cover-up of COVID-19 origins. The Truth about Wuhan also shows how and why Dr. Anthony Fauci is intricately involved in the COVID cover-up; how scientists like EcoHealth Alliance president and CEO Dr. Peter Daszak rose to power and used their influence to corrupt science and the COVID origin investigation; and how the intelligence community likely orchestrated the cover-up with Dr. Anthony Fauci. Dr. Huff also provides personal harrowing accounts of how the US government waged a psychological operation against him to prevent him from speaking out. COVID-19 is the biggest lie, scandal, and intelligence failure in US history, and Dr. Andrew G. Huff is stepping out of the shadows to share his insider story about this failure that led to millions of deaths around the world.",
  "genres": [
    "History",
    "Nonfiction",
    "Health",
    "Science",
    "China",
    "Politics"
  ],
  "author": "Andrew G. Huff",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/60585293-the-truth-about-wuhan"
}