{
  "title": "Heartbreak Hero",
  "description": "My name is Sue O’Malley, and I’ve been keeping it awkward since 1996.Another thing about me? I think I’m in love with my bodyguard.Leo Mason is all I’ve been able to think about since he broke my heart and left me standing alone on my front porch six months ago.But now he’s back. He says someone is after us and insists we hide in his remote cabin until the threat is neutralized. It’ll be just the two of us with one bed, along with all his muscles, tats, and those fecking smoldering glances that burn up my skin.I trust him to keep me safe from danger, but can I trust him to protect my heart too?***My name is Leo Mason. As a bodyguard with Redleg Security and a former Army Ranger, I’ve got lots of secrets and even more enemies.Six months ago, I did the unthinkable when I fell for a woman I was protecting.She’s too young for me — too innocent — and being with me comes at a cost. One I didn’t want her to be forced to pay.So I did the best thing I could do to save her — I left.But now there’s a new danger threatening her, and I’ll stop at nothing to protect Sue… my angel.I broke her heart before, but this time things will be different. This time, I’ll be her hero.*****Heartbreak Hero is a stand-alone, slow burn, romantic suspense novel with some romcom vibes, plot twists, steamy times, foul language, and page-turning action. This novel features a plus-sized, neurodivergent heroine and a protective hero who helps her see her quirks as strengths. There is a happily ever after and no cheating.Tropes: Second chance, age-gap, and forced proximity.Author's Note: Since this is a action-packed, suspenseful, bodyguard novel, it features some content that sensitive readers may like to know about before reading. More detail about these topics are available on my author website to keep this description spoiler-free.",
  "genres": [
    "Romance",
    "Second Chance",
    "Forced Proximity",
    "Contemporary",
    "Romantic Suspense",
    "Military Fiction",
    "Contemporary Romance"
  ],
  "author": "Jackie  Walker",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/60577801-heartbreak-hero"
}