{
  "title": "A Strange Habit of Mind",
  "description": "USA Today bestseller English professor and ex-spy Cameron Winter confronts a Big Tech billionaire to solve the suspicious suicide of a former student The world of Big Tech is full of eccentric characters, but shamanic billionaire Gerald Byrne may be the strangest of the bunch. The founder of Byrner, a global social media platform, Byrne is known for speaking with vague profundity and for dabbling in esoteric spiritual practices; he wears his hair in a long black ponytail to reveal a large flower tattooed on his neck; he’s universally admired as a visionary, a philanthropist, and a devoted husband and father. And every person who gets in the way of his good work seems to die. When a former student commits suicide, English professor and ex-spy Cameron Winter takes it upon himself to understand why. The young man was expelled from the university in an unfortunate episode that left Winter sympathetic to his plight; after a prolonged silence, he reached out to his teacher with two words just before taking the fatal plunge from the roof of his San Francisco apartment: “Help me.” Winter has what he calls “a strange habit of mind”―the ability to imagine himself into a crime scene, to reconstruct it mentally and play through various possible causes and outcomes to understand exactly what took place. When he applies this exercise to Adam Kemp’s desperate final moments, he discovers a troubling inconsistency. And when he learns that Kemp was in a tumultuous relationship with Gerald Byrne’s niece, he begins to suspect that the suicide was the result of a carefully-engineered plot, put in motion by the powerful businessman.  Featuring the tough-but-learned protagonist from 2021’s When Christmas Comes , A Strange Habit of Mind is a thrilling mystery set in the cutthroat world of tech money and tech influence, where unchecked fortunes produce unstoppable power for a lawless few.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Audiobook",
    "Crime",
    "Action"
  ],
  "author": "Andrew Klavan",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/60572705-a-strange-habit-of-mind"
}