{
  "title": "The Long Road Back: A Survivor's Guide to Anorexia",
  "description": "\"Today, I see the link between my feelings of craziness and loss of control over my own life and my need to place rigid restraints on my weight and eating. \"When other areas of my life felt out of control, there was always one thing I knew I could control. My weight and eating became the focus of my life, and all of my other troubles were forgotten -- at least temporarily.\" From The Long Road Back: A Survivor's Guide to Anorexia Each year, in the United States alone, thousands die of the eating disorder anorexia nervosa, which carries the highest mortality rate of any psychiatric disorder. To make matters worse, it is some of our brightest and best young people (more than 90 percent of them females) whose lives are lost to this insidious illness. Anorexia is characterized by a refusal to maintain a minimally normal body weight. The individual suffering from it is intensely afraid of gaining weight, and has a distorted perception of the size and shape of his or her body. Unless there is successful intervention and treatment, the anorexic may die of starvation, suicide, or electrolyte imbalance. In THE LONG ROAD BACK, Judy Sargent tells the story of her ten-year struggle with anorexia, which began to manifest when she was thirteen. As it progressed, the disease repeatedly brought her weight to life-threatening lows of less than seventy pounds. Now completely recovered, and pursuing a career as a clinical nurse specialist, Sargent details in this book her return to health and a normal life. She writes with an honesty, humor, and insight that make her fascinating and harrowing story all the more absorbing. Young people afflicted with eating disorders (and those who love them) will find hope, inspiration, and valid advice in these pages.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Judy Tam Sargent",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/6057.The_Long_Road_Back"
}