{
  "title": "هذه هي أمريكا",
  "description": "يقدم الكتاب يوميات الطالب علاء مصباح في الولايات المتحدة الأمريكية طيلة أربعة أشهر هي مدة برنامج التبادل الطلابي الذي اشترك به عام 2008 م , تكمن قيمة الكتاب المعلوماتية في كون كاتبه يزور الولايات المتحدة بعد أحداث 11 سبتمبر 2001 م مما يتيح له تقديم معلومات حديثة نسبياً عن المجتمع الأمريكي تكاد تتوغل في ثناياه وتلامس أفكار رجل الشارع هناك , يتميز المؤلف بكونه يعمل مراسلاً صحفياً لموقع \" بص وطل \" على شبكة الإنترنت مما يجعله معتاداً على إستخدام أساليب اللغة بشكل ممتاز وهذا ما يظهر في تطويعه الكامل لأدوات التعبير في كتابه , يتكون الكتاب من عشرة فصول وخاتمة , تتنوع مواضيع الفصول منذ بداية الوصول الى الولايات المتحدة وحتى لحظة مغادرتها , يقدم الكاتب فيها كماً هائلاً من المعلومات بطريقة أدبية سلسة وسهلة ومبسطة , كما يصحبك الكاتب في عدة مدن أمريكية شهيرة كنيويورك وواشنطن وبوسطن ونيو جيرسي ليرصد عبر يومياته نظرته كشخص مصري إلى أعظم قوة في العالم , يحسب للكتاب أنه قدم أحداثاً قد تهم القارئ بشكل كبير كمشاركة المؤلف في تظاهرة ضخمة أمام البيت الأبيض ضد سياسات الرئيس الأمريكي جورج بوش في الذكرى الخامسة لغزو العراق , كذلك قيام المؤلف بزيارة نقطة الصفر أو مكان برجي مركز التجارة العالمي سابقاً ورصده لأحاسيس ومشاعر الشعب الأمريكي بعد انهيار البرجين , وزيارته مقر الأمم المتحدة الشهير في نيويورك وتجوله في قاعاته المتعددة وحضوره المحاضرت المخصصة لطلاب التبادل الطلابي به , كل هذا يقدمه المؤلف بأسلوب روائي جذاب لا تتوقع منه أنه الكتاب الأول لمؤلفه الشاب . يؤخذ فقط على كاتبه تطويله لبعض الفصول وإستغراقه في تفاصيلها بما لا يتناسب مع أهميتها لدى القارئ .لكن في النهاية يجب علينا أن نشير إلى أن المؤلف يحظى بقلم راقي يحسن إستغلال الحروف ليشكلها كلمات أدبية تجيد التعبير عما يريد بطريقة سهلة ومبسطة , ولهذا لم يكن من الغريب أن نرى مقدمة الكتاب بقلم الدكتور أحمد خالد توفيق الأديب المعروف ورائد أدب الرعب في العالم العربي . كتاب \" هذه هي أمريكا \" لمؤلفه الشاب علاء مصباح كتاب ننصحك بقرائته إن كنت من المهتمين بالشأن الأمريكي حيث سيقدم لك وجبة أدبية دسمة تمكنك من التعرف على المجتمع الأمريكي عن قرب وبطريقة شيقة",
  "genres": [],
  "author": "علاء مصباح",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/6057854"
}