{
  "title": "Flowers of Fire: The Inside Story of South Korea's Feminist Movement and What It Means for Women's Rights Worldwide",
  "description": "An eye-opening firsthand account of the ongoing and trailblazing feminist movement in South Korea—one that the world should be watching.Since the beginning of the #MeToo movement, tens of thousands of people in South Korea have taken to the street, and many more brave individuals took a stand, to end a decades-long abortion ban and bring down powerful men accused of sexual misconduct—including a popular presidential contender. South Korean feminists know that the revolution has been a long time coming, between battles against its own patriarchal society as well as challenging stereotypes of docile Asian women in the Western imagination.Now, author Hawon Jung will show the rest of the world that these women are no delicate flowers—they are trailblazing flames. Flowers of Fire takes the reader into the trenches of this fight for equality, following along as South Korean activists march on the streets, navigate public and private spaces where spycam porn crimes are rampant, and share tips and tricks with each other as they learn how to protect themselves from harassment and how to push authorities to act.Jung, the former Seoul correspondent for the AFP, draws on her on-the-ground reporting and interviews with many women who became activists and leaders, from the elite prosecutor who ignited the country’s #MeToo movement to the young women who led the war against non-consensual photography. Their stories, though long overlooked in the West, mirror realities that women across the world are all too familiar with: threats of defamation lawsuits to silence victims of assault, tech-based sexual abuse, and criminal justice systems where victims’ voices are often met with suspicion and abusers’ downfalls are met with sympathy. These are the issues at the heart of their #MeToo movement, and South Korean women have fought against them vigorously—and with extraordinary success. In Flowers of Fire, Jung illuminates the strength and tenacity of these women, too often sidelined in global conversations about feminism and gender equality.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "History",
    "Politics",
    "Asia",
    "Womens",
    "Audiobook"
  ],
  "author": "Hawon Jung",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/60588930-flowers-of-fire"
}