{
  "title": "Wretched",
  "description": "From international bestselling author, Emily McIntire, comes a dark and delicious fractured fairy tale reimagining of The Wizard of Oz.   A woman can be great, and terrible too. Evelina Westerly has always been the bad guy. As the brains, brawn, and botanist behind her family's drug empire, she's her father's ruthless secret weapon. With her days divided between perfecting her greenhouse, seeking revenge for her sister's murder, and putting a gun to the head of anyone in her way, Evelina doesn't have time for anything else. Especially not for love. After a one-night stand with a gorgeous man at a nightclub, she's sated her urges and is back to her criminal ways. That is, until that same man shows up as the new Westerly lackey...under a totally different name.But Nicholas Woodsworth's real secret is much more dangerous than an alias. He's an undercover DEA agent, and he's hell-bent on destroying the drug trade that devastated his family. When he realizes the youngest daughter of the Westerly empire is the same woman he's been fantasizing about since that night at the club, attraction wars violently with disgust. Evelina embodies everything he's against, and he's been sent here to be her downfall. Yet the more they learn about the darkness in each other's hearts, the more alike they seem, and when hatred turns to something more, Nicholas will have to decide whether he can love a wretched woman, even if it means bringing both of their lives to ruin. Wretched is a dark, contemporary romance and the third complete standalone in The Never After Series: A collection of fractured fairy tales inspired by our favorite villains. It is not fantasy and it is not a retelling. Reader discretion is advised. For all content warnings check the author's website.",
  "genres": [
    "Dark Romance",
    "Romance",
    "Fantasy",
    "Enemies To Lovers",
    "Dark",
    "Audiobook",
    "Retellings"
  ],
  "author": "Emily McIntire",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/60601111-wretched"
}