{
  "title": "Smashin' Candy",
  "description": "So bloody sweet, I’ll give you tooth decay.Call off the search party, here I am. Candy Crystal is back for another round with my Gambler’s Monarchs. And don’t be mistaken, they are mine. All mine. So much has changed, except for me obviously. I’m as perfect as Angus’ advice on a dismal day. With the Monarchs fractured and Malik suffering from an identity crisis, I need to use my best moves to bring the whole gang home. My best moves being reverse cowgirl, the upside down corkscrew and the underestimated cupid’s arrow. Armed with my magical pu$$y and a newfound sense of purpose, I’ll lure them all back to the Devil’s Bedpost where we belong. Together.Unfortunately, my appeal doesn’t stretch as far as the stray who has latched onto one of my men. A charming, cunning killer to be exact. It’s obvious this house isn’t big enough for the two of us. I’m a b!tch who knows her way around a bone so this slutty snake had better watch her back. Did I mention she’s also trying to kill me? Well, not if Angus and I get to her first. The Monarchs may be blind but I know an assassin when I see one. Some say I’m delusional, others use the term disturbingly obsessive. I prefer protective, and now the Candy Crusher isn’t my sole possession anymore. The claws are out, the game is on. Marco Polo Motherf*cker$.Trigger Warning: This is book two of the I Love Candy series, featuring a feisty female lead. Candy is spontaneous, impulsive and reckless, which makes this book inappropriate for under 18’s. She gives as good as she gets, causing chaos and leaves you wondering who is bullying who! Expect excessive amounts of steam, violence and cursing throughout. This series is a RH trilogy with a HEA…eventually.",
  "genres": [
    "Reverse Harem",
    "Enemies To Lovers",
    "Dark",
    "Dark Romance",
    "Threesome",
    "Contemporary",
    "Second Chance"
  ],
  "author": "Maddison Cole",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/60596443-smashin-candy"
}