{
  "title": "An Empress of Fire & Steel",
  "description": "Under the light of the approaching Cold Moon, Emara Clearwater's ascension as the Empress of House Air must take place quickly to secure her crown and title. With the covens under attack, she has no choice but to immediately adjust to the world of elemental magic and its hierarchy. However, after the events of the Uplift, questions of Emara's dominant element loom heavily in the air, and fears of her House rejecting her start to arise. But maybe that's not all she should question, as her family's dark past continues to claw its way to the surface. Torin Blacksteel quickly finds himself fortunate to be selected as one of the guards appointed to protect the Empress of Air. As the second-in-command of his clan, Torin makes it known to all that he will protect Emara with his life. Will he be able to uncover who is responsible for the attacks on the witches before they strike again, or will he be too distracted by his growing feelings for Emara? Breighly Baxgroll, daughter of the Alpha , leader of the Shifter faction , finds herself tied up with the hunters once more. This time, it is not the Blacksteels who are taking up her time, but another warrior, inked from head to toe. The relationship is forbidden, but will she disobey her Alpha? Gideon Blacksteel has been appointed to protect the Empress of House Earth, but he still finds himself sore around the heart as he watches his brother get closer to Emara. She's promised to Torin in an alliance between clan and coven, but will that stop Gideon from fighting for her? Or will fate find him a new path entirely? Darkness and desire go hand in hand as the Winter Solstice Ball comes into focus. As Emara indulges her most intimate wants and needs, will she be able to let her heart burn for only one Blacksteel brother, or does the candle of her past love still flicker? Or maybe the decision will be taken out of her hands altogether.",
  "genres": [
    "Fantasy"
  ],
  "author": "Noelle Rayne",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/60591877-an-empress-of-fire-steel"
}