{
  "title": "Make Every Move a Meditation: Mindful Movement for Mental Health, Well-Being, and Insight",
  "description": "“Let me say it simply. Someone should have written this book a long time ago.” — Shinzen Young , meditation teacher, neuroscience research consultant, founder of Unified Mindfulness, author of  Meditation in the Zone and  The Science of EnlightenmentAward-winning Finalist in the “ Diet & Exercise” category of the 2022 International Book Awards #1 New Release in Sports Health & Safety, Other Eastern Religions & Sacred Texts, Cycling, Sports Psychology, Walking, Theravada Buddhism, and Meditation Transform movement and meditation into the powerful practice of mindful movement Exercise can be meditation. What do you think of when you hear the word meditation? A quiet room filled with monks? An Instagram influencer? What about moving meditation? Yoga? Tai Chi?For too long, meditation in books has focused on specific periods of meditation, rather than mediation through fitness or daily activities. What if lifting weights, dancing with your love, or walking across a room counted? What if you could use exercise as meditation? What if you could make every move a meditation? Let's combine the two.  In Make Every Move a Meditation, award-winning author, meditation leader, and mental health advocate Nita Sweeney shows us fitness can be mindfulness. She teaches us how to bring meditation and mindfulness into any activity by incorporating centuries-old techniques.Studies show that both exercise and meditation reduce anxiety, stabilize blood pressure, improve mood and cognition, and lead to a deeper self-relationship and wisdom. Movement is medicine, and meditation is medicine. Inside you'll learn to:* Turn exercise into a meditation tool* Make any activity a mindful practice* Enjoy the benefits of meditation while getting fitIf you like meditation books and best sellers such as Think Like a Monk, Practicing Mindfulness, or Breath, you’ll love Make Every Move a Meditation.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Health",
    "Audiobook"
  ],
  "author": "Nita Sweeney",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/60589539-make-every-move-a-meditation"
}