{
  "title": "The Beta and His Bully: Claiming Your Crush",
  "description": "You love her, but he's going to have her, and there's nothing a beta like you can do about it.Except maybe watch.But your bully has plans for you too.Jared was your friend once, but he's bullied you for years. Now he's going to claim the sweet, innocent girl you've always adored; Charlotte won't be able to resist his considerable charms – he's the alpha she's secretly craved.But your cravings are only going to get worse. Once your tiny beta bits are safely locked in chastity, you'll be the cuckold to the bully you hate and the woman you love.And then your transformation can really begin.This 17,500 word first-person maledom and femdom story is the beginning of a six-book series by best-selling author, James Hardcourt, under his alternate pen name for his edgier stories.It explores a beta male, discovering his place, and despite all the turmoil and torment, learning to love it. The series includes cuckolding, tease and denial, chastity, SPH, voyeurism and more. And that's just the first book! Later on expect BDSM, cuckqueaning, gender exploration, femboy love and a whole mix of MF, MFM, and first time M/m action.Some praise for his other \nThe One-Bar \n★★★★★ - First of a series delivers!\"The male Dom of the story professes that the mind is the most important sexual organ. The author infuses that belief throughout this highly erotic story, bringing taboo fantasies between two consenting adults to full bloom. It was a thrill to see Natalie reveling in her sexual freedom, ironically entrapped by her own hand..\"\nTease for \n★★★★★ - FINALLY! Accurately Integrated Kinky Erotica\"The second installment in the Kink by the Numbers series continues the stereotype blasting tour-de-force that is Author James Hardcourt! Whether you are a new explorer to the kink world or a frequent flyer, you will be pleased, I certainly am!\"\nFriends with Kinky \n★★★★★ - Hot AND Empowering!\"What makes James Hardcourt's books the best kink stories on the market? Hot fantasies mixed with characters that are actually relatable! Not to mention they're educational without being dry and detracting from the sexy fantasy. As someone who's always identified as submissive this book was also really empowering and helpful for building up more confidence to take charge some of the time in the bedroom, which my husband loves. I desperately want to see where this exploration takes Amy and Dylan, and hopefully see them switch roles interchangeably!\"",
  "genres": [
    "Erotica"
  ],
  "author": "J.S. Hardcourt",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/60628149-the-beta-and-his-bully"
}