{
  "title": "The Forerunner: A Story of Pain and Perseverance in America",
  "description": "From one of America's most transformative politicians and activists, a powerful and inspiring memoir that sheds light on a harrowing personal journey and reveals how urgently we need our political leadership to prioritize meeting the needs of our most marginalized communities.\"Piercing and gripping... Bush’s words are beautifully devastating.\" — The CutHaving worked as a nurse, a pastor, and a community organizer in St. Louis, Missouri, Cori Bush hadn’t initially intended to run for political office. But when protests in Ferguson erupted in 2014, Bush found herself on the frontlines, providing medical care and protesting violence against Black lives. Encouraged by community leaders to run for office, and compelled by an urgency to prevent her children and others from becoming social media hashtags, Bush campaigned persistently while navigating myriad personal challenges—and ultimately rose to unseat a twenty-year incumbent to become the first Black woman to represent her state in Congress.The Forerunner is the raw and moving account of a politician and activist whose life experiences, though underrepresented in the halls of Congress, reflect some of the same realities and struggles that many Americans face in their everyday lives. Courageously laying bare her experience as a minimum-wage worker, a survivor of domestic and sexual violence, and an unhoused parent, Congresswoman Bush embodies a new chapter in progressive politics that prioritizes the lives and stories of those most politically vulnerable at the core of its agenda. A testament to the lasting legacy of the Ferguson Uprising and an unflinching examination of how the American political system is so deeply intertwined with systemic injustice, The Forerunner is profoundly relatable and inspiring at its heart. At once a stirring and emotionally wrought personal account and a fierce call to action, this is political memoir the likes of which we’ve never seen before.",
  "genres": [
    "Memoir",
    "Politics",
    "Audiobook",
    "Nonfiction",
    "Biography Memoir",
    "Biography",
    "Autobiography"
  ],
  "author": "Cori Bush",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/60621101-the-forerunner"
}