{
  "title": "The 27s: The Greatest Myth of Rock & Roll",
  "description": "Excess and tragedy are the stuff of music legend, but it is only with hindsight that deeper patterns emerge. None of these is more striking than the deaths at age 27 of some of the greatest musicians of our time.Jimi Hendrix. Janis Joplin. Jim Morrison. Brian Jones. Kurt Cobain. Founding bluesman Robert Johnson. All died at 27. Their stories, as well as those of ill-fated members of the Grateful Dead, The Stooges, Badfinger, Big Star, Minutemen, Echo & the Bunnymen, and The Mars Volta, are here presented for the first time as a profound and interlocking web that reaches beyond coincidence to the roots of artistic causality and fate.The 27s is the first comprehensive account of the lives and legacies of the thirty-four musicians who make up (to date) rock’s most notorious myth. It is also a capsule history of rock & roll, twisting and turning through decades and genres, unfurling layers of numerology, philosophy, and astrology along the way. The text is complemented by compelling and multifaceted artwork that brings a nonlinear graphic-novel edge to this major contribution to the study of rock culture.The 27s also include crooner Jesse Belvin (\"Earth Angel,\" \"Goodnight My Love\"), Rudy Lewis of the Drifters, Brian Jones of the Rolling Stones, Malcolm Hale of Spanky And Our Gang, Alan Wilson from Canned Heat, Arlester Christian of Dyke And the Blazers, Jim Morrison, Ron \"Pigpen\" McKernan of the Grateful Dead, Pete Ham of Badfinger, Gary Thain of Uriah Heep and Keef Hartley Band, Roger Lee Durham of Bloodstone, Helmut Köllen of Triumvirat, Chris Bell of Big Star, D. Boon of Minutemen, Pete de Freitas of Echo & the Bunnymen, Mia Zapata of the Gits, Kurt Cobain of Nirvana, Kristin Pfaff of Hole, Raymond \"Freaky Tah\" Rogers of Lost Boyz, Sean McCabe of Ink & Dagger, Jeremy Michael Ward of De Facto and The Mars Volta, Bryan Ottoson of American Head Charge, and Valentin Elizalde.",
  "genres": [
    "Music",
    "Nonfiction",
    "History"
  ],
  "author": "Eric Segalstad",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/6062384-the-27s"
}