{
  "title": "Spiritual, but not Religious: Understanding Unchurched America",
  "description": "Nearly 40% of all Americans have no connection with organized religion. Yet many of these people, even though they might never step inside a house of worship, live profoundly spiritual lives. But what is the nature and value of unchurched spirituality in America? Is it a recent phenomenon, a New Age fad that will soon fade, or a long-standing and essential aspect of the American experience?  In Spiritual But Not Religious, Robert Fuller offers fascinating answers to these questions. He shows that alternative spiritual practices have a long and rich history in America, dating back to the colonial period, when church membership rarely exceeded 17% and interest in astrology, numerology, magic, and witchcraft ran high. Fuller traces such unchurched traditions into the mid-nineteenth century, when Americans responded enthusiastically to new philosophies such as Swedenborgianism, Transcendentalism, and mesmerism, right up to the current interest in meditation, channeling, divination, and a host of other unconventional spiritual practices. Throughout, Fuller argues that far from the flighty and narcissistic dilettantes they are often made out to be, unchurched spiritual seekers embrace a mature and dynamic set of basic beliefs. They focus on inner sources of spirituality and on this world rather than the afterlife; they believe in the accessibility of God and in the mind's untapped powers; they see a fundamental unity between science and religion and an equality between genders and races; and they are more willing to test their beliefs and change them when they prove untenable.  Timely, sweeping in its scope, and informed by a clear historical understanding, Spiritual But Not Religious offers fresh perspective on the growing numbers of Americans who find their spirituality outside the church.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Philosophy",
    "Theology",
    "Spirituality",
    "Witchcraft"
  ],
  "author": "Robert C. Fuller",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/606124.Spiritual_but_not_Religious"
}