{
  "title": "We're Three: A Story About Families and The Only Child",
  "description": "AWARDS: 2010-2012 and 2017-2022, BOOK OF THE YEAR, 2013-2016 PREFERRED CHOICE AWARD AND THE 2009 SEAL OF EXCELLENCE FOR CHILDREN'S INTERACTIVE BOOKS AWARDED BY CREATIVE CHILD MAGAZINE.Not since the Three Bears has there been a children's story about the family of three or the only child. This book captures the spirit and love of the family of three and invites other family numbers to participate. The book is interactive and asks children to draw pictures representing their own family unit. This makes the book more than just a story book but a pictorial journal of the child's personal family experience.Inspired by her own family of three, Vivian Cameron-Gallo sets out to take the \"only child\" out of the isolation that generalizes and labels the only child. The single child does not stand alone but stands as an important part of a larger unit, a family. This \"interactive\" story is about families and the things they do together. The author hopes that the reader will follow along and draw pictures about their family on the blank pages designed for this purpose. The illustrations by Christina Simcic have captured the love of many different families. This book is made from the heart for all the young hearts beating to become our future. \"We're Three\" let's you know that your place in the world is specialREVIEWSRating: Five Stars: \"There are all kinds of families in this great big world. Some are big with lots of kids... and some are small, with not too many or simply none at all.\" Did you know that the single-child family is the fastest growing type of American family? Yet, when author Vivian Cameron-Gallo, the mother of an \"only child,\" sought a children's book that represented her daughter Ava, she found only a few and those had a melancholy tone with negative stereotypes. Therefore, inspired by her own family of three, she wrote this endearing little book to make the single child feel \"normal\" and part of something bigger - a family. The gentle, flowing verse makes for easy reading, and the colorful drawings by Christina Simcic add visual beauty to the text. I think that We're Three is a very beneficial and useful book, and it has my hearty endorsement.Wayne WalkerSTORIES FOR CHILDREN MAGAZINERating: Five Stars: \"We're Three\" is a beautifully written and illustrated book. I truly enjoyed reading it to my son and sharing the message of how special a family of three is. He especially loved the interactive aspect of the book and drew his own interpretation of our unique family of three. The playful words and colorful illustrations made it fun to turn every page. I loved every \"bit\" of itChristine Pitaccio, Peekskill, NY FOR: THE ONLY CHILD PROJECTRating: Five Stars: What a lovely story regarding a family structure that revolves around the only child. In these current times when only children are becoming the norm, it is nice to see that someone has identified with this growing family structure in a positive way. Kudos to the author and to the illustrator on such beautiful illustrations. I look forward to more work from this dynamic duoAnthony FOR: WE READ",
  "genres": [],
  "author": "Vivian Cameron-Gallo",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/6062201-we-re-three"
}