{
  "title": "Firestorm: A Collection of Sci Fi Stories",
  "description": "If you obsess over FLOWERS FOR ALGERNON, you will love the twenty-three sci fi stories in this collection. Each tale examines some aspect of the human condition, sometimes dark and dystopian, sometimes optimistic, but always thought-provoking.If you enjoy time travel, try “Neverland through the Looking Glass,” “The Self-Murder Solution,” or “One Million Years in a Day.”“The Self-Murder Solution” describes a suicide crisis a few hundred years in the future from the point of view of a contemporary woman who tries to kill herself.In “One Million Years in a Day,” an up-close survey of the supermassive black hole at the center of our Milky Way Galaxy goes awry when a pilot erroneously crosses the event horizon.In “Neverland through the Looking Glass,” just about everything that can go wrong does, and the culpable scientific and military people try to undo the damage within a narrow window of opportunity.The stories featuring trans characters are: “Informed Consent,” “Yes, Dear, Breast Cancer can Kill a Trans Woman,” and “The Gender Blender.” The author is a male-to-female transsexual, and these stories are drawn from her experience as an early transitioned (1974) trans woman.Dystopian stories include “Ride the Snake,” “Maiden Voyage of the Fearless,” and “The Black Hole: A Tale for Men and Women Who Aren’t Trying to Kill Feminism.” “Ride the Snake” describes a “golden” future that is a little bit more than tarnished. “The Maiden Voyage” focuses on a miracle cure for anxieties of all kinds. “Black Hole,” is about the status of women in this world and our future world.“The Cold Waters of Europa” (a recreational diving expedition goes wrong with the help of eco-terrorists), “Helping Hand” (a stranded astronaut proves that she is seriously tough), or “Raptures of the Deep” (what could possibly turn sideways when exploring the Mariana Trench?) are hard sci fi.If you want a little humor, there are “Growing Up Human” (cybernetic creatures try to be like people), “The Mimic” (one character accuses the other of being an alien and vice versa), or “Aliens Anonymous” (a quasi-twelve-step program for alien abductees). “Electro Genesis” is about a woman who survives an electric jolt to the brain. And in “Center of the Universe,” astronomers begin to worry when all the stars except Sol appear to be growing dimmer.In “The Predator Trap,” a quirky entomology student solves a missing-person mystery and discovers a new species. “Crime Warp” mixes science fiction and fantasy when a junior professor discovers that worldwide crime rates are falling. “Death After Dying” takes a look at the possibility of post-mortem brain waves and quasi-life-after-death experiences. And “The Final Launch” centers on an Air Force Colonel who will stop at nothing to launch her missile. “The Conservationist Hunter,” is an adult fairy tale about big-game hunting on a lush alien planet.",
  "genres": [],
  "author": "Claudine Griggs",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/60629732-firestorm"
}