{
  "title": "The Claw and the Crowned",
  "description": "Freedom is her desire. Vengeance is his price.Slip into this scintillating tale of a young royal whose loyalty is torn between the prince she was sold to and the tempestuous knight determined to ruin her.Imryll is unfit to be a princess. Everyone has always told her so. So when the king stuns everyone by crowning her the prince’s consort, her life is completely upended, crushing any lingering dreams of a future away from the suffocating Rhiagain court.Still reeling from the news, she meets Drazhan, the formidable, mercurial knight who wins the right to be her personal guard. But when he defiantly refuses any show of respect, a dangerous spark ignites between them, one she doesn’t know how to extinguish. Worse, she’s not sure she wants to.The dark knight’s licentious midnight whispers linger over her, commands she feels inexplicably called to obey. His dangerous promises spread their tendrils over her desperate, failed attempts to embrace life with the prince, her childhood best friend. They take her apart and put her back together, piece by agonizing piece.Yet she can’t shake the sense Drazhan is hiding something important. He refuses to explain why he surrendered a life of privilege to become her guard. The roaring vengeance burning in his heart, scorching him from the inside out, is a painful mystery Imryll can’t solve.But she will.Because Drazhan’s revenge doesn’t just start with Imryll.It ends with her.__The Book of All Things is a series of standalone fantasy romance tales set in the vibrant, epic world first introduced by USA Today Bestselling Author Sarah M. Cradit in the Kingdom of the White Sea trilogy.The Claw and the Crownedis the first story in the Sceptre Cycle of The Book of All Things.The Sceptre Cycle:Stolen thrones, love triangles, arranged marriages, and fractured duty from the descendants of Ilynglass (high heat)The Claw and the CrownedThe Duke and the Disciple",
  "genres": [
    "Fantasy",
    "Fantasy Romance",
    "Romance",
    "Romantasy",
    "Enemies To Lovers"
  ],
  "author": "Sarah M. Cradit",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/60626778-the-claw-and-the-crowned"
}