{
  "title": "The Coming of Áed Omnibus: The Complete Celtic Fae-Inspired Fantasy Trilogy - The Hidden King, The Last Prince and The Wild Court",
  "description": "BOOK ONE - THE HIDDEN KINGHidden truths. Hidden power. Hidden destiny.On the shores of a rusty sea, in the streets of a starving city, a young man named Áed scraps to build a life for himself and the makeshift family he loves. Scarred by a trauma he cannot remember, and haunted by the brutal damage it left behind, he has no idea of the courage his future will demand.When a heart-wrenching tragedy shatters his family, a desperate Áed risks a treacherous journey to seek a kingdom of legend—and a new beginning. But an ancient legacy smoldering within him is about to turn deadly, and neither he—nor the legends—will ever be the same.BOOK TWO - THE LAST PRINCE (an origin story)In a hellish city, the fate of a young boy rests on the very thing he fears most…Robbed of his childhood by tragedy and betrayal and forced onto the streets, only fury makes young Ninian feel whole - and in a world of gangs and fae, Ninian is more than willing to fight for his life.But it doesn’t take much to topple a life which is already balanced on the edge of a knife. And by the time a desperate Ninian realizes he’s crossed the wrong person, it is much, much too late.In his frantic struggle to right his collapsing world, Ninian’s furious, bloody efforts are dredging up history he’d rather forget - the past is tired of being held at bay, and even fighting cannot protect Ninian from himself.So when he meets a crimson-eyed stranger, a boy so broken he refuses even to speak, Ninian does not believe he has the capacity to care.He is wrong.And that will change everything…BOOK THREE - THE WILD COURTWhat perils await on the other side of the veil?In the seventh year of Áed's reign, night descends on the autumn festival. But a time of revelry turns into one of fiery destruction—as fae pour across the veil and the Gut becomes a battlefield in an otherworldly war.Determined to protect his kingdom and the people he loves, Áed finds himself catapulted into a realm as unfamiliar as it is dangerous, where magic is king and wild courts vie for supremacy.While the faerie Queen's missing consort holds the key to life and death, tenuous alliances raise questions about Áed’s connection to the mysterious Bone court. His survival hinges on cunning as much as illusion.On a mission like no other, only one thing is certain: no one will survive unscathed.",
  "genres": [],
  "author": "E.G. Radcliff",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/60629838-the-coming-of-ed-omnibus"
}