{
  "title": "Road to the Galliano Club: Prequel to the Galliano Club historical fiction series",
  "description": "Three outcasts try to outrun the past, only to end up at the Galliano Club, where trouble is always on tap.In this prequel to the exciting Prohibition-era Galliano Club historical fiction thriller series, go on the road with three unforgettable characters and experience their timeless tales of risk, determination, and danger during the Roaring Ruth Cross escapes a dead-end life in a Pennsylvania coal mining town, but scandal will chase her all the way to the tiny apartment over the Galliano Club.Luca Lombardo emigrates to America but it costs him everything. By the time he goes to work as the barman at the Galliano Club, he has nothing left to lose.Benny Rotolo rises from street thug to trusted bodyguard for Chicago’s North Side Gang but when Al Capone puts a price on his head, the Galliano Club could be his chance to get evenAre you a fan of The Godfather, Road to Perdition, The Untouchables, or Boardwalk Empire? If you love historical fiction featuring Prohibition-era stories of Chicago gangsters, Italian mobsters, and bold bootleggers, you’ll love this introduction to the Galliano Club series.\"The Galliano Club series promises to be as riveting as Amato’s previous novels set in Mexico. The Roaring Twenties in their uninhibited violence and excitement come alive . . . A sure hit with loyal fans and new readers alike.\" - Michael Hogan, author of Women of the Irish Rising“A gripping thriller series that will immerse you in the gritty, violent world of America in the 1920s. Clawing their way through the tale are a host of desperate characters that will shock and amaze you, never allowing you to catch your breath until the jaw-dropping conclusion.” - Amanda Hughes, author of The Looking Glass Goddess and The Image Seeker“Spot-on historic atmosphere as the compelling characters fight, dance, and gamble their way to the Galliano Club . . . An epic tale with all the glitz, danger and gritty charm of the era.” - L.A. Chandlar, award-winning author of the Art Deco Mystery SeriesGALLIANO CLUB SERIESROAD TO THE GALLIANO PrequelMURDER AT THE GALLIANO Book 1BLACKMAIL AT THE GALLIANO Book 2REVENGE AT THE GALLIANO Book 3",
  "genres": [],
  "author": "Carmen Amato",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/60619485-road-to-the-galliano-club"
}