{
  "title": "A Purer Evil: The Werewolf Priest",
  "description": "A Purer Evil: The Werewolf Priest is about the monster in the soul of men and the humanity in the soul of monsters. And it is about saving the souls of those nature has condemned. It is also about passions: the passions that animate us for good or evil; our passions for life, for blood, for sex. As one reader said: \"It is a werewolf tale for grown-ups.\" Arthur Lehmann, a young Episcopal priest, is the new pastor of a quiet congregation in rural Ohio. He has come there to grieve and reconstruct a life for himself after the tragic death of his pregnant wife in a car accident. He wants nothing but peace, quiet, and an undemanding routine to dull his pain. His only companion is a dog. Then one night, while walking his dog, he is attacked by a strange animal, and his peace is destroyed forever. His passions and zest for life return, but there is something horribly wrong. He is slowly changing, into what he does not know. Then, under the full moon, the change is complete. He is consumed by the primal cravings of a beast: he hungers, he Lehmann has become a monster, what people would call a werewolf. He becomes a slave to primal urges that threaten to take him over, to drag him down into a squalid world of subhuman creatures where a quick death is his most likely fate. He must fight for his mortal existence and for his eternal soul or he will lose them both. What keeps him human? Only his moral core and the love of a woman. But she too has secrets, and other temptations challenge his commitment to her.A Purer Evil: The Werewolf Priest is a dark look at the paranormal. The creatures Lehmann meets are wretched, living a squalid existence that can only end in misery and death. He tries to survive, to retain his humanity, and he fights to control these diabolical urges. But as he does, he is sucked further and further into a world he did not know existed, a netherworld of violence, primal lusts, and relentless persecution. For he is one of them, and to the world they all are monsters that must be exterminated.",
  "genres": [
    "Horror",
    "Werewolves",
    "Paranormal"
  ],
  "author": "Timothy P. Niedermann",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/12870898-a-purer-evil"
}