{
  "title": "Power And Prediction: The Disruptive Economics of Artificial Intelligence",
  "description": "Disruption resulting from the proliferation of AI is coming. The authors of the bestselling Prediction Machines describe what you can do to prepare.Banking and finance, pharmaceuticals, automotive, medical technology, retail. Artificial intelligence (AI) has made its way into many industries around the world. But the truth is, it has just begun its odyssey toward cheaper, better, and faster predictions to drive strategic business decisions--powering and accelerating business. When prediction is taken to the max, industries transform. The disruption that comes with such transformation is yet to be felt--but it is coming.How do businesses prepare? In their bestselling first book, Prediction Machines, eminent economists Ajay Agrawal, Joshua Gans, and Avi Goldfarb explained the simple yet game-changing economics of AI. Now, in Power and Prediction, they go further to reveal AI as a prediction technology directly impacting decision-making and to teach businesses how to identify disruptive opportunities and threats resulting from AI. Their exhaustive study of new developments in artificial intelligence and the past history of how technologies have disrupted industries highlights the striking phase we are now in: after witnessing the power of this new technology and before its widespread adoption--what they call \"the Between Times.\" While there continue to be important opportunities for businesses, there are also threats of disruption. As prediction machines improve, old ways of doing things will be upended. Also, the process by which AI filters into the many systems involved in application is very uneven. That process will have winners and losers. How can businesses leverage, or protect, their positions?Filled with illuminating insights, rich examples, and practical advice, Power and Prediction is the must-read guide for any business leader or policy maker on how to make the coming AI disruptions work for you rather than against you.",
  "genres": [
    "Business",
    "Artificial Intelligence",
    "Nonfiction",
    "Economics",
    "Technology",
    "Science",
    "Finance"
  ],
  "author": "Ajay Agrawal",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/60623908-power-and-prediction"
}