{
  "title": "Virgin Hearts",
  "description": "Can an inexperienced cowboy wrangle the adult movie star of his dreams?\nHawthorneI’ve lived in the same small town my entire life. And I like it, for the most part: being a rancher, taking care of my chickens, and even my meddlesome family. What I don’t like are the limited dating options. I’m gay, and at thirty-six-years-old, I’ve never been with a man.When I enter a contest to win my favorite adult entertainer’s support for our town’s first Pride Parade, I never expect to win. And I definitely never expect to find myself in a friends-with-benefits relationship with the man.The problem is, I quickly realize I want more. But could someone as confident, sexy, and independent as Silver ever consider building a life with a simple cowboy like me?MateoMy work is my life. Filming under the moniker Silver, I’m happy enough. I’m making good money, I’m free from my crummy past, I’m well on my way to the career I actually dream about, and I’m not looking for any complications.Enter Hawthorne Moore, with his sweet-as-molasses drawl, that adorable gap-toothed smile, and the beautiful way in which he begs, and suddenly, I find myself getting in too deep. And that’s a problem, because I’ve spent years building up these walls around my heart, and I don’t know how to bust them down.Can I work through my trauma and lasso myself a cowboy, or will I lose the only man who’s ever loved me?Virgin Hearts is a friends-with-benefits-to-more romance that includes a flirty performer, risqué photo shoots amongst peeping bovine, an endearing cowboy whose cock (ahem, rooster) rises at dawn, dom/sub undertones, and one very HEA. It’s book 2 in the Plum Valley Cowboys series but can be read as a standalone.",
  "genres": [
    "M M Romance",
    "Romance",
    "Westerns",
    "Contemporary",
    "LGBT",
    "Friends To Lovers",
    "Forced Proximity"
  ],
  "author": "Emmy Sanders",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/60636716-virgin-hearts"
}