{
  "title": "American Pie: Slices of Life (and Pie) from America's Back Roads",
  "description": "You know you're going on a quest for pie, but you may find something else entirely. Be prepared. These were the prophetic words uttered to Pascale Le Draoulec as she began her cross-country journey. When offered a job in New York, she chose to drive rather than fly into her new life. As a food writer, she decided to turn an ordinary move into a culinary quest. She chose pie as her grail and guide, because, after all, what's more American than pie? Crossing class and color lines, and spanning the nation (from Montana Huckleberry to Pennsylvania Shoo-Fly), pie -- real, homemade pie -- has meaning for all of us. But in today's treadmill take-out world, our fast-food nation, does pie still have a place? As a first-generation American raised by two quintessentially French parents, Le Draoulec knew much more about tartes than pies, but as she made her way across the United States, she discovered that mentioning homemade pie to anyone made faces soften, shoulders sigh, and memories come wafting back; that everyone she met had a fond memory of pie. Le Draoulec and Betty the Volvo (her trusty automotive sidekick) meandered from town to town, meeting the famous and sometimes infamous pie makers in each place, like the little old ladies of Wasta, South Dakota (pop. 70), who had been baking pies from scratch to serve, and sell, on Election Day. They found themselves going head to head with state officials when South Dakota outlawed the sale of food at elections. Le Draoulec's story, based on her adventure serialized in the Gannett newspapers, will entertain and move readers as she seeks to answer the question of the place of pie in today's world.",
  "genres": [
    "Food",
    "Nonfiction",
    "Travel",
    "Cooking",
    "Cookbooks",
    "Memoir",
    "Food Writing"
  ],
  "author": "Pascale Le Draoulec",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1287147.American_Pie"
}