{
  "title": "What My Bones Know: A Memoir of Healing from Complex Trauma",
  "description": "A searing memoir of reckoning and healing from an acclaimed journalist and former This American Life producer investigating the little-understood science behind Complex PTSD and how it has shaped her life.By age thirty, Stephanie Foo was successful on paper: She had her dream job as a radio producer at This American Life and had won an Emmy. But behind her office door she was having panic attacks and sobbing at her desk. After years of questioning what was wrong with her, she was diagnosed with Complex PTSD--a condition that occurs when trauma happens continuously, over the course of years.Both of Stephanie's parents had abandoned her as a teenager after years of physical and verbal abuse and neglect. She thought she'd overcome her trauma, but her diagnosis illuminated the ways in which her past continued to threaten her health, her relationships, and her career. Finding few resources to help her heal, Stephanie set out to map her experience onto the scarce scientific research on C-PTSD.In this deeply personal and thoroughly researched account, Stephanie interviews scientists and psychologists and tries a variety of innovative therapies with the determination and curiosity of an award-winning journalist. She returns to her hometown of San Jose, California, to investigate the effects of immigrant trauma on a community, she uncovers family secrets in the country of her birth, Malaysia, and learns how trauma can be inherited through generations. Ultimately, she discovers that you don't move on from trauma--but you can learn to move with it, with grace and joy.Powerful, enlightening, and clarifying, What My Bones Know is a brave narrative that reckons with the hold of the past over the present, the mind over the body--and one woman's ability to reclaim agency from her trauma.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Psychology",
    "Mental Health",
    "Audiobook",
    "Self Help",
    "Biography"
  ],
  "author": "Stephanie Foo",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/60638414-what-my-bones-know"
}