{
  "title": "And There Was Light: Abraham Lincoln and the American Struggle",
  "description": "The life and moral evolution of Abraham Lincoln, exploring why and how Lincoln confronted secession, threats to democracy, and the tragedy of slavery in order to expand the possibilities of America.A president who governed a divided country has much to teach us in a twenty-first-century moment of polarization and political crisis. Abraham Lincoln was president when implacable secessionists gave no quarter in a clash of visions inextricably bound up with money, power, race, identity, and faith. He was hated and hailed, excoriated and revered. In Lincoln we can see the possibilities of the presidency as well as its limitations. At once familiar and elusive, Lincoln tends to be seen in popular minds as the greatest of American presidents—a remote icon—or as a politician driven more by calculation than by conviction. This illuminating new portrait gives us a very human Lincoln—an imperfect man whose moral antislavery commitment was essential to the story of justice in America. Here is the Lincoln who, as a boy, was steeped in the sermons of emancipation by Baptist preachers; who insisted that slavery was a moral evil; and who sought, as he put it, to do right as God gave him light to see the right. This book tells the story of Lincoln from his birth on the Kentucky frontier in 1809 to his leadership during the Civil War to his tragic assassination at Ford’s Theater on Good Friday 1865: his rise, his self-education through reading, his loves, his bouts of depression, his political failures, his deepening faith, and his persistent conviction that slavery must end. In a nation shaped by the courage of the enslaved of the era and by the brave witness of Black Americans of the nineteenth century, Lincoln’s story illuminates the ways and means of politics, the marshaling of power in a belligerent democracy, the durability of white supremacy in America, and the capacity of conscience to shape the maelstrom of events. Lincoln was not all he might have been—few human beings ever are—but he was more than many men have ever been. We could have done worse. And we have. And, as Lincoln himself would readily acknowledge, we can always do better. But we will do so only if we see Abraham Lincoln—and ourselves—whole.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "Presidents",
    "Civil War",
    "American History"
  ],
  "author": "Jon Meacham",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/60647674-and-there-was-light"
}