{
  "title": "A Prairie Creek Christmas",
  "description": "From USA TODAY bestseller Elizabeth Bromke comes a cozy Christmas romance perfect for Hallmark fans.Miles Gentry cannot spend this Christmas without a date on his arm. At least, not if he wants a shot at winning the Snow Ball, a silly men's beauty pageant organized to support the local pet rescue. The cause is close to Miles' heart not only because he's an animal lover, but because his sister is running the event.But eligible bachelorettes are non-existent in the small South Dakota town. That's when Miles' sister Lucy steps in. Lucy, a journalist, posts an ad online behind Miles' back.Single 39-year-old man seeking mistletoe-loving woman for a day of Christmas magic...Meanwhile up in Aberdeen, Erika Lee has no plans this Christmas. A park manager for South Dakota Game and Fish, she's thousands of miles away from her family and feels antsy not to have a dinner to make or gifts to exchange. When she comes across a goofy online posting, the 35-year-old figures she has nothing to lose. That's when Erika heads down to Prairie Creek to play girlfriend to a small-town hunter who is way better looking than his sister made him out to seem.Once they meet, the deal is set: Miles and Erika will pretend to be together in order to win over the hearts of the event attendees and judges. All they'll need to do is act like they are in love, and they have a shot at helping Cause for Paws meet their fundraising goal. After that, Erika can return to the campgrounds of Aberdeen and Miles can return to his life of game days with the boys and weekends hunting pheasant. That is, as long as they don't really fall for each other.Fans of Hickory Grove, Cedar Cove, and sweet romance will fall in love with Prairie Creek in this heartwarming fake romance set in a small-town full of Christmas spirit.",
  "genres": [
    "Christmas"
  ],
  "author": "Elizabeth Bromke",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/60643595-a-prairie-creek-christmas"
}