{
  "title": "Into the Mouth of the Wolf",
  "description": "Russell Shepard was just a boy when the first footage of a living werewolf was authenticated and broadcast. As he grew, the lycanthropic outbreak was a constant. During Russell's adolescence he watched with the rest of the world as \"outbreak\" turned into \"epidemic\". Now, as an adult, the epidemic had become a pandemic, reaching every nation and turning the scientific community on its head.Still, those unfortunate few who'd been contaminated remained a notable minority. Spectacular research facilities peppered the globe, designed to study the infection. Specially trained urban tactical units protected the population at large, capturing and containing the creatures for analysis until a cure could be developed.All of this fascinated Russell, as it did everyone he knew, but there was an entire global community dedicated to helping the victims of lycanthropic infection and eventually producing a cure. There was no need to panic. At least that was what Russell had been told all his life by television personalities and politicians alike. Just don't do anything stupid. Follow the rules and the odds of encountering an actual werewolf would remain blissfully remote.And so Russell's consideration of werewolves remained passive. It remained passive, that is, until the night he was bitten.Werewolves are real and the world has mobilized, brutally, to crush both the contagion that creates them and the individuals who have become infected. After Russell Shepard narrowly survives a werewolf attack, he is haunted by dreams of a place and time he has never been, and hunted by those who would end his life immediately, without remorse. He is propelled along a path that will bring him face to face with the forces determined to contain and destroy the threat he himself now represents.",
  "genres": [
    "Werewolves",
    "M M Romance",
    "Paranormal",
    "Shapeshifters"
  ],
  "author": "Joshua Dagon",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/6063191-into-the-mouth-of-the-wolf"
}