{
  "title": "The Local School",
  "description": "Although many view schools, colleges, and universities as the primary places from which we attain an education, opportunities for education surround us all in many overlooked forms, often around the corner, down the block, or even right in your own home. Written over the span of several years as he shuttled to and from the Indian subcontinent, Colin Phelan's debut book The Local School pays tribute to this idea: that the best schools are our local schools, ones of friends, of family, or of the people serendipitously encountered in your own neighborhood.Fusing genres of travel writing, narrative journalism, memoir, and poetry, The Local School explores a counterintuitive perception of education and the need for an education renaissance in America. Detailing his experiences living and studying alongside two Indian men, one a Bengali teacher, and one a northern Indian truck driver, Phelan reorients education as a lifestyle, as opposed to something we chase. For years, Phelan wrestles with questions about these two Indian men's uniquely uncommon friendship, about the Indian subcontinent's history and complex social fabric, and ultimately, about what makes an education. All the while travelling far from home, Phelan learns that the best schools are our local schools. Utilizing archival research from the National Archives of India, Delhi, the British Library, London, and behind the scenes access in Kolkata, Delhi, Kashmir, and parts of the Garhwal Himalayan foothills, Phelan's story treads genres of travel writing, narrative journalism, and memoir. All the while reimagining these ideas about education, Phelan's narrative offers readers privileged access into worlds of India about which they would otherwise know little.Editorial Reviews:\"It's been a while since I've read anything as unique and moving. It had me from the start. Fortunately, Phelan strays far from the local to contend with what are, at root, universal themes: the connection between past and present, between one's own inner life and the lives of others. It's a vivid literary success.\" - John O'Connor, Acclaimed American Travel Writer\"A mosaic of fresh, honest reflections on the 'serendipitous' relationship that evolved among a trio of seekers in modern Kolkata: a shared quest for what the author calls the soul's 'engagement and personal betterment.' By 'The Local School, ' Phelan means the process through which, with the aid of his Bengali and Garhwali 'brothers by choice' in an impromptu neighborhood academy, he learned to 'slow down and identify' his Western 'predispositions as a means of both correcting and valuing' his own identity. Much as sifting passages lifted from a journal, you'll find here a rich, heartfelt mix of poetry, pedagogical musings, astute political history of the subcontinent and British Empire--and a restless desire to review one's first impressions, so as to plan yet another journey of learning.\" - Dr. Christopher Wilson, Reading Narrative Journalism\"The Local School recounts the formative journey of a young teacher who comes to understand and commit to the teaching profession and its universal values. Phelan paints a vivid portrait of modern day India and its people, delving into history, politics and the philosophy of education. This moving tale of an unlikely friendship enlightens and inspires.\" - Jennifer Berkshire, A Wolf at the Schoolhouse Door: the Dismantling of Public Education and the Future of School",
  "genres": [
    "Nonfiction",
    "Education",
    "Memoir",
    "India",
    "Poetry",
    "Biography",
    "Sociology"
  ],
  "author": "Colin Phelan",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/60631087-the-local-school"
}