{
  "title": "What Came After",
  "description": "WHAT CAME AFTER is the Amazon bestseller written by Jon Clinch (THE THIEF OF AUSCHWITZ, FINN, KINGS OF THE EARTH) under his pen name, Sam Winston.The apocalypse doesn't need plagues or zombies or bombs. All it needs is us.Set in the very near future, WHAT CAME AFTER takes place in a too-credible third-world America that's been hijacked by corporations in the service of the wealthy. The Federal government has collapsed, health care is inaccessible, and private armies keep order. The upper class is concentrated in the cities, while the middle class-decimated by disease and poisoned by genetically engineered foods-labors on in a handful of desolate Empowerment Zones.One man, Henry Weller, has had enough. With his five-year-old daughter going blind, he sets out across a ruined America to find her the health care she deserves. He'll have to face a strange and hostile world-from the financial districts of a walled New York to the armed camp of Washington, DC-but if he's successful, his daughter might see again.And along the way, a revolution might get started.WHAT CAME AFTER is shaped by issues on everyone's mind right now: poverty, corporate power, access to heath care, the outsourcing of government, parents' obligations to their children.But at its core, it's a post-apocalyptic adventure in a desolate and treacherous world: THE WIZARD OF OZ meets HEART OF DARKNESS, at the end of the American dream.From the critics:\"Sometimes I just keep hearing about a book on social media and I get so curious, I seek out the book myself. Case in point: Sam Winston's extraordinary WHAT CAME AFTER, an e-book about the end of the world. I started reading after dinner and didn't stop until I finished. This is no ordinary book. Character-driven, haunting, and gorgeously written, I think it's a classic\"- Caroline Leavitt, New York Times bestselling author of PICTURES OF YOU.",
  "genres": [
    "Dystopia",
    "Science Fiction",
    "Post Apocalyptic",
    "Fiction",
    "Apocalyptic"
  ],
  "author": "Sam  Winston",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/12871190-what-came-after"
}