{
  "title": "South with Endurance: Shackleton's Antarctic Expedition 1914-1917",
  "description": "The definitive and spellbinding record of Shackleton's legendary Antarctic expedition, immortalized on film by pioneering photographer Frank HurleySir Ernest Shackleton's trans-Antarctic expedition of 1914-1917 was one of the great feats of human endurance -- one vividly captured in the powerful and dramatic pictures taken by Frank Hurley, the expedition's official photographer. These images, appearing together here for the first time in print, constitute an amazing body of photojournalism created under the most adverse circumstances imaginable. As this book reveals, however, they are far more than visual reportage; they also are images of great artistry that capture the life-and-death drama that was played out against an arctic landscape of magnificent and terrible beauty.The story told here through Frank Hurley's lens began in the summer of 1914, when Shackleton and his crew set sail from England with the intention of being the first to cross Antarctica from one coast to the other, passing through the South Pole on the way. After five months they reached the freezing Weddell Sea and were within sight of land when the Endurance became trapped in the ice pack. Nine months later, the ship was finally crushed, leaving the crew stranded on drifting ice floes at the end of the earth.What followed is one of the most remarkable survival stories in the history of human exploration. Shackleton's men camped on the ice floes for five months before they escaped in their lifeboats and, after a harrowing five-day voyage, reached Elephant Island, a barren outcrop too remote for any hope of rescue. From there, Shackleton and five other volunteers set out for South Georgia Island and miraculously reached their destination after traversing 850 miles of the fiercest seas on the face of the planet in an open lifeboat. There they raised help, and three months later, after three failed attempts, Shackleton made it back to Elephant Island with a rescue ship.Incredibly, every single one of his men survived. Almost as incredible is the fact that so much of this drama was captured on film by Frank Hurley, and that so many of these pictures survived. South with Endurance is the first book to reproduce a total of nearly 500 extant photographs, including many remarkable color images that have never been published before. It is also the first to reproduce the photos to a standard and size that display Hurley's work as the art that it is. Drawn from the archives of the Royal Geographical Society in London, the State Library of New South Wales in Sydney, and the Scott Polar Research Institute in Cambridge, the photographs are complemented by excerpts from Hurley's diary, a chapter about the expedition itself, a biographical essay, and commentary about Hurley's photographic techniques.",
  "genres": [
    "History",
    "Nonfiction",
    "Photography",
    "Travel",
    "Art",
    "Adventure",
    "Survival"
  ],
  "author": "Frank Hurley",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/128722.South_with_Endurance"
}