{
  "title": "Murder at Mallowan Hall",
  "description": "The first in an exciting new historical mystery series set in the home of Agatha Christie!\n\n\n\nColleen Cambridge's charming and inventive new historical series introduces an unforgettable heroine in Phyllida Bright, fictional housekeeper for none other than famed mystery novelist Agatha Christie. When a dead body is found during a house party at the home of Agatha Christie and her husband Max Mallowan, it's up to famous author's head of household, Phyllida Bright, to investigate...\nTucked away among Devon's rolling green hills, Mallowan Hall combines the best of English tradition with the modern conveniences of 1930. Housekeeper Phyllida Bright, as efficient as she is personable, manages the large household with an iron fist in her very elegant glove. In one respect, however, Mallowan Hall stands far apart from other picturesque country houses...The manor is home to archaeologist Max Mallowan and his famous wife, Agatha Christie. Phyllida is both loyal to and protective of the crime writer, who is as much friend as employer. An aficionado of detective fiction, Phyllida has yet to find a gentleman in real life half as fascinating as Mrs. Agatha's Belgian hero, Hercule Poirot. But though accustomed to murder and its methods as frequent topics of conversation, Phyllida is unprepared for the sight of a very real, very dead body on the library floor...A former Army nurse, Phyllida reacts with practical common sense--and a great deal of curiosity. It soon becomes clear that the victim arrived at Mallowan Hall under false pretenses during a weekend party. Now, Phyllida not only has a houseful of demanding guests on her hands--along with a distracted, anxious staff--but hordes of reporters camping outside. When another dead body is discovered--this time, one of her housemaids--Phyllida decides to follow in M. Poirot's footsteps to determine which of the Mallowans' guests is the killer. With help from the village's handsome physician, Dr. Bhatt, Mr. Dobble, the butler, along with other household staff, Phyllida assembles the clues. Yet, she is all too aware that the killer must still be close at hand and poised to strike again. And only Phyllida's wits will prevent her own story from coming to an abrupt end...",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Cozy Mystery",
    "Audiobook",
    "Historical",
    "Historical Mystery"
  ],
  "author": "Colleen Cambridge",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/60649471-murder-at-mallowan-hall"
}