{
  "title": "A Song of Saints and Swans",
  "description": "According to legend, swans sing most beautifully before they die.As shifter royalty and the next in line to lead my clan, I believed I was invincible. Until my mother disappeared without a trace and I learned my entire existence was a lie.My fate was sealed when the last of my power was stolen by human men. From that day forward, I buried the life I’d been born into, along with any humanity I had left.Until all that remained was pure animal rage.When the past arrives with twin promises of winter’s death and spring’s renewal, I’m given the chance to reclaim the life I was destined for.The question is—how badly do I want it?Enough to be reborn from the ashes? Or should I allow my fate to sing its final swan song?---You will want to read the complete Yaga's Riders trilogy (starting with Rise of the Witch) before reading this novella. The Yaga’s Riders is based on the folklore of Baba Yaga, with many often ridiculous creative liberties taken.This series is meant for readers 18 and over.IF YOU LOVE• A salty swan who takes no shiz• Fire + Ice with a certain pair of gods ( + enemies-to-lovers vibes)• Extra spicy spice with respectful MFF• Body positivity + va ju-ju love• Suspense + mystery• Folklore + witchy vibes• Cameos from a certain witch and her Riders, and a Rusalka & her human*Then preorder this Yaga's Riders tale!Full list of CW/TWs coming soon, but it's safe to assume the following will be included:• Sweary dialogue• Naughty, irreverent humor• EmoTIOnaL DAmaGe• Graphic, extra spicy sex• References to past SA• Healing from trauma• General weirdness and medium-dark elementsPlease note: Margo + Konstantin from the Into the Woods monster romance anthology will be side characters, but NOT the sammich bread in this tale.",
  "genres": [
    "Magic",
    "Paranormal Romance",
    "Friends To Lovers",
    "Paranormal"
  ],
  "author": "C. Rochelle",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/60660715-a-song-of-saints-and-swans"
}