{
  "title": "Pariah",
  "description": "Named by the Washington Post as one of the best books of 2009.\"What a sick puppy of a writer Dave Zeltserman is!...a doozy of a doom-laden crime story that not only makes merry with the justice system, but also satirizes those bottom feeders in the publishing industry who would sign Osama bin Laden to a six-figure contract for his memoirs, if only they could figure out which cave to send their lawyers into...I'd say Zeltserman can't top Pariah for its sheer diabolical inventiveness, but he probably will. And given that the corrupting vision of his work is so powerful, I ought to know better than to read the next novel he writes. But I probably will anyway.\" Maureen Corrigan, The Washington Post\"This fusion of hardboiled and bitter satire is brand new territory for noir and I suspect that it will be one of the most talked about novels of 2009.\" Ed Gorman\"Pariah will keep you glued to its pages. There are no holds barred anywhere in this wonderful launch into evil. The meek beware . . . be-very-ware.\" Charlie Stella\"Pariah is sure to catapult Zeltserman head and shoulders above other Boston authors. This is not only a great crime book, but a gripping read that will crossover to allow greater exposure for this rising talent.\" BOOKGASM.comOnce part of the holy triumvirate ruling the South Boston Irish Mob, Kyle Nevin is set up with the Feds by head mobster Red Mahoney, who leads him to a court case and a stretch in the slammer. Now out of prison, Kyle wants revenge on his old boss and mentor and, just as importantly, to reclaim his former glory. A kidnapping gone wrong leads, bizarrely, to a major book deal and a newfound celebrity status for Kyle. However, it also brings about bigger problems for both himself and anyone unlucky enough to cross his path. With this dark riff and contemporary theme, Zeltserman shows why he is the heir of Jim Thompson and James M. Cain.Dave Zeltserman lives in the Boston area with his wife. His previous novel Small Crimes was included in The Washington Post's best books of 2008 and was one of NPR's top five crime and mystery novels of 2008.",
  "genres": [
    "Noir",
    "Crime",
    "Mystery",
    "Thriller",
    "Fiction"
  ],
  "author": "Dave Zeltserman",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/6065908-pariah"
}