{
  "title": "And There Was Light: Abraham Lincoln and the American Struggle",
  "description": "NEW YORK TIMES BESTSELLER - Pulitzer Prize-winning biographer Jon Meacham chronicles the life of Abraham Lincoln, charting how--and why--he confronted secession, threats to democracy, and the tragedy of slavery to expand the possibilities of America.\"In his captivating new book, Jon Meacham has given us the Lincoln for our time.\"--Henry Louis Gates, Jr.ONE OF THE BEST BOOKS OF THE YEAR: The Christian Science Monitor, Kirkus ReviewsA president who governed a divided country has much to teach us in a twenty-first-century moment of polarization and political crisis. Hated and hailed, excoriated and revered, Abraham Lincoln was at the pinnacle of American power when implacable secessionists gave no quarter in a clash of visions bound up with money, race, identity, and faith. In him we can see the possibilities of the presidency as well as its limitations.At once familiar and elusive, Lincoln tends to be seen as the greatest of American presidents--a remote icon--or as a politician driven more by calculation than by conviction. This illuminating new portrait gives us a very human Lincoln--an imperfect man whose moral antislavery commitment, essential to the story of justice in America, began as he grew up in an antislavery Baptist community; who insisted that slavery was a moral evil; and who sought, as he put it, to do right as God gave him to see the right.This book tells the story of Lincoln from his birth on the Kentucky frontier in 1809 to his leadership during the Civil War to his tragic assassination in 1865: his rise, his self-education, his loves, his bouts of depression, his political failures, his deepening faith, and his persistent conviction that slavery must end. In a nation shaped by the courage of the enslaved of the era and by the brave witness of Black Americans, Lincoln's story illustrates the ways and means of politics in a democracy, the roots and durability of racism, and the capacity of conscience to shape events.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "Presidents",
    "Civil War",
    "American History"
  ],
  "author": "Jon Meacham",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/60664832-and-there-was-light"
}