{
  "title": "Masters and Commanders: The Military Geniuses Who Led the West to Victory in World War II",
  "description": "Andrew Roberts's Masters and The Military Geniuses who led the West to Victory in WWII tells the story of how four great leaders fought each other over how best to fight Hitler. During the Second World War the master strategy of the West was shaped by four titanic Winston Churchill and Franklin Roosevelt, and their respective military commanders - General Sir Alan Brooke and General George C. Marshall. Each man was tough-willed and strong minded. And each was certain he knew best how to achieve victory. Drawing on previously unpublished material, including for the first time verbatim reports of Churchill's War Cabinet meetings, Andrew Roberts's acclaimed history recreates with vivid immediacy the fiery debates and political maneuverings, the rebuffs and the charm, the explosive rows and dramatic reconciliations, as the masters and commanders of the Western Alliance fought each other over the best way to fight Adolf Hitler. 'History as it should be written; a gripping narrative'  Michael Gove, Mail on Sunday Books of the Year 'Scintillating historical writing on the whole rich panorama of Britain and the US at war'  Martin Gilbert, Evening Standard 'A compelling analysis of American and British military strategy during the war. He also tells a profoundly human story'  Laurence Rees, Sunday Times 'A masterpiece'  Christopher Silvester, Daily Express 'Britain's finest contemporary military historian'  Economist Books of the Year Andrew Roberts is a biographer and historian of international renown whose previous books include Victorian Titan (1999), which won the Wolfson History Prize and the James Stern Silver Pen Award for Non-Fiction; Napoleon and Wellington (2001); Hitler and Secrets of Leadership (2003), which coincided with four-part BBC2 history series, and A History of the English-Speaking Peoples Since 1900 (2005).",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Biography",
    "War",
    "Military Fiction",
    "Military History"
  ],
  "author": "Andrew Roberts",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/6065741-masters-and-commanders"
}