{
  "title": "Devil",
  "description": "VALENTINE I'm locked in a gilded cage, and the devil holds the key. Malcolm Whitlock, the city's most corrupt official. The man they call Devil, because when you make a deal with him, you're guaranteed to lose. Your wealth. Your life. Maybe even your soul. And this respectable psychopath (his words, not mine) is the man I call brother-in-law. Because I'm just that particular brand of unlucky. When a demon from Malcolm's past gets my best friend murdered, revenge is the force that draws us together. Obsession is the force that pulls me under his absolute control. See, once you're in the devil's clutches, there's no turning back. And the most twisted part? I'm losing sight of why I wanted to in the first place. - MALCOLM He's the one thing that's ever been off limits to me. That's why I'll tear the underworld apart to make him mine. Valentine is the wrong prey for a myriad of reasons, and at the very top of that list is the fact that he's a DiFiore. He's naïve, reckless, and far too pretty for his own good. He's a doctor who can barely even stand the sight of blood. It's a damn miracle he managed to stomach med school, let alone survive this long in a world as cruel and depraved as ours. He's also straight. Just in case there needed to be one more reason I have no business wanting him. When the monster who killed the one man I've ever truly loved comes back from the dead and Valentine ends up in his crosshairs, it falls to me to keep this beautiful idiot alive. I can't make any promises for his innocence, though. Not when he looks at me with those defiant honey-brown eyes, just daring me to make him mine. My key witness. My prisoner. My boy. Because as Valentine is about to learn, I'm the kind of man who always gets what he wants. I'm just not sure either of us is ready to pay the cost. Author's Note: This is an intense, high-heat, high-angst standalone MM Mafia Romance brimming with violence and mayhem. Malcolm is no hero, and reader discretion is advised. See author's website for specific content notes.",
  "genres": [
    "M M Romance",
    "Dark",
    "BDSM",
    "Romance",
    "Crime",
    "Dark Romance",
    "Contemporary"
  ],
  "author": "Joel Abernathy",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/60683855-devil"
}