{
  "title": "The People in the Room: Rabbis, Nuns, Pastors, Popes, and Presidents",
  "description": "Go behind the headlines and read the inside story told by “one who was in the room” as Christians and Jews—strangers and adversaries for nearly twenty centuries—reversed that sad history and created an extraordinary revolution of the human spirit. Told by a global interreligious leader, this authoritative book is a riveting personal account of the significant issues and major personalities he encountered in the vital effort to permanently change the relationship between two of the world’s major religious communities.With his belief in the goodness of humanity and the undying faith that with interreligious dialogue we can find good in all religions, Rabbi James Rudin opens up to his life’s work, his journey into the soul of religion, spirituality, and life.Rabbi Rudin takes us inside the Vatican, Camp David, churches, synagogues, and other stops across the globe, where he and so many others worked under the radar, tirelessly, for a lifetime, building rapport and bringing the religions together with interfaith dialogue. Rabbis, reverends, pastors, priests, nuns, popes, all work in tandem to make our world a better place.As Rabbi Rudin and others keep putting their next foot forward, we find inspiration to ask:Are there possibilities where we never dreamed they existed?Have we given enough of ourselves to the good of the world?How can we continue the work Rabbi Rudin and others have done?Most people look at peace through a broad lens—either we have it or we are at war—but the day-to-day efforts of moving toward love and understanding have escaped us. This hopeful explanation shows that one person, one of many, can work diligently behind the scenes, toward peace. Such tenacity, such grit in believing so strongly in human nature’s possibilities will accomplish miracles.Read this book and learn the inside story.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Historical"
  ],
  "author": "James Rudin",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/60668710-the-people-in-the-room"
}