{
  "title": "Four Leaf Felony",
  "description": "CELEBRATE GOOD CRIMES!Holiday Cozy Mystery Series is a spin off of Tonya Kappes's A Camper and Criminals Cozy Mystery Series! Smiling eyes aren't shining upon Violet Rhinehammer!Violet Rhinehammer finally got the call! She's been working so hard in her hometown of Normal, Kentucky as a reporter for Channel Two News and the Normal Gazette to get the national attention to she believes she rightfully deserves!Now is her time! Violet got an interview of a lifetime with a huge national news network. It didn't take her long to pack her bag and hop on an airplane leaving Normal, Kentucky behind!While in flight she was so busy dreaming about her opportunity. The passenger sitting next to Violet yammered on and on about her grandchildren, Violet had to use her southern manners to excuse herself to the bathroom after the woman gave Violet a headache.After all, Violet had to keep her head in the game because she was determined to get the job so she didn't have to go back to her small hometown.Violet's moment of bathroom silence quickly turned to chaos after she found a dead body in the airplane bathroom causing the pilot to make an emergency landing in the small town Holiday Junction.The NTSB has grounded any flights leaving in or out of Holiday Junction and every passenger is considered a suspect which means Violet Rhinehammer is stranded until the murder is solved. Y'all know Violet! She's not going to sit on her laurels, she's using her keen journalist skills and possibly a little help from the Laundry Club Ladies from Normal, Kentucky to solve the crime.After all, she's got to show up for her big interview and her dream job is slipping through her hands.Holiday Cozy Mystery Series is set during the holidays. Some of them will be released before the intended holiday but most won't because Tonya writes these exclusively for her Patreon group and releases them as she sees fit.",
  "genres": [
    "Cozy Mystery",
    "Mystery",
    "Holiday",
    "Cozy",
    "Fiction",
    "Audiobook",
    "Adult"
  ],
  "author": "Tonya Kappes",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/60671230-four-leaf-felony"
}