{
  "title": "Answers from Heaven for Soul and Self",
  "description": "Self-development, self-improvement, understanding the inner or hidden self – whatever you may call it, what it really is about is soul and self-findings. We all understand the various terms that have been mentioned above. In fact, most of them also use some techniques for achieving these various aspects. But most of us don’t think about the ultimate goal – the ultimate self that is to be achieved through these techniques. When thinking of self-development, we thing about developing our personality and mannerisms to increase our work efficiency and decrease our stress levels. We practice various meditative techniques and some oriental exercises like yoga for a better life style. But is that the only purpose that these techniques fulfill? Is that all that our ancestors aimed at, considering that at that time people did not face such stresses and tensions that we do in the modern world? The answer is they wanted to achieve something very special – something imperishable. The imperishable that our ancestors from the Greek, Roman, Chinese, Indian, Japanese and Sri Lankan civilizations eyed was the soul, the ultimate self. Most oriental religious texts talk about this imperishable self and also teach ways in which it can be understood and gained. What they talk about is leading a simple life – a life void of worldly ambitions and greed. A person should work but only for gaining, the most basic thing required for leading a comfortable life. Instead of running after luxuries and a greed for gaining more of material things, we should think about making lives around us better and easy. We should not think about what we haven’t gained but appreciate all that we have got without doing much of hard work. Think that we are lucky that God gave use all our five senses that work perfectly, a healthy body and a normally functioning brain that helps us in distinguishing between right and wrong. Think about all the comforts that we got in our childhood. Consider the fact that how lucky we are to have gone to a good school and gained education – the education on the basis of which we can earn our livelihood and live with pride. Think about all the good people who are a part of our lives and the family who has been there like a backbone. Think about all the good things that we got – all the things that many in this world have been deprived of. When you will compare yourself to those you are deprived of even the basic gifts of God like a healthy body, you will understand how lucky you are. You will realize what all you already have. This realization is necessary to get out of the rat race for getting more. Once you get to this level, you will automatically feel a change in yourself. Your mind will be more relaxed – void of all the tensions and worries that use to haunt you. And when you will combine various meditative techniques and exercises with it, you will feel like in heaven. Now since meditation and exercises have been mentioned lets talk about them. Meditation as we know is a primarily oriental technique. For centuries, it has been related with saints or old people who think that old age is the time of getting rid of all the worldly desires. But the fact is that these exercises and meditation techniques should be practiced throughout your life, right from the childhood. They are beneficial for students because they help in improving their concentration, which is extremely necessary for studies. These techniques also help in relaxing their minds considering that even kids have to face stress related to studies. How these techniques are beneficial for working people is most apparent. They also help those who have taken retirement from office work. In fact, these techniques are extremely important in understanding the self and finding the soul so that not only after death but during life also we gain our heaven.",
  "genres": [],
  "author": "The Saint",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/60685240-answers-from-heaven-for-soul-and-self"
}