{
  "title": "No coração da bruxa",
  "description": "A jornada épica de uma bruxa ressurgida das cinzasDizem que uma velha bruxa viveu ao leste, no Bosque de Ferro, e que deu à luz os lobos que perseguem o Sol e a Lua.Dizem que ela foi até Asgard e foi queimada três vezes em uma pira, e que três vezes ela renasceu antes de fugir.Dizem que ela amou um homem de lábios marcados e língua afiada, um homem que lhe devolveu o coração e muito mais...A história de Angrboda — uma gigante, bruxa, mulher forte e mãe destemida — começa da forma como muitas outras terminam: com uma bruxa em chamas. Embora estejamos em território da mitologia nórdica, povoada por tantas histórias com homens e deuses no centro de tudo, quem ganha destaque aqui é um ser gigantesco, que se tornou inimiga dos deuses.A protagonista de No Coração das Bruxas— novo romance a integrar as marcas DarkLove e Magicae — ajudou estes mesmos deuses, mas se negou a fornecer conhecimentos sobre o futuro a Odin. O Pai-de-Todos então puniu a bruxa, queimando-a na fogueira. Porém, já habituada a livrar-se da ceifadora, Angrboda consegue retornar das chamas.Ferida e indefesa, ela encontra refúgio em uma floresta isolada. Não demora muito para que a bruxa conheça Skadi, uma caçadora de olhos azuis glaciais com quem compartilha um vínculo crescente, e Loki — que, embora não seja muito confiável, acaba por se tornar o grande amor de Angrboda. De sua união com Loki, nascem três filhos bastante incomuns: Hel, Fenrir e Jormungand. As visões de Angrboda sobre o Ragnarok e o papel que seus filhos desempenharão na queda dos deuses colocam em risco a vida pacífica de sua família, e ela terá que escolher entre aceitar o destino ou fazer tudo que está ao seu alcance para mudar o futuro de seus filhos.Em uma trama comovente e subversiva, Genevive Gornichec nos brinda com a história de uma mulher que ama — e está disposta a declarar guerra aos deuses em nome desse sentimento. A fantástica saga criada por Gornichec dá vida a uma personagem pouco conhecida da mitologia nórdica e se aprofunda na complexidade dos relacionamentos de Angrboda e nos caminhos que ela está disposta a percorrer por amor e vingança.Uma obra repleta de magia, com personagens cativantes, florestas, poções mágicas e todos os elementos necessários para enfeitiçar o coração e a alma daqueles que adentrarem os territórios sagrados das marcas Magicae, que já encantou os darksiders com títulos como O Ano da Bruxa e Bruxa Natural, e DarkLove, que arrebatou as leitoras e os leitores com as Crônicas de Amor e Ódio. Uma jornada épica e poderosa para guardar no lugar mais seguro e inquebrantável de todos: o coração.",
  "genres": [
    "Fantasy",
    "Mythology",
    "Fiction",
    "Romance",
    "Retellings",
    "Witches",
    "Historical Fiction"
  ],
  "author": "Genevieve Gornichec",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/60683967-no-cora-o-da-bruxa"
}