{
  "title": "Best Laid Plans",
  "description": "\"This is a series that should be savored like a fine scotch, one whose sweetness lingers in your mouth long after you've swallowed.\" (Journal of Always Reviews)The reavers are swarming and this time their prey is the supreme ruler of the Templum, the Ipsissimus himself.With Shader dead and his piece of the Statue of Eingana in the hands of Shadrak the Unseen, the threat of the Unweaving of all Creation is one step nearer.Dr. Cadman realizes he’s in too deep and there’s nothing for it but to go on the offensive. If he’s to survive the coming war for the statue, what better allies could he have than an army of the living dead?As Sektis Gandaw closes in and a clash of cultures threatens the land of Sahul, the philosopher Aristodeus still has ideas of his own that could decide the fate of all existence.But with the passage to the heavenly realm of Araboth covered by the Abyss, nothing is as it should be. Aristodeus knows that even Shader’s death can be turned to his advantage; after all, it’s a long game, and he holds all the cards.But even the best laid plans …\"The star of this show is the intriguing post-apocalyptic world that Mr. Prior began building in Sword of the Archon. This alternative Earth is a wondrous thing to behold, filled with interesting lore, mysteries galore, vile plots, ancient gods and goddesses, and old world technology.\" (Bookwraiths Reviews)Here's what readers are saying about book 1, Sword of the \"This is the best full-length self-published fantasy I've yet to read.\" (Rex Jameson) \"Gritty and thought-provoking, Shader is an absolute triumph of fantasy.\" (Journal of Always Reviews)\"If you liked Abercrombie's trilogy I think you'll like this.\" (Ray Nicholson Reviews)\"This author has some major talent.\" (Readers Favourite)",
  "genres": [
    "Fantasy",
    "Sword and Sorcery",
    "Dark Fantasy"
  ],
  "author": "Derek Prior",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/12872561-best-laid-plans"
}