{
  "title": "Reasons Why Not to Date Public Enemy CEO",
  "description": "What happens when the most hated man in town goes after everyone’s favorite girl-next-door?\nReason #1: Big, bad CEO Aiden Beaumont wears his grumpy mask every day like a badge of honor. Mia Sparks wants nothing more than to honk his nose or throw a pie in his face, à la The Three Stooges, just to see if he’s capable of smiling. Unfortunately, she can’t. Because he’s technically her boss, and she’d like to keep her gig at the new five-star beach resort for longer than two weeks.Reason #2: Everyone in her small hometown of Shell Grove, SC hates the man. He brought big business to their little beach town, and as far as her fellow citizens are concerned, that makes him the devil incarnate. But he won’t be staying forever, which works for Mia. She doesn’t go for the flashy city types anyway. She’s quite happy living her quiet life in Shell Grove. The faster the cranky—albeit stupidly hot—CEO is out of her life, the better.Reason #3: Every time Aiden frowns at her, it hits her like a thousand-watt smile. He has a language all his own, and it’s starting to make way too much sense to her. She can’t avoid him in a town the size of a postage stamp, and it finally hits her that…she doesn’t want to escape him. This always-irritated, too-serious businessman couldn’t possibly be the stable safe haven she’s been looking for. Could he?Aiden knows there’s a million and one reasons to stay away from the sugary sweet Mia. But who runs away from sunshine after living their entire life in a secluded cave? And when someone from her past unexpectedly emerges and tries to drive a wedge between the two of them? All bets are off. Aiden has never lost a fight in the boardroom, and he’s not about to lose the fight for the woman he wants to deserve. He just has to prove to her that he’s not the PUBLIC ENEMY CEO everyone thinks he is.",
  "genres": [
    "Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Small Town Romance",
    "Adult",
    "Workplace Romance",
    "Contemporary Romance"
  ],
  "author": "Melanie Munton",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/60695761-reasons-why-not-to-date-public-enemy-ceo"
}