{
  "title": "Grimwood",
  "description": "‘Funny, anarchic, original and gloriously silly.’ Richard Osman‘Ted and Nancy are my favourite funny foxes EVER.’ Liz Pichon, author of \nTom Gates\nLaugh your head off with this fully-illustrated new series from award-winning Nadia Shireen. Perfect for readers age 7 to 107, fans of Dog Man, Roald Dahl, Mr Gum and David Walliams, and anyone who loves to laugh.   Fox cub siblings Ted and Nancy are on the run from Princess Buttons, the scariest street cat in the Big City. They flee for Grimwood, expecting to find refuge in the peaceful countryside.  Instead, they are met with thieving eagles, dramatic ducks, riotous rabbits and a whole host of unusual characters. Grimwood is . . . weird. But when Princess Buttons tracks them down, Nancy and Ted and the animals of Grimwood must unite in a mind-bending race against time . . .   This memorable, distinctive and warm-hearted comedy series will have kids begging to read more.   Nadia Shireen has won awards for her picture books including the UKLA Book Award for Good Little Wolf, and her latest, Barbara Throws a Wobbler, has been described as a ‘little doorway of joy’ by Caitlin Moran. She’s also been shortlisted for the Roald Dahl Funny Prize and the Waterstones Children's Book Prize, and has been Writer-Illustrator in Residence for BookTrust. Grimwood is her first series for older readers.PRAISE FOR GRIMWOOD: 'Gloriously anarchic, properly funny and highly illustrated with dynamic black-and-white art, this is a quirky delight for children – and their parents, too.'   ? \nThe Bookseller\n 'Dark, original and laugh-out-loud funny' -- \nThe Times\n 'This book made my face hurt! Relentlessly funny.' -- Rob Biddulph 'Like Watership Down, but funny. You’ll laugh hysterically on every page.' -- Caitlin Moran 'Fantastic.' -- Lauren Laverne 'Pure genius!' -- Louie Stowell 'Made us laugh out loud.' -- Jim Smith, author of Barry Loser 'You’re in for a treat!' -- Selom Sunu, illustrator of Look Both Ways 'Utterly HILARIOUS' -- Sophy Henn, author-illustrator of Pizazz  PRAISE FOR NADIA SHIREEN: 'Shireen’s latest book confirms her as one of the brightest and best picture book creators working in Britain today ... Sensational.' - \nObserver",
  "genres": [
    "Childrens",
    "Humor",
    "Middle Grade",
    "Animals",
    "Graphic Novels",
    "Chapter Books",
    "Juvenile"
  ],
  "author": "Nadia Shireen",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/60696440-grimwood"
}