{
  "title": "You & Me",
  "description": "A single dads, friends-to-lovers, bi awakening MM Romance.We're a puzzle made of two pieces.Landon Larsen is the envy of all the dads in Last Waters, Texas. He's cool, confident, and put together. He and his son—the high school's all-star quarterback—have the perfect father-son relationship. He’s such a Super Dad, it's almost sickening.I'm not cool, or confident, and my relationship with my son couldn't be worse. He's barely speaking to me, and a year after my wife died, we're both clinging to the wreckage of our family.Landon's son and mine are best friends and—of course—Landon is the football Team Dad. And though I know nothing about football, Landon convinces me to volunteer to be closer to my son. Volunteering might give him and me a chance to rebuild what's broken between us. Now I'm spending all my free time with the team—and with Landon—and the more we're together, the deeper our friendship grows. My son is opening up, too, little by little. I think I’m getting him back.There's just one giant problem.I'm head over heels for Landon.I've never been attracted to men in my life… until him. Landon draws me in without even trying, and the harder I fight this, the deeper I fall.Crushing on my son's best friend's father must be my biggest parenting failure ever, but I can't get enough of Landon. Falling for him puts each fragile moment I've rebuilt with my son at risk. What would he think if he knew I craved his best friend's dad? I'm playing with fire, but I can't turn off these feelings Landon has unlocked inside of me.Of course, a guy like Landon could never fall for someone like me. It's pointless to even imagine we could be something together.So why did I just kiss him?***You & Me is a single dads, friends-to-lovers, bi awakening MM romance, full of dads and their exasperating teenage sons, high school sports shenanigans, and #FoundFamily. Come for the epic love, stay for the forever feels.",
  "genres": [
    "M M Romance",
    "Romance",
    "Friends To Lovers",
    "LGBT",
    "Contemporary",
    "Sports",
    "Contemporary Romance"
  ],
  "author": "Tal Bauer",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/60695252-you-me"
}