{
  "title": "Unspeakable: Surviving My Childhood and Finding My Voice",
  "description": "Using the written word as her witness statement, Jessica Willis Fisher gives a lacerating portrait of a girl finding her voice after years of being silenced and an unforgettable story of risk and faith. Growing up the eldest daughter in a large, highly controlled, fundamentalist Christian household, Jessica Willis was groomed to perform, and to conform to her father's disturbing and chaotic teachings. Cut off from anything unapproved by her father, Jessica was persistently curious about the outside world, always wondering what was normal or potentially dangerous about her upbringing. When the Willis family rocketed into fame after their appearances on multiple televised talent competitions in 2014, Jessica and her family landed their own reality TV show and toured across the globe, singing and dancing for millions. The world loved this beautiful family of kids; young and vivacious, the Willis's presented themselves to be extraordinary and happy. But the older and wiser Jessica got, the more she had to face that what was going on behind closed doors would forever be escalating. In this elegant, harrowing story of the manipulation and codependency that defines abusive family relationships, Jessica Willis Fisher lets us see the formative moments of her childhood through her eyes. Fisher's haunting coming-of-age memoir captures the beauty and ugliness of a young woman finding her way—filled with longing, fear, confusion, secrecy, and most importantly, hope for the future. Surviving My Childhood and Finding My Voice Beautifully written and monumental in its bravery, Fisher's story is proof that we can all become so much more that the things that happen to us.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Religion",
    "Biography Memoir",
    "True Crime"
  ],
  "author": "Jessica Willis Fisher",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/60693502-unspeakable"
}