{
  "title": "Something Old, Something New",
  "description": "Sometimes treasure can be found where you least expect it.In the decade since high school graduation, Christine Sawyer has realized her dream of opening Treasure Hunting Antique Mall, the place where shoppers find gems that are new to them. Between her store, her house, and her role as a doting aunt, she’s happy with her life—if a bit lonely. But she’s used to being less lucky in love than her fraternal twin sister. Britney was always the popular one, the head cheerleader who dated the homecoming king and quarterback, while Christine stayed in the shadows.Brent Nicholson is still trying to come to grips with the shambles his life has become. After leading his football team to a state championship, he suffered a career-ending injury. Now he’s lost his construction business thanks to his so-called best friend. So when his great-aunt Midge asks for his help readying her home to put it on the market, the opportunity to spend time with his biggest fan is a balm to his bruised soul.But the antiques Brent finds in his aunt’s house lead him to an unexpected partnership with Christine. After being blind to her for so many years, is it too late for the former high school jock to win the heart of the self-proclaimed “nerdy twin”?As they shift through items of the past, Christine and Brent learn to let go of the pieces they don’t want to bring into the future—and realize the value of what’s in front of them today.“Hometown charm and swoon-worthy second chances make this a must read.” —Kristen Mckanagh, author of Snowball’s ChristmasSweet, stand-alone contemporary romanceBook length: approximately 90,000 wordsIncludes discussion questions for book clubsMore contemporary romance to love by Amy Clipston:?The Heart of Splendid Lake and The View from Coral Cove",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Chick Lit",
    "Christian Romance"
  ],
  "author": "Amy Clipston",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/60693376-something-old-something-new"
}