{
  "title": "Crashing Box Set",
  "description": "This is the boxed set of the first three books in the Samantha Wayland’s Crashing Series. This is sexy, slightly kinky romance series with no cheating, no cliffhangers, and all the HEA anyone could want.Crashing the NetDumping gallons of lube on the new kid is just another day at the office for Alexei. He knows exactly who he is: a goalie on the ice, a prankster in the locker room, and a man who knows better than to share his private life with anyone. He’s let people in before and it’s taught him that if he can’t have what he really wants, it’s better to be alone.Mike is broke, bruised, and covered from head to toe in cheap lube. All he wants is to keep to himself and play for the Ice Cats. What he needs, though, is another matter entirely.Checking It TwiceAfter four years with Alexei, there are things Mike knows with absolute certainty: he loves Alexei, Alexei loves him, and Alexei gives the very best gifts. This Christmas is no exception, though Mike is having a hell of a time figuring out what, exactly, Alexei’s gift is.Alexei knows his gift this year is going to blow Mike’s mind, but in the meantime, it’s pretty hilarious watching Mike try to figure out what it is. Granted, Alexei does have a lot of surprises in store for Mike this week, and it sure as hell isn’t frankincense and myrrh.Changing the RulesAlexei and Mike have been together a long time. They’re getting married. They can go a few nights not sleeping next to each other, right? For the sake of the team, Alexei is going to try.Mike can’t stand not sleeping next to Alexei, and it turns out sleep deprivation makes him overthink things he wasn’t planning to think about at all until the off-season—like the fact they’ve been engaged for over a year and haven’t set a date.",
  "genres": [
    "Audiobook",
    "M M Romance",
    "Hockey",
    "M M Contemporary",
    "Sports"
  ],
  "author": "Samantha Wayland",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/60692729-crashing-box-set"
}