{
  "title": "Pregnancy Nutrition",
  "description": "Congratulations and welcome to parenthood. Your body has gone through a lot these past nine months and it still has a while to go before it is back to normal. The next few months are going to give you and your body a whole new set of challenges especially if you are a first time parent. Recovering from childbirth is exhausting and when you throw a new baby who has no concept of time into the mix and you might find your head spinning. Eating well during this time is almost as important as eating well during your pregnancy. Your body has just been through a traumatic ordeal. If you gave birth vaginally, you mind find yourself recovering from tears and what not. If you gave birth via c-section, you are recovering from major surgery. The first thing most hospitals and doctors like to make sure is that your plumbing and waste systems are working. Eating high fiber food and drinking lots of water after your delivery will help make that first bowel movement a lot less painful. This can be a little hard for women who delivery via c-section because they are usually on a liquid diet for the first 24 hours. You may find you need a little help from either stool softeners or prune juice to make that first trip a little easier. Once you are home from the hospital, you are going to need your energy to take care of the baby. Gone are the nights where you were able to get a full 8 hours of sleep. You might not see that again for at least three months, though ask any parent and they will tell you that getting 8 hours of sleep a night will not happen until your kids are grown and married. Sleep deprivation can wreak havoc on you and it is important that you eat healthy to maintain a decent amount of energy. The postpartum period is usually where most women find themselves downing countless amounts of coffee or sugary foods to give them a quick fix. This is not healthy because once you come down from that high, you are going to be even more exhausted than you were before hand. Make sure all of your meals are balanced meals and stock up on quick and healthy snacks such as celery sticks, baby carrots and lots of fruit to get you through the day. Eating healthy can also help you fight the baby blues those first few weeks. Nearly 80% of all women suffer from baby blues. These usually kick in between the 4th and 5th day after delivery and can last for 10 days to 2 weeks. You may find yourself emotional for no reason and you may start to cry for no reason. Some women report a feeling of sadness that they are no longer pregnant and others report a feeling of helplessness when it comes to dealing with their new baby. The baby blues are caused by your hormone levels going back to normal. By maintaining your healthy habits that you practiced during your pregnancy could help you handle your changing emotions a little better. Pregnancy is tough and the post partum period is just as tough. Make sure you take the best care of yourself as possible during this time. Eat right and continue to take your prenatal vitamin to make sure your baby is going to get the best care you are capable of.",
  "genres": [],
  "author": "Samantha Joe Smith",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/60689228-pregnancy-nutrition"
}