{
  "title": "The Disappearance of Irene Dos Santos",
  "description": "Internationally acclaimed author Margaret Mascarenhas makes her US debut with an exquisite novel set in Venezuela about the search for individual truth, love, and belonging, embodied in a fifteen-year-old girl.Irene dos Santos disappeared at age 15. Believed to have drowned while on holiday with her best friend, Lily Martinez, her body was never found. Now, years later, she appears ghostlike in Lily's dreams, prompting a quest for the truth behind her disappearance. Mysteriously, Lily, eight-months pregnant with her first child, slips and falls on the same day that the statue of Maria Lionza, Patron Saint of their Venezuelan town, cracks in two. Confined to her bed, Lily is surrounded by her family and closest friends, who agree that a Novena to Maria Lionza will guide the baby's spirit safely into the world. Together, through their nine nights of prayer, each offers a story to entertain Lily and her baby. What emerges is a vivid picture of Venezuela during a time of revolution and uncertainty-and the unraveling of the mystery behind Irene dos Santos.\"The Disappearance of Irene Dos Santos is an intricately woven tale of love and memory from a deeply talented writer.\" -- Laila Lalami, author of Hope and Other Dangerous Pursuits and Secret Son\"Mascarenhas uses a 15-year-old girl's disappearance to spin a multilayered history of a Venezuelan family, incorporating folklore, political intrigue and magical realism...This family epic is immersive; no character or event is left unexplored from multiple perspectives. Indeed, the conclusion is like the final piece of an intricate puzzle.\" -- Publishers Weekly",
  "genres": [
    "Fiction",
    "Mystery",
    "Book Club",
    "Contemporary",
    "Friendship",
    "Magical Realism",
    "Novels"
  ],
  "author": "Margaret Mascarenhas",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/6072168-the-disappearance-of-irene-dos-santos"
}