{
  "title": "Llamadas telefónicas",
  "description": "Decía Hemingway que un buen relato debe ser como un iceberg; lo que se ve es siempre menos que lo que queda oculto bajo el agua, y otorga intensidad, misterio, fuerza y significación a lo que flota en la superficie. Los cuentos de este libro cumplen con tal premisa, pero también se sustentan en una afirmación que hace el autor en uno de ellos: la cultura es la realidad. Y asi es, al menos en su territorio literario: relatos abiertos, nada previsibles, donde lo que esta mas allá de la historia que se cuenta -siempre apasionante-, el enigma que hay que desvelar, subyace a lo escrito; donde en cada uno de ellos hay una figura inscrita en la trama del tapiz que hay que descubrir, una figura en la que realidad y ficción se imitan la una a la otra. Sensini, un viejo escritor sudamericano exiliado - y aquí aparecen las sombras de Onetti y de Moyano, entre otros -, ensena a otro escritor mas joven, también expatriado, la picaresca de los premios literarios de provincias... Joanna Silvestri, antigua diva del cine porno, nos habla de su relación con Jack, uno de sus partenaires, y no podemos sino recordar a uno de los mas celebres actores de este circuito, que murió hace pocos anos de sida tras una vida bastante enigmática... Henry Simon Leprince, o la peripecia, en tiempos convulsos, de un escritor sin talento pero poseído por la literatura... El gusano es, sentado en uno de los bancos de La Alameda, en México, un hombre que va siempre armado, que habla todas las lenguas de los indios mexicanos, que un día dice venir de un pueblo de asesinos y fascina a un adolescente que ha comenzado a desertar de una vida convencional... William Burns, un americano tranquilo de California del sur, se ve envuelto en una historia de relaciones triangulares, asesinatos equivocados... Relatos que remiten a otros relatos, a otros escritores, a otras historias, a películas, la obra de un fabulador que, como afirmo un crítico, mantiene un constante dialogo con la tradición literaria más inteligente.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Spanish Literature",
    "Literature",
    "Latin American Literature",
    "Latin American",
    "Contemporary"
  ],
  "author": "Roberto Bolaño",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/607046.Llamadas_telef_nicas"
}