{
  "title": "The Book Boyfriend",
  "description": "Escape with the Meet Cute Book Club, where meet cutes don't happen only between the pages of romance novels, and one by one, all the members find their own happily ever afters.MilaI never thought I’d have a real-life meet cute, but the minute Crossland Parker walks into my life, it starts feeling like I’m living in the pages of a romance novel.He sweeps me off my feet, and I find myself calling fast and hard for the rough around the edges mechanic. He’s a troubled bad boy with a heart of gold. Cross fits into my life effortlessly, even sharing my love of books. He’s everything I didn’t know I wanted in a man. Attentive, sweet, a little bit possessive. He’s also my biggest source of support when I decide I want to buy the building next door so I can expand my business. So what if he has a criminal record? No one is perfect.Unless you ask my stepfather. He expects nothing less than perfection, but not even I could ever come close.CrossAfter spending too many years wandering when I was released from prison, I came back to Abbott Ridge to start over.I wasn’t expecting Mila Santos to fall into my arms, but I’m irrevocably drawn to the curvy little beauty who owns the bookstore. She’s a good girl, too good for a guy like me.Our relationship develops faster than most, but I spent too many years of my life locked up. Now that I’m out, I refuse to waste a single second. I’m still not sure I deserve someone as sweet as Mila, but if she accepts me and all my faults, there’s no way I’m letting her go. Only a fucking fool would do that.My past is no secret, and I knew the day would come when someone would try to use it against me. I just didn’t expect it to happen so soon.Will the good girl get her happily ever after when she falls for the guy from the wrong side of the tracks?The Book Boyfriend is a standalone, wrong side of the tracks romance that is part of the Meet Cute Book Club multi-author series.",
  "genres": [
    "Contemporary",
    "Romance",
    "Contemporary Romance",
    "Humor"
  ],
  "author": "Kate Stacy",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/60720958-the-book-boyfriend"
}