{
  "title": "The Red Book",
  "description": "The Big Chill meets The Group in Deborah Copaken Kogan’s wry, lively, and irresistible new novel about a once-close circle of friends at their twentieth college reunion.  Clover, Addison, Mia, and Jane were roommates at Harvard until their graduation in 1989. Clover, homeschooled on a commune by mixed-race parents, felt woefully out of place, both among the East Coast elite and within the social milieu of her prep-schooled beau, Bucky. Addison yearned to shed the burden of her Mayflower heritage, finding escape in both art and in the arms of another woman. Mia mined the depths of her suburban ennui to enact brilliant performances on the Harvard stage, including a heartrending turn as Nora in A Doll’s House. Jane, an adopted Vietnamese war orphan, made sense of her fractured world through words, spending long hours as an editor at the Crimson. Twenty years later, all their lives are in free fall. Clover, once a securities broker with Lehman, is out of a job and struggling to reproduce before her fertility window slams shut. Addison’s marriage to a writer’s-blocked novelist is as stale as her so-called career as a painter, as troubled as her children’s psyches, and as mismanaged as her trust fund. Hollywood shut its gold-plated gates to Mia, who now stays home with her four children, renovating and acquiring faster than her director husband can pay the bills. Jane, the Paris bureau chief for a newspaper whose foreign bureaus are now shuttered, is caught in a vortex of loss, having lost her journalist husband—the father of her young child—to war, her adoptive mother to cancer, and quite possibly her current partner due to an errant email. Like all Harvard grads, they’ve kept abreast of one another via the red book, a class report published every five years, containing brief autobiographical essays by fellow alumni. But there’s the story we tell the world, and then there’s the real story, as these former classmates will learn during their twentieth reunion weekend, when they arrive with their families, their histories, their dashed dreams, and their secret yearnings to a relationship-changing, score-settling, unforgettable weekend.",
  "genres": [
    "Fiction",
    "Book Club",
    "Chick Lit",
    "Contemporary",
    "Friendship",
    "Relationships",
    "Literary Fiction"
  ],
  "author": "Deborah Copaken Kogan",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/12874448-the-red-book"
}