{
  "title": "360 Degrees Longitude: One Family's Journey Around the World",
  "description": "Much more than a travel narrative 360 Degrees Longitude: One Family’s Journey Around the World is a glimpse at what it means to be a “global citizen”—a progressively changing view of the world as seen through the eyes of an American family of four. After more than a decade of planning, John Higham and his wife September bid their high-tech jobs and suburban lives good-bye, packed up their home and set out with two children, ages eight and eleven, to travel around the world. In the course of the next 52 weeks they crossed 24 time zones, visited 28 countries and experienced a lifetime of adventures. Making their way across the world, the Highams discovered more than just different foods and cultures; they also learned such diverse things as a Chilean mall isn’t the best place to get your ears pierced, and that elephants appreciate flowers just as much as the next person.  But most importantly, they learned about each other, and just how much a family can weather if they do it together.\n360 Degrees Longitude\n employs Google’s wildly popular Google Earth as a compliment to the narrative. Using your computer you can spin the digital globe to join the adventure cycling through Europe, feeling the cold stare of a pride of lions in Africa, and breaking down in the Andes.  Packed with photos, video and text, the online Google Earth companion adds a dimension not possible with mere paper and ink.  Fly over the terrain of the Inca Trail or drill down to see the majesty of the Swiss Alps—without leaving the comfort of your chair.John Higham is an aerospace engineer with an expertise in satellites. He is also an avid traveler, frequently writing and lecturing on his own experience traversing the globe. The Highams live in the San Francisco Bay Area. Visit him online at www.360DegreesLongitude.com.The Voyages of Tim Vetter interviews 360 author John Higham about what it is like to travel with children, his bucket list and what he and his family have been up to since traveling around the world. Available at http://bit.ly/podcast360 or on search for \"360 Degrees Longitude\" on your favorite podcast store.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Adventure",
    "Education",
    "Parenting"
  ],
  "author": "John Higham",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/6071068-360-degrees-longitude"
}