{
  "title": "Lead Me Here",
  "description": "Secrets are a recipe for disaster, even for relationships that only last four days. ♥ ♥ ♥They say time heals all wounds, but what if unintentional secrets are involved? Or more accurately, unintentional secret babies.I tried to find him—I really did—but what was I to do with nothing more than a first name? After we spent four amazing days together, he left me a note with what I can only assume was his full name and phone number, but his handwriting is like chicken scratch. It also didn’t help that my roommate decided to do me a solid and washed all my clothes before I had a chance to clean out my pockets. Needless to say, the note didn’t survive. Now, four and a half years later, I find myself standing in front of the same grumpy stranger that changed my life forever. Now, I’m about to change his because he has no idea, he has a three-year-old daughter. ♥ ♥ ♥Agreeing to keep our identities a secret may have been the dumbest idea ever, especially considering the consequences of four wild and perfectly wonderful nights together. When our time together came to an end, we went our separate ways, and I never saw him again. Fast forward four and a half years and imagine my surprise to discover he’s my new landlord. Lead Me Here is a dual POV steamy full-length STANDALONE romance filled with lots of sexy times in the bedroom, profanity, and love with a HEA ending!♥ ♥ ♥Author Notes: Fans of Claire Kingsley, Melanie Harlow, Lauren Landish, and Amy Daws will love this new series by Aria Bliss. Get ready to stay up all night laughing, crying, and swooning because this series has it all. A short-lived, yet unforgettable love affair that resulted in a secret child between a sexy, grumpy, closeted romantic and a sunny, optimistic woman who stole his heart. This one has all the feels and enough steam to fog up your windows.The books in A Drunk Love Romantic Comedy series are all standalone novels and can be read in any order. But if you love family drama and the subtle build of future romances, I suggest you read them in order, starting with Not For Me.",
  "genres": [
    "Second Chance",
    "Contemporary"
  ],
  "author": "Aria Bliss",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/60737882-lead-me-here"
}