{
  "title": "Merciless",
  "description": "On a frigid December night, Karen sits at the edge of Philadelphia’s Schuylkill River, dressed in a flowing gown, like a visitor from the distant past. A beautiful and shining young woman, she gazes up at a bone-white winter moon like a fairy-tale princess frozen in time. At first glance, one might not even notice that she is dead, coated in a glistening patina of ice.Homicide cops Kevin Byrne and Jessica Balzano take the lead on the case, uncovering a plethora of eerie clues–each more warped and spine-chilling than the last. Yet the identity of Karen’s pitiless killer remains a mystery. Then the next victim is found upriver at an abandoned waterworks, posed with an unlikely object in her clasped hands. Struggling to link the victims and make sense of the madman’s agenda, Byrne and Balzano follow his twisted trail, which stretches into a past of dark crimes forgotten by all but a few.Now the past roars back into the present with a vengeance as the ingenious killer unleashes a torrent of rage upon the streets of Philadelphia. As Byrne and Balzano sift through suspects and clues, they unearth a shocking secret a legacy of malevolence and cold-blooded retribution dating back twenty years. And the farther they make their way up the body-strewn banks of the Schuylkill River, the closer they get to a villain from their worst nightmare, an evil as patient as it is merciless.Lightning fast and razor sharp, this jolting thriller from acclaimed author Richard Montanari coils back in time to deliver a fiendish mystery, a shattering revelation, and one hell of a wild ride. Lock your doors and turn up the lights. Montanari’s terrifying bedtime story will keep you up all night.",
  "genres": [
    "Crime",
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Richard Montanari",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1287516.Merciless"
}