{
  "title": "Being Indigenous in Jim Crow Virginia: Powhatan People and the Color Line",
  "description": "Virginia’s Racial Integrity Act of 1924 recodified the state’s long-standing racial hierarchy as a more rigid Black-white binary. Then, Virginia officials asserted that no Virginia Indians could be other than legally Black, given centuries of love and marriage across color lines. How indigenous peoples of Virginia resisted erasure and built their identities as Native Americans is the powerful story this book tells. Spanning a century of fraught history, Being Indigenous in Jim Crow Virginia describes the critical strategic work that tidewater Virginia Indians, descendants of the seventeenth-century Algonquian Powhatan chiefdom, undertook to sustain their Native identity in the face of deep racial hostility from segregationist officials, politicians, and institutions. Like other Southeastern Native groups living under Jim Crow regimes, tidewater Native groups and individuals fortified their communities by founding tribal organizations, churches, and schools; they displayed their Indianness in public performances; and they enlisted whites, including well-known ethnographers, to help them argue for their Native distinctness. Describing an arduous campaign marked by ingenuity, conviction, and perseverance, Laura J. Feller shows how these tidewater Native people drew on their shared histories as descendants of Powhatan peoples, and how they strengthened their bonds through living and marrying within clusters of Native Virginians, both on and off reservation lands. She also finds that, by at times excluding African Americans from Indian organizations and Native families, Virginian Indians themselves reinforced racial segregation while they built their own communities. Even as it paved the way to tribal recognition in Virginia, the tidewater Natives’ sustained efforts chronicled in this book demonstrate the fluidity, instability, and persistent destructive power of the construction of race in America.",
  "genres": [
    "History"
  ],
  "author": "Laura J Feller",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/60735855-being-indigenous-in-jim-crow-virginia"
}