{
  "title": "Hide Me Among the Graves",
  "description": "London, winter of 1862, Adelaide McKee, a former prostitute, arrives on the doorstep of veterinarian John Crawford, a man she met once seven years earlier. Their brief meeting produced a child who, until now, had been presumed dead. McKee has learned that the girl lives--but that her life and soul are in mortal peril from a vampiric ghost. But this is no ordinary spirit; the bloodthirsty wraith is none other than John Polidori, the onetime physician to the mad, bad, and dangerous Romantic poet Lord Byron. Both McKee and Crawford have mysterious histories with creatures like Polidori, and their child is a prize the malevolent spirit covets dearly.Polidori is also the late uncle and supernatural muse to the poet Christina Rossetti and her brother, the painter Dante Gabriel Rossetti. When she was just fourteen years old, Christina unwittingly brought Polidori's curse upon her family. But the curse bestowed unexpected blessings as well, inspiring Christina's poetry and Gabriel's paintings. But when Polidori resurrects Dante's dead wife--turning her into a horrifying vampire--and threatens other family members, Christina and Dante agree that they must destroy their monstrous uncle and break the spell, even if it means the end of their creative powers.Determined to save their daughter, McKee and Crawford join forces with the Rossettis, and soon these wildly mismatched allies are plunged into a supernatural London underworld whose existence goes beyond their wildest imaginings. Ultimately, each of these disparate individuals--the sensitive poet, the tortured painter, the straitlaced animal doctor, the reformed prostitute, and even their Artful Dodger-like young daughter--must choose between the banality and constraints of human life and the unholy immortality that Polidori offers.Sweeping from the mansions of London's high society to its grimy slums, the elegant salons of the West End to the pre-Roman catacombs beneath St. Paul's Cathedral, \"Hide Me Among the Graves\" blends the historical and the supernatural in a dazzling, edge-of-your-seat thrill ride--a modern horror story with a Victorian twist.",
  "genres": [
    "Fantasy",
    "Horror",
    "Historical Fiction",
    "Fiction",
    "Vampires",
    "Historical",
    "Paranormal"
  ],
  "author": "Tim Powers",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/12875147-hide-me-among-the-graves"
}