{
  "title": "The Haunting of Autumn Lake",
  "description": "The breathtaking romantic sequel to The Visions of Ransom Lake!Excerpt:Autumn Lake stopped cold in her tracks. She puffed a breath of summoning courage as she gazed at the old covered bridge before her. Ever since she was a child and Sawyer had read to her the fascinating yet thoroughly haunting story of The Legend of Sleepy Hollow by Mr. Washington Irving, Autumn had secreted a fear of bridges. Each time she was meant to cross a bridge (especially the old covered bridge on the far side of the orchards), she expected the ghostly headless horseman to appear and attempt to decapitate her. Oh, certainly the tale of the Specter did nothing to soothe her either, for it was said that this was to be a year of the Specter. As the story went, the local phantom, the Specter, only appeared once every ten years—but this was to be the year of the Specter, and Autumn did not like crossing bridges even when it was not a year of the Specter.Gulping down her fear, however, Autumn glanced behind her, assuring herself that there was no headless horseman riding up behind her intent on stealing her head.“He wouldn’t want a woman’s head anyway,” she mumbled to herself, even as rising fear caused her heart to pound in her chest. “And besides,” she said, looking back to the old bridge, “I’m eighteen years old…nineteen in less than a month. Surely I can cross the bridge without runnin’.”Pulling her sketchbook to her chest and tightly folding her arms across it, she spoke aloud to the cattails. “Wish me luck, my darlings…for I do prefer to keep my head attached to the rest of me.”As Autumn stepped onto the bridge, the roof blocked the warm sunshine, making the space inside the bridge dark and gloomy. Yet she’d expected this. What else would one expect of a covered bridge? After all, its very purpose was protection from the elements, and that included the heat of the summer sun. Naturally, Autumn preferred to think of its purpose as being made for something else—the seclusion necessary for the romance of lovers’ trysts.She sighed with disenchantment for a moment—disappointment at never having had a lover of her own. She thought how different it would be to cross the old bridge if her arm were linked to that of a strong and handsome lover. Still, she had no lover, and the fact remained that she must indeed cross the bridge.",
  "genres": [
    "Romance",
    "Clean Romance",
    "Westerns",
    "Historical Romance",
    "Historical Fiction",
    "Fiction",
    "Mystery"
  ],
  "author": "Marcia Lynn McClure",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/12875016-the-haunting-of-autumn-lake"
}