{
  "title": "Our Vengeful Souls",
  "description": "When magical mermaid Sereia saves her little sister and overshadows brother and rightful heir, Triton, the position of next ruler of the sea is in question. Determined to keep his throne, Triton curses Sereia, transforming her into a human and stripping her of magic. Banishing her from their underwater kingdom, he gives her a final warning: if you should ever return, you will become a monster.Left for dead, Sereia washes up on the shores of Atlantis, discovered by a kind merchant with a tragic past. Patient and charming, he helps her build a life on land, leaving her realizing that everything she was taught about humans may have been wrong. But legends are powerful forces, and mermaids are burned for their magic by humans who fear their power. Sereia is forced to keep her true identity a secret, even as her feelings for her savior deepen. Channeling her skill with a blade, she finds a place within the ranks of the Atlantean army, finally giving her the chance to become the respected warrior she always desired. During her training, however, she discovers the legend of a trident of equal power to her father’s exists, and is within her grasp in Atlantis. With a way back to the sea in her grasp, she wavers between the pull of revenge and the possibility of love on land, all under the hateful eye of a vengeful enemy within her ranks. But when the fate of a friend is in the balance, she must make the hardest decision of all: be burned at the stake as a witch, or turn into a monster should she return to the sea.In line with the classic fairy tale The Little Mermaid (Hans Christian Anderson) and the mythological adventure Lore (Alexandra Bracken), Our Vengeful Souls takes you on a journey of loss, love and vengeance, into the life of one of fairy tales most famous villains.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Retellings",
    "Mermaids",
    "Fiction",
    "Mythology",
    "Fairy Tales"
  ],
  "author": "Kristi McManus",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/60739614-our-vengeful-souls"
}