{
  "title": "Waco Rising: David Koresh, the FBI, and the Birth of America's Modern Militias",
  "description": "Named one of The New Yorker's \"Best Books of 2023\"A news-making account of the war between David Koresh’s Branch Davidians and the FBI, and how their standoff launched today’s militiasIn 1993, David Koresh and a band of heavily armed evangelical Christians took on the might of the US government. A two-month siege of their compound in Waco, Texas, ended in a firefight that killed seventy-six, including twenty-five children. America is still picking up the pieces, and we still haven’t heard the full story.Kevin Cook, who revealed the truth behind a mythic, misunderstood murder in his 2014 Kitty Genovese, finally provides the full story of what happened at Waco. He gives readers a taste of Koresh’s deadly charisma and takes us behind the scenes at the Branch Davidians’ compound, where “the new Christ” turned his followers into servants and sired seventeen children by a dozen “wives.” In vivid accounts packed with human drama, Cook harnesses never-reported material to reconstruct the FBI’s fifty-one-day siege of the Waco compound in minute-to-minute detail. He sheds new light on the Clinton administration’s approval of a lethal governmental assault in a new, definitive account of the firefight that ended so many lives and triggered the rise of today’s militia movement. Waco drew the battle lines for American extremists—in Oklahoma City bomber Timothy McVeigh’s words, “Waco started this war.” With help from sources as diverse as Branch Davidian survivors and the FBI’s lead negotiator during the siege, Cook draws a straight line from Waco’s ashes to the January 6, 2021, riot at the US Capitol and insurrections yet to come.Unmissable reading for anyone interested in the truth of what happened in Texas three decades ago, Waco Rising is chillingly relevant today. Here is the spark that ignited today’s antigovernment militias.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Politics",
    "Audiobook",
    "Cults",
    "Religion"
  ],
  "author": "Kevin Cook",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/60741802-waco-rising"
}