{
  "title": "Sleep No More",
  "description": "Jayne Ann Krentz returns with the first novel of the Lost Night Files, an exciting new romantic suspense trilogy about a night that changed three women forever—but that none of them can remember. Seven months ago, Pallas Llewellyn, Talia March, and Amelia Rivers were strangers, until their fateful stay at the Lucent Springs Hotel. An earthquake and a fire partially destroyed the hotel, but the women have no memory of their time there. Now close friends, the three women co-host a podcast called the Lost Night Files, where they investigate cold cases and hope to connect with others who may have had a similar experience to theirs—an experience that has somehow enhanced the psychic abilities already present in each woman. After receiving a tip for their podcast, Pallas travels to the small college town of Carnelian, California, to explore an abandoned asylum. Shaken by the dark energy she feels in the building, she is rushing out when she’s stopped by a dark figure—who turns out to be the women’s mysterious tipster. Ambrose Drake is certain he’s a witness to a murder, but without a body, everyone thinks he’s having delusions caused by extreme sleep deprivation. But Ambrose is positive something terrible happened at the Carnelian Sleep Institute the night he was there. Unable to find proof on his own, he approaches Pallas for help, only for her to realize that Ambrose, too, has a lost night that he can’t remember—one that may be connected to Pallas. Pallas and Ambrose conduct their investigation using the podcast as a cover, and while the townsfolk are eager to share what they know, it turns out there are others who are not so happy about their questions—and someone is willing to kill to keep the truth from coming out.",
  "genres": [
    "Romance",
    "Paranormal",
    "Mystery",
    "Romantic Suspense",
    "Suspense",
    "Audiobook",
    "Thriller"
  ],
  "author": "Jayne Ann Krentz",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/60753741-sleep-no-more"
}