{
  "title": "Financial Feminist: Overcome the Patriarchy's Bullsh*t to Master Your Money and Build a Life You Love",
  "description": "From the globally-recognized personal finance educator and social media star behind Her First $100K, an inclusive guide to all things money--from managing debt to investing and voting with your dollarsTori Dunlap was always good with money. As a kid, she watched her prudent parents balance their checkbook every month and learned to save for musical tickets by gathering pennies in an Altoids tin. But she quickly discovered that her experience with money was pretty unusual, especially among her female friends.It wasn't our fault. Investigating this financial literacy and wealth gap, Tori found that girls are significantly less likely to receive a holistic financial education; we're taught to restrain our spending, while boys are taught about investing and rewarded for pursuing wealth. In adulthood, women are hounded by the unfounded stereotype of the frivolous spenders whose lattes are to blame for the wealth gap. And when something like, say, a global pandemic happens, we're the first to have jobs cut and the last to re-enter the workforce. It's no wonder money is a source of anxiety and a barrier to equality for so many of us.But what if money didn't mean restriction, and instead, choice? The ability to luxuriously travel, quit toxic jobs, donate to important organizations, retire early? The freedom to live the life you want, and change the world while you do it?Tori founded Her First $100K to teach women to overcome the unique obstacles standing in the way of their financial freedom. In Financial Feminist, she distills the principles of her shame- and judgment-free approach to paying off debt, figuring out your value categories to spend mindfully, saving money without monk-like deprivation, and investing in order to spend your retirement tanning in Tulum.Featuring journaling prompts, deep-dives into the invisible aspects of the financial landscape, and interviews with experts on everything money--from predatory credit card companies to the racial wealth gap and voting with your dollars--Financial Feminist is the ultimate guide to making your money work harder for you (rather than the other way around.)",
  "genres": [
    "Nonfiction",
    "Finance",
    "Self Help",
    "Feminism",
    "Audiobook",
    "Money",
    "Personal Finance"
  ],
  "author": "Tori Dunlap",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/60746476-financial-feminist"
}