{
  "title": "Biting the Hand: Growing Up Asian in Black and White America",
  "description": "Julia Lee is angry. And she has questions.What does it mean to be Asian in America? What does it look like to be an ally or an accomplice? How can we shatter the structures of white supremacy that fuel racial stratification?When Julia was fifteen, her hometown went up in smoke during the 1992 Los Angeles riots. The daughter of Korean immigrant store owners in a predominantly Black neighborhood, Julia was taught to be grateful for the privilege afforded to her. However, the acquittal of four white police officers in the beating of Rodney King, following the murder of Latasha Harlins by a Korean shopkeeper, forced Julia to question her racial identity and complicity. She was neither Black nor white. So who was she?This question would follow Julia for years to come, resurfacing as she traded in her tumultuous childhood for the white upper echelon of elite academia. It was only when she began a PhD in English that she found answers―not through studying Victorian literature, as Julia had planned, but rather in the brilliant prose of writers like James Baldwin and Toni Morrison. Their works gave Julia the vocabulary and, more important, the permission to critically examine her own tortured position as an Asian American, setting off a powerful journey of racial reckoning, atonement, and self-discovery.With prose by turns scathing and heart-wrenching, Julia lays bare the complex disorientation and shame that stem from this country’s imposed racial hierarchy. And she argues that Asian Americans must work toward lasting social change alongside Black and brown communities in order to combat the scarcity culture of white supremacy through abundance and joy. In this passionate, no-holds-barred memoir, Julia interrogates her own experiences of marginality and resistance, and ultimately asks what may be the biggest question of all―what can we do?",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Race",
    "Audiobook",
    "Social Justice",
    "Asian Literature",
    "Biography Memoir"
  ],
  "author": "Julia       Lee",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/60741783-biting-the-hand"
}