{
  "title": "Light in Gaza: Writings Born of Fire",
  "description": "Imagining the future of Gaza beyond the cruelties of occupation and Apartheid, Light in Gaza is a powerful contribution to understanding Palestinian experience.Gaza, home to two million people, continues to face suffocating conditions imposed by Israel. This distinctive anthology imagines what the future of Gaza could be, while reaffirming the critical role of Gaza in Palestinian identity, history, and struggle for liberation.Light in Gaza is a seminal, moving and wide-ranging anthology of Palestinian writers and artists. It constitutes a collective effort to organize and center Palestinian voices in the ongoing struggle. As political discourse shifts toward futurism as a means of reimagining a better way of living, beyond the violence and limitations of colonialism, Light in Gaza is an urgent and powerful intervention into an important political moment.Table of ContentsMap: Gaza strip and Gaza district before 1948Foreword (Jehad Abusalim, Jennifer Bing, Michael Merryman-Lotze)- Introduction (Jehad Abusalim)- Gaza Asks: When Shall This Pass? (Rafaad Alareer)- On Why We Still Hold Onto Our Phones and Keep Recording (Asmaa Abu Mezied)- Breaking the Vicious Circle of Permanent Temporality (Shahd Abusalama)- Don't Step on My Feet Again (Basman Aldirawi)- Lost Identity: The Tale of Peasantry and Nature (Asmaa Abu Mezied)- Why Are You Still Here? (Basman Aldirawi)- Ethical Implications of Experimental Design on Affected Communities in the Gaza Strip (Salem Al Qudwa)- People's Light In Gaza's Darkness (Suhail Taha) - Artificial Intelligence as a Tool for Restoring Palestinian Rights and Improving the Quality of Life (Nour Naim)- Exporting Oranges and Short Stories: Cultural Struggle in the Gaza Strip (Mosab Abu Toha)- In the Haze of Fifty-One Days (Dorgham Abusalim)- Travel Restrictions as a Manifestation of Nakba: Gazam the Path Backward is the Path Forward (Yousef M. Aljamal)- Let Me Dream (Isram Mohammed Jamal)- Gaza 2050: Three Scenarios (Basman Aldirawi)- A Rose Shoulders Up (Mosab Abu Toha)NotesIndex",
  "genres": [
    "Nonfiction",
    "History",
    "Poetry",
    "Politics",
    "Short Stories",
    "Essays",
    "Social Justice"
  ],
  "author": "Jehad Abusalim",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/60746110-light-in-gaza"
}