{
  "title": "The Hometown Dilemma",
  "description": "JaimeWho says you can't go home?Coming back to Abbott Ridge and starting over was my plan. But, just like everything in life, plans change. Especially when the interior design reality tv show I dreamed of taking part in gets canceled before filming even begins. Now I'm stuck without a job and forced to rethink how I'll start my own company.Insert Wade Dempsey.Owner of Dempsey's bar, and one of my closest friends from college. He immediately offers me a temporary job working with him, like old times. It's an offer I can't refuse. Oh, and did I mention that my new boss is even sexier than I remember?Things between us are going great...until a call from New York presents me with a new offer that has me second guessing my stay in Abbott Ridge.WadeHome is where the heart is.I've spent my whole life in Abbott Ridge, running in and out of my family's bar until I was finally old enough to take over. Now I'm in charge, but it's a struggle to keep the place from going under. I need fresh ideas to compete with all the fancy bars and clubs popping up downtown.Insert, Jaime Harlow.Having Jaime back behind my bar seems like a good place to start. She's an inspiration and a breath of fresh air, in more ways than one.Old times, new feelings - and one stormy night - are all we need to ignite the desires I never realized existed.When New York calls for Jaime and the only future I've known goes up in flames, we find ourselves faced with a huge dilemma that threatens our new found relationship. Can we really make this work when right now it feels like we can't even see eye to eye? There's only one way to find out.The Hometown Dilemma is a standalone, return to hometown romance that is part of the multi-author series, Meet Cute Book Club. Escape with this swoon-worthy collection of romances where meet-cutes don't only happen between the pages of romance novels and members find their own happily ever afters.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Julie Archer",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/60760421-the-hometown-dilemma"
}