{
  "title": "الإمتاع والمؤانسة",
  "description": "لتأليف أبي حيان لهذا الكتاب قصة ممتعة، ذلك أن أبا الوفاء المهندس كان صديقاً لأبي حيّان وللوزير أبي عبد الله العارض، فقرب أبو الوفاء أبا حيّان من الوزير، ووصله به، ومدحه عنده، حتى جعل الوزير أبا حيّان من سُمّاره، فسامره سبعاً وثلاثين ليلة، كان يحادثه فيها، ويطرح الوزير عليه أسئلة في مسائل مختلفة فيجيب عنها أبو حيّان.ثم طلب أبو الوفا من أبي حيّان أن يقص عليه كل ما دار بينه وبين الوزير من حديث فأجاب أبو حيان طلب أبي الوفاء، ونزل على حكمه، وفضل أن يدوّن ذلك ليشتمل على كل ما دار بينه وبين الوزير من دقيق وجليل وحلو ومر، فكان من ذلك كتاب \"الإمتاع والمؤانسة\" والكتاب ممتع على الحقيقة لمن له مشاركة في فنون العلم، فإنه خاض كل بحر، وغاص كل لجّة، وابتدأ أبو حيّان كتابه صوفياً وتوسطه محدثاً، وختمه سائلاً ملحفاً.قسم كتابه إلى ليالٍ، فكان يدون في كل ليلة ما دار فيها بينه وبين الوزير على طريقته قال لي وسألني وقلت له وأجبته. وكان الذي يقترح الموضوع دائماً هو الوزير، وأبو حيّان يجيب عما اقترح. لذا كانت موضوعات الكتاب متنوعة تنوعاً طريفاً لا تخضع لترتيب ولا تبويب، إنما تخضع لخطوات العقل وطيران الخيال وشجون الحديث، حتى لنجد في الكتاب مسائل من كل علم وفن، فأدب وفلسفة وحيوان ومجون وأخلاق وطبيعة، وبلاغة وتفسير وحديث وغناء ولغة وسياسة وتحليل شخصيات لفلاسفة العصر وأدبائه وعلمائه وتصوير للعادات وأحاديث المجالس، وغير ذلك مما يطول شرحه.وفي الكتاب النص الوحيد الذي كشف لنا عن مؤلفي إخوان الصفا، وقد نقله القفطي منه، إذ كان الوزير قد سأل أبا حيّان عن هذه الرسائل ومن ألفها. وأسلوب أبي حيان في الكتاب أسلوب أدبي راقٍ كعهده في سائر كتاباته. ويمكن القول بأنه وإن كان ألف ليلة وليلة تصوّر أبدع تصوير الحياة الشعبية في ملاهيها وفتنها وعشقها، فكتاب الإمتاع والمؤانسة يصوّر حياة الأرستقراطيين أرستقراطية عقلية، كيف يبحثون، وفيما يفكرون، وكلاهما في شكل قصصي مقسم إلى ليال، وإن كان حظ الخيال في الإمتاع والمؤانسة أقل من حظه في ألف ليلة وليلة.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "History",
    "Classics",
    "Literature",
    "Linguistics"
  ],
  "author": "أبو حيان التوحيدي",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6076420"
}