{
  "title": "I Kick and I Fly",
  "description": "A propulsive social justice adventure by renowned activist and award-winning documentarian Ruchira Gupta, I Kick and I Fly is an inspiring, hopeful story of triumph about a girl in Bihar, India, who escapes being sold into the sex trade when a local hostel owner helps her to understand the value of her body through kung fu. On the outskirts of the Red Light District in Bihar, India, fourteen-year-old Heera is living on borrowed time until her father sells her into the sex trade to help feed their family and repay his loans. It is, as she's been told, the fate of the women in her community to end up here. But watching her cousin, Mira Di, live this life day in and day out is hard enough. To live it feels like the worst fate imaginable. And after a run-in with a bully leads to her expulsion from school, it feels closer than ever. But when a local hostel owner shows up at Heera's home with the money to repay her family's debt, Heera begins to learn that fate can change. Destiny can be disrupted. Heroics can be contagious. It's at the local hostel for at risk girls that Heera is given a transformative opportunity: learning kung fu with the other girls. Through the practice of martial arts, she starts to understand that her body isn't a an object to be commodified and preyed upon, but a vessel through which she can protect herself and those around her. And when Heera discovers the whereabouts of her missing friend, Rosy, through a kung fu pen pal in the US, she makes the decision to embark on a daring rescue mission to New York in an attempt to save her. A triumphant, shocking account inspired by Ruchira Gupta's experience making the Emmy-award winning documentary, The Selling of Innocents, this is an unforgettable story of overcoming adversity by a life-long activist who has dedicated her life to creating a world where no child is bought or sold.",
  "genres": [
    "Young Adult",
    "Realistic Fiction",
    "Fiction",
    "India",
    "Contemporary",
    "Social Justice",
    "Asian Literature"
  ],
  "author": "Ruchira Gupta",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/60758307-i-kick-and-i-fly"
}