{
  "title": "Suite Française",
  "description": "Suite Française is both a brilliant novel of wartime and an extraordinary historical document. An unmatched evocation of the exodus from Paris after the German invasion of 1940, and of life under the Nazi occupation, it was written by the esteemed French novelist Irène Némirovsky as events unfolded around her. This haunting masterpiece has been hailed by European critics as a War and Peace for the Second World War.Though she conceived the book as a five-part work (based on the form of Beethoven’s Fifth Symphony), Irène Némirovsky was able to write only the first two parts, Storm in June and Dolce , before she was arrested in July 1942. She died in Auschwitz the following month. The manuscript was saved by her young daughter Denise; it was only decades later that Denise learned that what she had imagined was her mother’s journal was in fact an invaluable work of art.Storm in June takes place in the tumult of the evacuation from Paris in 1940, just before the arrival of the invading German army. It moves vividly between different levels of society–from the wealthy Péricand family, whose servants pack up their possessions for them, to a group of orphans from the 16th arrondissement escaping in a military truck. Némirovsky’s immense canvas includes deserting soldiers and terrified secretaries, cynical bank directors and hapless priests, egotistical writers and hardscrabble prostitutes–all thrown together in a chaotic attempt to escape the capital. Moving between them chapter by chapter, this thrilling novel describes a journey hampered and in some cases abandoned because of confusion, shelling, rumour, lack of supplies, bad luck and ordinary human weakness. Cars break down or are stolen; relatives are forgotten; friends are divided; but there are also moments of love and charity. Throughout, whether depicting saintly forbearance or the basest selfishness, Storm in June neither sweetens nor demonizes its characters; unsentimentally, with stunning perceptiveness, Némirovsky shows the complexities that mean no-one is simply a hero or villain.The second volume, Dolce , is set in the German-occupied village of Bussy. Again, Némirovsky switches seamlessly between social strata, from tenant farmers to the local aristocracy. The focus, however, is on the delicate, secret love affair between a German soldier and the French woman in whose house he has been billeted; the passion, doubts and deceits of their burgeoning relationship echo the complex mixture of hostility and acceptance felt by the occupied community as a whole. Némirovsky is amazingly sensitive in her depiction of changing, often contradictory emotions, but her attention to the personal is matched by her sharp-eyed discussion of small-town life and the politics of occupation. In this myth-dissolving book, the French villagers see the Germans as oppressive warriors, but also as handsome young men, and occupation does nothing to remedy the condescension and envy that bedevil relations between rich and poor.Quite apart from the astonishing story of its survival, Suite Française is a novel of genius and lasting artistic value. Subtle, often fiercely ironic, and deeply compassionate, it is both a piercing record of its time and a humane, profoundly moving novel.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "France",
    "Book Club",
    "World War II",
    "War",
    "Classics"
  ],
  "author": "Irène Némirovsky",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/607701.Suite_Fran_aise"
}