{
  "title": "The Borderlands Princess",
  "description": "In seven days, she will marry the King of the Fae as part of a century-old peace treaty between her people and the Fae. But we all know that a lot can happen in a hundred years.And even more can happen in a week...***What her people need, or what her heart wants?Destined to unite the war-torn kingdoms of humans and Fae, Princess Sorcha must do her duty. But her heart has other ideas.The road to Fae-lands is long, and her fae escort, Lord Conall, is handsome, dashing, and brave—all things a loyal knight should be. Yet no fae wants a human queen, and more war is on the horizon. Her betrothed, High King of the Fae, has secrets of his own, and she’s not sure that he’s her destiny. But her handsome knight and her heart will have to stand aside, for the princess has a duty—her people need this alliance. Until terrible secrets are exposed and the princess must choose between upholding her duty or following her dreams.One mistake, one wrong choice and it's not just her heart that will suffer, it's her entire kingdom…***Tropes:✨ arranged marriage 🥀 forbidden romance ✨ she falls for her guard🥀 love triangle?✨ fae and mythical creatures 🥀 curvy strong FMC✨ adult characters 🥀 elemental magic✨ cute side characters 🥀 cozy adjacent/classic fantasy feel✨ plot twists and unreliable narratorIf you love fae stories, fated mates, and steam, you will not want to miss this high-fae Arthurian and Sleeping Beauty reimagining.The Borderlands Princess is a steamy adult fantasy romance for fans of Sarah J. Maas, Sylvia Mercedes, and Raven Kennedy.Please be advised: In an effort to be transparent, this is intended for audiences eighteen years and older. TRIGGER/CONTENT WARNINGS: This book contains scenes that may depict, mention, or discuss animal death, assault, attempted murder, blood, bones, death, decapitation, fire/smoke, implied non-consent/sexual coercion, violence, and discussions of slavery and war. There are several adult scenes with sexually explicit material as well as explicit language.This book also contains enthusiastic consent, positive body image language, nonbinary representation (a character with they/them pronouns), found family, healthy family systems, and older protagonists.",
  "genres": [
    "Fantasy",
    "Fae",
    "Romantasy",
    "Fantasy Romance",
    "Romance",
    "Retellings",
    "Magic"
  ],
  "author": "Ophelia Wells Langley",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/60763354-the-borderlands-princess"
}