{
  "title": "Falling for the Ice Queen",
  "description": "He’s more than a little rough around the edges…Memphis Camden isn’t a nice guy. He’s big, dangerous, and has an extremely low tolerance for BS. A former bounty hunter, Memphis now has a deadly new target…a serial killer. Memphis has been tracking the guy for months, and he may just have found the way to drag the monster into the light. In order to accomplish his mission, he’s going to need help from an unlikely ally…She’s elegant, poised, and a beautiful society queen.Eliza Robinson doesn’t talk about her past. She tried going to the cops—long ago—but they never caught the man responsible for her abduction, and her powerful family made sure to bury every detail about that night. Now, she spends her days dodging the stiff guards her family keeps sending her way. Until someone very unusual steps into her path.He’s not like the others. He’s fierce, ruggedly sexy, and more than a little uncivilized…At first, Eliza thinks that Memphis is a new bodyguard. The attraction she feels for him is white-hot, stunning in its intensity, and it completely disrupts her carefully ordered life. But Memphis isn’t suddenly close to her because he’s on her parents’ payroll.Memphis belongs to a group of cold case solvers called the Ice Breakers, and for his latest mission? He’s hunting the man who once turned Eliza’s world into a nightmare. Memphis wants her help because she is the only one who ever escaped from the monster. What Memphis doesn’t know…is that the monster has been stalking Eliza ever since she fled from him…They are complete opposites.The only rules that Memphis follows are the ones that he makes. He hits life full-force, with no apologies. Eliza is reserved, careful in all that she does, and always on her guard. They shouldn’t want each other so badly, but they do. Their attraction won’t be denied, and their sudden, forced proximity just throws them closer to the edge of desire.Eliza is determined to help Memphis, and she’ll take any risk to end the nightmare that has haunted her. But with every moment that passes, the danger deepens around her, and soon Memphis realizes that closing the latest case isn’t his top priority. Protecting Eliza, making sure that she’s safe—that is his only goal. Because the refined and cautious Eliza may have just stolen his heart…Author’s Note: Memphis never loses his prey. He’s alpha to his core, fierce and dedicated, and when he falls…oh, but he will fall hard. His latest cold case has taken him into Eliza’s high society world. The fierce attraction he feels for Eliza catches him off-guard, and all too soon, he can’t imagine his life without her in it. But, someone else has eyes on Eliza, too. Someone who has been watching her for a very long time. A cold case is about to ignite, and if they aren’t careful, Memphis and Eliza might just get caught in the blaze.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Mystery",
    "Suspense",
    "Contemporary Romance",
    "Forced Proximity"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/60781232-falling-for-the-ice-queen"
}