{
  "title": "Our Best Intentions",
  "description": "A GMA Buzz Pick!NPR 1A Inaugural Book Club PickA 'Must-Read' by USA Today!A suspenseful drama about an immigrant family caught in a criminal investigation, perfect for readers of Celeste Ng's Everything I Never Told You.\"Our Best Intentions is a thoughtful, gripping suspense that shakes up definitions of family and identity in a beautiful and refreshing way!\" --Kal Penn, actor and national bestselling author of You Can't Be SeriousBabur \"Bobby\" Singh, Indian immigrant, single parent, and owner of a fledging rideshare business, remains ever hopeful about ascending the ladder of American success. He lives in an affluent suburb of New York with his introverted teenage daughter Angie.During summer break, Angie is walking home after swimming at the high school pool when she finds Henry McCleary, a white classmate from a wealthy family, stabbed and bleeding on the football field. The police immediately focus their investigation on Chiara Thompkins, a runaway Black girl who disappears after the stabbing and--it's later discovered--wasn't properly enrolled in the public high school.The incident sends shock waves through the community and reveals jarring truths about the lengths to which families will go to protect themselves. Alternating between multiple perspectives,  Our Best Intentions is a pulsating story about a father and daughter re-examining their familial bonds and place in the community. Both a gripping page-turner and an intimate portrait of an immigrant family, Vibhuti Jain's provocative debut explores how easily friendships, careers, communities, and individual lives can unravel when the toxicity of privilege and racial bias are exposed.",
  "genres": [
    "Fiction",
    "Mystery",
    "Contemporary",
    "Audiobook",
    "Thriller",
    "Mystery Thriller",
    "Literary Fiction"
  ],
  "author": "Vibhuti Jain",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/60779746-our-best-intentions"
}