{
  "title": "The Last Summer",
  "description": "From the New York Times-bestselling author of The Sisterhood of the Traveling Pants Ann Brashares comes her first adult novel In the town of Waterby on Fire Island, the rhythms and rituals of summer are the ceremonial arrivals and departures by ferry; yacht club dinners with terrible food and breathtaking views; the virtual decree against shoes; and the generational parade of sandy, sun-bleached kids, running, swimming, squealing, and coming of age on the beach. Set against this vivid backdrop, The Last Summer (of You and Me) is the enchanting, heartrending story of a beach-community friendship triangle and summertime romance among three young adults for whom summer and this place have meant everything. Sisters Riley and Alice, now in their twenties, have been returning to their parents’ modest beach house every summer for their entire lives. Petite, tenacious Riley is a tomboy and a lifeguard, always ready for a midnight swim, a gale-force sail, or a barefoot sprint down the beach. Beautiful Alice is lithe, gentle, a reader and a thinker, and worshipful of her older sister. And every summer growing up, in the big house that overshadowed their humble one, there was Paul, a friend as important to both girls as the place itself, who has now finally returned to the island after three years away. But his return marks a season of tremendous change, and when a simmering attraction, a serious illness, and a deep secret all collide, the three friends are launched into an unfamiliar adult world, a world from which their summer haven can no longer protect them. Ann Brashares has won millions of fans with her blockbuster series, The Sisterhood of the Traveling Pants, in which she so powerfully captured the emotional complexities of female friendship and young love. With The Last Summer (of You and Me), she moves on to introduce a new set of characters and adult relationships just as true, endearing, and unforgettable. With warmth, humor, and wisdom, Brashares makes us feel the excruciating joys and pangs of love—both platonic and romantic. She reminds us of the strength and sting of friendship, the great ache of loss, and the complicated weight of family loyalty. Thoughtful, lyrical, and tremendously moving, The Last Summer (of You and Me is a deeply felt celebration of summer and nostalgia for youth.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Young Adult",
    "Contemporary",
    "Adult",
    "Adult Fiction"
  ],
  "author": "Ann Brashares",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/6078012-the-last-summer"
}