{
  "title": "Wear Something Red Anthology",
  "description": "Welcome to the Vault, an exclusive 24-hour club frequented by the rich and famous that caters to many tastes. If you venture down to the infamous basement, there’s one very important rule to follow: In the event that you find yourself officially claimed by a club member, you’d better wear something red.ACHE FOR MEA recent betrayal leaves Isabel “Izzy” McKenzie tempted to avoid men for a while. Fate apparently has other plans—it tosses Cole Delaney in her path, and sexual chemistry instantly flares between them.Strong, solid, and hot as sin, the undefeated world champion boxer pushes all her best buttons. But, wholly focused on his career, Cole has little time for relationships. That’s okay—she’s a busy girl herself.They’re both content to do as most club members do and stick to a simple arrangement. Until they’re not. Until possessiveness creeps in and they begin breaking their own rules.Goodbye, simple. Hello, complicated.Now they need to decide just how much more complicated they’ll allow things to get.MELT FOR MEIt started with a question … If I asked you to be still and quiet like a good little toy while I fucked you, would you do it?Oh, Cat Dukas had done it. She’d also agreed to a casual arrangement, though getting involved with a criminal mastermind wasn’t the wisest idea.Six months later, she’s no less drawn to the dangerous, inscrutable Danton Quintero. The problem is … she can feel herself becoming a little too attached. She might tell herself that she doesn’t want anything serious, but she knows it’s a lie, just as she knows he’ll never cross the casual line. Distant and remote, he holds himself apart from the world.Cat is left with only one option: Walk away before she finds herself even more wrapped up in him. Which she truly would do if he’d only stop making it difficult. As it turns out, Danton doesn’t easily part with what belongs to him.SHATTER FOR USOne has a face the world sighs over. The other has a voice that makes toes everywhere curl. Briar Leighton can admit she’s wildly drawn to both the elegant Trace Lacroix and the rough-around-the-edges Kaleb Westley.Rational thought vacates the building when they offer her a night of unparalleled pleasure. Together, they deliver it. There’s just one measly issue ...Now she wants more, but the guys are anti-arrangement and rarely play with the same woman twice.It's fine. Totally. She'll just turn her attention to the other fish in the basement’s sea. Except … Trace and Kaleb don’t seem to like that. And now they’re all up in her space, boldly possessive.What is a girl to do when two specimens of lethally raw sexuality home in on her this way? Well Briar’s not so sure yet.[Warning: MFM]BURN FOR MEAs a teenager, Inaya Rose Rafferty had two aspirations: to become a rock singer, and to marry her idol Kaiser Wolfe.Her first dream later became a reality. As for her second, she shed that juvenile fantasy. Which is good or she’d be heartbroken over how badly their first meeting went. Not that she can take Kaiser’s unfriendliness personally. The gorgeous rock legend is well-known for being blunt and rude.He's also her new neighbor. More, he now frequents the Vault.Considering he usually alternates between ignoring and glaring at her, Inaya doesn’t expect him to save her from an awkward situation. Or for him to kiss her. Or for them both to soon become enslaved by the sexual tension that crackles between them.She agrees to an arrangement, certain she can keep all her teenage fantasies locked away in a box. But the lid begins to rattle as lust and obsession twist and tangle until they become something else, something more, something that begins with ‘L.’Sexual chemistry had a lot to answer for.",
  "genres": [
    "Romance",
    "Contemporary",
    "Anthologies",
    "Erotica",
    "BDSM",
    "Contemporary Romance",
    "Menage"
  ],
  "author": "Suzanne Wright",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/60771138-wear-something-red-anthology"
}