{
  "title": "Take Five",
  "description": "Renée Pawlish, the award-winning author of the Reed Ferguson mystery series, the Dewey Webb historical mystery series, The Girl in the Window, a stand-alone suspense novel, and much more, offers a wonderful collection of five short stories. You will laugh, feel chills, cringe, and most of all, keep turning pages. This collection offers a variety of mysteries, including a Reed Ferguson story. It is an inexpensive way to get introduced to the author and her works. TAKE FIVE Five mystery tales set in Colorado. Sarah Spillman, a sassy Denver police detective. Reed Ferguson, a witty private eye with a love of film noir and Humphrey Bogart. Kay, a computer nerd with revenge on her mind. Each story sells individually for 99 cents, so this bundle at $2.99 is a bargain! Plus, one story is only available in this collection. Scroll up and get your copy now. Praise for Renée Pawlish's mystery THIS DOESN'T HAPPEN IN THE MOVIES Kirkus The promising kickoff to Pawlish's comic mystery series, starring far-from-perfect PI Reed Ferguson. Pawlish earns high marks for plot construction, with twists and turns naturally unfolding as Ferguson, inexperienced but not incapable, feels his way through the case. A good-humored mystery series worth following. Readers' Favorite on this mystery This is one witty, hilarious detective story that will keep the reader glued to the pages until the very end. 5 Star Review There is little doubt that Renée Pawlish is a promising new voice to the comic murder/mystery genre. Quite noticeable...is Pawlish's adept development of the plot coupled with her ability to contrive clear, concise and playful prose with almost perfect pacing. Norman Goldman, Bookpleasures Publisher and Editor Top Amazon Reviewer About the Author Renée Pawlish is the author of the Reed Ferguson mystery series, Nephilim Genesis of Evil, first in the Nephilim trilogy, the Noah Winter adventure series, and she has also written short stories, middle grade novels, and a non-fiction book, The Sallie Exposing the Beast Within, about the investigation of America's most haunted house. Visit www.reneepawlish.com for more information.",
  "genres": [
    "Mystery"
  ],
  "author": "Renee Pawlish",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/12876782-take-five"
}