{
  "title": "Pressure",
  "description": "alternate cover edition of ASIN B09RJZP65KAxe Landry needs a fake mate—fast.Axe Landry is the disgraced heir of a defeated Alpha. He craves law, order, and stability, but he's clinging to his position of Chief of the Lunar Council Enforcement Agency, the protectors of Crescent City, by a thread. If he doesn't find a mate—a witch mate, at that—by the next full moon, he's bound for a life of ridicule and isolation. And to Axe, that kind of humiliation is a fate worse than death.Enter Caden Borealis—wild, reckless...and irresistible.Caden hasn't made much of his twenty-three years on earth. His dysfunctional family and traumatic past sent him on a five year bender, but when his grandpa gets sick, Caden knows he needs to take care of the only person who ever cared about him. Caden's life is a mess, though, and he desperately needs money if he wants to save his grandpa's life.A deliciously indecent proposal.When Caden first hears Axe's proposal, he can't believe Axe is serious. All he has to do is pretend to be Axe's husband and Axe will give him half a million dollars? There has to be a catch. Sure, Axe is a little strict. And yeah, there's a list of rules Caden has to follow. But he can play the obedient pretend husband for as long as it takes for his grandpa to get better.Unless it's all real...When werewolves start to go missing in Crescent City, Caden realizes he might be in over his head. He's never let himself rely on anyone before, but Axe—older, gorgeous, steady Axe—becomes his rock as he learns to navigate this newfound world of witches and werewolves. But as the lines between real and pretend blur, Caden can't always remember that he's only acting like he's in love. He needs to keep his head in the game, but it might just be his heart that's calling the shots now.Pressure is the first book in the Lunar Wolves series. It is a paranormal gay romance with mystery, suspense, a stern and sexy wolf, and an impulsive twink who maybe should’ve actually read that contract—like Axe had instructed—before he signed it.",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Romance",
    "Shapeshifters",
    "Paranormal",
    "Magic",
    "Audiobook"
  ],
  "author": "Kiki Burrelli",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/60774939-pressure"
}