{
  "title": "Every Rising Sun",
  "description": "In this riveting take on One Thousand and One Nights, Shaherazade, at the center of her own story, uses wit and political mastery to navigate opulent palaces brimming with treachery and the perils of the Third Crusade as her Persian homeland teeters on the brink of destruction.In twelfth century, Persia, clever and dreamy Shaherazade stumbles on the Malik’s beloved wife entwined with a lover in a sun-dappled courtyard. When Shaherazade recounts her first tale, the story of this infidelity, to the Malik, she sets the Seljuk Empire on fire. Enraged at his wife’s betrayal, the once-gentle Malik beheads her. But when that killing does not quench his anger, the Malik begins to marry and behead a new bride each night. Furious at the murders, his province seethes on rebellion’s edge. To suppress her guilt, quell threats of a revolt, and perhaps marry the man she has loved since childhood, Shaherazade persuades her beloved father, the Malik’s vizier, to offer her as the next wife. On their wedding night, Shaherazade begins a yarn, but as the sun ascends she cuts the story short, ensuring that she will live to tell another tale, a practice she repeats night after night. But the Malik’s rage runs too deep for Shaherazade to exorcise alone. And so she and her father persuade the Malik to leave Persia to join Saladin’s fight against the Crusaders in Palestine. With plots spun against the Seljuks from all corners, Shaherazade must maneuver through intrigue in the age’s greatest courts to safeguard her people. All the while, she must keep the Malik enticed with her otherworldly tales—because the slightest misstep could cost Shaherazade her head. This suspenseful first-person retelling is vividly rendered through the voice of a fully imagined Shaherazade, a book lover whose late mother bestowed the gift of story that becomes her power. Created over fourteen years of writing and research, Jamila Ahmed’s gorgeously written debut is a celebration of storytelling and a love letter to the medieval Islamic world that brings to life one of the most enduring and intriguing woman characters of all time.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Retellings",
    "Fantasy",
    "Historical",
    "Mythology",
    "Adult"
  ],
  "author": "Jamila Ahmed",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/60779443-every-rising-sun"
}