{
  "title": "Der wunderbare Massenselbstmord",
  "description": "Ausgerechnet am Johannistag, dem mittsommerlichen Fest des Lichtes und der Freude, beschließt Direktor Onni Rellonen seinem Leben ein Ende zu setzen. Doch kaum hat der Glücklose mit Hang zum Konkurs in einer abgelegenen Scheune den idealen Platz zum Ableben ausgemacht, schrecken ihn merkwürdige Geräusche aus dem Inneren auf. In letzter Sekunde kann er den auf einem Stuhl taumelnden zweiten Scheunenbesucher aus seiner Schlinge befreien, denn ausgerechnet am Johannistag, dem mittsommerlichen Fest des Lichtes und der Freude, hat Oberst Kemppainen beschlossen, seinem Leben ein Ende zu setzen. \"Am allerwichtigsten in diesem Leben ist der Tod, und auch der ist nicht wirklich wichtig.\" Gemäß dieser aufmunternden finnischen Volksweisheit, stürzen sich alljährlich Abertausende Finnen -- traditionell ein lichtarmes Volk von frostbeuligen Melancholikern und Alkoholikern -- von Klippen, oder setzen hinter ihr nordisch karges Leben in heimischer Garage unter dem Auspuff den Schlussakkord. Diesen doch eher betrüblichen Sachverhalt hat Arto Paasilinna nun zu einem rasend komischen Suizidal-Reisebericht verarbeitet, der so manches erkaltete Leserherz auf Hochofentemperatur bringen dürfte. Die gegenseitige Errettung vor dem Exitus nämlich ließ aus dem Direktor und dem Oberst Freunde fürs Leben werden. Und -- es entstand eine geniale Geschäftsidee. Quasi seelsorgerisch soll allen lebensmüden Landsleuten zu kostengünstiger Entsorgung plus buntem Rahmenprogramm verholfen werden. Als gälte es, Erster in einem Casting-Wettbewerb zu werden, trudeln aus ganz Finnland schon bald Hunderte von Bewerbungen potenzieller Todeskandidaten ein. Arto Paasilinna, so entnehmen wir dem Klappentext, gilt mit inzwischen sage und schreibe 40 Romanen als Finnlands populärster Schriftsteller. Dies verwundert nicht. Der Mann, den man, nach seinem Konterfei zu urteilen, gut und gerne der von ihm beschriebenen Klientel zurechnen könnte, hat mit leichtester Hand und präzisem Humoreinsatz ein finnisches Roadmovie à la Kaurismäki gestrickt. Der Selbstmord-Trip einer halben Hundertschaft zu Tode betrübter selbsttötungswilliger Finnen (und Finninnen!) im gemieteten Bus durch halb Europa endet natürlich gänzlich anders als erwartet. Spätestens im urdeutschen Schwarzwald bekommen einige der Trauerklöße wieder unbändige Lust am Leben. --Ravi Unger",
  "genres": [
    "Fiction",
    "Humor",
    "Finnish Literature",
    "Contemporary",
    "Roman",
    "Novels",
    "Scandinavian Literature"
  ],
  "author": "Arto Paasilinna",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/1030636.Der_wunderbare_Massenselbstmord"
}