{
  "title": "The Second You're Single",
  "description": "Cheerfully irreverent, bitingly funny, and filled with romantic charm, The Second You're Single is all about navigating the most romantic month of the year, and how love always seems to arrive when you least expect it.Freelance writer Sora Reid believes in inertia. She’s the odd one out in a close-knit family of go-getters, including her Japanese-American mom, who hints about her need to lose weight, and her soon-to-be married, overachieving younger sister, who needs her to have a date for the wedding, since a wedding party couples' dance with their Scottish great uncle Bob simply won't do. For Sora, minimal input, minimal expectations is the way to go. She’d rather stay at home with her insufferable neighbor and her adorable pitbull.The one thing that disrupts her inertia: an intense dislike for Valentine’s Day. What is it with the commercial love machine? Why do we pin our hopes on one romantic day, when staying home with a package of bacon and a bottle of tequila would be way better? Sora’s been betrayed and disappointed more than once and her heart is starting to feel like her Grandma Mitsuye’s antique Japanese ceramic bowl, with its many gold-filled cracks.When her pledge to stay single in February inspires readers to #gosolo, Sora has a responsibility to empower her readers. But relationships aren’t built to last, so it shouldn’t be that hard. Right?Enter Jack Mann. A muscle-bound baker who looks like he lifts logs on the weekends, Sora hasn’t thought of Jack since they were in elementary school together. When they see each other at the local grocery store and the attraction hits hard, Sora knows she has to shut it down, quick. She can’t #gosolo AND get the guy. She can’t let down her readers. And relationships always end, so why should Jack be any different–even though he’s confounding all her long-held expectations of love?",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Audiobook",
    "Contemporary Romance",
    "Chick Lit",
    "Adult"
  ],
  "author": "Cara Tanamachi",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/60784611-the-second-you-re-single"
}