{
  "title": "The Education of Kendrick Perkins: A Memoir",
  "description": "Kendrick “Perk” Perkins is known for his blunt, opinionated, “carry the hell on” commentary on ESPN’s most popular shows. As a fourteen year NBA player and starting center for the 2008 NBA champion Boston Celtics, Perk earned a reputation as an enforcer, a fierce defender, and a great teammate. Now, In The Education of Kendrick Perkins, he opens a different side of himself: a powerful and intimate memoir that goes beyond basketball to discuss the reality of being Black in America.Abandoned by his father, then orphaned after the murder of his mother, Perk was raised by his grandparents in a small Texas town. He left their home at age eighteen, drafted out of high school by the legendary Celtics. For a country boy, Boston was a completely new world, and the NBA a league of legends: Kobe Bryant, Lebron James, Kevin Garnett, James Harden, Shaquille O’Neal, Paul Pierce, Ray Allen, Kevin Durant, and more. Perk had to learn how to play with and against these stars, while adjusting to life on the road as a professional athlete. But his education went beyond basketball. In this book, Perk reveals his awakening consciousness of larger issues that affected him, his fellow players, and Black Americans:-How many NBA players grow up in broken families and difficult circumstances-The history of slavery and how that trauma affects generations of Black life-The truths told by writers including James Baldwin, Ralph Ellison, Richard Wright, and others-The false myths about the Black family and fatherhood-Why George Floyd’s murder forced a reckoning about race in AmericaHonest, fearless, dramatic, filled with stories about life on and off the court, The Education of Kendrick Perkins is a unique memoir that shows how he and we all can “carry the hell on.”",
  "genres": [
    "Sports",
    "Memoir",
    "Nonfiction",
    "Basketball",
    "Biography",
    "Autobiography",
    "Audiobook"
  ],
  "author": "Kendrick Perkins",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/60784585-the-education-of-kendrick-perkins"
}