{
  "title": "The Case for Cancel Culture: How This Democratic Tool Works to Liberate Us All",
  "description": "Refinery 29 's Most Anticipated Books By Black & Latine Authors in 2023!Philadelphia Inquirer 's Best New Books for February!\"A necessary discourse about power and control, and who ultimately has a voice versus whose is often stifled.\" ―Preston D. Mitchum, LGBTQIA attorney, activist, and adjunct professor of law at Georgetown UniversityThe first major case for cancel culture as a fundamental means of democratic expression throughout history, and timely necessity aimed at combating systems of oppression.“___ is canceled.”Chances are, you’ve heard this a lot lately. What might’ve once been a niche digital term has been legitimized in the discourse of presidents, politicians, and lawmakers.But what really is cancel culture? Blacklisting celebrities? Censorship? Until now, this has been the general consensus in the media. But it’s time to raise the bar on our definition― to think of cancel culture less as scandal or suppression, and more as an essential means of democratic expression and accountability.The Case for Cancel Culture does just that. This cultural critique from 2023 Philly News Award-Winning journalist Ernest Owens offers a fresh progressive lens in favor of cancel culture as a tool for activism and change. Using examples from politics, pop culture, and his own personal experience, Owens helps readers reflect on and learn the long history of canceling ( the Boston Tea Party was cancel culture); how the left and right uniquely equip it as part of their political toolkits; how intersections of society wield it for justice; and ultimately how it levels the playing field for the everyday person’s voice to matter.Why should we care? Because in a world where protest and free speech are being challenged by the most powerful institutions, those without power deserve to understand the nuance and importance of this democratic tool available to them. Readers will walk away from this first-of-its-kind exploration not despising cancel culture but embracing it as a form of democratic expression that’s always been leading the charge in liberating us all.\"Journalist Owens debuts with an incisive defense of cancel culture... his arguments are thought-provoking and well supported. The result is an invigorating survey of a hot-button political issue.\" ― Publishers Weekly\"An important tool for all times, and for anyone looking to learn how to have the difficult but necessary conversations about race, injustice, inequality, and oppression.\" ―Dawn Ennis, award-winning journalist, advocate, and university professor",
  "genres": [
    "Nonfiction",
    "Politics",
    "Sociology",
    "Social Justice",
    "History",
    "Audiobook"
  ],
  "author": "Ernest Owens",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/60784587-the-case-for-cancel-culture"
}