{
  "title": "The Great Money Reset: Change Your Work, Change Your Wealth, Change Your Life",
  "description": "Ten timely financial steps to build the life you really want.The COVID-19 pandemic forced us to rethink everything. Now, when it comes to envisioning a post-pandemic future, noted financial expert Jill Schlesinger hears one question over and How far should I really go to change my life?The Great Money Reset is your guide to getting serious and building your best life. A road map for navigating our present era, this book shows us how to take advantage of the seismic changes unfurling all around us to make big life improvements. Whether it’s negotiating a better deal with your boss, starting or selling a business, moving to a new locale, retraining for a new career, taking time off to find yourself, or saying “the heck with it” and retiring early, The Great Money Reset provides an essential frame-work for strategizing and planning your next move.Is quitting your job a wise decision or the biggest mistake of your life? Should you pursue that graduate degree or are you throwing away your money for a few meaningless letters after your name? What kinds of lifestyle sacrifices will you need to make―and could you tolerate―in order to realize your dreams? What tax and investment moves should you make to secure your future as you head into uncharted territory? And how can you put yourself in a strong position to undertake future life transitions that you can’t fully imagine now?The Great Money Reset answers these and many other questions with Jill’s signature clarity, wit, and no-nonsense honesty. You’ll learn how to change your work, change your wealth, and change your life.In ten simple steps, this book empowers you to break free of your unsatisfying pre-pandemic reality and thrive, regardless of whatever surprises might come next.",
  "genres": [
    "Finance",
    "Nonfiction",
    "Personal Finance",
    "Money",
    "Self Help",
    "Audiobook",
    "Business"
  ],
  "author": "Jill Schlesinger",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/60784621-the-great-money-reset"
}