{
  "title": "Picasso the Foreigner: An Artist in France, 1900-1973",
  "description": "\"Absorbing [and] astute . . . Cohen-Solal captures a facet of Picasso’s character long overlooked.\" ―Hamilton Cain, The Wall Street Journal\"A beguiling read, as ingenious as it is ambitious . . . See Picasso and Paris shimmering with new light.\" ―Mark Braude, author of Kiki Man Ray: Art, Love, and Rivalry in 1920s ParisBorn from her probing inquiry into Picasso's odyssey in France, which inspired a museum exhibition of the same name, historian Annie-Cohen Solal’s Picasso the Foreigner presents a bold new understanding of the artist’s career and his relationship with the country he called home.Winner of the 2021 Prix Femina EssaiBefore Picasso became Picasso―the iconic artist now celebrated as one of France’s leading figures―he was constantly surveilled by the police. Amidst political tensions in the spring of 1901, he was flagged as an anarchist by the security services―the first of many entries in what would become an extensive case file. Though he soon became the leader of the cubist avant-garde, and became increasingly wealthy as his reputation grew worldwide, Picasso’s art was largely excluded from public collections in France for the next four decades. The genius who conceived Guernica as a visceral statement against fascism in 1937 was even denied French citizenship three years later, on the eve of the Nazi occupation. In a country where the police and the conservative Académie des Beaux-Arts represented two major pillars of the establishment at the time, Picasso faced a triple stigma―as a foreigner, a political radical, and an avant-garde artist.Picasso the Foreigner approaches the artist’s career and work from an entirely new angle, making extensive use of fascinating and long-understudied archival sources. In this groundbreaking narrative, Picasso emerges as an artist ahead of his time not only aesthetically but politically, one who ignored national modes in favor of contemporary cosmopolitan forms. Cohen-Solal reveals how, in a period encompassing the brutality of World War I, the Nazi occupation, and Cold War rivalries, Picasso strategized and fought to preserve his agency, eventually leaving Paris for good in 1955. He chose the south over the north, the provinces over the capital, and craftspeople over academicians, while simultaneously achieving widespread fame. The artist never became a citizen of France, yet he enriched and dynamized its culture like few other figures in the country’s history. This book, for the first time, explains how.Includes color images",
  "genres": [
    "Art",
    "Biography",
    "History",
    "Nonfiction",
    "Art History",
    "France"
  ],
  "author": "Annie Cohen-Solal",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/60784725-picasso-the-foreigner"
}