{
  "title": "My Father's Brain: Life in the Shadow of Alzheimer's",
  "description": "“Blending the humor, compassion, and absorbing family drama of first-rate memoir with expert science writing, [Sandeep Jauhar] has composed a can’t-miss introduction to what has been called the Age of Alzheimer’s.” ―Sanjay Gupta, author of Keep Sharp and World War CA deeply affecting memoir of a father’s descent into dementia, and a revelatory inquiry into why the human brain degenerates with age and what we can do about it.Almost six million Americans―about one in every ten people over the age of sixty-five―have Alzheimer’s disease or a related dementia, and this number is projected to more than double by 2050. What is it like to live with and amid this increasingly prevalent condition, an affliction that some fear more than death? In My Father’s Brain , the distinguished physician and author Sandeep Jauhar sets his father’s struggle with Alzheimer’s alongside his own journey toward understanding this disease and how it might best be coped with, if not cured.In an intimate memoir rich with humor and heartbreak, Jauhar relates how his immigrant father and extended family felt, quarreled, and found their way through the dissolution of a cherished life. Along the way, he lucidly exposes what happens in the brain as we age and our memory falters, and explores everything from ancient conceptions of the mind to the most cutting-edge neurological―and bioethical―research. Throughout, My Father’s Brain confronts the moral and psychological concerns that arise when family members must become caregivers, when children’s and parents’ roles reverse, and when we must accept unforeseen turns in our closest relationships―and in our understanding of what it is to have a self. The result is a work of essential insight into dementia, and into how scientists, caregivers, and all of us in an aging society are reckoning with the fallout.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Health",
    "Science",
    "Medicine",
    "Audiobook",
    "Biography"
  ],
  "author": "Sandeep Jauhar",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/60784676-my-father-s-brain"
}