{
  "title": "Unlikely Heroes: Franklin Roosevelt, His Four Lieutenants, and the World They Made",
  "description": "\"Masterful.” ― The Guardian\"Propulsive.\" ― The Wall Street Journal\"Leebaert has done the near impossible―crafted a fresh and challenging portrait of the man and his inner circle.” ― Richard Norton Smith, author of An Uncommon Man , former director of the Hoover, Eisenhower, Reagan, and Ford presidential libraries.“A fascinating and absorbing analysis of FDR’s brilliantly chosen team of four courageous and creative men and women.” ― Susan Dunn, author of 1940: FDR, Willkie, Lindbergh, Hitler―the Election Amid the Storm , Massachusetts Professor of Humanities, Williams College.Drawing on new materials, Unlikely Heroes constructs an entirely fresh understanding of FDR and his presidency by spotlighting the powerful, equally wounded figures whom he raised up to confront the Depression, then to beat the Axis.Only four people served at the top echelon of President Franklin Roosevelt's Administration from the frightening early months of spring 1933 until he died in April 1945, on the cusp of wartime victory. These lieutenants composed the tough, constrictive, long-term core of government. They built the great institutions being raised against the Depression, implemented the New Deal, and they were pivotal to winning World War II.Yet, in their different ways, each was as wounded as the polio-stricken titan. Harry Hopkins, Harold Ickes, Frances Perkins, and Henry Wallace were also strange outsiders. Up to 1933, none would ever have been considered for high office. Still, each became a world figure, and it would have been exceedingly difficult for Roosevelt to transform the nation without them. By examining the lives of these four, a very different picture emerges of how Americans saved their democracy and rescued civilization overseas. Many of the dangers that they all overcame are troublingly like those America faces today.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Politics",
    "American History",
    "Presidents",
    "World War II"
  ],
  "author": "Derek Leebaert",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/60784581-unlikely-heroes"
}