{
  "title": "One Duke Down",
  "description": "The next delightful novel in Anna Bennett's Rogues to Lovers series!\"Tantalizing...readers will be swept away.\" - Publishers WeeklyA FISHERMAN’S DAUGHTERMiss Poppy Summers is determined to keep her family’s fishing business afloat. Her poor widowed father has fallen ill, and her foolhardy brother has moved to London, leaving her precious little time to read or pursue her own dreams. But she’ll do anything for her family, so she cheerfully spends mornings in her rowboat, casting her nets. The very last thing Poppy expects or wants to find tangled in them is a dangerously attractive man. Especially one with a head wound―who’s convinced he’s a duke.AND A DUKE OUT OF WATERAndrew Keane is the Duke of Hawking, but he’s having the devil of a time convincing his fiery-haired rescuer of that fact. The truth is he came to the seaside resort of Bellehaven Bay to escape his life in London. Unfortunately, someone in Bellehaven wants to kill him―and he intends to find out who. He implores Poppy to tend to his injuries and hide him on her beach, reasoning it will be easier to find his attacker if that man assumes Keane is already dead. She wants no part of the scheme but can’t refuse the generous sum he offers in exchange for food and shelter while he recovers. It’s a mutually beneficial business arrangement…nothing more.ARE ABOUT TO MAKE WAVESUnder Poppy’s care, Keane regains his strength―and a sense of purpose. As they work together to solve the puzzle of his would-be murderer, he’s dazzled by her rapier wit and adventurous spirit; she’s intrigued by his mysterious air and protective streak. Though Poppy’s past gives her every reason to mistrust someone like Keane, the seawalls around her heart crumble in the storm of their passion. But when clues hint at the prime suspect in Keane’s attempted murder, Poppy must decide where her loyalties lie. Torn between the world she’s always known and the one she’s always dreamed of, she’ll need true love for a shot at her fairytale ending.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Regency Romance",
    "Audiobook"
  ],
  "author": "Anna  Bennett",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/60784478-one-duke-down"
}