{
  "title": "The Odyssey of Phillis Wheatley: A Poet's Journeys Through American Slavery and Independence",
  "description": "A paradigm-shattering biography of Phillis Wheatley, whose extraordinary poetry set African American literature at the heart of the American Revolution. Admired by George Washington, ridiculed by Thomas Jefferson, published in London, and read far and wide, Phillis Wheatley led one of the most extraordinary American lives. Seized in West Africa and forced into slavery as a child, she was sold to a merchant family in Boston, where she became a noted poet at a young age. Mastering the Bible, Greek and Latin translations, and the works of Pope and Milton, she composed elegies for local elites, celebrated political events, praised warriors, and used her verse to variously lampoon, question, and assert the injustice of her enslaved condition. \"Can I then but pray / Others may never feel tyrannic sway?\" By doing so, she added her voice to a vibrant, multisided conversation about race, slavery, and discontent with British rule; before and after her emancipation, her verses shook up racial etiquette and used familiar forms to create bold new meanings. Her life demonstrated that the American Revolution both strengthened and limited Black slavery. Indeed, she helped make it so.In this new biography, the historian David Waldstreicher offers the deepest account to date of Wheatley's life and works, correcting myths, reconstructing intimate friendships, and deepening our understanding of the revolutionary era. Throughout The Odyssey of Phillis Wheatley, he demonstrates the continued vitality and resonance of a woman who wrote, in a founding gesture of American literature, \"Thy Power, O Liberty, makes strong the weak / And (wond'rous instinct) Ethiopians speak.\"",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Poetry",
    "Race",
    "Biography Memoir",
    "Feminism"
  ],
  "author": "David Waldstreicher",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/60784754-the-odyssey-of-phillis-wheatley"
}