{
  "title": "Once Upon a Prime: The Wondrous Connections Between Mathematics and Literature",
  "description": "A New York Times Book Review Editors’ Choice“Wide-ranging and thoroughly winning.” ―Jordan Ellenberg, The New York Times Book Review“An absolute joy to read!\" ―Steven Levitt, New York Times bestselling author of FreakonomicsFor fans of Seven Brief Lessons in Physics , an exploration of the many ways mathematics can transform our understanding of literature and vice versa, by the first woman to hold England's oldest mathematical chair.We often think of mathematics and literature as polar opposites. But what if, instead, they were fundamentally linked? In her clear, insightful, laugh-out-loud funny debut, Once Upon a Prime , Professor Sarah Hart shows us the myriad connections between math and literature, and how understanding those connections can enhance our enjoyment of both.Did you know, for instance, that Moby-Dick is full of sophisticated geometry? That James Joyce’s stream-of-consciousness novels are deliberately checkered with mathematical references? That George Eliot was obsessed with statistics? That Jurassic Park is undergirded by fractal patterns? That Sir Arthur Conan Doyle and Chimamanda Ngozi Adichie wrote mathematician characters? From sonnets to fairytales to experimental French literature, Professor Hart shows how math and literature are complementary parts of the same quest, to understand human life and our place in the universe.As the first woman to hold England’s oldest mathematical chair, Professor Hart is the ideal tour guide, taking us on an unforgettable journey through the books we thought we knew, revealing new layers of beauty and wonder. As she promises, you’re going to need a bigger bookcase.",
  "genres": [
    "Nonfiction",
    "Science",
    "Mathematics",
    "Literature",
    "History",
    "Writing",
    "Literary Criticism"
  ],
  "author": "Sarah  Hart",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/60784368-once-upon-a-prime"
}