{
  "title": "We Were Once a Family: A Story of Love, Death, and Child Removal in America",
  "description": "The shocking, deeply reported story of a murder-suicide that claimed the lives of six children—and a searing indictment of the American foster care system.On March 26, 2018, rescue workers discovered a crumpled SUV and the bodies of two women and several children at the bottom of a cliff beside the Pacific Coast Highway. Investigators soon concluded that the crash was a murder-suicide, but there was more to the story: Jennifer and Sarah Hart, it turned out, were a white married couple who had adopted the six Black children from two different Texas families in 2006 and 2008. Behind the family's loving facade, however, was a pattern of abuse and neglect that went ignored as the couple withdrew the children from school and moved across the country. It soon became apparent that the State of Texas knew very little about the two individuals to whom it had given custody of six children—with fateful consequences.In the manner of Adrian Nicole LeBlanc's Random Family and other classic works of investigative journalism, Roxanna Asgarian’s We Were Once a Family is a revelation of vulnerable lives; it is also a shattering exposé of the foster care and adoption systems that produced this tragedy. As a journalist in Houston, Asgarian became the first reporter to put the children’s birth families at the center of the story. We follow the author as she runs up against the intransigence of a state agency that removes tens of thousands of kids from homes each year in the name of child welfare, while often failing to consider alternatives. Her reporting uncovers persistent racial biases and corruption as children of color are separated from birth parents without proper cause. The result is a riveting narrative and a deeply reported indictment of a system that continues to fail America’s most vulnerable children while upending the lives of their families.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Audiobook",
    "Sociology",
    "Crime",
    "Social Justice",
    "History"
  ],
  "author": "Roxanna Asgarian",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/60784741-we-were-once-a-family"
}