{
  "title": "You Are Not Stuck: How Soul-Guided Choices Transform Fear into Freedom",
  "description": "Becky Vollmer's You Are Not Stuck is a blend of straight talk, humor, and clear steps for action to help change-seekers reset their priorities, drown out the naysaying voices in their heads, and make bold choices.We all feel stuck in our jobs, our relationships, our habits, or when the life we’re living simply doesn’t add up to the one we want. We feel stuck when it seems like we don’t have options, or when we don’t trust or allow ourselves to make the changes we so deeply long to make.Speaker and yoga teacher Becky Vollmer believes that, when we feel paralyzed by our fears, the answer isn’t just courage―it’s choice. Because we all have choices, we just have to be brave enough to make them.You Are Not Stuck is the key to breaking the cycle of fear and making bold choices for real change. Sometimes this transformation looks like an audacious Thelma and Louise -style leap; more often, though, it is a series of small, deliberate actions based on personal values that yield more clarity, alignment, and, ultimately, long-term contentment than driving off a cliff.If what you seek is a tried-and-true process of empowerment that unlocks the true north already inside you, look no further. This book is a unique blend of permission and spirituality that will help you excavate your divine inner badass, close the gap between intention and action, and develop a strategic path forward that’s as unique as your thumbprint.Through warm and straightforward wisdom, a modern and approachable take on ancient yoga philosophy, a series of practical and insightful grounding exercises, and a healthy dose of laugh-out-loud humor, you’ll learn how to make soul-guided choices in support of the life you’ve desired all along.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Spirituality",
    "Mental Health",
    "Audiobook"
  ],
  "author": "Becky Vollmer",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/60784645-you-are-not-stuck"
}