{
  "title": "Legend and Country",
  "description": "I’m crushing on my boss. An older, single-dad grump who walked out on me the day we met. Still, every time he enters a room, my pulse races. How long can I pretend our relationship is strictly professional?I’m not like most people my age. Instead of partying my weekends away or applying for the next coolest internships, I travel the world with families seeking new adventures.After I met with a famous music manager, I agreed on joining Sam Stevens, a country music legend who has forfeited his career after his wife left him with his two young daughters without an explanation, on tour for six months.Our first encounter is nothing like I imagined. He’s broody, rude, merciless, and seems to hate my guts. Not only does he walks out on me, but he gives me attitude I don’t deserve. Being almost ten years older than me doesn’t give him an excuse to be arrogant.What Sam doesn’t know is that I don’t forfeit easily. And I won’t let him intimidate me because I’m not missing out on the opportunity of adding this new work experience to my resume. His daughters are adorable and have him wrapped around their fingers. When he's with them, a softer side of him that appeals to me emerges.Luckily for me, I’m here for the job. And the experience. Not to fall in love.The more we learn to co-exist together, the more sides of him I see. Unguarded, more human, and less grumpy versions of him that grow on me.Long stares, hands touching, we can’t seem to move out of each other’s energy field. I know better. The attraction searing between us is just a figment of my imagination. It’s a forbidden crush I won’t pursue.As the kindle between us transformed into a blazing fire, can we keep our relationship professional, or should I just resign from my nanny position and leave the man who has a rock instead of a heart behind? But a little voice in my head tells me that with me in his corner, maybe he can get back at the top where he belongs.Legend and Country is an inspirational slow burn romance in the Carter Hills Band romance series. All titles in the series are standalone novels that can be read in any order. For a better experience, read in the suggested order.Legend and Country is an emotional rollercoaster that will transport you on a journey that will stick with you well after you read “The End,” and is filled with hot steamy chemistry, second chances, age gap, single dad, romantic and heartwarming happily ever after.",
  "genres": [
    "Romance"
  ],
  "author": "Emmanuelle Snow",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/60786494-legend-and-country"
}