{
  "title": "Come Here Often?",
  "description": "“I flew through this in one sitting. Made me laugh, brought me close to tears… Had me hooked… Absolutely adored… Will keep you turning the pages.” Bookworm86My name is Kat and I have a confession. For the last week, I’ve been secretly living in the gym.Let me set the scene for you… It was my first day working out. Ever. My idea of fun is lifting Dunkin’ Donuts, so as if exercising wasn’t bad enough, it got a lot worse. In the space of minutes, my boyfriend dumped me over the phone and my boss fired me.Cue a Code Red panic attack. Now, no matter how hard I try, my anxiety is stopping me from physically walking out of the door, back into the hot mess of my life.So now I’m stuck here, spending night after night sleeping on massage tables, escaping security guards and hiding from my ex. Flirting with personal trainer Marcus, who’s carved like a Greek god and has a smile that makes my stomach flip-flop, is the silver lining to this craziness.But what happens if I get caught? Can I finally sort my life out? And how personal is too personal when it comes to personal trainers?This fresh and funny page-turner is for anyone who has ever lost their spark, struggled with anxiety, or prefers pie and lattes to pilates. Perfect for fans of Beth O’Leary and Emily Henry.Read what everyone’s saying about \nCome Here Often?\n: “LOVED, loved, loved… I loved this. I would totally recommend this. I even talked about it with my friends… Awesome.” NetGalley reviewer“FLEW through this excellent, incredible book… Laugh-out-loud funny… It hooked me immediately… Wow, my heart melted so many times… I love light-hearted rom coms like this. The heroine was so relatable—her aversion to working out and her living situation made her so likeable and fun… Ellie does such a beautiful job curating these endearing and wonderful characters with seemingly real personalities and ambitions. I absolutely loved being in Kat’s head and trying to figure out what Marcus was thinking… I AM SO HONORED I GOT THE CHANCE TO READ THIS NOVEL. This one even topped so many other rom com novels this month, and I can’t wait to tell everyone to buy it when it’s in stores or be annoyingly persistent about it when I’m at the library. I adored all the characters and the atmosphere so much, and I hope the author continues putting out more books like this!” Goodreads reviewer“The book was hilarious. It had me laughing out loud and calling my friends to tell them about it.” Goodreads reviewer“Made me laugh, but also made me realize a few things about myself. I connected with Kat from the very beginning… I lost sense of time while reading it… I was laughing out loud which I haven’t done from reading in quite while! Well done, Ellie Center!” Goodreads reviewer“Such a breath of fresh air! I loved this book. I fell in love with the characters and the cute storyline! It was cute, romantic, and compelling.",
  "genres": [
    "Audiobook",
    "Chick Lit",
    "Mental Health",
    "Contemporary",
    "Romance"
  ],
  "author": "Ellie Center",
  "average_rating": "2.81",
  "url": "https://www.goodreads.com/book/show/60801256-come-here-often"
}