{
  "title": "The Real Wizard of Oz: The Life and Times of L. Frank Baum",
  "description": "In the first major literary biography of L. Frank Baum, Rebecca Loncraine tells the story of Oz as you've never heard it, with a look behind the curtain at the vivid life and eccentric imagination of its creator.L. Frank Baum wrote The Wonderful Wizard of Oz in 1899 and it was first published in 1900. A runaway hit, it was soon recognized as America's first modern fairy tale. Baum's life story, like the fictional world he created, is uniquely American, rooted in the transforming historical changes of his times. Baum was a complex and eccentric man who could never stay put for long; his restless creative spirit and voracious appetite for new projects led him across the U.S. during his lifetime, and he drew energy and inspiration from each new dramatic landscape he encountered,. Born in 1856, Baum spent his youth in the Finger Lakes region of New York as amputee soldiers returned from the Civil War; childhood mortality was also commonplace, blurring the lines between the living and the dead, and making room in Baum's young imagination for vividly real ghosts. When Baum was growing up, P. T. Barnum ruled the minds of small towns and his traveling circus was the most famous act around. Baum married a headstrong young woman named Maud Gage and they ventured out west to Dakota Territory, where they faced violent tornadoes, Ghost Dancing tribes and desperate droughts, before trading the hardships on the Great Plains for the excitement of Chicago and the fantastical White City of the World's Fair.Baum's writing tapped into an inner world that blurred his own sense of reality and fantasy. The Land of Oz, which Baum believed he had \"discovered\" rather than invented, grew into something far bigger and more popular than he'd ever imagined. After the roaring success of The Wonderful Wizard of Oz in 1900, he became a kind of slave to his creation, trapped inside Oz as his army of demanding child fans kept sending him back there to create new adventures for Dorothy, Toto and the humbug wizard. He went on to write thirteen sequels to his first Oz book. He also wrote the first Broadway adaptations of his Oz tales, and turned his Oz books into some of the first motion pictures in a small and undiscovered rural settlement called \"Hollywood\". Baum co-founded the Oz Film Manufacturing Company, even as critics warned that no one would pay to see a children's story. And they were right- his early ventures were box office flops and the world was not ready for Oz on screen until 1939, when MGM released \"The Wizard of Oz\" in brilliant Technicolor. Baum was not around to see it-he'd died in bed in 1919 just weeks after completing his final Oz book. But the book and film alike have become classics, just as well-loved today as they were when they first appeared.The Real Wizard of Oz is an imaginatively written work that stretches the genre of biography and enriches our understanding of modern fairytales. L. Frank Baum, author of The Wonderful Wizard of Oz and its thirteen sequels, lived during eventful times in American history-- from 1856 to 1919-- that influenced nearly every aspect of his writing, from the Civil War to Hollywood, which was emerging as a modern Emerald City full of broken dreams and humbug wizards, to the gulf between America's prairie heartland, with its wild tornadoes, and its cities teeming with \"Tin Man\" factory workers. This is a colorful portrait of one man's vivid and eccentric imagination and the world that shaped it. Baum's famous fairytale is filled with the pain of the economic uncertainties of the Gilded Age and with a yearning for real change, ideas which many contemporary Americans will recognize. The Wizard of Oz continues to fascinate and influence us because it explores universal themes of longing for a better world, homesickness and finding inner strength amid the storms.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "American History",
    "Biography Memoir",
    "Audiobook",
    "Classics"
  ],
  "author": "Rebecca Loncraine",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/6080824-the-real-wizard-of-oz"
}