{
  "title": "ابن طراق",
  "description": "نبذة النيل والفرات:برحيل زمن رجل ما يبدأ زمن رجل آخر...\" إذا ما قرأنا سيرة حياة \"ابن طرَّاق\" سنجدها حكاية تتشابه وربما تتكرر في كل مدينة، وفي كل مجتمع، وداخل كل ذات. المطلوب منا كقراء التأمل فقط في الناس من حولنا. وسنكتشف الشبه. ربما كان أحدنا في المستوصف الذي توفي فيه ابن طرَّاق – \"كمثل كلب أضاعه أهله في الصحراء\" – وآخر كان في المسجد يصلي عليه، أو في المقبرة التي دفن فيها. \"ابن طرَّاق\" حكاية لا تخص حالة بعينها، أو حي، أو شارع، أو مدينة، فجميع أبطالها أصدقاء لنا، حكاياتهم تتشابه، وتتكرر في كل زمان ومكان. سنختار بعض أبطالها ليقصوا علينا، لا بل ليبوحوا لنا بأسرار الذات. ربما يعتبرها البعض مجرد ثرثرات ولكن في طياتها بكاء وتألم عميق، إنها اعترافات على أرض الورق فلتقرأ بعضاً مما تبوحه شخوصها: جبل: \"أنا بحاجة الآن أن أحكي لغريب، والحديث للغرباء يداوي النفوس كثيراً شريطة أن لا نراهم أو يدخلوا حياتنا بعد حديثنا لهم، نرمي أسرارنا معهم ويرمون بأسرارهم معنا ونمضي ويمضون...\". طرقي: \"إن أصعب لحظة ممكنة تمر على الإنسان هي اللحظة التي تلمس كل تفاصيلها\". فردوس: \"... كان جسدي مقابل معروف في بطن أبي، وثمني كان بخساً، وحين يكون ثمنك بخساً فلا تتوقع سوى حياة بخسة الثمن بائسة، وهكذا كان انتظاري طويلاً (...) المكان الذي أتوق إليه هو حلمي، إذ لا يمكن للإنسان أن يعيش كما يريد سوى حين يصنع حلمه بنفسه. تحقيق الحلم ليس شجرة تنمو فجأة عند بابك بلا بذور، أو أمنية تخرج من فقاعات الصابون التي تملأ مغطساً وتتحقق، هي رغبات وقدرات، ومنعطفات حادة، وربما كرات ثلج أرميها هنا وهناك\". فرج طقعان: \"... ها أنذا الآن أقف وقفة تأملية، أفكر في حياتي، وأحاول أن أمرق إلى ذاتي وأنبش الذكريات التي رسمتني، والعراقيل التي لونت حياتي بالألوان الداكنة، ليس ثمة ألوان بهيجة في أعماقي، ليس هناك سوى آلامي التي لا تفارقني. صدِّقوني إن الشخص الذي يستطيع إيجاد إجابات لكل الأسئلة التي تسكن في داخله هو شخص لم يعد يستطيع العيش...\". أبو ضاري: \"... النساء هن الوليمة الوحيدة التي لا يمكن أن يشبع الرجال منها\". لوزية: \"... أنا أدرك تماماً أن باستطاعة كل الأجساد أن ترقص، وعليك فقط أن تجد الإيقاع المناسب لكل جسد في مزاج مناسب، حتى ولو دفعت ذلك الجسد دفعاً لحلبة الرقص\". وأخيراً لا بد لنا من الاعتراف إننا أمام نص روائي متميز، تمكن من حبك تقنيات السرد عبر تداخل الضمائر السردية التي تراوحت بين ضمير الغائب وضمير المتكلم، وحديث الراوي وهو يقتحم ارتحالات الذات، بشكل لافت، فضلاً عن الاعتناء باللغة وبتشخيص انفعالات الشخوص عبر وصف شاعري عميق لمراحل ضعفها الإنساني المرئي والخفي أجاد الروائيان بحبك خيوطه عبر نسيج روائي مدهش...",
  "genres": [],
  "author": "بدر السماري",
  "average_rating": "2.94",
  "url": "https://www.goodreads.com/book/show/12877574"
}