{
  "title": "Michael",
  "description": "\"Hot and super sexy...a delicious read!\" --Paige Tyler, author of Vampire 101A totally original and spine-chillingly sexy tale of a vampire Mafia and the detective who is determined to bring it to justice…Risking it all, Detective Victoria Tyler agrees to let a vampire mob enforcer take her neck and lead her on a journey through a world of bondage, domination and blood to stop the killer. But can she resist the dark lusts he sparks? Or will her weakness get someone else killed?More Books You'll Love from Ravenous Edge Act 2 by Jo AtkinsonVeronica won the role of a lifetime as the heroine in a remake of Twilight’s Edge – but life imitates art when she stumbles into grave danger. To survive she must solve a centuries-old mystery- and stop it before it ever happens.Running in Escaped by Trinity BlacioJaycee has been on the run since her sixteenth birthday. After growing up fast and depending on no one, how is she supposed to handle three male werewolves who claim to be her mates? Can she learn to trust them or will she continue to run?Woodcliff Shifter Series by Jennifer DellermanShifting PositionsTess Gentry fled her home ten years ago to find a normal life- away from the shifters of Woodcliff, CO. Now she's come back home and finds herself face to face with her destiny. Don't miss the first book in the Woodcliff Shifter Series!Shifter’s Surrender Kaylie wants Dean, Alpha of the Woodcliff Shifter Pack, but he keeps his distance, until an accidental touch sends sparks flying! Dean can no longer deny her...at least sexually. But can Kaylie win his heart too? Find out in Shifter's Surrender, book two of the Woodcliff Shifter Series!What This Wolf WantsThe third book in the Woodcliff Shifter Series, What This Wolf Wants is sure to make you howl! Dr. Jacklyn Chavez knows all about the shifters of Woodcliff, CO- and she has a secret of her own.Animal attraction brings her and hot shifter Zan on a wild ride of lost relatives, family secrets, and wolves- oh my! From best-selling author Jennifer Dellerman comes a passionate story of hot shifter love!Seduced by a ShifterWillow Yancy lost her career as a ballet dancer, and nearly her life, after being in the right place at the wrong time. Located by her shooter, she's transferred and placed into the protection of people who have secrets of their own. As bait to lure the enemy, she'll accept all the help she can get, especially if it comes from the one man who makes her body sizzle with desire! Read more in book four of the Woodcliff Shifter Series!",
  "genres": [
    "Vampires",
    "Paranormal Romance",
    "Paranormal",
    "Erotica",
    "BDSM",
    "Romance",
    "Contemporary"
  ],
  "author": "Angela Cameron",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/6079199-michael"
}