{
  "title": "The Lucky Ones",
  "description": "Good Housekeeping Magazine's BEST 50 KIDS' Books of All TimeKate DiCamillo's READ BRAVE Reading Challenge SelectionKate DiCamillo's TOP FIVE Recommended Books for ChildrenWeek Junior Magazine TOP SEVEN Kids' Books of 2022Common Sense Media BEST SIX Kids' Books of 20222022 Foreword Reviews Indies Book of the Year Award Finalist2022 New-York Historical Society Children's History Book Prize Finalist2023 Mississippi Institute of Arts and Letters Youth Book Award Winner  Award-winning author Linda Williams Jackson pulls from her own childhood in the Mississippi Delta to tell the story of Ellis Earl, who dreams of a real house, food enough for the whole family—and to be someone.It's 1967, and eleven-year-old Ellis Earl Brown has big dreams. He's going to grow up to be a teacher or a lawyer—or maybe both—and live in a big brick house in town. There'll always be enough food in the icebox, and his mama won't have to run herself ragged looking for work as a maid in order to support Ellis Earl and his eight siblings and niece, Vera. So Ellis Earl applies himself at school, soaking up the lessons that Mr. Foster teaches his class—particularly those about famous colored people like Mr. Thurgood Marshall and Miss Marian Wright—and borrowing books from his teacher's bookshelf. When Mr. Foster presents him with a copy of Charlie and the Chocolate Factory, Ellis Earl is amazed to encounter a family that's even worse off than his own—and is delighted by the Buckets' very happy ending. But when Mama tells Ellis Earl that he might need to quit school to help support the family, he wonders if happy endings are only possible in storybooks. Around the historical touchstone of Robert Kennedy's southern \"poverty tour,\" Linda Williams Jackson pulls from her own childhood in the Mississippi Delta to tell a detail-rich and poignant story with memorable characters, sure to resonate with readers who have ever felt constricted by their circumstances.",
  "genres": [
    "Historical Fiction",
    "Middle Grade",
    "Juvenile",
    "School",
    "Poverty",
    "Fiction",
    "Audiobook"
  ],
  "author": "Linda Williams Jackson",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/60809922-the-lucky-ones"
}