{
  "title": "Gringos in Paradise: An American Couple Builds Their Retirement Dream House in a Seaside Village in Mexico",
  "description": "A Year in Provence meets Mr. Blandings Builds His Dream House in this lively and entertaining account of a couple's year building their dream house in Mexico.In 2004, Barry Golson wrote an award-winning article for AARP magazine about Mexican hot spots for retirees longing for a lifestyle they couldn't afford in the United States. A year later, he and his wife Thia were taking part in the growing trend of retiring abroad. They sold their Manhattan apartment, packed up their SUV, and moved to one of those idyllic hot spots, the surfing and fishing village of Sayulita on Mexico's Pacific coast.With humor and charm, Golson details the year he and his wife spent settling into their new life and planning and building their dream home. Sayulita -- population 1,500, not including stray dogs or pelicans -- is a never-dull mixture of traditional Mexican customs and new, gringo-influenced change. Before long, the Golsons had been absorbed into the rhythms and routines of village they adopted a pair of iguanas named Iggy Pop and Iggy Mom, got sick and got cured by a doctor who charged them sixteen dollars a visit, made lasting friends with Mexicans and fellow expatriates, and discovered the skill and artistry of local craftsmen.But their daily lives were mostly dedicated to the difficult yet satisfying process of building their house. It took them almost six months to begin building -- nothing is simple (or speedy) in Mexico -- and incredibly, they completed construction in another six. They engaged a Mexican architect, builder, and landscape designer who not only built their home but also changed their lives; encountered uproariously odd bureaucracy; and ultimately experienced a lifetime's worth of education about the challenges and advantages of living in Mexico.The Golsons lived (and are still living) the dream of many -- not only of going off to a tropical paradise but also of building something beautiful, becoming a part of a new world, making lasting friends, and transforming their lives. As much about family and friendship as about house-building, Gringos in Paradise is an immensely readable and illuminating book about finding a personal paradise and making it a home.",
  "genres": [
    "Travel",
    "Memoir",
    "Nonfiction"
  ],
  "author": "Barry Golson",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/6081001-gringos-in-paradise"
}