{
  "title": "The Deep Blue Sea for Beginners",
  "description": "A legendary island steeped in the mystery and wisdom of centuries…A runaway heiress learning to trust life, and love…A mother and daughter, separated for years, searching for a way to face the future together…New York Times bestselling author Luanne Rice tells a powerful story of love, family, and friendship through the lives of two women who reunite at a place where dreams begin—and where they may be fulfilled at last….Years ago, Lyra Davis left behind a world of wealth and privilege and the people she loved most in the world, unable to reconcile the expectations of her celebrated family with the longings of her own wild heart. Now she lives quietly among a community of expatriates on the isle of Capri, slowly, carefully learning to live fully for the first time, flourishing in the friendship of a singular man who recognizes in her a kindred spirit.Granddaughter of the reigning doyenne of Newport, Rhode Island, wise beyond her sixteen years, Pell Davis is poised to take her place at the pinnacle of society. Yet she and her young sister still long for the mother who ran away from them when they were children so that they could be raised by the father they adored. Pell knows that Lyra felt she loved them best by leaving. But with her father now dead and her sister veering dangerously into fantasy, she will travel across an ocean to find the mother she remembers and the deeper truths they all need so desperately….Lyrical, unforgettable, Luanne Rice’s new novel unfolds against a background of timeless beauty, as an unlikely love affair reshapes the meaning of devotion and three generations of women resist the pull of memory and tradition to find a new way forward.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Family",
    "Contemporary",
    "Womens Fiction",
    "Drama"
  ],
  "author": "Luanne Rice",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/6081394-the-deep-blue-sea-for-beginners"
}