{
  "title": "You Must Remember This",
  "description": "A Knives Out-style whodunnit with a twist of Taylor Jenkins Reid, You Must Remember This is an immersive Gothic mystery, with a long-ago love affair, icy death, and a rich family gone bad, from Kat Rosenfield, the acclaimed author of No One Will Miss Her.On Christmas Eve, eighty-five-year-old Miriam Gardiner walks onto the vast frozen river behind her home. As a younger woman, she used to steal out on winter nights to meet her lover, walking straight across the ice to their secret meeting place. She knows the way—but not the year. Miriam, her mind clouded by dementia, doesn’t hear the snap of thin ice until it’s too late.Was it an accident? Suicide? Or worse: did someone urge the old woman onto the frozen river on purpose?There are plenty of suspects; Miriam’s fractured and complicated family has gathered in their Bar Harbor mansion to celebrate what they already thought would likely be the matriarch’s last Christmas. The guests include Delphine, Miriam’s granddaughter, a frightened and insecure young woman who adored her grandmother, and Miriam’s live-in nurse, Adam, a handsome man from a working-class background, whom Delphine has been secretly dating. Then there’s Miriam’s children: Nicole, who hated being thrust into the role of caretaker; Diana, whose deadbeat husband has long been a family joke; and Richard, who always said they’d all be better off if Mother would just hurry up and die. But it’s Delphine who comes in for the greatest scrutiny when they learn the shocking news that Miriam’s will cut off her children, and left the entire estate to Delphine only.As her relatives obsess over getting the will thrown out, Delphine begins to notice inconsistencies in their stories and is emboldened to start investigating…until the trail seems to lead her onto thin ice as well.",
  "genres": [
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "Fiction",
    "Audiobook",
    "Adult",
    "Gothic"
  ],
  "author": "Kat Rosenfield",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/60833946-you-must-remember-this"
}