{
  "title": "And the World Changed: Contemporary Stories by Pakistani Women",
  "description": "The only English-language anthology by Pakistani women published in the United States, And the World Changed goes beyond the sensational headlines to reveal the stories of Pakistani women. Immigrants and refugees, travelers and explorers, seasoned authors and fresh voices, the twenty-five writers in this volume are as dynamic and diverse as their stories.Sixty years have passed since the Partition of India, and it’s clear that Pakistani writers have established their own literary tradition to record the stories of their communities. Famed novelist Bapsi Sidhwa portrays a Pakistani community in Houston, Texas, still struggling to heal from the horrors of Partition. In Uzma Aslam Khan’s tale, a man working in a Karachi auto body shop falls in love with the magical woman painted on a bus cabin. Bushra Rehman introduces us to a Pakistani girl living in Corona, Queens, who becomes painfully aware of the tensions between established Italian immigrants and their new Pakistani neighbors. And during the anti-Muslim sentiment following 9/11, a young woman in newcomer Humera Afridi’s story searches Manhattan’s rubble-filled streets for a mosque.Filled with nostalgic memories of Pakistan, critical commentary about the world’s current political climate, and inspirational hope for the future, the stories in And the World Changed weave an intricate, enlightening view of Pakistan, its relation to the West, and the women who travel between the two regions. Talat Abbasi, Humera Afridi, Aamina Ahmad, Rukhsana Ahmad, Feryal Ali Gauhar, Sara Suleri Goodyear, Shahrukh Husain, Sabyn Javeri Jillani, Sonia Kamal, Fawzia Afzal Khan, Sorayya Khan, Uzma Aslam Khan, Maniza Naqvi, Tahira Naqvi, Nayyara Rahman, Hima Raza, Bushra Rehman, Fahmida Riaz, Roshni Rustomji, Sehba Sarwar, Bina Shah, Qaisra Shahraz, Kamila Shamsie, Muneeza Shamsie, and Bapsi Sidwa.",
  "genres": [
    "Pakistan",
    "Short Stories",
    "Fiction",
    "Feminism"
  ],
  "author": "Muneeza Shamsie",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/6082489-and-the-world-changed"
}