{
  "title": "Ms. Demeanor",
  "description": "From one of America's most beloved contemporary novelists, a delicious and witty story about love under house arrestJane Morgan is a valued member of her law firm--or was,  until a prudish neighbor, binoculars poised, observes her having sex on the roof of her NYC apartment building. Police are summoned, and a punishing judge sentences her to six months of home confinement. With Jane now jobless and rootless, trapped at home, life looks bleak. Yes, her twin sister provides support and advice, but mostly of the unwelcome kind. When a doorman lets slip that Jane isn't the only resident wearing an ankle monitor, she strikes up a friendship with fellow white-collar felon Perry Salisbury. As she tries to adapt to life within her apartment walls, she discovers she hasn't heard the end of that tattletale neighbor--whose past isn't as decorous as her 9-1-1 snitching would suggest. Why are police knocking on Jane's door again? Can her house arrest have a silver lining? Can two wrongs make a right? In the hands of \"an inspired alchemist who converts serious subject into humor\" (New York Times Book Review)--yes, delightfully.\"Ms. Demeanor is a complete and utter delight. Of course it is. What Elinor Lipman novel isn't?\"--Richard Russo, author of Empire Falls and Chances Are . . .\"Who knew house arrest could be sexy and fun? Not me, at least not until I read Ms. Demeanor. Written with Elinor Lipman's signature wit and charm, this breezy, engrossing novel tells the story of two people who make the most of their shared confinement.\"--Tom Perrotta, New York Times bestselling author of Tracy Flick Can't WinWhen a neighbor's complaint about consensual al fresco sex turns into house arrest and a suspended legal license, Jane's recipe for survival involves cooking for another home-arrested tenant (could this be a match made in confinement?) while trying to figure out the whys and hows of her mysterious accuser. Filled with food, family, romance and intrigue, Lipman's novel cooks up a bounty of delights as sparkling as prosecco and as deeply satisfying and delicious as a five-star meal.\"--Caroline Leavitt, New York Times bestselling author of With or Without You",
  "genres": [
    "Fiction",
    "Romance",
    "Audiobook",
    "Contemporary",
    "Chick Lit",
    "Humor",
    "Adult"
  ],
  "author": "Elinor Lipman",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/60839440-ms-demeanor"
}