{
  "title": "Seeking Shelter",
  "description": "A long-hidden secret is lurking beneath the wasteland. But can the Sienans take on another challenge when they are already fighting to build a new society while surviving dust storms and an unforgiving landscape? Life in Siena is becoming the new normal for the Florentine rebels. They build their homes from scavenged remnants of the ancient ruins and learn to navigate the desolate terrain. As questions about democracy, religion and leadership begin to arise, Teo realizes that everyone looks to her for answers. Meanwhile, Renn is lending his hard-earned survival skills to the Sienans while coming to terms with a life without migration and with the unfathomable technological wonders that Luca shares with the settlement. When an orphaned stranger is cast out by her fellow wanderers and heads toward Siena, an invisible killer also threatens the settlement, and Luca picks up a mysterious signal on his newly reinvented radio transmitter... Seeking Shelter continues where Marie Howalt's We Lost the Sky left off, treating readers to personal tales seen through the eyes of a cast of unforgettable characters. It imagines the rebuilding of society and tells a hopeful story of survival in a world after the destruction of the Moon.“An absolute page-turner… Howalt expertly balances brisk pacing, a vivid dystopian world, and a humane and subversive cast of characters while simultaneously exploring the complex themes of democracy, governance, and religion, the foundation for the rebuilding of a new society. Readers will be swept away by this fantastic dystopian tale.”— The Prairies Book Review“…Howalt has this amazing ability to write personal topics and feel as if they had devastating world shattering consequences… Like all second books in a trilogy, Seeking Shelter is a rebel with a cause, fighting to grow out of its original’s shadow, doing so wonderfully. It is an epic of a minute scale, which can cure the lethargic heart of society with empathy and grace.”— Aden Ng, author of The Chronicles of Tearha series, and editor at Ombak Magazine“Howalt’s brand of sci-fi is my favorite kind—the kind where the characters’ depths and growth are equally as important as the sci fi elements. The world, its history, and its characters are vivid and an absolute joy to read. I’m always happy to escape from our current reality in the pages of anything written by Howalt, and this book is no exception.”— Laura Morrison, author of Come Back to the Swamp, the Chronicles of Fritillary series, and the Space Mantis podcast“I have to admit that once I started the book, I became a bit obsessed. I latched on to these characters immediately and didn’t want to let go.”— Steeven R. Orr, author and host of the Just Another Fanboy podcast“Howalt has created a perfect sequel which builds on everything that made the first book so special and expands on it in organic and meaningful ways. Meeting the previous cast again felt like reuniting with old, dear friends. The themes take on a new life, focusing on things like what makes a society, superstition, and cultural differences. Esmia is a delightful and expertly crafted addition to the cast. Howalt has crafted a beautiful world, and characters you cannot help but love, even when they aren’t being their best selves. Seeking Shelter is a testament to Howalt’s supreme skill in world and character building and is a must-read for anyone who loves dystopian fiction, great characters, and a world you cannot help but sink into.”— Kathy Joy, author of Last One to the Bridge",
  "genres": [],
  "author": "Marie Howalt",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/60841185-seeking-shelter"
}