{
  "title": "الاغتيال الاقتصادي للأمم: اعترافات قرصان اقتصادي",
  "description": "القراصنة قديماً.. كانوا يجوبون البحار قاطعين طرقها بوجوه لفحتها حرارة الشمس وأشعتها، وأعين متربصة عادة ماتكون إحداها معصوبة وسيوف لامعة وأطماع نهمة، يبحثون عن السفن وما تحمل من كنوز وبضائع وأموال.. هؤلاء صاروا فى أيامنا المعاصرة يلبسون البذات الأنيقة، يحملون حقائبهم ومؤهلاتهم ودرجاتهم العلمية والوظيفية الراقية ليجوبوا العالم أراضيه وبحاره ومحيطاته، ولكن ليس للإستيلاء على السفن وإنما على الدول .هؤلاء هم قراصنة الإقتصاد..قراصنة قرن العولمة وعصر المعلومات، مهمتهم أن يجعلوا إقتصاديات الدول تنهار بعد إقناعها وإقحامها فى مشروعات تنموية تنهار تحت وطأتها، يكبلونها بسلاسل من ديون وقروض لا تنتهى فوائدها..هؤلاء هم من يقص علينا حكايتهم من البداية حتى النهاية \"جون بركنز\" فى هذا الكتاب الفريد فى نوعه وصراحته، وقد قام بترجمته إلى اللغة العربية كل من الأستاذ \"مصطفى الطنانى\" و \"عاطف معتمد\" والذى هو وفقاً لما قالته نيورك تايمز الكتاب الأكثر مبيعاً، وفيه يكشف لنا المؤلف وهو قرصان إقتصادى سابق أسرار تلك المهنة الغريبة والبغيضة فى ذات الوقت، يشرح ويعرّي لنا الحقائق ويبين لنا كيف توزع الولايات المتحدة \"قراصنتها\" على دول العالم مما يسمى بالدول النامية ودول العالم الثالث لتجعلها دولاً تدور فى أفلاك تبعيتها، تدور فى دائرة مفرغة لا تخرج منها أبداً، تزيد فيها معدلات الفقر والمجاعات والديون وتنهب الثروات وتسجن الشعوب خلف أسوار من الحاجة والعوز والجهل والصراعات والإغتيالات أقامتها الشركات الأمريكية ومتعددة الجنسيات فلا تستطيع الفكاك منها.إنه كتاب خطير بما يحوي من حقائق وروايات أتت من أعماق واقع مخفي وغير معلن.. ظاهره المساعدات والمبادئ النبيلة وباطنه احتلال من نوع خاص للثروات الأموال، حقائق أشبه بحلم مزعج من شدة شرّها وتمكّن خبثها من التلون والإختفاء طوال هذه السنوات.. إنها إعترافات قرصان اقتصادى كتبت بمداد من مستقبل أجيال ودماء شعوب وأحلام أمم.نبذة المؤلف:قراصنة الإقتصاد هم رجال محترفون ذوو أجور عالية، عملهم هو أن يسلبوا بالغش والخداع ملايين الدولارات من دول عديدة فى سائر أنحاء العالم.هذه الحكاية يجب أن تُروى، فنحن نعيش فى زمن أزمات رهيبة، وفرص هائلة. وقصة هذا القرصان الإقتصادي بالذات، هي قصة كيف وصلنا إلى ما نحن عليه، ولماذا نواجه حاليا أزمات يبدو تخطيها صعبا؟ هذه القصة يجب أن تُروى لأننا فقط من خلال فهم أخطاء الماضى نستطيع استثمار الفرص المستقبلية بشكل أفضل. هذه القصة يجب أن تُروى بسبب أحداث 11 سبتمبر، كذلك حرب العراق الثانية، ولأنه بالإضافة إلى الثلاثة آلاف شخص الذين ماتوا فى سبتمبر على يد الإرهاب هناك أربعة وعشرون ألفا ماتوا من المجاعات وتبعاتها، فى الحقيقة هناك أربعة وعشرون ألفا يموتون كل يوم لأنهم لا يستطيعون الحصول على طعام لسد الرمق، والأهم من هذا كله أن هذه القصة يجب أن تُروى، لأنه فى هذا الوقت بالذات ولأول مرة فى التاريخ، هنالك أمة وحيدة لديها القدرة، والمال، والقوة لتغير كل هذا.. إنها الأمة التى ولدتُ فيها، والأمة التى خدمتُ باسمها كقرصان اقتصاد. إنها الولايات المتحدة الأمريكية.",
  "genres": [
    "Nonfiction",
    "Economics",
    "Politics",
    "History",
    "Biography",
    "Business",
    "Memoir"
  ],
  "author": "John Perkins",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/6084077"
}