{
  "title": "The Great Reset: And the War for the World",
  "description": "In The Great And the War for the World, the most controversial man on earth Alex Jones gives you a full analysis of The Great Reset, the global elite's international conspiracy to enslave humanity and all life on the planet. If you really want to know what’s happening in the world, this is the one book you must read now. Alex Jones is the most censored man on the planet and you should ask yourself why that is. There is a powerful authoritarian takeover in process that is seeking to capture the entire human system and turn it into an artificial factory farm controlled system. We are in a war for the future of the world. In this book, you will hear from the world’s elites, from their own mouths, what they are planning for you and your families and you will learn what you can do to fight it.From central bankers, corporate billionaires, and corrupted government officials, global elites have been organizing a historic war on humanity under a trans-humanist, scientific dictatorship. Alex Jones was the first major figure to expose the World Economic Forum’s agenda. He has dedicated the last 30 years of his life to studying The Great Reset, conducting tens of thousands of interviews with top-level scientists, politicians, and military officials in order to reverse engineer their secrets and help awaken humanity. The Great And the War for the World chronicles the history of the global elites' rise to power and reveals how they’ve captured the governments of the world and financed The Great Reset to pave the way for The New World Order. Once dubbed a conspiracy theory, but now openly promoted by the most powerful corporations and governments, The Great Reset is a planned attempt to redistribute all the world’s wealth and power into the hands of banks, corporations, billionaires, and The World Economic Forum. If you read one book in a lifetime, this is it. In The Great And the War for the World, you will discover from the self-appointed controllers of the planet in their own words, their plan for what they call the final revolution, or The Great Reset. The only way this corporate fascist conspiracy can succeed is if the people of the world are not aware of it. And this book lays out their sinister blueprint and how to stop it. While many great books have been written to help awaken people to this sinister agenda, no author has ever spent as much time and research on The Great Reset as Alex Jones. The Great And the War for the World is the undisputed trailblazer for understanding what’s happening and how to stop it.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Conspiracy Theories",
    "History",
    "Philosophy",
    "Audiobook",
    "War"
  ],
  "author": "Alex Jones",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/60852462-the-great-reset"
}