{
  "title": "Chronic City",
  "description": "The acclaimed author of Motherless Brooklyn and The Fortress of Solitude returns with a roar with this gorgeous, searing portrayal of Manhattanites wrapped in their own delusions, desires, and lies.Chase Insteadman, a handsome, inoffensive fixture on Manhattan's social scene, lives off residuals earned as a child star on a beloved sitcom called Martyr & Pesty. Chase owes his current social cachet to an ongoing tragedy much covered in the tabloids: His teenage sweetheart and fiancée, Janice Trumbull, is trapped by a layer of low-orbit mines on the International Space Station, from which she sends him rapturous and heartbreaking love letters. Like Janice, Chase is adrift, she in Earth's stratosphere, he in a vague routine punctuated by Upper East Side dinner parties. Into Chase's cloistered city enters Perkus Tooth, a wall-eyed free-range pop critic whose soaring conspiratorial riffs are fueled by high-grade marijuana, mammoth cheeseburgers, and a desperate ache for meaning. Perkus's countercultural savvy and voracious paranoia draw Chase into another Manhattan, where questions of what is real, what is fake, and who is complicit take on a life-shattering urgency. Along with Oona Laszlo, a self-loathing ghostwriter, and Richard Abneg, a hero of the Tompkins Square Park riot now working as a fixer for the billionaire mayor, Chase and Perkus attempt to unearth the answers to several mysteries that seem to offer that rarest of artifacts on an island where everything can be bought: Truth. Like Manhattan itself, Jonathan Lethem's masterpiece is beautiful and tawdry, tragic and forgiving, devastating and antic, a stand-in for the whole world and a place utterly unique.",
  "genres": [
    "Fiction",
    "Novels",
    "Contemporary",
    "Literary Fiction",
    "New York",
    "Literature",
    "Science Fiction"
  ],
  "author": "Jonathan Lethem",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/6085191-chronic-city"
}