{
  "title": "In Felt Treeling: A Libretto",
  "description": "In in felt treeling, Michael Cross has created a pastoral theatre in which elaborate patterns of resemblance are poetically measured by counter-voiced assertions of autonomy and difference. The world is invited to “err” and to “air” its intentions freely, treely, freewheelingly, treelingly. These poems are “felt” doubly, as both noun and verb, with their layered emotional registers and their playfully theatrical costume dressing. As this carefully scored work is animated by the vocal fabric of its setting in the woods, the reader becomes transfixed, like Daphne, within the lush, felt landscape of the poems. — Elizabeth WillisMichael Cross’ post-objectivist poems lace archaic vocabularies into airy filagrees — spun wisps of whispered fragments and obliquely glimpsed scenes barely suspended in the draft. These poems suggest “tracery” in both senses of the word: a delicate interweaving of open-work lines, but also phrases traced from other pages, records of reading rendered as writing. And yet, despite that filigrane and the impression of found language, in felt treeling also has an astonishing sonic density that proves Cross’ language infelt [“inwardly felt or experienced”] and leaves the reader reeling, as syllabic hints and fragile internal rhymes transform words in a tour-de-force series of seriously playful midsummer metamorphoses. The slightest sleight or faintest feint moves this language from “squints” to “sequins,” from “herr” to “err,” from “slips” to “lips” to “lisp” to “ellipse.” Scored for Mezzo and Chorus with Narrator, this Virgilian libretto is also scored by virgules which cross the page in a signature poetic device that puts cæsura and linebreak into new lyric tension. A genuinely original formal invention, these distinctive marks both open and anchor the text, echoing the book’s dialogues of intimacy and distance. Airy and solid, felt and seen, separating and soldering, those solidi or separatrices are — like the poems they punctuate — little strokes of genius. — Craig Dworkin",
  "genres": [],
  "author": "Michael Cross",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/6084973-in-felt-treeling"
}