{
  "title": "Mama Might Be Better Off Dead: The Failure of Health Care in Urban America",
  "description": "Mama Might Be Better Off Dead is an unsettling, profound look at the human face of health care. Both disturbing and illuminating, it immerses readers in the lives of four generations of a poor, African-American family beset with the devastating illnesses that are all too common in America's inner-cities.The story takes place in North Lawndale, a neighborhood that lies in the shadows of Chicago's Loop. Although surrounded by some of the city's finest medical facilities, North Lawndale is one of the sickest, most medically underserved communities in the country. Headed by Jackie Banes, who oversees the care of a diabetic grandmother, a husband on kidney dialysis, an ailing father, and three children, the Banes family contends with countless medical crises. From visits to emergency rooms and dialysis units, to trials with home care, to struggles for Medicaid eligibility, Abraham chronicles their access (or lack of access) to medical care.Told sympathetically but without sentimentality, their story reveals an inadequate health care system that is further undermined by the direct and indirect effects of poverty. When people are poor, they become sick easily. When people are sick, their families quickly become poorer.Embedded in the family narrative is a lucid analysis of the gaps, inconsistencies, and inequalities the poor face when they seek health care. This book reveals what health care policies crafted in Washington, D. C. or state capitals look like when they hit the street. It shows how Medicaid and Medicare work and don't work, the Catch-22s of hospital financing in the inner city, the racial politics of organ transplants, the failure of childhood immunization programs, the vexed issues of individual responsibility and institutional paternalism. One observer puts it this way: \"Show me the poor woman who finds a way to get everything she's entitled to in the system, and I'll show you a woman who could run General Motors.\"Abraham deftly weaves these themes together to make a persuasive case for health care reform while unflinchingly presenting the complexities that will make true reform as difficult as it is necessary. Mama Might Be Better Off Dead is a book with the power to change the way health care is understood in America. For those seeking to learn what our current system of health care promises and what it delivers, it offers a place for the debate to begin.",
  "genres": [
    "Nonfiction",
    "Medicine",
    "Sociology",
    "Health",
    "Medical",
    "Health Care",
    "Politics"
  ],
  "author": "Laurie Kaye Abraham",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/60862.Mama_Might_Be_Better_Off_Dead"
}