{
  "title": "Lost Brothers",
  "description": "Can coping mechanisms piece you back together and keep you whole? The Randall brothers escaped their father, but not the trauma haunting them deep into their marrow. No matter how agonizing, their coping mechanisms are how they survived. Unwilling to relinquish them, they let the world move around them rather than moving to suit the world. They are the enchained, the abandoned, and the unloved. The family they built through strife is all they need. Julius Vincenzo, famous ballet dancer, moves to town after a horrific assault ends his ballet career. Wyatt Reeves wanted to hide from everyone after the cutthroat life as a marine spit him out. When these men collide with the Randalls and disrupt the fragile balance of the house, old wounds bleed to the surface and spill out raw. “Nothing buried stays buried and comes to life as a molting parrot zombie to suck out your brains—or something like that,” Darius said—yeah, he said that. Love is claustrophobic. Love is responsible. Love binds us whether we like it or not. But it’s also the only thing that means anything. Is healing real? Or is it another socially constructed illusion? If it’s all an illusion anyway, maybe it’s best we manufacture our own. Lost Brothers is an MM dark romance trilogy featuring age-gap, second chances, brother bonds, found family, a sizzling dancer duo, a taciturn marine man, and the special love and care dynamics that Mock is known for.**NOTE** if you are NOT familiar with TiH, HoH and DD dynamics, this is NOT the book to get acquainted with them for the first time. Like, for instance, if you don't know what those acronyms mean, try my Xavier's School series for a run down. They are not a requirement for reading, but if you want to know more, you'll have to seek other literature. Thanks! Mock",
  "genres": [
    "M M Romance",
    "Romance",
    "BDSM",
    "Dark",
    "Contemporary",
    "Dark Romance",
    "Enemies To Lovers"
  ],
  "author": "S. Legend",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/60862149-lost-brothers"
}