{
  "title": "Burn",
  "description": "This is a reverse harem, mafia/gang, mystery romance with plot twists/turns, steamy and smutty scenes, hot alpha-possessive-assholes, sweet love, and grungy content. Our FMC goes through it but she definitely has her come back. Her badassery comes through and she becomes a warrior with the support of her men behind her.Ella​Ever since that day on the bridge two years ago, I’ve done everything in my power to change my life for the better. I have fought tooth and nail to climb out of the dark hole of depression that I had been living in. Finally, I found myself in a good place, until one day, I made a mistake that had repercussions I never saw coming.I said yes.Now, I’m once again in a difficult situation that I don’t know how to escape. I’m alone, scared, and broken. I’m doing everything I can to hold onto the good pieces of my life, small as they may be. But what am I supposed to do when no matter how hard I fight, outside forces keep knocking me back down?How much worse can things get? And how and the world will I save myself this time when it’s not me I’m fighting against?My ex is doing everything he can to destroy me and I have no idea how to escape to jerk. Until one day, I meet him, Gage Luna. He’s gorgeous, powerful, domineering and he makes me feel things I’ve never felt before. He introduces me to a world I never knew existed. It’s full of murder, mayhem, and his three hot as hell brothers.Now torn between the demons of my past and the future that is begging for me to take it, I’m realizing there is no turning back from what’s in front of me.I want it, and I’m damn well going to take it.​GageShe’s unlike anyone I’ve ever met before. She’s a stunning little hellion and she’s got me in a chokehold.From the moment I laid eyes on her, I knew she had the potential to bring me to my knees, and it seems my brother feels the same way.We’ve allowed ourselves to get close to her and it’s never something either of us thought we would do. We don’t have relationships and women don’t fit in with our insane lives. But I find that I’m drawn to her and no matter how much I tell myself that it’s not a good idea, I can’t seem to let her go. Neither can Maddox.Ella has secrets and it’s clear as day that she’s fighting a downhill battle. She has demons in her life that she’s doing her best to hide, but when they come out and seek to destroy her, she can’t keep her secret any longer.She thinks she’s alone in all of this. She thinks there is no one more powerful than her enemies.The problem is, she has no idea who I really am. Who we are.Maddox, my brother, and our two best friends, Stone and Nyxon and myself, are the biggest monsters out there. And now that we’ve got Ella in our lives, no one will touch her but us.We will burn the world for her.",
  "genres": [
    "Reverse Harem",
    "Dark",
    "Dark Romance",
    "Romance",
    "Mafia Romance",
    "Contemporary",
    "M M Romance"
  ],
  "author": "Bex Dawn",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/60859852-burn"
}