{
  "title": "The One That Got Away",
  "description": "For fans of Colleen Hoover and Rosie this book will break your heart... then put it back together.Two years together. Twenty years apart. One day to change their story.Benjamin's world is turned upside down the day he meets Clara. Instinctively, he knows that she is his person and he is hers, but the events of one devastating night will take their lives in very different directions.20 years later, a bombing is reported in the city where Clara and Ben met, and she is pulled back to a place she tries not to remember and the first love she could never forget. Searching for Ben, Clara prays that twenty years of silence is about to end.But is it too late to put right what went wrong?This is not a love story. But it is a story of first love, of the mistakes people make, and the lengths they'll go to put things right.Praise for The One That Got  'Compelling tale of the power of first love. Hooks you in with a sucker punch and never lets go' Lisa Green'Evocative and beautifully written... I defy anyone who has experienced the heartbreak of first love not to cry when they read it.' Nikki Smith, author of Look What You Made Me Do 'Captures masterfully the magic and devastation of first love... A powerful exploration of the relationships that shape us, this is a nostalgic, fierce and utterly spellbinding read.' Holly Miller 'A powerful page-turner that perfectly portrays the destruction and jealousy of a relationship between two damaged young people, too inexperienced to deal with the intensity of their feelings. A tense, gripping read – I loved it.' Sarah Stovell, author of Other Parents'Moving and gripping.' Eva Woods, author of How To Be Happy 'Absorbing, touching and wise – I raced through it.' Rebecca Wait, author of I'm Sorry You Feel That Way 'Do not let this one get away. It will steal your heart.' Lesley Kara, author of The Dare",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Chick Lit",
    "Coming Of Age",
    "Adult"
  ],
  "author": "Charlotte Rixon",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/60857939-the-one-that-got-away"
}