{
  "title": "Vintage Contemporaries",
  "description": "Slate editor Dan Kois makes his fiction debut with this stunning coming-of-age novel set in New York City, about the power of leaning into the moment, the joys of unexpected life-altering relationships, and learning to forgive ourselves when we inevitably mess everything up.It’s 1991. Em moved to New York City for excitement, adventure, and possibility. The Big Apple, though, isn’t quite what she thought it would be. Working as a literary agent’s assistant, she’s down to her last nineteen dollars but has made two close friends: Emily, a firebrand theater director living in a Lower East Side squat, and Lucy, a middle-aged novelist and single mom. Em’s life revolves around these two wildly different women and their vividly disparate yet equally assured views of art and the world. But who is Em, and what does she want to become?It's 2004. Em is now Emily, a successful book editor, happily married and coping with the challenges of a new baby. Though she barely thinks of her early days in the city, the past suddenly comes back to remind her. Her old friend Lucy wrote a posthumous work that needs a publisher, and her ex-friend Emily has reached out and is eager to reconnect. As they did once before, these two women—one dead, one very alive—force Emily to reckon with her decisions, her failures, and what kind of creative life she wants to lead.A sharp yet reflective story of a young woman coming into herself and struggling to find her place, Vintage Contemporaries is a novel about art, parenthood, loyalty, and fighting for a cause—the times we do the right thing, and the times we fail—set in New York City on both side of the millennium.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Contemporary",
    "Literary Fiction",
    "New York",
    "Audiobook",
    "Coming Of Age"
  ],
  "author": "Dan Kois",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/60857011-vintage-contemporaries"
}