{
  "title": "When a Moth Loved a Bee",
  "description": "New York Times Bestseller, Pepper Winters, delivers a brand new High Fantasy Romance.\n“It’s taking everything I have not to touch you. Not because I want to make you mine but because every part of me screams that you already are.”A pack of wolves hunt a girl who takes her last breath by a river’s edge.She is found and nursed back to health by the kind-hearted Nhil people.She has no memory.No past.And is given a choice that could change her forgotten life forever.A pack of wolves adopt a man who begs for death in the grasslands.Blood revives him. Flesh strengthens him. All while the alpha watches him as if he knows who he is.He has no memory.No past.And yet…he’s drawn toward the smoke of a faraway clan.And in that smoke, he finds a girl with the same mark on her thigh, the same empty mind, and the same forgotten language on her lips.He’s convinced they know each other.She’s certain they are strangers.But the more time they spend together, the more tangled the truth becomes.Their forgetfulness was deliberate.To keep them apart.To keep them lost.To keep them from claiming their true power.Because in that power exists a terrible choice.A choice that could destroy the world……or each other.When a Moth Loved a Bee is the first volume in the Epic Fantasy Romance Destini Chronicles.A heavily romantic, spice-filled fantasy set in a world where life and death, shadows and stars watch over two forbidden lovers whose powers are best left forgotten.Recommended for readers over R18 due to explicit scenes, content, and darker elements.Author Note:This Fantasy is 100% romance. It isn't a quest where they spend most of the book apart. If you want a rich world, magic, intrigue, oodles and oodles of page time with the two characters together, all brimming with longing, forbiddenness, and butterfly-winging moments, then this is the book for you.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fantasy Romance",
    "Paranormal",
    "Dark",
    "Dark Romance",
    "Magic"
  ],
  "author": "Pepper Winters",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/60866133-when-a-moth-loved-a-bee"
}