{
  "title": "How Capitalism Saved America: The Untold History of Our Country, from the Pilgrims to the Present",
  "description": "Here’s the real history of our country. How Capitalism Saved America explodes the myths spun by Michael Moore, the liberal media, Hollywood, academia, and the rest of the anticapitalist establishment.Whether it’s Michael Moore or the New York Times , Hollywood or academia, a growing segment in America is waging a war on capitalism. We hear that greedy plutocrats exploit the American public; that capitalism harms consumers, the working class, and the environment; that the government needs to rein in capitalism; and on and on. Anticapitalist critiques have only grown more fevered in the wake of corporate scandals like Enron and WorldCom. Indeed, the 2004 presidential campaign has brought frequent calls to re-regulate the American economy.But the anticapitalist arguments are pure bunk, as Thomas J. DiLorenzo reveals in How Capitalism Saved America . DiLorenzo, a professor of economics, shows how capitalism has made America the most prosperous nation on earth—and how the sort of government regulation that politicians and pundits endorse has hindered economic growth, caused higher unemployment, raised prices, and created many other problems. He propels the reader along with a fresh and compelling look at critical events in American history—covering everything from the Pilgrims to Bill Gates.And just as he did in his last book, The Real Lincoln , DiLorenzo explodes numerous myths that have become conventional wisdom. How Capitalism Saved America reveals:• How the introduction of a capitalist system saved the Pilgrims from starvation• How the American Revolution was in large part a revolt against Britain’s stifling economic controls• How the so-called robber barons actually improved the lives of millions of Americans by providing newer and better products at lower prices• How the New Deal made the Great Depression worse• How deregulation got this country out of the energy crisis of the 1970s—and was not the cause of recent blackouts in California and the Northeast• And much moreHow Capitalism Saved America is popular history at its explosive best.",
  "genres": [
    "History",
    "Economics",
    "Politics",
    "Nonfiction",
    "American History",
    "American",
    "Historical"
  ],
  "author": "Thomas J. DiLorenzo",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/608640.How_Capitalism_Saved_America"
}