{
  "title": "Under the Moon",
  "description": "A young girl, Clara has been hit with the death of her caregiver and aunt of almost twenty years. The death was expected, but still created a hole in her heart that desperately wanted to be filled. Taking the deed to a new home her aunt left her, Clara travels hundreds of miles away leaving her job as a waitress, few friends, and a boy pining for her affections, in search of a new adventure.Clara finds more than she bargained for when she arrives in Evergreen, a town secretly crawling with Werewolves that don’t take too kindly to strangers. Clara has wolves falling under her spell quickly with her kindness and open heart, creating new friendships and happy customers at her new job.In an unexpected turn of events, Clara has been told she is in a Werewolf community and that she is mated to one of them. Not just any Werewolf, but to a visiting high-ranked Alpha. Future Alpha Kane of the Crimson Shadows.Will Clara be able to tame the wild beast? Kane is ruthless, cutthroat, and covered in tattoos and piercings. His wolf, Torin, is a wolf to be reckoned with. Clara is the last hope to calm him enough to end the long-suffering of his rage and thirst for blood.Not only does Clara find a new life, a mate, and a whole new supernatural world, she finds herself. No longer innocent and naïve she becomes a kick-ass strong heroine who becomes so much more in such little time.♥This is the first book in a series called, Under the Moon, but can be read as a stand-alone. This is also considered an epic novel. Long, slow burn fantasy with spicy twists and cliche romance.♥Book contains mature scenes, sexual encounters and strong language and kidnappings. Not meant for anyone under the age of 18.",
  "genres": [
    "Fantasy",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Werewolves",
    "Paranormal Romance",
    "Vampires"
  ],
  "author": "Vera Foxx",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/60870693-under-the-moon"
}