{
  "title": "Anger Strategies: Practical Tools for Professionals Treating Anger",
  "description": "This book is a valuable aid to counselors, mental health practitioners and health care providers who are working with clients whose anger is causing difficulties in significant areas of their lives. These difficulties may range from how they view and feel about themselves, to parenting skills, partner relationships, job performance, legal issues and overall health. With the foundation of good client assessment and intervention, Anger Strategies will be of great assistance in working with these clients. Some clients may be participating in an anger management group as a consequence of domestic violence or other illegal behaviors that have arisen from their inappropriate expression of anger. Others may be in individual, couples, or family therapy and their anger becomes identified as a crucial clinical issue. Irrespective of the manner in which clients have come to you, their anger has become distorted and twisted and is conveyed in ways that create shame and blame. While some clients are more motivated to change than others, the strategies in this book will assist in both motivation and change. This workbook is composed of seven sections with 42 sessions containing didactic information, reproducible handouts and audio CD. Section titles Anger History Strategies Cognitive Strategies Behavioral Strategies Addiction Strategies Affective Strategies Spiritual Strategies Closing Strategies A sampling of the sessions included Anger's Many Faces - Roles of Anger - Family Gift- Distorted Thinking Styles - Respecting Others - Triggers - Outside Influences - Substances & Anger - Relapse Connection - Hidden Feelings - Practicing Spirituality - Healing & Recovery Tools - Moving On with New Skills. In many of the strategies sections, ideas and formats are presented for structured interventions. The use of handouts in the form of written exercises, checklists, sentence stems, structured dialogues and/or art activities is an integral part of this therapeutic technique. All handouts are designed for clinicians to reproduce and use without restriction as to copyright permission. The audio CD, Imageries, offers structured meditations for recovery. The disc contains four Relaxation Exercise, Inner Child Affirmation, Inner Source of Wisdom, and Letting Go and Receiving. It can be used in a group or individual setting.",
  "genres": [],
  "author": "Claudia Black",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/6086045-anger-strategies"
}