{
  "title": "The Brightest Star",
  "description": "A LIBRARYREADS PICK AND BEST BOOK CLUB PICK OF 2023. The beloved bestselling author of The Color of Air, Women of the Silk,  and The Samurai's Garden returns with this magnificent historical novel based on the life of the luminous, groundbreaking actress Anna May Wong--the first and only Asian American woman to gain movie stardom in the early days of Hollywood.At the dawn of a new century, America is falling in love with silent movies, including young Wong Liu Tsong. The daughter of Chinese immigrants who own a laundry, Wong Liu and her older sister Lew Ying (Lulu) are taunted and bullied for their Chinese heritage. But while Lulu diligently obeys her parents and learns to speak Chinese, Wong Liu sneaks away to the local nickelodeons, buying a ticket with her lunch money and tips saved from laundry deliveries. By eleven Wong Liu is determined to become an actress and has already chosen a stage name: Anna May Wong. At sixteen, Anna May leaves high school to pursue her Hollywood dreams, defying her disapproving father and her Chinese traditional upbringing--a choice that will hold emotional and physical consequences.After a series of nothing parts, nineteen-year-old Anna May gets her big break--and her first taste of Hollywood fame--starring opposite Douglas Fairbanks in The Thief of Bagdad. Yet her beauty and talent isn't enough to overcome the racism that relegates her to supporting roles as a helpless, exotic butterfly or a vicious, murderous dragon lady while Caucasian actresses in yellowface\" are given starring roles portraying Asian women. Though she suffers professionally and personally, Anna May fights to win lead roles, accept risqué parts, financially support her family, and keep her illicit love affairs hidden--even as she finds freedom and glittering stardom abroad, and receives glowing reviews across the globe.Powerful, poignant, and imbued with Gail Tsukiyama's warmth and empathy, The Brightest Star reimagines the life of the first Asian American screen star whose legacy endures--a remarkable and inspiring woman who broke barriers and became a shining light in Hollywood history.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Asian Literature",
    "China",
    "Audiobook",
    "Adult"
  ],
  "author": "Gail Tsukiyama",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/60864071-the-brightest-star"
}