{
  "title": "Harry Potter - Festivities and Feasts",
  "description": "Plan the perfect Harry Potter-themed party with this official entertaining guide, featuring a treasury of crafts, projects, party foods, and activities to help you throw enchanting celebrations inspired by the films. Every event is magical when it's inspired by the imaginative Wizarding World of the Harry Potter films! Bursting with gorgeous photography and sprinkled with fascinating behind-the-scenes film facts, Harry Festivities Feasts offers step-by-step instructions on how to create, craft, and cater six unique Harry Potter-themed events. Packed with fun and unique crafts, recipes, and activities, this book includes complete blueprints for a colorful house-themed birthday party, mysterious magical creatures-themed Halloween party, glittering Yule Ball-inspired soiree, cozy movie marathon, elegant Slug Club-themed mixer, and a charming Harry Potter-inspired wedding reception. Each party includes a complete planning strategy, plus ideas, photos, and instructions for decorating your space, catering your buffet table, sending out invitations, creating favors, planning activities, and more. Crafts and menu are chosen to match the occasion, and include projects like our DIY Sorting Hat, decorations like the Deathly Hallows Wreath, party foods like our color-coded Hogwarts House Pizzas, and games like Quidditch Bean Bag Toss. Each project or recipe is easy to make using common household items and ingredients, and many include free downloadable templates based on the original graphic art from the films. With ideas ranging from simple plans for beginner hosts to more elaborate arrangements for experienced party-planners, you can re-create each party in full or mix and match elements to create your own unique celebration. Whether you're planning a casual small gathering or a large-scale formal event, this book includes everything you need to make your next party an event family and friends will not want to miss.",
  "genres": [
    "Cookbooks",
    "Food",
    "Cooking"
  ],
  "author": "Jennifer Carroll",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/60861547-harry-potter---festivities-and-feasts"
}