{
  "title": "Rescuing Isabelle",
  "description": "Keeping her safe from a deadly cartel might be the easy part of our relationship…As a former NAVY SEAL and Guardian, rescuing Isabelle LaCroix was my job.Falling for her was not.But that didn’t stop me.Boy, did I fall hard.Just my luck… Izzy isn’t looking for happily ever after. Especially not with a guy like me. She’s got big dreams, and she’s as strong, smart, and independent as she is sinfully seductive and sexy.Not even she can ignore the pull of attraction between us, or the way the air sizzles when we’re in the same room.Instead of falling for me, she fights her feelings; and boy does she know how to fight.I’ll do whatever it takes to convince her to take a chance on love—and on me.But first, I have to fix the biggest mistake I’ve ever made. When I rescued Isabelle, I thought she was no longer in danger.I was wrong.The cartel wants Izzy back, and they’re used to getting whatever—and whoever—they want.What they don’t realize is that I’ll burn their entire world to the ground for the woman I love.And nothing will stand in my way.__________________________Rescuing Isabelle is the second book in the exhilarating new BRAVO TEAM series. It’s an angsty, steamy, romantic suspense read, chock-full of edge-of-your-seat action, exciting adventure, and all the protective hero yummy goodness you can handle.It’s hot, H-O-T… HOT!These former Navy SEALs, DELTA Operatives, and Special Ops soldiers turned Guardians & Protectors will capture your heart and leave you breathless.If you’re looking for Heart-Stopping, Pulse-Pounding, Can’t-Stop-Reading Romantic Suspense filled with all of your Swoon-worthy, Passionate and Protective Ex-Military Heroes, and you CRAVE an unputdownable, read-all-night romantic suspense that sweeps you off your feet then you need to read RESCUING ISABELLE!Download today—let BOOKER and the Guardian Hostage Rescue Specialists restore your belief in modern day heroes.No cliffhangers. No cheating. HEA guaranteed. Each book is a stand-alone with a different couple.",
  "genres": [
    "Romance",
    "Suspense",
    "Romantic Suspense",
    "Military Fiction",
    "Military Romance",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Ellie Masters",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/60885324-rescuing-isabelle"
}