{
  "title": "Varina Palladino's Jersey Italian Love Story",
  "description": "“Varina Palladino’s Jersey Italian Love Story is fun and funny, wonderfully exuberant, and incredibly wise. These endearing characters—their voices and stories— will be with me for a long time to come. I didn’t want to say good-bye.” –Jill McCorkle, New York Times bestselling author of HieroglyphicsAn utterly delightful and surprising family drama—think Moonstruck and My Big Fat Greek Wedding set in New Jersey—about a boisterous, complicated Italian family determined to help their widowed mother find a new boyfriend. Lively widow Varina Palladino has lived in the same house in Wyldale, New Jersey, her entire life. The town might be slightly stuck in the 1960s, when small businesses thrived and most residents were Italian, but its population is getting younger and the Palladinos are embracing the change. What Varina’s not embracing, much to her ninety-two-year-old mother’s dismay, is dating. Running Palladino’s Italian Specialties grocery, caring for her mother, and keeping her large, loud Jersey Italian family from killing one another takes up all of Varina’s energy anyway.Sylvia Spini worries about her daughter Varina being left all alone when she dies. Sylvia knows what it is to be old and alone, so when her granddaughter, Donatella, comes to her with an ill-conceived plan to find Varina a man, Sylvia dives in. The three men of the family—Dante, Tommy, and Paulie—are each secretly plotting their own big life changes, which will throw everyone for a loop.Three generations of Paladinos butt heads and break one another’s hearts as they wrestle with their own Jersey Italian love stories in this hilarious and life-affirming ode to love and family.",
  "genres": [
    "Fiction",
    "Romance",
    "Contemporary",
    "Chick Lit",
    "Audiobook",
    "Family",
    "Humor"
  ],
  "author": "Terri-Lynne DeFino",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/60877614-varina-palladino-s-jersey-italian-love-story"
}