{
  "title": "My Professor",
  "description": "Young and naïve—those are his exact words.Professor Barclay views me as a nuisance, a disruption of his otherwise obedient class and perfectly regimented life. His bad impression of me stems from a simple misunderstanding, and when that impression sours from bad to worse, he decides to make an example out of me in front of the entire class. Every other female student in that auditorium looks on, longing to trade places with me, wishing they were the object of his attention. It’s humiliating. I want nothing to do with him or the tension growing between us, but he feels inescapable.Deep down, I know I have a crush on him. It’s a shameful feeling I refuse to give life to.Not that it matters—nothing can come from it. Besides our mutual dislike for one another and the fact that he’s my professor, there’s an age gap that should be warning enough.While we might cross the line once—the dark glance across a dimly lit bar…the metallic sound of the bathroom door locking behind us…his hand slowly sliding up my skirt—I know it’s a boundary I can’t break again. Now, more than ever, he’s off-limits.After four years apart, I’m a brand-new hire at his firm. I’ve convinced myself he won’t remember me. I’m safe here in the wolf’s den.It’s funny, isn’t it? How easily we can delude ourselves if only we want something bad enough.\nNothing has changed.\nThat same friction roils between us. My gaze still flees from the chill of his glacier blue eyes. I try to stay out of his way, to keep my distance, but like always we feel inevitable. Fate seems to think I belong in the arms of my old professor, and raging against fate…well, that’s a battle we’re all bound to lose.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Workplace Romance",
    "College",
    "Second Chance"
  ],
  "author": "R.S. Grey",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/60881607-my-professor"
}