{
  "title": "Good for a Girl: A Woman Running in a Man's World",
  "description": "Fueled by her years as an elite runner and advocate for women in sports, Lauren Fleshman offers her inspiring personal story and a rallying cry for reform of a sports landscape that is failing young female athletes Lauren Fleshman has grown up in the world of running. One of the most decorated collegiate athletes of all time and a national champion as a pro, she was a major face of women's running for Nike before leaving to shake up the industry with feminist running brand Oiselle and now coaches elite young female runners. Every step of the way, she has seen the way that our sports systems--originally designed by men, for men and boys--fail young women and girls as much as empower them. Girls drop out of sports at alarming rates once they hit puberty, and female collegiate athletes routinely fall victim to injury, eating disorders, or mental health struggles as they try to force their way past a natural dip in performance for women of their age.Part memoir, part manifesto, Good for a Girl is Fleshman's story of falling in love with running as a girl, being pushed to her limits and succumbing to devastating injuries, and daring to fight for a better way for female athletes. Long gone are the days when women and girls felt lucky just to participate; Fleshman and women everywhere are waking up to the reality that they're running, playing, and competing in a world that wasn't made for them. Drawing on not only her own story but also emerging research on the physiology and psychology of young athletes, of any gender, Fleshman gives voice to the often-silent experience of the female athlete and argues that the time has come to rebuild our systems of competitive sport with women at their center.Written with heart and verve, Good for a Girl is a joyful love letter to the running life, a raw personal narrative of growth and change, and a vital call to reimagine sports for young women.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Sports",
    "Audiobook",
    "Biography",
    "Feminism",
    "Book Club"
  ],
  "author": "Lauren Fleshman",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/60880793-good-for-a-girl"
}