{
  "title": "The Gardens of Ash",
  "description": "The world of Azadia smolders in restless isolation, molten rivers splitting the earth, and curtains of ash dripping from a scarlet sky. The followers of Alrya - an empire that spans many worlds - believe Azadia to be the hell their faith condemns, but to Draden and his family, it is merely home.Once a feared warlord, Draden now wishes only to maintain a fragile peace in his corner of Azadia. But Draden's contentment ends swiftly when a Tear - a passageway between worlds - splits open in his kingdom, and a stranger comes tumbling through with the fury of Alrya licking at his heels. Draden decides to take the young man in, but Vessels - eerie creatures that appear to be women, wreathed in flowering overgrowth and puppeted by an unknown force - pursue Jak into Draden's kingdom, Lucia. The ensuing battle forces Draden to acknowledge that, as much as he hates to admit it, he can't face this threat alone.As a new war breaks forth from an ancient rivalry, Alrya fights to appease a god that has fallen silent, while the rulers of Azadia form an uneasy alliance against the waves of Alryan forces closing in on them from distant worlds. But even as these tentative new allies help Draden resist invasion, the conflict draws out Draden's own struggles with restless memories and the temptations of power.Meanwhile, Jak, now fleeing Alrya's endless war, seeks a new Tear in hopes that it will lead him to a place where he will be left in peace to study the stars. But his budding feelings for Edim and Tlia, companions met in his travels, and the revelation of his fascinating gift for Blood Craft, a forbidden magic of Azadia, complicate Jak's desire to leave the war-wracked world.Together with Sarien, a famous hero who has put her own adventures on hold to help her half-brother defend Lucia, and Epomina, a mercenary seeking the elusive magic of Storm Craft in a world where strength is all that stands between her and a bloody end, Draden and his allies make their stand.The Gardens of Ash is the first entry in an epic of gothic fantasy.",
  "genres": [
    "Fantasy"
  ],
  "author": "Sarah  Cline",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/60877316-the-gardens-of-ash"
}