{
  "title": "L.A. Noir: The Struggle for the Soul of America's Most Seductive City",
  "description": "Other cities have histories. Los Angeles has legends.Midcentury Los Angeles. A city sold to the world as \"the white spot of America,\" a land of sunshine and orange groves, wholesome Midwestern values and Hollywood stars, protected by the world’s most famous police force, the Dragnet-era LAPD. Behind this public image lies a hidden world of \"pleasure girls\" and crooked cops, ruthless newspaper tycoons, corrupt politicians, and East Coast gangsters on the make. Into this underworld came two men–one L.A.’s most notorious gangster, the other its most famous police chief–each prepared to battle the other for the soul of the city.Former street thug turned featherweight boxer Mickey Cohen left the ring for the rackets, first as mobster Benjamin \"Bugsy\" Siegel’s enforcer, then as his protégé. A fastidious dresser and unrepentant killer, the diminutive Cohen was Hollywood’s favorite gangster–and L.A.’s preeminent underworld boss. Frank Sinatra, Robert Mitchum, and Sammy Davis Jr. palled around with him; TV journalist Mike Wallace wanted his stories; evangelist Billy Graham sought his soul.William H. Parker was the proud son of a pioneering law-enforcement family from the fabled frontier town of Deadwood. As a rookie patrolman in the Roaring Twenties, he discovered that L.A. was ruled by a shadowy \"Combination\"–a triumvirate of tycoons, politicians, and underworld figures where alliances were shifting, loyalties uncertain, and politics were practiced with shotguns and dynamite. Parker’s life mission became to topple it–and to create a police force that would never answer to elected officials again.These two men, one morally unflinching, the other unflinchingly immoral, would soon come head-to-head in a struggle to control the city–a struggle that echoes unforgettably through the fiction of Raymond Chandler and movies such as The Big Sleep, Chinatown , and L.A. Confidential .For more than three decades, from Prohibition through the Watts Riots, the battle between the underworld and the police played out amid the nightclubs of the Sunset Strip and the mansions of Beverly Hills, from the gritty streets of Boyle Heights to the manicured lawns of Brentwood, intersecting in the process with the agendas and ambitions of J. Edgar Hoover, Robert F. Kennedy, and Malcolm X. The outcome of this decades-long entanglement shaped modern American policing–for better and for worse–and helped create the Los Angeles we know today.A fascinating examination of Los Angeles’s underbelly, the Mob, and America’s most admired–and reviled–police department, L.A. Noir is an enlightening, entertaining, and richly detailed narrative about the city originally known as El Pueblo de Nuestra Se–ora la Reina de los Angeles, \"The Town of Our Lady the Queen of the Angels.\"",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Crime",
    "Historical",
    "Noir",
    "Mystery"
  ],
  "author": "John Buntin",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/6088116-l-a-noir"
}