{
  "title": "Mandíbula",
  "description": "Neste romance perturbador e polifônico, terrível e hipnótico, Mónica Ojeda recria um mundo do feminino monstruoso, impiedoso e sem limites, onde perigo e desejo reinam como uma fascinante deusa de duas cabeças.Fernanda, uma insolente estudante do Ensino Médio apaixonada por literatura e filmes de terror, acorda com os pés e as mãos amarrados em uma cabana no meio da floresta. Sua sequestradora, entretanto, não é uma estranha. Trata-se de Miss Clara, a professora de Literatura, uma mulher assombrada pela memória da própria mãe e assediada durante meses por suas alunas do Colégio Bilíngue Delta, uma escola católica de elite. Rapidamente, os motivos do sequestro se revelarão muito mais complexos e sombrios do que a vingança pelos traumas sofridos pela professora.Com um texto imaginativo e surpreendente, a equatoriana Mónica Ojeda cria neste romance não apenas personagens desconcertantes, mas também uma ambientação perturbadora para uma narrativa de nuances e contornos tênues entre o horror, o desejo e a perversidade, investindo nas relações de professoras e alunas, mães e filhas, irmãs e amigas do coração.Aqui, o medo e sua relação com os laços familiares, a sexualidade e a violência que espreita o amor estão expressos, várias vezes literalmente, por meio da mordida feroz e do ataque quase sexual, das brincadeiras dolorosas e da confiança quase dependente entre meninas e mulheres que se conectam, mas também se (a)traem. O rapto revelado já nas primeiras páginas será apenas o começo de uma jornada aterradora e viciante pela escrita de Mónica Ojeda.“Mandíbula é o terceiro romance de Ojeda e a prova irrefutável de sua maestria para contar histórias tecidas com saliva, sangue, pesadelos e rosários de dentes de leite.”MARÍA FERNANDA AMPUERO – El Telégrafo“Um impacto literário, estético e emocional ”MARIANA ENRÍQUEZ – Escritora e jornalista argentina",
  "genres": [
    "Horror",
    "Fiction",
    "Thriller",
    "Queer",
    "LGBT",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Mónica Ojeda",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/60883333-mand-bula"
}