{
  "title": "Inside The Maelstrom: The Complete Duet",
  "description": "THE COMPLETE DUET, NOW AVAILABLE IN ONE VOLUME\"A wondrous whirlwind of a contemporary romance...\" - Amazon Review\n\"Ripped my heart open in the best possible way...\"\n- Amazon Review\n\"I can confidently say this book hit me in my feels right at the core.\"\n- Amazon Review  When a dangerous driving charge gets me put in a fancy rehab for rich kids and socialites, I intended to do my time and then leave. I was going to leave behind the sports star who was addicted to uppers, the coke-head lawyers, and the space cadets. I was going to leave behind him.Hendrick Kenley. Bored, listless, and filthy dirty rich. If there was a waste of oxygen, it was him. My only goal was to avoid him and his beautifully cruel smirk until my time at the Wellness Center was over. I’d get lost in books and the view of the ocean, and then I’d go back to my life.But Fate, that glorious bitch, had other plans. Days before my release, I pick up a book. Jules Verne’s Twenty-Thousand Leagues Under the Sea. In the margins of that tatty paperback was my future, words in smeared ink that spoke to my soul, and I had to find their author. He'd left me clues, and I was going to track him down.Problem was, unlike the rest of the people in the Center, I was poor. My parents had taken out a second mortgage so I could spend my ninety days here, instead of in juvie. I had to make a deal with the Devil, and by the Devil I mean Hendrick Kenley and his cohort of disenchanted fools.The Devil offered me a deal I couldn’t refuse; he’d pay for everything on the trip, travelling on a private planes and staying in fancy hotels, but I had to let him and his friends tag along.There was a reason for the adage that if something sounds too good to be true, it probably is. I’d learn the truth of that the hard way.Inside The Maelstrom is a two part enemies to lovers, reverse harem romance. The protagonists are all in their twenties and this book contains M/M.May contain possibly triggering themes, including those around mental health.",
  "genres": [
    "Contemporary",
    "Reverse Harem",
    "Mental Health"
  ],
  "author": "Grace McGinty",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/60893625-inside-the-maelstrom"
}