{
  "title": "Highland Burn",
  "description": "He’s been betrothed to a supposed spy. Her safety is at stake because she’s aligned with his greatest enemy in the Highlands. An enemy that robbed him of his closest kin.♥ Can they put their traumas behind them and build something new from the ashes of the past? ♥From award-winning author Michelle Deerwester-Dalrymple!Reade MacDonald hates the Campbells and everything they represent. Supporters of a foreign king on the Scottish throne and murderers of his dearest friend, the Campbells are a plague in the Highlands. Brash and thick-headed Highlander warrior Reade does all in his power to subdue the Campbell threat.Then the widow Blair Gordon enters his life.The comely widow is caught in a web not of her making, and once again finds herself at the mercy of powerful men who forcibly decide her fate.Now Blair’s fate is to wed Reade, both for her protection and in hopes she might know something of her dead husband’s treasonous activities.But she knows nothing. And Reade doesn’t believe her. Yet the more time they are forced to spend together, the passionate desire they can’t control becomes louder than any misguided beliefs they have for each other.The past, however, doesn’t like to remain buried, and when the Gordons and Campbells try to use Blair against the MacDonalds, all of Reade’s hopes for a future with her come crashing down and puts all their lives as stake.Can Reade save himself and Blair, and let the ashes of the past remain buried? Or will the conflict in the Highlands wound more than just their hopes for happiness?A steamy Highlander romance with bold heroes, strong heroines, and packed with passion and adventure. Discover Highland Burn and start this Outlander-styled romance today!This eBook includes the full text of the novel plus the following additional content: a link to a free bonus ebook: The Heartbreak of the Glen, an excerpt of book 1 of The Glen Highland Romance To Dance in the Glen, and an excerpt from book 1 in the Celtic Highland Maidens Series, The Maiden of the Storm.The novels in this series are each stand-alone stories and can be read individually in any order, if desired. These historical romances are set in Jacobite Scottish Highlands and do not shy away from steamy scenes, occasional archaic curses, and accurate portrayals of historical violence and life!",
  "genres": [],
  "author": "Michelle Deerwester-Dalrymple",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/60905104-highland-burn"
}