{
  "title": "The Fifth Passenger and Other Perversities",
  "description": "Nine tales of the strange and uncomfortable. Nine stories marked by the darkness of perversity. Unusual tasks and unusual people; decisions, divisions, and nightmarish landscapes. The Fifth Passenger and Other Perversities contains a selection of never-before-published stories from the twisted depths of the mind of Scott R.S. Raphael, the author of A Little Slice and Spruce Road.Contents:\"What Hearts Are Meant to Do\": A man debates whether or not to complete his morbid assignment.\"Figures of Tomorrow\": Three co-workers are invited to meet their boss's wife at his mansion. They quickly discover that she is nothing like any of them had expected.\"Changing Storefronts\": Returning home after a long day, a very important man can't quite put his finger on why it feels like everything has changed.\"He May Not Rise\": Afflicted by sleep paralysis and mentally drained from a stressful living situation, a man struggles to maintain his sanity.\"Storm Coming\": After crashing in a field in the middle of nowhere, a pilot recovers in a strange, dreamlike landscape.\"Biting\": After waking up in a dark and snowy world, not knowing how he got there, a man and his dog try to find home.\"The Red Fox\": A disturbing desire and the childhood memory of a red fox drive the life of a young man as he discovers the violent, twisted thing that he never knew he was looking for.\"Why Couldn't It Have Been Yesterday?\": A woman fights for her survival against mysterious figures who have watched and threatened a group of people from outside a small house. With only two left alive inside, the hunters decide to come in.\"The Fifth Passenger\": Driving home late at night after a road trip to Chicago, a group of friends strike a pedestrian. With no witnesses for miles around, they struggle to decide what to do with the body.",
  "genres": [
    "Suspense",
    "Horror",
    "Fiction",
    "Dark",
    "Adult",
    "Thriller",
    "Supernatural"
  ],
  "author": "Scott R.S. Raphael",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/60905554-the-fifth-passenger-and-other-perversities"
}