{
  "title": "Queen Elizabeth",
  "description": "In this book from the critically acclaimed Little People, BIG DREAMS series, discover the life of Queen Elizabeth II, the longest-reigning monarch of modern times.Little Elizabeth loved dogs and horses and dreamed of living on a farm. But, one day, she heard chants on the streets. Her uncle Edward had renounced the Crown, which meant her father would be the next king, and she heiress to the throne. From that day on, she had to learn how to one day be the queen.When she was only 13, World War Two broke out across the globe. Elizabeth bravely served as an ambulance driver, and after the war ended, she fell in love with and married the charming Prince Philip. In 1952, she was crowned Queen of the United Kingdom, and for the next 70 years she would serve as a beacon of continuity, looking after her subjects and serving the country she reigned over.This moving book features stylish and quirky illustrations and extra facts at the back, including a biographical timeline with historical photos and a detailed profile of the monarch’s life.Little People, BIG DREAMS is a best-selling series of books and games that explore the lives of outstanding people, from designers and artists to scientists and activists. All of them achieved incredible things, yet each began life as a child with a dream.This empowering series offers inspiring messages to children of all ages, in a range of formats. The board books are told in simple sentences, perfect for reading aloud to babies and toddlers. The hardcover versions present expanded stories for beginning readers. Boxed gift sets allow you to collect a selection of the books by theme. Matching games and other fun learning tools provide even more ways to make the lives of these role models accessible to children​​.Inspire the next generation of outstanding people who will change the world with Little People, BIG DREAMS!",
  "genres": [
    "Biography",
    "Nonfiction",
    "Picture Books",
    "Childrens",
    "History"
  ],
  "author": "Maria Isabel Sanchez Vegara",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/60904146-queen-elizabeth"
}