{
  "title": "13 Rue del Percebe",
  "description": "Número 35 de la colección «Súper Humor» de Mortadelo y Filemón. ¡Las últimas novedades de Mortadelo y Filemón recogidas en un solo libro! Este álbum contiene una selección de páginas de la historieta 13 Rue del Percebe. 13, Rue del Percebe es una macroviñeta que muestra un edificio de apartamentos y la comunidad que lo Planta baja Colmado Sené Ubicada a la izquierda, se halla la tienda de ultramarinos de Don Senén, un desconfiado tendero que siempre encuentra modos de engañar a las clientas con el peso y la frescura de la mercancía. La porterí Se encuentra anexa al Colmado Senén, habitada por la cotilla portera de la comunidad de vecinos. El A pesar de tratarse de un ser inerte, es un personaje por derecho propio de igual modo, pues sufre las más diversas peripecias y fenómenos. Tan pronto no funciona bien como es robado como se encoge al mojarse, como está en reparación y es sustituido por variados métodos alternativos... La Frente a la portería habita Don Hurón (Doroteo Hurón), nada más y nada menos que en una alcantarilla. A menudo aparece comentando sus problemas con la portera, generalmente sobre transeúntes despistados que caen por el boquete de la alcantarilla o sobre los intentos de una serie de ratas que viven en el pozo por disputarle la vivienda. Primera planta Primero Es la consulta de un veterinario no muy competente con una variopinta clientela. Primero Vive la mezquina dueña de una pensión continuamente superpoblada. Segunda planta Segundo En este piso habita una anciana de la Sociedad Protectora de Animales que, eterna amante de éstos, no deja de cambiar de mascota. Segundo Es el único piso cuyo inquilino ha cambiado con los años. Tercera planta Tercero En él vive un patoso ladrón llamado Ceferino Raffles que no parece poder dejar de robar cosas inútiles. Tercero Está ocupado por una mujer y sus tres hijos pequeños, incorregiblemente traviesos. Azotea La En ella vive Manolo, un pintor que se encuentra siempre acosado por sus acreedores. El gato y el rató En la azotea se encuentra un gato negro que generalmente es torturado por un cruel ratón que se divierte a su costa. ____________________________________________________ Sobre la coleccióLa colección «Súper Humor» empezó a publicarse en la editorial Bruguera en el año 1975 . Sus números recopilaban aventuras aparecidas anteriormente en la colección «Olé!», mezclando diversos personajes de la casa en un mismo álbum, aunque siempre priorizando los de Ibáñez y Escobar. Posteriormente, en 1987, Ediciones B recuperó la colección manteniendo su formato original hasta 1992 , momento en el que se empezó a hacer distinción por personajes, pudiendo encontrar «Súper Humor» seriados de Mortadelo y Filemón , Superlópez , Zipi y Zape , etc. En la actualidad se publica un único número de «Súper Humor» al año con las últimas novedades de las series de Mortadelo y Filemón y Superlópez .",
  "genres": [
    "Comics",
    "Humor"
  ],
  "author": "Francisco Ibáñez",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/6091454-13-rue-del-percebe"
}