{
  "title": "Goth: Undead Subculture",
  "description": "Since it first emerged from Britain’s punk-rock scene in the late 1970s, goth subculture has haunted postmodern culture and society, reinventing itself inside and against the mainstream. Undead Subculture is the first collection of scholarly essays devoted to this enduring yet little examined cultural phenomenon. Twenty-three essays from various disciplines explore the music, cinema, television, fashion, literature, aesthetics, and fandoms associated with the subculture. They examine goth’s many dimensions—including its melancholy, androgyny, spirituality, and perversity—and take readers inside locations in Los Angeles, Austin, Leeds, London, Buffalo, New York City, and Sydney. A number of the contributors are or have been participants in the subculture, and several draw on their own experiences. The volume’s editors provide a rich history of goth, describing its play of resistance and consumerism; its impact on class, race, and gender; and its distinctive features as an “undead” subculture in light of post-subculture studies and other critical approaches. The essays include an interview with the distinguished fashion historian Valerie Steele; analyses of novels by Anne Rice, Poppy Z. Brite, and Nick Cave; discussions of goths on the Internet; and readings of iconic goth texts from Bram Stoker’s Dracula to James O’Barr’s graphic novel The Crow . Other essays focus on gothic music, including seminal precursors such as Joy Division and David Bowie, and goth-influenced performers such as the Cure, Nine Inch Nails, and Marilyn Manson. Gothic sexuality is explored in multiple ways, the subjects ranging from the San Francisco queercore scene of the 1980s to the increasing influence of fetishism and fetish play. Together these essays demonstrate that while its participants are often middle-class suburbanites, goth blurs normalizing boundaries even as it appears as an everlasting shadow of late capitalism. Contributors : Heather Arnet, Michael Bibby, Jessica Burstein, Angel M. Butts, Michael du Plessis, Jason Friedman, Nancy Gagnier, Ken Gelder, Lauren M. E. Goodlad, Joshua Gunn, Trevor Holmes, Paul Hodkinson, David Lenson, Robert Markley, Mark Nowak, Anna Powell, Kristen Schilt, Rebecca Schraffenberger, David Shumway, Carol Siegel, Catherine Spooner, Lauren Stasiak, Jeffrey Andrew Weinstock",
  "genres": [
    "Nonfiction",
    "Music",
    "Goth",
    "Gothic",
    "Art",
    "Theory",
    "Pop Culture"
  ],
  "author": "Lauren M.E. Goodlad",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/609119.Goth"
}