{
  "title": "Savage Kingdom",
  "description": "Savage Kingdom is the heart-pounding conclusion of the Savage Kingdom Series.My name is Alexandria Donatella McCarthy, or Andie for short. Former daughter of the don of the Rossi syndicate. Abused. Neglected. Overlooked. After five years in exile, I return home to avenge my brother Kellan’s death and to take down my father, Maximillian Rossi, and anyone else who stands in my way. But things don’t work out as I planned. Especially when I come face-to-face with four men from my past. Four men who were once my enemies. Four men who are now my destiny.Keane Agosti, the new head of the Rossi syndicate. The man I love to hate and my future husband.Jaxson West, his psychotic enforcer with a lust for bloodshed. My Grim Reaper. Pain is our foreplay.Rafael Ortiz, my ex-boyfriend and youngest son of the head of the Ortiz Cartel. His sadistic older brother, Alejandro, wants me for his own.And Liam Connelly, the Irish hitman of my family’s enemy, Declan Levine. My angel-turned-devil obsessed with making me his.These four dangerous, brutal, beautiful men call themselves my kings, but it’s time for me to become their queen. I must delve into the darkness in order to win the war against Julio and Alejandro Ortiz. And nothing can stop me. Not even them.Betrayal, lies, and treachery are only the beginning. All the secrets will come to light, and everything will be revealed. Are you ready for the end?Reader’s Note: Savage Kingdom is a dark, enemies to lovers, mafia, reverse harem romance. This book contains dark themes and possible triggers, so please check the TW/CW at the beginning of the book and read at your own discretion. Savage Kingdom is book 3 and the conclusion to the Savage Kingdom Series and ends with a much-deserved HEA. Recommended for mature readers.Savage Kingdom Series#1 Savage Princess#2 Savage Kings#3 Savage KingdomSavage Kingdom was previously published as Savage Hearts (Kingdom of Chaos, Book 3) [Episodes 1-36] It has been completely rewritten, brand new content created, and 10,000+ words added for book form.",
  "genres": [
    "Reverse Harem",
    "Dark Romance",
    "Romance",
    "Mafia Romance",
    "Dark",
    "Contemporary",
    "New Adult"
  ],
  "author": "Jennilynn Wyer",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/60915845-savage-kingdom"
}