{
  "title": "Tears in the Water",
  "description": "A character-driven, slice-of-life contemporary story of love and self-discovery.At White Ravens University, where athletes train to become professional sportspeople, Alex is on the swimming team with her best friend, Xiuying. Having grown up mostly alone, parents absent and brother often busy with his own life, Alex tends not to meet new people unless she and Xiuying are together.After an embarrassing encounter with a boy from the volleyball team Alex soon discovers that the world isn’t so big after all and the universe has a funny way of setting people up, especially when and with whom they’re least expecting. Despite her reserved character, Alex becomes part of a newly formed friend group consisting of four amazing people with different identities and personalities. As she tries to overcome her anxiety and negative past events, Alex finds herself both struggling with romantic feelings for a new acquaintance and a full blown gender crisis.✿✿✿✿✿✿ “A honest and raw story about struggling to find your own identity, with a thoughtful portrayal of neurodivergence and anxiety that doesn't shy away from the ugliness of it. Scialla offers comfort to every outcast that they are worthy of love no matter how messy they are.” — Francesca Tacchi, author of Let the Mountains Be My Grave “Both authentically raw and full of heart — TEARS IN THE WATER will sweep you off your feet. In between wonderfully written explorations of gender and sexuality, Scialla has crafted a story filled to the brim with lovable characters, each with their own struggles to discover and accept themselves. With a sweet romance at the center, be prepared to fall in love with this book. ”— Rafael Nicolás, author of Angels Before Man",
  "genres": [
    "Queer",
    "LGBT",
    "Romance",
    "Contemporary",
    "Transgender",
    "Sports",
    "Young Adult"
  ],
  "author": "Margherita Scialla",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/60909266-tears-in-the-water"
}