{
  "title": "A Death in Denmark",
  "description": "“A fast-paced, emotionally rich, and whip-smart read!”—Sonali Dev, bestselling author of The Vibrant YearsFor fans of the Netflix series Borgen and WWII history buffs, A Death in Denmark is a page-turning Nordic thriller with a cosmopolitan vibe, introducing Gabriel Præst, an ex-Copenhagen cop (with impeccable fashion sense), Blues musician, and pursuer of truth as he explores Denmark's Nazi-collaborator past and anti-Muslim present in this intelligent and stimulating murder mystery.Everyone in Denmark knew that Yousef Ahmed, a Muslim refugee from Iraq, brutally murdered the right-wing politician Sanne Melgaard. So, when part-time Blues musician, frustrated home renovator, and full-time private investigator Gabriel Præst agrees to investigate the matter because his ex--the one who got away--asked him, he knew it was a no-win case.But as Gabriel starts to ask questions, his face meets with the fists of Russian gangsters, the Danish Prime Minister asks him for a favor, and he starts to realize that something may be rotten in the State of Denmark.Wondering if Yousef was framed to heighten the local anti-Muslim sentiment, Gabriel follows a trail back in time to World War II when anti-Semitism was raging during the German occupation of Denmark. Fearing such a mindset has resurfaced, Gabriel rolls up the sleeves of his well-cut suit and gets to work. From the cobblestone streets of Copenhagen to the historic strassen of Berlin where the sounds of the steel-toed boots of marching Nazis still linger, Gabriel finds that some very powerful Danes don't want him digging into the case--as the secrets he unearths could shake the foundations of Danish identity.\"A jazzy murder mystery that digs up Copenhagen's past Nazi ties in the inescapable context of the country's current refugee policies.\" — Iben Albinus, international bestselling and award-winning author of Damascus",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Thriller",
    "Contemporary",
    "Mystery Thriller",
    "Denmark"
  ],
  "author": "Amulya Malladi",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/60916182-a-death-in-denmark"
}