{
  "title": "Perasaan-Perasaan yang Menyusun Sendiri Petualangannya",
  "description": "1baiklah. kujalani saja kutukan iniakan kutulis seribu perasaan tentangmumulai pagi ini hingga kelakketika burung-burung itu tak lagi bersarang di rambutmusaat itulah semua berakhir1.1juga diriku: mencair,menjelma sungai, tak sanggup kauseberangimenjadi kesedihan, kaukenang sepanjang jalan1.2juga dirimu: mencair,datang tiap musim penghujandengan curah yang tetap, tak berubah1.1.1perasaan, aku tak ingin berlebihantapi pernahkah kita kosong. benar-benar kosongdatar tanpa tekanan. tetap. tak berlebihan. tanpa emositak ada sama sekali, bahkan untuk sebaris puisi(Perasaan-Perasaan yang Menyusun Sendiri Petualangannya, 2007).Gunawan Maryanto.Bergiat sebagai penulis dan sutradara dari Teater Garasi: Laboratorium Penciptaan Teater. Saat ini menetap di Jogja. Karya-karya tulisnya berupa prosa dan puisi serta kritik seni pertunjukan terpublikasikan lewat Kompas, Koran Tempo, Media Indonesia, Jawa Pos, Suara Merdeka, Kedaulatan Rakyat, Bernas, BlockNotProse, BlockNotPoetry, On/Off, Jurnal Kolong Budaya, Jurnal Puisi, Jurnal Prosa, Jurnal Cerpen, Jurnal Kalam dan LeBur Theater Quarterly. Bukunya yang telah terbit adalah Waktu Batu (sastra lakon, ditulis bersama Andri Nur Latif dan Ugoran Prasad, IndonesiaTera 2004), Bon Suwung (kumpulan cerpen, InsistPress 2005, Longlist Khatulistiwa Award 2005) dan Galigi (kumpulan cerpen, Penerbit Koekoesan 2007, LongList Khatulistiwa Award 2007). Pada tahun 2004 puisinya yang berjudul Kupanggil Kau Batu mendapat nominasi Anugrah Sih Award dari Jurnal Puisi dan tahun 2007 puisi Jineman Uler Kambang mendapat Anugrah Budaya dari Departemen Kebudayaan dan Pariwisata untuk Media Cetak dan Elektronik katagori puisi. 1 cerpen dan 3 puisinya masuk ke dalam 20 Cerpen Indonesia Terbaik dan 100 Puisi Indonesia Terbaik Anugerah Sastra Pena Kencana 2008 (PT. Gramedia Pustaka Utama). Juga pernah diundang untuk membacakan karyanya di Bienal Sastra Internasional Utan Kayu 2005 dan Ubud Writers and Readers Festival 2006.",
  "genres": [
    "Poetry",
    "Indonesian Literature"
  ],
  "author": "Gunawan Maryanto",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/6091876-perasaan-perasaan-yang-menyusun-sendiri-petualangannya"
}