{
  "title": "Paulo Coelho: A Warrior's Life - The Authorized Biography",
  "description": "Paulo Coelho: A Warrior’s Life is the definitive, authorized biography of one of the world’s most popular and widely read authors—and the story of how his enormously popular novel The Alchemist came to be. Fernando Morais, the preeminent biographer in Brazil and a groundbreaking journalist, traces Coelho’s roots in Brazil to his time as a musician and pop lyricist to his wild days of rock and roll to the publication of the The Alchemist and beyond, telling the true tale of one of the most adored authors of our time.Book DescriptionPaulo Coelho: A Warrior's Life is the first-ever biography of the man whose books have sold an astounding 100 million copies worldwide, making him one of the bestselling authors of all time.Paulo Coelho's life begins with a complicated birth in Rio de Janeiro, Brazil, in August 1947. He was known as the \"boy who was born dead\" and who ultimately survived against all odds. Before he became internationally known as a worldwide bestselling author, Paulo lived many different lives. He flirted with suicide, was committed by his parents to insane asylums, suffered the brutality of electric shock therapy, dove into drugs, tried several varieties of sex, met the devil, spent time in prison, helped revolutionize Brazilian rock with musician Raul Seixas, and finally rediscovered his faith in 1986 as he walked the sacred Road to Santiago de Compostela, a medieval pilgrim's route between France and Spain.Coelho would later describe this life-changing spiritual experience in his first book, The Pilgrimage. The following year, The Alchemist established his worldwide reputation. The novel has already achieved the status of a universally admired modern classic. Now, for the first time, discover the life story of one of the most widely read and adored authors of our time.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Writing",
    "Literary Fiction",
    "Spirituality",
    "Biography Memoir"
  ],
  "author": "Fernando Morais",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/6095360-paulo-coelho"
}