{
  "title": "Squid Pulp Blues",
  "description": "Three novellas of squishy-noir from Jordan Krall.  On the surface, Thompson looks like any other blue collar New Jersey town. But beneath the working class exterior lies a bizarro world of fetishistic crime, sleazy motels, and squid. In these three bizarro-noir novellas, the reader is thrown into a world of murderers, drugs made from squid parts, deformed war veterans, and a mischievous apocalyptic donkey...  THE HABERDASHER  Red Henry Hooper just got out on parole. He meets his friends, fellow small-time criminals Dix Hayden and Grant Minissi, in a cheap motel to drink a couple beers and perhaps plan another job. Things go sour when Grant takes some bad drugs. Meanwhile, in the next room, strange things are happening that will make Henry's day even worse: a woman is missing her feet and a notorious local gangster Robert Hapertas (aka The Haberdasher) is on his way. And he's not pleased...  THE LONGHEADS  Tommy Pingpong knew it was a mistake sending his partner Jake into the meeting with their boss. Now they were on the run from Peachy, a diaper-wearing gangster who would like nothing better than to kill the both of them. On top of that, the deformed war veterans called the longheads are buying up all the guns in town, planning something big that'll have severe implications for the town of Thompson.  THE APOCALYPSE DONKEY  When Simon Palmer took the black envelope from the tall man in the parking lot, he didn't know that this case of mistaken identity would make his day take such a weird turn for the worst. When the man finally realizes that he gave the envelope to the wrong guy, Simon is thrown into a dangerous cat-and-mouse game that finally leads to a sleazy carnival of squid violence...",
  "genres": [
    "Bizarro Fiction",
    "Horror",
    "Short Stories",
    "Crime",
    "Fiction",
    "Lovecraftian",
    "Noir"
  ],
  "author": "Jordan Krall",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/6096862-squid-pulp-blues"
}