{
  "title": "Leaving Fortusa",
  "description": "LEAVING FORTUSA by John Grant A disabled US veteran from Iraq finds in Scotland a bizarrely distorted form of Fairyland and realizes he has lost his own country. A New Yorker learns how to discard the sad times from his life as around him society crumbles. A dream-research laboratory uncovers the true origin of our reality, a secret too dangerous to reveal . . . The powerhouse dystopian novel by a master of fantastic literature. Two children are taught to suppress their imagination. Armies travel back in time to conquer the worlds of the past, there to hold gladiatorial circuses. A man suffers the death penalty over and over for everyone else’s murders, so the victims’ families may have \"closure\" . . . Ten episodes from a horrifying future, with the Decline and Fall of the American Empire as their backdrop. Two karmic tempters dance through myriad different universes in search of ways to engineer the downfall of their enemies here. A rusted ferris wheel standing tall above the desert is a locus for barbarous religious executions. An old woman recalls her childhood loss of innocence about the world in which she lives . . . In the great If This Goes On tradition, an impassioned assault on the seeds of destruction sown within our society. Searing prose conjures a nightmare vision you will never be able to forget. A loner foraging in the graveyard of our civilization comes across what may be all that’s left of human literature . . . One of the most astonishing novels of the new century’s first decade, LEAVING FORTUSA is also one of its most urgent. John Grant is author of some sixty books, of which about twenty-five are fiction, and has received two Hugo Awards, the World Fantasy Award, the Locus Award, and a number of other international literary awards. Under his given name, Paul Barnett, he has written several further books and for a number of years ran the world-famous fantasy-artbook imprint Paper Tiger, for this work earning a Chesley Award (as Best Art Director) and a nomination for the World Fantasy Award.",
  "genres": [],
  "author": "John Grant",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6096792-leaving-fortusa"
}