{
  "title": "Howl of the Wolf",
  "description": "Drako is a planet on the fringe of civilized space. It proves suitable for colonization, but a society of telepathic wolves already occupies the world. When a colony ship lands on Drako, the wolves try to communicate but find no intelligent creatures to speak with them. The wolves watch as colonists develop Drako into a recreation planet for wealthy tourists. Settlers became feudal lords, desert sheiks, oriental samurai, and ordinary peasants depending on their level of investment. After several generations the monarchy revolted against technology and closed Drako to offworld visitors. Distaste for technology mutated into superstitious hatred. Anyone caught with spacer tools or weapons could be executed.In civilized space scientists invented Transfer, a means to insure immortality by moving a human mind into a clone—free of hereditary defects. Every fifty years (a span) an individual qualified for Transfer but the tradeoff was large debt to the Institute. Governments toppled and war left the Institute in total control. Individuals were virtual slaves to Institute rules, but the inventors of Transfer became a threat.When the medical spaceship Zebulon flees from an Institute death sentence, they don’t know an assassin infiltrated the crew. They picked the remote planet of Drako for their exile. They encounter a dying king and hereditary lords who hate spacers. When the king proclaims the Zebulon’s captain his heir, Donovan must compete for the crown to protect his crew. Faced with superstitions, hatred, and eminent danger, the crew must adapt to a feudal society without using modern tools or weapons. Fortunately the Transfer process enhanced the natural talents of each person and might give them an advantage. The wolves make telepathic contact and decide to protect Donovan’s pack from the assassin who is determined to kill their doctor and captain.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Young Adult"
  ],
  "author": "Diane Rapp",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/12883689-howl-of-the-wolf"
}