{
  "title": "The Tale of the Bamboo Cutter",
  "description": "Preface by Donald KeeneTaketori Monogatari, The Tale of the Bamboo Cutter is the oldest surviving Japanese work of fiction; The Tale of Genji (written about 1010) referred to it as the \"ancestor of all romances.\" The names of five suitors, resembling those of members of the Japanese court of the eighth century, have suggested to some scholars that the The Tale of the Bamboo Cutter was conceived of as a satire, but this is not how the work was read in later centuries. Today it is thought of mainly as a children's story, and Kaguya-hime, the heroine, looks in the illustrations as lovable as Snow-White or Cinderella; there is no suggestions of the heartlessness that is perhaps her most memorable feature. Elements in the narrative recall similar tales from other parts of the world. The tests to which the suitors are subjected resemble the riddles asked by the icy Princess Turandot, or we may recall the three caskets among which the suitors had to choose in The Merchant of Venice. Perhaps the most interesting aspect of the tests Kaguya-hime imposes is the humor with which they are related. The second suitor's lyrical description of the magical island of Horai, where he allegedly found the jeweled branch, is interrupted by the mundane demands of the artisans who actually made it. Again, the fourth suitor, at the end of his unsuccessful quest, urges his men to stay away from the vicinity of the house of \"that thief of a Kaguya-hime.\" Such a characterization of the heroine takes us from the realm of the children's story.About thirty-five years ago I first published a translation of The Tales of the Bamboo Cutter in the journal Monumenta Nipponica. A few years later-in the summer of 1965-a Japanese publisher conceived the plan of a book that would incorporate my translation, the translation into modern Japanese by the great novelist Yasunari Kawabata, and illustrations by one of the outstanding contemporary Japanese painters. I decided to take advantage of the opportunity to revise my translation.About this time, I visited an exhibition of kirie (paper-cut pictures) by Masayuki Miyata, and discovered that he had actually completed series of works illustrating The Tale if the Bamboo Cutter. I was delighted that at last it would be possible to realize the project first conceived so many years before. There were still further delays, but at last the book has materialized. [This work] combines the work of unknown Japanese writer of over a thousand years ago, the translation by a master of modern Japanese, illustrations by an outstanding artist, and a translation by an American who has devoted his life to the study of Japanese literature.",
  "genres": [
    "Japan",
    "Classics",
    "Japanese Literature",
    "Fiction",
    "Fantasy",
    "Asia",
    "Fairy Tales"
  ],
  "author": "Anonymous",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/609492.The_Tale_of_the_Bamboo_Cutter"
}