{
  "title": "The Drift",
  "description": "Three ordinary people risk everything for a chance at redemption in this audacious, utterly gripping novel of catastrophe and survival at the end of the world, from the acclaimed author of The Chalk Man\nHannah awakens to carnage, all mangled metal and shattered glass. During a hasty escape from a secluded boarding school, her coach careened over a hillside road during one of the year's heaviest snowstorms, trapping her inside with a handful of survivors, a brewing virus, and no way to call for help. If she and the remaining few want to make it out alive, with their sanity--and secrets--intact, they'll need to work together or they'll be buried alive with the rest of the dead.A former detective, Meg awakens to a gentle rocking. She is in a cable car suspended far above a snowstorm and surrounded by strangers in the same uniform as her, with no memory of how they got there. They are heading to a mysterious place known to them only as \"The Retreat,\" but when they discover a dead man among their ranks and Meg spies a familiar face, she realizes that there is something far more insidious going on.Carter is gazing out the window of the abandoned ski chalet that he and his ragtag compatriots call home. Together, they manage a precarious survival, manufacturing vaccines against a deadly virus in exchange for life's essentials. But as their generator begins to waver, the threat of something lurking in the chalet's depths looms larger, and their fragile bonds will be tested when the power finally fails--for good.The imminent dangers faced by Hannah, Meg, and Carter are each one part of the puzzle. Lurking in their shadows is an even greater threat--one that threatens to consume all of humanity.",
  "genres": [
    "Horror",
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Dystopia",
    "Audiobook"
  ],
  "author": "C.J. Tudor",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/60965424-the-drift"
}