{
  "title": "The Disappeared",
  "description": "A sixteen year old girl falls in love with a Cambodian student.A revolutionary closes the borders of a country for four years. Families, friends, lovers disappear.Kim Echlin’s powerful new novel tells the story of Anne Greves, from Montreal, who meets Serey, a Cambodian student forced into exile when he cannot return home during Pol Pot’s time of terror. Anne and Serey meet in a jazz club where their shared passion for music turns into a passion for each other, against the will of her father. But when the borders of Cambodia open, Serey is compelled to return home, alone, to try to find his family. Left behind, and without word from her lover, Anne tries to build a new life but she cannot forget her first love. She decides to travel to the war-ravaged country that claimed Serey. What she finds there is a traumatized and courageous people struggling to create new freedoms out of the tragedy that claimed their traditional ways, their livelihood, and a seventh of their population.“Despair is an unwitnessed life,” writes Anne as she searches for the truth, about her lover, and about herself. “If we live long enough, we have to tell, or turn to stone inside.”From its first page, The Disappeared takes us into the land of kings and temples, fought over for generations. It reveals the forces that act on love everywhere: family, politics, forgetting. Universal in its questions about how to claim the past, how to honor our dead, and how to go on after those we love disappear, it is a story written in spare and rhythmic prose. The Disappeared is a remarkable consideration of language, truth, justice, and memory that speaks to the conscience of the world, and to love, even when those we love most are gone.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Canada",
    "Romance",
    "Book Club",
    "Asia",
    "War"
  ],
  "author": "Kim Echlin",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/6098557-the-disappeared"
}