{
  "title": "Kissing Cousins",
  "description": "Poppy Amore loved her job waitressing at Good Ol' Days Family Restaurant. No one could ask for a better working environment. After all, her best friend Whitney worked there, and her boss, restaurant owner Mr. Dexter, was a kind, understanding, grandfatherly sort of man. Furthermore, the job allowed Poppy to linger in the company of Mr. Dexter's grandson Swaggart Moretti-the handsome and charismatic head cook at Good Ol' Days.Secretly, Swaggart was far more to Poppy than just a man who was easy to look at. In truth, she had harbored a secret crush on him for years-since her freshman year in high school, in fact. And although the memory of her feelings-even the lingering truth of them-haunted Poppy the way a veiled, unrequited love always haunts a heart, she had learned to simply find joy in possessing a hidden, anonymous delight in merely being associated with Swaggart. Still, Poppy had begun to wonder if her heart would ever let go of Swaggart Moretti-if any other man in the world could ever turn her head.When the dazzling, uber-fashionable Mark Lawson appeared one night at Good Ol' Days, however, Poppy began to believe that perhaps her attention and her heart would be distracted from Swaggart at last. Mark Lawson was every girl's fantasy-tall, uniquely handsome, financially well-off, and as charming as any prince ever to appear in fairy tales. He was kind, considerate, and, Poppy would find, a true, old-fashioned champion. Thus, Poppy Amore willingly allowed her heart and mind to follow Mark Lawson-to attempt to abandon the past and an unrequited love and begin to move on.But all the world knows that real love is not so easily put off, and Poppy began to wonder if even a man so wonderful as Mark Lawson could truly drive Swaggart Moretti from her heart. Would Poppy Amore miss her one chance at happiness, all for the sake of an unfulfilled adolescent's dream?",
  "genres": [
    "Romance",
    "Clean Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Chick Lit",
    "Young Adult"
  ],
  "author": "Marcia Lynn McClure",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/6099957-kissing-cousins"
}