{
  "title": "Shadows of Scandal",
  "description": "She needs a champion willing to scandalize her. He doesn’t need anyone. Scandal turns into seduction when a not-quite-perfect heiress tangles with a lost son of society.An heiress with an imperfection.Spawn of the devil. Willow has suffered the gossip her entire life. She has the requisite pot of gold, but not the perfection that is necessary for an admirable ton match. Which is fine—she resigned herself to spinsterhood long ago. But when a vicious threat rears against her family, she hatches a desperate plan. She needs to find a man to champion her—and then jilt her—no matter what she has to pay him. Her sister’s life depends upon it.An unknowable rogue.Being a guardian—a protector of innocents—is in Jack Thatcher’s blood. He’s the best in the business, even if he’s trying to leave the life behind. He’s making his fortune, has a life of his own choosing where he doesn’t need anyone, and no one really knows him. Paradise.Jack is done with the business of being a guardian—until the day Miss Willow Constantine corners him in an alleyway, begging for his help. He decides to help her, if only to pay off an old debt. Woo and wreck her? That he can do. It isn’t as though they could possibly ever be together.Two souls that will find perfection is what you make of it.It isn’t long before Jack discovers Willow is hiding a barrage of secrets, some that threaten her life, and his protective instinct takes over. In order to save her, he’ll have to get close to her. Too close. Which may just turn the impossible into possible.Don’t miss USA Today bestselling author K.J. Jackson’s next Guardians of the Bones story, a fake relationship Regency romance with high adventure, high seduction, and a happily-ever-after to swoon for.Note: The novels in the Guardians of the Bones series by K.J. Jackson are each stand-alone stories and can be read individually in any order. These historical romances are set in the Regency and Victorian eras, and do not shy away from scenes with steamy heat, occasional naughty language, and moments that might possibly make you squirm.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Regency",
    "Regency Romance"
  ],
  "author": "K.J. Jackson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/60997837-shadows-of-scandal"
}