{
  "title": "Martha Stewart's Encyclopedia of Crafts: An A-to-Z Guide with Detailed Instructions and Endless Inspiration",
  "description": "For nearly 20 years, home crafters have turned to the pages of Martha Stewart Living for all kinds of crafts projects, each presented in the magazine’s inimitable style. Now, the best of those projects, including step-by-step instructions and full-color photographs, have been collected into a single encyclopedia. Organized by topic from A to Z, Martha Stewart’s Encyclopedia of Crafts contains complete instructions and brief histories for more than 30 techniques, detailed descriptions of the necessary tools and materials, and easy-to-copy templates. Martha and her team of crafts editors guide readers through each subject, from botanical pressing and decoupage to rubber stamping and wreaths, with characteristic clarity and unparalleled attention to detail. Crafters of all skill and experience levels will appreciate the many variations presented for each technique. For example, candlemaking presents a comprehensive array of poured, rolled, and cutout candles, including instructions for making your own one-of-a-kind rubber candle molds, floating candles, sand candles, and more. Each craft in the book takes on charming new dimensions with innovations that could come only from the team behind Martha Stewart Living . In addition, each entry in Martha Stewart’s Encyclopedia of Crafts is chock-full of tips and advice. Handy glossaries in the entries--such as a comprehensive gem glossary, a glitter glossary, and a color glossary for making tinted wax--are valuable references that crafters will refer to again and again. What’s more, the Tools and Materials section outlines the best essential supplies that every crafter needs to have on hand, and the Sources pages clue readers in to the vendors and suppliers that the magazine’s crafts editors rely on most. Filled with solid technical know-how, and presented with gorgeous color photographs, this handy guide can be read page by page and kept as a lasting reference by crafters and artisans alike.",
  "genres": [
    "Crafts",
    "Nonfiction",
    "Reference",
    "How To",
    "Art",
    "Sewing",
    "Adult"
  ],
  "author": "Martha Stewart",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/6100839-martha-stewart-s-encyclopedia-of-crafts"
}