{
  "title": "The Book of Air and Shadows",
  "description": "An intellectual property lawyer is at the center of a deadly conspiracy and a chase to find a priceless treasure involving William Shakespeare. As he awaits a killer—or killers—unknown, Jake writes an account of the events that led to this deadly endgame, a frantic chase that began with a fire in an antiquarian bookstore.A distinguished Shakespearean scholar found tortured to death . . . A lost manuscript and its secrets buried for centuries . . . An encrypted map that leads to incalculable wealth . . . The Washington Post called Michael Gruber's previous work \"a miracle of intelligent fiction and among the essential novels of recent years.\" Now comes his most intellectually provocative and compulsively readable novel yet. Tap-tapping the keys and out come the words on this little screen, and who will read them I hardly know. I could be dead by the time anyone actually gets to read them, as dead as, say, Tolstoy. Or Shakespeare. Does it matter, when you read, if the person who wrote still lives? These are the words of Jake Mishkin, whose seemingly innocent job as an intellectual property lawyer has put him at the center of a deadly conspiracy and a chase to find a priceless treasure involving William Shakespeare. As he awaits a killer—or killers—unknown, Jake writes an account of the events that led to this deadly endgame, a frantic chase that began when a fire in an antiquarian bookstore revealed the hiding place of letters containing a shocking secret, concealed for four hundred years. In a frantic race from New York to England and Switzerland, Jake finds himself matching wits with a shadowy figure who seems to anticipate his every move. What at first seems like a thrilling puzzle waiting to be deciphered soon turns into a dangerous game of cat-and-mouse, where no one—not family, not friends, not lovers—is to be trusted. Moving between twenty-first-century America and seventeenth-century England, The Book of Air and Shadows is a modern thriller that brilliantly re-creates William Shakespeare's life at the turn of the seventeenth century and combines an ingenious and intricately layered plot with a devastating portrait of a contemporary man on the brink of self-discovery . . . or self-destruction.",
  "genres": [
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Thriller",
    "Books About Books",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Michael Gruber",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/609801.The_Book_of_Air_and_Shadows"
}