{
  "title": "Qualified: Finding Your Voice, Leading with Character, and Empowering Others",
  "description": "This memoir from the first Black Republican congresswoman in America  shows readers how to own their stories, find their voices, and lead with character as they empower others to do the same.  For so long, women—and Black women in particular—have been taught that they must have a stellar background, the highest degree of education, and the strongest resumé imaginable to earn their place in a society historically dominated by white men. As a result, women have found themselves plagued with anxiety and self-doubt and have felt constricted by this limiting belief of qualification by achievement and the necessity of sporting a flawless track record. These false assumptions have discouraged women from pursuing positions of power and influence for the betterment of their communities, leading to underrepresentation in our institutions and the tragedy of wasted potential. But it doesn’t have to be this way.  Mia Love has devoted her entire life to defeating illusive boundaries and redefining the meaning of “qualified.” The daughter of immigrant parents who sacrificed everything to embrace the American Dream, Love learned that she had something unique and valuable that she could give back to her country—her voice. And now she wants to empower others to do the same.  For years, Love faced intense scrutiny and fielded questions regarding her political party affiliation, her desire to run for office, and her commitment to championing conservative values. In  Qualified , Love explains her answers to these questions by taking readers through her journey from election to her local city council, leading as mayor of Saratoga Springs, and making history in the U.S. House of Representatives serving Utah’s 4th Congressional District from 2015–2019.Her story showcases how we can stay true to our integrity, fearlessly voice our values despite fervent opposition, and begin again after every failure and setback.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Mia Love",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/61030747-qualified"
}