{
  "title": "Liberation Day",
  "description": "NEW YORK TIMES BESTSELLER • “One of our most inventive purveyors of the form returns with pitch-perfect, genre-bending stories that stare into the abyss of our national character. . . . An exquisite work from a writer whose reach is galactic.”—Oprah Daily   Booker Prize winner George Saunders returns with his first collection of short stories since the New York Times bestseller Tenth of December. ONE OF THE BEST BOOKS OF THE The New York Times Book Review, The New Yorker, Oprah Daily, NPR, Time, USA Today, The Guardian, Esquire, Newsweek, Kirkus Reviews, Booklist, Library JournalThe “best short-story writer in English” (Time) is back with a masterful collection that explores ideas of power, ethics, and justice and cuts to the very heart of what it means to live in community with our fellow humans. With his trademark prose—wickedly funny, unsentimental, and exquisitely tuned—Saunders continues to challenge and Here is a collection of prismatic, resonant stories that encompass joy and despair, oppression and revolution, bizarre fantasy and brutal reality.“Love Letter” is a tender missive from grandfather to grandson, in the midst of a dystopian political situation in the (not too distant, all too believable) future, that reminds us of our obligations to our ideals, ourselves, and one another. “Ghoul” is set in a Hell-themed section of an underground amusement park in Colorado and follows the exploits of a lonely, morally complex character named Brian, who comes to question everything he takes for granted about his reality. In “Mother’s Day,” two women who loved the same man come to an existential reckoning in the middle of a hailstorm. In “Elliott Spencer,” our eighty-nine-year-old protagonist finds himself brainwashed, his memory “scraped”—a victim of a scheme in which poor, vulnerable people are reprogrammed and deployed as political protesters. And “My House”—in a mere seven pages—comes to terms with the haunting nature of unfulfilled dreams and the inevitability of decay.Together, these nine subversive, profound, and essential stories coalesce into a case for viewing the world with the same generosity and clear-eyed attention Saunders does, even in the most absurd of circumstances.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Audiobook",
    "Literary Fiction",
    "Science Fiction",
    "Contemporary",
    "Dystopia"
  ],
  "author": "George Saunders",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/61033655-liberation-day"
}