{
  "title": "Slim Aarons: Once Upon A Time",
  "description": "Slim Once Upon a Time is a luxurious photography book presenting the ultimate insider’s view of the lifestyles of the wealthy, privileged, and powerful.“Aarons was a transitional figure at the height of the era of photojournalism, when magazines like Life were read by millions. The public had become fascinated by members of the affluent class, and Aarons captured them in all their splendor.” — Town & CountryIncreasingly heralded for his influence, Slim Aarons has established his place in the pantheon of great postwar photographers. It was Aarons who perfected, if not invented, the environmental portrait while photographing the international elite in their exclusive playgrounds during the jet-set decades of the ‘50s, ‘60s, and ‘70s, carrying out his self-described to document “attractive people doing attractive things in attractive places.”Sexy women in tiny bikinis and handsome men dressed for dinner, fabulous homes and boats, and splendid pools and gardens are the playground of Slim Aarons’s world. You’ll find style and joy in visiting them in this rapturous coffee-table celebration of living well.Join the Duke and Duchess of Windsor for dinner at the Waldorf Astoria. Visit novelist Elizabeth Bowen at Bowen’s Court, her ancestral home in County Cork, Ireland. Jump on a speedboat with actor George Hamilton and his beautiful friends. Pulitzer, Vanderbilt, Hearst, and Ford are just some of the bold-faced names who light up this Who’s Who of society.Presenting Hollywood royalty, European aristocracy, the grandes dames of high society, captains of industry, media moguls, statesmen, and luminaries of various stripes, across a vast geography of opulent and glamorous settings, Slim Aarons’s photographs—some 250 of which are included here—define the legendary class known as the Beautiful People and document a lost era of style, grace, and grandeur.",
  "genres": [
    "Photography",
    "Art",
    "Biography",
    "History",
    "Design",
    "Fashion",
    "Nonfiction"
  ],
  "author": "Slim Aarons",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/61024.Slim_Aarons"
}