{
  "title": "Ex Marks the Perfect Spot",
  "description": "He can’t be the hero.One moment, Chelsea Ember is sitting on a gorgeous, tropical island and sipping a cute drink, but in the next instant, she’s being tossed in the back of a van and spirited away. She’s terrified, desperate, and sure that she will never see her family again…then he rushes to her rescue. Her ex. Her gorgeous, hyper-controlled, heartbreaker of a former lover, Colt Easton.He isn’t the lover she remembers…Suddenly he’s knocking out bad guys and showing a dangerously brutal edge that she never expected. He’s fierce, vicious with the enemy, and there is no sign of the polished and cool businessman she knew before. But the attraction she felt for him since the very beginning—that scorching, consuming desire—is still there. Even if Colt does seem to be a complete stranger.Trapped in paradise, all their secrets will be exposed.Colt met Chelsea while he was working undercover. She never had an opportunity to get to know the real man beneath his mask, and he’s tracked her down because he wants a second chance with the woman he can’t get out of his head. When Chelsea is taken, he knows a boring, good guy won’t be able to help her. But the real Colt can. Time for Chelsea to see just how wild he can be.A lot can happen on a hot island night.Danger stalks Chelsea from every turn. And her best bet of getting off the island alive? Her ex, the most unlikely hero ever. A man who is proving to be a complete badass as they trek through the heart of the island and dodge the foes on their trail. He’s savage, rough, and definitely not a civilized gentleman, but Colt is exactly what she needs in order to stay alive. As they fight to survive, Chelsea realizes that she might just be in danger of falling for him all over again…Author’s Note: When you’re trapped in paradise, you need just the right hero to help save the day. Sometimes, the “right” hero is dangerous and deceptive, and he’s also down to do anything to protect the woman he wants. Prepare for some hot island fun and for two lovers who are about to scorch the tropical night with their passion. A second chance, a lover in disguise, twisting secrets, and some edgy danger are inside EX MARKS THE PERFECT SPOT.",
  "genres": [
    "Romantic Suspense",
    "Second Chance",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Suspense",
    "Second Chance Romance"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/61034535-ex-marks-the-perfect-spot"
}