{
  "title": "Summer Storm",
  "description": "Can a beautiful, free-spirited dancer and a once jaded but now lovesick retired soldier set aside what they want and give in to what they need?Find out in this friends to lovers, age gap romance that sizzles off the page.SUMMERWhy is everyone in a rush to fall in love?My cousin and bestie, Sunny, fell madly in love with the movie star she’s been crushing on since we were kids. They’ve set up house in the Village and have a baby on the way. She’s marvelously happy.I’d like to be marvelously happy, but I’ll settle for one or the other. After all, we get one chance to get things right. I don’t want any divorces or do-overs. I need to be sure the man I choose will not only make my babies but stick around to raise them.Roman Russo might be hot, sweet as cotton candy, and divine on the dance floor, but I know when something feels too good to be true.He’s the first man to give me butterflies and the first to rock my world.But things are moving too fast. I can’t lose my head and make rash decisions.I’ve got a perfect gig in the mountains. It’s temporary. Secluded. Far away from Roman with just enough time to clear my mind.At the end of the summer, if he’s still available---we can reunite with a fresh perspective for our future.Roman’s a reasonable man. I’m sure he’ll understand.ROMANFor as far back as I can remember, I’ve had a way with the ladies. It’s not a brag. When you grow up with sisters, you learn a thing or two about charming the opposite sex.I’ve never been short on girlfriends. But no one has kept my attention long enough to settle down. A restless heart breeds a wandering eye, and I’m not the kind of man who breaks promises.Still, I never lost faith I’d meet the right girl.And I was right. Summer Luna set me straight the moment we met. Like a summer storm, she blew in with a blast of sweltering heat and turned my life upside down.Her indifference intrigued me. Her sass provoked me.She had no time for my charm or game. The more she pushed me away, the harder I fell under her spell.It took months to break down her suspicions, but it was worth it. Summer’s perfect for me. Beneath her tough exterior, I caught a glimpse of the girl of my dreams, and I can’t lose her now.I thought I could play by her rules. I wanted her so badly that I agreed to school my heart and keep things casual.But I should have known better.You don’t make love to a woman like Summer, let her crawl under your skin and give her time to get you out of her system.Maybe I pushed things too far, too fast. A man in love says crazy things.But I’ll be damned if I let her push me out of her life.I’m not a reasonable man. Logic flew out the window when I fell head over heels in love with Summer Luna.Wherever she goes, I go.And this summer, despite her objections, I’m headed into the mountains to be with my woman.Summer is the season for love at Mountain Ridge Resort! Pack your bags and get ready to have the time of your life at this charming, lakeside resort nestled in the Virginia mountains. This summer, our guests are getting much more than they expect, when what starts as a summer getaway ends in love and happily-ever-after! Your reservation is confirmed. Check in today, and join some of your favorite romance authors for 25 unforgettable, steamy, summer love stories.",
  "genres": [
    "Contemporary"
  ],
  "author": "Matilda Martel",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/61050379-summer-storm"
}