{
  "title": "They Whisper in my Blood",
  "description": "Have you ever made a split-second decision that changed the course of your life? When, at one fell swoop, your world glided from one side of a thin veil that was happiness, to the other? Nineteen-year-old honey-eyed Perpetua (Pippa),a tragic, heartbreakingly beautiful Luso-Indian had to do just that and it takes her almost four decades to discover that she was not the decisionmaker after all - someone centuries ago made that decision for her. Can she reach across space and time and rent that veil? Is it too late? Can she ever be happy? Fulfilled? They Whisper in my Blood is a moving love story, a sweeping tale, a panorama of a Portuguese-Indian family's history told through a poignant refrain that is this clan's nemesis. It screams across time and continents. There's murder, girl-child trafficking, a torrid mixed-race affair and homophobia, all of which beget intrigue, sensuousness, heartache . . . but always hope. The characters - visceral, impassioned and deeply flawed - stay with you long after the last page is turned.Fans of authors like Arundhati Roy, Delia Owens and Richard Powers will love this multi-generational story. Nature's spontaneous beauty is reverenced in sentences that weave lush imagery; sentences that resound with stunning prose crafted seemingly by a poet. Sculpted with as bold a hand, is the plot which delivers one hell of a punch. Combining the literary pizzaz of A passage to India, the cultural nuances of characters found in novels like The God of Small Things and The Joy Luck Club , the poignancy of The Bridges of Madison County, the wondrously inspirational, life-affirming plot of A Long Way Home, They Whisper in My Blood captures the deep essence of the struggles endured by those of us who are mangled by tradition, prejudices and superstitions and snobbery.",
  "genres": [
    "Historical Fiction",
    "India"
  ],
  "author": "Franciska Soares",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/61052211-they-whisper-in-my-blood"
}