{
  "title": "Inextricably Tied",
  "description": "Harbinger is reckless.It only makes sense that she keeps the world at arm’s length. No one to answer to. No one to lose. No one to touch her banshee skin and become connected forever.It’s a system that works — even if it means keeping her partner, Flint, from getting any closer to her.Flint is restrained.As Harbinger’s bodyguard, he has to be — until pulling her behind his gargoyle armor accidentally links them. Now Harbinger’s privy to the romantic feelings he’s denied himself for years…And Flint’s no longer the only one connected to her.Agony is unlike anything they’ve ever seen.A night terror extracted from a serial killer, Agony doesn’t care who he hurts — and Flint and Harbinger look like perfect targets.Forced together by circumstance, the three search for the remains of the murderer’s victims…and try to keep from killing each other in the process.But as the mystery comes into focus, the lines between the three of them begin to blur. What started as begrudging partnership becomes as intertwined as their bodies in the dark.The bond between Flint and Harbinger is fraying — but Agony isn’t the only one to blame. Not when Flint and Harbinger have painful histories they’ve spent their whole lives running from.Every step toward uncovering the truth proves that the only way to untangle these complicated webs is to unravel them…and each other.Warning: This 95k novel is an M/M/F romance between a gargoyle, a night terror, and a banshee. It is intended only for adult audiences. Reader discretion is advised.\nContent advisories are listed in the book's front matter and on the author's website.\n **The first book in this duet, \nSkin\n, is included in the paperback version of \nInextricably Tied\n!**",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Monsters",
    "Paranormal Romance",
    "M M F",
    "Reverse Harem"
  ],
  "author": "Aveda Vice",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/61042891-inextricably-tied"
}