{
  "title": "Up With the Sun",
  "description": "A look back at the life of a little-known, C-list celebrity striver who met a bad end in New York City in the 1980s.Dick Kallman was an up-and-coming actor—until he wasn’t. From co-starring in Broadway shows, to becoming part of Lucille Ball’s historic Desilu workshop, and then finally landing his own short-lived primetime TV series, Dick’s star was clearly on the rise. But his roles began to dry up and he faded from the spotlight - until his sensational murder in 1980. Told from the perspective of Matt Liannetto, Dick’s occasional pianist and longtime acquaintance, we see the full story of Dick’s life and death. Liannetto is a talented journeyman pianist, often on the fringes of Broadway history’s most important moments. He’s also a gay man who grew up in an era when that sort of information was closely held, and he struggles with accepting the rapid changes happening in the world around him. Up With The Sun takes readers on a journey that spans more than thirty years, from the studio lots and rehearsal sets of the 1950s to the seedy streets of 1970s Manhattan. It is a busy, bustling world, peopled by a captivating cast of characters all clamoring for a sliver of the limelight. Readers will bump elbows with Sophie Tucker and gossip about Rock Hudson during intermission at Judy Garland’s comeback show. Newsweek has called Mallon a \"master of the historical novel,\" and here he proves himself a veteran of the genre, doing what he does best: conjuring figures from history who feel real enough to walk right off the page. This is a crime story, a showbiz story, a love story, and a deeply moving story about a series of pivotal moments in the history of gay life in the post-war era.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Queer",
    "LGBT",
    "Gay",
    "Historical",
    "Adult"
  ],
  "author": "Thomas Mallon",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/61053701-up-with-the-sun"
}