{
  "title": "Going to Extremes: How Like Minds Unite and Divide",
  "description": "Why do people become extremists? What makes people become so dismissive of opposing views? Why is political and cultural polarization so pervasive in America?In Going to Extremes, renowned legal scholar and best-selling author Cass R. Sunstein offers startling insights into why and when people gravitate toward extremism. Sunstein marshals a wealth of evidence that shows that when like-minded people gather in groups, they tend to become more extreme in their views than they were before. Thus when liberals group get together to debate climate change, they end up more alarmed about climate change, while conservatives brought together to discuss same-sex unions become more set against same-sex unions. In courtrooms, radio stations, and chatrooms, enclaves of like-minded people are breeding ground for extreme movements. Indeed, Sunstein shows that a good way to create an extremist group, or a cult of any kind, is to separate members from the rest of society, either physically or psychologically. Sunstein's findings help to explain such diverse phenomena as political outrage on the Internet, unanticipated \"blockbusters\" in the film and music industry, the success of the disability rights movement, ethnic conflict in Iraq and former Yugoslavia, and Islamic terrorism. Providing a wealth of real-world examples혰sometimes entertaining, sometimes alarming혰Sunstein offers a fresh explanation of why partisanship has become so bitter and debate so rancorous in America and abroad.\nPraise for the hardcover:\n\"A path-breaking exploration of the perils and possibilities created by polarization among the like-minded.\"혰Kathleen Hall Jamieson, co-author of unSpun and Echo Chamber\"Poses a powerful challenge to anyone concerned with the future of our democracy. He reveals the dark side to our cherished freedoms of thought, expression and participation. Initiates an urgent dialogue which any thoughtful citizen should be interested in.\" 혰James S. Fishkin, author of When the People Speak",
  "genres": [
    "Psychology",
    "Politics",
    "Nonfiction",
    "Sociology",
    "Political Science",
    "Leadership",
    "Economics"
  ],
  "author": "Cass R. Sunstein",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/6104547-going-to-extremes"
}