{
  "title": "Because I Need You",
  "description": "From New York Times best-seller Claire Contreras comes a new, sexy stand-alone mafia romance novel . . .Isabel Bonetti –One minute I’m mourning the sudden death of my father, and the next, I’m getting calls from a lawyer saying they needed to read me my father’s will.As far as I know, my father didn’t have much to leave. He was a blue-collar worker, through and through. Or so I thought. Everything topples down at once, the inheritance I’m left with and the truth about what my father did, but the biggest shock of all was finding out he’d married me off to a complete stranger without my consent. By the time I show up at my supposed husband’s nightclub, I’m determined to leave with divorce papers signed, but nothing can prepare me for the man that awaits me on the other side of those doors. Giovanni Masseria –My father has done a lot of messed up stuff, but marrying me off to Charles Bonetti’s daughter, a complete stranger, may take the cake. I didn’t even know old Bonetti had a daughter and I want nothing to do with her or this marriage, until I’m told what staying married to her would mean for the empire I’m slowly trying to build. There’s no harm in staying married a little longer if it means I’ll cash out on those promises. I decide that I’ll cut ties with her as soon as that’s done. That is, until barges into my office demanding a divorce. I wasn’t sure what I’d expected her to be like, but it certainly wasn’t . . . this. A week ago, I didn’t know of her existence, and now, I can’t seem to escape her presence anywhere I go. She doesn’t belong in this world and I know this won’t end well for either of us, but I can’t seem to stop reminding her who I am. Her husband.",
  "genres": [
    "Romance",
    "Mafia Romance",
    "Dark Romance",
    "Enemies To Lovers",
    "Contemporary",
    "Dark",
    "Romantic Suspense"
  ],
  "author": "Claire Contreras",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/61070783-because-i-need-you"
}