{
  "title": "Postcards from Across the Pond: Dispatches from an Accidental Expatriate",
  "description": "Postcards from across The Pond began as a means of keeping in touch with the folks back home in the USA, but it soon expanded into a humorous commentary on British life by an accidental expat. \"Laugh out loud funny regardless of which side of the pond you call home... Bill Bryson move over, there's a new American expat in town with a keen sense of humor.\" Jeff Yeager, author of 'The Ultimate Cheapskate's Road Map To True Riches' \"A very funny book indeed. I was literally laughing out loud whilst reading this book; not only did I enjoy it, but I am now craving more.\" Steve Gillen, moderator of www.ukusforum.com \"I savored the bubbling flavor of this Yankee reaction to Saxon country in the form of perky postcard-style epistles.\" Eileen Swift, former syndicated travel writer for Newsday \"Not only fascinating for Anglophiles who've only visited the 'motherland' on vacation, but very, very funny, too. Joe Queenan and Bill Bryson...watch out!\" Diana Burrell, co-author of 'The Renegade Writer', www.hailbritannia.com \"A lovely, quixotic, affectionate attempt to bring together those 'two nations divided by a common language.' A must for travellers in both directions.\" Gordon Astley, presenter of BBC Southern Counties Radio \"Whether you've been in the UK for decades, or are just about to embark on your journey, sit back and enjoy Mike Harling's unique, entertaining descriptions of his life across the pond.\" Toni Hargis, author of 'Rules Britannia', www.rulesbritannia.com Michael Harling grew up in rural Columbia County in Upstate New York. He has been published in various newspapers and magazines The Writer's Digest, The National Lampoon and The Journal of Forensic Identification. Six years ago, through no fault of his own, he found himself living in Sussex, England where, amazed and amused by the behavior of the British, he began posting his observations on his website. Michael is the father of three sons from a previous marriage. He currently lives in Horsham with his wife, Shonagh. Find out more at www.lindenwald.com",
  "genres": [
    "British Literature",
    "Travel"
  ],
  "author": "Michael  Harling",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/6105903-postcards-from-across-the-pond"
}