{
  "title": "The Monk of Park Avenue: A Modern Daoist Odyssey",
  "description": "Priceless Wisdom from a Modern Tao Te Ching Odyssey“...this book will completely absorb your attention from the beginning...” —Emanuele Pettener, PhD, assistant professor of Italian and writer in residence at Florida Atlantic University#1 New Release in Chinese Poetry, Asian Poetry, and Tao Te ChingA literary memoir like no other, Monk of Park Avenue recounts novelist and martial master Monk Yon Rou’s spiritual journey of self-discovery. Learn from Yon Rou as he tackles tragedy and redemption on an unforgettable soul-searching odyssey.A spiritual journey with extraordinary encounters. Yon Rou’s memoir is a kaleidoscopic ride through the upper echelons of New York Society and the nature-worshipping, sword-wielding world of East Asian religious and martial arts. Monk of Park Avenue divulges a privileged childhood in Manhattan, followed by the bitter rigors of kung fu in China and meditations in Daoist temples. Join Yon Rou’s adventure as he encounters kings, Nobel laureates, and the Mob. Witness this martial master’s incarceration in a high-mountain Ecuadorian hellhole and fight for survival in Paraguay’s brutal thorn jungle. Meet celebrities along the way. A story of love, loss, persistence, triumph, and mastery, The Monk of Park Avenue is peopled with the likes of Milos Forman, Richard Holbrooke, Paul McCartney, Warren Beatty and now-infamous opioid purveyors, the Sackler Family. Yun Rou’s memoir is no mere celebrity tell-all, but a novelist and martial master’s path to self-discovery.The Monk of Park Avenue offers Paths for personal and spiritual growthAnecdotal stories of self-discovery and insights into how to liveAn eloquent, candid exploration of spiritual transformationIf you loved Zen and the Art of Motorcycle Maintenance, To Shake the Sleeping Self, or Lao Tzu by Ursula K. Le Guin, you’ll love The Monk of Park Avenue. Also, be sure to read Monk Yon Rou’s Mad Monk Manifesto, winner of both the Gold & Silver 2018 Nautilus Book Award.",
  "genres": [
    "Buddhism",
    "Spirituality"
  ],
  "author": "Yun Rou",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/61067027-the-monk-of-park-avenue"
}