{
  "title": "Biography of X",
  "description": "From one of our fiercest stylists, a roaring epic chronicling the life, times, and secrets of a notorious artist.When X—an iconoclastic artist, writer, and polarizing shape-shifter—falls dead in her office, her widow, wild with grief and refusing everyone’s good advice, hurls herself into writing a biography of the woman she deified. Though X was recognized as a crucial creative force of her era, she kept a tight grip on her life story. Not even CM, her wife, knew where X had been born, and in her quest to find out, she opens a Pandora’s box of secrets, betrayals, and destruction. All the while, she immerses herself in the history of the Southern Territory, a fascist theocracy that split from the rest of the country after World War II, as it is finally, in the present day, forced into an uneasy reunification. A masterfully constructed literary adventure complete with original images assembled by X’s widow, Biography of X follows a grieving wife seeking to understand the woman who enthralled her. CM traces X’s peripatetic trajectory over decades, from Europe to the ruins of America's divided territories, and through her collaborations and feuds with everyone from Bowie and Waits to Sontag and Acker. And when she finally understands the scope of X’s defining artistic project, CM realizes her wife’s deceptions were far crueler than she imagined.Pulsing with suspense and intellect while blending nonfiction and fiction, Biography of X is a roaring epic that plumbs the depths of grief, art, and love. In her most ambitious novel yet, Catherine Lacey, one of our most acclaimed literary innovators, pushes her craft to its highest level, introducing us to an unforgettable character who, in her tantalizing mystery, shows us the fallibility of the stories we craft for ourselves.",
  "genres": [
    "Fiction",
    "Queer",
    "LGBT",
    "Literary Fiction",
    "Contemporary",
    "Audiobook",
    "Book Club"
  ],
  "author": "Catherine Lacey",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/61068817-biography-of-x"
}