{
  "title": "Room Ten: Praise Times Three",
  "description": "I’m the good twin, the quiet one, the one who hides in the shadows. I never draw attention to myself, never cause my family concern, and most people forget I exist. My sister is my polar opposite in every way. Loud and in the spotlight, she likes to let people believe she’s the bad twin, but I know better.So when I’m mistaken for her, kidnapped and thrust into the spotlight, my three gorgeous rescuers, now bodyguards, are my only protection from the attention I’ve avoided my entire life—and suddenly, I want to be the bad twin.I want THEIR attention.I want THEIR affirmation.I want THEIR praise.They hired us to rescue and protect the twenty-two-year-old kidnapped daughter of a billionaire, but none of us expected to fall in love. We are three men with the complimentary needs and desires, and when we’re not working, we get those needs met at Club Sin. We’ve been members for years, but we’ve never had a pet of our own to accompany us. Finding that one woman has always eluded us.She’s everything we’ve been looking for and more, but we’re on the job, and the number one rule as a bodyguard is Don’t f^ck the Client. Although left unstated, we’re pretty sure rule number two is Don’t take the Client to a Sex Club. But the more time we spend together, holed up in a rancher smack dab in suburbia, the harder it is to ignore our feelings, especially as she becomes more dependent upon us, seeking the comfort and physical touch she never received growing up.She has to know what she’s doing to us. She wants our attention, and she’s got it. But it’s more than that. Our little pet has been lonely her whole life—a quelled bird trapped in a gilded cage with no one to take care of her. We are the men to change that.And as soon as the threat on her life is dealt with, that’s what we aim to do.She’s ours to protect, ours to cherish, ours to adore.If she’ll have us, we’ll claim her in a safe space called Club Sin.You're invited to Room Ten.",
  "genres": [
    "Reverse Harem",
    "BDSM",
    "Romance",
    "Contemporary",
    "Military Fiction",
    "Erotica"
  ],
  "author": "Kameron Claire",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/61067362-room-ten"
}