{
  "title": "The Mistress of Bhatia House",
  "description": "Bombay’s only female solicitor, Perveen Mistry, grapples with class divisions, sexism, and complex family dynamics as she seeks justice for a mistreated young woman in this thrilling fourth installment in Sujata Massey’s award-winning series.India, 1922: Perveen Mistry is the only female lawyer in Bombay, a city where child mortality is high, birth control is unavailable and very few women have ever seen a doctor.Perveen is attending a lavish fundraiser for a new women’s hospital specializing in maternal health issues when she witnesses an accident. The grandson of an influential Gujarati businessman catches fire—but a servant, his young ayah, Sunanda, rushes to save him, selflessly putting herself in harm’s way. Later, Perveen learns that Sunanda, who’s still ailing from her burns, has been arrested on trumped-up charges made by a man who doesn’t seem to exist.Perveen cannot stand by while Sunanda languishes in jail with no hope of justice. She takes Sunanda as a client, even inviting her to live at the Mistry home in Bombay’s Dadar Parsi colony. But the joint family household is already full of tension. Perveen’s father worries about their law firm taking so much personal responsibility for a client, and her brother and sister-in-law are struggling to cope with their new baby. Perveen herself is going through personal turmoil as she navigates a taboo relationship with a handsome former civil service officer.When the hospital’s chief donor dies suddenly, Miriam Penkar, a Jewish-Indian obstetrician, and Sunanda become suspects. Perveen’s original case spirals into a complex investigation taking her into the Gujarati strongholds of Kalbadevi and Ghatkopar, and up the coast to Juhu Beach, where a decadent nawab lives with his Australian trophy wife. Then a second fire erupts, and Perveen realizes how much is at stake. Has someone powerful framed Sunanda to cover up another crime? Will Perveen be able to prove Sunanda’s innocence without endangering her own family?",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "India",
    "Historical",
    "Mystery Thriller",
    "Historical Mystery"
  ],
  "author": "Sujata Massey",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/61068991-the-mistress-of-bhatia-house"
}