{
  "title": "Here and Queer",
  "description": "Here and Queer is a helpful, friendly guide full of support and advice about living your best queer life, written for girls. This vibrant, inclusive guide, designed for all kinds of girls, is designed to help you be the strongest, proudest, happiest version of yourself! A celebration of the gift of queerness, it's packed full of heartfelt advice, comforting stories, and stylish illustrations, and will give you the tools you need to explore your own identity, on your own terms.Author and YouTuber Rowan Ellis uses her personal experience to take you through queer life, from coming out and dealing with tough stuff, right through to finding friendships and celebrating Pride. There are also brilliant guest essays from contributors across the LGBTQ+ spectrum.The book opens with guidance on understanding how you feel as a queer girl. From choosing your pronouns to navigating different labels and identities, Ellis helps girls understand that they are in control of their own identity, and that it's ok to not be sure straight away.Moving onto a glossary of queer terms, Here and Queer helps introduce girls to the rainbow of definitions and terms which help queer people understand who they are and how they feel. The book then moves onto advice on coming out, for many one of the hardest steps to take on their journey to truly living their best lives.Following are chapters on sex and romance, including helpful advice about your first time, as well as guides on consent and knowing how to make sure you build a healthy and supportive relationship with your partner.There are also sections on dealing with bullies and stigma, finding your community, and looking after your mental health, including advice on how to help you find extra support if you need it. The book also has more information on queer ladies in history, and on the fight for equality undertaken by brave activists throughout history and today.Stylishly designed with cool illustrations, this helpful, friendly guide will help all queer girls navigate the challenges of discovering and embracing their identities and flourishing in their own skins!",
  "genres": [
    "Nonfiction",
    "LGBT",
    "Queer",
    "Lesbian",
    "Feminism",
    "Self Help",
    "Graphic Novels"
  ],
  "author": "Rowan Ellis",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/61069879-here-and-queer"
}