{
  "title": "Suferință și extaz",
  "description": "Martha Friel împlinește patruzeci de ani. Cândva, lucra la Vogue și plănuia să scrie un roman. Acum, scrie pe internet. A locuit o vreme la Paris. Acum, locuiește în Oxford, într-o comunitate restrânsă. Este singura persoană care nu are un doctorat, un copil sau pe amândouă. Stă într-o casă pe care o urăște, dar din care nu se îndură să plece. Și totuși, trebuie să plece acum, când soțul ei, Patrick, genul care gătește, o iubește necondiționat și nu și-a dorit niciodată altceva decât să o facă pe ea fericită, a plecat.Pentru că ceva este în neregulă cu Martha, și asta, de multă vreme. La șaptesprezece ani, o mică bombă s-a declanșat în creierul ei și de atunci, n-a mai fost niciodată aceeași. Și cu toți doctorii și nesfârșitele terapii, cu toate medicamentele pe care le-a luat, tot nu știe care e problema, de ce petrece zile întregi incapabilă să se ridice din pat și de ce îi rănește pe ceilalți cu remarcile ei crude.Martha se refugiază în casa copilăriei, o locuință londoneză boemă (și decrepită), alături de mama ei, o sculptoriță minoră (și o băutoare de calibru) și de tatăl său, un poet celebru (deși nepublicat), încercând să supraviețuiască fără sora ei cea devotată, care, cândva, făcea suportabil tot haosul din casă.Dar poate că, luând viața de la capăt, Martha va reuși să scrie un final fericit și să descopere că, de fapt, povestea ei nu se termină aici.„Un roman incredibil de amuzant și de tulburător... însuflețit adesea de o energie debordantă. Și totuși, reușește să fie sensibil și înduioșător și să ofere imagini nuanțate asupra a ceea ce înseamnă să faci schimbări și concesii, chiar dacă pentru aceasta trebuie să începi din nou, de la zero.“ The Guardian„Meg Mason excelează în acest roman impresionant, o poveste despre descoperirea de sine a unei femei, în lupta cu boala mintală... Spirituală și puternică, povestea emoționantă a Marthei îi va încânta pe fanii lui Sally Rooney.“ Publishers Weekly",
  "genres": [
    "Fiction",
    "Contemporary",
    "Mental Health",
    "Literary Fiction",
    "Book Club",
    "Audiobook",
    "Adult"
  ],
  "author": "Meg Mason",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/61075820-suferin-i-extaz"
}