{
  "title": "A Tall Dark Trouble",
  "description": "Practical Magic meets Erika L. Sanchez in this dazzling YA fantasy about a Cuban American family of brujas who get entangled in love, magic, and murder, alternating between 1980s Cuba and present-day Miami. Twin sisters Ofelia and Delfi know better than to get involved with magic. Their Mami has seen to that. After all, it was magic that cursed their family, turning love into a poison. Romance is off the table for the Sanchez women. They’ve seen the curse take hold enough times to know how that road ends. And yet. Sometimes a girl catches feelings and just can’t help herself. When Ofelia and Delfi begin having premonitions of a series of murders, the sisters know it is time to embrace their magical inheritance to get to the bottom of the mystery and save innocent lives. Teaming up with their best friend Ethan and with brooding detective-in-training Andres, the sisters set out to learn the truth. They just need to make sure Mami doesn’t find out what they’re up to.Meanwhile, in 1980 Cuba, Anita struggles with a different magical conflict. Her mother, Mama Orti, is a bruja who belongs to a secret coven of elders and Anita knows she will be forced to join the coven herself one day. She sees no escape, though the thought of staying and letting this future claim her is terrifying. Ofelia, Delfi, and Anita’s stories collide as each woman steps into her power and embraces who she truly is, refusing to be subdued by any person, coven, or curse.In this stunning YA contemporary fantasy, debut author Vanessa Montalban explores the interlocking struggles of three generations of women in one family. An unputdownable debut for anyone who roots for magic, sisterhood, and love.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Witches",
    "Fiction",
    "Paranormal",
    "Young Adult Fantasy"
  ],
  "author": "Vanessa Montalban",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/61069650-a-tall-dark-trouble"
}