{
  "title": "Haven Lost (The Guard Trilogy Extended Series, Book 5) The Guards of Haven",
  "description": "Happy New Year—not! Fate, destiny, purpose… what does it all mean?For Lynn, it means being a loving wife, a protective mother, a loyal friend… and now the hidden ace in the hole for a host of earthbound Angels. It also means putting her marriage, her friendships, and her own self-preservation, through the supernatural ringer. When self-centered, popular restaurateur Kristopher Snow, hidden member of the Earthbound Seraphim and one of the seven Guards of Haven, goes missing… Lynn offers up the use of her celestial radar abilities to aid in locating the lost Angel.Who could have predicted that being related to a preternatural being could be so perilous? DNA doesn’t always make you family, but in Lynn’s case it sure does link you to a sizeable legion of otherworldly beings… beings who right now need her gifts in their time of crisis. Unfortunately, there are others of their kind who seek to use Lynn’s abilities to guarantee anarchy ensues. Would you agreed to help these outsiders, these earthbound Angels, knowing that doing so could put not only yourself—but possibly everyone you love, in danger? Are the risks worth the gains, worth the benefit of their protection? What if those who you aid today become the saviors you end up needing in the not so distant future?This novel, like the others in succession, is not a standalone story.Book 5, Haven Lost, is the next in The Guard Trilogy Extended Series - The Guards of Haven. Although the original three books of The Guard Trilogy can stand alone as a complete story, and even though these next novels adhere to the original storyline, readers should complete the trilogy before going on to read the next books in the extended series.",
  "genres": [],
  "author": "N.L. Westaway",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/61092711-haven-lost-the-guard-trilogy-extended-series-book-5-the-guards-of-hav"
}