{
  "title": "Caper Crush",
  "description": "* DISTINGUISHED FAVORITE - ROMANTIC COMEDY - 2023 Independent Press Award“This is a brilliant mix of opposites attract and romcom mystery, too. With great characters, clues and relationship dramas to entertain you. . .” - Splashes Into Books Blog “I love a slow burn romance and this definitely hits its mark. William is so reserved and I love how this fits in with Miranda . . . (I love those awkward moments in a romance but so much more in a slow burn) . . . This is definitely my kind of book, it’s so uplifting to read, funny, Miranda is just hilarious, I had tears of laughter so many times.”- Tara’s Bookish Blog A feel-good, opposites-attract, slow-burn romantic comedySomebody stole my painting! The one I need for the career-defining Vertex Art Exhibit. This upcoming art show is my chance to finally be recognized as an artist--after ten years of waitressing and being asked if I still have that \"lovely painting hobby.\"I have mere weeks to find my painting or lose my artist dream forever--but it's going to mean working with William .William Haruki Matsumura. Good-looking, if you like the Secret Service type. You know, law-abiding, protector of women and children. That's all fine, but I never know what he's thinking. Which drives me crazy.He insists on coming along to do \"damage control.\" As if \"accidentally\" wandering into certain areas is \"breaking and entering.\" I may be an emotional artist, but William shouldn't dismiss my investigative skills yet.William is definitely my opposite, and if there's one takeaway from my parents' divorce, it's that opposites might attract, but it doesn't last. But detecting with William is kind of fun--and fluttery. I definitely can't trust these feelings, or can I? However this caper ends, I think this may be more than a crush.*Caper Crush is the third stand-alone book in the romantic comedy series, New York Friendship.",
  "genres": [
    "Romance",
    "Mystery",
    "Contemporary",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Kathy Strobos",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/61085932-caper-crush"
}