{
  "title": "Now You See Us",
  "description": "The story of three women who work in the homes of Singapore’s elite and band together to solve a murder mystery involving one of their own The wealthy island nation of Singapore seems like an oasis of luxury and order, but it owes everything to the immigrant women no one sees. Corazon, Donita, and Angel are Filipina domestic workers—part of the wave of women sent to Singapore to be cleaners, maids, and caregivers in its decadent homes.A veteran domestic worker, Corazon had retired back to the Philippines for good, but she has returned to Singapore under mysterious circumstances. Now she’s keeping a secret from her wealthy employer, who is planning an extravagant wedding for her socialite daughter.Barely out of her teens, this is Donita’s first time in Singapore, and she’s had the bad luck to be hired by the notoriously fussy Mrs. Fann. Brazen and exuberant, Donita’s thrown herself into a love affair with an Indian construction worker and started a lively social media account that says more than it should.Working as an in-home caregiver for an elderly employer, Angel is feeling blue after a recent breakup with the woman she loves. She’s alarmed when her employer’s son suddenly brings in a new Filipina nurse who may be a valuable ally, or who may be meant to replace her.Then an explosive news story shatters Singapore’s famous tranquility—and sends a chill down the spine of every domestic worker: Flordeliza Martinez, a Filipina maid, has been arrested for murdering her female employer. The three women don’t know the accused well, but she could be any of them; every worker knows stories of women who were scapegoated or even executed for crimes they didn’t commit.Shocked into action, Donita, Corazon, and Angel will use their considerable moxie and insight to piece together the mystery of what really happened on the day Flordeliza’s employer was murdered. After all, no one knows the secrets of Singapore’s elite like the women who work in their homes.",
  "genres": [
    "Fiction",
    "Mystery",
    "Contemporary",
    "Mystery Thriller",
    "Asia",
    "Audiobook",
    "Thriller"
  ],
  "author": "Balli Kaur Jaswal",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/61102596-now-you-see-us"
}