{
  "title": "The Devil's Element: Phosphorus and a World Out of Balance",
  "description": "The New York Times best-selling author on the source of great bounty—and now great peril—all over the world.Phosphorus has played a critical role in some of the most lethal substances on earth: firebombs, rat poison, nerve gas. But it’s also the key component of one of the most vital: fertilizer, which has sustained life for billions of people. In this major work of explanatory science and environmental journalism, Pulitzer Prize finalist Dan Egan investigates the past, present, and future of what has been called “the oil of our time.”The story of phosphorus spans the globe and vast tracts of human history. First discovered in a seventeenth-century alchemy lab in Hamburg, it soon became a highly sought-after resource. The race to mine phosphorus took people from the battlefields of Waterloo, which were looted for the bones of fallen soldiers, to the fabled guano islands off Peru, the Bone Valley of Florida, and the sand dunes of the Western Sahara. Over the past century, phosphorus has made farming vastly more productive, feeding the enormous increase in the human population. Yet, as Egan harrowingly reports, our overreliance on this vital crop nutrient is today causing toxic algae blooms and “dead zones” in waterways from the coasts of Florida to the Mississippi River basin to the Great Lakes and beyond. Egan also explores the alarming reality that diminishing access to phosphorus poses a threat to the food system worldwide—which risks rising conflict and even war.With The Devil’s Element, Egan has written an essential and eye-opening account that urges us to pay attention to one of the most perilous but little-known environmental issues of our time.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Nature",
    "Environment",
    "Audiobook",
    "Chemistry"
  ],
  "author": "Dan Egan",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/61089465-the-devil-s-element"
}