{
  "title": "Homo Cosmicus 2: Titan: A Science Fiction Novel",
  "description": "2nd Book in Sci-Fi Series Is Set on Saturn’s MoonHomo Cosmicus-2: Titan is a sci-fi novel, sui generis, a sequel to the first Homo Cosmicus novel. It’s something like Arthur Clarke’s Odysseys, which, after his words, are not direct continuations one to the other.The action takes place mostly on Titan, Saturn’s satellite, in 2069. The Earth’s civilization rises to the dawn of a type-II civilization on the Kardashev scale, a civilization having full use of its solar system’s planets and satellites. Titan turns out to be the mankind’s golden mine. Interplanetary trade relies exclusively on Titan as the key hub. From here, massive deliveries of hydrogen and nitrogen depart to the colonies on Mars, Venus, the asteroids, and Jupiter’s and Saturn’s satellites. The settlements on them accelerate their rates together with the exploring expeditions there.The private corporation CSC and NASA have launched 10 scientists on a mission to Titan. They get their inspiration from their own discoveries which the wrapped in dusk and mystery satellite conceals. And at that moment, all of a sudden, deaths begin to occur one after another. Are they murders or just accidents? One by one, the mission’s members die ominously and mysteriously. The things coarsen more and more until the moon inhabitant Dr. Eddie Roberto disentangles the tangle of crimes. The weird deaths follow fix sequence, the sequence of a minstrel song known to us from Agatha Christie. And what will Earth with its new civilization of GMO men, cyborgs, and androids look like? What kind of civilization it is? What is its future?About the Author: Todor Bombov is a customs officer with 30 years’ service in the pearl of the Black Sea, the historic city of Varna, Bulgaria, which has had a highly developed culture for over 6,500 years. This is his fourth book.",
  "genres": [
    "Drama",
    "Novels",
    "Contemporary",
    "Book Club",
    "Science Fiction"
  ],
  "author": "Todor Bombov",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/61085357-homo-cosmicus-2"
}