{
  "title": "Foolproof: Why Misinformation Infects Our Minds and How to Build Immunity",
  "description": "Winner of the 2024 APA William James Book Award • Winner of the 2024 Harvard Goldsmith Book Prize • Winner of the 2024 Nautilus Book Award (Silver) • A Next Big Idea Club Must-Read • A Financial Times Best Book of the Year 2023 • One of Nature’s best science picksInformed by decades of research and on-the-ground experience advising governments and tech companies, Foolproof is the definitive guide to navigating the misinformation age. From fake news to conspiracy theories, from inflammatory memes to misleading headlines, misinformation has swiftly become the defining problem of our era. The crisis threatens the integrity of our democracies, our ability to cultivate trusting relationships, even our physical and psychological well-being―yet most attempts to combat it have proven insufficient. In Foolproof , one of the world’s leading experts on misinformation lays out a crucial new paradigm for understanding and defending ourselves against the worldwide infodemic. With remarkable clarity, Sander van der Linden explains why our brains are so vulnerable to misinformation, how it spreads across social networks, and what we can do to protect ourselves and others. Like a virus, misinformation infects our minds, exploiting shortcuts in how we see and process information to alter our beliefs, modify our memories, and replicate at astonishing rates. Once the virus takes hold, it’s very hard to cure. Strategies like fact-checking and debunking can leave a falsehood still festering or, at worst, even strengthen its hold. But we aren’t helpless. As van der Linden shows based on award-winning original research, we can cultivate immunity through the innovative science of “prebunking”: inoculating people against false information by preemptively exposing them to a weakened dose, thus empowering them to identify and fend off its manipulative tactics. Deconstructing the characteristic techniques of conspiracies and misinformation, van der Linden gives readers practical tools to defend themselves and others against nefarious persuasion―whether at scale or around their own dinner table. 35 illustrations",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Politics",
    "Science",
    "Sociology",
    "Society",
    "Self Help"
  ],
  "author": "Sander van der Linden",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/61089459-foolproof"
}