{
  "title": "Against the World: Anti-Globalism and Mass Politics Between the World Wars",
  "description": "A brilliant, eye-opening work of history that speaks volumes about today’s battles over international trade, immigration, public health and global inequality. Before the First World War, enthusiasm for a borderless world reached its height. International travel, migration, trade, and progressive projects on matters ranging from women’s rights to world peace reached a crescendo. Yet in the same breath, an undercurrent of reaction was growing, one that would surge ahead with the outbreak of war and its aftermath. In Against the World , a sweeping and ambitious work of history, acclaimed scholar Tara Zahra examines how nationalism, rather than internationalism, came to ensnare world politics in the early twentieth century. The air went out of the globalist balloon with the First World War as quotas were put on immigration and tariffs on trade, not only in the United States but across Europe, where war and disease led to mass societal upheaval. The “Spanish flu” heightened anxieties about porous national boundaries. The global impact of the 1929 economic crash and the Great Depression amplified a quest for food security in Europe and economic autonomy worldwide. Demands for relief from the instability and inequality linked to globalization forged democracies and dictatorships alike, from Gandhi’s India to America’s New Deal and Hitler’s Third Reich. Immigration restrictions, racially constituted notions of citizenship, anti-Semitism, and violent outbursts of hatred of the “other” became the norm―coming to genocidal fruition in the Second World War. Millions across the political spectrum sought refuge from the imagined and real threats of the global economy in ways strikingly reminiscent of our contemporary political new movements emerged focused on homegrown and local foods, domestically produced clothing and other goods, and back-to-the-land communities. Rich with astonishing detail gleaned from Zahra’s unparalleled archival research in five languages, Against the World is a poignant and thorough exhumation of the popular sources of resistance to globalization. With anti-globalism a major tenet of today’s extremist agendas, Zahra's arrestingly clearsighted and wide-angled account is essential reading to grapple with our divided present. 30 illustrations",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "World History",
    "Economics",
    "War",
    "20th Century"
  ],
  "author": "Tara Zahra",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/61089447-against-the-world"
}