{
  "title": "The Soldier and the Bodyguard",
  "description": "Someone wants JC dead, and Adrian is the only thing standing in the way. Has war followed them home? Or is something more sinister at play?JC struggles to understand his place in the world, and despite being wealthy beyond imagination, he’s never found real happiness outside of his friendship with Adrian. Enlisting in the army is his attempt at finding purpose, but tragedy strikes, and only the Ellery Veterans Center can help put back the pieces of his shattered life. With a bullet fragment in his brain and seemingly no chance of ever being the man he once was, he begins to lose hope.Adrian didn’t hesitate to follow his best friend to war, but with their unit decimated in an ambush and JC bleeding into the dirt, Adrian buries his hopes for the future to keep the man he loves safe. Acting as JC’s bodyguard means he is secure for now, but threats from an unknown person escalate to attempted murder, and Adrian has no choice but to take JC and run. When the Sanctuary Foundation intervenes and takes them into their care, they might be safe, but revealed secrets could destroy everything.Sometimes, even if love finds a way through tragedy, it can be impossible to imagine forever.This book features characters from my action-adventure romantic suspense Sanctuary series, but you do not have to have read Sanctuary to enjoy this story. This best-friend-to-lover, hurt-comfort romance has bodyguards, threats, found family, and a guaranteed love-filled happily ever after.This book features characters from my action-adventure romantic suspense Sanctuary series, but you do not have to have read Sanctuary to enjoy this story. This best-friend-to-lover, hurt-comfort romance has bodyguards, threats, found family, and a guaranteed love-filled happily ever after.",
  "genres": [
    "M M Romance",
    "Romance",
    "Friends To Lovers",
    "Military Fiction",
    "Mystery",
    "Crime",
    "LGBT"
  ],
  "author": "R.J. Scott",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/61088169-the-soldier-and-the-bodyguard"
}