{
  "title": "The Beach at Summerly",
  "description": "New York Times bestseller Beatriz Williams returns with a ravishing summer read, taking readers back to a mid-century New England rich with secrets and Cold War intrigue.June 1946. As the residents of Winthrop Island prepare for the first summer season after the sacrifice of war, a glamorous new figure moves into the guest cottage at Summerly, the idyllic seaside estate of the wealthy Peabody family. To Emilia Winthrop, daughter of Summerly’s year-round caretaker and a descendant of the island’s settlers, Olive Rainsford opens a window into a world of shining possibility. While Emilia spent the war years caring for her incapacitated mother, Olive traveled the world, married fascinating men, and involved herself in political causes. She’s also the beloved aunt of the two surviving Peabody sons, Amory and Shep, with whom Emilia has a tangled romantic history.As the summer wears on, Emilia develops a deep rapport with Olive, who urges her to leave the island for a life of adventure, while romance blossoms with the sturdy and honorable Shep. But the heady promise of Peabody patronage is blown apart by the arrival of Sumner Fox, an FBI agent who demands Emilia’s help to capture a Soviet agent who’s transmitting vital intelligence on the West’s atomic weapon program from somewhere inside the Summerly estate.April 1954. Eight years later, Summerly is boarded up and Emilia has rebuilt her shattered life as a professor at Wellesley College, when shocking news arrives from Washington—the traitor she helped convict is about to be swapped for an American spy imprisoned in the Soviet Union, but with a mysterious condition only Emilia can fulfill. A reluctant Emilia is summoned to CIA headquarters, where she’s forced to confront the harrowing consequences of her actions that fateful summer, and a choice that could destroy the Peabody family—and Emilia’s chance for redemption—all over again.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Mystery",
    "Romance",
    "Audiobook",
    "World War II"
  ],
  "author": "Beatriz Williams",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/61102578-the-beach-at-summerly"
}