{
  "title": "Culture: The Story of Us, From Cave Art to K-Pop",
  "description": "In Culture, acclaimed author, professor, and public intellectual Martin Puchner takes us on a breakneck tour through pivotal moments in world history, providing a global introduction to the arts and humanities in one engaging volume.What good are the arts? Why should we care about the past? For millennia, humanity has sought to understand and transmit to future generations not just the “know-how” of life, but the “know-why”―the meaning and purpose of our existence, as expressed in art, architecture, religion, and philosophy. This crucial passing down of knowledge has required the radical integration of insights from the past and from other cultures. In Culture, acclaimed author, professor, and public intellectual Martin Puchner takes us on a breakneck tour through pivotal moments in world history, providing a global introduction to the arts and humanities in one engaging volume.From Nefertiti’s lost city to the plays of Wole Soyinka; from the theaters of ancient Greece to Chinese travel journals to Arab and Aztec libraries; from a South Asian statuette found at Pompeii to a time capsule left behind on the Moon, Puchner tells the gripping story of human achievement through our collective losses and rediscoveries, power plays and heroic journeys, innovations, imitations, and appropriations. More than a work of history, Culture is an archive of humanity’s most monumental junctures and a guidebook for the future of us humans as a creative species. Witty, erudite, and full of wonder, Puchner argues that the humanities are (and always have been) essential to the transmission of knowledge that drives the efforts of human civilization.8 pages of full-color illustrations; 30 black-and-white illustrations\"Puchner is an adept storyteller who uses narrative to show that the common trait among all human cultures is skillful stealing in service of explanation.\"― Ismail Muhammad, New York Times Book Review\"So many books these days are described as being ‘sweeping histories’; Culture, which promises in its subtitle to take us from our most primitive artistic impulses all the way to the machinery of modern-day fandom. But what intrigues me most about Puchner’s latest isn’t its scope―it’s its driving question: ‘What good are the arts?’ In my more hopeless moments, this question bubbles up inside me, and I’m chomping at the bit to hear Puchner’s answer, grounded in history and informed by cultures around the world.\"― Sophie Stewart, The Millions\"Why do we make art? Why do we tell stories? What is it about humanity that just has to build a pyramid or write a concerto or spray paint the side of a subway car? With Culture, professor and public intellectual Martin Puchner attempts to answer these questions―along with a seemingly infinite array of others―as he takes the reader through millennia of human creation, always wondering what’s at the heart of our need to achieve.\"― Jonny Diamond, Literary Hub Most Anticipated Books of 2023\"Martin Puchner’s timely book takes us on a breathtaking tour of world history, reminding us that as we judge the past, one day we, too, will be judged, and that when we ignore or try to erase our cultural heritage, we are only impoverishing ourselves.\"― Louis Menand, Pulitzer Prize-winning author of The Metaphysical Club\"Martin Puchner has exceptional and invaluable gifts: intellectual fearlessness, dazzling erudition, trenchancy tempered by breadth of mind, and a humanist’s eye for minute evidence that illumines huge problems. He leaps daringly among well-chosen vignettes to show us what cultural change is like: contingent, fragile, unpredictable, and always dependent on our willingness to exchange objects, people, and ideas.\"― Felipe Fernandez-Armesto, author of The Oxford Illustrated History of the World\"Fearless and exhilaratingly erudite, Martin Puchner’s panoramic tour of human culture across the millennia is a riveting page-turner. Revealing the beauty and necessity of cultural cross-pollination and borrowing, Puchner’s tour de force is the perfect antidote to our increasingly dreary and close-minded times.\"― Amy Chua, author of Political Tribes\"Culture is a breakneck, utterly captivating survey of the cultural transmission of ideas, stories, and songs―how they survive, change, vanish, and are borrowed, refined, coopted, and grafted through time. Reading this book was like taking a course in the history of humanities from a world-class professor with a rapacious, global, up-to-the-minute curiosity. I underlined sentences on every page.\"― Anthony Doerr, author of Cloud Cuckoo Land\"If anyone wants to know what it is for comparative literature to encompass the globe, they need only read this remarkable book.\"― Kwame Anthony Appiah, author of The Lies that Bind: Rethinking Identity\"Puchner really is a bit of a genius.\"― William Dalrymple, author of The Anarchy\"A thoughtful, generous vision of human creativity across centuries of culture.\"― Kirkus\"Exhilarating....elegantly written and full of erudite lore, this vibrant history illuminates the inveterate human yearning for expression.\"― Publishers Weekly\"Puchner creates a perfectly balanced and incisively abridged version of the story of human culture. Ultimately, this is an examination of the making and transport of ideas, which is always an interaction between old and new. Each chapter builds a new layer, adding to the depth and complexity, while Puchner also provides a global who’s who of cultural diffusion.\"― Anne Doventry, BooklistAbout the AuthorMartin Puchner, the Byron and Anita Wien Professor of English and Comparative Literature at Harvard University, is a prize-winning author, educator, public speaker, and institution-builder in the arts and humanities. He lives in Cambridge, Massachusetts.",
  "genres": [
    "History",
    "Nonfiction",
    "Art",
    "Sociology",
    "Cultural",
    "Anthropology",
    "Audiobook"
  ],
  "author": "Martin Puchner",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/61089457-culture"
}