{
  "title": "Ghosted",
  "description": "“Long story, but ghosts are real. There’s an afterlife, death is not the end, and it’s all very complicated.”\n For freelance exorcist Jason Kent there’s one thing that makes his job harder than anything else: mediums, especially the fake kind. So naturally he isn’t thrilled when he rolls into a job in New Orleans and finds psychic medium Desanges ‘Ange’ Passebon pretending to talk to ghosts in an extremely haunted mansion. Ange is glittery, attention-hungry, and so annoyingly hot that things rapidly spill over into a steamy hookup. Only trouble is that Jason doesn’t do relationships. Or cuddling. Or sharing beds. The only thing he really knows is ghosts and how to get rid of them, or so he thinks. What he doesn’t know is that one of the ghosts from New Orleans has followed Ange home and now he’s sharing body space with a frightened ghost who seems determined to starve him out of his own body. Ghosted in more ways than one, Ange needs an exorcist, and he knows just where to find one. As the two bumbling ghostbusters reunite and attempt to get to the bottom of Ange’s possession they find themselves digging deeper into the demons of their own pasts, stripping away layers that kept them both single for far too long. But time is ticking, and Ange is getting weaker. Is this job really too much for the unconventional exorcist who once attempted to purge a house using nothing but crystals, baby powder, and a twenty piece serving of chicken McNuggets? Unsavory poltergeists, haunted refrigerators, inappropriate dairy production, and angry neighbors objecting to backyard sorcery – just some of the obstacles facing Ange and Jason as they navigate their way through a hot mess of paranormal activity. It’s not going to be easy, but then love never is.",
  "genres": [
    "Paranormal",
    "Ghosts",
    "M M Romance",
    "Romance",
    "Horror",
    "Gay",
    "Queer"
  ],
  "author": "Jess Whitecroft",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/61112884-ghosted"
}