{
  "title": "Standalone",
  "description": "Dickie Cornish, Washington, DC street denizen turned unlicensed private investigator, is forced at gunpoint to track down the daughter of an ex-con, setting up a chain of events that unleashes a war within the corrupt police force, exposes shocking conduct in child services, and unearths a secret that threatens to tear the nation’s capitol apart. The second book in the Dickie Cornish mystery series, STANDALONE is a must-read for fans of S. A. Cosby, George Pelecanos, and Walter Mosley.It’s been over year since that bleak Christmas when a rich man peeled homeless, drug-addled Dickie Cornish from a steam grate, cleaned him up, and convinced him to use his street connections to track down his missing property. Now, as the summer sun bakes those same mean streets, the air is thick with crime, contagion, and corruption. Dickie struggles with sobriety, anti-psychotic meds, and counseling at the VA, but manages to make a meager living as a private investigator with his sidekick, “Stripe”—until an ex-con named Al-Mayadeen Thomas sticks a gun to Dickie’s forehead and kidnaps him to a grim flophouse—a motel filled with squatters more desperate than the poor souls in the shelters.Thomas demands that Dickie find his daughter, missing for years from the motel in a notorious cold case. The other squatters plead for him to find their vanished children as well. When Thomas takes his own life to seal Dickie’s help, Police Chief Linda Figgis hauls Dickie in and offers him a Faustian choice: she directs him to help her close the Thomas cold case, but only if he forgets about the other vanished and abused children. To his horror, Dickie finds himself in the middle of a war within the police, with either side closing in for the kill to keep the truth hidden.The sequel to author Christopher Chambers' critically-acclaimed mystery SCAVENGER, STANDALONE has already received high praise. 2022 Sue Grafton Memorial Award winner Tracy Clark (author, the Cass Raines Chicago mystery series) proclaims, \"Dickie Cornish works the gritty underbelly of DC, and it’s hard to decide who skirts the edges more, Dickie or our corrupt nation’s capital. Earthy, raw, all the way street, STANDALONE’s got a lot to say.\" And award-winning mystery author Gary Phillips (One-Shot Harry) raves, \"Once again Chris Chambers weaves a mesmerizing and timely tale of twists and deceit with his most unique street level gumshoe Dickie Cornish at the center of it all. A well crafted page turner.”",
  "genres": [
    "Fiction",
    "Noir",
    "Mystery"
  ],
  "author": "Christopher Chambers",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/61121865-standalone"
}