{
  "title": "Hurt Me, Daddy",
  "description": "Does the baddest boy in school need a tutor... or a Daddy? I've spent my whole life needing absolutely nothing and getting exactly that. Love? No. Security? Yeah, right. Parental supervision? As if. I take care of myself. After graduation, my football scholarship and I are out of here and we're never looking back. Unless I screw it up. Trying to study when I'm cold and hungry, that I'm used to. But throw in my mom's sketchy new boyfriend and his shady side hustle, and my home life's suddenly way more than just unbearable. Studying's barely on my radar and I'm in danger of losing my future before it starts. My one shot at turning things around is The Beast. Caleb Heath is the smartest guy in school. And the biggest. A giant, quiet bookworm with no friends, and okay, maybe that's partly my fault, but whatever. I hate him and he hates me, so why would he even offer to be my tutor? Turns out there's a reason. He doesn't just want to save my grades. He doesn't just want to save my season. He wants to save me. Wants to wrap me up in his giant arms and rescue me. He wants to spoil me. Punish me. Take care of me. He wants me to call him Daddy. Sure it's hot. Sure it's tempting to think anyone could ever really want me. But I'm way too old to believe in fairy tales. Aren't I? ---------- Hurt Me, Daddy is book one in The Brat & The Beast duet, an angsty, kinky, grumpy epic MM romance about an angry, stubborn, bratty jock who won't give an inch and a slightly stalky gentle giant with infinite patience. Get ready for steamy study sessions, unexpected attraction, hurt/comfort, daddy kink, spanking, fun sized candy bars, ugly gray sweaters, and all the feels. This book ends on a satisfying but exciting cliffhanger. The second and final installment, Comfort Me, Daddy, contains a happily ever after for Logan and Caleb.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Romance",
    "Sports",
    "Enemies To Lovers",
    "High School",
    "Contemporary"
  ],
  "author": "Misha Horne",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/61118248-hurt-me-daddy"
}