{
  "title": "Symphony of Secrets",
  "description": "A gripping page-turner about a professor who uncovers a shocking secret about the most famous American composer of all time—that his music was stolen from a young Black composer named Josephine Reed. Determined to uncover the truth and right history’s wrongs, Bern Hendricks will stop at nothing to finally give Josephine the recognition she deserves.Bern Hendricks has just received the call of a lifetime. As one of the world’s preeminent experts on the famed twentieth-century composer Frederick Delaney, Bern knows everything there is to know about the man behind the music. When Mallory Roberts, a board member of the distinguished Delaney Foundation and direct descendant of the man himself, asks for Bern’s help authenticating a newly discovered piece, which may be his famous lost opera, RED, he jumps at the chance. With the help of his tech-savvy acquaintance Eboni, Bern soon discovers that the truth is far more complicated than history would have them believe. In 1920s Manhattan, Josephine Reed is living on the streets and frequenting jazz clubs when she meets the struggling musician Fred Delaney. But where young Delaney struggles, Josephine soars. She’s a natural prodigy who hears beautiful music in the sounds of the world around her. With Josephine as his silent partner, Delaney’s career takes off—but who is the real genius here? In the present day, Bern and Eboni begin to uncover more clues that indicate Delaney may have had help in composing his most successful work. Armed with more questions than answers and caught in the crosshairs of a powerful organization who will stop at nothing to keep their secret hidden, Bern and Eboni will move heaven and earth in their dogged quest to right history’s wrongs.",
  "genres": [
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Music",
    "Audiobook",
    "Mystery Thriller",
    "Thriller"
  ],
  "author": "Brendan Slocumb",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/61111253-symphony-of-secrets"
}