{
  "title": "I Know Who You Are: How an Amateur DNA Sleuth Unmasked the Golden State Killer and Changed Crime Fighting Forever",
  "description": "The amateur DNA sleuth who solved one of the most infamous cold cases in American history--the Golden State Killer crime spree--tells the incredible true story of how she did it, and explains how her methods have forever changed criminal investigations.In the span of just a few years, Barbara Rae-Venter went from researching her family history as a retiree to finding a serial killer who had baffled law enforcement for decades. I Know Who You Are tracks her improbable journey to becoming the nation's leading authority in investigative genetic genealogy, and to identifying the Golden State Killer--who had evaded authorities for forty-four years--in just sixty-three days.Rae-Venter also details other extraordinary cases that she has worked on, from the first criminal cold case she ever cracked--uncovering the long-lost identity of a child abductee--to the heartbreaking case of the Billboard Boy, which began with unidentified remains dumped along a North Carolina highway. When she looks at DNA data, Rae-Venter sees numbers, percentages, probabilities--but she also sees the very stuff that makes us who we are. Drawing on both her own experiences and insights from all the key players in her investigations, Rae-Venter brings readers inside her unique \"grasshopper mind as she analyzes DNA data; pores through obituaries, marriage records, and old newspapers articles; and envisions different scenarios that bring her closer and closer to her target. She lets readers join in on urgent calls from sheriffs, FBI agents, district attorneys, and researchers, and she takes us inside the struggle to obtain a usable crime scene DNA sample and other unexpected roadblocks that often make the search more difficult. Time and again, Rae-Venter pushes through setbacks, finds new angles of investigation, and uses the most cutting-edge new technology--much of it developed during her search--until, finally, a critical piece of the puzzle suddenly tumbles into place.I Know Who You Are captures the exhilaration of the moment of discovery in cold case investigations, but also the sheer depth of emotion that lingers around these cases and informs Rae-Venter's careful approach to her work. It is a story of relentless curiosity, of constant invention and reinvention, and of recognizing that we may not be who we thought we were.*Listening Length:\t8 hours and 23 minutes",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Science",
    "Audiobook",
    "Mystery",
    "Memoir"
  ],
  "author": "Barbara Rae-Venter",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/61111260-i-know-who-you-are"
}