{
  "title": "Dirty Crazy Bad",
  "description": "A new dark college reverse harem romance from the USA Today & WSJ bestselling author of The Sainthood Series. In the secret society of The Luminaries, no sin will go unpunished… Sleeping with my boyfriend’s best friend, behind his girlfriend’s back, probably wasn’t my smartest idea. But Jase is mine, and it’s about time Julia knew it. Attending Lowell University was supposed to be a fresh start. A chance to end all the sneaking around and make our relationship official. I couldn’t have been more wrong.Julia is digging her claws into Jase.My boyfriend, Chad, is getting in deeper with a local gang.And my loathsome new stepbrother, Ares, has just moved in. Ares despises Chad and Jase, and the feeling is mutual. As their rivalry escalates, Ares seems determined to use me as a pawn, and I’m trapped in the middle. It doesn’t help that he’s hot AF, knows exactly how to push my buttons, and my body hasn’t gotten the memo he’s off-limits.I wish that were the least of my worries.Pride. Wrath. Lust. Envy. Greed. Gluttony. Sloth. My life turns upside down the moment the dark secret society of The Luminaries is revealed to me. Everything I thought I knew was a lie.Now, I have lost all control over my future, and a heart-breaking new reality emerges. One where lovers become enemies, enemies become allies, and corrupting sinners to sin is my only way to survive.***This is a 138k-word full-length novel and book one of two. It cannot be read as a stand-alone, and it ends with a cliff-hanger. This book contains mature content including cursing and graphic scenes with some dub-con/non-con. This is a dark romance, and it may contain triggers for some readers.",
  "genres": [
    "Reverse Harem",
    "Dark Romance",
    "Dark",
    "Romance",
    "College",
    "Enemies To Lovers",
    "Contemporary"
  ],
  "author": "Siobhan     Davis",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/61112950-dirty-crazy-bad"
}