{
  "title": "Life Beyond Us: An Original Anthology of SF Stories and Science Essays",
  "description": "European Astrobiology Institute Presents: Life Beyond Us: An Original Anthology of SF Stories and Science Essays. How would first contact, on earth, in space, on another planet, transform our understandings of technology, philosophy, and what it means to be human? What kind of cognitive dissonance would society experience, if we discovered a previously unrecognized sentience on Earth?What would life be like if it originated in a frigid ocean beneath an impenetrable shell of ice? Or on a world whose haze obscures any view of the universe beyond? Or on an unfathomable scale in the depths of space? Or . . .Dive in as the European Astrobiology Institute presents fifty-four original SF Stories and Science Essays on life, from microbial to macro, from automatic to sagacious. Each speculative story is followed by a professional essay illuminating the scientific underpinnings of the story and providing a new window into the cutting-edge knowledge about exploration for life in the universe.Contents: * Foreword (Life Beyond Us) • essay by Julie Novakova * Introduction (Life Beyond Us) • essay by Stephen Baxter * Hemlock on Mars / short story by Eric Choi; Planetary Protection • essay by Giovanni Poggiali * The Dog Star Killer / short story by Renan Bernardo; That Cold Black Cloud • essay by Stefano Sandrelli * Titan of Chaos / short story by G. David Nordley; Flying Instead of Diving • essay by Fabian Klenner * Cloudskimmer / short story by Geoffrey A. Landis; Earth's Sister Planet • essay by Dennis Honing * The Lament of Kivu Lacus / short story by B. Zelkovich; Robots in Space Are Great • essay by Ania Losiak * Heavy Lies / short story by Rich Larson; Major Transitions • essay by Stephen Francis Mann * The World of Silver / short story by Tomáš Petrásek; Wet Wet Wet • essay by William Bains * Spider Plant / short story by Tessa Fisher; Signs of Life (and How to Find Them) • essay by Tessa Fisher * This Is How We Save Them / short story by Deji Bryce Olukotun; Valuing Life • essay by Erik Persson; * The Far Side of the Door / short story by Premee Mohamed; Space Agriculture • essay by Raymond M. Wheeler * Ranya's Crash / short story by Lisa J. Krieg (trans. of Die Todbringerin) [as by Lisa Jenny Krieg]; You Are Not Alone! • essay by Jacques Arnould * Spiral / short story by Arula Ratnakar; Spiraling Into the Unknown • essay by Tomáš Petrásek * The Last Cathedral of Earth, in Flight / short story by Tobias S. Buckell; The Latest Black Hole Planet, in Formation • essay by Amedeo Romagnolo * The Secret History of the Greatest Discovery / short story by Valentin D. Ivanov [as by as by Валентин Иванов]; Cooperation Without Communication • essay by Valentin D. Ivanov [as by Валентин Иванов] * Human Beans / short story by Eugen Bacon; Microbial Life and Belonging • essay by Tony Milligan * The Mirrored Symphony / short story by D. A. Xiaolin Spires; Mirror Images • essay by Dimitra Demertzi * Lumenfabulator / short story by Liu Yang; Crystal Green Persuasion • essay by Nina Kopacz * Cyclic Amplification, Meaning Family / short story by Bogi Takács; The Science of Xenolinguistics • essay by Sheri Wells-Jensen * The Diaphanous / short story by Gregory Benford; Life 2.0 • essay by Geoffrey A. Landis * The Sphinx of Adzhimushkaj / short story by Brian Rappatta; Finding Common Ground • essay by Philippe Nauny * Defective / novelette by Peter Watts; How Did They Know It Was Agni? • essay by Joanna Piotrowska * The Dangers We Choose / short story by Malka Older; The Habitability of Water Worlds • essay by Floris van der Tak * Third Life / short story by Julie E. Czerneda; The Unveiled Possibilities of Biomaterials in Space • essay by Martina Dimoska * Forever the Forest / short story by Simone Heller; Astra Narrans • essay by Connor Martini * Still As Bright / short story by Mary Robinette Kowal; — And the Moon Be Still As Bright • essay by José A. Caballero * Devil in the Deep / short story by Lucie Lukačovičová; Some Like It Hot • essay by Natuschka Lee, Lucie Lukačovičová * Deep Blue Neon / short story by Jana Bianchi; Destined for Symbiosis • essay by Jan Toman * Afterword I (Life Beyond Us) • essay by Wolf D. Geppert * Afterword II (Life Beyond Us) • essay by Susan Forest and Lucas K. Law * Acknowledgments (Life Beyond Us) • essay by editor * About the Contributors (Life Beyond Us) • essay by editor * About the Editors (Life Beyond Us) • essay by editor * Copyright Acknowledgments (Life Beyond Us) • essay by editor * European Astrobiology Institute (EAI) • essay by editor * European Science Foundation (ESF) • essay by editor * Laksa Media Groups Inc. (LMG) • essay by editor.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Biology",
    "Fantasy"
  ],
  "author": "Julie Nováková",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/61129692-life-beyond-us"
}