{
  "title": "A Thousand Moments",
  "description": "FIRST BOOK IN A NEW SERIES BY INTERNATIONAL BESTSELLING AUTHOR KELLY MORAN!Wallflower Rosemary Fillmore has never endeavored anything more than a good book, a cool glass of sweet tea, and a cat to curl up in her lap after a long day of teaching teenagers how to dissect literary masterpieces. Dowdy and shy, hardly anyone in her quaint southern town of Vallantine, Georgia, knows she exists, and the only time she has an ounce of confidence is if the world is a fictional one. So, when three of her star students suddenly start to show an interest in her personal life, or lack thereof, she wonders what on earth the girls are after. Or why. And how it involves a certain town librarian. Because she hasn’t exactly agreed with how he’s been running the beautiful landmark into the ground since taking over, and frankly, she’s been more than a little upset about it. Besides, he is probably the sole person more awkward than herself, despite how kind or understatedly handsome he may be.As the only living descendant of the original town founders, saving the Vallantine Library from destitution falls on Sheldon Brown’s shoulders. And he’s failing. Miserably. The one-hundred and forty-year-old historical building, erected by his ancestors, has been in near ruins for a decade, and the state of the library system is declining. What he doesn’t need adding to his burden is giggling teenage girls hanging out between the stacks, spying on him, and asking silly questions about their teacher. Even if the woman in question is Rosemary. Pretty, sweet, and utterly endearing Rosemary, who he’s been attempting to ask on a date since forever. Except he’s chronically gotten the impression she doesn’t approve of him or his attempts to save the library. But then a mishap one night and a strange challenge from an unlikely source changes everything, and he wonders if perhaps two introverted bookworms can get a happy ending, after all.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Small Town Romance",
    "Novella",
    "Contemporary",
    "Clean Romance"
  ],
  "author": "Kelly Moran",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/61128208-a-thousand-moments"
}