{
  "title": "Your Consent Is Not Required",
  "description": "\"Deeply researched, lucidly written… an important contribution to public policy debate and a profoundly moving, must-read call for human dignity and humane treatment for all. Highly recommended.”–Tom Sandborn, Vancouver Sun\"…timely… eye-opening… exhaustive… powerful… Wipond’s comprehensive study unearths health and social services replete with poor-to-dreadful outcomes, lax oversight, and protocols seemingly rigged against those most in need.” –Christopher Lane, Psychology TodayAsylums are supposed to be in the past. However, though the buildings were closed, many of the practices lived on.In fact, more law-abiding Americans today are being involuntarily committed and forcibly treated “for their own good” than at any time in history.In the first work of investigative journalism in decades to give a comprehensive view into contemporary psychiatric incarceration and forced interventions, Your Consent Is Not Required exposes how rising numbers of people from many walks of life are being subjected against their will to surveillance, indefinite detention, and powerful tranquilizing drugs, restraints, seclusion, and electroshock. There’s a common misconception that, due to asylum closures, only “dangerous” people get committed now. But forced psychiatric interventions today occur in thousands of public and private hospitals, and also in group and long-term care facilities, troubled-teen and residential treatment centers, and even in people’s own homes under outpatient commitment orders. Intended to “help,” for many people the experiences are terrifying, traumatizing, and permanently damaging. Driven partly by individuals’ genuine concerns for the “mental health” of others, and partly by institutions entangled with goals of power, profit, and social control, psychiatric coercion is increasingly used to:  • manage school children and the elderly • quell family conflicts • police the streets  • control people in shelters, community living, and prisons • fraudulently increase hospital profits • “resolve” workplace disagreements • detain protesters and discredit whistleblowers Thoroughly researched, with alarming true stories and hard data from the US and Canada, Rob Wipond’s Your Consent Is Not Required builds an unassailable case for greater transparency, vigilance, and change.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Mental Health",
    "Medicine",
    "Disability",
    "Mental Illness",
    "History"
  ],
  "author": "Rob Wipond",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/61131239-your-consent-is-not-required"
}