{
  "title": "Agency: The Four Point Plan (F.R.E.E.) for ALL Children to Overcome the Victimhood Narrative and Discover Their Pathway to Power",
  "description": "Every child in America deserves to know that a path to a successful life exists and that they have the power to follow it. But many never set foot on that path because they grow up hearing the message that systemic forces control their destinies, or that they are at fault for everything that has gone wrong in their lives. These children often come from difficult circumstances. Many are raised by young, single parents, live in disadvantaged neighborhoods, attend substandard schools, and lack the moral safeguards of religious and civic institutions. As a result, they can be dispirited into cycles of learned helplessness rather than inspired to pursue their own possibilities.Yet this phenomenon is not universal. Some children thrive where others do not. Why? Are there personal behaviors and institutional supports that have proven to make a difference in helping young people chart a course for their futures? Agency answers with a loud and clear “yes!” This book describes four pillars that can uplift every young person as they make the passage into Family, Religion, Education, and Entrepreneurship. Together, these pillars embody the true meaning of freedom, wherein people are motivated to embrace the ennobling responsibilities of building healthy social structures and shaping the outcomes of their own lives. For that reason, Ian Rowe calls the four pillars the FREE framework. With this framework in place, children are empowered to develop agency, which Rowe defines as the force of one’s free will, guided by moral discernment. Developing agency is the alternative to the debilitating ‘blame-the-system’ and ‘blame-the-victim’ narratives. It transcends our political differences and beckons all who dare to envision lives unshackled by present realities. In addition to making the case for agency, Rowe shares his personal story of success coming from an immigrant family. He defends America as an ever-improving country worthy of our esteem. He corrects misguided calls for “anti-racism” and “equity,” and champions a game plan for creating new agents of agency, dedicated to promoting the aspirational spirit of America’s children, and showing them the path that will set them FREE.",
  "genres": [
    "Education",
    "Nonfiction",
    "Parenting"
  ],
  "author": "Ian V. Rowe",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/61140238-agency"
}