{
  "title": "On the Savage Side",
  "description": "Six women--mothers, daughters, sisters--gone missing. When the first is found floating dead in the river, it reveals the disturbing truth of a small Ohio town. Inspired by the unsolved murders of the Chillicothe Six, this harrowing and haunting novel tells the story of two sisters, both of whom could be the next victims, from the internationally-bestselling author of Betty.Arcade and Daffodil are twin sisters born one minute apart. With their fiery red hair and thirst for an escape, they forge an unbreakable bond nurtured by both their grandmother's stories and their imaginations. Together, they create a world where a patch of grass reveals an archaeologist's dig, the smoke emerging from the local paper mill becomes the dust rising from wild horses galloping on the ground, and an abandoned 1950s convertible transforms into a time machine that can take them anywhere.But the two sisters can't escape the generational chaos that grips their family. Growing up in the shadow of the town, the sisters cling tight to one another. As an adult, Arcade wrestles with these memories of her life, just as a local woman is discovered drowned in the river. Soon, more bodies are found. While her friends disappear around her, Arcade is forced to reckon with the past while the killer circles ever closer. Arcade's promise to keep herself and her sister safe becomes increasingly desperate while the powerful riptide of the savage side becomes more difficult to resist.Drawing from the true story of women killed in her native Ohio, acclaimed novelist and poet Tiffany McDaniel has written a powerful literary testament and fearless elegy for missing women everywhere.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "Horror",
    "Literary Fiction",
    "Crime"
  ],
  "author": "Tiffany   McDaniel",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/61153745-on-the-savage-side"
}