{
  "title": "Joy Of Being Daily Moments Of Becoming Present",
  "description": "Joy Of Being: Daily Moments of Becoming Present is a sincerely profound self reflection journal designed to provide the reader with insights into their gratitude, presence, mindfulness, self compassion, self love, self care, inner leadership, purpose, happiness, wellbeing.Can you imagine appreciating the journey and process through fear, stress, doubt, worry, perfectionism, anxiety, worthiness, being enough?The mission of this book is to support you to be in wholeness in mind, body and soul.The journal takes the reader on a 120 day journey through each day of their life encouraging expressions of feelings, thoughts, and desires in life.It has been designed to be a source of accountability to support people to live in authenticity, love, connection, courage, trust, belief, hope, faith, kindness, compassion, and inner knowing.In this journal there is no shortage of personal exploration with daily journaling and reflections, weekly and monthly reflection, extensive thought provoking journal prompts, and the generous value shared within the heart-centered resource section containing heartfelt exercises. Inspiring insights that can be referenced over and over again.It provides an abundance of deep questions that provoke curiosity, create awareness, positive mindset, open new possibilities, see empowered choices.Featuring beautiful paintings from artist Mara Szyp to create surrender and letting go, inspirational quotes to create curiosity, abundance of captivating journal prompts to create choice and possibility.Through the journaling process the reader gets to experience a way of being that is in alignment with how they want to live. Uncovering how they would like to be living in presence while seeing the joy in their life. This brings them clarity, purpose, discovery, commitment to living in their higher self.This is a journal that serves many people. It can help someone in their healing journey, in their personal growth journey, in their life transformation journey. Being a tool in their transformation into deeper connection in relationships, health, money, life purpose, career.Be the creator of your life vision and the architect of your dreams, goals and happiness.Grab the #1 \"Best Self Help Journal\" you will have the pleasure of experiencing.",
  "genres": [],
  "author": "Kristin Larsen",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/61142363-joy-of-being-daily-moments-of-becoming-present"
}