{
  "title": "World of Department Stores",
  "description": "Who first introduced Manolo Blahnik to Vogue , or a canny buyer at Bendel’s? Where under one roof can shoppers find Chanel, Yves Saint Laurent, Prada, and Hermès? Here are the great retail palaces—from Harrods to Barneys to Galeries Lafayette—where shoppers spend their day in opulent settings, drifting from cosmetics to shoes, stopping for lunch, the hairdresser, and endless temptations along the way. With photographs and ephemera from all over the world, this lavish book goes beyond in-store extravaganzas to the history of these consumer institutions, the personalities behind them, their vast range of goods, unique architecture, advertising, and associated sociological trends. With perfumed air and chandeliers, department stores have lured millions for over a century with that enticing, dizzying sense that no matter how much you already have, there is always more.Praise for The World of Department Stores :“Since my visits as a child to La Opera Department Store in Santo Domingo, I have believed that the best department stores are merchants not of clothing or shoes or cosmetics but of dreams. Whitaker’s book is a remarkable around-the-world look at these dream factories. It is an invaluable resource to anyone interested in the business of retailing and to shoppers everywhere.”—Oscar de la Renta“ The World of Department Stores is essential reading for anyone who wants to understand the foundations of the urban experience in the West and the department store as the ultimate expression of the needs of the rising middle class and its tastes.” ­—Leonard Lauder, Chairman Emeritus, The Estée Lauder Companies Inc.“I have nothing but good memories about the many department stores that played an important part in my business, [and] I warmly welcome the publication of this wonderful and unique book on department stores throughout the world.” —Hubert de Givenchy\"The birth of the department store in the late 19th century brought everything glamorous together under one roof—from inviting, intelligent architecture and design to the latest fashions. Jan Whitaker's The World of Department Stores looks back to the biggest and brightest shops—including the belle epoque splendor of Paris's Bon Marché, the block-long, palatial GUM in Moscow; and the always outrageous holiday windows at Barneys New York.\" – Elle Décor\"In photos and art, this visual feast details the extraordinary history of the world's \"great retail palaces\" from the past century. With authoritative and informative text.\" - Sacramento Bee\"Illustrated with photos of window displays, catalog covers and the Gilded Age architecture of institutions from Philadelphia’s long-gone Wanamaker’s to Paris’s still-strong La Samaritaine, The World of Department Stores makes a worthwhile gift for the history, sociology or shopping buff on your list. \" - Washington Post",
  "genres": [
    "Nonfiction",
    "History",
    "Architecture",
    "Art",
    "Economics",
    "Design"
  ],
  "author": "Jan  Whitaker",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/12892167-world-of-department-stores"
}