{
  "title": "Israel and Humanity: Study on the Problem of Universal Religion and its Solution: Part Two: Man",
  "description": "The message of Rabbi Eliyahu Benamozegh's major work “Israel and Humanity”, needs more than ever to be read and in its entirety. Eliyahu Benamozegh (1822-1900) was the rabbi of Livorno in Italy; he studied major religions as well as mysticism and philosophy with the aim of rectifying the fragmentation and alienation in society. According to him, brotherhood can be achieved by finding common principles among different systems of thought, all of which, according to Rabbi Benamozegh, are derived from divine precepts. Nowadays, this approach retains all its relevance, as it was the case in his time which corresponds to the years preceding the two world wars.His work has sparked a debate between liberal and orthodox camps: did Rabbi Benamozegh simply stumble upon universal and humanistic truths, indirectly opening up the Orthodox world to a greater vision, or did he embrace a vision of the prophets, a federation of nations under a universal divine covenant, of which the twelve tribes were to be the model for humanity? Editors subsequent to the first edition considerably refined the original text, in effect removing entire parts, no doubt in response to its large volume and seemingly contradictory approaches.\"AlSadiqin Press\" thus presents the original and unabridged version of \"Israel and Humanity \", so that readers can take cognizance of Rabbi Benamozegh's broad inclusive vision and his many approaches to the role of the Jewish people towards the nations of the world. This will allow the reader not to be encumbered by the slightest editorial omission. It will also serve as a useful tool to build a framework for a just society, as Rabbi Benamozegh envisioned.\" Israel and Humanity \" was published posthumously in 1914 by the disciple of Rabbi Benamozegh: Aimé Pallière to whom the rabbi had taught the seven laws of Noah. Rabbi Benamozegh valued the mandate of the Jewish people to communicate Noah's seven laws to the nations of the world. It is these laws that form the basis of true religion and a just society.These laws are:1.Monotheism – Belief in one God;2.Respect and revere the Almighty – Do not blaspheme;3.Protect life – Do not kill;4.Protect the family – Morality;5.Protect possessions – Do not steal;6.Protect the natural world – Do not detach a limb from a living animal. The ban on tree grafting is used as an allegory to symbolize the protection of crops;7.Social justice – Establishment of courts.In a parable attributed to Rabbi Benamozegh, the different nations of the world are compared to craftsmen who build a grand palace for a king. Everyone believes their profession is the most important and takes pride in their unique talent. A sense of pride is necessary to skillfully refine one's task. Indeed, carpenters are the best to assemble a work; electricians are the best at spreading energy. A fusion of talents would reduce the specialty and diversity needed to create the most perfect of palaces and be a waste for the whole project. Each group's diet, clothing, and training must be different, but their goal is the same: to build a grand palace for the king.The more liberal voices will insist that Rabbi Benamozegh presents a more humanistic view. Orthodox voices will claim that his idealism will only be realized in a future messianic time.Both views are incomplete. Rabbi Benamozegh was not a humanist in rabbinical clothes, nor were his ideas purely theoretical. The rabbi's belief in the uniqueness of the Jewish people had not clouded his love for humanity, quite the contrary. He argued that the function of teaching should create positive feelings, making people aware of our duty to others. Particularism and the love of humanity are actually interconnected. It is only by reading his major work in its entirety that the reader can appreciate the reconciliation of these apparently contradictory points of view; views which, in his eyes, were not at all contradictory.The author desired that his work be read in all countries. In this vein and as we seek to build this palace – that is, the land we live on – we present the English translation of the first volume of three in an entire reprint of the original, unabridged text. This will also be the case for the two subsequent works.Rabbi Ben AbrahamsonDirector of Al Sadiqin Press",
  "genres": [],
  "author": "Rabbi Eliyahu Benamozegh",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/61145025-israel-and-humanity"
}