{
  "title": "The Complete Guide to Walt Disney World 2007",
  "description": "There's nothing else like it. Filled with more than 400 color photographs, The Complete Guide to Walt Disney World is the first photo-driven handbook to the world's No. 1 vacation destination.But this book doesn't stop there. Taking its title seriously, The Complete Guide to Walt Disney World is also packed with information. Besides the requisite planning, restaurant and resort coverage, the 320 chock-full of content on Disney's theme parks, water parks and other entertainment options. The Walt Disney Company gave the authors incredible access to its property, and allowed them to interview dozens of artists, engineers, performers and technicians. The result? Attraction descriptions, bonus articles and hundreds of Fun Facts and Fun Finds that readers just can't find anywhere else. Extra touches are everywhere. There are architecture articles, an animal guide to the Animal Kingdom, even a full section on Christmas events. Sprinkled throughout are features on attraction technology, monorails, swimming pools and much more.Walt Disney World gives you a choice of 168 rides and attractions, 81 live performances, 104 recreational activities, 179 places to eat, 197 shops and 29 resorts -- all spread out over 47 square miles. Overwhelming? Not any more. Filled with the most detailed information ever published about Disney World, this full-color guide combines a thorough description of everything Disney has to offer with a cornucopia of advice, insight and tips to help you enjoy it. In other words, it's a handbook on how to have fun. Also included: over 1,000 fun finds and facts, dozens of secrets, quizzes, Hidden Mickeys and over 400 color photos.\n\nFrom theAuthors\nWe first came to Walt Disney World as tourists and were instantly infatuated. Now, with a home right next door, we visit Disney nearly every day and have come to know it like few others can. Putting this book together it seems like we've learned every every firework blast, every ride twist and turn, every single snippet of prerecorded speech. (Oh, can we be dull at parties!)Seriously, we wrote this book to share the best of that information with you, to give you exactly what you need to experience all the joy and wonder a Disney vacation can bring. We understand the time, effort and expense it takes to come here, so we want you to know about every possible way to have a good time once you arrive. In short, we want you to go home saying \"I never knew Disney World could be so much fun.\" We've also designed the book so that it's easy to track down just what you're looking for -- so you don't have to endlessly flip through the entire thing just to find one fact. The main chapters are color-coded and divided into clearly marked sections. For the theme parks, each attraction is on its own page (or often, pages). Shopping sections are organized first by category -- \"apparel,\" \"art,\" \"books\" -- and then by store. There's a comprehensive index and, on the back page, a phone directory.",
  "genres": [
    "Travel"
  ],
  "author": "Julie Neal",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/611548.The_Complete_Guide_to_Walt_Disney_World_2007"
}