{
  "title": "Queen of Exiles",
  "description": "Acclaimed historical novelist Vanessa Riley is back with another novel based on the life of an extraordinary Black woman from history: Haiti's Queen Marie-Louise Coidavid, who escaped a coup in Haiti to set up her own royal court in Italy during the Regency era, where she became a popular member of royal European society.  The Queen of Exiles is Marie-Louise Christophe, wife and then widow of Henry I, who ruled over the newly liberated Kingdom of Hayti in the wake of the brutal Haitian Revolution. In 1810 Louise is crowned queen as her husband begins his reign over the first and only free Black nation in the Western Hemisphere. But despite their newfound freedom, Haitians still struggle under mountains of debt to France and indifference from former allies in Britain and the new United States. Louise desperately tries to steer the country's political course as King Henry descends into a mire of mental illness. In 1820, King Henry is overthrown and dies by his own hand. Louise and her daughters manage to flee to Europe with their smuggled jewels. In exile, the resilient Louise redefines her role, recovering the fortune that Henry had lost and establishing herself as an equal to the kings of European nations. With newspapers and gossip tracking their every movement, Louise and her daughters tour Europe like other royals, complete with glittering balls and princes with marriage proposals. As they find their footing--and acceptance--they discover more about themselves, their Blackness, and the opportunities they can grasp in a European and male-dominated world. Queen of Exiles is the tale of a remarkable Black woman of history--a canny and bold survivor who chooses the fire and ideals of political struggle, and then is forced to rebuild her life on her own terms, forever a queen.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Romance",
    "Adult Fiction",
    "Adult",
    "Historical Romance"
  ],
  "author": "Vanessa Riley",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/61159727-queen-of-exiles"
}