{
  "title": "Blue Boy",
  "description": "Meet Kiran Sharma: lover of music, dance, and all things sensual; son of immigrants, social outcast, spiritual seeker. A boy who doesn't quite understand his lot--until he realizes he's a god. . . As an only son, Kiran has obligations--to excel in his studies, to honor the deities, to find a nice Indian girl, and, above all, to make his mother and father proud--standard stuff for a boy of his background. If only Kiran had anything in common with the other Indian kids besides the color of his skin. They reject him at every turn, and his cretinous public schoolmates are no better. Cincinnati in the early 1990s isn't exactly a hotbed of cultural diversity, and Kiran's not-so-well-kept secrets don't endear him to any group. Playing with dolls, choosing ballet over basketball, taking the annual talent show way too seriously. . .the very things that make Kiran who he is also make him the star of his own personal freak show. . .Surrounded by examples of upstanding Indian Americans--in his own home, in his temple, at the weekly parties given by his parents' friends--Kiran nevertheless finds it impossible to get the knack of \"normalcy.\" And then one fateful day, a revelation: perhaps his desires aren't too earthly, but too divine. Perhaps the solution to the mystery of his existence has been before him since birth. For Kiran Sharma, a long, strange trip is about to begin--a journey so sublime, so ridiculous, so painfully beautiful, that it can only lead to the truth. . .\"The best fiction reminds us that humanity is much, much larger than our personal world, our own little reality. Blue Boy shows us a world too funny and sad and sweet to be based on anything but the truth.\" --Chuck PalahniukNew York Times Bestselling Author",
  "genres": [
    "Fiction",
    "Queer",
    "LGBT",
    "Humor",
    "India",
    "Gay",
    "Coming Of Age"
  ],
  "author": "Rakesh Satyal",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/6116947-blue-boy"
}