{
  "title": "Christmas with the Queen",
  "description": "’Tis the season! The Crown meets When Harry Met Sally and Bridget Jones’s Diary, in the latest heartwarming historical novel from Hazel Gaynor and Heather Webb, bestselling authors of Meet Me in Monaco and Three Words for Goodbye.December 1952. While the young Queen Elizabeth II finds her feet as the new monarch, she must also find the right words to continue in the tradition of her late father and grandfather’s beloved Christmas Day radio broadcast. But even traditions must move with the times, and the Queen faces a postwar Britain hungry for change. As preparations begin for the royal Christmas at Sandringham House in Norfolk, two old friends—Jack Devereux and Olive Carter—find themselves reunited for the festivities. A single mother, typist at the BBC, and aspiring reporter, Olive leaps at the opportunity to cover the holiday celebration, despite self-doubts. When a chance encounter with the Queen presents an exciting opportunity, Olive begins to believe her luck might change. Jack, a grief-stricken widowed chef originally from New Orleans, accepts a last-minute chance to cook in the royal kitchens at Sandringham. When he bumps into a long-lost friend, an old spark is reignited.Despite personal and professional heartache, Jack and Olive’s paths continue to cross over the following five Christmas seasons and they find themselves growing ever closer. Yet Olive carries the burden of a heavy secret. Christmas Day, December 1957. As the nation eagerly awaits the Queen’s first televised Christmas speech, Olive decides to reveal the shocking truth of her secret, which threatens to tear her and Jack apart forever. Unless Christmas has one last gift to deliver…",
  "genres": [
    "Christmas",
    "Historical Fiction",
    "Fiction",
    "Holiday",
    "Audiobook",
    "Historical",
    "British Literature"
  ],
  "author": "Hazel Gaynor",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/61159458-christmas-with-the-queen"
}