{
  "title": "Hellucination",
  "description": "A drug-fueled trip through the gruesome levels of Hell may sound like a fictional horror story to some, and since the traveler in question was movie distributor Stephen Biro , it could just as easily have been one of his film projects. But Stephen's experiences were the real, life-changing sort. They're also proof that the Lord does work in mysterious ways -- extending all the way to squares of LSD and nitrous oxide cartridges.Armed with psychedelics, hallucinogenics and a brave desire to meet God no matter the personal cost, Stephen pushed beyond the boundaries of safe drug use. He took the most nightmarish of trips from a cramped one-bedroom apartment that he used for running his underground video business. With initial difficulty finding God in his altered state, Stephen instead encountered depravity and grotesquery enough to make his soul weep, but he pushed on. And if that wasn't bad enough, his Hellish experiences bled over into his waking days, and his friends and acquaintances began identifying themselves to him as Antichrists, deities and other assorted beings from \"the other side.\" Reality was blurring and shifting, and Stephen was run utterly ragged. Could he fulfill his quest to learn universal truths before his extreme drug use took its toll? A Memoir spares no disturbing detail of the unusual route that one man took to find Christ and the God of the Bible. The memoir also follows younger Stephen through his 1970s childhood and his bizarre early encounters with religion that drove him to Atheism.\"An utterly surreal memoir. I'd say it was 'mindbending,' but \"HELLUCINATION\" doesn't just bend your mind, it twists it, stretches it, stabs it, and tosses it on the grill!\" - Jeff Strand, author of the upcoming book, \"PRESSURE\" and \"WOLF HUNT\" He's been nominated for the Bram Stoker Award in 2006, 2008, and 2010.\"HELLUCINATION takes the form of a page-turning memoir, combining personal trip reporting with science fiction, horror movie, and religious mythologies, philosophical speculation on the nature of the author’s experiments with psychedelic drug combinations, strange encounters with other people who may not be what they seem, and the rationale behind his spiritual conversion from atheism to Christianity.\" -- David Jay BrownAuthor of \"Mavericks of the Mind\" and \"Conversations on the Edge of the Apocalypse\"“HELLUCINATION is a powerful read. In fact, it might distinctly appeal to fantasy readers, film lovers and lovers of fiction. Biro writes passionately with a purpose… you may end of ripping your eyes out afterwards though.\" -- Review, Horrornews.netMind-boggling and enthralling. The visualization techniques used is astounding . - Paul White - Producer of Bride of Re-Animator and Brian Yuzna's SocietyI felt myself questioning my faith, or lack of faith, on religion, Jesus, God, the Devil, and what the purpose and point of my life and existence really was/is. I think that is the point of the book. The book raises awareness and makes readers think about the meaning of life and what their purpose is in it. That, in itself, is a pretty scary thing to think and ponder about. - Hellucination - Book review by www.shuizmz.comCinematic... it's going to scare the Hell out of some Christians. - Jim VanBebber - Director of The Manson Family and Deadbeat At Dawn",
  "genres": [
    "Horror",
    "Fiction",
    "Religion",
    "Spirituality",
    "Science Fiction",
    "Bizarro Fiction"
  ],
  "author": "Stephen Biro",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/12892801-hellucination"
}