{
  "title": "The Boy in the Attic",
  "description": "Anna opened the letter with trembling hands. ‘My darling, if you’re reading this, I haven’t managed to unravel my parents’ secret. But you can. Will you finish the search for me, find out who they were, and who you really are?’Nazi-occupied Holland, 1944. As soldiers patrol the streets, nursing student Ilse is only just surviving the terrible famine and increasingly violent German occupation. Though exhausted by her demanding work at a hospital far from home, she can’t help but notice strange noises coming from the attic above her bedroom late at night… Investigating after curfew one evening, she discovers Levi, a terrified young Jewish man who begs her not to give him up to the Nazis, not to make him follow his family’s awful fate…Protecting Levi will mean great danger for her. With starvation setting in, and the Nazi regime becoming ever more violent, Ilse must make the most difficult decision of her life. Can she risk death herself, to save an innocent life? As she looks into Levi’s dark, soulful eyes, she knows she must. But, as the war worsens, keeping Levi a secret becomes almost impossible, even as their mutual affection grows. And when a local German soldier becomes obsessed with Ilse, they fear their time – and luck – has run out…London, present day. When Anna’s father dies, he leaves her a ticket to Amsterdam, a bent silver sixpence on a delicate silver chain, and a note begging her to complete the journey he was never able to. To the town where he was born, to find out once and for all who his parents were, and to discover their wartime fate.Based on the author’s incredible family history, a totally devastating and ultimately uplifting story about a girl who risked everything, including her life, to save the man she loved. Heart-breaking and timely, this powerful tale will be loved by fans of The Tattooist of Auschwitz, The Nightingale and Fiona Valpy.",
  "genres": [
    "Historical Fiction",
    "World War II",
    "Historical",
    "Holland"
  ],
  "author": "Imogen Matthews",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/61160852-the-boy-in-the-attic"
}