{
  "title": "Spark of Madness",
  "description": "Mercy is a sinner, and Arlo is no saint…MERCYFor years, I've served the men of Ember Glen. I've endured their depravity because it's required. But when the most vicious man in our village decides to target me during a purge, I have to make a choice…I can kneel and serve…or I can run and become a sinner.I choose sin…I choose to run.Only, I didn't expect another man to chase me…I didn't expect the harrowing punishments he'd make me endure once I was caught…And I certainly didn't expect to find passion for him. The man who calls me a sinner sets my soul on fire.ARLOIt's my role to maintain control in Ember Glen. Selected women must serve beneath the full moon, and refusal is not an option. So, when I see her run, refusing to fulfill her duty, I have to take control…I have an urge to follow her…a visceral need to hunt her down.I have to catch her...I have to chase her.Only, I didn't expect to find her so intoxicating…I didn't expect the brutal punishment that awaited her for running…And I certainly didn't expect to feel so conflicted about delivering it.My craving for her is forbidden, but I might let her drag me to hell.SERIES NOTE: Spark of Madness is book 1 of 3 in the Ember Glen dystopian dark romance trilogy. This trilogy follows the forbidden romance of Mercy Madness and Arlo Rainn, and the books must be read in order. Books 1 and 2 end on cliffhangers, but all 3 books in the trilogy are available now. The series is complete and ready for you to binge read!AUTHOR NOTE: This is a dark romance series that involves many triggering elements which may be upsetting for some readers. A complete list of tropes and triggers can be found on the author's website.READING ORDERBook 1: Spark of MadnessBook 2: Blaze of MiseryBook 3: Embers of Mercy",
  "genres": [
    "Dark",
    "Dark Romance",
    "Dystopia",
    "Romance",
    "Fantasy",
    "Cult Classics",
    "Enemies To Lovers"
  ],
  "author": "Brynn Ford",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/61167448-spark-of-madness"
}