{
  "title": "Wild Rose: The True Story of a Civil War Spy",
  "description": "For sheer bravado and style, no woman in the North or South rivaled the Civil War heroine Rose O’Neale Greenhow. Fearless spy for the Confederacy, glittering Washington hostess, legendary beauty and lover, Rose Greenhow risked everything for the cause she valued more than life itself. In this superb portrait, biographer Ann Blackman tells the surprising true story of a unique woman in history. “I am a Southern woman, born with revolutionary blood in my veins,” Rose once declared–and that fiery spirit would plunge her into the center of power and the thick of adventure. Born into a slave-holding family, Rose moved to Washington, D.C., as a young woman and soon established herself as one of the capital’s most charming and influential socialites, an intimate of John C. Calhoun, James Buchanan, and Dolley Madison. She married well, bore eight children and buried five, and, at the height of the Gold Rush, accompanied her husband Robert Greenhow to San Francisco. Widowed after Robert died in a tragic accident, Rose became notorious in Washington for her daring–and numerous–love affairs.But with the outbreak of the Civil War, everything changed. Overnight, Rose Greenhow, fashionable hostess, become Rose Greenhow, intrepid spy. As Blackman reveals, deadly accurate intelligence that Rose supplied to General Pierre G. T. Beauregard written in a fascinating code (the code duplicated in the background on the jacket of this book). Her message to Beauregard turned the tide in the first Battle of Bull Run, and was a brilliant piece of spycraft that eventually led to her arrest by Allan Pinkerton and imprisonment with her young daughter. Indomitable, Rose regained her freedom and, as the war reached a crisis, journeyed to Europe to plead the Confederate cause at the royal courts of England and France. Drawing on newly discovered diaries and a rich trove of contemporary accounts, Blackman has fashioned a thrilling, intimate narrative that reads like a novel. Wild Rose is an unforgettable rendering of an astonishing woman, a book that will stand with the finest Civil War biographies.",
  "genres": [
    "History",
    "Nonfiction",
    "Civil War",
    "Biography",
    "Historical",
    "Biography Memoir",
    "American History"
  ],
  "author": "Ann Blackman",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/611705.Wild_Rose"
}