{
  "title": "Goldencrest Pack: A Collection of Holiday Stories",
  "description": "Seven stories in this collection, from sweet short story to hot and steamy novellas. Join the Goldencrest Pack in the celebration of the holidays. From Valentine's day to Christmas, and every holiday in between. A short story series that will captivate you with sweet romances, loveable characters, and HEA.Cupid and The Wolf: Enemies to Lovers The only day that they worship me and remember that I exist. As soon as February the fourteenth is over, no one remembers me anymore. I’m Cupid,dammit! - CarysThe She-Wolf and her Leprechaun: Friends to Lovers This is my year, I know it. I only need to get that elusive little green munchkin at the end of the rainbow with his pot of gold. No, correction, I just need to win the freaking games this year. - SaoirseThe Easter Bunny and the Wolf: Secret Royalty\"You have the power to make all this go away, if you wanted.” My heart was beating rapidly all the way in my throat, making my voice falter, but my resolution to not go back will not falter. - AnjaThe Dragon and his Wolf: CEO/Billionaire“My dear Stephanos, how wrong you are. I have accepted my fate centuries ago. Finding a mate is not in the stars for us.” I tried not to let the sting of not having found my mate color my voice, but I failed miserably. - LadonThe Banshee and her Lovers: Reverse HaremMy mouth went dry while my pulse quickened. Three sets of flared eyes bore into me, stopping me in my tracks. Making me forget my own name, forget where I was. I could feel flutters blossoming in my stomach. - ClíonaThe Huntress and the Wolf: Forbidden Love“Nope, not happening. I’m a freaking huntress.” I kept repeating as if it would make it not true. It cannot be, me of all people mated to that…that abomination. - DheliaThe Alpha and his Christmas Fairy: Mistaken Identity/Fake Relationship“It’s not that I will marry this girl, I just need her to solidify my claim as alpha and then tragically break up with her.” - Greyson",
  "genres": [],
  "author": "Kindra White",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/61161287-goldencrest-pack"
}