{
  "title": "The Journey",
  "description": "The journey of Big Panda and Tiny Dragon continues with an inspiring story of friendship and discovery for readers of all ages.In the eagerly anticipated follow up to the international bestseller, The Big Panda and Tiny Dragon continues the adventures of two unlikely traveling companions as they embark on a path that brings them farther from home, and closer to each other and themselves.“Change,” said Big Panda. “even if you don’t know where it will lead, is better than stagnation.”When Tiny Dragon feels unhappy, he confides in Big Panda, who leads his friend on a journey to heal his heart. They explore new lands, encounter extraordinary experiences, face demanding challenges, and, ultimately, find contentment. As Big Panda and Tiny Dragon trek further on their trail of acceptance, they learn that changes and challenges are a natural part of life and essential for growth.Illustrated with the same charm and warmth as the original bestseller, Big Panda and Tiny Dragon , this all-new spiritual journey imparts both ancient wisdom, and soothes today’s troubled souls. Full of inspiration and touching humor, The Big Panda and Tiny Dragon is a heartwarming tale of adventure and acceptance.BELOVED AROUND THE James Norbury’s debut Big Panda and Tiny Dragon , based on the popular Instagram account of the same name, is an international hit that inspired and delighted fans around the world, and reached #1 in his native UK.A TALE FOR ALL In The Journey , the plucky pair’s spirit of adventure will resonate with readers from toddlers to grandparents, and the engaging narrative is perfect for bedtime and storytime.INSPIRING Influenced by calligraphy and Japanese woodcuts, James Norbury’s charming illustrations are filled with detail, bursting with color, and brimming with charm and humor.GRACIOUS A beautiful volume with a timeless message of hope, The Journey offers inspiration and support for anyone embarking on an uncertain adventure, from a new job to a new day.COMPLETE YOUR The first book in the series, Big Panda and Tiny Dragon , is also available.",
  "genres": [
    "Fiction",
    "Philosophy",
    "Graphic Novels",
    "Art",
    "Self Help",
    "Childrens",
    "Spirituality"
  ],
  "author": "James Norbury",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/61165542-the-journey"
}