{
  "title": "Morningside Heights",
  "description": "Following the tremendous success of her first book, a nonfiction work on housekeeping that became a surprise bestseller, Cheryl Mendelson brings to her debut novel the same intensely readable style that made Home Comforts so popular. In the spirit of Anthony Trollope, she roots her story very much in a specific time and place—1999, in an old-fashioned New York City neighborhood that’s becoming rapidly gentrified—and the enormously engaging result resembles a twentieth-century version of The Way We Live Now .Anne and Charles Braithwaite have spent their entire married life in a sedate old apartment building in Morningside Heights, a northern Manhattan neighborhood filled with intellectual, artistic souls like themselves, who thrive on the area’s abundant parks, cultural offferings, and reasonably priced real estate. The Braithwaites, musicians with several young children, are at the core of a circle of friends who make their living as writers, psychiatrists, and professors. But as the novel opens, their comfortable life is being threatened as a buoyant economy sends newly rich Wall Street types scurrying northward in search of good investments and more space. At the same time, the Braithwaites weather the difficult love lives of their friends, and all of the characters confront their fears that the institutions and social values that have until now provided them with meaning and stability—science, religion, the arts—are in increasing decline. Though the group clings to the rituals and promises of such institutions, the Braithwaites’ imminent departure sends shock waves through their community. As the family contemplates the impossible—a move to the suburbs—their predicament represents the end of a cultured kind of city life that middle-class families can no longer afford.This intelligent and captivating social chronicle is the first of a trilogy of novels about Morningside Heights; readers sure to be drawn in by Mendelson’s habit-forming prose have much more to look forward to.",
  "genres": [
    "Fiction",
    "New York",
    "Contemporary",
    "Literary Fiction",
    "Novels",
    "Music",
    "Family"
  ],
  "author": "Cheryl Mendelson",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/61173.Morningside_Heights"
}