{
  "title": "The Withering",
  "description": "Their world has reached its end... the fight for their future has only just begun.The moon will soon collide with the surface of Noloro, and three orphaned teens have nothing left in the world but each other.As the apocalypse threatens to end all life on their world, Rho is desperate to protect his little brother and secure a future for themselves, while Jeema falls captive to her dark past.A sardonic traveling magician offers them a way off their dying world, but at what cost?Their search for an escape will force them to face questions of flesh v. spirit, natural life v. eternal life, and physical death v. spiritual death.Family, faith, and courage are at the heart of this end-of-the-world adventure.The Withering is a clean read, but has some intense scenes that may be a bit much for the under 12 crowd. The mood and themes are one part Book of Eli, one part The Gunslinger, and three parts Perelandra.---WHAT READERS ARE SAYING:\"Patton has crafted a redemptive tale of brotherhood, sacrifice, and hope.\" —Emily Hayse, 2020 Realm Award Winner for Book of the Year, Seventh City.---\"The Withering is a compelling story set against a stark dystopian landscape. Patton has put together a gripping scenario that combines suspense, intrigue, and a truly likeable cast of characters to cheer on. This smartly written, tautly paced, and carefully plotted tale will linger with you long after you turn the last page.\" —Shana Dow, Author of The Keepers of the Balance series.​---\"I stayed up into the wee hours and read the whole thing. Superb storytelling … Compelling and thought-provoking. It will be a great witnessing tool for the sci-fi/fantasy community!”​ —Daphne Self, author of When Legends Rise.​---“I really felt those Perelandra vibes throughout, and the mix of tension with (superbly done) supernatural elements made me feel like I was reading a peer of Peretti or Dekker.” —Kate Stein, Author of the Earthbound series.​",
  "genres": [
    "Science Fiction"
  ],
  "author": "P.S. Patton",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/61161408-the-withering"
}