{
  "title": "Hellucination",
  "description": "A drug-fueled trip through the gruesome levels of Hell may sound like afictional horror story to some, and since the traveler in question wasmovie distributor Stephen Biro, it could just as easily have been oneof his film projects. But Stephen's experiences were the real,life-changing sort. They're also proof that the Lorddoes work in mysterious ways -- extending all theway to squares of LSD and nitrous oxide cartridges.Armed with psychedelics, hallucinogenics and a brave desire to meet Godno matter the personal cost, Stephen pushed beyond the boundaries ofsafe drug use. He took the most nightmarish of trips from a crampedone-bedroom apartment that he used for running his underground videobusiness. With initial difficulty finding God in his altered state,Stephen instead encountered depravity and grotesquery enough to makehis soul weep, but he pushed on. And if that wasn't bad enough, hisHellish experiences bled over into his waking days, and his friends andacquaintances began identifying themselves to him as Antichrists,deities and other assorted beings from \"the other side.\" Reality wasblurring and shifting, and Stephen was run utterly ragged. Could hefulfill his quest to learn universal truths before his extreme drug usetook its toll?Hellucination: A Memoir spares no disturbing detailof the unusual route that one man took to find Christ and the God ofthe Bible. The memoir also follows younger Stephen through his 1970schildhood and his bizarre early encounters with religion that drove him to Atheism. \"An utterly surreal memoir. I'd say it was 'mindbending,' but HELLUCINATION doesn't just bend your mind, it twists it, stretches it, stabs it, and tosses it on the grill!\" -- Jeff Strand, author of the upcoming book, \"PRESSURE\" and \"WOLF HUNT\" He's been nominated for the Bram Stoker Award in 2006, 2008, and 2010.\"HELLUCINATION takes the form of a page-turning memoir, combining personal trip reporting with science fiction, horror movie, and religious mythologies, philosophical speculation on the nature of the author’s experiments with psychedelic drug combinations, strange encounters with other people who may not be what they seem, and the rationale behind his spiritual conversion from atheism to Christianity.\" --David Jay Brown Author of \"Mavericks of the Mind\" and \"Conversations on the Edge of the Apocalypse\"  “HELLUCINATION is a powerful read. In fact, it might distinctly appeal to fantasy readers, film lovers and lovers of fiction. Biro writes passionately with a purpose… you may end of ripping your eyes out afterwards though.\" -- Review, Horrornews.net\"HELLUCINATION\" is unlike any book I've ever read before. While the memoir appears to cross over into the realms of Science Fiction, Fantasy and Psychological Thriller, it does not make any pretentious claim to be anything greater or lesser than what the author had intended. While often vile and repulsive, yet told with a flair of humor, Stephen Biro is brutally honest with his audience and with himself. When I finished reading the book and finally put it down, all I could do was sit in stunned silence for an untold amount of time. Hellucination is extremely powerful, and MUST be read to be fully appreciated! -- Paul J. CaputoMind-boggling and enthralling. The visualization techniques used is astounding.",
  "genres": [
    "Horror",
    "Fiction",
    "Religion",
    "Spirituality",
    "Science Fiction",
    "Bizarro Fiction"
  ],
  "author": "Stephen Biro",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/12892808-hellucination"
}