{
  "title": "Impress of the Seventh Surge",
  "description": "In an outbreak everyone must make choices. What will yours be?From Midwest Book Review:\"Fans of speculative sci-fi and thrillers (especially those who look for succinct, hard-hitting pieces that are captivating and quickly read) will relish the power and lure of Impress of the Seventh Surge, which chronicles the now-familiar world of a pandemic survivor who struggles to help others overcome the virus.\" -Midwest Book Review, Diane DonovanWith the definitive American pandemic accounting still pending, it’s trailblazing scifi author Jessica Mae Stover who brings the receipts and then sets them aflame in Impress of the Seventh Surge, a novella about a conscientious pandemic evacuee working to free the next victims of a mysterious virus.Familiar and otherworldly, explosive with originality and utterly unconventional, coated in the residue of rage and the red tinge of fever dreams, Impress of the Seventh Surge is a plunge into near-future social bonds, technology, law, love and fascism; a profound story about justice, psychic AIs, and rising body counts that demolishes the borders between literature and technology. In these electric pages Stover ingeniously devises the next evolution in cyberpunk fiction.With her trademark “deep point-of-view” that pierces the veil between reader and character, impressionistic and startling prose, and the surreality of a video game, every twist of phrase in Seventh Surge is a knifing reminder that Stover’s experimental framing is, in fact, all too real.Impress of the Seventh Surge is an astounding work of gravity and furious speculative fiction — a scifi “what if” that doesn’t ask what would you do? but instead demands to know what you will do.In an outbreak everyone must make choices. What will yours be?IMPRESS OF THE SEVENTH SURGEA scifi novella from Jessica Mae Stover, author of Astral Fall.",
  "genres": [],
  "author": "Jessica Mae Stover",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/61184987-impress-of-the-seventh-surge"
}