{
  "title": "Revolution: 80 Days",
  "description": "Synopsis:They say a revolution usually took 365 days, but could it be possible in just eighty? British gentleman Phileas Fogg drove the world crazy with his uncanny wager to circumnavigate the globe in eighty days, at the wake of the infamous robbery done against the Bank of England. His sensational adventure, however, came to a grim end on his part as he became 20,000 pounds poorer after finishing the journey on the 81st day. The slim loss, meanwhile, did not seem to discourage the populace from proving him right. The following year, 1873, was met with a daring public declaration from two ladies and one gentleman to fulfill the monumental task, this time through an even heftier wager that tripled Fogg’s stakes.The lone gentleman who stepped up was one of Fogg’s few friends remaining in the Reform Club, the similarly eccentric yet relatively unknown Richard Haze. Intent on redeeming his friend’s convictions and taking his own place in history even as his prosperity was placed on the line, Haze decided to acquire the services of a valet who had sufficient experience and knowledge of the other side of the world in order to avoid Fogg’s fate. He found the person in the Filipino migrant worker Juan Ruiz, who beneath his cheerful façade as a valet, and his limited grasp of the English and Spanish languages was a closely held secret – he was the real bank thief.Indefinitely detained in London due to utmost diligence of the police force, the disguised Ruiz now found in Haze’s wager a legitimate way for him to escape the country and accomplish the next phase of his ultimate mission. That is, bringing the money to the Philippines in order to fund a revolution there and avenge the failure of the 1872 Cavite Mutiny, an event engraved not only in the archipelago’s history, but also in Ruiz’s personal memory. With both men bent on their respective paths towards redemption and revolution, how would this affect the ever-changing world around them? In an era of brewing instability, how could victory be assured?Design, layout:Ukiyoto Publishing. Toronto, Canada.Cover art derived from:Gustave Doré \"The New Zealander\" for London: A Pilgrimage (1872) The British Museum, London, United Kingdom. Print illustration.Esteban Villanueva \"Los Ilocanos Insurgentes del Norte dirigen al Sur\" / The Basi Revolt III (1821) Old Carcel Museum, National Museum Ilocos Regional Museum Complex, Vigan, Ilocos Sur, Philippines. Oil on canvas.",
  "genres": [],
  "author": "Arius Lauren Raposas",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/61176698-revolution"
}