{
  "title": "The Confidante: The Untold Story of the Woman Who Helped Win WWII and Shape Modern America",
  "description": "Perfect for readers of A Woman of No Importance, Three Ordinary Girls, and Eleanor: A Life comes the first-ever biography of Anna Marie Rosenberg, the Hungarian Jewish immigrant who became FDR’s closest advisor during World War II and, according to LIFE, “the most important official woman in the world” —a woman of many firsts, whose story, forgotten for too long, is extraordinary, inspiring, and uniquely American. Her life ran parallel to the front lines of history yet her influence on 20th century America, from the New Deal to the Cold War and beyond, has never before been told.“Far and away the most important woman in the American government, and perhaps the most important official female in the world.” —LIFE magazine, 1952As Franklin Delano Roosevelt’s special envoy to Europe in World War II she went where the president couldn’t go. She was among the first Allied women to enter a liberated concentration camp, and stood in the Eagle’s Nest, Hitler’s mountain retreat, days after its capture. She guided the direction of the G.I. Bill of Rights and the Manhattan Project. Though Anna Rosenberg emerged from modest immigrant beginnings, equipped with only a high school education, she was the real power behind national policies critical to America winning the war and prospering afterward. Astonishingly, her story remains largely forgotten.With a disarming mix of charm and Tammany-hewn toughness, Rosenberg began her career in public relations in 1920s Manhattan. She became friends with Eleanor Roosevelt, who recommended Anna to her husband, who was then running for Governor of New York. As FDR’s unofficial adviser, Rosenberg soon wielded enormous influence—no less potent for being subtle. Roosevelt dubbed her “my Mrs. Fix-It.” Her extraordinary career continued after his death. By 1950, she was tapped to become the assistant secretary of defense—the highest position ever held by a woman in the US military—prompting Senator Joe McCarthy to wage an unsuccessful smear campaign against her. In 1962, she organized John F. Kennedy’s infamous birthday gala, sitting beside him while Marilyn Monroe sang. Until the end of her life, Rosenberg fought tirelessly for causes from racial integration to women’s equality to national health care. More than the story of one remarkable woman, The Confidante explores who gets to be at the forefront of history, and why. Though she was not quite a hidden figure, Rosenberg’s position as “the power behind,” combined with her status as an immigrant and a Jewish woman, served to diminish her importance. In this inspiring, impeccably researched, and revelatory book, Christopher C. Gorham at last affords Anna Rosenberg the recognition she so richly deserves. “A fitting tribute to a trailblazer.” —Publishers Weekly“Wonderfully told…perfect for readers of history, biography, politics, and feminism.” —Booklist“A well-deserved first biography.” —Kirkus Reviews",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Politics",
    "World War II",
    "Historical",
    "Audiobook"
  ],
  "author": "Christopher C. Gorham",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/61192830-the-confidante"
}