{
  "title": "Oscar Wars: A History of Hollywood in Gold, Sweat, and Tears",
  "description": "The author of the New York Times bestseller Her Becoming Meryl Streep returns with a lively history of the Academy Awards, focusing on the brutal battles, the starry rivalries, and the colorful behind-the-scenes drama.America does not have royalty. It has the Academy Awards. For nine decades, perfectly coiffed starlets, debonair leading men, and producers with gold in their eyes have chased the elusive Oscar. What began as an industry banquet in 1929 has now exploded into a hallowed ceremony, complete with red carpets, envelopes, and little gold men. But don’t be fooled by the the Oscars, more than anything, are a battlefield, where the history of Hollywood—and of America itself—unfolds in dramas large and small. The road to the Oscars may be golden, but it’s paved in blood, sweat, and broken hearts.In Oscar Wars, Michael Schulman chronicles the remarkable, sprawling history of the Academy Awards and the personal dramas—some iconic, others never-before-revealed—that have played out on the stage and off camera. Unlike other books on the subject, each chapter takes a deep dive into a particular year, conflict, or even category that tells a larger story of cultural change, from Louis B. Mayer to Moonlight. Schulman examines how the red carpet runs through contested turf, and the victors aren't always as clear as the names drawn from envelopes. Caught in the crossfire are their thwarted ambitions, their artistic epiphanies, their messy collaborations, their dreams fulfilled or dashed.Featuring a star-studded cast of some of the most powerful Hollywood players of today and yesterday, as well as outsiders who stormed the palace gates, this captivating history is a collection of revelatory tales, each representing a turning point for the Academy, for the movies, or for the culture at large.",
  "genres": [
    "Nonfiction",
    "History",
    "Film",
    "Audiobook",
    "Media Tie In",
    "Pop Culture",
    "Art"
  ],
  "author": "Michael        Schulman",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/61190218-oscar-wars"
}