{
  "title": "The Diary Keepers: World War II in the Netherlands, as Written by the People Who Lived Through It",
  "description": "A riveting look at the story of World War II and the Holocaust through the diaries of Dutch citizens, firsthand accounts of ordinary people living through extraordinary times  Based on select writings from a collection of more than two thousand Dutch diaries written during World War II in order to record this unparalleled time, and maintained by devoted archivists, The Diary Keepers illuminates a part of history we haven’t seen in quite this way before, from the stories of a Nazi sympathizing police officer to a Jewish journalist who documented daily activities at a transport camp. Journalist Nina Siegal, who grew up in a family that had survived the Holocaust in Europe, had always wondered about the experience of regular people during World War II. She had heard stories of the war as a child and Anne Frank’s diary, but the tales were either crafted as moral lessons — to never waste food, to be grateful for all you receive, to hide your silver — or told with a punch line. The details of the past went untold in an effort to make it easier assimilate into American life. When Siegal moved to Amsterdam as an adult, those questions came up again, as did another horrifying Why did seventy five percent of the Dutch Jewish community perish in the war, while in other Western European countries the proportions were significantly lower? How did this square with the narratives of Dutch resistance she had heard so much about and in what way did it relate to the famed tolerance people in the Netherlands were always talking about? Perhaps more importantly, how could she raise a Jewish child in this country without knowing these answers? Searching and singular, The Diary Keepers mines the diaries of ordinary citizens to understand the nature of resistance, the workings of memory, and the ways we reflect on, commemorate, and re-envision the past.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Holocaust",
    "War",
    "Memoir",
    "Biography"
  ],
  "author": "Nina Siegal",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/61193963-the-diary-keepers"
}