{
  "title": "You Can Trust Me",
  "description": "\"Two best friends grift their way through the California elite, until a scam goes awry-with devastating consequences-in this gripping, stylish thriller. Summer and Leo would do anything for each other. Inspired by the way each has had to carve her place in a hostile and unforgiving world, and united by the call of the open road, they travel around sunny California in Summer's tricked-out Land Cruiser. It's not a glamorous life, but it gives them the freedom they crave-from family, expectations, and the painful pasts they've left behind. But even free spirits have bills to pay. Luckily, Summer is a skilled pickpocket, small-time thief, and con artist-and Leo, determined to pay her way, has learned a trick or two from Summer. Eager for a big score, Leo sets her crosshairs on Michael Forrester, self-made billionaire and philanthropist. When her charm wins him over, she's rewarded with an invite to his private island off the coast of Los Angeles for a night of fabulous excess. She eagerly anticipates returning with photos that can be sold to the paparazzi, jewelry that can be liquidated, and endless stories to share with Summer. Instead, Leo disappears. The police assure Summer that her friend probably just ditched her. After all, who would believe a philanthropic billionaire could be up to no good? On her own for the first time in years, Summer decides to infiltrate Michael's island and find out what really happened. As Summer searches for Leo, she stumbles upon hidden secrets buried deep beneath the secluded island's heavily guarded walls-secrets worth killing for-and realizes she may have met her match. Michael Forrester is used to getting what he wants. But then again, so is Summer\"--",
  "genres": [
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Audiobook",
    "Suspense",
    "Contemporary"
  ],
  "author": "Wendy Heard",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/61206567-you-can-trust-me"
}