{
  "title": "Cracks",
  "description": "This is an alternate cover ed. for ISBN 1590512057.Put adolescents together in a confined environment with only minimal adult supervision, and bad things will happen--a truism in literature as well as life. (Think The Children's Hour, think Lord of the Flies.) But in Sheila Kohler's eerie, atmospheric Cracks, the bad things that will happen are not the ones you might expect, and the message is far more complex than just \"Children are savages.\" (Although they certainly are.) Written in an ominously anonymous first person plural, the novel follows the 12 girls on the swim team at a South African boarding school. They include the jock, the pretty one, the brain, the fat girl, and perhaps most interestingly, the shadowy Sheila Kohler, a storyteller whose tales all \"came to the same dramatic finale: violent death...\" All of them are in love with the dashing Miss G, their swim instructor, and a \"crack,\" as it turns out, is a crush--the embodiment of all of adolescence's formless yearnings:  When you had a crack you saw things more clearly: the thick dark of the shadows and the transparence of the oak leaves in the light and the soft glow of the pink magnolia petals against their waxy leaves. You wanted to lie down alone in the dark in the music room and listen to Rachmaninoff and to the summer rains rushing hard down the gutters. You left notes for your crack in her mug next to her toothbrush on the shelf in the bathroom. If you accidentally brushed up against your crack and felt her boosie, you nearly fainted.  When they're not swimming, the members of the team amuse themselves by torturing new girls and taking turns fainting in chapel, until Fiamma Coronna throws everything off balance. A breathtaking Italian princess, a first-class swimmer, Fiamma quickly earns the girls' enmity by becoming Miss G's favorite. Worse still, she shows no interest in her teammates at all, and the usual hazing soon escalates to something far more serious. Heat dust, frangipani, adolescent sexuality simmering just under the surface: this could all have gone terribly, terribly wrong. It doesn't, and Kohler's elegant prose is the main reason why. The girls may be overheated, but the author's language never is. --Chloe Byrne",
  "genres": [
    "Fiction",
    "Mystery",
    "LGBT",
    "Coming Of Age",
    "Historical Fiction",
    "Queer",
    "Dark Academia"
  ],
  "author": "Sheila Kohler",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/61215900-cracks"
}