{
  "title": "Moon Blooded Breeding Clinic (Cambric Creek, #3)",
  "description": "Lowell Hemming is stuck.Grounded from his job as a photographer, this globe-trotting werewolf is pulling his hair out being back in his small hometown, with no end to the current situation in sight. The first Hemming to leave Cambric Creek in several generations, he's feeling the pressure from his mother to move back home permanently, is chafed by his inescapable family name, and hasn't gotten laid in months. When he picks up an intriguingly-worded flyer, he hopes that his boredom is about to come to an end.For the first time in her life, Moriah has an open door of possibility before her. Recently divorced, she owns her own home, her interior design business is thriving, and she's free to do what she's always wanted — travel the world. There's only one thing holding her back — the desire to have a child. After trying for years, to the erosion of her marriage, she's ready to put her dreams of travel aside and take drastic measures to get the one thing her heart desires above all else.Moon Blooded Breeding Clinic offers a unique service — trigger a heat, and breed with a werewolf in a controlled setting, right before the full moon. Their success rates are higher than multi-species IVF, cheaper than adoption, and more enjoyable than most trips to a clinic.When Moriah picks a handsome, dark-haired werewolf out of a catalog, it seems as easy as buying a pair of shoes. She doesn't count on liking him. He's funny, he's sexy, and once she takes his knot, Moriah isn't sure if she'll ever be able to see their relationship as a transaction.When Lowell gets the call that he's been chosen by a clinic patient, all he's looking forward to is scratching a physical itch and possibly unlocking a new medical kink. Catching feelings is not part of the contract. But when he meets the gorgeous little redhead who's picked him, walking away from her after he's fulfilled his end of the contract is harder than he thought.Hard to think of leaving . . . and it's not the only thing she makes hard.Moon Blooded Breeding Clinic human/monster romance novel, featuring high heat with a lot of heart, and a guaranteed HEA. It is the third book in the Cambric Creek Monster Romance series and can be read as a standalone. CWs will be available on the author's website.",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Paranormal Romance",
    "Monsters",
    "Shapeshifters",
    "Audiobook"
  ],
  "author": "C.M. Nascosta",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/61215959-moon-blooded-breeding-clinic-cambric-creek-3"
}