{
  "title": "ITV Cultures: Independent Television Over Fifty Years",
  "description": "“This exciting book goes to the heart of a creative commercial and public service culture - it shows why ITV matters and how it was made to work so well. A tremendous contribution.”Professor Jean Seaton, University of Westminster “This is a valuable addition to studies of ITV's history and programming...”Tom O'Malley, Professor of Media Studies, University of Wales, Aberyswyth, and Co-Editor of Media History . Since breaking the BBC’s monopoly in 1955, ITV has been at the centre of the British television landscape. To coincide with the fiftieth anniversary of the first ITV broadcast, this accessible book offers a range of perspectives on the complex and multifaceted history of Britain’s first commercial broadcaster. The book explores key tensions and conflicts which have influenced the ITV service. Chapters focus on particular institutions, including London Weekend Television and ITN, and programme forms, including Who Wants to be a Millionaire?, Upstairs Downstairs and Trisha . The contributors show that ITV has had to tread an uneasy line between public service and commercial imperatives, between a pluralistic regional structure and a national network, and between popular appeal and quality programming. A timeline of key events in the history of ITV is also included. ITV Cultures provides a timely intervention in debates on broadcasting and cultural history for academics and researchers, and a lively introduction to the history of ITV for students and general readers. Rod Allen, City University; Jonathan Bignell, University of Reading; John Ellis, Royal Holloway, University of London; Jackie Harrison, University of Sheffield; Jamie Medhurst, University of Wales, Aberystwyth; Matt Hills, Cardiff University; Steve Neale, University of Exeter; Helen Wheatley, University of Reading; Sherryl Wilson, Bournemouth University.",
  "genres": [],
  "author": "Catherine Johnson",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/6121350-itv-cultures"
}