{
  "title": "The Sunset Crowd",
  "description": "From Rodeo Drive to the French Riviera, Karin Tanabe's The Sunset Crowd is a tale of survival and reinvention, of faking it until you make it, and the glittering appeal of success and stardom, as it seeks to answer that timeless question―who gets to have the American dream?Money and fame: in 1970's Los Angeles, everyone is fighting to reach the top, but very few have the talent, ambition, and luck to get there.Meet LA darling Evra Scott. The daughter of an Oscar-winning director and a Brazilian bombshell actress, Evra is the city's reigning style queen. By day, she's at the helm of Sunset on Sunset, the store beloved by Hollywood's young and beautiful. By night, she's on the arm of Kai de la Faire, Hawaii's hottest export, and the screenwriter of the moment.Enter Theodora Leigh. The twenty-something Paramount assistant looks like a big screen star, but her sights are firmly set behind the scenes, as she fights to become a movie producer in a town where sex and sexism sell. Theodora's got the talent and instincts, but she's not willing to wait. Luckily, getting ahead by any means necessary is LA's mantra.Observing it all is Bea Dupont, a photographer for Rolling Stone and Vogue, who never misses the party, but always keeps to its fringes. A Manhattan blue blood turned West Coast bohemian, Bea holds Evra's Sunset crowd together. She's also Kai's oldest friend, and she's harbored a not-so-secret flame for him since they met at an elite Swiss boarding school.But in Hollywood, no one stays on top forever. And it's not long before Theodora's unrelenting ambition sets in motion a dramatic quest for power in an industry that is as glamorous as it is duplicitous. From Rodeo Drive to the French Riviera, The Sunset Crowd is a tale of survival and reinvention, of faking it until you make it, and the glittering appeal of success and stardom, as it seeks to answer that timeless question--who gets to have the American dream?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Contemporary",
    "Chick Lit",
    "Audiobook",
    "Adult"
  ],
  "author": "Karin Tanabe",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/61214141-the-sunset-crowd"
}