{
  "title": "Reluctantly Yours",
  "description": "BarrettI’ve rebuilt my father’s media company with hard work and determination, but my single status leaves me on the outs with the one businessman I need to get close to. A little white lie and I’m suddenly in love, head over heels. Now I need to find a fake girlfriend, someone to keep up appearances without any emotions.When I find my mother’s fiery assistant in a compromising position, it’s the perfect opportunity to get what I want: a girlfriend for business appearances, without any feelings involved. I won’t let the fact that I’m wildly attracted to the petite redhead get in my way.But the closer she gets, the more my heart thaws and all too soon I find myself having to choose between the business deal I’m determined to land and the woman I’ve fallen hard for.ChloeAfter two years as editorial assistant to JoAnna St. Clair of the famed St. Clair Press, I’ve been given a chance to take on my dream job as an assistant editor.When my childhood best friend asks me to host her bachelorette weekend in the city, I’m thrilled to show everyone how amazing my life is in New York. (Things not included on the tour are my shoebox of an apartment or my romance book collection that is the only thing keeping me warm at night.)But when I fail to confirm the restaurant reservation and I’m left with no event location an hour before the party starts, I’m desperate. Desperate enough to use my boss’s penthouse for a party while she’s out of town.No one will ever know. That is until her cold, dismissive, and annoyingly hot son walks in.In order to keep his silence, Barrett demands a favor in return: he needs a date for a business dinner. That’s easy enough until his mother finds out and he seals my fate by telling her we are dating. It’s that or kiss my job goodbye.While I’m reluctant at first, the more time we spend together, the harder it is to fight my attraction to him. Beneath that brooding, icy demeanor lies a heart of gold.But when a scandalous discovery puts his deal at stake, and our relationship to the test, will Barrett prove he’s all about business?",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Contemporary",
    "Workplace Romance",
    "Forced Proximity",
    "Billionaire Romance"
  ],
  "author": "Erin Hawkins",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/61211202-reluctantly-yours"
}