{
  "title": "A Wrens' Wartime Christmas",
  "description": "After her fiancé died in the sinking of the Royal Oak , Mary finds herself stationed in Orkney, still battling her grief. With Iris and Sally by her side, she is gradually overcoming her loss and is surprised to be helped by the irascible Joe . Joe is a signalman aboard the Kelpie and his cheeky Morse code signals to Mary while she's on shift bring her cheer and exasperation in equal measure. With Christmas round the corner, Mary is opening herself back up to the festive spirit – and to love. But the Germans keep slipping through Scapa Flow’s defences, somehow without triggering any of the Navy’s alarms. Could someone on land be guiding them? If so, can Mary, Iris and Sally figure out who and stop them before more lives are lost? A wonderfully heartwarming and gripping saga, perfect for readers of Johanna Bell, Kate Thompson and Daisy Styles.‘This had me enthralled from the very start … Vicki knows how to tell a great story and I can't wait until the next book. I thoroughly recommend this!’ ⭐⭐⭐⭐⭐ Reader review ‘Enjoyed this book - was a lovely, easy to read story with really good characters !’ ⭐⭐⭐⭐⭐ Reader review ‘ Another brilliant story from Vicki Beeby . I do so love reading this genre – you learn so much.’ ⭐⭐⭐⭐⭐ Reader review ‘This book kept me awake at night because I couldn’t put it down . It was exciting and heartwarming in equal measures … loved it.’ ⭐⭐⭐⭐⭐ Reader review ‘ Another fantastic book in the series . The girls are all so likeable... The story was easy to read and had plenty of twists and turns to keep the reader interested.’ ⭐⭐⭐⭐⭐ Reader review ‘ I loved the festive wartime vibes . Honestly had me smiling from ear to ear and this is another book I can add to the ‘adored it’ list.’ ⭐⭐⭐⭐⭐ Reader review ‘Wow what another brilliant book in The Wren Series . If you love family saga set during the world wars, this is right up your street.’ ⭐⭐⭐⭐⭐ Reader review",
  "genres": [
    "Historical Fiction",
    "World War II",
    "Christmas",
    "Fiction"
  ],
  "author": "Vicki Beeby",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/61203235-a-wrens-wartime-christmas"
}