{
  "title": "The Babysitter Lives",
  "description": "Only on Audio! A new horror novel from the bestselling author of The Only Good Indians and My Heart is a Chainsaw.A mother carries her six-year-old daughter into the tiled bathroom where the bathtub is already running, is still running, is overflowing, and for a moment the girl calms, seeing her little brother floating facedown in the water, his hair a golden halo around him, but then this mother is guiding her face-first down into that water, that, as it turns out, isn’t just water but scalding water, and eleven years later her scream is the drawer screeching out of the counter by the sink.When high school senior Charlotte agrees to babysit the Wilbanks twins, she plans to put the six-year-olds to bed early and spend a quiet night studying: the SATs are tomorrow, and checking the Native American/Alaskan Native box on all the forms doesn’t mean jack if you choke on test day.But tomorrow is also Halloween, and the twins are eager to show off their costumes—Ron is a nurse, in an old-fashioned white skirt-uniform, and Desi has an Authentic Squaw costume, complete with buckskin and feathered headdress. Excitement is in the air.Charlotte’s last babysitting gig almost ended in tragedy, when her young charge sleepwalked unnoticed into the middle of the street, only to be found unharmed by Charlotte’s mother. Charlotte vows to be extra careful this time. But the house is filled with mysterious noises and secrets that only the twins understand, echoes of horrors that Charlotte gradually realizes took place in the house eleven years ago. Soon Charlotte has to admit that every babysitter’s worst nightmare has come true: they’re not alone in the house.The Babysitter Lives is a mind-bending haunted house tale from the Jordan Peele of horror literature, Stephen Graham Jones.",
  "genres": [
    "Horror",
    "Audiobook",
    "Fiction",
    "Paranormal",
    "Thriller",
    "Adult",
    "Fantasy"
  ],
  "author": "Stephen Graham Jones",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/61228644-the-babysitter-lives"
}