{
  "title": "Face Down in the Marrow-Bone Pie",
  "description": "\"Today's letter was not a summons to serve Queen Elizabeth. It came from Lancashire. John Bexwith, my steward at Appleton Manor, is dead.\"Susanna frowned, surprised that this news should have affected her husband so strongly. \"The man was quite elderly,\" she said hesitantly, \"was he not?\"\"Your memory is excellent,\" Robert told her, absently tucking an unruly lock of dark brown hair back up under her brocaded cap. \"He was found face down in a marrow-bone pie.\"With that incredible statement, Robert placed the letter in his wife's outstretched hand.Face Down in the Marrow-Bone Pie is a delightfully cozy Elizabethan mystery introducing Susanna, Lady Appleton. When her husband's steward dies in a unique, ignominious, and highly suspicious manner, Susanna takes advantage of her husband's absence on a political mission for Queen Elizabeth to investigate Bexwith's mysterious demise.The serving wench who found Bexwith claims that he was frightened to death by a ghost, but Susanna can think of several poisons that could have been concealed in the marrow-bone pie. (Susanna is something of an expert on poisons, having been inspired by her sister's fatal encounter with some poisonous berries to write a cautionary herbal for housewives.)Even if Bexwith was poisoned, was it accidental or intentional? As if the case weren't complicated enough, Susanna must also unmask a \"ghost\"-- or are the ghost and the poisoner one and the same?Kathy Lynn Emerson's debut Elizabethan mystery will delight as it introduces you to a sixteenth-century husband's worst nightmare: an intelligent, no-nonsense wife who happens to know hundreds of poisons.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Cozy Mystery",
    "Fiction",
    "British Literature"
  ],
  "author": "Kathy Lynn Emerson",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/612301.Face_Down_in_the_Marrow_Bone_Pie"
}