{
  "title": "Madame Restell: The Life, Death, and Resurrection of Old New York's Most Fabulous, Fearless, and Infamous Abortionist",
  "description": "“This is the story of one of the boldest women in American history: a self-made millionaire, a celebrity in her era, a woman beloved by her patients and despised by the men who wanted to control them.”   In Madame Restell, readers are instantly transported to the glamorous mansions and bejeweled carriages of pre-Gilded Age New York, where they meet our eponymous heroine: the city’s premiere abortionist. An industrious woman who built her business from the ground up, Restell was a self-taught surgeon on the cutting edge of healthcare, and her bustling “boarding house” provided birth control, abortions, and medical assistance to thousands of women—rich and poor alike. As her practice expanded, her notoriety swelled, and Restell established herself as a prime target for tabloids, threats, and lawsuits galore. But far from fading into the background, she flaunted her wealth defiantly, parading across the city in designer duds and expensive jewelry, rubbing her success in the faces of the many politicians, publishers, religious zealots, and male competitors determined to bring her down. Unfortunately for Madame Restell, her rise to the top of her field coincided with “the greatest scam you’ve never heard about”: the campaign to curtail women’s power by restricting their access to healthcare. For centuries, midwives and female practitioners, like Restell, had tended to public healthcare needs of both men and women. But after the birth of the medical clinic, newly-minted male MDs were eager to edge out their feminine competition—by forcing women back into the home and turning medicine into a standardized, male-only practice. At the same time, a group of powerful, secular men—threatened by women’s burgeoning independence in other fields—persuaded the Christian leadership to declare abortion a sin, rewriting the meaning of “Christian morality” to protect their own interests. By unraveling the misogynistic and misleading lies that put women’s health in jeopardy, Wright simultaneously restores Restell to her rightful place in history and obliterates the faulty, fractured reasoning underlying the very foundation of what has since been dubbed the “pro-life” movement. Thought-provoking, character-driven, boldly written, and feminist as hell, Madame Restell is required reading for anyone and everyone who believes that when it comes to women’s rights, women’s bodies, and women’s history, women should have the last word.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Feminism",
    "Audiobook",
    "Historical",
    "Womens"
  ],
  "author": "Jennifer   Wright",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/61237011-madame-restell"
}