{
  "title": "The World Treasury of Children's Literature: Books I & II",
  "description": "Clifton Fadiman can remember to this day the wonder that he felt as a child when he opened a book and found \"a surprise package stuffed with things I had no idea ever existed.\" Fadiman's lifelong love affair with books, which began at the age of four, is evident in this splendid anthology, which gives young children--and adults who can still summon up the child in themselves--a chance to explore the riches of books that will entertain, amuse, sadden, delight, mystify, and astonish.International in scope, covering countless countries, and handsomely illustrated (often with the original art), the 140 selections in The World Treasury of Children's Literature represent the finest traditional and modern favorites. Book I has Mother Goose rhymes, as well as rhymes from Hungary, Denmark and China; ancient Norse and Greek myths; Aesop's fables; English fairy tales, including The Story of the Three Bears and Whittington and His Cat; and verse by Robert Louis Stevenson, Hilarie Belloc, and Dennis Lee. And there are wonderful stories by:-Margaret Wise Brown (Goodnight Moon)-Jean de Brunhoff (The Story of Babar the Little Elephant)-Marie Hall Ets (Play with Me)-Robert McCloskey (Make Way for Ducklings)-H.A. Rey (Curious George)-Ezra Jack Keats (Hi, Cat)-Judith Viorst (Alexander and the Terrible, Horrible, No Good, Very Bad Day)-Else Holmelund Minarik (A Kiss for Little Bear)-Wanda G'ag (The Funny Thing)-Tomi Ungerer (The Three Robbers)Continuing the parade of children’s favorites that began in the first book, the beautifully illustrated companion volume opens with Gunter Spang’s marvelous The House in Sunflower Street and ends with the modern classics Where the Wild Things Are and Chicken Soup with Rice by Maurice Sendak. In between there are fairy tales by the Brothers Grimm, including Cinderella, Hansel and Gretel and Rumpelstiltskin; nonsense verse and limericks by Edward Lear, and wonderfully illustrated stories by Mitsumasa Anno (The King’s Flower) and Dr. Seuss (And to Think That I Saw It on Mulberry Street).Readers will also meet some of the best-loved characters in children’s literature in:* The Tale of Peter Rabbit by Beatrix Potter * The Tomten by Astrid Lindgren*Amos and Boris by William Steig* The Story about Ping by Marjorie Flack and Kurt Wiese* Mr. Gumpy’s Motor Car by John Burningham* Eeyore Has a Birthday and Gets Two Presents by A.A. Milne* The Stupids Step Out by Harry Allard * The Emperor’s New Clothes by Hans Christian Andersen* “Paddington Goes Underground,” from A Bear Called Paddington by Michael Bond.Designed so that readers can dip into the two books anywhere and find something delightful and entertaining, The World Treasury of Children’s Literature is one of the finest anthologies of its kind ever published. It is a collection that will be read and reread by everyone, who, like Clifton Fadiman, is still in awe of “the miracle of language.”",
  "genres": [
    "Childrens",
    "Fiction",
    "Poetry",
    "Classics",
    "Reference",
    "Short Stories",
    "Fantasy"
  ],
  "author": "Clifton Fadiman",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/612259.The_World_Treasury_of_Children_s_Literature"
}