{
  "title": "Season of Love",
  "description": "For a limited time only discontinued on 31st of January 2012. Start your collection today!A time of changing seasons and changing lives…Is it the season to find contentment or reach for something more? Four stories of discovery, hope, and the realization that nothing is more important than being with the one you love.A holiday collection including stories by:A Christmas Proposal by Sherri Hayes -Matthew Andersen knew he wanted to spend the rest of his life with Cali Stanton. Since she came into his life just five months ago, his world had completely changed for the better. With everything in their lives finally coming together, he was determined to make their first Christmas a memorable one. Not the Same Season by Lindsey Gray -Two broken hearts embarked on a holiday season in a way they never had before. Divorced Mitch had been badly burned by love, but was willing to take a chance . . . with the right woman. Hannah had lived everyday with the grief love had brought her that followed her everywhere. Can two hearts find love and heal each other during the most difficult season of the year? A Christmas Kiss by Jennifer Schmidt -Christmas Eve for Emma Callaway is just another night stuck at the office fetching coffee and being ignored by her workaholic boss Jarrett Mackenzie. But when a snow storm forces them to spend the night together Emma learns her boss isn’t quite what he seems. And when Jarrett finally notices his assistant the only thing he wants for Christmas is her. Bone Deep by C. M. Smith - Matt Kulver never wanted a steady girlfriend. Being able to come and go as he pleased, not having to answer to anyone, and able to sleep around with as many other girls as he wanted was something he prided himself in. That all changed when the one girl who stuck by his side in spite of the jerk moves he would pull. When she, his best friend, starts to pull away, he's forced to face the truth. This Christmas, Matt has a lot to make up for.",
  "genres": [
    "Romance"
  ],
  "author": "Sherri Hayes",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/12895613-season-of-love"
}