{
  "title": "The Greatest Speeches of Donald J. Trump: 45TH PRESIDENT OF THE UNITED STATES OF AMERICA with an Introduction by Presidential Historian Craig Shirley",
  "description": "\"We will make America strong again. We will make America safe again. And we will make America great again. Greater than ever before!” — President Donald J. Trump The ultimate collection of President Donald J. Trump's most important speeches and words to the Nation. The Greatest Speeches of President Donald J. Trump is edited by New York Times bestselling author and President Reagan biographer Craig Shirley who also wrote the introduction. This beautiful book will include historical photographs throughout and is the perfect gift for anyone who wants to know the history of how President Trump made America great again.  The collection includes speeches from many pivotal and powerful moments in President Trump’s time in office and his presidential The President's own strong and inspiring words from his final speech to the Nation from Washington D.C. while in office as the 45th President of the United States of \"We must never forget that while Americans will always have our disagreements, we are a nation of incredible, decent, faithful, and peace-loving citizens who all want our country to thrive and flourish and be very, very successful and good. We are a truly magnificent nation... As long as the American people hold in their hearts deep and devoted love of country, then there is nothing that this nation cannot achieve. Our communities will flourish. Our people will be prosperous. Our traditions will be cherished. Our faith will be strong. And our future will be brighter than ever before. I go from this majestic place with a loyal and joyful heart, an optimistic spirit, and a supreme confidence that for our country and for our children, the best is yet to come. Thank you, and farewell. God bless you. God bless the United States of America.\"",
  "genres": [],
  "author": "Donald J. Trump",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/61224188-the-greatest-speeches-of-donald-j-trump"
}