{
  "title": "The Infidelity Clause",
  "description": "“What are you talking about? Marry another man?”\nCaspian, fourth son and yet still a Crown Prince of Gunkermal knew he was a party to a marriage contract. Arranged marriages were common in his family, and he expected the contract would cement various trade or security agreements with another country. He just didn't realize the other party to his contract was a full-grown man, who stepped off his ship and into Caspian's life as if he owned it.\nHow much is this marriage worth to our king again?\nNikolas, Crown Prince and only heir of Westland, arrived in Gunkermal to fulfill his part of a marriage contract that was six months in the making. He was under no illusions about his prospective spouse. By all accounts, his intended was a womanizer, a lay about, and was likely someone who fussed if Nikolas should use a wrong fork at dinner. That's why Nikolas insisted their marriage contract have an infidelity clause. He figured his spouse would invoke what was known as the \"piss-off\" clause before Christmas and he'd be free.\nIt’s far better to marry someone whose weaknesses we’re already aware of.\nOne man went into his marriage contract blindly. The other thought he knew everything there was to know about his intended spouse. When circumstances suggested that neither man knew what was actually going on, was there a possibility the marriage could work after all? And what did a pirate captain have to do with anything at all.The Infidelity Clause is a whimsical story that is the result of the author's muse taking a holiday. If you are a fan of MM arranged marriage stories, set in a land with a dash of magic, and a double dose of humor, you might enjoy this one. The main characters in this story are adults, so intimate situations are described. Please store your e-book content responsibly.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Romance",
    "Historical",
    "Magic",
    "Paranormal",
    "Historical Romance"
  ],
  "author": "Lisa Oliver",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/61221365-the-infidelity-clause"
}