{
  "title": "The Unmatchmakers",
  "description": "From the author of DONUT FALL IN LOVE comes a perfect summer love story set in the forested paradise of Canadian cottage country that asks the question: can love beat the odds when the odds are two mothers dead-set against it?----------------You’d think my mother would be trying to set me up with architect Neil Choy, the unmarried son of her best friend. But you’d be wrong.My single mother has always been fiercely independent. Since I was a small child, she’s always told me not to believe in fairy tales and that I don’t need a man. So she’s failed to mention that Neil is a total hottie in glasses. When I see him for the first time in a decade, on a multi-family cottage vacation, I’m in for quite a shock. (In fact, I nearly fall in the lake, but let’s keep that a secret.)He sure can grill a mean steak and mix a killer cocktail, plus he’s pretty impressive in a kayak. Yes, he’s a little stern and grumpy, but that just makes him more fun to tease—and makes it more satisfying when he quirks his lips in my direction.Even though my mind is spinning romantic fantasies, I’m not entirely sure how he feels. And I’m afraid that if anything happens between us, it’ll screw up the friendship between our staunchly anti-relationship mothers. Especially since they’ve been acting increasingly weird since we arrived—I will never forgive them for the S’mores Incident. In fact, I think they’re trying to sabotage my love life, and I’m starting to worry that I won’t make it through this bizarre summer vacation…----------------Perfect for fans of Helen Hoang’s THE BRIDE TEST and THE DONUT TRAP by Julie Tieu, THE UNMATCHMAKERS is a forced-proximity, friends-to-lovers romantic comedy that explores finding the balance of meeting expectations and being true to yourself, and how even the best of intentions can sometimes backfire.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "Audiobook",
    "Canada",
    "Friends To Lovers"
  ],
  "author": "Jackie Lau",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/61218594-the-unmatchmakers"
}