{
  "title": "Eat Your Heart Out",
  "description": "Cold.Cruel.Coward.Ares “Wolf” Mallick ripped my heart out. He ground it into mush and didn’t even grant me the courtesy of a goodbye. He just left me. He left and said our relationship, fake or otherwise, meant nothing to him.I made a mistake last semester, and it had nothing to do with our phony arrangement. I let him hurt me, and I refuse to make that mistake again. Wolf and I make it back into each other’s lives, and when we do, I make one thing clear. I don’t need him anymore.Showing up for the holidays with his brother only drives the point home.Cry.Red.Wolfy.I’ve moved on from my ex-fake boyfriend, but unfortunately, the physical draw to him is still there. It’s carnal and just as messed up as him and that period we played pretend.Wolf has made it very clear he feels nothing for me, and I loathe the guy who savagely broke my heart. The pair of us don’t need or even like each other, but we don’t have to in order for a relationship with benefits to work. The Big Bad Wolf and I aren’t friends, and I have no desire to be…I’m more than fine being his enemy.Warning: Eat Your Heart Out is an enemies-to-lovers, college romance. Please see the author’s website upon release for content warnings. The book is recommended for readers 18+ and is book five in Eden O’Neill’s Court Legacy series. Eat Your Heart Out is not a standalone and is part two of a duet. Part one, Eat You Alive, needs to be read before reading this book.Author's Note: Court Legacy is a spin-off series about the children of characters featured in Eden O'Neill's Court High and Court University series. It's not necessary to read the previously released series to enjoy Court Legacy. This is a new series that can be read completely on its own.",
  "genres": [
    "Dark Romance",
    "Romance",
    "Enemies To Lovers",
    "College",
    "Dark",
    "Second Chance",
    "Second Chance Romance"
  ],
  "author": "Eden O'Neill",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/61223043-eat-your-heart-out"
}