{
  "title": "Hoops Shorts: A HOOPS Novella Collection",
  "description": "Two novellas from Kennedy Ryan's critically-acclaimed HOOPS Series!Full-Court Press (formerly appeared in HOOPS Holiday)Avery + Deck's StoryMacKenzie Decker was a question Avery never got to ask, much less answer.They met when she was a young reporter fueled by ambition, and the ink on Deck's first NBA contract was barely dry. Years later, they've climbed so high and lost so much, but one thing hasn't changed. The attraction that simmered between them in a locker room before is still there. With success like theirs, everything has been possible . . . except them.But that was then.The only question is...what about now?Fast BreakQuinn + Ean's StoryQuinnI was a world-class runner once.My dreams had wings spun from wind and speed.Every time out of the blocks was a glorious flight.But then I crashed and burned.When I lost my leg, I thought it was the finish lineLittle did I know, life was just beginningNow they call me “America’s Titanium Sweetheart.”(What can I say? It tested well. LOL)The life I thought was over is moving so fast.I have my own gym, a fitness app, a clothing line, and an endless trail of endorsements.One thing there’s never time for? Love.One thing I don’t have time for? Games.Come real, or don’t come at all. In a field full of players, I’m looking for a real one.Otherwise, I won’t stop.EanI had hoops dreams. I wanted to be like Mike, jump like Magic and soar like Dr. J.But a college injury grounded me. What I thought was game over, actually opened up a whole new world.Fast forward to now. I’m coaching some of the NBA’s best.They call me The Machine because I’m obsessed with stats and data, and my near-photographic memory means I remember every play.I see the court clearly. But I never saw her coming. Quinn Barrow stops me in my tracks.Pursuing my first championship, there’s been no time for love.I’m more than willing to chase her, but will she slow down long enough to be caught?",
  "genres": [
    "Sports Romance",
    "Romance",
    "Novella",
    "Sports",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Kennedy Ryan",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/61221133-hoops-shorts"
}