{
  "title": "Time and Tide in Sarajevo",
  "description": "Shortlisted for the 2023 Readings Prize for New Australian FictionEvelyn is teaching English in Sarajevo, a beautiful city still recovering almost two decades after the long and brutal siege in the 1990s.Life in the city is tenuous yet welcoming. Dedicated to her work preparing high-schoolers for a scholarship that could change the course of their lives, Evelyn feels more herself here than at home in Australia. But when the teenage son of a local hero is stabbed and it seems like a cover-up will let the killer go free, Sarajevans take to the streets in protest.When Evelyn discovers evidence that could ignite the volatile situation, putting both her students' ambitions and her friendships at risk, she faces an impossible decision.Gripping and heartfelt, Time and Tide in Sarajevo asks: how do we find hope in a world that feels beyond repair?-‘In Time and Tide in Sarajevo Birdsall constructs an intricate world, where old pain and contemporary frustration ignite and hope and despair are tightly woven. A tinderbox ofa novel. Finely-crafted and absorbing.’Jessie Cole, author of Staying‘A fine thread of tension and mystery binds this beautiful, gentle story. Time and Tide in Sarajevo is both fascinating and touching, encompassing lovely details of life in Sarajevo.’Mirandi Riwoe, author of Stone Sky Gold Mountain‘A vivid and compelling novel that goes right to the beating heart of modern-day Sarajevo.’Marele Day, author of Lambs of God‘Time and Tide in Sarajevo hooked me from page one. Bronwyn Birdsall has written a triumph of a book – a tender, careful, beautiful love letter to a city and its people that grapples with belonging and the possibility of repair. I couldn’t put this page-turner down!’Sarah Sentilles, author of Draw Your Weapons",
  "genres": [
    "Fiction",
    "Literary Fiction"
  ],
  "author": "Bronwyn Birdsall",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/61234924-time-and-tide-in-sarajevo"
}