{
  "title": "Sink: A Memoir",
  "description": "A wrenching and redemptive coming-of-age memoir about the difficulty of growing up in a hazardous home and the glory of finding salvation in geek culture. Stranded within an ever-shifting family’s desperate but volatile attempts to love, saddled with a mercurial mother mired in crack addiction, and demeaned daily for his perceived weakness, Joseph Earl Thomas grew up feeling he was under constant threat. Roaches fell from the ceiling, colonizing bowls of noodles and cereal boxes. Fists and palms pounded down at school and at home, leaving welts that ached long after they disappeared. An inescapable hunger gnawed at his frequently empty stomach, and requests for food were often met with indifference if not open hostility. Deemed too unlike the other boys to ever gain the acceptance he so desperately desired, he began to escape into fantasy and virtual worlds, wells of happiness in a childhood assailed on all sides. In a series of exacting and fierce vignettes, Thomas guides readers through the unceasing cruelty that defined his circumstances, laying bare the depths of his loneliness and illuminating the vital reprieve geek culture offered him. With remarkable tenderness and devastating clarity, he explores how lessons of toxic masculinity were drilled into his body and the way the cycle of violence permeated the very fabric of his environment. Even in the depths of isolation, there were unexpected moments of joy carved out, from summers where he was freed from the injurious structures of his surroundings to the first glimpses of kinship he caught on his journey to becoming a Pokémon master. SINK follows Thomas's coming-of-age towards an understanding of what it means to lose the desire to fit in—with his immediate peers, turbulent family, or the world—and how good it feels to build community, love, and salvation on your own terms.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Coming Of Age",
    "Adult"
  ],
  "author": "Joseph Earl Thomas",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/61237136-sink"
}