{
  "title": "California Sister",
  "description": "Winner of the 2024 Independent Press Awards in the category Grief: Fiction. Winner of the 2022 Indies Today Awards in Best Contemporary Fiction. Two-Time Finalist in the 2023 Next Generation Indie Books Awards. Finalist in the 2023 American Writing Awardsin the Multi-Cultural Fiction category. Two-Time Winner in the 2022 Firebird Book Awards. November 2023 International Book Of The Month official selection of The Pulpwood Queens and Timber Guys Book Club and Reading Nation. Moral dilemmas crash into fierce, sisterly love. Claire Waters, an Italian mystery writer living in Los Angeles, rushes to Italy after her older sister's devastating brain-hemorrhage, determined to restore her health-or help her die with dignity. Claire is a gritty decision-maker, a lone wolf who values freedom above all else. Her sister, Ondina-now on the edge of death or living a severely limited life-is wise, cautious, and sociable. They may be different, but have remained close despite the distance. Claire is faced with a dilemma impossible to solve. Would her non-verbal sister want to go on struggling, damaged as she is, or end her suffering? How can anybody know what's best for others? \"Cathartic, poignant and sensitive, California Sister explores the fine line where selflessness and selfishness coalesce into a muddle mess. Gloria Mattioni's heartrending novel is not the first to walk such emotionally charged ground, but it might be the best!\" - IndiesToday (5-star review) \"A touching novel about sisterly love. An immediate audience-grabber and practical parable about the choices we make and the priorities that matter to us.\"-Readers' Favorite (5-star review) \"In California Sister, Gloria Mattioni explores sibling love and navigating family, distance, and desire. A poignant story of caring and coping and of growing apart and healing together, deftly traversing California to Italy and back. A deeply touching and heartfelt narrative.\" David Francis, author of The Great Inland Sea, Stray Dog Winter and Wedding Bush Road",
  "genres": [],
  "author": "Gloria Mattioni",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/61252206-california-sister"
}