{
  "title": "I Choose You",
  "description": "Mackenzie There are two things in life I’m certain about—commitment isn’t for me, and Mason, my best friend, isn’t a person I want to live without. I’m more than aware of the effects his presence has, how it soothes me and makes me thrive all at once. So, when he shares the news of his promotion out of state, it’s only reasonable my heart seizes. I wish I could say the response only comes from his approaching move, but here’s the thing…I’m noticing him more than I should. More than I want to. I’m ready to pull out all the tricks to ignore what I want when a night of drunken stupidity leads to a kiss. Mason seals his lips over mine, and it feels better than it should. Despite my fear of commitment and the scars his departure reminds me of, I can’t say no to him.When my fears become too loud to silence, I know I need to make a choice. Do I choose the promise I made to myself, or do I choose Mason? I wish I could choose both, but both may not be an option…Mason There are two things in life I’m certain about—how stupid it would be if I were to decline the biggest promotion of my life and how attracted I am to Mackenzie, my best friend. Being hundreds of miles away isn’t exactly what I picture when I think about my future, but time is ticking—I have to make a choice. And I do. I choose the promotion, but here’s the thing…A drunken dare gives me the chance to throw caution to the wind, and I do the one thing I’ve dreamt about for years—I allow her allure to take over, pull her close, and kiss the hell out of her. It’s only reasonable that it knocks me to my knees and rocks my soul.When my love for her gets too apparent to hide, I know choosing only one thing isn’t in the cards, and I decide to go rogue and choose both. But both may not be an option…I CHOOSE YOU is a full-length standalone best friends to lovers romance with swoon-worthy characters, a heartfelt plot, binge-worthy drama, and steamy angst that will have you reading until the HEA. Recommended for 18+.",
  "genres": [
    "Friends To Lovers",
    "Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Sara Tallary",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/61245543-i-choose-you"
}