{
  "title": "The House Is on Fire",
  "description": "The author of Florence Adler Swims Forever returns with a masterful work of historical fiction about an incendiary tragedy that shocked a young nation and tore apart a community in a single night—told from the perspectives of four people whose actions during the inferno changed the course of history.Richmond, Virginia 1811. It’s the height of the winter social season. The General Assembly is in session, and many of Virginia’s gentleman planters, along with their wives and children, have made the long and arduous journey to the capital in hopes of whiling away the darkest days of the year. At the city’s only theater, the Charleston-based Placide & Green Company puts on two plays a night to meet the demand of a populace that’s done looking for enlightenment in a church.On the night after Christmas, the theater is packed with more than six hundred holiday revelers. In the third-floor boxes, sits newly widowed Sally Henry Campbell, who is glad for any opportunity to relive the happy times she shared with her husband. One floor away, in the colored gallery, Cecily Patterson doesn’t give a whit about the play but is grateful for a four-hour reprieve from a life that has recently gone from bad to worse. Backstage, young stagehand Jack Gibson hopes that, if he can impress the theater’s managers, he’ll be offered a permanent job with the company. And on the other side of town, blacksmith Gilbert Hunt dreams of one day being able to bring his wife to the theater, but he’ll have to buy her freedom first.When the theater goes up in flames in the middle of the performance, Sally, Cecily, Jack, and Gilbert make a series of split-second decisions that will not only affect their own lives but those of countless others. And in the days following the fire, as news of the disaster spreads across the United States, the paths of these four people will become forever intertwined.Based on the true story of Richmond’s theater fire, The House Is on Fire offers proof that sometimes, in the midst of great tragedy, we are offered our most precious—and fleeting—chances at redemption.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Audiobook",
    "Mystery",
    "Adult"
  ],
  "author": "Rachel Beanland",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/61271754-the-house-is-on-fire"
}