{
  "title": "The Status Revolution: The Improbable Story of How the Lowbrow Became the Highbrow",
  "description": "How did rescue dogs become status symbols? Why are luxury brands losing their cachet? What’s made F. Scott Fitzgerald’s most famous observations obsolete? The answers are part of a new revolution that’s radically reorganizing the way we view ourselves and others that “will be hard for pop-culture readers to put down” (Booklist).Status was once easy to identify—fast cars, fancy shoes, sprawling estates, elite brands. But in place of Louboutin’s and Lamborghinis, the relevance of the rich, famous, and gauche is waning and a riveting revolution is underfoot. Chuck Thompson—dubbed “savagely funny” by The New York Times and “wickedly entertaining” by the San Francisco Chronicle—sets out to determine what “status” means today and learns that what was once considered the low life has become the high life. In Status Revolution, Thompson tours the new world of status from a small community in British Columbia where an indigenous artist uses wood carving to restore communal status; to a Washington, DC, meeting of the “Patriotic Millionaires,” a club of high-earners who are begging the government to tax them; to a luxury auto factory in the south of Italy where making beautiful cars is as much about bringing dignity to a low-earning region than it is about flash and indulgence; to a London lab where the neural secrets of status are being unlocked. “Chock-full of shocking revelations” (In Touch Weekly) and with his signature wit and irreverence, Thompson explains why everything we know about status is changing, upends centuries of conventional wisdom, and shows how the new status revolution reflects our place in contemporary society.",
  "genres": [
    "Nonfiction",
    "History",
    "Society",
    "Sociology",
    "Cultural",
    "Audiobook",
    "Economics"
  ],
  "author": "Chuck Thompson",
  "average_rating": "2.91",
  "url": "https://www.goodreads.com/book/show/61271873-the-status-revolution"
}