{
  "title": "Final Battle: THE NEXT ELECTION COULD BE THE LAST",
  "description": "\"My great friend and author of 'Dark Agenda,' David Horowitz, is out with a new book, 'Final The Next Election Could Be the Last.' It is great! Get your copy.\"—PRESIDENT DONALD J. TRUMP“I could not be a bigger fan…David Horowitz has been telling the truth for decades, in a way that almost nobody else has been willing to.”—PETE HEGSETH “Nothing less than a handbook for the salvation of the United States of America.”—DENNIS PRAGER“Exposes the outrages perpetrated by the Biden Administration and the Democratic Left.”—DINESH D’SOUZA“An ominous warning about what the future may hold if the present course is not reversed. Don’t miss it.”—PETER SCHWEIZERDemocrats have conducted a sustained assault on the spirit of compromise that binds the union together and set the nation on the path to a one-party state.Final Battle exposes the real threat that Democrats pose to freedom. The rise of socialism and critical race theory, coupled with threats to the Electoral College and Senate, an independent judiciary, and the integrity of the electoral system, now threaten to destroy the traditions that bring Americans together — the heart of our democracy. Attacks on these quintessentially American customs codified by the Founding Fathers undermine the possibility of bipartisan solutions to common problems like viral pandemics and civil disorders. Americans now speak in different and antagonistic political languages, and the two parties are so polarized that the American way of life itself is at risk. In his devastating exposé of the Democrats’ nefarious goals, New York Times bestselling author David Horowitz reveals the hallmarks of their strategies, The double standard in Antifa and BLM versus January 6 Citizenship as granting noncitizens privileges like voting, welfare, and healthcare So-called “cancel culture” and collusion in the defamation of conservative voices “Empires and states rise and fall while everybody is watching. Although the watchers may be surprised when the actual collapse occurs, with the hindsight provided by the end itself, everybody can see how it fell.”Read Final Battle before it’s too late!",
  "genres": [
    "Politics",
    "Nonfiction",
    "Society"
  ],
  "author": "David Horowitz",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/61256503-final-battle"
}