{
  "title": "The Call of the Void",
  "description": "In this 21st century pastiche to Dante’s Inferno, the author of God’s Unwanted Child puts the reader in the driver’s seat of a surreal, oneiric vision about the changing nature of American society, and those who reject it. After a successful, albeit bleak, education in academia, Sam Killian—now Doctor Killian—has accepted a tenured position at UCLA’s Department of Philosophy. The only problem is things aren’t what they used to be. His students, now in an open mutiny against Killian, talk through class, use their cell phones constantly, and mock Sam at every turn, all with impunity. Feeling like an abject Kafka character, Sam turns to the bottle in a desperate struggle to find some form of escapism. Weathering the constant invective storm of his class, Sam finally snaps one day while on a 48-hour cocaine fueled liquor binge and levels his graduate students with an enigmatic, indecipherable, philippic that puts him on paid leave. The resulting fallout puts him in the midst of an all-out, nationwide, viral opprobrium. The university’s provost takes mercy on Sam and stipulates a psychiatric evaluation for his reinstatement with the school’s own psychologist. Convinced Sam is a pedantic philosophaster that has unwisely distanced himself from people, he accepts the terms of Sam’s reinstatement under one condition—Sam must spend one night walking the streets of LA.Whether traversing LA’s sordid Red-Light District, consorting with a band of virtuous, renegade pariahs that follow Sam through each chapter committing ritual suicide, or fighting off unsavory characters at Target on Black Friday, Killian has 12 hours to complete his arduous task. Part philosophical peregrination, part jeremiad on the decadence of Western Civilization, The Call of the Void is a starkly explicit reminder of the seedy world that rests just beneath our own.",
  "genres": [
    "Fiction",
    "Dark Academia"
  ],
  "author": "Reece LeResche",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/61256095-the-call-of-the-void"
}