{
  "title": "Who's Got Your Back: The Breakthrough Program to Build Deep, Trusting Relationships That Create Success--And Won't Let You Fail",
  "description": "Disregard the myth of the lone professional “superman” and the rest of our culture’s go-it alone mentality. The real path to success in your work and in your life is through creating an inner circle of “lifeline relationships” – deep, close relationships with a few key trusted individuals who will offer the encouragement, feedback, and generous mutual support every one of us needs to reach our full potential. Whether your dream is to lead a company, be a top producer in your field, overcome the self-destructive habits that hold you back, lose weight or make a difference in the larger world, Who’s Got Your Back will give you the roadmap you’ve been looking for to achieve the success you deserve.Keith Ferrazzi, the internationally renowned thought leader, consultant, and bestselling author of Never Eat Alone, shows us that becoming a winner in any field of endeavor requires a trusted team of advisors who can offer guidance and help to hold us accountable to achieving our goals. It is the reason PH.D candidates have advisor teams, top executives have boards, world class athletes have fitness coaches, and presidents have cabinets.In this step-by-step guide to the powerful principles behind personal growth and change, you’ll learn how · Master the mindsets that will help you to build deeper, more trusting “ lifeline relationships”· Overcome the career-crippling habits that hold you back, once and for all· Get further, faster by setting goals in a dramatically more powerful way· Use “sparring ” as a productive tool to make the decisions that will fuel personal success· Replace the yes men in your life with those who get it and care – and will hold you accountable to achieving your goals· Lower your guard and let others help!None of us can do it alone. We need the perspective and advice of a trusted team. And in Who’s Got Your Back, Keith Ferrazzi shows us how to put our own “dream team” together.",
  "genres": [
    "Business",
    "Self Help",
    "Relationships",
    "Nonfiction",
    "Personal Development",
    "Psychology",
    "Leadership"
  ],
  "author": "Keith Ferrazzi",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/6125587-who-s-got-your-back"
}