{
  "title": "I'm Just Saying: A Guide to Maintaining Civil Discourse in an Increasingly Divided World",
  "description": "A straightforward look at the history and the art of maintaining courteous communication in an increasingly divided world.Have you ever been in a conversation that, after volleying back and forth, ended with the words, “I’m just saying . . .”? Usually, this signals frustration, that the discussion has reached a dead end, that you haven’t made your point, and may even leave you feeling that your relationship with the other person has changed for the worse. Digital interactions, devoid of nuance and understanding, further complicate discussion. We may believe that we are superior because our opinions are the “right” ones, and in the future avoid conversations with those whose opinions differ from ours, sending us into a never-ending echo chamber. In I’m Just Saying, author Milan Kordestani shows us that although challenging conversations can be unpleasant, they can also help us grow. Sometimes, people inspire us to change how we speak, making us better communicators in the process as we search to find common ground with those with whom we disagree. Kordestani uses contemporary case studies and personal experience to teach readers how to have constructive conversations by engaging in civil discourse—the idea that good-faith actors can reach consensus on any opinion-based disagreement. He discusses influential leaders and reflects on his successes and failures in creating The Doe, an online publication focused on civil discourse. He addresses the challenges that digital media consumption presents when seeking common ground—especially when people are only digitally connected. Civil discourse, an essential part of democracy, is becoming rare in today's digital age. I’m Just Saying examines discourse's successes and the ways to rebuild it. Drawing from history, popular culture, and personal anecdotes, the book promotes effective civil discourse by providing practical advice and strategies for respect. Through story, I’m Just Saying offers insight and tools for politeness in a divided world.",
  "genres": [
    "Nonfiction",
    "Communication",
    "Self Help",
    "Psychology",
    "Personal Development",
    "Politics",
    "Leadership"
  ],
  "author": "Milan Kordestani",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/61271862-i-m-just-saying"
}