{
  "title": "Doctor Untouchable",
  "description": "The secret I’m keeping from my hot boss is a ticking time bomb. And it’s about to explode…Running out on my wedding and throwing myself onto his car to get away from my cheating ex is not how I thought I’d see Kaplan Fritz again.Which is probably why I didn’t recognize him until I ran into his mother shortly after. A hell of a morning and a bottle of champagne later and I’m accepting a job I likely shouldn't—working for his family’s foundation as their new executive assistant.Now I'm in a new city, living a new life, determined that this will be the start of a new me, while foolishly assuming I’ll never have to see Kaplan again. Wrong.Sitting high up on his throne, Doctor Untouchable with his boyishly handsome face, piercing green eyes, and jawline that could sharpen a knife can make a girl blush and her panties melt just by walking past her. Everyone wants a piece of Boston’s last eligible billionaire bachelor.I simply want to forget he ever existed to me.Especially when it turns out he's nothing like the man I remember.Cold, aggravatingly closed off, and infuriatingly cocky, his sexy smirk grates on my every nerve. The pediatric cardiothoracic surgeon has no time or patience for me, his lowly assistant trying to help him run his family's foundation that he's now the CEO of.Every encounter we have grows more and more heated. Every fiery exchange a twisted form of foreplay. Which is why I'm determined he never discover the truth about me.But what happens when my cover is blown and he realizes that the curvy girl he loves to fight with is the same one from his past? DOCTOR UNTOUCHABLE is a 106k word INSANELY steamy, laugh out loud, full on romance with explosive chemistry. It is guaranteed to hit you straight in the feels! One-click this standalone in the bestselling series about Boston's hottest billionaire doctors and the women they fall head over heels for!",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Second Chance",
    "Doctors",
    "Contemporary",
    "Medical"
  ],
  "author": "J. Saman",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/61259814-doctor-untouchable"
}