{
  "title": "The Seeds of War",
  "description": "The Seeds of War, Book Two in Ashok Banker’s “MBA” series, introduces us to the elder protagonists of the epic, as well as some of the great loves and lusts, friendships and enmities, politics and self-sacrifice that will lay the seeds that will eventually fester and erupt into the mother of all wars. At first it may seem that the journey is the reward, with seemingly unrelated love stories, fantastical tales of exploits in the heavenly realms, divine pacts and demoniac trysts. But it soon becomes evident that all these form a tapestry revealing the grandeur and glamour of the Kuru Bharata race itself, the growing descendants of the original tribe that established perhaps the greatest and oldest human civilization ever known in recorded history. Their loves and enmities are epic, their stories astonishing, their personalities mercurial. Every page you turn reveals magical new thrills and wonders. As one larger-than-life personality after another strides onstage, the drama ratchets up to thriller level, the arrow swarms begin to fly and conflicts turn ugly as the author of the Ramayana Series once again proves himself the master of epics.Ashok Kumar Banker’s internationally acclaimed Ramayana Series® has been hailed by critics as a ‘milestone’ (India Today) and a ‘magnificently rendered labour of love’ (Outlook). It is arguably the most popular English-language retelling of the ancient Sanskrit epic. His work has been published in 56 countries, a dozen languages, several hundred reprint editions with over 1.1 million copies of his books currently in print.With the Ramayana Series® Banker embarked on a massively ambitious publishing project he calls the Epic India Library. Returning to the roots of the great ancient tales that have inspired countless authors and filmmakers, Banker sought to reclaim the original stories through a series of multi-volume retellings as well as original fiction and non-fiction. The Krishna Coriolis series, of which the first three books have been published, and the Mahabharata Series (of which this book is the second in an 18-volume series) are part of this project..",
  "genres": [
    "Mythology",
    "Fiction",
    "India",
    "Hinduism",
    "Fantasy"
  ],
  "author": "Ashok K. Banker",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/12896777-the-seeds-of-war"
}