{
  "title": "Inn Love",
  "description": "Elijah I’ve never really been into the West Coast women, all glitz and glamor. They just want what you can do for them. I am so tired of looking for the right woman, I don’t even date. I look at all my single male friends and it looks like such a hassle to deal with. Different women, all the time. I’ll know my perfect mate when I see her, but not if I can only associate with actresses and groupies. So I need a break from all the directors, actors, producers, and cameramen…. Returning home to restore my family’s Inn seems like a step down from my Hollywood stardom. But I guess I came here for a reason because a beautiful stranger is walking toward the doorstep of my parent’s Inn, looking for an inexpensive room to spend the night. It’s her. I instantly recognize that this is the woman who I have been waiting for to walk into my life, just begging for me to make her mine…. She’s young and beautiful. She could have any man she wants but would she want an older man like me? Olivia It’s truly been a lonely and oftentimes scary life for me since I was a child. Moving from home to home, never really finding my place with another family, never mind if they liked me or not. All I really wanted was to find a place to belong and to be loved. Living in the city, though, I haven’t been able to find a job that can afford a better apartment, never mind the dump I live in now. Plus, just my luck, there is a strange man stalking me. I have no idea who he is or why he is following me, but anywhere I go, he seems to be there. So, getting kicked out of my apartment seems like a blessing in disguise this time. When I show up at the one Inn in town that has a room, I’m greeted by the most handsome man on Earth. His appearance just stops me in my tracks. Never have I seen such beauty in a man before. I could tell when our eyes locked that he would play an extremely important part in my life from here on out. But I have a secret, and it may threaten to destroy this thing between him and me….",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Flora Ferrari",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/61265638-inn-love"
}