{
  "title": "All the Knowledge in the World: The Extraordinary History of the Encyclopedia",
  "description": "The encyclopaedia once shaped our understanding of the world.Created by thousands of scholars and the most obsessive of editors, a good set conveyed a sense of absolute wisdom on its reader. Contributions from Albert Einstein, Sigmund Freud, Orville Wright, Alfred Hitchcock, Marie Curie and Indira Gandhi helped millions of children with their homework. Adults cleared their shelves in the belief that everything that was explainable was now effortlessly accessible in their living rooms.But now these huge books gather dust, and sell for almost nothing on eBay, and we derive our information from our phones and computers, apparently for free. What have we lost in this transition? And how did we tell the progress of our lives in the past?All the Knowledge in the World is a history and celebration of those who created the most ground-breaking and remarkable publishing phenomenon of any age. It tracks the story from Ancient Greece to Wikipedia, from modest single-volumes to the 11,000-volume Chinese manuscript that was too big to print. It looks at how Encyclopaedia Britannica came to dominate the industry, how it spawned hundreds of competitors, and how an army of ingenious door-to-door salesmen sold their wares to guilt-ridden parents. It explains how encyclopaedias have reflected our changing attitudes towards sexuality, race and technology, and exposes how these ultimate bastions of trust were often riddled with errors and prejudice.With his characteristic ability to tackle the broadest of subjects in an illuminating and highly entertaining way, Simon Garfield uncovers a fascinating and important part of our shared past, and wonders whether the promise of complete knowledge - that most human of ambitions - will forever be beyond our grasp.",
  "genres": [
    "History",
    "Nonfiction",
    "Books About Books",
    "Science",
    "Audiobook",
    "Reference",
    "Education"
  ],
  "author": "Simon Garfield",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/61281788-all-the-knowledge-in-the-world"
}