{
  "title": "Take Command: Find Your Inner Strength, Build Enduring Relationships, and Live the Life You Want",
  "description": "Take command of your future with this groundbreaking, Wall Street Journal bestseller, from the experts who brought you How to Win Friends and Influence People.Take Command offers powerful tools and time-tested methods to help you live an intentional life by transforming how you approach your thoughts, emotions, relationships, and future. Filled with stories of everyday people and based on expert research and interviews with more than a hundred high-performing leaders, Take Command gives you the strategies you need to unlock your full potential and create the life you want.Written by Joe Hart (CEO) and Michael Crom (Board Member) of Dale Carnegie & Associates, Take Command is a modern manual for personal development that will help anyone, at any age. It is structured around questions geared to encourage self-reflection, such -How do we use the power of mindset to deal with stress and anxiety, gain perspective on negative emotions, and build resilience?-Once we understand our inner lives, how do we create enriching, rewarding, and enduring relationships?-How do we deal with difficult people and manage conflict?-After mastering our thoughts and relationships, how do we live courageously and intentionally to build a vision that will bring out the best in ourselves and other people?For more than one hundred years, the wisdom of Dale Carnegie’s How to Win Friends and Influence People has provided people around the world with richer, more fulfilling relationships and a happier way of life. Now, Take Command combines decades of Dale Carnegie’s award-winning training and timeless principles—ones that have transformed the personal and professional lives of millions—into a master text that tells you everything you need to know about the art of human relations.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Business",
    "Personal Development",
    "Psychology",
    "Love Story",
    "Romantic"
  ],
  "author": "Joe   Hart",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/61273823-take-command"
}