{
  "title": "An Assassin in Utopia: The True Story of a Nineteenth-Century Sex Cult and a President's Murder",
  "description": "This true crime odyssey explores a forgotten, astonishing chapter of American history, leading the reader from a free-love community in upstate New York to the shocking assassination of President James Garfield.It was heaven on earth—and, some whispered, the devil’s garden. Thousands came by trains and carriages to see this new Eden, carved from hundreds of acres of wild woodland. They marveled at orchards bursting with fruit, thick herds of Ayrshire cattle and Cotswold sheep, and whizzing mills. They gaped at the people who lived in this place—especially the women, with their queer cropped hair and shamelessly short skirts. The men and women of this strange outpost worked and slept together—without sin, they claimed. From 1848 to 1881, a small utopian colony in upstate New York—the Oneida Community—was known for its shocking sexual practices, from open marriage and free love to the sexual training of young boys by older women. And in 1881, a one-time member of the Oneida Community—Charles Julius Guiteau—assassinated President James Garfield in a brutal crime that shook America to its core. An Assassin in Utopia is the first book that weaves together these explosive stories in a tale of utopian experiments, political machinations, and murder. This deeply researched narrative—by bestselling author Susan Wels—tells the true, interlocking stories of the Oneida Community and its radical founder, John Humphrey Noyes; his idol, the eccentric newspaper publisher Horace Greeley (founder of the New Yorker and the New York Tribune); and the gloomy, indecisive President James Garfield—who was assassinated after his first six months in office. Juxtaposed to their stories is the odd tale of Garfield’s assassin, the demented Charles Julius Guiteau, who was connected to all of them in extraordinary, surprising ways. Against a vivid backdrop of ambition, hucksterism, epidemics, and spectacle, the book’s interwoven stories fuse together in the climactic murder of President Garfield in 1881—at the same time as the Oneida Community collapsed. Colorful and compelling, An Assassin in Utopia is a page-turning odyssey through America’s nineteenth-century cultural and political landscape.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Audiobook",
    "American History",
    "Politics",
    "Cults"
  ],
  "author": "Susan Wels",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/61272014-an-assassin-in-utopia"
}