{
  "title": "You and Your Adult Child: How to Grow Together in Challenging Times",
  "description": "A “wonderfully innovative” (Jennifer Senior, New York Times bestseller All Joy and No Fun), much-needed guide for parents of people in their twenties and thirties from one of the world’s leading developmental psychologists.Your child is now an adult, but your job as a parent is far from over. Instead, your role must evolve to meet their ongoing, changing needs. But what exactly are these new needs? And why are they so different now than they were when you were a young adult? This is the first comprehensive guide written for parents whose children are in two of the most crucial decades of life. Steinberg discusses topics as various as whether you should be involved in your child’s college education, how to behave when they unexpectedly must move back home, how to state your opinion on their romantic partners, what to do when you disagree with the way they are raising their own child, and what parameters to apply if you want to give them money for a home or startup. He answers such challenging questions When do I express my opinion and when should I bite my tongue? How do I know if my son is floundering? Is it okay to help my daughter with her grad school application? What should I do if my kid is getting seriously involved with someone I think is dangerous? We have been helping our twenty-five-year-old financially for the last few years, but how long is too long? How can I help my adult child through a difficult psychological time? Leading psychologist Laurence Steinberg has devoted his forty-five-year career to researching parent-child relationships. Here, he provides some “must-read” (Martin Seligman, PhD, author of The Hope Circuit) principles to help parents with adult children think more intelligently about common issues, avoid minefields, weather the inevitable ups and downs, and create a stronger, happier, more effective bond with their child.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Relationships",
    "Audiobook"
  ],
  "author": "Laurence Steinberg",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/61272212-you-and-your-adult-child"
}