{
  "title": "Excavating the Histories of Slave-Trade and Pirate Ships: Property, Plunder and Loss",
  "description": "This edited volume brings new perspectives on the topic maritime archaeology of the slave trade in the Caribbean. The book focuses on shipwrecks of the slave trade in the 18th century and suggests that there is a more complex and challenging social narrative than has previously been discussed. The authors examine biographies of ships, crew members, voyage logs, cargo inventories, trader correspondence and contextual analysis of the artifact assemblages to bring new insights into the microeconomics and maritime traditions of these floating prisons. The illustrious biography of Captain Edward Thache (aka Blackbeard) reveals past identities as a naval officer, slave trader, and pirate. Categories of artifacts in archaeological collections represent cultural connections and traditions of enslaved Africans. The volume includes several case studies that inform these narratives and examines slave ships such as la Concorde, Henrietta Marie, Whydah, La Marie Seraphique and Marquis de Bouillé.Within the larger context of slave trade during the 18th century, authors explore legal and illegal trade in the British West Indies. These studies also address the plethora of social, political, and environmental impacts on these island communities that played an integral and strategic role in slave trade economics. This volume presents up-to-date research of professional maritime historians, artifact curators, and marine archaeologists drawing upon primary source documents, artwork, and material culture. The research collaborators reconstruct the international spheres of colonial North America, Europe, Africa, and West Indies. It is an interwoven narrative, both unique and typical, to the social and economic dynamics of 18th century Atlantic World.",
  "genres": [],
  "author": "Lynn Brenda Harris",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/61275412-excavating-the-histories-of-slave-trade-and-pirate-ships"
}