{
  "title": "Ringmaster: Vince McMahon and the Unmaking of America",
  "description": "“Riveting, essential reading.” —Rick Perlstein, author of Reaganland \nThe definitive biography of Vince McMahon, former WWE chairman and CEO, charts his rise from rural poverty to the throne of one of the world’s most influential media empires—and features never-before-seen research and exclusive interviews with more than 150 people who witnessed, aided, and suffered from his ascent.\n\n\nEven if you’ve never watched a minute of professional wrestling, you are living in Vince McMahon’s world. In his four decades as the defining figure of American pro wrestling, McMahon was the man behind Dwayne “The Rock” Johnson, “Stone Cold” Steve Austin, John Cena, Dave Bautista, Bret “The Hitman” Hart, and Hulk Hogan, to name just a few of the mega-stars who owe him their careers. For more than twenty-five years, he has also been a performer in his own show, acting as the diabolical “Mr. McMahon”—a figure who may have more in common with the real Vince than he would care to admit. Just as importantly, McMahon is one of Donald Trump’s closest friends—and Trump’s experiences as a performer in McMahon’s programming were, in many ways, a dress rehearsal for the 45th President’s campaigns and presidency. McMahon and his wife, Linda, are major Republican donors. Linda was in Trump’s cabinet. McMahon makes deals with the Saudi government worth hundreds of millions of dollars. And for generations of people who have watched wrestling, he has been a defining cultural force. Accessible to anyone, regardless of wrestling knowledge, Ringmaster is an unauthorized, independent, investigative chronicle of Vince McMahon’s origins and rise to supreme power. It is built on exclusive interviews with more than 150 people, from McMahon’s childhood friends to those who accuse him of destroying their lives. Far more than just an athletics or entertainment biography, Ringmaster uses Vince’s story as a new lens for understanding the contemporary American apocalypse.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Sports",
    "Business",
    "Audiobook",
    "Pop Culture",
    "History"
  ],
  "author": "Abraham Riesman",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/61273754-ringmaster"
}