{
  "title": "Maybe Next Time",
  "description": "Alternate cover edition of ISBN 9780063239920.One Day meets Groundhog Day, in this heartwarming and emotionally poignant novel about a stressed woman who must relive the same day over and over, keeping her family and work life from imploding as she attempts to spare her husband from an unfortunate fate.It is an ordinary Monday and harried London literary agent Emma is flying out of the door as usual. Preoccupied with work and her ever growing to-do list, she fails to notice her lovely husband Dan seems bereft, her son can barely meet her eye, and her daughter won’t go near her. Even the dog seems sad.She is far too busy, buried deep in her phone; social media alerts pinging; clients messaging with “emergencies”; keeping track of a dozen WhatsApp groups about the kids’ sports, school, playdates, all of it. Her whole day is frantic—what else is new—and as she rushes back through the door for dinner, Dan is still upset. They fight, and he walks out, desolate, dragging their poor dog around the block. Just as she realizes it is their anniversary and she has forgotten, again, she hears the screech of brakes.Dan is dead.The next day Emma wakes up… and Dan is alive. And it’s Monday again.And again.And again.Emma tries desperately to change the course of fate by doing different things each time she wakes up: leaving WhatsApp, telling her boss where to get off, writing to Dan, listening to her kids, reaching out to forgotten friends, getting drunk and buying out Prada. But will Emma have the chance to find herself again, remember what she likes about her job, reconnect with her children, love her husband? Will this be enough to change the fate they seem destined for?A moving “What if” story of what it is to be a woman in the modern world—never feeling we’re getting it quite right—about learning to slow down and appreciate life that is sure to resonate with women’s fiction fans.",
  "genres": [
    "Fiction",
    "Romance",
    "Audiobook",
    "Time Travel",
    "Book Club",
    "Contemporary",
    "Magical Realism"
  ],
  "author": "Cesca   Major",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/61281769-maybe-next-time"
}