{
  "title": "Adrift in the Embers",
  "description": "Join Little Corey on his journey out of the fire, away from the crippling doubt and uncertainties, and into the healing, adrenaline-inducing, sweet, filthy, and safe embrace of three men starting to realize their dynamic might not be complete just yet. On a bad day, I blamed my stupid, damaged, autistic brain. No one forced me to be with him. No one forced me to accept what he told me. That I was difficult. Difficult to handle, difficult to please…heck, even difficult to go out to dinner with, considering all my texture issues. On a bad day, I believed every word he said. I was lucky to have him. I loved him so, so much for putting up with me. I was gonna leave my friends and family behind, move with him to Denver, and we were going to be happy together forever. Then Master Greer opened his big mouth, and I didn’t know what to believe anymore. He was my friend, my favorite Sadist in the whole world, and he was dating two amazing men who were also saying stuff that was painful to hear. Like, I wasn’t difficult at all. Like, the man who was supposed to protect me, love me, and take care of me in our Daddy/Little relationship was in reality abusing me. I started having good days thanks to them. Good, bewildering, mind-numbing, eye-opening, very good days. It was just extremely important I didn’t get confused by their kindness. They opened up their home to me as an act of friendship. Nothing more, nothing less. As soon as I felt better, I’d be on my way again. Crap. - The Game Series is a BDSM series where romance meets the reality of kink. Sometimes we fall for someone we don’t match with, sometimes vanilla business gets in the way of kinky pleasure, and sometimes we have to compromise and push ourselves to overcome trauma and insecurities. No matter what, one thing is certain. This is not a perfect world—and maybe that’s why the happily ever after feels so good.",
  "genres": [
    "BDSM",
    "M M Romance",
    "M M M",
    "Romance",
    "Polyamory",
    "Contemporary",
    "LGBT"
  ],
  "author": "Cara Dee",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/61276920-adrift-in-the-embers"
}