{
  "title": "The Ugly History of Beautiful Things: Essays on Desire and Consumption",
  "description": "Exploring our obsession with gorgeous things, unveiling the fraught histories of makeup, flowers, perfume, silk, and other beautiful objects.  Katy Kelleher has spent much of her life chasing beauty. As a child, she uprooted handfuls of purple, fragrant little flowers from the earth, plucked iridescent seashells from the beach, and dug for turquoise stones in her backyard. As a teenager she applied glittery shimmer to her eyelids after religiously dabbing on her signature scent of orange blossoms and jasmine. And as an adult, she coveted gleaming marble countertops and delicate porcelain to beautify her home. This obsession with beauty led her to become a home, garden, and design writer, where she studied how beautiful things are mined, grown, made, and enhanced. In researching these objects, Kelleher concluded that most of us are blind to the true cost of our desires. Because whenever you find something unbearably beautiful, look closer, and you’ll inevitably find a shadow of decay lurking underneath.  In these dazzling and deeply researched essays, Katy Kelleher blends science, history, and memoir to uncover the dark underbellies of our favorite goods. She reveals the crushed beetle shells in our lipstick, the musk of rodents in our perfume, and the burnt cow bones baked into our dishware. She untangles the secret history of silk and muses on her problematic prom dress. She tells the story of countless workers dying in their efforts to bring us shiny rocks from unsafe mines that shatter and wound the earth, all because a diamond company created a compelling ad. She examines the enduring appeal of the beautiful dead girl and the sad fate of the ugly mollusk. With prose as stunning as the objects she describes, Kelleher invites readers to examine their own relationships with the beautiful objects that adorn their body and grace their homes.  And yet, Kelleher argues that while we have a moral imperative to understand our relationship to desire, we are not evil or weak for desiring beauty. The Ugly History of Beautiful Things opens our eyes to beauty that surrounds us, helps us understand how that beauty came to be, what price was paid and by whom, and how we can most ethically partake in the beauty of the world.",
  "genres": [
    "Nonfiction",
    "Essays",
    "History",
    "Audiobook",
    "Psychology",
    "Memoir",
    "Art"
  ],
  "author": "Katy Kelleher",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/61272288-the-ugly-history-of-beautiful-things"
}