{
  "title": "The Only Survivors",
  "description": "A decade ago, two vans filled with high school seniors on a school service trip crashed into a Tennessee ravine—a tragedy that claimed the lives of multiple classmates and teachers. The nine students who managed to escape the river that night were irrevocably changed. A year later, after one of the survivors dies by suicide on the anniversary of the crash, the rest of them make a pact: to come together each year to commemorate that terrible night.To keep one another safe.To hold one another accountable.Or both.Their annual meeting place, a house on the Outer Banks, has long been a refuge. But by the tenth anniversary, Cassidy Bent has worked to distance herself from the tragedy and from the other survivors. She’s changed her mobile number. She’s blocked the others’ email addresses. This year, she is determined to finally break ties once and for all. But on the day of the reunion, she receives a text with an obituary attached: another survivor is gone. Now they are seven—and Cassidy finds herself hurling back toward the group, wild with grief—and suspicion.Almost immediately, something feels off this year. Cassidy is the first to notice when Amaya, the annual organizer, slips away, overwhelmed. This wouldn’t raise alarm except for the impending storm. Suddenly, they’re facing the threat of closed roads and surging waters…again. Then Amaya stops responding to her phone. After all they’ve been through, she wouldn’t willfully make them worry. Would she?And—as they promised long ago—each survivor will do whatever he or she can do to save one another. Won’t they?A propulsive and chilling locked-box mystery filled with the dazzling hairpin twists that are the author’s signature, The Only Survivors is New York Times bestselling author Megan Miranda’s best novel yet.",
  "genres": [
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Audiobook",
    "Suspense",
    "Adult"
  ],
  "author": "Megan Miranda",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/61273351-the-only-survivors"
}