{
  "title": "Good Girls: A Story and Study of Anorexia",
  "description": "From Hadley Freeman, bestselling author of House of Glass , comes a “riveting” ( The New York Times ) memoir about her experience as an anorexic and her journey to recovery.In 1995, Hadley Freeman wrote in her “I just spent three years of my life in mental hospitals. So why am I crazier than I was before????”From the ages of fourteen to seventeen, Freeman lived in psychiatric wards after developing anorexia nervosa. Her doctors informed her that her body was cannibalizing her muscles and heart for nutrition, but they could tell her little why she had it, what it felt like, what recovery looked like. For the next twenty years, Freeman lived as a “functioning anorexic,” grappling with new forms of self-destructive behavior as the anorexia mutated and persisted. Anorexia is one of the most widely discussed but least understood mental illnesses. Through “sharp storytelling, solid research and gentle humor” ( The Wall Street Journal ), Freeman delivers an incisive and bracing work that details her experiences with anorexia—the shame, fear, loneliness, and rage—and how she overcame it. She interviews doctors to learn how treatment for the illness has changed since she was hospitalized and what new discoveries have been made about the illness, including its connection to autism, OCD, and metabolic rate. She learns why the illness always begins during adolescence and how this reveals the difficulties for girls to come of age. Freeman tracks down the women with whom she was hospitalized and reports on how their recovery has progressed over decades.Good Girls is an honest and hopeful story of resilience that offers a message to the nearly 30 million Americans who suffer from eating Life can be enjoyed, rather than merely endured.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Mental Health",
    "Biography",
    "Psychology",
    "Audiobook",
    "Feminism"
  ],
  "author": "Hadley Freeman",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/61273822-good-girls"
}