{
  "title": "The Deerfield Massacre: A Surprise Attack, a Forced March, and the Fight for Survival in Early America",
  "description": "In the tradition of the New York Times bestseller Empire of the Summer Moon comes a spellbinding account of a forgotten chapter in American the deadly confrontation between Native Americans and colonists in Massachusetts in 1704 and the tragic saga that unfolded, written by acclaimed historian James Swanson.Once it was one of the most famous events in early American history. Today, it has been nearly forgotten.In an obscure, two-hundred-year-old museum in a little village in western Massachusetts, there lies what once was the most revered but now totally forgotten relic from the history of early New England—the massive, tomahawk-scarred door that came to symbolize the notorious Deerfield Massacre. This impregnable barricade—known to early Americans as “The Old Indian Door”—constructed from double-thick planks of Massachusetts oak and studded with hand-wrought iron nails to repel the flailing tomahawk blades of several attacking native tribes, is the sole surviving artifact from the most dramatic moment in colonial American Leap Year, February 29, 1704, a cold, snowy night when hundreds of native Americans and their French allies swept down upon an isolated frontier outpost and ruthlessly slaughtered its inhabitants.The sacking of Deerfield led to one of the greatest sagas of adventure, survival, sacrifice, family, honor, and faith ever told in North America. 112 survivors, including their fearless minister, the Reverand John Williams, were captured and led on a 300-mile forced march north, into enemy territory in Canada. Any captive who faltered or became too weak to continue the journey—including Williams’s own wife and one of his children—fell under the knife or tomahawk.Survivors of the march willed themselves to live and endured captivity. Ransomed by the King of England’s royal governor of Massachusetts, the captives later returned home to Deerfield, rebuilt their town and, for the rest of their lives, told the incredible tale. The memoir of Rev. Williams, The Redeemed Captive , became the first bestselling book in American history and published a few years after his liberation, it remains a literary classic. The old Indian door is a touchstone that conjures up one of the most dramatic and inspiring stories of colonial America—and now, finally, this legendary event is brought to vivid life by popular historian James Swanson.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Historical",
    "True Crime",
    "War",
    "Audiobook"
  ],
  "author": "James L. Swanson",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/61272701-the-deerfield-massacre"
}