{
  "title": "The Secret Keeper",
  "description": "From USA TODAY and internationally bestselling author Genevieve Graham comes a gripping World War II novel about two sisters who join the war effort—one as a codebreaker and the other as a pilot—and the secrets that threaten to tear them apart. Perfect for fans of The Rose Code and The Nightingale .Twin sisters Dot and Dash Wilson share many things, and while they are practically inseparable, they are nothing alike. Dot is fascinated by books, puzzles, and Morse code, a language taught to both girls by their father, a WWI veteran. Dash’s days are filled with fixing engines, dancing with friends, and dreaming of flying airplanes. Almost always at their side is their best friend Gus—until war breaks out and he enlists in the army, deploying to an unknown front.Determined to do their duty, both girls join the WRENS, Dash as a mechanic and Dot as a typist. Before long, Dot’s fixation on patterns and numbers takes her from HMCS Coverdale , a covert listening and codebreaking station working with Bletchley Park in England, to Camp X, a top-secret spy school. But when personal tragedy strikes the family, Dot’s oath of secrecy causes a rift between the sisters.Eager to leave her pain behind, Dash jumps at the opportunity to train as a pilot with the Air Transport Auxiliary, where she risks her life to ferry aircraft and troops across the battlefields of Europe. Meanwhile Dot is drawn into the Allies’ preparations for D-Day. But Dot’s loyalties are put to the test once more when someone close to her goes missing in Nazi-occupied territory. With everyone’s eyes on Operation Overlord, Dot must use every skill at her disposal to save those she loves before it’s too late.Inspired by the real-life stories of women in World War II, The Secret Keeper is an extraordinary novel about the unbreakable bonds of sisterhood and the light of courage during the darkest of nights.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "Audiobook",
    "Canada",
    "War"
  ],
  "author": "Genevieve Graham",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/61273857-the-secret-keeper"
}