{
  "title": "The Night Travelers",
  "description": "Four generations of women experience love, loss, war, and hope from the rise of Nazism to the Cuban Revolution and finally, the fall of the Berlin Wall in this sweeping novel from the bestselling author of The German Girl.Berlin, 1931: Ally Keller, a talented young poet, is alone and scared when she gives birth to a mixed-race daughter she names Lilith. As the Nazis rise to power, Ally knows she must keep her baby in the shadows to protect her against Hitler’s deadly ideology of Aryan purity. But as she grows, it becomes more and more difficult to keep Lilith hidden so Ally sets in motion a dangerous and desperate plan to send her daughter across the ocean to safety.Havana, 1958: Now an adult, Lilith has few memories of her mother or her childhood in Germany. Besides, she’s too excited for her future with her beloved Martin, a Cuban pilot with strong ties to the Batista government. But as the flames of revolution ignite, Lilith and her newborn daughter, Nadine, find themselves at a terrifying crossroads.Berlin, 1988: As a scientist in Berlin, Nadine is dedicated to ensuring the dignity of the remains of all those who were murdered by the Nazis. Yet she has spent her entire lifetime avoiding the truth about her own family’s history. It takes her daughter, Luna, to encourage Nadine to uncover the truth about the choices her mother and grandmother made to ensure the survival of their children. And it will fall to Luna to come to terms with a shocking betrayal that changes everything she thought she knew about her family’s past.Separated by time but united by sacrifice, four women embark on journeys of self-discovery and find themselves to be living testaments to the power of motherly love.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "World War II",
    "Book Club",
    "War",
    "Audiobook"
  ],
  "author": "Armando Lucas Correa",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/61272710-the-night-travelers"
}