{
  "title": "To Poison a King",
  "description": "S.G. Prince's new standalone is a breathtaking fantasy about sacrifice, self-discovery, and a girl tasked with saving the very man she aimed to kill.Selene is the youngest daughter in a gifted line of healers, born to serve as the king's royal physician. Yet when Selene's mother Persaphe embroils her in a plot to kill the king, Selene finds herself poisoning the very man she is sworn to protect. Things seem bleak, but there is another problem—the poison doesn’t work, and the king doesn’t die. Rather, he awakes from his coma paralyzed, aware of the attempt on his life, and furious. With the palace in a state of upheaval and everyone hunting the king's poisoner, Persaphe flees, leaving Selene the task of rehabilitating the man she aimed to kill, all while hiding her true role in his demise. What follows is a journey spanning years and continents, as a king and his servant develop into unlikely friends…and more. Yet the closer Selene grows to the king, the more her secret weighs on her, as does her growing fear that Persaphe—having failed to kill him once—might return to try again. Author's Note: To Poison a King is an adult standalone fantasy romance featuring a brooding hero and a gifted yet self-conscious healer. The story is written for readers who want to know a character from the inside out, who are in it for the build, who like to watch a transformation take place over time, because that's how you really feel it. I wrote this book from the heart, as true as I could make it. I think it changed me to write it. I hope it changes you, too. - S.G.Content Warning: This book contains reference to attempted suicide, attempted sexual assault, violence, gore, death of an infant, and sex.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fantasy Romance",
    "Adult",
    "Romantasy",
    "Witches",
    "Magic"
  ],
  "author": "S.G. Prince",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/61288500-to-poison-a-king"
}