{
  "title": "Violent Desire",
  "description": "12 immortals, 12 outcasts, 1 mission.Kill their own kind, before it’s too late. \nDetective, killer, vigilant. Eric Sharpe is tired of watching criminals walk free. When a low-life drug-dealer kills his partner and escapes justice, Eric plots his own revenge. His plan is faultless, but for one thing: The handsome, mysterious man who arrives moments before Eric’s plan comes to fruition. Not only does the mysterious man know Eric’s an undercover cop, he knows exactly what Eric did fifteen years ago—an event so traumatic Eric has been trying to bury it ever since. And the mysterious man? Fifteen years ago, Eric killed him. Now he’s back to reclaim what’s his: Detective Eric Sharpe. Immortal. Predator. Vampire. After betraying himself and the Blackrose Brotherhood, Zaine can’t afford another mistake. There’s one rule above all others the Brotherhood stand by. One rule that can never be broken. Never, ever, care. All Zaine has to do is hunt and kill the savage nyktelios vampires and keep his head down. And he was doing just fine, until saving Detective Eric Sharpe from a vicious vampire attack. Zaine can’t stop thinking about the intelligent, handsome but haunted man. Walking away is the right thing to do, but the detective and Zaine are hunting the same killer—the same vampire—a vampire who knows more about the both of them, and the brotherhood, than anyone realizes. A vampire seeking to bring down the Blackrose Brotherhood, for good. Zaine can’t walk away. Eric won’t walk away. Brotherhood rules be damned, the vampire must be stopped, and they’ll go down fighting together to end him. ***Violent Desire is the first book in an all-new MM paranormal romance series. Each book features a new MM couple ending in a HEA/HFN. Content warning: These are adult books. There will be graphic, on-page depictions of sex, torture, and swearing. These vampires do not sparkle. They're relentless in their mission. They do bad shit for good reasons, and some do good shit for bad reasons. They DO NOT CARE. They have been described as psychopaths with fangs. Read at your own risk.",
  "genres": [
    "M M Romance",
    "Vampires",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Urban Fantasy",
    "Dark"
  ],
  "author": "Ariana Nash",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/61290991-violent-desire"
}