{
  "title": "The Sweet Spot",
  "description": "Amy Poeppel brings her signature “big-hearted, charming” (The Washington Post) style to this wise and joyful novel that celebrates love, hate, and all of the glorious absurdity in between.In the heart of Greenwich Village, three women form an accidental sorority when a baby—belonging to exactly none of them—lands on their collective doorstep. Lauren and her family—lucky bastards—have been granted the use of a spectacular brownstone, teeming with history and dizzyingly unattractive 70s wallpaper. Adding to the home’s bohemian, grungy splendor is the bar occupying the basement, a (mostly) beloved dive called The Sweet Spot. Within days of moving in, Lauren discovers that she has already made an enemy in the neighborhood by inadvertently sparking the divorce of a couple she has never actually met. Melinda’s husband of thirty years has dumped her for a young celebrity entrepreneur named Felicity, and, to Melinda’s horror, the lovebirds are soon to become parents. In her incandescent rage, Melinda wreaks havoc wherever she can, including in Felicity’s Soho boutique, where she has a fit of epic proportions, which happens to be caught on film.​ Olivia—the industrious twenty-something behind the counter, who has big dreams and bigger debt—gets caught in the crossfire. In an effort to diffuse Melinda’s temper, Olivia has a tantrum of her own and gets unceremoniously canned, thanks to TikTok. When Melinda’s ex follows his lover across the country, leaving their squalling baby behind, the three women rise to the occasion in order to forgive, to forget, to Ferberize, and to track down the wayward parents. But can their little village find a way toward the happily ever afters they all desire? Welcome to The Sweet Spot.",
  "genres": [
    "Fiction",
    "Romance",
    "Audiobook",
    "Contemporary",
    "Chick Lit",
    "Humor",
    "Book Club"
  ],
  "author": "Amy Poeppel",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/61294697-the-sweet-spot"
}