{
  "title": "Central Reservation",
  "description": "A compelling and highly original novel, Central Reservation tells the story of Holly Jones and the ghost of her dead twin sister. Set in 2001 as the pyres of foot-and-mouth disease blaze around the countryside. This is how Holly had woken up every day since the crash. First she would become aware of a weight pressing against her chest; then she'd open her eyes, stiff and unmoving in a breathless clutch of wrinkled sheets, her hands by her sides, as if in a vice, staring into the face of her dead sister from inches away. She hadn't screamed, not even the first time. It's 2001 and Holly believes her life will never change. She and her twin sister Yvonne, growing up on their mother's isolated farm, will be stuck with each other forever, no matter how desperately Holly longs for freedom. Until, one February morning, Yvonne dies. For a few brief hours Holly is alone at last. Then her sister's silent ghost appears, and haunts Holly with ruthless determination. Her cousins arrive, full of promises and secrets. The foot-and-mouth epidemic erupts, and gangs of slaughtermen begin to maraud the countryside. As the pyres blaze, Holly has to find out how far she's prepared to go for a life that is truly her own. A gripping and darkly comic tale of loss, haunting and the search for identity in a world on fire. 'Central Reservation is a beautifully written, moving and truly original book' --Christie Dickason, novelist and poet 'Central Reservation is a dazzling puzzle piece, an exploration of the relationship between grief and guilt, self and other. This disordered world, where a fatal accident happens in a second of irritation, and the dank smell of death clings everywhere, is a curiously funny diagnosis of the state of England. It's also a delicately observed comedy of family manners and a coming-of-age story",
  "genres": [],
  "author": "Will Le Fleming",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/12898166-central-reservation"
}