{
  "title": "When the Spirit Moves You",
  "description": "Arlene Watson and her girlfriends intended to spend most of their summer vacation at the beach among friends, and naturally boys, before returning to high school for their senior year. But on one particularly hot and lazy afternoon in late June, Arlene consents to perform tarot readings for her closest friends. Her minor talent for 'fortune-telling' had seemed to mature dramatically since receiving an unusual hand-painted tarot deck as a gift from her sister. Since then, whenever she gathered socially with friends, someone would beg for a reading.Repeated attempts at finding answers in the cards on this occasion only produced more questions. In frustration, Arlene gives up. Hoping that contact with a real spirit from the 'great beyond' might help clarify ambiguous responses from the cards, she convinces the others to join her in an experimental séance at a deserted mansion where a ghost is reputed to roam the grounds each evening.Waiting until security patrols end for the day, the four young women sneak onto the estate and manage to enter the house. Their efforts at contact appear to fail, but as they prepare to leave, the spirit arrives and shows them how foolhardy they were to tamper with metaphysical forces beyond their ken.The spirit pursues them through the house, finally cornering them in a front vestibule. As it approaches, they collapse into unconsciousness.When they awaken, nothing is familiar; not even their reflections in a mirror. Everything is as real as anything they've ever known, yet they appear to have traveled more than a hundred years back through time. The body of an unmarried, desirable, and very eligible young woman has replaced the body each has known all her life.Trapped in this nightmare from which they can't escape, they are at first desperate to reestablish a link with the reality they know. But as romances with young men of the period blossom, they slowly realize that it might not be so terrible if they can't find a way home.Can four twenty-first century girls, used to speaking their minds freely and behaving independently, assimilate into a Victorian period where women don’t even possess the right to vote?Perhaps it really is true that love conquers all.",
  "genres": [],
  "author": "Thomas DePrima",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/6130053-when-the-spirit-moves-you"
}