{
  "title": "Remembering Wholeness: The Energetics of Healing for the Twenty-first Century",
  "description": "To a large extent, Remembering Wholeness is an introduction to Jozef and to his ideas, to the timeless, eternal truths that underscore his life’s work. He speaks to us of the need to become fully discerning, fully accountable for ourselves in every aspect of our lives and to awaken to a fuller understanding of Creative Source, one that takes into account both the masculine and feminine forces at play in the universe. His vision and his insights serve as the underpinning of the book, and the ideas presented here provide the foundation for many future works of his yet to come. In particular, Remembering Wholeness examines the energy of the Divine Feminine as it is reflected in the healing arts. This is part of a larger definition of healing, one that includes the spiritual aspect of our being. It is a way of considering health that has been lost to us for some time and which we are only now beginning to remember. In a sense, the story is told through many eyes, through the eyes of those who have learned to see with more than the usual degree of spiritual sight. Insights into the process of remembering wholeness come not only from the authors but from many others as well. The modalities explored in these pages engage the individual in the healing process spiritually, emotionally and mentally as well as physically. They do not separate soul from body or heart from mind. In coming to understand the impetus behind these methods and their grounding in the feminine energy, we can also see the energetics of healing for the 21st century as it begins to take shape and form. An added feature of Remembering Wholeness is an interview with Jozef on the subject of natural healing modalities and the direction of the energetics of healing for the 21st century.",
  "genres": [],
  "author": "Jozef Dominguez",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/613239.Remembering_Wholeness"
}