{
  "title": "Pathogenesis: A History of the World in Eight Plagues",
  "description": "An account of how the major transformations in history—from the rise of Homo sapiens to the birth of capitalism—have been shaped not by humans but by germs According to the accepted narrative of progress, humans have thrived thanks to their brains and brawn, collectively bending the arc of history. But in this revelatory book, Professor Jonathan Kennedy argues that the myth of human exceptionalism overstates the role that we play in social and political change. Instead, it is the humble microbe that wins wars and topples empires. Drawing on the latest research in fields ranging from genetics and anthropology to archaeology and economics, Pathogenesis takes us through sixty thousand years of history, exploring eight major outbreaks of infectious disease that have made the modern world. Bacteria and viruses were protagonists in the demise of the Neanderthals, the growth of Islam, the transition from feudalism to capitalism, the devastation wrought by European colonialism, and the evolution of the United States from an imperial backwater to a global superpower. Even Christianity rose to prominence in the wake of a series of deadly pandemics that swept through the Roman Empire in the second and third centuries: Caring for the sick turned what was a tiny sect into one of the world’s major religions. By placing disease at the center of his wide-ranging history of humankind, Kennedy challenges some of the most fundamental assumptions about our collective past—and urges us to view this moment as another disease-driven inflection point that will change the course of history. Provocative and brimming with insight, Pathogenesis transforms our understanding of the human story.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Audiobook",
    "Medicine",
    "Health",
    "Biology"
  ],
  "author": "Jonathan Kennedy",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/61327450-pathogenesis"
}