{
  "title": "A Letter to Liberals: Censorship and COVID: An Attack on Science and American Ideals",
  "description": "A leading Democrat challenges his party to return to liberal values and evidence-based science Democrats were the party of intellectual curiosity, critical thinking, and faith in scientific and liberal empiricism. They once took pride in understanding how to read science critically, exercising healthy skepticism toward notoriously corrupt entities like the drug companies that brought us the opioid crisis, and were outraged by the phenomenon of “agency capture” and the pervasive control of private interests over Congress, the media, and the scientific journals. During the COVID pandemic, these attitudes have taken a back seat to blind faith in government mandates and countermeasures driven by pharmaceutical companies and captive federal agencies, promoted by corporate media, and cynically exploiting the fears of the American people. A Letter to Liberals is Robert F. Kennedy Jr.’s, challenge to “lockdown liberalism’s” embrace of policies that are an affront to once cherished precepts. Kennedy invites readers to look at the data in order to answer questions such Did COVID vaccines really save millions and end the pandemic?Why were the lowest COVID death rates in countries and states that relied on therapeutic drugs, and in countries with the lowest vaccination rates?Did vaccines prevent infection or transmission as officials promised?Why do COVID vaccines appear to show “negative efficacy”—making the vaccinated more susceptible to COVID.Why does the most reliable data suggest that COVID vaccines do not lower the risk of death and hospitalization.Should government technocrats be partnering with media and social media titans to censor and suppress the questioning of government policies?And why have so many liberals abandoned fundamental Constitutional principles in their headlong rush to embrace pandemic policies pushed by captured bureaucrats, feckless politicians, a compromised news media, and Big Pharma?In his November 2021 book The Real Anthony Fauci, which sold over 1,000,000 copies, Kennedy made predictions that have matured from “conspiracy theories” to proven facts. Among Masks Are Ineffective and DangerousSocial Distancing Was Not Science-BasedSchool Closures Were Not Science-BasedLockdowns Were CounterproductiveVaccinating Children Causes More Harm and Death Than It AvertsOfficials Wrongly Used PCR Tests to Justify the CountermeasuresCOVID-19 May Have Come from Wuhan LabNatural Immunity is Superior to Vaccine Immunity Kennedy throws down the gauntlet for the kind of vigorous scientific debate that liberals have long stood for and strives to ensure that unbiased honesty and well-researched thought is brought to bear on one of the most important and still unfolding chapters in human history.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Science",
    "Medical",
    "Health",
    "Philosophy"
  ],
  "author": "Robert F. Kennedy Jr.",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/61306294-a-letter-to-liberals"
}