{
  "title": "Tension",
  "description": "Huxley's best friend is his rock.Huxley Might's position as agent within the elite Lunar Council Enforcement Agency has prepared him for a life of service. Being an Alpha is about control and sacrifice. He doesn't have siblings to pass the duty to. It's up to Huxley to become the next Alpha and ensure the Might family legacy continues. It is a heavy burden to bear, but Huxley can always count on his childhood best friend, Ezra, to be in his corner.Nothing could come between them—except the future.If Ezra Fescue manages to stay out of prison, he'll be doing better than the rest of his witch family. Crescent City doesn't have tracks, but if it did, Ezra's house would be the only one on the wrong side. He's poor, unattractive, and comes from a family of magical felons—not exactly the type to be close friends with the next Alpha. Full of criminals and mediocre witches, the Fescue clan is despised by the entire witch community. No matter who Huxley chooses as his mate, the first thing she'll demand is for Huxley to give Ezra the boot. As a werewolf, pleasing his mate will always trump keeping a best friend.A night of passion changes everything.Their friendship has a time limit, and after a drunken night where things get out of hand, Ezra is certain their end is nearer than ever. But Huxley refuses to let one night ruin a lifetime of friendship. He needs Ezra in his life. He'll fix it, fix them, and bring everything back to normal. Except, now that he's had a taste of Ezra, he can't go back. If he doesn't figure out a way to convince Ezra he doesn't care about Ezra's bad reputation, he'll lose him forever. But, how can Ezra let Huxley give up on his legacy?Can their friendship become more?Meanwhile, there is a thief operating within Crescent City. Each new theft tightens the tensions that already exist between the different werewolf packs and if Huxley's team doesn't find the criminal in time, their powder keg of a city is going to blow.Tension is the second book in the Lunar Wolves series and can be read as a standalone. It is a paranormal gay romance with mystery, suspense, a possessive, protective werewolf, and a witch who knows he'll just end up regretting agreeing to that whole friends-with benefits thing.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Shapeshifters",
    "Audiobook",
    "Paranormal",
    "Friends To Lovers",
    "Magic"
  ],
  "author": "Kiki Burrelli",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/61307267-tension"
}