{
  "title": "How Big Things Get Done: The Surprising Factors That Determine the Fate of Every Project, from Home Renovations to Space Exploration and Everything In Between",
  "description": "The secrets to successfully planning and delivering projects on any scale—from home renovation to space exploration—by the world’s leading expert on megaprojects “This book is important, timely, instructive, and entertaining. What more could you ask for?”—Daniel Kahneman, Nobel Prize–winning author of Thinking, Fast and Slow “Over-budget and over-schedule is an inevitability. Incompetence and grift is outrageous. Bent Flyvbjerg, with this terrific data-driven book, has shown that there is another way.”—Frank GehryNothing is more inspiring than a big vision that becomes a triumphant, new reality. Think of how the Empire State Building went from a sketch to the jewel of New York’s skyline in twenty-one months, or how Apple’s iPod went from a project with a single employee to a product launch in eleven months.These are wonderful stories. But most of the time big visions turn into nightmares. Remember Boston’s “Big Dig”? Almost every sizeable city in the world has such a fiasco in its backyard. In fact, no less than 92% of megaprojects come in over budget or over schedule, or both. The cost of California’s high-speed rail project soared from $33 billion to $100 billon—and won’t even go where promised. More modest endeavors, whether launching a small business, organizing a conference, or just finishing a work project on time, also commonly fail. Why?Understanding what distinguishes the triumphs from the failures has been the life’s work of Oxford professor Bent Flyvbjerg, dubbed “the world’s leading megaproject expert.” In How Big Things Get Done, he identifies the errors in judgment and decision-making that lead projects, both big and small, to fail, and the research-based principles that will make you succeed with yours. For example:• Understand your odds. If you don’t know them, you won’t win.• Plan slow, act fast. Getting to the action quick feels right. But it’s wrong. • Think right to left. Start with your goal, then identify the steps to get there.• Find your Lego. Big is best built from small.• Be a team maker. You won’t succeed without an “us.”• Master the unknown unknowns. Most think they can’t, so they fail. Flyvbjerg shows how you can.• Know that your biggest risk is you.Full of vivid examples ranging from the building of the Sydney Opera House, to the making of the latest Pixar blockbusters, to a home renovation in Brooklyn gone awry, How Big Things Get Done reveals how to get any ambitious project done—on time and on budget.",
  "genres": [
    "Business",
    "Nonfiction",
    "Management",
    "Leadership",
    "Productivity",
    "Economics",
    "Psychology"
  ],
  "author": "Bent Flyvbjerg",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/61327449-how-big-things-get-done"
}