{
  "title": "Princess, Countess, Socialite, Spy: True Stories of High-Society Ladies Turned WWII Spies",
  "description": "The Second World War changed the course of modern history. It is filled with incredible stories of daring risks and exceptional struggles, but in the popular imagination, these stories are more often than not the stories of men.There is, however, a hidden treasure trove of untold stories of heroic women who have risked their lives in the monumental battle against fascism.We’ve heard of women who became nurses treating soldiers with battlefield injuries, partisans who fought occupying armies, and skilled laborers who worked in wartime industries.But in the shadows, as part of a secret war against the Nazis, women served as intelligence agents who risked their lives to collect and relay information vital to the war effort. Danger lurked at every turn—a danger that some were not able to evade forever. These courageous women spies worked in secret, but their stories, which are finally coming to light today, offer a significant and unique perspective on the history of World War II. Inside Princess, Countess, Socialite, True Stories of High-Society Ladies Turned WWII Spies you’ll learnthe thrilling stories of Virginia Hall, Christine Granville, Noor Inayat Khan, Nancy Wake and Aline Griffith, who went behind enemy lines to aid the war effort, and what motivated them to take such risks, what it takes to run a successful espionage operation as a woman during a time when women had little respect in the professional realm, the risks of operating undercover and secretly collecting information from the enemy, andhow these women heroes of WWII helped shape the course and outcome of the most significant war in modern history.You’ll gain insights into why some high-society ladies chose to give up a life of comfort to fight against global tyranny and live under constant threat of exposure and imprisonment or death.If you’re looking for a unique and enlightening view of the Second World War and are interested in women’s historically overshadowed roles in international espionage, then look no further than Princess, Countess, Socialite, Spy.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Historical"
  ],
  "author": "Elise  Baker",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/61310108-princess-countess-socialite-spy"
}