{
  "title": "Ice Cold Saint",
  "description": "“I’m here to take you down.” – Saint“You said that wrong. What you meant was that you’re here to fall in love with me.” - AliceSaint is in the family business…the business of hunting killers and closing unsolved cases. He knows his reputation—most people think he is a monster. Dangerous, cold, deadly…and with no conscience. But it takes a guy like him to get the job done. And his latest job? Well, that job has him tracking down a suspected Black Widow…the beautiful and ever-so-seductive Alice Shephard. A woman who is linked to the disappearance of three men.Beauty can be the coldest lie of all.Whispers and scandal follow her every step, but Alice doesn’t seem to care. Is she responsible for the disappearances—and possible deaths—of three ex-lovers? Saint will find out. He’s stepping into her web, and if she’s guilty, he’ll personally lock her away, just as he has done on case after case before. Emotions never get in his way.Wanting her isn’t a surprise. Needing her is.Alice seems immune to his charm. Fair enough, mostly because Saint isn’t known for charm. But he is hell on wheels when it comes to seduction, and the attraction between him and Alice is electric. When he touches her, need rocks through him, a desire so fierce that it threatens to consume them both. But Saint can want her and still lock her away. No problem. Or…Problem. What if she’s not guilty?When Alice saves his life, Saint realizes there is more to her than meets the eye. Maybe she’s using him, maybe everything is a game to her, or maybe…maybe Alice is the real victim in the story and not the villain. Unlikely, but…what if? What if all along someone else was attacking from the dark? What if someone else is determined to claim Alice, to eliminate all other men from her life?And what if Saint might just wind up losing the one person he needs above all others?They call him Saint, but everyone knows he’s a monster…and he’s ready to let his dark side out to hunt.Author’s Note: As part of the Ice Breakers, Saint is intent on solving cold cases. But his latest case heats up—or rather, goes molten—the instant he meets Alice. She’s supposed to be a villain. Fair enough, he’s not exactly hero material. Can two villains fall in love? Time to find out. These two don’t play nicely, they love hard and dirty, and they will take on the world for each other.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Suspense",
    "Enemies To Lovers",
    "Mystery",
    "Contemporary Romance"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/61315781-ice-cold-saint"
}