{
  "title": "Dirty Laundry",
  "description": "A twisty, domestic suspense debut about a clique of mothers that shatters when one of their own is murdered, bringing chaos to their curated lives.She was the perfect wife, with the perfect life. You would kill to have it... Ciara Dunphy has it all--a loving husband, well-behaved children, and a beautiful home. Her circle of friends in their small Irish village go to her for tips about mothering, style, and influencer success--a picture-perfect life is easy money on Instagram. But behind the filters, reality is less polished.Enter Mishti Guha: Ciara's best friend. Ciara welcomed Mishti into her inner circle for being... unlike the other mothers in the group. But, discontent in a marriage arranged for her through her parents back in Calcutta, Mishti now raises her young daughter in a country that is too cold, among the children of her new friends who look nothing like her. She just wants what Ciara has--the ease with which she moves through the world--and in that sense, Mishti might be exactly like the other mothers.And there's earth mother Lauren Doyle, born, bred, and the butt of jokes in their village. With her disheveled partner and children who run naked in the yard, they're mostly a happy lot, though unsurprisingly ostracized for being the singular dysfunction in Ciara's immaculate world. When Lauren finds an unlikely ally in Mishti, she decides that her days of ridicule are over.Then Ciara is found murdered in her own pristine home, and the house of cards she'd worked so hard to build comes crumbling down. Everyone seems to have something to gain from Ciara's death, so if they don't want the blame, it may be the perfect time to air their enemies' dirty laundry.In this dazzling debut novel, Disha Bose revolutionizes age-old ideas of love and deceit. What ensues is the delicious unspooling of a group of women desperate to preserve themselves.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Audiobook",
    "Mystery Thriller",
    "Suspense",
    "Ireland"
  ],
  "author": "Disha Bose",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/61327484-dirty-laundry"
}