{
  "title": "The Immortal Detective",
  "description": "2024 IPPY Award Winner (Mystery)Sometimes being immortal makes you wish you were dead. Although twins Celeste and Nick Crenshaw are introduced in The Immortal Twin, most readers consider The Immortal Detective a standalone. After losing both parents to a vampire attack, the twins lead a pampered lifestyle under the watchful eye of adoptive parents, Razvan and Bianca Torok. On the surface, the Toroks are founders of a Fortune-500 laboratory. Secretly, they are commanders of the Realm, a vampiric coalition, its primary mission the protection of mortals from mutinous vampires.When catastrophe strikes, and Nick's rebellious ways place Celeste in peril, the Toroks instruct their supreme warrior to return her to Kansas City, unaware of a vindictive vampiress's intent to destroy their daughter at first opportunity. The Immortal Detective opens immediately following the attack. While Celeste grapples with the painful transition from mortal to vampire, ancient vampires swoop in and whisk her away to an interdimensional utopia where they impart supernatural capabilities.Acquiring a novice's aptitude at best, Celeste doubts her ability to utilize her new powers and deny her vampiric urges once the ancients return her to the Kansas City Detective Squad. Solving a sex-trafficking case with the assistance of her uncanny powers, Celeste manages to stay one explanation ahead of her suspicious police captain. But when assigned a rash of complex homicides, while juggling a zealous lover, a demanding five-year-old vampire, and a gay nanny determined to make headlines, Celeste realizes it's going to take everything in her arsenal to solve cases growing cold.Perfect for those who enjoy complex detective mysteries, as well as novels by Nalini Singh, J. R. Ward, and Anne Rice.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Fiction",
    "Audiobook",
    "Mystery",
    "Romance",
    "Supernatural"
  ],
  "author": "D.B. Woodling",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/61311953-the-immortal-detective"
}