{
  "title": "The Complete Peanuts, 1983-1984",
  "description": "As Peanuts reaches the mid-1980s, Charles Schulz is still creating and playing with new characters, and in this volume Snoopy's deadpan, droopy-mustached brother Spike takes center stage: Surrounded by coyotes in the desert where he lives and who are attacking him with rubber bands, he sends a frantic message to Snoopy who launches an expedition to save him. Then, he makes the long trek back to Snoopy's neck of the woods accompanied by his only friend (a cactus, of course) and throughout the rest of the book, pops up in hilarious, Waiting for Godot-style vignettes set in his native Needles.In romantic news, the Peppermint Patty-Marcie-Charlie Brown love triangle of overlapping unrequited love heats up (well, kind of), while Linus continues to vociferously deny that he is Sally's Sweet Babboo; of course, Lucy's unsuccessful pursuit of Schroeder remains unabated. Also, a romance blossoms between two of Snoopy's Beagle Scout birds. (We will pass over Spike's brief attraction to one of the coyotes.)In what is probably his most baroque and hilarious baseball-involved humiliation yet, Charlie Brown agrees to join Peppermint Patty's team, the Pelicans, only to discover that he's wanted not as a player but as a mascot. Linus gives up his security blanket and forms a support group for other kids who are trying to do the same, and Peppermint Patty manages to be held back in school (leaving a snoring ghost to take her place in the rest of the class that has advanced), and yet gets to go on a European trip with her dad, sending back periodic dispatches from the road. All this, plus appearances from Franklin, Rerun, and the rest of the gang in these strips from a period of Peanuts that's far less well-known than the endlessly-collected 1960s and 1970s eras.",
  "genres": [
    "Comics",
    "Humor",
    "Comic Strips",
    "Graphic Novels",
    "Graphic Novels Comics",
    "Sequential Art",
    "Comic Book"
  ],
  "author": "Charles M. Schulz",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/12898900-the-complete-peanuts-1983-1984"
}