{
  "title": "Stridens skönhet och sorg: Första världskriget i 212 korta kapitel",
  "description": "Första världskriget anses av många experter vara den mest omgripande historiska händelse som drabbat vår kontinent sedan romarrikets fall. Trots detta, och trots att detta krig kom att prägla hela 1900-talet, är det idag en händelse som hamnat i minnesskugga. I november är det 90 år sedan första världskriget slutade, och till minnesdagen kommer det ut ett nytt historiskt verk om detta krig av Peter Englund.Det är ingen vanlig historiebok, där skeendet skildras uppifrån och där allt samlas i en övergripande berättelse. I denna bok återförs historien istället till sin minsta, atomära beståndsdel: den enskilda människan och hennes erfarenheter. I Stridens skönhet och sorg får läsaren följa ett tjugotal verkliga men nu okända människor, bland annat en australiensisk kvinna som körde lastbil åt serbiska armén, en italiensk soldat som hamnade på mentalsjukhus, en fransk ämbetsman som aldrig såg fronten, en tysk skolflicka som växte upp med kriget vid gränsen mot öster, en sydamerikansk äventyrare som slogs som frivillig i turkiska armén, en belgisk stridspilot, en tysk infanterist, en rysk sjuksköterska, en amerikansk fältkirurg och en ungersk kavallerist.Dessa människor upplevde kriget på olika platser och på olika vis, men de förenas av att de alla befann sig långt ned i hierarkierna och att de alla fick sina liv ändrade. Boken bygger på material som de har lämnat efter sig: brev, dagböcker, memoarer. Vart och att av de korta kapitlen utgår ifrån vad en av dessa enskilda människor såg, tänkte eller gjorde en enskild dag, med början i augusti 1914 och slut i november 1918.Detta är inte en bok om första världskrigets strategiska spel utan om kriget som upplevelse och vardag, som berusning och mardröm, som löfte och lögn och som en allt nedbrytande, förändrande kraft. Det är historia, men historia på ett nytt sätt, historia av ett slag du aldrig läst förut.",
  "genres": [
    "History",
    "Nonfiction",
    "World War I",
    "War",
    "Military Fiction",
    "Military History",
    "Biography"
  ],
  "author": "Peter Englund",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/6130890-stridens-sk-nhet-och-sorg"
}