{
  "title": "Capturing Her Highland Keeper",
  "description": "Lyla knows she needs something—she just doesn’t know what.Lyla Smythe is restless with that same uncomfortable edginess that always hits before a major life shakeup. She just needs to stay busy and ignore the feeling. Maybe it’s because her annoying sister moved in. Opposites in every way, at least they share a love of the stars.Armed with homemade wine, they watch a meteor shower. But the wine must be tainted. One minute, they’re retching in the night, the next, it’s morning. And Edinburgh has somehow become a tiny hamlet. Before Lyla can sort it out, riders approach. The leader, a fiercely handsome man, sets her sixth sense buzzing.Grant knows what he needs—but he’s afraid to repeat the past.After his uncle’s execution, Chieftain Grant Reddoch trusts very few. When he comes upon two strangely dressed women acting addled, he’s certain they are spies. Best take them prisoner. Keep allies close. Keep those you don’t trust closer. The one called Lyla unnerves him. She clouds his judgement with the endearing friendliness of an irresistible puppy.With growing political unrest, the last thing he needs are distractions. But the more he’s around Lyla, the more he needs her. And so, they wed. Then she tells him of her past and forces him to realize his error. He needs a wife and mother to his bairns. Not a woman suffering from lunacy. He locks her away for her own safety. Like he should have done with his first wife before she hanged herself.Lyla knows she can make Grant happy and be a good mother to his children—if only he will let her. One way or another, she will capture her Highland keeper and love him until he has no choice but to accept time travel and love her as fiercely as she loves him.Looking for a sigh-worthy page turner to make you laugh, cry, and stay up entirely too late to find out what happens? Then this Scottish historical time travel romance by USA TODAY bestselling author Maeve Greyson is the one for you. An Alpha male Highlander, a feisty modern-day woman, and a love that ignores the boundaries of time. Escape to the Highlands. Leave reality behind!Read Free in Kindle Unlimited!Time to Love a HighlanderBook 1 - Loving Her Highland ThiefBook 2 - Taming Her Highland LegendBook 3 - Winning Her Highland WarriorBook 4 - Capturing Her Highland KeeperBook 5 - Saving Her Highland TraitorBook 6 - Loving Her Lonely HighlanderBook 7 - Delighting Her Highland Devil",
  "genres": [
    "Time Travel",
    "Historical Romance",
    "Historical"
  ],
  "author": "Maeve Greyson",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/61311140-capturing-her-highland-keeper"
}