{
  "title": "Still Life with Bones: Genocide, Forensics, and What Remains",
  "description": "An anthropologist working with forensic teams and victims' families to investigate crimes against humanity in Latin America explores what science can tell us about the lives of the dead in this haunting account of grief, the power of ritual, and a quest for justice.\"Exhumation can divide brothers and restore fathers, open old wounds and open the possibility of regeneration--of building something new with the 'pile of broken mirrors' that is memory, loss, and mourning.\"Throughout Guatemala's thirty-six-year armed conflict, state forces killed more than two hundred thousand people. Argentina's military dictatorship disappeared up to thirty thousand people. In the wake of genocidal violence, families of the missing searched for the truth. Young scientists joined their fight against impunity. Gathering evidence in the face of intimidation and death threats, they pioneered the field of forensic exhumation for human rights.In Still Life with Bones,  anthropologist Alexa Hagerty learns to see the dead body with a forensic eye. She examines bones for marks of torture and fatal wounds--hands bound by rope, machete cuts--and also for signs of identity: how life shapes us down to the bone. A weaver is recognized from the tiny bones of the toes, molded by kneeling before a loom; a girl is identified alongside her pet dog. In the tenderness of understanding these bones, forensics not only offers proof of mass atrocity but also tells the story of each life lost.Working with forensic teams at mass grave sites and in labs, Hagerty discovers how bones bear witness to crimes against humanity and how exhumation can bring families meaning after unimaginable loss. She also comes to see how cutting-edge science can act as ritual--a way of caring for the dead with symbolic force that can repair societies torn apart by violence.Weaving together powerful stories about investigative breakthroughs, histories of violence and resistance, and her own forensic coming-of-age, Hagerty crafts a moving portrait of the living and the dead.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "True Crime",
    "Anthropology",
    "Memoir",
    "Audiobook"
  ],
  "author": "Alexa  Hagerty",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/61327473-still-life-with-bones"
}