{
  "title": "Summer Lights",
  "description": "Can love transcend time, space, and worlds?Spring Song may be over, but Midsummer celebrations at the House of Silveria come with unexpected challenges. A pair of sand kittens arrive with their handler, Fang, a desert nomad whose people are hounded and oppressed. Set on a secret mission, Fang must accomplish it by any means. At least, that was her plan until she meets Mara, the Stable Master whose scent has long haunted her dreams. Can Desert Warrior Fang accomplish her mission and still win the heart of the woman she desires?The annual lake outing on Night of Lights is imminent and everyone is excited, until the Reclining Dragon arrives with his liegeman. With these two unwelcome visitors prowling all over the House and the children running wild, Heinregard and Clayten must somehow keep them apart. Will the truth about the wildlings’ parentage be revealed or will they be able to keep the Reclining Dragon in the dark?----------------------------------------Summer Lights is Book 2 in the Seasons Cycle, a Romantic (High) Fantasy novel that follows two couples (one F/F and one M/M).If you enjoy sweet, slow-burn romance with your fantasy, or some fantasy with your romance; if you like lyrical story-telling that's beautiful and bittersweet, with memorable characters that are well-drawn and relatable; if you love horses, then you will love Summer Lights.The main characters have inspired poems and songs, including the poetry collection Songs of Love & Longing.. QR codes are embedded within the text to link to the songs on the author's youtube channel.The main characters in Summer Lights happen to be gay and lesbian. Summer Lights is the second book in the Seasons Cycle, an LGBTQ+ friendly series, but can be read as a standalone.Tropes: True Love, Forbidden Love, Fated Mates, Past Lives.High Fantasy; Medieval Fantasy; Romantic Fantasy; Fantasy Romance; LGBTQ+ Fantasy; Mythological Fantasy; Bittersweet Slow-Burn Romance",
  "genres": [
    "Fantasy"
  ],
  "author": "Cassia Hall",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/61343745-summer-lights"
}