{
  "title": "In Search of Dignity",
  "description": "I had been trying to fit into life after war - often making a pretty good mess of things - and was rejected at every attempt. What did Clara expect from me? Could we find a way to rekindle the love we once felt? I wondered. The questions swirled in my head until sun up, but the answers still evaded me. Of all the things I didn't know, however, one truth rang deep: I can't go on living like this.***This is the last night I'll sleep alone, I thought. Tomorrow, I'll be married... to a girl a third my age. It was certainly unusual, but unusual doesn't have to be wrong. Unusual can be beautiful. This is love; an amazing, deep, miraculous love maybe only we ourselves would ever fully understand the power of.***As if someone took blinders off an old horse, my eyes were fully opened to God's Truth. It had been simple enough for a child to understand all along... God moved everything around in my whole life to bring me to this very time and place.***Risking life and limb in the first World War, veteran Daniel Johnston returns home to realize he has lost everything precious. With his wife in love with another man and him feeling like a ghost among his children, he is leaving them and setting on a personal quest to fill the void of longing and despair. The only adventure he never considered, however, was falling in love with a woman a third his age as he passed through Harlan County, Kentucky on his way to the Gulf. Little did he know, the angel of the post office, one Anna Beth Atwood with a mysterious story of her own, would not only renew the joy of his natural life but also lead him to the one whose spiritual peace mends every broken soul.Based on true family history and written by the award-winning author of When Dignity Came to Harlan and Teaching Dignity, In Search of Dignity is a heartfelt story of heartbreak and hope, forgiveness and love, second chances and merciful redemption.Join Daniel and Anna Beth and see for yourself how age is no match for love - or God.",
  "genres": [],
  "author": "Rebecca Duvall Scott",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/61333089-in-search-of-dignity"
}