{
  "title": "The Fall of Númenor: and Other Tales from the Second Age of Middle-earth",
  "description": "J.R.R. Tolkien’s writings on the Second Age of Middle-earth, collected for the first time in one volume.J.R.R. Tolkien famously described the Second Age of Middle-earth as a ‘dark age, and not very much of its history is (or need be) told’. And for many years readers would need to be content with the tantalizing glimpses of it found within the pages of The Lord of the Rings and its appendices, including the forging of the Rings of Power, the building of the Barad-dûr and the rise of Sauron.It was not until Christopher Tolkien published The Silmarillion after his father’s death that a fuller story could be told. Although much of the book’s content concerned the First Age of Middle-earth, there were at its close two key works that revealed the tumultuous events concerning the rise and fall of the island of Númenor. Raised out of the Great Sea and gifted to the Men of Middle-earth as a reward for aiding the angelic Valar and the Elves in the defeat and capture of the Dark Lord Morgoth, the kingdom became a seat of influence and wealth; but as the Númenóreans’ power increased, the seed of their downfall would inevitably be sown, culminating in the Last Alliance of Elves and Men.Even greater insight into the Second Age would be revealed in subsequent publications, first in Unfinished Tales of Númenor and Middle-earth, then expanded upon in Christopher Tolkien’s magisterial twelve-volume The History of Middle-earth, in which he presented and discussed a wealth of further tales written by his father, many in draft form.Now, adhering to the timeline of ‘The Tale of Years’ in the appendices to The Lord of the Rings, editor Brian Sibley has assembled into one comprehensive volume a new chronicle of the Second Age of Middle-earth, told substantially in the words of J.R.R. Tolkien from the various published texts, with new pencil illustrations by the doyen of Tolkien art, Alan Lee.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Classics",
    "High Fantasy",
    "Audiobook",
    "Adult",
    "Epic Fantasy"
  ],
  "author": "J.R.R. Tolkien",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/61331094-the-fall-of-n-menor"
}