{
  "title": "The White Lady",
  "description": "The White Lady introduces yet another extraordinary heroine/sleuth from Jacqueline Winspear, creator of the best-selling Maisie Dobbs series. This heart-stopping adventure follows the coming of age and maturity of former wartime operative Elinor White—veteran of two wars, trained killer, protective of her anonymity—when she is drawn back into the world of violence she has been desperate to leave behind.A reluctant ex-spy with demons of her own, Elinor finds herself facing down one of the most dangerous organized crime gangs in London, and exposing corruption from Scotland Yard to the highest levels of government.Post-World War II Britain, 1947. Forty-one-year-old “Miss White,\" as Elinor is known, lives in a village in Kent, England, so quietly and privately as to seem an enigma to her fellow villagers. Well she might, as Elinor occupies a \"grace and favor\" property, a rare privilege offered to faithful servants of the Crown for services to the nation. But the residents of Shacklehurst have no way of knowing how dangerous Elinor's war work had been, or how deeply their mysterious neighbor continues to be haunted by her past.It will take the child of Jim Mackie, a young farmworker and his wife, Rose, to break through Miss White's icy demeanor—but Jim has something in common with Elinor. He, too, is desperate to escape his past. When the powerful Mackie crime family demands a return of their prodigal son for an important job, Elinor assumes the task of protecting her neighbors, especially the bright-eyed Susie, who reminds her of the darkest day of her life.Elinor’s wartime training and instincts serve her well, but as she endeavors to neutralize the threat to Jim, Rose and Susie Mackie, she is rapidly led along a tunnel of smoke and mirrors in which former wartime colleagues – who know the truth about what happened in 1944, and the terrible event that led to her wartime suicide attempt – are compromised by more powerful influences.Ultimately, Elinor will hold a gun to the head of a Mackie crime lord to uncover the truth behind the family's pursuit of Jim, and in doing so, reveal the far-reaching tentacles of their power—along with the truth that will free Elinor from her past.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Audiobook",
    "Historical",
    "World War II",
    "Thriller"
  ],
  "author": "Jacqueline Winspear",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/61346151-the-white-lady"
}