{
  "title": "Managing Chronic Illness Using the Four-Phase Treatment Approach: A Mental Health Professional's Guide to Helping Chronically Ill People",
  "description": "A pioneering book to help maximize the quality of life for chronically ill patientsWritten by a leading authority on chronic illness treatment and management, Managing Chronic Illness Using the Four-Phase Treatment Approach provides evidence-based practice guidelines for clinicians to help their clients with debilitating health problems embrace a new \"normal,\" understand the cyclical nature of their illness, and function at the highest level possible.Patricia Fennell's groundbreaking model for understanding chronic illness identifies and describes four broad phases experienced by the chronically crisis, stabilization, resolution, and integration. Using a broad array of case histories, Fennell vividly illustrates what clients need at each phase and how to assess and respond to them compassionately. Fennell also suggests how clinicians may best use their own changing experiences in their work to help clients transition through the four phases.The goal of the \"Four-Phase Model\" is to maximize a client's quality of life without offering false hope for a cure, making it an effective treatment strategy for diverse client populations, including people with physiological diseases; patients whose lives are being prolonged by modern medicine; and people who suffer from addiction, post-traumatic stress syndrome, intractable pain, and post-rape and abuse conditions.Complete with detailed treatment protocols for documenting a client's symptoms and quality of life at each phase, Managing Chronic Illness Using the Four-Phase Treatment Approach is a highly practical book for everyone working with chronically ill clients.",
  "genres": [
    "Nonfiction",
    "Psychology"
  ],
  "author": "Patricia A. Fennell",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/6133276-managing-chronic-illness-using-the-four-phase-treatment-approach"
}