{
  "title": "Creamed",
  "description": "MandyWorking for minimum wage with no real benefits is all I’ve known.But my newest job at the hospital coffee shop feels safe.It’s friendly enough, and Mrs. Peters always makes sure I have a stack of leftovers to take home after every shift.Then there’s Dr. de Silva, my favorite customer.My favorite everything. I mean… The man. Is. Built. And he has the kindest eyes.Strangely enough, he’s a heart doctor. Probably a good thing for all the palpitations he must give his female patients.It’s a silly fantasy of mine, pretending he’s thrilled to see me each day. Not as happy as I am to see him, though.But what chance would a short, thick-set younger girl like me have with an older, mature, and professional guy like him?He must be a man who knows what he really wants.Physical stuff aside. What could I have that a man as successful as him would even want?As it turns out, he’s developed a hankering for my now semi-famous creamed coffee.Lotsa cream, lotsa sugar.He only wanted water, but when I innocently asked if he wanted to try my cream and sugar, it was like a flare went off.In my pants.After trying my new drink, he’d visit twice or more every shift, and old Mrs. Peters started teasing me about it in her friendly way.“Cream o’clock,” she calls it.But it’s our time, Dr. de Silva and me.For those few moments each day, I get to pretend that I’ve caught the eye of an amazing man.The perfect man.But when an accident lands me in the emergency room of the hospital where I work, it’s Dr. Foxx de Silva to the rescue.And I find out fast that he’s done with cream and sugar in a cup.The man has it on tap, and there’s only one place he wants it.Inside me!Am I dreaming? Did I maybe just bump my head a little too hard when I had my accident?Or do fairy tales exist in real life?Can a knight in shining armor really come out of nowhere and sweep a girl off her feet?This girl is dying to find out. And from now on, there’s only one man who’ll get my cream and sugar.All for him.If only he’d just say that’s what he really wants.FoxxI’m Dr. Foxx De Silva.And being a doctor, I deal with tears and joy on a daily basis.All of it other people’s. No joy or tears from me, though.Just a doctor who is doing his job.There was never much to break the pattern either.Go to work, stack more cash. Go home to a luxury penthouse apartment.Rinse and repeat.That was until Mandy came into my life, the new coffee shop girl.She tells me she makes a mean creamed coffee when all I came for was bottled water.I instantly became a coffee buyer, but I can’t drink the stuff. I need a steady hand in surgery.The thought that other people were getting cream from her, though?It made me insane with jealousy, and I vowed to touch more than just her fingers to get my cream from her.My growing obsession has me following her home one night, to watch over her, and make sure she gets home safe.But when I see where she lives, how she’s struggling to make ends meet only to have more of the same misery?I say ‘enough.’Time for the good doctor to prescribe something I never have.And although I struggle with saying the words, those three little words, I have no problem taking her with both hands. I want to show her that real men do exist and that the one thing a real man needs to complete him is sometimes staring him right in the face.",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Flora Ferrari",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/61347483-creamed"
}