{
  "title": "Assassin of Reality",
  "description": "The eagerly anticipated sequel to the highly acclaimed Vita Nostra takes readers to the next stage in Sasha Samokhina’s journey in a richly imagined world of dark academia in which grammar is magic—and not all magic is good.In Vita Nostra, Sasha Samokhina, a third-year student at the Institute of Special Technologies, was in the middle of taking the final exam that would transform her into a part of the Great Speech. After defying her teachers’ expectations, Sasha emerges from the exam as Password, a unique and powerful part of speech. Accomplished and ready to embrace her new role, she soon learns her powers threaten the old world, and despite her hard work, Sasha is set to fail.However, Farit Kozhennikov, Sasha’s dark mentor, finds a way to bring her out of the oblivion and back to the Institute for his own selfish purposes. Subsequently, Sasha must correct her mistakes before she is allowed to graduate and is forced to do what few are asked and even less achieve: to succeed and reverberate—becoming a part of the Great Speech and being one of the special few who dictate reality. If she fails, she faces a fate far worse than death: the choice is hers. Years have passed around the Institute—and the numerous realities that have spread from Sasha’s first failure—but it is only her fourth year of learning what role she will play in shaping the world. Her teachers despise and fear her, her classmates distrust her, and a growing love—for a young pilot with no affiliation to the school—is fraught because a relationship means leverage, and Farit won’t hesitate to use it against her.Planes crash all the time. Which means Sasha needs to rewrite the world so that can’t happen...or fail for good.",
  "genres": [
    "Fantasy",
    "Dark Academia",
    "Fiction",
    "Audiobook",
    "Science Fiction",
    "Russia",
    "Adult"
  ],
  "author": "Marina Dyachenko",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/61331501-assassin-of-reality"
}