{
  "title": "Ship Happens",
  "description": "TateMacy Carmichael has been my friend with mind-blowing benefits for a long time now. But, I’ve been craving more from her. More than she’s ready to give. When my siblings book me on an all-inclusive cruise, I jump at the idea of a free vacation and a chance to get away for a while. Unfortunately, my meddling older sister left out a few important details—like the name of the cruise. Love at Sea. Is she for real?If that’s not bad enough, she signed me up for a variety of activities and makes me promise that I’ll take part in every single one. She also failed to mention that she convinced Macy to book the same cruise.Imagine my surprise when she sits down across the table from me during the speed dating event I didn’t even want to attend. All bets are off. I’ll be damned if some other man is getting close to what’s mine.MacyDesperate for a vacation and break from everyday life, I take the suggestion of a close friend and book myself a week-long cruise. I even go along with her recommendation.The Love at Sea cruise aboard the Heart of the Deep. It doesn’t sound like a bad idea, even if the whole cruise is based around the finding and celebrating love. But when my best friend with toe-curling benefits, Tate Thorne, shows up during the speed dating event, I know I’m in trouble. No matter what I do, it always comes back to him.Maybe away from the hustle and bustle of our small town, we can finally explore something more. That is, if I can finally let go of all the “rules” of our previous arrangement. Ship Happens is a friends with benefits romance, part of the Love at Sea multi-author series. Get ready to set sail through the Caribbean on Festival Cruises’ most alluring voyage with eight of your favorite authors - happily ever after guaranteed!Experience everything the Love at Sea series has to offer. From speed dating to masquerades, guests are sure to enjoy the hot days and steamy nights. Explore hidden waterfalls, swim with dolphins, and watch as eight couples find their forever on the open ocean.",
  "genres": [
    "Friends To Lovers",
    "Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Kate Stacy",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/61329916-ship-happens"
}