{
  "title": "Guardians of the Blood",
  "description": "This is Book II in The Disciples of Goedric TrilogyBook Guardians of the Young Etan, AKA “Patient G,” flees his Chicago apartment in the middle of the night, narrowly escaping IFC henchmen who will stop at nothing to get him back under their control. His only hope lays with a rag-tag group of friends, led by the redoubtable Sues, two tough, old-guard lesbians who never thought they’d live long enough to witness the horrors of a second gay plague. Sue DeGault and Sue Keller pray for strength as they prepare to battle fate, and the IFC, a corporate goliath controlled by a powerful family with roots dating back to the days of King Yoshiyahu of Judea—a family that has been raging a religious war against homosexuals for 2,700 years. If you have not yet read Book Gay Gene Rising, it is available for immediate download.Also available of Amazon by Jeffrey Jude AKA Gay Author With Disciples of Goedric Gay Gene RisingThe Disciples of Goedric Guardians of the BloodThe Disciples of Goedric SoulFire and TearsThe Disciples of Goedric Trilogy Collection in a single Kindle volume Keeper of the Grey, The Chronicles of 0.00What others are saying about The Disciples of Goedric Trilogy...\"Spellbinding and terrifyingly possible! Jeffrey Jude has spun a tale rooted in historical facts that will grip your soul and inspire your imagination\"--GayNovelists.com Reviews\"If I hadn’t had book two and three in my possession I could have been pushed clean off the edge of sanity... The characters in this story are three dimensional, well described and ‘real’ on every level. Each with unique emotions and reactions to the many high adrenaline situations that Jeffrey Jude throws them into. Even the wolves in this story have their own personalities!\"-- Top 2 Bottom Reviews\"I was going to try to write this review without using the word epic, but that's not going to happen. This book embodies the word epic as you would have described blockbuster classic movies. The locations are varied and well researched, the characters are diverse and compelling and the storyline whilst encompassing elements of fantasy/fiction also deals with very contemporary and relevant current affairs. Books can entertain, inform and hopefully enthrall the reader. Jeffrey Jude has accomplished all of this and more.\" -- Dyna Leake, G2Z ReviewsGoodreads Reader Reviews...\"Best gay themed fantasy I've read in years. Was totally enthralled by the narrative...\" \"What an amazing, inspired, and frightening look at the world and the history of homosexuality. By blending past, present, and future so seamlessly, you have given us our own mythology, our own place in the universe. I cannot wait to continue on and see how this loving family of chosen members saves the world. Thank you so much!\"Tweets...\"I was absolutely moved by the Gay Gene Rising Series...\"\"Intruiging...\"\"It sure inspired me to get more involved in gay issues in my city. Genius man!\"",
  "genres": [
    "Fantasy"
  ],
  "author": "Jeffrey Jude",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/12899803-guardians-of-the-blood"
}