{
  "title": "Plum Spooky (A Stephanie Plum Between the Numbers/Holiday Novel, #4)",
  "description": "Plum Spooky, the First Full Length Stephanie Plum Between-the-Numbers Novel from #1 Bestselling Author Janet Evanovich.Turn on all the lights and check under your bed. Things are about to get spooky in Trenton, New Jersey.According to legend, the Jersey Devil prowls the Pine Barrens and soars above the treetops in the dark of night. As eerie as this might seem, there are things in the Barrens that are even more frightening and dangerous. And there are monkeys. Lots of monkeys.Wulf Grimoire is a world wanderer and an opportunist who can kill without remorse and disappear like smoke. He's chosen Martin Munch, boy genius, as his new business partner, and he's chosen the Barrens as his new playground.Munch received his doctorate degree in quantum physics when he was twenty-two. He's now twenty-four, and while his brain is large, his body hasn't made it out of the boys' department at Macy's. Anyone who says good things come in small packages hasn't met Munch. Wulf Grimoire is looking for world domination. Martin Munch would be happy if he could just get a woman naked and tied to a tree.Bounty hunter Stephanie Plum has Munch on her most-wanted list for failure to appear in court. Plum is the all-American girl stuck in an uncomfortable job, succeeding on luck and tenacity. Usually she gets her man. This time she gets a monkey. She also gets a big guy named Diesel. Diesel pops in and out of Plum's life like birthday cake – delicious to look at and taste, not especially healthy as a steady diet, gone by the end of the week if not sooner. He's an über bounty hunter with special skills when it comes to tracking men and pleasing women. He's after Grimoire, and now he's also after Munch. And if truth were told, he wouldn't mind setting Stephanie Plum in his crosshairs.Diesel and Plum hunt down Munch and Grimoire, following them into the Barrens, surviving cranberry bogs, the Jersey Devil, a hair-raising experience, sand in their underwear, and, of course . . . monkeys.",
  "genres": [
    "Mystery",
    "Fiction",
    "Humor",
    "Chick Lit",
    "Romance",
    "Audiobook",
    "Crime"
  ],
  "author": "Janet Evanovich",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/6136141-plum-spooky-a-stephanie-plum-between-the-numbers-holiday-novel-4"
}