{
  "title": "Dissent: A Charity Romance Anthology",
  "description": "For National Read a Book day, DISSENT is available in eBook and paperback!DISSENT is a charity romance anthology with NEW, never before published content from over 150 authors of all romance genres. All proceeds from the eBook and paperbacks will be donated to organizations benefiting reproductive rights in the United States, particularly in areas where people need them more than ever.DISSENT will only be available for a very limited time, so grab your copy today!We are not affiliated nor endorsed by any of these charities. We are simply a community bound by a single cause: protecting the basic human right of body autonomy.AUTHORS INCLUDE: Brighton Walsh, Nicole French, Kennedy Fox, A.M. Roark, A.R. Hall, Aarti V Raman, Aidy Award, Alexis Anne, Amanda Richardson, Amelia Wilde, Amie Knight, Amy Quinton, Anna Michael, Aria Wyatt, Ashley Lane, Autumn Jones Lake, B. Celeste, Blair Babylon, Brenda St John Brown, Brenna Aubrey, Bri Blackwood, Cara Dee, Carmen Jenner, C.L. Matthews, Cassie Graham, Celia Kyle, Charity Ferrell, Claire Wilder, Claudia Burgoa, Dakota Willink, Dani René, Daniela Romero, Dee Garcia, Dee Lagasse, Deidre-Ann Anderson, Donna Grant, Echo Grayce, Elena Aitken, Elle Thorpe, Ellis Leigh, Emily Colin, Emily Goodwin, Erica Alexander, Erin Parisien, Eva Charles, Eva Moore, Evelyn Adams, Glenna Maynard, H.D. Carlton, Haley Jenner, Heidi McLaughlin, Holly Mortimer, Hope Jones, Ines Johnson, Iris Morland, J. Saman, J. Sterling, J.H. Croix, J.L. Beck & C. Hallman, J.M. Walker, Jane Blythe, Janet Berry, Jasmin Miller, JD HOLLYFIELD, Jen Stevens, Jenika Snow, Jenna Hartley, Jenna Lynn, Jennifer Sucevic, Jessica Florence, Jillian Liota, Julia Kent, Kait Nolan, Kat Latham, Kat Savage, Kate Canterbary, Kate King and Jessa Wilder, Kate Meader, Kathy Coopmans, K.B. Cinder, K.D. Proctor, Kelly Maher, Kim Loraine, Kym Grosso, Lainey Davis, Laramie Briscoe, Laura Hall, Laura Lee, Lauren Stewart, Lea Coll, Len Webster, Lili Valente, Linnea May, Lisa Shelby, Lissanne Jones, Lucy Lennox, Mary Ann Marlowe, Max Henry, Megan Ryder, Melissa Andrea, Melissa Marino, Melonie Johnson, Mia Harlan, Mignon Mykel, Molly O’Hare, Monica Corwin, Morgan Jane Mitchell, N.A. Moore, Natasha Raulerson, Nicole Blanchard, Nina Levine, Pamela DuMond, Patricia D. Eddy, Persephone Autumn, R.L. Kenderson, Rachel Brookes, Raven James, Rebecca Paula, Rebecca Yarros, Regina Kyle, R. Castro, Roxie Noir, S. Cinders, Sade Rena, Saffron A. Kent, Samantha Lind, Sarah M. Cradit, Scarlett Cole, S.E. Rose, Shaw Hart, Sydney St. James, S.J. Sylvis, Skye Alder, Stephanie Anne, Suzanne Baltsar, Sylvie Stewart, T.K. Leigh, Tabatha Vargo, Tamara Lush, Taryn Quinn, Tawna Fenske, T. Gephart, Toni Aleo, Tracy Krimmer, Tricia Lynne, Trish Milburn, V.F. Mason, Vanessa Booke, Vivian Wood, Zoe Ashwood, and Zoe York",
  "genres": [
    "Anthologies",
    "Romance",
    "Novella",
    "Short Stories",
    "Dark Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Brighton Walsh",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/61363121-dissent"
}