{
  "title": "Saving Time: Discovering a Life Beyond the Clock",
  "description": "In her first book, How to Do Nothing, Jenny Odell wrote about the importance of disconnecting from the “attention economy” to spend time in quiet contemplation. But what if you don’t have time to spend?In order to answer this seemingly simple question, Odell took a deep dive into the fundamental structure of our society and found that the clock we live by was built for profit, not people. This is why our lives, even in leisure, have come to seem like a series of moments to be bought, sold, and processed ever more efficiently. Odell shows us how our painful relationship to time is inextricably connected not only to persisting social inequities but to the climate crisis, existential dread, and a lethal fatalism.This dazzling, subversive, and deeply hopeful book offers us different ways to experience time—inspired by pre-industrial cultures, ecological cues, and geological timescales—that can bring within reach a more humane, responsive way of living. As planet-bound animals, we live inside shortening and lengthening days alongside gardens growing, birds migrating, and cliffs eroding; the stretchy quality of waiting and desire; the way the present may suddenly feel marbled with childhood memory; the slow but sure procession of a pregnancy; the time it takes to heal from injuries. Odell urges us to become stewards of these different rhythms of life in which time is not reducible to standardized units and instead forms the very medium of possibility.Saving Time tugs at the seams of reality as we know it—the way we experience time itself—and rearranges it, imagining a world not centered on work, the office clock, or the profit motive. If we can “save” time by imagining a life, identity, and source of meaning outside these things, time might also save us.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Philosophy",
    "Psychology",
    "Audiobook",
    "Essays",
    "Personal Development"
  ],
  "author": "Jenny Odell",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/61358639-saving-time"
}