{
  "title": "Caveman Logic: The Persistence of Primitive Thinking in a Modern World",
  "description": "We see the face of the Virgin Mary staring up at us from a grilled cheese sandwich and sell the uneaten portion of our meal for $37,000 on eBay. While science offers a wealth of rational explanations for natural phenomena, we often prefer to embrace the fantasies that reassured our distant ancestors. And we'll even go to war to protect our delusions against those who do not share them.These are examples of what evolutionary psychologist Hank Davis calls \"Caveman Logic.\" Although some examples are funny, the condition itself is no laughing matter. In this engagingly written book, Davis encourages us to transcend the mental default settings and tribal loyalties that worked well for our ancestors back in the Pleistocene age. Davis laments a modern world in which more people believe in ESP, ghosts, and angels than in evolution. Superstition and religion get particularly critical treatment, although Davis argues that religion, itself, is not the problem but \"an inevitable by-product of how our minds misperform.\"Davis argues, \"It's time to move beyond the one-size-fits-all, safety and comfort-oriented settings that got our ancestors through the terrifying Pleistocene night.\" In contrast, Davis advocates a world in which \"spirituality\" is viewed as a dangerous rather than an admirable quality, and suggests ways in which we can overcome our innate predisposition toward irrationality. He concludes by pointing out that \"biology is not destiny.\" Just as some of us succeed in watching our diets, resisting violent impulses, and engaging in unselfish behavior, we can learn to use critical thinking and the insights of science to guide individual effort and social action in the service of our whole species.",
  "genres": [
    "Psychology",
    "Science",
    "Religion",
    "Nonfiction",
    "Skepticism",
    "Biology",
    "Evolution"
  ],
  "author": "Hank Davis",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/6136192-caveman-logic"
}