{
  "title": "Dancing in the Darkness: Spiritual Lessons for Thriving in Turbulent Times",
  "description": "A “deeply spiritual and socially radical” (Dr. Obery Hendricks, PhD) guide to uplift our spirits as we work for justice in these politically turbulent times—from Reverend Otis Moss, III, Senior Pastor at Chicago’s Trinity United Church of Christ and one of the country’s most renowned and beloved spiritual and civil rights leaders.Once again, as Dr. Martin Luther King, Jr. first observed in the 1960s, it is midnight in America—a dark time of division and anxiety, with threats of violence looming in the shadows. In 2008, the Trinity United Church in Chicago received threats when one of its parishioners, Senator Barack Obama, ran for president. “ We’re going to kill you ” rang in Reverend Otis Moss’s ears when he suddenly heard a noise in the middle of the night. He grabbed a baseball bat to confront the intruder in his home. When he opened the door to his daughter’s room, he found that the source of the noise was his own little girl, dancing. She was simply practicing for her ballet recital.At that moment, Pastor Moss saw that the real intruder was within him. Caught in a cycle of worry and anger, he had allowed the darkness inside. But seeing his daughter evoked Pslam 30: “You have turned my mourning into dancing.” He set out to write the sermon that became this inspiring and transformative book.Dancing in the Darkness is a “life-affirming” (Dr. Teresa L. Fry Brown) guide to the practical, political, and spiritual challenges of our day. Drawing on the teachings of Dr. King, Howard Thurman, sacred scripture, southern wisdom, global spiritual traditions, Black culture, and his own personal experiences, Dr. Moss instructs you on how to practice spiritual resistance by combining justice and love. This collection helps us tap into the spiritual reserves we all possess but too often overlook, so we can slay our personal demons, confront our civic challenges, and reach our highest goals.",
  "genres": [
    "Religion",
    "Spirituality",
    "Theology",
    "Nonfiction",
    "Christian",
    "Christianity",
    "Race"
  ],
  "author": "Otis Moss III",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/61354042-dancing-in-the-darkness"
}