{
  "title": "All the Pretty Places",
  "description": "“A timeless and powerful novel of a daring woman who must decide if she will risk everything to follow her passion and find her voice.” —Patti Callahan Henry, New York Times bestselling author From the moment she was born, the transforming beauty of her family’s nurseries has arrested her heart. From the moment she knew love, her heart belonged with his. Now she’s at risk of losing them both. Rye, New York, 1893. Sadie Fremd’s dreams hinge on her family’s nursery, which has been the supplier of choice for respected landscape architects on the East Coast for decades. Now her small town is in a panic as the economy plummets into a depression, and Sadie’s father is pressuring her to secure her future by marrying a wealthy man among her peerage—but Sadie has never been one to play it safe. Besides, her heart is already spoken for. Rather than seek potential suitors, Sadie pursues new business from her father’s most reliable and wealthy clients of the Gilded Age in an attempt to bolster the floundering nursery. But the more time Sadie spends in the secluded gardens of the elite, the more she notices the hopelessness in the eyes of those outside the mansions. The poor, the grieving, the weary. The people with no access to the restorative beauty of nature. Sadie has always wanted her father to pass his business to her instead of to one of her brothers, but he seems oblivious to her desire and talent—and now to her passion for providing natural beauty to those who can’t afford it. When former employee, Sam, shows up unexpectedly, Sadie wonders if their love can be rekindled or if his presence will simply be another reminder of a life she longs for and cannot have. Joy Callaway illuminates the life of her great-great-grandmother in this captivating story about a daring woman following her passion and finding her voice, while exploring natural beauty and its effect in the lives of those who need it most.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "Audiobook",
    "19th Century",
    "New York"
  ],
  "author": "Joy Callaway",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/61349409-all-the-pretty-places"
}