{
  "title": "Run, Run Rabbit (Cambric Creek After Darkverse, #1)",
  "description": "Vanessa loves having Grayson Hemming chase her, and she'll do anything to keep him running.When young werewolf Vanessa Blevin begins working at new law firm, she expects long hours, hard work, and harder personalities. Her boss is a demanding, demeaning bully who begins cutting her down on her very first day — cutting her down and setting her blood on fire. Grayson Hemming is tall, dark, alphahole handsome, the exact sort of werewolf she does not need in her life . . . but there's something about the way he smells, his cutting smile, and the way his eyes always seem to find her. Her wolf wants his, and the feeling is mutual. The lines between their professional lives and personal desires are blurred every full moon in his bed, and the only way she knows how to keep from being burned is to keep running.When she attends an exclusive Lupercalia celebration just outside of Cambric Creek, she knows exactly what to expect. The whole town knows what goes on at the invitation-only werewolf soirées, and every last one of them is eager for an invite. The Lupercalia festivities are an ancient rite of fertility and carnality, of sex and sweat and celebration, and she knows one of the wolves will have her before the night is done. One of them will have her, but only one wolf will do. One wolf, one knot, one set of teeth at her back . . . but he'll have to catch her first.Run, Run Rabbit is a part of the Cambric Creek After Darkverse and can be enjoyed as a standalone. The After Darkverse is NOT the same lightweight fluff you can expect from the main Cambric Creek series — there is no guarantee of a HEA, and the relationships will be darker. A bit less sugar and a lot more spice.Content advisories for Run, Run Rabbit include: Primal play, chase play, exhibitionism, knotting, non-monogamous relationship, shifted *relations*, inappropriate workplace romance, pregnancy termination, and a decently toxic relationship.",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters",
    "Monsters",
    "Dark Romance"
  ],
  "author": "C.M. Nascosta",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/61366808-run-run-rabbit-cambric-creek-after-darkverse-1"
}