{
  "title": "Das Kaufhaus der Träume",
  "description": "Penny wohnt in einem ganz besonderen Dorf. Betreten kann man es nur, wenn man eingeschlafen ist. Dann gibt es viel zu sehen: An einem Food-Truck kann man schlaffördernde Naschereien kaufen. In einer dunklen Gasse hat Maxim, der Produzent der Albträume, seine Werkstatt. Ein geheimnisvoller Mann wohnt in einer Hütte in einem Schneegebirge, und Elfen entwerfen Träume, in denen man fliegen kann. Viele weitere Attraktionen erwarten die Schlafenden, der Kundenmagnet aber ist das Kaufhaus von Dollargut, in dem Penny hoch motiviert arbeitet. In dem fünfgeschossigen Holzbau wimmelt es von Kunden. Das Kaufhaus erfreut sich aber nicht nur bei Menschen, sondern auch bei Tieren höchster Beliebtheit. In jeder Etage kann man eine bestimmte Sorte von Träumen finden: teure und beliebte Träume, limited editions und Vorbestellungen, allgemeinere Träume mit kleinen alltäglichen Ereignissen wie Kurzreisen, einer Feier mit Freunden oder ein leckeres Essen, aber auch innovative Träume mit viel Action. Sogar für Kurzweiliges ist gesorgt: In der dritten Etage gibt es spezielle Träume für den Mittagsschlaf. Die Bezahlung erfolgt über die Gefühle, die die Kunden nach dem Traum haben.„Das Kaufhaus der Träume“ besteht aus mehreren Episoden, die die persönlichen Geschichten der Kunden und ausführliche Beschreibungen der Traumwelt beinhalten: So möchte eine Frau nur Träume kaufen, in denen der Mann vorkommt, für den sie heimlich Gefühle hegt. Ein Mann in einem Patientenhemd möchte einen ganz bestimmten Traum als Vorbestellung für seine Hinterbliebenen. Mithilfe der Träume gelingt es den Kunden, ihre Verletzungen zu heilen, ihre Sehnsüchte zu stillen oder ihre Ängste zu überwinden.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Magical Realism",
    "Contemporary",
    "Cozy",
    "Audiobook",
    "Adult"
  ],
  "author": "Lee Mi-ye",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/61368880-das-kaufhaus-der-tr-ume"
}