{
  "title": "Unsolved Crimes & Mysteries",
  "description": "Unsolved Crimes, Cold Cases, and Mysterious Stories“Haunting and heartbreaking, The Best New True Crime Unsolved Crimes & Mysteries lives up to its title, and is a must-read for true crime aficionados...”—Alex Finlay, author of Every Last Fear and The Night Shift#1 New Release in Medical Forensic PsychologyThis collection of cold cases examines crimes that are dark, scary, mysterious, and still waiting to be solved.Unsolved crimes, unanswered questions. Crimes are meant to be solved. But what happens when they’re not? For the individuals involved—from the victims and their families to police investigators—this is the most frustrating part of all. For them there’s no resolution, no justice, no tidy boxes in which to pack away all the bits and pieces of a puzzle that finally links together. Instead, they are only left with questions that may never get answered. Chilling cold cases & unexplained mysteries. The Best New True Crime Stories examines a fascinating assortment of unsolved murders, unsolved crimes, serial killers, and mysterious stories from around the world, from the past to the contemporary. Like the previous anthologies in The Best New True Crime Stories series, this volume contains all-new and original nonfiction accounts penned by international writers from across the literary spectrum, from true crime and crime fiction to journalism. Contributors include Dean Jobb, Joan Renner, Cathy Pickens, Lindsey Danis, Anya Wassenberg, and many others.Inside, you’ll A varied assortment of unsolved crimes and mysterious murdersMurder cases to solve, told by writers from around the worldFrance’s “Valley of Hell” mystery and the story of Austria’s most wantedIf you like books about murder cases or liked The Book of Cold Cases, If You Tell, or Unmasked, you’ll love The Best New True Crime Stories.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Mitzi Szereto",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/61374704-unsolved-crimes-mysteries"
}