{
  "title": "An Anatomy of Addiction: Sigmund Freud, William Halsted, and the Miracle Drug Cocaine",
  "description": "From acclaimed medical historian Howard Markel, author of When Germs Travel, the astonishing account of the years-long cocaine use of Sigmund Freud, young, ambitious neurologist, and William Halsted, the equally young, pathfinding surgeon. Markel writes of the physical and emotional damage caused by the then-heralded wonder drug, and how each man ultimately changed the world in spite of it—or because of it. One became the father of psychoanalysis; the other, of modern surgery. Both men were practicing medicine at the same time in the 1880 Freud at the Vienna General Hospital, Halsted at New York’s Bellevue Hospital. Markel writes that Freud began to experiment with cocaine as a way of studying its therapeutic uses—as an antidote for the overprescribed morphine, which had made addicts of so many, and as a treatment for depression. Halsted, an acclaimed surgeon even then, was curious about cocaine’s effectiveness as an anesthetic and injected the drug into his arm to prove his theory. Neither Freud nor Halsted, nor their colleagues, had any idea of the drug’s potential to dominate and endanger their lives. Addiction as a bona fide medical diagnosis didn’t even exist in the elite medical circles they inhabited. In An Anatomy of Addiction, Markel writes about the life and work of each man, showing how each came to know about cocaine; how Freud found that the drug cured his indigestion, dulled his aches, and relieved his depression. The author writes that Freud, after a few months of taking the magical drug, published a treatise on it, Über Coca, in which he described his “most gorgeous excitement.” The paper marked a major shift in Freud’s he turned from studying the anatomy of the brain to exploring the human psyche. Halsted, one of the most revered of American surgeons, became the head of surgery at the newly built Johns Hopkins Hospital and then professor of surgery, the hospital’s most exalted position, committing himself repeatedly to Butler Hospital, an insane asylum, to withdraw from his out-of control cocaine use. Halsted invented modern surgery as we know it devising new ways to safely invade the body in search of cures and pioneering modern surgical techniques that controlled bleeding and promoted healing. He insisted on thorough hand washing, on scrub-downs and whites for doctors and nurses, on sterility in the operating room—even inventing the surgical glove, which he designed and had the Goodyear Rubber Company make for him—accomplishing all of this as he struggled to conquer his unyielding desire for cocaine. An Anatomy of Addiction tells the tragic and heroic story of each man, accidentally struck down in his prime by an insidious tragic because of the time, relationships, and health cocaine forced each to squander; heroic in the intense battle each man waged to overcome his affliction as he conquered his own world with his visionary healing gifts. Here is the full story, long overlooked, told in its rich historical context.",
  "genres": [
    "History",
    "Psychology",
    "Nonfiction",
    "Biography",
    "Medicine",
    "Science",
    "Medical"
  ],
  "author": "Howard Markel",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/10308694-an-anatomy-of-addiction"
}