{
  "title": "Heavenly Discourse",
  "description": "Heavenly Discourse is a collection of satirical essays by Charles Erskine Scott Wood & written in the form of plays or discussions between such characters as God, Jesus, Mark Twain, Tom Paine, Robert Ingersoll, Billy Sunday & Theodore Roosevelt. Politically radical, the essays ridicule militarism, prudery & religious intolerance. Ten were originally published in Max Eastman's magazine, The Masses, the 1st in '14. Following passage of the Espionage Act of '17, The Masses was suppressed by the US government on grounds it was detrimental to the war effort. Wood continued to write more discourses. In '27 Vanguard published a collection of 41 of them under the title Heavenly Discourse. Titles include: Is God a Jew; Marriage; God Receives a Delegation; Freedom; The Monkeys Complain; Birth Control; Anthony Comstock in Heaven; Prohibition; Billy Sunday Meets God; The US Must Be Pure; Billy Sunday Instructs God; A Fly Bothers God; St Peter Loses a Soul; Preparedness in Heaven; Prayer; Satan Brings the US into the War; A Pacifist Enters Heaven-in Bits; The Stupid Cannot Enter Heaven; T.R. Enters Heaven; Prince Buttinsky; God, Paul & Satan on Christianity; Satan Loses His Mind; God's Picnic; God's Picnic & the Playwright; Rabelais & Censors; Censorship; God & Christ Have a Merry Christmas; Denver Prays for Rain; God on Catholicism & the KKK; God Advises Peter as to the Church; Bishop Wm Montgomery Brown Enters Heaven; God & St Peter Discuss Theology; Joan of Arc-Heretic & Saint; Satan Regains His Reason; Charles Evans Hughes Visits Heaven w/out a Passport & Is Deported; England's General Strike; The Lame Duck & Imperialism; The Golden Rule; Satan Asks for Help; Noah's Cruise; & God's in His Heaven-All's Wrong w/the World.  In Billy Sunday meets God, Sunday is surprised to find people he condemned in heaven. \"Why, there is Herman Morgenstern. I sent him to hell. He kept a family beer garden on 4th Avenue in New York...What is he doing here?\" Jesus replies \"I liked him. He was a gentle, charitable soul.\" Sunday objects that he kept a beer salon, & Jesus replies \"I lived with publicans & sinners.\" Sunday complains about the presence in Heaven of a woman who had had an illegitimate child; Jesus replies \"I liked her. The one with her is Mary Magdalen.\" From A Pacifist enters Heaven—in bits:BATTERED SOUL: I'm a pacifist. GOD: A what? BATTERED SOUL: A pacifist. I believe in Jesus & peace. GOD: So you are a Christian? BATTERED SOUL: O, no. I really do believe in peace. In a discourse on Preparedness in Heaven, God decides to prepare for a war against Satan.GABRIEL: I am afraid Heaven won't stand for that. Jesus has preached peace too long. GOD: ...We must first frighten them, fill them with fear, then with hate. For example, headlines in the Heavenly Herald: \"Horrible Atrocities of Satan,\" \"Make the Cosmos Safe for Jesus,\" \"Satan Threatens Your Halos,\" \"Satan Disembowels a Cherub,\" \"Satan Rapes the Ten Foolish Virgins\" & so on... GABRIEL: But none of this will be true. GOD: True? Of course, it won't. Don't be a fool, Gabriel. You can't work up a war—preparedness, I mean—on the truth. This is war—I mean preparedness—& we simply must lie—the more horrible the lies the better.",
  "genres": [
    "Humor",
    "Philosophy",
    "Nonfiction",
    "Religion"
  ],
  "author": "Charles Erskine Scott Wood",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/6137738-heavenly-discourse"
}