{
  "title": "The Clock in the Hatbox",
  "description": "Classic golden age mystery from a true icon of crime fiction Circumstantial evidence was as strong as proof at the trial of Viola Ross. Everything pointed to the conclusion that this beautiful woman had smothered her wisp of a husband. But, the twelfth juror, Richard Arnold, held out stubbornly to the end . . . perhaps he knew something which the others didn't . . . perhaps he only guessed. But, he was certain that beautiful Viola Ross could have had neither the heart nor the strength to have murdered her husband, Teddy. When a retrial is ordered, Arnold, haunted by the face of Viola Ross, sets out his own investigation before she faces the second trial for her life! Without Richard Arnold's almost fanatical interference, Viola Ross would have gone quickly to the gallows, for there were too many strikes against her from the beginning. A dead man, for example, alone in the house with his wife, does not get up to hide his alarm clock in a hat box! Moreover, Viola had quarreled frequently and bitterly with her husband over her stepson, young Harry Ross -- and it was upon this young man and his life that the obsessed juror, Arnold, concentrated his desperate search for new evidence. Arnold discovered that Harry Ross had had both provocation and opportunity to have murdered his father and, as unbearable as the suspicion was to Arnold, young Ross could have been infatuated with his exquisite young stepmother. Three attempts on his life did not deter Arnold, but before the end of the story, he had learned that the police work more surely than the private individual. The final solution of The Clock in the Hat Box reveals the ingenuity of a plot that places this baffling and delightfully written story high on the list of Gilbert's widely popular mysteries. It is as brilliant a book as any that Anthony Gilbert (pseudonym of Lucy Beatrice Malleson) has written, full of ingenuity, character and refreshing humor.",
  "genres": [],
  "author": "Anthony Gilbert",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/6136578-the-clock-in-the-hatbox"
}