{
  "title": "The Elf and Shoemaker",
  "description": "(Gay / Erotica / Fantasy / Fairy Tale / Witchcraft / Magic) Logan Shoemaker's honest, hardworking, and loves what he does. Though he never expects to get rich, he's fared well enough to stay comfortable with his quirky metaphysical store, Shoemaker's Magick Shoppe. But when the economy falls on hard times, his store pays the price. As each month passes, slow sales turn into no sales, and soon Logan's living off ramen noodles and sleeping in a freezing house during the cold winter nights as he struggles to make ends meet. His personal life isn't much better--the worse business at the store grows, the more isolated and lonely he becomes. After a string of mishaps that wipe out the last of his small savings, he finally hits rock bottom the day he discovers the disconnection notice from the electric company hanging on his door. That night, desperate and in despair, he makes a plea to the universe, asking for help. Needless to say, he never anticipates receiving a response so quickly. Not only does he awaken the next morning to find on his kitchen table four little bottles of a special potion labeled 'PASSION,' but he keeps remembering the erotically charged dream he'd had during the night. A dream where a tall, gorgeous man with pointed ears comes to his bed and shows him just what kind of magick they can make together. But was it a dream? All Logan knows is that his customers can't get enough of the special potion--an aphrodisiac--and he can't stop thinking about the sweet seduction of the nighttime visitor who made it. As he tries to sort out what's real and what's not, he discovers there's a much bigger world out there than he'd ever believed, and his true heart's desire might come in a most unexpected form...",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Magic",
    "M M Romance",
    "Contemporary",
    "Romance",
    "Gay"
  ],
  "author": "M.L. Rhodes",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/6139004-the-elf-and-shoemaker"
}