{
  "title": "The Last Animal",
  "description": "A playful, witty, and resonant novel in which a single mother and her two teen daughters engage in a wild scientific experiment and discover themselves in the process, from the award-winning writer of Sons and Daughters of Ease and PlentyJane is a serious scientist on the cutting-edge team of a bold project looking to \"de-extinct\" the woolly mammoth. She's privileged to have been sent to Siberia to hunt for ancient DNA, but there's a catch: Jane's two \"tagalong\" teen daughters are there with her in the Arctic, and they're bored enough to cause trouble. Brilliant, fiery, sharp-tongued Eve is fifteen and willing to talk back to the male scientists in a way her mother is not. And sweet, thirteen-year-old Vera, who seems to absorb all the emotional burdens of her small family, just wants to be home in Berkeley, baking cakes and watching bad TV.When Eve and Vera stumble upon a four-thousand-year-old baby mammoth that has been perfectly preserved, their discovery sets off a chain of events that pits Jane against her colleagues, and soon her status at the lab is tenuous at best. So what does a female scientist do when she's a passionate devotee of her field but her gender and life history hold her back? She goes rogue.As Jane and her daughters ping-pong from the slopes of Siberia to a university in California, from the shores of Iceland to an exotic animal farm in Italy, The Last Animal takes readers on an expansive, bighearted journey that explores the possibility and peril of the human imagination on a changing planet, what it's like to be a woman and a mother in a field dominated by men, and how a wondrous discovery can best be enjoyed with family. Even teenagers.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Contemporary",
    "Book Club",
    "Animals",
    "Audiobook",
    "Literary Fiction"
  ],
  "author": "Ramona Ausubel",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/61387955-the-last-animal"
}