{
  "title": "Secrets of the Savanna: Twenty-Three Years in the African Wilderness Unraveling the Mysteries of Elephants and People",
  "description": "From the best-selling authors of Cry of the Kalahari, the dramatic story of Mark and Delia Owens's last years in Africa, fighting to save elephants, villages, and, in the end, themselves.Crossing stick bridges over swollen rivers and battling swarms of tsetse flies, Mark and Delia Owens found their way into one of the most startlingly beautiful, wild places on earth, the northern Luangwa Valley in Zambia. As they were setting up camp to launch their lion research, gunfire echoed off the cliffs nearby. Gangs of ivory poachers were not only shooting the elephants but also virtually enslaving local villagers. Against unimaginable odds, Mark and Delia stopped the poaching by helping the villagers find other work, start small businesses, and improve their health care and education.Living with wild creatures all around (lions sleeping at their toes, an orphan elephant dancing a jig in camp), Mark and Delia observed surprising similarities between the behaviors of humans and those of other animals. The bonding among young female animals and the competition among males reminded them of their own childhoods. As the elephant population slowly recovered from poaching, the Owenses saw parallels to human societies under stress. Older elephants, killed for their tusks, had taken with them the knowledge that had been passed down to the young for generations. The slaughter of the elders led to chaos -- single mothers without older females to guide them, solitary orphans, rowdy gangs of young males -- and a scientific how could there be so many babies and so few females old enough to be mothers? A young orphan they named Gift eventually provided the clue to the remarkable discovery that revealed the elephants' secret.After the local ivory poachers were put out of business, they shifted their sights from the elephants to the Owenses. To save themselves, Mark and Delia took a lesson from the elephants, employing one of the last secrets of the savanna.",
  "genres": [
    "Nonfiction",
    "Africa",
    "Animals",
    "Nature",
    "Zambia",
    "Memoir",
    "Travel"
  ],
  "author": "Mark  Owens",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/613928.Secrets_of_the_Savanna"
}