{
  "title": "Raven Stole the Moon",
  "description": "In this haunting debut, Garth Stein brilliantly invokes his Native American heritage and its folklore to create an electrifying supernatural thriller. When a grieving mother returns to the remote Alaskan town where her young son drowned, she discovers that the truth about her son's death is shrouded in legend— and buried in a terrifying wrinkle between life and death. When Jenna Rosen abandons her comfortable Seattle life to return to Wrangell, Alaska, it's a wrenching return to her past. Long ago the home of her Native American grandmother, Wrangell is located near the Thunder Bay resort, where Jenna's young son, Bobby, disappeared two years before. His body was never recovered, and Jenna is determined to lay to rest the aching mystery of his death. But the spectacular town provides little comfort beyond the steady and tender affections of Eddie, a local fisherman. And then whispers of ancient legends begin to suggest a frightening new possibility about Bobby's fate. Soon, Jenna must sift through the beliefs of her ancestors, the Tlingit— who still tell of powerful, menacing forces at work in the Alaskan wilderness.There beliefs are shared by Dr. David Livingstone, a practicing shaman who had been hired to \"cleanse\" Thunder Bay of its restless spirits. The experience almost cost him his life, and he warns Jenna about the danger of disturbing the legendary kushtaka— soul-stealing predators that stalk a netherworld between land and sea, the living and the dead. But Jenna is desperate for answers, and she appeals to both Livingstone and Eddie to help her sort fact from myth, and face the unthinkable possibilities head-on. Armed with nothing but a mother's ferocious protective instincts, Jenna's quest for the truth about her son— and the strength of her beliefs— is about to pull her into a terrifying and life-changing abyss...Coloring powerful legend with universal emotions, Garth Stein masterfully evokes our most primal dreams and fears. Remarkably vivid and relentlessly suspenseful, \"Raven Stole the Moon\" marks the arrival of a stunningly imaginative new talent.",
  "genres": [
    "Fiction",
    "Mystery",
    "Contemporary",
    "Native American",
    "Book Club",
    "Fantasy",
    "Suspense"
  ],
  "author": "Garth Stein",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/613959.Raven_Stole_the_Moon"
}