{
  "title": "Who Cries for the Lost",
  "description": "June 1815. The people of London wait, breathlessly, for news as Napoleon and the forces united against him hurtle toward their final reckoning at Waterloo. Among them is Sebastian St. Cyr, Viscount Devlin, frustrated to find himself sidelined while recovering from a dangerous wound he recently received in Paris. When the mutilated corpse of Major Miles Sedgewick surfaces from the murky waters of the Thames, Sebastian is drawn into the investigation of a murder that threatens one of his oldest and dearest friends, Irish surgeon Paul Gibson.Gibson’s lover, Alexi Sauvage, was tricked into a bigamous marriage with the victim. But there are other women who may have wanted the cruel, faithless Major dead. His mistress, his neglected wife, and their young governess who he seduced all make for compelling suspects. Even more interesting to Sebastian is one of Sedgewick’s fellow officers, a man who shared Sedgewick’s macabre interest in both old English folklore and the occult. And then there’s a valuable list of Londoners who once spied for Napoleon that Sedgewick was said to be transporting to Charles, Lord Jarvis, the Regent’s powerful cousin who also happens to be Sebastian’s own father-in-law.The deeper Sebastian delves into Sedgewick’s life, the more he learns about the Major’s many secrets and the list of people who could have wanted him dead grows even longer. Soon others connected to Sedgewick begin to die strange, brutal deaths and more evidence emerges that links Alexi to the crimes. Certain that Gibson will be implicated alongside his lover, Sebastian finds himself in a desperate race against time to stop the killings and save his friends from the terror of the gallows.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Fiction",
    "Audiobook",
    "Regency"
  ],
  "author": "C.S. Harris",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/61407438-who-cries-for-the-lost"
}