{
  "title": "The Bookbinder of Jericho",
  "description": "A young British woman working in a book bindery gets a chance to pursue knowledge and love when World War I upends her life in this new novel from the New York Times bestselling author of the Reese’s Book Club pick The Dictionary of Lost Words.“Williams spins an immersive and compelling tale, sweeping us back to the Oxford she painted so expertly in The Dictionary of Lost Words.”—Paula McLain, author of The Paris WifeIt is 1914, and as the war draws the young men of Britain away to fight, women must keep the nation running. Two of those women are Peggy and Maude, twin sisters who live on a narrow boat in Oxford and work in the bindery at the university press.Ambitious, intelligent Peggy has been told for most of her life that her job is to bind the books, not read them—but as she folds and gathers pages, her mind wanders to the opposite side of Walton Street, where the female students of Oxford’s Somerville College have a whole library at their fingertips. Maude, meanwhile, wants nothing more than what she has: to spend her days folding the pages of books in the company of the other bindery girls. She is extraordinary but vulnerable, and Peggy feels compelled to watch over her.Then refugees arrive from the war-torn cities of Belgium, sending ripples through the Oxford community and the sisters’ lives. Peggy begins to see the possibility of another future where she can educate herself and use her intellect, not just her hands. But as war and illness reshape her world, her love for a Belgian soldier—and the responsibility that comes with it—threaten to hold her back.The Bookbinder is a story about knowledge—who creates it, who can access it, and what truths get lost in the process. Much as she did in the international bestseller The Dictionary of Lost Words, Pip Williams thoughtfully explores another rarely seen slice of history through women’s eyes.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Books About Books",
    "Audiobook",
    "Book Club",
    "War"
  ],
  "author": "Pip Williams",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/61410172-the-bookbinder-of-jericho"
}