{
  "title": "Serpent's Kiss",
  "description": "From the bestselling author of the Blue Bloods and The Descendants series comes the thrilling sequel to the Witches of East End.The intriguing Beauchamp family, introduced in the New York Times bestselling Witches of East End, returns in Serpent's Kiss, with dizzying plot twists and spellbinding magic.Joanna and her daughters, bookish Ingrid and wild-child Freya, are just settling into the newfound peace that has been cast over their small, off-the map town of North Hampton. With the centuries-old restriction against practicing magic lifted, casting spells, mixing potions, and curing troubled souls has never felt so good for the three witches. That is, until everything gets turned upside down--from Joanna's organized kitchen to Ingrid's previously nonexistent love life to Freya's once unshakeable faith in her sexy soul mate, Killian Gardiner.When Freya's twin brother, Freddie, suddenly returns, escaped from Limbo and professing innocence on a long-ago crime, Freya should be ecstatic. The golden boy can do no wrong. Or can he? Freddie blames no other than her fiancÉ Killian for his downfall, and enlists Freya's help to prove it. Now Freya doesn't know who to believe or trust.And for the first time in--well, forever, really--Ingrid is also busy in love. Matt Noble, the handsome and charming police detective, has won her heart. But can romance work between a virgin witch and a mortal who doesn't believe in magic? Things get even more complicated when it appears Ingrid is harboring the prime suspects in Matt's police investigation.To add to the chaos, a dead spirit is attempting to make contact with Joanna--but does it mean to bring harm or help? Joanna asks her sort-of ex-husband Norman to help figure it out, only to accidentally invite him to a Thanksgiving dinner with a dapper gentleman she's recently begun dating.As the witches pull together to discover the serpent within their midst and the culprit behind Freddie's imprisonment, everything is thrown into peril. Will the discovery come too late to save those they love most?Melissa de la Cruz weaves all this and more in a blockbuster sequel that is not to be missed by her fans, and one that is sure to enchant new readers of the series.",
  "genres": [
    "Fantasy",
    "Witches",
    "Paranormal",
    "Fiction",
    "Romance",
    "Magic",
    "Young Adult"
  ],
  "author": "Melissa de la Cruz",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/12902131-serpent-s-kiss"
}