{
  "title": "Escape From Camp 14: One Man’s Remarkable Odyssey from North Korea to Freedom in the West",
  "description": "With a New ForewordThe heartwrenching New York Times bestseller about the only known person born inside a North Korean prison camp to have escaped. North Korea’s political prison camps have existed twice as long as Stalin’s Soviet gulags and twelve times as long as the Nazi concentration camps. No one born and raised in these camps is known to have escaped. No one, that is, except Shin Dong-hyuk.In Escape From Camp 14, Blaine Harden unlocks the secrets of the world’s most repressive totalitarian state through the story of Shin’s shocking imprisonment and his astounding getaway. Shin knew nothing of civilized existence—he saw his mother as a competitor for food, guards raised him to be a snitch, and he witnessed the execution of his mother and brother.The late “Dear Leader” Kim Jong Il was recognized throughout the world, but his country remains sealed as his third son and chosen heir, Kim Jong Eun, consolidates power. Few foreigners are allowed in, and few North Koreans are able to leave. North Korea is hungry, bankrupt, and armed with nuclear weapons. It is also a human rights catastrophe. Between 150,000 and 200,000 people work as slaves in its political prison camps. These camps are clearly visible in satellite photographs, yet North Korea’s government denies they exist.Harden’s harrowing narrative exposes this hidden dystopia, focusing on an extraordinary young man who came of age inside the highest security prison in the highest security state. Escape from Camp 14 offers an unequalled inside account of one of the world’s darkest nations. It is a tale of endurance and courage, survival and hope.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Memoir",
    "Politics",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Blaine Harden",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/12902060-escape-from-camp-14"
}