{
  "title": "Violent Mistake",
  "description": "Internet sensation, Kazimir Skokan, is loved around the world for his luxury photoshoots and envious lifestyle. But Felix Quaid has never hated a man more. Ex-investigative journalist turned true-crime podcaster, Felix knows something is off with playboy Kazi. From the late-night back-alley meetings to the people around him who later vanish, behind Kazimir’s flashy smile, he’s rotten to his core. Not to mention rumors of darker, dangerous, some-say supernatural occurrences around Kazimir. Felix even has photos to prove it.But the last time he tried to expose Kazimir Skokan, his story was inexplicably shut down, taking Felix’s career as a reporter with it. Kazimir owes him the truth. And Felix is going to make sure the whole world knows it. *Kazi has new orders. Kill Felix Quaid. The Blackrose Brotherhood leader, Mikalis, is never wrong. But in this, Kazi disagrees. Sure, Quaid is a pest, perhaps even a stalker, but no more than any other overzealous fan. Still, what Mikalis wants, Mikalis gets. And what’s another dead meat-bag to Kazi anyway? He stopped caring who lived and who died long ago. Making Quaid disappear should have been easy. But in Quaid’s final, crucial moments, a pack of cult members kidnap them both, mistaking Quaid for a member of the brotherhood. Now, trapped together, their time running out, Kazi must work with Quaid if they’re to survive the insane Nyx-worshipping acolytes.But as soon as they escape, Mikalis’s orders still stand: Quaid must die.Kazi thought he’d long ago given up on caring who lived and who died. Apparently, he was wrong… *Sparks fly in the second book in the all-new gay vampire romance. Please note these books contain morally grey characters, unlikable heroes, enemies to lovers, and all the Ariana Nash angst you didn’t know you needed.The Blackrose Brotherhood series is a fast burn paranormal MM romance featuring a new couple in each book. Each book ends in a HEA/HFN.",
  "genres": [
    "M M Romance",
    "Vampires",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Enemies To Lovers",
    "Urban Fantasy"
  ],
  "author": "Ariana Nash",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/61398280-violent-mistake"
}