{
  "title": "Child of the Erinyes: The Complete Collection: Books One Through Nine",
  "description": "The Year-god's Daughter, The Thinara King, In the Moon of Asterion, The Moon Casts a Spell, The Sixth Labyrinth, Falcon Blue, When the Moon Whispers (both chronicles) and Swimming in the Rainbow.The epic reincarnation fantasy inspired by Ariadne, Theseus, and the Minotaur.In the Bronze Age, two brothers plot Crete's overthrow, but desire for the queen's daughter will propel all three into an unimaginable future, and spark the immortal rage of the Erinyes.\"Atmospheric, lyrical, and inspired. I envy readers newly discovering this riveting epic.\" Lucinda Elliot, author of That Scoundrel Emile Dubois, Ravensdale, and The Peterloo Affair.For time beyond memory, Crete has sacrificed its king to ensure good harvests, ward off earthquakes, and please the Goddess. Men compete in brutal trials to win the title of Zagreus, the sacred bull-king, even though winning means they'll die in a year.Two brothers from Mycenae set out to trick the competition and its formidable reckoning as they search for weaknesses in this rich, coveted society.Hindering their goal is the seductive and fearless Cretan princess, Aridela, an uncommon woman neither brother can resist, and ancient prophecies that promise terrible retribution to any who threaten Goddess Athene's people.A woman of keen instinct and unshakable loyalty.A proud warrior prince and his wounded half-brother.Glory, passion, treachery, and conspiracy on the grandest scale.What seems the end is only the beginning.A note to readers from the author: I have continually warned potential readers that this is an interconnected reincarnation series that is not comprised of stand-alone books.But this warning does not apply here, as the entire series is included in this omnibus edition!Happy Reading!",
  "genres": [],
  "author": "Rebecca Lochlann",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/61414501-child-of-the-erinyes"
}