{
  "title": "Wizard's Masquerade",
  "description": "Who knew the jester was dangerous, or that he would try to steal her heart?After seven long years of learning magic at the Wizarding Guild, twenty-two-year-old Laynah is eager to graduate and pursue a glorious career as a wizard in the Royal Guard—until a horrendous injury leaves her dream in ruins.Defeated and with no chance of graduating, Laynah resigns herself to failure—so no one is more surprised than her when she is given a second chance to go to Rutherford Castle. But Laynah soon learns that not all that glitters is gold, and the royal castle’s inhabitants hold dangerous secrets, including the mysterious jester, who is both infuriating and charming.When tragedy strikes the kingdom, Laynah is drawn deeper into a web of secrets and lies, and becomes entangled with the jester in a treacherous game of trust and betrayal—but can she trust the jester with her heart?AMAZON BESTSELLER AND AWARDED READERS’ FAVORITE 5-STAR SEAL, this medieval fantasy romance blends magic, castles, ballrooms, political intrigue and a slow-burn romance for a seductive, page-turning escape. This is Book 1 of the Huskarl Duology - Book 2 Releasing Oct 1st 2023.\"Pride and Prejudice meets Harry Potter\" • Fantasy Romance for New Adults • Court Intrigue • Slow Burn with Open Door Spice (2/5) • Wizards, Castles & Ballrooms • Soft Magic System • Political Intrigue • Secrets & Deception • Grumpy/Sunshine trope • Book 1 of Huskarl Duology • Long book • Easy to read • Wholesome characters• Mild cliff-hanger with HFN vibes • Book 2 will deliver more spice and HEAPlease note:- The published book has undergone significant changes since the ARC in response to reader feedback.- Since the release date, Wizard's Masquerade has undergone changes including a five percent reduction in word count to improve flow and readability (without impacting the story) and the spelling of the protagonist's name has changed to Laynah. The audiobook has also been updated.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fantasy Romance",
    "Demons",
    "New Adult",
    "Audiobook",
    "Adult"
  ],
  "author": "Jay Pellegrin",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/61428537-wizard-s-masquerade"
}