{
  "title": "Embrace",
  "description": "It starts with a \"It's time for you to know who you are...\"On her 17th birthday, everything will change for Violet Eden. The boy she loves will betray her. Her enemy will save her. She will have to decide just how much she's willing to sacrifice.  Dangerously exciting and darkly romantic, EMBRACE is a compelling novel of good and evil, seductive desires and impossible choices. A centuries old war between fallen angels and the protectors of humanity chooses a new fighter. It's a battle Violet doesn't want, but she lives her life by two don't run and don't quit. If angels seek vengeance and humans are the warriors, you could do a lot worse than betting on Violet Eden.  He's been Violet's one anchor, her running partner and kickboxing trainer. Only he never told her he's Grigori-part human, part angel-and that he was training her for an ancient battle between Angels and Exiles.  No one knows where his loyalties lie, yet he's the only one there to pick up the pieces and protect her after Lincoln's lies. In a world of dark and light, he is all shades of gray.  Two Angel or Exile. Two Lincoln or Phoenix. The wrong choice could cost not only her life, but her eternity...  \"In her YA paranormal romance debut, Jessica Shirvington combines \"the badass-action of Vampire Academy, the complex love triangles of Twilight, and the angel mythology of Fallen, taken one step further.\" -Book Couture  \"Shirvington's debut is smart, edgy and addictive-and sure to leave readers clamoring for the rest of the series.\"- Kirkus Reviews, STARRED  \"One of the best YA novels we've seen in a while. Get ready for a confident, kick-butt, well-defined heroine.\" - RT Book Reviews\"",
  "genres": [
    "Young Adult",
    "Angels",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Supernatural"
  ],
  "author": "Jessica Shirvington",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/12902666-embrace"
}