{
  "title": "BloodLust",
  "description": "- 2022 Expanded Edition -First a slave, then a conscript, she’s always been at the mercy of monsters. When she’s offered a chance to unsheathe her claws, will death spill out?Sal Luxx is desperate to prove her kind are more than beasts. Born a second-class citizen in a world ruled by humans, the hardheaded pure-bred iliri has had subservience beaten into her veins. But her waning hope for freedom surges when she is given a pass to the trials for an elite military unit… and unleashes her inner predator.After Sal’s interaction with her new brothers-in-arms triggers strange mental powers, the knowledge her abusers have kept from her drives a growing rage. Yet even as she struggles to smother her rising berserker instincts, she’s undermined by the irresistible urge to claim a mate.Will Sal’s untamable nature spawn a rebellion or a massacre?BloodLust is the darkly intense first book in the Rise of the Iliri epic science fantasy series. If you like fierce female leads, shocking secrets, and scenes of primal passion, then you’ll love Auryn Hadley’s sharp-edged adventure.Buy BloodLust to declare dominance over despots today!Like all the books in the Rise of the Iliri series, this is a complete epic science-fantasy novel, without a cliffhanger. The female lead has multiple consensual romantic relationships as well as fulfilling friendships that matter to the storyline.Because the iliri have insatiable and exotic sexual instincts, it may be unsuitable for humans under 18. Due to the subject matter of this series, be aware of triggers for racial injustice, persecution, and various forms of discrimination. Like with many complex stories, things do not start out in a happy place.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Science Fiction",
    "Aliens",
    "Fantasy Romance"
  ],
  "author": "Auryn Hadley",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/61431670-bloodlust"
}