{
  "title": "The Price of Principle: Why Integrity Is Worth the Consequences",
  "description": "In his fiftieth book, Price of How Putting Honesty and Consistency Above Partisanship and Hypocrisy Costs Jobs, Reputations—and Even Friendships Alan Dershowitz—#1 New York Times bestselling author and one of America’s most influential legal scholars—explores the implications of the increasing tendency in politics, academia, media, and even the courts of law to punish principle and reward partisan hypocrisy.  Alan Dershowitz has been called “one of the most prominent and consistent defenders of civil liberties in America” by Politico, and “the nation’s most peripatetic civil liberties lawyer and one of its most distinguished defenders of individual rights” by Newsweek. Yet, he has come under intense criticism for living by his principles and applying his famed “shoe on the other foot test.” Price of Principle is about efforts to cancel Alan Dershowitz and his career because he has insisted on sticking to his principles instead of choosing sides in the current culture and political war dividing our country. He explains that principled people are actively punished for not being sufficiently partisan. Principle has become the vice and partisanship the virtue in an age when partisan ends justify unprincipled means, such as denial of due process and free speech in the interest of achieving partisan or ideological goals. Throughout his narrative, Dershowitz focuses on three sets of principles that have guided his 1) freedom of expression and conscience; 2) due process, fundamental fairness, and the adversary system of seeking justice; and 3) basic equality and meritocracy. He documents the attacks on him and others like him for being “guilty” of refusing to compromise important principles to promote partisanship. He names names and points fingers of accusation at those who have led us down this dangerous road. In the end, Price of Principle represents an icon in the defense of free speech and due process reckoning with the challenges of unprincipled attacks—a new brand of McCarthyism—and insisting that we ask hard questions about our own moral principles.",
  "genres": [
    "Politics",
    "Philosophy",
    "Law"
  ],
  "author": "Alan M. Dershowitz",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/61430817-the-price-of-principle"
}