{
  "title": "Race?: Debunking a Scientific Myth",
  "description": "Race has provided the rationale and excuse for some of the worst atrocities in human history. Yet, according to many biologists, physical anthropologists, and geneticists, there is no valid scientific justification for the concept of race.To be more precise, although there is clearly some physical basis for the variations that underlie perceptions of race, clear boundaries among “races” remain highly elusive from a purely biological standpoint. Differences among human populations that people intuitively view as “racial” are not only superficial but are also of astonishingly recent origin.In this intriguing and highly accessible book, physical anthropologist Ian Tattersall and geneticist Rob DeSalle, both senior scholars from the American Museum of Natural History, explain what human races actually are—and are not—and place them within the wider perspective of natural diversity. They explain that the relative isolation of local populations of the newly evolved human species during the last Ice Age—when Homo sapiens was spreading across the world from an African point of origin—has now begun to reverse itself, as differentiated human populations come back into contact and interbreed. Indeed, the authors suggest that all of the variety seen outside of Africa seems to have both accumulated and started reintegrating within only the last 50,000 or 60,000 years—the blink of an eye, from an evolutionary perspective.The overarching message of Race? Debunking a Scientific Myth is that scientifically speaking, there is nothing special about racial variation within the human species. These distinctions result from the working of entirely mundane evolutionary processes, such as those encountered in other organisms.",
  "genres": [
    "Science",
    "Nonfiction",
    "Anthropology",
    "Biology",
    "Race"
  ],
  "author": "Ian Tattersall",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/12902582-race"
}