{
  "title": "A Realidade Imutável: Brazilian Science Fiction",
  "description": "Para cada realidade compartilhada, que se transforma o tempo todo, existe uma outra, inalterável. A Realidade Imutável é uma novela futurista ambientada em Cape Town, capital sul-africana, finalista do prêmio Coerência de Literatura e publicada de forma independente com a Editora Villa-Lobos.Com uma ambientação pesada, quase remetendo a um distópico invernal, Dêner B. Lopes traz em destaque os conceitos de realidades paralelas, viagem no tempo e imersão em um Metaverso já estabelecido, onde grande parte da população desfruta de seu tempo livre no presente em um jogo de mundo aberto conhecido como Terra.Através de um capacete e ondas sonoras, os jogadores são transportados para o mundo virtual incorporando a realidade de seus avatares.\"Terra é nosso entretenimento. Seus programas de tevê e rádio são mais engraçados e suas redes sociais e smartphones, viciantes para quem curte um estilo clássico-tecnológico. O jogo, que segue um estilo viagem-no-tempo-sem-viagem-no-tempo, se limita somente aos acontecimentos que de fato aconteceram na Terra (uma representação fiel do passado) ...\"Ned vive com a mãe Mia no presente (século 24), e sozinho em Terra, no ano de 2019, na pele de seu avatar Edgar, que apesar da vida simples de um jovem trabalhador de shopping, também vive seus dilemas, e vem escrevendo um livro secreto.\"\n(...) um estalo em minha mente e se eu escrevesse a verdade em ficção para essa realidade falsa, mas bem arquitetada da qual estava?...\n \"Certa noite de ócio, com o desejo de viver a presença de seu mundo primeiro, Ned resolve passear a esmo pelas ruas e se depara com Zifa, um colega de escola.\"Ele me olha por alguns segundos, talvez evitando uma despedida, hesita o mesmo tempo e finaliza com 'Eu estou indo para o Te'-Cave, na festa de uma amiga. Até me deixaram levar algum amigo e...', ele sorriu sem emoção. 'Não queria ir sozinho.'Minha primeira reação é agradecer e recusar o convite, mas de uma maneira quase pessoal Zifa insiste. Sem saber exatamente a razão, mudo de ideia e entro na Bombardier, que tem o outro banco defronte vago.Te-Cave é um bairro subterrâneo que tem como entrada uma rotatória quase perfeita a oeste, seguida de um grande e extenso túnel reto em constante declínio. Não é um lugar sem saída, sua construção se iniciou abaixo da Grande Montanha, e sua outra extremidade acaba em alguma parte do Reservatório Silvermine (um grande lago no meio da formação montanhosa e plana.) Dizem se tratar de uma parte baixa da cidade, que se complementa à própria menção; suja, pervertida, submundana (...)\"Durante essa festa na boate, um choque cara a cara com seu próprio avatar alterará todas as suas estruturas físicas e psicológicas, e mudará para sempre o destino da sua realidade.\"Meus olhos se comprimem para suas costas, e logo em seguida os volto ao normal, comprovativos.Aquele ali é o Edgar.\" E se toda realidade que te cerca não passasse de um jogo? Uma simulação criada por uma tecnologia futurista tão avançada a ponto de criar um mu",
  "genres": [],
  "author": "Dêner B. Lopes",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/61437964-a-realidade-imut-vel"
}