{
  "title": "Mischief, Murder and Merlot",
  "description": "Norrie Ellington gears up for Halloween at Two Witches Winery, where the phrase “wine and spirits” takes on spooky—and deadly—overtones . . .Back at Two Witches Winery for a short stay, Norrie Ellington is warming to the holiday spirit and the upcoming Hallow Wine Weekend, and she’s happy to steer clear of the writer from Wine Enthusiast magazine who’s come to do interviews about this year’s spectacular Merlot. But then the critic’s dead body is found slumped over a Halloween cauldron display, and despite a stern warning from the local deputy to keep her nose out of it, Norrie instantly switches into sleuth mode. Intent on discovering why someone wanted to silence the victim, Norrie quickly learns that he was an unbearable snob and known womanizer who had no shortage of enemies. But as one suspect after another leads to a dead end, Norrie’s stumped—until the one mysterious clue that’s been haunting her turns the case around. Now, as all the ghouls, goblins, and trick-or-treaters come out on Halloween, Norrie’s ready to unleash her spirit of justice—she just has to close in on the killer before the Grim Reaper closes in on her . . .\nPraise for the Books of J. C. \n“Engaging characters and a stirring mystery kept me captivated from the first page to the last.” —Dollycas, Amazon Vine Voice, on Divide and Concord  “Well-crafted sleuth, enjoyable supporting characters. This is a series not to be missed.” —Cozy Cat Reviews on Death, Dismay and Rosé“A sparkling addition to the Wine Trail Mystery series. A toast to protagonist Norrie and Two Witches Winery, where the characters shine and the mystery flows. This novel is a perfect blend of suspense and fun!” —Carlene O’Neil, author of the Cypress Cove Mysteries, on Chardonnayed to Rest“A thoroughly entertaining series debut, with enjoyable yet realistic characters and enough plot twists—and dead ends—to appeal from beginning to end.” —Booklist, starred review, on Booked 4 Murder“Enjoy this laugh-out-loud funny mystery that will make you scream for the authors to get busy on the next one.” —Suspense Magazine on Molded 4 MurderAbout the J. C. Eaton is the pen name of husband-and-wife writing team Ann I. Goldfarb and James E. Clapp. They are the authors of the Wine Trail Mysteries, the Sophie Kimball Mysteries, and the Marcie Rayner Mysteries. In addition, Ann has published nine YA time travel mysteries under her own name. You can learn more about Ann and Jim at jceatonmysteries.com, jceatonauthor.com, facebook.com/JCEatonauthor, and timetravelmysteries.com.",
  "genres": [
    "Cozy Mystery",
    "Mystery",
    "Cozy"
  ],
  "author": "J.C. Eaton",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/61435349-mischief-murder-and-merlot"
}