{
  "title": "Second Chances at Brambleberry Creek",
  "description": "Sometimes you need to fall to learn how to fly…A totally addictive, heart-melting novel about the magic of friendship, family and making every day count, even when life takes an unexpected twist. Fans of RaeAnne Thayne, Elin Hilderbrand and Susan Mallery will love this page-turning story.Amber Lee Taylor has lived in the close-knit town of Brambleberry Creek, Kentucky her whole life. And she thought she had everything figured out. But when Amber discovers her long-term fiancé, Grant, has been cheating, her perfect future shatters into tiny pieces…Heartbroken, Amber retreats to her family’s crumbling farmhouse in the stunning countryside outside her little town. It’s her favorite place in the world. She loves the old oak beams and the smell of the fire crackling in the grate. But her family says the farm isn’t making enough money and they need to do something to save it…Determined to forget Grant and save her family home, Amber throws herself into launching a new wine business with her cousins, and stumbles across one of her grandfather’s old notebooks.Just as she realizes the size of her project, she discovers a family mystery weaving through her grandfather’s writing, and everything suddenly seems more complicated. But then, she hasn’t thought about Grant in days, and when she bumps into handsome, charming Callum on Main Street, Amber starts to wonder if breaking up with Grant could be the best thing that’s happened to her in years.It feels good to spend time with a guy with such a kind and genuine heart, and as he helps her untangle the notebook’s secrets, she wonders if the key to the mystery might just be the key to saving her beloved farmhouse too.But will Amber find the strength to make the most of her second chance? Or will crossing paths with Grant change everything again?",
  "genres": [
    "Contemporary",
    "Romance"
  ],
  "author": "Elizabeth Bromke",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/61423531-second-chances-at-brambleberry-creek"
}