{
  "title": "Once More with Feeling",
  "description": "Then. Katee Rose is living the dream as America's number one pop star, caught in a whirlwind of sold-out concerts, screaming fans, and constant tabloid coverage. Everyone wants to know everything about her and her boyfriend, Ryan LaNeve, the hottest member of adored boy band CrushZone. Katee loves to perform but hates the impossible demands of stardom. Maybe that's why she finds herself in the arms of another CrushZone member, Cal Kirby. Quiet, serious Cal, who's always been a good friend to Katee, is suddenly Cal with the smoldering eyes and very good hands. One unforgettable night is all it takes to blow up Katee's relationship with Ryan, her career, her whole life...Now. Kathleen Rosenberg is okay with her ordinary existence, and leaving her pop star image in the past. That is, until Cal Kirby shows up with the opportunity of her dreams--a starring role in the Broadway show he's directing and a chance to perform the way she's always wanted. The two haven't spoken since the joint destruction of their careers, and each of them blames the other, making their reunion a tense battle of wits and egos. Katee reluctantly agrees to the musical, as long as she keeps her guard up around Cal. But rehearsals are long, those eyes still smolder, and those hands are still very good. Despite everything, Katee can't deny the chemistry between them. Is it ever a good idea to reignite old flames? Especially if you've been burned in the past?A former pop star finds herself back in the spotlight--along with an old flame from her past--in this \"friends to lovers\" meets \"enemies to lovers\" romance from the bestselling author of Funny You Should Ask, the sensational Tik Tok romance!",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Adult",
    "Second Chance"
  ],
  "author": "Elissa Sussman",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/61420112-once-more-with-feeling"
}