{
  "title": "Class Action: The Landmark Case that Changed Sexual Harassment Law",
  "description": "\"This riveting, assiduously well-reported account follows the tortuous class-action lawsuit that redefined sexual-harassment law.... Class Action is a useful reminder of the emotional and psychological cost of waging even the most successful -- and justified -- lawsuits.\"In the tradition of A Civil Action and Erin Brockovitch, Class Action is a story of intrigue and injustice as dramatic as fiction but all the more poignant because it is true.In the coldest reaches of northern Minnesota, a group of women endured a shocking degree of sexual harassment–until one of them stepped forward and sued the company that had turned a blind eye to their pleas for help. Jenson vs. Eveleth Mines, the first sexual harassment class action in America, permanently changed the legal landscape as well as the lives of the women who fought the battle.In 1975, Lois Jenson, a single mother on welfare, heard that the local iron mine was now hiring women. The hours were grueling, but the pay was astonishing, and Jenson didn't think twice before accepting a job cleaning viscous soot from enormous grinding machines. What she hadn't considered was that she was now entering a male-dominated, hard-drinking society that firmly believed that women belonged at home–a sentiment quickly born out in the relentless, brutal harassment of every woman who worked at the mine. When a group of men whistled at her walking into the plant, she didn't think much of it; when they began yelling obscenities at her, she was resilient; when one of them began stalking her, she got mad; when the mining company was unwilling to come to her defense, she got even.From Jenson's first day on the job, through three intensely humiliating trials, to the emotional day of the settlement, it would take Jenson twenty-five years and most of her physical and mental health to fight the battle with the mining company. But with the support of other women miners like union official Patricia Kosmach and her luck at finding perhaps the finest legal team for class action law, Jenson would eventually prevail.Clara Bingham and Laura Leedy Gansler take readers on a fascinating, page-turning journey, the roller-coaster ride that became Jenson vs. Eveleth and show us that Class Action is not just one woman's story, it's every woman's legacy.",
  "genres": [
    "Nonfiction",
    "History",
    "Law",
    "Feminism",
    "Historical",
    "True Crime",
    "Audiobook"
  ],
  "author": "Clara Bingham",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/614582.Class_Action"
}