{
  "title": "The Steel Breakfast Era: The Decadent Return of the Hi-Fi Queen and Her Embryonic Reptile Infection",
  "description": "THE STEEL BREAKFAST ERA by Carlton Mellick III (w/ tattoos by Pooch) A nightmarishly absurd story that is like Re-Animator meets Naked Lunch during the zombie apocalypse. The living dead conquered the Earth almost a century ago, leaving only small isolated communities of survivors spread across the shattered-earwig landscape. One such community has been locked away in a New York City high-rise. Breeding like cockroaches for many generations, their civilization has almost completely deteriorated into a mess of insane ones and those infested with parasites that mutate flesh into steel-string sculptures. There is nothing to live for, no chance for hope. Except for one man, not yet effected by the parasites, who finds hope after he creates a wife out of the human body parts that litter the hallways and gets rescued by a group of zombie-shredding warriors from Japan (where the citizens have evolved into anime-like mechazoid characters). This tattoo-illustrated avant-garde novel is cult author Carlton Mellick III at his darkest and most horrific. THE DECADENT RETURN OF THE HI-FI QUEEN AND HER EMBRYONIC REPTILE INFECTION by Simon Logan The Hi-Fi Queen is resurrected after almost being killed in an ambush by another gang and rises once more to claim back the territory that was once hers. Set in a world of constant gang warfare and corporate subterfuge, she must first re-brand herself then assemble a new crew to help her in her fight. Pirate radio broadcasters, graffiti artists, black-marketing men and skaters alike are all caught up in her quest for revenge, for not only must the gang be strong ... but it must have a proper marketing campaign to match. In HI-FI QUEEN, Logan takes us deeper into his world of industrial-style fiction, expanding upon the grounding set forth in his highly successful underground hit I-O and bringing it to another level with threads of dark, bleak humour.",
  "genres": [
    "Bizarro Fiction",
    "Zombies",
    "Horror",
    "Fiction",
    "Cyberpunk",
    "Science Fiction"
  ],
  "author": "Carlton Mellick III",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/614471.The_Steel_Breakfast_Era"
}