{
  "title": "The Maid's Secret",
  "description": "Czechoslovakia, 1940: “We will always have our memories,” he says, as the soldiers pull him away. “You will survive this. You are braver than you know. Remember that, always.” This heartbreaking World War Two page-turner shows that love is more powerful than hatred, bravery can overcome evil, and hope is stronger than darkness.In the middle of the night, while I am curled in Ben’s arms, there is a harsh knock on the door. My blood turns to ice. The love of my life is Jewish, and I am a Romany gypsy maid; every second that we exist in Hitler’s Europe, we are in danger. Every day, we have been huddling around a crackling radio, listening for news of this evil war. Every night, we have feared we won’t live till dawn.The banging continues, and we leap out of bed. I can hardly breathe as I open the door, seeing Nazis standing before us. My heart cracks as the soldiers grab Ben. I’m powerless to stop them from shoving him into a wagon, bound for the place of no return.The love of my life is now imprisoned in wire with thousands of other innocent inmates. For every moment he is trapped behind the gates of hell, he gets closer to death—surviving on scraps of food, and forced to work in gruelling conditions.The soldiers haven’t arrested me yet, but it’s only a matter of time. I vow to stay alive for Ben, not to give up hope. I’ll stop at nothing to escape the enemy as they hunt me down.With our fate in the hands of monsters, will we ever see each other again? And will our love for one another save us—or kill us?Fans of Fiona Valpy, The Tattooist of Auschwitz and The Book of Lost Names will be utterly glued to this heart-wrenching and utterly gripping World War Two novel which shows that, if you have love, you can survive anything…",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "War",
    "Historical",
    "World War II",
    "Romance",
    "Amazon"
  ],
  "author": "Shari J. Ryan",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/61440213-the-maid-s-secret"
}