{
  "title": "Mirror Mirror...Am I Beautiful?: Looking Deeper to Find Your True Beauty",
  "description": "Does the mirror define your beauty and who you are? Are you desperately striving for the world's \"perfect image\" of outer beauty? Or have you given up trying, realizing you'll never be \"good enough?\"It's time to look deeper, past the surface. It's time to find your true beauty!Get practical, real-life, biblical advice for the issues you deal with every day...Body Image. Beauty. Fashion. Sex. Dating. Self Esteem. Relationships.Will you dare to look deeper?If you do, you will find that there is so much more. More than what your mirror has for you. More than what Hollywood and the media has for you. More than what any guy can give you.When you look deeper, you'll find true satisfaction, true beauty and true intimacy waiting for you. Jesus is inviting you to take this journey with Him.Will you accept?What People Are Saying...\"Mirror, Am I Beautiful?\" by Shelley Hitz is one of the best books I have read this year , and I am not just saying that because I am writing a review about it either! Not only is this book enjoyable to read, but it is also easy to read. I am encouraged by this book. It is refreshing to read a book that speaks about things I have struggled with, such as self-esteem and confidence with who God made me to be.  It can be so easy to fall into the trap the devil sets for us, to try and steal our joy by getting us to focus our attention on our outward appearance, instead of on our inward appearance, where it really matters.In her book Shelley Hitz does a great job of helping girls overcome their self-esteem issues by leading them to the Word of God.   I encourage every girl who reads this to read \"Mirror, Am I Beautiful?\" by Shelley Hitz.   You will be encouraged!\"--Mardi Robyn, author of isthismodest.com",
  "genres": [
    "Christian",
    "Self Help"
  ],
  "author": "Shelley Hitz",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/6147291-mirror-mirror-am-i-beautiful"
}