{
  "title": "Psychoanalytic Diagnosis: Understanding Personality Structure in the Clinical Process",
  "description": "This is the first text to come along in many years that makes psychoanalytic personality theory and its implications for practice accessible to beginning practitioners. The last book of its kind, which was published more than 20 years ago, predated the development of such significant concepts as borderline syndromes, narcissistic pathology, dissociative disorders and self-defeating personality.Contemporary students often react with bewilderment to the language of pioneering analysts like Reich and Fenichel and, since 1980, the various volumes of the Diagnostic and Statistical Manual of Mental Disorders (DSM) have reflected an empirical-descriptive orientation that deliberately eschews psychodynamic assumptions. Consequently, today's therapist in training may have little exposure to the rich clinical and theoretical history behind each disorder mentioned in DSM; to psychoanalytic expertise with widely recognized character patterns not mentioned in DSM, such as depressive and hypomanic psychologies, high-functioning schizoid personalities, and hysterical personalities; or to a comprehensive, theoretically sophisticated rationale that links assessment to treatment.Filling the need for a text that clearly lays out the conceptual heritage that psychoanalytic practitioners take for granted, this important new volume explicates the major clinically important character types and suggests how an appreciation of the patients' individual personality structure should influence the therapist's focus and style of intervention. Dispensing with the dense jargon that often discourages people from learning, Nancy McWilliams writes in a lucid, personal manner that demystifies psychodynamic theory and practice. Innumerable clinical vignettes are presented with humor, candor, and compassion, bringing abstract concepts to life.Comprehensive in scope, Psychoanalytic Diagnosis will be valued by seasoned clinicians and students alike. Psychodynamically oriented readers will find it an excellent introduction to psychoanalytic diagnostic thinking. For those identified with other approaches, it will foster psychoanalytic literacy, providing them with the capacity to better understand the approaches of their analytically oriented colleagues.",
  "genres": [
    "Psychology",
    "Psychoanalysis",
    "Nonfiction",
    "Psychiatry",
    "Mental Health",
    "Science",
    "Counselling"
  ],
  "author": "Nancy McWilliams",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/614694.Psychoanalytic_Diagnosis"
}