{
  "title": "Crystal Basics Pocket Encyclopedia: The Energetic, Healing, and Spiritual Power of 450 Gemstones",
  "description": "A full-color pocket reference guide to the healing properties of crystals• Presents an A-to-Z compendium of the physical, psychological, and spiritual healing properties of 450 crystals, rocks, minerals, and fossils• Each entry features a color photo of the stone and defines its physical, emotional, and metaphysical properties and its corresponding chakra, element, planet, and zodiac sign• Explores the basics of crystal healing, including how to select, charge, and program stones, safe and effective cleansing methods, and hands-on healing techniques and practicesIn this pocket reference, Nicholas Pearson offers a quick-start guide for working with crystals as well as a full-color A-to-Z compendium of the healing properties of 450 crystals, rocks, minerals, and fossils.Covering the basics of crystal healing, Pearson explores why crystals work, how to select stones, safe and effective cleansing methods, and hands-on techniques and practices to harness the power of rocks and gems to transform your life. He also looks at how to charge crystals and program them for specific purposes, and he examines crystal correspondences with planetary, astrological, and elemental energies.The encyclopedia of crystals includes familiar ones like agate, calcite, rose quartz, and hematite as well as rarer and more unusual crystals, such as phenakite, cavansite, and yooperlite—some of which have never before appeared in print. Each entry features a beautiful color photo of the stone and defines its physical, psychological, and spiritual healing properties and its corresponding chakra, element, planet, and zodiac sign. The author also looks at the geological nature of each stone, such as its hardness and crystal structure, enabling you to explore the connections between mineral science and the metaphysics of crystal healing.",
  "genres": [],
  "author": "Nicholas Pearson",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/61485842-crystal-basics-pocket-encyclopedia"
}