{
  "title": "Notwendige Streitgenossen",
  "description": "Lieber Herr Miggel,Streitgenossen habe ich genossen über den 1. Mai, sehr gut wie Familienumfeld und Charakter zusammen kommen, die Rivalitäten innerhalb und zwischen den Kanzleien, die Komik der präzisen Erfassung der steuerlichen Problematik des Lösegeldes, alles um nur nicht auf den Punkt zu kommen, glaubhaft wie größte jurisitische Rationalität bemüht wird um höchste Irratonalität anzugehen. Das steigert sich alles schön bis zur Mitte, dann treten die Streitgenossen und mit ihnen die Story auf der Stelle. Auch das überraschende Ende ist nicht ganz so überraschend, man hat irgendso eine zweite ebene erwartet, wenn auch nicht diese.Das schwächt den pay-off (Hornberger Schiessen). Sicher gute Vorlage für einen TV Krimi/Gesellschaftsdrama, allerdings in USA eher als bei uns; ich höre die Anwaltsserien haben hier wenig Zuspruch, bin da ber kein Spezialist.Jedenfalls eine empfehlenswerte Lektüre.KomplimentIhrVolker SchlöndorffIt only seems to start Theo Lindner, an internationally active law firm partner and father, an ordinary working day: In an unexpected meeting scheduled, he learns that his colleague Joachim Peters has been the victim of a kidnapping - the 20 million euro ransom to the members of the Board of their private pay. Within the firm a thrilling tug of war starts at the adequate handling of the emergency, on the one hand, anyone can associate a potential victim of the kidnap victims to identify the other hand, see all their material well-being threatened for years to come. The situation is alarming and, as encrypted, the second sign of life references to Peters' whereabouts, and he seems to contain Theo Lindner, with whom he privately nothing extraordinary, explicitly send out greetings. A breathtaking, exciting thriller in the legal environment, authentic and psychologically brilliant.Nur scheinbar beginnt für Theo Lindner, Partner einer international agierenden Anwaltskanzlei und Familienvater, ein ganz normaler Arbeitstag in Berlin: In einer unvorhergesehen anberaumten Sitzung erfährt er, dass sein Kollege Joachim Peters Opfer einer Entführung geworden ist – die 25 Millionen DM Lösegeld sollen die Mitglieder der Sozietät aus ihrem Privatvermögen berappen. Innerhalb der Sozietät beginnt ein nervenaufreibendes Tauziehen um den adäquaten Umgang mit der Notlage, denn einerseits kann sich jeder Teilhaber als potenzielles Opfer mit dem Entführten identifizieren, andererseits empfinden alle ihr materielles Wohlergehen auf Jahre hinaus bedroht.Die Lage spitzt sich zu, als das zweite Lebenszeichen verschlüsselte Hinweise auf Peters’ Aufenthaltsort zu enthalten scheint und er Theo Lindner, mit dem ihn privat nichts außergewöhnlich verbindet, explizit Grüße zukommen lässt …Ein atemberaubend spannender Krimi im Juristen-Milieu, authentisch und psychologisch brillant.",
  "genres": [
    "Crime",
    "Fiction"
  ],
  "author": "Georg Miggel",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/6150382-notwendige-streitgenossen"
}