{
  "title": "Revenge of the Wrought-Iron Flamingos",
  "description": "Every year, Yorktown, Virginia, relives its role in the Revolutionary War by celebrating the anniversary of the British surrender in 1781. This year, plans include a re-enactment of the original battle and a colonial craft fair. Meg Langslow has returned to her home town for the festivities--and to sell her wrought-iron works of art. Except, of course, for the pink-painted flamingos she reluctantly made for her mother's best friend--she's hoping to deliver them secretly, so she won't get a reputation as \"the blacksmith who makes those cute wrought-iron flamingos.\"Besides, she has taken on another responsibility--making sure none of her fellow crafters ruin the historical authenticity of the fair with forbidden modern devices--like wrist watches, calculators, or cell phones. She's only doing it to keep peace with the mother of the man she loves. And Michael himself will don the white-and-gold uniform of a French officer for the re-enactment--what actor could resist a role like that?Meg's also trying to keep her father from scaring too many tourists with his impersonation of an 18th century physician. And to prevent a snooping reporter from publishing any stories about local scandals. Not to mention saving her naive brother, Rob, from the clutches of a con man who might steal the computer game he has invented. It's a tough job--at least, until the swindler is found dead, slain in Meg's booth with one of her own wrought-iron creations.Now Meg must add another item to her already lengthy to do list: \"Don't forget to solve the murder!\"Fortunately, the more trouble Meg faces, the more fun the reader will have--and Meg faces plenty of trouble in this lighthearted and funny novel.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Humor",
    "Cozy",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Donna Andrews",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/615408.Revenge_of_the_Wrought_Iron_Flamingos"
}