{
  "title": "Der Schattengänger",
  "description": "Ich liebe dich …Ich brauche dich …Ich werde dich kriegen!Jettes Mutter, die Bestsellerautorin Imke Thalheim, wird von einem Stalker verfolgt, der besessen von ihren Krimis ist. Er schreibt ihr Briefe, terrorisiert sie mit Telefonanrufen und bricht schließlich in ihr Haus ein. Als sie sich ihm entzieht und für ihn unauffindbar ist, sucht er die Nähe zu Jette und gewinnt deren Vertrauen. Jette ahnt nicht, dass sie sich damit in tödliche Gefahr begibt …Jettes Mutter wird von einem Stalker verfolgt. Ein Unbekannter ist besessen, zunächst von den Romanen der Bestsellerautorin, dann zunehmend von ihr als Person. Seine Grenzüberschreitungen steigern sich immer mehr: Hatte Imke Thalheim zunächst Briefe von dem Fremden erhalten, verfolgt er sie jetzt wie ein Schatten, und er terrorisiert sie mit Telefonanrufen. Eines Tages dringt der unheimliche Unbekannte sogar in ihr Haus ein und verteilt in ihrem Arbeitszimmer rote Blütenblätter verteilt, auf denen kleine Zettel mit einem einzigen Wort gepint sind: \"Du\". Auf Anraten von Kommissar Melzig und Imkes Lebensgefährten Tilo packt sie schließlich heimlich die Koffer und reist in ein Hotel im Sauerland, wo sie an ihrem neuen Roman arbeitet. Jette hingegen schwebt auf Wolke Sieben: Sie und Merle haben ihr Traumdomizil gefunden – einen alten, renovierungsbedürftigen Bauernhof am Rande der Stadt. Und nicht nur das: Zum ersten Mal seit den schrecklichen Ereignissen um den Tod ihrer Freundin Caro hat sich Jette verliebt, und zwar in Luke, der bei der Maklerin jobbt, über die sie das Häuschen gefunden haben. Schmetterlingsgefühle breiten sich in Jette aus. Leise Zweifel an Luke, der mit allem Persönlichen hinter dem Berg hält und sich so gar nicht einfangen lassen mag, versucht sie zu verdrängen.Dann aber holt die Wirklichkeit sie ein: Der Stalker hat inzwischen erkannt, dass Imke Thalheim sich ihm entzogen hat. Er bricht erneut in ihr Haus ein und tötet dabei die zufällig anwesende Putzfrau. Jette findet die Ermordete noch am selben Tag, als sie alte Umzugskisten bei ihrer Mutter holen will. Die Polizei beginnt zu ermitteln und warnt Jette: Der Stalker ist hoch gefährlich und könnte auch sie bereits im Visier haben …",
  "genres": [
    "Thriller",
    "Young Adult",
    "German Literature",
    "Crime",
    "Contemporary",
    "Mystery",
    "Fiction"
  ],
  "author": "Monika Feth",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/6150252-der-schatteng-nger"
}