{
  "title": "A Mediterranean Feast: The Story Of The Birth Of The Celebrated Cuisines Of The Mediterranean:  From The Merchants Of Venice To The Barbary Corsairs",
  "description": "A groundbreaking culinary work of extraordinary depth and scope that spans more than one thousand years of history, A Mediterranean Feast tells the sweeping story of the birth of the venerated and diverse cuisines of the Mediterranean. Author Clifford A. Wright weaves together historical and culinary strands from Moorish Spain to North Africa, from coastal France to the Balearic Islands, from Sicily and the kingdoms of Italy to Greece, the Balkan coast, Turkey, and the Near East.The evolution of these cuisines is not simply the story of farming, herding, and fishing; rather, the story encompasses wars and plagues, political intrigue and pirates, the Silk Road and the discovery of the New World, the rise of capitalism and the birth of city-states, the Crusades and the Spanish Inquisition, and the obsession with spices. The ebb and flow of empires, the movement of populations from country to city, and religion have all played a determining role in making each of these cuisines unique.In A Mediterranean Feast, Wright also shows how the cuisines of the Mediterranean have been indelibly stamped with the uncompromising geography and climate of the area and a past marked by both unrelenting poverty and outrageous wealth. The book's more than five hundred contemporary recipes (which have been adapted for today's kitchen) are the end point of centuries of evolution and show the full range of culinary ingenuity and indulgence, from the peasant kitchen to the merchant pantry. They also illustrate the migration of local culinary predilections, tastes for food and methods of preparation carried from home to new lands and back by conquerors, seafarers, soldiers, merchants, and religious pilgrims.A Mediterranean Feast includes fourteen original maps of the contemporary and historical Mediterranean, a guide to the Mediterranean pantry, food products resources, a complete bibliography, and a recipe and general index, in addition to a pronunciation key. An astonishing accomplishment of culinary and historical research and detective work in eight languages, A Mediterranean Feast is required--and intriguing--reading for any cook, armchair or otherwise.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "History",
    "Food History",
    "Nonfiction",
    "Culinary"
  ],
  "author": "Clifford A. Wright",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/615320.A_Mediterranean_Feast"
}