{
  "title": "Hacia la paz perpetua: un esbozo filosófico",
  "description": "Poco después de firmada la Paz de Basilea entre la nueva República Francesa y el Reino de Prusia vio la luz, en 1795, una de las obras más famosas de Kant, Hacia la paz perpetua, que puede y debe ser asumida como obra de culminación en la que se dan cita todas las preocupaciones filosóficas del último Kant. Preocupaciones q ue encuentran su espacio idóneo de ejercicio en la filosofía de la historia, en la filosofía del derecho, en la filosofía moral, en la filosofía política y en la antropología, singularmente pesimista, que tanto cultivó en el último período productivo de su vida. Por eso Hacia la paz perpetua, que ostenta, con buscada ironía, la estructura formal de un tratado diplomático, es algo más, aun siéndolo de modo eminente, que la razonada propuesta del «estado de un derecho público». Hacia la paz perpetua es una excelente y concisa introducción al pensamiento kantiano en todas las materias arriba citadas.Zum ewigen Frieden. Ein philosophischer Entwurf (Königsberg: Friedrich Nicolovius, 1795), 104 pp. 2nd expanded edition (Königsberg: Nicolovius, 1796), 112 pp. [Ak. 8:343-86] “Toward Perpetual Peace: A Philosophical Project.” Translated by Ted Humphrey in Immanuel Kant, Perpetual Peace and Other Essays (Indianapolis: Hackett, 1983), pp. 107-39. Translated by H. B. Nisbet in Immanuel Kant, Political Writings, edited by Hans Reiss, 2nd ed. (Cambridge: Cambridge University Press, 1991), pp. 93-130. Translated by Mary J. Gregor in Immanuel Kant, Practical Philosophy, edited by Mary J. Gregor (Cambridge: Cambridge University Press, 1996), pp. 317-51.Written in approval of the signing of the Treaty of Basel, which promised the survival of the French Revolution.",
  "genres": [
    "Philosophy",
    "Politics",
    "Nonfiction",
    "Classics",
    "School",
    "German Literature",
    "Essays"
  ],
  "author": "Immanuel Kant",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/6162698-hacia-la-paz-perpetua"
}