{
  "title": "Path of Blood: The Rise and Conquests of Mzilikazi, Founder of the Matabele Tribe of Southern Africa",
  "description": "This is a PRE-ISBN edition.The story of MZILIKAZI, founder of the MATABELE empire.Mzilikazi, of the Northern KHUMALO, deserted King SHAKA and with his people, and after many years of warfare and disruption, settled in what is now Southern ZIMBABWE.MZILIKAZI rivals King SHAKA as a military genius and leader of his people and this book is a must for anyone wishing to understand the turbulent times of King SHAKA'S rule.Mzilikazi (ca. 1795-1868) was a southern African warrior leader who, after being driven out of his homeland, created the Ndebele, or Matabele, kingdom.A younger son of the Kumalo chieftain Mashobane, Mzilikazi spent his early life in the north of what was later to become the Zulu kingdom. During his young manhood, the Kumalo were victims of a power struggle between the Zulu chief, Shaka, and the Ndwandwe chief, Zwide. The latter, Mzilikazi's maternal grandfather, had Mashobane killed, but Mzilikazi, who was elevated to the vacant Kumalo chieftainship, identified his interests with the rising star of Shaka.Although Shaka's program of conquest and expansion commonly involved the elimination of members of former chiefly houses, Mzilikazi received specially favored treatment and seems to have been left, after the destruction of the Ndwandwe (ca. 1818), with the authority of a territorial subchief on the northern marches of the new Zulu kingdom.In 1823, after endangering his position by refusing to surrender to Shaka certain cattle captured in a raid, Mzilikazi fled Zululand. With a few hundred warriors he began a career of conquest that contributed to the Difaqane, a violent upheaval among the South African chiefdoms of the interior, which produced political consolidation in certain areas but left much of the central plateau practically uninhabited.Shifting westward, in stages, across the Transvaal, Mzilikazi eventually settled at Mosega on the Marico River. These moves gave him greater geographical security and enhanced his power. By piecemeal conquest and absorption of Transvaal Sotho groups and by incorporating Nguni refugees from Zululand, his Ndebele state became the dominant power on the \"highveld,\" with an army trained and regimented on the Zulu pattern.In 1836 Mzilikazi was faced by Trekkers (immigrant Boers, or Afrikaners, from the Cape) seeking lands beyond the area of British control. Although he was by no means ill-disposed toward whites and developed a close friendship with the missionary Robert Moffat, Mzilikazi determined to repulse these uninvited intruders. However, firearms gave the Trekkers and their black supporters an advantage that was ultimately decisive. In January 1837 Mosega was sacked, and in a 9-day battle in November Mzilikazi's warriors were defeated.An epic journey followed in which the Ndebele made their way northward in two contingents and at last established a new \"Matabeleland\" beyond the Limpopo. Here, in a portion of the former Rozwi empire, Mzilikazi's Nguni followers and their Sotho adherents superimposed themselves on Shona people and built a military monarchy based on a caste system that only slowly lost its definition.Mzilikazi is commonly remembered as a marauder who left a trail of devastation in his wake, but his achievement was also a constructive one. Although the Ndebele state collapsed less than 30 years after his death under the tide of white advance, one of the praise-names by which the \"Matabele\" of Rhodesia remember him is Umdabuli we Sizwe, the Maker of the Nation.",
  "genres": [
    "History",
    "Africa",
    "Chad"
  ],
  "author": "Peter Becker",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6158566-path-of-blood"
}