{
  "title": "Runner's Moon Trilogy Megabook Series",
  "description": "THREE COMPLETE NOVELS, ONE MEGABOOK SERIES LOW PRICE! The entire Bestselling erotic romance - science fiction trilogy from author Linda Mooney, which includes:Runner-s Moon: Jebaral: He was one of thirty-one aliens who had landed on this remote world and dispersed among the populace, unidentifiable because of their shape-shifting abilities. Jebaral had hoped for a life. A chance to be free after escaping years of slavery and cruelty. But when he met Hannah Pitt, there was no way he could turn away from her or from the feelings she evoked in him. But neither could he accept her offer of a future filled with laughter and promise. After all, she was human; he was nothing remotely human. Worse, the Arra were out looking for their lost cargo and they wouldn't stop until everybody was accounted for. Could he risk loving this woman? Would she even accept him for what he truly was? Little did he realize that all his choices would soon be taken away.Runner-s Moon: Tiron: Nearly six years ago they landed on Earth--thirty-one aliens, fugitives from a lifetime of slavery and cruelty. Now they were dispersed among the populace, unidentifiable because of their shape-shifting abilities. Tiron had found sanctuary in Crescent City as -Roni.- But her own self-hatred, beaten into her at the hands of the Arra, had her earning her living as a common street prostitute.Lieutenant Thom DeGrassi worked vice for the police department. He had busted prostitutes in the past, but nothing had prepared him for what he felt when he met Roni. Worse, there was some sicko out there getting his jollies cutting up hookers. Now DeGrassi was faced with two impossible situations-keeping Roni off the streets while he sorted out his feelings for her, and trying to find the man responsible for the deaths of four other women.Runner-s Moon: Simolif: Seven years ago they landed on Earth-thirty-one aliens, fugitives from a lifetime of slavery and cruelty. Now they were dispersed among the populace, unidentifiable because of their shape-shifting abilities. Simolif knew when his brother Jebaral found his life's mate. The blood lines in his arm had increased by one, and the sight of it had thrilled him like nothing else could...unless he, too, could find someone who could accept him for what he was, and who would not scream in fright to see his true self. He never expected to find Professor Sarah Drumman. As an astronomer, she suspected there were creatures from another galaxy now walking the Earth. And she planned to prove her theory to the world. Their meeting would forever change their lives. Too bad hers meant nothing to the creatures who had landed on Earth looking for their missing cargo. GET THE COMPLETE TRILOGY IN THIS LOW PRICED MEGABOOK SERIES RELEASE! Genre: Erotic Romance / Science FictionRating: Sensual Romance - Sensual (Contains adult content, language, and graphic sex)",
  "genres": [],
  "author": "Linda Mooney",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/6162331-runner-s-moon-trilogy-megabook-series"
}