{
  "title": "Small Joys",
  "description": "An unexpected friendship saves a young man's life in this moving, utterly charming debut about chosen family, the winding road to happiness, and the grace of second chances.Could I one day inspire happiness in others, the same way he seemed to do in me?It's 2005 and Harley has dropped out of college to move home, back to rural England, where he works a dead-end job at a movie theater. Estranged from his father and finding every attempt at happiness futile, Harley is on the verge of making a devastating final decision. Fortunately for him, things don't go according to plan, and his attempt on his own life is interrupted by his new roommate, Muddy.Muddy is everything Harley is not: ostensibly heterosexual, freewheeling, confident in his masculinity. Despite their differences, a deep friendship blossoms between them when Muddy takes Harley under his wing and shows him everything that, in his eyes, makes life worth living: bird-watching, karaoke, rugby, and the band Oasis.But this newfound friendship is complicated. It has enormous repercussions for the pair's romantically entangled friend group--for Chelsea, an overbearing striver whose generosity they begrudgingly rely on; for Finlay, her raffish and uncouth boyfriend; and for Noria, who despite her simmering confidence is smarting from a series of unreturned affections. And then there's the violent affair with an older man that Harley finds himself slipping back into . . .As secrets and jealousies endanger all that Harley has come to depend on, he finds himself faltering once again, even though he finally has something--and someone--to live for. Soul-stirring and witty, full of hope and peopled with characters who feel like close friends, Small Joys explores a young man's turbulent journey toward happiness and announces the arrival of an exciting voice in fiction.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Contemporary",
    "Literary Fiction",
    "Mental Health",
    "Gay"
  ],
  "author": "Elvin James Mensah",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/61612872-small-joys"
}