{
  "title": "Black Earth Wisdom: Soulful Conversations with Black Environmentalists",
  "description": "A soulful collection of illuminating essays and interviews that explore Black people’s spiritual and scientific connection to the land, waters, and climate, curated by the acclaimed author of Farming While BlackAuthor of Farming While Black and co-founder of Soul Fire Farm, Leah Penniman reminds us that ecological humility is an intrinsic part of Black cultural heritage. While racial capitalism has attempted to sever our connection to the sacred earth for 400 years, Black people have long seen the land and water as family and understood the intrinsic value of nature.This thought-provoking anthology brings together today’s most respected and influential Black environmentalist voices —leaders who have cultivated the skill of listening to the Earth —to share the lessons they have learned. These varied and distinguished experts include Pulitzer Prize and National Book Award-winning author Alice Walker; the first Queen Mother and official spokesperson for the Gullah/Geechee Nation, Queen Quet; marine biologist, policy expert, and founder and president of Ocean Collectiv, Dr. Ayana Elizabeth Johnson; and the Executive Director of the North Carolina Association of Black Lawyers, Land Loss Prevention Project, Savi Horne. In Black Earth Wisdom, they address the essential connection between nature and our survival and how runaway consumption and corporate insatiability are harming the earth and every facet of American society, engendering racial violence, food apartheid, and climate injustice.Those whose skin is the color of soil are reviving their ancestral and ancient practice of listening to the earth for guidance. Penniman makes clear that the fight for racial and environmental justice demands that people put our planet first and defer to nature as our ultimate teacher.Contributors Alice Walker • adrienne maree brown • Dr. Ross Gay • Dr. Ayana Elizabeth Johnson • Rue Mapp • Dr. Carolyn Finney • Audrey Peterman • Awise Agbaye Wande Abimbola • Ibrahim Abdul-Matin • Kendra Pierre-Louis • Latria Graham • Dr. Lauret Savoy •Ira Wallace • Savi Horne • Dr. Claudia Ford • Dr. J. Drew Lanham • Dr. Leni Sorensen • Queen Quet • Toshi Reagon • Yeye Luisah Teish • Yonnette Fleming • Naima Penniman • Angelou Ezeilo • James Edward Mills • Teresa Baker • Pandora Thomas • Toi Scott • Aleya Fraser • Chris Bolden-Newsome • Dr. Joshua Bennett • B. Anderson • Chris Hill • Greg Watson • T. Morgan Dixon • Dr. Dorceta Taylor • Colette Pichon Battle • Dillon Bernard • Sharon Lavigne • Steve Curwood • and Babalawo Enroue Halfkenny",
  "genres": [
    "Nonfiction",
    "Nature",
    "Environment",
    "Science",
    "Social Justice",
    "Ecology",
    "Essays"
  ],
  "author": "Leah Penniman",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/61604799-black-earth-wisdom"
}