{
  "title": "Betsy the Vampire Queen",
  "description": "It's been a helluva year. First I lose my job. Then, I'm in a car accident. Next, I'm waking up dressed in clothes I wouldn't be caught dead in (pink polyester and cheap shoes courtesy of my evil stepmother). But guess what? I am dead and what really bites is that I can't seem to stay dead. Every night, I wake up with a horrible craving. Not chocolate—mom would approve of that. No, all of a sudden my snack choice is blood, and I'm not taking well to a liquid diet.Yep, that's me: Betsy Taylor, a single, unemployed Minneapolis secretary. Taller at six feet than most of the men I meet. Pretty, but so dull my cat runs away three times a month. And now: a vampire. No sooner am I undead, than my stepmonster steals my shoes. My hellishly expensive, to-die-for shoes. What's worse, my new friends have the ridiculous idea that I'm their prophesied vampire queen. I must help them overthrow the baddest vampire lord they've seen in five centuries. Personally, I don't care—until they use a powerful temptation: designer shoes. How can I resist? No more than I can resist Eric Sinclair, the studly but infuriating bloodsucker I call \"sin in a suit.\"Vampire Queen or not, the bills keep coming. And that means getting a job... in the shoe department at Macy's. So man shoes, so little time! Especially when my friends keep after me to do something about all the vampires getting killed in St. Paul. Then my life takes an interesting turn when I find out that I have a long-lost sister who just happens to be the devil's own daughter—destined to rule the world. By Christmastime, all is not merry and bright.Like I said, it's been a helluva year...Includes Undead and Unwed, Undead and Unemployed, Undead and Unappreciated and Undead and Unreturnable.",
  "genres": [
    "Vampires",
    "Fantasy",
    "Paranormal",
    "Paranormal Romance",
    "Urban Fantasy",
    "Fiction",
    "Chick Lit"
  ],
  "author": "MaryJanice Davidson",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/615940.Betsy_the_Vampire_Queen"
}