{
  "title": "The Italian Daughter",
  "description": "Italy, 1946. “Estee, I bought this ring years ago and have kept it safe ever since. You’re the only woman I’ve ever loved.” She reached for Felix’s hand and gently closed it over the box. “No,” she whispered. “I want you to propose only when you’re truly free.”Estee always believed that she would spend her life with her childhood sweetheart Felix. But when her incredible gift for dance gave her the opportunity to move to a big city and provide for her mother, she knew she had to sacrifice her happiness for her family’s future and a chance at a better life.But years later, in a city of over a million people, Felix finds Estee. Due to marry the daughter of a prominent family, he is prepared to sacrifice everything to be with the love of his life. But Estee knows what is at his family’s love and his livelihood could be lost forever if she says yes. Can she really follow her heart if it means him losing everything?London, present Lily clutches a faded piece of paper in her hands, knowing that her life will never be the same again. Whilst grieving for her late father, she is told that her grandmother was born in a home for unmarried mothers, the only clues to her past contained on a handwritten Italian recipe and an old theatre programme.Desperate for answers, Lily accepts a job on an Italian vineyard – a dream her father once shared. Lily receives a warm welcome from the owner’s charming son Antonio and as they chat long into the night, Antonio offers to help her discover her family’s heritage.But arriving in Estee and Felix’s village, Lily unearths a tragic love story which has the power to change her future. As she unravels the truth of her own legacy, she begins to fall for Italy and for Antonio. Can Lily give up everything she has ever known to rebuild her life or will the risk of heartbreak force her home?An utterly enchanting and heartbreaking novel about lost loves, family secrets and enduring hope. Perfect for fans of Santa Montefiore, Lucinda Riley and Victoria Hislop.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Audiobook",
    "Roman",
    "Italy",
    "Historical"
  ],
  "author": "Soraya M. Lane",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/61620506-the-italian-daughter"
}