{
  "title": "Humanly Possible: Seven Hundred Years of Humanist Freethinking, Inquiry, and Hope",
  "description": "The bestselling author of How to Live and At the Existentialist Café explores seven hundred years of writers, thinkers, scientists, and artists, all trying to understand what it means to be truly humanHumanism is an expansive tradition of thought that places shared humanity, cultural vibrancy, and moral responsibility at the center of our lives. The humanistic worldview--as clear-eyed and enlightening as it is kaleidoscopic and richly ambiguous--has inspired people for centuries to make their choices by principles of freethinking, intellectual inquiry, fellow feeling, and optimism.In this sweeping new history, Sarah Bakewell, herself a lifelong humanist, illuminates the very personal, individual, and, well, human matter of humanism and takes readers on a grand intellectual adventure.Voyaging from the literary enthusiasts of the fourteenth century to the secular campaigners of our own time, from Erasmus to Esperanto, from anatomists to agnostics, from Christine de Pizan to Bertrand Russell, and from Voltaire to Zora Neale Hurston, Bakewell brings together extraordinary humanists across history. She explores their immense variety: some sought to promote scientific and rationalist ideas, others put more emphasis on moral living, and still others were concerned with the cultural and literary studies known as \"the humanities.\" Humanly Possible asks not only what brings all these aspects of humanism together but why it has such enduring power, despite opposition from fanatics, mystics, and tyrants.A singular examination of this vital tradition as well as a dazzling contribution to its literature, this is an intoxicating, joyful celebration of the human spirit from one of our most beloved writers. And at a moment when we are all too conscious of the world's divisions, Humanly Possible--brimming with ideas, experiments in living, and respect for the deepest ethical values--serves as a recentering, a call to care for one another, and a reminder that we are all, together, only human.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "History",
    "Biography",
    "Religion",
    "Politics",
    "Audiobook"
  ],
  "author": "Sarah Bakewell",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/61613477-humanly-possible"
}