{
  "title": "Don't Tell Anybody the Secrets I Told You: A Memoir",
  "description": "The iconic singer-songwriter and three-time Grammy winner opens up about her traumatic childhood in the Deep South, her years of being overlooked in the music industry, and the stories that inspired her enduring songs.Lucinda Williams's rise to fame was anything but easy. Raised in a working- class family in the Deep South, she moved from town to town each time her father—a poet, a textbook salesman, a professor, a lover of parties—got a new job, totaling twelve different places by the time she was eighteen. Her mother suffered from severe mental illness and was in and out of hospitals. And when Williams was about a year old she had to have an emergency tracheotomy—an inauspicious start for a singing career. But she was also born a fighter, and she would develop a voice that has captivated millions. In Don't Tell Anybody the Secrets I Told You, Williams takes readers through the events that shaped her music—from performing for family friends in her living room to singing at local high schools and colleges in Mexico City, to recording her first album with Folkway Records and headlining a sold-out show at Radio City Music Hall. She reveals the inspirations for her unforgettable lyrics, including the doomed love affairs with “poets on motorcycles” and the gothic southern landscapes of the many different towns of her youth, including Macon, Lake Charles, Baton Rouge, and New Orleans. Williams spent years working at health food stores and record stores during the day, so she could play her music at night, and faced record companies who told her that her music was “ not finished,” “too country for rock and too rock for country.” But her fighting spirit persevered, leading to a hard-won success that spans seventeen Grammy nominations and a legacy as one of the greatest and most influential songwriters of our time.Raw, intimate, and honest, Don't Tell Anybody the Secrets I Told You is an evocative reflection on an extraordinary woman’s life journey.",
  "genres": [
    "Memoir",
    "Music",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Lucinda Williams",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/61612836-don-t-tell-anybody-the-secrets-i-told-you"
}