{
  "title": "Villain",
  "description": "The Boys meets Starter Villain and Assistant to the Villain in Natalie Zina Walschots’s electrifying, sharp, violent, and hilarious sequel to the highly acclaimed novel, Hench, in which the Auditor must confront the near-impossible in order to right the many wrongs in the superhuman industry…or cause more of them. She’s not picky.Anna, better known to superheroes as the Auditor, has carved out a name for herself. Any hero unlucky enough to cross her path knows her potential and powers. Surely, success should taste she has an incredible job with lots of perks, and her boss will literally annihilate anyone who crosses her, and her greatest enemy, the former hero Supercollider, has been utterly defeated and literally ground to a pulp.But Anna still has her sights set on a greater destroying the Draft, the organization that makes, trains, and manages the world’s most powerful superheroes. These “heroes” have shown time and time again that they do more harm than good, and now is the time to stop the damage at its source.Yet all is not well for the Auditor and her fellow evildoers. Her employer, Leviathan—the world’s most feared supervillain—is not coping well with Supercollider’s defeat at someone else’s hands. Moreover, her unlikely ally and unexpected friend, Quantum Entanglement, has vanished without a trace, leaving Anna to examine all the ways they deceived each other. Tension and uncertainty fill the air, and fear that this moment of triumph is about to crumble looms over all of them.Anna soon finds herself facing down an opponent unlike any she’s taken on before—not another superhero, but someone like her…someone much more the Draft’s Chief Marketing Officer. This isn’t a test of physical prowess, but ideas, and as the fight spirals deeper and deeper, with new foes popping up every day—she’ll need more than just her superpower—data research—to keep ascending through the supervillain ranks.It’s guerrilla ad warfare, and the Auditor might have finally met her match.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Adult",
    "Fiction",
    "Superheroes",
    "Queer",
    "Canada"
  ],
  "author": "Natalie Zina Walschots",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/61659710-villain"
}