{
  "title": "Aladdin's Lamp: How Greek Science Came to Europe Through the Islamic World",
  "description": "Aladdin’s Lamp is the fascinating story of how ancient Greek philosophy and science began in the sixth century B.C. and, during the next millennium, spread across the Greco-Roman world, producing the remarkable discoveries and theories of Thales, Pythagoras, Hippocrates, Plato, Aristotle, Euclid, Archimedes, Galen, Ptolemy, and many others. John Freely explains how, as the Dark Ages shrouded Europe, scholars in medieval Baghdad translated the works of these Greek thinkers into Arabic, spreading their ideas throughout the Islamic world from Central Asia to Spain, with many Muslim scientists, most notably Avicenna, Alhazen, and Averroës, adding their own interpretations to the philosophy and science they had inherited. Freely goes on to show how, beginning in the twelfth century, these texts by Islamic scholars were then translated from Arabic into Latin, sparking the emergence of modern science at the dawn of the Renaissance, which climaxed in the Scientific Revolution of the seventeenth century.Here is early science in all its glory, from Pythagorean “celestial harmony” to the sun-centered planetary theory of Copernicus, who, in 1543, aided by the mathematical methods of medieval Arabic astronomers, revived a concept proposed by the Greek astronomer Aristarchus some eighteen centuries before. When Newton laid the foundations of modern science, building on the work of Copernicus, Tycho Brahe, Kepler, Galileo, and others, he said that he was “standing on the sholders [sic] of Giants,” referring to his predecessors in ancient Greece and in the Arabic and Latin worlds from the Middle Ages through the Renaissance.Caliph Harun al-Rashid was one of the Muslim rulers who first promoted translating Greek texts into Arabic. His Baghdad is the setting for The Thousand and One Nights, in which Scheherazades’s “Tale of Aladdin and His Magic Lamp” reflects the marvels of the new science and the amazing inventions it was said to produce. John Freely’s Aladdin’s Lamp returns us to that time and brings to light an essential and long-overlooked chapter in the history of science.",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "Islam",
    "History Of Science",
    "Philosophy",
    "Religion"
  ],
  "author": "John Freely",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/6163622-aladdin-s-lamp"
}