{
  "title": "By Blood We Live",
  "description": "From Dracula to Buffy the Vampire Slayer, from Castlevania to True Blood, the romance between popular culture and vampires hearkens back to humanity's darkest, deepest fears, flowing through our very blood; fears of death, and life, and insatiable hunger.  And yet, there is an attraction, undeniable, to the vampire archetype, whether the pale European count, impeccably dressed and coldly masculine, yet strangely ambiguous, ready to sink his sharp teeth deep into his victims' necks, draining or converting them, or the vamp, the count's feminine counterpart, villain and victim in one, using her wiles and icy sexuality to corrupt man and woman alike...  Edited and introduced by acclaimed anthologist John Joseph Adams (Wastelands, The Living Dead), By Blood We Live gathers together the best vampire literature from the preceding three decades, authored by many of today's most renowned writers of fantasy, speculative fiction, and horror. \nContents:\n(Author, title (type, year of first publication, beginning page in print edition))01 - Neil Gaiman, Snow, Glass, Apples (short story, 1995, p3)02 - Anne Rice, The Master of Rampling Gate (novelette, 1984, p13)03 - Harry Turtledove, Under St. Peter's (novelette, 2007, p33)04 - Tad Williams, Child of an Ancient City (novelette, 1988, p43)05 - Michael A. Burstein, Lifeblood (novelette, 2003, p75)06 - Barbara Roden, Endless Night (short story, 2008, p88)07 - Garth Nix, Infestation (novelette, 2008, p106)08 - Carrie Vaughn, Life Is the Teacher (short story, 2008, p120)09 - Nancy Kilpatrick, The Vechi Barbat (short story, 2007, p134)10 - Kristine Kathryn Rusch, The Beautiful, The Damned (short story, 1995, p148) 11 - David Wellington, Pinecones (short story, 2006, p161)12 - Norman Partridge, Do Not Hasten to Bid Me Adieu (novelette, 1994, p165)13 - Sergei Lukyanenko, Foxtrot at High Noon (short story, 2008, p180)14 - Michael Marshall Smith, This Is Now (short story, 2004, p189)15 - Nancy Holder, Blood Gothic (short story, 1985, p199)16 - Jane Yolen, Mama Gone (short story, 1991, p204)17 - Joe Hill, Abraham's Boys (short story, 2004, p209)18 - Tanith Lee, Nunc Dimittis (novelette, 1983, p224)19 - Gabriela Lee, Hunger (short story, 2007, p240)20 - Caitlín R. Kiernan, Ode to Edvard Munch (short story, 2006, p250)21 - L.A. Banks, Finders Keepers (short story, 2008, p256)22 - Brian Stableford, After the Stone Age (short story, 2004, p275)23 - Kevin J. Anderson, Much at Stake (short story, 1991, p286)24 - Elizabeth Bear, House of the Rising Sun (short story, 2005, p297)25 - Lilith Saintcrow, A Stand-Up Dame (short story, 2008, p302)26 - Kelley Armstrong, Twilight (novelette, 2007, p316)27 - Eric Van Lustbader, In Darkness, Angels (novelette, 1983, p333)28 - Barbara Hambly, Sunrise on Running Water (novelette, 2007, p355)29 - Bruce McAllister, Hit (short story, 2008, p372)30 - Ken MacLeod, Undead Again (short story, 2005, p385)31 - Robert J. Sawyer, Peking Man (short story, 1996, p388)32 - Ben Lumley, Necros (short story, 1986, p396)33 - Catherynne M. Valente, Exsanguinations: A Handbook for the Educated Vampire by Anna S. Oppenhagen-Petrescu (short story, 2005, p409)34 - Charles Coleman Finlay, Lucy, In Her Splendor (short story, 2003, p415)35 - John Langan, The Wide, Carnivorous Sky (short story, 2009, p426)36 - Stephen King, One for the Road (short story, 1977, p464)37 - Ross E. Lockhart, For Further Reading (By Blood We Live) (essay, 2008, p477)",
  "genres": [
    "Horror",
    "Vampires",
    "Short Stories",
    "Anthologies",
    "Fantasy",
    "Fiction",
    "Urban Fantasy"
  ],
  "author": "John Joseph Adams",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/6163754-by-blood-we-live"
}