{
  "title": "Tremendous",
  "description": "New York Times BestsellerOutsider. Misfit. Criminal. Convict. . . . Movie star. Family man. Comedy legend.Joey Diaz has been called every name in the book (and then some). Now, for the first time, he shares the story of his unlikely rise to fame in his own words—with no punches pulled.Today, he stars in hit films, headlines sold-out tours, hosts the popular Uncle Joey’s Joint podcast, and is a devoted father—but his life wasn’t always so picture-perfect. Joey “Coco” Diaz credits his success to his “immigrant mentality,” the work ethic his mother modeled for him and on which countless others have depended to survive the harsh landscape of being an outsider.Diaz wasn’t always a star, but he was always a comedian—it just took him a while to figure it out. To be fair, he was pretty busy while he was young: helping his tough-as-nails mother in her bar, holding a gun for the first time at the age of six, and later dealing drugs and serving time.Tremendous is the story of Diaz’s life, from grueling childhood and misspent youth to finding his true calling in comedy. Immigrants, fans of celebrity tales, and comedy enthusiasts alike will be enthralled by this incredibly true, foul-mouthed, and funny memoir.It’s not a story for the faint of heart, or for prudes who’ve never spent a week sleeping in a piece of playground equipment. From finding his mom’s body to high stakes crime, addiction and depression, there are plenty of dark episodes in this saga. Diaz shares it all with brutal honesty and humor, in the same inimitable voice he’d use talking to you from the stage or in a bar. He also shares the story of his improbable rise to the top and the bumpy road that led him there.An inspiration to misfits everywhere, Tremendous is storytelling at its finest—and a reminder that the direst of circumstances can change in unimaginable, unpredictable ways.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Comedy",
    "Memoir",
    "Audiobook",
    "Autobiography",
    "Humor"
  ],
  "author": "Joey \"Coco\" Diaz",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/61656367-tremendous"
}