{
  "title": "Saturday Night at the Lakeside Supper Club",
  "description": "From the New York Times bestselling author J. Ryan Stradal, a story of a couple from two very different restaurant families in rustic Minnesota, and the legacy of love and tragedy, of hardship and hope, that unites and divides themMariel Prager needs a break. Her husband Ned is having an identity crisis, her spunky, beloved restaurant is bleeding money by the day, and her mother Florence is stubbornly refusing to leave the church where she’s been holed up for more than a week. The Lakeside Supper Club has been in her family for decades, and while Mariel’s grandmother embraced the business, seeing it as a saving grace, Florence never took to it. When Mariel inherited the restaurant, skipping Florence, it created a rift between mother and daughter that never quite healed.Ned is also an heir—to a chain of home-style diners—and while he doesn't have a head for business, he knows his family's chain could provide a better future than his wife's fading restaurant. In the aftermath of a devastating tragedy, Ned and Mariel lose almost everything they hold dear, and the hard-won victories of each family hang in the balance. With their dreams dashed, can one fractured family find a way to rebuild despite their losses, and will the Lakeside Supper Club be their salvation?In this colorful, vanishing world of relish trays and brandy Old Fashioneds, J. Ryan Stradal has once again given us a story full of his signature honest, lovable yet fallible Midwestern characters as they grapple with love, loss, and marriage; what we hold onto and what we leave behind; and what our legacy will be when we are gone.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Book Club",
    "Historical Fiction",
    "Contemporary",
    "Family",
    "Adult Fiction"
  ],
  "author": "J. Ryan Stradal",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/61653268-saturday-night-at-the-lakeside-supper-club"
}