{
  "title": "The Last Ark: Lost Secrets of Qumran",
  "description": "Winner - 2023 Reader's Favorite SILVER Book Award \n\n\n\nReader's \nOne of the most thrilling, heart-pounding stories I have ever read.It’s often difficult to balance action and violence in a thriller - this one has the perfect mix. This is a fantastic read and every bit as good as any of the similar religious conspiracy blockbusters in the marketplace. I can highly recommend this book. Guy Morris does not lose a minute in this high-octane tale which manages to balance its tense moments of intrigue with some fantastic action sequences and a plot that races against time.Guy Morris does not lose a minute in this high-octane tale which manages to balance its tense moments of intrigue with some fantastic action sequences and a plot that races against time. A fast-paced thriller packed with action in a fantastic plot.This is a fantastic read and every bit as good as any of the similar religious conspiracy blockbusters in the marketplace. I can highly recommend this book. \n \nGuy Morris manages the extraordinary feat of stitching together scintillating artifacts and prophecies from the ancient past with modern espionage and artificial intelligence technology. If Indiana Jones had the technological savvy of Elon Musk. The thing that makes each of Guy Morris’s novels so hard to put down is the way the author incorporates real-life technology, organizations, military weapons, and historical facts that are meticulously researched and carefully rendered.Guy Morris delivers yet another gripping story that is successful on so many levels. History, religion, politics, espionage, alliances, assassins are all in play. \nWOWji \nA beacon of innovative storytelling, illuminating the genre's potential with an intricate narrative structure and a keen sense of dramatic timingA labyrinth of suspense and intrigue, filled with compelling characters, geopolitical machinations, and theological mysteries that pull you into its vortex and refuse to let go.Morris has an uncanny ability to ground his narrative in real-world issues, giving the reader a palpable sense of the global stage on which the drama unfolds.Morris touches on spiritual themes that resonate on a universal level.\"The Last Ark\" is a thrilling rollercoaster ride through the labyrinthine world of international politics, ancient religious relics, and cutting-edge technology. It showcases Morris's narrative prowess and his ability to weave a multitude of elements into a coherent and engaging whole.\nSLVIA . . . decades ago, an AI program escaped the NSA Lawrence Livermore Laboratory, and has never been re-captured . . . true story.\nFollowing a brutal massacre, the Ethiopian Ark of the Covenant – a revered religious artifact – sells on the international black market. Soon afterward, the death of an aging Saudi King spurs a flawed Saudi-Israeli peace deal, promoted by a polarizing former US president under criminal indictment and seeking political asylum.Elsewhere, an assassin from the fanatical Solar Temple murder cult hunts down NSA fugitive Derek Taylor while he searches for an escaped US Defense artificial intelligence called the SLVIA.",
  "genres": [
    "Fiction"
  ],
  "author": "Guy Morris",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/61659515-the-last-ark"
}