{
  "title": "Grave Expectations",
  "description": "A fast-paced and hilarious debut crime novel, in which a burnt-out Millennial medium must utilize her ability to see ghosts and team-up with a band of oddball investigators to figure out which member(s) of a posh English family are guilty of murder.Almost-authentic medium Claire and her best friend, Sophie, agree to take on a seemingly simple job at a crumbling old manor in the English performing a seance for the family matriarch's 80th birthday. The pair have been friends since before Sophie went missing when they were seventeen. Everyone else is convinced Sophie simply ran away, but Claire knows the truth. Claire knows Sophie was murdered because Sophie has been haunting her ever since.Despite this traumatic past, Claire and Sophie are still unprepared for what they encounter when they arrive: a ghost, tragic and unrecognizable, and clearly the spirit of someone killed in a rage at the previous year's party. Given her obsession with crime shows—not to mention Sophie's ability to walk through walls—Claire decides they're the best people to solve the case. And with the help of the only obviously not-guilty members of their host family—sexy ex-policeman Sebastian and far-too-cool non-binary teen Alex—they launch an investigation into which of last year's guests never escaped the manor's grounds.What follows is somewhat irregular detective work involving stealing a priest's cassock, getting too drunk to remember to question your suspect, and of course, Chekhov's sparkly purple dildo. As Claire desperately tries to keep a lid on the shameful secret that would definitely alienate her new friends, the gang must race against their own incompetence to find the murderer before the murderer finds them.",
  "genres": [
    "Mystery",
    "Fiction",
    "Paranormal",
    "Crime",
    "Ghosts",
    "Audiobook",
    "Cozy Mystery"
  ],
  "author": "Alice   Bell",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/61659979-grave-expectations"
}