{
  "title": "If everyone cared: Autobiography of Margaret Tucker",
  "description": "At the age of thirteen Margaret Tucker—Lilardia—left school. Left school? Was snatched from school, by the police! Taken forcibly from her part-Aboriginal parents to be trained as a domestic servant.Lilardia was born in 1904 on an Aboriginal settlement on the New South Wales-Victorian border. Her memories of her early years are the happiest part of her story. There was no government assistance then, but there was freedom to enjoy a carefree childhood: swimming and fishing in the rivers and lakes, going walkabout with her old uncle and aunt in their buggy, listening to the legends and learning the lore of the tribal elders, being taught by the kindly missionaries.All this came to an abrupt end when Lilardia was sent to the Cootamundra Domestic Training Home for Aboriginal Girls. The horror of the training, the cruelty of her first employer in Sydney, the loneliness, homesickness and heartache she felt are related without sentimentality, malice or self pity.Throughout a life span from Mission to MBE, Lilardia’s religious beliefs have sustained her in her times of trouble: poverty, racism, a broken marriage, the sometimes hopeless task of helping her own people. She is a true Christian and a true Australian, not only in her race, but in her heartfelt love and concern for her country and in her hope that one day all she has worked for will come to pass: that all Australians, black and white, will live together in harmony.This is a simple tale of humour and sadness, adventure and legend. It is, incidentally, of great historical importance. But it will appeal as the story of a brave, dedicated woman and her struggle through a life of hardship towards the achievement of recognition for herself and her people.",
  "genres": [
    "Nonfiction",
    "Australia"
  ],
  "author": "Margaret Tucker",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/12906020-if-everyone-cared"
}