{
  "title": "Farm City: The Education of an Urban Farmer",
  "description": "Novella Carpenter loves cities-the culture, the crowds, the energy. At the same time, she can't shake the fact that she is the daughter of two back-to-the-land hippies who taught her to love nature and eat vegetables. Ambivalent about repeating her parents' disastrous mistakes, yet drawn to the idea of backyard self-sufficiency, Carpenter decided that it might be possible to have it both ways: a homegrown vegetable plot as well as museums, bars, concerts, and a twenty-four-hour convenience mart mere minutes away. Especially when she moved to a ramshackle house in inner city Oakland and discovered a weed-choked, garbage-strewn abandoned lot next door. She closed her eyes and pictured heirloom tomatoes, a beehive, and a chicken coop.What started out as a few egg-laying chickens led to turkeys, geese, and ducks. Soon, some rabbits joined the fun, then two three-hundred-pound pigs. And no, these charming and eccentric animals weren't pets; she was a farmer, not a zookeeper. Novella was raising these animals for dinner. Novella Carpenter's corner of downtown Oakland is populated by unforgettable characters. Lana (anal spelled backward, she reminds us) runs a speakeasy across the street and refuses to hurt even a fly, let alone condone raising turkeys for Thanksgiving. Bobby, the homeless man who collects cars and car parts just outside the farm, is an invaluable neighborhood concierge. The turkeys, Harold and Maude, tend to escape on a daily basis to cavort with the prostitutes hanging around just off the highway nearby. Every day on this strange and beautiful farm, urban meets rural in the most surprising ways.For anyone who has ever grown herbs on their windowsill, tomatoes on their fire escape, or obsessed over the offerings at the local farmers' market, Carpenter's story will capture your heart. And if you've ever considered leaving it all behind to become a farmer outside the city limits, or looked at the abandoned lot next door with a gleam in your eye, consider this both a cautionary tale and a full-throated call to action. Farm City is an unforgettably charming memoir, full of hilarious moments, fascinating farmers' tips, and a great deal of heart. It is also a moving meditation on urban life versus the natural world and what we have given up to live the way we do.(jacket)",
  "genres": [
    "Nonfiction",
    "Food",
    "Memoir",
    "Gardening",
    "Audiobook",
    "Book Club",
    "Agriculture"
  ],
  "author": "Novella Carpenter",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/6164628-farm-city"
}