{
  "title": "Bonjour tristesse",
  "description": "(English follows French)La villa est magnifique, l'été brûlant, la Méditerranée toute proche. Cécile a dix-sept ans. Elle ne connaît de l'amour que des baisers, des rendez-vous, des lassitudes. Pas pour longtemps. Son père, veuf, est un adepte joyeux des liaisons passagères et sans importance. Ils s'amusent, ils n'ont besoin de personne, ils sont heureux. La visite d'une femme de cœur, intelligente et calme, vient troubler ce délicieux désordre. Comment écarter la menace ? Dans la pinède embrasée, un jeu cruel se prépare.C'était l'été 1954. On entendait pour la première fois la voix sèche et rapide d'un « charmant petit monstre » qui allait faire scandale. la deuxième moitié du XXe siècle commençait. Elle serait à l'image de cette adolescente déchirée entre le remords et le culte du plaisir.Set against the translucent beauty of France in summer, Bonjour Tristesse is a bittersweet tale narrated by Cecile, a seventeen-year-old girl on the brink of womanhood, whose meddling in her father's love life leads to tragic consequences.Endearing, self-absorbed, seventeen-year-old Cécile is the very essence of untroubled amorality. Freed from the stifling constraints of boarding school, she joins her father—a handsome, still-young widower with a wandering eye—for a carefree, two-month summer vacation in a beautiful villa outside of Paris with his latest mistress. Cécile cherishes the free-spirited moments she and her father share, while plotting her own sexual adventures with a \"tall and almost beautiful\" law student. But the arrival of her late mother's best friend intrudes upon a young girl's pleasures. And when a relationship begins to develop between the adults, Cécile and her lover set in motion a plan to keep them apart...with tragic, unexpected consequences.The internationally beloved story of a precocious teenager's attempts to understand and control the world around her, Françoise Sagan's Bonjour Tristesse is a beautifully composed, wonderfully ambiguous celebration of sexual liberation, at once sympathetic and powerfully unsparing.",
  "genres": [
    "Classics",
    "Fiction",
    "France",
    "French Literature",
    "Romance",
    "Novels",
    "Coming Of Age"
  ],
  "author": "Françoise Sagan",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/61672.Bonjour_tristesse"
}