{
  "title": "The Golden Doves",
  "description": "Two former female spies, bound by their past, risk everything to hunt down an infamous Nazi doctor in the aftermath of World War II--an extraordinary, propulsive historical novel inspired by true events from the New York Times bestselling author of Lilac GirlsThe year is 1952. It's been over a decade since American Josie Anderson and Frechwoman Arlette LaRue were imprisoned at the Ravensbrück concentration camp. As a pair of spies known as the Golden Doves, they were arrested for working with the Resistance and bound forever when they lost everything--including Arlette's son, Willie. It was here, in the darkest of places, that they created a makeshift family to endure: Josie, Arlette and a little orphan they took in as their own, Fleur.Now thirty and supposedly working for the U.S. Army to bring Nazi scientists to America in a quest to outpace the Russians, Sofie nurtures an undying ember of anger in her heart. She is searching for Dr. Snow: The infamous, enigmatic doctor who did unspeakable things to her mother.Arlette is trying to make ends meet in Paris. She's exhausted all her finances to find her stolen son and works tirelessly to care for shellshocked Fleur. Then, the charming Luc Bouchard arrives in her café. The son of a famous philanthropic family, he invites her to their compound in French Guiana with the promised hope she might find Willie at the orphanage. And yet . . . rumor is it's also filled with absconding Nazis.When Arlette arrives at the secluded Cove House, she finds herself barred from the outside. Soon, she has to rely on her old techniques as a spy to uncover a deep deception that hits close to home. In the meantime, Josie's quest for Dr. Snow leads her from Strasbourg to the Vatican to Brazil, and finally back to Arlette in French Guiana, where the two discover that their lives, and the ones they love, are in grave danger.Martha Hall Kelly has garnered acclaim for her stunning combination of empathy and research into terrors of Ravensbrück. With The Golden Doves, she has once again crafted an unforgettable story about the fates of the Nazi doctors in the wake of WWII, and the unsung females spies who risked it all to fight for justice.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "Audiobook",
    "Holocaust",
    "War"
  ],
  "author": "Martha Hall Kelly",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/61714636-the-golden-doves"
}