{
  "title": "El año de la República",
  "description": "Madrid, febrero de 1873. Amadeo abdica y en España se proclama la República. Por esos días, Fernando Besora, director de La Iberia , a quien ya conocimos en Sangre en la calle del Turco , recibe a un misterioso joven, Alonso Figueroa, que le propone investigar sobre la desaparición de dos valiosos libros de la Biblioteca Nacional. Sus pesquisas lo llevarán tras la pista de una enigmática mujer relacionada con un sujeto que ha aparecido colgado en un desván en la calle de la Luna.La vida política de Madrid está agitada por la amenaza de un golpe de Estado, las diferencias entre los propios republicanos y las noticias de la guerra carlista y la de Cuba. Besora será testigo en el Congreso de los Diputados de encendidos debates, espléndidos discursos y situaciones llamativas en las que participan personalidades como Pi y Margall, Castelar o Salmerón. También vivirá en primera persona el movimiento cantonal cuyo epicentro es Cartagena, donde las pasiones se desbordan.A través de estas páginas conoceremos también el Madrid de las tertulias en los cafés. A una de ellas, la de El Suizo, acude Besora y se reúne con escritores como Galdós, que iniciaba aquel año la publicación sus Episodios nacionales, Valera, Zorrilla o Mesonero Romanos, con políticos como Cánovas del Castillo y Morayta, con pintores como Casado del Alisal… En ella se habla de política y también de literatura y de arte.Después de Sangre en la calle del Turco, José Calvo Poyato regresa con El año de la República a uno de los periodos más atractivos y convulsos de nuestro pasado con una potente novela histórica aderezada con una intriga detectivesca, al tiempo que nos sumerge en ambientes propios de la época como las corridas de toros, las tertulias, las tabernas, los balnearios, los duelos, las fiestas de sociedad, los viajes en tren y en diligencia, las librerías o las algaradas callejeras.",
  "genres": [
    "Historical"
  ],
  "author": "José Calvo Poyato",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/61678261-el-a-o-de-la-rep-blica"
}