{
  "title": "Tattoos & Tequila: To Hell and Back with One of Rock's Most Notorious Frontmen",
  "description": "\"So where do we start? I remember when we did The Dirt, the Mötley Crüe book, I was interviewed at The Grand Havana Room in Beverly Hills. A lot of people think I didn't get to say much in The Dirt. It's probably true. I didn't read it. I'm not that big a talker. Some people can f*ckin' talk ... eat up all the oxygen in a room in no time flat. I don't tend to run my mouth. It's b*llshit. All those years in rehab and counseling--the talking cure? I can't say I really got that much out of it. All that cure and I should be cured by now, don't you think? All this talking...So forgive me if it's a bit hard for me to slice open a vein and let my blood run red all over this page for you. I'll fight you or I'll f*ck you but chances are I'll be hard pressed to sit there and talk to you.War stories. War wounds. I know, I know. Old rock stars fall hard. I'm forty-nine years old. I'm five-foot-nine, 170. The spandex is over. I've had three plastic surgeries. Still, who do you think gets laid more, me or you? But time does change a man. I ain't twenty-one anymore.It's a miracle we survived at all. A bottle of Jack Daniel's and uncooked hot dogs do not make for a particularly well-balanced diet. We are all very lucky we didn't kill ourselves. It might look like we were trying to do that but speaking for myself, death was never my intent. I just wanted to feel good, you know? I was just looking for that kick, that high...These days I've got businesses to run. I like the action. Something to get your heart pumping. Healthier than a syringe full of cocaine powder like I was doing back in '81 with my girlfriend Lovey, that's for sure...But you got to admit...those days are a lot more fun to talk about...\"",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "Memoir",
    "Rock N Roll",
    "Biography Memoir"
  ],
  "author": "Vince Neil",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/6169414-tattoos-tequila"
}