{
  "title": "Queen of the Witches",
  "description": "A lean and exciting standalone novelette for fans of L.J. Smith, Kevin Williamson and the long-gone glory days of the CW network!Why does Boston suck so much?This is the first thought that comes to Tallulah Stark’s head on the morning of her seventeenth birthday. Maybe it’s exciting if you’re a tourist. Or if you’re big into American history like her dad is. You couldn’t pay Richard Stark enough money to leave Boston. But for Tallulah, it’s become stale.It’s nice that Salem is so close. That’s where she feels like she truly belongs and she tries to spend as much time there as possible. The only place she thinks she might like even more is New Orleans but she’s never had a chance to visit, so Salem will have to do for now.She opens her eyes and looks around.She wonders whether people in smaller towns in Massachusetts wake up with similar thoughts about their abodes and instead dream about moving to Boston one day. We can trade places anytime, thinks Tallulah, yawning. Her fluffy all-white cat Ledger is still snoring on the blanket by her feet. Even though she’s a girl cat – and an old one at that, now fourteen – she was named after Heath Ledger because she was born the day he died.January 22nd, 2008. Never forget.Tallulah Stark was born three years before that. February 15th, 2005. She hates snow. She can’t stand the cold. Anything under 50 degrees is torture for her. So, waking up on her birthday isn’t the special treat it might be for other people. While seventeen is undoubtedly an important milestone, she’s really not looking forward to having to wear four layers and waddle to school like a fat snowman.Thankfully she’s got something to look forward to now. Last night, her dad confirmed that he had paid for the summer camp. Only four months to go and she’ll be in beautiful Salem again. She’ll enjoy the sun on her face that’s going to bring her freckles out. She’s going to get a much-needed break from the city. She’ll spend ridiculous amounts of money on crafts and other fun supplies during trips into town.Suddenly she remembers the odd dream she had. She was with two other girls about her age and an older boy. It wasn’t camp, though. It wasn’t really anything. She saw the four of them standing near the edge of a cliff somewhere. But in her mind, she knew that they were also close to a cottage in the woods. A cottage that she knew the layout of exactly. It was one of those weird dream contradictions – like seeing someone you know but instinctually realizing that they’re actually a stand-in for a completely different person.Tallulah had extremely vivid dreams and they were often completely absurd, so she didn’t think much of them. She enjoyed the ride while it lasted and three times in her life, had actually achieved a lucid dream. But while she was sensitive to the world around her, she didn’t put much stock into dreams and their deeper meanings, thinking they were mostly her brain taking a big dump at the end of the day.But the boy’s face in this dream. She can still see it. She sits up and starts slowly stroking Ledger, the old girl purring with pleasure, thinking about all the gourmet mice and organic milk she’ll hopefully be getting for her upcoming quinceanera. Tallulah grabs her phone and turns her alarms off. Wow – she actually woke up twenty minutes before the first one.The boy.A young man, rather, maybe in his early twenties. Not very tall but with a nice athletic build. No washboard abs but an attractive leanness to him. A tan. And the most incredibly striking gray eyes you’ve ever seen. A look exchanged between them.The two other girls staring at the couple, their faces blurred but their anger obvious through any funky effects.More waves crashing.And then…Silence.",
  "genres": [],
  "author": "C.C. Vega",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/61688055-queen-of-the-witches"
}