{
  "title": "Emerson, the Stoics, and Me: Timeless Wisdom for Living an Authentic Life",
  "description": "\"This is a beautiful book, full of ideas that could help restore America’s genius for freedom and promise.” — Thomas Moore, New York Times bestselling author of Care of the Soul A lifelong Emerson lover, teacher, and spiritual seeker reveals how American philosopher Ralph Waldo Emerson’s twelve essential teachings hold the answer to living an authentic and fulfilling life, one that is in harmony with our souls.In this wise, illuminating book, award-winning author Mark Matousek reveals how Emerson’s timeless wisdom can help us with the problems we’re facing today. America’s ‘original Stoic’ confronted many of the issues before us, from polarization to fake news, from crooked politicians and rampant materialism, to the scourge of racism.Matousek explains that Emerson’s path of self-reliance can radically improve your quality of life. The mentor and friend of Henry David Thoreau, Emerson (aka the Oracle of Concord) was America’s first self-help author, and his nation’s conscience for half a century. Like the Stoics before him, he emphasized self-knowledge and mindfulness as paths to happiness; also, self-reliance, cooperation, non-conformity, originality, adaptability, and receptiveness.As Americans are once again discovering the power of Stoicism, Matousek shows why Emerson’s vision is precisely the medicine we need today. The principles of Waldo’s philosophy are universal and require no spiritual faith to put into practice.Each person creates her own realityObstacles are teachers in disguiseYour character is your destinyWonder and awe are the keys to the kingdomNonconformity is the greatest virtueNature is the doorway to GodLife without self-knowledge is not worth livingEmerson encourages us to throw-off conventions and platitudes, explore ourselves in depth, tell the truth about what we find there, and awaken to our greatest potential.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Education",
    "Productivity",
    "Inspirational"
  ],
  "author": "Mark Matousek",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/61713837-emerson-the-stoics-and-me"
}