{
  "title": "Mastering the Art of French Murder",
  "description": "Fans of Jacqueline Winspear, Marie Benedict, Nita Prose, and of course, Julia Child, will adore this magnifique new mystery set in Paris and starring Julia Child’s (fictional) best friend, confidante, and fellow American. From the acclaimed author of Murder at Mallowan Hall , this delightful new book provides a fresh perspective on the iconic chef’s years in post-WWII Paris.“Enchanting…Cambridge captures Child’s distinct voice and energy so perfectly. Expect to leave this vacation hoping for a return trip.” – Publishers WeeklyAs Paris rediscovers its joie de vivre, Tabitha Knight, recently arrived from Detroit for an extended stay with her French grandfather, is on her own journey of discovery. Paris isn’t just the City of Light; it’s the city of history, romance, stunning architecture . . . and food. Thanks to her neighbor and friend Julia Child, another ex-pat who’s fallen head over heels for Paris, Tabitha is learning how to cook for her Grandpère and Oncle Rafe.Between tutoring Americans in French, visiting the market, and eagerly sampling the results of Julia’s studies at Le Cordon Bleu cooking school, Tabitha’s sojourn is proving thoroughly delightful. That is, until the cold December day they return to Julia’s building and learn that a body has been found in the cellar. Tabitha recognizes the victim as a woman she’d met only the night before, at a party given by Julia’s sister, Dort. The murder weapon found nearby is recognizable too—a knife from Julia’s kitchen.Tabitha is eager to help the investigation, but is shocked when Inspector Merveille reveals that a note, in Tabitha’s handwriting, was found in the dead woman’s pocket. Is this murder a case of international intrigue, or something far more personal? From the shadows of the Tour Eiffel at midnight, to the tiny third-floor Child kitchen, to the grungy streets of Montmartre, Tabitha navigates through the city hoping to find the real killer before she or one of her friends ends up in prison . . . or worse.“Part historical fiction, part mystery, Mastering the Art of French Murder is totally delectable entertainment.” – The Washington Post“Certain to appeal to a broad readership, especially fans of Jacqueline Winspear, Rhys Bowen, and Cambridge’s own Phyllida Bright series.” –First Clue, STARRED REVIEW",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Cozy Mystery",
    "Audiobook",
    "Mystery Thriller",
    "France"
  ],
  "author": "Colleen Cambridge",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/61678536-mastering-the-art-of-french-murder"
}