{
  "title": "Married by Scandal",
  "description": "She’ll marry a prince if she must.But fall in love?Never.The first time Amelie Fairfield fell in love, she started a war. Now, the part-human, part-fae fashion designer has sworn off romance to focus on her career. But when her name makes headlines in the worst possible way, there’s only one thing she can do to escape scandal—marry a human prince and make everyone forget about the career-killing rumors.To solidify peace between the humans and fae, Prince Albert must take a fae bride. As sister to the fae queen, Amelie is the perfect candidate. If only she could say the same for the rakish prince she’ll have to marry. At least his devilish charm and good looks keep society fixated on him and not her.But scandal becomes the least of Amelie’s worries when she embarks upon an engagement tour. She’ll need to convince the aristocracy that her arranged marriage is a true love match…without falling in love. Just when she thinks she has it all under control, the prince reveals a secret that suggests he might not be the man she thought. In fact, he might not be a prince at all…Can Amelie juggle a world of fashion, unexpected espionage, and dating her not-so-fake fiancé? Or will her closed-off heart prove to be her biggest hurdle yet?Married by Scandal is the third book in the Arranged Marriages of the Fae series, a multi-author collaboration of romantic fantasy stand-alone novellas, designed to be read independently. Together, they feature arranged marriages in fae fantasy and offer complete romances while also allowing the reader to enjoy a variety of tones and approaches. Perfect for romantic fantasy readers with busy lives who love swoony romance.Married by Scandal is set in the same world as The Fair Isle Trilogy and the Entangled with Fae series. Journey back to Faerwyvae or start your adventure here for the first time!",
  "genres": [
    "Fantasy",
    "Romance",
    "Fae",
    "Fantasy Romance",
    "Fiction",
    "New Adult",
    "Romantasy"
  ],
  "author": "Tessonja Odette",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/61753921-married-by-scandal"
}