{
  "title": "Dirty Truths",
  "description": "You know that saying, things can’t possibly get worse? They always can.I thought I’d reached a whole new low the day I ran from Bellerose. The day I was snatched by mafia goons, beaten half to death, and left wishing they’d finish the job.But then an Angel saved me.His kind of salvation wasn’t the freedom I’d been hoping for, though. Two months later I’m his prisoner in the gilded cage of his home. His pregnant mistress.Angelo Ricci--my Angel--holds my life in his hands. He’s both protecting me, and condemning me, and if his father ever discovers our secret deal then death will be a blessing.I’m tired, and scared, and don’t know who I can trust. All I know is that I miss the boys of Bellerose. Grayson and Rhett still hold parts of my heart, even if I could happily kick Jace in the nu… face. And Flo? She’s dead to me.Literally.Like, dead dead.Wormfood.Fate takes a turn in my favor when Bellerose gets a new owner, and an unexpected opportunity to reconnect with the band is forced on me. Getting locked in a secluded farmhouse with the guys who think I left them for my abusive ex sounds like a recipe for bloodshed, but I don’t get a choice in the matter.Except, this time I’m not going alone. Angelo is tagging along, and seems determined to cause drama. Somehow we all need to make it out alive, but that should be easy enough, right? After all, I’m Billie Bellerose.Dirty Truths is book TWO of FOUR in the Boys Of Bellerose series. This is a mafia/rockstar reverse harem romance series with dark elements and gripping cliffhangers throughout. Content is intended for a mature audience. Please consult the warning at the front of the book if you have any content sensitivity.",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Dark Romance",
    "Enemies To Lovers",
    "Contemporary",
    "Dark",
    "Second Chance"
  ],
  "author": "Jaymin Eve",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/61753033-dirty-truths"
}