{
  "title": "America, Empire of Liberty: A New History",
  "description": "David Reynolds award-winning ninety-episode radio series traces the story of America from its beginnings to the present day.This epic narrative, spread over three volumes of thirty episodes each, tells the history of the United States through the viewpoints and archived voices of those who lived it, exploring three abiding national themes: empire, liberty, and faith.Volume 1: Liberty and Slavery. These first thirty episodes start with the Native Americans, who arrived from Asia around 15,000 years ago. In a fascinating journey that takes in the impact of Columbus, the founding of Puritan New England, the Declaration of Independence, the slave trade, and the forced relocation of the Indians, Reynolds shows how the United States expanded to cover a whole continent, laying the foundations of a superpower if the country could stay united. And that seemd to be a big if in 1861 as the conflicts over liberty and slavery brought America to the brink of Civil War.Volume 2: Power and Progress. In this second series of thirty episodes, Reynolds depicts the tragedy and heroism of the Civil War, which finally ended slavery, though not racial discrimination, but spurred the dynamism of the reunited nation as it grew into an industrial giant. World War I made America a force on the world stage, but then the country lost its way, and its nerve, in the Depression, only for another world war to turn it into a nuclear superpower by 1945. This is also the story of how ordinary Americans lived, worked, and had fun, with fascinating notes about H. J. Heinz, Buffalo Bill, skyscrapers, baseball, the flappers, and \"Gone with the Wind.\"Volume 3: Empire and Evil. The final series of thirty episodes chronicles America s long struggle with the Soviet Union through the Cuban missile crisis to the collapse of what Ronald Reagan dubbed the evil empire and examines the corrosive effect of that confrontation on American values, particularly in Vietnam and Watergate. The country also struggled to overcome the evils of its own racist past, from the Civil Rights Movement to the election of its first black president. Woven into this tapestry are vivid threads from ordinary life, such as the impact of Elvis on popular music, the battle over abortion rights, and the story of the personal computer and the information revolution.Written and presented by acclaimed historian David Reynolds, this saga won the Voice of the Listener & Viewer Award for the Best New Radio Program and was nominated for a SONY Radio Academy Award.\"",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "American",
    "Politics",
    "The United States Of America",
    "Audiobook"
  ],
  "author": "David   Reynolds",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/6172192-america-empire-of-liberty"
}