{
  "title": "A Bride for Eight Brothers, Volume 1",
  "description": "A Bride for Eight Brothers, Volume 1: Parts 1 & 2Part 1: Mikayla's Men[Siren LoveXtreme Forever: Erotic Sci-Fi Menage Romance, F/M/M/M/M/M/M/M/M, bondage, public exhibition] Mikayla believed the wrong man and found herself stranded on a planet a long way from home. Faced with starvation or prostitution, she chooses to survive, but things don’t go quite the way she expected.Matt, John, Peter, Ryan, Ty, Lachlan and Brock have a small problem. She’s a beautiful, talented, kind and incredibly sexy woman snowed in with them for the winter. But she is also a victim and in need of their help. Refusing to use her as the prostitute they paid for, they manage to find enough work to keep her busy.But they hadn’t counted on Mikayla actually wanting to fulfill the terms of her contract...Snowed in for the winter with seven sexy brothers, can Mikayla live a fantasy without losing her heart?----------Part 2: Sweet Captivation[Siren LoveXtreme Forever: Erotic Sci-Fi Menage Romance, F/M/M/M/M/M/M/M/M] Unable to return to the ice planet due to her pregnancy, Mikayla is left on Earth with Lachlan while the rest of her husbands complete their contract. But an unexpected midnight visitor causes concern. He's injured, frightened and offensive, but he's also Matt's twin brother, Bryce.When Brock is injured and stranded at the bottom of a snow crevice, Lachlan is called back to the ice planet to help rescue his brother. He has no choice but to leave his wife's safety in the hands of a man he barely knows.But when trouble comes looking for Bryce, will Mikayla end up in the line of fire?** NOTE You are purchasing Siren's newest serialized imprint, the LoveXtreme Forever Series. These books are not stand alone. Each is a continuation of the previous book and must be read in the numbered order. Each book may end on a cliffhanger but usually with a happy-for-now for the heroine and one or more men. The final book (#6) contains a happily forever after for the heroine and all her men. ** A Siren Erotic Romance **",
  "genres": [
    "Menage",
    "Romance",
    "Erotica"
  ],
  "author": "Abby Blake",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/12907199-a-bride-for-eight-brothers-volume-1"
}