{
  "title": "With My Little Eye",
  "description": "The hair-raising story of a mother who moves herself and her daughter across the country to lose a dangerous stalker—only to discover that it will take more than distance to escape him.It started with the letters…For actress Meribel Mills, disturbing fan mail is part of the price of fame. So when she starts getting creepy letters written in fruit-scented marker she is mostly unphased and diligently files them along with her other messages from unhinged fans. After all, she’s a single mom approaching forty, not the kind of hot young celeb who sparks dangerous obsessions. But there’s something different about Marker Man…He’s been in her home…Meribel’s sheets smell of unfamiliar cologne, and objects have gone missing around the house. Plus, the letters have become more perverse, with drawings of a naked Meribel tied up or chopped into pieces. While the police insist that stalkers hardly ever escalate to violence, Meribel has played the dead girl one too many times on TV to risk becoming her in real life. She and her daughter move from Los Angeles to Atlanta for a fresh start—but no distance is great enough.He’s watching her…Years of being in front of a camera have given Meribel a superpower—she can feel eyes on her, a creeping sensation like bees inside her skin. And someone definitely has her in their sights. Could Marker Man have followed her all the way across the country?Who else might be watching—her ex-husband? The lover she left behind in LA? Her new neighbor? Suddenly, every man in her life is a suspect, but she can’t keep herself and her daughter safe from a monster she can’t identify. When the paths of all of these men collide, Meribel will find herself alone in the fight of her life, desperate to protect those she loves as danger closes in from all sides.",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Suspense",
    "Adult"
  ],
  "author": "Joshilyn Jackson",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/61745949-with-my-little-eye"
}