{
  "title": "Twisted Series 4 Books Collection",
  "description": "Twisted LoveAlex Volkov is a devil blessed with the face of an angel and cursed with a past he can't escape.Driven by a tragedy that has haunted him for most of his life, his ruthless pursuits for success and vengeance leave little room for matters of the heart.But when he's forced to look after his best friend's sister, he starts to feel something in his chest. A crack. A melt.Twisted GamesStoic, broody and arrogant, elite bodyguard Rhys Larsen has two rules: protect his clients at all costs and do not become emotionally involved. Ever.He has never once been tempted to break those rules . . . until her.Bridget von Ascheberg. A princess with a stubborn streak that matches his own and a hidden fire that reduces his rules to ash.Twisted HateGorgeous, cocky, and fast on his way to becoming a hotshot doctor, Josh Chen has never met a woman he couldn't charm - except for Jules f**king Ambrose.The beautiful redhead has been a thorn in his side since they met, but she also consumes his thoughts in a way no woman ever has.When their animosity explodes into one unforgettable night, he proposes a solution that'll get her out of his system once and for all: an enemies with benefits arrangement with simple rules.Twisted LiesCharming, deadly and smart enough to hide it, Christian Harper is a monster dressed in the perfectly tailored suits of a gentleman.He has little use for morals and even less use for love, but he can't deny the strange pull he feels toward the woman living just one floor below him.She's the object of his darkest desires, the only puzzle he can't solve. And when the opportunity to get closer to her arises, he breaks his own rules to offer her a deal she can't refuse.",
  "genres": [
    "Romance",
    "Love",
    "Dark Romance",
    "Fiction",
    "Fantasy",
    "Romantic",
    "Audiobook"
  ],
  "author": "Ana Huang",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/61754236-twisted-series-4-books-collection"
}