{
  "title": "The Best Minds: A Story of Friendship, Madness, and the Tragedy of Good Intentions",
  "description": "“Brave and nuanced…an act of tremendous compassion and a literary triumph.” — The New York Times“Immensely emotional and unforgettably haunting.” — Wall Street JournalAcclaimed author Jonathan Rosen’s haunting investigation of the forces that led his closest childhood friend, Michael Laudor, from the heights of brilliant promise to the forensic psychiatric hospital where he has lived since killing the woman he loved. A story about friendship, love, and the price of self-delusion, The Best Minds explores the ways in which we understand—and fail to understand—mental illness.When the Rosens moved to New Rochelle in 1973, Jonathan Rosen and Michael Laudor became inseparable. Both children of college professors, the boys were best friends and keen competitors, and, when they both got into Yale University, seemed set to join the American meritocratic elite.Michael blazed through college in three years, graduating summa cum laude and landing a top-flight consulting job. But all wasn’t as it seemed. One day, Jonathan received the Michael had suffered a serious psychotic break and was in the locked ward of a psychiatric hospital.Diagnosed with paranoid schizophrenia, Michael was still in the hospital when he learned he'd been accepted to Yale Law School, and still battling delusions when he decided to trade his halfway house for the top law school in the country. He not only managed to graduate, but after his extraordinary story was featured in The New York Times , sold a memoir for a large sum. Ron Howard bought film rights, completing the dream for Michael and his tirelessly supportive girlfriend Carrie. But then Michael, in the grip of an unshakeable paranoid fantasy, stabbed Carrie to death with a kitchen knife and became a front-page story of an entirely different sort.The Best Minds is Jonathan Rosen's brilliant and heartbreaking account of an American tragedy. It is a story about the bonds of family, friendship, and community; the promise of intellectual achievement; and the lure of utopian solutions. Tender, funny, and harrowing by turns, at times almost unbearably sad, The Best Minds is an extreme version of a story that is tragically familiar to all too many. In the hands of a writer of Jonathan Rosen's gifts and dedication, its significance will echo widely.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Psychology",
    "True Crime",
    "Audiobook",
    "Biography",
    "Mental Health"
  ],
  "author": "Jonathan Rosen",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/61724281-the-best-minds"
}