{
  "title": "SOCKS: A Modern Retelling - The Twelve Dancing Princesses",
  "description": "“A cleverly-crafted tale, with a cast of fun-to-get-to-know characters. Highly recommended for 8 – 11 year olds!” A ‘Wishing Shelf’ Book ReviewA modern retelling of The Twelve Dancing PrincessesWhen the girls in Riverside Children’s Home start falling asleep in school, their classmate Bobby decides to investigate the cause.He doesn’t know how to help them, but then one day he does a good deed and is repaid by a totally cool gift of an invisible cloak.Hidden under his new cloak, Bobby sneaks into the girl’s dormitory to find out where they are going during the night. He is surprised to find them all disappearing into the wardrobe. With no other way to get to the bottom of things, Bobby follows Lotti and the other girls… and ends up in a magical world.Can Bobby help the girls before Mr Rumble, the home’s care worker, separates them all and sends them to new homes?A sweet fairy tale about family and friendship. WISHING SHELF FULL REVIEWIt all started with socks. What a wonderful first sentence for a children's book! This is a delightful read based on The Twelve Dancing Princesses by The Brothers Grimm. Accessibly written for 8 to 11 year olds, it's the story of a young lad called Bobby who attempts to discover why the girls are falling asleep in school. What follows is a delightful, fantasy tale which is well written, funny (particularly in the beginning), and a perfect bedtime story.There are two things about this book that I particularly enjoyed. Firstly, I felt the author worked really well with dialogue. The speech between the girls sounded so natural - and it's often rather funny too! In many ways, it's the way the girls talk - and what they say - which best helps the reader to understand them. Secondly, the story is so sweet; so safe, it's perfect for parents and grandparents looking for a fun, exciting story for children to enjoy, and not have to worry they'll get frightened or upset. There's a sort of warm, fuzzy feeling to the book, like putting on soft slippers.All in all, this is a sweetly told story for 8 to 11 year olds. Children will enjoy getting to know the young characters and trying to work out what the girls are getting up to! I was also happy to see the original story has been included at the end, adding a little historical context to the proceedings!",
  "genres": [],
  "author": "T.N. Traynor",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/61739307-socks"
}