{
  "title": "Burning For Him",
  "description": "BridgetMonday morning. Another day, another dollar. But today’s a little different at the office, and my boss hasn’t let me forget it either.Fire drill.Like most other things, the boss should organize herself it’s left to me to arrange and be responsible for everything while she takes the credit as usual.My job?Give everyone the heads up, including the fire department. Press the bell and count everyone off as we all go outside to enjoy an extended coffee break.Easy, right?I thought so too.Until our little practice run turns into a real-life fire, and all my planning and box-checking proves just one thing: You can’t always plan for the unexpected.I guess that’s why they call them emergencies or accidents.Nobody willingly locks themselves in a burning building. And nobody wants to have to jump to save their own skin.But this short, thick, and slightly heavy girl doesn’t have a choice. Especially not when she sees who’s gonna catch her.My hero is an older, mature man with a body even I can see from three stories up that would put men half his age to shame.A firefighter who happens to be in the right place at the right time on his day off.If I land on him, he’s also the only one big enough to stand a chance at standing, let alone still breathe.He commands me to trust him, to take that leap of faith. To step out off the ledge and just drop right into his arms.To know he’ll be there to catch me. To save me, and once I do, I know he’s gonna keep me safe for a lot longer than just a few minutes.But once I do, I feel myself falling more than just a few floors.I’ve fallen longer, deeper, and harder for him than anyone ever could.The tricky part? Trying to explain all this to my nagging self-doubts. Wondering if an older guy as amazing as Ash could even think about a girl like me in that way.But most of all, trying to find a way to keep it from my controlling parents.Falling for the fireman is a no-brainer.But trusting my heart and my gut when everything else falls apart?That’s the kind of stuff that real heroes make you believe.The kind of stuff Ash promises me.Promising he’ll never let go. No matter what.AshBefore I even meet her, I’d already seen her.I mean, I’ve really seen her. And not just from across the street either.She’s the one. I just know she is.Something in my blood and bones tells me she’s why I’ve waited so long.I’ve seen our future, our home. Our family.And I’m just the man to provide her and ours with everything they need.I’ve been ordered off duty for a few days. Thirty-seven days straight isn’t the kind of record my Chief likes, so it’s a forced mini-vacation for me.And then I see her.After that, I’m a mess. I can only think about that brief glimpse—the life I can see clearer in my mind than anything else.Just one problem. She doesn’t know me from a bar of soap.I could track her down and trace her to the building I saw her go into.But then what?‘Hi! I’m an off-duty fireman, and I’m here to rescue you, take you away to a life you’ve only dreamed of.’That would never work.She must be half my age too. But I can’t forget those curves.Her hair.The way she moved.If only there was some way to see her again. Something not so obvious, so I could at least get to know her a bit. Find out if she could really go for an older, more mature guy.I know it’s destiny. I’ve never been so sure of anything.She will be mine, somehow.And when she is, it’s a forever deal.Fireman’s promise",
  "genres": [
    "Firefighters",
    "Romance",
    "Contemporary"
  ],
  "author": "Flora Ferrari",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/61778878-burning-for-him"
}