{
  "title": "Carmageddon: How Cars Make Life Worse and What to Do About It",
  "description": "A high-octane polemic against cars—which are ruining the world, while making us unhappy and unhealthy—from a talented young writer at the Economist The automobile was one of the most miraculous inventions of the 20th century. It promised freedom, style, and utility. But sometimes, rather than improving our lives technology just makes everything worse. Over the past century cars have filled the air with toxic pollutants and fueled climate change. Cars have stolen public space and made our cities uglier, dirtier, less useful, and more unequal. Cars have caused tens of millions of deaths and injuries. They have wasted our time and our money. In Carmageddon, journalist Daniel Knowles outlines the rise of the automobile and the costs we all bear as a result. Weaving together history, economics, and reportage, Knowles traces the forces and decisions that normalized cars and cemented our reliance on them. He takes readers around the world to show the ways car use has impacted people’s lives—from Nairobi, where few people own a car but the city is still cloaked in smog, to Houston, where the Katy Freeway has a mind-boggling 26 lanes and there are 30 parking spaces for every resident, enough land to fit Paris ten times. With these negatives, Knowles shows that there are better ways to live, looking at Amsterdam, Copenhagen, Tokyo, and New York City. CARMAGEDDON features original reporting from: Chicago Detroit Houston Las Vegas Los Angeles New York Paris, France Mumbai, India Nairobi, Kenya Tokyo, Japan London, Birmingham, and Coventry, England   CARMAGEDDON also covers: Atlanta Cincinnati Louisville Memphis St Louis Amsterdam, Netherlands Copenhagen, Denmark Lagos, Nigeria Sao Paolo, Brazil Singapore",
  "genres": [
    "Nonfiction",
    "Urbanism",
    "Politics",
    "History",
    "Urban Planning",
    "Economics",
    "Environment"
  ],
  "author": "Daniel Knowles",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/61783761-carmageddon"
}