{
  "title": "Flux",
  "description": "A blazingly original and stylish debut novel about a young man whose reality unravels when he suspects his employers have inadvertently discovered time travel and are covering up a string of violent crimes.Combining elements of neo-noir, speculative fiction, and '80s detective shows, FLUX is a haunting and sometimes shocking exploration of the cyclical nature of grief, of moving past trauma, and of the pervasive nature of whiteness within the development of Asian identity in America.In FLUX, a brilliant debut in the vein of William Gibson’s Neuromancer and Ling Ma’s Severance, Jinwoo Chong introduces us to three characters —Bo, Brandon and Blue— who are tortured by these questions as their lives spin out of control.* After 8-year-old Bo loses his mother in a tragic accident, his white father, attempting to hold their lives together, begins to gradually retreat from the family.* 28-year-old Brandon loses his job at a legacy magazine publisher and is offered a new position. Confused to find himself in an apartment he does not recognize, and an office he sometimes cannot remember leaving, he comes to suspect that something far more sinister is happening behind the walls. * 48-year-old Blue participates in a television exposé of Flux, a failed bioelectric tech startup whose fraudulent activity eventually claimed the lives of three people and nearly killed him. Blue, who can only speak with the aid of cybernetic implants, stalks his old manager while holding his estranged family at arms-length.Intertwined with the saga of a once-iconic '80s detective show, Raider, whose star has fallen after decades of concealed abuse, the lives of Bo, Brandon and Blue intersect with each other, to the extent that it becomes clear that their lives are more interconnected and interdependent than the reader could have ever imagined.Can we ever really change the past, or the future? What truth do we owe our families? What truth do we owe ourselves?",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Time Travel",
    "Queer",
    "LGBT",
    "Audiobook",
    "Thriller"
  ],
  "author": "Jinwoo Chong",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/61774690-flux"
}