{
  "title": "Juno Loves Legs",
  "description": "For fans of Shuggie Bain and A Little Life, Juno Loves Legs is the epic and heartbreaking story of a young friendship set in working-class Dublin in the 1980sJuno Loves Legs is the story of two teens labeled as delinquents. Juno and \"Legs\" grow up on the same housing estate in Dublin, where spirited, intelligent Juno is ostracized for her poverty and Legs is persecuted for his sexuality; they find safety only in each other. Set against the backdrop of Dublin in the 1980s, a place of political, social and religious change, the friends yearn for an unbound life and together they begin to fight to take up the space of who they truly are. As their defiance reverberates through their lives, the children are further alienated from their surrounding society through acts of bravery and cowardice, both their own and others’. Finding themselves as outsiders, they are feared, coveted and watched, but rarely truly seen.Told through the eyes of Juno, we see the pair begin to navigate the political and oftentimes confusing adult world with honesty and intuition. A country emerging from a dark Catholicism into the wider world of possibilities. Who is invited into modernity and gentrification and who is left behind?Caught between the rich depth of her intellect and the harsh reality of her life, we follow Juno as she begins to understand how divergent a life lived and a life thought can be.Juno Loves Legs shows the frustration of feeling trapped in a life that is not yours and the ability of friendship to lift us out of our experiences and into a truer version of ourselves. It is a novel that reminds us that kindness, bravery, and love appear in places where they are not always expected and in forms not usually recognised, but with a potency that cannot be ignored.",
  "genres": [
    "Fiction",
    "Ireland",
    "Literary Fiction",
    "Historical Fiction",
    "LGBT",
    "Queer",
    "Irish Literature"
  ],
  "author": "Karl Geary",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/61778428-juno-loves-legs"
}