{
  "title": "رقص... رقص... رقص...",
  "description": "كثيراً ما يتراءى لي فندق الدولفين في أحلامي، وفي هذه الأحلام أجدني هناك عالقاً في بعض الأحداث المتواصلة، كل شيء حولي يقول إنني جزء من هذا الحلم المستمر.وفندق الدولفين هو فندق يندّ عن المألوف وذلك لضيقه الشديد الذي يجعله يبدو أشبه بجسر طويل، بيد أنه جسر مغطى، جسر يتمدد في الزمان إلى ما لا نهاية، وهناك أجدني داخله، لكن هنالك شخص آخر يبكي أيضاً.أجد الفندق دائماً يحوطني من كل جانب، أستشعر نبضاته وحرارته، وفي أحلامي أجدني جزءاً منه، أصحو من نومي، ولكن أين أنا؟ إنني حتى لا أفكر في ذلك، سألت نفسي بالفعل ذلك السؤال: \"أين أنا؟\" وكأنني لم أكن أعلم: إنني موجود، في حياتي، ووجودي هو مظهر من مظاهر العالم، لست أستذكر ولو لمرة واحدة أنه سبق لي أن وافقت على هذه الأمور أو هذه الحالة أو مجموعة الأحداث هذه التي أظهر فيها، ربما تكون ثمة إمرأة تنام إلى جواري، ولكن في معظم الأحوال أجدني وحيداً، ليس هناك سواي أنا والطريق السريع الذي يمتد مباشرة بمحاذاة شقتي وكذلك كأس (كان ما زال فيها خمسة مليمترات من الويسكي) وضوء الصبح المغبر أحياناً يكون الطقس ماطراً.إن فندق الدولفين فندق حقيقي ويوجد بالفعل في حي من أحياء سابورو، كنت قد أمضيت فيه أسبوعاً قبل عدة سنوات، لا بل دعني أكون دقيقاً في ذلك، قبل كم سنة كان ذلك؟ أربع سنوات، وحتى أكون أكثر دقة، أربع سنوات ونصف، كنت ما أزال آنذاك في العشرينات من عمري، حينما نزلت بفندق الدولفين بصحة إمرأة كنت أعيش معها، وكانت هي مَن اختارت المكان حينما قالت \"هذا هو المكان الذي سننزل به\"، ولولاها لما وطأت قدماي أبداً مثل هذا المكان.كان فندقاً صغيراً وقبيحاً، فطوال الوقت الذي أمضيناه هناك لا أعرف ما إذا كنا رأينا أي نزلاء آخرين، كانت هناك بعض المفاتيح غير موجودة في اللوحة الموجودة خلف مكتب الإستقبال وهو ما يجعلني أخمّن أن ثمة نزلاء آخرين كانوا هناك...إنه فندق يحوطه الغموض من كل جانب، يذكّرني بالموت البيولوجي، وبإنتكاسة جينية، إنه صنع غريب من أعمال الطبيعة التي ألقت بكائن في المسار الخطأ من دون أن يكون ثمة طريق للعودة...بيد أننا أقمنا هناك، وأذكر أنها قالت \"هذا هو المكان الذي سننزل به\"، لكنها اختفت بعد ذلك، ظهرت ثم اختفت، إنه المقنَّع هو الذي أبلغني بذلك حينما قال: المرأة غادرت بمفردها بعد الظهيرة، بطريقة ما كان الرجل المقنَّع يعلم بذلك، علم أنه كان لزاماً عليها أن تغادر، تماماً مثلما أعلم أنا الآن، كانت غايتها أن تأخذني إلى هناك، كما لو كان ذلك هو قدرها، مثل نهر فولتاففا في تدفقه نحو مصبّه في البحر، ومثل المطر في نزوله إلى الأرض؛ حينما بدأت هذه الأحلام تنتابني حول فندق الدولفين، كانت هي أول ما يَرِدُ على خاطري، كانت تبحث عني، وإلا فلماذا يظهر لي الحلم نفسه المرة تلو المرة؟...بين الفانتازيا التي تعبّر عن الواقع الإفتراضي، والحياة الواقعية المعاشة، يسير موراكامي في هذه الرواية، إنها حياة المجتمع الرأسمالي الحديث، حياة البحث عن الصداقة والحب والطعام، والحاجات الإستهلاكية التي تتنامى، وأيضاً حياة الفرديّة والتمزّق والعزلة، حياة والدَيْ هاكوني: الأم مصوّرة محترفة، فنانة مشهورة، تترك ابنتها وحدها، وهمّها السفر إلى أماكن التصوير... وإلى عشّاقها... ووالد ثري يعش في عالم آخر ويسعده أن يجد شخصاً يهتم بإبنته، فيمنحه ليس فقط ما يريده، بل ما قد يشتهيه.في خلفية هذه الرواية هناك دائماً الرجل المقَنَّع، مالك الحكمة وحافظ تاريخ تحولات البشر، هذا الرجل يكرّر لبطل الرواية: يجب أن ترقص... ارقص... معبراً بذلك عن نمط الحياة المعاصرة.",
  "genres": [
    "Fiction",
    "Japan",
    "Japanese Literature",
    "Magical Realism",
    "Fantasy",
    "Contemporary",
    "Novels"
  ],
  "author": "Haruki Murakami",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/12908597"
}