{
  "title": "Once Forbidden, Twice Shy",
  "description": "Running from your problems only brings you hurtling face first into even worse baggage.After experiencing a brutal trauma in New York that I’d rather bury than address, escaping to a new job in London seems like the perfect solution. That was before I was introduced to my new boss, who is none other than my brother’s best friend. You know, the one I’ve been head-over-heels in love with forever.Jack Merrick had been my crush since I knew what one was. For years we fought the feelings; I didn’t want to humiliate myself and his excuse was not betraying my brother or parents, who had accepted him as their own. Then, the night of my college graduation party, he undressed me in my childhood bedroom and confirmed that there was no one else on this earth for him but me.When I woke the next morning he was gone, off to take a job as a coder halfway around the world. Four years and a mangled heart later, Jack is the last person I expect to see in London, and something close to fate is tricking me into thinking this is more than a coincidence. Our shared love of programming has always connected us, but now it’s the thing we’re weaponizing to get back at each other.Until one night, when the emotional scars from my attack resurface and he’s the only one to witness a massive breakdown. He coaxes out my secrets and swears to love and protect me like he couldn’t before. But with everything stacked against us, I’m not sure we can ever have what we’ve always dreamed of.Except just as we’re beginning to tackle those obstacles, I learn the truth of why he left all those years ago. And suddenly there may be no future for us at all.",
  "genres": [
    "Second Chance",
    "Romance",
    "Second Chance Romance",
    "Friends To Lovers",
    "Contemporary Romance",
    "Workplace Romance",
    "Contemporary"
  ],
  "author": "Carrie Aarons",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/61815757-once-forbidden-twice-shy"
}