{
  "title": "Stars and Smoke",
  "description": "This smoldering enemies-to-lovers novel from #1 New York Times bestselling author Marie Lu puts a superstar global phenomenon and a hotshot young spy on a collision course with danger – and Cupid’s arrow – in an electric new series perfect for fans of Nicola Yoon and Ally Carter.Meet Winter Young – International pop sensation, with a voice like velvet and looks that could kill. His star power has smashed records, selling out stadiums from LA to London. His rabid fans would move heaven and earth for even a glimpse of him – just imagine what they’d do to become his latest fling.Meet Sydney Cossette – Part of an elite covert ops group, Sydney joined their ranks as their youngest spy with plans to become the best agent they’ve ever had. An ice queen with moves as dangerous as her comebacks, Sydney picks up languages just as quickly as she breaks hearts. She's fiery, no-nonsense, and has zero time for romance – especially with a shameless flirt more used to serving sass than taking orders.When a major crime boss gifts his daughter a private concert with Winter for her birthday, Sydney and Winter's lives suddenly collide. Tasked with infiltrating the crime organization’s inner circle, Sydney is assigned as Winter's bodyguard with Winter tapped to join her on the mission of a lifetime as a new spy recruit. Sydney may be the only person alive impervious to Winter's charms, but as their mission brings them closer, she’s forced to admit that there's more to Winter Young than just a handsome face . . .Romance and danger abound in this “brilliant, breathtaking ride that will leave you clamoring for the sequel.” —Tahereh Mafi, #1 internationally bestselling author of Shatter Me .",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Mystery",
    "Fiction",
    "Fantasy",
    "Thriller"
  ],
  "author": "Marie Lu",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/61796738-stars-and-smoke"
}