{
  "title": "سعار",
  "description": "وبين الرواية والروائية عالم فائض بأسئلته الحارقة، لا يستحق أكثر من خلود ما في لجة الكتابة وسحرها الإنساني المغامر في منتهى الموهبة، حين تصير الموهبة هي السؤال، و هي الإجابة، و هي المحرض على الآتي من الأسئلة والإجابات في علاقة مشتبكة مع كل ما نؤمن به من قيم، و ما نتوارى وراءه من ضرورات، وما نمنح وجودنا تحت وطأته المستمرة من شرعية الغياب المفترضة لكينونتنا المفترضة.تشتبك بثينة العيسى في هذه الرواية، إذن، مع العالم بأكمله، عبر لغة مفرطة في رهافتها إلى حد أن تكون أغنية موزعة في معمار موسيقي يتراكم تدريجياً ما بين المتن والهامش ، فتفيض العذوبة ذهولاً وبكاء، ولكنها قاسية أيضاً إلى حد الوجع المقيم في تلافيف الروح منذ أزمان سحيقة لا بدّ أن بثينة عاشتها بتفاصيلها الدقيقة قبل أن تصير تاريخاً مشاعاً بين نساء الكرة الأرضية وهوية سرية لرجالها.هنا إذن امرأة باهية تكتشف بداياتها مرسومة على هامش من نسغ الكون بكل تجلياته، وروائية عريقة الخبرة بحرفتها، رغم أنها لم تغادر بعد الثانية والعشرين من عمرها (لا أدري بالضبط ما العلاقة المفترضة بين حجم الموهبة وعمر الموهوب؟!!)، و هي بهذه الخبرة تحاول أن تعيد صياغة العالم كله وفقا لما ترتب لديها من علائق جديدة بين الكائنات في معنى الكتابة و تاريخها أيضاً، و هي تنجح كثيراً في تلك المهمة لأنها تجيد اكتشاف الحياة عبر اكتشافها لذاتها الذاهبة في منتهى الشغف الروائي بجلد كتابي واثق من تفاصيل سيره وصيرورته، وحيل أنثوية موروثة في سبيل رسم نهاية للبقاء خلوداً في الدهشة وما تؤدي إليه.\"سعار\" نص روائي لا يريد أن يكتمل، لأنه نص مفتوح على أسئلة تدور في فضاء من القلق الوجودي الفادح في سوداويته، و لكن الفاضح في تعريته لكل ما نحاول أن نخبئه تحت ركام من الإرث الإنساني النفسي.ورغم أن \"سعار\" هو النص الروائي الثاني لكاتبته بعد نصها الأول، الجميل والمدهش بدوره، \"ارتطامٌ .. لم يسمع له دويّ\"، إلا أنني وقد كنت على تواصل مع الكاتبة وهي تكتبهما واحداً بعد الآخر، وقرأتهما، بعد ذلك مخطوطين، أرى أنها في \"سعار\" بالذات تضع سؤالها الروائي الأول بحكمة مكتسبة وذكاء فطري.. وموهبة تتألق بينهما باضطراد عبر أحداث تتنامى في أجواء خالية من الحدث التقليدي، و هي تسجل كل ذلك برصانة لغوية رغم السخرية السوداء التي نادراً ما تلجأ إليها الروائيات في ثقافة الرواية العربية الراهنة، مما أكسب هذا النص إضافة لصالح المتعة في القراءة واللذة في تتابعهما.هذه ليست مقدمة، ولكنها إشارة إلى هذه الرواية الناجحة .. وهذه الروائية الناجحة جداً .",
  "genres": [
    "Novels",
    "Audiobook"
  ],
  "author": "بثينة العيسى",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/6182049"
}