{
  "title": "Little Earthquakes: A Memoir",
  "description": "“Sarah Mandel has done something remarkable here. I found myself weeping, laughing with delight and moved with love—all in the span of the day it took me to devour this book. Filled with deliciously specific images and metaphors, clear dialogue, and rich explorations of self and others, Mandel has written—among other things—a tender witness statement of and for her body.”—Hala Alyan, author of Salt Houses A psychologist, wife, and mother chronicles her extraordinary journey with cancer while pregnant with her second baby, and the insights into life, death, trauma, and healing that she gleaned—an utterly inspiring debut memoir reminiscent of the intimacy and emotional power of Paul Kalanithi’s When Breath Becomes Air and Kate Bowler’s No Cure for Being Human. When clinical psychologist Sarah Mandel was pregnant with her second child, she began preparing for her maternity leave, juggling the demands of her soon-to-be-new baby with the needs of her patients. Noticing a lump in her breast, she assumed it was most likely a clogged milk duct. But a biopsy revealed it was not. When she went into labor, she learned that she had Stage Four cancer—devastating news that forced her to confront terminal illness as she was bringing new life into the world. But Sarah's illness took a highly improbable turn when, after three months of treatment, her second PET scan showed no evidence of disease. Sarah, however, was unable to celebrate the good news; she was frozen in a dissociated state caused by the emotional whiplash of going from oncology patient to new mother, from a terminal sentence to a shocking reprieve. As a therapist who specialized in trauma work, Sarah had utilized “narrative therapy” to help her patients. Now she Could the treatment that eased her patients’ pain successfully help her navigate her own trauma? Little Earthquakes is a beautiful and thought-provoking debut from a brave and unwavering new voice that captures the mind, sears the soul, and leaves its indelible mark on the heart.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Mental Health",
    "Unfinished",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Sarah Mandel",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/61812439-little-earthquakes"
}