{
  "title": "Crook Manifesto",
  "description": "Colson Whitehead continues his Harlem saga in a novel that summons 1970s New York in all its seedy glory.It's 1971. Trash piles up on the streets, crime is at an all-time high, the city is careening towards bankruptcy, and a shooting war has broken out between the NYPD and the Black Liberation Army. Amidst this collective nervous breakdown furniture store owner and ex-fence Ray Carney tries to keep his head down and his business thriving. His days moving stolen goods around the city are over. It's strictly the straight-and-narrow for him -- until he needs Jackson 5 tickets for his daughter May and he decides to hit up his old police contact Munson, fixer extraordinaire. But Munson has his own favors to ask of Carney and staying out of the game gets a lot more complicated - and deadly.1973. The counter-culture has created a new generation, the old ways are being overthrown, but there is one constant, Pepper, Carney's endearingly violent partner in crime. It's getting harder to put together a reliable crew for hijackings, heists, and assorted felonies, so Pepper takes on a side gig doing security on a Blaxploitation shoot in Harlem. He finds himself in a freaky world of Hollywood stars, up-and-coming comedians, and celebrity drug dealers, in addition to the usual cast of hustlers, mobsters, and hit men. These adversaries underestimate the seasoned crook - to their regret.1976. Harlem is burning, block by block, while the whole country is gearing up for Bicentennial celebrations. Carney is trying to come up with a July 4th ad he can live with. (\"Two Hundred Years of Getting Away with It!\"), while his wife Elizabeth is campaigning for her childhood friend, the former assistant D.A and rising politician Alexander Oakes. When a fire severely injures one of Carney's tenants, he enlists Pepper to look into who may be behind it. Our crooked duo have to battle their way through a crumbling metropolis run by the shady, the violent, and the utterly corrupted.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Crime",
    "Mystery",
    "Audiobook",
    "Literary Fiction",
    "New York"
  ],
  "author": "Colson Whitehead",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/61812836-crook-manifesto"
}