{
  "title": "Palestine 1936: The Great Revolt and the Roots of the Middle East Conflict",
  "description": "Winner, 2024 Sami Rohr Prize for Jewish LiteratureOne of the Wall Street Journal’s 10 Best Books of 2023Booklist Editors’ Choice in History, 2023Finalist, National Jewish Book AwardsFinalist, Sophie Brody Medal, American Library Association“Want to understand the roots of the Middle East conflict? Read this book.” —  Haaretz“Kessler’s history is key to understanding the current situation between Israelis and Palestinians.” — Booklist“[Kessler] has done an exceptional job and opened new vistas on troubles past and present.” — Wall Street JournalA gripping, profoundly human, yet even-handed narrative of the origins of the Middle East conflict, with enduring resonance and relevance for our time.In spring 1936, the Holy Land erupted in a rebellion that targeted both the local Jewish community and the British Mandate authorities that for two decades had midwifed the Zionist project. The Great Arab Revolt would last three years, cost thousands of lives–Jewish, British, and Arab–and cast the trajectory for the Middle East conflict ever since. Yet incredibly, no history of this seminal, formative first “Intifada” has ever been published for a general audience.The 1936-1939 revolt was the crucible in which Palestinian identity coalesced, uniting rival families, city and country, rich and poor in a single struggle for independence. Yet the rebellion would ultimately turn on itself, shredding the social fabric, sidelining pragmatists in favor of extremists, and propelling waves of refugees from their homes. British forces’ aggressive counterinsurgency took care of the rest, finally quashing the uprising on the eve of World War II. The revolt to end Zionism had instead crushed the Arabs themselves, leaving them crippled in facing the Jews’ own drive for statehood a decade later.To the Jews, the insurgency would leave a very different legacy. It was then that Zionist leaders began to abandon illusions over Arab acquiescence, to face the unnerving prospect that fulfilling their dream of sovereignty might mean forever clinging to the sword. The revolt saw thousands of Jews trained and armed by Britain–the world’s supreme military power–turning their ramshackle guard units into the seed of a formidable Jewish army. And it was then, amid carnage in Palestine and the Hitler menace in Europe, that portentous words like “partition” and “Jewish state” first appeared on the international diplomatic agenda.This is the story of two national movements and the first sustained confrontation between them. The rebellion was Arab, but the Zionist counter-rebellion–the Jews’ military, economic, and psychological transformation–is a vital, overlooked element in the chronicle of how Palestine became Israel.Today, eight decades on, the revolt’s legacy endures. Hamas’s armed wing and rockets carry the name of the fighter-preacher whose death sparked the 1936 rebellion. When Israel builds security barriers, sets up checkpoints, or razes homes, it is evoking laws and methods inherited from its British predecessor. And when Washington promotes a “two-state solution,” it is invoking a plan with roots in this same pivotal period.Based on extensive archival research on three continents and in three languages, Palestine 1936 is the origin story of the world’s most intractable conflict, but it is also more than that. In Oren Kessler’s engaging, journalistic voice, it reveals world-changing events through extraordinary individuals on all sides: their loves and their hatreds, their deepest fears and profoundest hopes.",
  "genres": [
    "History",
    "Nonfiction",
    "Israel",
    "Politics",
    "Jewish",
    "War",
    "Audiobook"
  ],
  "author": "Oren Kessler",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/61817859-palestine-1936"
}