{
  "title": "Gravity",
  "description": "C’est cela l’amour, et tu es mon rêve...Bryce:Hockey is my life. This game pulled me from my tiny Quebec hometown all the way to the NHL, and now? I’m the number one player in the league. Team capitaine for the Montréal Étoiles. I’m shattering records and packing arenas every night, and I’ve promised my team: we’re going to win the Stanley Cup this year.But I’m keeping big secrets. I'm thinking dangerous thoughts, and dreaming about impossible things. Like how a man’s lips might taste, or how his body might feel in my arms.I can’t go there. I’ve got to focus. Team. Hockey. Cup. What my heart wants doesn’t matter.So why am I falling head over heels at the NHL's All-Star Weekend?I can’t do this. I can’t fall for Hunter Lacey. He’s a hockey player. We’re both in the NHL. He’s on a different team. And, oh yeah, he’s straight.Hunter:I’m a middle-of-the-road, nothing-special hockey player. Good enough to be drafted into the NHL, and I’ve been on the roster for the past two years, but I’ll never make the Hall of Fame. I’m just trying to keep my head up and get through each day, until this wild ride comes to an end.Deep thinking isn’t really my thing. Look inside myself? Lotta beer and burgers there.I never thought I’d be invited to the All-Star Weekend, but here I am. And there’s my hero: Bryce Michel, league superstar.Saying hello to Bryce turns into hours spent together on the ice, and then an invite to dinner, and then days at each other's side. I’m in heaven. He’s my hero, and this is the coolest—Then Bryce’s lips land on mine, and the world turns upside down.Gravity is an MM romance featuring bi/gay awakening, friends to lovers, team shenanigans, fast-paced hockey, ice-melting sizzle, and swoony Québécois love songs.Gravity is set in the same universe as \nThe Rest of the Story\n.",
  "genres": [
    "M M Romance",
    "Sports",
    "Romance",
    "Sports Romance",
    "Hockey",
    "LGBT",
    "Contemporary"
  ],
  "author": "Tal Bauer",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/61848341-gravity"
}