{
  "title": "Two Can Play That Game",
  "description": "Funny and romantic, an upbeat YA novel about gaming, goals and getting even from a fresh new voice in contemporary fiction.How did I let my sister talk me into going out when I have a game to fix and a jerkface to destroy?Sam Khoo has one goal in life: create cool indie games. She's willing to do anything to make her dream come true - even throw away a scholarship to university. All she needs is a super-rare ticket to a game design workshop and she can kickstart her career.So when Jaysen Chua, otherwise known as Jerky McJerkface, sneakily grabs the last ticket for himself, Sam is left with no choice. It's war. Knowing all too well how their Australian-Malaysian community works, she issues him an ultimatum: put the ticket on the line in a 1v1 competition of classic video games, or she'll broadcast his duplicity to everyone. Thank you, Asian Gossip Network.Meeting in neutral locations, away from the eyes and ears of nosy aunties and uncles, Sam and Jay connect despite themselves. It's a puzzle that Sam's not sure she wants to solve. But when her dream is under threat, will she discover that there is more than one way to win?'A gloriously nerdy debut about family, culture, passion and ambition.' Tobias Madden, bestselling author of Take a Bow, Noah Mitchell'A relatable, fire-cracking story about chasing your dreams. Sam Khoo stole my heart.' Wai Chim, award-winning author of The Surprising Power of a Good Dumpling'Witty, charming and full of heart. I didn't want it to end!' Kay Kerr, acclaimed author of Social Queue and Please Don't Hug Me'Funny, romantic and heart-warming. A dazzling debut.' C.S. Pacat, New York Times bestselling author of Dark Rise",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Fiction",
    "LGBT",
    "Gaming",
    "Young Adult Romance"
  ],
  "author": "Leanne Yong",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/61841856-two-can-play-that-game"
}