{
  "title": "In Deadly Combat: A German Soldier's Memoir of the Eastern Front",
  "description": "In the hell that was World War II, the Eastern Front was its heart of fire and ice. Gottlob Herbert Bidermann served in that lethal theater from 1941 to 1945, and his memoir of those years recaptures the sights, sounds, and smells of the war as it vividly portrays an army marching on the road to ruin.A riveting and reflective account by one of the millions of anonymous soldiers who fought and died in that cruel terrain, In Deadly Combat conveys the brutality and horrors of the Eastern Front in detail never before available in English. It offers a ground soldier's perspective on life and death on the front lines, providing revealing new information concerning day-to-day operations and German army life.Wounded five times and awarded numerous decorations for valor, Bidermann saw action in the Crimea and siege of Sebastopol, participated in the vicious battles in the forests south of Leningrad, and ended the war in the Courland Pocket. He shares his impressions of countless Russian POWs seen at the outset of his service, of peasants struggling to survive the hostilities while caught between two ruthless antagonists, and of corpses littering the landscape. He recalls a Christmas gift of gingerbread from home that overcame the stench of battle, an Easter celebrated with a basket of Russian hand grenades for eggs, and his miraculous survival of machine gun fire at close range. In closing he relives the humiliation of surrender to an enemy whom the Germans had once derided and offers a sobering glimpse into life in the Soviet gulags.Bidermann's account debunks the myth of a highly mechanized German army that rolled over weaker opponents with impunity. Despite the vast expanses of territory captured by the Germans during the early months of Operation Barbarossa, the war with Russia remained tenuous and unforgiving. His story commits that living hell to the annals of World War II and broadens our understanding of its most deadly combat zone.Translator Derek Zumbro has rendered Bidermann's memoir into a compelling narrative that retains the author's powerful style. This English-language edition of Bidermann's dynamic story is based upon a privately published memoir entitled Krim-Kurland Mit Der 132 Infanterie Division. The translator has added important events derived from numerous interviews with Bidermann to provide additional context for American readers.",
  "genres": [
    "History",
    "World War II",
    "War",
    "Nonfiction",
    "Military History",
    "Military Fiction",
    "Memoir"
  ],
  "author": "Gottlob Herbert Bidermann",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/618453.In_Deadly_Combat"
}