{
  "title": "River of Ashes",
  "description": "One of Apple’s Most Anticipated Books in Mysteries & Thrillers, River of Ashes is an Adult Southern Gothic Psychological Thriller that will appeal to fans of Sharp Objects by Gillian Flynn, YOU by Caroline Kepnes, Jennifer McMahon, Darcy Coates, and Shirley Jackson.“Despite its ghosts and hauntings, this evocative tale presents an all-too-real terror that gets under your skin—and stays.” ~\nRue Morgue\n“A psychological portrait akin to \nLord of the Flies\n.” ~Midwest Book Review\nSome truths are better kept secret. Some secrets are better off dead.\nALONG THE BANKS OF THE BOGUE FALAYA RIVER, sits the abandoned St. Francis Seminary. Beneath a canopy of oaks, blocked from prying eyes, the teens of St. Benedict High gather here on Fridays. The rest of the week belongs to school and family—but weekends belong to the river.And the river belongs to Beau Devereaux.The only child of a powerful family, Beau can do no wrong. Star quarterback. Handsome. Charming. The “prince” of St. Benedict is the ultimate catch.He is also a psychopath.A dirty family secret buried for years, Beau’s evil grows unchecked. In the shadows of the haunted abbey, he commits unspeakable acts on his victims and ensures their silence with threats and intimidation. Senior year, Beau sets his sights on his girlfriend’s headstrong twin sister, Leslie, who hates him. Everything he wants but cannot have, she will be his ultimate prize.As the victim toll mounts, it becomes clear that someone must stop Beau Devereaux.And that someone will pay with their life.* * * This book contains rape, violence, and a psychopath's POV, which some readers will find disturbing.“If Gillian Flynn and Bret Easton Ellis had a book baby, it would be River of Ashes.” \n~Booktrib\n“[Beau Devereaux] makes some of Stephen King's characters appear tame by comparison.” ~Nanette Fandino-Diaz @tea.and.titles“Those into serial killers and fans of Shirley Jackson—you are not going to want to miss this.” ~RoseReviews.art.blog“Beau Devereaux is every bit the “bad boy” our mothers warned us about. Think Mark Wahlberg from \nFear \nbut imagine if he crossed paths with Sidney Prescott.” ~GothGirlOnTheTrain“A look inside the mind of a psychopath—a cautionary tale that the scariest monsters are the ones you know but never suspect.” ~Pearry Teo, PhD (Award-Winning Director of The Assent, Executive Producer of Cloud Atlas)“Chilling and suspenseful, River of Ashes is a story that mimics real-life abuse and violence in today's youth. What seems like innocent high school shenanigans quickly turns evil in the path of a predator.” ~\nSan Francisco Book Review\n“Alexandrea Weis’s novels are destined to stand along with authors such as Stephen King, Gillian Flynn, Joyce Carol Oates, and Jeffery",
  "genres": [
    "Horror",
    "Thriller",
    "Young Adult",
    "Fantasy",
    "Mystery Thriller",
    "Fiction",
    "Suspense"
  ],
  "author": "Alexandrea Weis",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/61833889-river-of-ashes"
}