{
  "title": "Taken",
  "description": "'Dinuka McKenzie has talent to burn' Dervla McTiernanA parent's worst nightmare. A case that's too close to home. The tense, must-read new Detective Kate Miles novel from the award-winning author of The Torrent. 'I was in the shower. I left Sienna in her bassinet ...When I got out ... She was gone.'Detective Sergeant Kate Miles is back from maternity leave and struggling on multiple fronts - the pressures of a second child, financial strain from her husband losing his job, and a corruption scandal that may involve her father.When an infant goes missing, Kate finds herself fronting a high-profile and emotionally fraught case. Was baby Sienna removed from her bassinet by an unknown abductor or is the answer much closer to home?Amidst a frenzied media demanding answers, and a station chief looking for any reason to remove her from the investigation, Kate is pushed to her limits, pulled between the competing demands of the family at the centre of the case and her own spiralling personal life.'Thrilling, yes. Action-packed, absolutely. Most importantly, though, utterly moving. I don't think I've ever felt as connected to a character as I am to Kate Miles, who is now, I'm happy to say, my favourite fictional detective. Dinuka McKenzie will have you feverishly turning pages, mark my words.' Ben HobsonPraise for The Torrent:'Such a good read' Val McDermid'Vivid, pacy and refreshingly original. A gripping whodunnit with heart.' Emma Viskic'Brings a fresh perspective to the crime genre ... This gripping debut will keep you turning the pages late into the night.' Petronella McGovern'A realistic, character-driven policier that holds a mirror to contemporary tensions in rural Australian life and builds expertly from slow burn to adrenaline-fuelled climax' The Age",
  "genres": [
    "Crime",
    "Mystery",
    "Thriller",
    "Fiction",
    "Australia",
    "Detective",
    "Audiobook"
  ],
  "author": "Dinuka McKenzie",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/61839163-taken"
}