{
  "title": "Stuck with Him: A hilarious and uplifting romantic comedy",
  "description": "Lucy Clark has just bought a house with her worst enemy. Some might say she’s crazy, that her sanity cracked the night she lost her business, her best friend and her house in one great margarita-themed disaster. But not Lucy, she knows that the final straw was when Zack – Mr ‘I’m your infuriatingly laidback yet impossibly ripped new yoga teacher’ – decided to put in a competing offer to buy her childhood home. Which, as it turns out, neither of them can actually afford. But Lucy isn’t a type-A perfectionist for there is no way she’s backing down without those front door keys in her hand. No price is too high, and if Zack thinks they should become housemates to afford the mortgage together… well, he’d better be prepared. But when Zack moves in – with his weird health food in the fridge and non-existent sleepwear – Lucy realises that maybe she’s the one with no clue what’s coming… A completely joyful, laugh-out-loud rom com, perfect for fans of The Hating Game and The Spanish Love Deception . What readers are saying about Danielle ‘ Had me in stitches from start to finish … The romance left my heart full and my spirits lifted .’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘ Blew me away in the best possible way . Reading it felt like being held in a warm hug by a fairy godmother and I never wanted to let go … I hereby crown Owen-Jones the Northern Queen of the Rom-Coms, and long may she reign!’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘ I laughed from the very first line … A joy to read. Quick witted, sharp and fun… Perfect .’ Bobs and Books , ⭐⭐⭐⭐⭐ ‘An amazing gem … I enjoyed it from start to finish and kept laughing out loud … I truly recommend reading this, it’s just a pure joy .’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘ Laugh out loud … A read that’ll have you devouring every word in a single sitting as you laugh, cry, and cheer for the characters.’ alohabooksandbujos , ⭐⭐⭐⭐⭐ ‘Reminded me very much of Becky Bloomwood from the Shopaholic series… it was a total joy to get lost in her world. I finished this book with a smile on my face and what more could you want from a rom-com! ’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘ WOW! … I was slow to put the book down, and quick to pick it back up . When this happens I say the book has “the pull”, and this is one of those books… Very Sophie Kinsella-esque.’ PoweredByPepsi , ⭐⭐⭐⭐⭐ ‘ Made me laugh all the way through from the first word to the last … Well worth 5 stars.’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘An absolute treat to read. Heart-warming and laugh-out-loud funny .’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘ My favourite read of 2022 … This book has it all.’ BookishxBlondie , ⭐⭐⭐⭐⭐ ‘An absolute joy … A real heart-warming hug of a book and a tonic to curl up with during the stormy weather – but would have been just as good company with a glass of fizz on a sun lounger.’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘I absolutely loved this book!… captured my attention from the start and just drew me in … You will finish the book with a warm feeling in your heart and a smile on your face .’ NetGalley reviewer, ⭐⭐⭐⭐⭐",
  "genres": [],
  "author": "Danielle Owen-Jones",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/61861022-stuck-with-him"
}