{
  "title": "Breath of Oblivion",
  "description": "Maurice Broaddus's Breath of Oblivion is the second book in the Astra Black trilogy, where the futuristic technology of Black Panther meets the scale of The Expanse and the intricate political maneuverings of Game of Thrones.Maurice Broaddus returns with Breath of Oblivion, the second book in his Astra Black trilogy, which explores the struggles of an empire. Epic in scope and intimate in voice, it follows members of the Muungano Empire―a far-reaching coalition of city-states that stretches from Earth to Titan and beyond―as it faces renewed threats to its progress.Beyond the Orun Gate, Epyc Ro and her elite soldiers are stranded. Capturing an alien ship and searching for a way home, they discover a stowaway who may be the key to overcoming the alien forces swarming all around them.On board the Cypher, Captain Stacia Chikeke is struggling to keep her ship and its fractured crew together. But the discovery of an interstellar phenomenon and the opportunity to explore unites them in a singular purpose, for now.In the slums of Indianapolis, Wachiru Adisa works to free the children of the diaspora detained in Old Earth facilities, only to be captured and sent to a nightmarish criminal justice facility, the Panopticon.On Old Earth, Ishant Sangsuwangul is the newly assigned liaison to the corporate entity running the government there. He feels like a prisoner, but must find a way to stem the tide of conflict as animosity toward his people grows.In the Badlands of Mars, Amachi Adisa and her new teacher Nehanda begin her training to learn from her past, chart her future, and unlock the power that is her birthright.In the Dreaming City, the lunar heart of Muungano power, Maulana Buhari struggles with how to lead his people. Is now the time for isolation or aggression?Together they, and all of Muungano, will guide the empire forward by any means necessary, as enemies of old and new extraterrestrial threats mount.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction"
  ],
  "author": "Maurice Broaddus",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/61884898-breath-of-oblivion"
}