{
  "title": "Women Code Breakers: The Best Kept Secret of WWII: True Stories of Female Code Breakers Whose Top-Secret Work Helped Win World War II",
  "description": "Who were the silent women whose top-secret work helped shorten World War II? Meet the female code breakers.Embedded within military intelligence and communications, wartime cryptography was a man’s world. But women did much more for secret intelligence during World War II than resupply coffee and shuffle papers.Even beyond nursing and manufacturing, women working top-secret jobs played an integral role in supporting the Allied effort. They helped shorten the length of the war, saving countless lives in the process.Bringing to light the quiet heroism of female code breakers is an opportunity to showcase the exceptional women who saved lives and changed the tide of the greatest war in human history.The life of a female codebreaker was not a simple one. Even as they applied themselves to complicated counterintelligence work and labored daily alongside their male colleagues, they fought an uphill battle on many different fronts inside and outside the office.Despite the constant need to “prove” themselves and justify their life choices to men and women alike, these brilliant women never thought of themselves as heroes, but rather as citizens performing their duty, in common with the pragmatic attitudes that many people held during the war.As such, their stories and accomplishments have remained firmly under the radar—often missing from official documentation, history books, public lore, and therefore general public awareness.The British feat of breaking the German Enigma code at Bletchley Park has been celebrated in popular culture in various books and movies, but the stories of many women who worked to break codes in the complex world of cryptography remain relatively untold.Many of the men who served in the war have been made heroes through the documentation of and telling and retelling of their daring exploits. Not so the unsung women heroes of WWII.Inside Women Code The Best Kept Secret of WWII you’ll learn the true stories of female code breakers whose top-secret work helped win World War II.By knowing the names of the heroic women codebreakers of WWII, we are finally allowing their lives and accomplishments to shine. If you are looking for a unique perspective of wartime history then Women Code Breakers: The Best Kept Secret of WWII is a great place to start!",
  "genres": [
    "History",
    "Nonfiction",
    "War"
  ],
  "author": "Elise  Baker",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/61855659-women-code-breakers"
}