{
  "title": "Snowflakes and Secrets in the Scottish Highlands",
  "description": "Step into the cosy Scottish village of Christmas where you’ll find plenty of secrets, romance and mulled wine! And join Merry McKenzie as she stays at her Aunt Ava’s cottage for the winter festivities to try and mend her broken heart…Twenty-five-year-old Merry is escaping to the Scottish Highlands for Christmas. Heartbroken by the death of her father, the man who raised her single-handedly, she needs some time to heal. Hiding away at Chestnut Cottage with only her Aunt Ava’s menagerie of pets for company seems like the perfect way to spend a peaceful December. But when she arrives, Merry discovers some curious instructions from her aunt asking her to organise Secret Santa gifts for the residents of Christmas village.Merry’s determined to try and carry out her aunt’s festive task. But on her first night in the little cottage everything goes wrong – including upsetting the handsome local vet Theo Ellis-Lee when he arrives to assist with a crazed turkey and the mischievous rabbit who’s torn apart her aunt’s gift list. Merry is completely out of her comfort zone and it doesn’t help that Theo is both infuriatingly cheerful and insanely attractive.Merry’s plans for a quiet break are quickly thwarted as Theo starts coming by every day to check on the unruly animals, and she can’t deny he sets her pulse racing. And, one by one, the friendly locals draw her out of her shell with cosy cups of tea, warm words and laughter-filled evenings in the pub. She finds herself embracing the challenge of finding the perfect gift for each of the kind-hearted people on her list. When Theo offers to help, sparks fly between them. But when the Secret Santa project forces Merry to face her heartache, she’s not sure she’s ready for a fresh start.At a crossroads in her life, will Merry decide to go home and hide from her problems or will she open her heart and stay in Christmas village?A gorgeous, winter romance to lose yourself in this Christmas. Perfect for fans of Nicola May, Trisha Ashley and Debbie Macomber – and best accompanied by a hot chocolate!",
  "genres": [
    "Christmas",
    "Romance",
    "Contemporary",
    "Chick Lit",
    "Holiday",
    "Fiction",
    "Audiobook"
  ],
  "author": "Donna Ashcroft",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/61864535-snowflakes-and-secrets-in-the-scottish-highlands"
}