{
  "title": "Force",
  "description": "Cy isn't the mating kind.Cy Pataki doesn't get attached. He doesn't do coddling. And at thirty-two, he’s old enough to know his feelings won’t change. He's a damn good agent who enjoys his job protecting Crescent City, but to keep it, he must mate the witch his pack lined up for him twenty years ago.David never got a choice...After years of training to be a perfect mate, David Reeds is in a world he doesn’t understand and where none of the rules make sense. Worse, his future mate doesn’t seem to want anything to do with someone so much younger and so very naïve. But, David refuses to disappoint his clan and his mentor. He has his training. He can meet Cy’s every need. Maybe then, Cy will see how well David can fit into his life....and was taught he should never have one.If Cy doesn't want a mate, he definitely doesn't want a servant. Gorgeous though he is, the poor kid has been brainwashed, and Cy suspects the man David calls his mentor has motives of his own. If Cy calls off their mating, he'll leave David vulnerable and in a position to be further preyed upon. But he can't mate a man who was taught only to serve, no matter how attractive he is. Cy has to show David that being someone's mate can't be his only personality trait—even if that means David will realize Cy is all wrong for him.Cy just didn't realize how sexy it would be to watch David’s personality emerge or how difficult it would become reminding his wolf he still isn't the mating kind. As Cy teaches David to stand on his own, he fights the urge to pull David right back.While Cy fights his instincts, Crescent City faces a threat powerful enough to leave their city in ruins. There’s an enemy operating within their borders and Cy's team must discover who before the city crumbles from the inside out.Force is the third book in the Lunar Wolves series and can be enjoyed as a standalone. It is a paranormal gay romance with mystery, suspense, a grouchy, sexy wolf and a young, sheltered witch who never knew the world could be full of so many choices.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Shapeshifters",
    "Magic",
    "Paranormal",
    "Romance",
    "Audiobook"
  ],
  "author": "Kiki Burrelli",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/61880778-force"
}