{
  "title": "Marcus Aurelius: Warrior, Philosopher, Emperor",
  "description": "Previous cover edition for ISBN 9780224072922For alternate cover edition see here* Marcus Aurelius - the last of Rome's 'five good emperors' - is the one great figure of antiquity who still speaks to us today, nearly 2,000 years after his death. We may thrill to the exploits of Alexander the Great, Hannibal or Julius Caesar but the only voice from the Greco-Roman world that still seems to have contemporary relevance is that of the man who ruled the Roman Empire from 161 to 180 AD.* Singled out by Hadrian as a future emperor Marcus was educated by some of the greatest scholars of his day. His correspondence with his Latin teacher Fronto provides many insights into his emerging character and his growing interest in philosophy. When he assumed the throne he issued numerous reforms favouring the less privileged, while the status of Christians remained unchanged: they were legally punishable and were subject to persecution.* Marcus fought the Parthians in the East, the German tribes in the North but finally succumbed to a plague which, for much of his reign, swept through the Empire. His Meditations, written while he was campaigning between 170 and 180, has been called the 'gospel of his life' and compared by John Stuart Mill to the Sermon on the Mount. A guide to how we should live, it holds out the prospect of spirituality for atheists, happiness without heaven, and morality without religion. It remains one of the most widely-read books from the Classical world.* Marcus' reign foreshadowed the eventual decline and fall of the Roman Empire, though his life itself represents the fulfilment of Plato's famous dictum that mankind will prosper only when philosophers are rulers and rulers philosophers. Marcus Aurelius, based on all available original sources as well as secondary scholarship in five languages, promises to be the definitive and most vivid biography to date of this monumental historical figure.",
  "genres": [
    "History",
    "Biography",
    "Philosophy",
    "Nonfiction",
    "Ancient History",
    "Classics",
    "Ancient"
  ],
  "author": "Frank McLynn",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/6186354-marcus-aurelius"
}