{
  "title": "And Then There's Margaret",
  "description": "Hey Readers!AND NOW THERE'S ZELDA comes out MAY 9 20241! Pre-order your copy today.AND THEN THERE'S MARGARET (July 2022):#1 US Amazon Bestseller - Kindle -Women's Humorous Fiction#1 US Amazon Bestseller - Kindle - Humor & Satire#1 US Amazon Bestseller - Kindle - Family and Parenting HumorFor fans of Maria Semple’s Where’d You Go Bernadette or Camille Pagan’s I’m Fine and Neither Are You, comes the perfect laugh-out-loud dramedy AND THEN THERE'S MARGARET about marriage, midlife and a controlling, manipulative and self-absorbed mother-in-law thrown into the mix. MULTI-AWARD-WINNING debut novel, AND THEN THERE'S MARGARET, takes readers on a relatable and hilarious ride, as Allie realizes the only way to survive the angst of family is to let go….and let be.\"Perfect for women’s fiction books club wanting to explore complex and turbulent family relationships. It’s a playful coming of (middle-age) novel.” –Indie ReaderWhen Allison Montgomery's beloved father-in-law and long-time confidant passes away, her mother-in-law, Margaret, 'temporarily' moves in. From rearranging the furniture and taking over the kitchen, to undermining and embarrassing Allie at every turn, including funding her daughter's escape, throwing a hissy fit at the mall, and publicly equating Allie's glass of Chardonnay to full blown alcoholism, Margaret turns Allie's life upside down causing her to bounce between a sincere desire to support her grieving mother-in-law and an intense urge to simply push her out of the nearest window.Feeling annoyed, trapped and even a little childish, Allie struggles to avoid a complete meltdown with help from her fearless and audacious best friend, a plan for reinventing herself and enjoying a second act, and, yes, a few glasses of Chardonnay. Along the way, Allie discovers the reasons behind Margaret's attitude toward her all these years. Does it help? Maybe...2022 Chick Lit Cafe - CLC Book Excellence Award Winner - Women's Fiction/Humor2022 Indie Book Awards Finalist - Chick Lit (Fiction)2022 Maxy Awards Winner - Literary & Humor2022 Readers' Choice Book Awards - Finalist - Best Adult Book2022 Readers' Favorite - Finalist - Humor/Comedy",
  "genres": [
    "Fiction",
    "Humor",
    "Book Club",
    "Contemporary",
    "Comedy",
    "Chick Lit",
    "Novels"
  ],
  "author": "Carolyn   Clarke",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/61857714-and-then-there-s-margaret"
}