{
  "title": "Hidden Scars",
  "description": "While Jamie’s cold, lifeless body lay in the morgue, Detective Kim Stone stared at the empty board in the incident room and felt her anger boil. Why were there no photos, details, or lines of enquiry?When a nineteen-year-old boy, Jamie Mills, is found hanging from a tree in a local park, his death is ruled a suicide. Detective Kim Stone’s instincts tell her something isn’t right – but it’s not her investigation and her temporary replacement is too busy waiting for the next big case to be asking the right questions.Why would a seemingly healthy boy choose to end his life?Why does his mother show no sign of emotional distress at the loss of her son?Still mending her broken mind and body from her last harrowing case, Kim is supposed to be easing back into work gently. But then she finds a crucial, overlooked Jamie had a recent injury that would have made it impossible for him to climb the tree. He must have been murdered.Quickly taking back charge of her team and the case, Kim visits Jamie’s parents and is shocked to hear that they had sent him to a clinic to ‘cure’ him of his sexuality. According to his mother, Jamie was introverted and prone to mood swings. Yet his friend speaks of a vibrant, outgoing boy.The clues to smashing open this disturbing case lie behind the old Victorian walls of the clinic, run by the Gardner family. They claim that patients come of their own accord and are free to leave at any time. But why are those that attended the clinic so afraid to speak of what happens there? And where did the faded restraint marks identified on Jamie’s wrists come from?Then the body of a young woman is found dead by suffocation and Kim makes two chilling discoveries. The victim spent time at the clinic too, and her death was also staged to look like a suicide.Scarred from an ordeal that nearly took her life, is Kim strong enough to stop a terrifying killer from silencing the clinic’s previous patients one by one?",
  "genres": [
    "Crime",
    "Thriller",
    "Mystery",
    "Fiction",
    "Detective",
    "Audiobook",
    "Suspense"
  ],
  "author": "Angela Marsons",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/61858482-hidden-scars"
}