{
  "title": "Covert Dreams",
  "description": "What if the government said that your missing wife never existed? Intrigue and conspiracy from Munich to the burning sands of Saudi Arabia.\"As he sat there, he became one gigantic spasm. His body jerked involuntarily, without interruption, and he began to spin. The world was upside down, sideways—because what couldn’t possibly be, inexplicably was. Blobs of perspiration fell onto the book. B.J. slammed it shut. He pushed the terrible pages aside. He was in such a state that the librarian looked up at him from across the room, frowning disapproval his way as sharp as Arabian swords.But B.J. didn’t notice. He couldn’t see. He was lost completely to the horror of his mind.\"If you love fast-paced international thrillers, then take on COVERT DREAMS. It is like \"reading Robert Ludlum and the Bourne series\" - Dale Roberts, mystery writer\"Don't start reading this book on an evening when you have to get up early the next morning, because you're going to find it hard to put down!\" - Nick Russell, NY Times bestselling author of the BIG LAKE seriesFrom the author of DEADLY EYES, a thrilling Caribbean mystery.EXCERPTThe Munich all around her was bustling with activity. She could hear it from all directions. Munich was a wonderful city, a fun-loving place, the live and let live ebullience of the city emanating from its every nook and cranny. She had had a lovely stay here. All of it had been so adventurous, so new, so unlike life back home in Arizona. She could vividly recall the first time she had ventured into a Munich beer garden, where the liter mugs had been so huge that she had had to lift hers with both hands, and the giggles, from him, until he too had had to use both hands.The fumbling noises he had been making came to an abrupt halt. He began stroking her cheek again. Gus looked so happy, so young, so full of life. It was so hard to imagine that he could be so heavily involved in all this horror.Gus smiled at her once more. His eyes were soft, so gentle, so caring, so loving.Maybe this was some kind of huge mistake. Maybe he wasn't going to kill her after all. Maybe everything would turn out happily ever after. Maybe. Maybe. Maybe.But then suddenly she saw it clearly. It was no fairy tale. There would be no maybe. This was real, as real as the mixture of sadness and fear that now flooded her brain.And then she died, with her eyes wide open, challenging, piercing his to the end.",
  "genres": [
    "Mystery",
    "Thriller",
    "Suspense",
    "Mystery Thriller",
    "Fiction"
  ],
  "author": "Mike  Meyer",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/12909746-covert-dreams"
}