{
  "title": "Charming CEO",
  "description": "\"He's the bane of my existence... and my brother's best friend!\" Fall for a new trope-tactic off-limits rom-com from USA Today bestselling author, Lila Monroe! Flynn McCord is ruggedly charming, impossibly annoying, and… my brother’s best friend. He’s been driving me crazy as long as I can remember - and not even in a sexy, fun ‘oh my god, don’t stop’ kind of way. Is it any wonder the only action I’m getting these days is of the solo variety, courtesy of my soon-to-be-launched adult accessory empire? The classy, top - secret adult accessory empire I’m opening… right next door to Flynn’s workshop. Where he can hear me. Testing the merchandise. Every night. Soon, the chemistry between us is impossible to ignore, even for a stubborn (fine) ass like Flynn. But as our off-limits romance sizzles, the fun and (battery-operated) games take a turn for something… real? With torn loyalties, sexy secrets, and my new business on the line, can we find a way to put the ‘love’ into enemies-to-lovers, or will this relationship run out of juice? Find out in the new hot and hilarious rom-com from Lila Monroe! BILLIONAIRE BACHELORS 1 Maverick Mogul 2 Renegade Roomie 3 Baller Boss 4 One-Week Wingman 5 Charming CEO6 The Hollywood Marriage Bargain7 The Great British Bachelor Chase PRAISE FOR \"Romantic comedy at its best!\" - Seraphim Books Reviews \"A fun and flirty feel-good story that put a smile on my face!\" - Goodreads “A funny rom-com that gives me all the laugh and fluff was exactly what I need. This quirky and heartwarming second-chance romance was fun, light and perfect to take me away from all the heaviness in life .” - Goodreads “Lila Monroe’s writing is a sure thing to put me in a good mood especially in the gray days… I smiled all the time while reading it and these characters made my day so much better.” - ItaPixie Reviews \" I love the humor in Ms. Monroe's stories! They are outrageously funny! Add to that the romance and off the charts steaminess and you get one helluva story! \" - Bibliophile Chloe \"This is a great… new series. I enjoyed playful characters, the funny moments and the steamy romance! 5 Stars. \" Reading Keeps Me Sane Blog “Lila Monroe is an author who knocks romantic comedy books out of the park . Her books are, sweet, spicy, romantic and so funn y that you cannot help but fall in love with her characters and her stories.” - Goodreads",
  "genres": [
    "Romance",
    "Billionaire Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Lila Monroe",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/61892378-charming-ceo"
}