{
  "title": "Angeline",
  "description": "After surviving a tragedy that killed her entire family, sixteen-year-old Meg joins a cloistered convent, believing it is her life's work to pray full time for the suffering of others. Taking the name Sister Angeline, she spends her days and nights in silence, moving from one prayerful hour to the next. She prays for the hardships of others, the sick and poor, the loved ones she lost, and her own atonement.When the Archdiocese of Chicago runs out of money to keep the convent open, she is torn from her carefully constructed life and sent to a progressive convent on a rocky island in the Pacific Northwest. There, at the Light of the Sea, five radical feminist nuns have their own vision of faithful service. They do not follow canonical law, they do not live a cloistered life, and they believe in using their voices for change.As Sister Angeline struggles to adapt to her new home, she must navigate her grief, fears, and confusions, while being drawn into the lives of a child in crisis, an angry teen, an EMT suffering survivor's guilt, and the parish priest who is losing his congregation to the Sisters' all-inclusive Sunday masses. Through all of this, something seems to have awakened in her, a healing power she has not experienced in years that could be her saving grace, or her downfall.In Angeline, novelist Anna Quinn explores the complexity of our past selves and the discovery of our present truth; the enduring imprints left by our losses, forgiveness and acceptance, and why we believe what we believe. Affecting and beautifully told, Angeline is both poignant and startling and will touch the hearts of anyone who has ever asked themselves: When your foundations crumble and you've lost yourself, how do you find the strength to go on? Do you follow your heart or the rules?",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Religion",
    "Contemporary",
    "Feminism",
    "Literary Fiction",
    "Coming Of Age"
  ],
  "author": "Anna     Quinn",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/61890705-angeline"
}