{
  "title": "Murder in Haxford",
  "description": "A delightful day in 1910 at the Haxford Spring Fair turns horrifying and deadly when a balloonist plummets to the earth from the blue skies above. However unlikely, it's soon discovered that this unfortunate corpse was not done in by his precipitous plunge but instead from an arrow fatally lodged in his chest. Unraveling the twisted web of intrigue that took the man's life requires the expert skills of Haxford's brilliant and sartorially splendid Chief Inspector Pignon Scorbion.But the quirky detective is not alone in this task. Aiding Scorbion in his dogged pursuit of truth and justice are his carefully chosen deputies: six quirky and unconventional thinkers from the town who meet regularly with Scorbion in Calvin Brown's barbershop to unmask ne'er-do-wells and solve local crimes. Since his move to the charming village, the enigmatic detective has also realized his growing dependence upon its bookshop's owner. Lovely and quick-witted Thelma Smith not only helps Pignon with his criminal cases, but she seems well on her way to unlocking the mysteries of his heart.Not everyone in Haxford is so cooperative. Faustin Hardcastle from the Gazette is bound and determined to ruin the town's new officer of the law with slanderous news reports of failure and misconduct. And other residents of the picture-perfect village do not welcome the inspector's inquiring eye and expert nose for trouble. When they engage in decidedly un-quaint activities like gambling, revenge, forgery, and loan sharking, it falls to Pignon Scorbion to reveal their deceit and criminal misdeeds--all in a good day's work. Once done, he and Thelma can then thoroughly enjoy a delicious dinner at the Bridgehouse Inn.",
  "genres": [
    "Mystery",
    "Historical Mystery",
    "Historical Fiction",
    "Historical",
    "British Literature",
    "Fiction",
    "Cozy Mystery"
  ],
  "author": "Rick Bleiweiss",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/61890702-murder-in-haxford"
}