{
  "title": "Devil of Dublin",
  "description": "From the Wall Street Journal bestselling author of 44 Chapters About 4 Men (inspiration for the Netflix Original series Sex/Life) comes a dark mafia romance steeped in Irish folklore.I can’t remember anymore if my grandfather’s eyes were blue or green, but I’ll never forget the way they wrinkled at the corners when he laughed at one of his own jokes. Or the way they sparkled with mischief when he told me tales about the magical creatures that dwelled in the forest behind his humble Irish sheep farm—shy fairies who liked to eat tea biscuits, cruel witches who liked to eat children, a moody lake spirit with a taste for expensive gifts.  As a child, I believed every fantastical word. But when he warned me about the mute boy who also lurked in those woods, the one the priest had declared to be the spawn of Satan himself, I refused to listen. Kellen wasn’t evil. He was kind, and beautiful, and special, and hurting. He was my friend. And with every summer I spent stolen away with him in those enchanted woods, he grew to become so much more.But when I return to Glenshire as an adult, grieving and engaged to someone else, all those legends quickly morph into nightmares. My grandfather had been right about everything, especially the boy. If only I had listened. WARNING: If you are a sensitive reader or find certain topics to be emotionally triggering, please exercise self-care and select a different book. Devil of Dublin is intended for mature audiences who enjoy dark subject matter, tortured anti-heroes, explicit adult content, graphic violence, heart-pounding suspense, fairy-tale worthy love, and gorgeous Irish scenery. If that sounds like you, then welcome to Glenshire!",
  "genres": [
    "Dark Romance",
    "Romance",
    "Dark",
    "Mafia Romance",
    "Friends To Lovers",
    "Audiobook",
    "Contemporary"
  ],
  "author": "B.B. Easton",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/61899218-devil-of-dublin"
}