{
  "title": "The Cursed Forest",
  "description": "BOOK THREE in The Sleeping Kingdom series, a fantasy fairy tale retelling crossover where the road to happiness is not always the easy path...The Cursed Forest is a dark and twisted place. Overgrown from the once prized forest of a kingdom long lost, its trees tower ten-times higher than any other in the Seven Kingdoms. With abrupt changes to its path, any traveler brave—or mad—enough to journey through its trees is at the whim of the forest to make it to their destination alive. And it is here that most of our characters now find themselves.When a messenger confirms her father never arrived in Meerreich, Amabelle takes advantage of the opportunity to escape her impending marriage to Stéphane. Intuition leads her to believe that her father tried to cut through Cursed Forest, and she soon finds herself lost amongst the looming trees. And a brush with death results in her waking in an enchanted and forgotten castle, where Amabelle learns some fairy tales are not mere stories of imagination, and not all monsters are in the forms of beasts.In D'or, Sajan is at odds with his father over Sajni's disappearance. He does not believe she is dead, and is infuriated the king will not spare men to search the forest for the missing princess. On a whim, the D'oran prince ventures into the forest alone with amateur survival skills and no plan. As the toils of the forest hit him hard, Sajan comes across Eilidh, Princess of the Southern Isles, who has her own mysterious reasons for traveling the forest alone.In Nordreich, Princess Gerda asks Kaj to venture into the woods to protect Queen Eija, the mythical true ruler of their kingdom. Kaj does not hesitate to obey despite not wanting to leave the princess's side. But when he finally meets the mysterious \"ice queen,\" things take a strange turn as he learns she has been kidnapping men from the forest for an odd purpose.And as Rapunzel and Theo make their way to the Unseen Fortress, they stumble upon a small cottage in the woods, where a peculiar set of dwarfs seem to be hiding something...THE CURSED FOREST continues the retellings of the fairy tales established in the first two novels (WHITE AS SNOW and STROKE OF MIDNIGHT) and introduces \"The Ice Queen.\" Game of Thrones meets Brothers Grimm, this is a story fairy tale fans won't want to miss!",
  "genres": [
    "Fantasy",
    "Book Club",
    "Retellings"
  ],
  "author": "Veronica Bonn",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/61886496-the-cursed-forest"
}