{
  "title": "Laid and Confused: Why We Tolerate Bad Sex and How to Stop",
  "description": "A refreshingly honest, deeply researched, and frequently hilarious deep-dive into the cultural crisis of bad sex, as one brave sex columnist recruits the counsel of coaches, psychologists, pro-dommes, and peers in the pursuit of pleasure.Far more alarming than the millennial “sex recession\"―the phenomenon of young people having less sex than previous generations―is that we’re in the middle of a bad sex epidemic that all generations are suffering from. Despite major advances in sex education, positivity, and technology, we haven’t moved the needle on better. We’re still quietly enduring unsatisfying sex, whether that’s resigning ourselves to the same three positions we secretly hate, or lying when our Bumble date asks if we’re “close” after fifteen seconds of oral. We’ve been trained to optimize everything, except our own pleasure.For journalist Maria Yagoda, bad sex was her villain origin story. After going viral for a column calling out bad sex on her college campus, she launched a career as a sex columnist, earning a global following for her wit, vulnerability, and expertise in her popular VICE series, Sex Machina . But even as a professional sex writer, most of the sex she was having landed somewhere between passable and “huh.” In search of understanding, she consulted sex therapists, psychologists, dominatrixes and sex toy creators, as well as young people of all genders and sexualities, putting her own sex life on the line―from hiring a sex coach to attending a “masturbation meditation” Zoom seminar―in order to pave a new path forward.In the vein of Come as You Are for the Trick Mirror audience, Laid and Confused presents a fresh, funny, and compassionate analysis of our current sexual moment, and offers research-based tools that will empower readers to craft the deeply pleasurable sex lives they deserve.",
  "genres": [
    "Nonfiction",
    "Sexuality",
    "Feminism",
    "Audiobook",
    "Relationships",
    "Self Help",
    "Psychology"
  ],
  "author": "Maria Yagoda",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/61885081-laid-and-confused"
}