{
  "title": "Articles on Old Kingdom Series, Including: Sabriel, Lirael, Abhorsen, Across the Wall: A Tale of the Abhorsen and Other Stories, Old Kingdom (Book Ser",
  "description": "This book consists of reprints of freely available online articles from Wikipedia about the Old Kingdom series.It does not contain any of the Old Kingdom books, or any other writings by the author of those books.Hephaestus Books represents a new publishing paradigm, allowing disparate content sources to be curated into cohesive, relevant, and informative books. To date, this content has been curated from Wikipedia articles and images under Creative Commons licensing, although as Hephaestus Books continues to increase in scope and dimension, more licensed and public domain content is being added. We believe books such as this represent a new and exciting lexicon in the sharing of human knowledge. This particular book contains chapters focused on Old Kingdom series, and Old Kingdom series books. More info: The Old Kingdom series (also known as the Abhorsen series in North America) is a trilogy of books by Garth Nix. It begins with Sabriel, followed by Lirael and Abhorsen. In addition, a novella set after the trilogy entitled Nicholas Sayre and the Creature in the Case was released, first separately for World Book Day and later as the lead story of the short story collection A Tale of the Abhorsen and Other Stories. A second short story, An Extract of the Journal of Idrach the Lesser Necromancer, was written with exclusive distribution through the official Abhorsen Trilogy web site. A second novella \"To Hold the Bridge\" will be released at some point in 2010 as part of a compilation likely titled \"Australia's Legends of Fantasy\" edited by Jack Dann and Jonathan Strahan. Garth Nix has announced two additions to the series: a prequel and a \"sequel of sorts to Abhorsen.\" While the sequel is unnamed, the prequel has the working title Clariel: The Lost Abhorsen. The books are slated to appear in 2011.",
  "genres": [],
  "author": "Hephaestus Books",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/12911315-articles-on-old-kingdom-series-including"
}