{
  "title": "Practice Makes Perfect",
  "description": "A small-town sweetheart and an emotionally unavailable bad boy try to find some common ground in this chemistry-filled romance from the author of The Cheat Sheet and When in Rome.Annie Walker is on a quest to find her perfect match—someone who complements her happy, quiet life running the local flower shop in Rome, Kentucky. But finding her dream man may be harder than Annie imagined. Everyone knows everyone in her hometown, and the dating prospects are getting fewer by the day. After she overhears her latest date say she is “so unbelievably boring,” Annie starts to think the problem might be her. Is it too late to become flirtatious and fun like the leading ladies in her favorite romance movies? Maybe she only needs a little practice . . . and Annie has the perfect person in mind to be her tutor: Will Griffin.Will—the sexy, tattooed, and absolutely gorgeous bodyguard—is temporarily back in Rome, providing security for Amelia Rose as excitement builds for her upcoming marriage to Noah Walker, Annie’s brother. He has one personal objective while on the job: stay away from Annie Walker and any other possible attachments to this sleepy town. But no sooner than he gets settled, Will finds himself tasked with helping Annie find the love of her life by becoming the next leading lady of Rome, Kentucky. Will wants no part in changing the sweet and lovely Annie. He knows for a fact that some stuffy, straitlaced guy won’t make her happy, but he doesn’t have the heart to say no.Amid steamy practice dates and strictly “educational” tutoring lessons, Annie discovers there are more layers to Will’s usual stoic attitude. As the lines of their friendship become dangerously blurred, Annie reconsiders her dream guy. Maybe her love life doesn’t need to be perfect—it just needs to be real.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Fiction",
    "Friends To Lovers",
    "Adult"
  ],
  "author": "Sarah       Adams",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/61897968-practice-makes-perfect"
}