{
  "title": "Engines of Chaos",
  "description": "\"Perfect for fans of Brent Weeks, George R. R. Martin, or David Gemmell . . . . The best traditional epic fantasy I have read in years.\" — Grimdark Magazine on Engines of Empire“An excellent start to a new fast-paced and engaging, with a properly epic setting and a cast of characters I look forward to seeing more of.” – James Islington, author of The Shadow of What Was Lost on Engines of EmpireFrom an unmissable voice in epic fantasy comes the second novel in a trilogy where guilds clash, magic fuels machines, and an empire begins a revolution. Torwyn burns as Sanctan Egelrath tightens his grip on power. The Draconate Ministry has gathered its forces, determined to eradicate the Guilds, but Rosomon Hawkspur still stands in their way.  Her only hope could lay with Lancelin Jagdor, sent to gather allies in their struggle against the usurper. Can even the greatest warrior in Torwyn hope to succeed with so many adversaries determined to stop him? Tyreta returns home with newfound strength and mysterious sorcerous abilities, only to discover it is not the land she left behind. She will have to call upon her untested powers to survive when she embarks on a mission that could turn the tide of war.  Conall, trapped in a dangerous land, has his own enemies to defeat before he can hope to escape and join the conflict that threatens his family. Even if he succeeds, he must overcome the demons that threaten from within or face damnation.  Though Rosomon is vastly outnumbered, and her family lost, she is determined to strike back against her enemies. But saving her homeland might prove an impossible task. “Epic fantasy fans listen This is the good stuff. Highly recommended.” —Kirkus (starred review) on Engines of Empire For more from R. S. Ford, check Age of Uprising:Engines of Empire Engines of Chaos",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Steampunk",
    "Audiobook",
    "Fiction",
    "High Fantasy",
    "Adult"
  ],
  "author": "Richard S. Ford",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/61918520-engines-of-chaos"
}