{
  "title": "Reasons Why Not to Date Your Nemesis",
  "description": "There’s a new sheriff in town…And he’s her worst nightmare.\nReason #1: Ben Crawford is Olivia Knight’s long-time arch rival. They’ve been sworn enemies ever since she wore overalls to school one day, and he asked her in homeroom where she parked her cow. Now that he’s back, it doesn’t appear much has changed. He’s still arrogant. He’s still trouble. And this time, he’s got a badge and handcuffs. Which will make murdering him and disposing of his body much more challenging for her.Reason #2: Sheriff Ben has done a lot of growing up during his time away from Shell Grove. He went and got himself some muscles and tattoos, and has the nerve to wear that sheriff’s uniform absurdly well. For some reason, that’s all she can seem to focus on whenever they cross paths. All the nice changes he’s made, instead of how vehemently she’s vowed to hate his guts for all eternity.Reason #3: The complicated connection that has forever entwined their lives doesn’t have a pleasant backstory. As adults, they should be able to forget what happened when they were teenagers and move on. But in a small town where everyone has long memories, there are reminders everywhere of the nasty events that destroyed both of their families years ago. And she’s not sure their growing feelings for each other are enough to forgive the sins of the past and carve out a future…together.Ben has a secret. A big one. The longer he’s in Shell Grove and surrounded by people who know his sordid history, the more likely that secret is going to come out. But if it does, Olivia will never speak to him again. Which will not do. Because he’s finally realized that Olivia is the reason why he came back to town in the first place. And if he doesn’t want to lose her forever, he needs to correct the mistakes he made a long time ago and prove he’s not the NEMESIS she’s always thought him to be.",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Melanie Munton",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/61925890-reasons-why-not-to-date-your-nemesis"
}