{
  "title": "Journey from the Land of No: A Girlhood Caught in Revolutionary Iran",
  "description": "An emotional, evocative coming-of-age story about one deeply intelligent and perceptive girl’s attempt to find her own voice in prerevolutionary Iran “An immensely moving, extraordinarily eloquent, and passionate memoir.”—Harold BloomRoya Hakakian was twelve years old in 1979 when the revolution swept through Tehran. The daughter of an esteemed poet, she grew up in a household that hummed with intellectual life. Family gatherings were punctuated by witty, satirical exchanges and spontaneous recitations of poetry. But the Hakakians were also part of the very small Jewish population in Iran who witnessed the iron fist of the Islamic fundamentalists increasingly tightening its grip. It is with the innocent confusion of youth that Roya describes her discovery of a swastika—“a plus sign gone awry, a dark reptile with four hungry claws”—painted on the wall near her home. As a schoolgirl she watched as friends accused of reading blasphemous books were escorted from class by Islamic Society guards, never to return. Only much later did Roya learn that she was spared a similar fate because her teacher admired her writing.Hakakian relates in the most poignant, and at times painful, ways what life was like for women after the country fell into the hands of Islamic fundamentalists who had declared an insidious war against them, but we see it all through the eyes of a strong, youthful optimist who somehow came up in the world believing that she was different, knowing she was special.A wonderfully evocative story,  Journey from the Land of No  reveals an Iran most readers have not encountered and re-creates a time and place dominated by religious fanaticism, violence, and fear with an open heart.",
  "genres": [
    "Iran",
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "History",
    "Biography",
    "Jewish"
  ],
  "author": "Roya Hakakian",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/129118.Journey_from_the_Land_of_No"
}