{
  "title": "Dragon Wings",
  "description": "Fiction is about to have a new breed of characters never before featured! The Amethyst Dragon series will introduce you to a whole new brand of creatures, called Dragon Fae. Making their home in Avalon, Dragon Fae are half dragon and half fairy. They are rare creatures, and are the chosen protectors of the fairy realm, as well as humans in the mortal realm. Dragon Fae can take on the form of a dragon, but when in fairy form they do not have wings. In Book One, Dragon Wings, we meet Dade Blue-Therror, the Amethyst Dragon. He is dubbed this not just for his amethyst eyes, but because he was born of a Blue clan Spring Fairy and a Red clan Summer Dragon. Dade is also Queen Mab's grandson, and heir to the throne of the Seelie Court. When he comes to the earthly realm with his family for his first assignment as Gaia's sentinel, he isn't prepared for what awaits him.Shelby Mercy, high school junior and popular member of Shelbyville, Kentucky's \"in crowd\" has everything she ever wanted in life, including the affections of Marshall Townes, Shelby High's beloved football star. But she doesn't have the kind of adventure she reads about in her romance novels. When she literally runs into Dade at his mother's new shop on the Square, she can't get him out of her mind. But Dade isn't interested in getting involved with human girls. He avoids her at all cost, but something about her is hard to resist. The harder he fights it, the farther he falls.Dragon Wings is a story of everlasting love, passion, fire and fury. Fairy tale meets modern romance in this exciting, thought-provoking story. As battle lines are drawn, darkness and light fight for control. And only one warrior was born to walk both light and dark - the Amethyst Dragon. But who can Dade really trust? The fairies who cannot lie, yet tell creative truths, or the mortals he has always been so suspicious of? Will he save the girl he loves and protect the two realms from the threat posed by the evil Winter Dragon?The Amethyst Dragon series will take readers on a walk back in time, while still being firmly rooted in present day. In Dade's world, chivalry is not dead, and Avalon still exists on a plane that holds fast to simple truths. Fairy magic is real, Morgan le Fay is real, and with the help of Dade, the Amethyst Dragon, Camelot could rise again. Enjoy the stories of King Arthur and the Knights of the Round Table? This series is for you! So join us as the tale unfolds, and enter a world that few have glimpsed. Welcome to Avalon, the world of the elusive Dragon Fae. Slip through the gates, and fall in love with the Amethyst Dragon, his best friend Leo, the Sunrise Dragon, and Dade's aunt Tryamon, Keeper of the Forest. There's plenty of room, so bring your silver bough for the Ferryman. And remember, once you're there, you may never want to leave. But remember, with dragons, you can get burned...",
  "genres": [
    "Fantasy",
    "Dragons",
    "Young Adult",
    "Fae"
  ],
  "author": "D.C. Grace",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/12911827-dragon-wings"
}