{
  "title": "Her Worthy Rake",
  "description": "Sparkling Regency romance full of wit, warmth and mystery from a fabulous new voice. If you like Georgette Heyer or all things Bridgerton, you'll love this. Is falling for this rake a mistake?Owen Tattershall might not have a title or immeasurable wealth like other gentlemen of his ilk, but he does have rather excellent taste in the waistcoat department-and taste counts for a lot amongst the ton. It also doesn't hurt that his adopted mother is the dowager Marchioness of Faye and his kind-of-cousin is the Duke of Woodhal. Unfortunately, prestige didn't save his family from the ravages of war, and now what's left is held together by nothing more than heartbreak, hope and bravado. To keep his memories of the war at bay, Owen immerses himself in his work ... until the day Sophy Calder comes colliding into his life.Sophy has been fending for herself ever since her twin brother was press ganged to fight against Napoleon's forces. But the war ended almost two years ago, and still he hasn't returned. Knowing something dreadful has happened, Sophy is determined to find her missing brother, even if it means infiltrating the world that snatched him from her. But when she encounters Owen, she quickly finds her growing attraction for the only man who's taken her seriously threatening her long-mastered control.An addictive romp from start to finish, this delightful Regency romance is set in the world of The Unworthy Duke, but is a standalone read.PRAISE FOR CHARLOTTE ANNE: 'Secrets and scars that run deep ... a delightful Regency twist on Beauty and the Beast!' -Alison Stuart, author of The Postmistress'Charming characters, witty banter, a delightful romp from a sparkling new voice in historical romance.' -Allison Butler, author of the Borderland Brides series",
  "genres": [
    "Historical",
    "Regency"
  ],
  "author": "Charlotte Anne",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/61910047-her-worthy-rake"
}