{
  "title": "You'll Never Know, Vol. 1: A Good and Decent Man",
  "description": "You’ll Never Know is the first graphic novel from C. Tyler (Late Bloomer)and sure to be one of the most acclaimed books of the year. It tells the story of the 50-something author’s relationship with her World War II veteran father, and how his war experience shaped her childhood and affected her relationships in adulthood. “You’ll Never Know” refers not only to the title of her parents’ courtship song from that era, but also to the many challenges the author encountered in uncovering the difficult and painful truths about her Dad’s service—challenges exacerbated by her own tumultuous family life.You’ll Never Know is Tyler’s first first full-fledged graphic novel (after two volumes of short stories). Unlike many other graphic memoirs which have opted for simple, stylized drawings and limited color or black and white, You’ll Never Know makes full use of Tyler’s virtuosity as a cartoonist: stunningly rendered in detailed inks and subtle watercolors, it plunges the reader headlong into the diverse locales: her father’s wartime experiences and courtship, her own childhood and adolescence, and contemporary life.The unique landscape format, and the lush variety of design choices and rendering techniques, make perusing You’ll Never Know like reading a family album—but one with a strong, compelling, sharply told story.You’ll Never Know’s release schedule and format emulate those of Chris Ware’s ACME Novelty Library:three beautifully designed, large-format hardcover volumes released annually to complete a trilogy of astonishing breadth, depth, and sensitivity.Nominated for two 2010 Will Eisner Comic Industry Awards: (Best Writer/Artist: Nonfiction; Best Painter/Multimedia Artist: Interior Art).",
  "genres": [
    "Graphic Novels",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Comics",
    "World War II",
    "Adult"
  ],
  "author": "Carol Tyler",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/6192276-you-ll-never-know-vol-1"
}