{
  "title": "Anne McCaffrey Pern Collection",
  "description": "Dragonseye (also Red Star Rising): Thread: deadly silver strands that fall from the sky like rain, devouring every organic thing in their path—animals, plants, and people alike. Who could believe that such a horrible thing could exist? After all, it’s been two hundred years since Thread supposedly fell on Pern. No one alive remembers that first onslaught. There’s no sign of it anywhere in the world. Only the dragons, originally created to be a weapon against Thread, are still around to remind people that once before their population was decimated, their hopes and dreams and livelihoods almost destroyed forever. For two centuries the dragonriders have been practicing and training, passing down from generation to generation the Threadfighting techniques learned on the fly by their besieged ancestors. And most of the Lord Holders are prepared to protect their people, to provide sanctuary, to assemble groundcrews to search out and destroy any Thread that might be missed by the dragons soaring overhead. All but one. Even now the ominous signs are appearing: the violent winter storms and volcanic eruptions that are said to herald the approach of the Red Star and its lethal spawn. Impossibly, one stubborn Lord Holder, Chalkin of Bitra, refuses to believe—and that disbelief could spell disaster for all of Pern. So while the dragonriders desperately train to face an enemy they’ve never fought before, they and the other Lord Holders must find a way to deal with Chalkin and protect Bitra.The Masterharper of Pern: In a time when no Thread has fallen for centuries—when, indeed, many are beginning to dare to hope that Thread will never fall again—a boy is born to Harper Hall. His name is Robinton, and he is destined to be one of the most famous and beloved leaders Pern has ever known. It is a perilous time for harpers. They sing of Thread, yet more and more people are beginning to doubt the return of that deadly scourge. They teach reading, writing, history, but Fax—who hates the harpers in general—is determined to keep his growing area of influence free of the learning that might sow unrest. And they extol the dragonriders, whom many view increasingly as a drain on the resources of the Holds. Now harpers are being turned away from the holds; and, worse yet, they are being derided, attacked, even beaten. It is the climate of unrest that Robinton will come into his own. For despite the tragedies that beset his own life, he continues to believe in music and in the dragons, and is determined to save his beloved Pern from itself…so that the dragonriders can be ready to fly against the dreaded Thread when it at last returns!The Skies of Pern: Now that Pern can look forward to a future without the threat of Threadfall, the people are free to leave their protective stone holds and spread across more of the planet, as well as improve their lives with the newly discovered ancient technology. Not everyone is happy, though. Some resist the change, and consider anything new to be an “abomination”. And the dragonriders are uncertain: without Thread, what will their purpose be in Pernese society? Then a new danger—again from the skies—looms. Once again, the people must pull together… And turn to the only ones who can solve the crisis: the dragonriders of Pern!",
  "genres": [
    "Fantasy",
    "Dragons",
    "Fiction",
    "Science Fiction Fantasy",
    "Science Fiction"
  ],
  "author": "Anne McCaffrey",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/61937.Anne_McCaffrey_Pern_Collection"
}