{
  "title": "Knot Running From Fate",
  "description": "JACEIn the years since everything changed in Screaming Woods, including myself, the only place I’ve found solace is in the woods I protect as a park ranger. I’m not sure how to deal with my new…attributes as a wolfman. What if I go feral? What if I can’t control the monster I was made into? Every year this goes on, I retreat farther from humanity and closer to the animal I’ve become. I don’t get close to anyone, which is for the best. I’m destined to be alone now; at least that’s what I assumed. Until I meet Dakota.Dakota moves to town to open a gourmet pet treat business, but I know there is more to the story. I didn’t know I had a future beyond being a monster. Fate has given me something else—her, my mate. Now I’ll do anything to keep her safe and make her mine, even accept the monster I’ve become.DAKOTAWhen looking for a place to open a brick-and-mortar store for the business I run with my best friend, I wanted to take the opportunity to move far away. My ex is obsessed with me and not in a dark romance kind of way, more in a creepy, scary, restraining order kind of way. Something was calling me to Screaming Woods, so I took a chance.Opening Paws Up is going well. The town is welcoming and a little odd. Just the way I like things. I’ll be able to build a new, safe life here. I’ll be able to stay out of trouble and focus on the business.Then Jace growls his way into my life. He’s a wolfman who loves nature and takes offense to my business, though I can’t understand why. It’s not like I’d suggest he try my treats…unless he wanted to. I have a lot to learn about Screaming Woods and the monster whose fate is entwined with mine. Hopefully my past won’t come back to haunt me and try and take it all away from me. Even if it does, I’m knot running from fate.*18+ If you like alpha heroes and an insta-love story that is sweet and spicy but isn’t necessarily simple, then this is for you. No cheating with a guaranteed HEA. It is a standalone but is loosely related to my Denver Family series (Banks Ink., Suburban Outcasts and Higgins Security). Meet Dakota in Double Dog Dare (Lassoed in Love Series).*Twelve of your favorite authors are heading to Screamer Woods, where the monsters mash with their human soulmates. These monsters are tired of hiding in the shadows and ready to fall in love. Go into the woods and meet your new book boyfriend, he might have scales, claws, or fangs, but he’s 100% irresistible.",
  "genres": [
    "Paranormal",
    "Romance",
    "Monsters",
    "Paranormal Romance",
    "Novella",
    "Fantasy",
    "Fiction"
  ],
  "author": "Ember Davis",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/61949431-knot-running-from-fate"
}