{
  "title": "Uncle of the Year: And Other Debatable Triumphs",
  "description": "Candid, hilarious essays from the star of The Book of Mormon, Girls, and Big Mouth on anxiety, ambition, and the uncertain path to adulthood, which ask, how will we know when we get there?In Uncle of the Year, Andrew Rannells wonders: If he, now in his early forties, has everything he’s supposed to need to be a true adult–a career, property, a well-tailored suit–why does he still feel like an anxious twenty-year-old climbing his way toward security? Is it because he hasn’t won a Tony, or found a husband, or had a child? And what if he doesn’t want those things? (A husband and a child, that is. He wants a Tony.)In essays drawn from his life and career, Rannells argues that we all pretend we are constantly winning. And with each success, we act like we’ve reached the pinnacle of happiness (for our parents), maturity (for our friends), success (for our bosses), and devotion (for our partners). But if “adulting” is just a pantomime that’s leaving us unmoored, then we need new markers of time, new milestones, new expectations of what adulthood is–and can be.Along the way, Rannells looks back, reevaluating whether his triumphs were actually failures–and his failures, triumphs–and exploring what it will take to ever, ever feel like he has enough. In essays like “Uncle of the Year,” he explores the role that children play in his life, as a man who never thought having kids was necessary or even possible—until his siblings have kids and he falls in love with a man with two of his own. “It’s an Honor to Be Eligible” reveals the thrills and absurdities of the awards circuit (and the desire to be recognized for your work). And in “Horses, Not Zebras,” he shares the piece of wisdom that helped him finally come to terms with crippling anxiety and perfectionism.Filled with witty and honest insights and observations, and a sharp sense of humor, Uncle of the Year challenges us to take a long look at who we're pretending to be, who we know we are, and who we want to become.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Humor",
    "LGBT",
    "Queer",
    "Essays"
  ],
  "author": "Andrew  Rannells",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/61928015-uncle-of-the-year"
}