{
  "title": "Intent to Kill",
  "description": "An angsty second-chance, enemies-to-lovers romance brought to you by Amy Barnett. For fans of car chases, epic fight scenes and badass female main characters.He’s back to seek his revenge. But she’s engaged to his worst enemy.Win Her Back. Or Kill Trying.Five years after faking his death Adam Vandemilio returns to his organized crime driven hometown to enact his revenge, only to find the love of his life now engaged to the man who nearly murdered him.“He took everything from me. Now I have to take it back. This is non-negotiable, and I can’t do it without you.”Adam and Mercedes, lovers and partners in crime, almost had it all. Until a single encounter with Dorian Blake - head of the Blake Family Crime Empire - nearly ends Adam's life and separates them for good.Five years later Adam returns to Ridge City, Florida, his tropical organized crime driven hometown to enact his revenge. But his friends and his city have moved on without him. And Mercedes? She's now engaged to the man who nearly murdered him.Adam must rope his friends into his ill-advised revenge scheme to take down Dorian Blake. It will take deadly opponents, fast cars, near-misses, epic fights and, worst of all, facing his own failings, if he wants to win back his friends, his empire, and his girl.“What are you doing sleeping next to him every night?!Wearing his ring on your finger? You don’t love him, you don’t even like him!I know what love looks like on you. You’re not wearing it right now.You are not marrying that idiot.”There's only one thing he knows for certain. Mercedes is his. He'll win her back. Or kill trying.Dorian Blake has to die.Intent to Kill is dark, enemies to lovers, second chance romance set in a tropical organized crime city. Contains explicit language, explicit scenes and dark gang romance themes.",
  "genres": [
    "Second Chance",
    "Romance",
    "Contemporary"
  ],
  "author": "Amy  Barnett",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/61929575-intent-to-kill"
}