{
  "title": "Vaccinated: One Man's Quest to Defeat the World's Deadliest Diseases",
  "description": "\"Medical writing at its finest.\"—David Oshinsky, author of Polio and winner of the Pulitzer Prize for History Respected physician Paul Offit tells a fascinating story of modern medicine and pays tribute to one of the greatest lifesaving breakthroughs—vaccinations—and the medical hero responsible for developing nine of the big fourteen vaccines which have saved billions of lives worldwide. This edition includes a new foreword by the author. Maurice Hilleman’s mother died a day after he was born and his twin sister was stillborn. Believing that he had escaped an appointment with death, he made it his life’s work to see that others could do the same. The fruits of his labors were nine vaccines that practically every child receives, everyday miracles of modern medicine that have eradicated some of the most common—and devastating—diseases, including mumps and rubella. Offit, a vaccine researcher himself who co-invented the rotavirus vaccine, befriended Hilleman and, during the great man’s final months, interviewed him extensively about his life and career. Those conversations are the heart of Vaccinated . In telling Hilleman’s story, Offit takes us around the globe and across time, from the days of Louis Pasteur, to today, when a childhood vaccine can protect women from cervical cancer and stop a deadly pandemic like Covid-19. Yet these preventative treatments have come under increasing attack from both the left and right, and the anti-vaxxer movement that began with false reports over autism is growing at an alarming rate, threatening society’s well-being, and especially those whose conditions prevent them from being vaccinated.  Offit makes an eloquent and compelling case for Hilleman’s importance, arguing that his name should be as well-known as Jonas Salk. Vaccinated reminds us of the value of vaccines and the power of science to save lives and protect our well-being.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Medicine",
    "Medical",
    "Biography",
    "Health"
  ],
  "author": "Paul A. Offit",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/619379.Vaccinated"
}