{
  "title": "It's Not Unusual to Be Loved by an Alien",
  "description": "A sexy alien living incognito on Earth meets a sci-fi loving nerd who wants to rock his universe. What could possibly go wrong? Besides the unexpected tentacles and the accidental Mating Courtship Ritual, that is....RIVER SULLIVANAs a bona fide sci-fi nerd and total X-phile—the truth is out there—I’ve always believed in aliens. Duh. But I never thought I’d actually find them on Earth–let alone right here in Las Vegas! Now I’ve stumbled onto a big freakin’ secret and found my very own hot AF alien. I’m head over heels, but he’s being a total grump and holding back. How do I make him realize a geeky sunshine guy like me is just what he needs in his life? Did I mention he also has tentacles?!?! #HolyHentaiFantasyBatman #SwoonworthyAlien #SignMeUpSugar #MakeItSo #VivaLasVegasKAI GENAROThe last thing I need in my life is a chatterbox twink who’s determined to woo me and could expose the secret existence of aliens on Earth to all humankind. Everything about him annoys me, including his stupidly attractive halo of golden curls and his bright green ‘come hither’ eyes. To make matters worse, he’s been recruited to work for the alien Alliance on Earth, and I’m assigned to keep him out of trouble. I don’t care how attractive he is. I don’t date humans! Except, my tentacles may have accidentally started the Mating Courtship Ritual with him…It’s Not Unusual To Be Loved by an Alien (Tentacular Tales #1) is a (102,000 words) M/M sci-fi rom com featuring an adorkable twink with unexpected secrets and a slight obsession with extraterrestrials, the reluctant alien he wants to make his boo, tentacles with a mind of their own, zany extraterrestrial shenanigans in Sin City, and enough humor to fill an entire spaceship. This is the first book in the series. There is no cheating, and this book ends with a HFN. Never fear, the series guarantees readers an HEA by the end!",
  "genres": [
    "M M Romance",
    "Aliens",
    "Science Fiction",
    "Romance",
    "Paranormal",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Chloe  Archer",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/61989826-it-s-not-unusual-to-be-loved-by-an-alien"
}