{
  "title": "Wildflower: A Memoir",
  "description": "This extraordinary memoir of struggle and perseverance offers new ways of envisioning economic equality for everyone--from a leading activist and fashion pioneer.Aurora James's story is not a \"success story.\" Or at least, it shouldn't be told that way. Having dropped out of high school, struggled with body image, and dabbled in street racing, her eventual arrest might have been her rock bottom. But as a visionary and optimist, that experience became one of many that reshaped her way of thinking about the world. After a brief modeling stint, James discovered the real power in creating for the runway and started her own business in a flea market, a sustainable fashion line showcasing traditional African design that would become an award-winning international brand. Then she founded one of the fastest-growing social justice nonprofits, the Fifteen Percent Pledge. But none of this came from a desire to \"succeed.\" It came from a desire to forge a new creative path--and to lift others up alongside her.Already a rising star in fashion and the first Black American female designer to win a CFDA Award, James was inspired by the activism that swept the nation in the summer of 2020 to think bigger about how to empower Black business owners. With an idea and an Instagram post, she founded the Fifteen Percent Pledge, which challenges retailers to commit 15% of their shelf space and spending power to Black businesses. To date, more than two dozen of the world's most recognized retailers have taken the pledge, redirecting $10 billion in revenue to Black brands.Empowering and full of heart,  Wildflower is the story of how Aurora James got to where she is now and a rallying cry for those eager to make change.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Fashion",
    "Audiobook",
    "Business",
    "Feminism"
  ],
  "author": "Aurora  James",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/61984801-wildflower"
}