{
  "title": "The Dolphins of Pern",
  "description": "When the first humans came to settle the planet Pern, they did not come alone: intelligence-enhanced dolphins also crossed the stars, to colonize the oceans of the new planet while their human partners settled the vast continents. But then disaster struck in the form of Thread, deadly silver spores that fell like rain from the sky, devouring everything--and everyone--in their path. And as the human colonists' dreams of a new, idyllic life shattered into a desperate struggle for survival,the dolphins were forgotten, left to make their own life in the seas of PernAs time went by, human memory of dolphins was lost to legend, and only the occasional tall tale of \"shipfish\" rescuing fishermen lost at sea kept the legend alive. But the dolphins never forgot, and from generation to generation they preserved their oral hisotry against the day when humans at last might remember their old friends, and once again the seas would resound with the ringing of the dolphins' bells from docks and ships...Now, centuries later, the dragonriders of Pern were on the verge of ridding their planet of Thread forever. But T'lion, a young bronze rider, was not old enough to participate in that great venture. Instead, he and his dragon, Gadareth, were relegated to conveying people from place to place--until he and Readis, son of the Lord Holder of Paradise River Hold, made contact with the legendary \"shipfish.\"And as the dragonriders grappled with the ending of an era, T'lion, Readis, and the dolphins faced the start of a new one: reviving the bond between land- and ocean-dwellers, and, in the process, resurrecting the dreams of the first colonists of Pern...",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Dragons",
    "Fiction",
    "Science Fiction Fantasy",
    "Adult",
    "Adventure"
  ],
  "author": "Anne McCaffrey",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/61972.The_Dolphins_of_Pern"
}