{
  "title": "The Secret Book of Flora Lea",
  "description": "When a woman discovers a rare book that has connections to her past, long-held secrets about her missing sister and their childhood spent in the English countryside during World War II are revealed.In the war-torn London of 1939, fourteen-year-old Hazel and five-year-old Flora are evacuated to a rural village to escape the horrors of the Second World War. Living with the kind Bridie Aberdeen and her teenage son, Harry, in a charming stone cottage along the River Thames, Hazel fills their days with walks and games to distract her young sister, including one that she creates for her sister and her sister alone—a fairy tale about a magical land, a secret place they can escape to that is all their own.But the unthinkable happens when young Flora suddenly vanishes while playing near the banks of the river. Shattered, Hazel blames herself for her sister’s disappearance, and she carries that guilt into adulthood as a private burden she feels she deserves.Twenty years later, Hazel is in London, ready to move on from her job at a cozy rare bookstore to a career at Sotheby’s. With a charming boyfriend and her elegantly timeworn Bloomsbury flat, Hazel’s future seems determined. But her tidy life is turned upside down when she unwraps a package containing an illustrated book called Whisperwood and the River of Stars . Hazel never told a soul about the imaginary world she created just for Flora. Could this book hold the secrets to Flora’s disappearance? Could it be a sign that her beloved sister is still alive after all these years?As Hazel embarks on a feverish quest, revisiting long-dormant relationships and bravely opening wounds from her past, her career and future hang in the balance. An astonishing twist ultimately reveals the truth in this transporting and refreshingly original novel about the bond between sisters, the complications of conflicted love, and the enduring magic of storytelling.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Book Club",
    "Audiobook",
    "Books About Books",
    "Historical"
  ],
  "author": "Patti Callahan Henry",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/61964751-the-secret-book-of-flora-lea"
}