{
  "title": "The Settled Homeless",
  "description": "In this novel, Dr Theodor Rae, a renowned name in the upper echelon of global academics, depicts his world as he saw it.Ted’s personal life was in shambles from his early childhood. He grew up in the shelter of a prestigious residential school and then one premier engineering institute in India. Both helped him earn the due recognition for his prodigious scholastic capabilities but did not plant his roots in that country’s soil. Since the time he set out for his doctoral and postdoc studies in the USA, providence turned Ted into a truly global citizen. When the recession interrupted his research, Ted worked in the USA and Germany for a multinational corporate house in software until he found a job of his choice at a prestigious university in England. Although his duties here, as earlier, made him visit many other countries, including Australia, he gladly became a permanent resident of the UK.His brilliant academic performance often showered Ted with accolades and encomiums, to be treated with his utter indifference. The coveted employment positions did not offer him any lasting sense of satisfaction. The eventful career journey of this erudite scholar, homeless and lonely since his early years, kept Ted unaware of what unrecognised yet insatiate cravings left his life without clear direction or purpose. He allowed himself no time to ask why he was always driven more by eventualities than long-term goals of his own. A successful man on many counts, nothing ever happened to Ted that could erase the scars of his being so lonely and homeless throughout his life, and he kept those buried.It was no deliberate design by either but a chain of events that brought Nelly, a girl student from his alma mater and again of remarkable aptitude and accomplishments, close to him. In the beginning, Ted was Nelly’s mentor when this impressive professor, endowed with his lifelong asset – a commendable sense of humour – created a profound mark on the girl. After Nelly came to study at the same university as Ted, they became closer, more when the subsequent Covid outbreak marooned them together in Ted’s residence. Ted was in love without being fully conscious of it. However, he felt the long-lived company of someone so caring, affectionate, and adorable to be the singularly blissful experience of his life. Only after some situational developments separated them was the realisation crystal clear before Ted. He could feel how meaningless his life would be in the absence of Nelly, which he continued lamenting; no forcibly set professional priorities helped him overcome this ache.Fortunately for Ted, Nelly, who understood everything for a long time, had the sense to return to him, carrying a lot of wisdom to share. They could not and had no more reason to withhold the innermost feelings towards each other. Finally, they decided to build a home for them to settle in, weaving its fabrics with their love to set an example before the individualists like they earlier were.The saga is full of remarkable personalities, insightful observations, and intriguing viewpoints. It lifts the veil of myths, enveloping the extraordinary personae akin to Ted, and reveals the simple humans hidden underneath. Distancing these awe-inspiring characters with respect and reverence is proven a mistake, it being so easy for anybody to relate to their intrinsically simple weal and woe.",
  "genres": [
    "Fiction",
    "Contemporary"
  ],
  "author": "Rover V.",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/61967540-the-settled-homeless"
}