{
  "title": "The Boy and the Dog",
  "description": "Winner of the Naoki Prize Perfect for fans of The Guest Cat and Before the Coffee Gets Cold  'It’s no wonder the author won the prestigious Naoki Prize for this novel, which is at times heartwarming and suspenseful, detailing true resilience and survival.'  Belfast Telegraph One dog changes the life of everyone who takes him in on his journey to reunite with his first owner in this inspiring tribute to the bond between humans and dogs and the life-affirming power of connection. Following a devastating earthquake and tsunami, a young man in Japan finds a stray dog outside a convenience store. The dog’s tag says “Tamon,” a name evocative of the guardian deity of the north. The man decides to keep Tamon, becoming the first in a series of owners as the dog journeys south to find the boy whom disaster tore him from.  Over the course of five years, Tamon will be taken into six vastly different homes, the final one belonging to his beloved first owner, Hikaru, a boy who has not spoken since the trauma of the tsunami. An agent of fate, Tamon is a gift to everyone who welcomes him into their life. At once heart-rending and heart-warming, intimate and panoramic, suspenseful and luminous, this bestselling, award-winning novel weaves a feel-good tale of survival, resilience, and love beyond measure. “Heartrending . . . Powerfully demonstrates how love and loyalty can overcome obstacles . . . and how a dog’s love can save a person in every possible way.”  Booklist  “Affecting . . . Moving . . . Never feels sentimental or overdrawn . . . [Seishu Hase] proves himself a gifted storyteller.”  Publishers Weekly  “Heartbreakingly moving in its simplicity . . . A touching meditation on shining lights in the face of trauma and hopelessness.”  Kirkus Reviews",
  "genres": [
    "Fiction",
    "Japan",
    "Japanese Literature",
    "Animals",
    "Contemporary",
    "Dogs",
    "Literary Fiction"
  ],
  "author": "Seishū Hase",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/61991790-the-boy-and-the-dog"
}