{
  "title": "Allie's Enforcer",
  "description": "MilesMy teammates love to razz me about my literary habits.A hockey player who loves to read? Unheard of, right?I always let their teasing roll off my back and keep my head in the game, until they send a curvy little firecracker to my door with a special delivery. And by \"special delivery\" I mean the filthiest books the jerks could find in Silver Spoon Falls. Now, my head is everywhere except in the game...and so is my heart. Both are tangled up in the smart-mouthed little goddess who thinks she can fight what’s happening between us. Allie Mackenzie is wrong, and I intend to prove it to her. Repeatedly, in fact.AllieSurely the universe is just toying with me.A hot hockey player who loves to read? Way too good to be true.Then he keeps showing up at my bookstore to buy books, and I think I just found my Kryptonite. Someone send help because I do not have time for Miles Temptation, I mean Temptest, or his wicked ways. But oh man, when he smirks at me, my heart rate goes into overdrive, and my body comes alive. This is bound to end in disaster...right?!What we wanted: professional athletes. What we got: stick-wielding madmen who look good in TEAM COLORS, play hard, and love harder. It's a good thing this is Silver Spoon Falls because these hunky hockey players fit right in.Welcome the Falcons to the roster! These over-the-top athletes are about the play the most important game of all: the game of love. And the sassy, curvy women of Silver Spoon Falls have no intention of going down without a fight. Let the games begin!Silver Spoon Falls is getting a professional hockey team and these hunky athletes are about to play the most important game of all. The game of love! The sassy, curvy ladies of Silver Spoon Falls are going to bring them to their knees.Come along with Loni Ree and Nichole Rose as we build our own little world-the Silver Spoon Falls Universe where forever means exactly that.We hope you'll join us as we introduce you guys to even more of the men and women who call Silver Spoon Falls home in the Silver Spoon Falls series, the Silver Spoon Underworld series and the Silver Spoon Falls Falcons series.",
  "genres": [
    "Sports",
    "Romance",
    "Sports Romance",
    "Contemporary Romance",
    "Hockey",
    "Novella",
    "Fiction"
  ],
  "author": "Loni Ree",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/62001003-allie-s-enforcer"
}