{
  "title": "A Dream So Wicked",
  "description": "A Sleeping Beauty Retelling\nA vicious rivalry.A forbidden desire.A curse only her enemy can break.After twenty years stuck in a fae convent with no word from whoever abandoned her there, Briony Rose is all out of hope. But when her parents suddenly claim her and reveal she’s a lost fae princess, she’s burdened with the weight of a kingdom on the brink of collapse. To secure her family’s precarious position, she must marry a wealthy human stranger. She would have done her duty with pride…if it weren’t for Thorne Blackwood.Thorne Blackwood harbors three things: a secret name, a love for baked goods, and a long-standing plan for revenge on the family that destroyed his own. Briony Rose—a woman born to be his nemesis—provides the solution. With a single touch, he controls her. And through that control, he tricks her into triggering a curse that sends her family into one hundred years of enchanted sleep.But Briony isn’t the soft princess he expected her to be. She’s just as sharp and cunning as he is, and when she traps him in a bargain to reverse her family’s curse, he has no choice but to join a tense alliance. He too stands to gain from her plans, for if they break the sleeping spell, his own family will return from their forced slumber.To accomplish their goal, they must cooperate on one task: pair Briony with a husband who will make her parents proud. It should be easy. Thorne has connections while Briony has wit and beauty. What neither of them expects is the forbidden desire that burns in their darkest hearts…ACOTAR meets Kingdom of the Wicked in this standalone fairytale retelling of Sleeping Beauty. If you like enemies-to-lovers romance where the villain gets the girl, you’ll love this swoon-worthy story in the Entangled with Fae series.*NOTE this book is upper YA/NA featuring mature situations, moderate violence and gore, substance abuse, and some adult language. The romance is slow burn but leads to moderate steam.\nA Dream So Wicked\n is a complete stand-alone novel set in the same world as The Fair Isle Trilogy. Journey back to Faerwyvae or begin your adventure for the first time with this enchanting tale. Each book in the \nEntangled with Fae\n series can be read on its own and in any order. Happily ever after guaranteed!",
  "genres": [
    "Fantasy",
    "Romance",
    "Retellings",
    "Fae",
    "Fantasy Romance",
    "Romantasy",
    "New Adult"
  ],
  "author": "Tessonja Odette",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/62004185-a-dream-so-wicked"
}