{
  "title": "Mooncakes",
  "description": "Uma aventura mágica sobre família, livros, amores e demôniosNova Huang é uma jovem bruxa de nacionalidade chinesa e americana. Ela trabalha na peculiar livraria de suas avós, que vendem obras de bruxaria, grimórios mágicos e livros raros sobre espíritos e suas manifestações. Em uma noite de lua cheia, Huang é atraída por um lobo branco até uma floresta e se depara com ume antigue crush de infância, Tam Lang, que sob eterna ameaça das forças das trevas precisa desesperadamente de ajuda.Roteirizado por Suzanne Walker e ilustrado por Wendy Xu, Mooncakes é uma história de autodescoberta. Tratando de temas como acolhimento familiar, autoconhecimento e laços que resistem à passagem do tempo, o lançamento da marca DarkSide® Graphic Novel nos presenteia com uma trama repleta de aventura, protagonizada por personagens cativantes e diversos que estão compreendendo sua verdadeira essência e transformando o mundo que querem chamar de lar.Huang é uma pessoa com deficiência auditiva que passa pela experiência do luto após o falecimento dos seus pais. Tam, não binárie e que possui poderes de licantropia, tenta seguir em frente após o total desacolhimento de sua própria família — todos esses sentimentos transbordam diante de um mundo que sempre recusou abraçar sua cria.Determinadas a ajudar Tam, Huang e suas avós unem forças para combater a ameaça — um culto ávido por reivindicar a magia dos lobos e disposto a fazer de tudo para atingir seu objetivo. A perigosa batalha contra o mal reacende sentimentos latentes e testa poderes mágicos nesta encantadora leitura com um apaixonante romance friends-to-lovers, capaz de evocar os sentimentos mais puros da nossa velha infância.Finalista do Goodreads Choice Awards, do Cybils Award e indicado ao Prêmio Hugo, Mooncakes é a leitura perfeita para fãs de O Príncipe e a Costureira, Francis e Floresta dos Medos. A atmosfera bruxesca também conecta a marca DarkSide® Graphic Novel com a magia do universo Magicae.Wendy Xu é ilustradora e quadrinista, estabelecida no Brooklyn. Seus trabalhos foram publicados no Catapult, blog de fantasia e ficção científica da Barnes & Noble, e no Tor, entre outros veículos. Atualmente trabalha como editora assistente, fazendo curadoria de livros infantis e juvenis.Suzanne Walker é escritora e editora, residente de Chicago. Publicou ficções curtas na Clarkesworld e artigos de não ficção na Uncanny Magazine. Deu palestras em várias convenções sobre a representatividade de deficiências na fantasia e na ficção científica e também sobre a importância da remuneração justa para autores marginalizados.“Se Mooncakes fosse um feitiço, seria um encantamento de boas-vindas que se aloja com carinho nas partes mais aconchegantes de uma casa e faz as plantas crescerem. Eu gostaria de poder viver dentro deste quadrinho.”— Casey McQuiston, autora de Vermelho, Branco e Sangue Azul e Eu Beijei Shara Wheeler —“Mooncakes é encantador.”— Tillie Walden, autora de Spinning e On a Sunbeam —“Este quadrinho é a história de amor fantástica e alegre que todos precisamos e que vai restaurar sua fé na magia.”— Charlie Jane Anders, autora de Todos os Pássaros no Céu —",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "LGBT",
    "Young Adult",
    "Romance",
    "Queer",
    "Comics"
  ],
  "author": "Suzanne  Walker",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/62015646-mooncakes"
}