{
  "title": "The Best Bread Ever: Great Homemade Bread Using your Food Processor",
  "description": "When Charlie van Over makes his bread, he breaks all the rules of classic bread baking.  He doesn't proof the yeast.  He uses cold water instead of warm.  He mixes the dough in a food processor for forty-five seconds instead of kneading it by hand.  He lets the dough rise in a cool place.  The results?  Perfect crusty-on-the-outside baguettes with texture, taste, and aroma.  Light brioche with buttery crisp crusts and fluffy, saffron interiors.  Chewy bagels with hardy, smooth crusts.  A rich walnut loaf studded with nuts and scented with the full flavor of whole wheat.  A homey cherry babka with a crunchy cinnamon sugar topping.  How is this possible?Like many inventors, Charlie came across his technique by accident.  At a party for Carl Sontheimer, founder of Cuisinart, the company that first introduced the food processor to American home cooks, it was suggested to Charlie that he mix his dough in a food processor.  Thus began several years of experimentation and, finally, a foolproof method for making perfect bread every time.Now you can re-create Charlie van Over's great bread for yourself.  And what's even more amazing is that Charlie's is a hands-off, rather than a hands-on, method.  Once the dough is mixed in the food processor, there's no kneading.  Just place it in a bowl at room temperature to allow the flavors to develop.  Have to run out suddenly for a few hours?  No problem.  Just put the dough in the refrigerator until you're ready.  You won't have to keep baker's hours or become a professional to make wonderful bread at home.Once you've mastered the basic technique, the possibilities are endless.  Fougasse, Ciabatta, Semolina Bread, pizza, Danish Twists, and even sourdough Olive Rosemary Bread and Idaho Potato Rolls.  Have a favorite bread?  Charlie even explains how to convert any recipe to The Best Bread Ever method.The Best Bread Ever provides easy-to-follow instructions for more than sixty breads, step-by-step photographs, helpful advice for troubleshooting your food processor, rich color photographs of Charlie's bread, and recipes for using bread in bread puddings, soups, and other dishes.  As Jacques Pépin says in his foreword, \"Get your ingredients and equipment together and follow Charlie's remarkable method.  You will never be without good bread again.\"",
  "genres": [
    "Cookbooks",
    "Food",
    "Cooking"
  ],
  "author": "Charles Van Over",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/620179.The_Best_Bread_Ever"
}