{
  "title": "Until It Hurts: America's Obsession with Youth Sports and How It Harms Our Kids",
  "description": "Near the end of a long season, fourteen-year-old baseball pitcher Ben Hyman approached his father with disappointing, if not surprising, his pitching shoulder was tired. With each throw to home plate, he felt a twinge in his still maturing arm. Any doctor would have advised the young boy to take off the rest of the season. Author Mark Hyman sent his son out to pitch the next game. After all, it was play-off time.Stories like these are not uncommon. Over the last seventy-five years, adults have staged a hostile takeover of kids' sports. In 2003 alone, more than 3.5 million children under age fifteen required medical treatment for sports injuries, nearly half of which were the result of simple overuse. The quest to turn children into tomorrow's superstar athletes has often led adults to push them beyond physical and emotional limits.In Until It Hurts , journalist, coach, and sports dad Mark Hyman explores how youth sports reached this problematic state. His investigation takes him from the Little League World Series in Pennsylvania to a prestigious Chicago soccer club, from adolescent golf and tennis superstars in Atlanta to California volleyball players. He interviews dozens of children, parents, coaches, psychologists, surgeons, sports medicine specialists, and former professional athletes. He speaks at length with Whitney Phelps, Michael's older sister; retraces the story of A Very Young Gymnast , and its subject, Torrance York; and tells the saga of the Castle High School girls' basketball team of Evansville, Indiana, which in 2005 lost three-fifths of its lineup to ACL injuries. Along the way, Hyman hears numerous about a mother who left her fifteen-year-old daughter at an interstate exit after a heated exchange over her performance during a soccer game, about a coach who ordered preteens to swim laps in three-hour shifts for twenty-four hours.Hyman's exploration leads him to examine the history of youth sports in our country and how it's evolved, particularly with the increasing involvement of girls and much more proactive participation of parents. With its unique multiple perspective-of history, of reporting, and of personal experience-this book delves deep into the complicated issue of sports for children, and opens up a much-needed discussion about the perils of youth sports culture today. Hyman focuses not only on the unfortunate cases of overzealous parents and overly ambitious kids, but also on how positive change can be made, and concludes by shining a spotlight on some inspirational parents and model sports programs, giving hope that the current destructive cycle can be broken.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Sociology",
    "Baseball"
  ],
  "author": "Mark   Hyman",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/6202526-until-it-hurts"
}