{
  "title": "Mountain Man Box Set",
  "description": "Includes FIVE Mountain Man Books:1. Mountain Man FixatedI’m a city girl.I don’t do nature.It sucks.Bugs, bears, poison ivy.You name it, I hate it.So, when my niece asks me to accompany her on a camping trip, I’m horrified.But I’m a good aunt, so I say yes.Well, that was a huge mistake.One of many.Forgetting the bug spray. That was a mistake.So was thinking I could control a canoe.Spoiler alert: I can’t.When I get irrevocably lost from the group in the mountain wilderness, I think I’ve made a fatal mistake.Until Cyrus finds me.He’s big, strong, and the toughest man these mountains have ever seen.But he goes absolutely weak when he sees me.An obsession takes over and he’s not about to let me go.Is there anything in the survival guide for when a burly mountain man becomes obsessed with you?Spoiler alert: Nope. There’s not.2. My Mountain Man MuseI’ve always dreamed of renting a cottage in the mountains for a week to write a romance novel and now I’m finally here.I have everything I need.- Log cabin on a secluded mountain (check)- A week off work to do nothing but write (check)- A light snow falling outside as I sit under a blanket at the desk (check)- An amazing love story that writes itself (what’s the opposite of a check?)It’s my second day here and I haven’t written one word.Can you still get writer’s block if you’re not a real writer?It’s all a disaster until I’m wandering through the woods and see some much-needed inspiration.It comes in a big, bearded, growly package.His name is Jayden Rowe and he’s a rugged mountain man who says he owns everything on this mountain.Including me.Suddenly, with Jayden’s shirtless body to gawk at while he chops wood, the words start flowing and my book comes alive.But when it’s time to write the love scene, the words dry up and I have nothing.What I need is a little mountain man inspiration to get the book going again.Research. That’s what I need.Hot, sweaty, sultry research with my gorgeous new mountain man friend.That’s when I decide that I’m going to seduce Jayden……for research purposes of course.3. Mountain Man RescuedMy home was burning.The mountains were on fire.Then, out of the ashes, came an angel.Kennedy.One look and I knew that I needed her.When I saw those stunning green eyes and delicious curves, I knew I would do anything to make her mine.But Kennedy isn’t here on her own.She’s surrounded by other convicts and a half dozen armed guards.They’re part of a program using prisoners to help fight the wildfires.They’re determined to keep her in chains.I’m determined to break her free.Kennedy may be a convict, but I know she’s innocent. I can feel it.That orange jumpsuit isn’t fooling me.I’ll break any damn law I have to in order to bring my new obsession home.And I’ll do anything to make this angel mine and keep her in the mountains where she belongs.4. Mountain Man Taken5. Mountain Man Obsessed",
  "genres": [],
  "author": "Olivia T. Turner",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/62017239-mountain-man-box-set"
}