{
  "title": "A Duet with the Siren Duke",
  "description": "She sold her soul to a siren and now he’s come to collect. Victoria risks everything to leave a dangerous marriage and gain a second chance at life. But when her escape goes awry, she finds herself caught in the strong embrace of a mysterious siren, forced to choose: temporary salvation or immediate death. And so, a cursed deal is struck. Five years later, Victoria is alive—and the world’s finest ship captain. But her debt to the siren looms while her conniving ex has demanded a king’s ransom as the final price of her freedom. Victoria refuses to cause her family to suffer any more on her behalf, and is determined to make things right before her time is up. But that time is cut short. The siren comes for her. Six months early. Taken to the magical and deadly Eversea, home of the sirens, Victoria discovers she’s the sacrifice upon which all sirens pin their hopes. If they want to appease an angry god and save a world on the brink of destruction, then they need her. Which gives her the perfect leverage. Victoria strikes a new bargain: the Siren Duke will help save her family, and she’ll fulfill his demands. It’s a good bargain until a flicker of passion ignites in the scarred remnants of Victoria's heart, threatening all she's worked for. As the sacrifice for the God of Death, she’s meant to give up everything that draws her to the world of the living. But that’s impossible when all she can think about is how this handsome siren’s song, and his hands, make her feel very much alive. In a realm of ancient magic, submerged secrets, and forgotten gods, can love find a place among shattered hearts as they race against time and the blossoming of forbidden desires? Or will the delicate songs of their hearts be silenced once and for all? A Duet with the Siren Duke is a complete, *stand alone novel*. It’s for readers looking for a fantasy romance with deep lore, second-chance love, sacrifice, forbidden and slow-burn romance that sizzles on the page, and a happily ever after where love triumphs over all. While it is set in the Married to Magic universe, readers can start with this book as all Married to Magic novels are stand alones.",
  "genres": [
    "Fantasy",
    "Romance",
    "Romantasy",
    "Fantasy Romance",
    "Magic",
    "Adult",
    "Mermaids"
  ],
  "author": "Elise Kova",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/62009833-a-duet-with-the-siren-duke"
}