{
  "title": "A Brief History of Intelligence: Evolution, AI, and the Five Breakthroughs That Made Our Brains",
  "description": "Equal parts Sapiens, Behave, and Superintelligence, but wholly original in scope, A Brief History of Intelligence offers a paradigm shift for how we understand neuroscience and AI. Artificial intelligence entrepreneur Max Bennett chronicles the five “breakthroughs” in the evolution of human intelligence and reveals what brains of the past can tell us about the AI of tomorrow. In the last decade, capabilities of artificial intelligence that had long been the realm of science fiction have, for the first time, become our reality. AI is now able to produce original art, identify tumors in pictures, and even steer our cars. And yet, large gaps remain in what modern AI systems can achieve—indeed, human brains still easily perform intellectual feats that we can’t replicate in AI systems. How is it possible that AI can beat a grandmaster at chess but can’t effectively load a dishwasher? As AI entrepreneur Max Bennett compellingly argues, finding the answer requires diving into the billion-year history of how the human brain evolved; a history filled with countless half-starts, calamities, and clever innovations. Not only do our brains have a story to tell—the future of AI may depend on it. Now, in A Brief History of Intelligence, Bennett bridges the gap between neuroscience and AI to tell the brain’s evolutionary story, revealing how understanding that story can help shape the next generation of AI breakthroughs. Deploying a fresh perspective and working with the support of many top minds in neuroscience, Bennett consolidates this immense history into an approachable new framework, identifying the “Five Breakthroughs” that mark the brain’s most important evolutionary leaps forward. Each breakthrough brings new insight into the biggest mysteries of human intelligence. Containing fascinating corollaries to developments in AI, A Brief History of Intelligence shows where current AI systems have matched or surpassed our brains, as well as where AI systems still fall short. Simply put, until AI systems successfully replicate each part of our brain’s long journey, AI systems will fail to exhibit human-like intelligence. Endorsed and lauded by many of the top neuroscientists in the field today, Bennett’s work synthesizes the most relevant scientific knowledge and cutting-edge research into an easy-to-understand and riveting evolutionary story. With sweeping scope and stunning insights, A Brief History of Intelligence  proves that understanding the arc of our brain’s history can unlock the tools for successfully navigating our technological future.",
  "genres": [
    "Science",
    "Nonfiction",
    "Artificial Intelligence",
    "History",
    "Psychology",
    "Technology",
    "Neuroscience"
  ],
  "author": "Max Solomon Bennett",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/62050269-a-brief-history-of-intelligence"
}