{
  "title": "The Meadows",
  "description": "\"A story of pain, injustice, love, resistance, and hope, this glorious book will lodge inside you and make you feel everything.” —Helena Fox, award-winning author of How It Feels to FloatA queer, YA Handmaid’s Tale meets Never Let Me Go about a dystopian society bent on relentless conformity, and the struggle of one girl to save herself and those she loves from a life of liesEveryone hopes for a letter—to attend the Estuary, the Glades, the Meadows. These are the special places where only the best and brightest go to burn even brighter. When Eleanor is accepted at the Meadows, it means escape from her hardscrabble life by the sea, in a country ravaged by climate disaster. But despite its luminous facilities, endless fields, and pretty things, the Meadows keeps dark secrets: its purpose is to reform students, to condition them against their attractions, to show them that one way of life is the only way to survive. And maybe Eleanor would believe them, except then she meets Rose.Four years later, Eleanor and her friends seem free of the Meadows, changed but not as they’d hoped. Eleanor is an adjudicator, her job to ensure her former classmates don’t stray from the lives they’ve been trained to live. But Eleanor can’t escape her past . . . or thoughts of the girl she once loved. As secrets unfurl, Eleanor must wage a dangerous battle for her own identity and the truth of what happened to the girl she lost, knowing, if she’s not careful, Rose’s fate could be her own.A raw and timely masterwork of speculative fiction, The Meadows will sink its roots into you. This is a novel for our times and for always—not to be missed.\"Evocative prose and worldbuilding shot through with equal parts melancholy and hope\" —PW (starred review)“Timely and gripping, [with] a new revelation always around the corner” —Kirkus Reviews\"Atmospheric and unsettling . . . Belongs in every collection\" —Natalie C. Parker, author of the Seafire series“Extraordinary” —Helena Fox, author of How It Feels to Float",
  "genres": [
    "Young Adult",
    "LGBT",
    "Dystopia",
    "Science Fiction",
    "Contemporary",
    "Lesbian",
    "Queer"
  ],
  "author": "Stephanie Oakes",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/62052292-the-meadows"
}