{
  "title": "Cosmic Scholar: The Life and Times of Harry Smith",
  "description": "“The first comprehensive biography of this hipster magus . . . [John Szwed] allows different sides of Smith’s personality to catch blades of sun. He brings the right mixture of reverence and comic incredulity to his task.” ―Dwight Garner, The New York TimesGrammy Award–winning music scholar and celebrated biographer John Szwed presents the first biography of Harry Smith, the brilliant eccentric who transformed twentieth century art and culture.He was an anthropologist, filmmaker, painter, folklorist, mystic, and walking encyclopedia. He taught Patti Smith and Robert Mapplethorpe about the occult, swapped drugs with Timothy Leary, had a front-row seat to a young Thelonious Monk, lived with (and tortured) Allen Ginsberg, was admired by Susan Sontag, and was one of the first artists funded by Guggenheim Foundation. He was always broke, generally intoxicated, compulsively irascible, and unimpeachably authentic. Harry Smith was, in the words of Robert Frank, “the only person I met in my life that transcended everything.”In Cosmic Scholar , the Grammy Award-winning music scholar and celebrated biographer John Szwed patches together, for the first time, the life of one of the twentieth century’s most overlooked cultural figures. From his time recording the customs of Native American tribes in the Pacific Northwest and Florida to his life in Greenwich Village in its heyday, Smith was consumed by an unceasing desire to create a unified theory of culture. He was an insatiable creator and collector, responsible for the influential Anthology of American Folk Music and several pioneering experimental films, but was also an insufferable and destructive eccentric who was unable to survive in regular society, or keep himself healthy or sober.Exhaustively researched, energetically told, and complete with a trove of images, Cosmic Scholar is a feat of biographical restoration and the long overdue canonization of an American icon.Includes black-and-white and color images",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "Art",
    "History",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "John F. Szwed",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/62039161-cosmic-scholar"
}