{
  "title": "Dinner with the President: Food, Politics, and a History of Breaking Bread at the White House",
  "description": "A wonderfully entertaining, often surprising narrative history of presidential food: from Washington's lack of it at Valley Forge to Trump's well-done steaks with ketchup--what they ate, why they ate it, and what it all means--from the co-author of My Life in France. The American presidents have been hosts to some of the most significant moments in our history over meals at 1600 Pennsylvania Avenue. And during such occasions, our commanders-in-chief have understood the value of breaking bread with both friends and foes—Thomas Jefferson’s nation-building receptions in the new capital Washington, D.C.; Ulysses S. Grant’s state dinner for the king of Hawaii; Booker T. Washington’s groundbreaking supper with Teddy Roosevelt; Richard Nixon’s practiced use of chopsticks to pry open China; Jimmy Carter’s détente between Israel and Egypt at Camp David.Here, Alex Prud’homme invites readers into the White House kitchen to reveal the sometimes curious tastes of twenty-six of America’s most influential presidents, how their meals were prepared and by whom, and the ways in which their food policies affected people around the world. As each president grew into his distinguished role, his personal tastes evolved White House menus over time—from simple eggs and black coffee for Abraham Lincoln during the Civil War and celebratory turtle soup after, to squirrel stew for Dwight Eisenhower, jelly beans and enchiladas for Ronald Reagan, and arugula for Barack Obama. What our leaders say about food touches on everything from our nation’s shifting diet and local politics to global trade, science, religion, war, class, gender, race, and so much more.Prud’homme also pulls back the curtain on overlooked figures like George Washington’s enslaved chef, Hercules Posey, whose meals burnished the president’s reputation before the cook narrowly escaped to freedom, or pioneering First Ladies, such as Dolley Madison and Jackie Kennedy, who used food and entertaining to build political and social relationships. As he weaves these stories together, Prud’homme reveals that food is not just fuel when it is served to the most powerful people in the world. It is a tool of communication, a lever of power and persuasion, a form of entertainment, and a symbol of the nation.",
  "genres": [
    "Nonfiction",
    "History",
    "Food",
    "Politics",
    "Audiobook",
    "American History",
    "Biography"
  ],
  "author": "Alex Prud’homme",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/62049591-dinner-with-the-president"
}