{
  "title": "Animal Spirits: The American Pursuit of Vitality from Camp Meeting to Wall Street",
  "description": "“[A] master class in American cultural and intellectual history.” ―Sarah E. Igo, The New York Times Book Review“Jackson Lears is the preeminent cultural historian of the American empire. This book is another masterpiece in his magisterial corpus.” ―Cornel WestA master historian’s retrieval of the spiritual visions and vitalisms that animate American life and the possibilities they offer today.In Animal Spirits , the distinguished historian Jackson Lears explores an alternative American cultural history by tracking the thinkers who championed the individual’s spontaneous energies and the idea of a living universe against the strictures of conventional religion, business, and politics. From Puritan times to today, Lears traces ideas and fads such as hypnosis and faith healing from the pulpit and stock exchange to the streets and the betting table. We meet the great prophets of American vitality, from Walt Whitman and William James to Andrew Jackson Davis (the “Poughkeepsie Seer”) and the “New Thought” pioneer Helen Wilmans, who spoke of the “god within―rendering us diseaseless incarnations of the great I Am.\"Well before John Maynard Keynes stressed the reliance of capitalism on investors’ “animal spirits,” these vernacular vitalists established an American religion of embodied mind that also suited the needs of the marketplace. In the twentieth century, the vitalist impulse would be enlisted in projects of violent and racially charged national regeneration by Theodore Roosevelt and his legatees, even as African American writers confronted the paradoxes of primitivism and the 1960s counterculture imagined new ways of inspiriting the universe. Today, scientists are rediscovering the best features of the vitalist tradition―permitting us to reclaim the role of chance and spontaneity in the conduct of our lives and our understanding of the cosmos.Includes 8 pages of black-and-white images",
  "genres": [
    "History",
    "Nonfiction",
    "Economics",
    "Philosophy",
    "American History",
    "Politics"
  ],
  "author": "Jackson Lears",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/62039221-animal-spirits"
}