{
  "title": "Defenders of the Faith: Charles V, Suleyman the Magnificent, and the Battle for Europe, 1520-1536",
  "description": "In his Warriors of God and Dogs of God , James Reston, limned two epochal conflicts between Islam and Christendom. Here he examines the ultimate battle in that centuries-long war, which found Europe at its most vulnerable and Islam on the attack. This drama was propelled by two astonishing young Holy Roman Emperor Charles V and Turkish sultan Suleyman the Magnificent. Though they represented two colliding worlds, they were remarkably similar. Each was a poet and cultured cosmopolitan; each was the most powerful man on his continent; each was called \"Defender of the Faith\"; and each faced strident religious rebellion in his domain. Charles was beset by the \"heresy\" of Martin Luther and his fervid adherents, even while tensions between him and the pope threatened to boil over, and the upstart French king Francis I harried Charles's realm by land and sea. Suleyman was hardly more comfortable on his throne. He had earned his crown by avoiding the grim Ottoman tradition of royal fratricide. Shiites in the East were fighting off the Sunni Turks' cruel repression of their \"heresy.\" The ferocity and skill of Suleyman's Janissaries had expanded the Ottoman Empire to its greatest extent ever, but these slave soldiers became rebellious when foreign wars did not engage them.With Europe newly hobbled and the Turks suffused with restless vigor, the stage was set for a drama that unfolded from Hungary to Rhodes and ultimately to Vienna itself, which both sides thought the Turks could win. If that happened, it was generally agreed that Europe would become Muslim as far west as the Rhine.During these same years, Europe was roiled by constant internal tumult that saw, among other spectacles, the Diet of Worms, the Sack of Rome, and an actual wrestling match between the English and French monarchs in which Henry VIII's pride was badly hurt. Would-could-this fractious continent be united to repulse a fearsome enemy?",
  "genres": [
    "History",
    "Nonfiction",
    "European History",
    "Religion",
    "Islam",
    "Biography",
    "Military History"
  ],
  "author": "James Reston Jr.",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/6203507-defenders-of-the-faith"
}