{
  "title": "The New Year's Bride",
  "description": "Kit Morgan delivers yet another fun romp through the old west! Enjoy this sweet, mail order bride story!  Sheriff Spencer Riley and his mother recently ordered his big brother Clayton a mail order bride for Christmas! (The Christmas Mail Order Bride, Holiday Mail Order Brides, Book One). Too bad neither one of them bothered to tell Clayton, so imagine his surprise, and Spencer thought it to be one of the funniest things ever...until it happened to him! \"After all,\" his mother told him. \"If Clayton can have a mail order bride for Christmas, why can't you have one for New Year's?\" So much for the annual scarf and mitten set she usually got for him this time of year! Just what sort of mail order bride was HE going to get?  Elle Barstow spent most of her life at Winslow's Orphanage but now it was time to leave and either find a job (of which there were none) become a mail order bride, or take to the streets of New Orleans and hope for the best. Becoming a mail order bride looked like the safest option, but Elle soon learned things don't always go the way we think they will. Unwittingly involved in a horrendous encounter before she leaves New Orleans, Elle can't possibly marry her future husband when she doesn't know if she's considered guilty of murder! She figures her only chance is to avoid the law, not to mention her future husband, until she finds out what really happened. Easier said than done. Her future husband IS the law!  Also by Kit Morgan:  The Christmas Mail Order Bride (Holiday Mail Order Brides, Book One) Clayton's story! Coming in January: His Forever Valentine (Holiday Mail Order Brides, Book Three)  You might also like The Prairie Bride Series beginning with His Prairie Princess! Enjoy all of Kit Morgans hilarious romps about life and romance in the old west with some of the kookiest characters around!",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Westerns",
    "Historical Fiction",
    "Christian",
    "Mail Order Brides"
  ],
  "author": "Kit Morgan",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/62074132-the-new-year-s-bride"
}