{
  "title": "Iggy Pop: Open Up and Bleed",
  "description": "“Fellow rock stars, casual members of the public, lords and media magnates, countless thousands of people will talk of their encounters with this driven, talented, indomitable creature, a man who has plumbed the depths of depravity, yet emerged with an indisputable nobility. Each of them will share an admiration and appreciation of the contradictions and ironies of his incredible life. Even so, they are unlikely to fully comprehend both the heights and the depths of his experience, for the extremes are simply beyond the realms of most people’s understanding.”—from the Prologue The first full biography of one of rock ’n’ roll’s greatest pioneers and legendary wild menBorn James Newell Osterberg Jr., Iggy Pop transcended life in Ypsilanti, Michigan, to become a member of the punk band the Stooges, thereby earning the nickname “the Godfather of Punk.” He is one of the most riveting and reckless performers in music history, with a commitment to his art that is perilously total. But his personal life was often a shambles, as he struggled with drug addiction, mental illness, and the ever-problematic question of commercial success in the music world. That he is even alive today, let alone performing with undiminished energy, is a wonder. The musical genres of punk, glam, and New Wave were all anticipated and profoundly influenced by his work.Paul Trynka, former editor of Mojo magazine, has spent much time with Iggy’s childhood friends, lovers, and fellow musicians, gaining a profound understanding of the particular artistic culture of Ann Arbor, where Iggy and the Stooges were formed in the mid to late sixties. Trynka has conducted over 250 interviews, has traveled to Michigan, New York, California, London, and Berlin, and, in the course of the last decade or so at Mojo , has spoken to dozens of musicians who count Iggy as an influence. This has allowed him to depict, via real-life stories from members of bands like New Order and the Red Hot Chili Peppers, Iggy’s huge influence on the music scene of the ’70s, ’80s, and ’90s, as well as to portray in unprecedented detail Iggy’s relationship with his enigmatic friend and mentor David Bowie. Trynka has also interviewed Iggy Pop himself at his home in Miami for this book. What emerges is a fascinating psychological study of a Jekyll/Hyde the quietly charismatic, thoughtful, well-read Jim Osterberg hitched to the banshee creation and alter ego that is Iggy Pop.Iggy Open Up and Bleed is a truly definitive work—not just about Iggy Pop’s life and music but also about the death of the hippie dream, the influence of drugs on human creativity, the nature of comradeship, and the depredations of fame.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Punk",
    "History",
    "Memoir",
    "Rock N Roll"
  ],
  "author": "Paul Trynka",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/620679.Iggy_Pop"
}