{
  "title": "Titanium Noir",
  "description": "A virtuosic mashup of Philip K. Dick and Raymond Chandler by way of Marvel—the story of a detective investigating the murder of a Titan, one of society's most powerful, medically-enhanced elites. \"Cross-genre brilliance from the superbly talented Nick Harkaway.\" —William Gibson, New York Times best-selling author of Agency. Cal Sounder is a detective working for the police on certain very sensitive cases. So when he's called in to investigate a homicide at a local apartment, he's surprised by the routineness of it all. But when he arrives on scene, Cal soon learns that the victim—Roddy Tebbit, an otherwise milquetoast techie—is well over seven feet tall. And although he doesn't look a day over thirty, he is ninety-one years old. Tebbit is a Titan—one of this dystopian, near-future society's genetically altered elites. And this case is definitely Cal's thing. There are only a few thousand Titans worldwide, thanks to Stefan Tonfamecasca's discovery of the controversial T7 genetic therapy, which elevated his family to godlike status. T7 turns average humans into near-immortal distortions of themselves—with immense physical proportions to match their ostentatious, unreachable lifestyles. A dead Titan is big news . . . a murdered Titan is unimaginable. But these modified magnates are Cal's specialty. In fact, his own ex-girlfriend, Athena, is a Titan. And not just any—she is Stefan's daughter, heir to the massive Tonfamecasca empire. As the murder investigation intensifies, Cal begins to unravel the complicated threads of what should have been a straightforward case, and it becomes clear he's on the trail of a crime whose roots run deep into the dark heart of the world.",
  "genres": [
    "Science Fiction",
    "Mystery",
    "Fiction",
    "Noir",
    "Crime",
    "Audiobook",
    "Thriller"
  ],
  "author": "Nick Harkaway",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/62052321-titanium-noir"
}