{
  "title": "A Winter Grave",
  "description": "It is the year 2051. Warnings of climate catastrophe have been ignored, and vast areas of the planet are under water, or uninhabitably hot. A quarter of the world's population has been displaced by hunger and flooding, and immigration wars are breaking out around the globe as refugees pour into neighboring countries.By contrast, melting ice sheets have brought the Gulf Stream to a halt and northern latitudes, including Scotland, are being hit by snow and ice storms. It is against this backdrop that Addie, a young meteorologist checking a mountain top weather station, discovers the body of a man entombed in ice.The dead man is investigative reporter, George Younger, missing for three months after vanishing during what he claimed was a hill-walking holiday. But Younger was no hill walker, and his discovery on a mountain-top near the Highland village of Kinlochleven, is inexplicable.Cameron Brodie, a veteran Glasgow detective, volunteers to be flown north to investigate Younger's death, but he has more than a murder enquiry on his agenda. He has just been given a devastating medical prognosis by his doctor and knows the time has come to face his estranged daughter who has made her home in the remote Highland village.Arriving during an ice storm, Brodie and pathologist Dr. Sita Roy, find themselves the sole guests at the inappropriately named International Hotel, where Younger's body has been kept refrigerated in a cake cabinet. But evidence uncovered during his autopsy places the lives of both Brodie and Roy in extreme jeopardy.As another storm closes off communications and the possibility of escape, Brodie must face up not only to the ghosts of his past, but to a killer determined to bury forever the chilling secret that George Younger's investigations had threatened to expose.",
  "genres": [
    "Crime",
    "Mystery",
    "Thriller",
    "Fiction",
    "Novels",
    "Suspense",
    "Dark"
  ],
  "author": "Peter  May",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/62058590-a-winter-grave"
}