{
  "title": "The Wolf & the Wildflower",
  "description": "A heartbroken faerie queen in search of an evening of escape awakens the heart of a grumpy wolf warrior who will bring kingdoms to their knees to claim her.When I was young, I was told that my true love would be a faerie king. I didn’t heed the warning.I tumbled into love as soon as our eyes first met, unaware that he wasn’t what he seemed.My king wanted marriage, power, devotion, and a family. He had all but one, and as our kingdom stood upon the precipice of ruin, the weight of failure tore us apart.Though it was not the war but his betrayal that sent me running to a foreign land.And straight into the arms of a one-eyed warrior.The wolf was a weapon of heartless destruction, a rogue without a real name, and nothing I was allowed to want.A week spent within his city and the walls of his threadbare home was all it took to irrevocably change everything.And nothing at all.For there was no escaping the life I’d once thought I’d cherish forever. My kingdom was dying and my king would soon start searching for his missing queen.Attempting to keep all I’d found in the heartache he’d caused would only create more.So I fled from the wolf who hadn’t learned my true identity, and I returned to my kingdom with a silent vow to heal my torn heart. I would try to forgive my faithless husband and accept my bloodstained future.But those meddlesome fates had other plans.The warrior I’d left without warning was born a hunter and conditioned to be a monster. An alpha in his own right, he would accept nothing less than what he hungered for.Even if the battle of his life delivered our hearts to their doom and our kingdoms to their knees._A standalone fantasy romance that takes place in the same world as The Savage and the Swan. Can be read on its own. Contains spice and a HEA. No cliffhanger.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fae",
    "Fantasy Romance",
    "Romantasy",
    "Paranormal",
    "Magic"
  ],
  "author": "Ella Fields",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/62058849-the-wolf-the-wildflower"
}