{
  "title": "How Dogs Think: Understanding the Canine Mind",
  "description": "How Dogs Think is “a sharp-eyed analysis and wry wit” (The Seattle Times) analysis of dog behavior from bestselling author, psychologist, and world-renowned expert, Dr. Stanley Coren. With smart humor, Cohen presents informative, in-depth, and fascinating details that shatter many common misconceptions about our four-legged friends. Bestselling author, psychologist, and world-renowned expert on dog behavior and training Dr. Stanley Coren presents the most informative, in-depth, fascinating book yet on dogs. Acclaimed for its solid scientific research and entertaining, eminently readable style, How Dogs Think gives you the insight that you need to understand the silly, quirky, and apparently irrational behaviors that dogs demonstrate, as well as those stunning flashes of brilliance and creativity that they also can display. It lets you see through a dog’s eyes, hear through his ears, and even sense the world through his nose, as Coren presents a fascinat­ing picture of the way dogs interpret their world and their human companions, and of how they solve problems, learn, and take in new information. How Dogs Think also answers questions about our canine companions that have puzzled Can dogs count? Do they have an appreciation of art or music? Can a dog learn how to do something just by watching another dog or even a person do it? Do dogs dream? What is the nature of dog personality? Which behaviors are prewired into your dog, and which can you actually change? And, can dogs actually sense future earthquakes or detect cancer? With sound behavioral science and numerous funny, informative anecdotes, experiments, and firsthand observations, How Dogs Think shatters many common myths and misconcep­tions about our four-legged friends and reveals a wealth of surprises about their mental abilities and potential. It will make you love and appreciate all dogs—including your own—in wonder­ful new ways.",
  "genres": [
    "Dogs",
    "Nonfiction",
    "Animals",
    "Science",
    "Psychology",
    "Nature",
    "Audiobook"
  ],
  "author": "Stanley Coren",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/6207875-how-dogs-think"
}