{
  "title": "The Prairie",
  "description": "In the spring of 1826, soon after the publication of The Last of the Mohicans, James Fenimore Cooper immersed himself in The Prairie. In taking Natty Bumppo from his beloved forests of New York state to the Great American Plains, Cooper was in part fulfilling his own prophecy at the end of The Pioneers. Though he was certainly recalling the periodic westward removals of Daniel Boone, one of the prototypes of Natty Bumppo, he was also responding to the ever-increasing public interest in Jefferson's Louisiana Purchase.No characterization more clearly exhibits the firmness of Cooper's vision than that of Natty Bumppo. As his colossal entrance implies, Cooper has reconceived him, and through him, the world in which he moves. Though descended from the garrulous hunter of The Pioneers and reduced to the lowly occupation of a trapper, his moral stature has undergone an apotheosis. Though he is again in The Prairie the loyal guide he was in The Last of the Mohicans, his words here take on even more striking moral force. He is both the spokesman for and the representation of, the most basic rhythm of existence, the natural cycle of life which must end in death.The metaphor of the prairie as the sea, shaped by Cooper's meditation on the relationships between Nature, God, and Man, seems to have had a fertile hold on his imagination. The sea is, as he knew by personal experience, a place of isolation and emptiness on whose surface man lives a precarious life. Imagistically Cooper's plot sets his little bands—the groups of outcasts led by Natty, Ishmael's family, the Sioux, and the Pawnees—to converge and tack away from each other. There is also much in the bursts of action—escapes, captures, shifting alliances, steering by moonlight—that evokes sea life. This same metaphor also points us to a central theme of The Prairie. Beyond the fast-paced action, the novel becomes a meditation on the ways of establishing justice between men.",
  "genres": [
    "Classics",
    "Fiction",
    "Historical Fiction",
    "Adventure",
    "Literature",
    "Westerns",
    "American"
  ],
  "author": "James Fenimore Cooper",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/621017.The_Prairie"
}