{
  "title": "Wilco: Learning How to Die",
  "description": "The intimate story of one of the great American bands of our time, creators of the controversial masterpiece Yankee Hotel FoxtrotWhen alt-country heroes-turned-rock-iconoclasts Wilco handed in their fourth album, Yankee Hotel Foxtrot , to the band’s label, Reprise, a division of Warner Brothers, fans looked forward to the release of another challenging, genre-bending departure from their previous work. The band aimed to build on previous sales and critical acclaim with its boldest and most ambitious album yet, but was instead urged by skittish Reprise execs to make the record more “radio friendly.” When Wilco wouldn’t give, they found themselves without a label. Instead, they used the Internet to introduce the album to their fans, and eventually sold the record to Nonesuch, another division of Warner. Wilco was vindicated when the album debuted at No. 13 on the Billboard charts and posted the band’s strongest sales to date. Learning How to Die traces the band’s story to its deepest origins in Southern Illinois, where Jeff Tweedy began growing into one of the best songwriters of his generation. As we witness how his music grew from its punk and alt-country origins, some of the key issues and questions in our culture are How is music of substance created while the gulf between art and commerce widens in the corporate consolidation era? How does the music industry make or break a hit? How do working musicians reconcile the rewards of artistic risk with the toll it exacts on their personal life?This book was written with the cooperation of Wilco band members past and present.  It is also fully up to date, covering the latest changes in personnel and the imminent release of the band’s fifth album, A Ghost Is Born , sure to be one of the most talked-about albums of 2004.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Collections"
  ],
  "author": "Greg Kot",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/62088.Wilco"
}