{
  "title": "Coolies and Cane: Race, Labor, and Sugar in the Age of Emancipation",
  "description": "2007 Winner of the Merle Curti Intellectual History Award of the Organization of American Historians, 2006 Winner of the History/Social Science Book Award of the Association of Asian American Studies How did thousands of Chinese migrants end up working alongside African Americans in Louisiana after the Civil War? With the stories of these workers, Coolies and Cane advances an interpretation of emancipation that moves beyond U.S. borders and the black-white racial dynamic. Tracing American ideas of Asian labor to the sugar plantations of the Caribbean, Moon-Ho Jung argues that the racial formation of \"coolies\" in American culture and law played a pivotal role in reconstructing concepts of race, nation, and citizenship in the United States. Jung examines how coolies appeared in major U.S. political debates on race, labor, and immigration between the 1830s and 1880s. He finds that racial notions of coolies were articulated in many, often contradictory, ways. They could mark the progress of freedom; they could also symbolize the barbarism of slavery. Welcomed and rejected as neither black nor white, coolies emerged recurrently as both the salvation of the fracturing and reuniting nation and the scourge of American civilization. Based on extensive archival research, this study makes sense of these contradictions to reveal how American impulses to recruit and exclude coolies enabled and justified a series of historical from slave-trade laws to racially coded immigration laws, from a slaveholding nation to a \"nation of immigrants,\" and from a continental empire of manifest destiny to a liberating empire across the seas. Combining political, cultural, and social history, Coolies and Cane is a compelling study of race, Reconstruction, and Asian American history.",
  "genres": [
    "History",
    "Nonfiction",
    "Labor",
    "19th Century",
    "World History",
    "School",
    "China"
  ],
  "author": "Moon-Ho Jung",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/6212879-coolies-and-cane"
}