{
  "title": "Magic Has No Borders",
  "description": "A pair of star-crossed lovers search for a way back to one another against all odds…A girl fights for her life against a malignant, generations-old evil…A peri seeks to reclaim her lost powers…A warrior rebels against her foretold destiny…From chudails and peris to jinn and goddesses, this lush collection of South Asian folklore, legends, and epics reimagines stories of old for a modern audience. This fantasy and science fiction teen anthology edited by Samira Ahmed and Sona Charaipotra contains a wide range of stories from fourteen bestselling, award-winning, and emerging writers from the South Asian diaspora that will surprise, delight, and move you. So read on, for after all, magic has no borders.With stories by:▪Sabaa Tahir, #1 New York Times bestselling author of the Ember in the Ashes series, and winner of the National Book Award and Printz Award for All My Rage▪Sayantani DasGupta, New York Times bestselling author of the Kiranmala and the Kingdom Beyond series▪Preeti Chhibber, author of Spider-Man’s Social Dilemma▪Sona Charaipotra, author of Symptoms of a Heartbreak and How Maya Got Fierce, and coauthor of The Rumor Game and Tiny Pretty Things, now a Netflix original series.▪Tanaz Bhathena, award-winning author of Hunted by the Sky and Of Light and Shadow▪Sangu Mandanna, bestselling author of The Very Secret Society of Irregular Witches and the Celestial Trilogy▪Olivia Chadha, author of Rise of the Red Hand▪Nafiza Azad, author of William C. Morris Award nominee, The Candle and the Flame▪Tracey Baptiste, New York Times bestselling author of The Jumbies series and Minecraft: The Crash▪Naz Kutub, author of The Loophole▪Nikita Gill, bestselling author of Wild Embers and Fierce Fairytales▪Swati Teerdhala, author of the Tiger at Midnight trilogy▪Shreya Ila Anasuya, New Voices selection▪Tahir Abrar, New Voices selection",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Young Adult",
    "Anthologies",
    "Mythology",
    "Fiction",
    "Retellings"
  ],
  "author": "Sona Charaipotra",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/62119776-magic-has-no-borders"
}