{
  "title": "The West: A New History in Fourteen Lives",
  "description": "\"A bold, sweeping bird's eye view of thousands of years of history that provides a truly global perspective of the past. A fantastic achievement.\"--Peter Frankopan, internationally bestselling author of The Silk Roads Prize-winning historian Naoíse Mac Sweeney delivers a captivating exploration of how \"Western Civilization\"--the concept of a single cultural inheritance extending from ancient Greece to modern times--is a powerful figment of our collective imagination. An urgently needed emergent voice in big history, she offers a bold new account of Western history, real and imagined, through the lives of fourteen remarkable individuals.In this groundbreaking, story-driven retelling of Western history, Naoíse Mac Sweeney debunks the myths and origin stories that underpin the history we thought we knew. Told through fourteen figures who each played a role in the creation of the Western idea--from Herodotus, a mixed-race migrant, to Phylis Wheatley, an enslaved African American who became a literary sensation; and from Gladstone, with a private passion for epic poetry, to the medieval Arab scholar Al-Kindi--the subjects are a mind-expanding blend of unsung heroes and familiar faces viewed afresh. These characters span the millennia and the continents, representing different religions, varying levels of wealth and education, diverse traditions and nationalities. Each life tells us something unexpected about the age in which it was lived and offers us a piece of the puzzle of how the modern idea of the West developed--and why we've misunderstood it for too long.The concept of \"the West\" is present in every daily interaction you have, from entertainment and politics to world markets and world history. This engagingly intimate history will reshape the way you see the world around you. At this moment of civilizational redefinition, if we are to chart a future for the West, we must properly understand its past.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "World History",
    "Audiobook",
    "Historical",
    "Biography"
  ],
  "author": "Naoíse Mac Sweeney",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/62121585-the-west"
}