{
  "title": "Such Good Friends: A Novel of Truman Capote & Lee Radziwill",
  "description": "“Fans of Capote and the era of Camelot should be delighted.” —Shana Abé, New York Times bestselling author of The Second Mrs. AstorA must-read for fans of Truman Capote and Jackie Kennedy, this star-studded, evocative novel revels in the glamor, gossip, and casual betrayal of 1960s and ’70s high society New York and the socialite “swans” that ruled this scandalous world. On a Thursday morning in May 1961, a well-mannered twenty-one-year-old named Marlene enters the Fifth Avenue apartment of Lee Radziwill to interview for the position of housekeeper and cook. The stylish wife of London-based Prince Stanislaw Radziwill, Princess Lee is intelligent and creative, with ambitions beyond simply jet-setting. But to the public, she is always First Lady Jackie Kennedy’s little sister.As Marlene becomes a trusted presence in the Radziwill household, she observes the dazzling array of famous figures who flit in and out of Lee’s intimate circle, including Gloria Vanderbilt, Rudolf Nureyev, Jackie and the President, Ari Onassis, Gore Vidal, Andy Warhol, and, most regularly, celebrated author Truman Capote. At the height of his fame following the success of Breakfast at Tiffany’s, Truman has granted Lee place of honor in his flock of glamorous socialite “swans.”Their closeness stems from an unexpected kinship. Both know too well the feeling of being second-best. Seeing his shadow in the woman he refers to as his most unconventional swan, Truman uses his influence and talent to try and make Lee a star.Their bond deepens through the decade’s extraordinary events, from JFK’s assassination to the era-defining Black and White Ball. But Marlene, who Truman has taken under his wing as an aspiring writer, can see Truman’s darker side—especially his penchant for mining his friends’ private lives for material. And there are betrayals on either side that may signal the end not just of a friendship, but of the shared expectation that wealth and fame can shield against every heartbreak.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Adult",
    "Audiobook",
    "Contemporary",
    "Book Club"
  ],
  "author": "Stephen Greco",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/62140427-such-good-friends"
}