{
  "title": "America's Cultural Revolution: How the Radical Left Conquered Everything",
  "description": "AN INSTANT NEW YORK TIMES, USA TODAY, AND AMAZON BESTSELLER America’s most effective conservative intellectual proves once and for all that Marxist radicals have taken over our nation's institutions.In the 1960s, Mao launched China’s Cultural Revolution. Cities grew overcrowded. Technocrats demanded progress from above. Anyone opposed was sent to be “re-educated.” China’s revolution was bloody, fast, and a failure, but what if America started a revolution at the same time, based on the same bad ideas, and it’s just been slower, calmer, and more effective?In his powerful new book, Christopher F. Rufo uncovers the hidden history of left-wing intellectuals and activists who systematically took control of America’s institutions to undermine them from within. America’s Cultural Revolution finally answers so many of the questions normal Americans have, such • Why is nearly every major corporation bending the knee to a far-left agenda?• How did DEI suddenly become the department no institution can continue without?• Why is race the main thing America’s rich, white elite wants to talk about? • When did the left adopt all this doublespeak, saying progress is a lack of progress, equality is not equality, speech is violence, and violence is speech?• Has the goal of the left, for a century, actually been the destruction of every Western institution? Readers may not know the names of Herbert Marcuse, Angela Davis, Paulo Freire, and Derrick Bell, but they will recognize the ideas they spread. How their radical, destructive ideology slowly worked its way from prisons to academia to classrooms to your human resources department will come as a shock.Failing to act soon, Rufo warns, could allow the radical left to achieve their ultimate replacing constitutional equality with a race-based redistribution system overseen by bureaucratic ‘diversity and inclusion’ officials. Most Americans don’t want this, but most Americans are no longer in control of our institutions. If the mainstream media’s depiction of a failing dystopia in need of a fresh start never sounded right to you, this expose and call to arms is the book you’ve been looking for.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Sociology",
    "Cultural",
    "Audiobook",
    "Philosophy"
  ],
  "author": "Christopher F. Rufo",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/62119781-america-s-cultural-revolution"
}