{
  "title": "Best Men",
  "description": "\"Bursting with laughs and so much love, Sidney Karger's debut novel delivers a truly refreshing spin on the romantic comedy…A big-hearted, feel-good summer escape.\"—Anderson Cooper, #1 New York Times bestselling author and journalistWhen two best men in a wedding party fall for each other, they realize love isn’t a piece of cake in this hilarious and heartfelt romantic comedy debut by screenwriter Sidney Karger.Max Moody thought he had everything figured out. He’s trying to live his best life in New York City and has the best friend a gay guy could ask Paige. She and Max grew up next door to each other in the suburbs of Chicago. She can light up any party. She finishes his sentences. She’s always a reliable splunch (they don’t like to use the word brunch) partner. But then Max’s whole world is turned upside down when Paige suddenly announces some huge she’s engaged and wants Max to be her man of honor. Max was always the romantic one who imagined he would get married before the unpredictable Paige and is shocked to hear she’s ready to settle down. But it turns out there’s not just one new man in Paige’s life—there are two. There's the groom, Austin, who’s a perfectly nice guy. Then there's his charming, fun and ridiculously handsome gay younger brother, Chasten, who is Austin's best man. As Paige’s wedding draws closer, Max, the introverted Midwesterner, and Chasten, the social butterfly East Coaster, realize they’re like oil and water. Yet they still have to figure out how to coexist in Paige’s life while not making her wedding festivities all about them. But can the tiny romantic spark between these two very different guys transform their best man supporting roles into the leading best men in each other’s lives?",
  "genres": [
    "Romance",
    "LGBT",
    "Queer",
    "Contemporary",
    "Fiction",
    "Gay",
    "Adult"
  ],
  "author": "Sidney Karger",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/62110171-best-men"
}