{
  "title": "Lost Souls Recovered",
  "description": "One Fateful Night, John Must Make a Life-Changing Decision and Leave Everything He’s Ever Known... But Life Was Never So Kind to Let Him Leave Peacefully.Life on the plantation was all seventeen-year-old John had ever known.His mother had been the property of the plantation owner, and in turn, so was John. He’d grown up in the harsh environment where his hands and feet were put to work the moment he could think for himself.Slavery had ended, but also… it had not.It felt like nothing had changed — they still glared at John with distasteful looks, treated him like he was worth less than them, and he was still tied to working at the plantation.Until one fateful night.When the wife of their plantation owner suddenly passes away, John’s life completely turns upside down as all fingers point at him.With the instruction of his mother—the only blood relative he knows in the world—John painstakingly flees their slave cabin, leaves his mother behind without telling her the real reason he needs to leave, and begins to make his way down south, away from all the accusations, to find a putative cousin, and in search of a bigger and better life.If only it were that easy…Throughout his journey, John must stay two steps ahead as the plantation owner shadows him every step of the way. One misstep could cost him his newly-earned freedom — and his life.Embark on a heart-wrenching, explosive, fast-paced, and adventure-filled journey in this historical fiction inspired by a true story. Travel with John as he does everything he can to honor the promise he made to his mother — to find a cousin and that bigger and better life.Filled with loss, gain, self-reinvention, and struggle, this book is going to keep you on the edge of your seat as John fights against his inner demons and wrestles them for control of his identity and emotions.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Eric  Walker",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/62160652-lost-souls-recovered"
}