{
  "title": "The Big Book of Science Fiction",
  "description": "A collection of SF stories edited by Groff Conklin. Contains stories by Clifford Simak, Theodore Sturgeon, Murray Leinster, Lester del Rey, Frederic Brown, Fletcher Pratt, Ray Bradbury, John D. MacDonald, Fritz Leiber Jr, and C. M. Kornbluth. Content\"Sanity\" by Fritz Leiber\"The Only Thing We Learn\" by C. M. Kornbluth\"Mewhu's Jet\" by Theodore Sturgeon\"Isolationist\" by Mack Reynolds\"Dear Devil\" by Eric Frank Russell\"Arena\" by Fredric Brown\"Emergency Landing\" by Ralph Williams\"E for Effort\" by T. L. Sherred\"The Wings of Night\" by Lester del Rey\"Desertion\" by Clifford D. Simak\"A Matter of Form\" by H. L. Gold [as\" by Horace L. Gold ]\"Not With a Bang\" by Damon Knight\"Defense Mechanism\" by Katherine MacLean\"The Man with the Strange Head\" by Miles J. Breuer, M.D.\"One Leg Too Many\" by W. Alexander\"The Roger Bacon Formula\" by Fletcher Pratt\"Manna\" by Peter Phillips\"Rat Race\" by Dorothy de Courcy and John de Courcy\"The Ship That Turned Aside\" by Green Peyton (G. Peyton Wertenbaker)\"The Outer Limit\" by Graham Doar\"Culture\" by Jerry Shelton\"In the Year 2889\" by Jules Verne (\"La Journée d'un journaliste américain en 2890\")\"The Planetoid of Doom\" by Morrison Colladay\"Nobody Saw the Ship\" by Murray Leinster\"The Long Dawn\" by Noel Loomis\"Forever and the Earth\" by Ray Bradbury\"Mr. Murphy of New York\" by Thomas McMorrow\"The Diminishing Draft\" by Waldemar Kaempffert\"Margin for Error\" by Henry Kuttner and C. L. Moore [as\" by Lewis Padgett ]\"Contact, Incorporated\" by Robertson Osborne (variant of \"Action on Azura\")\"Peacebringer\" by Ward Moore\"The Miniature\" by Peter Reed (John D. MacDonald)",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Speculative Fiction"
  ],
  "author": "Groff Conklin",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/6218057-the-big-book-of-science-fiction"
}