{
  "title": "Tears of Ice",
  "description": "One human stranded in another realm. Two mortal enemies who can't stay away from her. One secret that could destroy them all.AvaI escape from my kidnappers through a doorway only to find myself stranded in another world. As if having an undiagnosable heart condition wasn't hard enough, this new realm is inhabited by shapeshifting beings I thought only existed in legend. Did I mention they're racists bastards with a dumb hierarchy that ends with humans?I want to stay as far away as possible from their literal ice prince, Erritt, who has a stick up his ass, but he keeps involving himself in my business. Around here, his word is law. Which is really bad news for the dragon he likes to torment. The dragon who has my heart fluttering, but blows hot and cold on me.But then I stumble on Prince Erritt's secret. Now my life is on the line, because he'll do anything to protect it.SkyeWe dragons are hated. Despised after an uprising three hundred years ago that no one, especially not the Exerin royal family, will forget. I thought I was okay with the status quo, until a human who doesn't belong here shows up, seeing through me with those wide hazel eyes and asking uncomfortable questions. Despite her pathetic frailness, she's dangerous, because she has something stirring inside of me. Something that was supposed to stay asleep. Enchanted, I can't stay away. But any association with me puts her in danger. Especially after HE lays claim to her.ErrittDuty, honor, obedience. My whole life is dedicated to the royal crown of Exerin. I've reconciled with my golden prison fate. Then the human shows up.She's pathetic, and defenceless and beneath me. So why can't I ignore her? Thoughts of her invade my every moment, no matter how hard I try to keep her at arms length. But when she discovers my life and death secret, everything changes.Author note: This is a 36,000 word novella, introducing the currently incomplete series Tears of the Heart.The series is a medium-burn fantasy story about a young woman finding love with more than one (paranormal/shifter) man. If that's not your cup of tea, try a different book. If it is, buckle up and hang on! Triggers: mild coarse language, abduction, bullying",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Shapeshifters",
    "Dragons",
    "M M Romance",
    "Paranormal",
    "Enemies To Lovers"
  ],
  "author": "Sierra Knoxly",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/62170679-tears-of-ice"
}