{
  "title": "Revolutionary Spring: Europe Aflame and the Fight for a New World, 1848-1849",
  "description": "An epic history of the 1848 revolutions that swept Europe and the charismatic figures who propelled them forward, with deep resonance and frightening parallels to today--from a renowned Cambridge historian.Historically, 1848 has long been overshadowed by the French Revolution of 1789, the Paris Commune of 1870, and the Russian revolutions of the early twentieth century. And yet in 1848, nearly all of Europe was aflame with conflict. Parallel political tumults spread like brush fire across the entire continent, leading to more significant and lasting change than earlier upheavals. And they brought with them a new awareness of the concept of history; the men and women of 1848 saw and shaped what was happening around them through the lens of previous revolutions.Celebrated Cambridge historian Christopher Clark describes this continental uprising as \"the particle collision chamber at the center of the European nineteenth century,\" a place where political movements and ideas--from socialism and democratic radicalism to liberalism, nationalism, corporatism, and conservatism--were tested and transformed. The insurgents asked questions that sound modern to our ears: What happens when demands for political or economic liberty conflict with demands for social rights? How do we reconcile representative and direct forms of democracy? How is capitalism connected to social inequality? As a result of the events of 1848, the papacy of Pius IX and even the Catholic Church changed profoundly; Denmark, Piedmont and Prussia issued constitutions; Sicily founded its own all-Sicilian parliament; the Austrian Chancellor Metternich fled from Vienna. The revolutions were short-lived, but their impact was profound. Public life, administrative cultures and political thought were all transformed by this mid-century convulsion. Those who lived through them were marked for life by what they had seen and experienced.Elegantly written, meticulously researched, and filled with a fascinating cast of charismatic figures, including the social theorist de Tochqueville and the troubled Priest de Lamennais, who struggled to reconcile his faith with politics, Revolutionary Spring is a new understanding of 1848 that offers chilling parallels to our present moment. \"Looking back at the revolutions from the end of the first quarter of the twenty-first century, it is impossible not to be struck by the resonances,\" Clark writes. \"If a revolution is coming for us, it may look something like 1848.\"",
  "genres": [
    "History",
    "Nonfiction",
    "European History",
    "Politics",
    "Audiobook",
    "World History",
    "War"
  ],
  "author": "Christopher   Clark",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/62192405-revolutionary-spring"
}