{
  "title": "Dead John: A Romantic Comedy - Girls On Top Book One",
  "description": "Action-packed romantic high school comedy. Gossip Girl and Cruel Intentions meet Harry Potter in a fun murder mystery with a strong female lead and a sexy cast of characters. Sharp, funny and smart.This 45-minute Kindle Unlimited Short Read is Chapter 1 of a larger series.Welcome to Colorado in 2042, where John's Dead and all is not as it seems.Meet Perry Prescott.Beautiful. Brilliant. Destined for Power.And a little in love with her older brother's best friend, senior Xander Holland.Take an adventure through murder and mystery at Coyote Academy as Perry and her friends fall in love, get revenge, gain power, and plot to take over the world in this humorous take on billionaire boarding school in future America.Enter a lightly futuristic fantasy where democracy hangs on by a thread, enemies become lovers, intrigue reigns free and girls take matters into their own hands.See what happens when a group of crazy adults who run the world and think they have matters under control find their stories intertwined with a bunch of too smart for their own good high school kids.For fans of books like Hunger Games, 50 Shades of Grey, Twilight, Bridgerton, Game Of Thrones, One of Us Is Lying, ACOTAR, The Hating Game, The Selection, The Summer I Turned Pretty, Gone GirlExcerpt. © All rights reserved.Dead John - Girls On Top Book OneExplosions filled the air, and Perry jumped, feeling the wind in her long smooth hair and the thrill of adrenaline coursing through her blood.Seeing fireworks, not gunshots, she let out a sigh, planted her designer sneakered feet on the hard stone of Niko Orlov's colossal balcony, and placed a steadying hand on Xander Holland’s shoulder.Closing her eyes, she willed away images of John’s blood staining her white Chanel romper last night, and thought of Xander’s hands removing it in the shower afterwards instead.Though Perry never really loved John, not like she did Xander, she never hated him, either. Until she put a bullet through his head, of course. She definitely hated him now.Xander's cashmere crew sweater felt cool under her clammy fingers.Someone cleared their throat and Perry looked up, noting another blast of glittering lights in the sky over the Wicked Wood and twelve pairs of eyes examining her curiously from around the marble fire pit.\"Are you having another one of your I need attention moments?\" Xander’s girlfriend, Madison, asked, loud enough for Xander and Perry to hear, but not loud enough for the others to notice her acting like a classless cunt.Beautiful idiot. Perry thought, observing a predictable shift in Xander’s energy and admiring the impassive mask of boredom that juxtaposed the knife-sharp edges of his face.Across the crackling fire, Perry’s roommate Mae grinned at her, and Perry smiled, before directing her attention back to Xander, who, without saying a word, reached down and peeled Madison’s white knuckled grip from his leg.With a sick sense of glee, Perry found herself unable to look away as Madison, a crazed look in her eye, re-wrapped her long fingers around Xander’s thigh.Xander leaned toward Madison and whispered in her ear.Madison blanched, then coughed.Uncurling her fingers, she faced forward, a look of silent fury snaking its way across her exquisite features.",
  "genres": [],
  "author": "Dagmara Mach",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/62191206-dead-john"
}