{
  "title": "Sparta Rose",
  "description": "Sparta Rose by Ginger SimpsonWestern Historical Romance, 64,000 words$6.95 CA .pdf Cover Art 2009 by Shirley BurnettEdited by Lauren GilbertCopyedited by Rose Vera StepneyLayout and Book Production by Ally RobertsoneBook Print Roselle can’t quite live up to her flowery name and prefers to be called Ellie. Her plans of one day running her father’s ranch are threatened by a handsome foreman, the dastardly family on the adjoining land… and more surprisingly, her heart.Foreman, Tyler Bishop, can’t make heads or tails out of Ellie Fountain. One minute she’s a childish tomboy and the next, cooper curls and curves. One thing he’s determined to do, and that’s keep her safe. He’s not sure if he’s doing it because she’s the boss’s daughter or because her feistiness attracts him in ways he doesn’t want to admit.Romance and suspense emerge in Sparta Rose. As soon as his gun cleared leather, a blaze of gunfire ensued. With lightning precision, Ty masterfully downed five of the six cans, and re-holstered his weapon. With a cocky smile, he turned to Ellie. “Well, I must have been distracted on that last one, but five out of six is pretty good, seeing as how it probably only took thirty seconds or so.”Ellie exhaled. There was no denying he’d done a good job. Her heart really started to pound. What if she wasn’t as skilled as she thought? While watching Ty set up six new cans, she mentally pictured her make-shift target filled with holes made by expertly placed shots. The whole time she fought rising nausea.Ty strolled back. “It’s your turn.”Her stomach clenched.“Thanks. I kind of figured that,” she snapped, surprised by her snippiness. This was her idea, not his. She swallowed hard, determined to mellow her tone. “Could you do me a favor?”“What?”“Can you please stand back a little ways?” She motioned over her shoulder. “It distracts me to see you out of the corner of my eye.”“Sure, no problem.” He backed up a few paces.",
  "genres": [
    "Romance",
    "Westerns",
    "Historical",
    "Fiction"
  ],
  "author": "Ginger Simpson",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/6219102-sparta-rose"
}