{
  "title": "Aeternum",
  "description": "MAJOR SPOILERS below if you have not read book one (The Umbra King).This is NOT a standalone. It is the second and final book in the Vincula Realm duology and must be read after The Umbra King.ErdikoaAfter being released from the prison realm four-hundred and ninety-nine years early, Rory finds herself in Erdikoa with no memory of the last three months and orders to keep her release a secret.Feeling like an outsider looking in, she tries to acclimate to her new life, but she can’t shake the feeling that something, or someone, is missing.She begins to question her reality when her sister’s killer plagues her dreams, insisting he’s innocent. But she knows what she saw all those years ago, and she’s faced with a choice: avenge her sister, potentially destroying her life again, or let go of revenge to embrace the second chance she’s been givenWill she be able to retrieve her memories to help her decide, or will she stay in the dark forever, dreaming of a man she should hate?VinculaWith a haunting prophecy hanging over his head, Caius races against time to break the magic barrier trapping him in his own realm. With the help of unlikely allies, they discover a solution, giving Caius hope for the first time since Rory’s departure, but it comes at a steep priceHowever, the evil they face cannot be underestimated, and the evil within may become necessary.For her, he will become a monster. For him, she will remain one.The last installment of the Vincula Realm duology is filled with mystery, romance, and twists to keep you guessing until the very end. This is book two in a duology and cannot be read as a standalone.Not suitable for those under 18 years of age due to mature language and situations. Please see the author's website for a full list of content warnings.",
  "genres": [
    "Fantasy",
    "Romantasy",
    "Fantasy Romance",
    "Romance",
    "Dark Romance",
    "Fae",
    "Dark"
  ],
  "author": "Jamie Applegate Hunter",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/62205020-aeternum"
}