{
  "title": "Bluebird",
  "description": "Vesna Maric left Bosnia the beginning of the war, at the age of 16, on a convoy of coaches of women and children heading for Penrith. \"Bluebird\" is her funny, vivid and immensely readable memoir of the experience. Maric describes the beginning of the war - the machine gun fire that sounded like a sewing machine in the distance - and her family's growing anxiety, culminating in the decision to send her and her sister to Britain. She makes the account of the four day coach trip to Penrith hugely entertaining - the personalities, the gossip and the Gordana, who looks like Xena Warrior Princess in tight lilac leggings and a long plait, weepingly revealing that she is pregnant, their interpreter descending into a nervous breakdown.They spend nights at Esso stations and days being shown alternate videos of 'The Snowman', the song from which haunts Vesna to this day, and, insensitively, the devastation in Mostar. They finally arrive in the vivid green of the Lake District, and are greeted by well-meaning but patronising volunteers. Maric is sharp and revealing on the presumptions the volunteers make about how refugees should behave, and the refugees' own resistance to the role. She tells about her love affair with a local lad, and her eventual moves to Exeter and Hull.Throughout she interweaves the stories of other refugees - love stories, stories of escape, stories about the strange clash between refugees and their hosts. Maric attracts touching and absurd stories like a magnet. In the intensely moving ending Maric describes her return to Bosnia years later, walking through the ruined streets of her town, and then realising her old slippers, still by her bed, no longer fit. Unlike many books on Bosnia, and refugees in general, \"Bluebird\" is never self-pitying, never grave. It's refreshing to read an account of these experiences filtered through the eyes of a teenager with attitude - written with brilliant comic timing, and a great storytelling gift.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Read For School",
    "War"
  ],
  "author": "Vesna Maric",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/6218319-bluebird"
}