{
  "title": "When the World Didn't End: A Memoir",
  "description": "In this immersive, spell-binding memoir, an acclaimed screenwriter tells the story of her childhood growing up with the infamous Lyman Family cult--and the complicated and unexpected pain of leaving the only home she'd ever knownOn January 5, 1975, the world was supposed to end. Under strict instructions from her Family Leader, seven-year-old Guinevere Turner put on her best dress, grabbed her favorite toy, and waited for her salvation--a spaceship that would take her and her peers to live on Venus. But the spaceship never came.Guinevere did not understand her family was a cult. She spent most of her days on a compound in Kansas, living with dozens of other children who worked in the sorghum fields and roved freely through the surrounding pastures, eating mulberries and tending to farm animals. But there was a dark side to this bucolic existence: When selected girls in her community turned twelve or thirteen, they were \"given\" to older men on the compound as wives in training. Turner was part of the Lyman Family, a cult spearheaded by Mel Lyman, a self-proclaimed \"world savior,\" committed to isolation from a world he declared had lost its way. When Guinevere caught the attention of Jessie, the \"queen\" of the Family, her status was elevated and suddenly she was traveling in the inner-circle caravan between communities in Los Angeles, Boston, and Martha's Vineyard.Then, at age eleven, Guinevere's world as she had known it ended. Her mother, from whom she had been separated since age three, left the Family with a disgraced member, and Guinevere and her four-year-old sister were forced to go with her. Traveling outside the bounds of her cloistered existence, Guinevere was thrust into public school for the first time, a stranger in a strange world with homemade clothes, clueless to social codes. Now, in the World she'd been raised to believe was evil, she faced challenges and horrors she couldn't have imagined.Drawing from the diaries that she kept throughout her youth, Guinevere Turner's memoir is an intimate and heart-wrenching chronicle of a childhood touched with extraordinary beauty and unfathomable ugliness, the ache of yearning to return to a lost home--and the slow realization of how harmful that place really was.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Cults",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "Cult Classics"
  ],
  "author": "Guinevere Turner",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/62192504-when-the-world-didn-t-end"
}