{
  "title": "Perilous Times",
  "description": "An immortal Knight of the Round Table faces his greatest challenge yet—saving the politically polarized, rapidly warming world from itself—in this slyly funny contemporary take on Arthurian legend.Legends don’t always live up to reality.Being reborn as an immortal defender of the realm gets awfully tiring over the years—or at least that’s what Sir Kay’s thinking as he claws his way up from beneath the earth yet again.Kay once rode alongside his brother, King Arthur, as a Knight of the Round Table. Since then, he has fought at Hastings and at Waterloo and in both World Wars. But now he finds himself in a strange new world where oceans have risen, the army’s been privatized, and half of Britain’s been sold to foreign powers. The dragon that’s running amok—that he can handle. The rest? He’s not so sure.Mariam’s spent her life fighting what’s wrong with her country. But she’s just one ordinary person, up against a hopelessly broken system. So when she meets Kay, she dares to hope that the world has finally found the savior it needs.Yet as the two travel through this bizarre and dangerous land, they discover that a magical plot of apocalyptic proportions is underway. And Kay’s too busy hunting dragons—and exchanging blows with his old enemy Lancelot—to figure out what to do about it. In perilous times like these, the realm doesn’t just need a knight. It needs a true leader. Luckily, Excalibur lies within reach. But who will be fit to wield it? With a cast that includes Merlin, Morgan le Fay, the Lady of the Lake, and King Arthur himself—all reimagined in joyous, wickedly subversive fashion— Perilous Times is an Arthurian retelling that looks forward as much as it looks back . . . and a rollicking, deadpan-funny, surprisingly touching fantasy adventure.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Arthurian",
    "Retellings",
    "Historical",
    "Historical Fiction",
    "Queer"
  ],
  "author": "Thomas D. Lee",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/62192516-perilous-times"
}