{
  "title": "Apartment 303",
  "description": "Rory observes the world from the safety of her third-floor apartment. But she's being watched too and will soon learn that no lock will protect her. The compelling, unsettling new psychological suspense novel from the bestselling author of Other People's Houses. Even a locked door can't keep you safeTwenty-six-year-old Rory rarely leaves her apartment, though her little dog Buster keeps her company. Days are spent working for her aunt's PI business, and watching and imagining histories for the homeless men, the Dossers, across the road. At night she walks Buster on the roof, gazes at the stars and wonders.The night before New Year's Eve, one of the Dossers is murdered, an incident which brings the world - police, new neighbours, her dark past and new possibilities - crashing through Rory's front door.She thought she was keeping her fears at bay. But has her sanctuary turned into her prison? Or is it safer for everyone if Rory stays locked away?'Hawkins continues to show her expertise in the psychological thriller genre through her fantastic and layered exploration of a troubled narrator in a sinister plot. Rory is an utterly intriguing protagonist ... Each line resonates with a building sense of danger that will keep readers guessing ... [and] on the edge of their seats with every chapter. It's a perfect, simmering slow burn that gets your heart pounding ... I couldn't put it down!' Better ReadingPraise for All She Wants:'A twisting, simmering mystery.' Readings'A searing domestic thriller that will have you hooked from start to end ... Atmospheric and loaded with suspense; Hawkins delivers plenty of satisfying surprises.' Better ReadingPraise for Other People's Houses:'A clever premise and a troubled narrator set this page-turner up beautifully. I really enjoyed the ride.' Sara Foster, author of The Hush'Taut, smart and immensely satisfying. I was addicted from the first page to the last.' Nicola Moriarty, author of You Need to Know'Heartbreaking and gripping ... a terrific read.' Sisters in Crime",
  "genres": [
    "Thriller",
    "Mystery",
    "Audiobook",
    "Fiction",
    "Adult",
    "Crime",
    "Drama"
  ],
  "author": "Kelli Hawkins",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/62216675-apartment-303"
}