{
  "title": "The Deen Bros. Take It Easy: Quick and Affordable Meals the Whole Family Will Love: A Cookbook",
  "description": "If you haven’t got time to waste, Jamie and Bobby Deen have the meals to make. Imagine getting dinner on the table for your family in forty-five minutes or less. In this inspired and indispensable new cookbook, Paula Deen’s sons show you how to whip up 125 delicious Southern-style recipes quicker than you can say, “Come and get it!”The Deen brothers know a lot about cooking good food fast. They hosted the Food Network hit Road Tasted , appear regularly on Good Morning America , and are co-owners (with their mom) of Savannah’s famous The Lady & Sons Restaurant. Their fast-paced lifestyles require no-fuss meals without a lot of prep. Jamie’s a family man who’s got to work, serve supper, and still chase after his three-year-old son. Bobby, one of People magazine’s most eligible bachelors, appreciates a good meal before heading out to work at his restaurant or for a night on the town. They’re the perfect guys to write a guide to swift dishes that don’t stint on taste or Southern authenticity.This mouthwatering collection offers dishes that really deliver on flavor yet can be prepared within a budget. There are no hard-to-find ingredients or tricky techniques to follow, just the tasty, irresistible cooking that the Deens have come to be known for. For lunch, dinner, or late-night snacks, if you’ve got meat in mind, how about Speedy Mini-Meat Loaves with Baked Sweet Potato Wedges? If chicken’s your choice, Broiled Pesto Chicken with Cherry Tomatoes is a satisfying possibility. And if you’re really on the go, there are whole chapters devoted to simple grilling and crockpot cooking.Lighter fare includes Turkey and Black Bean Burgers with Corny Salsa and Jerk Shrimp Kebabs with Tomatoes, Onions, and Peppers, and main-course salads such as Jamie’s Nutty Orange Chicken Salad. If you have kids, they will love Yummy Orange Beef Fingers. In fact, in honor of Jamie’s son, there’s a whole chapter devoted to kids’ food called “Jack’s Favorites” (which might become your kids’ favorites too!). And what’s a meal without dessert? Jamie and Bobby offer their favorite temptations, ranging from Chocolate Peanut-Butter Malteds to Quick Blackberry Cream Pie.Seasoned with wonderful never-before-seen color photos of the entire Deen family and sprinkled liberally with Jamie’s and Bobby’s down-home charm, and including signature dishes from The Lady & Sons Restaurant, The Deen Bros. Take It Easy is a treat in itself for anyone with a full life and an empty stomach.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction"
  ],
  "author": "Jamie Deen",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/6222091-the-deen-bros-take-it-easy"
}