{
  "title": "Fight Like a Girl: How to Be a Fearless Feminist",
  "description": "View the Author's website!Seely, the youngest elected president of California's chapter of the National Organization for Women, combines her own story of third-wave feminism with an overview of the feminist movement and words to guide others. Third-wave feminists are aware of both the victories won by earlier feminists and the problems of class, race, sexual orientation, and internationalism that must still be overcome. This book weaves a deep respect for the foremothers with commonsense discussion of current obstacles and suggestions for direct action, resulting in a work that reminds us of what too many activists forget-every progressive movement has a long history, few organizing tricks are new, and problems must be understood before they can be solved. Seely includes booklists, time lines, web sites, and how-to tips that will help readers over the bridge from her insights to real world activism. For midsize to larger public libraries, academic libraries, and all feminist collections.— Library Journal\"Want to know what it means to be a feminist of the third wave? Megan Seely's Fight Like a Girl is the answer; there’s enough information here to make you angry and enough resources to make you an effective activist.—Jennifer Baumgardner and Amy Richards, co-authors of Young Women, Feminism and the Future“Always engaging, interesting, and insightful. Fascinating and sure to engage many young women!”—Sherrie A. Inness, editor of Action Chicks“The resources, helpful hints about organizing and working with the press, the short bios of companies and fabulous feminists are great!”—Caryn Aviv, co-editor of American Queer, Then and NowFight Like a Girl is packed with both information and inspiration for young women by a young woman who knows her stuff. It's a terrific practical feminist resource book with an optimistic attitude that says in clear language, “You're in charge of your life and here's how to stay that way”.—Gloria Feldt, former president, Planned Parenthood Federation of America and author of The War on The Right-Wing Attack on Women's Rights and How to Fight BackFight Like a Girl offers a fearless vision for the future of feminism. By boldly detailing what is at stake for women and girls today, Megan Seely outlines the necessary steps to achieve true political, social and economic equity for all. Reclaiming feminism for a new generation, Fight Like a Girl speaks to young women who embrace feminism in substance but not necessarily in name.With an eye toward what it takes to create actual change, Seely offers a practical guide for how to get involved, take action and wage successful events and campaigns.The book is full of valuable resources for novice and committed activists alike, including such features as “How to Write a Press Release,” “Guidelines to a Good Media Interview,” “A Feminist Shopping Guide,” and a list of over 100 Fabulous Feminist Resources, including organizations, websites, and events to attend. Each chapter is full of ideas, both big and small, for ways to get involved, get active, and make a difference.Exploring such issues as body image and self-acceptance, education and empowerment, health and sexuality, political representation, economic justice, and violence against women, Fight Like a Girl looks at the challenges that women and girls face while emphasizing the strength that they independently, and collectively, embody. Seely delves into the politics of the feminist movement, exploring both women's history and current–day realities with easy-to-follow lists and timelines like those on “Women Who Made a Difference,” “Chronology of the U.S. Women's Movement,” and “Do's and Don'ts for Young Feminists.”A Third Wave manifesto as well as an introduction to feminism for a new generation, Fight Like A Girl is a powerful blueprint for young women today.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Gender",
    "Activism",
    "Womens Studies",
    "Politics"
  ],
  "author": "Megan Seely",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/622437.Fight_Like_a_Girl"
}