{
  "title": "Drinking from Graveyard Wells: Stories",
  "description": "\"Even in death, who has ownership over Black women's bodies?\"Questions like this sit between the lines of this stunning collection of stories that engage the nuance of African women's histories. Their history is not just one thing, there is heartbreak and pain, and joy, and flying and magic, so much magic. An avenging spirit takes on the patriarchy from beyond the grave.An immigrant woman undergoes a naturalization ceremony in an imagined American state that demands that immigrants pay a toll of the thing they love the most to be allowed to stay. A first-generation Zimbabwean-American woman haunted by generational trauma is willing to pay the ultimate price to take her pain away—giving up her memories. A neighborhood gossip wakes up to find that houses are mysteriously vanishing in the night. A shapeshifting freedom fighter leaves a legacy of resistance to her granddaughter.In Drinking from Graveyard Wells, Yvette Lisa Ndlovu assembles a collection of poignantly reflective stories that ventilate the voices of African women charting a Black history across oceans between southern Africa and America. Ndlovu's stories play with genres ranging from softly surreal to deeply fantastical. Each narrative is wrapped in the literary eloquence and tradition of southern African mythology, in a way that transports readers into the lives of African women who have fought across time and space to be seen.Drawing on her own experiences as a Zimbabwean whose early life was spent under the Mugabe dictatorship, Ndlovu's stories are grounded in truth and empathy. Ndlovu boldly offers up alternative interpretations of a past and a present that speculates into the everyday lives of a people disregarded. Her words explore the erasure of African women—while highlighting their beauty potential and limitless possibility. Immersed in worlds both fantastical and familiar, readers find themselves walking alongside these women, grieving their pain, and celebrating their joy, all against the textured backdrop of African histories, languages, and cultures.",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Horror",
    "Fiction",
    "Africa",
    "Poetry",
    "Zimbabwe"
  ],
  "author": "Yvette Lisa Ndlovu",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/62215455-drinking-from-graveyard-wells"
}