{
  "title": "Christmas in the Little Irish Village",
  "description": "Welcome to the little Irish village where Christmas celebrations are in full swing! Twinkling lights, cosy fires and big mugs of hot chocolate are in abundance as Shannon Kelly returns home to the Shamrock Inn. Will this be the year she finds the man of her dreams or is she destined to be forever unlucky in love?Thirty-four-year-old Shannon is heartbroken following an unexpected break up. Seasonal joy is the last thing on her mind, as she wonders if she’ll ever find the kind of long-lasting love she’s always dreamed of. Even the comforting distractions of her big Irish family can’t cheer her up. Then things get even worse when Shannon slips over on the ice and finds herself red-faced in the arms of a gorgeous American man…Despite the embarrassing encounter, Shannon can’t help wondering who the handsome stranger is. She soon finds out when James Cabot takes a room at the Shamrock Inn. Their second meeting is equally disastrous when she gives James the tour – without realising her skirt is tucked into her knickers! Shannon isn’t sure how she’s going to survive living under the same roof when she has such a talent for making a complete eejit of herself, and resolves to avoid their new guest at all costs.But when Shannon discovers James is in Ireland because he’s claiming to be the long-lost grandson of her elderly neighbour, Maeve Doolin, she is immediately suspicious. Shannon has known kind Maeve since she was a little girl and feels protective of her, so she’s determined to find out the truth. Even if it means spending more time with James…The two of them end up getting closer than she’d bargained for when they take a tour of Emerald Bay and end up snowed in together. But just as James begins to make Shannon’s heart melt with his cheeky grin and awful carol singing, a shocking secret threatens to shatter the growing romance between them.Can Shannon trust James? And will she get the happily-ever-after she’s been hoping for this Christmas?",
  "genres": [
    "Christmas",
    "Romance",
    "Contemporary",
    "Holiday",
    "Ireland",
    "Fiction",
    "Chick Lit"
  ],
  "author": "Michelle Vernal",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/62227065-christmas-in-the-little-irish-village"
}