{
  "title": "AUSCHWITZ ON THE POTOMAC 1943: HILLEL KOOK, THE ATTEMPT TO SAVE EUROPEAN JEWRY, AND THE BIRTH OF THE ISRAELI NATION",
  "description": "The inspiring story of how Hillel Kook (Peter Bergson) confronted FDR, Congress, and the Jewish Leadership to try and stop the Nazi extermination of European Jewry in order to create a Hebrew Nation in Israel.From the I met the author of this remarkable book forty years ago, as a result of making Who Shall Live and Who Shall Die? -- my documentary film about Peter Bergson (the pen name of Hillel Kook) and his struggle to persuade America to stop the Nazi extermination of European Jewry during World War II. Eliyaho Matz was then a young man, pursuing academic study, publishing journal articles, who had been a research assistant for Professor David Wyman, author of The Abandonment of the Jews, while a graduate student in history at the Unversity of Massachussetts, publishing research in intellectual journals like Midstream. He also worked for Bergson, assisting him to define the Israeli national identity, which became subject of Matz's earlier publication, Who is an Israeli?Like Bergson, Matz found himself subject to the fate of an outsider thought too critical of the Establishment, and left academia to work in the private sector. However, he contintued to research and analyze the causes and consequences of the tragic fate of European Jewry during World War II, America's failure to act decisively, and the prophetic role of Peter Bergson, Ben Hecht, Will Rogers, Jr., members and supporters of the Emergency Committee for the Rescue of the Jewish People of Europe and its successor organization, the Hebrew Committee for National Liberation.The results of Matz's years of research and contemplation may be found in this book. Most significantly, working as a researcher for Wyman and Bergson, Matz scoured the key historial archives related to America and what has come to be known as \"The Holocaust.\" He kept his own copies of historical documents that are to be found in reproduced in the chapters and appendices of this book--documents providing evidence for Matz's contention that Peter Bergson's actions from 1942 through the end of 1943 \"comprise the most important events in the history of Jews worldwide, as well as a very important event in American history.”Matz makes a convincing case that Bergson's activities led to the rescue of thousands of European Jews through the work of the War Refugee Board as well as to the establishment of the State of Israel following the war. His interviews with Bergson give some sense of is approach to the issue of identity, which Bergson held as the key to understanding both the Nazi extermination campaign during World War II and Israeli nationalism in the aftermath.That is to say, if Americans, American Jewish leaders, and Israelis had listened to what Peter Bergson had to say instead of fighting him--he was subject to attacks by The Washington Post, FBI investigation, and attempts at deportation by the US Government, as well as continuous criticism from American Jewish leaders--there was an excellent chance that the Nazi extermination program could have been stopped by the Allies in 1943. Bergson's recommended policies might have saved millions more from tragic deaths, as well as establishing the new nation of Israel in a more positive demographic and political environment.Eliyho Matz has done the world a service by bringing this documentary history together in book form, so that readers may see for themselves what was known, documented, and reported about the Holocaust during the 1940s, and hopefully be able to apply his information and analysis to the thorny problems facing America, Israel and the world today.--LAURENCE JARVIK, Clearwater, Florida, August, 2022.",
  "genres": [],
  "author": "Eliyho Matz",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/62214204-auschwitz-on-the-potomac-1943"
}