{
  "title": "Where Oceans Burn",
  "description": "With these three virtues, we shall rise. With these three, we shall conquer.Truth. Honor. Blood.To my people, the sky-reigning Empyreans, Intention Day is sacred…Truth…To me, it’s the day my carefully crafted lie crumbles and my truth gives way to my ruin. The intense power surging through my veins is revealed, immediately coveted by those eager to exploit me for what they deem a greater good. If they have their way, the future I long for will be ripped away. But I am a warrior born to fly. To fight. Not to be caged and controlled.The great scale of the goddess Neera has tipped out of my favor. The pans teeter between weighty punishment and deadly opportunity. My choices? Capture my most formidable enemy before next Intention Day, or forfeit my wings.Honor…But life’s loftiest plans are often a breath away from disaster, and tragedy strikes as unpredictably as a bolt of lightning. When I find myself at the mercy of my greatest enemy, the terror known as the Shark of the Sea, the monster who killed the person I loved most, I accept my fate. My death. But the Shark does not lash out in revenge for all I’ve done. He tells me his true name is Crest. And while he calls me a Scourge, he honors his orders to guard me.Blood…Forced together, Crest reveals that the truth only exists in the place between our perspectives and shares his hope to garner peace before the land is further soaked with the blood of sky and sea. The longer I am among his kind, the more I wonder if he might be right. Could an alliance be the salvation of both our peoples?I am Elira, great Scourge of the Sky.He is Crest, cunning Shark of the Sea.Together… we could be unstoppable.",
  "genres": [
    "Fantasy",
    "Romantasy",
    "Romance",
    "Young Adult",
    "Fantasy Romance",
    "Mermaids",
    "Enemies To Lovers"
  ],
  "author": "Casey L. Bond",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/62214105-where-oceans-burn"
}