{
  "title": "Benedict Arnold, Revolutionary Hero: An American Warrior Reconsidered",
  "description": "An extensively researched account of the infamous Benedict Arnold, framed in Martin's biography as a hero rather than a traitorBenedict Arnold stands as one of the most vilified figures in American history. Stories of his treason have so come to define him that his name, like that of Judas, is virtually synonymous with treason.Yet Arnold was one of the most heroic and remarkable men of his time, indeed in all of American history. A brilliant military leader of uncommon bravery, Arnold dedicated himself to the Revolutionary cause, sacrificing family life, health, and financial well-being for a conflict that left him physically crippled, sullied by false accusations, and profoundly alienated from the American cause of liberty. By viewing Arnold's life backward through the prism of his treason, we invariably succumb to the demonizations that arose only after his abandonment of the rebel forces. We thereby overlook his critical role as one of the influential actors in the American Revolution.Distinguished historian James Kirby Martin's landmark biography, the result of a decade's labor, stands as an invaluable antidote to this historical distortion. Careful not to endow the Revolutionary generation with mythical proportions of virtue, Martin shows how self-serving, venal behavior was just as common in the Revolutionary era as in our own time. Arnold, a deeply committed patriot, suffered acutely because of his lack of political savvy in dealing with those who attacked his honor and reputation. Tracing Arnold's life, from his difficult childhood through his grueling winter trek across the howling Maine wilderness, his valiant defense of Lake Champlain, and his crucial role in the Quebec and Saratoga campaigns, Martin has given us an entirely new perspective on this dramatic and exceptional life, set against the tumultuous background of the American Revolution.",
  "genres": [
    "History",
    "Biography",
    "American History",
    "American Revolution",
    "Nonfiction"
  ],
  "author": "James Kirby Martin",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/622523.Benedict_Arnold_Revolutionary_Hero"
}