{
  "title": "Green Sisters: A Spiritual Ecology",
  "description": "Listen to a short interview with Sarah McFarland Taylor Host: Chris Gondek - Producer: Heron & CraneIt is perhaps the critical issue of our time: How can we, as human beings, find ethical and sustainable ways to live with one another and with other living beings on this planet? Inviting us into the world of green sisters, this book provides compelling answers from a variety of religious communities.Green sisters are environmentally active Catholic nuns who are working to heal the earth as they cultivate new forms of religious culture. Sarah Taylor approaches this world as an \"intimate outsider.\" Neither Roman Catholic nor member of a religious order, she is a scholar well versed in both ethnography and American religious history who has also spent time shucking garlic and digging vegetable beds with the sisters. With her we encounter sisters in North America who are sod-busting the manicured lawns around their motherhouses to create community-supported organic gardens; building alternative housing structures and hermitages from renewable materials; adopting the \"green\" technology of composting toilets, solar panels, fluorescent lighting, and hybrid vehicles; and turning their community properties into land trusts with wildlife sanctuaries.\"Green Sisters\" gives us a firsthand understanding of the practice and experience of women whose lives bring together Catholicism and ecology, orthodoxy and activism, traditional theology and a passionate mission to save the planet. As green sisters explore ways of living a meaningful religious life in the face of increased cultural diversity and ecological crisis, their story offers hope for the future--and for a deeper understanding of the connections between women, religion, ecology, and culture.",
  "genres": [
    "Nature",
    "Religion",
    "Read For School",
    "Nonfiction",
    "Spirituality"
  ],
  "author": "Sarah McFarland Taylor",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/622894.Green_Sisters"
}