{
  "title": "DeadEndia: The Watcher's Test",
  "description": "From the creator of Netflix original series Dead End: Paranormal Park comes the graphic novel series that started it all!  “DeadEndia is immediately appealing with its colorful art, unique setting, and funny jokes, but I especially loved the complicated emotional arcs of the characters and the weird, spooky magic underlying everything!” —Molly Knox Ostertag, creator of The Witch Boy   “Heart-warming, heartbreaking, heart-pounding, and heartfelt!\" —Marika McCoola, The New York Times bestselling author of Baba Yaga’s Assistant   Barney Guttman’s life has been turned upside down. His family is struggling to fully embrace his trans identity, but thanks to his best friend Norma, he’s just landed a job at Phoenix Parks, a Dollywood-esque amusement park inspired by the long life and career of mysteriously youthful actress and singer Pauline Phoenix. Soon, Barney and his dog, Pugsley, secretly move into the haunted house attraction. Little does Barney know, the house contains a portal to the demonic planes of Hell. When Courtney, Barney’s devilish new roommate, invites a demon king to Earth through the portal, they offer Barney and Norma as flesh vessels for the king, but in a strange twist, Pugsley is possessed instead! It’s a race through the park to save Pugsley—and the world—from the demon king’s reign of terror that leaves Pugsley with strange and magical side effects. With all of this chaos going on, Barney is also discovering he has crush on park employee, Logan, so he must face his biggest fear of all… talking to someone he likes. Follow the lives of this diverse group of friends in this hilarious and moving graphic novel series, complete with talking pugs, vengeful ghosts, and first love.  Part workplace comedy, part supernatural horror adventure, with a splash of LGBTQ+ romance, The Watcher’s Test is perfect for fans of author Hamish Steele’s TV series Dead End: Paranormal Park who are in search of more adventures, for graphic novel lovers who want more diversity in their reads, or simply as an introduction to the zany, creative, and laugh-out-loud funny world of DeadEndia.",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "LGBT",
    "Comics",
    "Young Adult",
    "Queer",
    "Horror"
  ],
  "author": "Hamish Steele",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/62306737-deadendia"
}