{
  "title": "Vital Blindside",
  "description": "Adam White is many things, but a single dad was one that he never planned on becoming. He was twenty-three when the plan he had for his life crumbled at his feet. In the blink of an eye, he went from a flirtatious playboy just getting his new business up and off the ground, to a struggling father of a two-year-old boy that he never knew existed.Still, he did it. Adam accomplished what he thought was impossible. And now, at the prime age of thirty-three, he doesn’t think that his life can get any better. His twelve-year-old son, Cooper, is his world, and his business, White Ice Training, is one of the most known hockey training facilities in Vancouver. But when he posts a job listing for a new hockey trainer, he gets a response that lights a flame inside of him that he never realized was burnt out. One that he refuses to go without again.One terrible game was all it took for Scarlett Carter to lose everything. After a career-ending injury destroys her chances of ever playing professional hockey again, she finds herself lost in a mess of guilt-stricken “what-ifs” and broken dreams. Moving back home to Vancouver was never in the playbook, but neither was letting herself get tricked into taking a job working for a man who seems to want to stop at nothing to see her play the sport she loves again.Scarlett wants to forget about the world that broke her, but the single dad refuses to let her move on. The more time she spends with Adam, the harder she’s finding it to resist him and the sly grins he seems to only give her. She can’t help but wonder why he cares so much about her. And more importantly, why can't she bring herself to make him leave her alone.***Vital Blindside is a stand alone novel in a world of interconnected stories. It is recommended to read the first 2 novels in the Swift Hat-Trick Trilogy before VB, but is not necessary to understand this book. Recommended reading order for Hannah Cowan’s books can be found on her website.***",
  "genres": [
    "Sports Romance",
    "Hockey",
    "Romance",
    "Sports",
    "Workplace Romance",
    "Contemporary",
    "Forced Proximity"
  ],
  "author": "Hannah Cowan",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/62311035-vital-blindside"
}