{
  "title": "Fixit",
  "description": "In the latest installment in Joe Ide's \"superb\" series ( Washington Post ), the relentless, hard-bitten PI, Isaiah Quintabe, is faced with a nightmarish scenario when the love of his life is kidnapped by a maniacal hitman who bears a grudge against him.Danger has always followed IQ, a reality he’s keenly aware of as he’s laid up in a hospital bed, recovering from injuries sustained in his last case. Isaiah cannot help himself from being the hero, and any misery he’s suffered as a result—wounds from a knife fight, gnawing paranoia—he’s suffered alone. Yet as IQ recovers, five hundred miles from East Long Beach, he’s unaware that Grace has been abducted by his sworn enemy, the professional hitman Skip Hanson. Skip is savage and psychotic, determined to punish Isaiah for sending him to prison and destroying his life. Now, Isaiah and his sometimes partner, ex-hustler Juanell Dodson, must track scant clues through L.A.’s perilous landscape as Grace’s predicament grows more uncertain.A complication arises in the form of Winnie Hando, a homicide detective with something to prove. Stubborn and effective, Winnie sees Isaiah’s efforts as an obstruction to the investigation and a possible an unlicensed PI can’t be seen doing the department’s job better than the department. Winnie tries to stop Isaiah while pursuing the case herself, their struggles clashing and slowing their progress. As the desperate hunt winds on, Isaiah fears that even if he can bring Grace home alive, things between them will never be the same. This latest series installment is an explosive collision of drug dealers, thieves, maniacs, shotguns, vicious dogs, stampeding horses, and Ide’s signature energy, grit, and profundity",
  "genres": [
    "Mystery",
    "Fiction",
    "Audiobook",
    "Crime",
    "Mystery Thriller",
    "Thriller",
    "Suspense"
  ],
  "author": "Joe Ide",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/62315619-fixit"
}