{
  "title": "The Last Honest Man: The CIA, the FBI, the Mafia, and the Kennedys―and One Senator's Fight to Save Democracy",
  "description": "Witnesses were mysteriously murdered. The FBI, NSA, CIA, and even the IRS were on the warpath. It was 1975, and a senator named Frank Church stood almost alone in the face of extraordinary abuses of power.   For decades now, America’s national security state has grown ever bigger, ever more secretive and powerful, and ever more abusive. Only once did someone manage to put a stop to any of it. Senator Frank Church of Idaho was an unlikely hero. He led congressional opposition to the Vietnam War and had become a scathing, radical critic of what he saw as American imperialism around the world. But he was still politically ambitious, privately yearning for acceptance from the foreign policy establishment that he hated and eager to run for president. Despite his flaws, Church would show historic strength in his greatest moment, when in the wake of Watergate he was suddenly tasked with investigating abuses of power in the intelligence community. The dark truths that Church exposed—from assassination plots by the CIA, to links between the Kennedy dynasty and the mafia, to the surveillance of civil rights activists by the NSA and FBI—would shake the nation to its core, and forever change the way that Americans thought about not only their government but also their ability to hold it accountable. Drawing upon hundreds of interviews, thousands of pages of recently declassified documents, and reams of unpublished letters, notes, and memoirs, some of which remain sensitive today, Pulitzer Prize–winning reporter James Risen tells the gripping, untold story of truth and integrity standing against unchecked power—and winning—in The Last Honest Man.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "American History",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "James Risen",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/62315624-the-last-honest-man"
}