{
  "title": "The Tiffany Girls",
  "description": "New York Times bestselling author Shelley Noble wows with a gripping historical novel about the real-life “Tiffany Girls,” a fascinating and largely unknown group of women artists behind Tiffany’s most legendary glassworks.It’s 1899, and Manhattan is abuzz. Louis Comfort Tiffany, famous for his stained-glass windows, is planning a unique installation at the Paris World’s Fair, the largest in history. At their fifth-floor studio on Fourth Avenue, the artists of the Women’s Division of the Tiffany Glass Company are already working longer shifts to finish the pieces that Tiffany hopes will prove that he is the world’s finest artist in glass. Known as the “Tiffany Girls,” these women are responsible for much of the design and construction of Tiffany’s extraordinary glassworks, but none receive credit.Emilie Pascal, daughter of an art forger, has been shunned in Paris art circles after the unmasking of her abusive father. Wanting nothing more than a chance to start a new life, she forges a letter of recommendation in hopes of fulfilling her destiny as an artist in the one place where she will finally be free to live her own life.Grace Griffith is the best copyist in the studio, spending her days cutting glass into floral borders for Tiffany’s religious stained-glass windows. But none of her coworkers know her secret: she is living a double life as a political cartoonist under the pseudonym of G.L. Griffith—hiding her identity as a woman.As manager of the women’s division, Clara Driscoll is responsible for keeping everything on schedule and within budget. But in the lead-up to the most important exhibition of her career, not only are her girls becoming increasingly difficult to wrangle, she finds herself obsessed with a new design: a dragonfly lamp that she has no idea will one day become Tiffany’s signature piece.Brought together by chance, driven by their desire to be artists in one of the only ways acceptable for women in their time, these “Tiffany Girls” will break the glass ceiling of their era and for working women to come.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Art",
    "Book Club",
    "New York"
  ],
  "author": "Shelley Noble",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/62292413-the-tiffany-girls"
}