{
  "title": "She Started It",
  "description": "For fans of Lucy Foley and Liane Moriarty, She Started It is a hot, twisty summer debut thriller about a group of young women whose Caribbean bachelorette party takes a sinister turn. It’s Lord of the Flies meets And Then There Were None...but with Instagram and too much prosecco.The party of a lifetime is nothing like what they expected...Annabel, Esther, Tanya, and Chloe are best friends—or were, as children. Despite drifting apart in adulthood, shared secrets have kept them bonded for better or worse, even as their childhood dreams haven’t quite turned out as they’d hoped. Then one day they receive a wholly unexpected—but not entirely unwelcome—invitation from another old friend. Poppy Greer has invited them all to her extravagant bachelorette party: a first-class plane ticket to three days of white sand, cocktails, and relaxation on a luxe private island in the Bahamas.None of them has spoken to Poppy in years. But Poppy’s Instagram pics shows that the girl they used to consider the weakest link in their group has definitely made good—and made money. Curiosity gets the better of them. Besides, who can turn down a posh all-expenses-paid vacation on a Caribbean island?The first-class flight and the island’s accommodations are just as opulent as expected...even if the scenic island proves more remote than they’d anticipated. Quite remote, in fact, with no cell service, and no other guests. The women quickly discover they’ve underestimated Poppy, and each other. As their darkest secrets are revealed, the tropical adventure morphs into a terrifying nightmare.Endlessly twisty, sharply observant, and deliciously catty, She Started It is sure to shock readers until the very end.",
  "genres": [
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Audiobook",
    "Suspense",
    "Adult"
  ],
  "author": "Sian Gilbert",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/62292419-she-started-it"
}