{
  "title": "The Adult",
  "description": "\"Soon, but not yet, Nora will look up and she will see me, sitting at a distance.  In the wet grass, the imprints of Nora’s shoes will fill back slowly, and I won’t suspect that she is walking towards me.  After Nora meets me on the bench, it will be difficult to recall that in the beginning, when I first arrived at school, there were moments so plain and unconsumed that I felt I could watch them like a distant view. Like hills rolling away. Once she holds out her hand and asks, do you mind if I sit, it will be impossible for any other memory to exist without touching backwards or forwards over the view of her eyes looking down at me. The soft and penetrable skull of the world will suddenly harden and everything will be seen through the damp and willful light of our first meeting.\"\n Eighteen-year-old Natalie has just arrived at her first year of university in Toronto, leaving her remote, forested hometown for the big, impersonal city. Everyone she encounters seems to know exactly who they are. Chatty, confident Clara from down the hall, who wants to be her friend; intense, determined Rachel from her poetry class, who is going to be a writer. Natalie doesn't know what she wants. She reads advice listicles and watches videos online and thinks about how to fit in, how to really become someone, who that someone even is. Just as she is trying to find her footing, she meets Nora, an older woman who takes an unexpected interest in her. Natalie is drawn magnetically into Nora's orbit. She begins spending more and more of her time off-campus at Nora's perfect home living in her beautiful, quiet world. She lies to her floormates about her absence, inventing a secret boyfriend called Paul, and carefully protects this intimate, sacred adulthood she is building for herself. But when it becomes clear that Nora is lying, too, her secrets begin to take an insidious shape in Natalie's life, even as Natalie tries to look away. What, or who, is Nora hiding?",
  "genres": [
    "Fiction",
    "Queer",
    "LGBT",
    "Contemporary",
    "Literary Fiction",
    "Lesbian",
    "Romance"
  ],
  "author": "Bronwyn Fischer",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/62315926-the-adult"
}