{
  "title": "Not All Himbos Wear Capes",
  "description": "PLEASE NOTE: Full list of Content & TWs can be found in the front of the book and at c-rochelle[dot]com. XanderBig City is supposedly the place where dreams come true. As someone just trying to live my life, I can tell you, it’s more like a recurring nightmare where dreams get c*ckblocked at every turn.Especially if you’re a supervillain like me.The irony is that I have zero powers, despite coming from purebred villain stock, but try telling that to Big City’s beloved hero, Captain Masculine.This himbo is ruining my research, and if his firepower doesn’t kill me, the sight of him in Lycra surely will. Luckily—or unluckily, in my opinion—my bestie just signed me up for the Bangers dating app and found my perfect match.If this isn’t the start of my villain arc, I don’t know what is.ButchIt’s hard feeling like I have to wear a mask every day—that the only value I bring to the table is the sparkling image others have created for me.Such is the life of being Captain Masculine, Big City’s greatest superhero. This is the existence I was destined for, and I will gladly defend this city against every threat to its people.Except Doctor Antihero.I’ve seen countless villains come and go, but something about Antihero intrigues me more than the usual hero-villain encounters should.It’s because of him that I impulsively signed up for a dating app, hoping a meaningless fling with a local normie will help get my head back in the game. The truth is, what I really want is someone who sees me—the man behind the mask.But that’s a luxury no superhero can afford.---Not All Himbos Wear Capes is an MM romance between a superhero and a villain. Our men find other men in tight supersuits incredibly attractive. Sometimes, they keep these supersuits on while engaging in explicit extracurricular activities with each other (and sometimes they even use bad words!). This is not your kid’s superhero book. This is Sin City and The Boys having a love child with extra spicy Spideypool and is meant for 18+ adults who can handle such things.The Villainous Things series contains standalone books (each with HEAs) that feature interconnected characters and an overarching plot.---*FULL LIST OF Content & TWs can be found in the front of the book and at c-rochelle[dot]com*CONTENT & TROPES:• MM romance• Dual POV• Superheroes/villains• Grumpy/sunshine• Star-crossed lovers + fated mates• Lovers-to-enemies-to-lovers (yup)• Hurt/comfort + found family• D/s dynamic that's more bedroom than lifestyle• MM romance (in case you missed that part)• Plus suspenseful plot + save-the-world epicness for pizazzPOTENTIAL TRIGGERS:• Sweary dialogue• Naughty irreverent humor• Extremely morally gray characters with moments of psychotic ideation• Extra spicy extracurricular activities (see inside book and c-rochelle[dot]com for specifics)• Minor gore in villain lair and during hero/villain battle scenes• Controlling + neglectful parents with some physical (superpowered) abuse• Lack of autonomy + indentured servitude• Restraints (not the fun kind)• Detailed descriptions of humans’ negative effects on coastal wildlife (specifically with pollution and including a seagull autopsy with details of the contents of its stomach)",
  "genres": [
    "M M Romance",
    "Romance",
    "Fantasy",
    "Enemies To Lovers",
    "BDSM",
    "Paranormal",
    "Superheroes"
  ],
  "author": "C. Rochelle",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/62296322-not-all-himbos-wear-capes"
}