{
  "title": "Entwined Within the Darkness",
  "description": "Prepare for a whirlwind of supernatural chaos in a night gone demonically wrong...Patience, a witch with a thirst for answers, finds herself trapped in a web of lost memories and unanswered questions, even after half a century. Plagued by haunting visions of piercing red eyes and plagued by mysterious dreams, the truth eludes her. Seeking distraction, she defies all laws and infiltrates the forbidden vampire club, Moarte. Little does she know, her world is about to spiral into darkness.When her closest friend, Michael, undergoes a terrifying transformation into a full-fledged demon, Patience is driven to desperate measures. She binds him to his vampire lover, hoping to save him from the abyss. But the situation takes a treacherous turn when Lucius, the formidable brother of Michael's vampire escort, emerges with a seething hatred for witches—and an undeniable magnetic pull towards Patience.Forced into an unlikely alliance, Patience and Lucius must join forces to locate a precious soul gem that holds the key to breaking the deadly bond before Michael and his brother's souls are irrevocably lost. As their dangerous alliance deepens, long-buried memories resurface, connecting them in ways they never expected. Patience soon realizes Lucius might hold the answers to her enigmatic past, but can she convince him she is more than an enemy to be vanquished?In a journey that entwines love, danger, and the dark forces of destiny, Patience, and Lucius unravel the secrets that bind them together. But the price of unlocking their fate may prove deadlier than they ever imagined. Brace yourself for an electrifying ride as they navigate a world where trust is scarce and their unspoken attraction could be their ultimate salvation or damnation.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Romance",
    "Fiction",
    "Paranormal Romance"
  ],
  "author": "Charley Black",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/62295054-entwined-within-the-darkness"
}