{
  "title": "LaBelle Cuisine: Recipes to Sing About",
  "description": "\"From the time I was a little girl, I knew there were two things in this world I was born to do: sing and cook. I've spent my life developing my voice and my recipes, and to tell you the truth, I'm hard pressed to say where I'm happiest--in concert or in the kitchen, making music or making meals.\"For Patti, cooking is about love. Taught by the great Southern cooks in her family--her mother, father, and aunts Hattie Mae and Joshia Mae--Patti LaBelle has kept these family heirlooms close to her heart. But now, she invites you into her kitchen and serves up more than 100 of her favorite recipes, from treasured down-home favorites--Say-My-Name Smothered Chicken and Gravy, Fierce Fried Corn, and Aunt Hattie's Scrumptious Sweet Tater Bread--to good-enough-for-dinner-parties dishes--Shrimp Etouffée, Roast Leg of Lamb with Rosemary-Lemon Rub, and Aunt Mary's Philadelphia Buttercake.Wherever Patti goes, so do her electric frying pans and bottles of hot sauce. After her raise-the-roof shows, she often goes back to her hotel room and whips up a meal for her band or celebrity visitors. When she's home--at holiday time and at family gatherings--or just after one of her sold-out concert tours, Patti likes nothing more than to head for her kitchen and cook her Geechee Geechee Ya Ya Gumbo, Pass-It-On Pot Roast, or Burnin' Babyback Ribs. And like her bestselling memoir, Don't Block the Blessings , her accompanying personal reminiscences will fill your heart just as her recipes will fill your stomach.Patti LaBelle's LaBelle Cuisine has the recipes you'll want to cook, eat, and share with friends. Filled with the legendary diva's favorite dishes and step-by-step instructions on how to prepare them, LaBelle Cuisine makes you feel like Patti's in the kitchen with you, demonstrating the recipes and techniques that can turn anybody into a fabulous cook.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Biography"
  ],
  "author": "Patti LaBelle",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/622713.LaBelle_Cuisine"
}