{
  "title": "Straight Sex: Rethinking the Politics of Pleasure",
  "description": "Is heterosexual sex inherently damaging to women? Is it possible for women to enjoy sensuality and pleasure with men that does not increase male power? Lynne Segal's unflinching examination of feminist thinking on sexuality over the past twenty-five years tackles these questions head on. Straightforward and challenging, she invites an exploration of sex in our culture—an exploration that could reverse the traditional male gaze and phallic construction of the heterosexual woman.Only two decades ago, politically aware women often declared themselves both sexual liberationists and feminists—their right to sexual fulfillment symbolized their right to selfhood. However, the most positive women's writing on female sexuality in recent years has come primarily from the lesbian community. Segal addresses the silence of heterosexual feminists on questions of sex and love and notes the shift toward sexual conservatism. She looks at the trends that followed Sixties sex as a subversive activity, the \"liberated orgasm,\" sex advice literature, gender uncertainties, Queer politics, antipornography campaigns, the rise of the moral right.The hidden anxieties of male sexuality are also discussed. For both men and women, says Segal, our wildest dreams and worst fears are often projected onto sex. She urges an understanding of how our personal pleasures and pains remain public issues, and how a rethinking of sexual liberation could inspire a truly progressive politics for our time.\"It is always another whom we try to reach when we experience desire, it is their physical contact we want—sometimes, any sort of contact will suffice . . . and by whom we yearn to feel ourselves desired. It is the very greatest of joys, as I experience it . . . simply to know that we are able to desire, maybe even able to love, some other human adult.\" —from the book",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Sexuality",
    "Politics",
    "Philosophy",
    "Sociology",
    "Gender"
  ],
  "author": "Lynne Segal",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/622648.Straight_Sex"
}