{
  "title": "Hunger",
  "description": "A Dark Love Story\"As I struggle to unlock my gaze from the impertinent bridesmaid who doesn’t seem able to stop herself from giving me attitude, I contemplate the various ways in which I intend to teach the insolent little brat a lesson.\"GreysonThis wasn't supposed to happen.Every piece of my life has been planned out since the day I was born, calculated to the letter.I knew where I was headed. I knew what to do at every turn.I had power and wealth and privilege, and women dropping to their knees whenever I would care to look at them.And most of all, I had what I required most...Control.Until I met her.She blazed into my life entirely uninvited, a storm of chaos, creating messes for me to clean up, daring me with her audacious eyes, her impertinent attitude, and that smart little mouth of hers.Her singular beauty knocked me off balance despite her refusal to show me the reverence that my name normally arouses.Now when I close my eyes, I am hounded by her face, by her voice, by her taste.And what's more, she has awakened in me a torturous need to protect her. A need that renders me weak, and one which my illustrious family little appreciates.The way she consumes me despite her unrelenting insubordination is most unwanted.I need to get back to what I had before--absolute control.And a life I was the master of.Free of the torment afflicting me.That means I need to work her insolence out of my system bit by bit.To claw back every piece of control that I've lost while drowning in obstinate green eyes that just dare me to punish her.To do that, I must make her submit to me, to willingly fulfill every one of my unpalatable desires.Once she does that, I will be free of this affliction.I will be the Master again.IndigoGreyson Everitt.A walking red flag.A man who doesn't hide his need to dominate.He says he can't fall in love, but he watches over me with a fervor I've never seen before, and the way he protects me stuns my senses, urging me to succumb to his will.Or almost.I've been hurt before, and I won't allow any man to take control again. Even one as coveted as him.The only problem is... when he touches me, I want only to melt, to let go, to finally trust again.His words are rough, but his touch is strangely tentative, even when he binds my hands behind my back.He wants a brand of submission he'll never get from me.I intend to resist him all the way.I just need to withstand this heat.I just need to not succumb to this HUNGER.___________________________________________Hunger is a standalone dark love story with a HEA. It is emotion-heavy and features a dominant male hero who needs control and a very feisty heroine who refuses to relinquish it. Dual POV.It features adult themes and is for mature readers only.",
  "genres": [
    "Dark Romance",
    "Dark",
    "Enemies To Lovers",
    "Romance",
    "Contemporary",
    "BDSM"
  ],
  "author": "Monique Edenwood",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/62296434-hunger"
}