{
  "title": "Tracing Paradise: Two Years in Harmony with John Milton",
  "description": "One winter morning, poet Dawn Potter sat down at her desk in Harmony, Maine, and began copying out the opening lines of John Milton's Paradise Lost. Her intent was to spend half an hour with a poem she had never liked, her goal to transcribe a page or two. Maybe she would begin to appreciate the poet's art, though she had no real expectations that the exercise would change her mind about the poem. Yet what began as a whim turned rapidly into an obsession, and soon Potter was immersed in a strange and unexpected she found herself copying out every single word of Milton's immense, convoluted epic.Tracing Two Years in Harmony with John Milton is her memoir of that long task. Over the course of twelve chapters, Potter explores her very personal response to Milton and Paradise Lost, tracing the surprising intersections between a seventeenth-century biblical epic and the routine joys and tragedies of domestic life in contemporary rural Maine. Curious, opinionated, and eager, she engages with the canon on mutable, individual terms. Though she writes perceptively about the details and techniques of Milton's art, always her reactions are linked to her present-tense experiences as a poet, small-time farmer, family member, and citizen of a poor and beleaguered north-country town.A skilled and entertaining writer, Potter is also a wide-ranging and sophisticated reader. Yet her memoir is not a scholarly her enthusiasms and misgivings about both Milton and Paradise Lost ebb and flow with the days. Tracing Paradise reminds us that close engagement with another artist's task may itself be a form of creation. Above all, Potter's memoir celebrates one reader's difficult yet transformative love affair with Milton's glorious, irritating, inscrutable masterpiece.",
  "genres": [],
  "author": "Dawn Potter",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/6228441-tracing-paradise"
}