{
  "title": "Chasing the Dragon",
  "description": "Lila Black returns in the fourth volume of high-octane, high-magic, high-tech adventures.Ever since the Quantum Bomb of 2015 things have been different; the dimensions have fused and suddenly our world is accessible to elves, demons, ghosts and elementals and their worlds are open to us. Things have been different for Special Agent Lila Black too: tortured and magic-scarred by elves, rebuilt by humans into a half-robot, part-AI, nuclear-fueled walking arsenal, married to a demon and in love with a recently-deceased elf. It was confusing enough before she was catapulted fifty years into her own future.Returning to the life of a guns-blazing secret agent, Lila finds herself having inherited all of her former boss's old offices and whatever mysteries they contain, as the elf has done a runner some fifty years previously. Appointed head of the new android division, she can see all too clearly what lies in store for her if the growth of the alien technologies in her cyborg body continue unchecked.But there are more immediate concerns. Like resurrecting her lover, Zal. And her husband, the demon Teazle, is embroiled in a fatal plot in Demonia, and her magic sword is making itself happy as a pen whose writing has the power to affect other worlds. The world is off its rocker and most everyone is terrified of faeries.And all the while, she hears the voices of the machine material projections of an immaterial form, The Signal. The Signal talks constantly if only she knew what it meant.Chasing the Dragon is bright, fast moving and accessible SF that mixes in fantasy and a cool cult-lit sensibility to create a series that will appeal to all fans of Laurrell K. Hamilton and Peter Hamilton alike.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Urban Fantasy",
    "Cyberpunk",
    "Science Fiction Fantasy",
    "Fae",
    "Romance"
  ],
  "author": "Justina Robson",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/6234689-chasing-the-dragon"
}