{
  "title": "Jelleyman's Thrown a Wobbly: Saturday Afternoons in Front of the Telly",
  "description": "Jeff Stelling is a legend among soccer fans. To the millions unable to get to their teams' games on Saturday afternoons, the next best thing is undoubtedly the pleasurable company of Jeff and the Sky Sports videprinter for a cozy marathon on the sofa. If someone's got to reveal that your beloved team have just gone 3–0 down away from home and had a man sent off, it's best if it's consummate professional Jeff who breaks the news to you. Avid Hartlepool fan Jeff knows our pain and shares our joy—but mostly he knows our pain. The long-time host of SkySports' iconic Soccer Saturday show has become a cult figure, universally admired for his encyclopedic knowledge of the game, his genuine and unlimited enthusiasm for all levels of soccer, and his wicked sense of humor which makes the six-hour long show simply whiz by. This deliciously chaotic, hugely entertaining, anecdote-ridden, humorous taste of life in the Soccer Saturday studio reveals what Jeff has to say about some of the show's legendary pundits over the years—ex-players such as George Best, Rodney Marsh, Chris Kamara, Charlie Nicholas, and Matt Le Tissier. Get the inside track on all those great one-liners: \"Mansfield Town's Gareth Jellyman has been shown the red card for dissent. Looks like Jellyman's thrown a wobbly.\" \"Darlington's equalizer has been scored by Guyain Ndumbu-Nsungu. Very much a case of local boy makes good.\" \"They'll be dancing in the streets of Total Network Solutions tonight.\" \"James Brown's grabbed a second for Hartlepool. I feel good!\" Jellyman's Thrown a Wobbly goes a long way to demonstrate how a six-hour long, studio-based show with no live action pictures and featuring men gazing into TV monitors which the viewer can't see, can hold a huge audience enthralled every Saturday afternoon between August and May.",
  "genres": [
    "Football",
    "Sports",
    "Humor",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "Comedy"
  ],
  "author": "Jeff Stelling",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/6237900-jelleyman-s-thrown-a-wobbly"
}