{
  "title": "The True Love Experiment",
  "description": "Sparks fly when a romance novelist and a documentary filmmaker join forces to craft the perfect Hollywood love story and take both of their careers to the next level—but only if they can keep the chemistry between them from taking the whole thing off script.Felicity “Fizzy” Chen is lost. Sure, she’s got an incredible career as a beloved romance novelist with a slew of bestsellers under her belt, but when she’s asked to give a commencement address, it hits her: she hasn’t been practicing what she’s preached.Fizzy hasn’t ever really been in love. Lust? Definitely. But that swoon-worthy, can’t-stop-thinking-about-him, all-encompassing feeling? Nope. Nothing. What happens when the optimism she’s spent her career encouraging in readers starts to feel like a lie?Connor Prince, documentary filmmaker and single father, loves his work in large part because it allows him to live near his daughter. But when his profit-minded boss orders him to create a reality TV show, putting his job on the line, Connor is out of his element. Desperate to find his romantic lead, a chance run-in with an exasperated Fizzy offers Connor the perfect solution. What if he could show the queen of romance herself falling head-over-heels for all the world to see? Fizzy gives him a hard pass—unless he agrees to her list of demands. When he says yes, and production on The True Love Experiment begins, Connor wonders if that perfect match will ever be in the cue cards for him, too. The True Love Experiment is the book fans have been waiting for ever since Fizzy’s debut in The Soulmate Equation. But when the lights come on and all eyes are on her, it turns out the happily ever after Fizzy had all but given up on might lie just behind the camera.",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary",
    "Fiction",
    "Contemporary Romance",
    "Adult",
    "Chick Lit"
  ],
  "author": "Christina Lauren",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/62361081-the-true-love-experiment"
}