{
  "title": "The Stanley Kubrick Archives",
  "description": "The first book to explore Stanley Kubrick's archives is also the most comprehensive study of the filmmaker to date Part 1: The films In 1968, when Stanley Kubrick was asked to comment on the metaphysical significance of 2001: A Space Odyssey, he replied: ?It's not a message I ever intended to convey in words. 2001 is a nonverbal experience?. I tried to create a visual experience, one that bypasses verbalized pigeonholing and directly penetrates the subconscious with an emotional and philosophic content.? The philosophy behind Part I borrows from this line of thinking: from the opening sequence of Killer's Kiss to the final frames of Eyes Wide Shut, Kubrick's complete films will be presented chronologically and wordlessly via frame enlargements. A completely nonverbal experience. Part 2: The Creative Process Divided into chapters chronologically by film, Part 2 brings to life the creative process of Kubrick's filmmaking by presenting a remarkable collection of material from his archives, including photographs, props, posters, artwork, set designs, sketches, correspondence, documents, screenplays, drafts, notes, and shooting schedules. Accompanying the visual material are essays by noted Kubrick scholars, articles written by and about Kubrick, and a selection of Kubrick's best interviews. Special features ? Part 1 features 800 film stills scanned directly from the original prints and interpositives ? Part 2 presents about 800 items from the archives, most of which have never been published before ? essays by Kubrick scholars Gene D. Phillips, Michel Ciment, and Rodney Hill ? selected articles and essays, including interviews with and essays by Stanley Kubrick ? illustrated Kubrickchronology ? audio CD featuring a 70-minute 1966 interview of Stanley Kubrick by Jeremy Bernstein **BONUS** ? books in the first print run will each include a twelve-frame film strip from a 70mm print of 2001: A Space Odyssey owned by Stanley Kubrick Made in cooperation with Jan Harlan, Christiane Kubrick, and the Stanley Kubrick Estate. The editor: Alison Castle received a BA in philosophy from Columbia University and an MA in photography and film from New York University (NYU/International Center of Photography masters program). Castle also edited TASCHEN's Some Like it Hot. She lives in Paris, home of the world's best cinemas.",
  "genres": [
    "Film",
    "Nonfiction",
    "Art",
    "Biography",
    "Media Tie In",
    "Collections",
    "Reference"
  ],
  "author": "Stanley Kubrick",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/62381.The_Stanley_Kubrick_Archives"
}