{
  "title": "Ripped: How the Wired Generation Revolutionized Music",
  "description": "A decade ago the vast majority of mainstream music was funneled through a handful of media conglomerates. Now, more people are listening to more music from a greater variety of sources than at any time in history. And big corporations such as Viacom, Clear Channel, and Sony are no longer the sole gatekeepers and distributors, their monopoly busted by a revolution -- an uprising led by bands and fans networking on the Internet. Ripped tells the story of how the laptop generation created a new grassroots music industry, with the fans and bands rather than the corporations in charge. In this new world, bands aren't just musicmakers but self-contained multimedia businesses; and fans aren't just consumers but distributors and even collaborators. As the Web popularized bands and albums that previously would have been relegated to obscurity, innovative artists -- from Prince to Death Cab for Cutie -- started coming up with, and stumbling into, alternative ways of getting their music out to fans. Live music took on an even more significant role. TV shows and commercials emerged as great places to hear new tunes. Sample-based composition and mash-ups leapfrogged ahead of the industry's, and the law's, ability to keep up with them. Then, in 2007, Radiohead released an album exclusively on the Internet and allowed customers to name their own price, including $0.00. Radiohead's \"it's up to you\" marketing coup seized on a concept the old music industry had the customer is always right. National radio host and critically acclaimed music journalist Greg Kot masterfully chronicles this story of how we went from $17.99 to $0.00 in less than a decade. It's a fascinating tale of backward thinking, forward thinking, and the power of music.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Technology",
    "Cultural",
    "Pop Culture",
    "Business"
  ],
  "author": "Greg Kot",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6240268-ripped"
}