{
  "title": "Hunger and Temptation",
  "description": "Bad in Boots - Harm's Hunger By Patrice Michelle Book 1 in the Bad In Boots series. In order to meet her Great-aunt Sally's will stipulation to 'handle the sale personally,' Jena Hudson visits Texas to finalize the sale of her aunt's ranch to her neighbor, Harm Steele. What Jena didn't expect was to fall for the rugged, sexy cowboy. Harm might find Jena to be the most sensual creature he's ever met, but he won't let her sultry body be more than a satisfying distraction. He learned a long time ago that happily-ever-afters are best left for childhood fantasies. So what's a girl to do when she finds out the man of her dreams doesn't believe in a happy ending? Well, given the right set of circumstances...she'll create one for him.Bad in Boots - Ty's Temptation By Patrice Michelle Book 2 in the Bad In Boots series. Ty Hudson never expected a trip to Texas for his sister's wedding would turn into a lesson in patience...of the sensual kind. When a sexy cowgirl ties him up then offers a suggestive proposal, Ty's more than willing to accommodate her, but only on his terms. Evan Masters has always lived her life one step ahead of most people. So she's surprised when she's faced with an intelligent, seductive, tightly controlled man who agrees to show her the ropes in the one area of her life she's yet to tread. Ty might insist on doing things his way-slow and easy-but the more he prolongs their sensual dance, the more Evan wants to show him just how satisfying letting go and giving in to their desires can be. As the sexual heat and anticipation between them builds to a boiling point, Ty discovers that his own personal \"\"Eve\"\" is more temptation than he can resist. Note: Even though Ty's Temptation is part of a series, it can be read separately.",
  "genres": [
    "Erotic Romance",
    "Contemporary Romance",
    "Anthologies",
    "Erotica",
    "Westerns"
  ],
  "author": "Patrice Michelle",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/624382.Hunger_and_Temptation"
}