{
  "title": "The Great Mortality : An Intimate History of the Black Death, the Most Devastating Plague of All Time",
  "description": "A compelling and harrowing history of the Black Death epidemic that swept through Europe in the mid–14th century killing 25 million people. It was one of the most devastating human disasters in history.\"The bodies were sparsely covered that the dogs dragged them forth and devoured them . And believing it to be the end of the world, no one wept for the dead, for all expected to die.\" Agnolo di Turo, Siena, 1348In just over 1000 days from 1347 to 1351 the 'Black Death' swept across medieval Europe killing 30% of it's population. It was a catastrophe that touched the lives of every individual on the continent. The deadly Y. Pestis virus entered Europe by Genoese galley at Messina, Sicily in October 1347. By the spring of 1348 it was devastating the cities of central Italy, by June 1348 it had swept in to France and Spain, and by August it had reached England. One graphic testimony can be found at St Mary's, Ashwell, Hertfordshire, where an anonymous hand carved a harrowing inscription for 1349: 'Wretched, terrible, destructive year, the remnants of the people alone remain.'According to the Foster scale, a kind of Richter scale of human disaster, the plague of 1347–51 is the second worst catastrophe in recorded history. Only World War II produced more death, physical damage, and emotional suffering. It is also the closest thing that Defence Analysts compare a thermonuclear war to – in geographical extent, abruptness and casualties.In The Great Mortality John Kelly retraces the journey of the Black Death using original source material – diary fragments, letters, manuscripts – as it swept across Europe. It is harrowing portrait of a continent gripped by an epidemic, but also a very personal story narrated by the individuals whose lives were touched by it.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medicine",
    "Medical",
    "Historical",
    "Medieval"
  ],
  "author": "John     Kelly",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1292213.The_Great_Mortality_"
}