{
  "title": "Cleopatra and Antony: Power, Love, and Politics in the Ancient World",
  "description": "The story of the world's best-remembered celebrity couple, set against the political backdrop of their time. On a stiflingly hot day in August 30 b.c., the thirty-nine-year-old queen of Egypt, Cleopatra, took her own life rather than be paraded in chains through Rome by her conqueror, Octavian--the future first emperor, Augustus. A few days earlier, her lover of eleven years, Mark Antony, had himself committed suicide and died in her arms. Oceans of mythology have grown up around them, all of which Diana Preston explores in her stirring history of the lives and times of a couple whose names--more than two millennia later--still invoke passion, curiosity, and intrigue.Preston views the drama and romance of Cleopatra and Antony's personal lives as an integral part of the great military, political, and ideological struggle that culminated in the full-fledged rise of the Roman Empire, joined east and west. Perhaps not until Joanna in fourteenth-century Naples or Elizabeth I of England would another woman show such political shrewdness and staying power as did Cleopatra during her years atop the throne of Egypt. Her lengthy affair with Julius Caesar linked the might of Egypt with that of Rome; in the aftermath of the civil war that erupted following Caesar's murder, her alliance with Antony, and his subsequent split with Octavian, set the stage for the end of the Republic.With the keen eye for detail, abundant insight, and storytelling skill that have won awards for her previous books, Diana Preston sheds new light on a vitally important period in Western history. Indeed, had Cleopatra and Antony managed to win the battle of Actium, the centuries that followed, which included the life of Jesus himself, could well have played out differently.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Ancient History",
    "Egypt",
    "Historical",
    "Politics"
  ],
  "author": "Diana Preston",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/6251412-cleopatra-and-antony"
}