{
  "title": "Sundowners",
  "description": "From the author of the supernatural suspense series Gifted (Healer, Connection) comes a new queer paranormal romance series.Praise for Connection: \"The romance element is complemented nicely by the relentless action and adventure throughout, creating an emotionally intense and page-turning narrative...A fast-paced and fun fusion of supernatural romance and mainstream thriller.\" ~KirkusVampire Creed Lowell drifts from town to town working with the elderly as a night nurse and looking to avenge his harrowing past. His youth and vitality make him a favorite of his patients and his gifts bring them peace. At long last he’s arrived in the place where he hopes to find the truth about those who betrayed him…but first he finds an unexpected love with a man who might understand him—or end him.Grad student Roman San Angelo is struggling to handle his courses, teaching schedule, and research for his dissertation on an obscure cult. He spends every spare moment with his beloved yet demanding grandmother Frances who’s recently moved to an assisted living facility—and he’s fascinated by her night nurse, who is able to bring out the inner light which had faded during her battle with dementia. Something about Creed doesn’t add up, however, Roman finds himself fighting an undeniable attraction. His concerns multiply when Roman discovers a connection between Creed and a bizarre series of vampire-wannabe assaults in the area. A moment of weakness leads to a night of passion between them, and the promise of something more, and yet Roman can’t shake his concern that Creed is not what he seems.Creed knows better than to bring a mortal into his world, even one who could help him find the link between the pack of violent vampires preying on the people of Santa Cruz and Creed’s past. When he discovers Creed’s secret, Roman is ready to step outside his comfort zone and accept everything a life with a vampire entails, and when Creed disappears, Roman will go to the ends of the earth to find the man who brought the light back to his grandmother and the warmth back to his own heart.*This book contains violence and sexual content. It is meant for audiences 18+",
  "genres": [
    "Fantasy",
    "Vampires",
    "Paranormal",
    "Urban Fantasy",
    "Romance",
    "LGBT",
    "M M Romance"
  ],
  "author": "R.L. Merrill",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/62508288-sundowners"
}