{
  "title": "American Beauty: The Shooting Script",
  "description": "On a typical suburban street in a typical suburban town, there is an ordinary family living the American dream. But look closer. Lester Burnham's wife, Carolyn, regards him with contempt, his daughter, Jane, thinks he's a loser, and his boss is positioning him for the ax.Captivated by Jane's sultry high school friend Angela, Lester decides to make a few changes in his mere existence—changes that are less mid-life crisis than a life reclaimed. The freer he gets, the happier he gets, which is even more maddening to his wife and daughter. Complicating matters, Lester finds an unexpected ally in Ricky, the teenage son of the new next-door neighbors, who sees life through a camera lens that has lately focused on Jane Burnham.In pursuit of his new vision of the American dream, Lester is about to learn that the ultimate freedom comes at the ultimate price.The 1999 winner of five Academy Awards®, including Best Picture and Best Original Screenplay, American Beauty boasts an accomplished cast led by two-time Academy Award® Best Actor winner Kevin Spacey (The Usual Suspects) and Oscar® nominee Annette Bening (The Grifters). The ensemble cast also includes Thora Birch (Ghost World), Wes Bentley (The Claim), Mena Suvari (American Pie), Peter Gallagher (Mr. Deeds), Allison Janney (NBC's The West Wing), Scott Bakula (NBC's Quantum Leap), Sam Robards (A.I.: Artificial Intelligence), and Chris Cooper (Adaptation).American Beauty marks the feature film directorial debut of award-winning theater director Sam Mendes (The Blue Room, Cabaret). The film is produced by Dan Jinks (Nothing to Lose) and Bruce Cohen (The Flintstones in Viva Rock Vegas) from an original screenplay by Alan Ball (HBO's Six Feet Under). Stan Wlodkowski (One Hour Photo) and Alan Ball are the co-producers.",
  "genres": [
    "Film",
    "Media Tie In",
    "Fiction",
    "Romance",
    "Plays",
    "Humor",
    "Drama"
  ],
  "author": "Alan Ball",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/624665.American_Beauty"
}