{
  "title": "Il principe di sangue nero",
  "description": "ANNO 1870. I VAMPIRI HANNO CONQUISTATO LA PARTE SETTENTRIONALE DEL PIANETA, SEMINANDO MORTE E DEVASTAZIONELe grandi e sfarzose capitali dell'era industriale sono diventate cimiteri. I pochi sopravvissuti hanno dovuto cercare rifugio ai Tropici, il cui clima torrido è nocivo alle grigie creature della notte. Così, dall'Egitto al Centro America, fino ai templi immersi nelle foreste della Malesia, sono sorte nuove civiltà del vapore e del ferro, fondate sull'arte e la tecnologia. Anno 2020. Quello che resta del glorioso impero britannico è ora il regno di Equatoria, la cui erede al trono è la principessa Adele, un'intrepida guerriera, ma anche una ragazza colta e raffinata, che trascorre intere giornate immersa nella lettura nei silenziosi saloni della mitica Biblioteca di Alessandria. La sua intraprendenza e il suo spirito indomito risveglieranno però la crudeltà di un efferato clan di vampiri decisi a scatenare una nuova guerra. In questa lotta all'ultimo sangue, Adele troverà al proprio fianco il principe Greyfriar, affascinante signore delle tenebre dal volto mascherato. E il misterioso protettore le rivelerà la vera natura del conflitto tra gli uomini e i non-morti, combattendo con lei una battaglia epocale per la vita e per l'amore.Il Principe di sangue nero è il primo romanzo della trilogia Vampire Empire, un'appassionante saga epica in cui il bene e il male si insinuano nello scontro di civiltà tra umani e vampiri. Ma Vampire Empire è anche una grande storia d'amore e una magistrale combinazione di generi - fantasy, steampunk, romance, storico - che si è guadagnato il plauso della critica e del pubblico americani per avere portato una boccata d'aria fresca nel sovrappopolato mondo dei vampiri.",
  "genres": [
    "Steampunk",
    "Vampires",
    "Fantasy",
    "Paranormal",
    "Urban Fantasy",
    "Romance",
    "Fiction"
  ],
  "author": "Clay Griffith",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/12922301-il-principe-di-sangue-nero"
}