{
  "title": "Playing for England",
  "description": "When best selling author David Black took a slug in the eye, it seemed his military career was over, or was it? He began to rebuild his shattered life by taking a most extreme road to salvation...British army SAS selection! With a 90% failure rate, had David set the bar too high? Had he embarked on an impossible quest? Join him on the barren and unforgiving mountains of south Wales, and see for yourself what the elite SAS demanded of him and what he endured in this true and quite amazing story. David Black served in the British army for more than 15 years. From the ugly, war-torn streets of Londonderry in the early 1970's, to the ranks of a Territorial regiment of the now famous Special Air Service, until the mid-eighties. When not serving part-time with the Regiment, he worked as a fully qualified London black cab driver. Because of the security implications with the S.A.S., David has waited over twenty years before writing anything about his many military adventures. Names have been changed, because even now, ex-members of the Regiment (and their families) are potential targets for the more rabid elements of the terrorist world. David holds many memories of life and experiences in the British army and particularly the Special Air Service regiment; happy, sad, funny, outrageous and sometimes, downright dangerous. This book covers his early military years, and culminates with a detailed look at his S.A.S. Selection and Continuation training course. He holds the old saying “I wouldn't change a moment\" close to his heart... and means every word of it! Having published his fascinating reserve SAS autobiography - Playing for England and based on a mixture of fiction and his own experiences, David is currently writing a new and highly original series of novels concerning the dangerous global missions of Sgt. Pat Farrell and the SAS reserve – The men of the ultra-secret SAS Shadow Squadron burst onto the global stage in book #1 - THE GREAT SATAN. Shadow Squadron travel to Africa on exercise, and get much more than they bargained for in book #2 - DARK EMPIRE In the third book in the series, SAS Sgt Pat Farrell and his men face their greatest challenge #3 THE DEVIL'S WEB JUST RELEASED - David's latest...'EAGLES of the DAMNED' - Why did three Roman Legions die in the vast Teutoburg Wald in AD 9? Join Centurion Rufus as he fights for survival, trapped with his men in the depths of the dark and forbidding forest. Based on a true story, this is an incredible tale of courage, horror and betrayal...",
  "genres": [],
  "author": "David  Black",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/12923116-playing-for-england"
}