{
  "title": "Homebodies",
  "description": "Urgent, propulsive, and strikingly insightful, Homebodies is a thrilling debut novel about a young Black writer whose world is turned upside down when she loses her coveted job in media and pens a searing manifesto about racism in the industry. Mickey Hayward dreams of writing stories that matter. She has a flashy media job that makes her feel successful and a devoted girlfriend who takes care of her when she comes home exhausted and demoralized. It’s not all A-list parties and steamy romance, but Mickey’s on her way, and it’s far from the messy life she left behind in Maryland. Despite being overlooked and mistreated at work, it seems like she might finally get the chance to prove herself—until she finds out she’s being replaced. Distraught and enraged, Mickey fires back with a detailed letter outlining the racism and sexism she’s endured as a Black woman in media, certain it will change the world for the better. But when her letter is met with overwhelming silence, Mickey is sent into a tailspin of self-doubt. Forced to reckon with just how fragile her life is—including the uncertainty of her relationship—she flees to the last place she ever dreamed she would run to, her hometown, desperate for a break from her troubles. Back home, Mickey is seduced by the simplicity of her old life—and the flirtation of a former flame—but her life in New York refuses to be forgotten. When a media scandal catapults Mickey’s forgotten letter into the public zeitgeist, suddenly everyone wants to hear what Mickey has to say. It’s what she’s always wanted—isn’t it? Intimate, witty, and deeply sexy, Homebodies is a testament to those trying to be heard and loved in a world that refuses to make space, and introduces a standout new writer.",
  "genres": [
    "Fiction",
    "Queer",
    "LGBT",
    "Contemporary",
    "Literary Fiction",
    "Audiobook",
    "Lesbian"
  ],
  "author": "Tembe Denton-Hurst",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/62558851-homebodies"
}