{
  "title": "The Creation: An Appeal to Save Life on Earth",
  "description": "In this daring work, Edward O. Wilson proposes an alliance between science and religion to save Earth's vanishing biodiversity. Dear Pastor: We have not met, yet I feel I know you well enough to call you friend. First of all, we grew up in the same faith. Although I no longer belong to that faith, I am confident that if we met and spoke privately of our deepest beliefs, it would be in a spirit of mutual respect and goodwill. I write to you now for your counsel and help. Let us see if we can, and you are willing, to meet on the near side of metaphysics in order to deal with the real world we share. I suggest that we set aside our differences in order to save the Creation. The defense of living Nature is a universal value. It doesn't rise from nor does it promote any religious or ideological dogma. Rather, it serves without discrimination the interests of all humanity. Pastor, we need your help. The Creation―living Nature―is in deep trouble. The Creation is E. O. Wilson's most important work since the publications of Sociobiology and Biophilia . Like Rachel Carson's Silent Spring , it is a book about the fate of the earth and the survival of our planet. Yet while Carson was specifically concerned with insecticides and the ecological destruction of our natural resources, Wilson, the two-time Pulitzer Prize-winner, attempts his new social revolution by bridging the seemingly irreconcilable worlds of fundamentalism and science. Like Carson, Wilson passionately concerned about the state of the world, draws on his own personal experiences and expertise as an entomologist, and prophesies that half the species of plants and animals on Earth could either have gone or at least are fated for early extinction by the end of our present century. Astonishingly, The Creation is not a bitter, predictable rant against fundamentalist Christians or deniers of Darwin. Rather, Wilson, a leading \"secular humanist,\" draws upon his own rich background as a boy in Alabama who \"took the waters,\" and seeks not to condemn this new generations of Christians but to address them on their own terms. Conceiving the book as an extended letter to a southern Baptist minister, Wilson, in stirring language that can evoke Martin Luther King's \"Letter from Birmingham Jail,\" tells this everyman minister how, in fact, the world really came to be. He pleads with these men of the cloth to understand the cataclysmic damage that is destroying our planet and asks for their help in preventing the destruction of our Earth before it is too late. Never a pessimist, Wilson avers that there are solutions that may yet save the planet, and believes that the vision that he presents in The Creation is one that both scientists and pastors can accept, and work on together in spite of their fundamental ideological differences.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Environment",
    "Nature",
    "Ecology",
    "Religion"
  ],
  "author": "Edward O. Wilson",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/62539.The_Creation"
}