{
  "title": "Reef Madness: Charles Darwin, Alexander Agassiz, and the Meaning of Coral",
  "description": "Reef Madness opens up the world of nineteenth-century science and philosophy at a moment when the nature of scientific thought was changing, when what we call “science” (the word did not even exist) was spoken of as “natural philosophy” and was a part of theology, the study of “God’s natural works.” This is how what is now called science, until then based on the presence and hence the authority of God, moved toward reliance on observable phenomena as evidence of truth. At the book’s center, two of that century’s most bitter one about the theory of natural selection, the other about the origin of coral. Caught in the grip of these controversies were two men considered to be the gods of the nineteenth-century scientific Charles Darwin, the most controversial and ultimately the most influential; and the Swiss-born zoologist Louis Agassiz, almost forgotten today but at the time even more lionized than Darwin. Agassiz was a paleontologist, the first to classify the fossil fish of the planet, and the first to conceive the idea of the ice age that altered our view of the Earth. He taught at Harvard, founded the Museum of Comparative Zoology, was one of the founders of the Smithsonian and of the National Academy of Sciences, and was considered the greatest lecturer of his time—eloquent, charming, spellbinding. Among his Emerson, Theodore Roosevelt, William James, and Thoreau. Agassiz believed that nature was so vast, complicated, and elegantly ordered that it could only be the work of God. We see how this central principle of Agassiz’s was threatened by Darwin’s most central theory—that species change through natural causes, that we exist not because we’re meant to but because we happen to. Agassiz, forced either to disprove Darwin’s principle or give up his own, went to war full tilt against the theory of natural selection. It was a war that, beyond its own drama, had a second important effect on the new world of science. David Dobbs tells how Agassiz’s son, Alexander, one of the most respected naturalists of his time, who witnessed his father’s rise and tragic defeat yet supported the theory of natural selection over his father’s objections, himself became locked in combat with Darwin. The subject of contention was the “coral reef problem.” As a young man of twenty-six, Darwin, with only a small amount of data, put forth a theory about the formation of these huge beautiful forms composed of the skeletons of tiny animals that survive in shallow water. It explained how the reefs could rise on foundations that emerged from the Pacific’s greatest depths. This became the subject of Darwin’s first long paper, and it propelled him to the highest circles of British science. The obsessed younger Agassiz spent the next thirty years in a vain effort to disprove Darwin’s coral theory, traveling 300,000 miles of ocean and looking at every coral mass. In so doing, he laid the groundwork for oceanography, through which, in 1950, the question of the origin of coral was finally resolved. In Reef Madness , Dobbs looks at the nature of scientific theory. He shows how Darwin was crucially influenced by his encounters with the Agassiz father and son, and how the coral problem prefigured the fierce battle about evolution. Original, illuminating, and fascinating, Reef Madness uses these large human struggles, which devastated two lives and shaped the thinking of another, to make real the Victorian world of science and to show how it affected the century that followed and continues to this day to affect our own.",
  "genres": [
    "Science",
    "History",
    "Nonfiction",
    "Biology",
    "Geology",
    "History Of Science",
    "Natural History"
  ],
  "author": "David Dobbs",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/625426.Reef_Madness"
}