{
  "title": "American Fantastic Tales: Terror and the Uncanny from Poe to the Pulps",
  "description": "From early on, American literature has teemed with tales of horror, of hauntings, of terrifying obsessions and gruesome incursions, of the uncanny ways in which ordinary reality can be breached and subverted by the unknown and the irrational. As this pathbreaking two-volume anthology demonstrates, it is a tradition with many unexpected detours and hidden chambers, and one that continues to evolve, finding new forms and new themes as it explores the bad dreams that lurk around the edges—if not in the unacknowledged heart—of the everyday. Peter Straub, one of today’s masters of horror and fantasy, offers an authoritative and diverse gathering of stories calculated to unsettle and delight.This first volume surveys a century and a half of American fantastic storytelling, revealing in its 44 stories an array of recurring themes: trance states, sleepwalking, mesmerism, obsession, possession, madness, exotic curses, evil atmospheres. In the tales of Irving, Poe, and Hawthorne, the bright prospects of the New World face an uneasy reckoning with the forces of darkness. In the ghost-haunted Victorian and Edwardian eras, writers including Henry James, Edith Wharton, Mary Wilkins Freeman, Charlotte Perkins Gilman, and Ambrose Bierce explore ever more refined varieties of spectral invasion and disintegrating selfhood.In the twentieth century, with the arrival of the era of the pulps, the fantastic took on more monstrous and horrific forms at the hands of H. P. Lovecraft, Robert E. Howard, Robert Bloch, and other classic contributors to Weird Tales. Here are works by acknowledged masters such as Stephen Crane, Willa Cather, Conrad Aiken, and F. Scott Fitzgerald, along with surprising discoveries like Ralph Adams Cram’s “The Dead Valley,” Emma Francis Dawson’s “An Itinerant House,” and Julian Hawthorne’s “Absolute Evil.”American Fantastic Tales offers an unforgettable ride through strange and visionary realms.",
  "genres": [
    "Horror",
    "Short Stories",
    "Fantasy",
    "Fiction",
    "Anthologies",
    "Gothic",
    "Literature"
  ],
  "author": "Peter Straub",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/6254610-american-fantastic-tales"
}