{
  "title": "Devotion",
  "description": "Fans of Howard Norman, the internationally acclaimed author of The Hunting of L and The Bird Artist and a two-time National Book Award finalist, will find in his latest novel -- an intense and intriguingly unconventional love story -- all the hallmarks of this masterly writer: sparkling yet spare language, a totally compelling air of mystery spread over our workaday world, and ability to capture the metaphorical heartbeat at the center of our lives.Like many of Howard Norman’s celebrated novels, Devotion begins with an announcement of a crime: on August 19, 1985, David Kozol and his father-in-law engaged in “assault by mutual affray.” Norman sets out to explore a great mystery: why seemingly quiet, contained people lose control. David and Maggie's story seemed straightforward enough; they met in a hotel lobby in London. For David, the simple fact was love at first sight. For Maggie, the attraction was similarly sudden and unprecedented in intensity. Their love affair, \"A fugue state of amorous devotion,\" turned into a whirlwind romance and marriage. So what could possibly enrage David enough that he would strike at the father of his new bride? Why would William, a gentle man who looks after an estate -- and its flock of swans -- in Nova Scotia, be so angry at the man who has just married his beloved only child, Maggie? And what would lead Maggie to believe that David has been unfaithful to her? In his signature style -- haunting and evocative -- Norman lays bare the inventive stupidities people are capable of when wounded and confused.At its core, Devotion is an elegantly constructed, never sentimental examination of love: romantic love (and its flip side, hate), filial love at its most tender, and, of course, love for the vast open spaces of Nova Scotia.",
  "genres": [
    "Fiction",
    "Canada",
    "Love",
    "Literary Fiction"
  ],
  "author": "Howard Norman",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/62515.Devotion"
}