{
  "title": "Great Sky Woman",
  "description": "Thirty thousand years ago, in the heart of the African continent and in the shadow of the largest freestanding mountain in the world, lived the Ibandi. For countless generations they nurtured their ancient tradition, and met survival’s daily struggle with quiet faith in their gods. But when brutal intruders arrived from the south, a few brave souls dared the ultimate quest–to climb the Great Mountain, seeking answers and a way into the future.In this breathtaking blend of imagination, anthropology, and sheer storytelling magic, Steven Barnes takes us to the foot of Mount Kilimanjaro and into the realm of our own ancestors, who lived, hunted, celebrated, and died side by side with roaming herds of wild animals and great golden clouds of migrating butterflies. A people whose skin was the color and smell of the earth itself, the Ibandi formed a hierarchy based on strength of limb and spirit. In this extraordinary novel, we follow the adventures of two of the Ibandi’s chosen T’Cori, an abandoned girl raised by the powerful and mysterious medicine woman Stillshadow, and Frog Hopping, a boy possessing a gift that is also a curse.Though the live in different encampments, Frog and T’Cori are linked through the revered and powerful Stillshadow, who has sensed in them a destiny apart from others’.Through the years, and on their separate life paths, T’Cori’s and Frog’s fates entwine as an inevitable disaster approaches from the south–from the very god they worship. For as long as there have been mountain, sky, and savannah, there has been a home for the Ibandi. Now, in the face of an enemy beyond anything spoken of even in legend, they must ask their god Do we remain or do we depart?Great Sky Woman not only brings to life the world of prehistoric man but also shines a brilliant light on humanity itself. For here is a story of rivalries and alliances, of human fear and desire, of faith and betrayal . . . and, above all, a story of how primitive man, without words or machines, set in motion civilization’s long, winding journey to the present.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Prehistoric",
    "Africa",
    "Prehistory",
    "Science Fiction",
    "Historical"
  ],
  "author": "Steven Barnes",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/625845.Great_Sky_Woman"
}