{
  "title": "Black Folk: The Roots of the Black Working Class",
  "description": "An award-winning historian illuminates the adversities and joys of the Black working class in America through a stunning narrative centered on her forebears.There have been countless books, articles, and televised reports in recent years about the almost mythic “white working class,” a tide of commentary that has obscured the labor, and even the very existence, of entire groups of working people, including everyday Black workers. In this brilliant corrective, Black Folk , acclaimed historian Blair LM Kelley restores the Black working class to the center of the American story.Spanning 200 years―from one of Kelley’s earliest known ancestors, an enslaved blacksmith, to the essential workers of the Covid-19 pandemic― Black Folk highlights the lives of the laundresses, Pullman porters, domestic maids, and postal workers who established the Black working class as a force in the late 19th and early 20th centuries. Taking jobs white people didn’t want and confined to segregated neighborhoods, Black workers found community in intimate spaces, from stoops on city streets to the backyards of washerwomen, where multiple generations labored from dawn to dusk, talking and laughing in a space free of white supervision and largely beyond white knowledge.As millions of Black people left the violence of the American South for the promise of a better life in the North and West, these networks of resistance and joy sustained early arrivals and newcomers alike and laid the groundwork for organizing for better jobs, better pay, and equal rights. As her narrative moves from Georgia to Philadelphia, Florida to Chicago, Texas to Oakland, Kelley treats Black workers not just as laborers, or members of a class, or activists, but as people whose daily experiences mattered―to themselves, to their communities, and to a nation that denied that basic fact.Through affecting portraits of her great-grandfather, a sharecropper named Solicitor, and her grandmother, Brunell, who worked for more than a decade as a domestic maid, Kelley captures, in intimate detail, how generation after generation of labor was required to improve, and at times maintain, her family’s status. Yet her family, like so many others, was always animated by a vision of a better future. The church yards, factory floors, railcars, and postal sorting facilities where Black people worked were sites of possibility, and, as Kelley suggests, Amazon package processing centers, supermarkets, and nursing homes. can be the same today. With the resurgence of labor activism in our own time, Black Folk presents a stirring history of our possible future. 30 illustrations",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "Labor",
    "Sociology",
    "Audiobook"
  ],
  "author": "Blair  L.M. Kelley",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/62585957-black-folk"
}