{
  "title": "Situationship",
  "description": "In a witty modern twist on How Stella Got Her Groove Back, New York Times bestselling author Marina Adair blends the fun of falling in love with a thoughtful and heartfelt exploration of modern family dynamics when two former teenage crushes reunite unexpectedly for a second chance at love. Complicated and steamy, Situationship shines a light on romantic and family relationships that don’t easily fit into any box.The sand and surf of California’s coastal Pacific Cove is the charming backdrop for New York Times bestselling author Marina Adair’s fun and sexy novel about getting back on track after life makes a sharp left turn—and finding you’ve arrived in just the right place to get back your mojo . . .Teagan Bianchi has survived a road trip with rambunctious toddler twins and a large mutt named Garbage Disposal. She clings to a tattered scrap of hope that moving into her late grandmother’s house is the best way to repair her failing business—and the sad shreds of her life—after the man who promised her forever lost everything they had. But she’s barely arrived when she finds herself face to face with her teenage crush, now an irresistible man—who still happens to live next door . . .Veterinarian Colin West is closer to being an empty nester than a soccer dad. His marriage lasted only long enough to give him his beloved daughter, and he has no regrets. But as she readies for college, Colin contemplates his own future—which is, of course, exactly when his past shows up, as gorgeous as ever, and twice as fascinating. But Teagan torpedoed his plans once before. Is he crazy to consider letting her into his life again? Is Teagan ready to admit what she’s really afraid of? Could this unexpected “situationship” be forever?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Chick Lit",
    "Second Chance",
    "Adult",
    "Second Chance Romance"
  ],
  "author": "Marina Adair",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/62572857-situationship"
}