{
  "title": "Crystal Moon",
  "description": "Hello Reader......or should I say, \"lost soul.\" I truly hate to be the bearer of bad news, but since there's no tender way to deliver the blow, I'm just going to come right out and say it. You see, you and I, well...we're dead, or if it makes it easier to hear, we have perished. And, if a softer delivery is still necessary...we have passed on.We can no longer call Earth our home. Our souls, whether good or evil, now exist inside the Book, and we're waiting for our chance to be reborn, possibly on one of many new worlds.Yes, I know - oh, believe me, I know - none of this makes any sense and you're probably asking yourself, \"Phillip, what on earth are you talking about?\" And I would be forced to answer your question by saying...Earth just doesn't exist any longer!Just know this. I'm glad your soul was retrieved from the darkness of space and placed in here with me inside the Book. I know you're confused and have many questions, not to mention a fair amount of stress which I'm sure has suddenly surfaced because of my revelation, but it will get better, I promise. You should hang in there while I try to explain further.The Book, known as The Book of Immortality, has a second name - Gabriel. He asked me to explain some extremely important things which are for your benefit.First, there was a series of God Wars which lasted nearly 3,000 seasons. It was during this period of constant battling by these so-called \"deities\" that the entire Cosmos ceased to exist. (I say 'so-called' because I'm still not convinced they should be called gods at all.)Second, along with our beloved Earth, the places you knew as Heaven and Hell, everything you ever loved, everything you understood, and everything you cherished as your own, exploded into countless pieces of mass, most of which still wander aimlessly through space.Yeah, this news really sounds like one big pile of garesh...not to mention it's thoroughly depressing to know that your soul is stuck inside a book, but again, hang in there... many answers will be revealed as I move forward with the telling of The Crystal Moon.You see, prior to The great Destruction of Everything Known, I was an author back on Earth. The Book, after learning this, has asked me to gather the facts necessary to tell a series of stories. I get to share the knowledge I've gained from speaking with the souls residing inside Gabriel's pages, including the deities who perished, most during the God Wars. I will reveal the information acquired from questioning hundreds of fascinating creatures, as well as numerous other races, some of which are immortal, living on the new worlds. I've taken great care to understand everyone's emotions, their desires, their thoughts, and the reasons for doing the things they did, and will now share everything with you.Thus, I welcome you to: The Worlds of the Crystal Moon. Let us begin with the first of many stories - Crystal Moon, World of Grayham. I do hope you enjoy my recollections.Your friend, and fellow soul inside the Book of Immortaility, Phillip \"Big Dog\" JonesAllow me to take you back to a period just over 14,000 seasons ago...to a series of moments just before the destruction of Earth.Dr. Sam Goodrich put the cold stethoscope on the boy's chest and asked him to take two deep breaths. The child jumped and Sam realized the boy was in good general health. His flu-like symptoms could be treated with a simple over-the-counter medication, so the doctor wrote out a recommendation and handed it to the boy's mother.\"Mrs. Taylor, thanks for bringing Bobby in to see me. This should do the trick. He'll be just fine in a few days.\" Sam smiled and gave a few other words of encouragement, then shook the woman's hand before leaving the room. As he left, his smile faded and he grimaced at the thought of his",
  "genres": [
    "Fantasy",
    "Fiction"
  ],
  "author": "Phillip E. Jones",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/6256512-crystal-moon"
}