{
  "title": "Weird Florida: Your Travel Guide to Florida's Local Legends and Best Kept Secrets",
  "description": "Ah, Florida: sun, surf, sand, South Beach, and senior citizens. That's about it, right? Well, no, not exactly. Florida is also one of the best places to chart your weirdest travel destinations. And who better to chronicle this state's fabled places, roadside wonders, bizarre beasts, and downright peculiar people than Charlie Carlson, a tenth-generation Floridian. All who know Charlie can testify that he is one very strange dude and the perfect person to steer you to Florida's best-kept secrets and oddest legends.Mosquito netting in place and notepad in hand, Charlie has waddled through swamps, trekked the lesser-traveled roads, and visited the weirder destinations of our country's only peninsula state. Looking for the odd and the offbeat, he found them everywhere. He has tracked down impossible-to-believe tales that had just enough truth in them to create the same uneasiness a gator sighting would. Whether it's the Skunk Ape, the Devil's Chair of Cassadaga, or the She-Man of the Caloosahatchee River, Charlie presents it here for you, our fellow admirers of the weird.So act like a tourist and start browsing. You'll be entranced with the beer-can car, the tombstone for Pearl (\"I told you I was sick\") Roberts, the Blue Heaven Rooster Graveyard, the Devil Tree, the bowling-ball house, Catalina's ghost, the Mafia House, and Xanadu, the abandoned and neglected house of the future. Read all about the Wizard of Central Florida and Count Von Cosel and his immortal love. It's all here. It's all for you. It's all...very weird.A brand-new entry in the best-selling Weird U.S. series, Weird Florida is packed with all the info about the Sunshine State that your history teacher never taught you. So travel down our state's highways and byways with your tour guide, Mr. Charlie. It's a great adventure. And we promise: it's a journey you'll never forget.",
  "genres": [
    "Travel",
    "Nonfiction",
    "History",
    "Paranormal",
    "Reference",
    "Humor"
  ],
  "author": "Charlie Carlson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/625741.Weird_Florida"
}