{
  "title": "Ultra-Processed People: The Science Behind Food That Isn't Food",
  "description": "A manifesto to change how you eat and how you think about the human body.It’s not you, it’s the food.We have entered a new age of eating. For the first time in human history, most of our calories come from an entirely novel set of substances called Ultra-Processed Food. There’s a long, formal scientific definition, but it can be boiled down to this: if it’s wrapped in plastic and has at least one ingredient that you wouldn’t find in your kitchen, it’s UPF.These products are specifically engineered to behave as addictive substances, driving excess consumption. They are now linked to the leading cause of early death globally and the number one cause of environmental destruction. Yet almost all our staple foods are ultra-processed. UPF is our food culture and for many people it is the only available and affordable food.In this book, Chris van Tulleken, father, scientist, doctor, and award-winning BBC broadcaster, marshals the latest evidence to show how governments, scientists, and doctors have allowed transnational food companies to create a pandemic of diet-related disease. The solutions don’t lie in willpower, personal responsibility, or exercise. You’ll find no diet plan in this book―but join Chris as he undertakes a powerful self-experiment that made headlines around the world: under the supervision of colleagues at University College London he spent a month eating a diet of 80 percent UPF, typical for many children and adults in the United States. While his body became the subject of scientific scrutiny, he spoke to the world’s leading experts from academia, agriculture, and―most important―the food industry itself. But more than teaching him about the experience of the food, the diet switched off Chris’s own addiction to UPF.In a fast-paced and eye-opening narrative he explores the origins, science, and economics of UPF to reveal its catastrophic impact on our bodies and the planet. And he proposes real solutions for doctors, for policy makers, and for all of us who have to eat. A book that won’t only upend the way you shop and eat, Ultra-Processed People will open your eyes to the need for action on a global scale.",
  "genres": [
    "Nonfiction",
    "Health",
    "Science",
    "Food",
    "Audiobook",
    "Nutrition",
    "Self Help"
  ],
  "author": "Chris van Tulleken",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/62586003-ultra-processed-people"
}