{
  "title": "Science Fiction",
  "description": "ContentsThe Sentinel [A Space Odyssey] (1951) short story by Arthur C. ClarkeZero Hour (1947) short story by Ray BradburyHarrison Bergeron (1961) short story by Kurt Vonnegut, Jr.Chief (1960) short story by Henry SlesarLitterbug (1969) novelette by Tony MorphettGreen Patches (1950) short story by Isaac AsimovThe Yellow Pill (1958) short story by Rog PhillipsEnchanted Village (1950) short story by A. E. van VogtOf Missing Persons (1955) short story by Jack Finney\"—And He Built a Crooked House\" (1941) novelette by Robert A. HeinleinA Sound of Thunder (1952) short story by Ray BradburyThe Winner (1970) short story by Donald E. WestlakeSummertime on Icarus (1960) short story by Arthur C. ClarkeBy the Waters of Babylon (1937) short story by Stephen Vincent BenétHEMEAC (1968) short story by E. G. Von WaldPrisoners of Paradise (1966) short story by David ReddVictory Parade (1957) short story by Henry SlesarA Projection (1955) poem by Reed WhittemoreWe'll All Be Space-Men Before We Die (1968) poem by Mike Evans (II)Ghost Crabs (1966) poem by Ted HughesMushrooms (1969) poem by Mike Evans (II)Mushrooms (1960) poem by Sylvia PlathA.D. 2267 (1967) poem by John Frederick NimsAfterwards (1964) poem by Edward Lucie-SmithVoyage to the Moon (1964) poem by William DickeyThe Flight of Apollo (1969) poem by Stanley KunitzOrbiter 5 Shows How Earth Looks from the Moon (1969) poem by May SwensonOff Course (1967) poem by Edwin MorganI Am A (1969) poem by Lenore MarshallSpace Man (1969) poem by Babette DeutschElectronic Concert (1963) poem by Babette DeutschAnd It Will Serve Us Right (1969) essay by Isaac Asimov Europe After the Rain interior artwork by Max Ernst Sun and Forest interior artwork by Max Ernst Fool from the Depths interior artwork by Paul Klee The Melancholy and Mystery of a Street interior artwork by Giorgio de Chirico The Earth Is a Man interior artwork by Roberto Matta The Aliens interior artwork by Wolfgang Paalen A Large Painting Which Is a Landscape interior artwork by Yves Tanguy The Dead Child interior artwork by Miljenko StancicMoonshot Sonnet poem by Mary Ellen Solt Person Throwing a Stone at a Bird interior artwork by Joan Miro Eyeball of the Sun interior artwork by Bernard Childs The Sea interior artwork by Max Ernst The Castle of the Pyrenees interior artwork by René Magritte The Whole City interior artwork by Max Ernst Untitled Box No. 3 interior artwork by Lucas Samaris On the Threshold of Freedom interior artwork by René Magritte Male Figure interior artwork by Nancy Grossman Peruvian Mummy Mask interior artwork by uncredited Mechanical Head interior artwork by Raoul Hausmann Man Falling Forward interior artwork by Juan Genoves Two Dancers interior artwork by Haniwa Mama, Papa Is Wounded! interior artwork by Yves Tanguy Village Dance Mask from Ceylon interior artwork by uncredited Piége interior artwork by Herve Telemaque Head interior artwork by Rudolph Belling Butterflies interior artwork by M. C. Escher Puddle interior artwork by M. C. Escher Equivocation interior artwork by Ben Cunningham Up and Down interior artwork by M. C. Escher The Phases of the Night interior artwork by Max Ernst Photographic Evidence interior artwork by Juan Genoves",
  "genres": [
    "Science Fiction",
    "Short Stories"
  ],
  "author": "Sylvia Z. Brodkin",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/6258623-science-fiction"
}