{
  "title": "Life After",
  "description": "Best Teen Novel - Indies Today“. . . [a] gorgeously-written story of hope that will stay with you long after you finish the last page.” (Amber Smith, New York Times bestselling author of The Way I Used to Be)Someone once asked August Haiz if twins realize one of them is an accident. Deep down, August knows if anyone was an accident, it wasn’t Benny—it was her. Granted, August doesn’t mind dancing in the background, letting Benny be the star musician and center of attention. In fact, she prefers it that way.Abandoned by their mother as children, the twins have spent a decade dodging the unpredictable nature of their alcoholic father in an attempt to stay off his radar. With graduation in sight and their freedom on the horizon, August and Benny look forward to fleeing their hometown together and starting fresh at college. But a tragic accident turns August’s world upside down, swallowing her hopes of a brighter future.Guilt-ridden and struggling to cope with her new normal, August shuts out the people who love her most, and nearly ruins her most important friendship. If August wants a chance at adjusting to life after tragedy, she’ll have to process her pain, let go of the past, and leave the darkness behind.“Perfect for fans of Sarah Dessen, LIFE AFTER is a moving story of overcoming grief, loss and heartbreak. Bust out the tissues!” (Kelly deVos, author of Fat Girl on a Plane and Eat Your Heart Out)“A heartbreaking and poignant exploration of grief in the wake of tragedy, LIFE AFTER reminds us of the incredible strength of the human spirit – to experience pain and love and loss and still find the courage to start anew. Readers will cheer for August in this gorgeously-written story of hope that will stay with you long after you finish the last page.” (Amber Smith, New York Times bestselling author of The Way I Used to Be and The Last to Let Go)\"Raw and wrenching, LIFE AFTER tackles themes of trauma, grief, and resilience with compassion and care. Readers will hurt along with August as she faces life-changing loss—and root for her as she finds her way forward.\" (Kathryn Holmes, author of The Distance Between Lost and Found and How It Feels to Fly)\"LIFE AFTER is a searing coming-of-age novel that tackles loss with poignancy and grace. An immersive and deeply honest look at the staggering waking dream of grief and the power love and compassion can have to light the way through. Barker writes with an emotional potency that breathes warmth into each tender moment shared. Gus's voice shines—vibrant and vulnerable—as she navigates her new life, and finds the will to step into a self that while shaped by both loss and love is all her own.\" (Jacquie Reiko Teruya, award-winning writer)",
  "genres": [
    "Young Adult",
    "Contemporary"
  ],
  "author": "Genalea Barker",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/62610975-life-after"
}