{
  "title": "A Fade of Light",
  "description": "An intimate and moving graphic memoir by cartoonist Nate Fakes, dedicated to his stepdad Ron, a larger-than-life personality who gradually becomes affected by a rare form of dementia.Editor's Picks, Honorable Mention at Publishers Weekly's US Book Show\"A Fade of Light is a rare story that is both deeply heartbreaking and heartwarming. Nate Fakes is an observant writer and artist, with a good memory and an eye for small, revealing details. In his clear cartooning style, Fakes shows he and his family navigating a rare disease imperfectly but as well as they can. He captures the confusion and frustration of knowing something's wrong but not what, of desperately wanting to fix something that can't be fixed.\"—Brian Fies, Eisner Award–winning author of Mom's Cancer\"A Fade of Light is a graphic memoir centered on [Nate] Fakes’s stepdad, Ron, who came into Nate’s life in the 1990s and brought light into their family—until progressive dementia caused Ron’s own light to begin to fade.\"—Publishers Weekly, Fall 2022 Announcements: Comics & Graphic NovelsThe first time Nate met his future stepdad in the summer of 1994, he thought Ron was nice, goofy, and kind, the type of guy who wasn't afraid to be himself. Ron liked to honk at other Jeeps while driving his own, bang on the drums without abandon, and order practically the whole menu at drive-thrus. It was alternatively embarrassing, annoying, and funny, though one thing was for sure: life with Ron was never dull.But as years passed, Nate noticed Ron's behavior becoming erratic and strange. He forgot obvious things and seemed more stubborn and irritable than before. Finally Ron received a diagnosis: he has frontotemporal dementia, a progressive disorder that affects about 10 percent of all dementia cases. There is no cure.Stylized in black-and-white drawings, A Fade of Light is a graphic memoir capturing the fullness of a life well lived—the ups and downs, the laughter and tears, the joys and heartaches, and the treasured moments that will always be cherished, if not remembered.",
  "genres": [
    "Graphic Novels",
    "Memoir",
    "Nonfiction",
    "Comics",
    "Mental Health",
    "Medical",
    "Adult"
  ],
  "author": "Nate Fakes",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/62600197-a-fade-of-light"
}