{
  "title": "Talonsister",
  "description": "Uncover a magical past that refuses to be forgotten in a world of mythical creatures and ruthless religion in this brand-new duology from the multi-award winning author of The Ninth Rain, perfect for fans of John Gwynne and Andrea Stewart.Leven has no memory of her life before she was a soldier. The process of turning her into a Herald – a magical killing machine – was traumatic enough that it wiped her mind clean. Now, with the war won and the Imperium satisfied, she finds herself unemployed and facing a bleak future. Her fellow Heralds are disappearing, and her own mind seems to be coming apart at the seams. Strange visions, memories she shouldn’t have, are resurfacing, and none of them make any sense. They show her Brittletain, the ancient and mysterious island that the Imperium was never able to tame. Leven resolves to go to this place of magic and warring queens, with the hope of finding who she really is.Envoy Kaeto has done a number of important little jobs for the Imperium, most of them nasty, all of them in the shadows. His newest assignment is to escort the bone-crafter Gynid Tyleigh as she travels across the Imperium – as the woman responsible for creating the Heralds, his employers owe her a great deal. But Tyleigh’s ambition alarms even Kaeto, and her conviction that she has found a new source of Titan bones, buried deep in the earth, could lead to another, even bloodier war.Ynis was raised by the griffins, and has never seen another human face. She lives wild, as they do, eating her meat raw and flying with her talon-sister, T’rook. The griffins fiercely protect their isolation – the piles of skulls that litter the mountains of Brittletain are testament to that – but the magic they guard will always make them a target for the greed of men. By choosing not to kill Ynis when she was just a baby, the griffins may have doomed themselves – because the girl’s past is coming for her, and it carries a lethal blade.",
  "genres": [
    "Fantasy",
    "High Fantasy",
    "Magic",
    "Audiobook",
    "Epic Fantasy",
    "Adult",
    "Fiction"
  ],
  "author": "Jen Williams",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/62606460-talonsister"
}