{
  "title": "Can't Help Falling in Love with an Alien",
  "description": "RiverWorking for the Alliance is a sci-fi nerd’s dream–aka mine–come true. I’ve even won the heart of my grumpy-sexy alien boyfriend. Nothing can bring me down, baby. I’m walking on freaking sunshine! Except now one of Kai’s douchey AF exes decides to turn up like a bad case of crabs. I don’t trust him one bit. But I’ve got even bigger problems to worry about. Like helping some awesome aliens in trouble, and maybe moving in with Kai, who’s totally going to propose any day now—right? Oh, and my shady relatives might be hiring an assassin to take me out. So, you know, a day in the life of River Sullivan. I’m sure everything’s going to be fine. Won’t it?KaiWe’ve finally got a new lead on the drug dealer targeting extraterrestrials on Earth. But the more we unravel in this investigation, the less I like it. Outside of work though, things are going amazingly well with my adorable mate–dear galactic gods, how did that happen? But with an ex back in my life and wanting to be friends, and the threat of a potential assassin looming, things are getting a little complicated. I love River with both my hearts—and all five tentacles—but even I’m worried I might not be able to protect him from the dangers ahead. Also, I need to figure out how the heck I’m going to propose to him. River deserves something “epic,” and I don’t want to let him down. Am I going to be able to deliver?Can’t Help Falling in Love with an Alien (Tentacular Tales #2) is a (116,000 words) M/M sci-fi rom com and the second book in the series. It should be read in chronological order. This installment features a pajama party date that will go down in infamy, inappropriate team t-shirts, a half-baked love poem, more Captain Starblade and Lord Vardox, drunken shenanigans courtesy of spaceship moonshine, unexpected mating instincts, plenty of new aliens with problems for River to solve, and tentacles galore. And possibly an epic proposal? This book has an HFN ending and no cheating. Never fear—there is a guaranteed HEA by the end of the series!",
  "genres": [
    "M M Romance",
    "Aliens",
    "Science Fiction",
    "Romance",
    "Audiobook",
    "Fantasy",
    "Humor"
  ],
  "author": "Chloe  Archer",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/62610309-can-t-help-falling-in-love-with-an-alien"
}