{
  "title": "Miss Marple All 20 Stories",
  "description": "This is a beautiful gift pack featuring one of Agatha Christie's most famous creations: Miss Marple. It contains \"The Thirteen Problems\" and \"Miss Marple's Final Cases\" which gather together all 20 Miss Marple short stories.Described by her friend Dolly Bantry as 'the typical old maid of fiction', Miss Marple has lived almost her entire life in the sleepy hamlet of St Mary Mead. Yet, by observing village life she has gained an unparalleled insight into human nature - and used it to devastating effect. As her friend Sir Henry Clithering, the ex-Commissioner of Scotland Yard has been heard to say: 'She's just the finest detective God ever made.' - and many Agatha Christie fans would agree.Appearing for the first time in \"The Murder at The Vicarage\" (1930) her crime-fighting career spanned over forty years when she solved her final case in 1977 in \"Sleeping Murder\". With every tale flawlessly plotted by the Queen of Crime herself, these short stories provide a feast for hardened Agatha Christie addicts as well as those who have grown to love the detective through her many film and television appearances.The stories are: 1. The Tuesday Night Club; 2. The Idol House of Astarte; 3. Ingots of Gold; 4. The Bloodstained Pavement; 5. Motive v. Opportunity; 6. The Thumbmark of St Peter; 7. The Blue Geranium; 8. The Companion; 9. The Four Suspects; 10. A Christmas Tragedy; 11. The Herb of Death; 12. The Affair at the Bungalow; 13. Death by Drowning; 14. Miss Marple Tells a Story; 15. Strange Jest; 16. The Case of the Perfect Maid; 17. The Case of the Caretaker; 18. Tape-Measure Murder; 19. Greenshaw's Folly; and 20. Sanctuary.Librarian's note: this entry is for \"Miss Marple All 20 Stories\". Each of the individual stories can be found elsewhere on Goodreads.",
  "genres": [],
  "author": "Agatha Christie",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/6260445-miss-marple-all-20-stories"
}