{
  "title": "Unsettled Visions: Contemporary Asian American Artists and the Social Imaginary",
  "description": "In Unsettled Visions , the activist, curator, and scholar Margo Machida presents a pioneering, in-depth exploration of contemporary Asian American visual art. Machida focuses on works produced during the watershed 1990s, when surging Asian immigration had significantly altered the demographic, cultural, and political contours of Asian America, and a renaissance in Asian American art and visual culture was well underway. Machida conducted extensive interviews with ten artists working during this transformative women and men of Chinese, Filipino, Indian, Vietnamese, Korean, and Japanese descent, most of whom migrated to the United States. In dialogue with the artists, Machida illuminates and contextualizes the origins of and intent behind bodies of their work. Unsettled Visions is an engrossing look at a vital art scene and a subtle account of the multiple, shifting meanings of “Asianness” in Asian American art. Analyses of the work of individual artists are grouped around three major themes that Asian American artists engaged with during the 1990 representations of the Other; social memory and trauma; and migration, diaspora, and sense of place. Machida considers the work of the photographers Pipo Nguyen-duy and Hanh Thi Pham, the printmaker and sculptor Zarina Hashmi, and installations by the artists Tomie Arai, Ming Fay, and Yong Soon Min. She examines the work of Marlon Fuentes, whose films and photographs play with the stereotyping conventions of visual anthropology, and prints in which Allan deSouza addresses the persistence of Orientalism in American popular culture. Machida reflects on Kristine Aono’s museum installations embodying the multigenerational effects of the internment of Japanese Americans during World War II and on Y. David Chung’s representations of urban spaces transformed by migration in works ranging from large-scale charcoal drawings to multimedia installations and an “electronic rap opera.”",
  "genres": [
    "Art",
    "Nonfiction"
  ],
  "author": "Margo Machida",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/6262539-unsettled-visions"
}