{
  "title": "Naughty Christmas Wishes : 12 days of Christmas",
  "description": "Have you ever wondered what Christmas legends would be like as every day people? Well, you're in luck because here's my take on that very idea.* The Naughty Christmas Wishes Series ~ 12 Days of Christmas *My name's Joyful Jolly, but I'm definitely not feeling any joy this holiday season.My fiance was cheating on me and just like any bad romance, I caught the loser red handed right before Christmas.So, what's an uptight professional woman to do?Steal the ride waiting for his mistress and get totally wasted, duh.Sounds harmless, right?WRONG!After a night of drinking, reading and men at the Reindeer bar and cafe. My wise driver Rudolph aka Ruby suggested we make a Christmas list for Santa.Of course, we decided to write him a very detailed list with some naughty Christmas wishes. We found a mailbox and sent the letter off laughing at her ridiculous idea. I got home safe thinking that night would be a funny memory I wouldn't remember.Imagine my surprise when the next morning Saint Nicholas shows up telling me I have 12 days of Christmas wishes. I did what any woman would do...I kicked him out of my house then went back to bed.But that wasn't the last time I saw Santa or his friends: Frost the Iceman, the mischievous twin Reindeer sheriffs, or the friendly shy Principal Mr. Elf...This is a fun Holiday standalone from The Naughty Christmas Wishes Series! A contemporary (no shifters) why choose romance with an unexpected twist!Please meet the men of North Pole in the California Mountains by Big Bear.* Blitz (Blitzen) and Don (Donner) Reindeer the twin sheriffs. They smell like peppermint & pine trees.* Jack Frost - aka the \"Iceman.\" He's an ex hockey player that's now a kid's coach, and the snowplow man. Of course, he smells like fresh winter snow.* Bud (Hermey) Elf. He's the local high school principal and co-founder of the small group home in town. He smells like cinnamon and he's a switch.* Saint Nicholas. This man is the Mayor of North Pole and Postmaster. He smells like yummy chocolate chip cookies.* Then there's the flippin' EX - aka \"Fruitcake.\" That dude is stale, gross and no one likes him.* Our FMC is the newly single Joy Jolly. Her future is as confusing as her past.Since this is a Christmas story I throw in a lot of cheesy Christmas references. For example instead of holy sh!t, it's holy chestnuts, or Christmas cookies!I'm really into writing mystery. You'll find another unique twist in this story too!",
  "genres": [
    "Christmas",
    "Holiday"
  ],
  "author": "Rainy Flower",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/62618644-naughty-christmas-wishes"
}