{
  "title": "A Long Time Coming",
  "description": "A witty take on a romantic comedy classic, My Best Friend's Wedding. Steamy, laugh-out-loud, and full of charm, these two best friends heat up the pages while proving true love might be right in front of you.<Have you ever heard of a man-in-waiting?Yeah, neither has my best friend's soon-to-be monster-in-law. Ooo, sorry, I meant mother-in-law. Nor has she heard of the term, what the bride wants, the bride gets.With wedding planning underway and a short timeline, my best friend, Lia, has recruited me to help her battle the snarly beast that is Mrs. Beaver. Not scared at all, I accept the challenge as her man-in-waiting--aka, man of honor--and take matters into my own hands.The only problem is, with every second we draw closer to the wedding, I'm starting to see my best girl in a different light.She's always been beautiful to me, but now . . . I find myself staring a touch too long. My hand lingering for one more minute. And when she's upset? Allowing her to sleep in my bed.And before I know what's happening, it hits me like a ton of bricks. I'm in love with my best friend. Not just in love, but infatuated.No one compares to her and nothing seems to distract me from that realization.Not the girl I try to date while I help plan Lia's wedding.Not her angry fiancé who thinks I'm growing too close.And not the looming deadline of her nuptials.Which means, there's only one thing left for me to do. Prove to Lia I'm the one she should be with instead. But with the pressure of her engagement, the stress from her soon-to-be mother-in-law, and the breath-stealing nerves running through me, I'm finding it a lot harder to claim the girl than I would like to admit.Say a little prayer for me . . .",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Contemporary Romance",
    "Contemporary",
    "Slow Burn",
    "Billionaire Romance",
    "Audiobook"
  ],
  "author": "Meghan Quinn",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/62626163-a-long-time-coming"
}