{
  "title": "Platone, c'ho l'ansia",
  "description": "Questo libro è per chi si sente fuori posto o, come si dice in greco, atopos. Pare che uno dei primi a essere definito così sia stato Socrate, giudicato troppo strano, a volte anche fastidioso. Dopo di lui, tutti i filosofi vennero considerati atopoi. Le loro vite erano tormentate dalla ricerca di qualcosa che continuava a sfuggire e osservavano il mondo dall’esterno, senza farne mai davvero parte.Chi si sente fuori posto prova ogni giorno il doloroso desiderio di trovare un luogo da chiamare casa e vive la vita col fiato sospeso, sperando di riuscire un giorno a respirare. Viaggia per trovare il suo posto nel mondo, ma la strada sembra non avere mai fine e, nei momenti bui, si chiede se davvero esista un luogo in cui potrà essere se stesso. Si sente diverso dagli altri ma, nel contempo, teme di non avere niente di speciale. A volte il peso che gli opprime il petto può essere tanto forte da fargli credere che valga la pena di rinunciare a una parte di sé pur di sentirsi a proprio agio con gli altri, a volte invece fa di tutto per rimanere fedele a se stesso e si arrabbia con un mondo che sembra essere piatto, banale e crudele. È una guerra difficile da vincere, se si combatte da soli.In Platone c’ho l’ansia Benedetta Santini ci svela con chiarezza e semplicità i pensieri complessi e le vite complicate di otto grandi filosofi, in un percorso di crescita psicologica che aiuta il lettore a trovare esempi e strumenti per superare le difficoltà che a volte ingabbiano le nostre vite: sapersi perdonare, trovare la felicità, superare l’ansia del giudizio altrui, imparare a fare una scelta...Da Platone a Nietzsche, da Socrate a Schopenhauer, otto storie di atopoi che dovettero lottare contro uomini potenti, contro delusioni, abbandoni e anche contro se stessi. Il loro modo di pensare atipico, causa della emarginazione, fu proprio la loro salvezza. Sono filosofi, ma soprattutto persone che hanno trovato un posto nel mondo e, oggi, possono aiutarci a trovare il nostro.",
  "genres": [
    "Philosophy",
    "Nonfiction"
  ],
  "author": "Benedetta Santini",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/62616987-platone-c-ho-l-ansia"
}