{
  "title": "Ghost a la Mode",
  "description": "A new series debut from Odelia Grey mystery author Sue Ann Jaffarian! Granny was famous for her award-winning apple pies-and notorious for murdering her husband Jacob at their homestead in Julian, California. The only trouble is, Granny was framed, then murdered. For more than one hundred years, Granny's spirit has been searching for someone to help her see that justice is served--and she hits pay dirt when she pops in to a seance attended by her great-great-great-granddaughter, modern-day divorced mom Emma Whitecastle. Together, Emma and Granny Apples solve mysteries of the past--starting with Granny's own unjust murder rap in the final days of the California Gold Rush. Along with a sprinkling of history, this spirited new mystery series features the amateur sleuth team of Emma Whitecastle and the spirit of her pie-baking great-great-great-grandmother, Granny Apples. Praise:  \"A delectable first in a new paranormal cozy series from Sue Ann Jaffarian.\"--Publishers Weekly \"A fun new series. Ghostly puzzles are one of the trendy new themes in cozy mysteries, and this is a good one.\"--Booklist \"Jaffarian has done a nifty job of incorporating Julian's history into her tale of unresolved ghosts, uncanny psychics, unsolved murders and unhappy divorcees, while handily introducing some characters, alive and dead, to carry the series forward.\"--North Country Times \"Emma handles her 'gift' of seeing the dead with aplomb, and class. I'll look forward to seeing where the sequel will take Emma and Granny.\"--Deadly Pleasures \"A charming tale, as appealing as apple pie. I predict a long life (and afterlife) for Sue Ann's latest series.\"--Harley Jane Kozak, Agatha, Anthony and Macavity Award-winning author of Dating Dead Men\n\n \"Take colorful characters in a charming setting, mix in a dash of romance, add a pinch of the paranormal, and serve it up like one of Granny's famous pies. I guarantee you'll be back for seconds.\"--Deborah Sharp, author of Mama Rides Shotgun",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Paranormal",
    "Ghosts",
    "Cozy",
    "Fiction",
    "Fantasy"
  ],
  "author": "Sue Ann Jaffarian",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/6262397-ghost-a-la-mode"
}