{
  "title": "The Rios Omnibus",
  "description": "From seven-time Lambda Literary Award-winning author Michael Nava comes this unforgettable duet of original Henry Rios mysteries—The Little Death and Goldenboy. These two top-notch legal thrillers, which have been out of print for years, are filled with the author’s signature storytelling genius.\nThe Little Death\nIn the novel that launched the acclaimed Henry Rios Mystery Series, a lawyer doggedly pursues a murder investigation into the lion’s den of San Francisco’s moneyed elite.Henry Rios meets Hugh Paris when Paris is arrested for drug possession and being high on PCP. A burnt-out public defender battling alcoholism, Rios has reached a crossroads in his life. While interviewing Paris in jail, Rios goes through the motions but notices that Paris is far more polished and well-off than the usual drug suspects. Paris is mysteriously bailed out—but a few weeks later, he turns up on Rios’s doorstep. Skittish and paranoid, he admits to using heroin and says he’s afraid that his wealthy grandfather wants to murder him.Rios tries to help Paris get clean, but when Paris is found dead of an apparent heroin overdose, Rios is the only one who considers foul play. Determined to find Paris’s killer, Rios knocks on San Francisco’s most gilded doors, where he discovers a family tainted by jealousy, greed, and hate. They’ve been warped by a fortune someone’s willing to kill—and kill again—to possess.At once an atmospheric noir mystery and a scathing indictment of a legal system caught in the maws of escalating corruption, The Little Death chronicles one man’s struggle to achieve true justice for all.\nGoldenboy\nHenry Rios may have something few defense attorneys ever a truly innocent client.It’s a cause Henry Rios can’t defending a young gay man on trial for killing the coworker who threatened to out him. Jim Pears is charged with first-degree murder; Pears says he’s innocent, but the evidence is damning. Pears was found covered in the victim’s blood and with the murder weapon in his hand. But nothing about the People v. Jim Pears is what it seems.Rios is asked to join the case because he knows first-hand the pressures and threats of being gay in 1980s California. During one of the most complex trials of his career, Rios meets and falls in love with Josh Mandel, the prosecutor’s star witness. For this defense attorney, fighting for justice has never been more personal. And the stakes are no less than life and death.",
  "genres": [],
  "author": "Michael Nava",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/62612352-the-rios-omnibus"
}