{
  "title": "Spellbound 2011",
  "description": "Spellbound at Midnight by Isabelle Kane and Audrey TremaineIn the sultry Big Easy, Viole Godin is hired to restore Magnolia Place, an antebellum mansion which is crumbling under a mysterious curse. Marie Verret and her dangerously attractive grandson, Lucien, believe Viole is the key to ending the curse one magical Halloween night.Room 1309.5 by John M. MecomInspired by the works of Poe and Stephen King, Room 1309.5 is a story of revenge and despair. It is the author’s first story to be published and received honorable mention in the Fifth Annual Writer’s Digest Popular Fiction Awards.Mansion of Nightmares by Walt TriznaA mysterious mansion, long abandoned, harbors a past that claims those who enter. Then one day, by a stroke of luck, an intruder survives and uncovers its secret.Uncle Vernon by Jenny TwistThere’s something very peculiar about Uncle Vernon. Nobody knows what he does in the cellar. But he’s quite harmless, really. Isn’t he?Half Seen, Half Hidden by John SteinerNine dead. One missing. No suspects and no leads. What happened in the cabin outside Wilson Wyoming? Where and who is Mason Oliver? Deep within ourselves rests a greater mystery. Half Seen, Half Hidden traces the last three days of Mason Oliver and nine hitchhikers. Offering them shelter, Mason takes them to a secluded cabin. There they all sense the others aren’t quite the strangers they seemed, and that they hold something extraordinary in common.Ghost Taxi by Joanna ForemanA man drowns heading for freedom in America, but his ghost is trapped. Washed up on the beach, the ghost is an illegal alien, not allowed to cross the street into Miami. A homeless man and a vacationing tourist search for his wife so the ghost can possess her.Telltale Signs by Tori L RidgewoodDon't stay in the Dark Lake Museum after sunset! But Kate Elliot has a deadline to meet. Working overtime, she realizes she's not alone in the creepy old mansion...The Origin of Fear by Tara Fox HallFour college friends mount an expedition to Latham’s Landing—an abandoned island estate infamous for mysterious deaths—to gather pictures and inspiration for a thesis on the origin of fear.",
  "genres": [
    "Paranormal",
    "Romance"
  ],
  "author": "Isabelle Kane",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/12924196-spellbound-2011"
}