{
  "title": "The Law of Peoples with The Idea of Public Reason Revisited",
  "description": "This book consists of two parts: “The Law of Peoples,” a major reworking of a much shorter article by the same name published in 1993, and the essay “The Idea of Public Reason Revisited,” first published in 1997. Taken together, they are the culmination of more than fifty years of reflection on liberalism and on some of the most pressing problems of our times by John Rawls.“The Law of Peoples” extends the idea of a social contract to the Society of Peoples and lays out the general principles that can and should be accepted by both liberal and non-liberal societies as the standard for regulating their behavior toward one another. In particular, it draws a crucial distinction between basic human rights and the rights of each citizen of a liberal constitutional democracy. It explores the terms under which such a society may appropriately wage war against an “outlaw society” and discusses the moral grounds for rendering assistance to non-liberal societies burdened by unfavorable political and economic conditions.“The Idea of Public Reason Revisited” explains why the constraints of public reason, a concept first discussed in Political Liberalism (1993), are ones that holders of both religious and non-religious comprehensive views can reasonably endorse. It is Rawls’s most detailed account of how a modern constitutional democracy, based on a liberal political conception, could and would be viewed as legitimate by reasonable citizens who on religious, philosophical, or moral grounds do not themselves accept a liberal comprehensive doctrine―such as that of Kant, or Mill, or Rawls’s own “Justice as Fairness,” presented in A Theory of Justice (1971).",
  "genres": [
    "Philosophy",
    "Politics",
    "Nonfiction",
    "Law",
    "International Relations",
    "School",
    "Economics"
  ],
  "author": "John Rawls",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/129242.The_Law_of_Peoples_with_The_Idea_of_Public_Reason_Revisited"
}