{
  "title": "The Aria of Steel Trilogy",
  "description": "A CANTICLE OF TWO SOULSA CANTICLE FOR THE FALLENA CANTICLE OF WARBound together for the first time in a single volume, enjoy the complete ARIA OF STEEL trilogy, a grim fantasy tale about a cursed blade, magical warchildren, and what it means to be human.---Book I: A Canticle of Two SoulsA magic sword forged of a demon. A broken boy seeking revenge.Raziel watched the Rhotian Empire slaughter his family. When a sentient sword promises him the head of the emperor, Raziel carves a bloody path in an epic journey across a land filled with banshees and mercenaries in pursuit of his revenge.But forced to travel with a strange young woman with a dark past, will Raziel even reach his destination?Alicia has plans of her own. Gifted with a terrible magic that can bend others to her will, she also has revenge on her mind and Raziel in her sights. Can two enemies put aside their differences to seek a higher goal, or will mistrust and inner-demons condemn their fates? Magic is a dangerous thing. So is hope.The Aria of Steel Trilogy is a heavy-metal power ballad of clashing blades, blood-soaked betrayal, and sweet revenge. Will you walk away or join the fight?---Book II: A Canticle for the FallenHow far would you go to change the past?Raziel faces tough decisions in this blood-drenched sequel. After four years in exile, Raziel is forced back to his homeland.The return of old friends and new enemies adds to his troubles. Once thought only the stuff of legend and nightmare, the rise of the hated ‘warchildren’ and their dark magic forces Raziel and his companions to live as fugitives in their own land.They must face their mortal enemies and inner demons or succumb to the darkness. But when a mysterious woman offers Raziel a chance to change the past, will fighting be enough?---Book III: A Canticle of WarWhen the world is threatened with total destruction, can warchildren unite to save it?In this epic conclusion, all bets are off as Raziel and his rag-tag crew must finally come together against the rising dark power. If death doesn’t find them first.The city of Archehan lies in ruins, banshees circle the crumbling towers. Famine and violence spread across the fallen kingdom. An empire marches its armies to war. Ancient magics are stirring, woken by Raziel’s choices.With the fate of the world in their hands, will Raziel and his companions find the way forward through the darkness, or will they be the architects of their own doom?",
  "genres": [],
  "author": "Steven Raaymakers",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/62613664-the-aria-of-steel-trilogy"
}