{
  "title": "Romantic Comedy",
  "description": "A comedy writer thinks she’s sworn off love, until a dreamily handsome pop star flips the script on all her assumptions. Romantic Comedy is a hilarious, observant and deeply tender novel from New York Times–bestselling author Curtis Sittenfeld. Sally Milz is a sketch writer for \"The Night Owls,\" the late-night live comedy show that airs each Saturday. With a couple of heartbreaks under her belt, she’s long abandoned the search for love, settling instead for the occasional hook-up, career success, and a close relationship with her stepfather to round out a satisfying life. But when Sally’s friend and fellow writer Danny Horst begins dating Annabel, a glamorous actor who guest-hosted the show, he joins the not-so-exclusive group of talented but average-looking and even dorky men at the show—and in society at large—who’ve gotten romantically involved with incredibly beautiful and accomplished women. Sally channels her annoyance into a sketch called the \"Danny Horst Rule,\" poking fun at this phenomenon while underscoring how unlikely it is that the reverse would ever happen for a woman. Enter Noah Brewster, a pop music sensation with a reputation for dating models, who signed on as both host and musical guest for this week’s show. Dazzled by his charms, Sally hits it off with Noah instantly, and as they collaborate on one sketch after another, she begins to wonder whether there might actually be sparks flying. But this isn’t a romantic comedy; it’s real life. And in real life, someone like him would never date someone like her...right? With her keen observations and trademark ability to bring complex women to life on the page, Sittenfeld explores the neurosis-inducing and heart-fluttering wonder of love, while slyly dissecting the social rituals of romance and gender relations in the modern age.",
  "genres": [
    "Romance",
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Book Club",
    "Chick Lit",
    "Adult"
  ],
  "author": "Curtis Sittenfeld",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/62628727-romantic-comedy"
}