{
  "title": "Halfway to Heaven: My White-knuckled--and Knuckleheaded--Quest for the Rocky Mountain High",
  "description": "Fat, forty-four, father of three sons, and facing a vasectomy, Mark Obmascik would never have guessed that his next move would be up a 14,000-foot mountain. But when his twelve-year-old son gets bitten by the climbing bug at summer camp, Obmascik can't resist the opportunity for some high-altitude father-son bonding by hiking a peak together. After their first joint climb, addled by the thin air, Obmascik decides to keep his head in the clouds and try scaling all 54 of Colorado's 14,000-foot mountains, known as the Fourteeners -- and to do them in less than one year .The result is Halfway to Heaven , Pulitzer Prize-winning journalist Obmascik's rollicking, witty, sometimes harrowing, often poignant chronicle of an outrageous midlife adventure that is no walk in the park, although sometimes it's A Walk in the Woods -- but with more sweat and less oxygen. Half a million people try climbing a Colorado Fourteener every year, but only twelve hundred have reported summiting them all. Can an overweight, stay-at-home dad become No. 1,201?With his ebullient personality and sparkling prose, Obmascik brings us inside the quirky, colorful subculture of mountaineering obsessives who summit these mountains year after year. Honoring his concerned wife's orders not to climb alone, Obmascik drags old friends up the slopes, some of them lifelong flatlanders tasting thin air for the first time, and lures seasoned Rockies junkies into taking on a huffing, puffing newbie by bribing them with free beer, lunches, and car washes. Among the new friends he makes are an ex-drag racer trying to perform a headstand on every summit, the lead oboe player in a Hebrew salsa band, and a climber with the counterproductive pre-climb ritual of gulping down four beers and a burrito. Along the way, Obmascik experiences the raw, rowdy, and rarely seen intimacy of male friendship, braced by the double intoxicants of adrenaline and altitude.Though danger is always present -- the Colorado Fourteeners have killed more climbers than Mount Everest -- Mark knows his aging scalp can't afford the hair-raising adventures of Jon Krakauer's Into Thin Air , and his quest becomes a story of family, friendship, and fraternity. In Obmascik's summer of climbing, he loses fifteen pounds, finds a few dozen man-dates, and gains respect for the history of these storied mountains (home to cannibalism, gold rushes, shoot-outs, and one of the nation's most famed religious shrines). As much about midlife and male bonding as it is about mountains, Halfway to Heaven tells how weekend warriors can survive them all as they reach for those most distant things -- the summits of mountains and a teenage son. And as one man exceeds the physical achievements of his youth, he discovers that age -- like summit height -- is just a number.",
  "genres": [
    "Nonfiction",
    "Adventure",
    "Memoir",
    "Mountaineering",
    "Biography",
    "Outdoors",
    "Travel"
  ],
  "author": "Mark Obmascik",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/6262620-halfway-to-heaven"
}