{
  "title": "Siipien kantamat",
  "description": "Syyllisyys - osoittaako se, että on jo ajauduttu väärille raiteille vai onko huono omatunto nimenomaan moraalin tae, joka varmistaa ettei mitään väärää pääse tapahtumaan? Juhani on lukion äidinkielen opettaja. Hän on jokin aika sitten eronnut vaimostaan Hannasta, jonka kanssa elettyjä vuosia reunusti traaginen menetys. Syksyllä kouluun tulee uusi oppilas, Yhdysvalloista muuttava Marianne, johon Juhani kiinnittää heti huomiota. \"Tämän henkilön kanssa haluan olla samaa mieltä, silloinkin kun olen eri mieltä.\" Marianne sulautuu helposti koulun muiden oppilaiden joukkoon, mutta opettajan kanssa syntyy yhteys. Aluksi he keskustelevat kirjoista ja elokuvista kuin kirjallisuudesta innostuneet opettaja ja oppilas: Turkasta, Vartiosta, Bergmanista, Hemingwaysta, Fitzgeraldista. Keväällä Marianne tuo Juhanille luettavaksi kirjoittamiaan novelleja ja he alkavat tavata myös vapaa-ajalla. Juhani tajuaa nopeasti että heidän välillään on jotain vakavaa. Mutta mikä yli puolta nuoremmassa Mariannessa Juhania kiehtoo? Onko kiintyminen Marianneen kuolemanpelkoa, keski-iän kriisiä vaiko ihka oikeaa rakastumista? Marianne on Miss Sixty -farkkuineen ja pikkuvanhoine mielipiteineen kaukana Juhanin maailmasta, johon kuuluu vain hyllymetreittäin kirjoja ja vanha koira. Ikäero painaa Juhania ja hän yrittää ottaa etäisyyttä Marianneen. Mahdollisuuden tähän tarjoaa lastentarhanopettaja Marjut, joka järjestelee Juhanin kodin uuteen uskoon ja vakuuttaa hänet siitä, että ihminen voi olla onnellinen kunhan vain tarpeeksi haluaa. Helpommaksi Juhanin elämää ei tee se, että arkea alkaa yhä enemmän hallita vakava sairaus. Siipien kantamat on taitavasti kirjoitettu ihmissuhdedraama, joka kysyy kipeitä kysymyksiä elämästä, kuolemasta ja rakkaudesta. Jussi Valtonen on aikaisemmin julkaissut kaksi romaania, Tasapainoilua (2003) ja Vesiseinä (2006, molemmat Like). Hän on koulutukseltaan psykologi. Kaunis ja yllätyksellinen tarina rakastumisesta.",
  "genres": [
    "Fiction",
    "Finnish Literature",
    "Audiobook",
    "Romance",
    "Adult Fiction"
  ],
  "author": "Jussi Valtonen",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/6265728-siipien-kantamat"
}