{
  "title": "A Final Arc of Sky: A Memoir of Critical Care",
  "description": "Buckling herself into the rear of an Agusta A109A, Jennifer Culkin prepares for the moment of lift. The deafening thrum of the helicopter announces the unknown perils and potential havoc that await. A critical care and emergency flight nurse, Culkin treats patients who are most often in mortal danger. Aboard the Agusta, she is entrusted with the life of a seventeen-year-old pulled from the wreckage of a headon collision as his father calls out a wrenching plea from below; she cares for a middle-aged man who is bleeding to death internally, remembering the four daughters who have kissed him goodbye, possibly for the last time. It is the arduous and acute struggle to keep her patients alive en route to the hospital that is Jennifer Culkin's most profound duty.Culkin is no stranger to death and its dramas, or the urgency that accompanies them. Her memoir pulls us into the neonatal intensive care unit, where she labors to ventilate an eleven-ounce preemie, the smallest human she has ever cared for. The tenuous lines between life and death lead us to the pediatric intensive care unit, where she looks after children seemingly too small to contain their devastating illnesses.As her personal life begins to mirror the intensity of her work, Culkin writes poignantly of attending her dying mother, who refuses to decide whether to prolong her life. She recounts with tenderness and exasperation the experience of looking after her widowed father, who faces death with dramatic stubbornness, ignoring medical advice and rejecting even basic treatment. Tempering her profound insights with humor, Culkin relates her taste for the edge, her own risky gambles, and her ongoing battle with multiple sclerosis. Finally, Culkin takes us back to flying, with the dramatic and redemptive stories of her colleagues who have perished in helicopter crashes in their very exceptional line of duty.A Final Arc of Sky does more than plunge readers into the chaos of emergency medicine; it is also a masterful reflection on the pivotal moments of our lives, on the beautiful fragility of our mortality.",
  "genres": [
    "Memoir",
    "Medical",
    "Nonfiction",
    "Medicine",
    "Biography Memoir",
    "Health"
  ],
  "author": "Jennifer Culkin",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/6265970-a-final-arc-of-sky"
}