{
  "title": "I Do Not Come to You by Chance",
  "description": "A deeply moving debut novel set amid the perilous world of Nigerian email scams, I Do Not Come to You by Chance tells the story of one young man and the family who loves him. Being the opara of the family, Kingsley Ibe is entitled to certain privileges--a piece of meat in his egusi soup, a party to celebrate his graduation from university. As first son, he has responsibilities, too. But times are bad in Nigeria, and life is hard. Unable to find work, Kingsley cannot take on the duty of training his younger siblings, nor can he provide his parents with financial peace in their retirement. And then there is Ola. Dear, sweet Ola, the sugar in Kingsley's tea. It does not seem to matter that he loves her deeply; he cannot afford her bride price.  It hasn't always been like this. For much of his young life, Kingsley believed that education was everything, that through wisdom, all things were possible. Now he worries that without a \"long-leg\"--someone who knows someone who can help him--his degrees will do nothing but adorn the walls of his parents' low-rent house. And when a tragedy befalls his family, Kingsley learns the hardest lesson of all: education may be the language of success in Nigeria, but it's money that does the talking. Unconditional family support may be the way in Nigeria, but when Kingsley turns to his Uncle Boniface for help, he learns that charity may come with strings attached. Boniface--aka Cash Daddy--is an exuberant character who suffers from elephantiasis of the pocket. He's also rumored to run a successful empire of email scams. But he can help. With Cash Daddy's intervention, Kingsley and his family can be as safe as a tortoise in its shell. It's up to Kingsley now to reconcile his passion for knowledge with his hunger for money, and to fully assume his role of first son. But can he do it without being drawn into this outlandish mileu?",
  "genres": [
    "Fiction",
    "Africa",
    "Nigeria",
    "African Literature",
    "Contemporary",
    "Literary Fiction",
    "Novels"
  ],
  "author": "Adaobi Tricia Nwaubani",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/6265288-i-do-not-come-to-you-by-chance"
}