{
  "title": "Lost Tomb of the Knights Templar",
  "description": "Treasure, tombs, secret codes and hidden clues, a brutal murder, the Knights Templar and 2000 year old relics - it could be the premise for a new archaeological thriller. Except that it is real. What begins as a treasure hunt and a bit of fun and adventure, leads an Englishman to the tiny French village of Rennes-le-Chateau, where an ordinary man unlocked a mysterious puzzle set up by a priest 100 years ago. Abbe Berenger Sauniere became mysteriously and fabulously rich after finding a hidden parchment when carrying out repairs to the Church of Mary Magdalene. Subsequent to Sauniere's death in 1917, speculation was rife about the possible source of his sudden wealth.Some have said it was proceeds from the sale of an ancient or a Royal Treasure. Or it might have been hush money paid by the Vatican to keep Sauniere quiet, but if so what did Sauniere find that they were so afraid of? As many believe, the mysterious priest had embedded clues in his church decoration leading to a treasure or a secret, and the source of his wealth. When Ben Hammott enters the church he soon spots something that everyone else has somehow missed - a key that deciphers some of the embedded clues.Painstakingly deciphering and following the clues, Ben is led to a discovery of 2000-year-old artefacts, a treasure of gold, and a Knights Templar tomb containing a body under a shroud! The area surrounding Rennes-le-Chateau features prominently in the bloodline legend which follows the premise that Mary Magdalene escaped Jerusalem with child, sailed to France and settled in the region. Centuries old manuscripts also support this legend. Mitochondrial DNA tests carried out on a hair sample give the body a Middle Eastern profile, rare in Europe with an incidence of only 4 percent - Are the legends and the tomb linked?",
  "genres": [],
  "author": "Ben Hammott",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/6266298-lost-tomb-of-the-knights-templar"
}