{
  "title": "Patrick O'Connell's Refined American Cuisine: The Inn at Little Washington",
  "description": "Patrick O'Connell is often referred to as the Pope of American Cuisine. He is one of the pioneers in our country's culinary evolution over the last quarter century. Selecting The Inn at Little Washington as one of the top ten restaurants in the world, Patricia Wells hails O'Connell as \"a rare chef with a sense of near-perfect taste, like a musician with perfect pitch.\" As a self-taught chef who learned to cook by reading cookbooks, he has a unique ability to write recipes that are easy to follow and that produce delicious results. In this groundbreaking work, O'Connell celebrates the coming-of-age of American cooking and illustrates that we at last have our own equivalent to the haute cuisine of the great chefs of Europe. He manages to demonstrate that reproducing his versions of refined American cuisine is not only surprisingly doable but often easier than replicating the classic American dishes we grew up with. O'Connell offers vastly refined versions of his favorite American food: Macaroni and Cheese with Virginia Country Ham, Wild Mushroom Pizza, Crab Cake \"Sandwich\" with Fried Green Tomatoes, Pan-Roasted Maine Lobster with Rosemary Cream, Veal Medallions with Country Ham Ravioli, and Warm Plum Torte with Sweet Corn Ice Cream. All the recipes use readily available ingredients and are written in a clear, easy-to-follow voice - the voice of a self-taught chef who wants to share his love of food and hard-earned expertise. But even more refreshing than the delectable recipes are O'Connell's musings on his upbringing, American food, and entertaining. Reading this warm, witty book is the next best thing to dining at The Inn at Little Washington. Cooking from it is even better!",
  "genres": [
    "Cookbooks",
    "Reference"
  ],
  "author": "Patrick O'Connell",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/626478.Patrick_O_Connell_s_Refined_American_Cuisine"
}