{
  "title": "The Struggle for the People’s King: How Politics Transforms the Memory of the Civil Rights Movement",
  "description": "How the misuses of Martin Luther King’s legacy divide us and undermine democracyIn the post–civil rights era, wide-ranging groups have made civil rights claims that echo those made by Black civil rights activists of the 1960s, from people with disabilities to women’s rights activists and LGBTQ coalitions. Increasingly since the 1980s, white, right-wing social movements, from family values coalitions to the alt-right, now claim the collective memory of civil rights to portray themselves as the newly oppressed minorities. The Struggle for the People’s King reveals how, as these powerful groups remake collective memory toward competing political ends, they generate offshoots of remembrance that distort history and threaten the very foundations of multicultural democracy.In the revisionist memories of white conservatives, gun rights activists are the new Rosa Parks, antiabortion activists are freedom riders, and antigay groups are the defenders of Martin Luther King’s Christian vision. Drawing on a wealth of evidence ranging from newspaper articles and organizational documents to television transcripts, press releases, and focus groups, Hajar Yazdiha documents the consequential reimagining of the civil rights movement in American political culture from 1980 to today. She shows how the public memory of King and civil rights has transformed into a vacated, sanitized collective memory that evades social reality and perpetuates racial inequality.Powerful and persuasive, The Struggle for the People’s King demonstrates that these oppositional uses of memory fracture our collective understanding of who we are, how we got here, and where we go next.",
  "genres": [
    "History",
    "Politics",
    "Race",
    "Nonfiction",
    "Social Justice"
  ],
  "author": "Hajar Yazdiha",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/62649165-the-struggle-for-the-people-s-king"
}