{
  "title": "Futuristic Farms",
  "description": "Welcome to Futuristic Farms! We hope you enjoy your stay!One will do everything for his species. The other focuses on nothing but her career. Together, they may find there’s more to life than the duty to their people.It’s been five years since our spaceship came tumbling out of the atmosphere and crash-landed on Earth. After a civil war that ended in the destruction of our home planet and the death of everyone I’ve ever loved, the only thing keeping me sane is my duty to my people. I care nothing for humans, their petty squabbles, or their planet. I only care about the future of the Bolund race.But all that begins to change when she walks in, looking for a new job at Futuristic Farms. At first, I want nothing to do with her and her foreign human ways, but as we continue our duties, my loyalty to my people starts to blur…I’ve spent the last five years of my life hunched over in a lab, trying to find the key to unlock the secret to the disease that took the life of my younger brother. But when my funding is pulled and the lab is shut down, I find myself unemployed and struggling to make ends meet. I apply for a job at Futuristic Farms, the world-renowned corporation that’s on the cutting edge of advancements using both human and Bolund research.When I get the job, I’m ecstatic. But there are two one, I find myself employed as nothing more than an Extraction Specialist, harvesting the alien’s most important fluid in the hopes of repopulating their species; and two, my Extraction Subject is more than a little hard to get along with. His name is Kal, and he wants nothing to do with me.Unfortunately for him, he’s the Subject and I’m the Specialist, and after I’m forced to extract his most precious fluid every day, I find myself falling for him, which begins to put my career in jeopardy. To make matters worse, Futuristic Farms isn’t all it seems to be, and as we grow closer, so too does the danger to our lives…",
  "genres": [
    "Aliens"
  ],
  "author": "Abby Summers",
  "average_rating": "2.89",
  "url": "https://www.goodreads.com/book/show/62690504-futuristic-farms"
}