{
  "title": "Overrun: How Joe Biden Unleashed the Greatest Border Crisis in U.S. History",
  "description": "Overrun provides the first full account of the worst mass immigration border crisis ever to strike the United States, how and why the administration of President Joe Biden unleashed it, how it has forever altered the nation, and what voters and all future leaders need to comprehend in order to finally end it.“Todd Bensman tells the truth about illegal immigration and how it is not a victimless crime. With immigration front and center this year, his book is a must -read.” –Thomas Homan, former Acting Director of Immigration and Customs Enforcement, 2017-2018, and author of Defend the Border and Save Solving Our Most Important Humanitarian and Security Crisis .The time has come to acknowledge and comprehend that America is weathering the worst mass border migration event in the nation’s history. Millions of foreign nationals have overrun the southern border, starting on Inauguration Day in 2021, and millions more will cross over by the end of President Joe Biden’s term in 2024. This event is historic by all measures, exceeding even the storied chronicles of Ellis Island, and portends the same permanent change for the nation. Unfortunately, a fog of a fierce partisan information war obscures that it is even happening as well as basic truths Americans desperately need to have about this historic event. Radical ideologues, whose ideas even the modern Democratic Party had always rejected, gained power in 2021 and, with impunity, implemented an extreme reality-divorced theology about immigration. Americans never voted for their experiment or the irrevocable consequences that immediately waylaid a surprised nation.But the American electorate has upcoming chances in the election booth to reclaim their say. This book provides what is needed reporting-based analysis that will lay bare this crushing ongoing emergency’s causes, dimensions, and chaotic impacts so as to finally illuminate the pathway out of it. Here is ground zero of the human tsunami that smashed into America and is still washing into all fifty states with permanent consequences. It is a true story that can be found nowhere else because it comes from the author’s frontline reportage throughout the borderlands and all along the migration trails in Central America from its first days. Its primary sources are not “experts,” politicians and media pundits, but the witnesses to this history, the immigrants at its core.",
  "genres": [
    "Politics",
    "Nonfiction",
    "American"
  ],
  "author": "Todd Bensman",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/62688457-overrun"
}