{
  "title": "The Iron Princess",
  "description": "A young woman rises from the streets to battle a sinister evil in this magical fantasy adventure by the bestselling author of the Darwath series.Something is amiss with the world's magic. Spells don't work the way they used to--when they work at all. Only the powers of the Crystal Mages remain as they were, powers founded on the use of the mystical element adamis, the harvesting of which has enslaved the peoples of the Twilight Lands.They need a hero.At the same time, ravenous beasts have begun to appear, legendary creatures that seem to be proof against any magic. And Clea Stylachos, granddaughter of a great sage of the Twilight people, has reason to fear that the Crystal Mages, instead of seeking to defeat these insanely destructive monsters, are attempting to weaponize them in their quest for power.Clea's only hope to save her people is a wizard who retains his power, one who will not betray her, either to the great merchant houses or to the all-entangling web of the Crystal Mages. But that wizard--Ithrazel the Cursed, destroyer of a city and magically imprisoned to suffer undying, unremitting torment--wants nothing to do with saving the world, helping a hero, or unraveling the terrible secret at the heart of the Crystal Mages' plans.From the slums and tunnels of the slave-city of Morne, to the watery wilderness of the Twilight lands, to the halls of her father's palace and the spell-soaked mysteries of the Crystal Mages' House of Glass, Clea works to untwist the deadly riddles of magic and monsters--to free her mother's disenfranchised people from slavery under her father's conquering forces. To save her mageborn brother from the Crystal Mages' power; to control a sorcerer legendary for his deed of evil; to keep her own small band of friends one step ahead of her father's troops and the Crystal Order's spells.She is the Iron Princess, and she knows she must prevail or die.But at what cost to herself?",
  "genres": [
    "Fantasy",
    "Fiction",
    "Magic",
    "Romance",
    "Epic Fantasy",
    "Adventure",
    "Science Fiction Fantasy"
  ],
  "author": "Barbara Hambly",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/62690930-the-iron-princess"
}