{
  "title": "ابن سينا أو الطريق إلى أصفهان",
  "description": "ابن سينا واحد من بين قلة من نوابغ العصور السالفة الذين وصلتنا أهم مؤلفاتهم، إضافة إلى صورة واضحة عن حياتهم الشخصية، وذلك من خلال الصفحات التي تركها لنا تلميذه وتابعه أبو عبيد الجوزجاني الذي صاحبه في حله وترحاله، والذي وصف لنا في قرابة العشرين صفحة ما تعرض إليه معلمه من ظلم الملوك وسطوة الأمراء وتعب الجسد في مرام النفس الكبيرة. ويبدو ابن سينا من خلال “سيرة الجوزجاني” شخصية مأساوية جاهزة للتنفيذ الروائي، بما تتضمنه من تفاصيل وتقلبات وتشويق ونهاية يتعارض فيها القدر مع الإرادة وفقاً لشروط المأساة الإغريقية.وقد استغل جيلبرت سينويه هذه السيرة القصيرة لإنجاز عمله الضخم، فأجرى نص هذه الرواية على لسان أبي عبيد الجوزجاني، وأورد عدداً من الحواشي ذيلها باسم هذا التابع الوفي الذي رافق ابن سينا طيلة خمسة وعشرين عاماً، وأردفها بحواشي أخرى ذيلها بإمضاء “المترجم” وذلك لإحكام الإيهام بنسبة هذا النص إلى تلميذ ابن سينا وكاتب سيرته المعروف، ولمزيد الإقناع (إقناع القارئ) بأن المؤلف (الفرنسي) ليس أكثر من مترجم لسيرة ابن سينا كما كتبها الجوزجاني، وهذا يعني أيضاً أنه ليس سوى ناقل أمين لنص كتب في الأصل بالعربية.ولما كان ذلك من جوهر “لعبة” السرد المتوخاة في هذا العمل، فقد رأينا أن نحترم قواعد اللعبة أثناء الترجمة، مذيلين حواشينا الخاصة بإمضاء “المعرب”، وكأننا لا نترجم نصاً، بل نعيده إلى لغته الأم. وقد تطلب منا هذا الأمر أن نعود إلى نص رسالة أبي عبيد، وأن نرجع إلى مؤلفات ابن سينا نفسه: خاصة كتاب القانون وكتاب الشفاء والأرجوزة الطبية، وأن نثبت الكثير من الآيات القرآنية والأحاديث النبوية والأمثال والأبيات الشعرية، للدنو قدر المستطاع من “نص أصلي”، هو أقرب إلى الحقيقة الافتراضية منه إلى أي شيء آخر.هكذا يجد القارئ نفسه أمام لعبتين: لعبة الكتابة باعتبارها ترجمة، ثم لعبة الترجمة باعتبارها عودة بالنص إلى أصل ما. كان ذلك أول الأسباب التي أغرتنا بترجمة هذه الرواية.يسند جيلبرت سينويه إلى أبي عبيد الجوزجاني دوراً مزدوجاً أو لنقل دورين متعاضدين في عملية السرد: دور “الراوي المعلن” المعتمد على ضمير المتكلم، الذي يصف الأحداث من زاوية نظرة الشخصية، ودور “الراوي المستتر” الذي يتقمص دور المؤلف ويدعي “الحياد”بتقديم نفسه ضمن سائر الشخصيات المتحركة داخل دائرة الأحداث المروية.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Novels",
    "Philosophy",
    "France",
    "Iran",
    "French Literature"
  ],
  "author": "Gilbert Sinoué",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/6267879"
}