{
  "title": "Knot My Problem",
  "description": "Secrets are my life. But after so many years of living one lie after another, do I even really know who I am without them? When work explodes—quite literally—in my face, I’m forced into hiding until the smoke clears. Now I’m living in a small town, with the one man who has the power to break down my carefully constructed identity. Ten years ago he walked away without so much as a goodbye and broke my fragile, barely legal heart. Looking back on it, there were so many obstacles in our way, but I would’ve been willing to risk his honor and integrity to have what I so desperately wanted—consequences be damned—if he hadn’t taken the choice out of my hands. Now here we are, older and wiser, or so I’d like to think. Could this time be different? Except now he’s got a pack to consider and I have a very persistent Beta who refuses to give me any sort of space. For a woman used to handling things on her own, it’s all a little too much, too fast. Add in the threat that’s looming closer every day, and things are about to get messy. If there’s one thing I need from the overprotective men in my life, it’s their trust. Yet they always underestimate me. It’s cool. I’m used to taking care of things on my own. This girl has everything under control. And when it comes to the men I love, I will do whatever is necessary to protect them. What they choose to do next…well, it’s knot my problem. For Trigger Warnings, please visit my website. Knot My Problem is book three in the Knot Yours Omegaverse, a series of fast-burn reverse harem romance standalones. Each book will end in an HEA and lead into the next book with a new reluctant omega and her own possessive, purring alphas.",
  "genres": [
    "Omegaverse",
    "Reverse Harem",
    "Romance",
    "M M Romance",
    "Fantasy",
    "Paranormal Romance",
    "Contemporary"
  ],
  "author": "Sinclair Kelly",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/62697458-knot-my-problem"
}