{
  "title": "Rules for Rule Breaking",
  "description": "Booksmart meets Never Have I Ever in this debut YA rom-com about two Korean American teens forced into a shared college visit road trip where they discover that the reasons they’ve been rivals their entire lives might actually be signs they’re a perfect pair.Winter Park and Bobby Bae are Korean American high school juniors whose families have been friends since the kids were making crayon art. They, however, are repulsed by each other.Winter is MIT-bound, comfortable keeping people at arm’s length, and known by others as responsible, though she has a desire to let loose. This probably comes from her rebel grandmother, who is constantly pushing boundaries and encouraging Winter to do so as well. Winter’s best friend is moving abroad and won’t be attending college at all, and Winter’s wrestling with what it means to be left behind. Bobby is as Type-A, anxious, and risk-averse as you can get. He’s also been recently dumped, which has him feeling disoriented and untethered.That’s why, when Winter’s and Bobby’s parents insist that they go on a northeast college campus tour together, both teens find reasons to accept even though the thought of being stuck in a car together for 700 miles sounds unbearable. What awaits them is a journey of self-discovery where the only rule on their road trip is to break all the rules. At first, this happens in hilariously calculated ways (using lists and reason and logic!), but they soon abandon that, challenging each other to dares in Virginia, getting high and wandering around Philly for food—and battling the subsequent digestive distress—and crashing a party in Cambridge. And, of course, realizing that they’re perfect together.Praise for RULES FOR RULE BREAKING:Tucker’s debut is full of fun, slow-burn, romantic comedy hallmark moments...A thoughtful coming-of-age story filled with rom-com cuteness. —- Kirkus Reviews“…Satisfying, laugh-out-loud road-trip debut…Tucker levies dynamic storytelling via the duo’s alternating POVs to present a lightweight rom-com that captures the thrill of spontaneity and budding romance.”—Publishers Weekly“[Winter and Bobby] are such imperfectly perfect teens, [I wanted] to cringe,then hug them. Empathetic and instantly compelling.”—CLAIRE AHN, author of I Guess I Live Here Now“You’ll laugh, you’ll cry, you’ll be begging Winter and Bobby to kiss. Readers, prepare a permanent spot on your must-buy list for Talia Tucker!”—TESS SHARPE, author of The Girls I’ve Been“Rules for Rule Breaking took me on a journey filled with self-discovery [and] sparkling chemistry... Talia Tucker is a debut author to watch.”—SARAH SUK, author of The Space Between Here & Now and Made in Korea“My favorite kind of rom-com: smart, snappy, and swoon-worthy.”—MICHELLE QUACH, author of Not Here to Be Liked“Enemies-to-lovers done right, and an immediate favorite.”—Serena Kaylor, author of Long Story Short",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Young Adult Romance",
    "Fiction",
    "Enemies To Lovers",
    "Young Adult Contemporary"
  ],
  "author": "Talia Tucker",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/62692382-rules-for-rule-breaking"
}