{
  "title": "Fatal Identity",
  "description": "Spy craft between the United States and Iraq takes a turn for the deadly when Iraq teams up with Iran to steal highly classified scientific information.Just as Majors Paul Remmich and Eric Miller are beginning to heal from their sly kidnapping ordeal in Europe, they encounter two Middle Eastern spies who infiltrate their secret post at Fort Belvoir. Clearly still in danger, the two officers are strategically sent to the Los Alamos National Laboratory (LANL). Using their classified decryption knowledge, they will teach foreign scientists participating in an international biophysics study. It should be a safe place to wait for the heat to die down.Meanwhile, Iraq and Iran make an unusual pact. Little does LANL know that two of the visiting scientists are conspirators for Iran. Their sole purpose of stealing scientific information will aid their own country’s ominous plans. Fake names and altered facial features create facades for identities that can’t be verified.To the Iraqi underground spy organization known as Tariq’Allah, the officers’ presence becomes an obstacle as well as an opportunity for retribution. When both the officers locate the missing study, Iranians find out. They have a strategic plan to steal it. Unfortunately, when satellite communication between the spies and their country misfires, the hunt shifts from paper to human. A scramble to correct the mistake leaves the foreigners exposed and hoping for a quick getaway.The FBI sets up surveillance which, when discovered, causes Tariq'Allah spies to be sent to correct the screwup and quickly flee the US. When the action shifts to Europe, CIA counterespionage agents thwart the foreigners in the US and Istanbul, but the outcome proves unexpectedly fatal.",
  "genres": [
    "Fiction",
    "Novels",
    "Contemporary",
    "Epic",
    "Drama"
  ],
  "author": "Karl Braungart",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/62686425-fatal-identity"
}