{
  "title": "A New Age Begins",
  "description": "What if time were a pendulum that swung to and fro through the ages? At one end of the arc science and technology held dominion while at the other end of the arc alchemy, sorcery and magic ruled. In the very near future that pendulum is going to the threshold where science and technology holds sway and move into the region where alchemy, sorcery and magic are the mainstay of life. The result is that the science and technology that rules the world no longer works as designed … if at all. Instead people around the globe begin to discover talents they had no idea they possessed. There seems to be no rhyme or reason for who ends up possessing those talents. So begins the first steps in the rebirth of the 3 main talents of the new age. Amazingly enough, the fairy tale of Merlin emerges with a kernel of truth behind it. Though one of the most powerful magicians of his age, he was one of the final caretakers of the last age of wonder. Cautions begin to reveal themselves regarding the location of his journal that contains information to not only improve the skills of emerging alchemists, sorcerers and magicians but also tips on how to restrain the forces held in abeyance by the age of science and technology.An unlikely band of friends begin following the clues left behind in search of Merlin’s lost journal. Finding allies and friends in some of the least expected places they forge onward from clue to clue toward their ultimate destination and reward. Learning about each other as well as themselves they travel from the heart of the Midwest to Europe on their quest. Each step along the way they feel the impending arrival of the evil only hinted at in the various clues. Will the evil emerge into a world totally unprepared to defend itself against such power? Will Merlin’s journal contain enough help to guide them to a mastery of their unique skills and abilities in time? Will they be able to find the journal in time to do anything? Will the perils of the new world allow them to live through to see the end of the quest? Only time will tell.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "Jeffrey Michael",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/12924817-a-new-age-begins"
}