{
  "title": "The Financial Collapse Survival Guide and Cookbook",
  "description": "The Financial Collapse Survival Guide and Cookbook.With his twelfth book, Albert Bates changes the frame on the global financial collapse, inviting us to enjoy what he calls \"the Great Change.\" A longtime expert in sustainable development, Bates shows how to secure your basic needs -- water, energy, food, waste management, transportation -- and how to deal with the slow fear of the unfamiliar.From the Foreword by Richard \"Albert Bates has produced a volume with more wit and judicious advice than anyone else could possibly have done; indeed there is probably no one better suited than he to address this topic. Albert has been living a post-collapse lifestyle since the 1970s, and, as Director of the Ecovillage Training Center at The Farm in Tennessee (a legendary intentional community exploring the frontiers of creative solutions to environmental and social problems), has taught subjects ranging from straw-bale home-building and mycoforestry to Permaculture and urban village design.\"In a typical stroke of mad genius, Albert chose to make this a cookbook as well as a survival guide. There is nothing more basic to human life than eating, and the transitional period will require some serious adjustments in how we feed ourselves. But what good is mere survival if we cannot find enjoyment as we go? Self-sufficiency and relocalization of economic activity will require creativity and humor as well as serious planning and hard work.As Albert says of his latest \"There is a kind of slow fear - not the kind of fear you feel when you are up high on a ladder and it shakes, or there is a deer in the headlights at 70 miles per hour. Those are sudden adrenaline rush types of fear. There is also a slow fear.\"Half a million people in the USA are being laid off each week now. They have watched their homes become worth less than their mortgages, their cars repossessed, their retirement savings vaporize, and their dreams of college for the children and a soft retirement vanish. They are staring at future involving working until they die, downsizing to a small apartment in a poor neighborhood, and giving up the car, if they are lucky.\"That sense of slow fear is gripping many of us now; a stone in the pit of the stomach, a sweat on the brow, a concern for our children and elderly relatives, and for where our food and health care will come from.\"There is standard advice for fear. We know it well, and Albert Bates been preaching it for many years now, in books, workshops, and advice at seminars.\"The advice is simple. Prepare yourself. Prepare your family. Prepare your community.\"It starts with having cash on hand. Not a checkbook or a credit card. Cash. Then there is the 3-day jump kit. Then there is one's personal supply of water, repairable shelter, camping gear, first aid, and food. Have a garden, even in the city. Don't panic. Learn to embrace uncertainty with humor, and shape up. You know all of this.\"But the slow fear is about something more insidious, something for which none of that preparation really matters.\"What has to be done with my slow fear, and with everyone's, is not to ignore it. Even if one thinks one is prepared, nobody is. So keep preparing. Go for those things that count. Get trained. Get centered. Shape up. This book could be the most valuable investment in your future you could make.\"The Financial Collapse Survival Guide also has something everyone should have on their the complete International Red Cross guide for first aid and emergency medical care in any situation. If you don't yet have this in your purse or briefcase, you can now.Here is information that's helpful to have on the home bookshelf, on the plane, on the street, and in the office. Start living a prepared-for-anything lifestyle now and avoid the rush.This book is like a Swiss army knife, which you may need in the next five minutes or five years from now. - Dr. Valentin Yemelin, climate scientist, UN Environment P",
  "genres": [],
  "author": "Albert Bates",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/6268378-the-financial-collapse-survival-guide-and-cookbook"
}