{
  "title": "A Bride for Eight Brothers, Volume 2",
  "description": "A Bride for Eight Brothers, Volume 2: Parts 3 & 4Part 3: Wild Fascination[Siren LoveXtreme Forever: Erotic Sci-Fi, Menage Romance, F/M/M/M/M/M/M/M/M, BDSM, sex toys]A woman from Peter's past is back to stir up trouble, so Ryan and Ty take their wife to Earth for a quick holiday.When Mikayla learns of the legal action against Peter, she insists on standing beside her man. Trouble is, that's exactly where Peter's ex-fiancée wants her.Meanwhile, Lachlan, Brock, John, Matt, and Bryce are setting up the research base on a new, uninhabited planet. But there's something strange about this place, and it only gets worse when Mikayla arrives. Can they identify the source of the problem before their fascination becomes a danger to the woman they all love?----------Part 4: Keen Inclination[Siren LoveXtreme Forever: Erotic Sci-Fi Menage Romance, F/M/M/M/M/M/M/M/M, light BDSM, public exhibition]Mikayla’s men are keen to start their family, but when things go wrong, can Mikayla really keep eight husbands happy? Feeling sad and rundown, and trying desperately to hide it from her men, Mikayla is glad to have some time on Earth with her best friend, Tracey. Her husbands Brock and John travel with her, but their concerns ratchet higher when they overhear her conversation.With the news of the mouse tears aphrodisiac properties somehow leaked to the public, the jungle planet is now being raided on a daily basis. Lachlan and Bryce are spending more time rescuing raiders from their own stupidity than getting geological surveys done and are starting to wonder if this contract is even worth the effort.To make matters worse, Peter's ex-fiancée is stirring up trouble again, and it seems someone on the jungle planet has an unusual plan for a couple of Mikayla's men.** NOTE You are purchasing Siren's newest serialized imprint, the LoveXtreme Forever Series. These books are not stand alone. Each is a continuation of the previous book and must be read in the numbered order. Each book may end on a cliffhanger but usually with a happy-for-now for the heroine and one or more men. The final book (#6) contains a happily forever after for the heroine and all her men. ** A Siren Erotic Romance **",
  "genres": [
    "Menage"
  ],
  "author": "Abby Blake",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/12924990-a-bride-for-eight-brothers-volume-2"
}