{
  "title": "Dreams From Broken Road",
  "description": "HARLANDThe music calls to me. It’s part of me and entwined with my soul. It’s always been my dream to follow the music where it leads me. I’m hoping it’ll be to a big break, but so far, it hasn’t been going too well.I wasn’t expecting my music to lead me to Ophelia, but I need a place to play and she’s new in town to manage her uncle’s bar. She gives me a chance, even though she doesn’t have to. I’m just grateful to be near her because the moment I saw her, I knew my dreams brought me to the woman who is meant to be mine.When my music leads me out of town, what does it mean for the woman who fuels my muse and my heart? What happens when my big break comes knocking? I don’t want to leave her behind, but I’m not sure I can convince her to dream a little bigger with me. Is there a way for me to get everything I want without leaving Broken Road and Ophelia?OPHELIAI’ve always been told to dream bigger, but a simple life where I know my worth and who I’m headed home to at night is more my style. I have no use for broken promises and big cities. It’s what led me to take my uncle up on his offer to move to Broken Road and manage his bar.I thought I’d settle in and find my rhythm. Then Harland bursts through the doors and begged for a chance to make his own dreams come true. As much as the promise of love I see in his eyes is real, he has bigger dreams than me.I love the stars in his eyes, but they scare me. His dreams can’t come true in Broken Road. I can only hope, when he gets everything that he’s been working for, my heart isn’t broken under his boots as he walks away. Are his dreams all or nothing or can we find a way to get everything we want?**18+ If you like alpha heroes and an insta-love story that is sweet and spicy but isn’t necessarily simple, then this is for you. No cheating with a guaranteed HEA. Broken Road, Texas is a small town with lots of heart filled with men who know how to treat their women. Meet Harland in Broken Road Wishes. There is a connection to my Denver Family books through White Picket Fences Records, but there won’t be a lot of crossover or cameos in Broken Road.**",
  "genres": [],
  "author": "Ember Davis",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/62706723-dreams-from-broken-road"
}