{
  "title": "The Glass Château",
  "description": "From the critically acclaimed author of Universe of Two and The Baker’s Secret, a novel of hope, healing, and the redemptive power of art, set against the turmoil of post-World War II France and inspired by the life of Marc Chagall.One month after the end of World War II, amid the jubilation in the streets of France, there are throngs of people stunned by the recovery work ahead. Every bridge, road, and rail line, every church and school and hospital, has been destroyed. Disparate factions—from Communists, to Resistance fighters, to federalists, to those who supported appeasement of the Nazis—must somehow unite and rebuild their devastated country.Asher lost his family during the war, and in revenge served as an assassin in the Resistance. Burdened by grief and guilt, he wanders through the blasted countryside, stunned by what has become of his life. When he arrives at le Chateau Guerin, all he seeks is a decent meal. Instead he finds a sanctuary, an oasis despite being filled with people every bit as damaged as him. But they are calming themselves, and recovering inch by inch, by turning sand into glass, and glass into windows for the bombed cathedrals of France.It's a volatile place, and these former warriors manage their trauma in different ways. But they are helped by women of courage and affection. Asher turns out to have a gift for making windows, and decides to hide the fact that he is Jewish so the devout Catholics who own the chateau will not expel him. As the secrets of the chateau’s residents become known one by one, they experience more heated conflict and greater challenges. And as Asher kindles his talents for glasswork, his recovery will lead the way for them all.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "France",
    "World War II",
    "Art",
    "War"
  ],
  "author": "Stephen P. Kiernan",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/62710654-the-glass-ch-teau"
}