{
  "title": "Aftermath: Coming of Age on Three Continents. A Memoir",
  "description": "“I spent the first three years of my life unaware of the disaster that had befallen my family.” Annette Libeskind Berkovits writes: “I was shaped by the aftermath of the Holocaust...I adapted...grew a protective shield for self-preservation, then put on a smile and moved forward to meet the world on my own terms.”She was born in exile among the red poppy-strewn foothills of the Himalayan Mountains and raised in Soviet Kyrgyzstan. Annette and her parents returned via cattle train to Poland only to discover that the Nazis had murdered almost their entire extended family and reduced their homes to rubble. After her parents obtained exit visas from the Soviet authorities, she became a teenage immigrant to two different countries in the space of two years.Israel, a country barely ten years old - rough, sweet, vibrant, with its brilliant sky and azure sea - was like stepping into Technicolor after Poland’s dreary grays. Annette fell in love with it. But just two years later Annette’s life was upended again when the family was driven to emigrate to America.Leaving the blue of Israel behind Annette was greeted by the green patina of the Statue of Liberty as the ship reached New York harbor. Her father and an Auschwitz survivor aunt welcomed the family with excitement, but many obstacles lay ahead.The American immigrant experience is realized here from a perspective of a young girl. New languages, customs, and cultures, learned at lightning speed while mastering the normal angst of adolescence, make this a vivid and immersive memoir, rich with the detail of everyday life.Annette graduated from one of the most selective public high schools in America and later became an internationally respected wildlife conservation educator and a writer of memoir, poetry, and historical fiction. Her brother, Daniel Libeskind, the internationally renowned architect, is very much a part of her story.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Holocaust"
  ],
  "author": "Annette Libeskind Berkovits",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/62703190-aftermath"
}