{
  "title": "All the Lost Places",
  "description": "When all of Venice is unmasked, one man's identity remains a mystery . . .  1807When a baby is discovered floating in a basket along the quiet canals of Venice, a guild of artisans takes him in and raises him as a son, skilled in each of their trades. Although the boy, Sebastien Trovato, has wrestled with questions of his origins, it isn't until a woman washes ashore on his lagoon island that answers begin to emerge. In hunting down his story, Sebastien must make a choice that could alter not just his own future, but also that of the beloved floating city.1904Daniel Goodman is given a fresh start in life as the century turns. Hoping to redeem a past laden with regrets, he is sent on an assignment from California to Venice to procure and translate a rare book. There, he discovers a city of colliding hope and decay, much like his own life, and a mystery wrapped in the pages of that filigree-covered volume. With the help of Vittoria, a bookshop keeper, Daniel finds himself in a web of shadows, secrets, and discoveries carefully kept within the stones and canals of the ancient city . . . and in the mystery of the man whose story the book does not Sebastien Trovato.\"Introspective, surprising, and achingly beautiful.\"--Booklist starred review\"Dykes's pen is fused with magic and poetry. Every word's a gentle wave building into the splendor that is All the Lost Places, where struggles for identity and a place to belong find hope between the pages of a timeless story.\"--J'NELL CIESIELSKI, bestselling author of The Socialite\"Luscious writing, authentic characters, and an ending that satisfies to the core of the spirit, this novel is another winner from Amanda Dykes.\"--HEIDI CHIAVAROLI, Carol Award-winning author of Freedom's Ring and Hope Beyond the Waves",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Fiction",
    "Historical",
    "Romance",
    "Christian",
    "Italy"
  ],
  "author": "Amanda Dykes",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/62720633-all-the-lost-places"
}