{
  "title": "Faith Still Moves Mountains: Miraculous Stories of the Healing Power of Prayer",
  "description": "INSTANT #1 NEW YORK TIMES BESTSELLER! From FOX News anchor and author Harris Faulkner comes a collection of powerful, true-life stories of resilience, healing, rescue, and protection.We need reminders of God’s power now more than ever.We often think about prayer as a wish list, with God as Santa Claus. The reality is that the power of prayer reminds us not only how small we are, but also how big God is. Prayer is hope put into action. And prayer works.From the aftermath of the devastating earthquake in Haiti to the theater shooting in Aurora, Colorado, believers testify to how God inspired hope even when all seemed lost.Two teenagers who were saved from treacherous seas by a vessel named Amen now give thanks for the rescue that changed their lives. A woman’s near-death experience with COVID-19 turned out to be the crisis freeing her from despair. Others speak to how prayer helped them navigate family trauma, overcome abuse, and cope with mental illness and depression. Historical accounts of miracles testify to God’s power throughout time, and Faulkner recounts the role of faith and prayer in her own life and the life of her father.Along with these stories of God’s presence, the book includes an exclusive packet of newly written prayers. Created to reflect the current times, this prayer booklet will provide a road map for putting the lessons of these stories into action.Faith Still Moves Mountains reminds us that God’s light always shines through the darkness. Through these testimonies, we learn prayer isn’t just a ritual, it’s a vital spiritual strategy in a world that wants us to give up the fight.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Faith",
    "Religion",
    "Spirituality",
    "Audiobook",
    "Christian Non Fiction"
  ],
  "author": "Harris Faulkner",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/62708277-faith-still-moves-mountains"
}