{
  "title": "A Bride for Eight Brothers, Volume 3",
  "description": "A Bride for Eight Brothers, Volume 3: Part 5 & 6Part 5: Hot Inspiration[Siren LoveXtreme Forever: Erotic Sci-Fi, Menage Romance, F/M/M/M/M/M/M/M/M, BDSM, sex toys] Mikayla and her husbands’ new contract is on a desert planet that already has a small, well-established colony, and Mikayla is eager to sample the local markets. Despite the beautiful landscape, varied wildlife and sensually inspiring heat, things don’t seem quite right. Polygamy is legal for both sexes, but it seems that only the men in this community have multiple partners. Determined to protect their wife, Mikayla’s husbands try to limit her exposure to the local culture.However, Bryce needs his leg fixed, so Mikayla and Matt finally convince him to get the surgery done. But while waiting for his brother to wake up, Lachlan witnesses a vicious assault on a young woman and steps in to help. Unfortunately, his act of compassion leaves him a target for the more fanatical occupants of this planet.Will protecting a stranger cost Mikayla and her husbands more than they’re willing to pay?----------Part 6: Mikayla's Family[Siren LoveXtreme Forever: Erotic Sci-Fi, Menage Romance, F/M/M/M/M/M/M/M/M, BDSM, spanking, whipping, sex toys]Mikayla and her men are relaxed and trying to start their family. The farm on Earth is proving to be a challenge they all enjoy, but their idyllic existence is interrupted by a threat from Mikayla’s past.Jet Killarney has been released from prison pending a retrial on his involvement in human trafficking, and the suspicious loss of Mikayla and Tracey’s recorded testimonies has everyone on edge. Expecting that Jet’s next move will be to attack Mikayla and Tracey, their husbands move both families into the research station, now parked behind the farm house. But as the waiting grows longer and the threat seems nonexistent, can Mikayla’s husbands distract her enough to keep them all safe and happy?**NOTE! You are purchasing Siren's newest serialized imprint, the LoveXtreme Forever Series. This is the conclusion of the A Bride for Eight Brothers collection. These books are not stand alone. Each is a continuation of the previous book and must be read in the numbered order. The final book contains a happily forever after for the heroine and all her men. ** A Siren Erotic Romance **",
  "genres": [],
  "author": "Abby Blake",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/12924991-a-bride-for-eight-brothers-volume-3"
}