{
  "title": "The Bonobo Sisterhood: Revolution Through Female Alliance",
  "description": "Foreword by Ashley Judd“Rosenfeld’s tour-de-force takes the power of female alliances to a higher level, giving us a road map for a new vision of women’s equality through the relationships and bonds we form among one another. The gift of this book is that it gives us hope.”—Valerie Jarrett, New York Times bestselling author of Finding My Voice, and former senior advisor to President Barack ObamaThe Bonobo Sisterhood is a revolutionary call to action for women and their allies to protect one another from patriarchal violence. Internationally recognized legal expert Diane L. Rosenfeld introduces us to a groundbreaking new model of female solidarity; one that promises to thwart sexual coercion.Urgent, timely, and original, The Bonobo Sisterhood harnesses the power of the #MeToo movement into a road map for sex equality in humans. Our closest evolutionary cousins, the bonobos have a unique social order in which the females protect one another from male aggression. The takeaway? Evolutionarily, bonobos have eliminated sexual coercion and enjoy a more peaceful, cooperative, and playful existence. We have much to learn from them.Rosenfeld explores the implications of the bonobo model for human societies and systems of governance. How did law develop to elude women’s rights so consistently? What difference does it make that we live in a patriarchal democracy? And what do bonobos have to offer as living proof that patriarchy is not inevitable? Most important, how can women break down barriers among themselves to unleash their power as a unified force? Rosenfeld has answers.The Bonobo Sisterhood takes us through real-life stories from the courtroom to the classroom and beyond, charting a new vision of a collective self-defense among women and their allies. It offers an action plan accessible to everyone immediately. This is an open invitation to anyone who wants to challenge the status quo. It starts with the power inherent in each of us knowing that we have selves worth defending, and awakening that power for ourselves and for our sisters. We now have a new model for real change, Rosenfeld reminds us. It’s time to use it.The Bonobo Sisterhood forges a path to create and discover a new meaning of equality, liberty, and justice for all.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Womens",
    "Politics",
    "Society",
    "Science",
    "Social Justice"
  ],
  "author": "Diane Rosenfeld",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/62711100-the-bonobo-sisterhood"
}