{
  "title": "The Accountant's Story: Inside the Violent World of the Medellin Cartel",
  "description": "\"I have many scars. Some of them are physical, but many more are scars on my soul. A bomb sent to kill me while I was in a maximum security prison has made me blind, yet now I see the world more clearly than I have ever seen it before. I have lived an incredible adventure. I watched as my brother, Pablo Escobar, became the most successful criminal in history, but also a hero to many of the people of Colombia. My brother was loved and he was feared. Hundreds of thousands of people marched in his funeral procession, and certainly as many people celebrated his death.\" These are the words of Roberto Escobar-the top accountant for the notorious and deadly Medellín Cartel, and brother of Pablo Escobar, the most famous drug lord in history. At the height of his reign, Pablo's multibillion-dollar operation smuggled tons of cocaine each week into countries all over the world. Roberto and his ten accountants kept track of all the money. Only Pablo and Roberto knew where it was stashed-and what it bought.  And the amounts of money were simply staggering. According to Roberto, it cost $2,500 every month just to purchase the rubber bands needed to wrap the stacks of cash. The biggest problem was finding a place to store it: from secret compartments in walls and beneath swimming pools to banks and warehouses everywhere. There was so much money that Roberto would sometimes write off ten percent as \"spoilage,\" meaning either rats had chewed up the bills or dampness had ruined the cash.  Roberto writes about the incredible violence of the cartel, but he also writes of the humanitarian side of his brother. Pablo built entire towns, gave away thousands of houses, paid people's medical expenses, and built schools and hospitals. Yet he was responsible for the horrible deaths of thousands of people.  In short, this is the story of a world of riches almost beyond mortal imagination, and in his own words, Roberto Escobar tells all: building a magnificent zoo at Pablo's opulent home, the brothers' many escapes into the jungles of Colombia, devising ingenious methods to smuggle tons of cocaine into the United States, bribing officials with literally millions of dollars-and building a personal army to protect the Escobar family against an array of enemies sworn to kill them.  Few men in history have been more beloved-or despised-than Pablo Escobar. Now, for the first time, his story is told by the man who knew him best: his brother, Roberto.",
  "genres": [
    "Nonfiction",
    "Crime",
    "True Crime",
    "Biography",
    "History",
    "Autobiography",
    "Memoir"
  ],
  "author": "Roberto Escobar Gaviria",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/6270580-the-accountant-s-story"
}