{
  "title": "The Fifth Gospel: From the Akashic Record",
  "description": "18 lectures in various cities, Oct. 10, 1913 – Feb. 10, 1914 (CW 148) “Let me emphasize from the beginning that there is no element of sensationalism or anything of that kind in the choice of the title The Fifth Gospel . I hope to be able to show that it is possible to speak of such a Fifth Gospel from a point of view that is of particular importance to us in the present age, and that no title could be more suitable for what is intended. As you will hear, the Fifth Gospel has never been written down, but it will certainly be put into definite form in future times. In a sense, however, it would be true to say that it is as ancient as the other four Gospels.” ― Rudolf Steiner (Oct. 1, 1913) From his clairvoyant reading of the akashic record―the cosmic memory of all events, actions, and thoughts―Steiner was able to discuss aspects of the life of Jesus Christ that are not recorded in the four Gospels of the conventional Christian Bible. The results of such research has been called “The Fifth Gospel.” After an intense inner struggle to verify the exact nature of these events, and having checked the results of his research, Steiner described many detailed episodes from the akashic record. For example, he speaks of Jesus’ life in the community of the Essenes, the temptation of Christ in the wilderness, and a significant, previously unreported conversation between Jesus and Mary. Steiner states that divulging such spiritual research is intensely difficult, but that “although people show little inclination to be told such facts as these, it was absolutely essential that knowledge of such facts should be brought to Earth evolution at the present time.” This book is a translation from German of Aus der Das fünfte Evangelium (vol. 148 in The Collected Works of Rudolf Steiner).",
  "genres": [
    "Spirituality",
    "Religion",
    "Christianity",
    "Philosophy",
    "Metaphysics"
  ],
  "author": "Rudolf Steiner",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/627391.The_Fifth_Gospel"
}