{
  "title": "No Vacancies A Collection of Short Stories, Vol. 1",
  "description": "The No Vacancies Adventure Series starts here in Volume 1. Using short tales, Lucien Black introduces readers to his episodic on-going series of short tales offering various genres of storytelling including action/adventure, horror, mystery, superhero and fantasy. Volume 1 introduces two episodic adventures; the action packed High Stakes and the supernatural Outcast. Set in an alternate universe, High Stakes follows Jack Ander, a coward forced to confront his own fears and join the resistance against a powerful super villain group known as the Protectorate. Outcast, set in Hudson, NY, introduces readers to Nathaniel, a wanderer with a hidden secret, following the trail of a murderer leaving mutilated bodies in his path. One More Sunday, a standalone adventure, follows Hudson's Detective Sam Arkwright as he attempts to put together the missing pieces of a murder; the victim being one of the city's renowned super heroes, The Protector. Finally in Devotion, Dr. Alastair Cromwell struggles to resurrect his late wife, Annette. Does he succeed in bringing her back from the dead or creating a monster?With No Vacancies, Lucien Black is creating a universe of unique characters facing impossible odds, blending genres of storytelling into action packed tales. So join us as we enter a world with No Vacancies.\"If your idea of a great read is to dust off those old Batman comics in which the hero is not only super, but sensitive and fallible, you will definitely want to check out the No Vacancies Series by Lucien Black. Told with gusto and rendered with tight, sparse prose worthy of a superhero comic book, but also with the generous breath of a novelist, these episodes are un-put-downable.\"--Vincent Zandri, International Bestselling author of The Innocent, The Remains and Concrete Pearl",
  "genres": [
    "Horror",
    "Pulp"
  ],
  "author": "Lucien Black",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/6275726-no-vacancies-a-collection-of-short-stories-vol-1"
}