{
  "title": "Eryn",
  "description": "\"Ms. Arthur is a master at creating fabulous paranormal worlds that are amazingly realistic and wholly believable. Readers will be delighted with this imaginative escape, and hoping there's more of the same seduction in the future.\"-Darque Reviews She's every man's desire and one man's target. Some think of Lifemate Connections as a government approved dating service, meant to keep order in a world where men outnumber women ten to one and only the rich are allowed to bear children. But the fabulously expensive hotel and bar is little more than a sex club where approved singles are required to test potential mates-and anything goes. Shifter Eryn James is beautiful but not wealthy; when the police ask her to act as bait for a serial killer at the hotel, she jumps at the chance to indulge in the decadent world of the privileged class. Her keen sense of smell should protect her. The club is full of security, and the cops have her under constant surveillance. None of that will keep her safe from Grey Stockard . . . a dangerous, mysterious fellow shifter who instantly destroys her willpower and claims her as his own. But even mind-blowing sex and their powerful psychic bond can't erase Eryn's fear that he may be the killer. A man she wants with every ounce of her being. A man she just might end up dying for . . .  Keri Arthur, author of the New York Times bestselling Riley Jenson Guardian series, has now written more than thirty novels. She's received several nominations in the Best Contemporary Paranormal category of the Romantic Times Reviewers Choice Awards and has won RT's Career Achievement Award for urban fantasy. She lives with her daughter in Melbourne, Australia.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Urban Fantasy",
    "Shapeshifters",
    "Adult"
  ],
  "author": "Keri Arthur",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/627759.Eryn"
}