{
  "title": "The Science of the Cross",
  "description": "To help celebrate the fourth centenary of the birth of St. John of the Cross in 1542, Edith Stein received the task of preparing a study of his writings. She uses her skill as a philosopher to enter into an illuminating reflection on the difference between the two symbols of cross and night. Pointing out how entering the night is synonymous with carrying the cross, she provides a condensed presentation of John's thought on the active and passive nights, as discussed in The Ascent of Mount Carmel and The Dark Night. All of this leads Edith to speak of the glory of resurrection that the soul shares, through a unitive contemplation described chiefly in The Living Flame of Love. In the summer of 1942, the Nazis without warrant took Edith away. The nuns found the manuscript of this profound study lying open in her room.Because of the Nazis' merciless persecution of Jews in Germany, Edith Stein traveled discreetly across the border into Holland to find safe harbor in the Carmel of Echt. But the Nazi invasion of Holland in 1940 again put Edith in danger. The cross weighed down heavily as those of Jewish birth were harassed. Sr. Teresa Benedicta of the Cross's superiors then assigned her a task they thought would take her mind off the threatening situation. The fourth centenary of the birth, of St. John of the Cross (1542) was approaching, and Edith could surely contribute a valuable study for the celebration. It is no surprise that in view of her circumstances she discovered in the subject of the cross a central viewpoint for her study. A subject like this enabled her to grasp John's unity of being as expressed in his life and works.Using her training in phenomenology, she helps the reader apprehend the difference in the symbolic character of cross and night and why the night-symbol prevails in John. She clarifies that detachment is designated by him as a night through which the soul must pass to reach union with God and points out how entering the night is equivalent to carrying the cross.Finally, in a fascinating way Edith speaks of how the heart or fountainhead of personal life, an inmost region, is present in both God and the soul and that in the spiritual marriage this inmost region is surrendered by each to the other. She observes that in the soul seized by God in contemplation all that is mortal is consumed in the fire of eternal love. The spirit as spirit is destined for immortal being, to move through fire along a path from the cross of Christ to the glory of his resurrection.",
  "genres": [
    "Theology",
    "Catholic",
    "Religion",
    "Philosophy",
    "Christianity",
    "Spirituality",
    "Poetry"
  ],
  "author": "Edith Stein",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/627634.The_Science_of_the_Cross"
}