{
  "title": "الطريق من هنا",
  "description": "تخلف العالم الإسلامي قضية معروفة وإن كانت مخجلة! وهذا التخلف أطمع الأقوياء فيه! بل قد طمع فيه من لا حسن الدفاع عن نفسه! وشر من ذلك أن هذا التخلف ألصق بالإسلام تهما كثيرة٬ بل إن عقائد خرافية فكرت في إقصائه ووضع اليد على أتباعه..! ولست ألوم أحدا استهان بنا أو ساء ظنه بديننا مادمنا المسئولين الأوائل عن هذا البلاء ٬ إن القطيع السائب لابد أن تفترسه الذئاب. وقد نهض كثيرون لمعالجة هذا الانحدار ٬ وإزاحة العوائق التي تمنع التجاوب بين الأمة ودينها أو إزالة الأسباب التي جعلت أمة كانت طليعة العالم ألف عام تتراجع هائمة على وجهها في مؤخرة القافلة البشرية... ورأيت ناشدى الإصلاح فريقين ٬ فريقا يتجه إلى الحكم على أنه أداة سريعة لتغيير الأوضاع ٬ وفريقا يتجه إلى الجماهير يرى في ترشيدها الخير كله..قلت في نفسي: إن الذين يسعون إلى السلطة لتحقيق رسالة رفيعة لابد أن يكونوا من الصديقين والشهداء والصالحين أو من الحكماء المتجردين والفلاسفة المحلقين! وأين هؤلاء وأولئك؟ إنهم لم ينعدموا ٬ ولكنهم في الشرق الإسلامي عملة نادرة. ومع ذلك ٬ فان أي حكم رفيع القدر لن يبلغ غايته إلا إذا ظاهره شعب نفيس المعدن عالي الهمة.!إذن الشعوب هي الأصل ٬ أو هي المرجع الأخير! وعلى بغاة الخير أن يختلطوا بالجماهير لا ليذوبوا فيها وإنما ليرفعوا مستواها ويفكوا قيودها النفسية والفكرية ٬ قيودها الموروثة أو التي أقبلت مع الاستعمار الحديث... وجاء الاعتراض السريع: إن السلطات القائمة لن تأذن لهم بذلك فهذه السلطات إن لم تؤجل على منافعها وجلت من القوى الكبرى التي تملك زمام الأمور في العالم الكبير ٬ ومن ثم فسوف تخرس الدعاة وأولى النهي... ولم تخدعني هذه الحجة على وجاهتها الظاهرة ٬ ولم أرها ذريعة للاشتباك مع الحاكمين ٬ وأخذ الزمام من أيديهم بالقوة ٬ فقد راقبت كثيراً من مراحل الصراع على السلطة درست ناسا نجحوا في الوصول إلى المناصب الكبرى فلم أرهم صنعوا شيئا٬ بل لعلهم زادوا الطين بلة..!. إنني أناشد أولى الغيرة على الإسلام وأولى العزم من الدعاة أن يعيدوا النظر في أساليب عرض الإسلام والدفاع عنه ٬ وأن يبذلوا وسعهم في تغيير الشعوب والأفكار ٬ سائرين في الطريق نفسه الذي سار فيه المرسلون من قبل... والإسلام اليوم يعانى من أمرين: الأول تصوُّر مشوَّش يخلط بين الأصول والفروع ٬ وبين التعاليم المعصومة والتطبيقات التي تحتمل الخطأ والصواب وقد يتبنى أحكاما وهمية ويدافع عنها دفاعه عن الوحي .....رابط للكتابhttp://www.4shared.com/office/kT8zkDg...",
  "genres": [
    "Religion",
    "Islam",
    "Nonfiction"
  ],
  "author": "محمد الغزالي",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/6276886"
}