{
  "title": "High Heels and Dirty Deals - Globetrotting Tales of Debauchery from a binge-drinking Nymphomaniac",
  "description": "Hilarious, riveting tales from a photo-journalist in his relentless pursuit of fast money, exotic women, and debauchery. Brett Tate and his posse of Russian gazillionaire gangsters blast through Moscow's fast paced nightlife living large, leaving a carnal train wreck in their wake. Devious adventures with bizarre twists. They somehow manage to set new highs and new lows for depravity at the same time. The stories are packaged with screaming funny observation humor and candid to erotic photography as they tear up the town. Like a Beverly Hills mafia, the wealthy businessmen/degenerates spend their days in a sea of top-shelf imported booze, Colombian flake, and a human pyramid of nude models. The writing captures the pulse and dark comedy fatalism of adrenaline junkies living the mobster lifestyle. Dangers and consequences are ignored. No expense is spared. The attitude, sights and sounds are described with a stunning clarity. Tate is a chest thumping Gladiator one second, self-deprecating and self-destructive the next. Brilliant; and yet clinically insane, written with the same amount of curiosity of the outcome as the reader's. You feel as if Tate is sitting next to you sharing his tales. The energy and vivid descriptions are brought alive with the crisp images that accompany the story line. Cityscapes, random people mocked, and hundreds of erotic photos from inside the VIP strip clubs and brothels, from the chic nightclubs to the jacuzzi, capturing the face-melting gorgeous women with whom the trio indulge every vice. But with all the outlandish antics and sex-drenched exploits, the icing on the cake is the cynical wit. Endless biting one-liners and satire. There's enough shock value to offend several generations of women. Destined to be a cult classic.",
  "genres": [
    "Nonfiction",
    "Memoir"
  ],
  "author": "Brett Tate",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/6276158-high-heels-and-dirty-deals---globetrotting-tales-of-debauchery-from-a-bi"
}