{
  "title": "Brother Betrayed",
  "description": "“One brother will betray the others with such treachery that it will change the destiny of Miscia forever.” The three princes hear this prophecy, and they will discover how far it will drive them to explore love, loyalty, and their own souls. The princes are bound by loyalty to each other and their kingdom. When conflict comes to their land, their ascension into power is darkened by betrayal. Oman, eldest and Anteria’s promised king, leads his brothers on their journey through Arnith. Fasime, driven by passion, seeks a life of romance and adventure. Syah, born the ailing youngest brother of these two outgoing princes, endeavours to overcome his bleak destiny through pursuit of knowledge and magic… a quest that may reveal unknown power within his own soul. A tale woven with deception, war, sacrifice, and magic, BROTHER, BETRAYED takes readers to a troubled kingdom surrounded by barbarians, magical races, and forbidden boundaries. Reviews and The excerpt drew me in and kept me interested. The writing is strong and very detailed. I can envision the scenes as if I am standing in them. Sara Raven I enjoyed the magical, royal setting, the lavishness of the setting, the dancing and revelry of your opening paragraph; and the emergence of the relationships among the brothers and their parents. Very intriguing. Well written, Danielle. Eldeen I loved loved loved your writing! You are a great writer. Well, your novel held me hostage!!! Casey S Your writing is excellent! The descriptions and attention to detail is some of the best I've read (even among well-known authors). I felt immediately drawn into the world and I could visualize every scene and set as I was reading. The three brothers are very intriguing, and I sense there's going to be a lot more development with them, but I became immediately attached to them all right from the start. It grabbed me from among the other.",
  "genres": [
    "Fantasy",
    "Magic",
    "War",
    "Fiction"
  ],
  "author": "Danielle Raver",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/12925274-brother-betrayed"
}