{
  "title": "Remember Me",
  "description": "Can Lady Philippa Ware forgive the man who once shattered all her youthful dreams? Discover the passionate and heartwarming new novel on the redemptive power of love from New York Times bestselling author Mary Balogh.Philippa, elder daughter of the Earl of Stratton, grew up eagerly anticipating a glittering debut and a brilliant marriage. Then her brother caught their father out in a clandestine affair and denounced him publicly. The whole family was disgraced, and Philippa’s hopes grew dim, then were fully shattered when she overheard the dashing, handsome Marquess of Roath viciously insult her upon learning of her father’s identity. Only years later does Philippa find the courage to go to London at last to meet the ton . She is an instant success and enjoys a close friendship with the granddaughter of a duke. Only one man can spoil everything for her, but surely he will not be in London this year.The Duke of Wilby is nearing death and has tasked his grandson and heir, Lucas Arden, Marquess of Roath, with marrying and producing a son before it is too late. Lucas, who usually shuns London, goes there early in the Season in the hope of finding an eligible bride before his grandparents come and find one for him. He is instantly attracted to his sister’s new friend, until that young lady asks a simple “Remember me?” And suddenly he does remember her, as well as the reason why the daughter of the Earl of Stratton is the one woman he can never marry—even if his heart tells him she is the only woman he wants.Unfortunately for Philippa and Lucas, the autocratic duke and his duchess have other ideas and believe them to be perfect for each other. They will simply not take no for an answer. Telling Philippa the full truth is the hardest thing Lucas has ever faced, and the discovery of it will change them both before they discover the healing power of love.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Fiction",
    "Audiobook"
  ],
  "author": "Mary Balogh",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/62802757-remember-me"
}