{
  "title": "Graceful Submission",
  "description": "\"Graceful Submission\"Plus-sized Grace Kinison lives a dull life. She's a teacher and aspiring author who does nothing but work and then write on her novel. That is, until she becomes a cyber submissive.Grace has agreed to help her childhood friend's husband plan her surprise birthday party. Grace thinks her fellow party planner, Toffer Shelley, is a writer on a TV show. What she doesn't know is that he's the show's sexy star, Drake Dawson. He's a Dom, and he wants to work his magic on her. When Grace runs into trouble at work, her cyber relationship turns into the real thing after she travels to Hollywood to meet Toffer. She's thrilled to be meeting her Master, until she realizes that he's the most gorgeous man in Hollywood. But Toffer won't let Grace judge him by his looks. He takes her on a sexual journey full of bondage and submission, which give her strength to overcome challenges in her own work. \"Graceful Mischief\"It's their third Halloween together, and Toffer and Grace are in England. They're staying in an old castle complete with a moat and a maze. Grace thinks her Master is taking her to a fancy restaurant in London so they can be alone together on Halloween. Hidden underneath her beautiful new dress is the sexy corset her Master bought in London a few days earlier.The trick is on Grace, though, when her Master takes her to the maze and tells her to strip down to her corset. A costume party is going on just hundreds of feet away, and Toffer plans on giving Grace a head start, then hunting her through the maze. If he catches her, she's awarded the trick, and he gets to have his way with her in the maze. There's always the chance that anyone could walk up and see Grace being topped. If she makes it to the middle without him catching her, she gets the treat: dinner and dessert. Only Toffer's not playing fair -- the treat's also a trick. But with what he has in mind, even if Grace loses, she wins.\"Publisher's Note: This book is a nontraditional love story that contains sexual content that may be offensive to some readers: Anal sex; strong BDSM theme and content (bondage, domination/submission, spanking, punishment); and multiple partners\"",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Erotic Romance",
    "Adult",
    "Contemporary Romance"
  ],
  "author": "Melinda Barron",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/6279489-graceful-submission"
}