{
  "title": "Banyan Moon",
  "description": "When Ann Tran gets the call that her fiercely beloved grandmother, Minh, has passed away, her life is already at a crossroads. In the years since she’s last seen Minh, Ann has built a seemingly perfect life—a beautiful lake house, a charming professor boyfriend, and invites to elegant parties that bubble over with champagne and good taste—but it all crumbles with one positive pregnancy test. With both her relationship and carefully planned future now in question, Ann returns home to Florida to face her estranged mother, Huơng.Back in Florida, Huơng is simultaneously mourning her mother and resenting her for having the relationship with Ann that she never did. Then Ann and Huơng learn that Minh has left them both the Banyan House, the crumbling old manor that was Ann’s childhood home, in all its strange, Gothic glory. Under the same roof for the first time in years, mother and daughter must face the simmering questions of their past and their uncertain futures, while trying to rebuild their relationship without the one person who’s always held them together.Running parallel to this is Minh’s story, as she goes from a lovestruck teenager living in the shadow of the Vietnam War to a determined young mother immigrating to America in search of a better life for her children. And when Ann makes a shocking discovery in the Banyan House’s attic, long-buried secrets come to light as it becomes clear how decisions Minh made in her youth affected the rest of her life—and beyond.Spanning decades and continents, from 1960s Vietnam to the wild swamplands of the Florida coast, Banyan Moon is a stunning and deeply moving story of mothers and daughters, the things we inherit, and the lives we choose to make out of that inheritance.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Audiobook",
    "Contemporary",
    "Literary Fiction",
    "Historical"
  ],
  "author": "Thao Thai",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/62800971-banyan-moon"
}