{
  "title": "Beyond Armageddon: Twenty-One Sermons to the Dead",
  "description": "In Beyond Armageddon, the distinguished science fiction writer Walter M. Miller Jr. (1923–96) and the famed anthologist Martin H. Greenberg (1941-2011) have together collected stories that address one of the most challenging themes of imaginative fiction: the nature of life after nuclear war. These richly imagined stories offer glimpses into a future no reader will soon forget. Miller’s incisive introduction and a thought-provoking and irreverent commentary are included. All stories are preceded by intros, written by Miller, which comment on the story to come, and sometimes also the story preceeding the note.Contents: Introduction: Forewarning (Beyond Armageddon) (1985) • essay by Walter M. Miller, Jr. Salvador (1984) / short story by Lucius Shepard The Store of the Worlds (1959) / short story by Robert Sheckley The Big Flash (1969) / novelette by Norman Spinrad Lot [David Jimmon] (1953) / novelette by Ward Moore Day at the Beach (1959) / short story by Carol Emshwiller The Wheel (1952) / short story by John Wyndham Jody After the War (1972) / short story by Edward Bryant The Terminal Beach (1964) / novelette by J. G. Ballard Tomorrow's Children [Tomorrow's Children • 1] (1947) / novelette by Poul Anderson and F. N. Waldrop Heirs Apparent (1954) / novelette by Robert Abernathy A Master of Babylon (1966) / novelette by Edgar Pangborn (variant of The Music Master of Babylon 1954) Game Preserve (1957) / short story by Rog Phillips By the Waters of Babylon (1937) / short fiction by Stephen Vincent Benét (variant of The Place of the Gods) [as by Stephen V. Benet] There Will Come Soft Rains [The Martian Chronicles] (1950) / short story by Ray Bradbury To the Chicago Abyss (1963) / short story by Ray Bradbury Lucifer (1964) / short story by Roger Zelazny Eastward Ho! (1958) / short story by William Tenn The Feast of Saint Janis (1980) / novelette by Michael Swanwick \"If I Forget Thee, Oh Earth ...\" (1951) / short story by Arthur C. Clarke A Boy and His Dog [Vic and Blood • 2] (1969) / novella by Harlan Ellison My Life in the Jungle (1985) / short story by Jim AikinAlso published as \"Beyond Armageddon: Survivors of the Megawar\"",
  "genres": [
    "Science Fiction",
    "Anthologies",
    "Post Apocalyptic",
    "Short Stories",
    "Fiction",
    "Apocalyptic",
    "Speculative Fiction"
  ],
  "author": "Walter M. Miller Jr.",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/627938.Beyond_Armageddon"
}