{
  "title": "So Help Me God",
  "description": "The autobiography of former Vice President Mike Pence.Loyalty is a Vice President’s first duty; but there is a greater one—to God and the Constitution.Mike Pence spent more hours in the Oval Office than any of his predecessors. On the surface, the affable evangelical Christian from a gas-station-owning family in Indiana wouldn’t seem to have much in common with a brash real estate mogul from New York. But the unlikely duo formed a tight bond. Pence was at Donald Trump’s side when he enacted historic tax relief, when he decided to take more assertive stances toward China and North Korea, and when he appointed three Supreme Court justices. But the relationship broke down after the 2020 election. On January 6, 2021, as the president pressured him to overturn the election, a mob erected a gallows on Capitol Hill and its members chanted “Hang Mike Pence!” as they rampaged through the halls of Congress. The vice president refused to leave the Capitol, and once the riot was quelled, he reconvened Congress to complete the work of a peaceful transfer of power.So Help Me God is the chronicle of the events and people who forged Mike Pence’s character and led him to that historic moment. His father, a Korean War combat veteran, was a formidable influence, but so was the Indiana history professor who inspired his devotion to the Constitution. And it was in college and law school that he embraced his Christian faith and met the love of his life, Karen—the two pillars that support him every day. You will read how his early political career was full of missteps that humbled him and how, as a talk radio host, Pence found his voice and the path that led him to Congress, the governor’s office in Indiana, and back to Washington as vice president.This is the inside story of the Trump administration by its second highest official—what he said to the president and how he was tested. The relationship begins in Indiana, when Pence sees how Trump connects with working-class voters. After the election, the vice president comes to appreciate how Trump maintains that connection through unvarnished tweets and how his unorthodox style led to historic breakthroughs, from tax cuts to trade deals, from establishing the United States Space Force to the first new peace agreement in the Middle East in more than twenty-five years. This is the most robust defense of the Trump record of anyone who served in the administration.But it is also about the private moments when Pence pushed back forcefully, how he navigated through the Mueller investigation, his damage control after Charlottesville, and his work on healing racial rifts after the murder of George Floyd. Pence was at the forefront when “history showed up” in the form of a devastating pandemic, and he provides a detailed account of leading the task force that circumvented bureaucracies to slow the disease in its tracks. Yes, it sometimes involved brokering peace between a president with an itchy Twitter finger and an agitated New York governor, but above all, it meant giving states and America’s eager entrepreneurs the power to come up with the solutions we needed. The result was the fastest development of life-saving vaccines in history.In So Help Me God, Pence shows how the faith that he embraced as a young man guided his every decision. It is a faith that guided him on that historic day and that keeps him happily at peace, ready to accept the next challenge.",
  "genres": [
    "Biography",
    "Politics",
    "Nonfiction",
    "Memoir",
    "History",
    "Audiobook",
    "Presidents"
  ],
  "author": "Mike Pence",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/62801878-so-help-me-god"
}