{
  "title": "Rocky Start",
  "description": "I think I’m falling for my bodyguard co-worker. Now I need protection… from myself. As a former SEAL intelligence officer, I’m supposed to be smart. Unfortunately, those smarts don't apply to love. I did a nice thing and took my heartbroken fellow bodyguard out for a Valentine’s dinner. Just us bros. But my plan worked a little too well, and a night that ended with a scorching kiss has turned into the most awkward morning at the office ever. Now we’re working together as bodyguards on a remote mountain movie shoot. And we’re roommates. I’ve never been attracted to a guy before, but something about Avery calls to every protective instinct I have. We’re not dating, but every night alone together, I fall a little deeper. It's also Avery’s first time with a guy too, and while we’re both enjoying all sorts of new things together, I worry my heart will be broken when we return to civilization. No matter how badly this may end, I can’t seem to stop wanting Avery. All of him. I want to see who he'll become if he ever manages to get out of his own way. I want to be his biggest cheerleader, best friend, and the guy he comes home to. But going from secret hookup to forever after is a big ask. Are we both brave enough to take the leap? ROCKY START is book four in the A-List Security series. It features TWO highly protective SEAL bodyguards, a double awakening, an exploration of the sexy, lacy kind, and all sorts of brand-new emotions. Get ready for all the high heat, big feels, and found family feels readers expect from this fan-favorite military romance author. Join A-List Security for this lower-angst series featuring former SEALs and celebrity clients. Happy endings and no cliffhangers guaranteed!",
  "genres": [
    "Romance",
    "M M Romance",
    "Military Fiction",
    "Contemporary",
    "Friends To Lovers",
    "LGBT",
    "Queer"
  ],
  "author": "Annabeth Albert",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/62795098-rocky-start"
}