{
  "title": "A Most Agreeable Murder",
  "description": "When a wealthy bachelor drops dead at a ball, a young lady takes on the decidedly improper role of detective in this action-packed debut comedy of manners and murder. Feisty, passionate Beatrice Steele has never fit the definition of a true lady, according to the strict code of conduct that reigns in Swampshire, her small English township--she is terrible at needlework, has absolutely no musical ability, and her artwork is so bad it frightens people. Nevertheless, she lives a perfectly agreeable life with her marriage-scheming mother, prankster father, and two younger sisters-- beautiful Louisa and forgettable Mary. But she harbors a dark secret: She is obsessed with the true crime cases she reads about in the newspaper. If anyone in her etiquette-obsessed community found out, she'd be deemed a morbid creep and banished from respectable society forever.For her family's sake, she's vowed to put her obsession behind her. Because eligible bachelor Edmund Croaksworth is set to attend the approaching autumnal ball, and the Steele family hopes that Louisa will steal his heart. If not, Martin Grub, their disgusting cousin, will inherit the family's estate, and they will be ruined or, even worse, forced to move to France. So Beatrice must be on her best behavior . . . which is made difficult when a disgraced yet alluring detective inexplicably shows up to the ball.Beatrice is just holding things together when Croaksworth drops dead in the middle of a minuet. As a storm rages outside, the evening descends into a frenzy of panic, fear, and betrayal as it becomes clear they are trapped with a killer. Contending with competitive card games, tricky tonics, and Swampshire's infamous squelch holes, Beatrice must rise above decorum and decency to pursue justice and her own desires--before anyone else is murdered.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Audiobook",
    "Historical",
    "Romance",
    "Mystery Thriller"
  ],
  "author": "Julia Seales",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/62794526-a-most-agreeable-murder"
}