{
  "title": "Wonder Drug: The Secret History of Thalidomide in America and Its Hidden Victims",
  "description": "A riveting account of the most notorious drug of the twentieth century and the never-before-told story of its American survivors. In 1959, a Cincinnati pharmaceutical firm, the William S. Merrell Company, quietly began distributing samples of an exciting new wonder drug already popular around the world. Touted as a sedative without risks, thalidomide was handed out freely, under the guise of clinical trials, by doctors who believed approval by the Food and Drug Administration was imminent. But in 1960, when the application for thalidomide landed on the desk of FDA medical reviewer Frances Kelsey, she quickly grew suspicious. When she learned that the drug was causing severe birth abnormalities abroad, she and a team of dedicated doctors, parents, and journalists fought tirelessly to block its authorization in the United States and stop its sale around the world. Jennifer Vanderbes set out to write about this FDA success story only to discover a sinister truth that had been buried for decades: For more than five years, several American pharmaceutical firms had distributed unmarked thalidomide samples in shoddy clinical trials, reaching tens of thousands of unwitting patients, including hundreds of pregnant women. As Vanderbes examined government and corporate archives, probed court records, and interviewed hundreds of key players, she unearthed an even more stunning find: Scores of Americans had likely been harmed by the drug. Deceived by the pharmaceutical firms, betrayed by doctors, and ignored by the government, most of these Americans had spent their lives unaware that thalidomide had caused their birth defects.  Now, for the first time, this shocking episode in American history is brought to light. Based on thousands of previously unseen documents and over three hundred interviews that spanned three continents, Wonder Drug lays bare a shocking episode in American history. This landmark exposé finally gives voice to the unrecognized victims of the 20th century's most notorious drug.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Medical",
    "Audiobook",
    "Health",
    "Medicine"
  ],
  "author": "Jennifer Vanderbes",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/62802667-wonder-drug"
}