{
  "title": "Nothing to Fear: FDR's Inner Circle and the Hundred Days That Created Modern America",
  "description": "Nothing to Fear brings to life a fulcrum moment in American history—the tense, feverish first one hundred days of Franklin Delano Roosevelt's presidency, when he and his inner circle completely reinvented the role of the federal government. When FDR took his oath of office in March 1933, more than 10,000 banks had gone under following the Crash of 1929, a quarter of American workers were unemployed, and riots were breaking out at garbage dumps as people fought over scraps of food. Before the hundred days, the federal government was limited in scope and ambition; by the end, it had assumed an active responsibility for the welfare of all of its citizens. Adam Cohen provides an illuminating group portrait of the five members of FDR's inner circle who, more than any others, drove this unprecedented transformation. These five men and women frequently pushed FDR to embrace more radical programs than he would have otherwise. FDR came to the White House with few firm commitments about how to resolve this national crisis—as a politician he was more pragmatic than ideological and, perhaps surprising given his New Deal legacy, a fiscal conservative by nature. Instead, he relied heavily on his advisers and preferred when they had conflicting views so that he could choose the best option among them. For this reason, he kept in close confidence both Frances Perkins—a feminist before her time and the strongest advocate for social welfare programs—and Lewis Douglas, an entrenched budget cutter who frequently clashed with the other members of FDR's progressive inner circle. Rather than commit to a single solution or ideology, FDR favored a policy of \"bold, persistent experimentation.\" As a result, he presided over the most feverish period of government activity in American history, one that gave birth to modern America. The political fault lines of this era—welfare, government regulation, agriculture policy—remain with us today. Nothing to Fear is both a riveting narrative account of the personal dynamics that shaped the heady hundred days and a character study of one of America's defining leaders in a moment of crisis.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "American History",
    "Presidents",
    "Audiobook"
  ],
  "author": "Adam Cohen",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/6282602-nothing-to-fear"
}