{
  "title": "Thrust",
  "description": "alternate cover edition of ASIN B0BGJPQ6CZZayne wants controlZayne Andino wants his life back. For years, his father has set him up with mate after mate, but only as a pretext to gain more money and power. Zayne is sick of being a bargaining chip, but he can't anger his father without jeopardizing his own status as agent in the Lunar Council Enforcement Agency. The best he can do is shut down his emotions and act like none of it bothers him.Talli refuses to be tamedTalli Paolao should be skating through life. He's the scion of the most feared witch clan in the world and drop dead gorgeous. But Talli's first mating went horribly wrong, leaving him with scars that might never heal. And now, his mother is demanding that he mate again, no matter how much Talli dreads it.A spark neither man can denyWhen Zayne meets Talli, his father's latest pick, all he sees is a spoiled brat. Zayne can't wait to be free of him. Only, the more he gets to know Talli, the more he sees the vulnerable, wounded man hiding under that beautiful, brash surface. And the more time they spend together, the harder it is for Zayne to pretend his attraction to Talli is just physical.Talli would rather die than be controlled again. He's sure he can find a way out of being mated to an arrogant wolf with a disciplinarian streak, no matter how hot the guy might be. But as trouble closes in on the isolated town of Crescent City, Talli realizes he might need Zayne more than he wants to admit.Can Zayne stand up to his father when it's time to let Talli go? And can Talli open up enough to let Zayne be the mate he needs? As ruin threatens their lives within and without, the only hope the two men have is in learning to surrender to each other.Thrust is the fourth and final book in the gay paranormal romance series, Lunar Wolves. It features an arrogant, cocky wolf and a sassy twink in need of a dominant hand and a mate to call his own.",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Paranormal",
    "Shapeshifters",
    "Magic",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "Kiki Burrelli",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/62819202-thrust"
}