{
  "title": "Ripping the Bodice",
  "description": "\"If you're looking for a big dose of fun to go along with your romance, look no farther than Inara Lavey's Ripping the Bodice. This story positively sparkles with wit and humor...Along with that humor, Ms. Lavey has given us an absolutely addictive cast of characters who are colorful and well-developed and almost larger than life.\"--Bookwenches.com\"The story was well-written and I enjoyed it immensely.\"--4-martini review from The Girls on Books\"Old school romance daydreams + embarrassing contemporary situations * two potential heroes = exponential fun.\" --Love Romance Passion\"Had me laughing out loud...\"--Nixy Valentine\"Ripping the Bodice is a classy read that kept this reader's interest from beginning to end. Inara Lavey seasons sexual passion, love, romance and wonderful wit and charm into this delightful tale.\" --Coffee Time RomanceGot sex and romance on the brain? So does Cassandra Devon. She also has hard-boiled private eyes, dashing pirates, jet-setting super spies and other sexy rogues entertaining her in her surprisingly explicit subconscious. All these erotic daydreams make it hard to stay focused on Cassandra's current namely, rebuffing the advances of Connor, a wild Irish rascal who wants to play the starring role in her fantasies. Cassandra is only interested in getting together with Raphael, the tall, dark and handsome man of her dreams. May the best romance hero win!Walter Mitty meets Erica Jong in this wickedly funny and sexy hot comedy-romance.LOOKING FOR MORE… in sexy RomComs? Check out these titles from Ravenous Romance that are both sultry and hilarious!SAVING SOPHIE by Elle AmeryA lifelong crush develops into a passionate—and sometimes toxic—lust affair. Jake has the power to save Sophie's career as well as her heart, but must decide if it's worth confronting his own obsessions.OPPOSITE SEX by Gina McQueenTwo lovers get so close in a steamy night of staggering sex that they swap bodies. What new thrills will their new bodies bring them? The phrase \"two become one\" never rang so true when these lovers test their boundaries, and even their will to swap back!HOT ON HER HEELS by Monica NewcombHot, young, Korean-American publicist Grace Park has perfected the art of enticing men to pursue her. But when she sets her sights on Nick Matthews, a man who is notoriously strings-free, she worries her five-inch heels and façade of unattainability won't get her what she wants. Both Grace and Nick may just throw out what they know about baiting their prey when they end up in a steamy Hawaiian setting...and might find they've got each other hook, line and sinker.EXPOSING NICOLE by Hayden RenierSex columnist, Sadie—known to her readers as Naughty Nicole—takes on a bet with her best friend to date her way through 30 days. Behind the scenes, a conservative journalist threatens to expose Sadie's double-life to her devout parents. Will Sadie be forced to give up her ruse? Or can she balance her life with Naughty Nicole's and succumb to her passions?VITAL SIGNS 1: I’VE BEEN A NAUGHTY NURSE by Jamaica LayneA lusty triangle between two South Carolina nurses and a hot Yankee doctor heightens more than just blood pressure at a small-town hospital. These southern belles find out that Dr. Harlan Wilkinson's chilly northern demeanor may just pack a lot of heat. Watch him test their Vital Signs!",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "M F Romance",
    "Humor",
    "Erotica",
    "Fiction"
  ],
  "author": "Inara Lavey",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/6281482-ripping-the-bodice"
}