{
  "title": "Passion",
  "description": "As the owner and CEO of his own company, Robert Bauer has spent the past fifteen years building his business into a multi-million-dollar corporation. It's taken all his time and energy, which hasn't left much room for a personal life, especially a love life. That's fine with Robert because he doesn't believe in the \"L word\" anyway. Lately, however, every time he goes to his favorite bar, he can't keep his eyes and thoughts off Jesse McIntyre, the gorgeous bartender with the soulful blue eyes. Even though Robert's not looking for a relationship, and tries to shake the attraction, he can't get the younger man out of his system. There's just one problem...he believes Jesse's straight. Jesse's been on the run from his old life for the past two and a half years. Even though he slings drinks at a gay bar, he has a hard and fast rule about never hooking up with customers. He's been down that road before, and though his physical wounds have healed, the emotional ones aren't so easy to forget. He lets his customers assume he's straight because it makes it easier to keep his distance. That is, until the businessman with the sexy smile starts coming into the bar. Jesse's drawn to Robert, even though he knows there's no way a wealthy, powerful man like that would ever be interested in a tattooed, college drop-out bad boy like him. But even if Robert weren't his opposite, it wouldn’t matter anyway, because Jesse's determined not to break his rules for anyone. When fate throws them together, and they find themselves alone for a weekend, the passion that has silently simmered for months ignites a firestorm that leaves them both shaken. Will it be enough, though, to convince Robert, who's sworn to never fall in love, that he might be pushing away the best thing that's ever happened to him? Or to force Jesse to face his fears once and for all and learn to trust his heart? Gay / Contemporary / Series",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Erotica",
    "LGBT",
    "Magic",
    "Gay"
  ],
  "author": "M.L. Rhodes",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6282355-passion"
}