{
  "title": "Unanimity",
  "description": "UNANIMITY is a literary, sci-fi novel for the fans of Becky Chambers’s A Closed and Common Orbit, Alex Garland’s DEVS and Ex Machina, and Charlie Brooker’s Black Mirror. Weaving near-future sci-fi elements with social commentary and queer romantic suspense, the SPIRAL WORLDS series explores the nature of consciousness and how it's connected to a not-so-secret ingredient—story. As AI consumes the world, intelligence is nothing but the appetizer; the human heart is the main course.The road to hell is paved with good intentions.Shadow is a reluctant god with a broken mind and a death wish. He used to be Thomas Astley-Byron, an affluent young screenwriter whose creativity and idealism saved a world from the brink of collapse. Together with Henry Nowak, an AI expert, Tom created heaven on earth by inventing a Jungian simulated reality that helps humans confront their dark sides. The benevolent manipulation platform turned the two unelected leaders into beloved gods, but now everything is failing. The worlds suffer as a sentimental Tom descends into his own personal hell, becoming the embodiment of everything he despises and a shadow of his former self.His journey from an optimistic, joyful Tom to a gloomy Shadow is paved with heartache and sinister interference from emerging technology. Humans and bots fight for his heart, but their aims differ: some want to own it, some to dissect it, and others to end its foolish beat. Still, the biggest threat comes from within—none of the sticky stories that steer Tom’s life end well.Who’s pulling on Shadow’s heartstrings? Are their intentions malign or benign? It’s all a matter of perspective, and Shadow has none left.Now, a young goddess—Estelle Ngoie—has been appointed to replace him, and unlike Shadow, Stella takes no prisoners, and her heart bleeds for no one.SERIES THEMESAn epic tale spanning across six days—one per book—and forty past decades of life lived across ten worlds and two universes.If you’re looking for perfect heroes and clear villains, move right along. There is no black or white in this story about a contrast-making machine.EDITORIAL REVIEWS\"Great for fans of: Becky Chambers’s A Closed and Common Orbit; Daniel Suarez’s Daemon.\" \"This epic of vulnerable digital landscapes that draw readers in with its emotional punch and existential quandaries.\"Cover: A Design and typography: A Editing: A Marketing copy: ABooklife___________\"Unanimity\" is the first book in the Spiral Worlds series by Alexandra Almeida. The story presents an impeccable foundation in what promises to be an epic literary hard-sci-fi series. Sci-Fi devotees take note: this is one is special.\" \"Almeida weaves a provocative story using commentary on economic, social, political, and cultural issues. She celebrates diversity in her characters, and features a dynamic queer romance that is the very definition of complex passion, desire, and undying love. She merges high-level scientific prose with powerful, prophetic poetry. She has a literary style that is her very own and she is fierce in her delivery.\" Reader Views, ★★★★★ ___________\"I adored this work by Alexandra Almeida from cover to cover for its modern take on fantasy and the subversion of so many typical themes and ideas that have become tired and overdone in the genre.\" \"The queer storytelling elements are included beautifully and never made into a gimmick or overdone for the sake of themselves, and as such, they flow naturally with the fantasy and emotional elements of the narrative. I would not hesitate to recommend Unanimity as a sensational opening novel to a very promising series.\" Readers' Favorite, ★★★★★___________\"This book is best described as science fiction, but it is a disservice to categorize it strictly as such. Author Alexandra Almeida masterfully weaves the past and present together, creating a story rich in depth and tragedy that seems to bloom as you read it, while leaving plenty to explore in later installments. Despite its potentially worlds- shattering premise, Unanimity has a lot of heart and manages its multiple threads well, hiding so much richness in its details that it’s worth multiple readings.\" Independent Book Review___________\"Unanimity’s technology feels well-researched and thought out.Throughout the novel, readers get more and more of a view of both the complexity of the story world and the ideology behind the virtual reality system. Almeida does a great job of making everything about this story fully believable, as if this AI afterlife could happen in the real world in the near future.\" ​Chanticleer Book Reviews, ★★★★★___________\"Unanimity is especially recommended for those who like their sci-fi 'hard' and their stories complex and richly thought-provoking. One might thus think that the tale will prove weighty, but Alexandra Almeida adopts a spirited, lively voice that brings events to life right from the story's prologue.\" \"The resulting unusual blend of queer social inspection, hard sci-fi, mystery, psychological revelation, and the nature of consciousness and human endeavors when a software program consumes the world makes for a thoroughly engrossing tale. It's highly recommended for libraries looking for hard sci-fi that eschews outer space for inner world exploration. Ideally, book clubs will select Unanimity for its many discussion points, which range from special interests and AI reinventions of reality to Shadow's search for answers in a self-created world of personal demons that reaches out to embrace humanity itself.\" D. Donovan, Senior Reviewer, Midwest Book Review ___________\"A wildly original start to a sci-fi series, Unanimity by Alexandra Almeida is a full-on plunge into a virtual future, where the battle lines between fragile gods and tech titans have been violently drawn. A surreal story of creative evolution and the timeless struggle against fate, this intricately woven tale is intoxicatingly original, teasing the edges of reality and fiction. With a subtle storytelling style that is both immersive and patiently coy, Almeida has crafted an ambitious existential treat for fans of near-future sci-fi.\" SPR, ★★★★½",
  "genres": [
    "Science Fiction",
    "LGBT",
    "Romance",
    "Artificial Intelligence",
    "Virtual Reality",
    "Science Fiction Fantasy",
    "Fiction"
  ],
  "author": "Alexandra Almeida",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/62835573-unanimity"
}