{
  "title": "Becoming Free Indeed: My Story of Disentangling Faith from Fear",
  "description": "New York Times Bestseller Jinger Vuolo, the sixth child in the famous Duggar family of TLC's 19 Kids and Counting and Counting On , recounts how she began to question the unhealthy ideology of her youth and learned to embrace true freedom in Christ. When Jinger Duggar Vuolo was growing up, she was convinced that obeying the rules was the key to success and God's favor. She zealously promoted the Basic Life Principles of Bill Gothard,   Jinger, along with three of her sisters, wrote a New York Times bestseller about their religious convictions. She believed this level of commitment would guarantee God's blessing, even though in private she felt constant fear that she wasn't measuring up to the high standards demanded of her. In Becoming Free Indeed , Jinger shares how in her early twenties, a new family member—a brother-in-law who didn't grow up in the same tight-knit conservative circle as Jinger—caused her to examine her beliefs. He was committed to the Bible, but he didn't believe many of the things Jinger had always assumed were true. His influence, along with the help of a pastor named Jeremy Vuolo, caused Jinger to see that her life was built on rules, not God's Word. Jinger committed to studying the Bible—truly understanding it—for the first time. What resulted was an earth-shaking realization: much of what she'd always believed about God, obedience to His Word, and personal holiness wasn't in-line with what the Bible teaches. Now with a renewed faith of personal conviction, Becoming Free Indeed shares what it was like living under the tenants of Bill Gothard, the Biblical truth that changed her perspective, and how she disentangled her faith with her belief in Jesus intact.",
  "genres": [
    "Nonfiction",
    "Audiobook",
    "Memoir",
    "Christian",
    "Biography",
    "Religion",
    "Biography Memoir"
  ],
  "author": "Jinger Duggar Vuolo",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/62837289-becoming-free-indeed"
}