{
  "title": "Two for the Road",
  "description": "Note: This is the Canadian title and same book as GIGI, LISTENING in the USA. For readers of Emily Henry, Gail Honeyman and Josie Silver, a tender, funny and wise new novel about a romance bookshop owner who embarks on the adventure--or misadventure--of a lifetime in search of her own happily ever after.Sometimes there are detours on the road to love . . . Gigi Rutherford loves love stories. She reads them, she sells them at her romance bookstore, and she could spend hours imagining the meet-cutes of every couple she encounters. But beyond her shop's walls, Gigi is out of stock when it comes to her own love interests. And instead of enduring bad date after bad date, these days she'd rather curl up at home with her favourite audiobook and the only man that makes her heart skip a beat: Zane Wilkenson, the smooth-voiced narrator that Gigi is convinced is her soulmate.Then, she's presented with the chance of a lifetime: a ten-day bus tour through the hills of the English countryside, taking in the sights and sounds of a world an ocean away from her bookstore--all in the presence of Zane, the man of her dreams, in person, as he leads the tour.But things don't go as planned. When Gigi arrives at the bus terminal in London, Zane is nowhere to be found. Until he shows up, she's stuck with an eclectic group of fellow travellers she'd rather not be with on a long road trip: the recently widowed and chatty Charlotte; odd Francis, a walking Trivial Pursuit; Jenny, a true-crime-makeup YouTuber documenting every detail for her subscribers; and Sindhi and Roshi, a long-married couple that just can't stop bickering. And then there's the brooding bus driver, Taj, who Gigi finds infuriating but also incredibly alluring . . .With heart and charm, warmth and humour, Chantel Guertin explores the meaning of love and family--and how, sometimes, the journey to yourself is where you'll find everything you've been searching for.",
  "genres": [
    "Romance",
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Chick Lit",
    "Contemporary Romance",
    "Books About Books"
  ],
  "author": "Chantel Guertin",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/62855834-two-for-the-road"
}