{
  "title": "Dance of the Dryad",
  "description": "A crippled ballerina and a Special Forces cat shifter dance a dangerous and magical pas de deux, dodging assassins and discovering the undeniable attraction that sizzles between them.Could she really be his fated mate?Captain Dennis Palmer is auditioning for a spot in the infamous shifter mercenary company known as the Wraiths. His first assignment is to track down the Alpha female’s long-lost sister and make contact. The leads are slim, but he travels to Sacramento and the one link they have with the woman – a record of employment by a small dance studio.The ethereal woman Dennis spies through the window, teaching a class of adorable toddlers in pink tutus, captures his attention and stirs his cold heart. He’s not sure if she’s the woman he came to find, but he doesn’t care. He has to talk to her. He has to breathe in her scent and see if she could possibly be the one woman he never dared hope to find.Then, a sniper’s bullet breaks the studio’s giant plate glass window and he leaps into action.What is it about this mystery man that compels her so?Sunny doesn’t move like she used to. Her days as a prima ballerina are over due to a crippling car wreck the previous year. She’s only just able to get out and about on her own, taking on a teaching role for her friend who owns the dance studio. When a strange man appears after the window shatters, she doesn’t know what to think, but her instincts clamor at her to trust him.Why does she feel so safe with him? And why does she agree to see him again? She doesn’t understand her own instincts when it comes to this man, but there’s a tingle of magic about him that draws her like a moth to a flame. She has to find out more.Magic, danger, and mystery await, if she’s not much mistaken. Along with the adventure of a lifetime and a man that just might be the one to make her life complete… If she dares to try again.",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Shapeshifters",
    "Magic",
    "Paranormal Romance"
  ],
  "author": "Bianca D'Arc",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/62846419-dance-of-the-dryad"
}