{
  "title": "Living On: Portraits of Tennessee Survivors and Liberators",
  "description": "Living On is a documentary project that includes portraits of survivors, liberators, U. S. Army witnesses, hidden children, and refugees from the Holocaust now living in Tennessee. These individuals lived through one of the most catastrophic periods in human history. They are witnesses to horrific events that have defied human imagination, then and now. Their stories, faces, and voices provide separate testimony into how the unthinkable happened and how its consequences created a lasting impact that has relevance today.Each of these courageous individuals was willing to revisit painful memories, telling his or her story in hopes that history might never repeat itself. Through the accounts of Holocaust survivors and liberators included in this book, readers become witnesses to an important and frightening period when government leaders persecuted and killed ordinary citizens because of who they were. Their stories of strength and courage serve as a permanent reminder that nothing can ever extinguish the light of the human spirit.Through the Living On project, the Tennessee Holocaust Commission created a traveling exhibition of photographs and stories that became the basis of this book. Living On gives voice to storytellers whose ability to testify may soon be lost through age and frailty. Living On also offers readers and viewers the opportunity to meet fellow citizens through the medium of photographic portrait and biographical sketch when physical encounters prove impossible. The book stands as a powerful testament to human resiliency in spite of the efforts, inspired by fanatical race hatred, to eliminate the very faces and voices it captures.Living On is a project of the Tennessee Holocaust Commission. For moreinformation on the exhibit, please visit Robert Heller is an associate professor in the School of Journalism and Electronic Media at the University of Tennessee. He teaches photojournalism and graphic design and is the author of More Than the The Tennessee Football Experience.",
  "genres": [],
  "author": "Tennessee Holocaust Commission",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/6286164-living-on"
}