{
  "title": "Race, Politics, and Irish America: A Gothic History",
  "description": "Figures from the Scots-Irish Andrew Jackson to the Caribbean-Irish Rihanna, as well as literature, film, caricature, and beauty discourse, convey how the Irish racially transformed multiple in the slave-holding Caribbean, on America's frontiers and antebellum plantations, and along its eastern seaboard. This cultural history of race and centuries of Irishness in the Americas examines the forcibly transported Irish, the eighteenth-century Presbyterian Ulster-Scots, and post-1845 Famine immigrants. Their racial transformations are indicated by the designations they acquired in the 'Redlegs,' 'Scots-Irish,' and 'black Irish.' In literature by Fitzgerald, O'Neill, Mitchell, Glasgow, and Yerby (an African-American author of Scots-Irish heritage), the Irish are both colluders and victims within America's racial structure. Depictions range from Irish encounters with Native and African Americans to competition within America's immigrant hierarchy between 'Saxon'Scots-Irish and 'Celtic' Irish Catholic. Irish-connected presidents feature, but attention to queer and multiracial authors, public women, beauty professionals, and performers complicates the 'Irish whitening' narrative. Thus, 'Irish Princess' Grace Kelly's globally-broadcast ascent to royalty paves the way for 'America's royals,' the Kennedys. The presidencies of the Scots-Irish Jackson and Catholic-Irish Kennedy signalled their respective cohorts' assimilation. Since Gothic literature particularly expresses the complicity that attaining power ('whiteness') entails, subgenres named 'Scots-Irish Gothic' and 'Kennedy Gothic' are in Gothic by Brown, Poe, James, Faulkner, and Welty, the violence of the colonial Irish motherland is visited upon marginalized Americans, including, sometimes, other Irish groupings. History is Gothic in Irish-American narrative because the undead Irish past replays within America's contexts of race.",
  "genres": [
    "Nonfiction",
    "History",
    "American"
  ],
  "author": "Mary M Burke",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/62870982-race-politics-and-irish-america"
}