{
  "title": "Better Living Through Birding: Notes from a Black Man in the Natural World",
  "description": "NEW YORK TIMES BESTSELLER • Central Park birder Christian Cooper takes us beyond the viral video that shocked a nation and into a world of avian adventures, global excursions, and the unexpected lessons you can learn from a life spent looking up.\"Wondrous . . . captivating.”—Ed Yong, Pulitzer Prize–winning author of An Immense WorldChristian Cooper is a self-described “Blerd” (Black nerd), an avid comics fan and expert birder who devotes every spring to gazing upon the migratory birds that stop to rest in Central Park, just a subway ride away from where he lives in New York City. While in the park one morning in May 2020, Cooper was engaged in the birdwatching ritual that had been a part of his life since he was ten years old when what might have been a routine encounter with a dog walker exploded age-old racial tensions. Cooper’s viral video of the incident would send shock waves through the nation.In Better Living Through Birding , Cooper tells the story of his extraordinary life leading up to the now-infamous incident in Central Park and shows how a life spent looking up at the birds prepared him, in the most uncanny of ways, to be a gay, Black man in America today. From sharpened senses that work just as well at a protest as in a park to what a bird like the Common Grackle can teach us about self-acceptance, Better Living Through Birding exults in the pleasures of a life lived in pursuit of the natural world and invites you to discover them yourself.Equal parts memoir, travelogue, and primer on the art of birding, this is Cooper’s story of learning to claim and defend space for himself and others like him, from his days at Marvel Comics introducing the first gay storylines to vivid and life-changing birding expeditions through Africa, Australia, the Americas, and the Himalayas. Better Living Through Birding recounts Cooper’s journey through the wonderful world of birds and what they can teach us about life, if only we would look and listen.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Nature",
    "Audiobook",
    "Birds",
    "LGBT",
    "Biography"
  ],
  "author": "Christian Cooper",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/62850110-better-living-through-birding"
}