{
  "title": "Day of the Damned",
  "description": "Fueled with high-octane testosterone and noteworthy for a kill rate more customary in computer games than in works of literature, David Gunn’s novels take no prisoners and make no apologies. Like war itself, they are raw and violent, horrifying yet mysteriously moving. These qualities also characterize Gunn’s hero and narrator, Lt. Sven Tveskoeg, a killing machine whose DNA marks him as less–or perhaps more–than human. Whatever he is, he is always as enthralling as he is lethal.Sven has survived everything a hostile universe can throw at him. But he’d be the first to admit that it isn’t smarts that have kept him alive for so long. And it’s not luck, either. Because luck wouldn’t have seen him plucked out of obscurity to serve in the army of Emperor OctoV, a machine-human hybrid who appears to be a teenage boy but is actually immeasurably older. Maybe Sven has survived out of sheer orneriness–although his artificially intelligent, unmistakably sarcastic, and more or less sociopathic sidearm might argue otherwise–but Sven isn’t one to ponder such questions.In Day of the Damned, Sven and his band of misfit auxiliaries have arrived at Farlight, capital of the Octavian Empire, for a little well-earned rest and relaxation. Sven visits his old friends Debro and Anton, whom he liberated from the prison planet of Paradise, and their teenage daughter Aptitude, whose husband he assassinated and who now has a major crush on him.But what begins as a respite quickly turns into a bloodbath as civil war erupts. And behind the double crosses and Byzantine betrayals threatening to topple OctoV from the throne he has held for thousands of years are the United Free, a galaxy-spanning empire with the technology of gods and the morals of schoolchildren.As usual, big trouble seems to be following Sven. Which is all right with him. He isn’t that fond of vacations, anyway.",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Military Science Fiction",
    "Fiction",
    "Action",
    "Space Opera",
    "Space"
  ],
  "author": "David Gunn",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/6284446-day-of-the-damned"
}