{
  "title": "The Puck Bunny",
  "description": "a Boston Brawlers hockey romance spin-offSara“She’s just a puck bunny. Who cares?” some asshole says.I jump up from my seat because someone has to stand up for the girl.“I care,” I say, My voice is loud and every player at the table turns to me. I slide a glance at Quinn, but I look away before he notices and stare directly at the offending asshole. “Aren’t puck bunnies people too, with hearts and souls and feelings and who do you think you are to say that? You shouldn’t be mean to people, any people, just because you can get away with it. You just shouldn’t.”All the guys from the team at the table on my right stare at me. All the puck bunnies at the table on my left stare at me. And the beat of silence turns into two as I turn into a ball of seething embarrassment, the inferno heating my cheeks, no doubt to a bright red, as I try to shrink back and scramble out of my seat, slipping away from the two groups of stunned people with all kinds of judgment in their expressions.My eyes automatically slide back to Quinn, because I can't help myself, and I find him staring back at me. Duh. I’ve just made an outrageous spectacle of myself butting into a private matter so loudly and passionately that I feel dizzy. That’s the last time I drink tequila. My heart thunders in my chest as I meet his eyes.It takes another beat to register the expression on his face. He’s not scowling, he’s not shocked. No, he looks… pleased. Then he breaks the pause of shocked silence.“She has a point.” He smiles that famous one-dimpled smile at me and I stumble. Then he winks and I stop breathing.The clamor of voices starts up again and he gets swallowed up by conversation, his attention ripped away from me as suddenly as it came.Two things war in my head. First, I need to get out of here before I literally die of embarrassment or the asshole I dissed confronts me. Second, I need to get his attention back somehow, that sweet sexy smile of approval, because it felt like having the best sex ever minus the orgasm—but only because I’ve never actually had an orgasm so how would I know. Shit.I realize I want Quinn to be the one to take my orgasm virginity no matter how far-fetched a fantasy it is...The Puck Bunny, a Boston Brawlers Hockey Spin-off, is a funny and poignant romp where the shy girl gets her dream guy against all the odds, scoring big for her team which includes every secret Puck Bunny everywhere.(Warning: language and sex for a mature audience.)",
  "genres": [
    "Hockey",
    "Sports Romance",
    "Sports",
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Stephanie Queen",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/62848809-the-puck-bunny"
}