{
  "title": "Girls and Their Monsters: The Genain Quadruplets and the Making of Madness in America",
  "description": "For readers of Hidden Valley Road and Patient H.M., an \"intimate and compassionate portrait\" (Grace M. Cho) of the Genain quadruplets, the harrowing violence they experienced, and its psychological and political consequences, from the author of The Unfit Heiress. In 1954, researchers at the newly formed National Institute of Mental Health set out to study the genetics of schizophrenia. When they got word that four 24-year-old identical quadruplets in Lansing, Michigan, had all been diagnosed with the mental illness, they could hardly believe their ears. Here was incontrovertible proof of hereditary transmission and, thus, a chance to bring international fame to their fledgling institution. The case of the pseudonymous Genain quadruplets, they soon found, was hardly so straightforward. Contrary to fawning media portrayals of a picture-perfect Christian family, the sisters had endured the stuff of nightmares. Behind closed doors, their parents had taken shocking measures to preserve their innocence while sowing fears of sex and the outside world. In public, the quadruplets were treated as communal property, as townsfolk and members of the press had long ago projected their own paranoid fantasies about the rapidly diversifying American landscape onto the fair-skinned, ribbon-wearing quartet who danced and sang about Christopher Columbus. Even as the sisters' erratic behaviors became impossible to ignore and the NIMH whisked the women off for study, their sterling image did not falter. Girls and Their Monsters chronicles the extraordinary lives of the quadruplets and the lead psychologist who studied them, asking questions that speak directly to our times: How do delusions come to take root, both in individuals and in nations? Why does society profess to be \"saving the children\" when it readily exploits them? What are the authoritarian ends of innocence myths? And how do people, particularly those with serious mental illness, go on after enduring the unspeakable? Can the unbreakable bonds of sisterhood help the deeply wounded heal?",
  "genres": [
    "Nonfiction",
    "History",
    "Psychology",
    "Mental Health",
    "Biography",
    "Science",
    "Audiobook"
  ],
  "author": "Audrey Clare Farley",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/62874240-girls-and-their-monsters"
}