{
  "title": "The Broadview Anthology of British Literature Volume 6A: The Twentieth Century and Beyond: From 1900 to Mid Century",
  "description": "In all six of its volumes The Broadview Anthology of British Literature presents British literature in a truly distinctive light. Fully grounded in sound literary and historical scholarship, the anthology takes a fresh approach to many canonical authors, and includes a wide selection of work by lesser-known writers. The anthology also provides wide-ranging coverage of the worldwide connections of British literature, and it pays attention throughout to issues of race, gender, class, and sexual orientation. It includes comprehensive introductions to each period, providing in each case an overview of the historical and cultural as well as the literary background. It features accessible and engaging headnotes for all authors, extensive explanatory annotations throughout, and an unparalleled number of illustrations and contextual materials, offering additional perspectives both on individual texts and on larger social and cultural developments. Innovative, authoritative, and comprehensive, The Broadview Anthology of British Literature embodies a consistently fresh approach to the study of literature and literary history. The full Broadview Anthology of British Literature comprises six bound volumes, together with an extensive website component; the latter has been edited, annotated, and designed according to the same high standards as the bound book component of the anthology, and is accessible through the broadviewpress.com website by using the passcode obtained with the purchase of one or more of the bound volumes. Highlights of Volume 6: The Twentieth Century and Beyond Joseph Conrad’s “The Secret Sharer,” “An Outpost of Progress,” an essay on the Titanic, and a substantial range of background materials, including documents on the exploitation of central Africa that set “An Outpost of Progress” in vivid context; and a large selection of late twentieth and early twenty-first century writers such as Ian McEwan, Kazuo Ishiguro, and Zadie Smith. For the convenience of those whose focus does not extend to the full period covered in the final volume of The Broadview Anthology of British Literature (Volume 6: The Twentieth Century and Beyond ), that volume is now available either in its original one-volume format or in this alternative two-volume format, with Volume 6a ( The Early Twentieth Century ) extending to the end of WWII, and Volume 6b ( The Late Twentieth Century and Beyond ) covering from WWII into the present century.",
  "genres": [
    "Nonfiction",
    "Feminism"
  ],
  "author": "Joseph Laurence Black",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/6288213-the-broadview-anthology-of-british-literature-volume-6a"
}