{
  "title": "Das Akhenaten-Abenteuer",
  "description": "You can tell from the very first page that P. B. Kerr had great fun writing his novel, The Akhenaten Adventure. The way the author introduces his cleverly named characters, the atmospheric setting, the fun tone of his narration--all indicate that a hugely entertaining story is in store. The first installment of his Children of the Lamp sequence is set firmly in the present day, but it soon breaks away and encompasses several wonderfully colorful parts of the globe, England and Egypt included.  John and Philippa Gaunt, two twelve-year-old not-very-identical twins, live a privileged life on the Upper East of Manhattan with their wealthy parents and two curiously-mannered Rottweilers named Alan and Neil. The twins realize there's something amiss with their world when a string of strange things begin to happen after their wisdom teeth are extracted--they dream the same dreams, become stronger, their zits clear up, and wishes wished in their presence inexplicably come true. And, when their estranged Uncle Nimrod asks them to come to England for the summer during one such shared dream, the discovery of their destiny is set in motion.   John and Phillippa discover that they are descended from a long line of Djinn, have great inherent powers. They must call on these powers a lot sooner than they anticipated, though, because the ancient Egyptian pharaoh Akhenaten is not as dead as history has so far declared and his legion of seventy magical djinn could tip the balance of power in the magical realm and affect the whole world order.   P.B. Kerr, under his given name Philip Kerr, is the author of several bestselling thrillers for adult readers. His debut novel for children is a slick, zeitgeisty fantasy adventure that is sure to win him a new raft of fans. The Blue Djinn of Babylon is next up for those who get hooked. (Age 10 and over) --John McLay",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Middle Grade",
    "Fiction",
    "Adventure",
    "Childrens",
    "Magic"
  ],
  "author": "P.B. Kerr",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/6289192-das-akhenaten-abenteuer"
}