{
  "title": "Patras Kay Mazameen / پطرس کے مضامین",
  "description": "پطرس کے مضامین میں ظرافت عام رواج سے ہٹ کر ہے۔ اور اس کا آغاز مختصر دیباچے ہی سے ہوتا ہے: ”اگر یہ کتاب آپ کو کسی نے مفت بھیجی ہے تو مجھ پر احسان کیا ہے اگر آپ نے کہیں سے چرائی ہے تو میں آپ کے ذوق کی داد دیتا ہوں اپنے پیسوں سے خریدی ہے تو مجھے آپ سے ہمدردی ہے (یعنی آپ کی حماقت سے ہمدردی ہے) اب مصلحت یہی ہے (کہ آپ اپنی حماقت کونبا ہیں) اور اسے حق بجانب ثابت کریں“۔ نہ معلوم یہ حقیقت ہے یا میری شک بھری طبیعت کہ پطرس کے اظہار حقیقت کی تہ میں بھی ظرافت کی ایک لہر دوڑی ہوئی ہے کیونکہ اپنے استاد کی خدمت میں اعترافِ ممنونیت ان الفاظ میں کیاہے: ”اس کتاب پر نظر ثانی کی اور اسے بعض لغزشوں سے پاک کیا“ جس کا مفہوم میرے نزدیک اس کے سوا نہیں ہوسکتا کہ جہاں کوئی بات ہوش مندی کی دیکھی اسے حماقت میں بدل دیا۔ کتاب میں گیارہ مضامین ہیں جو بہ ظاہر ”ہولا خبطا پن“ کے شاہکار ہیں مگر فی الحقیقت سوسائٹی اور تمدن کی دکھتی رگوں کو چھوا ہے اور خامکاریوں اور سفیہانہ رواسم وتوہمات کا پردہ فاش کیا ہے۔ پطرس نے اپنا مطلب زیادہ تر مزاح میں طنز کی پُٹ دے کر نکالا ہے۔ بخلاف دیگر ظرافت نگاروں کے جو تمسخر کو آلہٴ کار بناتے ہیں۔ یہی وجہ ہے کہ ان کے مضامین میں باوجود اس احساس کے کہ ہم کو (اور معاف کیجئے گا آپ کو) بےدال کا بودم بنایا جا رہا ہے جھنجھلاہٹ کے بجائے گدگدانے کی ادا نکلتی ہے اور اسی کے ساتھ غو وتعمق کی دعوت ہوتی ہے۔ ان مضامین کے کاتب کو بھی ظرافت سے کافی بہرہ معلوم ہوتا ہے کیونکہ علاوہ دیگر مخترعات کے ”ہاسٹل میں پڑھنا“ کے عنوان کو ہر جگہ ”ہاسٹل پر پڑنا“بنا دیا ہے۔ مضمون میں ظرافت کی چاشنی پہلے ہی فقرے سے شروع ہے: ”ہم نے کالج میں تعلیم تو ضرور پائی اور رفتہ رفتہ بی اے بھی پاس کر لیا“۔ رفتہ رفتہ اور بھی کی معنویت دعوت نظر دیتی ہے آگے چل کر بی اے کے خانے اس خوبی سے گنوائے ہیں کہ بایدوشاید۔ مضمون میں ایسے خاندان کی ذہنیت کا خاکہ ہے جو مہذب اور اخلاق پسندیدہ کا مالک ہونے کے باوصف قدامت پسند ہے اور حال کو ماضی کے آئینہ میں مشتبہ نظروں سے دیکھتا ہے۔ لڑکے نے انٹرنس کا امتحان تیسرے درجے میں پاس کیا ہے تاہم خوشیاں منائی جا رہی ہیں دعوتیں ہو رہی ہیں۔ مٹھائی تقسیم کی جا رہی ہے۔ خاندان خوش حال ہے مگر باوجود استطاعت کے لڑکے کو مزید تعلیم حاصل کرنے کے لئے ولایت نہ بھیجنے کی معقول ترین وجہ یہ ہے کہ گردو نواح سے کسی کا لڑکا ابھی تک ولایت نہ گیا تھا“۔ بڑی ہمت کی تو لڑکے کو لاہور بھیج دیا مگرہاسٹل کے بجائے ایک ایسے اجنبی عزیز کے یہاں قیام کا فیصلہ کیا جاتا ہے جس سے رشتہ داری کی نوعیت معلوم کرنے کے لئےخاندانی شجرے کی ورق گردانی کرنا پڑتی ہے تاہم ہاسٹل پر اس کے گھر کو یہ کہہ کر ترجیح دی جاتی ہے کہ ”گھر پاکیزگی اور طہارت کا ایک کعبہ اور ہاسٹل گناہ ومعصیت کا دوزخ ہے“ ضمناً نفسیات کے اس پہلو پر روشنی پڑی کہ جذبات کو دبا کر تحت الشعور میں دھکیل دینا ان کو دُند مچانے کے لئے آزاد چھوڑ دینا اور ارتفاع میں مشکلیں حائل کرنایا ارتفاع سے محروم کر دینا ہے۔ پطرس کے الفاظ میں: ”اس سے تحصیل علم کا جو ایک ولولہ ہمارے دل میں اُٹھ رہا تھا وہ کچھ بیٹھ سا گیا۔ ہم نے سوچا ماموں لوگ (ماموں قسم کے لوگ؟) اپنی سرپرستی کے زعم میں والدین سے بھی زیادہ احتیاط برتیں گے۔ جس کا نتیجہ یہ ہوگا کہ ہمارے دماغی اور روحانی قوےٰ کو پھلنے پھولنے کا موقع نہ ملے گا اور تعلیم کا اصل مقصد فوت ہوجائے گا۔ چنانچہ وہی ہوا“۔ بعد ازاں اس ”وہی ہوا“ کی شرح ہے۔ امتحانات میں پےدر پے فیل ہونا، صلاحیتوں کی بےراہ روی اختیار کرنا۔ صاف گوئی اور راستبازی کاکج مج راستے اختیار کرنا۔ غسل خانے میں چھپ چھپ کر سگریٹ پینا۔ المختصر وہ آزادی وفراخی ووارفتگی نصیب نہ ہوئی جو تعلیم کا اصل مقصد ہے“۔ پطرس نے مسئلے کے اس پہلو کو ظریفانہ انداز میں اس حسن وخوبی سے وضاحت کی ہے کہ طبیعت عش عش کرتی ہے۔ تفصیل میں جانا مضمون کی لذتیت کو فنا کر دینا ہے۔ پڑھئے اور لطف اندوز ہوجائے۔ کتاب کا مقصد بھی غالباً فوت ہو جائے گا اس کے مضامین کی چیر پھاڑ کی گئی۔ کتاب انگریزی کے اس مقولے کی بہترین ترجمان ہے کہ مذاق کے پردے میں بہت سی سنجیدہ باتیں کہہ دی جاتی ہیں۔",
  "genres": [
    "Classics",
    "Pakistan",
    "Humor",
    "Fiction",
    "Short Stories",
    "Essays",
    "Literature"
  ],
  "author": "Patras Bukhari",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/6288716-patras-kay-mazameen"
}