{
  "title": "\"Cause Unknown\": The Epidemic of Sudden Deaths in 2021 & 2022",
  "description": "What is killing healthy young Americans? 2020 saw a spike in deaths in America, smaller than you might imagine during a pandemic, some of which could be attributed to COVID and to initial treatment strategies that were not effective. But then, in 2021, the stats people expected went off the rails. The CEO of the OneAmerica insurance company publicly disclosed that during the third and fourth quarters of 2021, death in people of working age (18–64) was 40 percent higher than it was before the pandemic. Significantly, the majority of the deaths were not attributed to COVID. A 40 percent increase in deaths is literally earth-shaking. Even a 10 percent increase in excess deaths would have been a 1-in-200-year event. But this was 40 percent. And therein lies a story—a story that starts with obvious questions:   It isn’t COVID, of course, because we know that COVID is not a significant cause of death in young people. Various stakeholders opine about what could be causing this epidemic of unexpected sudden deaths, but “CAUSE UNKNOWN” doesn’t opine or speculate. The facts just are, and the math just is. The book begins with a close look at the actual human reality behind the statistics, and when you see the people who are represented by the dry term Excess Mortality , it’s difficult to accept so many unexpected sudden deaths of young athletes, known to be the healthiest among us. Similarly, when lots of healthy teenagers and young adults die in their sleep without obvious reason, collapse and die on a family outing, or fall down dead while playing sports, that all by itself raises an immediate public health concern. Or at least it used to. Ask yourself if you recall seeing these kinds of things occurring during your own life—in junior high? In high school? In college? How many times in your life did you hear of a performer dropping dead on stage in mid-performance? Your own life experience and intuition will tell you that what you’re about to see is not normal.  Or at least it wasn’t normal before 2021 .",
  "genres": [
    "Health",
    "Nonfiction",
    "Science",
    "Politics",
    "History",
    "Conspiracy Theories",
    "Sociology"
  ],
  "author": "Ed Dowd",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/62879395-cause-unknown"
}