{
  "title": "Les Voleurs du Marsupilami",
  "description": "Nom : Spirou. Professions : groom au Moustic-Hôtel, puis coureur d'aventure. Age : né le 21 avril 1938 à Marcinelle (Belgique). Signes particuliers : vêtu d'un costume rouge à boutons dorés et coiffé d'un calot. Le jeune Spirou fait ses débuts dans la vie active au sein de l'hebdomadaire du même nom, sous le crayon du dessinateur français Rob-Vel. Détail amusant : en wallon, spirou signifie écureuil. Et dès 1939, il prend sous sa protection un petit écureuil baptisé Spip… Mais le mot désigne aussi un garçon plutôt vif et débrouillard. Tout le portrait de Spirou, justement. Très vite, d'ailleurs, il délaisse son métier d'origine pour se lancer dans la course à l'aventure, tellement plus palpitante. En 1943, Rob-Vel cède la place à Jijé, qui donne à Spirou un compagnon haut en couleurs, un certain Fantasio. Un phénomène, celui-ci. Esprit fantasque et bouillonnant, reporter et inventeur à ses heures, fumeur de pipe, volontiers gaffeur et infatigable râleur. Bref, une authentique personnalité. Trois ans plus tard, Jijé passe le relais à un jeune inconnu, André Franquin. Avec lui, Spirou va acquérir un statut de vedette de la bande dessinée. Franquin imagine toute une galerie de personnages secondaires savoureux. Des méchants inoubliables comme Zantafio - cousin et double maléfique de Fantasio - ou Zorglub. Des gentils plein de poésie, comme le délicieux Comte de Champignac - Hégésippe Adélard Ladislas de son prénom. Et, bien sûr, le génial Marsupilami. En 1968, Franquin passe la main. Différents auteurs se succèdent jusqu'au duo actuel, Tome et Janry, qui hérite de la série en 1981. Et qui anime en parallèle depuis 1987 les délicieuses frasques de jeunesse du Petit Spirou. Et puis, en 1998, coup de théâtre. Dans Machine qui rêve, Spirou range au placard sa tenue de groom. Tome et Janry décident de traiter le personnage de manière réaliste. Le résultat est surprenant. A soixante ans, l'ex-garçon d'hôtel retrouve une seconde jeunesse et démarre une nouvelle vie… --Gilbert Jacques",
  "genres": [
    "Comics",
    "Bande Dessinée",
    "Fiction",
    "Humor",
    "Comic Book",
    "Graphic Novels",
    "Graphic Novels Comics"
  ],
  "author": "André Franquin",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/628741.Les_Voleurs_du_Marsupilami"
}