{
  "title": "The Last Fallen Realm",
  "description": "Best-selling author Rick Riordan presents the thrilling conclusion to Graci Kim's best-selling Gifted Clans trilogy.Riley Oh wasn’t born into her family. Instead, as she recently discovered, she tumbled down to the earth many years ago as the last fallen star. Riley Oh also wasn’t born to be a witch. Like, at all—even her status as a divine celestial being comes with zilch in the magical powers department. And Riley Oh definitely wasn’t born to be a leader. But now the entire magical community thinks she and her soul-twin, Dahl, are meant to lead the world into the Age of the Final Eclipse (or whatever it is that the Haetae keeps saying they’re “destined” to do). Greeeat. But ever since Riley killed the Cave Bear Goddess, she’s been a bit pre-occupied with one thing: waiting for the goddess’s sisters to get their revenge. And it looks like her wait is finally over—because as witches from around the world prepare for war, it seems as though the goddesses are preparing for something much worse. Something that will lure Riley and her friends deep into the realm of the gods. Into a world of humongous, talking moon bunnies; life-or-death mini-golf competitions; and…magical gummy candies? And in order to save the world, Riley must do the one thing she was born to do: believe in herself.Endorsed by Rick Riordan, author of Percy Jackson and the Olympians, soon to be a series on Disney+.Complete your middle grade collection with these best-selling fan favorites:Rick Riordan Presents Aru Shah and the End of Time by Roshani ChokshiRick Riordan Presents Tristan Strong Punches a Hole in the Sky by Kwame MbaliaRick Riordan Presents City of the Plague God by Sarwat ChaddaThe Trials of Apollo series by Rick Riordan",
  "genres": [
    "Fantasy",
    "Mythology",
    "Middle Grade",
    "Fiction",
    "Audiobook",
    "Young Adult",
    "Adventure"
  ],
  "author": "Graci Kim",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/62874126-the-last-fallen-realm"
}