{
  "title": "Unexpected Christmas",
  "description": "'Tis the Season for a Second Chance to Seduce the Hot Mechanic...Jake Henderson and I spent some long, hot days together, stealing kisses behind his dad’s auto shop. But the summer ended, and he broke my heart–I packed up the pieces and left town, vowing he’d never hurt me again.When I come home for the holidays twelve years later and get paired up with Jake on a local Christmas event, I feel like the universe is pranking me. I might be the youngest female ad executive in my company, but he makes me feel like the shy, awkward girl I used to be. It takes all my newfound bravado to act like his rejection meant nothing.But spending time with Jake brings out unexpected feelings, ones that pull on my heart. He's kind to his mother, helps the town bring Santa to life, and makes me breathless on the hood of his restored muscle car.I have a life to get back to, one where Jake is just a memory. But I can't ignore this unexpected gift.I wasn't looking for love this Christmas, but it looks like it found me.***Polish your jingle bells, strategically hang the mistletoe, and get ready to claim your spot on The Naughty List. This holiday season, fourteen of your favorite authors are spicing up the cocoa and taking advantage of those long winter nights, proving that sometimes it’s more fun to claim your coal than it is to stay on Santa’s good side. After all, well-behaved women might make the nice list, but naughty ones have all the fun…Wood Girl Gone Bad by Mae HardenOwned By Santa by Imani JayStuck Under the Mistletoe by Georgia CoffmanLovestruck by Julia JarrettSecret Santa Surprise by Tamrin BanksChecking It Twice by Claire HastingsFalling for the Grinch by Amy AlvesUnexpected Christmas by Eliza PeakeSleighed by Em TorreyNailed by Claire WilderEntry Level by Bella MichaelsRockin' Around the Christmas Tree by Breanna LynnTwo Pink Lines for Christmas by Ember DavisRun Run Rudolph by Chelle Sloan",
  "genres": [
    "Second Chance",
    "Christmas",
    "Holiday",
    "Novella",
    "Contemporary",
    "Romance",
    "Friends To Lovers"
  ],
  "author": "Eliza Peake",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/62894390-unexpected-christmas"
}