{
  "title": "The New York Years: Stories by Felice Picano",
  "description": "An Slashed To Ribbons in Defense of Love \"It's about time you decided to wake up! We have a brunch at one o'clock, as you very well know.\" Gary was up, dressed, sitting across the room sipping coffee and smoking a cigarillo. He'd been the Sunday Times sat unopened on a nearby chair. \"It's almost twelve now. A cab will take at least fifteen minutes. If we can find one. Go shower. You know you take forever in there.\" Behind Gary's head, sunlight came in through the skylighted dressing room and pushed through the flecked fibers of the shoji-screen. Spence could see the gold flecking on the rice paper very clearly today. The undulating fields of lacquered flowers were backlighted--bright as persimmons--Gary's face was in shadow. \"I want you to know beforehand that this brunch is extremely important to me. Arnie has invited Seitelman, the Oriental Art expert. I've been trying to get near him for months. I want him to come look at those Monoyamo scrolls I picked up last month.\" Gary exhaled blue smoke. It floated into the sunlight, turned grey then yellow then grey again. He exhaled again and a second cloud rose to meet the first in a billow. It spread thinly, forming a tiny tornado around the head of the smiling Shinto statue precariously perched on a wall shelf. The Shinto idol kept smiling; it never seemed to notice the smoke descend again and form a flat halo directly over Gary's head. Spence noticed though. He laughed. \"I'm not kidding, Spence. Arnie's gone to a lot of trouble to get Seitelman. And it will take a lot of tact to keep him there. So I don't want any interference from you. Is that clear?\" Gary exhaled forcefully and broke the halo. He began picking at the edge of the cup he was drinking from as though it were crusted with something. It was his favorite china--from the Northern Sung--and invaluable. Spence never touched it. He only used china that could be or thrown. Gary frowned. Spence turned over in bed. \"As soon as you've met him, go to the other end of the room or table or wherever we are. And stay there. And, Spence, do try to keep your pin-sized knowledge of art to yourself. No one is interested, I assure you.\" If Gary weren't dre",
  "genres": [
    "LGBT",
    "Queer"
  ],
  "author": "Felice Picano",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/628862.The_New_York_Years"
}