{
  "title": "The Island",
  "description": "From the New York Times bestselling author of The Chain comes a pulse-pounding thriller about a family that must face their darkest fears--and deepest secrets--when they go on the run for their lives. INSTANT NEW YORK TIMES BESTSELLER · A NEW YORK TIMES \"BEST THRILLER OF 2022\"\"Unrelenting suspense.\" —Stephen King“Extraordinary.” — T. J. Newman, New York Times bestselling author of Falling\"You'll never go on vacation the same way again.\" —Don Winslow, New York Time s bestselling author of City On FireIT WAS JUST SUPPOSED TO BE A FAMILY VACATION.A TERRIBLE ACCIDENT CHANGED EVERYTHING.YOU DON'T KNOW WHAT YOU'RE CAPABLE OF UNTIL THEY COME FOR YOUR FAMILY.After moving from a small country town to Seattle, Heather Baxter marries Tom, a widowed doctor with a young son and teenage daughter. A working vacation overseas seems like the perfect way to bring the new family together, but once they’re deep in the Australian outback, the jet-lagged and exhausted kids are so over their new mom.When they discover remote Dutch Island, off-limits to outside visitors, the family talks their way onto the ferry, taking a chance on an adventure far from the reach of iPhones and Instagram.But as soon as they set foot on the island, which is run by a tightly knit clan of locals, everything feels wrong. Then a shocking accident propels the Baxters from an unsettling situation into an absolute nightmare. When Heather and the kids are separated from Tom, they are forced to escape alone, seconds ahead of their pursuers.Now it’s up to Heather to save herself and the kids, even though they don’t trust her, the harsh bushland is filled with danger, and the locals want her dead.Heather has been underestimated her entire life, but she knows that only she can bring her family home again and become the mother the children desperately need, even if it means doing the unthinkable to keep them all alive.SOON TO BE A HULU ORIGINAL SERIES“Gripping and unpredictable. No one does high-stakes tension like McKinty . . . Prepare to be hooked.” —Sarah Pearse “A haunting masterpiece.” — Steve Cavanagh “McKinty has written another irresistible and pulse-pounding thriller about the surprising places evil hides and just how far we’ll go for those we love.” —Karin Slaughter",
  "genres": [
    "Thriller",
    "Horror",
    "Fiction",
    "Mystery Thriller",
    "Mystery",
    "Audiobook",
    "Suspense"
  ],
  "author": "Adrian McKinty",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/62874037-the-island"
}