{
  "title": "Goddesses and Heroines: Meet More Than 80 Legendary Women From Around the World",
  "description": "A beautifully illustrated collection of profiles of more than 80 goddesses and other powerful women retold for children aged 7-9.Delve into a world of key female figures from all over the world in this thrilling compendium of goddesses and heroines. With more than 30 stories about goddesses and powerful women, this is a must-have introduction for young readers interested in female figures from different cultures.This collection of tales for children aged 7-9 includes stories like how Japanese goddess of the dawn Ame-no-Uzume saved the day by dancing and how ancient Greek witch Medea helped to defeat a dragon. The enthralling stories introduce famous figures from around the world, while a handy reference section is packed with information about the goddesses and heroines themselves. Perfect for children aged 7 to 9, this collection contains more than 30 beloved stories retold by award-winning author Dr Jean Menzies, with striking illustrations bringing the tales to life.This book on goddesses for children - Over 80 profiles of women in mythology, covering famous classics and lesser-known stories.- Striking illustrations by multi-award-winning artist Katie Ponder.- A handy pronunciation guide listing all difficult-to-pronounce names for the reader's convenience.- Stunning gold foil on the cover, making it a wonderful gift for children into mythology.- More than 30 stories, combining the appeal of a story collection with key reference information.It's time to dive into the underworld of powerful women from religion and myth, from famous figures such as the warrior Mulan, to lesser-known characters like the ancient Greek queen Alcestis. Goddesses and Heriones brings the world of legendary women to life and is the perfect gift for children who love history and mythology.At DK, we believe in the power of discovery.So why not complete the collection!Discover the secrets of the pharohs tombs with Egyptian Myths , read extraordinary stories from Ancient Greece with Greek Myths, and uncover action-packed tales of extraordinary creatures and compelling gods, goddesses and more with Norse Myths.",
  "genres": [
    "Mythology",
    "Nonfiction",
    "History",
    "Childrens",
    "Middle Grade",
    "Picture Books",
    "Greek Mythology"
  ],
  "author": "Jean Menzies",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/62897395-goddesses-and-heroines"
}