{
  "title": "Nuestra parte de noche",
  "description": "El legado, el deseo de vivir, la paternidad, el horror, lo íntimo y lo político. El terror sobrenatural se entrelaza con terrores muy reales en esta osada y perturbadora novela. Un padre y su hijo atraviesan Argentina por carretera, desde Buenos Aires hacia las cataratas de Iguazú, en la frontera norte con Brasil. Son los años de la junta militar, hay controles de soldados armados y tensión en el ambiente. El padre de Gaspar trata de protegerlo del destino que le ha sido asignado después de que su madre muriese en circunstancias poco claras; en un accidente que acaso no lo fue. Como su padre, Gaspar está llamado a ser un médium en una sociedad secreta, la Orden, que contacta con la Oscuridad en busca de la vida eterna mediante atroces rituales. Para ellos es vital disponer de un médium, pero el destino de estos seres dotados de poderes especiales es cruel, y el desgaste físico y mental es rápido e implacable. Los orígenes de la Orden, regida por la poderosa familia de la madre de Gaspar, se remontan a siglos atrás, cuando el conocimiento de la Oscuridad llegó desde el corazón de África a Inglaterra y desde allí se extendió hasta Argentina. El lector emprenderá un viaje entre la represión de la dictadura militar argentina y el Londres psicodélico de los años sesenta, donde la madre de Gaspar conoció a un joven cantante de aire andrógino llamado David; descubrirá casas cuyo interior muta, pasadizos que esconden monstruos inimaginables, rituales con fieros sacrificios humanos, enigmáticas liturgias sexuales y la carga de una herencia atroz. \"Mariana Enríquez es una escritora fascinante que exige ser leída. Como a Bolaño, le interesan las cuestiones de la vida y la muerte; su ficción nos impacta con la fuerza de un tren de carga”.-Dave Eggers “Una narradora oscura, minuciosa, terrible y cautivadora”. –Javier Calvo “Leer a Enríquez es una experiencia dura, emocionante. Sus historias no son tranquilizantes. Es una maestra de lo macabro que no apela a emociones baratas, sino que cada pequeño detalle de oscuridad está allí por una razón y cada una de sus historias contiene una carga política”. –Anne Meadows, Granta “Mariana Enríquez muestra todo y lo muestra con morbo. Ilumina con luz intermitente de velas las zonas más oscuras de la literatura argentina”. --Violeta Gorodischer, La Nación \"Su novela más ambiciosa y brillante El lector agradece una convivencia de alta intensidad durante casi 700 páginas\". - Carlos Pardo, El País - Babelia \"Hacía tiempo que un autor contemporáneo no lograba “engancharme” como lo hicieron estas casi setecientas páginas... Enriquez ha escrito un novelón inabandonable\". - Nadal Suau, El Mundo – El Cultural \"El estilo de Enríquez es increíblemente elegante, a ratos parece que escriba con guantes caros. Describe de forma minuciosa (como el mejor cirujano, se maneja con una naturalidad pasmosa entre sangre, vísceras y cicatrices) y su prosa hipnotiza y cautiva de un modo aterrador. Es inevitable pensar en Stephen King y Shirley Jackson al leerla, pero también en Drácula o Emily Dickinson\". - Leticia Blanco, La Esfera de Papel, El Mundo \"Una novela tan ambiciosa como tenebrosa que me ha atrapado\". - Sergio Vila-Sanjuán, La Vanguardia - Cultura/s \"Con un caudal imaginativo poderoso, Nuestra parte de noche se erige en unasumma de arquetipos que no se pliega a la literatura de género y que se cierra sobre sí misma en una página final\".",
  "genres": [
    "Horror",
    "Fiction",
    "Fantasy",
    "Historical Fiction",
    "LGBT",
    "Queer",
    "Audiobook"
  ],
  "author": "Mariana Enríquez",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/62910648-nuestra-parte-de-noche"
}