{
  "title": "Arthas: Rise of the Lich King",
  "description": "Frostmourne. It was caught in a hovering, jagged chunk of ice, the runes that ran the length of its blade glowing a cool blue. Below it was a dais of some sort, standing on a large gently raised mound that was covered in a dusting of snow. A soft light, coming from somewhere high above where the cavern was open to daylight, shone down on the runeblade. The icy prison hid some details of the sword's shape and form, exaggerated others. It was revealed and concealed at the same time, and all the more tempting, like a new lover imperfectly glimpsed through a gauzy curtain. Arthas knew the blade -- it was the selfsame sword he had seen in his dream when he first arrived. The sword that had not killed Invincible, but that had brought him back healed and healthy. He'd thought it a good omen then, but now he knew it was a true sign. This was what he had come to find. This sword would change everything. Arthas stared raptly at it, his hands almost physically aching to grasp it, his fingers to wrap themselves around the hilt, his arms to feel the weapon swinging smoothly in the blow that would end Mal'Ganis, end the torment he had visited upon the people of Lordaeron, end this lust for revenge. Drawn, he stepped forward.The uncanny elemental spirit drew its icy sword. \"Turn away, before it is too late,\" it intoned. * * *His evil is legend. Lord of the undead Scourge, wielder of the runeblade Frostmourne, and enemy of the free peoples of Azeroth. The Lich King is an entity of incalculable power and unparalleled malice -- his icy soul utterly consumed by his plans to destroy all life on the World of Warcraft.But it was not always so. Long before his soul was fused with that of the orc shaman Ner'zhul, the Lich King was Arthas Menethil, crown prince of Lordaeron and faithful paladin of the Silver Hand.When a plague of undeath threatened all that he loved, Arthas was driven to pursue an ill-fated quest for a runeblade powerful enough to save his homeland. Yet the object of his search would exact a heavy price from its new master, beginning a horrifying descent into damnation. Arthas's path would lead him through the arctic northern wastes toward the Frozen Throne, where he would face, at long last, the darkest of destinies.",
  "genres": [
    "Fantasy",
    "Warcraft",
    "World Of Warcraft",
    "Fiction",
    "Gaming",
    "Video Games",
    "Games"
  ],
  "author": "Christie Golden",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/6290885-arthas"
}