{
  "title": "Unearthing: A Story of Tangled Love and Family Secrets",
  "description": "An unforgettable memoir about a family secret revealed by a DNA test, the lessons learned in its aftermath, and the indelible power of love—for readers of Dani Shapiro’s Inheritance and Katherine May’s Wintering.\n “Magnificent...I will never forget it.” —Dani Shapiro, author of Inheritance  “A mind-altering and supremely generous exploration of kinship, selfhood, memory, and the roots we share across time, space and species.” —Naomi Klein, author of \nThis Changes Everything\nThree months after Kyo Maclear’s father dies in December 2018, she gets the results of a DNA test showing that she and the father who raised her are not biologically related. Suddenly Maclear becomes a detective in her own life, unravelling a family mystery piece by piece, and assembling the story of her biological father. Along the way, larger questions arise: what exactly is kinship? And what does it mean to be a family? Unearthing is a captivating and propulsive story of inheritance that goes beyond heredity. Infused with moments of suspense, it is also a thoughtful reflection on race, lineage, and our cultural fixation on recreational genetics. Readers of Michelle Zauner’s bestseller Crying in H Mart will recognize Maclear’s unflinching insights on grief and loyalty, and keen perceptions into the relationship between mothers and daughters. What gets planted, and what gets buried? What role does storytelling play in unearthing the past and making sense of a life? Can the humble act of tending a garden provide common ground for an inquisitive daughter and her complicated mother? As it seeks to answer these questions, Unearthing bursts with the very love it seeks to understand.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Canada",
    "Biography",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Kyo Maclear",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/62918472-unearthing"
}