{
  "title": "A Quilter's Holiday",
  "description": "For the Elm Creek Quilters, the day after Thanksgiving marks the start of the quilting season, a time to gather at Elm Creek Manor and spend the day stitching holiday gifts for loved ones. This year, in keeping with the season's spirit of gratitude, Master Quilter Sylvia Bergstrom Compson Cooper is eager to revive a cherished family tradition. A recent remodeling of the manor's kitchen unearthed a cornucopia that once served as the centerpiece of the Bergstrom family's holiday table. Into it, each Bergstrom would place an object that symbolized something he or she was especially thankful for that year. On this quilter's holiday, Sylvia has invited her friends to continue the tradition by sewing quilt blocks that represent their thankfulness and gratitude.As each quilter explains the significance of her carefully chosen block, stories of love and longing for family and friends emerge -- feelings that are also expressed in the gifts they work on throughout the day. Diane is thankful for her two sons, who've outgrown their youthful troubles to become fine young men, but she wishes they revered their family's traditions as much as she does. Anna, in her first holiday season as an Elm Creek Quilter, creates a quilt for her best friend even as she begins to question her feelings for him, which may have grown beyond friendship. Sylvia reflects upon holidays past spent with her beloved, long-lost cousin Elizabeth and wonders whatever became of her. Sarah, pregnant with twins, determinedly sews a Christmas gift for her father-in-law, whose persistent suggestions that her husband, Matt, come to work for his construction company have created tension in their marriage. And as Gretchen pieces a quilt for a charity she has not yet chosen and Gwen completes a project begun by her graduate school mentor, both women lend their talents to those in need.As an early winter storm blankets Elm Creek Manor in heavy snow, the quilters find new meanings in their best-loved traditions and new reasons to be thankful. A Quilter's Holiday is a story of holiday spirit, in its truest, most generous sense.",
  "genres": [
    "Fiction",
    "Christmas",
    "Quilting",
    "Chick Lit",
    "Holiday",
    "Historical Fiction",
    "Contemporary"
  ],
  "author": "Jennifer Chiaverini",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/6289665-a-quilter-s-holiday"
}