{
  "title": "Deck the Headlines",
  "description": "She swore she’d never go back to her hometown. He can’t get enough of its wacky charm. Thrown together chasing headlines, will the sparks flying between them turn into love?Recently graduated journalist Ella Danforth is right where she wants to be…FAR away from her hometown of Hope Island, WA. But in a single morning, she loses everything. Before sundown she finds herself home for the first time in four years to reluctantly take up the recently (and mysteriously) available post of Editor in Chief for the local paper: The Hope Hornblower. And who does she find in her way? Cal Dickson, a jaded New Yorker fleeing a billionaire merger marriage back home and hoping to get the top job himself. The sparks turn to flames as they’re forced together to tackle the “Hellidays”: a month-long smorgasbord of wacky, holiday events designed to titillate tourists ranging from midnight fruitcake fights to a semi-erotic holiday cookie decorating contests complete with themed mimosas!Each day they get closer to Christmas Eve, the temperature keeps rising. But will their mutually painful pasts conspire to douse the flames of love? Deck the Headlines is a small town enemies-to-lovers holiday romantic comedy with new adult aged, nerdy MCs that will have you laughing out loud, tearing up, and always wanting more from this hilarious, island community.This extended length third person novel contains profanity and is not a clean romance. It is a plot-focused, emotional slowburn HEA with realistic characters and no instalove. The MMC is a green flag / cinnamon roll hero. While part of the Hope Island Holiday Romance series, it can be read as a stand alone, and has no cliffhanger.Join the wacky residents of Hope Island today and dive into this first book in the Hope Island Holiday Romances.",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Contemporary",
    "Enemies To Lovers",
    "Chick Lit",
    "Fiction"
  ],
  "author": "Teagan Hart",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/62916418-deck-the-headlines"
}