{
  "title": "Lady Tan’s Circle of Women",
  "description": "An immersive historical novel inspired by the true story of a woman physician in 15th-century China.According to Confucius, “an educated woman is a worthless woman,” but Tan Yunxian—born into an elite family, yet haunted by death, separations, and loneliness—is being raised by her grandparents to be of use. Her grandmother is one of only a handful of female doctors in China, and she teaches Yunxian the pillars of Chinese medicine, the Four Examinations—looking, listening, touching, and asking—something a man can never do with a female patient.From a young age, Yunxian learns about women’s illnesses, many of which relate to childbearing, alongside a young midwife-in-training, Meiling. The two girls find fast friendship and a mutual purpose—despite the prohibition that a doctor should never touch blood while a midwife comes in frequent contact with it—and they vow to be forever friends, sharing in each other’s joys and struggles. No mud, no lotus , they tell from adversity beauty can bloom.But when Yunxian is sent into an arranged marriage, her mother-in-law forbids her from seeing Meiling and from helping the women and girls in the household. Yunxian is to act like a proper wife—embroider bound-foot slippers, recite poetry, give birth to sons, and stay forever within the walls of the family compound, the Garden of Fragrant Delights.How might a woman like Yunxian break free of these traditions and lead a life of such importance that many of her remedies are still used five centuries later? How might the power of friendship support or complicate these efforts? A captivating story of women helping each other, Lady Tan’s Circle of Women is a triumphant reimagining of the life of one person who was remarkable in the Ming dynasty and would be considered remarkable today.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Audiobook",
    "China",
    "Asia"
  ],
  "author": "Lisa See",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/62919732-lady-tan-s-circle-of-women"
}