{
  "title": "What the Taliban Told Me",
  "description": "A powerful, timely memoir of a young Air Force linguist coming-of-age in a war that is lost.When Ian Fritz joined the Air Force at eighteen, he did so out of necessity. He hadn’t been accepted into college thanks to an indifferent high school career. He’d too often slept through his classes as he worked long hours at a Chinese restaurant to help pay the bills for his trailer-dwelling family in Lake City, Florida.But the Air Force recognizes his potential and sends him to the elite Defense Language Institute in Monterey, California, to learn Dari and Pashto, the main languages of Afghanistan. By 2011, Fritz was an airborne cryptologic linguist and one of only a tiny number of people in the world trained to do this job on low-flying gunships. He monitors communications on the ground and determines in real time which Afghans are Taliban and which are innocent civilians. This eavesdropping is critical to supporting Special Forces units on the ground, but there is no training to counter the emotional complexity that develops as you listen to people’s most intimate conversations. Over the course of two tours, Fritz listens to the Taliban for hundreds of hours, all over the country night and day, in moments of peace and in the middle of battle. What he hears teaches him about the people of Afghanistan—Taliban and otherwise—the war, and himself. Fritz’s fluency is his greatest asset to the military, yet it becomes the greatest liability to his own commitment to the cause.Both proud of his service and in despair that he is instrumental in destroying the voices that he hears, What the Taliban Told Me is a brilliant, intimate coming-of-age memoir and a reckoning with our twenty years of war in Afghanistan.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "War",
    "Military Fiction",
    "Audiobook",
    "Politics",
    "History"
  ],
  "author": "Ian Fritz",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/62919386-what-the-taliban-told-me"
}