{
  "title": "Harold",
  "description": "A uniquely humorous and deeply profound novel from a legendary stand-up comedian that follows the thoughts of a 1960s third grader during a single day at school.Steven Wright is one of the most significant and influential stand-up comedians in history. Rolling Stone ranked him fifteenth on their “50 Best Stand-ups of All Time” list, while the New York Times has written of his enduring “If you made a family tree of modern stand-up, he would top one of the few major and expanding branches. The children of Mr. Wright pack the comedy scene today.” Now comes his first novel, which is sure to be unlike anything you’ve ever read.From the outside, Harold is an average seven-year-old third grader growing up in the 1960s. Bored by school. Crushing on a girl. Likes movies and baseball—especially the hometown Boston Red Sox. Enjoys spending time with his grandfather. But inside Harold’s mind, things are a lot more complex and unusual. His thoughts come to him as birds flying through a small rectangle in the middle of his brain. He visits an outdoor cafe on the moon and is invited aboard a spaceship by famed astronomer Carl Sagan. He envisions his own funeral procession and wonders if the driver of the hearse has even been born yet.Harold documents the meandering, surreal, often hilarious, and always thought-provoking stream-of-consciousness ruminations of the title character during a single day in class. Saturated with the witticisms and profundities for which Wright’s groundbreaking stand-up has long been venerated, this novel will change the way you perceive your daily existence. To quote one of its many memorable “Everything doesn’t have to make sense. Just look at the world and your life.”",
  "genres": [
    "Fiction",
    "Humor",
    "Audiobook",
    "Comedy",
    "Historical Fiction",
    "Novels",
    "Contemporary"
  ],
  "author": "Steven Wright",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/62919437-harold"
}