{
  "title": "End Times: Elites, Counter-Elites, and the Path of Political Disintegration",
  "description": "“Peter Turchin brings science to history. Some like it and some prefer their history plain. But everyone needs to pay attention to the well-informed, convincing and terrifying analysis in this book.” —Angus Deaton, winner of the Nobel Prize in EconomicsFrom the pioneering co-founder of cliodynamics, the groundbreaking new interdisciplinary science of history, a big-picture explanation for America's civil strife and its possible endgamesPeter Turchin, one of the most interesting social scientists of our age, has infused the study of history with approaches and insights from other fields for more than a quarter century. End Times is the culmination of his work to understand what causes political communities to cohere and what causes them to fall apart, as applied to the current turmoil within the United States. Back in 2010, when Nature magazine asked leading scientists to provide a ten-year forecast, Turchin used his models to predict that America was in a spiral of social disintegration that would lead to a breakdown in the political order circa 2020. The years since have proved his prediction more and more accurate, and End Times reveals why.The lessons of world history are clear, Turchin When the equilibrium between ruling elites and the majority tips too far in favor of elites, political instability is all but inevitable. As income inequality surges and prosperity flows disproportionately into the hands of the elites, the common people suffer, and society-wide efforts to become an elite grow ever more frenzied. He calls this process the wealth pump; it’s a world of the damned and the saved. And since the number of such positions remains relatively fixed, the overproduction of elites inevitably leads to frustrated elite aspirants, who harness popular resentment to turn against the established order. Turchin’s models show that when this state has been reached, societies become locked in a death spiral it's very hard to exit.In America, the wealth pump has been operating full blast for two generations. As cliodynamics shows us, our current cycle of elite overproduction and popular immiseration is far along the path to violent political rupture.  That is only one possible end time, and the choice is up to us, but the hour grows late.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Economics",
    "Sociology",
    "Philosophy",
    "Society"
  ],
  "author": "Peter Turchin",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/62926960-end-times"
}