{
  "title": "My Name Is Iris",
  "description": "Brando Skyhorse, the PEN/Hemingway Award—winning author of The Madonnas of Echo Park, returns with a riveting literary dystopian novel set in a near-future America where mandatory identification wristbands make second-generation immigrants into second-class citizens—a powerful family saga for readers of Mohsin Hamid's Exit West and Rumaan Alam's Leave the World Behind. Iris Prince is starting over. After years of drifting apart, she and her husband are going through a surprisingly drama-free divorce. She's moved to a new house in a new neighborhood, and has plans for gardening, coffee clubs, and spending more time with her nine-year-old daughter Melanie. It feels like her life is finally exactly what she wants it to be. Then, one beautiful morning, she looks outside her kitchen window—and sees that a wall has appeared in her front yard overnight. Where did it come from? What does it mean? And why does it seem to keep growing? Meanwhile, a Silicon Valley startup has launched a high-tech wrist wearable called \"the Band.\" Pitched as a convenient, eco-friendly tool to help track local utilities and replace driver's licenses and IDs, the Band is available only to those who can prove parental citizenship. Suddenly, Iris, a proud second-generation Mexican-American, is now of \"unverifiable origin,\" unable to prove who she is, or where she, and her undocumented loved ones, belong. Amid a climate of fear and hate-fueled violence, Iris must confront how far she'll go to protect what matters to her most. My Name Is Iris is an all-too-possible story about family, intolerance, and hope, offering a brilliant and timely look at one woman's journey to discover who she can't—and can—be.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Dystopia",
    "Fantasy",
    "Magical Realism",
    "Speculative Fiction",
    "Literary Fiction"
  ],
  "author": "Brando Skyhorse",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/62919813-my-name-is-iris"
}