{
  "title": "The Late Mrs. Willoughby",
  "description": "The suspenseful sequel to The Murder of Mr. Wickham, which sees Jonathan Darcy and Juliet Tilney reunited, and with another mystery to solve: the dreadful poisoning of the scoundrel Willoughby's new wife.“An absolute page-turner full of well-plotted mystery and hints of simmering romance. . . . More of the Jane Austen characters we love (as well as those we love to hate).” —Mia P. Manansala, author of Arsenic and AdoboCatherine and Henry Tilney of Northanger Abbey are not entirely pleased to be sending their eligible young daughter Juliet out into the world again: the last house party she attended, at the home of the Knightleys, involved a murder—which Juliet helped solve. Particularly concerning is that she intends to visit her new friend Marianne Brandon, who's returned home to Devonshire shrouded in fresh scandal—made more potent by the news that her former suitor, the rakish Mr. Willoughby, intends to take up residence at his local estate with his new bride.Elizabeth and Fitzwilliam Darcy of Pemberley are thrilled that their eldest son, Jonathan—who, like his father, has not always been the most socially adept—has been invited to stay with his former schoolmate, John Willoughby. Jonathan himself is decidedly less taken with the notion of having to spend extended time under the roof of his old bully, but that all changes when he finds himself reunited with his fellow amateur sleuth, the radiant Miss Tilney. And when shortly thereafter, Willoughby's new wife—whom he married for her fortune—dies horribly at the party meant to welcome her to town.With rumors flying and Marianne—known to be both unstable and previously jilted by the dead woman's newly made widower—under increased suspicion, Jonathan and Juliet must team up once more to uncover the murderer. But as they collect clues and close in on suspects, eerie incidents suggest that the killer may strike again, and that the pair are in far graver danger than they or their families could imagine.A VINTAGE ORIGINAL.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Audiobook",
    "Historical",
    "Romance",
    "Mystery Thriller"
  ],
  "author": "Claudia Gray",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/62926935-the-late-mrs-willoughby"
}