{
  "title": "The Witch of New York: The Trials of Polly Bodine and the Cursed Birth of Tabloid Justice",
  "description": "Before the sensational cases of Amanda Knox and Casey Anthony—before even Lizzie Borden—there was Polly Bodine, the first American woman put on trial for capital murder in our nation’s debut media circus.On Christmas night, December 25, 1843, in a serene village on Staten Island, shocked neighbors discovered the burnt remains of twenty-four-year-old mother Emeline Houseman and her infant daughter, Ann Eliza. In a perverse nativity, someone bludgeoned to death a mother and child in their home—and then covered up the crime with hellfire.When an ambitious district attorney charges Polly Bodine (Emelin’s sister-in-law) with a double homicide, the new “penny press” explodes. Polly is a perfect media villain: she’s a separated wife who drinks gin, commits adultery, and has had multiple abortions. Between June 1844 and April 1846, the nation was enthralled by her three trials—in Staten Island, Manhattan, and Newburgh—for the “Christmas murders.”After Polly’s legal dream team entered the fray, the press and the public debated not only her guilt, but her character and fate as a fallen woman in society. Public opinion split into different camps over her case. Edgar Allen Poe and Walt Whitman covered her case as young newsmen. P. T. Barnum made a circus out of it. James Fenimore Cooper’s last novel was inspired by her trials.The Witch of New York is the first narrative history about the dueling trial lawyers, ruthless newsmen, and shameless hucksters who turned the Polly Bodine case into America’s formative tabloid trial. An origin story of how America became addicted to sensationalized reporting of criminal trials, The Witch of New York vividly reconstructs an epic mystery from Old New York—and uses the Bodine case to challenge our system of tabloid justice of today.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Audiobook",
    "Crime",
    "Historical",
    "American History"
  ],
  "author": "C. Alexander Hortis",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/62918999-the-witch-of-new-york"
}