{
  "title": "White House by the Sea: A Century of the Kennedys at Hyannis Port",
  "description": "“Impeccably researched…captivating!” —Elin Hilderbrand * “A well-paced history.” — The New York Times Book Review * “Fascinating…with new details and well-sourced reporting.” —Associated PressNEW YORK TIMES BESTSELLER! The intimate, multigenerational story of the Kennedy family as seen through their Hyannis Port compound on Cape Cod—the iconic place where they’ve celebrated, mourned, and bonded—based on more than a hundred in-depth interviews by a Rolling Stone editor and journalist Kate Storey.Hyannis Port, Massachusetts, is synonymous with the Kennedy family. It is where, for a hundred years, America’s most storied political family has come to celebrate, bond, play, and grieve. It is also the setting of so many events we JFK giving his presidential acceptance speech, Jackie speaking with a Life magazine reporter just days after her husband’s assassination, Senator Edward Kennedy seeking refuge after the Chappaquiddick crash, Maria Shriver and Arnold Schwarzenegger tying the knot—and even Conor Kennedy courting pop star Taylor Swift. Anyone who has lived in, worked at, or visited the Kennedy compound in Hyannis Port has had a front-row view to history. Now, with extraordinary access to the Kennedy family—and featuring more than fifty rarely-seen images—journalist Kate Storey gives us a remarkably intimate and poignant look at the rhythms of an American dynasty.Drawing from a wealth of conversations with family members, friends, neighbors, household and security staff, Storey delivers a rich and textured account of the Kennedys’ lives in their summer refuge. From the 1920s, when Rose and Joseph P. Kennedy rented then bought a home known as The Malcolm Cottage, to today, when many Kennedys have purchased their own homes surrounding what’s now called The Big House, this book delivers many surprising revelations across the decades, including what matriarch Rose considered the family’s greatest tragedy, the rivalrous relationship between brothers Jack and Joe, details about Jackie’s life at the compound, and previously unknown glimpses into JFK Jr. and Carolyn Bessette’s loving and ill-fated relationship.“Engaging and…intimate anecdotes that often stand in contrast to predominant, media-created perceptions...Readers will come away with new insights and due appreciation for this uniquely American dynasty” ( Booklist , starred review).",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Audiobook",
    "Politics",
    "Memoir",
    "Presidents"
  ],
  "author": "Kate Storey",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/62919769-white-house-by-the-sea"
}