{
  "title": "Marche ta peine",
  "description": "Ulis est beau, charmeur, charmant. Il plaît aux filles et est très populaire au collège. Enfin... il était. Car, depuis ce qui est arrivé à Noah, tout le monde le déteste.Pour échapper au centre de détention pour mineurs, Ulis doit participer au programme \"Marche ta peine\" : deux mois de randonnée à travers la France, au côté d'André, un homme bourru et taiseux, qui a remplacé à la dernière minute l'éducateur qui devait l'accompagner. Deux mois pour que le garçon réfléchisse à ce qu'il a fait. Car Ulis ne comprend pas ce qu'on lui reproche : après tout, ce n'est pas lui qui a poussé ce boloss de Noah par la fenêtre ! Il n'y est pour rien s'il a voulu se suicider !Pas après pas, étape après étape, Ulis remplit le journal que la juge lui demandé de tenir et revient sur son histoire, sur ses souvenirs.Pas après pas, étape après étape, Ulis apprend à connaître André, un homme mystérieux, qui lui fait rencontrer des gens de son passé : Dédé dans sa tente de SDF, Margareth dans son immense demeure... Tous ont la même photo de groupe, datant d'une autre époque. Tous semblent partager le même secret.Et si ce secret porté par André permettait à Ulis d'avoir une autre lecture de sa propre histoire ? Et si, à force d'avancer dans son voyage, le garçon finissait par avancer dans sa tête ?Un road trip plein de suspense et d'humanitéUn roman dans lequel on traverse les paysages de la France, en accompagnant pas à pas les deux protagonistes, des personnages forts et complexes, avec le désir ardent de découvrir quel lourd secret ils portent dans leurs sacs à dos.Un roman indispensable sur le harcèlementAvec beaucoup de subtilité et une empathie qui n'a rien de complaisant, Maryvonne Rippert décortique les mécanismes du harcèlement scolaire. Une histoire à mettre entre toutes les mains, notamment à l'occasion de la Journée nationale de lutte contre le harcèlement scolaire, le 5 novembre.",
  "genres": [],
  "author": "Maryvonne Rippert",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/62948530-marche-ta-peine"
}