{
  "title": "The Healthy Kitchen: Recipes for a Better Body, Life, and Spirit",
  "description": "Two of America’s most popular authorities on healthy eating and cooking join forces in this inspiring, easy-to-use cookbook. This is not a diet book. It is a lively guide to healthy cooking, day-by-day, packed with essential information and, above all, filled with enticing food.Andrew Weil, M.D.—author of the best-selling Eating Well for Optimum Health —brings to this perfect collaboration a comprehensive philosophy of nutrition grounded in science. Rosie Daley—acclaimed for her best-seller, In the Kitchen with Rosie —brings to it her innovative and highly flavorful spa cuisine.The recipes are eclectic, drawing from the healthy and delicious cooking of the Middle East, the Mediterranean, and Asia, among other cuisines. For starters, you might try Grilled Satay or a Miso Pâté; for soup, often a meal in itself, a hearty Mixed-Bean Minestrone Stew or a Roasted Winter Squash and Apple Soup with Cilantro Walnut Pesto; a special entrée could be the Savory Roasted Cornish Hens with Roasted Garlic or Baked Spicy Tofu with Bean Thread Noodles, Corn, and Mango; for a simple supper, Turkey Burgers or Portobello Burgers; and for the occasional indulgence, a dessert of Almond Fruit Tart or Peach and Blueberry Cobbler.Andy and Rosie do not always agree. When Rosie calls for chicken, Andy offers a tofu alternative; she likes the flavor of coconut milk, whereas he prefers ground nut milk; when she makes a pastry with butter, he suggests using Spectrum Spread. There are no hard-and-fast rules.Lifelong health begins in the kitchen, so this is a lifestyle book as well as a cookbook. In it you will learn from Dr. • how to make use of nutritional information in everyday cooking• what is organic . . . and how to buy organic foods• the importance of reading labels and what to look for• sensible advice about eggs, milk, cheese, salt, spicy foods, wine, coffee• the facts about sugar and artificial sweeteners. . . and from • how to get kids involved—from skinning almonds to layering lasagna• ways to have fun in the kitchen—creating scallion firecrackers and radish rosettes• low-fat and nondairy alternatives for those with special concerns• smart menu planning—letting the seasons be your guide. . . and lots more.This revolutionary book will change forever the way you cook for yourself and your family.With 58 photographs in full color.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Health",
    "Food",
    "Nonfiction",
    "Reference",
    "Nutrition"
  ],
  "author": "Andrew Weil",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/629448.The_Healthy_Kitchen"
}