{
  "title": "The Truth Pill: The Myth of Drug Regulation in India",
  "description": "Since 2004, when the fraud at Ranbaxy, the largest Indian pharmaceutical company at the time first came to light, the Indian pharmaceutical industry and clinical research organizations have been rocked by a series of scandals after investigations by American and European drug regulators. While the West has responded to concerns about quality of “Made in India” medicine by blocking exports from many Indian pharmaceutical companies, the Indian government responded not with regulatory reform but conspiracy theories about “vested interests” working against India.More worryingly, the Indian state has also turned a blind eye to a far more serious quality crisis in its domestic pharmaceutical market. At times, these quality issues manifest themselves in the deaths of Indian citizens as happened in early 2020 when 11 children died in Jammu because of adulterated cough syrup. On other occasions, a dodgy drug approval process has led to the Indian regulator approving sales of drugs that have never been approved by regulators in the developed markets. The result is not just poor health outcomes but outsize profits for pharmaceutical companies manufacturing medicines that have never been validated through scientifically rigorous clinical trials for therapeutic evidence.These twin crises, in both the domestic and export markets, is because India has either outdated regulations or no regulations in some areas. Even the outdated regulations are enforced with kid gloves by drug inspectors and judicial magistrates who are ready to forgive even those whose drugs are found to contain barely any active ingredient or dangerously high levels of bacterial endotoxins. In a race for growth of the pharmaceutical industry, the Indian state has sacrificed scientific rigour and ignored the basic principles of public health. Given India’s position as the pharmacy of the developing world, the failure of the Indian state is a problem for not just India but most of the developing world. This timely, important and compelling book based on deep research, questions and analyzes the actions of the institutions that are responsible for the safety and efficacy of the Indian drug supply in the context of the historical evolution of the Drugs Act 1940 from pre-Independence India to the present day. The future of Indian public health lies in responding to the issues raised in this book.",
  "genres": [
    "Nonfiction",
    "India",
    "Medicine",
    "Health",
    "Business"
  ],
  "author": "Dinesh Singh Thakur",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/62967474-the-truth-pill"
}