{
  "title": "The Darlings",
  "description": "On a secluded stretch of Cape Cod, a wedding is being planned at a beloved beach house—only for a long kept secret to emerge that hurtles both the wedding and the family off course, in this fresh, lyrical new novel from the acclaimed author of the “charming and warmhearted” (PopSugar) The Summer House.At age ninety-two, Tish Darling is the matriarch and protector of what’s left of the Darling family fortune, including the decades-old beach house, Riptide. Located on the crook of Cape Cod, it’s a place she once loved but has not returned to in decades, since a tragic family accident one perfect summer day. Still, she is determined to keep Riptide in the family. Even if that means going back there on the cusp of her granddaughter’s wedding. Even if it means revealing someone else’s truth. Her daughter-in-law Cora has her own complicated feelings surrounding Tish’s return as well as doubts about her place within the Darling family. After all, Cora came into the family carrying a secret that her husband promised to keep for her forever. Tish’s sudden return to Riptide may force everything they’ve worked so hard to protect out into the light.  Meanwhile, Cora’s eldest daughter, Andi isn’t exactly looking forward to her little sister’s wedding so soon after her own divorce. To make matters worse, her ex has arrived on the Cape with his insufferable new girlfriend. Andi has no idea how she’ll be able to survive this family reunion…until she bumps into an old friend from the past. A friend who may just offer her a second chance. As the three distinct generations of Darling women arrive at Riptide, they have no idea that this summer will forever change them. One old secret, kept with the best of intentions, threatens to not only divide the family, but shatter each member’s sense of who they really are. Can the ties that bind survive, when the history you’ve always been told turns out to be untrue?",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Womens Fiction",
    "Contemporary",
    "Adult Fiction",
    "Adult"
  ],
  "author": "Hannah McKinnon",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/62969956-the-darlings"
}