{
  "title": "Senseless",
  "description": "The Game Series • Book 9 • Humor • BDSM • Novella told in Multiple POVsSpend a day with your favorite Game Series characters as they prepare to get utterly senseless.It’s been a long fall for the kinksters at Mclean House, but soon the house will finally be ready for action again. If anything, the fire only brought them closer as a community, and that’s how they’re mastering the rebuild—together.They have one week to get the second floor finished for the upcoming event, Senseless, and there isn’t a minute to waste. But of course, hard work doesn’t mean there’s no time for the Sadists and the brats of Mclean to multitask and have a little fun too. Reese promises cuddles in the dark and possibly a ball gag, Kit is super-excited about a gift he’s won for Daddy Colt, Kingsley can’t help but picture a future with Tate in which they start a family, Noa has a bratty surprise, poor Greer is having his chest shaved for a frigid photo shoot—actually, so is Colt. Those about to watch are really looking forward to that.I’m down to clown, as Corey would say!-This is a novella told in multiple POVs we’ve heard from in the previous Game Series books, and it’s recommended to have read Their Boy, Breathless, Doll Parts, Out of the Ashes, The Shepherd, and Adrift in the Embers before diving into Senseless.The Game Series is a BDSM series where romance meets the reality of kink. Sometimes we fall for someone we don’t match with, sometimes vanilla business gets in the way of kinky pleasure, and sometimes we have to compromise and push ourselves to overcome trauma and insecurities. No matter what, one thing is certain. This is not a perfect world—and maybe that’s why the happily ever after feels so good.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Contemporary",
    "M M M",
    "Novella",
    "LGBT"
  ],
  "author": "Cara Dee",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/62981124-senseless"
}