{
  "title": "The Lightning and the Few",
  "description": "Don’t miss this thrilling wartime adventure! For fans of Derek Robinson, James Holland, Frank Barnard and Jack Higgins.\nJox is exchanging civilian life for the thrill of fighting in the skies.\nScotland, 1939When Jox McNabb is expelled from school he is forced to look to his future.Inspired by the sight of a Hurricane flying over him, he becomes determined to join the RAF.And after basic training, Jox is posted to RAF Montrose with the growing group of other recruits he has met along the way.Battling the bleak Scottish elements and finding themselves immediately thrown in at the deep end, the lads struggle to keep up with the training.Many are deemed unfit for service, and after tragedy strikes, Jox questions if he’s got what it takes.\nCan Jox earn his wings to face Blitzkrieg and defend his country in its hour of need? Does he have the courage and skill to become one of The Few? \nWill he beat the odds to survive his first battle? THE LIGHTNING AND THE FEW is the first book in the Jox McNabb Aviation Thrillers action-packed, authentic historical adventures following a RAF pilot during the second world war.‘Sweeping yet  a fast-paced tale centred on the skill, luck, hopes, and fears of one young man battling for survival and triumph in the dangerous skies above 1940 England. Will definitely appeal to anyone fascinated with the tenuous, tense, and razor's edge lives of the legendary Few.’ Dave Mason, author of EO-N‘Larsimont’s achievement is to blend a remarkable depth of research with an exciting story about people you can believe in. He has made an impressive start to what promises to be a significant contribution to the genre of fighter pilot thrillers, helping to keep alive the ever-growing interest in that small band of heroes who more than eighty years ago stood between victory and defeat.’ Frank Barnard, author of Blue Man FallingTHE JOX MCNABB AVIATION THRILLERS BOOK The Lightning and the FewBOOK The Raiders and the CrossBOOK The Maple and the BlueBOOK The Vulcan and the Straits",
  "genres": [
    "Historical Fiction",
    "Aviation"
  ],
  "author": "Patrick Larsimont",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/62971146-the-lightning-and-the-few"
}