{
  "title": "The Future Is Female! Volume Two, The 1970s: More Classic Science Fiction Stories by Women",
  "description": "Go back to the Future Is Female in this all new collection of wildly entertaining stories by the trailblazing feminist writers who transformed American science fiction in the 1970sIn the 1970s, feminist authors created a new mode of science fiction in defiance of the “baboon patriarchy”—Ursula Le Guin’s words—that had long dominated the genre, imagining futures that are still visionary. In this sequel to her groundbreaking 2018 anthology The Future is Female!: 25 Classic Science Fiction Stories by Women from Pulp Pioneers to Ursula K. Le Guin, SF-expert Lisa Yaszek offers a time machine back to the decade when far-sighted rebels changed science fiction forever with stories that made female community, agency, and sexuality central to the American future.  Here are twenty-three wild, witty, and wonderful classics that dramatize the liberating energies of the 1970s: Sonya Dorman, “Bitching It” (1971) Kate Wilhelm, “The Funeral” (1972)Joanna Russ, “When It Changed” (1972) NEBULA AWARD Miriam Allen deFord, “A Way Out”(1973)Vonda N. McIntyre, “Of Mist, and Grass, and Sand” (1973) NEBULA James Tiptree, Jr., “The Girl Who Was Plugged In” (1973) HUGO AWARD Kathleen Sky, “Lament of the Keeku Bird” (1973)Ursula K. Le Guin, “The Day Before the Revolution” (1974) NEBULA & LOCUS AWARD Eleanor Arnason, “The Warlord of Saturn’s Moons” (1974)Kathleen M. Sidney, “The Anthropologist” (1975)Marta Randall, “A Scarab in the City of Time” (1975) Elinor Busby, “A Time to Kill” (1977)Raccoona Sheldon, “The Screwfly Solution” (1977) NEBULA AWARD Pamela Sargent, “If Ever I Should Leave You” (1974)Joan D. Vinge, “View from a Height” (1978)M. Lucie Chin, “The Best Is Yet to Be” (1978)Lisa Tuttle, “Wives” (1979) Connie Willis, “Daisy, In the Sun” (1979)Story Locale:Include post-apocalyptic California; a dystopian convent; post-pandemic Earth; extraterrestrial human colonies; and more",
  "genres": [
    "Short Stories",
    "Science Fiction",
    "Anthologies",
    "Feminism",
    "Fiction",
    "Literature",
    "Speculative Fiction"
  ],
  "author": "Lisa Yaszek",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/62972302-the-future-is-female-volume-two-the-1970s"
}