{
  "title": "Pas de Don't",
  "description": "Heather Hays finally has everything she’s worked for—she’s a principal dancer at New York Ballet Theater, has the best friend a girl could ask for, and is engaged to her forever crush, fellow principal Jack Andersen. They’ve been dubbed “American ballet royalty” . . . but when Heather’s best friend Carly catches Jack with a corps ballet dancer, the castle comes crashing down. Determined to prove that she rose to the top on her own merits—and not, as the press has always implied, because of her relationship with Jack—she accepts a guest position from the only company that will hire her without him: the Australian National Ballet.Marcus Campbell has had the most hellish year imaginable. He shredded his Achilles tendon during a performance, destroying any chance of his dad seeing him dance before lung cancer ended his life. He’s spent a year in physical therapy, getting his strength back and determined to honor his father’s memory by getting back on stage before he’s too old to dance anymore. Now Marcus’s boss wants him to play tour guide for the company’s new arrival. When Marcus realizes who the new arrival is, and that she’s even more gorgeous in person than she is on the cover of Barre magazine, he also finds she’s opinionated and funny. And for Heather, Marcus is everything Jack wasn’t: kind, consistent, and interested in what she has to say. For once in her life, she wants to rebel a little. But Heather’s in Sydney to dance, and it’s not like she can act on her attraction: ANB has a strict no-dating policy, an anti-harassment measure that the reform-minded artistic director takes very seriously.But as their Sydney sightseeing time turns to much more, Heather and Marcus find even the best-kept secrets have a way of coming out.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Sports Romance",
    "Sports",
    "Fiction",
    "Australia"
  ],
  "author": "Chloe Angyal",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/62997437-pas-de-don-t"
}