{
  "title": "Halloween Hearts",
  "description": "HALLOWEEN POETRY INSPIRED BY RAY BRADBURY AND EDGAR ALLAN POEAdele Gardner’s Halloween Hearts is a welcome celebration of all things Halloween, whether they take place on October 31st or not. Disciples of All Hallows’ Eve, enter of your own free will . . . haunted houses, trick-or-treaters, vampires, demonic foxes, witches and their familiars, revenants both longed-for and uninvited, and the creeping mists of autumn all have their place in these pages. Ray Bradbury and Edgar Allan Poe—icons of the American imagination, pilgrims of the nightside territories of the mind—have a special place in Gardner’s works. The poetry in this volume is inspired by much of what makes each of these authors special to so many Poe’s sensitivity to loss and melancholia, and to horror and terror, and Bradbury’s enthusiastic embrace of Halloween and other dark aspects of Americana, along with his refusal to allow death to be the final word in our relationship with our loved ones. With “ Eureka ” “Nevermore,” “Poe’s Prophets,” and other poems, Gardner explores Poe’s hallowed place in our haunted hearts. And in the title poem, which opens the book, Gardner lovingly celebrates Ray Bradbury and his unique alchemy of nostalgia, dread, and Halloween eternal. “. . . this book has been a long time coming, with its black cats and witches, ghosts and the grave, vampires and writers that haunt the night. Whether their subjects are traditional to Halloween or on tangential themes, all these poems are Halloween to me—that season so melancholy and elegiac, yet also fierce, with shining teeth, pointy grins, and a cat’s fang-filled mischief.” — Adele Gardner , from the introduction With a foreword by S. T. Joshi and an introduction by the authorIllustrated • Featuring art by Gustave Doré and Dan Sauer“Adele Gardner’s Halloween Hearts presents a kaleidoscopic pageant of delightful October imagery. Haunted by the wistful ghost of childhood past, and paraded through by a midnight processional of witches and black cats, these pages provide a fine evening of autumnal entertainment. Like the many twinkling branches of Bradbury’s Halloween Tree, every pumpkin here has a smile, and every page has a grin—yours.” — K. A. Opperman , author of Past the Glad and Sunlit Poems for Halloween",
  "genres": [
    "Poetry",
    "Halloween"
  ],
  "author": "Adele Gardner",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/63013951-halloween-hearts"
}