{
  "title": "Mademoiselle Eiffel",
  "description": "From the author of The School for German Brides and A Bakery in Paris, this captivating historical novel set in nineteenth-century Paris tells the story of Claire Eiffel, a woman who played a significant role in maintaining her family’s legacy and their iconic contributions to the city of Paris.Claire Eiffel, the beautiful, brilliant eldest daughter of the illustrious architect Gustave Eiffel, is doted upon with an education envied by many sons of the upper classes, and entirely out of the reach of most daughters. Claire’s idyllic childhood ends abruptly when, at fourteen, her mother passes away. It’s soon made clear that Gustave expects Claire to fill her mother’s place as caregiver to the younger children and as manager of their home.As she proves her competence, Claire’s importance to her father grows. She accompanies him on his travels and becomes his confidante and private secretary. She learns her father’s architectural trade and becomes indispensable to his work. But when his bright young protégé, Adolphe Salles, takes up more of Gustave’s time, Claire resents being pushed aside.Slowly, the animosity between Claire and Adolphe turns to friendship…and then to something more. After their marriage in 1885 preserves the Eiffel legacy, they are privileged by the biggest commission of Eiffel’s career: a great iron tower dominating the 1889 World’s Fair to demonstrate the leading role of Paris in the world of art and architecture. Now hostess to the scientific elite, such as Thomas Edison, Claire is under the watchful eye not only of her family and father’s circle, but also the world.When Gustave Eiffel’s involvement in a disastrous endeavor to build a canal in Panama ends in his imprisonment, it is up to Claire to secure her father’s freedom but also preserve the hard-won family legacy.Claire Eiffel’s story of love, devotion, and the frantic pursuit to preserve her family’s legacy is not only an inspired reflection of real personages and historical events, but a hymn to the iconic tower that dominates the City of Lights.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "France",
    "Historical",
    "Audiobook",
    "Romance",
    "Book Club"
  ],
  "author": "Aimie K. Runyan",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/63006681-mademoiselle-eiffel"
}