{
  "title": "What I Would Tell You",
  "description": "Determined to resist the invading Nazis, a Greek Jewish woman's greatest dream has become her worst nightmare, and now she faces an impossible choice whose consequences echo across the generations.    1941—The pounding of Nazi boots on the streets of Salonika, Greece, reverberates in Mathilda Nissim’s ears, shaking her large community of Sephardic Jews to its core and altering her life forever. If only her people would rise up and resist their captors. At great risk to herself and those around her, she uses the small newspaper she publishes to call them to action, all to no avail. Her husband encourages her to trust God to watch over them, but God has once again deserted His people. Amid the chaos, Mathilda discovers she’s expecting a longed-for child. Still, nothing stops the occupiers’ noose from tightening around their necks, and she may have to resort to desperate measures to ensure her daughter’s survival.   2019—College student Tessa Payton and her cousin take a popular DNA heritage test only to discover they don’t share any common ancestors. In fact, the test reveals Tessa is a Greek Sephardic Jew. This revelation threatens her tenuous faith. Always the overlooked child in her family, she empties her savings account and jets off on a journey to Greece to discover where she belongs and which God demands her allegiance. The enchanting curator at the Jewish museum guides her as she navigates life in Thessaloniki, helps with her genealogical research, and loans her a fascinating journal written by a Jewish woman during WWII. Tessa’s search, however, may open old wounds and uncover long-hidden secrets that could fracture her family forever and leave her with more questions than when she started.  Based in part on true accounts of Jews in Salonika, Greece, What I Would Tell You traces two women’s journeys, delving into what faith looks like and where it leads us as they navigate difficult circumstances and impossible choices that have ripple effects across the years.Split time WWII and 2019Stand-alone novelApproximate book 91,000 wordsIncludes author’s notes",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Historical",
    "World War II",
    "Fiction",
    "Greece",
    "Inspirational"
  ],
  "author": "Liz Tolsma",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/63000806-what-i-would-tell-you"
}