{
  "title": "Instinct: An Animal Rescuers Anthology",
  "description": "Danger. Evil. Death. Heroes can face it all, but they cannot do it alone.Throughout history, creatures both big and small have stood alongside heroes and helped them through trying times, whether on the battlefield or in their laps. In these brand-new stories, sixteen bestselling authors regale us with adventures of animal companions and how they often are the ones rescuing the rescuer.The Gold Standard by A.J. Hartley, short story from \nThe Hawthorne Saga\nHowl-O-Ween by Alex Erickson, from the world of \nFurever Pets\nDog by D.J. Butler featuring John Abbott from Abbott in DarknessSafe Place by Eliza Eveland from the series \nTalons and Tethers\n George and KitKit Save the Witches by Faith Hunter, short story set within the \nJane Yellowrock\n universeKeeting it Real by Hailey Edwards, short story set within the \nThe Beginner's Guide to Necromancy\n seriesHelpful by Jennifer Blackstream, a story in the universe of \nBlood Trails\nFugitive by Jim Butcher, story in the world of \nThe Dresden Files\n The Unlikeliest Places by John G. Hartness, \nQuincy Harker\n short storyForever and A Day by Kelley Armstrong, short story from the \nCainsville\n seriesThe Unexpected Dachshund by L.E. Modesitt, Jr., short story within the \nArchform: Beauty\n universeThe Kitcoon by L.J. Hachmeister, prequel in the \nTriorion\n universeA Cry in the Night by Lucienne Diver (from The Latter-Day Olympians)The Kindness of Cats by R.R. Virdi, from the series \nTales of Tremaine\nJunkyard Rex by Sam Knight, upcoming series The Abandoned LandsNine by Seanan McGuire, standalone short storyA Memory of Witches by Patricia Briggs, scene takes place during Storm Cursed from the \nMercy Thompson\n universe.Purchasing this book saves a puppy’s life! Portions of the book sale profits are donated to Lifeline Puppy Rescue.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Anthologies",
    "Short Stories",
    "Shapeshifters",
    "Paranormal",
    "Fiction"
  ],
  "author": "L.J.  Hachmeister",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/62994052-instinct"
}