{
  "title": "Courage Under Fire: Under Siege and Outnumbered 58 to 1 on January 6",
  "description": "One of the darkest days in American history became an extraordinary story of courage under fire.Courage under Fire is United States Capitol Police Chief Steven A. Sund’s gripping personal account that takes readers inside the events leading up to January 6, and provides a detailed and harrowing minute-by-minute account of the attack on the US Capitol, which was valiantly defended in hand-to-hand combat by the US Capitol Police officers who found themselves outnumbered fifty-eight to one.Courage under Fire contains never-before-seen photographs and draws upon audio recordings, key documents, and government records as it traces Sund’s extraordinary journey from his command post on January 6 to his explosive behind-closed-doors testimony before the January 6 committee.Steven A. Sund, one of only ten men in history to hold the title of Chief of the US Capitol Police, has coordinated dozens of National Special Security Events, responded to numerous critical incidents and active shooter events, and has protected every living US president. But nothing could have prepared him for the violent attack on the US Capitol on January 6, 2021.Three days before the attack, Chief Sund requested the assistance of the National Guard. This request was denied. In preparation for the Joint Session of Congress, Chief Sund directed every available sworn officer to be on duty to protect the Capitol and all of its members and staff.But it wasn’t enough.The savage attack that followed was a well-planned and carefully coordinated armed assault on the United States Capitol, involving thousands. The shock and horror of this attack exploded on TV screens worldwide as US Capitol Police officers under Chief Sund’s command found themselves facing a violent siege, hit with pipes, fire extinguishers, boards, and flag poles. Dedicated men and women were knocked unconscious and sprayed with mace and bear spray as live pipe bombs were discovered at the national headquarters of both major political parties.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "Audiobook",
    "Historical",
    "Memoir"
  ],
  "author": "Steven A. Sund",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/62985152-courage-under-fire"
}