{
  "title": "Lady of Shadows",
  "description": "SHOW ME YOUR DARKNESS, AND I'LL SHOW YOU MINE.*THE STARS ARE FADING.*THE SHADOWS ARE CALLING.*THE DARKNESS THREATENS EVERYTHING.ANOTHER PRETTY CAGE.Whisked away to the Fire Court, Scarlett Monrhoe finds herself in the hands of the man who killed her mother. The Prince of Fire. Thrust amongst the Fae court she loathes, she is at their mercy. She doesn't know what plans he has for her, but she has plans of her own. She just hasn't decided how thoroughly she wants to break him yet. If only he didn't tempt her with every breath, every touch, every kiss. It's another dangerous game that has her wondering if she will be the one irreparably broken in the end.ANOTHER DANGEROUS GAME.The Fae Queen has plans of her own. She's determined to get to Scarlett in any way she can, and that includes using a mortal prince that followed the lost Fae princess across the border. Crown Prince Callan is desperate to get Scarlett back from the Fire Prince and return to Baylorin. The question is, what is he willing to sacrifice for the Wraith he loves who's trailed by shadows?ANOTHER RACE AGAINST TIME.Every day that passes, Lord Tyndell and Mikale get closer to finding where she is hidden in the Fire Court. Every day that passes puts those Scarlett left behind in more danger. Every day that passes, more secrets are revealed. Truth has been buried in history that has long-since been rewritten, but in order to separate facts from lies, they will be forced to cross other borders and seek answers from kingdoms far more terrifying than the Fire Court.Lady of Shadows is a new adult dark fantasy and romance novel. It's a slow-burn, enemies-to-lovers troupe. It may have triggers of love-hate themes, sexual scenes (both consensual and non), violence, and jealous/possessive themes. Fans of Sarah J. Maas, Jennifer L. Armentrout, and Leigh Bardugo will fall in love with this series.",
  "genres": [
    "Fantasy",
    "Romantasy",
    "Fantasy Romance",
    "Romance",
    "Fae",
    "Audiobook",
    "Magic"
  ],
  "author": "Melissa K. Roehrich",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/62987128-lady-of-shadows"
}