{
  "title": "The Deepest Map: The High-Stakes Race to Chart the World's Oceans",
  "description": "The dramatic and action-packed story of the last mysterious place on earth—the world’s seafloor—and the deep-sea divers, ocean mappers, marine biologists, entrepreneurs, and adventurers involved in the historic push to chart it, as well as the opportunities, challenges, and perils this exploration holds now and for the future. Five oceans—the Atlantic, the Pacific, the Indian, the Arctic, and the Southern—cover approximately 70 percent of the earth. Yet we know little about what lies beneath them. By the early 2020s, less than twenty-five percent of the ocean’s floor has been charted, most close to shorelines, and over three quarters of the ocean lies in in what is called the Deep Sea, depths below a thousand meters. Now, the race is on to completely map the ocean’s floor by 2030—an epic project involving scientists, investors, militaries, and private explorers who are cooperating and competing to get an accurate reading of this vast terrain and understand its contours and environment.  In The Deepest Map , Laura Trethewey documents this race to the bottom, following global efforts around the world, from crowdsourcing to advances in technology, recent scientific discoveries to tales of dangerous dives in untested and costly submersibles. The lure of ocean exploration has attracted many, including the likes of James Cameron, Richard Branson, Ray Dalio, and Eric Schmidt. The Deepest Map follows a cast of intriguing characters, from early mappers such as Marie Tharp, a woman working in the male-dominated fields of oceanography and geology whose discoveries have added significantly to our knowledge; Victor Vescovo, a man obsessed with reaching the deepest depths of each of the five oceans, and his young, brilliant, and fearless mapper Cassie Bongiovanni; and the diverse entrepreneurs looking to explore and exploit this uncharted territory and its resources. In The Deepest Map , ocean discovery converges with humanity's origin story; in mapping the ocean floor, scientists are actively tracing our roots back to the most inhospitable places on earth where life began—and flourished. But for every conservationist looking to protect the seafloor, there are others who see its commercial potential. Will a new map exacerbate pollution and the degradation of this natural resource? How will the race remake political power structures in years to come? Trethewey probes these questions as countries and conglomerates wrestle over the riches that may lie at the bottom of the sea. The future of humanity depends on our ability to protect this vast, precious, and often ignored resource. A true tale of science, nature, technology, and an extreme outdoor adventure The Deepest Map illuminates why we love—and fear—the earth’s final frontier and is a crucial addition to the increasingly urgent conversation about climate change.",
  "genres": [
    "Science",
    "Nonfiction",
    "Nature",
    "History",
    "Audiobook",
    "Geography",
    "Environment"
  ],
  "author": "Laura Trethewey",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/63017270-the-deepest-map"
}