{
  "title": "KyRose Takes A Leap",
  "description": "Empowering and inspiring kids to love STEAM and learn to collaborate with one another to solve problems–big and small–is likely every parent and teacher’s dream. Here's a delightful story that bridges technology with nature and celebrates our differences, as humans and animals. And, allows each child's voice and passion to be heard.It’s 2030 and students at MakerX20 (STEAM-based middle school) are building gadgets for the first astronauts about to land on Mars. Meanwhile, twelve-year-old KyRose has a secret mission of her own. She’s a freak. Well, at least, that’s what her classmates say when they see her talking to animals. Truth be told, that’s her superpower. But really, all KyRose wants is to be normal, like everyone else, and win over Georgia, the captain of the soccer team and most popular girl in school.Meanwhile, a mystery ensues off the coast of Catalina Island. The ecosystem has gone awry and left a young dolphin stranded. Will KyRose save the day? Or in her frenzy to fit in, will she shun her special gift—and her best friend Cora—to achieve the acceptance she longs for?From microbes to migration patterns, KyRose traverses the circle of life. Yet, before she can help anyone else, she must accept herself, even if that means being different. Only then can she blaze a path of her own—unique and authentic—to find the true belonging she seeks.“A debut middle-grade novel chronicles the adventures of a seventh grader…. KyRose Sanchez, a student at a STEM-focused school who has an uncanny ability to communicate with animals. Although she loves creatures of all kinds and is involved in local animal welfare issues (such as saving an injured dolphin she calls Misty and helping a pair of eagles named Gabriella and Merlin, whose ecosystem has been destroyed), her biggest wish is to be one of the popular kids.… The ingenuity and groundbreaking ideas that the students come up with (like echolocation vests) are…wildly empowering to young readers….A thought-provoking environmental tale featuring a lovable hero.” –Kirkus Reviews“KyRose...is a relatable heroine. She...makes decisions in haste, leading to teachable moments. Further, her discussions of echolocation, space exploration, and the intricacies of ecosystems are edifying. The prose has an easygoing tone that allows the characters to remain the focus…. By the book’s end...her family’s history all unite in the emotional conclusion.” –Clarion Reviews“Readers will be glued to the sidelines cheering for KyRose. She battles insecurity and struggles with friend issues and moral dilemmas. Supporting characters are original and well-defined, and the teens’ dialogue and behavior are dead-on.... The dramatic windup is as thrilling as it is surprising; and the story carries a timely theme about the interconnectedness of all life and the importance of protecting our ecosystems and fellow creatures.” –BlueInk Review“Readers in grades 5-8 who look for STEAM novels encouraging literacy and presenting problem-solving viewpoints will welcome the blend of magical realism and struggles…explored by KyRose. With its intrigue, discovery, problem-solving, and extraordinary encounters, Cicek Bricault has created an engaging story to attract STEAM learners. KyRose Takes A Leap is highly recommended for advanced elementary to middle school readers. They will relish this captivating story of a girl who decides when to take risks and how to accept more responsibility as a leader.” –Midwest Book Review\"All animals have a unique intelligence based on their biology, each with so much to teach us. Kids will delight in the escapades of KyRose and her fantastic array of classmates and furry friends while expanding their perspective of the world.\" –Tamar Geller, New York Times best-selling author of The Loved Dog",
  "genres": [],
  "author": "Cicek Bricault",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/63025619-kyrose-takes-a-leap"
}