{
  "title": "Murder at the Galliano Club: A Prohibition historical fiction thriller",
  "description": "In 1926, thanks to Prohibition, it’s hard to find a beer in Lido, New York. But trouble is always on tap at the Galliano Club in this explosive start to the riveting Prohibition-era historical fiction crime series.Winner, 2023 Silver Falchion Award for Best HistoricalSocial hub for the Italian immigrant community, the Galliano Club serves bootleg beer and Luca Lombardo’s signature sandwiches to workers from the city’s copper mills. The club means everything to Luca, who arrived in Lido with nothing left to lose.He’ll do whatever it takes to keep the club afloat, even staying silent about a murder in the alley behind the building.From her second-floor window, Ruth Cross witnessed the murder, but a scandalous past keeps her quiet.Could gangster Benny Rotolo be involved? Run out of Chicago by Al Capone, he fled to Lido with a gun in his pocket and plans to establish his own bootlegging empire. He wants to turn the Galliano Club into his private speakeasy.A collision between Luca and Benny is coming . . . Unless the killer gets there first.Award-winning author Carmen Amato’s Galliano Club historical fiction thriller series is a heady brew of murder, ambition, and secrets. With sizzling relationships, authentic period details, and a cast of unforgettable characters, you’ll savor every drop of this page-turning saga.Are you a fan of The Godfather, Road to Perdition, The Untouchables, or Boardwalk Empire? If you love historical fiction featuring Prohibition-era stories of Chicago gangsters, Italian mobsters, and bold bootleggers, you’ll love MURDER AT THE GALLIANO CLUB, the first novel in the series.Click the BUY NOW button at the top and enter the Galliano Club today! \nWe saved a spot at the bar for you.\n\"The Galliano Club series promises to be as riveting as Amato’s previous novels set in Mexico. The Roaring Twenties in their uninhibited violence and excitement come alive . . . A sure hit with loyal fans and new readers alike.\" - Michael Hogan, author of Women of the Irish Rising“A gripping thriller series that will immerse you in the gritty, violent world of America in the 1920s. Clawing their way through the tale are a host of desperate characters that will shock and amaze you, never allowing you to catch your breath until the jaw-dropping conclusion.” - Amanda Hughes, author of The Looking Glass Goddess and The Image Seeker“Spot-on historic atmosphere as the compelling characters fight, dance, and gamble their way to the Galliano Club . . . An epic tale with all the glitz, danger and gritty charm of the era.” - L.A. Chandlar, award-winning author of the Art Deco Mystery SeriesTHE GALLIANO CLUB THRILLERSROAD TO THE GALLIANA PREQUELMURDER AT THE GALLIANO CLUBBLACKMAIL AT THE GALLIANO CLUBREVENGE AT THE GALLIANO CLUB",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/63037768-murder-at-the-galliano-club"
}