{
  "title": "Step-Bully",
  "description": "You never know who your enemy is, until they are sitting at your dinner table. Lula Reynolds has her hands full. Between her sick father, their failing scrapyard and an online bully, she’s ready to leave her dream of singing to sold out crowds behind, pack a bag and start a Tiki bar in Bora Bora. When things couldn’t get worse, her mother blows into town on the arm of a highly skeezy new step-father whose bad-boy son is a level ten jerk. But he’s also got killer eyes and hands that make her body sing. For Scotch Morrison, crushing the competition with shady deals and black-hat tactics is business 101. So, when his father brings home wife number five, he has no interest in getting attached. Only, his shiny new step-mother comes with baggage in the form of an eighteen year old daughter with curves for days and a take-no-crap attitude who changes everything. It’s not long before the heat in the step-kitchen boils over, and Scotch decides Lula is more than just a nuisance. She’s his. To have. To hold. And… to knock-up. But if she finds out he’s the one that made her miserable for so long, will she ever forgive him? Or will their secret history turn their happily ever after into just another pile of scrap? Author’s Note: This hero doesn’t realize it’s his luscious new step-sister he’s been terrorizing online. These two have no interest in their new dynamics until they get the first look at each other. Then it’s game on with forbidden fantasies and bad boy/good girl love at the speed of light. As always, it’s safe, no cheating and obsessed at first sight. Wanting What’s Wrong Series: Step right up if you want to get down with some \"No, no, we can't, it's so wrong.\" action!",
  "genres": [
    "Novella",
    "Romance",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Plus Size",
    "New Adult",
    "Erotica"
  ],
  "author": "Dani Wyatt",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/63041560-step-bully"
}