{
  "title": "What an Owl Knows: The New Science of the World's Most Enigmatic Birds",
  "description": "An instant New York Times bestseller!From the author of The Genius of Birds and The Bird Way, a brilliant scientific investigation into owls—the most elusive of birds—and why they exert such a hold on human imaginationFor millennia, owls have captivated and intrigued us. Our fascination with these mysterious birds was first documented more than thirty thousand years ago in the Chauvet Cave paintings in southern France. With their forward gaze and quiet flight, owls are often a symbol of wisdom, knowledge, and foresight. But what does an owl really know? And what do we really know about owls? Though our fascination goes back centuries, scientists have only recently begun to understand in deep detail the complex nature of these extraordinary birds. Some two hundred sixty species of owls exist today, and they reside on every continent except Antarctica, but they are far more difficult to find and study than other birds because they are cryptic, camouflaged, and mostly active in the dark of night.Jennifer Ackerman illuminates the rich biology and natural history of these birds and reveals remarkable new scientific discoveries about their brains and behavior. She joins scientists in the field and explores how researchers are using modern technology and tools to learn how owls communicate, hunt, court, mate, raise their young, and move about from season to season. We now know that the hoots, squawks, and chitters of owls follow sophisticated and complex rules, allowing them to express not just their needs and desires but their individuality and identity. Owls duet. They migrate. They hoard their prey. Some live in underground burrows; some roost in large groups; some dine on black widows and scorpions.Ackerman brings this research alive with her own personal field observations about owls and dives deep into why these birds beguile us. What an Owl Knows is an awe-inspiring exploration of owls across the globe and through human history, and a spellbinding account of their astonishing hunting skills, communication, and sensory prowess. By providing extraordinary new insights into the science of owls, What an Owl Knows pulls back the curtain on the nature of the world’s most enigmatic group of birds.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "Animals",
    "Birds",
    "Audiobook",
    "Biology"
  ],
  "author": "Jennifer Ackerman",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/63024269-what-an-owl-knows"
}