{
  "title": "Eradication: Ridding the World of Diseases Forever?",
  "description": "How shall we improve human health? One answer by eradication. The Gates Foundation announced in 2007 that their goal is malaria eradication; another of their priorities is polio eradication. Eradication means the complete elimination of a disease through deliberate human intervention. It stands for an absolute in public health. This book by the award-winning historian of medicine Nancy Leys Stepan is an accessible, beautifully written, and deeply researched examination of one of the most controversial issues in public health today. The eradication of disease might seem like an absolute good. But critics of eradication argue that the huge resources needed to achieve eradication could be better allocated toward developing primary health services and general improvement in health. This book aims to look at the benefits and drawbacks of single-minded efforts to rid the world of particular diseases, one at a time. The sweep of the book is impressive, from the origins of the idea of complete eradication in the early twentieth century until the present-day campaigns against polio, Guinea worm disease, and now malaria. The author places eradication's story in its many contexts, from imperialism, changing notions of public health, the history of medicine and its technologies, the development of international health agencies such as the World Health Organization, and the impact of the Cold War on the shift of attention to disease in developing countries. At the center of this narrative is Dr. Fred Lowe Soper (1893-1977), a U.S.-trained doctor who became the arch-eradicationist of his time. His campaigns to eradicate hookworm disease, yaws, yellow fever, malaria, and smallpox are treated in compelling detail, as are the roles of international health agencies such as the Rockefeller Foundation and the World Health Organization. Throughout the book Stepan draws attention to the way that the ideal of eradication has repeatedly arisen, phoenix-like, from its setbacks. In a powerful conclusion, she uses the example of the current campaign to eradicate Guinea worm disease to argue that, today, under the right circumstances, eradication and primary health care need not be in conflict, as they were in the past, but can form mutually reinforcing policies to improve the health and well-being of populations, especially the poorest and most disease-burdened populations of the world.",
  "genres": [
    "Science",
    "Nonfiction",
    "Health",
    "Medicine",
    "Biology",
    "History",
    "Health Care"
  ],
  "author": "Nancy Leys Stepan",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/12931176-eradication"
}