{
  "title": "City of Souls and Sinners",
  "description": "In the sequel to City of Gods and Monsters, Loren Calla and Darien Cassel have settled back into their old routines, grateful that the whirlwind of dangers they’d faced on Kalendae and the weeks leading up to it are now behind them—or so they think.But Loren soon finds herself caught in a new storm of trouble when the Terran Imperator blackmails her into working for him. There’s only one problem: he expects her to use her magic, and she doesn’t seem to have any of it left. To keep Darien and the other Devils safe, she agrees to everything the imperator asks of her. But the secrets she is forced to keep from Darien, and her involvement with the imperator’s son, threaten to drive her away from Darien in ways she might never recover from…As Randal Slade’s successor, Darien wants nothing to do with the throne his father once sat in, but the city of Angelthene has other plans. The Magical Protections Unit asks for his help in taking down the illegal arms trade his father once dabbled in, and to do that Darien must claim his place at the top of the tiers of Darkslayers—a crown the other circles are willing to kill to possess. As he spirals deeper into the secrets his father kept, he makes enemies of friends and friends of enemies—and finds himself buried so deep in Angelthene’s underbelly that he is uncertain he’ll ever get out of it. And if that wasn’t enough, Darien fears he is going crazy when he starts to see creatures that only he can see…Return to Angelthene in City of Souls and Sinners, a gripping, action-packed tale that tackles themes of love and loss, light and darkness, and the battle between good and evil—and what happens when you can’t tell which is which.Please note: This book contains darker content that might not be suitable for some readers, including violence, mature language, detailed sex scenes, drug abuse/drug addiction, bullying, domestic violence and child abuse (shown in flashbacks), sexual harassment, anxiety, panic attacks, depression, and discussion of suicide.",
  "genres": [
    "Fantasy",
    "Romantasy",
    "Romance",
    "Fantasy Romance",
    "Urban Fantasy",
    "Vampires",
    "Paranormal"
  ],
  "author": "Kayla   Edwards",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/63049374-city-of-souls-and-sinners"
}