{
  "title": "Whispering Pines: The Northern Roots of American Music ... From Hank Snow to The Band",
  "description": "Whispering Pines is the first comprehensive history of Canada’s immense songwriting legacy, from Gordon Lightfoot to Joni Mitchell. Canadian songwriters have always struggled to create work that reflects the environment in which they were raised, while simultaneously connecting with a mass audience. For most of the 20th century, that audience lay outside Canada, making the challenge that much greater. While nearly every songwriter who successfully crossed this divide did so by immersing themselves in the American and British forms of blues, folk, country, and their bastard offspring, rock and roll, traces of Canadian sensibilities were never far beneath the surface of the eventual end product. What were these sensibilities, and why did they transfer so well outside Canada? With each passing decade, a clear picture eventually emerged of what Canadian songwriters were contributing to popular music, and subsequently passing on to fellow artists, both within Canada and around the world. Just as Hank Snow became a giant in country music, Ian & Sylvia and Gordon Lightfoot became crucial components of the folk revival. In the folk-rock boom that followed in the late ’60s, songs by The Band and Leonard Cohen were instant standards, while during the ’70s singer/songwriter movement few artists were more revered than Neil Young and Joni Mitchell. This is the first thorough exploration of how these, along with other lesser-known but no less significant, artists came to establish a distinct Canadian musical identity from the 1930s to the end of the 1970s. Anecdotes explaining the personal and creative connections that many of the artists shared comprise a large aspect of the storytelling, along with first-person interviews and extensive research. The emphasis is on the essential music – how and where it originated, and what impact it eventually had on both the artists’ subsequent work, and the wider musical world.",
  "genres": [
    "Music",
    "History",
    "Nonfiction"
  ],
  "author": "Jason Schneider",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/6304782-whispering-pines"
}