{
  "title": "تاء الخجل",
  "description": "بتلقائية كبيرة تبوح فضيلة الفاروق بما يدور في أعماقها كأنثى شرقية تتوق إلى التحرر من عصر الجواري والحريم وهي في هذه الرواية التي تصور واقع المرأة الجزائرية التي تشكل جزءاً من معاناة المجتمع الجزائري تنزع إلى الانعتاق من أسر التقاليد الرثة وتتطلع إلى كسر قضبان الداخل كي تهرب من صمت الوحدة الذي تعانيه وهي امرأة مفخخة بالألم تغطي حياتها بسرية تامة وتدثرها بدثار سميك...ولكن الحب الذي تبحث عنه المؤلفة مؤلم وعنيف، لكنه ليس أكثر إيلاماً من الانفصال الذي يجعل الدنيا تصبح أكثر حدة. امرأة هاربة من أنوثتها ومن الآخر-الرجل-لأنه مرادف لتلك الأنوثة المستضعفة والمهمشة في مجتمع لا يقدم أدنى متطلبات الاحترام للمرأة، فهي إذن مشروع أنثى وليست أنثى.\".. كنت مشروع أنثى ولم أصبح أنثى تماماً بسبب الظروف، كنت مشروع كاتبة، ولم أصبح كذلك إلا حين خسرت الإنسانية إلى الأبد. كنت مشروع حياة، ولم أحقق من ذلك المشروع سوى عُشره\".تاء الخجل رواية من أجل 5000 مغتصبة في الجزائر، تلامس قضية طالما عانت منها المرأة في كل مكان وتؤشر الخلل في العلاقة بين الجنسين في المجتمع وهي بحث يلقي الضوء على الواقع السياسي والاجتماعي في الجزائر. \"الاغتصاب استراتيجية حربية، إذ أعلنت الجماعات الإسلامية المسلحة \"GIA\" في بيانها رقم 28 الصادر في 30 نيسان/إبريل، أنها قد وسعت دائرة معركتها للانتصار للشرف بقتل نسائهم ونساء من يحاربوننا أينما كانوا، في كل الجهات\".لقد أصبح الخطف ابتداء من عام 1995 إذاً استراتيجية حربية، تسمي الكاتبة هذه السنة سنة العار حيث 55 حالة اغتصاب (لفتيات ونساء) تتراوح أعمارهن بين 13 و40 سنة. وقد تلاحقت السنوات حيث ازداد العدد الذي يفوق الخمسة آلاف حالة.الناشر:\"منذ العبوس الذي يستقبلنا عند الولادة، منذ أقدم من هذا، منذ والدتي التي ظلت معلقة بزواج ليس زواجاً تماماً، منذ كل ما كنت أراه فيها يموت بصمت، منذ جدتي التي ظلت مشلولة نصف قرن من الزمن، إثر الضرب المبرح الذي تعرضت له من أخي زوجها وصفقت له القبيلة، وأغمض القانون عنه عينيه. مند القدم، منذ الجواري والحريم، منذ الحروب التي تقوم من أجل مزيد من الغنائم، منهنّ... إليًّ أنا، لا شيء تغيّر سوى تنوع في وسائل القمع وانتهاك كرامة النساء. لهذا كثيراً ما هربت من أنوثتي، وكثيراً ما هربت منك لأنك مرادف لتلك الأنوثة\"",
  "genres": [
    "Novels",
    "Literature",
    "Feminism"
  ],
  "author": "فضيلة الفاروق",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/6304357"
}