{
  "title": "An Edible History of Humanity",
  "description": "Throughout history, food has acted as a catalyst of social change, political organization, geopolitical competition, industrial development, military conflict, and economic expansion. An Edible History of Humanity is a pithy, entertaining account of how a series of changes—caused, enabled, or influenced by food—has helped to shape and transform societies around the world. The first civilizations were built on barley and wheat in the Near East, millet and rice in Asia, and corn and potatoes in the Americas. Why farming created a strictly ordered social hierarchy in contrast to the loose egalitarianism of hunter-gatherers is, as Tom Standage reveals, as interesting as the details of the complex cultures that emerged, eventually interconnected by commerce. Trade in exotic spices in particular spawned the age of exploration and the colonization of the New World. Food's influence over the course of history has been just as prevalent in modern times. In the late eighteenth century, Britain's solution to food shortages was to industrialize and import food rather than grow it. Food helped to determine the outcome of wars: Napoleon's rise and fall was intimately connected with his ability to feed his vast armies. In the twentieth century, Communist leaders employed food as an ideological weapon, resulting in the death by starvation of millions in the Soviet Union and China. And today the foods we choose in the supermarket connect us to global debates about trade, development, the environment, and the adoption of new technologies. Encompassing many fields, from genetics and archaeology to anthropology and economics—and invoking food as a special form of technology—An Edible History of Humanity is a fully satisfying discourse on the sweep of human history.",
  "genres": [
    "History",
    "Nonfiction",
    "Food",
    "Science",
    "Food History",
    "Audiobook",
    "Food and Drink"
  ],
  "author": "Tom Standage",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/6306969-an-edible-history-of-humanity"
}