{
  "title": "A Bargain Made of Iron and Blood",
  "description": "A faerie determined to gain back what's hers. A prince afraid of becoming king. A bond that will change them forever.Acacia is a faerie whose world and powers were ripped out from under her when she witnessed her parent’s murder by a violent faerie prince. After spending one year in the unforgiving Irindil dungeons, Acacia finds herself faced with a bargain she can’t refuse: her powers restored in exchange for completing four perilous tasks for her queens.Acacia’s fourth task may be the most dangerous of all: making a mortal fall in love with her and trusting them with her name.After starting her journey, fate sends her Oren Valore—a mortal prince raised to hate and fear faeries for the atrocities they did to his mother. Only his mother’s life is dwindling fast, and in order to save her, he must find a rare flower that may be her only salvation.The catch? The flower is one of Acacia’s own creation, one she can’t produce without her powers, forcing the two strangers to agree to a bargain that unites their minds and hearts as they venture out of their comfort zones and into the dangerous world neither of them had ever dared explore.Though they both have their own secrets: Acacia hopes to get back her powers on her own terms—and without the falling in love part—while Oren struggles with putting his own prejudices aside in order to save his mother.The world outside of Valoria's walls is both magical and deadly, but as Oren helps Acacia on her quest throughout Prynne, he discovers there is more to faeries and magic than he has been led to believe.Left with no other choice, the two agree to a bargain and set off into the world of Prynne, discovering just how strong a bond between a faerie and a mortal can be.A Bargain Made of Iron and Blood is the first novel in an adult fantasy romance series that is perfect for readers looking to be lost in a magical world full of swoon-worthy and slow-burn romance!",
  "genres": [
    "Fantasy",
    "Fae",
    "Romance",
    "Fantasy Romance",
    "Enemies To Lovers"
  ],
  "author": "Guinevere Leigh",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/63089244-a-bargain-made-of-iron-and-blood"
}