{
  "title": "The Symphony of Ages Boxed Set I",
  "description": "Boxed Set containing Mass Market Paperback editions of Rhapsody , Prophecy , and Destiny RhapsodyThe brilliant new saga is born ... Rhapsody is a woman, a Singer of some talent, who is swept up into events of world-shattering import. On the run from an old romantic interest who won't take no for an answer, Rhapsody literally bumps into a couple of shady half-breeds who come to her rescue in the nick of time. Only the rescue turns into an abduction, and Rhapsody soon finds herself dragged along on an epic voyage, one that spans centuries and ranges across a wonder-filled fantasy world-- a world so real you can hear the sweet music of Rhapsody's aubade and smell the smoldering forges deep within the Cauldron. ProphecyIn Rhapsody , a fellowship was forged-- three companions who, through great adversity, became a force to be reckoned Rhapsody the Singer; Achmed the assassin-king; and Grunthor, the giant Sergeant-Major. Prophecy continues their powerful epic. Driven by a prophetic vision, Rhapsody races to rescue a religious leader while Achmed and Grunthor seek the F'dor-- an ancient and powerful demon. These companions may be destined to fulfill The Prophecy of the Three, but their time is running short. They must find their elusive enemy before his darkness consumes them all. DestinyA Fellowship of Three To stand against the F'dor-- an ancient, vile being intent on destroying the world-- a fellowship has been Rhapsody, a Singer of great talent and beauty; Achmed, an assassin with unearthly talents; and Grunthor, a giant of jolly disposition and lethal skill with weapons. Driven by prophetic visions, the three know that time is running short, know that they must find their elusive enemy before his darkness consumes them all. But after their final, brutal confrontation with the F'dor, their world crosses the threshold of disaster and faces utter oblivion. The action reaches a fevered pitch, achieving a crescendo of tragedy, love, and triumph of human spirit over world-shattering cataclysm. With death at hand and the world crumbling at their feet, these three will finally discover their true ... Destiny",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Fiction"
  ],
  "author": "Elizabeth Haydon",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/129314.The_Symphony_of_Ages_Boxed_Set_I"
}