{
  "title": "Cupid Can Suck It",
  "description": "Love sucks. Or so two coworkers think when they look out at all the sickening hearts and naked baby cupids stuck to everything that stands still on Hope Island. So, they decide to burn it down. The whole holiday. But when their pranks start to backfire on them, will the growing heat between them leave them both burned?Certified Public Accountant Molly Frasier is the oldest of four sisters. She also holds the record of the “Most appearances as Maid of Honor” in family and friend weddings. And everyone around her is starting to notice. She’s always hated dating but she hates nagging more. So, when her mom calls at the end of a particularly bad day at work, when she’s PMSing on top of that, she will say anything to get her mom off her back. Enter Dirk Dawson.The good-looking, confirmed bachelor foreman for Baskin Construction likes Molly. She’s funny and smart and she hates Valentine’s Day as much as he does. Maybe more than he does. When he walks into Molly’s office in the middle of her first panic attack, he’ll do anything to calm her down. Including posing as her fake boyfriend to get her parents off her back. It could be fun.Really fun, considering the plan they hatch to take their dating pressure revenge on their hometown of Hope Island and the hearts and roses they are trying to force-feed them. But when someone starts turning their harmless pranks deadly, they’ve got to watch each other’s backs . . . and fronts to make it through the holiday alive. They may be able to protect each other’s lives, but will their hearts get caught in the crossfire?Cupid Can Suck It is a small town friends-to-lovers fake relationship holiday romantic comedy with new adult aged MCs that will have you laughing out loud, tearing up, and always wanting more from this hilarious island community.This full novel contains profanity and is not a clean romance. It is a plot-focused, emotional slowburn HEA with realistic characters and no instalove. The MMC is a green flag / cinnamon roll hero. While part of the Hope Island Holiday Romance series, it can be read as a stand alone, and has no cliffhanger.Join the wacky residents of Hope Island today and dive into this fifth book in the Hope Island Holiday Romances!",
  "genres": [
    "Romance",
    "Holiday",
    "Contemporary"
  ],
  "author": "Teagan Hart",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/63106374-cupid-can-suck-it"
}