{
  "title": "Zorro: l'inizio della leggenda",
  "description": "Figlio del latifondista spagnolo Alejandro de la Vega e di Toypurnia, una bellissima india che prima di innamorarsi del marito era stata una specie di ‟guerrillera” ante litteram, Diego eredita dal padre il senso dell'onore e dalla madre la volontà di difendere gli oppressi.Legato da una fraterna e indissolubile amicizia a Bernardo, figlio della dama di compagnia della madre, trascorre un'infanzia serena. Alle soglie della giovinezza, accompagnato dal fedele amico Bernardo, viene mandato dal padre a studiare in Europa. Vengono accolti da Tomàs de Romeu, un vedovo illuminista, amico dei francesi bonapartisti che governano la Catalogna, che ha due giovani figlie, la bellissima Juliana e l'intrepida Isabel. Diego prende lezioni di scherma da Manuel Escalante che, oltre a essere un ottimo spadaccino, si rivelerà un membro del gruppo massonico ‟La Justicia” cui presto si affilierà anche de la Vega, con il ‟nome di battaglia” di Zorro (volpe in spagnolo). Intanto, Diego si innamora perdutamente di Juliana che, però, non lo ricambia e non ricambia nemmeno le attenzioni dell'altro pretendente, Rafael Moncada, destinato a divenire l'acerrimo nemico di Zorro. Diego non riesce a evitare che, con le sconfitte di Napoleone sul suolo iberico, Tomàs de Romeu venga imprigionato e fucilato, ma si fa carico delle ragazze e in seguito a uno scontro con Moncada è costretto a lasciare l'Europa. Dopo un seminaufragio a poche leghe dall'America, la nave viene assaltata dai pirati che prendono Diego e le ragazze come ostaggi. La situazione si ribalta quando Juliana s'innamora del corsaro che l'ha rapita e decide di rimanere con lui in Louisiana. Con il cuore spezzato, Diego torna in California e scopre che la regione è finita sotto il governo di Moncada, recatosi in America per ritrovare Juliana. Il suo primo atto giuridico è la confisca dei beni di Alejandro de la Vega e la sua incarcerazione. Nei panni di Zorro, e grazie al prezioso aiuto di Isabel e Bernardo, Diego riesce a liberare il padre e a cacciare Moncada dalla California.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Adventure",
    "Historical",
    "Romance",
    "Spanish Literature",
    "Book Club"
  ],
  "author": "Isabel Allende",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/6310301-zorro"
}