{
  "title": "Holmes Coming",
  "description": "The genius reappears, but is the twenty-first century ready for him?Dr. Amy Winslow tells the story: in foggy, nighttime San Francisco a jogging SFPD captain is savagely attacked by a Bengal tiger which then vanishes. In her ER, Amy labors unsuccessfully to save the captain’s life, then consoles his aggrieved closest friend, Lt. Luis Ortega. Neither suspects their lives will intertwine in a life-or-death mystery.The next day, checking on former patient Mrs. Hudson at her Victorian house isolated in Marin County’s forest, Amy discovers in the cellar a secret, cobweb-covered 1899 electrochemical laboratory containing a Jules Verne-esque steam-punk sarcophagus out of which springs a wild-eyed, half-mummified, crypt-keeper-like man who injects himself with something before falling dead at her feet. Amy barely revives him.He claims to be a real-life Victorian master chemist and detective named Holmes, who allowed Conan Doyle to write stories based on his cases, though was slightly annoyed when Doyle changed his real first name to the catchier Sherlock. Becoming uninspired by 1890s crime, Holmes devised this method to hibernate for a century to investigate future mysteries.Amy assumes he’s a lunatic. His Scotland Yard identity papers were stolen while he slept, so it takes her a while to realize his amazing story is true.Respectably handsome when cleaned up, Holmes is still the same brash, egoistic, uber-English, cocaine-addicted, non-feminist genius -- but now a century out of sync -- so his still-brilliant deductions are sometimes laughingly or dangerously wrong. Holmes and Amy, his reluctant new Watson, find themselves unexpectedly attracted to each other while perilously involved in reclaiming his proof of identity, aided by cybersavvy street teen Zapper. It’s all connected to the horrific death-by-tiger, only the first of several bizarre, mystifying murders being committed by an exquisitely fiendish descendant of Holmes’ Victorian archenemy, Professor Moriarty.The tone is classic Holmes -- plus a refreshing twist of fish-out-of-water humor with a surprising spark of real romance.",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Science Fiction",
    "Audiobook",
    "Time Travel",
    "Mystery Thriller"
  ],
  "author": "Kenneth C. Johnson",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/63101337-holmes-coming"
}