{
  "title": "Broken: A Love Story - Horses, Humans, and Redemption on the Wind River Indian Reservation",
  "description": "Writer Lisa Jones went to Wyoming for a four-day magazine assignment and came home four years later with a new life. At a dusty corral on the Wind River Indian Reservation, she met Stanford Addison, a Northern Arapaho who seemed to transform everything around him. He gentled horses rather than breaking them by force. It was said that he could heal people of everything from cancer toÊbipolar disorder. He did all this from a wheelchair; he had been a quadriplegic for more than twenty years. Intrigued, Lisa sat at Stanford's kitchen table and watched. She saw neighbors from the reservation and visitors from as far away as Holland bump up the dirt road to his battered modular home, seeking guidance and healing for what had broken in their lives. She followed him into the sweat lodge -- a framework of willow limbs covered with quilts -- where he used prayer and heat to shrink tumors and soothe agitated souls. Standing on his sun-blasted porch, pit bulls padding past her, she felt the vibration from thundering bands of Arabian horses that Stanford's young nephews brought to the ring to train. And she listened to his story. Stanford spent his teenage years busting broncs, seducing girls, and dealing drugs. At twenty, he left the house for another night of partying. By morning, a violent accident had robbed him of his physical prowess and left in its place unwelcome spiritual powers -- an exchange so shocking that Stanford spent several years trying to kill himself. But eventually he surrendered to his new life and mysterious gifts. Over the years Lisa was a frequent visitor to Stanford's place, the reservation and its people worked on her, exposing and healing the places where she, too, was broken. Broken entwines her story with Stanford's, exploring powerful spirits, material poverty, spiritual wealth, friendship, violence, confusion, death, and above all else,\"a love that comes before and after and above and below romantic love.\"",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Horses",
    "Native American",
    "Biography",
    "Animals",
    "Book Club"
  ],
  "author": "Lisa Jones",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/6310995-broken"
}