{
  "title": "The Marriage Auction",
  "description": "From #1 New York Times Bestselling Author Audrey Carlan, discover The Marriage Book TwoYou can now dive into the Kindle Vella phenomenon with over 2 MILLON READS. This saga has ranked #1 for over a full year and continues to break records each month as America’s favorite serial. Each volume contains more than 10% new content that includes two never before seen scenes from some of our favorite couples. \nWhat would you do for three million dollars?\nFour young women enter into a clandestine auction to be married to the highest bidders. For no less than a million dollars a year, for three years, each woman will do what it takes to secure her future. Entangled in a high-stakes game of money, lust, power, and the hope for absolution, this group of women becomes a sisterhood unlike any other.Once chosen by a man she’s never met and agrees to marry sight unseen…there is no going back. Hidden secrets, wicked desires, fiery couplings and intense family drama are all part of the deal when you willingly enter into The Marriage Auction.You may now kiss the bride…Reviews for The Marriage Audrey Carlan brings a whole lot of heat to the forced proximity trope along with a surprising sweetness that digs right in and takes hold! The Marriage Auction series is a compilation of passionate romances at their very best! Sexy, intriguing, and sprinkled with swoon-worthy moments, these romances kept me turning the pages late into the night! ~ New York Times bestselling author Rebecca ZanettiAudrey Carlan has taken a beautifully provocative premise and turned it into my unable-to-put-down series of the year! ~ New York Times bestselling author Jennifer ProbstAudrey is a phenomenal writer, and one of my favorite humans, and when I tell you that The Marriage Auction is some of the best writing I’ve read in a long time, well, it’s the truth! ~ New York Times bestselling author Kristen Proby",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Dark",
    "Fiction"
  ],
  "author": "Audrey Carlan",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/63112076-the-marriage-auction"
}