{
  "title": "Steel and Stone: The Curse of the Stone Keep",
  "description": "What if Prince Phillip failed to break Aurora's curse, and Hades whisked her away to his kingdom? A princess with a secret and a cursed kingdom to save.A mysterious illness has decimated the kingdom of Stonewall, snatching the king and queen’s lives. The barren Stone Keep is left in Princess Aurora’s hands, sustained only by the Steelborn’s coffers.But Aurora wants more than her kingdom’s survival. And to lift the curse that burdens her kingdom, she must dive into the Netherworld and beg for the Dark Prince's help. The catch is, none who’s traveled to the Realm of Death has ever made it back.Can she outwit the Dark Prince, and escape his island? And given the chance, will she want to?A broken prince striving to risk it all in the name of true love.When Aurora broke Prince Phillip’s heart, he vowed never to set foot in the Stone Keep. But when a coup rises against the crown of Whitehaven, the threat of war reopens his old wounds. Phillip must warn the kingdom of Stonewall.Chaos ensues upon his arrival as Princess Aurora is dragged to the Netherworld, kidnapped by a dark god. To rescue the princess, Phillip will need his captain’s help, as they plunge into a journey riddled with dangers—the worst of which is facing the Lord of the Netherworld himself.Will Phillip’s valiant heart conquer Aurora's and defeat the god of death?Steel and Stone is the second book in the Cursed Kingdoms series, packed with old gods, valiant heroes, and morally grey heroines. If you like Enemies to Lovers, Hades and Persephone’s mythos, and twisted fairytales, you’ll LOVE Steel and Stone!** This is a dark and steamy Sleeping Beauty retelling featuring morally grey heroes. This is an enemies-to-lovers and fated-mates story suitable for 18+. Steel and Stone is the second book in the Cursed Kingdoms series and the story will continue through future books. **Books in this series include:Ash and SnowSteel and StoneCinders and BloodFur and Thorns",
  "genres": [
    "Fantasy",
    "Fairy Tales"
  ],
  "author": "Silvana G. Sánchez",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/63107476-steel-and-stone"
}