{
  "title": "Anti-Inflammatory Diet Solution: Heal Your Immune System, Boost Your Brain, Strengthen Your Heart",
  "description": "The whole story about anti-inflammatory eating, good intestinal flora and how to change your lifestyle. Professor and legendary surgeon Stig Bengmark reveals his secrets in this beautifully illustrated, scientifically rigorous guide to living a longer, healthier life. Stig Bengmark is one of the foremost innovators and visionaries in Swedish medicine. After a long and celebrated career in medicine, as he found himself approaching old age, he realized there was no single source out there that could tell him how to simply live healthily. When a discovery is made in the field of nutritional research, fad diets arise, gain momentum, and ultimately get discarded by the public when the next discovery is made – but what does it all mean? Which dietary advice is sound, and which is based on conjecture?   In this book you will find the answer to questions such as: -           How do I make sense of anti-inflammatory eating? -           What is chronic inflammation, and how can I tell if I have it? -           Do I have to stop eating everything that’s tasty in order to live a healthy life? -           Should my plate be colour-coded? -           What are synbiotics? -           What is durra and how can it help me? -           How can I set myself up for success when grocery shopping? -           Should I want to diet? -           Is it possible to lose weight without falling into dangerous restrictions or gaining it all back later? -           What good, if any, does exercise even do? -           Keto, gluten-free or intermittent fasting – which way of eating is the best, and do I have to choose? For over 30 years professor Stig Bengmark has researched the impact of gut bacteria on general health. He knew of – and applied to his own life! – the benefits of anti-inflammatory eating well before news of it broke to mass audiences. At 90 years old he still lectures, writes and works. Now, his revolution has finally come. In this culmination of his life's work, beautifully illustrated by Sebastian Wadsted, Stig Bengmark shares the results of his research along with all his best advice, easy-to-follow strategy guides and practical recipes to help you make the right choices for you, your body and your lifestyle. In the end, it comes down to nothing less than longevity. Everyone can choose health. Your body, mind and immune system will thank you – as will your grandchildren!",
  "genres": [
    "Health"
  ],
  "author": "Stig Bengmark",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/63101874-anti-inflammatory-diet-solution"
}