{
  "title": "The Wonder That Was India: A Survey of the History and Culture of the Indian Sub-Continent before the coming of the Muslims",
  "description": "Indian civilization is among the oldest in the world, and what is unique in that respect is that the culture of the peoples still remains largely unchanged, with a strong thread of continuity through the ages.The Wonder That was India takes a look at the country's history from the time of the Harappan or Indus Valley Civilization. It explores the possible causes for the decline of the Harappan civilization and settlements. The book talks about the possibility of the Harappans having moved towards the south and settled in the peninsular region.The author also discusses the Aryan invasion theory, supporting it with various research papers and findings of that time. The evolution of Hindu religion is also talked about in this book--from the Harappan times, to the coming of the Aryans and the mutual influence that Hinduism and its off shoots Jainism and Buddhism had on each other.This book is comprehensive in its coverage of Indian history. It looks at every aspect of Indian society and culture. The Wonder That was India covers everything from religion, governance, social evolution, literary traditions, philosophy languages, and science.The author explores the significant role the Hindu religion played on the lives of the people. All the literary compositions of ancient times had religious associations. He also puts forward the theory that the European gypsies are of Indian origin.The Wonder That Was India also gives an insight into modern Indian society and culture, how it became a confluence of different influences from many a quarter throughout the many stages of its history.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Indian Literature",
    "Asia",
    "Cultural",
    "Research"
  ],
  "author": "A.L. Basham",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/631246.The_Wonder_That_Was_India"
}