{
  "title": "The Trail",
  "description": "A Transformative Journey on the John Muir TrailA NEXT GEN INDIE BOOK AWARD FINALISTSet authentically in the High Sierra, The Trail is a moving story showing how nature helps us find what’s missing in our lives.The Trail is fused with humor, philosophy, and trail lore. Woven in is a back story detailing the origins of the John Muir Trail: a 211-mile trail spanning the rooftop of the Sierra Nevada from Yosemite Valley to Mount Whitney, the highest peak in the continental United States.The tale begins with Gil, who In the wake of his father’s death and recently fired from his job, agrees to accompany his father’s old hiking partner Syd on a monthlong trek on the John Muir Trail. There’s just one problem: Gil hates camping and is woefully unprepared for the rigors of the journey. Moreover, he soon learns Syd may not survive the hike...Former Sierra Club leader Ethan Gallogly takes you on a wild tour across the Range of Light, describing its glorious scenery in vivid detail while introducing you to a diverse cast of characters drawn from his own personal experiences as a hiker.It’s a beautifully crafted book, with 43 maps and sketches by acclaimed mountain illustrator Jeremy Ashcroft, showing the topography of each section in clear three-dimensional renderings and peppered with drawings of the trail’s iconic scenery, like the Muir Hut, the Rock Monster, and Evolution Lake.Whether you’re planning your own John Muir Trail trek, have walked the trail before, or are simply an armchair explorer looking for a compelling story—this book is for you.Praise for The Trail“The author shines in his descriptions of the natural world... A subtle and vivid tale of finding peace in the great outdoors.”\n—Kirkus Reviews\n\"Unreservedly recommended.\"\n—Midwest Book Review\n“A Walk in the Woods meets Zen and the Art of Motorcycle Maintenance.”\n—Peter Snow Cao,\n Bike China Adventures“It’s a fantastic book. Everything rings true. I already have several people I plan to give copies to.”\n—Elizabeth Wenk,\n author of the best-selling John Muir Trail guidebook.“Ethan Gallogly has created a wonderful blend of High Sierra history, eloquent descriptions of the range’s glorious scenery, and fascinating vignettes of the diverse characters who roam the John Muir Trail.”\n—Steve Roper,\n author, mountaineer, and Sierra historian.“The Trail leaves the reader with a poignant picture of how nature can heal and reconstruct us.”\n—Alyssa Matesic,\n ASM EditorialAbout the AuthorEthan Gallogly, PhD (“Po”) has been a leader in the Sierra Club, the Cal Hiking and Outdoors Society (CHAOS) at UC Berkeley, and the Outdoors Club of Southern California. His boots have covered countless miles, including the John Muir Trail, the High Sierra Trail, the Oregon Section of the Pacific Crest Trail, the Tahoe–Yosemite Trail, and the Theodore Solomons Trail. He was a reviewer for the Wilderness Press guides: Sierra North, Sierra South, and Yosemite National Park and has read nearly every book on the history of the Sierra Nevada.Fans of Bill Bryson’s A Walk in the Woods, Ben Montgomery’s Grandma Gatewood’s Walk, and Eric Blehm’s The Last Season will love this new outdoors novel selected by Amazon as a Hot New Release.",
  "genres": [
    "Fiction",
    "Nature",
    "Travel",
    "Audiobook",
    "Adventure",
    "Outdoors"
  ],
  "author": "Ethan Gallogly",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/63134708-the-trail"
}