{
  "title": "Krwiopijcy",
  "description": "Jody nigdy nie prosiła, żeby zostać wampirem. Ale kiedy ocknęła się przy pojemniku na śmieci, z mocno poparzoną ręką, obolałą szyją, nadludzką siłą i typowym dla Nosferatu pragnieniem, zrozumiała, że decyzję podjęto za nią.Przestawienie się z codziennej harówki na niekończące się nocne polowania wymaga jednak nieco wysiłku, i tutaj przyda się Thomas C. Flood. Tommy (dla przyjaciół), niedoszły Kerouac z Incontinence w stanie Indiana, pracuje na nocną zmianę w supermarkecie w San Francisco. Wszystko się zmienia, gdy w drzwiach pojawia się rudowłosa, nieumarła istota... która wywołuje w jego życiu wstrząs, jakiego nigdy by się nie spodziewał.Christopher Moore, najwybitniejszy współczesny satyryk amerykański, stawiany w jednym szeregu z Kurtem Vonnegutem, Douglasem Adamsem i Jonathanem Swiftem.Jego książki okupują najważniejsze listy bestsellerów, a sam autor otoczony w Stanach Zjednoczonych podobnym kultem, jak Monty Python w Wielkiej Brytanii. Proza Moore’a to nie tylko rozrywka na najwyższym poziomie, ale także zabawne (i niezwykle celne) obserwacje i komentarze społeczne, obyczajowe, religijne oraz polityczne.Autor 9 powieści, w tym światowego bestselleru \"Lamb\", Chris urodził się w Toledo w stanie Ohio, a dorastał w Mansfield, w tym samym stanie. Jego ojciec był policjantem i patrolował autostrady, a matka sprzedawała sprzęt AGD w domu towarowym. Studiował na Uniwersytecie Stanowym w Ohio i Brooks Institute of Photography w Santa Barbara. W wieku 19 lat przeprowadził się do Kalifornii i mieszkał na wybrzeżu do 2003 roku, kiedy to przeniósł się na Hawaje.Przed wydaniem pierwszej książki w roku 1992 pracował jako dekarz, sprzedawca w sklepie spożywczym, rewident w hotelu, agent ubezpieczeniowy, kelner, fotograf i dyskdżokej. Chris czerpał z tych wszystkich doświadczeń, kreując bohaterów swoich książek. Kiedy nie pisze, lubi pływać kajakiem po oceanie, nurkować, fotografować i malować tuszem w technice sumi-e. Dzieli swój czas między Hawaje a San Francisco.",
  "genres": [
    "Humor",
    "Fiction",
    "Fantasy",
    "Vampires",
    "Paranormal",
    "Comedy",
    "Urban Fantasy"
  ],
  "author": "Christopher Moore",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/6313830-krwiopijcy"
}