{
  "title": "Sight Beyond the Sun",
  "description": "Separating truth from lies is impossible in the game of spies… especially the lies you tell yourself.A prison break.Adrenaline junkie and explosives specialist Kinsley “Switch” Morales had a chip on her shoulder long before being caught in what she suspects is some sort of intergalactic human-trafficking ring. Aliens not only exist, their reptilian bodies are stronger, their honed reflexes faster, and their shiny scales nearly impenetrable. But nothing will curb Kinsley’s resolve to commandeer their spaceship and return home to Earth—even if that means crawling behind enemy lines and cozying up to their uncompromising captain.An undercover mission.When Raveno Hoviir catches Kinsley outside her cell, wreaking havoc in his control room, he sees more than just her strength, resolve, and courage. He sees a golden opportunity to finally root out the traitor under his command and prove his brother’s loyalty before the coming revolution. After so many years undercover, Raveno is finally one mission away from saving his planet from its tyrannical ruler. He’s sacrificed everything to protect his people—his love life, his anonymity, his left leg—but in his efforts to right his father’s wrongs, has he inadvertently become the very monster he plans to overthrow?An unlikely alliance.As Kinsley and Raveno each attempt to exploit the other, they find more than just leverage for their separate missions. Inexplicably, they find common ground in their mutual devotion to family and service. Kinsley knows all too well the grief and guilt of making the wrong decision in the field, but will Raveno keep his word to send her home if she flips loyalties? Is Raveno’s softening heart compromising his judgment, or is Kinsley’s intelligence accurate? Separating truth from lies is impossible in the game of spies. Seeing beyond their surface differences and trusting in love again may be the only way to save both their people—and each other.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Aliens",
    "Enemies To Lovers",
    "Science Fiction Romance",
    "M F Romance",
    "Slow Burn"
  ],
  "author": "Melody   Johnson",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/63139918-sight-beyond-the-sun"
}