{
  "title": "The Once and Future Sex: Going Medieval on Women's Roles in Society",
  "description": "A “provocative, colloquial and entertaining” (Carolyne Larrington, Times Literary Supplement) exploration of medieval thinking about women’s beauty, sexuality, and behavior.“A timely corrective…Ms. Janega’s witty but merciless dissection of medieval misogyny is a welcome challenge to us to stop recycling the same old prejudices.”—Elizabeth Lowry, Wall Street JournalWhat makes for the ideal woman? How should she look, love, and be? In this vibrant, high-spirited history, medievalist Eleanor Janega turns to the Middle Ages, the era that bridged the ancient world and modern society, to unfurl its suppositions about women and reveal what’s shifted over time—and what hasn’t.Enshrined medieval thinkers, almost always male, subscribed to a blend of classical Greek and Roman philosophy and Christian theology for their concepts of the sexes. For the height of female attractiveness, they chose the mythical Helen of Troy, whose imagined pear shape, small breasts, and golden hair served as beauty’s epitome. Casting Eve’s shadow over medieval women, they derided them as oversexed sinners, inherently lustful, insatiable, and weak. And, unless a nun, a woman was to be the embodiment of perfect motherhood.In contrast, drawing on accounts of remarkable and subversive medieval women like Eleanor of Aquitaine and Hildegard of Bingen, along with others hidden in documents and court cases, Janega shows us how real women of the era lived. While often mothers, they were industrious farmers, brewers, textile workers, artists, and artisans and paved the way for new ideas about women’s nature, intellect, and ability.In The Once and Future Sex, Janega unravels the restricting expectations on medieval women and the ones on women today. She boldly questions why, if our ideas of women have changed drastically over time, we cannot reimagine them now to create a more equitable future.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Medieval",
    "Audiobook",
    "Womens",
    "Historical"
  ],
  "author": "Eleanor Janega",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/63141930-the-once-and-future-sex"
}