{
  "title": "Lost Boy",
  "description": "In the polygamous Fundamentalist Church of Jesus Christ of Latter-day Saints (FLDS), girls can become valuable property as plural wives, but boys are expendable, even a liability. In this powerful and heartbreaking account, former FLDS member Brent Jeffs reveals both the terror and the love he experienced growing up on his prophet’s compound—and the harsh exile existence that so many boys face once they have been expelled by the sect.Brent Jeffs is the nephew of Warren Jeffs, the imprisoned leader of the FLDS. The son of a prominent family in the church, Brent could have grown up to have multiple wives of his own and significant power in the 10,000-strong community. But he knew that behind the group’s pious public image—women in chaste dresses carrying babies on their hips—lay a much darker reality. So he walked away, and was the first to file a sexual-abuse lawsuit against his uncle. Now Brent shares his courageous story and that of many other young men who have become “lost boys” when they leave the FLDS, either by choice or by expulsion.Brent experienced firsthand the absolute power that church leaders wield—the kind of power that corrupts and perverts those who will do anything to maintain it. Once young men no longer belong to the church, they are cast out into a world for which they are utterly unprepared. More often than not, they succumb to the temptations of alcohol and other drugs.Tragically, Brent lost two of his brothers in this struggle, one to suicide, the other to overdose. In this book he shows that lost boys can triumph and that abuse and trauma can be overcome, and he hopes that readers will be inspired to help former FLDS members find their way in the world.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Religion",
    "Cults",
    "Biography",
    "True Crime",
    "Polygamy"
  ],
  "author": "Brent W. Jeffs",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/6314709-lost-boy"
}