{
  "title": "The Secret of the Sacred Scarab",
  "description": "In this exciting Middle Grade adventure set in Egypt, a 5000-year-old mystery comes to life. A scruffy peddler gives Adam and Justin Sinclair an old Egyptian scarab on their very first day in Egypt. Only when the evil Dr. Faisal Khalid shows a particular interest in the cousins and their scarab, do the boys realise they are in terrible danger. Dr. Khalid wants the relic at all costs. Justin and Adam embark upon the adventure of a lifetime, taking them down the Nile and across the harsh desert in their search for the legendary tomb of the Scarab King, an ancient Egyptian ruler. They are plunged into a whirlpool of hazardous and mysterious events when Dr. Khalid kidnaps them. They learn more about the ancient Seven Stones of Power and the mysterious Shemsu-Hor. They must translate the hieroglyphic clues on the underside of the scarab, as well as rescue the missing archaeologist James Kinnaird, and their friend, the Egyptologist Ebrahim Faza, before time runs out!The Secret of the Sacred Scarab is the kind of adventure book boys and girls love! The fast-paced action, the evil villain readers delight in hating, the secrets of the past, and the mysterious ancient setting make this novel a sure-hit favorite for all the young and adventurous at heart. Ingram's impeccable and fascinating research into Egyptian history illuminates the adventure and makes the secrets of Egypt's past as thrilling to the reader as the boys' dangerous encounters. Book Award Nominations & ·         Finalist Children's Fiction  USA Next Generation 2009 Indie Book Awards·         Finalist Juvenile Fiction USA National Best Books 2009 Awards·         Winner Pre-Teen USA 2009 Readers' Favorites Awards·         Number 2 in the USA Children's & Teens Book Connection Top Ten Favourite Books of 2009 for Kids, Tweens & Teens·         Winner Silver Medal Teen Fiction 2010 Nautilus Book Awards·         Finalist Children's Fiction 2010 International Book Awards·         Winner Bronze Medal Pre-Teen Fiction 2010 Moonbeam Book Awards·         Finalist 2011 Rubery Book Awards·         Winner Gold Award Mystery Pre-Teen 2011 Children's Literary Classics Awards·         2nd Place in the 2011 YA Sharpwrit Book Awards·         Gold Medal 2013 Wise Bear Book Awards WinnerFor colouring-in enthusiasts, nine original black and white illustrations including a map make for more enjoyment!",
  "genres": [
    "Middle Grade",
    "Adventure",
    "Childrens",
    "Historical Fiction",
    "Historical",
    "Mystery"
  ],
  "author": "Fiona  Ingram",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/6315891-the-secret-of-the-sacred-scarab"
}