{
  "title": "The State of Jones: The Small Southern County That Seceded from the Confederacy",
  "description": "New York Times bestselling author Sally Jenkins and distinguished Harvard professor John Stauffer mine a nearly forgotten piece of Civil War history and strike gold in this surprising account of the only Southern county to secede from the Confederacy.The State of Jones is a true story about the South during the Civil War—the real South. Not the South that has been mythologized in novels and movies, but an authentic, hardscrabble place where poor men were forced to fight a rich man’s war for slavery and cotton. In Jones County, Mississippi, a farmer named Newton Knight led his neighbors, white and black alike, in an insurrection against the Confederacy at the height of the Civil War. Knight’s life story mirrors the little-known story of class struggle in the South—and it shatters the image of the Confederacy as a unified front against the Union.This riveting investigative account takes us inside the battle of Corinth, where thousands lost their lives over less than a quarter mile of land, and to the dreadful siege of Vicksburg, presenting a gritty picture of a war in which generals sacrificed thousands through their arrogance and ignorance. Off the battlefield, the Newton Knight story is rich in drama as well. He was a man with two loves: his wife, who was forced to flee her home simply to survive, and an ex-slave named Rachel, who, in effect, became his second wife. It was Rachel who cared for Knight during the war when he was hunted by the Confederates, and, later, when members of the Knight clan sought revenge for the disgrace he had brought upon the family name.Working hand in hand with John Stauffer, distinguished chair and professor of the History of American Civilization at Harvard University, Sally Jenkins has made the leap from preeminent sportswriter to a historical writer endowed with the accuracy, drive, and passion of Doris Kearns Goodwin. The result is Civil War history at its finest.",
  "genres": [
    "History",
    "Nonfiction",
    "Civil War",
    "American History",
    "American Civil War",
    "War",
    "Biography"
  ],
  "author": "Sally Jenkins",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/6314749-the-state-of-jones"
}