{
  "title": "Renegade: The Making of a President",
  "description": "Before the White House and Air Force One, before the TV ads and the enormous rallies, there was the real Barack a man wrestling with the momentous decision to run for the presidency, feeling torn about leaving behind a young family, and figuring out how to win the biggest prize in politics.This book is the previously untold and epic story of how a political newcomer with no money and an alien name grew into the world’s most powerful leader. But it is also a uniquely intimate portrait of the person behind the iconic posters and the Secret Service code name Renegade.Drawing on a dozen unplugged interviews with the candidate and president, as well as twenty-one months covering his campaign as it traveled from coast to coast, Richard Wolffe answers the simple yet enduring question about Barack Who is he?Based on Wolffe’s unprecedented access to Obama, Renegade reveals the making of a president, both on the campaign trail and before he ran for high office. It explains how the politician who emerged in an extraordinary election learned the personal and political skills to succeed during his youth and early career. With cool self-discipline, calculated risk taking, and simple storytelling, Obama developed the strategies he would need to survive the onslaught of the Clintons and John McCain, and build a multimillion-dollar machine to win a historic contest.In Renegade , Richard Wolffe shares with us his front-row seat at Obama’s announcement to run for president on a frigid day in Springfield, and his victory speech on a warm night in Chicago. We fly on the candidate’s plane and ride in his bus on an odyssey across a country in crisis; stand next to him at a bar on the night he secures the nomination; and are backstage as he delivers his convention speech to a stadium crowd and a transfixed national audience. From a teacher’s office in Iowa to the Oval Office in Washington, we see and hear Barack Obama with an immediacy and honesty never witnessed before.Renegade provides not only an account of Obama’s triumphs, but also examines his many personal and political trials. We see Obama wrestling with race and politics, as well as his former pastor Reverend Jeremiah Wright. We see him struggling with life as a presidential candidate, a campaign that falters for most of its first year, and his reaction to a surprise defeat in the New Hampshire primary. And we see him relying on his personal experience, as well as meticulous polling, to pass the presidential test in foreign and economic affairs.Renegade is an essential guide to understanding President Barack Obama and his trusted inner circle of aides and friends. It is also a riveting and enlightening first draft of history and political psychology.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Biography",
    "History",
    "Presidents",
    "Us Presidents",
    "American History"
  ],
  "author": "Richard Wolffe",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/6314734-renegade"
}