{
  "title": "Pretty Little Picture",
  "description": "Pretty Little Picture is the second book in the Gorgeous, Armed, and Dangerous series.~~~~~Driven to leave her home of ten years by her persistent and toxic ex, Quinn lands her dream job in Colorado. Hoping the distance between Chicago and the small mountainside town will be far enough that he won’t find her. As the new Event Coordinator and Manager for Cardinal Hideaway, Quinn gets to enjoy world-class food while being surrounded by the most amazing mountain views. The visiting artist that just showed isn’t too bad to look at either.Lukas is at the top of his game when it comes to surveillance, security, and keeping his family safe. When he gets his first art commission, it’s the perfect chance to prove his art is more than a hobby. As he arrives at the mountainside resort of Cardinal Hideaway, he instantly finds his muse. Only it isn’t just the mountain views, but the bombshell redhead who happens to work at the resort.However, Lukas doesn’t do relationships. It rarely ends well for someone in his line of work, but he can’t resist her. Just as things heat up between Quinn and Lukas, her wished-to-be-forgotten ex invades her new life, causing her safety bubble to pop.Lukas and Quinn are now intertwined as their worlds collide in a way neither of them expected.Between Quinn’s stubborn will to be self-sufficient and Lukas’s overprotective nature, will they be able to find balance and keep each other safe?~~~~~~Content warning:Pretty Little Picture is a suspense romance, and some elements have a mafia flair to them. That being said, there is adult content in this book, including but not limited to abduction, physical violence, gun violence, stalking, on-page death, offensive language, mental health struggles, alcohol struggles, and non fade to black romantic scenes.For readers sensitive to these elements, please take note.~~~~~~This is a connected stand-alone with an HEA.",
  "genres": [],
  "author": "Elisabeth Garner",
  "average_rating": "4.84",
  "url": "https://www.goodreads.com/book/show/63159647-pretty-little-picture"
}