{
  "title": "i$UBSCRIBE",
  "description": "Introduction & warning***Summon up your philosophical side before perusing this book. There are strong metaphysical and abstract approaches to this narrative*** FIXING A GLITCH ends the possibility of an alien ever realizing his destiny. He resurrects her from her scattered memories. The only trouble is that she is a prime image of his dark but gifted side. One sustains mysticism, and another promotes prosperity. On the way to standardizing the earthly state, he ends the bodily dependency of the human species.Extinction of our species is possible not by natural disasters or inventions but by a fabricated organic phenomenon. What if it becomes a certainty, and we can’t tell the difference between real and virtual? It may be that our indigenous intelligence is our savior that puts a stop to our thought-driven obsession with progress. Who’s to say that our knight in shining armor is not an alien race. In the end, it may just be a random stroke of luck that saves us. Trip forward with SamVeer Eckhart into events of a parallel Earth. To find out if he succeeded in his infatuated undertaking. The risks are endless, even if the end is the same. Exchange – As articulated heavily in my previous work, my metaphysical viewpoint conceptualized another way to communicate – waving. This model is used in the following story and is bolded and italicized to keep it separate from typical ‘thinking’ expressions.  Triggers – This story has a radical take on many societal & religious customs. If you are a victim of rape, incest, or opinionated on the subject of sex workers, please walk away. This book seeks a diverse perspective on such matters.This is a standalone work of fiction and can be read on its own. i$UBSCRIBE – Gen Verismo Genesis is the concluding take from the ALL KAAL NONE series chapter – Human Eradication.",
  "genres": [],
  "author": "P.B. Flower",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/63168809-i-ubscribe"
}