{
  "title": "The Anatomy of Bibliomania",
  "description": "An unmitigated delight for any bibliophile, Holbrook Jackson's musings on the joys of reading combine his irrepressible wit with the wisdom of famous readers from all corners of the world. These three volumes, now back in print, are a leisurely, luxuriant confabulation on \"the usefulness, purpose, and pleasures that proceed from books.\" In The Anatomy of Bibliomania, Jackson inspects the allure of books, their curative and restorative properties, and the passion for them that leads to bibliomania (\"a genial mania, less harmful than the sanity of the sane\"). His sparkling commentary addresses why we read, where we read (on journeys, at mealtimes, on the toilet—this has \"a long but mostly unrecorded history\"—in bed, and in prison) and what happens to us when we read. He touches on bindings, bookworms, libraries, and the sport of book hunting, as well as the behavior of borrowers, embezzlers, thieves, and collectors. Francis Bacon, Anatole France, Oliver Wendell Holmes, Leigh Hunt, Marcel Proust, Ralph Waldo Emerson, William Shakespeare, and scores of other luminaries chime in on books and their love for them. Violent reactions to books, whether from jealous wives, political hacks, or righteous church leaders, indicate books' power over readers and their ability to inspire change. The Fear of Books interweaves Jackson's thoughts with the words of others to consider the trials and tribulations—burning, pulping, shredding, and censoring—to which books have been subjected throughout history and the fears that lead to such behavior. In The Reading of Books, Jackson focuses on the relationship between author and reader, describing reading as \"the art of extracting essences from books for our own, not the author's benefit.\" Reading should be \"a courtship ending in a collaboration\"—a creative process in which readers not only share the writers' aesthetic experiences but also distill them into something more personal. As Jackson says, reading is not a duty, and if it is not a pleasure it is a waste of time. Entertaining as well as instructive, his \"books on books\" provide inveterate readers with all things needful: vindication, inspiration, cogitation, and delectation. \"Mr. Jackson's cross-lights and unexpected illuminations are fascinating . . . among all his good things from other writers, his own good things should not be overlooked.\" — The Times Literary Supplement\"The Reading of Books is a library in itself and will be a constant source of pleasure to all who give themselves the satisfaction of owning a copy.\" —E. M. Sowerby, Christian Science Monitor",
  "genres": [
    "Books About Books",
    "Nonfiction",
    "History",
    "Essays",
    "Literary Criticism",
    "Language",
    "Writing"
  ],
  "author": "Holbrook Jackson",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/6320067-the-anatomy-of-bibliomania"
}