{
  "title": "The Natural Order of Money",
  "description": "The Natural Order of Money is about the intrinsic relationship between people, money, and nature. The book begins by asking a simple question: Why do we in our modern society expect food as if it were a given? What initially makes cooperation between the farmer and other members of society possible, and what, in the long run, renders it sustainable? The proposed solution affirms the vital importance of the farmer and the food that he harvests and argues that only a natural money can serve as the concrete means of assuring ecological accountability and sustainable prosperity. In a time of uncertainty plagued by wealth inequality, inflation, and environmental stress, The Natural Order of Money pierces the fog of financial elitism and re-establishes society in our shared home of nature. It equips the reader with a compass to again find True North in a sea of economic confusion.The Natural Order of Money is written to be accessible to any reader while also engaging experts in the realm of social science. The book presents a novel, philosophical account of money and its connection to the natural world. Its theory of 'ecological accountability' will interest those who are critical of modern capitalism, and those who are environmentally conscious and seek an economic theory which prioritizes sustainability. The arguments in the book offer a challenge to current political ideas on the right and left. Although written to be timeless, the book touches on many topics (such as inflation, wealth inequality, and unsustainable economic policy) that have recently come to dominate economic and political discourse. Anyone who has an interest in these disconcerting problems of our time will find new ideas in this book. The Natural Order of Money has the potential to inspire professionals, academics, and ordinary readers, and so ignite a wider cultural conversation.This book itself is a beautiful work of art. It is a clothbound hardcover with gold foil blocking and ribbon markers. Each book has been printed and bound in Great Britain in the city of Oxford by one of the few remaining artisan bookbinders in the world.",
  "genres": [
    "Economics",
    "Philosophy",
    "Nonfiction",
    "Finance",
    "Business",
    "Money",
    "Society"
  ],
  "author": "Roy Sebag",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/63206614-the-natural-order-of-money"
}