{
  "title": "Gentlemen Prefer Villains",
  "description": "SimonI needed to get the hell out of Big City.The only reason I was living in this American wasteland was because my mother insisted I reconcile with my estranged father. That the idea came to her while drunk on the French bubbly should have been my sign to stay right where I belonged.Anywhere but here. Certainly somewhere more fabulous.When an international job opportunity arises, I jump on board. It’s just a bonus that I’ll be traveling with the epitome of tall, dark, and handsome.Make that muscular, morally gray, and hopefully, my next conquest.What’s a casual fling between coworkers, after all? I’m ready for my next big adventure—far from Big City—so if whatever we’re up to is vaguely illegal, I’ll simply turn the other cheek.It’s not like some superhero is going to swoop in and stop a couple of humans like us.WolfgangI may have orchestrated my villainous parents’ deaths, but that doesn’t mean the crushing weight of my responsibilities is easy to bear.My sister was the only one of my siblings who knew how badly they treated me. The only one I told how much I despise my powers. Now she’s on the run—leaving me to carry this alone.But then I meet him. I may have hired Simon Alarie as my assistant, but it’s instantly apparent he’s much more than that. He’s not only intelligent and business savvy, but fiercely loyal, and the tastiest—most forbidden—little thing I’ve ever seen.Nothing can come of it. Because if I touch him, he dies.That doesn’t stop me from claiming him as mine. Whether or not this normie knows it, every inch of him—every breath he takes—belongs to me. And anyone who thinks otherwise will meet the Hand of Death.---Gentlemen Prefer Villains is an MM romance between a villain and a \"normie.\" Our men find other men in tight supersuits incredibly attractive. Sometimes, they keep these supersuits on while engaging in explicit extracurricular activities with each other (and sometimes they even use bad words!). This is not your kid’s superhero book. This is Sin City and The Boys having a love child with extra spicy Spideypool and is meant for 18+ adults who can handle such things.The Villainous Things series contains standalone books (each with HEAs) that feature interconnected characters and an overarching plot. You should read them in order (starting with Not All Himbos Wear Capes)---IF YOU LOVE (full list of CW/TW coming soon to the authors' webpage)• Superheroes/villains (and the “normies” who love them)• Big skerry boss + his sassy li’l assistant (SIZE DIFFERENCE)• Mafia vibes• Touch Him & Perish vibes too• Casual psychopaths with mutual obsession• SO MUCH TENSION• Leather• Extra spicy extracurricular activities• Naughty dark humor + sweary dialogue• MM romance (in case you missed that part)• A James Bond meets Catch Me If You Can international rompThen shake your martini and power up!",
  "genres": [
    "M M Romance",
    "Romance",
    "Fantasy",
    "Paranormal",
    "BDSM",
    "LGBT",
    "Superheroes"
  ],
  "author": "C. Rochelle",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/63219340-gentlemen-prefer-villains"
}