{
  "title": "Diana: Portrait of a Princess",
  "description": "Diana. From her first exposure to the world as the fiancee of the future King of England to her death as perhaps the most revered figure of the century, she captured the imagination and the love of literally hundreds of millions of people. And, from her first portrait of Lady Diana Spencer in 1980 to her last shoot months before Diana's tragic death and finally to Diana's funeral, Jayne Fincher -- the only female royal photographer working with the explicit approval and full cooperation of Buckingham Palace -- was there. Granted unprecedented access to the Princess of Wales and the extended royal family for 18 years, Fincher amassed an enormous archive of more than 30,000 striking images of Diana.She captured on film Diana's transformation from a shy, awkward teenager to an elegant and sophisticated woman. Diana: Portrait of a Princess collects in one spectacular volume for the first time ever the best of these extraordinary photographs. Here are some of the most famous images of Diana ever published...and here also are hundreds of never-before-seen candids, outtakes, and portraits, the definitive photographic document of Diana's life -- as fiance, wife, and then ex-wife of the Prince of Wales; as mother to princes William and Harry; as philanthropist, as ambassador, as fashion muse. But more than a simple collection of images, Diana: Portrait of a Princess is a personal and deeply felt memoir with behind-the-scenes insight into the moods and complex personality of Diana. This narrative, a collaborative effort with royal writer Judy Wade, incorporates detailed impressions and experiences gathered in photographing the Princess. Featuring more than 500 pictures -- three-quarters of them never before seen -- and including dozens of revealing anecdotes, Diana: Portrait of a Princess is all exquisite tribute to a woman who carried the hearts of the world in the palm of her hand.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Photography"
  ],
  "author": "Jayne Fincher",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/632113.Diana"
}