{
  "title": "One for the Money",
  "description": "Watch out, world. Here comes Stephanie Plum, a bounty hunter with attitude. In Stephanie's opinion, toxic waste, rabid drivers, armed schizophrenics, and August heat, humidity, and hydrocarbons are all part of the great adventure of living in Jersey.  She's a product of the \"burg,\" a blue-collar pocket of Trenton where houses are attached and narrow, cars are American, windows are clean, and (God forbid you should be late) dinner is served at six.  Now Stephanie's all grown up and out on her own, living five miles from Mom and Dad's, doing her best to sever the world's longest umbilical cord. Her mother is a meddler, and her grandmother is a few cans short of a case.  Out of work and out of money, with her Miata repossessed and her refrigerator empty, Stephanie blackmails her bail bondsman cousin, Vinnie, into giving her a try as an apprehension agent. Stephanie knows zilch about the job requirements, but she figures her new pal, fearless bounty hunter Ranger, can teach her what it takes to catch a crook.  Her first nail Joe Morelli, a former vice cop on the run from a charge of murder one. Morelli is also the irresistible macho pig who took Stephanie's virginity at age sixteen and then wrote the details on the bathroom wall of Mario's Sub Shop. There's still powerful chemistry between these two, so the chase should be interesting.  It could also be extremely dangerous, especially when Stephanie encounters a heavyweight title contender who likes to play rough. Benito Ramirez is known for his brutality to women. At the very least, his obsession with Stephanie complicates her manhunt and brings terror and uncertainty into her life. At worst, it could lead to murder.  Witty, fresh, and full of surprises, One for the Money is among the most eagerly awaited crime novels of the season.",
  "genres": [
    "Mystery",
    "Fiction",
    "Humor",
    "Chick Lit",
    "Romance",
    "Crime",
    "Audiobook"
  ],
  "author": "Janet Evanovich",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/6324739-one-for-the-money"
}