{
  "title": "The Road to Disunion: Volume I: Secessionists at Bay, 1776-1854",
  "description": "Far from a monolithic block of diehard slave states, the South in the eight decades before the Civil War was, in William Freehling's words, \"a world so lushly various as to be a storyteller's dream.\" It was a world where Deep South cotton planters clashed with South Carolina rice growers, where the egalitarian spirit sweeping the North seeped down through border states already uncertain about slavery, where even sections of the same state (for instance, coastal and mountain Virginia) divided bitterly on key issues. It was the world of Jefferson Davis, John C. Calhoun, Andrew Jackson, and Thomas Jefferson, and also of Gullah Jack, Nat Turner, and Frederick Douglass.  Now, in the first volume of his long awaited, monumental study of the South's road to disunion, historian William Freehling offers a sweeping political and social history of the antebellum South from 1776 to 1854. All the dramatic events leading to secession are here: the Missouri Compromise, the Nullification Controversy, the Gag Rule (\"the Pearl Harbor of the slavery controversy\"), the Annexation of Texas, the Compromise of 1850, and the Kansas-Nebraska Act. Freehling vividly recounts each crisis, illuminating complex issues and sketching colorful portraits of major figures. Along the way, he reveals the surprising extent to which slavery influenced national politics before 1850, and he provides important reinterpretations of American republicanism, Jeffersonian states' rights, Jacksonian democracy, and the causes of the American Civil War.  But for all Freehling's brilliant insight into American antebellum politics, Secessionists at Bay is at bottom the saga of the rich social tapestry of the pre-war South. He takes us to old Charleston, Natchez, and Nashville, to the big house of a typical plantation, and we feel anew the tensions between the slaveowner and his family, the poor whites and the planters, the established South and the newer South, and especially between the slave and his master, \"Cuffee\" and \"Massa.\" Freehling brings the Old South back to life in all its color, cruelty, and diversity. It is a memorable portrait, certain to be a key analysis of this crucial era in American history.",
  "genres": [
    "History",
    "Civil War",
    "American History",
    "Nonfiction",
    "Politics",
    "American Civil War",
    "War"
  ],
  "author": "William W. Freehling",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/632380.The_Road_to_Disunion"
}