{
  "title": "The Women Who Raised Me: A Memoir",
  "description": "The story of a remarkable woman's rise out of the foster-care system to attain the American dream—and of the unlikely series of women who lifted her up in marvelous and distinctive waysBorn as a ward of the state of Maine—the child of an unmarried Yankee blueblood mother and an unknown black father—Victoria Rowell beat the odds. Unlike so many other children who fall through the cracks of our overburdened foster-care system, her experience was nothing short of miraculous, thanks to several extraordinary women who stepped forward to love, nurture, guide, teach, and challenge her to become the accomplished actress, philanthropist, and mother that she is today.Rowell spent her first weeks of life as a boarder infant before being placed with a Caucasian foster family. Although her stay lasted for only two years, at this critical stage Rowell was given a foundation of love by the first of what would be an amazing array of women, each of whom presented herself for different purposes at every dramatic turn of Rowell's life.In this deeply touching memoir, Rowell pays tribute to her personal champions: the mothers, grandmothers, aunts, mentors, teachers, and sisters who each have fascinating stories to tell. Among them are Agatha Armstead, Rowell's longest-term foster mother, a black Bostonian on whose rural Maine farm Rowell's fire to reach for greatness was lit; Esther Brooks, a Paris-trained prima ballerina, Rowell's first mentor at the Cambridge School of Ballet; Rosa Turner, a Boston inner-city fosterer who taught Rowell lessons of independence; Sylvia Silverman, a mother and teacher whose home in a well-kept middle-class suburban neighborhood prepared Rowell for her transition out of foster care and into New York City's wild worlds of ballet and acting and adulthood.In spite of support from individuals and agencies, Rowell nonetheless carried the burden of loneliness and anxiety, common to most foster children, particularly those \"orphans of the living\" who are never adopted. Heroically overcoming those obstacles, Rowell also reaches a moment when she can embrace her biological mother, Dorothy, and, most important, accept herself.Ultimately, The Women Who Raised Me is a story that belongs to each of us as it shines a glowing light on the transformational power of mentoring, love, art, and womanhood.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Adoption",
    "Biography Memoir",
    "Biography",
    "Fostering",
    "Audiobook"
  ],
  "author": "Victoria Rowell",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/632483.The_Women_Who_Raised_Me"
}