{
  "title": "The Time for Love (The Cynster Next Generation Series)",
  "description": "#1 New York Times bestselling author Stephanie Laurens explores what happens when a gentleman intent on acquiring a business meets the unconventional lady-owner, only to discover that she is not the biggest or the most lethal hurdle they and the business face.Martin Cynster arrives at Carmichael Steelworks set on acquiring the business as the jewel in his industrialist’s crown, only to discover that the lady owner is not at all what he expected.Miss Sophia Carmichael learned about steelmaking at her father’s knee and, having inherited the major shareholding, sees no reason not to continue exactly as she is—running the steelworks and steadily becoming an expert in steel alloys. When Martin Cynster tracks her down, she has no option but to listen to his offer—until impending disaster on the steelworks floor interrupts.Consequently, she tries to dismiss Martin, but he’s persistent, and as he has now saved her life, gratitude compels her to hear him out. And day by day, as his understanding of her and the works grows, what he offers grows increasingly tempting, until a merger, both business-wise and personal, is very much on their cards.But a series of ever-escalating incidents makes it clear someone else has an eye on the steelworks. The quest to learn who and why leads Martin and Sophy into ever greater danger as, layer by layer, they uncover a diabolical scheme that, ultimately, will drain the lifeblood not just from the steelworks but from the city of Sheffield as well.A classic historical romance, incorporating adventure and intrigue, set in Sheffield. A Cynster Next Generation novel. A full-length historical romance of 100,000 words.",
  "genres": [
    "Romance",
    "Historical",
    "Historical Romance",
    "Historical Fiction",
    "Audiobook",
    "Mystery"
  ],
  "author": "Stephanie Laurens",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/63229984-the-time-for-love-the-cynster-next-generation-series"
}