{
  "title": "How to End a Love Story",
  "description": "A REESE'S BOOK CLUB PICK!“Emotional, relatable and binge-worthy.\" –Tessa Bailey“I’ll read anything she writes. An absolute star.\" –Emily Henry“I was hooked on the very first page. Don't miss this one!\" — Carley FortuneTwo writers with a complicated history end up working on the same TV show. Can they write themselves a new ending? A sexy and emotional enemies-to-lovers romance guaranteed to pull on your heartstrings and give you a book hangover from brilliant new voice Yulin KuangHelen Zhang hasn’t seen Grant Shepard once in the thirteen years since the tragic accident that bound their lives together forever.Now a bestselling author, Helen pours everything into her career. She’s even scored a coveted spot in the writers’ room of the TV adaptation of her popular young adult novels, and if she can hide her imposter syndrome and overcome her writer’s block, surely the rest of her life will fall into place too. LA is the fresh start she needs. After all, no one knows her there. Except…Grant has done everything in his power to move on from the past, including building a life across the country. And while the panic attacks have never quite gone away, he’s well liked around town as a screenwriter. He knows he shouldn’t have taken the job on Helen’s show, but it will open doors to developing his own projects that he just can’t pass up.Grant’s exactly as Helen remembers him—charming, funny, popular, and lovable in ways that she’s never been. And Helen’s exactly as Grant remembers too—brilliant, beautiful, closed off. But working together is messy, and electrifying, and Helen’s parents, who have never forgiven Grant, have no idea he’s in the picture at all.When secrets come to light, they must reckon with the fact that theirs was never meant to be any kind of love story. And yet… the key to making peace with their past—and themselves—might just lie in holding on to each other in the present.",
  "genres": [
    "Romance",
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Contemporary Romance",
    "Adult",
    "Chick Lit"
  ],
  "author": "Yulin Kuang",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/63247365-how-to-end-a-love-story"
}