{
  "title": "Παραμύθι χωρίς όνομα",
  "description": "Το \"Παραμύθι χωρίς όνομα\" γράφτηκε σε μια εποχή πολιτικά ταραγμένη για την Ελλάδα. Η ήττα του 1897 ήταν ακόμα νωπή, το καθεστώς ασταθές, άνθιζε η διαφθορά, η εκπαίδευση δεν ανταποκρινόταν στις ευρωπαϊκές αντιλήψεις περί παιδαγωγικής. Από την άλλη, το γλωσσικό ζήτημα έκαιγε. Ο Εκπαιδευτικός Όμιλος, του οποίου ήταν μέλος και η Δέλτα, συσπείρωνε διανοούμενους, όπως λογοτέχνες (Βάρναλης, Καζαντζάκης, Νιρβάνας), εκπαιδευτικούς και παιδαγωγούς (Γληνός, Δελμούζος) φιλολόγους (Σαρής, Τριανταφυλλίδης), με στόχο μεταρρυθμίσεις που αφορούσαν στην εισαγωγή της δημοτικής γλώσσας στην εκπαίδευση και στην εξάπλωση νέων ιδεών για την ανατροφή των παιδιών.ΜΑΡΙΖΑ ΝΤΕΚΑΣΤΡΟΤο \"Παραμύθι χωρίς όνομα\" είναι ένα πολιτικό παραμύθι, είναι μια πλατωνική Πολιτεία για παιδιά, είναι η ιστορία μιας παραμυθένιας πατρίδας... Της Ελλάδας.Η Πηνελόπη Δ. είναι πιστή, όπως τ' όνομά της, στις ιδέες της μέσα στο βιβλίο, πιστή μέχρι το θάνατο σ'όλα όσα επέλεξε να ξεχάσει και σ' αυτά που τόσο μεθοδικά προτείνει.Τα ονόματα των πρωταγωνιστών τούς ανήκουν εκ φύσεως και διηγούνται κι από μόνα τους την ιστορία. Ο καλός βασιλιάς, που μετρήθηκαν οι μέρες του, λέγεται Συνετός, και μετά αρχίζει η βασιλεία του Αστόχαστου και της Παλάβως στη Χώρα των Μοιρολάτρων. Μέχρι που, από τη γειτονική χώρα, φτάνει, αντί για οικονομική βοήθεια, η ύστατη προσβολή: μια γαϊδουροκεφαλή με τενεκεδένιο στέμμα.Κι εδώ ακριβώς αρχίζει το παραμύθι για τα απογοητευμένα μάτια μας. Ο γιος του Αστόχαστου λέγεται Συνετός Β΄ και αρκεί να πούμε ότι στο τέλος θα παντρευτεί τη Γνώση, κόρη της Φρόνησης, λες κι έχει πάρει το αξίωμά του κατευθείαν από τον Σωκράτη.Ξαναδιαβάζοντας το βιβλίο, ένας μεγάλος θα νιώσει ίσως αμήχανα στις μέρες μας, αντιμέτωπος μ'αυτή την ελπίδα που δεν διαψεύδεται και με την αρετή που ξαναχτίζει τον κόσμο - χωρίς καθόλου μαγικά ξόρκια ή δανεικά κονδύλια, αλλά χάρη σε πολύ σκληρή δουλειά για το κοινό καλό. Γιατί ένας μεγάλος αυτόματα θα μετρήσει την απόσταση ανάμεσα σ' αυτά που επέλεξε να υποτιμήσει και να ξεχάσει και στα τόσα που μεθοδικά προτείνει το βιβλίο. Γιατί η Πηνελόπη Δ. έχει προβλέψει ακόμα και για τη σωστή εκμετάλλευση της φύσης, έχει σκεφτεί ακόμα και τους φυλακισμένους να ξανακάνει ανθρώπους μέσα από την πιο σκληρή, είναι η αλήθεια, δουλειά των λατομείων. Και παρόλο που δεν ξεφεύγει από την παρουσία μιας ελέω Θεού βασιλικής οικογένειας, το βασιλόπουλο είναι τόσο ταπεινό, εργατικό και ενάρετο που θα μπορούσε να είναι ένας αυτοδημιούργητος λαϊκός ήρωας.ΜΑΡΙΑ ΜΗΤΣΟΡΑΗ Πηνελόπη Δέλτα φώτισε τα παιδικά μας χρόνια, τα κατοίκησε και τα ενθάρρυνε δίνοντας \"όνομα\" -και μια σπάνια αύρα- στα ανείπωτα της ψυχής. Κι αν η γενιά μας στρέφει ακόμη το βλέμμα της νοσταλγικά σ' εκείνα τα αναγνώσματα, οι τάξεις των νεόκοπων αναγνωστών ούτε λιγότερο πυκνές είναι ούτε λιγότερο ένθερμες.ΖΥΡΑΝΝΑ ΖΑΤΕΛΗΤο \"Παραμύθι χωρίς όνομα\" (πρώτη έκδοση: 1910) αποτελεί πραγματικά το πιο συναρπαστικό εγερτήριο σάλπισμα για μια Ελλάδα της εργατικότητας, της τιμιότητας, της προκοπής, της μόρφωσης, της εθνικής περηφάνειας. Παντοτινά επίκαιρο.Η παρούσα νέα, συμπληρωμένη έκδοση περιλαμβάνει επίμετρο της Μαρίζας Ντεκάστρο και χρονολόγιο του Αλ. Π. Ζάννα (επιμελητή του έργου της Π. Σ. Δέλτα), το οποίο μνημονεύει τα σημαντικά γεγονότα της ζωής της Πηνελόπης Δέλτα, καθώς και παράλληλα γεγονότα της πολιτικής, κοινωνικής και πνευματικής ζωής στην Ελλάδα και τον κόσμο.",
  "genres": [
    "Fiction",
    "Classics",
    "Fantasy",
    "Literature",
    "Childrens",
    "Greece",
    "Fairy Tales"
  ],
  "author": "Penelope Delta",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/6325305"
}