{
  "title": "The Christmas Book",
  "description": "A visual celebration of Christmas, from religious beginnings to festive cultural touchstones – a book to treasure This book is a unique and groundbreaking visual celebration of Christmas, a joyous religious and cultural occasion observed by billions of people around the world. The origins of Christmas are in the Christian observance of the birth of Christ on 25 December and, since the early 20th century, it has become a secular holiday with a myriad decorations, rituals, and themes. Key themes covered include advent and the nativity; the Christmas tree and holiday decorations; gift giving and carol singing; classic Christmas films; and festive music. This extraordinary book showcases a broad spectrum of global festive traditions from many different cultures, such as fried chicken eaten for Christmas dinner, surfing Santas, and shoes filled with carrots. A collection of more than 200 rich and evocative images, paintings, books, prints, sculptures, textiles, ceramics, and photography, thoughtfully paired to highlight similarities and contrasts between them, the works included feature a diverse range of both lesser-known and iconic artists, including Sandro Botticelli, Grandma Moses, Beatrix Potter, Norman Rockwell, Andy Warhol, and many more. These significant works cover festive topics such as Advent; the Christmas tree and holiday decorations; gift giving and carol singing; and classic Christmas films and music. Essays by Sam Bilton, Dolph Gotelli and David Trigg explore traditional festive food and drink, Santa Claus throughout history, and the religious origins of Christmas. In  The Christmas Book, the significant artistic and cultural influence of Christmas throughout history is explored through a wide range of beautiful and significant artworks and images from across the ages and six continents, creating the ultimate cultural companion to the festive season.",
  "genres": [
    "Christmas",
    "Nonfiction",
    "History",
    "Art"
  ],
  "author": "Phaidon Editors",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/63251982-the-christmas-book"
}