{
  "title": "Waiting to Be Arrested at Night: A Uyghur Poet's Memoir of China's Genocide",
  "description": "A poet's account of one of the world's most urgent humanitarian crises, and a harrowing tale of a family's escape from genocideOne by one, Tahir Hamut Izgil's friends disappeared. The Chinese government's brutal persecution of the Uyghur people had continued for years, but in 2017 it assumed a terrifying new scale. The Uyghurs, a predominantly Muslim minority group in western China, were experiencing an echo of the worst horrors of the twentieth century, amplified by China's establishment of an all-seeing high-tech surveillance state. Over a million people have vanished into China's internment camps for Muslim minorities.Tahir, a prominent poet and intellectual, had been no stranger to persecution. After he attempted to travel abroad in 1996, police tortured him until he confessed to fabricated charges and sent him to a re-education through labor camp. But even having endured three years in the camp, he could never have predicted the Chinese government's radical solution to the Uyghur question two decades later. Was the first sign when Tahir was interrogated for hours after a phone call with a fellow poet in the Netherlands? Or when his old friend was sentenced to life in prison simply for calling for Uyghurs' legal rights to be enforced? Perhaps it was when the police seized Uyghurs' radios and installed jamming equipment to cut them off from the outside world.Once Tahir noticed that the park near his home was nearly empty because so many neighbors had been arrested, he knew the police would be coming for him any day. One night, after Tahir's daughters were asleep, he placed by his door a sturdy pair of shoes, a sweater, and a coat so that he could stay warm if the police came for him in the middle of the night. It was clear to Tahir and his wife that fleeing the country was the family's only hope.Waiting to Be Arrested at Night is the story of the political, social, and cultural destruction of Tahir Hamut Izgil's homeland. Among leading Uyghur intellectuals and writers, he is the only one known to have escaped China since the mass internments began. His book is a call for the world to awaken to the unfolding catastrophe, and a tribute to his friends and fellow Uyghurs whose voices have been silenced.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "China",
    "History",
    "Politics",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Tahir Hamut Izgil",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/63249763-waiting-to-be-arrested-at-night"
}