{
  "title": "The Heat Will Kill You First: Life and Death on a Scorched Planet",
  "description": "The world is waking up to a new wildfires are now seasonal in California, the Northeast is getting less and less snow each winter, and the ice sheets in the Arctic and Antarctica are melting fast.  Heat is the first order threat that drives all other impacts of the climate crisis.  And as the temperature rises, it is revealing fault lines in our governments, our politics, our economy, and our values. The basic science is not Stop burning fossil fuels tomorrow, and the global temperature will stop rising tomorrow. Stop burning fossil fuels in 50 years, and the temperature will keep rising for 50 years, making parts of our planet virtually uninhabitable.  It’s up to us.  The hotter it gets, the deeper and wider our fault lines will open.   The Heat Will Kill You First  is about the extreme ways in which our planet is already changing. It is about why spring is coming a few weeks earlier and fall is coming a few weeks later and the impact that will have on everything from our food supply to disease outbreaks. It is about what will happen to our lives and our communities when typical summer days in Chicago or Boston go from 90° F to 110°F. A heatwave, Goodell explains, is a predatory event— one that culls out the most vulnerable people.  But that is changing. As heatwaves become more intense and more common, they will become more democratic.   As an award-winning journalist who has been at the forefront of environmental journalism for decades, Goodell’s new book may be his most provocative yet, explaining how extreme heat will dramatically change the world as we know it.  Masterfully reported, mixing the latest scientific insight with on-the-ground storytelling, Jeff Goodell tackles the big questions and uncovers how extreme heat is a force beyond anything we have reckoned with before.",
  "genres": [
    "Nonfiction",
    "Science",
    "Climate Change",
    "Environment",
    "Audiobook",
    "Nature",
    "History"
  ],
  "author": "Jeff Goodell",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/63251778-the-heat-will-kill-you-first"
}