{
  "title": "The Best of Catherynne M. Valente, Volume One",
  "description": "The celebrated author of Fairyland, Space Opera, and much more, Catherynne M. Valente is also known for her stunning prose and captivating worldbuilding. From life on Mars to the zombified streets of Augusta, Maine, she has taken readers on unforgettable journeys for two decades.Subterranean Press is proud to present: The Best of Catherynne M. Valente, Volume One, the first comprehensive collection of Valente’s short fiction, soaring through eighteen years of pushing the edges of storytelling.Among her award-winning stories, you’ll find everything from melancholy robot girls to Eurydice and Orpheus; from detectives in Purgatory to time-traveling squirrels to a very different Santa Claus; from the grey coast of Washington to Alice’s Wonderland. Valente’s work is an open, beating heart, ready to welcome you in to its darkness and its light.Table of Contents:Left Ventricle The Consultant The Difference Between Love and Time A Buyer’s Guide to Maps of Antarctica White Lines on a Green Field The Wolves of Brooklyn Reading Borges in Buenos Aires Days of Flaming Motorcycles One Breath, One Stroke Thirteen Ways of Looking at Space/Time Mouse Koan Right Atrium The Melancholy of Mechagirl The Future Is Blue The Sin-Eater The Sun in Exile Color, Heat, and the Wreck of the Argo The Perfect Host How to Become a Mars Overlord Fade to White Secretario Twenty-Five Facts About Santa Claus In the Future When All’s Well Planet LionLeft Atrium A Great Clerk of Necromancy Urchins, While Swimming L’Espirit D’Escalier The Lily and the Horn The Long Goodnight of Violet Wild Palimpsest The Red Girl The Flame After the Candle The Wedding The Bread We Eat in Dreams The Secret of Being a CowboyRight Ventricle Aquaman and the Duality of Self/Other, America, 1985 A Fall Counts Anywhere A Delicate Architecture Golubash, or Wine-Blood-War-Elegy Badgirl, the Deadman, and the Wheel of Fortune Down and Out in R’lyeh The Shoot-Out at Burnt Corn Ranch Over the Bride of the World No One Dies in Nowhere The Limitless Perspective of Master Peek, Or, the Luminescence of Debauchery Daisy Green Says I Love You Silently and Very Fast What the Dragon Said: A Love Story",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Science Fiction",
    "Anthologies",
    "Collections",
    "Adult",
    "Speculative Fiction"
  ],
  "author": "Catherynne M. Valente",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/63249948-the-best-of-catherynne-m-valente-volume-one"
}