{
  "title": "Did I Ever Tell You This?",
  "description": "In this unexpected memoir, written in a creative burst of just a few months in 2022, Sam Neill tells the story of how he became one of the world’s most celebrated actors, who has worked with everyone from Meryl Streep to Isabel Adjani, from Jeff Goldblum to Sean Connery, from Steven Spielberg to Jane Campion.By his own account, his career has been a series of unpredictable turns of fortune. Born in 1947 in Northern Ireland, he emigrated to New Zealand at the age of seven. His family settled in Dunedin on the South Island, but young Sam was sent away to boarding school in Christchurch, where he was hopeless at sports and discovered he enjoyed acting.But how did you become an actor in New Zealand in the 1960 and 1970s where there was no film industry? After university he made documentary films while also appearing in occasional amateur productions of Shakespeare. In 1977 he took the lead in Sleeping Dogs, the first feature made in New Zealand in more than a decade, a project that led to a major role in Gillian Armstrong’s celebrated My Brilliant Career.And after that Sam Neill found his way, sometimes by accident, into his own brilliant career. He has worked around the world, an actor who has moved effortlessly from blockbuster to art house to TV, from Dr Alan Grant in the Jurassic Park movies to The Piano and Peaky Blinders.Did I Ever Tell You This? is a joy to read, a marvellous and often very funny book, the work of a natural storyteller who is a superb observer of other people, and who writes with love and warmth about his family. It is also his account of his life outside film, especially in Central Otago where he established Two Paddocks, his vineyard famous for its pinot noir.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Audiobook",
    "Autobiography",
    "Biography Memoir",
    "Book Club"
  ],
  "author": "Sam Neill",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/63251402-did-i-ever-tell-you-this"
}