{
  "title": "Exit Only",
  "description": "Buy directly from ENC $17.00 A suspenseful, multihued novel of Saudi Arabia as it’s seen through the eyes of expatriates of various origins and social standings who have one thing in they are all leaving it forever, on the same plane hurtling toward its destiny.After twenty years of fixing Boeing aircraft alongside Saudi mechanics, Charlie Durango reckons he understands the Saudi mentality in Jeddah pretty well. In fact, so confident is Durango in his perceptions that for a few thousand bucks he helps Khalid Ba Sallah, a Saudi colleague, conceal two kilos of cocaine on a New York-bound 747. Unfortunately, anti-American remarks Khalid has made haunt Charlie and prompt him to try and glean whether or not he has put on board the airliner something more sinister than coke.Sara Santos stares into Saudi Arabia from another angle. Her eyes gaze down the shaft of a mop handle at life in a middle-class Saudi family. A maid from the Philippines, Sara has been languishing, trapped and abused, in a Jeddah household for the last twelve years, with no prospect of escaping until now. Sara has just palmed a U.S. passport, and she is using her final threads of will to alter it and flee Saudi Arabia on a New York–bound flight — the flight aboard which Charlie has, hopefully, hidden only cocaine.Charlie, Sara, and other central characters of Exit Only represent but a few people among a myriad of personalities on Jeddah’s “Arab street.” Pakistani taxi drivers, Egyptian clerks, Saudi youths male and female, Western pilots and flight attendants, government workers, British charlatans, hash-smoking ESL instructors, and many others toil there, too. Collectively, their personal development defines contemporary Saudi Arabia and powers the plot and themes of this pre-September 11 novel.Allegorical by nature and evolvement, satiric and cynical by characterization, and rapid by pacing, Exit Only is more than a suspense novel set in locale of current interest. It’s a blistering quest and climax on the Red Sea shores.",
  "genres": [
    "Fiction"
  ],
  "author": "Liam Bracken",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/6328343-exit-only"
}