{
  "title": "Princes of Chaos",
  "description": "“Tonight embarks your journey as the vessel for the next great heir. Any woman can have a womb, but yours has been chosen.” He steps forward and presses a hand to my stomach. “Blessed.”\nWhen I received the invitation to the Princes’ masked ball, I assumed it was a mistake. Possibly a prank. Why would East End Royalty invite West End trash for an opportunity to become their Princess?The bigger question: Why would I take it?I was raised to be the Dukes’ Duchess, but that dream came to an end when they chose a different woman. I had everything it took to be a house girl, including my innocence, something the Princes not only hold in high regard, but explicitly require.It’s not the title that scares me.It’s the men who have been chosen by the King. His adoptive sons.Whitaker would fit the textbook image of Prince Charming to everyone but me. Gorgeous, athletic, and obnoxiously promiscuous, it only takes a few days as his Princess to realize the flirtatiousness in his eyes is a mask for what’s haunted beneath.Believing me to be responsible for the two years he’s spent in prison, Pace harbors a grudge that’s as unyielding as his determination to know my every move. Even when he’s locked himself away, his eyes are everywhere. Watching. Waiting.Lex, a moody, high-strung student on a straight shot to become a gifted surgeon, would rather have me under his scalpel than his body. Treating me like the subject of his experiment with fertilization is the closest I’ll come to having him as a lover.These three have been trained to excel, endure, and maim, be it on in the hockey rink or down in the Palace’s dungeon. But most of all, they are Princes with one duty: to produce the next heir.To Create is to Reign.Princes of Chaos is book 7 in the contemporary, dark, reverse harem, traumatic romance, Royals of Forsyth U series by best-selling authors, Angel Lawson and Samantha Rue. Please read the foreword for all content warnings and details.",
  "genres": [
    "Dark Romance",
    "Reverse Harem",
    "Dark",
    "Romance",
    "Enemies To Lovers",
    "College",
    "Contemporary"
  ],
  "author": "Angel Lawson",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/63267168-princes-of-chaos"
}