{
  "title": "The Writer's Complete Fantasy Reference: An Indispensable Compendium of Myth and Magic",
  "description": "Fantasy writing must be grounded in both truth and life experience if it is to work. It can be as inventive and creative as the writer can make it, a whirlwind of images and plot twists, but it cannot be built on a foundation of air. The world must be identifiable with our own, must offer us a frame of reference we can recognize.--Terry BrooksThis is your complete guide to the realm of the fantastic. Whether you write science fiction, fantasy, horror, romance or historical fiction, here you'll find the factual information you need to construct a fantasy world full of wonder, imagination and spellbinding detail.From fabled creatures to occult religions, every page of this intriguing guide reveals the hidden realities of all things mystical, mythical and supernatural.Featuring charts, lists, illustrations and timelines, each chapter focuses on a different facet of fantasy, including:* Pagan orders, secret societies, witchcraft and the rites and rituals of magic* Detailed profiles of fantastic societies and ancient civilizations, from the Incas and Aztecs to Egypt and the Far East* Medieval trades, occupations, laws and punishments* Dragons, naiads, kelpies and other creatures of myth and fantasy* Legendary races, including elves, dwarfs, giants and more* A comprehensive look at the anatomy of a castle, describing the forms and functions of everything from barbicans to trebuchetsThis guide also goes well beyond standard reference books, offering sound advice on the writing styles and structures of this complex genre, with important tips on how to weave the elements of fact and fantasy into an absorbing narrative.Fascinating and authoritative, The Writer s Complete Fantasy Reference is the resource you need to create fiction that is compelling, fresh and wildly fantastic.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "Research",
    "Mythology",
    "Magic",
    "Guides"
  ],
  "author": "David H. Borcherding",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/632841.The_Writer_s_Complete_Fantasy_Reference"
}