{
  "title": "The Bratva's Bastards: Monsters of Moscow Book One",
  "description": "KLARA\nAfter a traumatic, near-death injury, my life spiraled into a dark hole I couldn’t escape from. Diagnosed with a rare condition at eighteen, I was left unresponsive to the world… until I met him.Micah Mikhailov.A man with influence, power, money, and a loyal brother to the ever-elusive Bratva.Thanks to my father, I was handed over to Micah with our home like a packaged deal while Dad allegedly abandoned me and disappeared. All I could do was watch silently and try to adjust to my new home.Micah’s world was dark, his words refined, and his appearance intoxicating.Underneath his expensive suit and curt expression, was a monster who operated with authority, bloodshed, and death.I was determined to recover and discover what really happened to my father the night Micah stormed into my life. Even more pressing; I wanted to know if I’d ever be allowed to leave, or was I doomed forever to remain in his possession?\nMicah\n\nMan... monster, there is no difference.\nAs an heir to an empire, I was born to serve the Russian Mafia.Trained from childhood to end lives and collect debts, my job was simple.My latest task should have been quick and easy—acquire some poor man’s house to cover his debt to my father—but the coward had other plans.His actions left his ailing daughter at my mercy. There was nothing to Klara but frailty and emptiness, yet she intrigued me, so I made her my project. If I could bring the beautiful, damaged girl back from the brink, she might just be the salvation for all my sins.She would soon understand that in this dangerous place, men and monsters are one and the same. Her life, dreams, pleasure, and pain would forever be controlled by me.This series is rated 18+ and has trigger warnings for violence, dark themes, and explicit sexual content. Please read responsibly.",
  "genres": [],
  "author": "R.C. Christiansen",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/63279874-the-bratva-s-bastards"
}