{
  "title": "Orphia and Eurydicius",
  "description": "A stunning, enthralling story about unconventional love, the power of creativity and the courage of women who struggle to make their voices heard - for fans of Jennifer Saint, Madeline Miller and Pat Barker. Their love transcends every boundary. Can it cheat death?Orphia dreams of something more than the warrior crafts she's been forced to learn. Hidden away on a far-flung island, her blood sings with poetry and her words can move flowers to bloom and forests to grow ... but her father, the sun god Apollo, has forbidden her this art.A chance meeting with a young shield-maker, Eurydicius, gives her the courage to use her voice. After wielding all her gifts to defeat one final champion, Orphia draws the scrutiny of the gods. Performing her poetry, she wins the protection of the goddesses of the the powerful Muses, who welcome her to their sanctuary on Mount Parnassus. Orphia learns to hone her talents, crafting words of magic infused with history, love and tragedy.When Eurydicius joins her, Orphia struggles with her desire for fame and her budding love. As her bond with the gentle shield-maker grows, she joins the Argonauts on their quest for the Golden Fleece. Facing dragons, sirens and ruthless warriors on the voyage, Orphia earns unparalleled fame, but she longs to return to Eurydicius.Yet she has a darker journey to make - one which will see her fight for her love with all the power of her poetry.PRAISE'Orphia and Eurydicius spins a bewitching tale of courage, love, and defiance, giving voice and agency to the women in Greek tales who are so often defined by the men they are associated with. Orphia's poetry may bring the gods to tears; John's words have the same effect on us mere mortals. Tragic and triumphant, a must-read!' Andrea Stewart, author of The Bone Shard Daughter",
  "genres": [
    "Mythology",
    "Greek Mythology",
    "Fantasy",
    "Romance",
    "Retellings",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Elyse John",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/63272876-orphia-and-eurydicius"
}