{
  "title": "Sushi and Beyond: One Family's Remarkable Journey Through the Greatest Food Nation on Earth",
  "description": "Japan is the pre-eminent food nation on earth. The Japanese go to the most extraordinary lengths and expense to eat the finest, most delectable, and downright freakiest food imaginable. Their creativity, dedication and ingenuity, not to mention courage in the face of dishes such as cod sperm, whale penis and octopus ice cream, is only now beginning to be fully appreciated in the sushi-saturated West, as are the remarkable health benefits of the traditional Japanese diet.Inspired by Shizuo Tsuji's classic book, Japanese Cooking, A Simple Art, food and travel writer Michael Booth sets off to take the culinary pulse of contemporary Japan, learning fascinating tips and recipes that few westerners have been privy to before. Accompanied by with two fussy eaters under the age of six, he and his wife travel the length of the country, from bear-infested, beer-loving Hokkaido to snake-infested, seaweed-loving Okinawa. Along the way, they dine with - and score a surprising victory over - sumos; meet the indigenous Ainu; drink coffee at the dog café; pamper the world's most expensive cows with massage and beer; discover the secret of the Okinawan people's remarkable longevity; share a seaside lunch with free-diving, female abalone hunters; and meet the greatest chefs working in Japan today. Less happily, they trash a Zen garden, witness a mass fugu slaughter, are traumatised by an encounter with giant crabs, and attempt a calamitous cooking demonstration for the lunching ladies of Kyoto. They also ask, 'Who are you?' to the most famous TV stars in Japan.What do the Japanese know about food? Perhaps more than anyone on else on earth, judging by this fascinating and funny journey through an extraordinary food-obsessed country.",
  "genres": [
    "Nonfiction",
    "Japan",
    "Travel",
    "Food",
    "Memoir",
    "Cooking",
    "Audiobook"
  ],
  "author": "Michael Booth",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/6328493-sushi-and-beyond"
}