{
  "title": "Paved Paradise: How Parking Explains the World",
  "description": "An entertaining, enlightening, and utterly original investigation into one of the most quietly influential forces in modern American life—the humble parking spotParking, quite literally, has a death grip on America: each year a handful of Americans are tragically killed by their fellow citizens over parking spots. But even when we don’t resort to violence, we routinely do ridiculous things for parking, contorting our professional, social, and financial lives to get a spot. Indeed, in the century since the advent of the car, we have deformed—and in some cases demolished—our homes and our cities in a Sisyphean quest for cheap and convenient car storage. As a result, much of the nation’s most valuable real estate is now devoted exclusively to empty and idle vehicles, even as so many Americans struggle to find affordable housing. Parking determines the design of new buildings and the fate of old ones, patterns of traffic and the viability of transit, neighborhood politics and municipal finance, the quality of public space, and even the course of floodwaters. Can this really be the best use of our finite resources and space? Why have we done this to the places we love? Is parking really more important than anything else?These are the questions Slate staff writer Henry Grabar sets out to answer, telling a mesmerizing story about the strange and wonderful superorganism that is the modern American city. In a beguiling and often absurdly hilarious mix of history, politics, and reportage, Grabar brilliantly surveys the pain points of the nation’s parking crisis, from Los Angeles to Disney World to New York, stopping at every major American city in between. He reveals how the pathological compulsion for car storage has exacerbated some of our most acute problems—from housing affordability to the accelerating global climate disaster—ultimately, lighting the way for us to free our cities from parking’s cruel yoke.",
  "genres": [
    "Nonfiction",
    "History",
    "Urban Planning",
    "Urbanism",
    "Audiobook",
    "Politics",
    "Sociology"
  ],
  "author": "Henry Grabar",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/63329951-paved-paradise"
}