{
  "title": "Forged by Blood",
  "description": "A brilliant new voice brings a brilliant new debut author Ehigbor Okosun’s first book in an action-packed, poignant duology inspired by Nigerian mythology—full of magic and emotion and set in a highly atmospheric, complex world in which a young woman fights to survive a tyrannical society, having everything stripped away from her, and seeks vengeance for her mother’s murder and the spilled blood of her people.In the midst of a tyrannical regime and political invasion, Dèmi just wants to avoid the suspicion of the nonmagical Ajes who occupy her ancestral homeland of Ife; to escape the King’s brutal genocide of her people—the darker-skinned, magic-wielding Oluso; and to live peacefully with her secretive mother while learning to control the terrifying blood magic that is her birthright. But when Dèmi’s misplaced trust costs her mother’s life, survival gives way to vengeance. She bides her time until the devious Lord Ekwensi grants her the perfect opportunity—kidnap the Aje prince, Jonas, and bargain with his life to save the remaining Oluso. With the help of her reckless childhood friend Colin, Dèmi succeeds, but discovers that she and Jonas share more than deadly secrets; every moment tangles them further into a forbidden, unmistakable attraction, much to Colin’s—and Dèmi’s—distress. The kidnapping is now a joint to return to the King, help get Lord Ekwensi on the council, and bolster the voice of the Oluso in a system designed to silence them. But the way is dangerous, Dèmi’s magic is growing yet uncertain, and it’s not clear if she can trust the two men at her side. A tale of rebellion and redemption, race and class, love and trust and betrayal,  Forged by Blood is epic fantasy at its finest, from an enthusiastic, emerging voice.",
  "genres": [
    "Fantasy",
    "Mythology",
    "Young Adult",
    "Romance",
    "Fiction",
    "Audiobook",
    "Adult"
  ],
  "author": "Ehigbor Okosun",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/63313283-forged-by-blood"
}