{
  "title": "There's Only Been You",
  "description": "\"...wonderfully heartwarming...\" 4 Stars ~ RT BOOK ReviewsSara Jamison has no clue where Mike Andrews' been all these years, but she knows where she's been - busy raising their son. Two weeks after he accused her of cheating and disappeared from her life, Sara discovered she was something she never expected to be - an unwed pregnant teenager. But with the love and support of her annoyingly alpha-male family, she's managed to make a good life for herself and her young son. She even owns her own business, Sara's Bakery, which she's built into a thriving success. Sure, she works too hard and her social life is nonexistent, but for the most part, she's content.Until the day Detective Mike Andrews walks into her bakery and back into her life...* * * *Sara was in the kitchen when she heard a truck pull up in front of the house.  She ran into the living room and peeked out the window.  Mike.  She ran back into the kitchen and checked on the meatloaves.  The cheese hadn't melted yet so she'd give them a few more minutes.  She glanced at the table.  Perfect. \"Ethan, are you ready?  He's here!\" she called out.  When she didn't get a reply, she hustled down the hall to his bedroom and rapped on the door.  \"Ethan?\" \"Come in,\" she heard him mumble. Sara opened the door and saw him sitting on his bed with a Power Ranger action-figure clutched in his fist.  He looked scared to death and Sara's heart gave a little lurch.  She sat down beside him on the bed.  \"You have the same look on your face as when you're going to the dentist.\"  He had on a brand-new pair of jeans and his favorite Spiderman T-shirt. \"I was just thinking,\" he said. Sara waited for him to elaborate, but he didn't.  He's so much like Garrett.  \"About...?\" He turned his head and gazed up at her.  \"What if my dad don't like me?\" \"Oh, sweetheart!\"  She put her arms around him and gave him a reassuring squeeze.  \"Your daddy is going to think you're the best thing since chocolate chip cookies, I promise.\" \"But his dad didn't like him.\" Sara frowned.  \"Where did you hear such a thing?\" He shrugged one shoulder.  \"I heard Uncle Garrett and Uncle Nicky talking about it.\" \"You were eavesdropping?  What did I tell you about that?\" she gently chided him. \"Sorry.  It's just that I wanted to know more about my dad, and I accidentally heard 'em talking.  Then on purpose, I stayed and listened.\"   \"Ethan, when you're older I'm sure your father will tell you about his own father.  But in the meantime, I promise, your daddy already loves you and can't wait to meet you.\" \"Really?\"  He looked so hopeful Sara felt her heart swell with love for this incredible little person that was her son. \"Really and truly, honest to God.  Now,\" she rose to her feet and motioned toward the door, \"ready to go meet your father?\" Ethan slid off the bed and eyed the Power Ranger figure clutched in his hand as if trying to come to a decision.  Finally, he set it down on the bed and said, \"Okay, I'm ready.\"",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Second Chance",
    "Amazon",
    "Romantic Suspense",
    "Second Chance Romance"
  ],
  "author": "Donna Marie Rogers",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/6332327-there-s-only-been-you"
}