{
  "title": "Stormbound",
  "description": "What happens when a free-spirited woman is snowed in with the mysterious mountain man who rescued her? Dropping temperatures, rising tensions, constant banter, and unknown threats. Kaylee Waters is a loose cannon. Catching her boyfriend mid-thrust in an affair with her favorite barista was reason enough to bolt from Boston like a banshee in need of a Midol. Pulled from a bizarre collision by an annoyingly handsome mountain man, she finds herself injured and stranded in Maine during a blizzard. Harley Kouris is a forest ranger. When he isn’t avoiding the nosy people of Pine Bluff, he is usually helping clueless tourists. Hardened from pulling too many bodies out of the forest after failed selfies with bears, he isn’t used to finding people alive, let alone so boldly defiant like the beautiful woman he rescued. He is used to wild, but not this kind of wild. Who knew a woman who keeps crystals in her bra, throws back iced coffee like a shot, and clutches pepper spray like a rabid raccoon could be so cute yet reckless? While sheltering in Harley’s cabin, a fateful tarot reading exposes the truth of their situation. As days go by, they must face not only their growing attraction, but the secrets they try to conceal. What is Harley avoiding? What is Kaylee truly running from? Will getting stuck together set them free? A lot can happen when you’re stormbound. Stormbound is a steamy forced proximity, snowed in, opposites attract romance with equal parts heat and humor. This story is told in first person narration, alternating between perspectives of the main characters. No cheating (aside from the affair that kicks off the story), no cliffhangers, and guaranteed HEA. If you love lumberjacks, look no further! Stormbound is the first novel in the Pine Bluff series which will contain novels about wild women and the mountain men who love them. These will be standalone novels that are interwoven for a fuller experience.",
  "genres": [
    "Romance",
    "Forced Proximity",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Maggie Maren",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/63310960-stormbound"
}