{
  "title": "Counterfeit Faith",
  "description": "\"Page-turning action combines with depth and richness to create a full-bodied, rewarding read.\"--Jocelyn Green, Christy Award-winning author of The Metropolitan Affair As matron of Final Chance House of Refuge, Gwendolyn Ellison has dedicated her life to serving the children deemed delinquents by society. She'll protect them with everything she has. So when she suspects someone is using Final Chance for criminal deeds, she's determined to investigate and put a stop to it. But villains don't like to be crossed--and they're willing to kill to get their way.Gwendolyn knows she can't quit fighting. More than her own life is on the line if counterfeiters go free. She must find someone she can trust to help her expose the criminals and protect the children under her care.Charming and chivalrous Secret Service operative Josiah Isaacs has never been able to turn his back on a woman in trouble--and capturing counterfeiters is his job, after all. The danger he's truly worried about is his growing attraction to Gwendolyn when his heart wants to remain faithful to his deceased wife.As both peril and interest grow, he begins to consider whether a second love may be possible--if they can live through this case. At the same time, he's put off by her faith in a God he no longer trusts. How can a future together even be possible when their beliefs are at odds?\"Readers who love romance, suspense, and a graceful amount of faith won't want to miss this story.\"--Toni Shiloh, Christy Award-winning author\"With a host of sympathetic and likable characters (and a few not so likable), a riveting plot that clips along at the perfect pace, and a relatable faith thread, this book [is a] completely enjoyable read.\"--Kimberly Duffy, Carol Award finalist and author of A Tapestry of Light",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Romance",
    "Historical Romance",
    "Mystery",
    "Historical",
    "Christian Romance"
  ],
  "author": "Crystal Caudill",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/63315338-counterfeit-faith"
}