{
  "title": "The Last Will of Moira Leahy",
  "description": "This haunting debut novel explores the intense bond of sisterhood as a grieving twin searches for her own identity in the ruins of her sister’s past.A lost shadow. Moira Leahy struggled growing up in her prodigious twin’s shadow; Maeve was always more talented, more daring, more fun. In the autumn of the girls’ sixteenth year, a secret love tempted Moira, allowing her to have her own taste of adventure, but it also damaged the intimate, intuitive relationship she’d always shared with her sister. Though Moira’s adolescent struggles came to a tragic end nearly a decade ago, her brief flirtation with independence will haunt her sister for years to come.A lone woman. When Maeve Leahy lost her twin, she left home and buried her fun-loving spirit to become a workaholic professor of languages at a small college in upstate New York. She lives a solitary life now, controlling what she can and ignoring the rest—the recurring nightmares, hallucinations about a child with red hair, the unquiet sounds in her mind, her reflection in the mirror. It doesn’t help that her mother avoids her, her best friend questions her sanity, and her not-quite boyfriend has left the country. But at least her life is ordered. Exactly how she wants it.A shared past. Until one night at an auction when Maeve wins a keris, a Javanese dagger that reminds her of her lost youth and happier days playing pirates with Moira in their father’s boat. Days later, a book on weaponry is nailed to her office door, followed by the arrival of anonymous notes, including one that invites her to Rome to learn more about the blade and its legendary properties. Opening her heart and mind to possibility, Maeve accepts the invitation and, with it, also opens a window into her past. Ultimately, she will revisit the tragic November night that shaped her and Moira’s destinies—and learn that nothing can be taken at face value—as one sister emerges whole and the other’s score is finally settled.The Last Will of Moira Leahy is a mesmerizing and romantic consideration of the bonds of family, the impossibility of forgetting, and the value of forgiveness.",
  "genres": [
    "Fiction",
    "Mystery",
    "Fantasy",
    "Contemporary",
    "Romance",
    "Chick Lit",
    "Historical Fiction"
  ],
  "author": "Therese Walsh",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6332451-the-last-will-of-moira-leahy"
}