{
  "title": "Cloak of Scarlet",
  "description": "She was an orphan of no importance . . .Violet Lambton never imagined herself as anything but average. Adopted as a young child, she’s content with her comfortable life in her small medieval town with her faith, her books, and her baking . . . and the vivid red cloak her grandmother gifted her. Her one dream: to find a love that is pure and true. Then, her beloved grandmother is robbed by the villainous Baron Dunham. Outraged, Violet finds herself in the midst of the action and determines to put an end to the evil baron’s mistreatment of the hardworking people.He was an ordinary knight serving the baron . . .Sir Merek, a knight in the service of Baron Dunham, has pledged his life to fighting injustice and defending the weak. But when he encounters the spirited and beautiful Violet and discovers the depths of the baron’s treachery, he realizes that serving his employer is not serving the kingdom—and so he sets out on a daring journey to go behind the baron’s back to expose his deceitfulness to the king.Suddenly the kingdom depends on both of them.But before Merek and Violet can act to bring the corruption to light, Violet is captured and brought directly to Dunham—where she shockingly discovers a secret that shakes her entire world . . . and the future she dreams of. Thrown together in the baron’s quarters in a race against time to save the lives of their loved ones and themselves, Violet and Merek must learn to trust each other to expose Dunham’s treachery to the king—all while succumbing to their growing feelings for each other. Can the two find their happily ever after against all odds, or will the wolves amongst them drive them apart?From New York Times bestselling author Melanie Dickerson comes a thrilling retelling of \"Little Red Riding Hood,\" where two hearts must learn to trust themselves and each other in order to save a kingdom.A medieval retelling of “Little Red Riding Hood”Part of the Dericott Tale series of stand-alone fairy talesIncludes discussion questions for book clubs",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Young Adult",
    "Christian Fiction",
    "Christian",
    "Fantasy",
    "Historical"
  ],
  "author": "Melanie Dickerson",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/63354443-cloak-of-scarlet"
}