{
  "title": "Positively, Penelope",
  "description": "Told mostly through letters, texts, and email, this contemporary romance will charm its way into hearts as Penelope rescues a theater and discovers her true self in the process.Penelope Edgewood is practically positive in every way, so when, fresh out of college, she is awarded a paid internship to help save a century-old theater on the island of Skymar, she jumps at the chance. After all, a crumbling theater needs the special touch of someone who reveres all things vintage and adores the stage.Unfortunately, not everything is as it seems at Darling House Theatre. Finances are in shambles, the local theater group is disenchanted, and the two brothers, Matt and Alec Gray, can’t seem to see eye-to-eye about how to run their theatrical business. So, of course, it’s the perfect place for Penelope to shine her own personal brand of sunshine.With a little help from GK, the person emailing her encouragement along the way, she puts all her heart into helping the Grays save Darling House. But between Matt’s ever-present skepticism, Alec’s tendency to treat Penelope a little too much like the “princess” she thinks she wants to be (until someone actually started treating her that way), a grandfather who is stuck in his grief, and a mysterious person stealing Penelope’s marketing ideas, she’s not sure her optimism is enough to make a happily-ever-after of her own story, let alone The Darling House’s.Between an adorable little girl, a matchmaker, a sea monster or two, and a copious amount of musical references, can Penelope draw enough confidence from her faith, her family, and her adoration of all things Julie Andrews, to find the thief and save the theater . . . without getting her heart broken in the process?Charming contemporary romancePerfect for fans of Dear Mr. Knightley and The Guernsey Literary and Potato Peel Pie SocietyIncludes discussion questions for book clubs",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Contemporary",
    "Fiction",
    "Audiobook",
    "Christian",
    "Christian Romance"
  ],
  "author": "Pepper Basham",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/63354447-positively-penelope"
}