{
  "title": "Lady Vernon and Her Daughter",
  "description": "Jane Austen's novella Lady Susan was written during the same period as another novella called Elinor and Marianne—which was later revised and expanded to become Sense and Sensibility. Unfortunately for readers, Lady Susan did not enjoy the same treatment by its author and was left abandoned and forgotten by all but the most diligent Austen scholars. Until now.In Lady Vernon and Her Daughter, Jane Rubino and Caitlen Rubino-Bradway have taken Austen's original novella and transformed it into a vivid and richly developed novel of love lost and found—and the complex relationships between women, men, and money in Regency England.Lady Vernon and her daughter, Frederica, are left penniless and without a home after the death of Sir Frederick Vernon, Susan's husband. Frederick's brother and heir, Charles Vernon, like so many others of his time, has forgotten his promises to look after the women, and despite their fervent hopes to the contrary, does nothing to financially support Lady Vernon and Frederica.When the ladies, left without another option, bravely arrive at Charles's home to confront him about his treatment of his family, they are faced with Charles's indifference, his wife Catherine's distrustful animosity, and a flood of rumors that threaten to undo them all. Will Lady Vernon and Frederica find love and happiness—and financial security—or will their hopes be dashed with their lost fortune?With wit and warmth reminiscent of Austen's greatest works, Lady Vernon and Her Daughter brings to vivid life a time and place where a woman's security is at the mercy of an entail, where love is hindered by misunderstanding, where marriage can never be entirely isolated from money, yet where romance somehow carries the day.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "British Literature",
    "Regency",
    "Audiobook"
  ],
  "author": "Jane Rubino",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/6335178-lady-vernon-and-her-daughter"
}