{
  "title": "A Shadow in Moscow",
  "description": "A betrayal at the highest level risks the lives of two courageous female spies: MI6's best Soviet spy and the CIA's newest Moscow recruit. As the KGB closes in, a compromise must be struck if either woman hopes to survive.Vienna, 1954After losing everyone she loves in the final days of World War II, Ingrid Bauer agrees to a hasty marriage with a gentle Soviet embassy worker and follows him home to Moscow. But nothing deep within the Soviet Union's totalitarian regime is what it seems, including her new husband, whom Ingrid suspects works for the KGB. Upon her daughter's birth, Ingrid risks everything and reaches out in hope to the one country she understands and trusts--Britain, the country of her mother's birth--and starts passing along intelligence to MI6, navigating a world of secrets and lies, light and shadow.Washington,  DC,  1980Part of the Foreign Studies Initiative, Anya Kadinova finishes her degree at Georgetown University and boards her flight home to Moscow, leaving behind the man she loves and a country she's grown to respect. Though raised by dedicated and loyal Soviet parents, Anya soon questions an increasingly oppressive and paranoid Soviet regime at the height of the Cold War. When the KGB murders her bestfriend, Anya picks sides and contacts the CIA. Working in a military research lab, Anya passes along Soviet military plans and schematics in an effort to end the 1980s arms race.Alternating points of view keep readers on their toes as the past catches up to the present when an unprecedented act of treachery in 1985 threatens all undercover agents operating within the Soviet Union, and both Ingrid and Anya find themselves in a race for their lives against time and the KGB.The exciting story of two brave female spies in Cold War Moscow",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Audiobook",
    "Russia",
    "Historical",
    "Mystery",
    "Espionage"
  ],
  "author": "Katherine Reay",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/63340978-a-shadow-in-moscow"
}