{
  "title": "Haunt Me Still",
  "description": "The modern heroine of the national bestseller Interred with Their Bones returns, in a thriller centering on Shakespeare's eeriest play.A legendary theatrical curse . . . A rune-engraved blade, a mysterious mirror, and an ancient cauldron . . . And a ritually murdered body laid out in the manner of ancient pagan burials. Kate Stanley, Jennifer Lee Carrell's dauntless Shakespearean scholarturned- director, made a memorable-and New York Times bestselling- debut in Interred with Their Bones. Having chased down her mentor's killer (and recovering one of Shakespeare's lost plays in the process), Kate's fame as a director with an expertise in \"occult Shakespeare\" catapults her-and Ben Pearl, her partner in crime-solving-into a new production of Macbeth, showcasing a fabled collection of objects relating both to the play and the historical Scottish king for whom it is named. The Bard's witch-haunted play is famously cursed, its reputation for malevolence so strong that many actors refuse to quote or even name the play aloud. And as rehearsals begin at the foot of Scotland's Dunsinnan Hill, it doesn't take long for the curse to stir. Strange references to the boy actor who first played Lady Macbeth in Shakespeare's day-and died in the role-pop up. A trench atop Dunsinnan Hill is found filled with blood, and a severed human thumb turns up among the props. And Kate begins sleepwalking, waking early one morning alone atop the hill, her hands smeared with blood. Kate has no memory of how she got there, but later that day a local woman is found dead on the hill in circumstances that suggest not just ritual murder but ancient pagan sacrifice. With the police more focused on Kate as a suspect than as a possible future victim, she and Ben find themselves in a desperate race to discover a lost version of Macbeth, said to contain rituals of witchcraft aimed at conjuring demonic forces to gain forbidden knowledge. However much Kate would like to dismiss such rituals as superstition, someone else appears willing to kill for them-and for the manuscript said to spell them out. Marked for sacrifice, can Kate Stanley uncover the killer before she becomes the next victim? Watch a Video",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Historical"
  ],
  "author": "Jennifer Lee Carrell",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/6334056-haunt-me-still"
}