{
  "title": "King Lear",
  "description": "Shakespeare’s King Lear challenges us with the magnitude, intensity, and sheer duration of the pain that it represents. Its figures harden their hearts, engage in violence, or try to alleviate the suffering of others. Lear himself rages until his sanity cracks. What, then, keeps bringing us back to King Lear? For all the force of its language, King Lear is almost equally powerful when translated, suggesting that it is the story, in large part, that draws us to the play.The play tells us about families struggling between greed and cruelty, on the one hand, and support and consolation, on the other. Emotions are extreme, magnified to gigantic proportions. We also see old age portrayed in all its vulnerability, pride, and, perhaps, wisdom—one reason this most devastating of Shakespeare’s tragedies is also perhaps his most moving.The authoritative edition of King Lear from The Folger Shakespeare Library, the trusted and widely used Shakespeare series for students and general readers, includes:-Freshly edited text based on the best early printed version of the play-Full explanatory notes conveniently placed on pages facing the text of the play-Scene-by-scene plot summaries-A key to the play’s famous lines and phrases-An introduction to reading Shakespeare’s language-An essay by a leading Shakespeare scholar providing a modern perspective on the play-Fresh images from the Folger Shakespeare Library’s vast holdings of rare books-An annotated guide to further readingEssay by Susan SnyderThe Folger Shakespeare Library in Washington, DC, is home to the world’s largest collection of Shakespeare’s printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs. For more information, visit Folger.edu.",
  "genres": [
    "Plays",
    "Fiction",
    "Classics",
    "School",
    "Theatre",
    "Literature",
    "Poetry"
  ],
  "author": "William Shakespeare",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/12938.King_Lear"
}