{
  "title": "Brhadaranyaka Upanisad",
  "description": "Translated by Swami Madhavananda.With the Commentary of Sankaracarya.In original Sanskrit characters with English Translations and Notes \"When there is duality, as it were, then one smells something, one sees something, one speaks something, one thinks something, one knows something. (But) when to the knower of Brahman everything has become the Self, then what should one smell and through what, what should one hear and through what, what should one speak and through what, what should one think and through what, what should know and through what? That owing to which all this is known - through what, O maitreyi should one know the knower?\"The Brhadaranyaka Upanishad is considered by some to be the greatest Upanishad. Likewise, the commentary of Shankara is also regarded as his greatest. The theme is the all-embracing Brahman. The commentary shows how the great truth of the Brahman-Atman identity forms the main purport of all the Vedantic texts in general, and this Upanishad in particular. With Devanagri, Sanskrit and English, translation and commentary.Brhadaranyaka Upanishad is the primary (Mukhya) Upanishad amongst all the Upanishads. It is the commentary on White (Shukla) Yajur Veda and is associated with Shatapatha Brahmana. The last five chapters from the fourteen volume of Shatapatha Brahmana is the Brhadaranyaka Upanishad. It is supposedly written by Sri Yogeeswara Yagnavalkya.Brihadaranyaka Upanishad is as old as the Shukla Yajur Veda, exact time is unknown. Brhat means big and aranya means forest; together put, it means a book that has many chapters and which should be read in a forest, where there is solitude and peace. It contains deep spiritual knowledge and so it better to read it when there is inner and external peace.In the ancient times, sages would prefer to meditate in forests; it may be with the same motive. Another reason, why it is called as Brhadaranyaka may possibly be because sage Yagnavalkya wrote it in the forests. That era, sages spent lot of their time in the forests.",
  "genres": [
    "Hinduism",
    "Spirituality"
  ],
  "author": "Yājñavalkya",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/6338604-brhadaranyaka-upanisad"
}