{
  "title": "The Poverty of the Poverty Rate: Measure and Mismeasure of Material Deprivation in Modern America",
  "description": "Since its inception in 1965, America's official poverty rate (OPR) has been the single most important statistic used by policymakers and concerned citizens to evaluate success or failure in the nation's ongoing struggle against material need. But in a critical new examination of this widely followed measure, Nicholas Eberstadt charges that the OPR is, in reality, \"a broken compass\"―a flawed index generating increasingly misleading numbers about poverty in the United States.The OPR was originally intended to track an absolute level of poverty over time by comparing a family's reported pretax income against a corresponding poverty threshold. But for the past three decades, the OPR has reported trends that are jarringly inconsistent with other statistical indicators of material deprivation. What is the reason for this curious discrepancy? Eberstadt suggests that the OPR's most serious problem is its implicit assumption that poor families will spend no more than their reported annual incomes―in other words, that their income levels are an accurate proxy for their consumption levels. In the decades since the OPR was unveiled, the disparity between reported income and expenditures has progressively widened, making income an ever less reliable predictor of consumption patterns―and, consequently, living standards―for America's poorer families.In The Poverty of \"The Poverty Rate,\" Eberstadt contends that the defects of the current poverty rate are not only severe but irremediable. Income-based measures cannot offer a faithful portrait of consumption patterns or material well-being in the United States. Central though the OPR has become to antipoverty policy, this \"untrustworthy yardstick\" should be discarded and replaced by more accurate measures of deprivation.",
  "genres": [
    "Economics"
  ],
  "author": "Nicholas Eberstadt",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/6338910-the-poverty-of-the-poverty-rate"
}