{
  "title": "The Russian Doll: A Raymond Mackey Mystery -- Book 2",
  "description": "An easy case turns deadly, spiraling down into the kind of bloody chaos that the streets of Chicago know only too well as the heart-pounding twists in this must-read mystery thriller keep coming and coming.Still grieving the death of his wife, Marlo, and wasting away in a retirement forced upon him under a cloud of suspicion, Raymond “Mack” Mackey finds a new job with the Chandler Illinois Police Department. It might be reason for hope. Or not. Mack can’t seem his to shake his reputation for corruption. Undeserved, sure, but most of his colleagues want to see him locked up or dead anyway.A welcome diversion shows up in the form of Nadia King, an alluring single mother who asks Mack to recover a missing an antique Russian nesting doll that belongs to Nadia’s immigrant mother.It might just be the easiest assignment he’s ever had.Until it isn’t.Just like the woman on his doorstep and the doll she wants him to retrieve, appearances are not what they seem. Success, and even Mack’s own redemption, requires separating truth from deception as he travels a path fraught with danger, littered with bodies, and confounded by cold homicide cases suddenly coming back to life.Like, for example, the popular Chicago restauranteur, gunned down in his bedroom. Or, the casino manager, bludgeoned by his own employees. Or, the police officer, shot to death in the home of his widowed mother as she listens, bound and gagged, from the kitchen.Not to mention the bald giant with a broken poker chip in his pocket and Mack on his mind. Maybe he works for Big Man. It seems like almost every criminal and most of the cops in the city work for Big Man.It’s also starting to seem like Big Man has developed a strange obsession with Ray Mackey.If Mack can keep himself alive, he has a chance to clear his name and salvage his career. But Big Man is always watching, with a thousand eyes and from every corner of the city. Marlo is still dead. The Russian doll knows everything, but she isn’t talking. The only one who can truly look out for Mack... is Mack.This astounding sequel to Message in a Bullet (shortlisted as the Best Mystery Novel of the Year by FORWARD Indies Best of the Year Awards), is the latest thrilling noir detective novel in multi-award-winning author Owen Thomas’ Raymond Mackey Mystery series. The Russian Doll is a unique and exhilarating read that’s packed with high-octane action and page-turning suspense.",
  "genres": [],
  "author": "Owen Thomas",
  "average_rating": "4.90",
  "url": "https://www.goodreads.com/book/show/63370213-the-russian-doll"
}