{
  "title": "The Light of Eternal Spring",
  "description": "Angel Di Zhang's intensely cinematic debut novel travels from the streets of New York City to northeast China, on the trail of a young photographer who needs to reconcile with her dead mother before she is able to see the world again.Amy Hilton, born Wu Aimee in the tiny Chinese village of Eternal Spring, has been living and working as a photographer in New York City for so long she's started to dream in English. When in the fall of 1999 she receives a letter from her sister, written in her birth tongue of Manchu, she needs to take it to a Chinatown produce vendor to get it translated. And so it is this stranger who tells Amy that her mother has died of a broken heart.Amy blames herself. How could she not? Her mother has never recovered from her oldest daughter leaving her, first for school, then to pursue her art, and finally to marry a white man. Vowing to be there for her mother in death as she hasn't been in life, she books a flight to China. Haunted by the folk stories her mother told her about a shaman's journey to the underworld to retrieve her child, Amy undertakes a quest that strips away all the elements of her new identity, leaving her ready to make amends. But when she finally reunites with her family, things are far different than she remembers, and her loved ones are less than thrilled to welcome their prodigal daughter home.Interwoven with indelible scenes from Amy's childhood, The Light of Eternal Spring is a tenderly told story about leaving home and returning again, and about forgetting where you come from until you can't forget any longer. Blending playful magical realism with the family balancing acts all immigrants and artists know so well, Angel Di Zhang creates a nuanced portrait of family lost and family found, of the transformative power of art, and of the need to transform yourself in order to make art that's true.“A luminous treasure of a novel you can’t help but fall into. Di Zhang’s compulsively readable story is at once an exploration of the urgency of artistry and a love letter to immigrant families that will leave you with an enduring sense of hope. I read this book in one sitting, ugly cried and called my mom.” —Vaishnavi Patel, author of Kaikeyi“This book is magical. Lyrical and surprising, it swept me up and left me gasping in the best of ways. It’s an original and beautiful take on the power of home and family and the pull of the past. Di Zhang has created a modern world flush with enchantment, but the connection between mothers and daughters may be the strongest magic of all. I was completely enthralled.” — Gin Phillips, author of Fierce Kingdom“The Light of Eternal Spring is a gorgeously lyrical book about the inherent magic in art and family. Each sentence reads as its own poem, its own snapshot of a distinct and enlightening emotional truth. This book is a beautiful tribute to the love between a mother and daughter, and the power in coming home.” —Lynn Steger Strong, author of Flight and Want",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Magical Realism",
    "Contemporary",
    "China",
    "Literary Fiction",
    "Adult"
  ],
  "author": "Angel Di Zhang",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/63387762-the-light-of-eternal-spring"
}