{
  "title": "Michael Symon's Live to Cook: Recipes and Techniques to Rock Your Kitchen: A Cookbook",
  "description": "Hometown boy turned superstar, Michael Symon is one of the hottest food personalities in America. Hailing from Cleveland, Ohio, he is counted among the nation’s greatest chefs, having joined the ranks of Mario Batali, Bobby Flay, and Masaharu Morimoto as one of America’s Iron Chefs. At his core, though, he’s a midwestern guy with family roots in old-world traditions. In Michael Symon’s Live to Cook, Michael tells the amazing story of his whirlwind rise to fame by sharing the food and incredible recipes that have marked his route.Michael is known for his easy, fresh food. He means it when he says that if a dish requires more than two pans to finish, he’s not going to make it. Cooking what he calls “heritage” food–based on the recipes beloved by his Greek—Italian—Eastern European—American parents and the community in Cleveland–Michael draws on the flavors of traditional recipes to create sophisticated dishes, such as his Beef Cheek Pierogies with Wild Mushrooms and Horseradish, which came out of the pierogies that his grandpa made. Michael translates the influences of the diverse working-class neighborhood in which he grew up into dishes with Mediterranean ingredients, such as those in Olive Oil Poached Halibut with Fennel, Rosemary, and Garlic; Italian-style handmade pastas, like Linguini with Heirloom Tomato, Capers, Anchovies, and Chilies; and re-imagined Cleveland favorites, such as Mac and Cheese with Roasted Chicken, Goat Cheese, and Rosemary.Part of Michael’s irresistible allure on the Food Network comes from how much fun he has in the kitchen. To help readers gain confidence and have a good time, Michael Symon’s Live to Cook has advice for cooking like a pro, starting with basic instructions for how to correctly use techniques such as braising, poaching, and pickling. There’s also information on how caramelizing vegetables and toasting spices can give dishes a greater depth of flavor–instead of a heavy, time-consuming stock-based sauce–and why the perfect finishing touch to most meat or fish dishes can be a savory hot vinaigrette instead.With fantastic four-color photography throughout and tons of helpful “Symon Says” tips, Michael Symon’s Live to Cook is bound to get anyone fired up about getting into the kitchen and cooking up something downright delicious.From the Hardcover edition.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Culinary"
  ],
  "author": "Michael Symon",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/6338646-michael-symon-s-live-to-cook"
}