{
  "title": "Black Lamb and Grey Falcon: A Journey through Yugoslavia",
  "description": "Part travelogue, part history, part love letter on a thousand-page scale, Rebecca West's Black Lamb and Grey Falcon is a genre-bending masterwork written in elegant prose. But what makes it so unlikely to be confused with any other book of history, politics, or culture--with, in fact, any other book--is its unashamed depth of feeling: think The Decline and Fall of the Roman Empire crossed with Let Us Now Praise Famous Men. West visited Yugoslavia for the first time in 1936. What she saw there affected her so much that she had to return--partly, she writes, because it most resembled \"the country I have always seen between sleeping and waking,\" and partly because \"it was like picking up a strand of wool that would lead me out of a labyrinth in which, to my surprise, I had found myself immured.\" Black Lamb is the chronicle of her travels, but above all it is West following that strand of wool: through countless historical digressions; through winding narratives of battles, slavery, and assassinations; through Shakespeare and Augustine and into the very heart of human frailty.  West wrote on the brink of World War II, when she was \"already convinced of the inevitability of the second Anglo-German war.\" The resulting book is colored by that impending conflict, and by West's search for universals amid the complex particulars of Balkan history. In the end, she saw the region's doom--and our own--in a double infatuation with sacrifice, the \"black lamb and grey falcon\" of her title. It's the story of Abraham and Isaac without the last-minute reprieve: those who hate are all too ready to martyr the innocent in order to procure their own advantage, and the innocent themselves are all too eager to be martyred. To West, in 1941, \"the whole world is a vast Kossovo, an abominable blood-logged plain.\" Unfortunately, little has happened since then to prove her wrong. --Mary Park",
  "genres": [
    "History",
    "Travel",
    "Nonfiction",
    "Classics",
    "Politics",
    "Memoir",
    "European History"
  ],
  "author": "Rebecca West",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/1293986.Black_Lamb_and_Grey_Falcon"
}