{
  "title": "Judgment Day! Islam, Israel and the Nations",
  "description": "The Truth is More Devastating than Fiction In what is possibly the most comprehensive and clear-cut examination of ancient biblical prophecy and modern-day Middle East politics regarding Islam, Israel, and the nations, Judgment Day! is an eye-opening page-turner for scholars, analysts, pastors, professors, politicians, and laypeople alike. Amazing historical facts and first-hand insight make this book a thrilling, sometimes troubling, read—but one that is necessary for an accurate understanding of the prophetic times in which we live. Drawing parallels between the “land for peace” appeasement of Hitler (prior to his systematic extermination of more than 6 million Jews) and today’s strategy of the nations united against Israel is not at all difficult—but Dave Hunt goes much deeper than that. With painstaking clarity and detail, Judgment Day! reveals the ancient agenda against the Jews, and traces its twisted trail to modern-day deceptions of U.S. Presidents, foreign ambassadors, covert (and overt) military operations, businesspeople, educators, and world leaders alike. In this no-holds-barred documentary, Dave Hunt skillfully dissects the myth of Palestinian claims to “the Promised Land,” and exposes the fraud, deceit, and treachery of an international community allied against the Jewish nation. As the author writes, “In the final analysis, the battle over Israel is a battle for the souls and destiny of mankind. If Islam and the nations siding with her should accomplish their goal of destroying Israel, then mankind [from a biblical perspective] is eternally lost....” Why are the stakes so high? What will the outcome be? Discover the uncomfortable but irrefutable truth in Dave Hunt’s impassioned exposé—Judgment Day! Hear what Shimon Erem, one of the most celebrated Israeli generals of all time has to “Dave Hunt’s Judgment Day! has encyclopedic dimensions of the most crucial and vital issues of our times… ‘Life and Death’ issues, which affect us both as individuals and as a Judeo-Christian community. “In 1948, when the State of Israel was just re-established, 600,000 Israelis faced 80 million Arabs! Sixty-thousand ill-trained and ill-equipped Israeli ‘soldiers’ of a newly organized army (six months old) crushed 600,000 (a ratio of one to ten) soldiers of four Arab armies, well trained and heavily armed, reinforced by units from seven additional Arab countries, not to mention the active help of the British. “Shame and humiliation overwhelmed the whole Islamic world! “To eliminate Israel, a strategy was conceived, establishing the ‘unholy trinity’: Islamic terrorism, a hostile, anti-Semitic Europe, and a corrupt United Nations. The slogan of conquest ‘First the Saturday people, then the Sunday people.’ “Europe has already been invaded by hordes of Muslims. It is all there in Dave Hunt’s Judgment Day! Who is next? USA?! “Like the biblical prophets, Dave Hunt has a vision and is not hesitant to issue a Battle Cry. Judgment Day! is a MUST READ and a call to action! “James’ statement (2:26), ‘Faith without works is dead,’ cannot be ignored! Not only will Faith be dead, but, alas, the faithful too…unless we ACT! Dave Hunt makes it utterly clear in Judgment Day! It is a powerful book!” —Shimon Erem, July 2005",
  "genres": [
    "Islam",
    "Christianity"
  ],
  "author": "Dave  Hunt",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/634263.Judgment_Day_Islam_Israel_and_the_Nations"
}