{
  "title": "Rule and Ruin: The Downfall of Moderation and the Destruction of the Republican Party, From Eisenhower to the Tea Party",
  "description": "The chaotic events leading up to Mitt Romney's defeat in the 2012 election indicated how far the Republican Party had rocketed rightward away from the center of public opinion. Republicans in Congress threatened to shut down the government and force a U.S. debt default. Tea Party activists mounted primary challenges against Republican officeholders who appeared to exhibit too much pragmatism or independence. Moderation and compromise were dirty words in the Republican presidential debates. The GOP, it seemed, had suddenly become a party of ideological purity.Except this development is not new at all. In Rule and Ruin , Geoffrey Kabaservice reveals that the moderate Republicans' downfall began not with the rise of the Tea Party but about the time of President Dwight Eisenhower's farewell address. Even in the 1960s, when left-wing radicalism and right-wing backlash commanded headlines, Republican moderates and progressives formed a powerful movement, supporting pro-civil rights politicians like Nelson Rockefeller and William Scranton, battling big-government liberals and conservative extremists alike. But the Republican civil war ended with the overthrow of the moderate ideas, heroes, and causes that had comprised the core of the GOP since its formation. In hindsight, it is today's conservatives who are \"Republicans in Name Only.\"Writing with passionate sympathy for a bygone tradition of moderation, Kabaservice recaptures a time when fiscal restraint was matched with social engagement; when a cohort of leading Republicans opposed the Vietnam war; when George Romney--father of Mitt Romney--conducted a nationwide tour of American poverty, from Appalachia to Watts, calling on society to \"listen to the voices from the ghetto.\" Rule and Ruin is an epic, deeply researched history that reorients our understanding of our political past and present.Today, following the Republicans' loss of the popular vote in five of the last six presidential contests, moderates remain marginalized in the GOP and progressives are all but nonexistent. In this insightful and elegantly argued book, Kabaservice contends that their decline has left Republicans less capable of governing responsibly, with dire consequences for all Americans. He has added a new afterword that considers the fallout from the 2012 elections.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "American History",
    "Economics",
    "United States",
    "American"
  ],
  "author": "Geoffrey Kabaservice",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/12939277-rule-and-ruin"
}