{
  "title": "Faux Pas",
  "description": "Published in France in 1943, Faux Pas is the first collection of Maurice Blanchot's essays on literature and language, consisting of fifty-four short pieces that were originally issued as reviews in literary journals, and one long introductory meditation that defines the trajectory of the whole volume. These essays―like those collected in the other five books of criticism published over several decades―have established Blanchot as the most lucid and powerful French critic of the second half of the twentieth century. Sober reconstructions of the main tenets of both classical and modern, both literary and theoretical texts, they have attained the status of model readings for authors as diverse as da Vinci and Kierkegaard, Melville and Proust, Molière, Goethe, and Mallarmé. However, the book is not a miscellaneous collection of exquisite essays. The first section of the volume, \"From Anguish to Language,\" indicates the relative unity of its trajectory and its special moment in the development of Blanchot's thought. \"Anguish\" was a prominent notion for the existentialist philosophies of the period of his first work, and in this book Blanchot reflects on the necessary transition from the paradoxes of anguish to a focus on the paradoxes of language. He does so without ever betraying the affective tensions that attach themselves to linguistic utterances, but he also insists that the pathos of anxiety is, in the last resort, comical. Whoever writes \"I am lonely\" can judge himself to be quite comical, as he evokes his solitude by addressing a reader and using means that make it impossible to be alone. This comedy of language is retraced in Blanchot's intensely luminous essays on poetry and narration, on silence and symbolism, the novel and morals, the stranger, the enigma, time, and the very possibility of literature in the works of Blake, Balzac, Rimbaud, and Gide, Bergson and Brice Parain, Rilke and Bataille, Sartre, Camus, Queneau, and so many others.",
  "genres": [
    "France",
    "Literary Criticism",
    "Philosophy",
    "Theory"
  ],
  "author": "Maurice Blanchot",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/634167.Faux_Pas"
}