{
  "title": "Dark Creations: Gabriel Rising",
  "description": "Melissa Martin was not prepared for what she experienced when a new student walked into her English class, how she felt the first time they spoke; she did not believe in love at first sight. At seventeen years old, she envisioned love but never dreamed it possible.That was before she met Gabriel James.Gabriel was different from other boys. With otherworldly attractiveness, gallantry, charm, and intelligence, Gabriel was everything boys her age were not. As her relationship with Gabriel grew, she realized his kindness and generosity matched his extraordinary physical appearance. Melissa found her feelings for him growing stronger with their every encounter.But Gabriel had a secret, a dark secret.Gabriel was no ordinary teenage boy. His exceptional attributes were not random inheritances from his ancestry. His origins were far different.Gabriel James was not born of man and woman. His DNA was hand-picked and refined by Dr. Franklin Terzini and grown in a clandestine facility in the Russian Far East. Dr. Terzini created Gabriel to be the future of the human species, a perfected version. The crucial difference between Gabriel and the rest of humanity, however, was his inability to experience emotions. His lack of emotion was not by accident, but by design. Dr. Terzini believed that humankind would best be served without sentimentality, that feelings were the root of every ill within society. Gabriel supposed Terzini’s theory to be true; until he met Melissa.Despite Terzini’s intention, Melissa Martin awakens feelings within Gabriel, offers him life beyond his maker’s confines. Gabriel realizes emotionality is not what is wrong with the world, but what gives life meaning. He realizes he must risk everything to be with her, to conceal his relationship with her from Terzini.Elsewhere, in a far corner of the Earth, Dr. Franklin Terzini’s earliest creation spirals out of control, no longer contented by his meditative state, propelled by an insatiable bloodlust. A creature more powerful and hideous than any that roam the planet, his first creation journeys to the United States leaving a trail of victims in his wake, as hatred for Gabriel fuels his voyage.Dr. Terzini’s discovery of Gabriel’s feelings and his connection with Melissa, along with the arrival of his first creation, threatens to destroy more than Gabriel’s relationship. Gabriel desperately struggles to protect her from the unrelenting forces conspiring against them. He must guard her against his maker and shield her from the wrath of mankind’s darkest creation.",
  "genres": [
    "Paranormal",
    "Romance",
    "Young Adult",
    "Paranormal Romance",
    "Fantasy",
    "Fiction",
    "Supernatural"
  ],
  "author": "Jennifer Martucci",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/12939794-dark-creations"
}