{
  "title": "To His Mistress",
  "description": "Twist legend into truth... King Arthur, the Round Table, and Merlin's magic are not myth, but history. In nineteenth century England, where knights are more plentiful than peers and younger sons of lords hold the honorary title Squire, the Council of Mages is a clandestine division of the government. It may not be quite what Jane Austen experienced, but the Regency pattern of life remains as clean as Brummell's tailoring. Young ladies dream of a season; gentlemen drive high perch phaetons. Morph the Napoleonic Wars into a quest. Scholars surmise the Ark of the Covenant was lost during the Great Flood; why would biblical Noah call his ship \"Ark\" unless it held the Ark? Led by the Duke of Wellington, Britain conducts a quest for the Ark and repeatedly clashes with the French, who also seek the holy relic. Katherine Scoville, like many in Regency England, understands little about events in foreign places like Badajoz. She laments the large numbers of men reported dead, but newspaper accounts of carnage are overshadowed by the events shaping her life. The favored few born to wield magic hide their talent from a mistrustful populace that cannot forget Mordred's devastating attacks on Camelot. Alexander Stanton, the Earl of Shelton, is unaware that he harbors two of the rare breed: both his mother and his butler are practicing magicians. When his mother divines that Shelton is about to meet his predestined mate in the person of Katherine Scoville, she takes his fate in her own hands. Katherine is not a suitable wife for a Stanton so Mama will cause the marriage to fail. The butler disagrees with her assessment of the future and the two lay a wager. Events will now unfold, but the magicians intend to influence every thought, word and deed between Katherine and Shelton to win the wager. Whose magic is stronger -- can Mama destroy Shelton's marriage, or will the butler preside over a loving household? Unsuspecting of the dramatic curtain rising, Shelton spends the night at a country inn. Fate does its chore and he compromises Katherine. They must and do marry. Strangers to each other, the couple stumbles around intimacy and dances through disagreements. Shelton's stubborn nature won't allow him to see that Katherine did not scheme to trap him into matrimony and Katherine is determined that the arrogant earl will not intimidate her. Realizing that he feels a powerful attraction to his infuriating wife, but not knowing that his mother's spells are guiding him, Shelton makes the fatal decision to divorce Katherine and then make her his mistress. Katherine, as unaware as Shelton of magical interference, is subtly pressured to agree with his scheme. Then, a higher power steps in. The Green Man, an ancient, enigmatic god of the Celts, is disturbed by the magic ping ponging through his realm. He wakes and meddles in the marriage with his own brand of sorcery. Battered by conflicting magical commands, how can a marriage begun in strife prosper? Will Katherine gratify the butler's vision and accept Shelton's hand in love-strewn matrimony, or will Shelton follow his mother's lead and offer not love, but his body, to his mistress?",
  "genres": [],
  "author": "Ann Tracy Marr",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/6342696-to-his-mistress"
}