{
  "title": "Emil und die Detektive / Emil und die drei Zwillinge",
  "description": "Eigentlich konnte Erich Kästner gar nicht davon ausgehen, dass irgendjemand seinen Bestseller Emil und die Detektive noch nicht gelesen hatte. Dennoch fühlte er sich bemüßigt, dem Nachfolgeband Emil und die drei Zwillinge gleich zwei Vorworte voranzustellen: Eins für \"Fachleute\" -- also Kenner des ersten Bands --, und eins für \"Laien\", die von Emil, Oberwachtmeister Jeschke, Gustav mit der Hupe und Fräulein Hütchen zuvor noch nie gehört hatten. In diesem Vorwort spielt Kästner augenzwinkernd auf den Erfolg von Emil und die Detektive an. Darin beschreibt er, wie er dem Titelhelden seiner Geschichte, dem im ersten Teil im Zug nach Berlin das Geld gestohlen wird und der dann mittellos durch die Großstadt irrt, bis ihm im Kampf gegen den Verbrecher Herr Grundeis Hunderte von Berliner Gören zur Hilfe eilen, plötzlich in Steglitz \"leibhaftig\" gegenübersteht. Dort nämlich wird ein Film gedreht über seinen sympatischen Protagonisten, der schon im Laufe dieser Begegnung unversehens wieder in eine neue Geschichte hinein gerät, in der es um eine geerbte Villa und das Geheimnis der drei Zwillinge geht. Nicht so gut wie der erste Band, aber immer noch überaus lesenswert. Als Kästner Emil und die drei Zwillinge schrieb, stand er vor einem Problem, das Fortsetzungen berühmter Kinder- und Jugendbbücher bis hin zu Harry Potter immer wieder einmal haben: Ihre Helden altern. Deshalb sind Gustav, Fräulein Hütchen und natürlich auch Emil selbst eigentlich schon ein wenig in die Jahre gekommen. Trotzdem: Wer diesen Doppelband zum Super-Sonderpreis ersteht, wird mit gleich zwei Klassikern belohnt. Und kommt nie mehr in die Verlegenheit, Kästners Vorwort für \"Laien\" lesen zu müssen. --Thomas Köster",
  "genres": [
    "German Literature",
    "Childrens",
    "Fiction",
    "Classics",
    "School",
    "Novels",
    "Middle Grade"
  ],
  "author": "Erich Kästner",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/63469.Emil_und_die_Detektive_Emil_und_die_drei_Zwillinge"
}