{
  "title": "قصيدة بلقيس",
  "description": "التقى نزار \"بلقيس \" للمرة الأولى ولم يكن يعرف أن عقله وقلبه سيتعلقان بها إلى هذا الحد المجنون , الذي دفعه رغم الرفض المتواصل إلى التقدم لخطبتها حتى نال ما كان يحلم به , التقاها في حفل استقبال بسيط في إحدى السفارات العربية في بيروت , وكان خارجا لتوه من أزمة وفاة زوجته الأولى \" زهراء\" الدمشقية , وولدة \" توفيق \" الذي توفي إثر عملية جراحية للقلب في لندن , وهو ما يزال في الثانية والعشرين من عمره . وكانت ابنته الوحيدة \" هدباء \" قد تزوجت وانتقلت لتعيش مع زوجها في إحدى دول الخليج العربيكان نزار وحيدا تماما وكانت بلقيس قبيلة من النساء, هيفاء فرعاء يكاد شعرها يلامس الأرض في استرسال لم تر عين نزار مثله . وهكذا رأها , بشكل جعلة يعود إلى كتابة الشعر مرة أخرى بعد توقف دام ثلاث سنوات ,لم يكن يعرف له نزار مبررا. ويقول :\" لكنها بلقيس , أعادت الحبر للأقلام مثلما أعادت الدماء للعروق تقدم نزار لخطبة بلقيس لأول مرة عام 1962 لكن عائلتها رفضت لما كانت تسمع عن نزار من أنه شاعر النساء والغزل والحب . ولم تأمن على ابنتها أن تعيش مع رجل كل كلامه عن النساء . ظل نزار يلاحقها بإصرار شديد مدة سبع سنين , رفضت من خلالها بلقيس أشخاصاً عديدين لأنها تحب نزار على الرغم من أنه يكبرها كثيرا , وكانت لم تتجاوز الــ 23 من عمرها وهو في سن الاربعين عاود الكره عام 1969, وكانت الموافقة وتزوجا ليعيشا معا في بيروت , ورزقا بطفلين : زينب وعمــر ونعم نزار معها بحب عميق لا تشوبه شائبة ولا تعكر صفوه الأيام حتى جاء اليوم الذي فقد فيه نزار فاتنته العراقية. فقد قتلت بلقيس عام 1981 في حادث انفجار دمر السفارة العراقية في بيروت .وبكى نزار بمرارة زوجته التي سقته من حنانها 12 عاما , نعم فيها ما كان قد افتقده حيث صار نزار يجمع ولديه ، زينب وعمر , ويغلق بابه منذ الغروب , بعيدا عن الناس , عله يسبح بخياله فيقابل طيف بلقيس فنطق من شعره أروع القصائد ألا وهي قصيدة بلقيسرثاء بلقيس لا تكفيه بضعة أسطر.. لقد خط نزار قصيدة بطول المعلقات في رثائها، لأنها في نظره رثاء للأمة العربية كلها!",
  "genres": [
    "Poetry",
    "Literature",
    "Romance",
    "Classics",
    "Politics"
  ],
  "author": "نزار قباني",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/6343963"
}