{
  "title": "O Mundo Em Que Vivi",
  "description": "Numa escrita inexcedivelmente sóbria e transparente, e através de breves episódios, este romance conduz-nos em crescendo de emoção desde a primeira infância rural de uma judia na Alemanha, pelos finais da Primeira Guerra Mundial, até ao avolumar de crises (inflação, desemprego, assassínio de Rathenau, aumento de influência e vitória dos Nazis) que por fim a obrigam ao exílio mesmo na iminência de um destino trágico num campo de concentração. Há uma felicíssima imagem simbólica de tudo, que é a do lento avançar de uma trovoada que acaba por estar «mesmo em cima de nós». Assistimos aos rituais judaicos públicos e domésticos, a uma clara atracção alternativa entre a emigração para os E.U. e o sionismo. Fica-se simultaneamente surpreendido pela correspondência e pelas diferenças entre o adolescer e o viver adulto em meios culturais muito diversos, pois há relances de vida religiosa luterana, católica e de agnosticisrno à margem da experiência judaica ortodoxa. Perpassam figuras familiares de recorte nítido: os avós da aldeia, o pai, negociante de cavalos, desfeiteado por anti-semistas e falecido de cancro, os tios progressistas Franz e Maria, o avô Markus, a amorável avozinha Ester (kleine Orna), Paul (o jovem quase namorado que se deixa intimidar pelo ambiente), Kurt (o jovem enamorado assolapado, culto e firme nas suas convicções). A acção é desfiada numa sucessão de fases biográficas progressivamente dramáticas — e nós acabamos por participar afectivamente de um destino ao mesmo tempo muito singular e muito típico, que bem nos poderia ter cabido. Um romance de características únicas na literatura portuguesa — e emocionantemente certeiro.Oscar Lopes, Novembro de 1989",
  "genres": [
    "Portuguese Literature",
    "Fiction",
    "Portugal",
    "School",
    "Historical",
    "Middle Grade",
    "World War II"
  ],
  "author": "Ilse Losa",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/6347235-o-mundo-em-que-vivi"
}