{
  "title": "How to Write a Non-fiction Book in 60 Days",
  "description": "What does it take to write a non-fiction book in 60 days? It takes an idea. How to Write a Non-fiction Book in 60 Days spells out in detail the process required to move from your idea to a solid first draft of your book - in 60 days. It takes purpose. How to Write a Non-fiction Book in 60 Days will help you clearly define your purpose so you can focus on achieving what you set out to do. It takes knowledge of your reader. How to Write a Non-fiction Book in 60 Days will help you ascertain what your readers know, and what they need to know, so you can logically present the information required to meet their expectations. It takes time. How to Write a Non-fiction Book in 60 Days will show you how to use your time productively to brainstorm all you need to know about your subject matter, to organize your thoughts and to outline your book before you write. And it will show you how to write effectively and efficiently from outline point to outline point, until you complete a solid first draft of your book - in 60 working days. Do you have a book just waiting to come out? Are you procrastinating because you think it will take you years to write it? This book will show you how to write a comprehensive first draft - a draft you can send to an agent or publisher or one you can edit and self-publish - in 60 days (working about 2 to 4 hours per day). The book will show you how to create a detailed, chapter-by-chapter outline and how to write each chapter from point to point. In addition, the book includes two bonus chapters: one on self-publishing and one on constructing effective sentences and paragraphs. What readers have said: \"You take, what is to most people, a big, hairy, scary project and break it down into a process that seems almost mundane in its simplicity. All of a sudden writing a book is possible.\" - Angie Gallop, author of The PWAC Guide to Roughing it in the Market \"60 Days is encouraging and positive and would allow someone who has good writing skills to believe that they could in fact write a book. It gives a clear and concise listing of the tasks needed to write a book, and then provides the tools needed to complete the tasks.\" - Johanna Bertin M.S.W., R.S.W., medical social worker and freelance writer/author \"I am in the midst of writing my second book and How To Write A Non-Fiction Book In 60 Days gave me a serious energy boost. I have been a bit intimidated by the thought of writing a 75,000-word book and reading your book has given me the tools I need to complete it. Our techniques are similar, but yours have obviously been developed and fine-tuned and they really helped me!\" - Heather Cook, author of Rookie Reiner (due out in Fall 2008 from Trafalgar Square Books) and The Green Stable (due out in 2009 from Storey Publishing).",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "Five Rivers Chapmanry",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/6349127-how-to-write-a-non-fiction-book-in-60-days"
}