{
  "title": "Queer Wolf",
  "description": "Their world lies between the shadows and the moonlight, between man and animal...and in the city under neon moons and through iron-treed streets, the queer wolves run.Bound within QUEER WOLF is an exciting collection of contemporary, urban and sensual werewolf tales; a gathering of queer wolves presented by exciting, new and established authors. In WOLF STRAP, “Returning home for the funeral of her cousin, Ayla thinks the worse she’ll have to deal with is her prejudiced parents until she finds herself hunting down a monster.” In MOON SING, “A young urban werewolf must choose between his life in the city or a young man who has secrets of his own.” In WOLF LOVER, “Nigel has a werewolf fetish. When some rough trade doesn’t quite go to plan, he finds himself wondering who is the hunted and who is the hunter?” In SHY HUNTER, “Since being assaulted, David must struggle to control the beast within. But the killer stalking David’s lover may leave him no choice but to embrace his dangerous nature.” In THE STRAY, “John thought it just coincidence that his housemate and the big grey dog that came by for handouts never crossed paths. How long would it take him to catch on?” In NEW BEGINNINGS, “Michael wasn’t looking for change, but change found him in the form of Tori, a young werewolf with a difficult past. To make a new beginning, they’ll have to survive first.” In WHERE THE SLED DOGS RUN, “Fourth grade teacher Drew Halliard thought he knew everything about the late Horwood Mather and his sled dogs, but what if the sled dogs want to know more about Drew?” In PAVLOV’S DOG, “Sometimes wolves go bad…it is this knowledge that kept Josh in self imposed isolation until Caleb came to the Pavlov’s Dog and Josh realized that sometimes they don’t.” In WOLVES OF THE WEST, “Sometimes your life is defined by the things you have to keep hidden…” In FAMILY MATTERS , “What was supposed to be a quiet evening at home for alpha wolf Tala Nqumayo and her mate Mirabella turns into a desperate fight for the survival of the city they’ve sworn to protect.” In WRONG TURN, “When Kevin Thomas ends up somewhere he should never be he meets Shawn Jameson, someone he should never have met and enters a world of danger and mystery.” In LEADER OF THE PACK, “A new lover ignites a flood of emotions within Adolfo as he reflects on beginnings and discovers a startling and unexpected ending.” In WAR OF THE WOLVES, “It took a werewolf to save Hunter’s life and a mortal to show him his destiny…but in the war to come he must fight for all he holds dear.” In FLIP CITY, “With nightmares invading his city, Ryan’s only refuge is the silence of the park–but when a strange wolf bites him, he discovers that not all nightmares are bad…” In NIGHT SWIMMING, “Far more than skin is revealed at the city’s river when two men from different walks of life are brought together.” In IN THE SEEONEE HILLS, “When young Claire infiltrates a rival pack and draws the attention of Geneva, the pack’s charismatic heir, she soon discovers that she is not the only werewolf with a hidden agenda.” And in A WOLF’S MOON, “An interloper stalks the queer wolves of the city but it is the alpha’s lover, his mate, Sebastian who appears deepest under the spell of scent and seduction.” THERE IS A PINK MOON RISING... Stories RJ Bradshaw; Naomi Clark; Charlie Cochrane; Laramie Dean; Moondancer Drake; Ginn Hale; Erica Hildebrand; Michael Itig; Lucas Johnson; Andi Lee; Charles Long; Stephen Osborne; Robert Saldarini; Quinn Smythwood; Jerome Stueart; Anel Viz; Cari Z",
  "genres": [
    "Anthologies",
    "M M Romance",
    "Short Stories",
    "Paranormal",
    "Werewolves",
    "Shapeshifters",
    "Gay"
  ],
  "author": "James E.M. Rasmussen",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/6348520-queer-wolf"
}