{
  "title": "The Planet Pirates",
  "description": "THE PLANET PIRATES ENSLAVED SASSINAK AND DESTROYED HER WORLD...A FATAL MISTAKE! The Planet Pirates traces the careers of two remarkable women, and a few men, Fordelition, Dupaynil, Aygar. Sassinak escaped from slavery to freedom, and then used that freedom to fight the evil that had wrecked her world, first as a cadet, later as a captain, and finally as an Admiral of the Fleet. Lunzie, one of the galaxy's greatest healers, is Sassinak's great-grandmother, but in actual years she is her junior; Lunzie spent nearly a century in coldsleep waiting for rescue when her ship was destroyed. Imagine their mutual surprise when Sassinak rescued her. How together Sassinak and Lunzie save first a world, and then a confederation of worlds, and almost in passing establish amity between the genetically engineered Heavy Worlders and normal humanity, is the story of The Planet Pirates.Contents: * The Death of Sleep [Planet Pirates • 2] (1990) / novel by Anne McCaffrey and Jody Lynn Nye: Like every other citizen of the Federation of Sentient PLanets, Lunzie Mespil knew the so-called 'planet pirates\" were capable of terrible things. But,also like every other citizen of the Federation, she never in her heart of hearts believed anything would happen to her. When pirates attack the space liner in which she is a passenger Lunzie didn't panic. She kept her head, made it to a lifeboat and she isn't too worried; she will spend a month or two in cryogenic stasis awaiting inevitable rescue, and the proceed with her life. Only it might not be a month or two. * Sassinak [Planet Pirates • 1] (1990) / novel by Anne McCaffrey and Elizabeth Moon: Sassinak was 12 when the raiders came. That made her just the right age: old enough to be used, young enough to be broken. Or so the slavers thought. But Sassy turned out to be a little different... and bided her time to become the fleet captain of a pirate-chasing ship of her own. * Generation Warriors [Planet Pirates • 3] (1991) / novel by Anne McCaffrey and Elizabeth Moon: The list of people who will save the galaxy is not a long one, but together the might and wisdom of them cannot be thwarted. Lunzie, Fordelition, Dupaynil, Aygar and Sassinak work to stop disaster..",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Space Opera",
    "Space",
    "Science Fiction Fantasy",
    "Military Fiction"
  ],
  "author": "Anne McCaffrey",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/635270.The_Planet_Pirates"
}