{
  "title": "الغيب",
  "description": "Ilmu mengandung dua unsur, yaitu akal dan bayangan. Dengan akalnya manusia dapat memahami kekuatan yang menciptakan alam ini. Tetapi manusia tidak akan mampu menemukan wujud kekuatan penciptanya karena memang hanya Dia sendirilah yang mutlak mengetahui semua kunci kegaiban. Tapi ternyata Allah membentangkan satu benang tipis kepada hamba-Nya untuk mengetahui sedikit saja dari ilmu gaib milik-Nya. Kegaiban macam apa itu? Jika anda penasaran ingin mengetahuinya, anda tidak perlu pergi lagi kemana-mana atau mencari buku-buku tentang itu, karena buku karya penulis kondang Prof. Dr. M. Asy Syarawi yang telah diterjemahkan oleh H. A. Aziz Salim Basyarahil sudah menjawabnya. Dibagi menjadi lima bab, buku ini diawali dengan bab ilmu gaib. Bab ini menjelaskan tentang apa itu ilmu gaib, bagaimana ilmu gaib itu, dan ada apa dengan ilmu gaib. Di bab ini juga diceritakan tentang kebingungan-kebingungan manusia mengenai ilmu gaib yang tidak mungkin dijangkau oleh manusia. Bahkan ada seorang ahli filsafat yang mencoba menerobos permasalahan ini dengan mencoba menggambarkan Allah (berimajinasi terhadap Allah) dengan gambaran seolah-olah Allah itu benda (makhluk). Dengan bahan-bahan dan teori yang semuanya kosong dan hampa. Buktinya tidak ada ajaran filsafat yang cocok satu dengan lainnya. Yang jelas, hal itu adalah persoalan-persoalan yang berada diluar jangkauan manusia. Selain itu bab ini juga menjelaskan kesalahan pendapat kuno dan pendapat baru yang benar. Juga ada penjelasan mengenai penciptaan makhluk, kehidupan, dan kematiannya. Melangkah ke bab berikutnya mengenai pelanggaran dan kezaliman manusia. Di bab ini dijelaskan gambaran dan tahapan pelanggaran manusia. Didalamnya terdapat sebab-sebab musnahnya peradaban manusia zaman dahulu karena perbuatan mereka sendiri. Dijelaskan pula apa yang diperoleh orang-orang zalim yakni azab yang pedih dari Allah. Bab selanjutnya yaitu doa sebagai otaknya ibadah. Doa atau memohon kepada Allah adalah sebuah kewajiban. Jika seseorang tidak mau berdoa, berarti orang tersebut adalah orang yang sombong dan angkuh karena tidak mau memohon kepada Allah. Di bab ini juga dijelaskan doa yang diterima dan ditolak oleh Allah. Dan bab terakhir mengenai sikap dan pendirian ahlul kitab terhadap Rasulullah. Dan sebagai penutup adalah kisah mengenai datangnya nabi umat islam dan pembangkangan oleh kaum Yahudi. Buku ini menyuguhkan kita sedikit gambaran mengenai ilmu gaib. Tema yang unik yaitu mengulas tentang ilmu gaib membuat buku ini cukup menarik untuk dibaca. Sampul buku buku juga cukup menarik. Dengan menguraikan penjelasan secara terperinci dan dengan bahasa sederhana membuat buku ini mudah untuk dipelajari siapa saja. Diantara keunggulan-keunggulan tersebut rupanya buku ini juga masih ditemui kesalahan ketik pada beberapa kata. Namun secara keseluruhan buku ini tetap baik untuk dibaca. Apalagi pada zaman sekarang ini, banyak sekali fenomena-fenomena gaib yang disalahartikan oleh masyarakat. Dan semoga buku ini dapat lebih membuka wawasan masyarakat akan hal-hal gaib.",
  "genres": [
    "Religion",
    "Islam"
  ],
  "author": "محمد متولي الشعراوي",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/6354335"
}