{
  "title": "To Live Is To Die: The life and death of Metallica's Cliff Burton",
  "description": "Metallica, the seventh-biggest recording act in American history, are consummate musicians--but it wasn't always that way. A significant proportion of their playing expertise was acquired from a pivotal three-year period in their history--1983 to 1986--during which their music, a potent variant of thrash metal, evolved from garage level to sophisticated, progressive heights thanks to the teachings of their bass player, Cliff Burton. The San Francisco-raised Burton, born in 1962, pushed the band to new musical levels with his musical training, songwriting ability and phenomenal bass guitar skills. Across three albums--Kill 'Em All (1983), Ride The Lightning (1985) and Metallica's undisputed masterpiece, Master Of Puppets (1986)--Burton's awe-inspiring playing, derived from a unique blend of classical and punk approaches, received worldwide recognition from fans and bass players alike. He was the first heavy metal bassist since Black Sabbath's Geezer Butler to regard the bass as a lead instrument, delivering intricate live solos based on classical fugues and even laying down a solo track on Metallica's debut album. Cliff's life was short but influential; his death was sudden and shocking. At the age of just 24, he was killed when Metallica's tourbus overturned on a remote Swedish mountain road in the early hours of September 27, 1986 for reasons which have still not been ascertained: he was crushed to death after being thrown from his bunk through a window. The driver, who has never been identified, told the rest of the band that the bus had hit black ice, leading to the accident: singer James Hetfield refused to believe him and has often spoken publicly about his doubts. With Cliff's death, Metallica's most critically acclaimed period of activity ended. They went on to record huge-selling albums, but by their own admission never pushed the creative envelope as radically as they had done in the first four years of their career.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "History",
    "Biography Memoir",
    "Pop Culture"
  ],
  "author": "Joel McIver",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/6353669-to-live-is-to-die"
}