{
  "title": "إسلام بلا مذاهب",
  "description": "نبذة النيل والفرات:المسلمون، ماضيهم مشرق مضيء، قوي عزيز، وحاضرهم حاب ضعيف مستذل، معتدى عليه. لذا يقف المسلم، متألماً من الواقع الذي صار إليه المسلمون والمؤلف كواحد من المسلمين يحاول الوقوف في هذا الكتاب على الأسباب التي أدت إلى هذه المفارقات الضخمة المؤسفة بين موقف المسلمين وحالهم في أمسهم ويومهم، ولم يظل به التفكير، فسرعان ما اهتدى إلى أن ضعف المسلمين جاءت تفرق كلمتهم وبشتات شملهم نتيجة لتفرق المذهب والعقيدة، فمذاهب المسلمين المختلفة كانت الباب الذي دخل منه الخلاف، واستغل الاستعمار هذه الثغرة فوسعها، وباركها كما يبارك الشيطان فعل الكبائر: هذا إمامي، وذاك زيدي، ومنهم من غلا في مذهبه علواً كبيراً: فهذا إسماعيلي، وذاك درزي، والآخر علوي، ثم يلتفت مرة أخرى فيجد أيضاً بعض رجال السنة يختلفون، ويجد أيضاً بأن هذا أباضياً وهذا يميل إلى الاعتزال، والإسماعيلية نفسها فيها النزارية الآغاخانية، والمستعلية البهرة ثم في الهند بعيداً جماعة الأحمدية أو القاديانية، وهي تنسب نفسها إلى الإسلام، ويصلح فريق منها ويضل فريق مذاهب مختلفة وعقائد متعددة في ظل دين واحد، ورسول واحد، يستغلها ذوو النيات السيئة وأصحاب المقاصد الدنيئة في حزب المسلمين بعضهم ببعض، فوق المؤلف من هذه المذاهب جميعاً، ما درس منها وما بقى، موقف الدارس المستأني، وقدمها إلى القارئ في يسر وبساطة ولين، وعرض لها عرضاً لها تاريخياً وأدبياً وعقائدياً، ناظراً نظرة علمية سمحة، مستهدفاً الإنصاف ما وسعه إلى ذلك سبيلاً، حتى يتعرف المسلمون على اختلاف مذاهبهم وفرقهم وطوائفهم الموقف الذي ينبغي أن يكونوا فيه.وقد قدم للكتاب فصلاً عن ماهية الإسلام وعظمته وما ضم من تشريعات سماوية دونها أية تشريعات سابقة أو لاحقة، وما حوى من نظم مثالية، وتكامل اجتماعي عادل، وشورى، وحرب على التميز العنصري، ولما كان بعض أعداد الإسلام قد اتخذوا من بعض الأمور، عن جهل وتصوره ذرائع لمهاجمة هذا الدين، فقد كتب المؤلف عدة موضوعات تتناول موقف الإسلام من حكمته تعدد الزوجات، ومن خرافة انتشاره بالسيف ومن الرُق، كل ذلك تناوله المؤلف، بأسلوب مبسط، ضارباً الأمثلة، ومتمثلاً الأحكام التي لا يأتيها الباطل من بين يديها ولا من خلفها، حيث جاء هذا الفصل التعريفي في مقدمة الكتاب.",
  "genres": [
    "Religion",
    "Islam",
    "History",
    "Sociology"
  ],
  "author": "مصطفى الشكعة",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6353835"
}