{
  "title": "Can We Talk About Race?: And Other Conversations in an Era of School Resegregation",
  "description": "Beverly Daniel Tatum emerged on the national scene in 1997 with \"Why Are All the Black Kids Sitting Together in the Cafeteria?,\" a book that spoke to a wide audience about the psychological dynamics of race relations in America. Tatum's unique ability to get people talking about race captured the attention of many, from Oprah Winfrey to President Clinton, who invited her to join him in his nationally televised dialogues on race.In her first book since that pathbreaking success, Tatum starts with a warning call about the increasing but underreported resegregation of America. A self-described \"integration baby\"--she was born in 1954--Tatum sees our growing isolation from each other as deeply problematic, and she believes that schools can be key institutions for forging connections across the racial divide.In this ambitious, accessible book, Tatum examines some of the most resonant issues in American education and race relations: -The need of African American students to see themselves reflected in curricula and institutions-How unexamined racial attitudes can negatively affect minority-student achievement-The possibilities--and complications--of intimate crossracial friendshipsTatum approaches all these topics with the blend of analysis and storytelling that make her one of our most persuasive and engaging commentators on race.Can We Talk About Race? launches a collaborative lecture and book series between Beacon Press and Simmons College, which aims to reinvigorate a crucial national public conversation on race, education and democracy.\"What Tatum seeks to do above all is trigger sometimes challenging discussions about race, and infuse those discussions with a reality-based focus on how race affects us all. Her latest book does that beautifully, asking touch questions, and patiently, inclusively seeking answers.\" --Boston Globe Beverly Daniel Tatum is author of Why Are All the Black Kids Sitting Together in the Cafeteria? and Assimilation Blues. She is currently president of Spelman College in Atlanta, where she lives with her husband.",
  "genres": [
    "Education",
    "Nonfiction",
    "Race",
    "Social Justice",
    "Sociology",
    "Anti Racist",
    "Psychology"
  ],
  "author": "Beverly Daniel Tatum",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/635112.Can_We_Talk_About_Race_"
}