{
  "title": "True Competition: A Guide to Pursuing Excellence in Sport and Society",
  "description": "True A Guide to Pursuing Excellence in Sport and Society offers a blueprint for maximizing the potential of competition to foster excellence and enjoyment. It provides a novel perspective on competition that challenges traditional beliefs through a research-backed defense that—up until now—has been lacking. With this text, readers will learn the differences between positive and negative competition, and they will discover how to implement change in their organizations, teams, and individual practices. The authors of this groundbreaking book, who are leading experts in sport psychology, redefine what competition is and should be. Unlike the more typical and often socially destructive form of competition—which they call decompetition —true competition brings out excellence in participants, fosters positive character development, and leads to lasting enjoyment. This socially and psychologically positive perspective on competition challenges Alfie Kohn's No The Case Against Competition , which has been called the definitive critique of competition. The authors propose that competition itself is not problematic; rather, they question how competition is sometimes envisioned, interpreted, and implemented. They provide suggestions for achieving positive outcomes from competition, including creating challenging yet supportive environments in sport programs and teams, fostering the well-being of athletes, and encouraging athletes to handle various situations. The research-based text uses a field-guide approach, in which the components of true competition are presented in chapter 3 and then detailed in the following chapters. This approach helps readers understand competition and how it is being used in their own lives. While the book relies heavily on the arena of sports, it also provides many examples of applying this revised understanding of competition in business, education, politics, and other nonsport environments. To enhance the learning experience, True Competition offers the following -A scholarly analysis of competition is presented in a clear and engaging writing style, making the provocative concepts easily accessible to any reader. -Engaging sidebars give examples of how true competition has been created in various environments to shorten the implementation curve for readers. -Q&A sidebars pose practical questions to ponder—just as a parent, coach, or official would—and prepares readers for issues they will confront in the field. By applying the information presented in this text, students, professionals, and athletes will learn how to maximize the benefits of competition by avoiding decompetition. Not only will they understand how to recognize and respond to positive and negative forms of competition, but they also will gain the tools they need in order to promote true competition in their own worlds.",
  "genres": [
    "Science"
  ],
  "author": "David Light Shields",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/6356419-true-competition"
}