{
  "title": "God's Plagiarist: Being an Account of the Fabulous Industry and Irregular Commerce of the Abbe Migne",
  "description": "God's Plagiarist is an entertaining account of the abbe Jacques-Paul Migne, one of the great entrepreneurs of the nineteenth century. A priest in Orleans from 1824 to 1833, Migne then moved to Paris, where, in the space of a decade, he built one of the most extensive publishing ventures of all time.How did he do it?Migne harnessed a deep well of personal energy and a will of iron to the latest innovations in print technology, advertising, and merchandising. His assembly-line production and innovative marketing of the massive editions of the Church Fathers placed him at the forefront of France's new commerce. Characterized by the police as one of the great \"schemers\" of the century, this priest-entrepreneur put the most questionable of business practices in the service of his devotion to Catholicism.Part detective novel, part morality tale, Bloch's narrative not only will interest scholars of nineteenth-century French intellectual history but will appeal also to general readers interested in the history of publishing or just a good historical yarn.\"An unforgettable, Daumier-like portrait, sharp and satirical, of this enterprising, austere and somewhat crazed merchandiser of sacred learning. . . . Bloch deserves great credit for the wit and style of his effort to explore the Pedantic Park of nineteenth-century learning, that island of monsters which scholars have found, as yet, no escape.\"—Anthony Grafton, New Republic\"Bloch is an exhilarating guide to the methods which made Migne the Napoleon of the Prospectus, a publicist of genius, Buffalo Bill and P.T. Barnum rolled into one.\"—David Coward, Times Literary Supplement\"Mercifully, Bloch's sense of humour has none of that condescending mock-bewilderment commonly applied to the foreign or ancient. . . . It enables Bloch to promote Migne as a forerunner of the department store and to place him on a continuum running from St. Paul to the Tupperware the quality of the merchandise is increasingly irrelevant, still more the nature of its contents.\"—Graham Robb, London Review of Books",
  "genres": [
    "History",
    "Books About Books",
    "Nonfiction"
  ],
  "author": "R. Howard Bloch",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/635906.God_s_Plagiarist"
}