{
  "title": "The Two Bells of Christmas",
  "description": "Christmas is the perfect time to fall in love—unless you’re pretending to be your twin sister.Cassandra Bell is happy to stay in the shadow of her poised and proper twin sister. After all, her only goal for the Hastings’ Christmas house party is to not make a complete fool of herself. Vivian, however, has much higher aspirations—her heart is set on a proposal from the eligible Mr. Hastings himself. But when Vivian grows ill, she begs Cassie to switch places with her and keep the other conniving ladies away from Mr. Hastings. Cassie reluctantly takes on the role of her twin, certain the charade will end in disaster.Anticipating a quiet Christmas in the country, Roland Hastings arrives home to learn his matchmaking mother has organized an entire house party to help him find a bride. The last thing Roland wants is to spend the Yuletide season fending off simpering ladies—that is, until he meets Miss Bell. Spunky and unconventional and refreshingly honest, Miss Bell sweeps into Roland’s heart like a whirlwind. A whirlwind he has no desire to escape.Mr. Hastings is nothing like Cassie expected, and the closer she grows to her handsome host, the harder it becomes to hide her true self—and her true feelings. But falling in love was never part of the plan, especially since Roland believes she is someone else. With Vivian quickly recovering and the house party coming to a close, Cassie is torn between loyalty to her sister and the unexpected yearnings of her heart . . .The Two Bells of Christmas is a sweet Regency romance novella that was previously published in the Timeless Regency Collection, A Christmas Promise. This edition has a bonus epilogue and new edits.",
  "genres": [
    "Christmas",
    "Romance",
    "Historical Fiction",
    "Regency",
    "Novella",
    "Historical Romance",
    "Regency Romance"
  ],
  "author": "Joanna  Barker",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/63589186-the-two-bells-of-christmas"
}