{
  "title": "Adventures with Ari: A Puppy, a Leash & Our Year Outdoors",
  "description": "Merle’s Door was a sensation because Ted Kerasote writes so beautifully about his dog and his dog’s love of the land. In Adventures wtih Ari , Kathryn Miles takes a step back from the wild places Kerasote describes. When she adopts Ari, an exotic Jindo dog, the two of them begin to explore the outdoors together. A dog sees the world quite differently from a person. For starters, he or she is much closer to the ground—to what we’ve been trying to preserve more and more of these days. A dog is the original environmental The sights, sounds, and smells of nature are what make a dog a dog. And if you want to learn more about nature, try enjoying life like a dog.Kathryn Miles sets out to do just that when she becomes determined to let Ari live life on her own terms. Once some basic ground rules are set, Kathryn takes the leash off her dog and the blinders off her own eyes. A new world soon She and Ari explore a backyard landscape of grass, mud, snow, trees, and the occasional fox. They find the scent of a northern wind, the footprints of a startled raccoon, and other secrets of the natural world. The puppy’s free-spirited outlook teaches Kathryn to see more when she might otherwise have seen less, while adding a certain excitement and clarity of vision. Soon, Kathryn begins to give up control and know the world as Ari learns it.Peppered with factual information about our natural world and the creatures that inhabit it, Adventures with Ari makes compelling reading for dog lovers as well as anyone who’s been out and about in the woods. Like most projects of discovery, this process forces Kathryn to uncover much more than the physical—it allows important insight to her thoughts and feelings and her relationship with her entire family, all thanks to a puppy named Ari.",
  "genres": [
    "Dogs",
    "Nonfiction",
    "Animals",
    "Memoir"
  ],
  "author": "Kathryn Miles",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/6361987-adventures-with-ari"
}