{
  "title": "The Spencer Johnson Audio Collection: Including Who Moved My Cheese? and Peaks and Valleys",
  "description": "WHO MOVED MY CHEESE?10th Anniversary EditionWho Moved My Cheese? is an amusing and enlightening story of four characters who live in a \"Maze\" and look for \"Cheese.\" \"Cheese\" is a metaphor for what you want to have in life -- whether it is a good job, a loving relationship, money, a possession, health, or spiritual peace of mind. And the \"Maze\" is where you look for what you want -- the organization you work in, or the family or community you live in. When you come to see \"The Handwriting on the Wall,\" you can discover for yourself how to deal with change, so that you can enjoy less stress and more success.The 10th anniversary audio edition of Who Moved My Cheese? includes exclusive bonus material in which Spencer Johnson offers fresh insights on its origins, impact and applications that will help you put its powerful wisdom to work.PEAKS AND VALLEYSIncludes a bonus interview with the author!Peaks and Valleys is a story of a young man who lives unhappily in a valley until he meets an old man who lives on a peak, and it changes his work and life forever. Initially, the young man does not realize he is talking with one of the most peaceful and successful people in the world. However, through a series of conversations and experiences that occur up on peaks and down in valleys, the young man comes to understand how he can use the old man's remarkable principles and practical tools in good and bad times and becomes more calm and successful himself.Now you can take a similar journey. In the story of Peaks and Valleys, and in the bonus audio interview with Spencer Johnson, sharing exclusive insights on how to put these principles to work -- you will discover how you Get out of a valley sooner; stay on a peak longer; and have more peaks and fewer valleys.",
  "genres": [],
  "author": "Spencer Johnson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/6364060-the-spencer-johnson-audio-collection"
}