{
  "title": "I Burn Paris",
  "description": "\"This is a superb text of astonishing modernity, a veritable manifesto of the wretched of the earth ...\"— MarianneBruno Jasienski’s I Burn Paris has remained one of Poland’s most uncomfortable masterstrokes of literature since its initial and controversial serialization in 1928 in the French magazine L’Humanité (for which Jasienski was deported). It tells the story of a disgruntled factory worker who, finding himself on the streets, takes the opportunity to poison Paris's water supply with a deadly virus. With the deaths piling up, we encounter Chinese communists, rabbis, disillusioned scientists, American millionaires and a host of others as the city sections off into ethnic enclaves and everyone plots their route of escape. At the heart of the cosmopolitan city is a deep-rooted xenophobia and hatred — the one thread that binds all these groups together. As Paris lies in ruin, Jasienski issues a rallying cry to the downtrodden of the world while mixing \"The Internationale\" with a broadcast of popular music.With its montage strategies reminiscent of early avant-garde cinema and fist-to-the-gut metaphors, I Burn Paris has lost none of its vitality and vigor. Ruthlessly dissecting various utopian fantasies, Jasienski is out to disorient, and he has a seemingly limitless ability to transform the Parisian landscape into the product of disease-addled minds. An exquisite example of literary Futurism and Catastrophism, the novel presents a filthy, degenerated world where factories and machines have replaced the human, but rather than cliché and simplistic propaganda, these features are given an immediacy that depicts the modern metropolis as only superficially cosmopolitan, as hostile and animalistic to its core.",
  "genres": [
    "Fiction",
    "Classics",
    "Poland",
    "Polish Literature",
    "Literature",
    "Fantasy",
    "Novels"
  ],
  "author": "Bruno Jasieński",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/12943902-i-burn-paris"
}