{
  "title": "Three Stations",
  "description": "A passenger train hurtling through the night. An unwed teenage mother headed to Moscow to seek a new life. A cruel-hearted soldier looking furtively, forcibly, for sex. An infant disappearing without a trace.So begins Martin Cruz Smith’s masterful Three Stations, a suspenseful, intricately constructed novel featuring Investigator Arkady Renko. For the last three decades, beginning with the trailblazing Gorky Park, Renko (and Smith) have captivated readers with detective tales set in Russia. Renko is the ironic, brilliantly observant cop who finds solutions to heinous crimes when other lawmen refuse to even acknowledge that crimes have occurred. He uses his biting humor and intuitive leaps to fight not only wrongdoers but the corrupt state apparatus as well.In Three Stations, Renko’s skills are put to their most severe test. Though he has been technically suspended from the prosecutor’s office for once again turning up unpleasant truths, he strives to solve a last case: the death of an elegant young woman whose body is found in a construction trailer on the perimeter of Moscow’s main rail hub. It looks like a simple drug overdose to everyone—except to Renko, whose examination of the crime scene turns up some inexplicable clues, most notably an invitation to Russia’s premier charity ball, the billionaires’ Nijinksy Fair. Thus a sordid death becomes interwoven with the lifestyles of Moscow’s rich and famous, many of whom are clinging to their cash in the face of Putin’s crackdown on the very oligarchs who placed him in power.Renko uncovers a web of death, money, madness and a kidnapping that threatens the woman he is coming to love and the lives of children he is desperate to protect. In Three Stations, Smith produces a complex and haunting vision of an emergent Russia’s secret underclass of street urchins, greedy thugs and a bureaucracy still paralyzed by power and fear.",
  "genres": [
    "Fiction",
    "Mystery",
    "Russia",
    "Thriller",
    "Crime",
    "Detective",
    "Suspense"
  ],
  "author": "Martin Cruz Smith",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/6362651-three-stations"
}