{
  "title": "Heart of the Assassin",
  "description": "The year is 2045 and a warrior battles to save America from an Islamic mastermind in this smart and violent futuristic thriller from New York Times bestselling author Robert Ferrigno.Time is running out for the Islamic Republic and the Bible Belt, the two warring nations that arose when the former United States split apart after an economic collapse left tens of millions unemployed and desperate for leadership. Weakened by their endless conflict, both countries are now threatened by the expansionist dreams of the Aztlán Empire (formerly known as Mexico) to the south, which has steadily encroached deep into the regions once called California, Arizona, New Mexico, and Texas. Riven by intellectual and social decay, both the Islamic Republic and the Belt are at the brink of collapse.The only solution is to reunite the countries and regain America's former power and global standing. And there's only one man who can do it: Rakkim Epps, genetically enhanced shadow warrior and hero of the two previous books in Robert Ferrigno's astonishing Assassin Trilogy.Time is also running out for Epps's archenemy, the Old One, the sly, immensely rich Muslim fanatic who seeks to create one world under his domination. Now more than one hundred and fifty years old, he is dying and unhappily knows it. His solution is to reunite the Islamic Republic and the Bible Belt his way, and his plan involves his voluptuous but deadly daughter, Baby, and none other than Rakkim himself. The Old One is aided by his sadistic, carbon-skinned enforcer, Gravenholtz, whom Rakkim failed to kill in an earlier encounter and who now wishes to kill Rakkim and those he loves.Meanwhile, there is a rumor of a discovery of a sacred relic in the contaminated ruins of Washington, D.C., a radiation zone peopled by diseased zombies and daring treasure hunters. It is into this deadly wasteland that Rakkim must secretly travel and retrieve the icon if he is to defeat Gravenholtz, Baby, and the Old One, and have even a chance to unite the two halves of America.",
  "genres": [
    "Fiction",
    "Thriller",
    "Dystopia",
    "Science Fiction",
    "Alternate History",
    "Mystery",
    "Post Apocalyptic"
  ],
  "author": "Robert Ferrigno",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/6359636-heart-of-the-assassin"
}