{
  "title": "Thicker Than Water",
  "description": "NOT YOUR TEENAGE SISTER'S VAMPIRESTyr and Loki are the kind of vampires who live for their own pleasure, not yours. They feel no remorse. They view human beings as livestock or sex objects. And after a thousand years of sex and destruction seducing and murdering the prettiest girls in the room, they have become two of the most diabolical serial killers of all time.But following a violent feud that separates the brothers for over a decade, Tyr hides himself away in a house on the outskirts of Las Vegas where he falls in love with a terminally ill young woman named Eva, an act deemed punishable by death by the fabled vampire council known as The Chosen.When a mysterious messenger arrives at his home, Tyr fears both Loki and The Chosen have tracked him down, forcing him to protect both himself and the dying young woman who is teaching him to feel.Thicker Than Water is a vampire thriller focusing on 100 years of immortal, hedonistic life, from the slummy brothels of the American Wild West to the bright lights of Las Vegas circa 1999. The story weaves together vampires, brothel owners, cowboys, prostitutes, and gallons of innocent blood in an orgy of violence, sex, revenge, romance, betrayal, and brotherly love.ABOUT THE \"BLOOD BROTHERS\" VAMPIRE SERIESThicker Than Water marks the first novel in the Blood Brothers vampire series. Drawing inspiration from Norse mythology and the works of Shakespeare, the series spans 1,000 years and half the globe, telling the story of two brothers and the rise and fall of their bloodthirsty clan. The aim of the series is to paint vampires as gods, preying on humanity from the shadows as they steer the events of history.Each of the four novels in the Blood Brothers vampire series will tell both a present day story and an historical story set sometime within the last 1,000 years, gradually unveiling the mystery of the brothers' origin and the details of their fall. The second novel in the series, The Wages of Sin, is now available exclusively in Amazon's Kindle Store.",
  "genres": [
    "Vampires",
    "Horror",
    "Paranormal",
    "Fiction",
    "Amazon",
    "Young Adult"
  ],
  "author": "Greg Sisco",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/12945682-thicker-than-water"
}