{
  "title": "House of Bush, House of Saud: The Secret Relationship Between the World's Two Most Powerful Dynasties",
  "description": "Newsbreaking and controversial -- an award-winning investigative journalist uncovers the thirty-year relationship between the Bush family and the House of Saud and explains its impact on American foreign policy, business, and national security.House of Bush, House of Saud begins with a politically explosive How is it that two days after 9/11, when U.S. air traffic was tightly restricted, 140 Saudis, many immediate kin to Osama Bin Laden, were permitted to leave the country without being questioned by U.S. intelligence?The answer lies in a hidden relationship that began in the 1970s, when the oil-rich House of Saud began courting American politicians in a bid for military protection, influence, and investment opportunity. With the Bush family, the Saudis hit a gusher -- direct access to presidents Reagan, George H.W. Bush, and George W. Bush. To trace the amazing weave of Saud- Bush connections, Unger interviewed three former directors of the CIA, top Saudi and Israeli intelligence officials, and more than one hundred other sources. His access to major players is unparalleled and often exclusive -- including executives at the Carlyle Group, the giant investment firm where the House of Bush and the House of Saud each has a major stake.Like Bob Woodward's The Veil, Unger's House of Bush, House of Saud features unprecedented reportage; like Michael Moore's Dude, Where's My Country? Unger's book offers a political counter-narrative to official explanations; this deeply sourced account has already been cited by Senators Hillary Rodham Clinton and Charles Schumer, and sets 9/11, the two Gulf Wars, and the ongoing Middle East crisis in a new What really happened when America's most powerful political family became seduced by its Saudi counterparts?",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Biography",
    "Journalism",
    "The United States Of America",
    "American History"
  ],
  "author": "Craig Unger",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/636758.House_of_Bush_House_of_Saud"
}