{
  "title": "Country of My Skull: Guilt, Sorrow, and the Limits of Forgiveness in the New South Africa",
  "description": "Ever since Nelson Mandela dramatically walked out of prison in 1990 after twenty-seven years behind bars, South Africa has been undergoing a radical transformation. In one of the most miraculous events of the century, the oppressive system of apartheid was dismantled. Repressive laws mandating separation of the races were thrown out. The country, which had been carved into a crazy quilt that reserved the most prosperous areas for whites and the most desolate and backward for blacks, was reunited. The dreaded and dangerous security force, which for years had systematically tortured, spied upon, and harassed people of color and their white supporters, was dismantled. But how could this country--one of spectacular beauty and promise--come to terms with its ugly past? How could its people, whom the oppressive white government had pitted against one another, live side by side as friends and neighbors?To begin the healing process, Nelson Mandela created the Truth and Reconciliation Commission, headed by the renowned cleric Archbishop Desmond Tutu. Established in 1995, the commission faced the awesome task of hearing the testimony of the victims of apartheid as well as the oppressors. Amnesty was granted to those who offered a full confession of any crimes associated with apartheid. Since the commission began its work, it has been the central player in a drama that has riveted the country. In this book, Antjie Krog, a South African journalist and poet who has covered the work of the commission, recounts the drama, the horrors, the wrenching personal stories of the victims and their families. Through the testimonies of victims of abuse and violence, from the appearance of Winnie Mandela to former South African president P. W. Botha's extraordinary courthouse press conference, this award-winning poet leads us on an amazing journey.Country of My Skull captures the complexity of the Truth Commission's work. The narrative is often traumatic, vivid, and provocative. Krog's powerful prose lures the reader actively and inventively through a mosaic of insights, impressions, and secret themes. This compelling tale is Antjie Krog's profound literary account of the mending of a country that was in colossal need of change.",
  "genres": [
    "Nonfiction",
    "Africa",
    "South Africa",
    "History",
    "Politics",
    "Memoir",
    "Biography"
  ],
  "author": "Antjie Krog",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/63675.Country_of_My_Skull"
}