{
  "title": "Psychamok",
  "description": "Brian Lumley is an international horror phenomenon, with books published in thirteen countries, including China, the Czech Republic, Germany, Japan, Russia, and Spain. More than two million books have been sold in his Necroscope series alone, but that barely taps the potential of this wildly imaginative author. Lumley's horror often crosses the dividing lines between fantasy and horror or between science fiction and horror. The Psychomech trilogy, of which Psychamok is the conclusion, is a perfect blend of science fiction, adventure, and horror, combining in a fast-paced whirlwind of a story that leaves the reader doubting the evidence of his or her own senses. Richard Garrison was once a corporal in the British Military Police, until a terrorist's bomb destroyed his eyesight and his career. Repaying Garrison for saving his wife and child from the blast, millionaire industrialist Thomas Schroeder introduced him to the Psychomech, an amazing machine that could either gift its users with astonishing mental powers-or destroy them utterly. Having successfully harnessed the Psychomech, Garrison discovered the Psychosphere, a strange plane of existence where mental abilities were all. Thought became intent, word became deed, and Garrison became like unto a god. Two decades later, Garrison is utilizing his unique powers to explore the universe. On Earth, his son, Richard Stone, is happily in love, until his beloved falls victim to \"The Gibbering,\" a plague of madness that destroys men and women by destroying their minds. There is no obvious cause. There is no cure. There are no survivors.When Richard Stone himself is infected by the Gibbering, the mental powers he inherited from his father enable him to defeat the madness, at least for a while. Then, to his horror, Stone discovers that the Psychomech has run amok and that the Gibbering is the result! Even though the insanity it creates batters his struggling mind, Stone realizes he is the only man with the knowledge and power capable of destroying the berserker mind-machine.The son of Garrison is at war with Psychomech. Who will survive the finalbattle, man or machine?At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [
    "Horror",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Brian Lumley",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/636754.Psychamok"
}