{
  "title": "A Cultural Dictionary of Punk, 1974-1982",
  "description": "Neither a dry-as-dust reference volume recycling the same dull facts nor a gushy, gossipy puff piece, A Cultural Dictionary of Punk: 1974-1982 is a bold book that examines punk as a movement that is best understood by placing it in its cultural field. It contains myriad critical-listening descriptions of the sounds of the time, but also places those sounds in the context of history. Drawing on hundreds of fanzines, magazines, and newspapers, the book is—in the spirit of punk—an obsessive, exhaustively researched, and sometimes deeply personal portrait of the many ways in which punk was an artistic, cultural, and political expression of defiance.A Cultural Dictionary of Punk is organized around scores of distinct entries, on everything from Lester Bangs to The Slits, from Jimmy Carter to Minimalism, from 'Dot Dash' to Bad Brains. Both highly informative and thrillingly idiosyncratic, the book takes a fresh look at how the malaise of the 1970s offered fertile ground for punk—as well as the new wave, post-punk, and hardcore—to emerge as a rejection of the easy platitudes of the dying counter-culture. The organization is accessible and entertaining: short bursts of meaning, in tune with the beat of punk itself.Rombes upends notions that the story of punk can be told in a chronological, linear fashion. Meant to be read straight through or opened up and experienced at random, A Cultural Dictionary of Punk covers not only many of the well-known, now-legendary punk bands, but the obscure, forgotten ones as well. Along the way, punk's secret codes are unraveled and a critical time in history is framed and exclaimed.Visit the Cultural Dictionaryof Punk blog here.",
  "genres": [
    "Music",
    "Punk",
    "Nonfiction",
    "Reference",
    "History",
    "Criticism"
  ],
  "author": "Nicholas Rombes",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/6365452-a-cultural-dictionary-of-punk-1974-1982"
}