{
  "title": "Leite Derramado",
  "description": "Um homem muito velho está num leito de hospital. Membro de uma tradicional família brasileira, ele desfia, num monólogo dirigido à filha, às enfermeiras e a quem quiser ouvir, a história de sua linhagem desde os ancestrais portugueses, passando por um barão do Império, um senador da Primeira República, até o tataraneto, garotão do Rio de Janeiro atual. A fala desarticulada do ancião cria dúvidas e suspenses que prendem o leitor. O discurso da personagem parece espontâneo, mas o escritor domina com mão firme as associações livres, as falsidades e os não ditos, de modo que o leitor pode ler nas entrelinhas, partilhando a ironia do autor, verdades que a personagem não consegue enfrentar. Tudo, neste texto, é conciso e preciso; como num quebra-cabeça bem concebido, nenhum elemento é supérfluo.Percorre todo o livro a paixão mal vivida e mal compreendida do narrador por uma mulher. Os múltiplos traços de Matilde, seu \"olhar em pingue-pongue\", suas corridas a cavalo ou na praia, suas danças, seus vestidos espalhafatosos, ao mesmo tempo que determinam a paixão do marido e impregnam indelevelmente sua lembrança, ocasionam a infelicidade de ambos. Embora vista de forma indireta e em breves flashes Matilde se torna, também para o leitor, inesquecível.Outras figuras, fixadas a partir de mínimos traços, circulam pela memória do protagonista: o arrogante engenheiro francês Dubosc; a mãe do narrador, que, de tão reprimida e repressora, \"toca\" piano sem emitir nenhum som; a namorada do garotão com seus piercings e gírias. É espantoso como tantas personagens ganham vida neste breve romance. Leite derramado é obra de um escritor em plena posse de seu talento e de sua linguagem.",
  "genres": [
    "Fiction",
    "Brazil",
    "Romance",
    "Portuguese Literature",
    "Literature",
    "Contemporary",
    "Historical"
  ],
  "author": "Chico Buarque",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/6365525-leite-derramado"
}