{
  "title": "VISAGES",
  "description": "\" Shoah \", de Lanzmann, est un film qui s'intègre dans l'histoire du cinéma par un suspens de l'action négatif, et un suspens des Visages singulier. Événement inaugural en ce qu'il fait sauter les cadres qui habituellement au cinéma balisent l'humanité. \" Shoah \" présente les Visages de revenants de l'extermination là où elle a été en son centre, et de témoins. Et présente aussi les paysages actuels où l'extermination a eu lieu. Le film laisse désespérance quant à l'Histoire, ne laisse pas subsister les mythes, les illusions qui paraissaient légitimes. La remémoration qu'il met en acte invalide les constructions de l'histoire fallacieuses, mais elle vise aussi à fonder des pratiques historiennes échappant aux stéréotypes. Et c'est la remémoration, par l'inscription des \" traces mémorielles \", qui autorise l'émergence d'un sujet de l'histoire. C'est par les Visages, d'abord comme événement visible sur l'écran, que \" Shoah \" rencontre la philosophie de façon telle que celle-ci ne peut se dérober. La puissance de pensée de la présentation des Visages dans le film détruit les illusions d'un sens assuré de l'Histoire passant outre les Visages, et même d'une fuite possible vers le Bien au-delà les Visages. \" Shoah \" oblige à penser les Visages avec une exigence absolue. Par les Visages narrant la mort et la souffrance advenues, cette pensée du film pose ses contenus de vérité. L'esthétique du film rencontre encore la pensée de Walter Benjamin. C'est le montage qui crée l'œuvre cinématographique. L'œuvre a sa légalité propre, impose sa nuit et sa lumière singulières. -- Lanzmann's film \"Shoah' has found its way into the history of cinema because of its delayed negative action and those unique faces it suspends in time. In breaking away from the framework generally used by the cinema to evoke human experience, it constitutes an inaugural event. In Shoah, we see the faces of ghosts at the place of their extermination, and the witnesses, and the landscape in which it took place. Holding up despair against History, it tolerates no myths or seemingly legitimate illusions. The rememoration it effects cancels out the construction of fallacious history and establishes a mode of historicization that escapes stereotypes. Through those faces, firstly as visible events on the screen, \"Shoah' encounters and confronts philosophy, leaving no possible escape route. The intensity of their presentation destroys all illusion of a meaning of History beyond those faces. \"Shoah' obliges us to think them with absolute rigour. As they tell of suffering and death, the mind behind the film lays down its inescapable truth.",
  "genres": [],
  "author": "ALTERMAN ALINE",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/6365553-visages"
}