{
  "title": "The Bridge Betrayed: Religion and Genocide in Bosnia (Comparative Studies in Religion and Society)",
  "description": "The recent atrocities in Bosnia-Herzegovina have stunned people throughout the world. With Holocaust memories still painfully vivid, a question haunts how is this savagery possible? Michael A. Sells answers by demonstrating that the Bosnian conflict is not simply a civil war or a feud of age-old adversaries. It is, he says, a systematic campaign of genocide and a Christian holy war spurred by religious mythologies.This passionate yet reasoned book examines how religious stereotyping―in popular and official discourse―has fueled Serbian and Croatian ethnic hatreds. Sells, who is himself Serbian American, traces the cultural logic of genocide to the manipulation by Serb nationalists of the symbolism of Christ's death, in which Muslims are \"Christ-killers\" and Judases who must be mercilessly destroyed. He shows how \"Christoslavic\" religious nationalism became a central part of Croat and Serbian politics, pointing out that intellectuals and clergy were key instruments in assimilating extreme religious and political ideas.Sells also elucidates the ways that Western policy makers have rewarded the perpetrators of the genocide and punished the victims. He concludes with a discussion of how the multireligious nature of Bosnian society has been a bridge between Christendom and Islam, symbolized by the now-destroyed bridge at Mostar. Drawing on historical documents, unpublished United Nations reports, articles from Serbian and Bosnian media, personal contacts in the region, and Internet postings, Sells reveals the central role played by religious mythology in the Bosnian tragedy. In addition, he makes clear how much is at stake for the entire world in the struggle to preserve Bosnia's existence as a multireligious society.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Religion",
    "Islam",
    "Sociology",
    "Christianity"
  ],
  "author": "Michael A. Sells",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/636984.The_Bridge_Betrayed"
}