{
  "title": "Fly: The Unsung Hero of Twentieth Century Science",
  "description": "There's a buzz in the air, the sound of a billion wings vibrating to the tune of scientific success. In biology labs across the world, fruit flies are turning up answers to some of the basic questions of life. It's business as usual for the fly, which for generations has been defining biology's major landmarks. From genetics to development, behavior to aging, and evolution to the origin of species, the fruit fly has been a key player in some of the twentieth century's greatest biological discoveries. Techniques to pinpoint genes that play a role in human disease depend on genetic mapmaking principles first established with the fly. It was experiments on fruit flies that opened our eyes to the dangers of radiation to human health. In fact, everything from gene therapy to cloning to the Human Genome Project is built on the foundation of fruit fly research. Despite its many achievements, the fruit fly remains an unsung hero in the history of science. At last, here is a book that gives the fly its long overdue credit. In a highly original, witty, and irreverent style, Martin Brookes takes us through successive stages in the life cycle of the fly, each illustrating an important concept in biology. Some, such as the fundamentals of heredity, are well established; others, such as sexual warfare, learning, and memory, are still in their infancy. But whether flies are getting high on crack cocaine, enjoying the pleasures and pains of a boozy night out, being trained by punishment and reward, or struggling with insomnia, this book provides a glimpse of how one short life has informed almost every aspect of human existence. The result is a broad introduction to biology with insights into the practical realities of science. Often dismissed as irrelevant outside academic circles, the fruit fly, through this distinctive biography, will come to be recognized for what it really an icon of twentieth-century science and a window on our own biological world.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology"
  ],
  "author": "Martin Brookes",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/636982.Fly"
}