{
  "title": "Revenge at the Galliano Club: A Prohibition historical fiction thriller",
  "description": "Revenge is a dish best served cold, but the heat is on at the Galliano Club.Lido, New York. 1926.Widow of a hitman who worked for Al Capone, Hanna Gorski leaves Chicago to hunt for her sister’s killer. The trail leads to Lido and a letter written by Luca Lombardo, bartender at the Galliano Club.To Hanna’s surprise, Luca is in jail on trumped up charges of attempted murder and kidnapping. His opponent has money, status, and connections. Everything that a poor immigrant like Luca doesn’t.The secrets of his past could come out at the trial.Who else besides Luca will lose everything if those secrets are revealed?Meanwhile, bootlegger Benny Rotolo is still determined to seize the Galliano Club and turn the neighborhood hangout into a swank speakeasy that makes Capone green with envy. Benny will do whatever it takes to make sure Luca stays in jail and out of the way.But Benny didn’t bargain on Hanna Gorski.Neither did anyone else.The Godfather meets Cheers in the Galliano Club historical fiction thriller series! Italian immigrants, Chicago mobsters, and the Roaring Twenties come alive, both gritty and exciting. In the saga, Luca Lombardo escapes the olive groves of Italy for a new life in upstate New York, even as Chicago thug Benny Rotolo rises through the ranks of the North Side gang and makes an enemy of Al Capone.REVENGE AT THE GALLIANO CLUB is the final clash as Benny and Luca face off for control of the Galliano Club and Hanna gambles it all to find a killer.Grab a seat at the bar. You won’t believe what happens.\"With the élan of E. L. Doctorow, Carmen Amato seamlessly merges historical characters with fictional creations. Al Capone, and Dean O’Banion’s North Side gang all come alive.” - Michael Hogan, author of Women of the Irish Rising“Splicing this all together is Amato's knowing eye for detail and intuitive feel for the temper of the times, the class divisions and the clannishness of immigrant communities struggling to make it in America . . . It's a world worth exploring and a tale worth telling.” – Jim Nesbitt, author of The Dead Certain DoubtTHE GALLIANO CLUB THRILLERSROAD TO THE GALLIANA PREQUELMURDER AT THE GALLIANO CLUBBLACKMAIL AT THE GALLIANO CLUBREVENGE AT THE GALLIANO CLUB",
  "genres": [],
  "author": "Carmen Amato",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/63713907-revenge-at-the-galliano-club"
}