{
  "title": "The Forgotten Child",
  "description": "How do you tell a man there is something wrong with his child?Brad Friessen wasn't looking to love again. But what he got was a woman who shook his lonely bitter world upside down, and touched him in a way no other woman could. Emily Nelson, a courageous young mother, ends a loveless, bitter marriage and strikes out on her own. She answers an ad as a cook and live-in caregiver to a three-year-old boy on a local ranch. Ranch owner Brad Friessen hires and moves in Emily and her daughter. But Emily soon discovers something's seriously wrong with the boy, and the reclusive, difficult man who hired her can't see the behavior and how delayed his son is. So Emily researches until she stumbles across what she suspects are the soft signs of autism. Now she must tell him, give him hope, and help him come to terms with this neurological disorder-to take the necessary steps to get his child the help he needs. As their lives become intertwined, their attraction is unavoidable-a connection sparks between them. But just as they're getting close, Brad's estranged wife, Crystal, returns after abandoning the family two years earlier. Among the shock and confusion is one disturbing question Brad can't shake: How does Crystal know so much of his personal business, the inner working of the ranch, and Emily's relationship with his son? Crystal must've had a plan, as she somehow gains the upper hand, driving a wedge in the emotional bond forged between Brad, Emily, and the children. The primary focus for care and therapy of three-year-old Trevor is diverted. The lengths to which Crystal will go, the lies, the greed, just to keep what's hers, are nothing short of cold and calculating. Emily's forced out of the house. Brad fights to save his boy, to protect what's his, and struggles over his greatest sacrifice-Emily, and the haunting question: Has he lost her forever?THE OUTSIDER SERIES:  The Forgotten Child (Brad & Emily) A Baby And A Wedding (An Outsider Series Short) Fallen Hero (Andy, Jed & Diana) The Search (An Outsider Series Short) The Awakening (Andy & Laura) Secrets (Jed & Diana) Runaway(Andy & Laura) Overdue (An Outsider Series Short) The Unexpected Storm (Neil & Candy) The Wedding (Neil & Candy) \nOr grab The Outsider Series: The Complete Omnibus Collection which includes all the books and short stories in this in this romantic saga.\n THE FRIESSENS: A NEW BEGINNING:  The Deadline (Andy & Laura) The Price to Love (Neil & Candy) A Different Kind of Love (Brad & Emily) A Vow of Love, A Friessen Christmas",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Westerns",
    "Chick Lit",
    "Drama"
  ],
  "author": "Lorhainne Eckhart",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/12946320-the-forgotten-child"
}