{
  "title": "An Irreverent Curiosity: In Search of the Church's Strangest Relic in Italy's Oddest Town",
  "description": "A tour through the centuries and through a bizarre Italian town in search of an unbelievable relic: the foreskin of Jesus Christ. In December 1983, a priest in the Italian hill town of Calcata shared shocking news with his congregation: The pride of their town, the foreskin of Jesus, had been stolen. Some postulated that it had been stolen by Satanists. Some said the priest himself was to blame. Some even pointed their fingers at the Vatican. In 2006, travel writer David Farley moved to Calcata, determined to find the missing foreskin, or at least find out the truth behind its disappearance. Farley recounts how the relic passed from Charlemagne to the papacy to a marauding sixteenth-century German solider before finally ending up in Calcata, where miracles occurred that made the sleepy town a major pilgrimage destination. Over the centuries, as Catholic theology evolved, the relic came to be viewed as something of an embarrassment, culminating in a 1900 Church decree that allowed the parish to display it only on New Year’s Day. An Irreverent Curiosity interweaves this history with the curious landscape of Calcata, a beautiful and untouched medieval village set atop four-hundred-fifty-foot cliffs, which now, due to the inscrutable machinations of Italian bureaucracy, is a veritable counterculture coven. Blending history, travel, and perhaps the oddest story in Christian lore, An Irreverent Curiosity is a weird and wonderful tale of conspiracy and misadventure.Winner of the 2010 Lowell Thomas Tavel Journalism Award for best book. Listed: \"One of the Best Travel Books of 2009\"--The Los Angeles Times--WorldHum.com\"One of the Best Books of the Decade\"--The Dubuque Telegraph Herald\"[Farley's] ribald detective story ... is like a cross between 'The Da Vinci Code' and 'Life of Brian' ... [a] charming yarn.\"--The New York Times\"Told with gusto, good humor, and a healthy respect for eccentricity, Farley's quixotic account is an eloquent testament to the power of travel--and travail--to entertain and illuminate.\"--National Geographic Traveler \"Genre bending at its best.\" --Kirkus Reviews (Starred review)",
  "genres": [
    "Nonfiction",
    "History",
    "Travel",
    "Italy",
    "Religion",
    "Humor",
    "Christianity"
  ],
  "author": "David Farley",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/6369613-an-irreverent-curiosity"
}