{
  "title": "موت سرير رقم 12",
  "description": "\"موت سرير رقم 12\" هي المجموعة القصصية الأولى التي أصدرها غسان كنفاني. وقد صدرت في بيروت عام 1961 بمقدمة قصيرة كتبها المؤلف يقول فيها: \"أنا أؤمن أن الكتاب يجب أن يقدم نفسه، وإذا عجز عن إحراز جزء من طموح كاتبه، فعلى الكاتب أن يقبل ذلك ببساطة، كما قبل -مرات ومرات- أن يمزق قصصاً ليعيد كتابتها. وهكذا \"فموت سرير رقم 12\" أدفعها لتشق طريقها، إن استطاعت أن تهتدي إلى أول الطريق، بنفسها، دون شفاعة ودون وساطة ودون جواز مرور\". ولأنها المجموعة الأولى، فإن \"موت سرير رقم 12\" تحمل الاتجاهات الرئيسية التي كانت تجربة كنفاني الإبداعية تحاول اكتشافها وبلورتها. نستطيع أن نميز ثلاثة خطوط رئيسية في المجموعة: الخط الأول: هو الخط الفلسطيني، إذا صح التعبير، حيث تبرز القصة القصيرة بوصفها استجماعاً للخطة التاريخية واستنطاقاً للذاكرة في سبيل صياغة رؤية فلسطينية جديدة تنطلق من الواقع المعاش ومن احتمالاته المتعددة. وفي هذه القصص يبرز النبض الحار لنثر كنفاني وقدرته على تكثيف اللحظات النثرية في رؤية تمزج بين مرارة الواقع وإمكانيات تغييره. الخط الثاني: خط المعاينة الواقعية، حيث يقدم كنفاني مجموعة من القصص الواقعية التي تصف حياة الناس في الخليج (حيث كان يقيم)، وسوف تكون هذه المحاولات الواقعية البذرة التي ستنمو وتتطور في كتابات كنفاني اللاحقة. الخط الثالث: هو خط طرح الأسئلة على الوجود، من سؤال محمد علي أكبر حول الموت، إلى سؤال قصة \"الأرجوحة\" حول الحب والعلاقات الإنسانية. هذه الخطوط ليست متوازية، بل إنها تتقاطع في أكثر من قصة ليشكل تقاطعها النبرة الخاصة التي استطاع كنفاني أن يؤسسها في القصة العربية القصيرة. فمن خلال تقاطع الخطين الأول والثاني، سوف تبرز رواية \"رجال في الشمس\" لتقدم من خلال واقع الفلسطينيين المهاجرين إلى الخليج صورة رمزية للواقع الفلسطيني والعربي بأسره. كما سيتطور هذا الخط في رواية \"أم سعد\" ليقدم لوحة نضالية عن تجربة المخيم الفلسطيني وسط القتال. وسيسمح الاتجاه الثالث لكنفاني أن يكتب روايته \"الأعمى والأطرش\" التي استشهد قبل إكمالها، ولكنها تعبر عن الكيفية الجديدة التي تطرح فيها أسئلة الوجود داخل التجربة الفلسطينية.لتحميل الرواية من هذا الرابط :https://goo.gl/QaY553",
  "genres": [
    "Short Stories",
    "Fiction",
    "Novels",
    "Literature",
    "Historical Fiction",
    "Classics",
    "Novella"
  ],
  "author": "Ghassan Kanafani",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/6375489-12"
}