{
  "title": "Female Prey",
  "description": "BEST-SELLING Ready for a wild adventure, the blonde-haired, blue-eyed beauty, Kimberley, hikes into the forest alone, knowing that somewhere nearby are anonymous men who will hunt her down like an animal, take her captive, and keep her as their sex toy for days on end. She is eager for the experience - in fact, she set up the game with a clandestine company that specializes in unique wilderness adventures like this one. But, just to make the experience more fun, she decides to make the hunters work before she lets them have her. Her scheme takes the men by surprise, and the days that follow are grueling for Kimberley and the posse that tails her. Maybe it's not so much fun after all, she begins to think... maybe she should call off the hunt, and go back to the resort hotel where she started - spend her week enjoying the luxury of room service…hot baths and sensuous pampering... Unfortunately, it's too late to change her plans and she's on the run…forced into a game of escape and evade. While Kimberley knows the outdoors and can survive on her own, her pursuers know it better. Tired and hungry, she is finally captured, and her days of naked slavery begin. She's kept in a cell below ground...unable to tell when one day ends and another begins. She knows there is a limit to her captivity, but she has no idea when it will end. As the days go by, Kimberley learns about her captors, especially the big, strong leader of the gang she calls 'Alpha'. He's rough with his newly captured slave, and as the days goes by, Alpha's power over her increases...the things they make her do alarm her. But soon she's doing more than enduring the forced nudity, bondage and torrid sexual gangbangs. Perhaps, she doesn't want her adventure in the wilds to end?",
  "genres": [
    "BDSM",
    "Erotica",
    "Menage",
    "M F M",
    "Action",
    "Multiple Partners",
    "Dark"
  ],
  "author": "S.J. Lewis",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/6372559-female-prey"
}