{
  "title": "Bowie: A Biography",
  "description": "Finally an expansive biography of one of the twentieth century’s greatest music and cultural iconsFrom noted author and rock ’n’ roll journalist Marc Spitz comes a major David Bowie biography to rival any other. Following Bowie’s life from his start as David Jones, an R & B—loving kid from Bromley, England, to his rise to rock ’n’ roll aristocracy as David Bowie, Bowie recounts his career but also reveals how much his music has influenced other musicians and forever changed the landscape of the modern era. Along the way, Spitz reflects on how growing up with Bowie as his soundtrack and how writing this definitive book on Bowie influenced him in ways he never expected, adding a personal dimension that Bowie fans and those passionate about art and culture will connect with and that no other bio on the artist offers.Bowie takes an in-depth look at the culture of postwar England in which Bowie grew up, the mod and hippie scenes of swinging London in the sixties, the sex and drug-fueled glitter scene of the early seventies when Bowie’s alter-ego Ziggy Stardust was born, his rise to global stardom in the eighties and his subsequent status as an elder statesman of alternative culture. Spitz puts each incarnation of Bowie into the context of its era, creating a cultural time line that is intriguing both for its historical significance as well as for its delineation of this rock ’n’ roll legend, the first musician to evolve a coherent vision after the death of the sixties dream.Amid the sex, drugs and rock ’n’ roll mayhem, a deeper portrait of the artist emerges. Bowie’s early struggles to go from follower to leader, his tricky relationship with art and commerce and Buddhism and the occult, his complicated family life, his open romantic relationship and, finally, his perceived disavowal of all that made him a touchstone for outcasts are all thoughtfully explored. A fresh evaluation of his recorded work, as well as his film, stage and video performances, is included as well.Based on a hundred original interviews with those who knew him best and those familiar with his work, including ex-wife Angie Bowie, former Bowie manager Kenneth Pitt, Siouxsie Sioux, Camille Paglia, Dick Cavett, Todd Haynes, Ricky Gervais and Peter Frampton, Bowie gives us not only a portrait of one of the most important artists in the last century, but also an honest examination of a truly revolutionary artist and the unique impact he’s had across generations.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "History",
    "Memoir",
    "Art"
  ],
  "author": "Marc Spitz",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6376464-bowie"
}