{
  "title": "I, Sniper",
  "description": "Four famed '60s radicals are gunned down at long range by a sniper. Under enormous media scrutiny, the FBI quickly concludes that Marine war hero Carl Hitchcock, whose ninety-three kills were considered the leading body count tally among American marksman in Vietnam, was the shooter. But as the Bureau, led by Special Agent Nick Memphis, bears down, Hitchcock commits suicide. In closing out the investigation, Nick discovers a case made in heaven: everything fits, from timeline, ballistics, and forensics to motive, means, and opportunity. Maybe it's a little too perfect. Nick asks his friend, the retired Marine sniper Bob Lee Swagger, to examine the data. Using a skill set no other man on earth possesses, Swagger soon discovers unseen anomalies and gradually begins to unravel a sophisticated conspiracy -- one that would require the highest level of warcraft by the most superb special operations professionals. As Swagger penetrates the deepest secrets of the sniper world and its new technology, Nick stands firm in the face of hardball PR initiatives and an inflamed media calling for his ouster.Swagger soon closes in, and those responsible will stop at nothing to take him out. But these heavily armed men make the mistake of thinking they are hunting Bob, when he is, in fact, hunting them.\"I, Sniper\" will satisfy Stephen Hunter's legions of fans and win him droves of new ones with its signature blend of brilliant plotting, vivid characters, razor-sharp dialogue, and extraordinary gunfights. And when Swagger and the last of his antagonists finally face each other, reenacting a classic ritual of arms, it is clear that at times there's nothing more necessary than a good man with a gun and the guts to use it.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Action",
    "Military Fiction",
    "Crime",
    "Suspense"
  ],
  "author": "Stephen Hunter",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/6379549-i-sniper"
}