{
  "title": "اللوح الأزرق",
  "description": "نبذة النيل والفرات:\"لم تصدّق مانويلا عينيها. كمشت أصابعها على رسالة المفتش العامّ وحولتها إلى كرة ضغطت عليها بقبضتها. هكذا إذن وعلى العكس من توقعاتها يأمرونها بمواصلة المهمة. لم تقنعهم المعلومات التي مدّتهم بها بضرورة التوقف عن مطاردة الرجال بل يبدو أن هذه المعلومات أدّت إلى نتائج عكسية. وها هي الرسالة تؤكد لها أن توركيمادا إزداد إصراراً على الذهاب في الاتجاه نفسه. دونا فيغيرو. انتفضت وهي تتذكر الرجل ذا وجه العقاب الذي نسيته تماماً أثناء استغراقها في قراءة الرسالة. دونما فيغيرو. لن يكون من الحيطة أن نمكث هنا وقتاً أطول وقد يلاحظ رفاقك غيابك عنهم. هل عليّ أن أبلغ قراري توركيمادا بشيء؟ ظلت صامتة وقد ازدحم رأسها بأفكار متناقضة، استرجعت مشهداً بعينه يوم جاءها توركيمادا وعرض عليها تفاصيل المهمة التي ستناط بعدتها، صدر عنها سؤال عفوي: أفهم مخاوفك فراي توركيمادا ولكن هل أنت واثق في صميم قلبك من أن ديانة كلّ من هذين الرجلين المسلم واليهودي هي دافعك الحقيقي؟ لم تكن تعرف لحظتها أن راهباً مسيحياً سيرافقها. هبط عليها ردّ المفتش العام دون لفّ ولا دوران. وهب أن ذلك صحيحاً دونا فيغيرو، أين الخطأ؟ تجرأت على الذهاب إلى أبعد. الخطأ في إزهاق أرواح بريئة لمجرد أنها تختلف عنا في الدين. ألا ترى أن ذلك مناقض لتعاليم الرب؟ زوى توركيمادا ما بين حاجبيه وأحدّ فيها النظر حتى لكأنه يخترقها هل يعني هذا أنك تتعاطفين مع الهراطقة والغزاة؟ صدمها السؤال فأجابت رافعة رأسها في تحدّ: لا تذهب بعيداً فراي توماس. أنا إسبانية وفخورة بذلك، وأنا أعشق بلادي ولا حلم لي إلا أن أراها تستعيد في أقرب وقت حريتها ووحدتها. ولكن الفرق كبير بين خوض معركة لطرد جيش غازٍ والبحث عن التخلص من شخص بدمٍّ بارد دون حساب أو عقاب لمجرد أنه يؤمن بدين غير دينك. هذا ليس حرباً يا فراي توركيمادا. هذا يسمى استبداداً وجريمة ولتطئمن، لا أتعاطف لا مع اليهود ولا مع المسلمين ولكني نشأت وفي قلبي رسالة حبّ، هذا كل ما في الأمر\". مسرح أحداث هذه الرواية إسبانيا وزمانها زمن سقوطها وهزيمة المسلمين وخروجهم منها. يحاول الروائي ومن خلال قراءة في تاريخ هذه الفترة استرجاعها بحسّ ومخيلة روائيين. يستعرض الكاتب الأحداث من محاكم التفتيش إلى المجازر والمحارق التي أبيد فيها العرب والمسلمون وحتى اليهود، إلى المكائد التي استطاع من خلال كل ملك وملكة إسبانيا إشعال الحرب والمضي فيها إلى حين بلوغ لحظة الانتصار التي وصلوا إليها بالخديعة.نبذة الناشر:توقف أمام مكتبة ومر براحة يده على مساحته الصقيلة. هل يمكن لهذه الطاولة أن تتصور النجار الذي أنشأها؟ أليس كبرياؤنا في تناهيه حد الغرور هو الذي يوهمنا بالقدرة على حل ما لا يحل؟ \"أنا هو أنا\"، ما انفكت هذه العبارة تعود على امتداد القصور التي حاول تفكيكها الرجال الثلاثة. ألا تكون تعبيراً عن الإرادة الحقيقية للرب؟ لا تمنحوني اسماً معيناً بل اقبلوني كما أنا. أي مجهولاً وأجل من كل وصف. طرد عنه هذه الهواجس وعاد إلى الحوار.",
  "genres": [
    "Novels",
    "Fiction",
    "Historical Fiction",
    "Historical",
    "Literature",
    "French Literature",
    "Mystery"
  ],
  "author": "Gilbert Sinoué",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/6379002"
}