{
  "title": "An American Gospel: On Family, History, and the Kingdom of God",
  "description": "From the award-winning author of Lost Mountain, a stirring, inspiring work of memoir, spiritual journey, and historical inquiry—a dazzling chronicle of a personal and national identity reclaimed. Erik Reece’s grandfather was a Bible-thumping, fire-and-brimstone Baptist preacher. He loved to hunt and fish and explore the Kentucky woods, but for him, existence on this earth was about denying the pleasures of this life in preparation for the next. Erik’s father was a Baptist minister, too. But at the age of thirty-three—not coincidentally, Jesus’ age when he was crucified— Erik’s father violently took his own life, and Erik ended up spending much of his childhood in the care of his grandparents. So, while Erik grew up with a conflicted relationship with Christianity, he also grew up with an acute awareness of a part of the country suffering ongoing economic, environmental, and even spiritual collapse. When he himself neared age thirty-three, he found unexpected comfort and guidance in his intellectual hero Thomas Jefferson’s famous Jefferson Bible, especially when he began to track similarities between it and the Zen-like message of the Gospel of Thomas. Inspired, he undertook what would become a spiritual and literary quest—to identify an “American gospel” coursing through the work of both great and forgotten American geniuses, from William Byrd to Walt Whitman to William James to Lynn Margulis. In synthesizing that gospel—one that prizes the pleasures and glories of this earth—Reece began to find a way to a spiritual and intellectual peace with his own American soul. The result of Reece’s journey is a deeply personal but also deeply thought out, inspiring, and stirring book, delivered almost like a secular sermon, about personal, political, and historical demons—and the geniuses we can and must call on to combat them.",
  "genres": [
    "Theology",
    "Biography Memoir",
    "Nonfiction"
  ],
  "author": "Erik Reece",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/6378825-an-american-gospel"
}