{
  "title": "Parallax",
  "description": "Only 99 Cents for a Limited Time! Previous problems with formatting and content now fixed!What happens when two professional assassins - one a Mafia hitman and the other a former German terrorist - kill at exactly the same moment in time? For Ernst Stahl and Frank Jolino the result is a psychic bond that slowly blossoms in each man's mind, enabling them to see into the other's world. Frank Jolino doesn't like what he sees, especially when he realizes that Stahl is headed to his home turf of Boston to kill a scientist who may hold the key to solving the world's deadliest diseases. But for Stahl, there's no other option. Virtually bankrupt and with his son in desperate need of a bone marrow transplant, he's got little choice but to take the assignment. Jolino has other ideas. On the run from his crime syndicate for refusing to kill his ex-girlfriend-turned-government-informant, Jolino sets a plan in motion that will bring the two men face-to-face and gun-to-gun...with no guarantees either will survive.This novel + excerpt runs approximately 90,000 words. Praise for Jon F. \"Lawson is more like Jason Bourne than Dracula, making this a vampire mystery with broad appeal.\" --Booklist\"A powerful novel by a man who knows the turf already.\" -NYT Bestselling author Robert. B. Parker\"Jon F. Merz's novels move at a break-neck pace, twisting through a landscape of thrills and terror.\" -- Douglas Clegg, author of The Infinite and The Priest of Blood\"...a fine stalking session in vampire-noir land...a series and talented writer I'll be sticking with all the way.\" -- Mort Castle, author of The Strangers and On Writing HorrorPraise for Jon F. Merz's THE KENSEI (A Lawson vampire Novel #5):\"If James Bond, True Blood and Kill Bill created a mutant hybrid of a book, it would be The Kensei. A bullet train slice 'em, dice 'em mixture of action, suspense, and vampire ninjas. Did I mention vampire ninjas?\"--Jason Pinter, bestselling author of The Fury and The Darkness\"The Kensei is an action novel with real bite. Vampires, Yakuza killers, crooks and animal-monster hyrbids. Jon F. Merz brings his A-game and then ratchets it up to a whole new level of supernatural action. Highly recommended!\" --Jonathan Maberry, New York Times bestselling author of The Dragon Factory and Patient Zero\"In The Kensei, Jon F. Merz seamlessly welds gritty detail with myth and legend to create a thrill ride into the shadow-world lurking beneath modern Japan. Lawson's fight against evil has bone-crunching authenticity. Plus, it has vampires, ninjas, and vampire ninjas. What more could anyone ask?\"--Christopher Farnsworth, author or Blood OathAbout The F. Merz is a writer with over a dozen published novels, a producer for New Ronin Entertainment and a trained black belt ninja. He has taught defensive tactics to civilian crime watch groups, police, military units, and agencies like the US Department of State, the Department of Justice, and the Bureau of Prisons. In his past, Jon served with the United States Air Force, worked for the US government, and handled executive protection for Fortune 500 clients. He lives with his wife and two sons in suburban Boston.",
  "genres": [
    "Science Fiction",
    "Thriller",
    "Suspense"
  ],
  "author": "Jon F. Merz",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/6382414-parallax"
}