{
  "title": "The Journal of Mortifying Moments",
  "description": "Kerry Spence is unfulfilled by her soulless career in advertising, disappointed by her dysfunctional relationship, and horrified by the ever-increasing size of her ass. Ever since her gorgeous, self-absorbed boyfriend Sam demoted her to late night hook-up status, she has fortified herself with prime-time TV and blissful binges on cream cheese frosting, awaiting an epiphany that will reveal her next move.Of course, everybody in her life is full of advice. Her free-spirited divorcee mother–when not necking furiously with her much younger boyfriend– sagely counsels her daughter to do whatever it takes to snag Sam back, since, quite frankly, he is the best she can do. Her friends ply her with fruity cocktails and dispense bits of ‘Cosmo’ wisdom like “Divide your age in half and add seven–that’s the youngest man you are allowed to date” and “Scotch tape can eliminate forehead wrinkles.” And then there is Kerry’s shrink, the calm, unflappable therapist who suggests she start “a diary of past encounters with men that may be contributing to her negative and dysfunctional quasi-relationship.” Or, as Kerry sees it, a journal of mortifying moments.Beginning with a kissing game gone bad in grade school, the journal jump-starts Kerry’s stroll down memory lane of man troubles. But just as Kerry decides her poorly dressed therapist is as crazy as everybody else in her orbit, she begins to realize the journal may actually make some sense–as she plumbs the depths of her most embarrassing experiences on a quest for personal awareness that will give her the strength to turn her life around–and just maybe find love again.The Journal of Mortifying Moments is a hysterically funny glimpse into the quirky, slightly obsessive, and completely lovable mind of Kerry Spence. But somewhere amidst the laugh-out-loud hilarity of Kerry’s exploits emerges the story of a woman who learns to stop trying to be someone she’s not, and start loving the wonderful, quirky person she is, once and for all.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Romance",
    "Contemporary",
    "Humor",
    "Womens Fiction",
    "Diary"
  ],
  "author": "Robyn Harding",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/638326.The_Journal_of_Mortifying_Moments"
}