{
  "title": "Demon's Sacrifice",
  "description": "From the Number One Best Selling Author Saxon Andrew comes the sixth Book in the Best Selling Annihilation Series, “Demon’s Sacrifice. ”The universal doorway into the Stars Realm has been destroyed delaying future invasions by the Eight Legs. They are still very much a danger and it is just a matter of time until their scientists find a way to return to the Realm. The Stars Realm and its new friends must find a means of stopping this enemy from future attacks and their continued destruction of intelligent life in other universes.  But now Destiny’s child has uncovered another creature that makes the Eight Legs appear tame in comparison. Even the Eight Legs will die if this being turns its focus toward them. Nothing the Stars Realm has faced will measure up to the ancient evil of this new threat and it is coming to the Realm. But first, it will deal with the Eight Legs.  Excerpt from Demon’s Sacrifice  The Supreme Male could hear millions of his warriors dying and could not grasp what was taking place. His interior sensors had been destroyed when the invader’s main beam had blown through his ship. The Sensor Leader keyed every scanner on his console but was unable to determine what was happening and time to develop a strategy to combat these white creatures was quickly running out.  The Plotter entered the bridge of the mother ship and counted ten Eight Legs. The huge white creature smiled as it killed every Eight Leg as it advanced quickly into the center of the room. It saved the Supreme Male for last. As The Supreme Male backed away from the relentlessly approaching creature, he heard, “Your species is weak. Is this the best you can do?” The white creature back handed the Supreme Male lifting him from the deck and slamming him into the bulkhead where he fell. He quickly jumped back up and heard, “No wonder you’re being replaced.”  The Supreme Male bared his fangs and rushed the white creature, which contemptuously slashed him in half with it's talons and burned the remains with a white hand gun. The Plotter looked around the bridge and turned abruptly to go back to his ship. He killed fifty Eight Legs on his way out and wondered how the rest of his Clan was faring.  Demon’s Sacrifice is a full length novel at 60,000 words by Saxon Andrew Publishing.   Visit us on face book at Annihilation Trilogy",
  "genres": [
    "Science Fiction",
    "Military Fiction"
  ],
  "author": "Saxon Andrew",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/12949211-demon-s-sacrifice"
}