{
  "title": "The Anti-Social Network",
  "description": "Set against the fast-paced, winner-take-all world of Silicon Valley, where today’s software geek is tomorrow’s billionaire, The Start-Up chronicles the meteoric rise of Adam and Amelia Dory, a talented brother and sister team. With only each other to rely on, the naïve eighteen-year-olds must make their way through a treacherous world of money, power, and envy.This suspenseful and exciting episode is the second installment in an ongoing serial story. Critical Acclaim for The Start-Up Series“Who knew Silicon Valley could be sexy? Sadie Hayes’ debut ebook series The Start-Up describes the real side of Silicon Valley and how its power corrupts. You will tear through this page-turner and will be begging for more!” –Amy Gleason“In The Start-Up we see the beginning of Adam and Amelia Dory’s climb to wealth and power… This fast-paced novel has provocative characters trying to figure out how to navigate a world controlled by money and bad intentions. I dare you to put it down!” –Becky Julian“Sadie Hayes is on her way to becoming a new kind of bestseller - an eBook bestseller.” –Grady Harp“Exciting, entertaining, and informative - The Start-Up is a must read for anyone interested in the fast paced worlds of entrepreneurship, Silicon Valley, and venture capital.” -J.R. Sedivy, Chairman and CEO, Analytika, Inc.“A well-crafted, fast-moving tale of the conflict which arises when honesty and integrity confront the wealth and oft-corrupted power of the high-tech world of Silicon Valley. An excellent read.” Frederick J. Masterman“Sadie Hayes provides a screen shot of technology’s sordid underbelly in this riveting e-book novella.” –Bill Bentrim“Sadie Hayes has blown me away with this series. This is something new in the YA genre…get to your nearest Ereader device and buy these books.” – Courtney Wyant, Courtney’s Book Nook“Deep-seated greed and corruption intricately blended with naivety and intelligence, The Start Up by Sadie Hayes, is sharp, fun and full of angsty dramatic brilliance. Gossip, intrigue and illegal corporate tactics sing from Silicon Valley, telling us of the money to be made and the people who will destroy anyone in their way to get that money.” –Jen, In the Closet with a Bibliophile“I loved these novellas! The Start-Up and The Anti-Social Network are, in my opinion, on the forefront of what is sure to be a great YA genre in the future because the topic of advancing technology is extremely relevant.” –Sandra, Panda ReadsEpisode 2: The Anti-Social NetworkThe Dory twins grew up with nothing. Now on the verge of having everything, their fledgling company—built on Amelia’s intellect and Adam’s ambition—threatens to be torn apart by new, powerful enemies and old, malicious ones. Episode 3: Beautiful CodeAvailable Now!As their industry profiles rise, Adam and Amelia Dory fly to Hawaii to keynote TechCrunch’s Maui Waves of Disruption conference. Patty Hawkins also finds herself in Hawaii as the maid of honor in her sister Shandi’s wedding to Chad… but Chad and Patty can’t seem to get past the secret night they spent together. Both Patty and the twins quickly discover that the energy, lust and enemies of Silicon Valley follow you—no matter how far you go.",
  "genres": [],
  "author": "Sadie Hayes",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/12949244-the-anti-social-network"
}