{
  "title": "The Devil's Triangle: Mark Judge vs the New American Stasi",
  "description": "A harrowing account of one man’s ordeal during the contentious Brett Kavanaugh hearings at the hands of the New American Stasi ⎯ a sinister cabal of partisan journalists, Democratic politicians, and shadowy oppo researchers the author calls “The Devil’s Triangle.”“Do you remember the woman in To Kill a Mockingbird who falsely accuses a black man of raping her? What could possess anyone to do such an evil thing—to viciously attempt to destroy a life by knowingly lying? For that answer look no farther than the riveting and gloriously candid The Devil’s Triangle by Mark Judge, who himself was targeted for destruction by that same evil, and who lived to tell the tale, if only so that we might all recognize the dark forces at work in our nation. In a voice evoking J.D. Salinger, Hunter S. Thompson, and yes, Lester Bangs—within a narrative that brings to mind All the President’s Men and Fast Times at Ridgemont High —Judge tells us the truth, in all of its brutality and beauty. May this book open the way for a spate of similar memoirs, whose honesty will lead this once-great nation out of the fetid triangular swamp of lies that is this brave book’s eponymous Devil’s Triangle—and toward a new sunlit frontier, in which genuine liberty and unvarnished truth once more become our beacons and our hope.”—Eric Metaxas, #1 New York Times Bestselling author of Fish Out of A Search for the Meaning of Life and Host of Socrates in the CityIn 2018, in the midst of a contentious Supreme Court confirmation battle, Christine Blasey Ford named Mark Judge as a witness to her alleged attempted rape over thirty years earlier at the hands of a teenaged Brett Kavanaugh.Overnight, the unassuming writer, critic, videographer, and recovering alcoholic was unwillingly thrust into the national media spotlight. Reporters combed through Judge’s writings, pored over his high school yearbook, hounded him with emails and phone calls, and invaded the privacy of his relatives, friends, and former girlfriends. He was mauled in the press, denounced in the Senate, received threatening late-night calls, became the target of a classic honey trap, and was even called out by Matt Damon on Saturday Night Live.As the lunacy reached its crescendo, Judge began to fear for his sanity⎯and even his life.A year later, still traumatized by this Kafkaesque experience, Judge found himself washing dishes in a Maryland restaurant, trying to piece his shattered life back together.Even at the time, it was clear that Judge himself was not the target of this campaign of vilification. Instead, it was an attempt to use his spotty record as a teenage alcoholic, and later, a political and cultural conservative, to destroy Brett Kavanaugh by proxy. The actors in this malicious and cynical plot were an informal cabal of partisan reporters, Democrats in Congress, and shadowy opposition a “Devil’s Triangle” whom Judge aptly compares to the Stasi, the dreaded East German secret police who terrorized citizens during the Cold War.Now, in a frank, confessional, and deeply moving book that stands comparison to Arthur Koestler’s Cold War classic Darkness at Noon, Judge rips the mask from the new American Stasi. Using pop culture, politics, the story of his friendship with Kavanaugh, and the fun, wild, and misunderstood 1980s, Judge celebrates sex, art, and freedom while issuing a timely warning to the rest of us about our own endangered freedoms.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Mark Judge",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/63854375-the-devil-s-triangle"
}