{
  "title": "As Máscaras do Destino",
  "description": "Colecção 120 Anos JN - Grandes Autores PortuguesesUma série de contos escritos por Florbela Espanca, totalmente dedicados à memória do irmão da poetisa, Apeles Espanca, que faleceu tragicamente num acidente de aviação a 6 de Junho de 1927. A obra reúne os contos: “O Aviador”, “A Morta”; “Os Mortos não Voltam”; “O Resto é Perfume”; “A Paixão de Manuel Garcia”; “O Inventor”; “As Orações de Soror Maria da Pureza”; “O Sobrenatural”.Este livro é o livro de um Morto, este livro é o livro do meu Morto. Tudo quanto nele vibra de subtil e profundo, tudo quanto nele é alado, tudo que nas suas páginas é luminosa e exaltante emoção, todo o sonho que lá lhe pus, toda a espiritualidade de que o enchi, a beleza dolorosa que, pobrezinho e humilde, o eleva acima de tudo, as almas que criei e que dentro dele são gritos e soluços e amor, tudo é d’Ele, tudo é do meu Morto!Obra publicada em 1931, um ano após a morte da poetisa, mas foi escrita em 1927, logo após a morte do irmão de Florbela.Muito se tem discutido sobre a natureza da relação de Florbela como o seu irmão Apele, havendo muitas especulações se a poetisa sentia pelo irmão algum amor platónico em segredo; se esse era um sentimento reciproco e mantinham ambos uma relação incestuosa; ou se tudo era fruto de uma forte ligação de amizade fraternal. Especulações à parte, o que se sabe é que Florbela via no irmão, segundo palavras suas, a sua “verdadeira alma gémea”; alguém lhe estava intelectualmente mais próximo e que, simultaneamente, representava o elo com a infância e o ponto de apoio firme da poetisa. Quando ela oscilava entre um sentimento de desvalorização de si própria e o desejo de ser valorizada, era a influência de Apeles que a conduzia ao equilíbrio.Quando, em 1927, Apeles decide tirar o curso de piloto-aviador e falece, pouco depois, vítima da queda, no Tejo, do hidro-avião que pilotava, dá-se o maior choque da vida da poetisa, que se confronta com o absurdo da morte, precisamente no momento em que se começava a adaptar à família do terceiro marido. Desse violentíssimo choque Florbela nunca mais foi a mesma, passando a viver permanentemente deprimida, doente dos nervos, fumando em demasia e a emagrecendo sensivelmente. Passa a viver em reclusão, guardando religiosamente no seu quarto dois pedaços do avião do irmão que foram resgatados, abandona a poesia e passa para a prosa, escrevendo sobre a estranheza da morte e do conforto da mesma.É nesse período que escreve “As Máscaras do Destino”, obra dedicada “ao seu morto”, a quem a autora dirige as palavras de exaltação e dor. Apesar disso encontram-se na obra frases de grande beleza e força com expressões de desejo, carregadas de erotismo, tanto como sofrimento e morte. O conto “O Aviador” é exemplo disso pois descreve uma visão mítica da morte do irmão amado.Terminada a obra, que lhe serviu como meio de escape, Florbela tentou arranjar uma editora que lhe publicasse o livro, mas sem resultado. Foi considerado demasiado deprimente e confuso. Só seria publicado um ano depois do seu suicido.",
  "genres": [
    "Portuguese Literature",
    "Portugal",
    "Poetry"
  ],
  "author": "Florbela Espanca",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/6384018-as-m-scaras-do-destino"
}