{
  "title": "The Dirty Squad",
  "description": "Michael Hames' compelling memoirs open with the carnage of the 1983 Harrods bomb, which ironically did much to further his career in the police force because of the bravery and resolution he displayed in the aftermath; it also coincided with his second divorce. Three marriages and a heart attack would seem a high price to pay for the rigours of public service but such is the policeman's lot. Hames' long career culminated in a five-year term as Head of Scotland Yard's Obscene Publications Branch (OPB)--aka the Dirty Squad--and a grapple with the tentacular world of hardcore pornography. His personal mission was to deliver a wake-up call about the prevalence of child pornography; by the time of his retirement in 1994, he'd succeeded in redefining the role of the OPB so that 90 per cent of its activity was directed against paedophiles. A sketchy personal history serves only as the skeleton on which to hang fleshy anecdotes. Tales of arresting Boy George for drugs, a friendship with Spike Milligan (originating in dog excrement, so to speak), and the obligatory MP in a brothel story are solid saloon bar patter, but the bulk of the narrative involves sex offenders, a depressingly familiar clothes line of dirty washing. Cases such as the man who intended filming a baby put in a tank of piranhas are too horrendous to contemplate, but more complicated ones, such as Operation Spanner, when a group of men were convicted for consensual, if extreme, sado-masochism, demand a more satisfying analysis. Hames perhaps wisely realises that he's too close to provide this, and the individual moral absolution gained by a pedantic adherence to the letter of the law offers an essential tool of survival, along with counselling, alcohol and punch-drunk filing cabinets. He sees his book as cautionary to both parents and respectively, be on your guard, and we know what you're up to. As a timely bridge between the eras of the card file and the computer file, it offers a sobering insight into dirty work past, and inevitably still to come. -- David Vincent",
  "genres": [
    "Biography",
    "Nonfiction"
  ],
  "author": "Michael Hames",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/6385700-the-dirty-squad"
}