{
  "title": "The Second Karmapa Karma Pakshi: Tibetan Mahasiddha",
  "description": "Karma Pakshi is considered influential in the development of the reincarnate lama tradition, a system that led to the lineage of the Dalai Lamas. Born in East Tibet in the thirteenth century, Karma Pakshi himself was the first master to be named Karmapa, a lineage that continues to modern times and has millions of admirers worldwide. During his lifetime, Karma Pakshi was widely acknowledged as a mahāsiddha—a great spiritual adept—and was therefore invited to the Mongol court at the apogee of its influence in Asia. He gave spiritual advice and meditation instructions to the emperor Mongke Khan, whom he advised to engage in social policies, to release prisoners, and to adopt a vegetarian diet. After Mongke’s death, Karma Pakshi was imprisoned by the successive emperor Kubilai Khan, and much of Karma Pakshi’s writing was done while he was captive in northeast China. He was eventually released and returned to Tibet, where he commissioned one of the medieval world’s largest metal statues: a seated Buddha sixty feet high.Centuries later, two Buddhist meditation masters, the First Mingyur Rinpoche and Chögyam Trungpa Rinpoche, were inspired by Karma Pakshi to write meditation practices that are profoundly important to contemporary Tibetan Buddhist practitioners: respectively, the Karma Pakshi Guru Yoga and the Sādhana of Mahāmudrā.This first-ever comprehensive biography of Karma Pakshi in English reveals new information about a pivotal historical figure in the development of Tibetan Buddhism and his interactions with two Mongol emperors. Also included are translations of several newly available songs attributed to Karma Pakshi and translations of ten excerpts of his writings on reincarnation, meditation, dreams, visionary experiences, tantra, and consecration.",
  "genres": [],
  "author": "Charles   Manson",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/63836604-the-second-karmapa-karma-pakshi"
}