{
  "title": "Reinventing the Body, Resurrecting the Soul: How to Create a New You",
  "description": "Deepak Chopra presents ten lessons to help build awareness and change the distorted energy patterns that are the root cause of aging, infirmity, and disease.Fifteen years after his #1 New York Times bestseller, Ageless Body, Timeless Mind , Deepak Chopra revisits \"the forgotten miracle\"–the body's infinite capacity for change and renewal. You cannot take advantage of this miracle, Chopra says, unless you are willing to completely reinvent your body, transforming it from a material object to a dynamic, flowing process. \"Your physical body is a fiction,\" Chopra contends. Every cell is made up of two invisible awareness and energy.Transformation can't stop with the body, however; it must involve the soul. The soul–seemingly invisible, aloof, and apart from the material world–actually creates the body. Only by going to the level of the soul will you access your full potential, bringing more intelligence, creativity, and awareness into every aspect of your life.Reinventing the Body, Resurrecting the Soul delivers ten breakthroughs–five for the body, five for the soul–that lead to self-transformation. In clear, accessible terms, Chopra shows us how to commit ourselves to deeper awareness, focus on relationships instead of consumption, embrace every day as a new world, and transcend the obstacles that afflict body and mind.Deepak Chopra has inspired millions with his profound teachings over the years. His bestselling books have explored the mind/body connection and the power of spirit. With his latest book, he invites you to experience with him the miracles that unfold when we connect the body directly to the awesome mysteries that give life meaning–directly to the soul. When you have completed this journey, after reinventing your body and resurrecting your soul, the ecstasy of true wholeness becomes possible for the very first time.",
  "genres": [
    "Spirituality",
    "Self Help",
    "Nonfiction",
    "Health",
    "Audiobook",
    "Psychology",
    "Personal Development"
  ],
  "author": "Deepak Chopra",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/6383910-reinventing-the-body-resurrecting-the-soul"
}