{
  "title": "Everything I Needed to Know about Women I Learned by Reading Twilight: A Vampire's Guide to Eternal Love",
  "description": "Update June 2009: Now available for non-Kindle readers at Scribd.comHave you ever wondered why Twilight, the popular vampire romance series, has had such a strong pull on millions of readers? After years of successfully counseling couples through marital challenges, Jim Lee, Ph.D., believes he knows why. It's because Twilight accurately captures in fictional form the seven things a woman really wants from a man. Join Lee in a fictional counseling experience in which he asks a client to read the Twilight books to better understand the woman he loves -- and to finally learn how to give her what Edward seems to give Bella so effortlessly. Along the way, you'll be introduced to The Seven Rules of Loving a Woman Forever as culled from the idealized vampires that attract millions of readers around the world to the Twilight series. Any man who wants to faithfully love a woman should pay attention. Any woman who wants to understand what really motivates her approach to love and relationships should, too. Because it turns out that men really aren't from Mars after all. Instead, Men are from Transylvania and women are from Forks, Washington.______From the first chapter:“So how bad did it get, Garrett? You said she kicked you out. What happened?”“Well,” at this he began to look sheepish and I drew up a mental list of nearby hotels where he could stay the night. “It turns out she was crying because she’d just finished a book that evidently made her realize what a bad husband I am.”This intrigued me. I’ve run into many cases where a man’s fascination with pornography can make his wife have feelings of self-doubt, but rarely does a man get intimidated by, say, Mr. Darcy. “What book, do you know?”“It’s some kind of vampire book.”Now he had me really intrigued. Vampires, very interesting.“It’s kind of silly, but she’s been totally into this vampire fantasy series called Sunset, or Sundown, or—““Twilight.” I said it more than asked it.______Print publication rights available, for more information, contact jimleephd AT gmail.",
  "genres": [],
  "author": "Jim    Lee",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/6385186-everything-i-needed-to-know-about-women-i-learned-by-reading-twilight"
}