{
  "title": "Amen, Amen, Amen: Memoir of a Girl Who Couldn't Stop Praying",
  "description": "Until the age of ten, Abby Sher was a happy child in a fun-loving, musical family. But when her father and favorite aunt pass away, Abby fills the void of her loss with rituals: kissing her father's picture over and over each night, washing her hands, counting her steps, and collecting sharp objects that she thinks could harm innocent pedestrians. Then she begins to pray. At first she repeats the few phrases she remembers from synagogue, but by the time she is in high school, Abby is spending hours locked in her closet, urgently reciting a series of incantations and pleas. If she doesn't, she is sure someone else will die, too. The patterns from which she cannot deviate become her shelter and her obsession.  In college Abby is diagnosed with obsessive-compulsive disorder, and while she accepts this as an explanation for the counting and kissing and collecting, she resists labeling her fiercest obsession, certain that her prayers and her relationship with G-d are not an illness but the cure. She also discovers a new passion: performing comedy. She is never happier than when she dons a wig and makes people laugh. Offstage, however, she remains unable to confront the fears that drive her. She descends into darker compulsions, starving and cutting herself, measuring every calorie and incision. It is only when her earliest, deepest fear is realized that Abby is forced to examine and redefine the terms of her faith and her future. Amen, Amen, Amen is an elegy honoring a mother, father, and beloved aunt who filled a child with music and their own blend of neuroticism. It is an adventure, full of fast cars, unsolved crimes, and close calls. It is part detective story, part love story, about Abby's hunt for answers and someone to guide her to them. It is a young woman's radiant and heartbreaking account of struggling to recognize the bounds and boundlessness of obsession and devotion.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Mental Health",
    "Psychology",
    "Religion",
    "Mental Illness",
    "Biography Memoir"
  ],
  "author": "Abby Sher",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/6384251-amen-amen-amen"
}