{
  "title": "Never Enough: When Achievement Culture Becomes Toxic-and What We Can Do About It",
  "description": "AN INSTANT NEW YORK TIMES BESTSELLERThe definitive book on the rise of “toxic achievement culture” overtaking our kids' and parents' lives, and a new framework for fighting backIn the ever more competitive race to secure the best possible future, today’s students face unprecedented pressure to succeed. They jam-pack their schedules with AP classes, fill every waking hour with resume-padding activities, and even sabotage relationships with friends to “get ahead.” Family incomes and schedules are stretched to the breaking point by tutoring fees and athletic schedules. Yet this drive to optimize performance has only resulted in skyrocketing rates of anxiety, depression, and even self-harm in America’s highest achieving schools. Parents, educators, and community leaders are facing the same how can we teach our kids to strive towards excellence without crushing them?In Never Enough, award-winning reporter Jennifer Breheny Wallace investigates the deep roots of toxic achievement culture, and finds out what we must do to fight back. Drawing on interviews with families, educators, and an original survey of nearly 6,000 parents, she exposes how the pressure to perform is not a matter of parental choice but baked in to our larger society and spurred by increasing income inequality and dwindling opportunities. As a result, children are increasingly absorbing the message that they have no value outside of their accomplishments, a message that is reinforced by the media and greater culture at large.Through deep research and interviews with today’s leading child psychologists, Wallace shows what kids need from the adults in the room is not more pressure, but to feel like they matter , and have intrinsic self-worth not contingent upon external achievements. Parents and educators who adopt the language and values of mattering help children see themselves as a valuable contributor to a larger community. And in an ironic twist, kids who receive consistent feedback that they matter no matter what are more likely to have the resilience, self-confidence, and psychological security to thrive.Packed with memorable stories and offering a powerful toolkit for positive change, Never Enough offers an urgent, humane view of the crisis plaguing today’s teens and a practical framework for how to help.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Education",
    "Self Help",
    "Audiobook",
    "Psychology",
    "Sociology"
  ],
  "author": "Jennifer Breheny Wallace",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/63876547-never-enough"
}