{
  "title": "كلمات: التقاط الألماس من كلام الناس",
  "description": "تضمُّ صفحاتُ هذا الكتاب، تأملاتٍ متواليةً استغرقتُ فيها لأوقاتٍ طوالٍ، محدِّقاً فى (المفردات) التى تجرى على الألسنة. وهى مفرداتٌ تبدو للوهلة الأولى محدودةَ الدلالة بسيطة المعنى ، غير أن التأمل فيها، يكشف عن الكثير من المعانى المضمرة، والشواهد المؤكِّدة أن (التواصل) بين المراحل الثقافية المتعاقبة، إنما يظهر على استحياءٍ وعلى نحوٍ من الغموض، فى عديد من الدلائل التى تخفيها اللغة بين طيَّات كلماتها وتعبيراتها. ولذلك، فالناسُ فى بلادنا تجرى على ألسنتهم كلمات، معظمها عامىٌّ وبعضها فصيحٌ ، يستعملونها فى حياتهم بيسرٍ وتلقائيةٍ (وأحياناً باستهانة) من دون أن يدروا بما تخفيه الكلمة بين حروفها من معنى عميق ، بل طبقات متراكبة من المعانى ، تراكمت بفعل الامتداد الطويل لتاريخنا الثقافى . والكلمات عموماً، هى رَسْمُ العالم فى الأذهان. فالوعى الجماعى والفردى يصوغ صورة العالم فى الذهن، عبر عدد من الكلمات التى تتألف منها اللغة . ولذلك فإننا حين نفكِّر، وحين ندرك، وحتى حين نحلم؛ فإننا نقوم بتلك الأنشطة الذهنية كلِّها، من خلال اللغة والكلمات .. ومن ثمَّ، فالكلمات هى مفاتيحُ المعرفة، وهى حدودُ المعانى، وهى وجودُ الأشياء فى العقل الإنسانى، وربما فى العقل الإلهى أيضاً! بحسب ما جاء فى الآية القرآنية البديعة ]قُل لو كان البحر مداداً لكلمات ربى، لنفد البحر قبل أن تنفد كلمات ربى، ولو جئنا بمثله مدداً[ ونلاحظ هنا أن (كلمات ربى) تكرَّرت، مرتين ، لتوكيد هذا المعنى العميق الدال على أن الكلمات هى الوجود، وللإشارة إلى أن كلمات الله هى أمرٌ يفوق الإدراك والإحاطة. ولذا، نرى (المسيح) على جلال قدره، يوصف فى القرآن بأنه: كلمةٌ من الله . من هذه الزاوية ننظر فى الكلمات فنراها أبواباً واسعة للفهم، وسُبلاً فسيحة للمعرفة. سواءٌ كانت معرفة ظاهرة بوضوح فى الألفاظ، أو معارف دقيقة ومدهشة، كامنة فى الكلمات، على ما سوف نراه فى (موضوعات) هذا الكتاب .. ومن المهم هنا، الإشارة إلى أننى أفرِّق تفرقةً خاصة ما بين اللفظ والكلمة، باعتبار أن (اللفظ) هو المقولُ بشكل عام، وهو كل ما يُنطق به؛ سواء كان له معنى فى ذاته أم لا . فاللفظُ (صوتٌ) يدل على أمرٍ يخص المتلفِّظ، مثلما هو الحال فى الزفرات التى يُصدرها المحزون والمكلوم والمأزوم، التى يكون (المعنى) فيها مرتبطاً بالضرورة، بالشخص المتلفِّظ بهذا (الصوت) أو ذاك، فلا يمكن إدراك الدلالة إدراكاً تاماً ، إلا بالإضافة إليه والعطف عليه . وقد يدل (الصوت) على معنى عام تواضعت عليه الجماعة واعتادت، كما هو الحال فى (التأوُّه) الذى يدلُّ لفظُهُ (آه) على الشكوى أو البوح أو تبريح الجوى . وقد يدلُّ أيضاً على الاستحسان أو الموافقة ، أو لوم المحبوب إذا قلنا له مثلاً : آهِ منك .. وفى هذه الحالة ومثلها الكثير، يكون (المعنى) قد ارتبط فى اللفظ، بحال الفاعل تخصيصاً. فما يدلُّ بصاحبه، فهو (لفظ) حتى وإن كان مركباً من عدة أصوات. أما الذى يدل بذاته، بصرف النظر عن قائله؛ فهو (كلمة) حتى وإن كانت بسيطة التركيب، محدودة الصوت. وعلى ذلك، فالكلمة عندى، هى كُلُّ ما له معنىً مستقلٌ عن المتلفِّظ .. ولذلك، فإن كُلَّ (كلمة) لفظٌ، ولكن ليس كل (لفظ ) كلمةٌ .* * * وتضم صفحات هذا الكتاب ، أطرافاً متنوعة تسعى لتبيان معانى (كلمات) خصَّصنا لكل كلمة منها فصلاً قد يطول أو يقصر، بحسب ما يلزمه الغوص فى طبقات المعانى المحتجبة خلف هذه الكلمة أو تلك ، مهما كانت قليلة الحروف. مثلما هو الحال فى كلمة بدء الوجود (كن) التى ابتدأنا بها فصول الكتاب. وكان ابتداءُ هذا المسار، سلسلةً من المقالات التى نشرتها، ومازلتُ أنشرها أسبوعياً، بجريدة الوفد المصرية. وكانت فكرتى الأولى الداعية إلى كتابتها، أن أتوقف كل أسبوع عند واحدة من الكلمات، للنظر فى معانيها العميقة. ثم تطوَّر الأمر إلى بحث الحدود الدلالية للكلمات، لتعميق الوعى باللغة التى نستخدمها، وللنظر فى (انقلاب) المعنى فى الكلمة الواحدة أحياناً، من الضد إلى الضد، حتى أننا نستخدم أحياناً (كلمات) قاصدين بها معنىً معاصراً، هو فى واقع الأمر نقيضُ المعنى الأصلى للكلمة. وقد أشار لى بعض الأصدقاء، بضرورة نشر المقالات فى كتاب. فكنتُ أتعلَّل بأن الأمر لا يستحق، فما هى إلا خطراتٌ ونظراتٌ استشرافية، فى حدود المعانى المترامية بقلب هذه الكلمة أو تلك . ولما اتسع المدى مع دخول مقالاتى الأسبوعية عامها الثانى، ومع تعمُّق النظر فى معانى الكلمات، لم يعد التعلُّل مقنعاً . خاصةً مع اضطرارى للإيجاز فى كتابة عديد من تلك المقالات، حتى تتناسب مع المساحة المخصصة للنشر، مع ما يقتضيه ذلك من إهدار لكثيرٍ من المعانى، التى كان يجب الوقوف عندها فى هذه الكلمة أو تلك. وبالطبع، فمن شأن (الإيجاز) أن يخلَّ أحياناً بالمعنى، ويقلِّل من الأهمية الدلالية للكلمات. ومن طبيعة النشر فى الصحف، أنه قد يختلُّ سياقه مع إسقاط بعض العبارات والفقرات عن عمد أو غير عمد، وقد تتشوَّش الفكرة مع الأخطاء المطبعية التى صارت فى جرائدنا كلها ، أمراً لا غنى عنه ! ولذلك اقتضى نشر (الكلمات) فى هذا الكتاب، إعادة بناء للنصوص السابق نشرها كمقالات، وإعادة كتابة بعضها كليةً. وقد نشرتها هنا، كاملةً، بما فى ذلك بعضها الذى ما كان من الممكن أن يُنشر هناك. وعلى ذلك، فإن فصول هذا (الكتاب) هى الصورة الأقرب لناتج النظر فى مدلولات الكلمات، ولنتائج التأملات والمناقشات التى أعقبت نشرها مسلسلةً . وقد جعلتُ العنوان الجانبى للكتاب (التقاط الألماس..) انطلاقاً من أن عديداً من الكلمات، صار بحكم تراكم الطبقات المعرفية فوقه، مثل فحم الأرض الذى صار ألماساً، لما طال عليه الأمدُ .. وما كل الكلام ألماساً، وإنما هى مفردات بعينها، التقطتها كما تُلتقط فصوص الألماس، من كلام الناس .",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "History",
    "Linguistics",
    "Essays",
    "Criticism"
  ],
  "author": "يوسف زيدان",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6386367"
}