{
  "title": "Dance Butterfly Dance",
  "description": "A contemporary why choose romance set in the third year of university. Multi POV, multiple love interests, very detailed high steam scenes, No full MM but a fluid scene with her in the middle.Savy St. James is a sad lonely girl with too many secrets to count. She hides away in her oversized frumpy clothes and thick glasses wishing she was brave enough to be seen without her mask.One small favor backfires and forces her into a fake date deal by the school’s hot shot quarterback. Him and his three best friends treat her like a pet to play with and are careless with her until she’s had enough and breaks the deal. But when her secrets are revealed and her masks are stripped away, they will all burn for it.Tate Valor thinks this nerdy girl is the perfect choice to use as his shield keeping all the groupies and gold diggers off his back. Savy’s a built in tutor to help him drag his marks back up so he doesn’t get benched. He never expected the make out show he forces her to put on in public to affect him more than it does her.Jude Dixon is the wild child, f**k boy of the team. His crazy antics that match his white blond hair, multiple piercings and slightly psycho personality couldn’t be any different from the shy little doll Tate’s brought into his orbit. He’s the first to see the treasure that she is and stakes his claim when he falls hard and fast for her even when she doesn’t want to be claimed.Beckett James had his shot at going pro blown right along with his knee. With football no longer a choice, he’s lost and depressed. Savy’s sweet heart and peach smelling hair has more than his interest stirring. He wants to peel back the masks she hides under and see the real her.Asher James doesn’t give a sh*t about the bookworm his friends are obsessing over. He only has one obsession, the Butterfly that dances in the cage for him. It doesn’t matter that she’s never spoken to him in two years. He wants her and only her…until Savy starts getting under his skin and he sees that maybe he’s been the one in the cage all along.Dance Butterfly Dance is book 1 of a duet and will be completed in Burn Butterfly Burn",
  "genres": [
    "Reverse Harem",
    "Romance",
    "College",
    "Sports",
    "Contemporary",
    "Dark Romance",
    "Contemporary Romance"
  ],
  "author": "Reese Rivers",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/63882991-dance-butterfly-dance"
}