{
  "title": "The Rapture",
  "description": "An electrifying story of science, faith, love, and self-destruction in a world on the brink.It is a June unlike any other before, with temperatures soaring to asphyxiating heights. All across the world, freak weather patterns—and the life-shattering catastrophes they entail—have become the norm. The twenty-first century has entered a new phase.But Gabrielle Fox’s main concern is a personal to rebuild her life after a devastating car accident that has left her disconnected from the world, a prisoner of her own guilt and grief. Determined to make a fresh start, and shake off memories of her wrecked past, she leaves London for a temporary posting as an art therapist at Oxsmith Adolescent Secure Psychiatric Hospital, home to one hundred of the most dangerous children in the country. Among the teenage killer Bethany Krall.Despite two years of therapy, Bethany is in no way rehabilitated and remains militantly nonchalant about the bloody, brutal death she inflicted on her mother. Raised in evangelistic hellfire, the teenager is violent, caustic, unruly, and cruelly intuitive. She is also insistent that her electroshock treatments enable her to foresee natural disasters—a claim which Gabrielle interprets as a symptom of doomsday delusion.But as Gabrielle delves further into Bethany’s psyche, she begins to note alarming parallels between her patient’s paranoid disaster fantasies and actual incidents of geological and meteorological upheaval—coincidences her professionalism tells her to ignore but that her heart cannot. When a brilliant physicist enters the equation, the disruptive tension mounts—and the stakes multiply. Is the self-proclaimed Nostradamus of the psych ward the ultimate manipulator or a harbinger of global disaster on a scale never seen before? Where does science end and faith begin? And what can love mean in “interesting times”?With gothic intensity, Liz Jensen conjures the increasingly unnerving relationship between the traumatized therapist and her fascinating, deeply calculating patient. As Bethany’s warnings continue to prove accurate beyond fluke and she begins to offer scientifically precise hints of a final, world-altering cataclysm, Gabrielle is confronted with a series of devastating choices in a world in which belief has become as precious - and as murderous—as life itself.",
  "genres": [
    "Fiction",
    "Thriller",
    "Horror",
    "Science Fiction",
    "Dystopia",
    "Psychology",
    "Book Club"
  ],
  "author": "Liz Jensen",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/6386076-the-rapture"
}