{
  "title": "Benét's Reader's Encyclopedia",
  "description": "Long recognized as the outstanding reference on world literature, Benet's Reader's Encyclopedia is the one against which all others are measured, and is the single-most complete one-volume encyclopedia available for those with a serious interest in the subject. The entries explore all aspects of literature from around the world: biographies of poets and playwrights, novelists and belle trists; plot synopses and character sketches from important works; historical data on literary schools, movements, terms and awards; myths and legends; and more.Completely revised and updated, this fourth edition captures the diversity of today's canon, with greater attention to African-American, Eastern, Middle Eastern, African, South American, Eastern European and women's literature.For nearly 50 years, this unique single-volume encyclopedia of world literature has been hailed as the best available. Here are over 10,000 informative entries, covering everything a reader could wish to know:Biographies of poets, playwrights, novelists, essayists and belle trists from around the world and through the ages, from Aristophanes to Toni Morrison, from Chuang Tzu to Juan Rulfo.Plot summaries of important literary works, ranging from Beowulf to Wuthering Heights to Things Fall Apart.Sketches of principal characters from literature, from Salome to Leopold Bloom.Myth, legend and folklore, covering everything from Isis to the Midgard Serpentto to the paladins.Biographies of artists, musicians, philosophers and other historical personages ranging from Roman emperors to U.S. presidents who figure prominently in literature.Accounts of significant schools and movements in literature, such as the Bloomsbury Group and the Beat writers.Original titles, as well as the most familiar English titles, for works in languages other than English.Recipients of major literary awards, including Pulitzer and Nobel prize winners.And more...For nearly 50 years, William Rose Benet and the editors who succeeded him have upheld the level of quality that distinguished the original Benet's Reader's Encyclopedia. Like its predecessors, this new edition will teach and delight, illuminate and expound, and enrich the pleasure of reading in countless ways.",
  "genres": [
    "Reference",
    "Nonfiction",
    "Books About Books",
    "Literary Criticism",
    "Literature",
    "Writing",
    "History"
  ],
  "author": "William Rose Benét",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/638597.Ben_t_s_Reader_s_Encyclopedia"
}