{
  "title": "Heritage and Exile",
  "description": "The Heritage of Hastur : Nominated for a Hugo Award, and described as “Bradley’s best [Darkover] novel” by Locus , The Heritage of Hastur is a brilliant epic of the pivotal events in the love-hate relationship between the Terran worlds and the semi-alien offspring of the forgotten colonists who peopled Darkover. This is the complex and compelling tale of the early life of Regis Hastur, Darkover’s greatest monarch. But Heritage also spins the terrifying and heartbreaking story of those who sought to control the deadly Sharra Matrix and tells how Lew Alton met and lost his greatest love, Marjorie Scott. This is the unforgettable showdown between those Darkovan lords who would bargain away their world for the glories of Terran science and those who would preserve the special matrix powers that are at once the prize and the burden of the Darkover.Sharra’s Exile : The most dangerous magical implement on all of Darkover was the infamous, legendary Sharra Matrix. Embodying the image of a chained woman wreathed in flames, it was the last remaining weapon of the Age of Chaos—an era of uncontrolled laran warfare which had almost destroyed all life on Darkover. The Sharra Matrix has been exiled offworld to one of the far-flung planets of the Terran Empire, in the protective custody of one who had suffered gravely from its Comyn Lord Lew Alton. But when Lew was called back to Darkover to contend for his rights, he had no choice but to bring this dangerous matrix back with him, and once Sharra Matrix was back, her flaming image spread far and wide, setting in motion events which would change the lands, the seven Domains, and the entire future of Darkover.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Adventure",
    "Gay",
    "Sci Fi Fantasy"
  ],
  "author": "Marion Zimmer Bradley",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/638686.Heritage_and_Exile"
}