{
  "title": "The Growing",
  "description": "It's 2012. Do you know where your androids are? In the near future, the world will grow complacent and a brilliant, if misguided, mind will seek to capitalize on that complacency by providing the common man and royalty alike with just the convenience he needs to aid him in his day to day labors. But what if suddenly those companions were to turn on their masters, sowing the seeds of destruction and death across the land? What if man's helper became his killer, and no one knew why or how to stop it? The Growing is the story of such a post-apocalyptic vision, and of the brave men and women who give everything they have to save the world from its eventual destruction. It is also the story of two lonely hearts, bitter enemies at first, who learn to trust and to love again in a world falling down all around them. Koda Rivers is a Lakota veterinarian and shaman whose roots run deep in her culture and in the soil of her native Black Hills. Kirsten King, Ph.D., is a brilliant cyberscientist and the sole surviving member of President Hillary Clinton's Cabinet. Each drawn by her own mission to destroy the androids, they meet in fire and blood at the North Dakota facility where the insurgent machines are manufactured. The Growing has all the bells and whistles of a classical epic: sweeping battles, a heroic love story, Amazon warriors, a blind bard, the gods of the land and a monster or two. The challenges present are met by our two heroes and their companions. These include Dakota's remarkable father and her warrior brother, Tacoma; Maggie Allen, USAF Colonel and crack pilot; an extraordinary German Shepherd named Asimov; and the spirits of the land in their various forms.",
  "genres": [
    "LGBT",
    "Lesbian",
    "Fantasy",
    "Post Apocalyptic",
    "Science Fiction",
    "Dystopia",
    "Fan Fiction"
  ],
  "author": "Susanne M. Beck",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/1294993.The_Growing"
}