{
  "title": "Why America Matters: The Case for a New Exceptionalism",
  "description": "As seen on Mornings with Maria on Fox BusinessWhy America Matters confronts the most challenging questions facing the nation today…and points the way towards an American Renaissance.Who are we? Where are we going? And why are we so divided? Why America Matters addresses these questions and argues that the place Americans call home is worth fighting for. The widely held belief of past generations—that America is special, with an extraordinary role to play in the world—remains true, but has been undermined by external adversaries, internal contradictions, and weakness of vision.Why America Matters reveals how the nation faces four extraordinary circumstances, confused identity, corrupt institutions, and inept policy engagement. The idea of America is under attack, yet many of our wounds are self-inflicted. Powerful forces within our country—hostile to the ideals of America—seem to be winning. These agents seek to rewrite America’s history, undermine its institutions, and silence those who don’t agree. All the while, America’s foreign adversaries prey on our divisions and weaknesses.America is neither declining nor dying, but in a winter season. Our current political and social crises represent fertile ground for national springtime and renewal, a process the nation has gone through before. While the country has never been more divided on partisan, cultural, and ideological lines, there is a path to achieve the unity and vigor necessary to confront the twenty-first century’s challenges. Americans must recognize and reject false ideologies; resist surveillance and tyranny; take back our communities, schools, and families; and assert our enshrined rights to free speech and privacy.The world recognized that America was great because America was good. America’s founding ideals, timeless values, and distinctive national character are needed now more than ever. But we can’t simply go back to the past. A new century requires a new vision of American greatness. Why America Matters points the way.“Why America Matters is an astonishing achievement. Wilkerson’s masterful synthesis of our history as it relates to where we are right at this moment—and how we can and must go forward—is an inestimable gift, and can hardly be praised enough.” —Eric Metaxas is the New York Times #1 bestselling author of Bonhoeffer, Martin Luther, Is Atheism Dead?, If You Can Keep It, and Letter to the American Church, and founder and host of Socrates in the City“Why America Matters is a courageous book. Wilkerson confronts the powers—both political and ideological, that have conspired to destroy our nation and its values. Why America Matters holds an urgent and timely message for anyone who cares about the future of this nation. Why America Matters is a must read for anyone seeking to understand what is happening to America, and more importantly, how to fix it!” —Matt Schlapp, Chairman, Conservative Political Action Coalition (CPAC)“Michael Wilkerson has pulled off a mean feat with Why America Matters. As much as it is a crisply written lament for our fractured national identity, his tour de force also is a blueprint for a new generation who will be left to rebuild the moral capital squandered by their forebears.",
  "genres": [],
  "author": "Michael Wilkerson",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/63903130-why-america-matters"
}