{
  "title": "Liberated from Religion: The Inestimable Pleasure of Being a Freethinker",
  "description": "★ ★ ★ ★ ★ “The best books about Atheism are the ones written by Paulo Bittencourt, because, unlike Richard Dawkings, Christopher Hitchens and Sam Harris, who have never been religious, he was raised Evangelical, studied Theology and, therefore, speaks from experience.” (D. Barker) “Liberated from Religion”, the book most hated by religions, creeds, beliefs, cults, dogmas, churches, rites, sects, abbots, apostles, archbishops, archdeacons, archimandrites, archpriests, astrologers, augurs, ayatollahs, babalawos, babalorishas, beati, bishops, canons, cardinals, chaplains, clerics, deacons, deans, devotees, divines, ecclesiastics, enchanters, enlightened ones, evangelists, faith healers, fortune tellers, friars, gurus, imams, magicians, mediums, missionaries, monks, monsignors, necromancers, nuncios, occultists, pastors, patriarchs, pontiffs, popes, preachers, prelates, presbyters, priests, primates, priors, prophets, protodeacons, rabbis, religious, reverends, seers, shamans, sorcerers, vicars, witch doctors and witches. Despite the enormous expansion of knowledge, the great advances in Science (with our space probes exploring the boundaries of the Solar System) and all philosophical thought, 250 years after the Enlightenment billions of people still think it’s indispensable to believe religious primitivenesses. While the world religions despise each other, thousands of Christian denominations fight for the title of “The True Church”. Yet, in their combat against reason and in the imposition of their dogmatisms on all of society, they pretend unity and harmony. As Islam becomes ever more radicalized, Third World countries are being the stage of a galloping increase in religious intolerance perpetrated by Pentecostals who seek to convert them into Evangelical theocracies. Based on his personal experience with biblical literalism, Paulo Bittencourt takes a historical approach to Christian fundamentalism and exposes the fallacies of religious dogmas, the negative effects of suppressing critical thinking and the benefits that living without religion brings the individual and, consequently, the world. Topics covered: Allah, Atheism, Bible, Christianity, Adventist, Baptist, Catholic, Evangelical, Pentecostal Church, Communism, Devil, Evolution, Freethought, God, Gospel, Heaven, Hell, Islam, Jesus, Judaism, Mohammed, Philosophy, Protestantism, Satan, Science, Skepticism, Socialism, etc. Paulo Bitencourt was born in Castro, Brazil, spent his childhood in Rio de Janeiro and studied Theology in São Paulo. Close to becoming a pastor, he went on an adventure to Europe and ended up settling in Austria. The book “Ethics”, by Bento de Espinosa (Baruch Spinoza), turned him into a naturalist, humanist and freethinker. Paulo Bitencourt dedicates his life to helping people liberate themselves from religion. Paulo Bittencourt is the author also of the books “Wasting Time on God” and “Com Zeus Não Se Brinca” (Zeus Is Not to Be Played With). “There is no greater pleasure than to be a freethinker.” — Paulo Bittencourt Visit: liberatedfromreligion . wordpress . com",
  "genres": [
    "Spirituality",
    "Science",
    "Nonfiction"
  ],
  "author": "Paulo Bitencourt",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/63889383-liberated-from-religion"
}