{
  "title": "The Education of an American Dreamer: How a Son of Greek Immigrants Learned His Way from a Nebraska Diner to Washington, Wall Street, and Beyond",
  "description": "With insight and refreshing candor, Peter G. Peterson describes his remarkable life story beginning in Kearney, Nebraska as an eight-year-old manning the cash register at his father's Greek diner through his \"Mad Men\" advertising days, to Secretary of Commerce in Nixon's paranoid White House, to the tumultuous days of Lehman Brothers, and to the creation of The Blackstone Group, one of the great financial enterprises in recent times.In THE EDUCATION OF AN AMERICAN DREAMER, Peterson chronicles the progress of this journey with irony, humor and, sometimes, painful honesty. Within these pages are stories of marriage and family hardship; lessons in political gamesmanship; thoughts on his obsessive desire to succeed; and, finally, learning the meaning of \"enough.\" From his advertising days in Chicago in the 1950's to becoming the youngest CEO of a Fortune 300 Company, he shares with us his rise to the top and the price paid along the way. As the youngest Cabinet member in the Nixon administration, he describes his survival techniques in a hubris-driven and paranoid White House, including his turbulent turf wars with Treasury Secretary John Connally leading to Peterson's abrupt and highly publicized firing. His stewardship of Lehman Brothers is a Shakespearian tale of a CEO who struggled to deal with partners who were plotting his demise and, at the same time, turning an institution on the brink of bankruptcy to one with 5 straight years of record profits.His life's story is about doing well by doing good. In the wake of Blackstone's highly successful public offering, Peterson found himself an 80-year old instant billionaire, on the verge of retirement. And like many lifetime workers and over-achievers, he suddenly confronts an unexpected, depressing identity crisis. His solution? Committing a great bulk of his net proceeds to establish the Peter G. Peterson Foundation, his philanthropic endeavor to do something about America's politically untouchable challenges that threaten America's future, among them massive entitlement obligations, ballooning health care costs, and our energy gluttony.Ultimately, this is a man's account of his legendary successes, humiliating failures, and personal tragedies - a testament to a remarkable life and, indeed, to the American Dream itself.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Business",
    "Memoir"
  ],
  "author": "Peter G. Peterson",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/6390344-the-education-of-an-american-dreamer"
}