{
  "title": "The Jeweler of Stolen Dreams",
  "description": "A captivating tale of two passionate women separated by decades but united by a shared vision. One, the famous jeweler Suzanne Belperron, fighting to protect her company and rescue the man she loves. The other, a young auctioneer whose exceptional gifts reveal a secret that endangers her very life.“Only one thing saves you, and that is not losing sight of beauty.”Paris, 1942. Suzanne Belperron is known as one of the most innovative jewelers of her time. Elsa Schiaparelli and the Duchess of Windsor are just two of her many illustrious clients. What no one knows is that Suzanne and her dear friend, American socialite Dixie Osgood, have been helping transport hundreds of Jewish families out of France since the war began. But now, the war has come to Suzanne’s front door—the Nazis have arrested her business partner and longtime lover, Bernard Herz.New York, 1986. Violine Duplessi, an appraiser for a boutique auction house, is summoned to visit the home of Paul Osgood, a scholarly lawyer and political candidate who aspires to take over the Senate seat of his recently deceased father. Paul has inherited everything inside Osgood Manor, from the eighteenth-century furniture to the nineteenth-century Limoges china. But a vintage Louis Vuitton trunk is what calls to Violine, with the surprising but undeniable thrum of energy that can only be one thing: the gift passed down to her by La Lune, the sixteenth-century courtesan.Since childhood, Violine has been able to read an object’s history and learn the secrets of its owners by merely touching it, but she silenced her psychometry when it destroyed her last relationship. Why has it returned now?While inspecting the trunk, she senses it holds a hidden treasure and finds a hoard of precious jewels that provoke nightmarish visions and raise a multitude of questions. Who owned these pieces? Why were they hidden inside the trunk? Were they stolen? Could their discovery derail Paul’s campaign and their burgeoning attraction to each other?So begins a search that takes Violine to Paris to work with the Midas Society, a covert international organization whose mission is to return lost and stolen antiques, jewels, and artwork to their original owners. There, Violine will discover both her and Paul’s surprising connections to the trunk—and to Suzanne Belperron, who silently and heroically hid an amazing truth in plain sight.Told through Violine’s first-person account and Suzanne’s diary entries, The Jeweler of Stolen Dreams is a riveting story of magick, mystery, romance, and revenge. Inspired by the real-life legend Suzanne Belperron, it marks yet another masterpiece by New York Times and Wall Street Journal bestselling author M.J. Rose.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Magical Realism",
    "Historical",
    "Romance",
    "Mystery",
    "Fantasy"
  ],
  "author": "M.J. Rose",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/63898953-the-jeweler-of-stolen-dreams"
}