{
  "title": "In Sardinia: An Unexpected Journey in Italy",
  "description": "Award-winning historian Jeff Biggers opens a new window into the hidden treasures of Sardinia in a groundbreaking travel narrative that crisscrosses one of the most enigmatic places in Italy.After three decades of living and traveling in Italy, Jeff Biggers finally crossed over to Sardinia, uncovering a treasury of stories amid major archaeological discoveries rewriting the history of the Mediterranean.Based in the spectacular port of Alghero, guided through the island’s rich and largely untranslated literature, he embarked on a rare journey around the island to experience its famed cuisine, wine, traditional rituals and thriving cultural movements. “Sardinia is something else. Enchanting spaces and distances to travel,” D. H. Lawrence wrote in 1921. On the 100th anniversary of Lawrence’s visit, Biggers opens a new window into the history of the island, chronicling how new archaeological findings have placed the island as one of the cradles of the Bronze Age. From the Neolithic array of Stonehenge-like dolmens and menhir stone formations to the thousands of Bronze Age “nuraghe” towers and burial tombs, the vastness of the uninterrupted cycles of civilizations and their architectural marvels have turned Sardinia into the Mediterranean’s ”open museum.” Beyond its fabled beaches, reconsidering how its unique history and ways have shaped Italy and Europe today, Biggers explores how travelers must first understand Sardinia and its ancient and modern history to truly understand the rest of Italy.In the tradition of Bruce Chatwin's In Patagonia, Mark Kurlansky’s Basque History of the World, and Frances Mayes’ and Tim Parks’ narratives on Italy, In Sardinia is a major new addition to travel writing and literature in Italy.",
  "genres": [
    "Travel",
    "Nonfiction",
    "History",
    "Italy"
  ],
  "author": "Jeff Biggers",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/63895410-in-sardinia"
}