{
  "title": "If My Words Had Wings",
  "description": "A life affirming story of rehabilitation and hope after prison. The third novel from the prize-winning Danielle Jawando, perfect for fans of Angie Thomas and Elizabeth Acevedo.   ‘Jawando’s writing is incredibly raw and real; I felt completely immersed’ Alice Oseman, author of the Heartstopper series    After getting in with the wrong crowd and being involved in a high-profile armed robbery, a flawed and discriminatory legal system convicts fifteen-year-old Tyrell Forrester. Locked up in a juvenile prison for two years, Ty soon realises the only person he can trust is himself. Now he’s getting out, and he’s determined to turn things around. Inspired by a visiting poet while inside, Ty discovers a whole new world through spoken word and is finally finding his voice. But will escaping his old life, and friends, be that easy? Will society ever see him as anything other than a criminal? Praise for And the Stars Were Burning Brightly: 'An outstanding and compassionate debut' Patrice Lawrence, author of Orangeboy ‘An utter page turner from a storming new talent. Passionate, committed and shines a ray of light into the darkest places - the YA novel of 2020!’ Melvin Burgess, author of Junk 'One of the brightest up and coming stars of the YA world' Alex Wheatle, author of Crongton Knights Praise for When Our Worlds Collided:   'A raw, unflinching and powerful story that will stay with me for a long time’ Manjeet Mann, author of The Crossing   ‘A beautiful ode to found family, and a compassionate look at the power of connection borne from the ashes of tragedy and apathy’ Christina Hammonds Reed, author of The Black Kids   ‘Hard-hitting yet still hopeful, this is an emotional powerhouse of a book’ Alexandra Sheppard, author of Oh My Gods",
  "genres": [
    "Young Adult",
    "Fiction",
    "Realistic Fiction",
    "Audiobook"
  ],
  "author": "Danielle Jawando",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/63895256-if-my-words-had-wings"
}