{
  "title": "Flags on the Bayou",
  "description": "From American master James Lee Burke comes a novel set in Civil War-era Louisiana as the South transforms and a brilliant cast of characters – enslaved and free women, plantation gentry, and battle-weary Confederate and Union soldiers – are caught in the maelstromIn the fall of 1863, the Union army is in control of the Mississippi river. Much of Louisiana, including New Orleans and Baton Rouge, is occupied. The Confederate army is in disarray, corrupt structures are falling apart, and enslaved men and women are beginning to glimpse freedom.When Hannah Laveau, a formerly enslaved woman working on the Lufkin plantation, is accused of murder, she goes on the run with Florence Milton, an abolitionist schoolteacher, dodging the local constable and the slavecatchers that prowl the bayous. Wade Lufkin, haunted by what he observed—and did—as a surgeon on the battlefield, has returned to his uncle’s plantation to convalesce, where he becomes enraptured by Hannah. Flags on the Bayou is an engaging, action-packed narrative that includes a duel that ends in disaster, a brutal encounter with the local Union commander, repeated skirmishes with Confederate irregulars led by a diseased and probably deranged colonel, and a powerful story of love blossoming between an unlikely pair. As the story unfolds, it illuminates a past that reflects our present in sharp relief.James Lee Burke, whose “evocative prose remains a thing of reliably fierce wonder” (Entertainment Weekly), expertly renders the rich Louisiana landscape, from the sunsets on the Mississippi River to the dingy saloons of New Orleans to the tree-lined shores of the bayou and the cottonmouth snakes that dwell in its depths. Powerful and deeply moving, Flags on the Bayou is a story of tragic acts of war, class divisions upended, and love enduring through it all.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Civil War",
    "Mystery",
    "Historical",
    "War",
    "Audiobook"
  ],
  "author": "James Lee Burke",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/63910395-flags-on-the-bayou"
}