{
  "title": "The Exodus Gate",
  "description": "“Stephen has created worlds that enthralled me and characters that intrigued me – the kind of thing that every writer aspires to do. I give The Exodus Gate a resounding 8 / 10 – incredibly imaginative and highly enjoyable, and I really looking forward to Book 2, The Storm Guardians.”-DaveBrendon’s Fantasy and SciFi Weblog (review)“With The Exodus Gate author Stephen Zimmer sets the stage for an adventurous new science fiction fantasy series that is sure to entertain the reader from beginning to end. Zimmer has weaved a tale of fantastic realms populated with exotic creatures. Keep a sharp eye out for this new series.” -Mark Randell ---Yellow30 Sci-Fi (review) Exodus Gate is the first book of a sweeping, epic-scale urban fantasy series with dystopian and apocalyptic themes from the imagination of Stephen Zimmer. The Rising Dawn Saga begins with a prologue that calls to mind the imagery of Milton's Paradise Lost, and then introduces Benedict Darwin, the host of a popular late night radio show dealing with the paranormal and the things of myth, legend, and conspiracy. Benedict comes into possession of a virtual reality simulator that turns out to be something far greater, and far more dangerous than he ever expected.Supernatural powers from the Abyss are aiding humans at the heights of political and economic power in a centuries-old movement called The Convergence. It is focused on bringing the world under one political and economic authority, one that erases borders between nations and governs all populations across the world.A tale of courage, hope, and adventure, with fantastical realms and exotic characters, The Exodus Gate is a unique story that blends fantasy, science fiction, the paranormal, horror, and military thriller elements into a powerful voice within the realms of urban fantasy. This edition also features a full set of interior illustrations from award-winning artist Matthew Perry.",
  "genres": [
    "Fantasy",
    "Fiction"
  ],
  "author": "Stephen Zimmer",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/6391422-the-exodus-gate"
}