{
  "title": "Teufelskind",
  "description": "Aiko Matsushima ist eine Einzelgängerin. Schon damals im Kinderheim sei sie das gewesen, meint Misaė, die inzwischen mit dem weitaus jüngeren Minoru zusammen wohnt. Damals war Misaė im Heim eine Aufseherin, Minoru eines der Kinder, das später eine Tischlerlehre machen konnte. Jetzt leben beide in einem eigentümlich sexualisierten Alltag wieder zusammen. Dann treffen sie plötzlich - durch Zufall? - Aiko wieder. Einsam kommt sie ihnen vor, Mitleid erregend irgendwie. Aber das ist ein tödlicher Irrtum. Denn Aiko ist im wahrsten Sinn des Wortes ein Teufelskind, und fackelt die Wohnung der beiden samt ihrer Bewohner ab. Kurz vor ihrem Tod wird sich Misaė noch daran erinnern, dass auch Sakura Inoue, eine früh verstorbene Studentin, ebenfalls einem Brandanschlag zum Opfer gefallen ist.Das Teufelskind schildert den mörderischen Rachefeldzug Aiko Matsushimas und legt dabei ein tragisches Leben frei: begonnen bei einer Kindheit im Bordell in den ärmlichsten Regionen Tokios, als Prostituierte und Zimmermädchen schonungslos der Kälte und Rücksichtslosigkeit der Welt ausgesetzt. Dann plötzlich erwacht das Böse in ihr. Und von da an gibt es kein Erbarmen mehr... Das Teufelskind ist ein verstörendes Buch. Das hat zum einen damit zu tun, dass es wie eine literarisch anspruchsvolle Mischung aus Sozialroman und Thriller daherkommt. Das hat aber vor allem auch damit zu tun, dass seine Sprache, der fremden literarischen Tradition (und der kongenialen Übersetzung durch Frank Rövekamp) geschuldet, so faszinierend fremdartig anmutet. Alles in allem also ist Das Teufelskind das grandios komponierte Psychogramm einer geschundenen Seele. Und einer der besten Thriller der letzten Zeit. -- Stefan Kellerer",
  "genres": [
    "Japan",
    "Thriller",
    "Fiction",
    "Japanese Literature",
    "Crime",
    "Asia",
    "Novels"
  ],
  "author": "Natsuo Kirino",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/6391864-teufelskind"
}