{
  "title": "La vieja sirena",
  "description": "Alejandría, siglo III. Los esplendores de Egipto se han apagado y el país se ha convertido en una gris provincia de un Imperio romano en descomposición. La época es cambiante: el cristianismo es la religión oficial, pero no ha calado en el pueblo; los viejos dioses se resisten a morir y magia y ciencia, administración y culto sagrado conviven en las estrechas callejuelas de la megalópolis que se desparrama bajo el célebre faro. Ajenos a los cambios y a la decadencia, desentendidos de las invasiones de los bárbaros que están desmigajando las fronteras del Imperio occidental, en la corte y en los palacios la vida transcurre polarizada por las dos grandes pasiones humanas: el amor y el poder.Éste es el magnífico marco donde se juega el destino particular de tres personajes: Ahram, un poderoso navegante, emblema del coraje y la fortaleza masculina; Krito, filósofo andrógino, símbolo de la racionalidad y la consistencia de carácter, y una mujer esquiva y sensual que posee la facultad de cambiar de nombre. Una mujer que entrará en la vida de Ahram cuando Anoptis, el gran mayordomo de la villa de Tanuris, la compre para su señor en el mercado de esclavas. Ahram se enamora súbitamente de la chica, que dice llamarse Irenia, y entre ambos arranca una intensa historia de amor cargada de sensualidad.Pero, como no tardará en intuir Krito, detrás de Irenia se ocultan circunstancias misteriosas, más enigmáticas que su rescate en la costa por unos pescadores de coral, más incluso que su iniciación en un grupo de mujeres religiosas que creen en la naturaleza femenina de Jesús: una transformación fantástica y casi blasfema que podría llevar la historia de amor con Ahram más allá de la muerte o destruirla antes de tiempo.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Unfinished",
    "Novels",
    "Spanish Literature",
    "Fantasy",
    "Literature"
  ],
  "author": "José Luis Sampedro",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/6390997-la-vieja-sirena"
}