{
  "title": "Hunting Party",
  "description": "Bondage Erotica. Stan, Jack and Mike set off for a week of hunting in the wilderness, but it's not just guns and backpacks that they bring along. Vacations like this require some nighttime entertainment too. As they've done in the past, they hire a pretty young female to service their sexual needs. This year it's Susan, a pretty blonde coed who's in need of some extra cash. Susan has been warned to expect some kinky sex, but it comes on all too fast for this wary newbie. Heading out for a remote hunting lodge, the company makes camp for the night in the out-of-doors, where the three men order Susan to strip out of her hiking clothes. If she wants the cash, the reluctant girl had better obey. Once the trio gets its first look at the voluptuous female, they name her 'Barbie', then take turns breaking her in. The next morning, Barbie is shocked to find herself hiking to the hunting lodge on the end of a leash...naked, collared, cuffed and barefoot. Joining her is another hired female, Toy, and two more hunters. Once at the lodge, both women discover that their week will include slave training in addition to all the straight and oral sex the men demand. As 'Barbie', Susan finds she can slip more easily into the role of submissive captive and begins to discover unexpected pleasure in the rough treatment. When the bound and collared Barbie is made to watch a helpless Toy get an introduction to anal sex, she's initially horrified by the brutal display. But seeing how Toy is beginning to enjoy it, the increasingly submissive Barbie decides to make a surprising proposal to her captors. What she wants is to get invited back for next year's hunting trip. But will baiting them with anal sex do the trick? It will break the men's long-standing rule of no repeats, but she's sure going to give it a try. Graphic sexual content.",
  "genres": [
    "BDSM",
    "Erotica",
    "Menage"
  ],
  "author": "S.J. Lewis",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/6392085-hunting-party"
}