{
  "title": "Travis",
  "description": "Travis Hale has it all. An important role as the chief of police in the idyllic town of Pelion, Maine. Looks that regularly and consistently make women fall at his feet. Two nephews and a niece he adores, and a family who’s mostly forgiven him after a series of unfortunate decisions years before. Perhaps his past is riddled with regrets and misguided choices, but his future looks bright and limitless.Until the new guy in town crosses him in a way both shocking and indefensible.A guy who, as it turns out, has a sister who may be equally as disastrous to Travis’s well-ordered plans, though in an altogether different manner. Not that there’s any real risk of him falling for the smoothie-making, birdseed-eating wild woman. She’s not even his type. A plant lady from California with a head of unruly curls and an equally messy past. More than that, she’s only in town for the summer, busy mooning over perfect-in-every-way Gage Buchanan.And if Travis knows anything, it’s that he refuses to be second best. Ever again.Haven Torres’s life fell apart. Or more to the point, it burned to the ground. At the time, it seemed like a solid idea to jump in her car, her brother a mostly-willing co-pilot, and embark on a cross-country adventure.When they land jobs at an exclusive tennis and golf club in a picturesque lake town in Maine, Haven’s hopeful it might prove a summer to remember. Especially if she can catch the attention of the most eligible bachelor in town and her current crush. Even the kindest, most upstanding, perfect of men aren’t opposed to summer flings, right?But when she meets the local police chief—all swagger and arrogance—and learns of her brother’s scandalous misdeed, she knows that Pelion is just another town where their stay is best . . . short-lived. Still, she and Travis strike up an unlikely friendship and Haven sees that the gorgeous lawman isn’t only easy on the eyes, but he has . . . layers. Not that she’s going to peel any of them. He’s only her friend. A friend willing to scratch her back, if she scratches his.It seems simple enough. She’ll help him make her brother sweat a little. And he’ll help her win over Gage. But before either Travis or Haven knows it, simple turns complicated, friendship gets flipped on its ear, passion faces down perfection, and they both discover that sometimes you have to lose it all to find exactly what you need.",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Contemporary Romance",
    "Contemporary",
    "Small Town Romance",
    "Forced Proximity",
    "Adult"
  ],
  "author": "Mia Sheridan",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/63907967-travis"
}