{
  "title": "Conflict of Intrigues: The Marylebone Intersection",
  "description": "RIPPED FROM THE HEADLINES, THE 36-HOUR dash through the Marylebone Intersection in CONFLICT OF INTRIGUES is a breakneck blur between real history and fictional mystery.This gateway novel into the INTERSECTION spy saga is a sensual psychological thriller of unconventional espionage clocking an inexplicable attraction between former intelligencers fanning a firestorm of conflicting interests that could ultimately burn more than just the two who ignited it.An accelerating pace-setter for the offbeat, tri-trilogy INTERSECTION series, CONFLICT OF INTRIGUES is driven by the sharp-tongued wit and waggish dysfunction of catalytic characters who will keep readers guessing… and laughing from one Intersection to the next!What sparked this intersection in Marylebone?The relentless ring from an unfamiliar number and the hushed voice on the other end….\"The microchip is back in play.\"Six words. Meaningless to anyone else. To Dr Jon Markston—former British Army Captain, now Royal Military Academy Sandhurst professor—those words are fraught with disturbing insinuations.Hearing an unknown caller resurrect a ten-year-old operation was troubling enough. The hint of a WikiLeaks-style exposure of classified intelligence that was once in his care is thoroughly alarming. Jon had walked away from the British Army Intelligence Corps… a life of secrets… for good reason. Now, the stakes may be too high not to step back in.But Jon is not the only one to be spooked by his old ghost.Irish-born American executive Katherine McKenna relegated her life in the line of fire to the rear-view mirror nearly a decade ago when she moved to London to take a publishing job. When an innocuous detour upends her firmly rote agenda, however, it also resurrects the haunted past she believed long buried.The intersection… a London bookshop.The collision… the professor and the publisher.The impact… a CONFLICT OF INTRIGUES.",
  "genres": [],
  "author": "ML Yost",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/63922836-conflict-of-intrigues"
}