{
  "title": "Stepbrother Daddy's Christmas Eve",
  "description": "Four thirty a.m I’m awake. By five I’ve done enough crunches and burpees to make Marines want pigtails and their mommy. My abs are perfect. Just like everything I surround myself with. But I’m never out of breath. I never get tired. My face cream is a custom blend, made in France. I bought the company. I have a penthouse apartment that overlooks the bay. I watch beach-goers through a telescope sometimes, most often before I head to the office for a meeting. Always with a crease of a smile, never really showing what I’m thinking or feeling. Not even to myself. The name on their designer swimwear, sunglasses and bags is often my own. The family name, Ellis. It’s a perfect life I’ve made. The family name is one thing, its fortune another. And it’s mostly due to me. But something happened recently. Something I couldn't change. Something I couldn't stop. Yet. My father re-married. Some Southern belle from one of our factories of all places. Eloped and made it official. So now I have a step family… Worse than that, they’re poor. Hole in the ground, dirt on the cheeks poor. I know how much we pay our workers. I’m head of finance and legal at Ellis. What I don’t count on though is the Christmas event where my father insists I make an appearance. I usually fly south for winter. The cold is unnatural for me. Makes me feel… nothing. I prefer Tahiti. This is going to be a hi and bye thing on the way to the airport. The jet is waiting. Father’s memo instructed me to bring a gift for his new step-daughter. My new step sister, Eve. Christmas Eve with Eve, I get the humor. It’s also her birthday. So I picked out a little something. She’s never had a real father either. No daddy means she’ll be right at home with a stepfather and stepbrother to look out for her. So far so good. Smile, nod. Happy birthday, Merry Christmas. Leave. See you all at the court case where I have the marriage annulled and take over the company for myself. Wrong. Everything I thought I knew is wrong. Everything I do or have is wrong. Everything I thought I was is turned upside down as soon as I set eyes on her. Eve… Eighteen years old and my step sister. Also the only thing I want, mainly because I know I can’t have her. But if I’m gonna take a billion dollar company back from my father, dismantle his own recent marriage and make him pay for making me who I am, then what better reason than to keep the greatest prize of all? I can have my cake and eat it to. Literally. But one single word from Eve changes everything. And only because it’s the one word I’ve longed to hear. From her lips, it’s all I’ll ever need. And it’s a special need I intend to keep within arm’s reach. Forever.",
  "genres": [
    "Christmas"
  ],
  "author": "Lena Little",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/63946260-stepbrother-daddy-s-christmas-eve"
}