{
  "title": "Anthropology of an American Girl",
  "description": "A moving depiction of the transformative power of first love, Hamann's first novel follows Eveline Auerbach from her high school years in East Hampton, New York, in the 1970s through her early adulthood in the moneyed, high-pressured Manhattan of the 1980s.Self-published in 2003, Hilary Thayer Hamann’s Anthropology of an American Girl touched a nerve among readers, who identified with the sexual and intellectual awakening of its heroine, a young woman on the brink of adulthood. A moving depiction of the transformative power of first love, Hamann’s first novel follows Eveline Auerbach from her high school years in East Hampton, New York, in the 1970s through her early adulthood in the moneyed, high-pressured Manhattan of the 1980s. Centering on Evie’s fragile relationship with her family and her thwarted love affair with Harrison Rourke, a professional boxer, the novel is both a love story and an exploration of the difficulty of finding one’s place in the world. As Evie surrenders to the dazzling emotional highs of love and the crippling loneliness of heartbreak, she strives to reconcile her identity with the constraints that all relationships—whether those familial or romantic, uplifting to the spirit or quietly detrimental—inherently place on us. Though she stumbles and strains against social conventions, Evie remains a strong yet sensitive observer of the world around her, often finding beauty and meaning in unexpected places. Newly edited and revised since its original publication, Anthropology of an American Girl is an extraordinary piece of writing, original in its vision and thrilling in its execution.",
  "genres": [
    "Fiction",
    "Young Adult",
    "Coming Of Age",
    "Contemporary",
    "Literary Fiction",
    "Romance",
    "Novels"
  ],
  "author": "Hilary Thayer Hamann",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/6393809-anthropology-of-an-american-girl"
}