{
  "title": "Stop Presenting! Start Succeeding",
  "description": "From the years ago, like so many others, I left the comfortable embrace of the academic world with my diploma in hand and entered the corporate world. The adjustment was smooth, my education in Chemistry didn’t fail me, and I found success in my early positions in the pharmaceutical industry. With success, came a greater need for me to speak in front of my peers and management. As is often the case in today’s world, I found that my success was becoming more and more tied to my ability to stand in a dimly lit room, and express or defend my work, in 30 minutes with 30 slides.Unlike my scientific education, I found that the training available to help me become a better presenter was nowhere near as complete or effective as I needed, until I came across Stop Presenting! The clear and concise methodology you will find in this book quickly helped me become more effective. I immediately started relating to my audiences better, found myself more comfortable, and was more effective at getting my message across. There is a measure of genius in the simplicity of creating presentations that “answer questions” versus “spewing data”. I believe you will find yourself, as I did, more at ease in front of the room, because it becomes more of a conversation than a presentation. Nothing could be easier. I also found that the techniques in this book work in every communication medium; whether it’s a live presentation, conference call, or a video conference.There is no question that my ability to present and speak in front of groups has allowed my knowledge and hard work to shine. In turn, it has provided me with countless job opportunities. I’m now the Managing Partner of a very successful consulting firm that works with some of the largest pharmaceutical companies in the world. Happily, I can tell you that I now love to be the person in front of the room, but I’ve learned to leave the lights on and only use a handful of slides. Thanks Brian for writing such a helpful book.Valarie Hegarty, M.S.Managing Partner, Innovative Strategy LLC",
  "genres": [
    "Business"
  ],
  "author": "Brian J. Boeheim",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/6394355-stop-presenting-start-succeeding"
}