{
  "title": "Mother Tongue: The Surprising History of Women's Words",
  "description": "An enlightening linguistic journey through a thousand years of feminist language--and what we can learn from the vivid vocabulary English once had for women's bodies, experiences, and sexualitySo many of the words we use to articulate the experiences women share feel awkward or alien. Medical terms are scrupulously accurate but antiseptic. Slang and obscenities have shock value, yet they perpetuate taboos. Where are the plain, honest words for the experiences that women encounter in their daily lives?Mother Tongue is a historical investigation of feminist language and thought, from the dawn of Old English to the present day. Dr. Jenni Nuttall guides readers through the evolution of words we have used to describe female bodies, menstruation, women's sexuality, the consequences of male violence, childbirth, women's paid and unpaid work, and gender. Along the way, she challenges our modern language's ability to insightfully articulate women's shared experiences by examining the long-forgotten words once used in English for female sexual and reproductive organs. Nuttall also tells the story of words like womb and breast, whose meanings have changed over time, as well as how anatomical words such as hysteria and hysterical came to have such loaded legacies.Inspired by today's heated debates about words like womxn and menstruators--and also by more personal conversations between her and her teenage daughter--Nuttall describes the profound transformation of the English language. In the process, she unearths some surprisingly progressive thinking that challenges our assumptions about the past--and, in some cases, puts our twenty-first-century society to shame.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Language",
    "Linguistics",
    "Womens",
    "Audiobook"
  ],
  "author": "Jenni  Nuttall",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/63946906-mother-tongue"
}