{
  "title": "The Golden Mean",
  "description": "On the orders of his boyhood friend, now King Philip of Macedon, Aristotle postpones his dreams of succeeding Plato as leader of the Academy in Athens and reluctantly arrives in the Macedonian capital of Pella to tutor the king’s adolescent sons. An early illness has left one son with the intellect of a child; the other is destined for greatness but struggles between a keen mind that craves instruction and the pressures of a society that demands his prowess as a soldier.  Initially Aristotle hopes for a short stay in what he considers the brutal backwater of his childhood. But, as a man of relentless curiosity and reason, Aristotle warms to the challenge of instructing his young charges, particularly Alexander, in whom he recognizes a kindred spirit, an engaged, questioning mind coupled with a unique sense of position and destiny. Aristotle struggles to match his ideas against the warrior culture that is Alexander’s birthright. He feels that teaching this startling, charming, sometimes horrifying boy is a desperate necessity. And that what the boy – thrown before his time onto his father’s battlefields – needs most is to learn the golden mean, that elusive balance between extremes that Aristotle hopes will mitigate the boy’s will to conquer. Aristotle struggles to inspire balance in Alexander, and he finds he must also play a cat-and-mouse game of power and influence with Philip in order to manage his own ambitions. As Alexander’s position as Philip’s heir strengthens and his victories on the battlefield mount, Aristotle’s attempts to instruct him are honoured, but increasingly unheeded. And despite several troubling incidents on the field of battle, Alexander remains steadfast in his desire to further the reach of his empire to all known and unknown corners of the world, rendering the intellectual pursuits Aristotle offers increasingly irrelevant. Exploring this fabled time and place, Annabel Lyon tells her story in the earthy, frank, and perceptive voice of Aristotle himself. With sensual and muscular prose, she explores how Aristotle’s genius touched the boy who would conquer the known world. And she reveals how we still live with the ghosts of both men.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Canada",
    "Historical",
    "Philosophy",
    "Book Club",
    "Greece"
  ],
  "author": "Annabel Lyon",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/6396579-the-golden-mean"
}