{
  "title": "The Peasant Prince: Thaddeus Kosciuszko and the Age of Revolution",
  "description": "Thaddeus Kosciuszko, a Polish-Lithuanian born in 1746, was one of the most important figures of the modern world. Fleeing his homeland after a death sentence was placed on his head (when he dared court a woman above his station), he came to America one month after the signing of the Declaration of Independence, literally showing up on Benjamin Franklin’s doorstep in Philadelphia with little more than a revolutionary spirit and a genius for engineering. Entering the fray as a volunteer in the war effort, he quickly proved his capabilities and became the most talented engineer of the Continental Army. Kosciuszko went on to construct the fortifications for Philadelphia, devise battle plans that were integral to the American victory at the pivotal Battle of Saratoga, and designed the plans for Fortress West Point—the same plans that were stolen by Benedict Arnold. Then, seeking new challenges, Kosciuszko asked for a transfer to the Southern Army, where he oversaw a ring of African-American spies.A lifelong champion of the common man and woman, he was ahead of his time in advocating tolerance and standing up for the rights of slaves, Native Americans, women, serfs, and Jews. Following the end of the war, Kosciuszko returned to Poland and was a leading figure in that nation’s Constitutional movement. He became Commander in Chief of the Polish Army and valiantly led a defense against a Russian invasion, and in 1794 he led what was dubbed the Kosciuszko Uprising—a revolt of Polish-Lithuanian forces against the Russian occupiers. Captured during the revolt, he was ultimately pardoned by Russia’s Paul I and lived the remainder of his life as an international celebrity and a vocal proponent for human rights. Thomas Jefferson, with whom Kosciuszko had an ongoing correspondence on the immorality of slaveholding, called him “as pure a son of liberty as I have ever known.” A lifelong bachelor with a knack for getting involved in doomed relationships, Kosciuszko navigated the tricky worlds of royal intrigue and romance while staying true to his ultimate passion—the pursuit of freedom for all. This definitive and exhaustively researched biography fills a long-standing gap in historical literature with its account of a dashing and inspiring revolutionary figure.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Poland",
    "European History",
    "American Revolution",
    "Military History"
  ],
  "author": "Alex Storozynski",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/6399604-the-peasant-prince"
}