{
  "title": "The Little Dictionary of Fashion: A Guide to Dress Sense for Every Woman",
  "description": "Christian Dior reveals the secrets of style in The Little Dictionary of Fashion , a charming, indispensable guide that covers everything from what to wear to a wedding and how to tie a scarf to how to walk with grace. These are timeless tips with something special for every woman.“Much has been written about fashion, in all its aspects, but I do not think any couturier has ever before attempted to compile a dictionary on the subject. Of course, it would take volumes to cover the entire field of Fashion, but I have compiled a book which I think is neither too long, so that it becomes tedious, nor too short so that it seems insufficient. . . . I think it should be of great practical use to the women of today.” —from the introductionChristian Dior’s taste, style, and expertise ensures every girl and woman will know the three fundamentals of simplicity, grooming, and good taste. This A to Z provides thoughtful advice and background on each topic. In “A” alone you will find advice about Accent, Accessories, Adaptation, Afternoon Frocks, Age, and more!Some things never go out of beauty and style among them. Here you will find advice that is as useful today as it was when first put on paper by one of the greatest names in French fashion, the master designer himself. First published in the 1950s, and filled with timeless advice, this landmark edition was published for the Victoria and Albert Museum’s Golden Age of Couture exhibition celebrating the 50th anniversary of Dior’s “New Look,” and illustrated with delightful photographs and drawings. This handbag-size classic is the perfect gift book for any style-conscious woman.",
  "genres": [
    "Fashion",
    "Nonfiction",
    "Art",
    "Design",
    "Self Help",
    "Reference",
    "France"
  ],
  "author": "Christian Dior",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/1295179.The_Little_Dictionary_of_Fashion"
}