{
  "title": "Space Grunts",
  "description": "Space Grunts is the third anthology of the Full-Throttle Space Tales series. Edited by Dayton Ward, Space Grunts contains 18 hard-hitting tales of soldiers in space, by established and rising-star authors. Dispatches from the front lines contained in this volume: \"98 Hill\" by Julie McGalliard: A young soldier far from home writes a letter to her mother, describing the overwhelming experience of fighting an enemy on a distant planet. \"The Thing with Private Leon's Face\" by David Boop: A mysterious entity takes on the form of a dead soldier, bringing with it a harsh message for humanity. \"Blowback\" by Derek Tyler Attico: A genetically-engineered subspecies of Humanity has finally had enough of being second class citizens. Time to send in the Marines! \"Rush\" by Jeff D. Jacques: In the aftermath of a devastating ground battle, a lone soldier discovers there's more to the enemy than meets the eye. \"Price of Command\" by Irene Radford: Continuing the adventures of Katie Talbet, younger sister of the O'Hara brothers from the Stargods Trilogy, when she is asked to betray the outlawed family she has just found and learned to love after a twenty-year separation. \"Target Market\" by James Swallow: Near-future war is big business, and big ratings! \"Unchained\" by Selina Rosen: Stashes was the planet of the damned; at least that's what it was called by the soldiers who got sent there...those who survived, anyway. \"It's Not A Game\" by Jean Johnson: For a soldier, racing through a forest is never a game. \"Truth Metric\" by Geoffrey Thorne: A commanding officer faces the unpleasant duty of notifying a parent about the death of their son, and explaining how and why he died. \"Finders Keepers\" by Scott Pearson: Unknown aliens attack the starship Alliance and render the entire crew unconscious...except for a lone Marine who finds herself trapped in a deadly game of cat-and-mouse with a single intruder who has friends on the way. \"Who Stand and Wait\" by Bradley H. Sinor and Susan P. Sinor: A soldier returns home after a long deployment, only to find that things are most certainly not the way he left them. \"An Assessment of the Incident at Camp Righteous\" by Nayad A. Monroe: A theocracy plots damage control over a political disaster within a human-run prison camp on an occupied planet. \"Flashback\" by Anne Stringer and Jason McDowell: A soldier on the run for murder escapes Earth and joins a far-flung foreign legion. \"Granny's Grunts\" by Alan L. Lickiss: What happens when your daughter is captured by aliens? If you're a retired soldier whose past exploits are the stuff of legend, then you go round up your old squad and go get her yourself. \"Shin-Gi-Tai\" by Robin Wayne Bailey: See what a hardened warrior and her alien lover will do to stop a generations-long war which has all but destroyed both sides. \"Across the Endless Sea\" by John Coffren: The term \"lifer\" takes on a whole new meaning as one soldier volunteers for a decades-long stealth mission into enemy territory; the vanguard for a massive invasion...of Earth! \"Widow's Weeds\" by Kirsten Beyer: Colleen Conway is no longer the wife of a military officer. Now, she's a military widow, and she has a few things to say about that. \"A Fresh Perspective\" by Dayton Ward: An alien race comes calling, interested in whatever resources it can take from Earth, and unimpressed with any resistance which might be offered by anyone already living there.",
  "genres": [
    "Anthologies",
    "Science Fiction"
  ],
  "author": "Derek Tyler Attico",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/6399299-space-grunts"
}