{
  "title": "School of Woke: How Critical Race Theory Infiltrated American Schools and Why We Must Reclaim Them",
  "description": "From one of America’s most relentless critics of Critical Race Theory comes this far-reaching, on-the-ground investigation of how CRT infiltrated our public schools and transformed them into activism factories—with disastrous results.Awareness of the rise of Critical Race Theory (CRT) in public schools and how it has shaped our education system took the U.S. by storm over the last few years. Parents truly became aware for the first time how deeply entrenched CRT was in the classrooms, and their eyes were opened to the insidious agenda thoroughly embedded in public schools. As a result, CRT and parental rights in education became some of the most explosive issues facing Americans today. Kenny Xu is a perceptive and relentless critic of CRT and our culture’s war on meritocracy. And now, in School of Woke , Xu exposes how CRT is transforming public schools and having a destructive impact on our children’s education—and their future. In School of Woke , Xu provides historical context to the rise of Critical Race Theory in education, tracing it back to elite graduate schools in the 1970s and showing how the ideology became institutionalized and credentialed. Xu covers the battles taking place in the most problematic and contested school districts in the nation, including Loudoun and Fairfax County Public Schools in Northern Virginia and Santa Barbara High School in California. He also exposes the lucrative business model behind the diversity consulting industrial complex that is instrumental in the curricular wars, revealing how educators and administrators have been gaslighting the public about the prevalence of this radical ideology in the classrooms, where children as young as five are being segregated in the classroom by race and are being taught that whiteness is inherently evil. A work of colorful reportage, historical analysis, and cultural commentary, School of Woke reveals what it will take to extricate our next generation from the destructive trends in our once-vaunted public school education system.",
  "genres": [
    "Nonfiction",
    "Politics"
  ],
  "author": "Kenny Xu",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/64005310-school-of-woke"
}