{
  "title": "Green Metropolis: Why Living Smaller, Living Closer, and Driving Less are the Keys to Sustainability",
  "description": "Read David Owen's posts on the Penguin Blog.A challenging, controversial, and highly readable look at our lives, our world, and our future.In this remarkable challenge to conventional thinking about the environment, David Owen argues that the greenest community in the United States is not Portland, Oregon, or Snowmass, Colorado, but New York, New York.Most Americans think of crowded cities as ecological nightmares, as wastelands of concrete and garbage and diesel fumes and traffic jams. Yet residents of compact urban centers, Owen shows, individually consume less oil, electricity, and water than other Americans. They live in smaller spaces, discard less trash, and, most important of all, spend far less time in automobiles. Residents of Manhattan— the most densely populated place in North America —rank first in public-transit use and last in percapita greenhouse-gas production, and they consume gasoline at a rate that the country as a whole hasn’t matched since the mid-1920s, when the most widely owned car in the United States was the Ford Model T. They are also among the only people in the United States for whom walking is still an important means of daily transportation.These achievements are not accidents. Spreading people thinly across the countryside may make them feel green, but it doesn’t reduce the damage they do to the environment. In fact, it increases the damage, while also making the problems they cause harder to see and to address. Owen contends that the environmental problem we face, at the current stage of our assault on the world’s nonrenewable resources, is not how to make teeming cities more like the pristine countryside. The problem is how to make other settled places more like Manhattan, whose residents presently come closer than any other Americans to meeting environmental goals that all of us, eventually, will have to come to terms with.",
  "genres": [
    "Nonfiction",
    "Urban Planning",
    "Urbanism",
    "Sustainability",
    "Environment",
    "Architecture",
    "Cities"
  ],
  "author": "David                  Owen",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/6402548-green-metropolis"
}