{
  "title": "Romans to Jude - Precise Christian Scripture Revealed",
  "description": "Have you ever wanted to just one day sit down to read the Bible and actually “get” what it was saying? What if the most misunderstood book in the entire world unearthed its entire truth to you? How AMAZING would that be? Throughout history, primitive and modern cultures alike have all used levels of meaning to pass on knowledge. The Bible is one such body of knowledge that has been passed down to most of us on a literal level. However, in my quest for enlightenment, I realized that literal levels of meaning had far less to do with what the original gospel writers intended to share when they first inscribed the words millennia ago. Myths, parables, and teaching stories were never meant to be taken literally nor were they supposed to hold any historical merit. Rather the literal levels were designed to hold a higher meaning, which could only be revealed to the initiated, or those who were able to think beyond the literal unto a higher psychological level. Whether you’re a new seeker or a long-time reader of the Bible, my new book Romans to Jude – Precise Christian Scripture will be the key to helping you finally graduate from the literal meaning of the New Testament on into a higher, more accurate knowledge of Biblical truth. The days of the Bible being the most mis-understood book ever published have come to an end. Here is your chance to become a master of Christian literature and a bona fide steward of the mystery. The time has come for us all to finally see with clarity. In addition to challenging Christians to lay aside doctrines, however deeply ingrained, the author offers insightful, step-by-step \"how to\" strategies to help readers discern the text of the New Testament with greater accuracy for a more sound and sober application. Romans to Jude - Precise Christian Scripture Revealed is paving the way for Christians of all races and denominations around the world to remove the restrictive veil of doctrine, become enlightened as never before, and get on with believing the authentic gospel of Jesus Christ. \"Long before there was ever a King James Version of the Bible, there was a gospel truth...and long before doctrines and denominations, the preeminence of the gospel was already ripe to harvest. Before man had ever thought about creating symbols and doctrines to represent spiritual concepts, there was a gospel.\" C.White",
  "genres": [],
  "author": "Chandel L. White",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/12952623-romans-to-jude---precise-christian-scripture-revealed"
}