{
  "title": "Sojourner Truth's America",
  "description": "This fascinating biography tells the story of nineteenth-century America through the life of one of its most charismatic and influential Sojourner Truth. In an in-depth account of this amazing activist, Margaret Washington unravels Sojourner Truth's world within the broader panorama of African American slavery and the nation's most significant reform era. Born into bondage among the Hudson Valley Dutch in Ulster County, New York, Isabella was sold several times, married, and bore five children before fleeing in 1826 with her infant daughter one year before New York slavery was abolished. In 1829, she moved to New York City, where she worked as a domestic, preached, joined a religious commune, and then in 1843 had an epiphany. Changing her name to Sojourner Truth, she began traveling the country as a champion of the downtrodden and a spokeswoman for equality by promoting Christianity, abolitionism, and women's rights. Gifted in verbal eloquence, wit, and biblical knowledge, Sojourner Truth possessed an earthy, imaginative, homespun personality that won her many friends and admirers and made her one of the most popular and quoted reformers of her times. Washington's biography of this remarkable figure considers many facets of Sojourner Truth's life to explain how she became one of the greatest activists in American history, including her African and Dutch religious heritage; her experiences of slavery within contexts of labor, domesticity, and patriarchy; and her profoundly personal sense of justice and intuitive integrity. Organized chronologically into three distinct eras of Truth's life, Sojourner Truth's America examines the complex dynamics of her times, beginning with the transnational contours of her spirituality and early life as Isabella and her embroilments in legal controversy. Truth's awakening during nineteenth-century America's progressive surge then propelled her ascendancy as a rousing preacher and political orator despite her inability to read and write. Throughout the book, Washington explores Truth's passionate commitment to family and community, including her vision for a beloved community that extended beyond race, gender, and socioeconomic condition and embraced a common humanity. For Sojourner Truth, the significant model for such communalism was a primitive, prophetic Christianity. Illustrated with dozens of images of Truth and her contemporaries, Sojourner Truth's America draws a delicate and compelling balance between Sojourner Truth's personal motivations and the influences of her historical context. Washington provides important insights into the turbulent cultural and political climate of the age while also separating the many myths from the facts concerning this legendary American figure.",
  "genres": [
    "Nonfiction",
    "American History",
    "History",
    "Biography"
  ],
  "author": "Margaret Washington",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/6404229-sojourner-truth-s-america"
}