{
  "title": "Celebration of Discipline: The Path to Spiritual Growth",
  "description": "Hailed by many as the best modern book on Christian spirituality, Celebration of Discipline has helped more than one million seekers discover a richer spiritual life infused with joy, peace, and a deeper understanding of God. Celebration of Discipline explores the 'classic disciplines,' or central spiritual practices, of the Christian faith. Along the way, Foster shows that it is only by and through these practices that the true path to spiritual growth can be found. Dividing the disciplines into three movements of the Spirit, Foster shows how each of these areas contribute to a more balanced spiritual life. The inward disciplines of meditation, prayer, fasting, and study offer avenues of personal examination and change. The outward disciplines of simplicity, solitude, submission, and service help prepare us to make the world a better place. The corporate disciplines of confession, worship, guidance, and celebration bring us nearer to one another and to God. Foster provides a wealth of examples demonstrating how these disciplines can become part of our daily activities--and how they can help us shed our superficial habits and 'bring the abundance of God into our lives.' He offers crucial new insights on simplicity, demonstrating how the biblical view of simplicity, properly understood and applied, brings joy and balance to our inward and outward lives and 'sets us free to enjoy the provision of God as a gift that can be shared with others.' The discussion of celebration, often the most neglected of the disciplines, shows its critical importance, for it stands at the heart of the way to Christ. Celebration of discipline will help motivate Christians everywhere to embark on a journey of prayer and spiritual growth.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Christianity",
    "Theology",
    "Faith",
    "Christian Living",
    "Spirituality"
  ],
  "author": "Richard J. Foster",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/64023.Celebration_of_Discipline"
}