{
  "title": "Anonymous Rex / Casual Rex",
  "description": "Anonymous Rex will soon be a television movie event on the Sci-Fi channel starring Isaac Hayes and Faye Dunaway!  Premieres Saturday, November 13th. For more information visit the official Sci-Fi Channel website... Anonymous Vincent Rubio, a Los Angeles private investigator, is down on his He's out of work. His car's been repossessed. His partner has died under mysterious circumstances. And his tail just won't stay put. Vincent is a dinosaur—a Velociraptor, to be precise. It seems the dinosaurs faked their extinction 65 million years ago and still roam the earth, disguised in convincing latex costumes that help them blend perfectly into human society. A heightened sense of smell allows the dinos to detect one another—Vincent's got an odor like a tasty Cuban cigar! When Vincent is called to investigate a two-bit case of arson at a hip dino nightclub, he discovers something much more sinister, which lures him back to New York City—the scene of his partner's death and a dangerous nexus of dinosaur and human intermingling. Will Vincent solve the mystery of his partner's death? Will a gorgeous blond chanteuse discover his true identity, jeopardizing both their lives? Will Vincent be able to conquer his dangerous addiction to basil, or will he wind up in Herbaholics Anonymous? Will he find true love, or resort to crumpled issues of Stegolicious?. Somewhere between Jurassic Park and L.A. Confidential lies Eric Garcia's Anonymous Rex , one of the smartest, wittiest, and most entertaining debuts this side of the Ice Age. Casual Rex : In 1999, Eric Garcia made his mark with one of the most striking mystery debuts of the year, Anonymous Rex , hailed as a dino-mite detective yarn by People , inventive and imaginative by USA Today , and a fresh and antic comic thriller by The Seattle Times . Now, with Casual Rex , the sharpest dinosaur-detective in Los Angeles is back, funnier and grittier than ever, for the next tale in this acclaimed series. Vincent Rubio is a private eye, working the angles in Los Angeles with his partner, Ernie. They've got the usual problems bills, bum cases, woman troubles. But being dinosaurs is not a problem, as long as their latex disguises fit properly. Not all dinosaurs agree. Some have joined a mysterious back-to-basics movement led by a beautiful and beguiling Velociraptor to help dinosaurs find themselves, let their tails hang out, and roam about as they really are. When a member of this cult dies under suspicious circumstances, Vincent and Ernie must investigate, while simultaneously handling the case of the missing Mussolini the theft of a rare and priceless prosthetic penis treasured in the dinosaur community. With Casual Rex , Eric Garcia takes readers even more deeply into this warped underworld and succeeds in making it all believable. The result is a novel that is as hilarious and entertaining as it is original.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Mystery",
    "Humor"
  ],
  "author": "Eric Garcia",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/640722.Anonymous_Rex_Casual_Rex"
}