{
  "title": "Wish I Could Be There: Notes From a Phobic Life",
  "description": "Allen Shawn is afraid of many things, including heights, water, fields, parking lots, tunnels, and unknown roads. He avoids taking subways, using elevators, or crossing bridges—in short, he is agoraphobic, which means he is afraid of both public spaces and of any form of isolation. part memori, part scientific inquiry, part meditation, Wish I Could Be There is a brave book about the experience of being afraid.The search to understand his own crippling condition led Shawn into the world of people who study brains and human behavior; at the same time, he looked back to clues from his own childhood. He grew up in one of America's premier literary families; his father was William Shawn, editor of The New Yorker for thirty-five years, and his brother is the distinguished playwright and actor Wallace Shawn. He also has a twin sister who is autistic and who was sent to live in a special home when they were eight. His father led a double life that introduced strict taboos into the household.As he looks at his own life for the sources of his phobias, Shawn also talks to professionals who are trying to decode the ways the human brain—and mind—works. These include researchers who are mapping the physiology of fear and psychologists and psychiatrists still wrestling with the mystery of how we form and change our habits of thought and behavior. Shawn deftly moves back and forth between science and personal history as he tries to solve the psychological and biological puzzles that have plagued him for so long. In doing so, he offers poignant insights into the role of pain, the nature of fear, and the definition of normality. We can all find ourselves in some part of his story.Allen Shawn's droll, probing, and honest book explores the mystery of the many ways we become who we are, whether through our upbringing, our genetic makeup, or our own choices. From inside the isolation of fear, he confronts the universal struggle to face our demons.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Psychology",
    "Mental Health",
    "Mental Illness",
    "Biography Memoir",
    "Biography"
  ],
  "author": "Allen Shawn",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/129532.Wish_I_Could_Be_There"
}