{
  "title": "Colorado Ghost Towns and Mining Camps",
  "description": "Prospectors lured to the West in hopes of striking rich settled a thousand towns in the Colorado mountains. The cry of “Gold!” or “Silver!” or a few flecks of color in a tin cup sent them to remote, often inhospitable locations to search for the precious metals.Close on the heels of the miners were the merchant, the gamblers, the prostitutes, the washerwomen, the capitalists, and the con men. Together they turned the mining camps into bustling towns where saloons never closed and the safest place for a man to walk after dark was down the middle of the street with a gun in each hand.Colorado Ghost Towns and Mining Camps is the first new book in more than twenty-five years to document these mountain communities. Most of the early settlers are gone, leaving few persons with any oral tradition to pass on to future generations. For many of the 147 towns and camps listed in this book, not much remains to be preserved beyond what Dallas and photographer Kendal Atchison have recorded.The book is lavishly illustrated with 290 photographs. In addition to those by Atchison and early historical photographs, rare photographs from the 1920s and 1930s are included, many never published before. Some of Atchison’s superb photographs evoke nostalgia with views of abandoned buildings deteriorating amid meadow wildflowers. Soon nothing will remain but the Colorado landscape, with the eternal mountains towering close by.The town histories are traced from their beginning in strike-it-rich excitement and glittering boom years, through the declines, to the present day. Some of these hopeful towns, such as Lulu, were deserted as quickly as they were settled, lasting barely more than a season, while a few, including Aspen and Breckenridge, are as lively today as they were a century ago. But most of them, like Animas Forks, flourished until the gold or silver played out and were abandoned, leaving a few lonely cabins or picturesque ruins. Towns such as Aspen, Crested Butte, Cripple Creek, and Breckenridge have lived on to become popular ski resorts, and these places warrant additional vignettes that add color and to the text.Written to inform and entertain the general reader, this book will be a delight for armchair adventurers as well as invaluable for vacationers interested in visiting the sites of these Colorado boomtowns. Most of the places are no longer shown on modern road maps, and special maps of the region have been prepared for this book.",
  "genres": [
    "History",
    "Nonfiction",
    "Travel"
  ],
  "author": "Dallas",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/640781.Colorado_Ghost_Towns_and_Mining_Camps"
}