{
  "title": "The Lady Queen: The Notorious Reign of Joanna I, Queen of Naples, Jerusalem, and Sicily",
  "description": "The riveting history of a beautiful queen, a shocking murder, a papal trial - and a reign as triumphant as any in the Middle Ages.Italy fourteenth century - Amid intrigue, betrayal, and conspiracy, Joanna I of Sicily became the only female monarch of her day to rule in her own name, and one of the most courageous women in history. Married for political advantage at the age of seven to her six-year-old Hungarian cousin, Joanna saw her brilliant, cultivated world shattered twelve years later by the brutal assassination of her husband. Accused of the murder by her powerful in-laws, Joanna was forced to flee her kingdom and stand trial for her life before the papal court at Avignon on March 15, 1348. The account of how, despite her youth and sex, she triumphed over her enemies, raised an army, and took back her realm makes for one of the most compelling sagas of any age.Joanna went on to rule for a further thirty years, weathering war, plague, and treason to become one of the most powerful and influential leaders in Italy. Dedicated to the welfare of her subjects and realm, she reduced crime, built hospitals and churches, encouraged the licensing of women physicians, and expertly navigated the dangerous complexity of papal politics. Her elegant court became a window on the century, luring some of the most important writers and artists of the period, including Giovanni Boccaccio, author of the The Decameron, and Francesco Petrarch. Her reign rivaled that of Elizabeth I in power and scope - until the violence and treachery of the medieval world ultimately betrayed her.As she did in her acclaimed Four Queens, Nancy Goldstone takes us back to the turbulent Middle Ages, and with skill and passion brings fully to life one of history's most remarkable women. Her research is impeccable, her eye for detail unerring. From the pageantry and splendor of the royal court to the ferocity of the battlefield and the intricacy of medieval politics, The Lady Queen paints a captivating portrait of medieval royalty, and reclaims the life of a woman notorious throughout history for a crime she did not commit.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Italy",
    "Historical",
    "Medieval",
    "European History"
  ],
  "author": "Nancy  Goldstone",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/6408184-the-lady-queen"
}