{
  "title": "Sylvia Browne's Journey of the Soul",
  "description": "This very special gift set includes the three books that comprise Sylvia Browne’s Journey of the Soul Book 1 God, Creation, and Tools for Life Does God exist? Was the world created, or did it evolve? Where am I in the big picture of the universe? Most people have asked these questions but have no clear answers. However, Sylvia does, and in this fascinating book, she shares her 40 years of investigation into these issues. Drawing from thousands of research sessions with Francine, her spirit guide, along with her own understanding of a number of riveting topics that are pertinent to humanity as a whole, you will have access to information that is mentally profound, spiritually moving, and eminently logical. Francine, who resides on the Other Side, lives within the presence of God and has access to a wealth of knowledge about the nature of creation. Sylvia, then, becomes the human voice for Francine and is able to share the fruits of her wisdom. We are assured that God will respond to all questions—our job is to ask the right questions and be receptive to the answers we receive. In so doing, we gain valuable tools for life! Book 2 Soul’s Perfection Sylvia and her guides help solve a great mystery in this fascinating book—namely, what is the meaning of life? Most human beings—and many teachers and great scholars— have pondered this question over the years, but there has never been a truly definitive answer. This leaves most of us with a feeling of being incomplete in some way. Here, Sylvia and her guides take you to that place within you where you can achieve a sense of intellectual and spiritual fulfillment. They explain that we are here to perfect our souls by absorbing God’s knowledge. We are the experiencing side of God, where God is the primary intellect of creation. Soul’s Perfection takes you through the complete scope of your soul’s journey, from planning each incarnation on the Other Side to making life meaningful here on Earth. If you wish to stand proudly before God some day, then the concepts discussed here will bring you wisdom, depth, and spiritual insight. Book 3 The Nature of Good and Evil We constantly see the \"senseless violence\" in our world, and it begs the \"How can an all-loving God allow this to exist?\" Indeed, many people simply reject any notion of God for this very reason. This third book in Sylvia’s Journey of the Soul series gives you the philosophical framework to understand the nature of good and evil—and the role of God in the big picture. When you see how evil originated and why it thrives in our world, you’re more prepared to face it and overcome it. Sylvia points out that you need not fear \"evil spirits\" or \"curses\"—which are merely stories bred from ignorance. And how would you like to serve as one of God’s warriors of Light? Sylvia explains how to enlist! By combining her philosophical and theological views, Sylvia creates a spiritual umbrella that rises above traditional religion. All paths that lead to knowing God have merit—Sylvia simply invites you to know Him/Her in your own way, free of dogma and fear. Millions of people have witnessed Sylvia Browne’s incredible psychic powers on TV shows such as Montel, Larry King Live, Entertainment Tonight, and Unsolved Mysteries; and she has been profiled in Cosmopolitan, People magazine, and other national media. Her on-target psychic readings have helped police solve crimes, and she astounds audiences wherever she appears. Sylvia is the author of numerous books and audios; is the president of the Sylvia Browne Corporation; and is the founder of her church, the Society of Novus Spiritus, located in Campbell, California.",
  "genres": [
    "Spirituality",
    "Nonfiction"
  ],
  "author": "Sylvia Browne",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/6408.Sylvia_Browne_s_Journey_of_the_Soul"
}