{
  "title": "Tower: A Novel",
  "description": "“Taking up the storied themes of crime fiction—loyalty and betrayal, temptation and treachery—Tower lifts and elevates them, forging a tale both barbaric and baleful, swaggering and broken-hearted. Brutal, soaring street poetry to take your breath away.”—Megan Abbott, Edgar Award–winning author of Queenpin and Bury Me Deep“A rough and profane read, with haunting echoes of a Southie of the mind.”—Daniel Woodrell, author of Winter’s Bone“Tower fulfills every promise made by the concept of this dream collaboration. Bruen and Coleman collaborate like twin sides of the same brain, making the difficult look easy --- and unforgettable, to boot. Dark, violent, frightening and touching, Tower stands as a masterpiece in the crime fiction genre.”—BookReporterAn original novel.From a rough Brooklyn neighborhood, Nick and Todd forge a lifelong bond that persists in the face of blood and betrayal. Low-level wiseguys with little ambition and less of a future, the friends become players in the destruction of an international crime syndicate stretching from the Kennedy Airport to the streets of New York, Boston, and Belfast, to the alleyways of Mexican border towns. Their paths are littered with the bodies of cops, snitches, lovers, and stone killers.In the tradition of The Long Goodbye, Mystic River, and The Departed, Tower is a powerful meditation on friendship, fate, and fatality. A twice-told tale done in the unique format of parallel narratives that intersect at deadly crossroads, Tower is like a beautifully crafted knife to the heart.Ken Bruen (The Guards, Priest) and Reed Farrel Coleman (The James Deans, Soul Patch) have each been twice nominated for the Edgar Award. They have each won the Shamus Award twice and have also either received or been nominated for the Barry, Anthony, and Macavity awards. Bruen divides his time between America and Ireland. Coleman lives on Long Island.",
  "genres": [
    "Crime",
    "Mystery",
    "Noir",
    "Fiction",
    "Thriller",
    "Ireland",
    "Irish Literature"
  ],
  "author": "Ken Bruen",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6413199-tower"
}