{
  "title": "To Heaven by Water",
  "description": "Now that his wife is dead, retired television news anchor, David Cross, believes that he is more himself than he has been for forty years. When Nancy was alive, he had secrets that he kept from her. Now he has a secret that he must keep from his children, Ed and Lucy, namely that he is in some ways happier now than he was when their mother was alive. To Heaven by Water is a touching and hilarious portrait of the Cross family, trying in their own fashion to come to terms with their loss. David knows that his children are perplexed by his increasingly compulsive behaviour while Ed's marriage to the lovely Rosalie, a former ballet dancer, is suffering strain, and Lucy is being stalked by her ex-boyfriend. Both children worry that their father will soon find a new partner. Over all three of them hangs the memory of Nancy. The book opens as David is taking time out with his brother in the Kalahari Desert, re-living his tumultuous and uplifting memories of Rome where he worked on a film with Richard Burton. Back home in London, Ed is trying to balance his affair with a young woman in his office with his real love for his wife, who is unable to conceive the child she longs for. And Lucy, who has just been voted No. 6 in the Evening News section devoted to beautiful and brainy women, is a young woman in pursuit of her real self. To Heaven by Water is a wonderful story of friendship, forgiveness and of love that comes from unexpected directions; it is an exploration of what we might hope for from this life and. in particular. the possibility of transcendence. Into the beautifully observed and subtly composed texture of this tale of middle-class London life, Justin Cartwright weaves sudden shocks that tear it apart, moments of sex and revenge that appear from a cloudless sky to take the reader's breath away.",
  "genres": [
    "Fiction",
    "Novels",
    "Family",
    "Literary Fiction",
    "Africa"
  ],
  "author": "Justin Cartwright",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/6411335-to-heaven-by-water"
}