{
  "title": "Justino, o Retirante",
  "description": "No romance “Justino, o retirante”, Odette de Barros Mott conta a história de um menino de doze anos, órfão e muito pobre, que abandona sua vida miserável no sertão nordestino e parte em busca de dias melhores.Ansioso por mudanças, o menino segue descalço com seu cão Pitó e um papagaio que fica na estrada, e leva uma pequena trouxa contendo uma par de sandálias, presente de seu pai, leva ainda, um lasco de jabá, e um pequeno pedaço de rapadura. Mais a frente, junta-se a um pequeno grupo de retirantes.A caminhada é dura, pois a sede, a fome e o choro das crianças que pedem comida são seus companheiros constantes. No percurso, o menino recorda o passado, pensa na vida, no pai, um homem de feições endurecidas pela miséria, herança recebida dos antepassados.Justino conhece o Chico Cego, violeiro e cantador que tira o seu sustento das esmolas recebidas dos corações caridosos.Os retirantes chegam a uma vila, e encaminham-se para os albergues em busca de comida, água e tratamento, tudo financiado pelo governo. Mas Chico Cego, Justino e Pitó preferem a feira da vila, nela há a festa da padroeira; há feiras, e trabalho, e Chico anima-se a tocar e cantar suas modinhas. À tardinha, procuram uma ponte para abrigo, alojam-se para o merecido descanso. A amizade entre os três vai crescendo e, logo tornam-se como uma família. Chico Cego não esconde o carinho que sente por Justino e o seu cão.O menino, por não conhecer dinheiro é enganado e roubado, pondo-se a chorar recebe, então, ajuda de dona Severina, que se sensibiliza com a situação do menino e faz o possível para ajudá-lo. Contrata-o para pequenos serviços, ensina-o a contar, a negociar na feira; em troca o menino recebe: dinheiro, comida e carinho.Dona Severina não se conforma que Justino durma embaixo da ponte, e oferece-lhe moradia. O cego recusa a oferta e parte em busca de um Beato, um homem santo, na ilusão de ficar curado de sua cegueira, deixando Justino com a dona da pensão.Justino demonstra interesse em aprender a ler, dona Severina o coloca na escola, mas na vila não há ginásio e a senhora, com pretexto de ajudar seu irmão, muda-se com menino para a cidade de São João de Caridé.O garoto conhece um sociólogo, que o incentiva com os estudos, empresta-lhe livros e lhe orienta sobre a gente sofrida daquela região.Deslumbrado com as coisas que aprende na escola, Justino quer ser médico para ajudar sua gente; ele traz consigo o conhecimento, mas é necessário aperfeiçoá-lo para que faça melhor. Seus esforços são recompensados, e é escolhido por seus companheiros para ser o orador da sua turma para grande orgulho de dona Severina que chora, emocionada. (...)Por: Lúcia Helena Gaspareti (http://www.alb.com.br/apoioprof/aprec...)",
  "genres": [
    "Classics"
  ],
  "author": "Odete de Barros Moot",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/6410892-justino-o-retirante"
}