{
  "title": "The Broken Teaglass",
  "description": "The dusty files of a venerable dictionary publisher . . . a hidden cache of coded clues . . . a story written by a phantom author . . . an unsolved murder in a gritty urban park-- all collide memorably in Emily Arsenault's magnificent debut, at once a teasing literary puzzle, an ingenious suspense novel, and an exploration of definitions: of words, of who we are, and of the stories we choose to define us.\n\nIn the maze of cubicles at Samuelson Company, editors toil away in silence, studying the English language, poring over new expressions and freshly coined words-- all in preparation for the next new edition of the Samuelson Dictionary. Among them is editorial assistant Billy Webb, just out of college, struggling to stay awake and appear competent. But there are a few distractions. His intriguing coworker Mona Minot may or may not be flirting with him. And he's starting to sense something suspicious going on beneath this company's academic facade.Mona has just made a startling discovery: a trove of puzzling citations, all taken from the same book, The Broken Teaglass. Billy and Mona soon learn that no such book exists. And the quotations from it are far too long, twisting, and bizarre for any dictionary. They read like a confessional, coyly hinting at a hidden identity, a secret liaison, a crime. As Billy and Mona ransack the office files, a chilling story begins to emerge: a story about a lonely young woman, a long-unsolved mystery, a moment of shattering violence. And as they piece together its fragments, the puzzle begins to take on bigger personal meaning for both of them, compelling them to redefine their notions of themselves and each other.Charged with wit and intelligence, set against a sweetly cautious love story, The Broken Teaglass is a tale that will delight lovers of words, lovers of mysteries, and fans of smart, funny, brilliantly inventive fiction.",
  "genres": [
    "Mystery",
    "Fiction",
    "Books About Books",
    "Mystery Thriller",
    "Contemporary",
    "Audiobook",
    "Literary Fiction"
  ],
  "author": "Emily Arsenault",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/6410327-the-broken-teaglass"
}