{
  "title": "بلدي",
  "description": "\"قريتي العزيزة تسادا!! ها أنا قد عدت إليك من ذلك العالم الضخم الذي رأى فيه والدي هذا العدد الكبير من العيوب. لقد جبته، هذا العام، ورأيت فيه الكثير من العجائب. لقد زاغت عيناي من فيض ما فيه من جمال دون أن تعرفا أين تستقران. كانتا تنتقلان من معبد رائع إلى آخر، ومن وجه إنساني رائع إلى آخر، لكني كنت أعرف أنه مهما كان الذي أراه اليوم رائعاً، فسأرى في الغد ما هو أروع منه.. فالعالم، كما تردن، لا نهاية له. فلتغفر لي معابد الهند، وأهرامات مصر، وكاتدرائيات إيطاليا، ولتغفر لي طرقات أميركا العريضة، أرصفة باريس، وحدائق إنكلترا، وجبال سويسرا، لتغفر لي نساء بولونيا واليابان وروما. لقد نعمت بالنظر إليكن، لكن قلبي يخفق بهدوء، وإذا كان خفقه قد ازداد، فليس بالقدر الذي يجف فيه فمي ويدور رأسي. فلماذا خفق قلبي الآن في صدري، حين رأيت من جديد هذه البيوت السبعين التي تأوي إلى سفوح الجبل، فغاصت عيناي ودار رأسي كأني مريض أو سكران؟ هل هذه القرية الداغستانية الصغيرة أروع من البندقية أو القاهرة أو كالكوتا؟ وهل الفتاة الآفارية التي تسير في الطريق الجبلي الضيق وهي تحمل حزمة حطب أروع من السكندنافية المشيقة؟أي تسادا! ها أنا أهيم في حقولك، وندى الصباح البارد يغسل قدمي المتعبتين. ثم لا أغسل وجهي بمياه السواقي الجبلية، بل بماء الينابيع. يقال: إذا أردت أن تشرب، فاشرب من العين. ويقال أيضاً: ووالدي كان يردد هذا: يمكن للرجل أن يرجع في حالتين: ليشرب من العين، وليقطف زهرة. وأنت عيني، يا تسادا. ها أنا ذا أركع أمامك وأنهل من ينابيعك، فلا أرتوي. ما إن أرى حجراً حتى يتراءى لي فوقه طيف شفاف. هذا الطيف هو أنا. كما كنت قبل ثلاثين عاماً. أجلس عليه وأرعى أغنامي، على رأسي قلبق ذو وبر وفي يدي عصا طويلة، والغبار يغطي رجلي. ما أن أرى طريقاً جبلياً حتى يتراءى لي فيه طيف شفاف، هذا الطيف هو أنا أيضاً، كما كنت قبل ثلاثين عاماً. لماذا أنا ذاهب إلى القرية المجاورة؟ يبدو أن والدي هو الذي أرسلني. في كل خطوة ألتقي بنفسي، بذاتي، بطفولتي، بفصول الربيع التي مرّت بي، بالأمطار والأزهار وأوراق الخريف المتساقطة.داغستان تلف البلاد المحلقة في سماء الخيال، هي أسطورة بكل ما فيها؛ بجبالها بوهادها بينابيعها وبأرضها وسمائها والأكثر برجالها الذين كثيراً ما جنح الخيال إلى تصور واحدهم بتلك السمات التي تستأثر بالنفس، بالإنسان من حيث رباطة جأشهم، وعنفوانهم.في روايته هذه يأخذ رسول حمزاتوف القارئ إلى هدأة حلم صيفي يستقر في أفيائه ليعرض عليه مشاهده المنطلقة من بلاد اسمها داغستان. يرسم الروائي خطوط شخصياته بدقة، مستحضراً بذلك تاريخ أمة اشتهر رجالها بالقوة والاستبسال والعنفوان. يسترسل الكاتب في سردياته ليشيع في نفس القارئ ومن خلال أسلوبه الرائع ذاك الحس المرهف والاندماج إلى حد التماهي مع الشخصيات ومع الكاتب نفسه لتصبح تسادا ذاك الحلم الذي يحلق دائماً في مناخاته.",
  "genres": [
    "Novels",
    "Fiction",
    "Poetry",
    "Russian Literature",
    "Unfinished",
    "Russia",
    "Literature"
  ],
  "author": "Rasul Gamzatov",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/6413374"
}