{
  "title": "Ginseng Dreams: The Secret World of America's Most Valuable Plant",
  "description": "American Ginseng has a strange and perilous history. It has one of the longest germination periods of any known species, and only two environments in the world have offered the ideal growing conditions for wild ginseng. The first was the forests of northern China, which disappeared over a millennium ago, and the sole remaining habitat is the Appalachian Mountain region of eastern North America, an area now threatened by logging and mining. Chinese legend says that ginseng is the child of lightning. The two elemental forces of water and fire fight in an eternal struggle, pouring down rain and snow and blasting the earth with lightning. If that lightning happens to strike a spring of water, the water disappears and in its place grows a ginseng plant―the fusion of yin and yang, water and fire, darkness and light, and the life force that moves the universe. American ginseng has become perhaps the most treasured of all herbal medicines, promising good health and longevity to those who consume it. Fortunes have been made and lost on the plant, which was America's first export to China―before our nation even existed. The strange, twisted, man-shaped root today commands as much as two thousand dollars a pound in the hot, noisy ginseng markets of Hong Kong, and a wealthy collector might pay as much as $10,000 for a single, perfect specimen. Ginseng The Secret World of America's Most Valuable Plant unfolds ginseng's past and its future through the stories of seven people whose lives have become inextricably bound to a huckster, a field researcher, a farmer, a ginseng \"missionary,\" a criminal investigator, a broker, and a cancer researcher. Each of these individuals brings a different perspective to the elusive root―and each is consumed by a different dream. Kristin Johannsen threads her way though remote woodlands in the Appalachians to observe the fragile plants slowly putting out leaves as part of a three-year growing cycle, during which time the ginseng is vulnerable to both poachers and growing suburban sprawl. She contrasts this with the huge commercial growing fields of Marathon County, Wisconsin, where among potato fields and paper mills, ninety percent of the country's ginseng is produced. Johannsen explores the brisk black market trade in the panacean root and the efforts to save the wild species and its native habitat, and she ends her story in the laboratory, where researchers are investigating ginseng's anti-cancer properties. An absorbing journey into the many worlds of this mysterious and potent plant, Ginseng Dreams tells the extraordinary story of America's little-known natural treasure and the spell it casts on those who seek it.",
  "genres": [
    "Nonfiction",
    "History",
    "Nature",
    "Science",
    "Plants",
    "Herbs"
  ],
  "author": "Kristin Johannsen",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/641112.Ginseng_Dreams"
}