{
  "title": "The Uses of Enchantment",
  "description": "In late afternoon on November 7, 1985, sixteen-year-old Mary Veal was abducted after field hockey practice at her all-girls New England prep school.Or was she?A few weeks later an unharmed Mary reappears as suddenly and mysteriously as she disappeared, claiming to have little memory of what happened to her. Her socially ambitious mother, a compelling if frosty woman descended from a Salem witch, is concerned that Mary has somehow been sullied by the experience and sends her to therapy with a psychologist named Dr. Hammer.Mary turns out to be a cagey and difficult patient. Dr. Hammer begins to suspect thatMary concocted her tale of abduction when he discovers its parallels with a seventeenth-century narrative of a girl who was abducted by Indians and who caused her rescuer to be hanged as a witch. Hammer, eager to further his professional reputation, decides to write a book about Mary’s faked abduction, a project her mother sanctions, because she'd rather her daughter be a liar than a rape victim.Fifteen years later, Mary has returned to Boston for her mother's funeral. Her abduction—real or imagined—has tainted many lives, including her own. When Mary finds a suggestive letter sent to her mother, she suspects her mother planned a reconciliation before her death. Thus begins a quest that requires Mary to revisit the people and places in her past.The Uses of Enchantment weaves a spell in which the reader sees how the extraordinary power of a young woman’s sexuality, and the desire to wield it, have a devastating effect on all involved. The riveting cat-and-mouse power games between doctor and patient, and between abductor and abductee, are gradually, dreamily revealed, along with the truth about what actually happened in 1985.Heidi Julavits is in full command of her considerable gifts and has crafted a dazzling narrative sure to garner her further acclaim as one of the best novelists working today.",
  "genres": [
    "Fiction",
    "Mystery",
    "Novels",
    "Contemporary",
    "Psychology",
    "Literary Fiction",
    "Thriller"
  ],
  "author": "Heidi Julavits",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/64104.The_Uses_of_Enchantment"
}