{
  "title": "True Sisters",
  "description": "In a novel based on true events, New York Times bestselling author Sandra Dallas delivers the story of four women---seeking the promise of salvation and prosperity in a new land---who come together on a harrowing journey. In 1856, Mormon converts, encouraged by Brigham Young himself, and outfitted with two-wheeled handcarts, set out on foot from Iowa City to Salt Lake City, the promised land. The Martin Handcart Company, a ragtag group of weary families headed for Zion, is the last to leave on this 1,300-mile journey. Three companies that left earlier in the year have completed their trek successfully, but for the Martin Company the trip proves disastrous. True Sisters tells the story of four women from the British Isles traveling in this group. Four women whose lives will become inextricably linked as they endure unimaginable hardships, each one testing the boundaries of her faith and learning the true meaning of survival and friendship along the way.  There's Nannie, who is traveling with her sister and brother-in-law after being abandoned on her wedding day.  There's Louisa, who's married to an overbearing church leader who she believes speaks for God.There's Jessie, who's traveling with her brothers, each one of them dreaming of the farm they will have in Zion.And finally, There's Anne, who hasn't converted to Mormonism but who has no choice but to follow her husband since he has sold everything to make the trek to Utah.Sandra Dallas has once again written a moving portrait of women surviving the unimaginable through the ties of female friendship. Her rich storytelling will leave you breathless as you take this trip with Nannie, Louisa, Jessie, and Anne. This is Sandra Dallas at her absolute best.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Adult Fiction",
    "Religion",
    "Westerns"
  ],
  "author": "Sandra Dallas",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/12953856-true-sisters"
}