{
  "title": "Heroic Measures",
  "description": "From the author of The Tattoo Artist (“Beautifully written”—Alice Sebold; “Boldly conceived”— The New York Times Book Review ), a new novel—taut, moving, accomplished—set in a fraught, post-9/11 New York... about real estate, dog love, and a city on alert.A gasoline tanker truck is “stuck” in the Midtown Tunnel. New Yorkers are panicked . . . . Is this the next big attack?Alex, an artist, and Ruth, a former schoolteacher with an FBI file as thick as a dictionary, must get their beloved dachshund, whose back legs have suddenly become paralyzed, to the animal hospital sixty blocks north. But the streets of Manhattan are welded with traffic. Their dog, Dorothy, twelve-years-old and gray-faced, is the emotional center of Alex and Ruth's forty-five-year-long childless marriage. Using a cutting board as a stretcher, they ferry the dog uptown.This is also the weekend that Alex and Ruth must sell their apartment. While house hunters traipsethrough it during their open house, husband and wife wait by the phone to hear from the animal hospital. During the course of forty-eight hours, as the missing truck driver terrorizes the city, the price of their apartment becomes a barometer for collective hope and despair, as the real estate market spikes and troughs with every breaking news story.In shifting points of view—Alex’s, Ruth’s, and the little dog’s—man, woman, and one small tenaciousbeast try to make sense of the cacophony of rumors, opinions, and innuendos coming from newsanchors, cable TV pundits, pollsters, bomb experts, hostages, witnesses, real estate agents, house hunters, bargain seekers, howling dogs, veterinarians, nurses, and cab drivers.A moving, deftly told novel of ultrahigh-urban anxiety.",
  "genres": [
    "Fiction",
    "Contemporary",
    "New York",
    "Animals",
    "Dogs",
    "Novels",
    "Realistic Fiction"
  ],
  "author": "Jill Ciment",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/6415806-heroic-measures"
}