{
  "title": "Mathilda Savitch",
  "description": "A fiercely funny and touching debut novel about a young girl trying to find out the truth behind her sister’s deathI have a sister who died. Did I tell you this already? I did but you don’t remember, you didn’t understand the code . . . She died a year ago, but in my mind sometimes it’s five minutes. In the morning sometimes it hasn’t even happened yet. For a second I’m confused, but then it all comes back. It happens again.Fear doesn’t come naturally to Mathilda Savitch. She prefers to look right at the things nobody else can bring themselves to mention: for example, the fact that her beloved older sister is dead, pushed in front of a train by a man still on the loose. Her grief-stricken parents have basically been sleepwalking ever since, and it is Mathilda’s sworn mission to shock them back to life. Her strategy? Being bad.Mathilda decides she’s going to figure out what lies behind the catastrophe. She starts sleuthing through her sister’s most secret possessions—e-mails, clothes, notebooks, whatever her determination and craftiness can ferret out. More troubling, she begins to apply some of her older sister’s magical charisma and powers of seduction to the unraveling situations around her. In a storyline that thrums with hints of ancient myth, Mathilda has to risk a great deal—in fact, has to leave behind everything she loves—in order to discover the truth.Mathilda Savitch bursts with unforgettably imagined details: impossible crushes, devastating humiliations, the way you can hate and love your family at the same moment, the times when you and your best friend are so weak with laughter that you can’t breathe. Startling, funny, touching, odd, truthful, page-turning, and, in the end, heartbreaking, Mathilda Savitch is an extraordinary debut. Once you make the acquaintance of Mathilda Savitch, you will never forget her.",
  "genres": [
    "Fiction",
    "Young Adult",
    "Coming Of Age",
    "Adult Fiction",
    "Book Club",
    "Grief",
    "Contemporary"
  ],
  "author": "Victor Lodato",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/6417409-mathilda-savitch"
}