{
  "title": "In the Valley of the Kings",
  "description": "In the Valley of the Kings marks the extraordinary debut of Terrence Holt, who fifteen years ago abandoned a promising writing career to practice medicine. Moved by his patients’ valor in the face of death, seeking to comprehend the mysteries revealed at their bedside, Holt has taken up fiction again. He emerges now with this astonishing collection of one novella and seven short stories that explore the farthest reaches of the imagination in a style that recalls the nineteenth-century American masters.Holt leaps across genres and millennia, from small-town America to deep space, daring his readers to journey with him into realms as mysterious as they are unforgettable. The opening story, “‘? ????s,” is a chilling account of the last days of the human race, as the hospitalization of a little girl in a New England town heralds a terrifying plague, transmitted not by a microbe but by a single word. The final story, “Apocalypse,” returns to small-town New England and another vision of the end, in an intimate account of how a couple struggles to live and love under the shadow of the Earth’s approaching doom. In between, these stories range from outer space, where—in “Charybdis”—an astronaut alone on a doomed NASA mission comes to terms with his fate, to the Egyptian desert of the title novella, where an archaeologist seeks a fabulous tomb that holds the secret of immortality. Painting with lurid colors and finely crafted prose, Holt offers his readers haunting visions of the reefs and abysses of the human imagination. In the Valley of the Kings redefines the art of the story, throwing aside the rules in search of the enduring truths that ultimately make stories worth reading.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Science Fiction",
    "Fantasy",
    "Horror",
    "Death",
    "Medical"
  ],
  "author": "Terrence Holt",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/6414202-in-the-valley-of-the-kings"
}