{
  "title": "Banned for Life",
  "description": "For almost two decades, rumors have swirled around Jim Cassady, a quasi-legendary musician who disappeared without a trace after his girlfriend’s apparent suicide. Though largely written off as dead, some claim to have had brushes with Cassady, now said to be homeless and bumming change on the streets of his native Los Angeles. Intrigued, Jason Maddox, a would-be filmmaker and Cassady fan, decides to investigate. But the man he eventually finds and befriends is damaged in ways he could never have imagined, and Jason’s own life begins to unravel as he tries to save the hapless Jim Cassady from himself.A mystery wrapped in a roller-coaster account of the American pop-culture underbelly, Banned for Life has been cited as a \"cult favorite\" by the New York Journal of Books, with a reputation that continues to expand. \"Every once in a while, I read a book that I think everyone else should read. A book that lovers of all genres can enjoy. A book that I wish I could buy for every single non-reader out there to prove to them what they are missing. [Banned for Life] is one of those books...once I started, I knew I was not going to want it to end. It called to me every time I put it down. It begged. It screamed. I savored every moment of it, and I dreaded reading that final sentence.\" — The Next Best Book Blog \"....pitch-perfect, laugh-out-loud funny, and heartrendingly sad...one of those rare books that tells the story of a generation.\" — Chris Kraus, author of I Love Dick \"...[Banned for Life] follows Jason Maddox's serio-comic adventures in the underground punk scene, stretching beyond mosh-pit mayhem and barroom brawls to explore death and obsession and purpose. The author zigzags confidently between a resonant coming-of-age tale in North Carolina, la vie bohème in hardscrabble New York, and a tempestuous L.A. love affair...even readers ambivalent to punk will be drawn in by the peculiarly irresistible voice of Jason...\" — The Nervous Breakdown \"Haney's characters are nuanced and interesting and you actually care about what's going to happen to them...\"— Maximum RocknRoll \"...literary fiction at its best. Like Melville [in Moby-Dick], D. R. Haney has created a world so rich in detail, so authentic, so damned cool, you want to take up a harpoon—or, in this case, a guitar—and join the fray.\" — Greg Olear, author of Totally Killer and Fathermucker \"...a powerful and affecting novel that hits all the right notes.\" — Largehearted Boy",
  "genres": [
    "Fiction",
    "Music",
    "Contemporary"
  ],
  "author": "Duke Haney",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/6416929-banned-for-life"
}