{
  "title": "Suckers",
  "description": "Masters of the comedy thriller genre, J.A. Konrath and Jeff Strand, team up for the humorous horror novella Suckers.Strand's perpetually unlucky character Andrew Mayhem, star of the novels Graverobbers Wanted (No Experience Necessary), Single White Psychopath Seeks Same, and Casket For Sale (Only Used Once), sets off on a simple mission at the request of his Get some spaghetti sauce.On his way to the store he meets Konrath's obnoxious private eye Harry McGlade, co-star of the Lt. Jack Daniels thrillers Whiskey Sour, Bloody Mary, Rusty Nail, Dirty Martini, Fuzzy Navel, and Cherry Bomb.Horrific violence, bad jokes, and lots of name calling soon ensues. Some sex, too, but not between the main characters.Originally, published as a very expensive limited-edition hardcover, Suckers is now available as a super cheap ebook.But the fun doesn't stop there.Also included in this ebook are six other Mayhem and McGlade stories, many of them rare and long out of print.Whelp Wanted - JA KonrathPoor Career Choice - Jeff StrandTaken to the Cleaners - JA KonrathA Bit of Halloween Mayhem - Jeff StrandThe Necro File - JA KonrathThe Lost (For a Good Reason) Adventure of Andrew Mayhem - Jeff StrandIf that's not enough to get you to part with your pocket change, this ebook also includes two brand new introductions written by the authors, and an exclusive Strand/Konrath interview.That's over 53,000 words worth of demented entertainment, for half the price of a kiddie meal at that fast food restaurant with the scary clown. It's also 1/3 of the calories. Plus, it's specially formatted for Kindle, with an active table of contents. Not active in the sense it will mow your lawn or fetch you a beer, but it's clickable and looks pretty. Some of the jokes (mostly Konrath's) push the boundaries of good taste. Don't buy this if you're easily offended.You also get a bonus excerpt from the hilarious novel, My Gun Has Bullets, by Lee Goldberg.Here's what critics and bestselling authors have to \"JA Konrath is the greatest writer who ever lived!\" -- Jeff Strand, published author of Benjamin's Parasite\"No, no, Jeff Strand is way better!\" -- JA Konrath, published author of Whiskey Sour\"I officially withdraw my previous quote based on new information provided by JA Konrath's quote. Jeff Strand is the greatest writer who ever lived!\" -- Jeff Strand, published author of The Sinister Mr. Corpse\"Of course, Jack Kilborn is better than both of us combined and mixed with a side helping of the Bronte sisters.\" -- JA Konrath, published author of the more mediocre half of Suckers\"Well, duh.\" -- Jeff Strand, published author of the half of Suckers that's okay, sort of, if your expectations aren't too high.",
  "genres": [
    "Horror",
    "Humor",
    "Fiction",
    "Thriller",
    "Mystery",
    "Short Stories",
    "Vampires"
  ],
  "author": "J.A. Konrath",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/6416357-suckers"
}