{
  "title": "Lost to the West: The Forgotten Byzantine Empire That Rescued Western Civilization",
  "description": "In AD 476 the Roman Empire fell–or rather, its western half did. Its eastern half, which would come to be known as the Byzantine Empire, would endure and often flourish for another eleven centuries. Though its capital would move to Constantinople, its citizens referred to themselves as Roman for the entire duration of the empire’s existence. Indeed, so did its neighbors, allies, and enemies: When the Turkish Sultan Mehmet II conquered Constantinople in 1453, he took the title Caesar of Rome, placing himself in a direct line that led back to Augustus.For far too many otherwise historically savvy people today, the story of the Byzantine civilization is something of a void. Yet for more than a millennium, Byzantium reigned as the glittering seat of Christian civilization. When Europe fell into the Dark Ages, Byzantium held fast against Muslim expansion, keeping Christianity alive. When literacy all but vanished in the West, Byzantium made primary education available to both sexes. Students debated the merits of Plato and Aristotle and commonly committed the entirety of Homer’s Iliad to memory. Streams of wealth flowed into Constantinople, making possible unprecedented wonders of art and architecture, from fabulous jeweled mosaics and other iconography to the great church known as the Hagia Sophia that was a vision of heaven on earth. The dome of the Great Palace stood nearly two hundred feet high and stretched over four acres, and the city’s population was more than twenty times that of London’s.From Constantine, who founded his eponymous city in the year 330, to Constantine XI, who valiantly fought the empire’s final battle more than a thousand years later, the emperors who ruled Byzantium enacted a saga of political intrigue and conquest as astonishing as anything in recorded history. Lost to the West is replete with stories of assassination, mass mutilation and execution, sexual scheming, ruthless grasping for power, and clashing armies that soaked battlefields with the blood of slain warriors numbering in the tens of thousands.Still, it was Byzantium that preserved for us today the great gifts of the classical world. Of the 55,000 ancient Greek texts in existence today, some 40,000 were transmitted to us by Byzantine scribes. And it was the Byzantine Empire that shielded Western Europe from invasion until it was ready to take its own place at the center of the world stage. Filled with unforgettable stories of emperors, generals, and religious patriarchs, as well as fascinating glimpses into the life of the ordinary citizen, Lost to the West reveals how much we owe to this empire that was the equal of any in its achievements, appetites, and enduring legacy.",
  "genres": [
    "History",
    "Nonfiction",
    "Ancient History",
    "Medieval",
    "World History",
    "Audiobook",
    "European History"
  ],
  "author": "Lars Brownworth",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/6415185-lost-to-the-west"
}