{
  "title": "The Amoveo Legacy",
  "description": "What if everything you knew turned out to be a lie? You find out that you aren't even human--at least not entirely. What if, one day, you realize your world will never be the same again? These are the questions that Samantha Logan must face in \"The Amoveo Legacy\". A dream on her thirtieth birthday compels her to leave her artists loft in New York City and move back to the beach with her Grandmother, Nonie. However, the instant Samantha steps foot on the salty shores of her childhood home, she realizes the landscape has changed. The moment she encounters the mysterious, arrogant neighbor Malcolm Drew, her life is never the same. Through a seductive courtship, he introduces her to the magical mystical world of the Amoveo. The dream walking, telepathic, shape shifters that he claims are her true heritage. However, Malcolm holds back a secret that could destroy them both. Will he be able to protect Samantha and convince her of the secret legacy buried deep inside of her? This series is about The Amoveo people; an ancient race of shape-shifters who have lived secretly among humans for thousands of years. The Amoveo are made up of ten different animal clans. Eagle, Lion, Panther, Tiger, Bear, Wolf, Hawk, Fox, Cheetah, Coyote. They are telepathic, dream walking, shape-shifters that are born with a pre-destined soul mate. If an Amoveo does not find their mate by the time they reach the age of 30 they begin to lose their abilities and eventually die. They can only have children with their life mates. They are physically beautiful, incredibly strong and once they are mated have considerably longer life spans than humans. However, the limitations with their breeding patterns, makes their race extremely fragile. Only two branches of humans know of the Amoveo's existence; the Caedo family and the Vasullus family. For generations The Caedo family have dedicated their lives to the annihilation of the Amoveo. Like so many others, they are driven by ignorance and fear and have hunted the Amoveo to the brink of extinction. When one Amoveo is killed, their mate eventually dies and any children they would have had are lost. The Vasullus family, however, serve as protectors for the Amoveo. The first book which is set on the misty, summer shores of Rhode Island follows the evolving courtship of Malcolm Drew of the Eagle Clan and his mate Samantha Logan. Sam is the first of her kind, she's a hybrid. Her father was Amoveo of the Wolf Clan and her mother was a human with psychic abilities. Her parents were killed in an accident when she was an infant and she was raised by her human grandparents. As a result, Sam was never taught any of the Amoveo ways and her abilities have lay dormant all of her life. Until she meets Malcolm. He introduces her to a magical, mystical world that is as foreign to Sam; as the burning passion he ignites within her. Their relationship is complicated by the looming threat of the Caedo that are hunting them. However, we soon learn that the Caedo hunter has enlisted the help of an unknown partner, who is out to destroy Malcolm and his unusual mate. Can Malcolm convince of her true heritage before it is too late?",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Shapeshifters",
    "Adult",
    "Urban Fantasy"
  ],
  "author": "Sara  Humphreys",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/6420432-the-amoveo-legacy"
}