{
  "title": "Brooklyn",
  "description": "From Brooklyn won the 2009 Costa Novel Award, was shortlisted for the International IMPAC Dublin Literary Award and was longlisted for the Man Booker Prize. The Observer named it as one of \"The 10 best historical novels\" Eilis Lacey is a young woman unable to find work in 1950s Ireland. She meets a Catholic priest called Father Flood from New York City, who tells Eilis of the wonderful employment opportunities awaiting her in New York. She emigrates to Brooklyn and gets a job in a department store while taking night classes. Her initial experiences working in a boring job and living in a repressive boardinghouse, run by the strict Mrs Kehoe, make her doubt her initial decision. Letters from home brought about severe homesickness but soon she begins to settle into a routine. Eilis falls in love with an Italian plumber called Tony. This leads to her first sexual encounter that are overheard by Mrs Kehoe. Tony proposes marriage and brings Eilis to meet his family. Eilis receives news that her sister Rose has died. She returns to Ireland to mourn and secretly marries Tony before she leaves. In Ireland she falls back into the town society easily. She meets Jim Farrell, who is interested in her. Eilis spends time with Jim and starts a relationship with him. He is a local pub owner, to whom she had been attracted to before emigrating to America. Eilis's mother is desperate for her to settle back in Ireland and marry Jim, as Eilis has not confided in anyone about her marriage. Eilis procrastinates about a return to her new life by extending her stay. She saves Tony's letters unopened thinking at times that she no longer loves him. Eventually a local busybody tells Eilis she knows her secret because Madge Kehoe is her cousin and the story is out in New York. Eilis immediately books her return passage, telling her mother the truth and posting a farewell note to Jim as she leaves town.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Ireland",
    "Romance",
    "Historical",
    "Audiobook"
  ],
  "author": "Colm Tóibín",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/6421888-brooklyn"
}