{
  "title": "Spy",
  "description": "“A border ain’t nothing but a law drawn in the sand.” So says a small-town Texas sheriff in Ted Bell’s most gripping espionage thriller to date. Things along America’s southern border are rapidly reaching the boiling point. American girls are being snatched from their homes, ranches are burning, and the number of deadly confrontations along the Mexican boarder grows daily. At night, armed Mexican troops cross the border at will in support of narcotics smugglers and illegal immigrants. By day, Americans take up arms and plan reprisals. An all-out border war is no longer inconceivable. It’s happening!On assignment for the British Secret Service, a man leads a mysterious expedition into the heart of darkness. Sailing up the furthest reaches of the Amazon River, he is captured by a brutal tribe of indigenous cannibals. Forced into slave labor, he witnesses the unimaginable. Golden domes and minarets rise beneath the rainforest canopy. Vast terror armies are being recruited and trained in the jungle. Their goal: a vicious jihad that will unite one continent…and destroy another. They possess weapons only dreamed of by the Western allies. Somehow he must escape his captors and live to tell his tale.With tensions on its southern border threatening to ignite into war, America must look to the one man who might be able to confront the demons in the jungle…and destroy them. Alex Hawke, with the aid of brilliant Scotland Yard Inspector Ambrose Congreve, and an unstoppable force of nature named Stokely Jones, begins a river journey fraught with peril. He must confront all the terrors that man and nature can hurl at him. From black magic, poison-tipped arrows, and blowguns to an awesome arsenal of the most advanced military hardware, Hawke must overcome insurmountable odds on his quest for victory.Here is an author who gets you in the palm of his hand and then clenches his fist. And here is a saga loaded to the gunwales with action, glamour, and spellbinding suspense. Alex Hawke once again takes listeners right to that thin border between fear and overwhelming terror. It’s merely a line drawn in the sand. Cross it at your peril.Cross it if you dare.",
  "genres": [
    "Fiction",
    "Thriller",
    "Adventure",
    "Mystery",
    "Espionage",
    "Action",
    "Spy Thriller"
  ],
  "author": "Ted Bell",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/129546.Spy"
}