{
  "title": "If the Dead Rise Not",
  "description": "Steven Elliot proposed to beautiful spunky Shannon Reed. He’d been in love with her since she was fifteen years old, but their plans for a happily ever after were shattered one fall day when Shannon was brutally killed. In the five years since her death Steve went from being a deputy to the sheriff of Pinedale Colorado. On the outside Steve appeared to have come to terms with Shannon’s death, on the inside he was still waiting for the peace and healing to come. Those who knew the sheriff well, worried about the tall blond man with the curly hair, they could still see the terrible grief that lurked in his eyes.Steve thought he had his emotions under control enough to endure the pain he lived with but fate conspired against him when the school board hired a new first grade teacher, named Jessica Spencer. Jessica reminded him too much of his dead fiancée and the shell he’d erected around himself seemed to be cracking. Feelings were oozing out that couldn’t be put back. Steve knew Shannon was dead, he’d seen her with his own eyes. It was a grizzly vision that haunted him still. Shannon wasn’t coming back, his head knew that but his heart wouldn’t let him believe it.Steve had been in the law business long enough to sense when things were not quite right. Something about Jessica bothered him and it was more than the fact that she looked similar to Shannon. Jessica didn’t talk like Shannon, didn’t move like her, didn’t have Shannon’s zest for life or exuberant personality. Jessica was quiet and reserved. At first Steve thought she was shy but it wasn’t long before he realized it wasn’t shyness he’d seen, but fear.What ever it was that Jessica was afraid of, it kept her from trusting Steve enough to tell him about it. When he couldn’t break through the wall she’d used to shut him out, Steve felt compelled to search for the truth on his own. The trail he followed led him to look for a connection between Jessica, an unsolved murder and the death of his own beloved Shannon. One way or another Steve was going to find out what she was hiding from; he only hoped he could do it before it was too late. He didn’t want the next dead body they found to be hers.",
  "genres": [],
  "author": "Dorothy F. Gricius",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/6421922-if-the-dead-rise-not"
}