{
  "title": "A Beautiful Rival",
  "description": "In this stunning new novel, bestselling author Gill Paul reveals the unknown history of cosmetic titans Elizabeth Arden and Helena Rubinstein and their infamous rivalry that spanned not only decades, but also broken marriages, personal tragedies, and a world that was changing dramatically for women—perfect for fans of Fiona Davis, Marie Benedict, and Beatriz Williams.Who would have guessed that the business of making women beautiful was so cutthroat?They could have been allies: two self-made millionaires who invented a global industry, in an era when wife and mother were supposed to be the highest goals for their sex. Elizabeth Arden and Helena Rubinstein each founded empires built on grit and determination…and yet they became locked in a feud spanning three continents, two world wars, and the Great Depression.Brought up in poverty, Canadian-born Elizabeth Arden changed popular opinion, persuading women from all walks of life ­to buy skincare products that promised them youth and beauty. Helena Rubenstein left her native Poland, and launched her company with scientific claims about her miracle creams made with anti-ageing herbs.And when it came to business, nothing was off-limits: poaching each other’s employees, copying each other’s products, planting spies, hiring ex-husbands, and one-upping each other every chance they had. This was a rivalry from which there was no surrender! And through it all were two women, bold, brazen, and determined to succeed—no matter the personal cost.In this sweeping novel from the bestselling author of Jackie and Maria and The Manhattan Girls, two larger-than life fashion icons come alive with all their passion, bitterness, and ambition as they each try to live the American dream.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Drama",
    "Womens Fiction",
    "New York"
  ],
  "author": "Gill Paul",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/64230282-a-beautiful-rival"
}