{
  "title": "The Neoconservative Mind: Politics, Culture, and the War of Ideology",
  "description": "For the past generation, neoconservatism has been the most powerful intellectual movement in American politics. Focusing on four of its most influential theorists—Irving Kristol, Norman Podhoretz, Michael Novak, and Peter Berger—Gary Dorrien presents a sweeping analysis of neoconservatism's history, ideology, and future prospects. He argues that it has the potential to become America's first genuine conservative intellectual tradition. Interviews with all the principal figures as well as with Michael Harrington and other opponents yield a rich and colorful portrayal of the figures and the publications that have shaped this ideological force. Neoconservatism grew out of the Old Left and retains the marks of its origins in the factional New York Intellectual debates of the 1930s. Dorrien traces the multiple strands that contributed to the new former Trotskyites, trade unionists, and right-wing social democrats who opposed the countercultural movements of the 1960s, were disillusioned with the Great Society, felt alienated from the \"fashionable liberal elite,\" and were repulsed by the anti-American sentiments of the Left. They attacked the \"new class,\" an amorphous group of non-producing elites that at various times included liberal intellectuals, \"parasitic\" managers, and bureaucrats, social workers and psychologists, the major media, consultants, administrators, and lawyers. Throughout the fascinating intellectual biographies of Kristol, Podhoretz, Novak, and Berger, Dorrien describes the vast array of New York literati and political pundits who are or have been associated with these neoconservative leaders. Naming Commentary, The New Republic, The Public Interest, Orbis, The American Scholar, The New Leader, The American Spectator, and Society, among others which have been established by or which regularly host the writings of prominent neoconservatives, Dorrien demonstrates the substantial influence of the movement. Dorrien characterizes neoconservatism by its militant anticommunist and capitalist economics, and its support of a minimal welfare state, the rule of traditional elites, and the return to traditional cultural values. He describes its different ideological currents, its feud with the traditional Right and the many camps from which its adherents converted. Tracking the movement's attainment of political power in the 1980s, he explains how the collapse of communism has fractured neoconservatism's foreign policy consensus, and analyzes the movement's subsequently heightened concern with cultural politics. While Dorrien does not aim to refute neoconservatism, he offers a respectful but strongly critical review of its development and examines the contradictions of its appeal.",
  "genres": [
    "History",
    "Politics"
  ],
  "author": "Gary J. Dorrien",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/642478.The_Neoconservative_Mind"
}