{
  "title": "Seeing Sean",
  "description": "A story of love at first sight. Then everything, including reality, gets in the way.When Wyatt meets Sean sparks fly. Their Zoom encounters, although work-related, generate the most unusual electronic reactions. But when they meet in the flesh he forgets all about contacting technical support because Sean is even more electrifying in person — an unusual experience for a Grindr-jaded Wyatt.But the interference continues and every time they meet Sean appears to get cold feet. Wyatt’s no fool. He knows the attraction is mutual. Neither is he desperate for attention. He gets plenty of that on his own. Sean is either up to something, he figures, or he’s frightened because he keeps coming back but retreats every time.Two worlds collide. Disillusioned at thirty-five, Wyatt leads a life that suits him. Affable to all but open to few, he's more-or-less content, a little bored, and not bad on his own. As far as he’s concerned, he’s seen and heard it all. Sean is different. Brimming with enthusiasm, he stumbles into Wyatt’s life like an overgrown puppy. Almost unnaturally handsome, he comes with none of the personality traits of the physically endowed. Yet, beneath the spectacular appearance is a man who’s awkward with people and reluctant to talk about himself.Each is fascinated by the other and neither wants to make the first move. Sean appears to hesitate and Wyatt, normally a hook-up pro, is lost. Despite his growing frustration — or perhaps because of it — he persists in hoping they’ll get together one day. And when that day comes the intimacy is greater than he’d ever imagined.Even locked in Wyatt’s arms, however, Sean refuses to talk about himself. But bouts of sex and declarations of love break down his barriers, and one by one, he lets his secrets drop. At first, Wyatt doesn’t believe him. Worse, he doubts his sanity. He’d expected to hear stories of an unhappy childhood, not fantastical fabrications of a life that cannot be. But with each secret revealed Sean demonstrates its truth until Wyatt is stuck between forsaking the world as he knows it or walking away. He hasn’t got much time, though. Sean has even more secrets and he’s not alone.",
  "genres": [
    "Science Fiction",
    "M M Romance",
    "Romance"
  ],
  "author": "Patrick  Doyle",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/64276290-seeing-sean"
}