{
  "title": "Woman's Inhumanity to Woman",
  "description": "“Man’s inhumanity to man”--the phrase is all too familiar. But until Phyllis Chesler's now-classic book, a profound silence prevailed about woman’s inhumanity to woman. Women's aggression may not take the same form as men's, but girls and women are indeed aggressive, often indirectly and mainly toward one another. They judge harshly, hold grudges, gossip, exclude, and disconnect from other women.             Like men, women are exposed to the messages of misogyny and sexism that permeate cultures worldwide. Like men, women unconsciously buy into negative images that can trigger abuse and mistreatment of other women. But like other social victims, many do not realize stereotyping affects members within the victimized group as well as those outside the group. They do not realize their behavior reflects society's biases.            How women view and treat other women matters. Are women oppressed? Yes. Do oppressed people internalize their oppressors' attitudes? Without a doubt. Prejudice must first be acknowledged before it can be resisted or overcome. More than men, women depend upon one another for emotional intimacy and bonding, and exclusionary and sexist behavior enforces female conformity and discourages independence and psychological growth.            Continuing the pioneering work begun in Women and Madness—Chesler's bestselling book that broke the story on double standards in psychology—Woman's Inhumanity to Woman draws on important studies, revolutionary theories, literature, and hundreds of original interviews. Chesler urges us to look within, to treat other women realistically, ethically, and kindly, and to forge bold and compassionate alliances. This is a necessary next step for women, without which they will never be liberated.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Psychology",
    "Womens",
    "Gender",
    "Womens Studies",
    "Politics"
  ],
  "author": "Phyllis Chesler",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/6431605-woman-s-inhumanity-to-woman"
}