{
  "title": "How The Mighty Fall: And Why Some Companies Never Give In",
  "description": "Decline can be avoided.Decline can be detected.Decline can be reversed.Amidst the desolate landscape of fallen great companies, Jim Collins began to wonder: How do the mighty fall? Can decline be detected early and avoided? How far can a company fall before the path toward doom becomes inevitable and unshakable? How can companies reverse course?In How the Mighty Fall, Collins confronts these questions, offering leaders the well-founded hope that they can learn how to stave off decline and, if they find themselves falling, reverse their course. Collins' research project—more than four years in duration—uncovered five step-wise stages of decline:Stage 1: Hubris Born of SuccessStage 2: Undisciplined Pursuit of MoreStage 3: Denial of Risk and PerilStage 4: Grasping for SalvationStage 5: Capitulation to Irrelevance or DeathBy understanding these stages of decline, leaders can substantially reduce their chances of falling all the way to the bottom.Great companies can stumble, badly, and recover.Every institution, no matter how great, is vulnerable to decline. There is no law of nature that the most powerful will inevitably remain at the top. Anyone can fall and most eventually do. But, as Collins' research emphasizes, some companies do indeed recover—in some cases, coming back even stronger—even after having crashed into the depths of Stage 4.Decline, it turns out, is largely self-inflicted, and the path to recovery lies largely within our own hands. We are not imprisoned by our circumstances, our history, or even our staggering defeats along the way. As long as we never get entirely knocked out of the game, hope always remains. The mighty can fall, but they can often rise again.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Management",
    "Buisness",
    "Audiobook",
    "Entrepreneurship"
  ],
  "author": "Jim Collins",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/6431063-how-the-mighty-fall"
}