{
  "title": "Marx's General: The Revolutionary Life of Friedrich Engels",
  "description": "A remarkable new biography from one of Britain’s leading young historians that recovers the co-founder of communism from the shadows of history Friedrich Engels is one of the most intriguing and contradictory figures of the nineteenth century. Born to a prosperous Prussian mercantile family, he spent his life working in the Manchester cotton industry, riding to the Cheshire hounds, and enjoying the comfortable upper-middle-class existence of a Victorian gentleman.Yet Engels was also, with Karl Marx, the founder of international communism, which in the twentieth century came to govern one-third of the human race. He was the coauthor of The Communist Manifesto , a ruthless party tactician, and the man who sacrificed his best years so that Marx could write Das Kapital . His searing account of the Industrial Revolution, The Condition of the Working Class in England , remains one of the most haunting and brutal indictments of the human costs of capitalism. Far more than Marx’s indispensable aide, Engels was a profound thinker in his own right—on warfare, feminism, urbanism, Darwinism, technology, and colonialism. With fierce clarity, he predicted the social effects of today’s free-market fundamentalism and unstoppable globalization.Drawing on a wealth of letters and archives, acclaimed historian Tristram Hunt plumbs Engels’s intellectual legacy and shows us how one of the great bon viveurs of Victorian Britain reconciled his exuberant personal life with his radical political philosophy. Set against the backdrop of revolutionary Europe and industrializing England—of Manchester mills, Paris barricades, and East End strikes— Marx’s General tells a story of devoted friendship, class compromise, ideological struggle, and family betrayal. And it tackles head-on the question of Engels’s was Engels, after Marx’s death, responsible for some of the most devastating turns of twentieth-century history, or was the idealism of his thought distorted by those who claimed to be his followers?An epic history and riveting biography, Marx’s General at last brings Engels out from the shadow of his famous friend and collaborator.",
  "genres": [
    "Biography",
    "History",
    "Politics",
    "Nonfiction",
    "Economics",
    "Philosophy",
    "Academic"
  ],
  "author": "Tristram Hunt",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/6428780-marx-s-general"
}