{
  "title": "The Kids Are All Right: A Memoir",
  "description": "“Perfect is boring.”Well, 1983 certainly wasn’t boring for the Welch family. Somehow, between their handsome father’s mysterious death, their glamorous soap-opera-star mother’s cancer diagnosis, and a phalanx of lawyers intent on bankruptcy proceedings, the four Welch siblings managed to handle each new heartbreaking misfortune in the same way they dealt with the unexpected arrival of the forgotten-about Chilean exchange student–together.All that changed with the death of their mother. While nineteen-year-old Amanda was legally on her own, the three younger siblings–Liz, sixteen; Dan, fourteen; and Diana, eight–were each dispatched to a different set of family friends. Quick-witted and sharp-tongued, Amanda headed for college in New York City and immersed herself in an ’80s world of alternative music and drugs. Liz, living with the couple for whom she babysat, followed in Amanda’s footsteps until high school graduation when she took a job in Norway as a nanny. Mischievous, rebellious Dan, bounced from guardian to boarding school and back again, getting deeper into trouble and drugs. And Diana, the red-haired baby of the family, was given a new life and identity and told to forget her past. But Diana’s siblings refused to forget her–or let her go.Told in the alternating voices of the four siblings, their poignant, harrowing story of un­breakable bonds unfolds with ferocious emotion. Despite the Welch children’s wrenching loss and subsequent separation, they retained the resilience and humor that both their mother and father endowed them with–growing up as lost souls, taking disastrous turns along the way, but eventually coming out right side up. The kids are not only all right; they’re back together.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Biography Memoir",
    "Book Club",
    "Family",
    "Autobiography"
  ],
  "author": "Diana Welch",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/6431240-the-kids-are-all-right"
}