{
  "title": "Kizuna: Fiction for Japan",
  "description": "March 11, 2011 - Three prefectures in northeastern Japan are devastated by a magnitude 9.0 earthquake, and a massive tsunami that takes the lives of 20,000 people. April 2011 - 75 authors from 11 countries came together to collaborate on a mixed-genre anthology of short stories to benefit the orphans of the disaster-stricken Tohoku area. Horror, humor, human drama, science fiction, fantasy, absurdist, bizarro, weird, new wave, bugpunk, Cthulhu, Sherlock Holmes, historical fiction, \"I\" stories, crime, and much more. Of the 75 stories in the anthology, a great portion of them were written for this anthology, including the Jerry Cornelius short \"Walking the Hog\" by Michael Moorcock. A fabulous collection! Royalties of this anthology go to the NPO Smile Kids Japan in an effort to support the orphans in the tsunami-struck areas of Iwate, Fukushima and Miyagi (Tohoku). Complete author list (in index order): Katherine Govier, Ken Asamatsu, Lee Pletzers, Joseph S. Pulver, Sr., S.A. Gambino, Michael Allen Rose, Nickolas Furr, Garrett Cook, Touya Tachihara, Jess Gulbranson, Alvin Pang, Robert M. Price, Kevin Lovelace, Junichi Ashikawa, Dan Ryan, Adam Joffrain, Moxie Mezcal, Andersen Prunty, L. Christopher Bird, Minoru Inaba, Richard Wright, Kirk Marshall, Davide Mana, Show Tomono, Jon Courtenay Grimwood, Christene Britton-Jones, Philip Overby, Yuusuke Tokita, David Agranoff, Bradley Sands, Naohiko Kitahara, Michael John Grist, Edmund Colell, Trent Zelazny, Riri Shimada, Made in DNA, Glynn Barrass, Fulvio Gatti, Nirnara, Melissa J White, Fumihiko Iino, Curt Seubert, Elizabeth Black, John F. Rice, Hiroshi Yamamoto, Volker Baetz, Andrew Freudenberg, Terrie Czechowski, Lucía González Lavado, Mie Takase, Stephen A. North, Ran Cartwright, Ukyou Kodachi, Danilo Arona, David Naughton-Shires, John Shirley, Jonathan Moon, Tadashi Ohta, Richard Salter, Midori Tateyama, Grant Wamack, Massimo Soumaré, Yufuko Senoh, Berry Sizemore, Ash Lomen, Adam Breckenridge, Yasumi Kobayashi, Jason Wuchenich, Ryuto Hijiri, Vittorio Catani, Joji Hayashi, Kevin David Anderson, Tamao Kanroji, Michael Moorcock, and Shinya Gaku.",
  "genres": [],
  "author": "Brent Millis",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/12955164-kizuna"
}