{
  "title": "Salt of the Air",
  "description": "You are familiar with the salt of the earth. But did you know there is an even finer, more delicate essence? Take wisdom and imagination, responsibility and beauty, and mix them together in arcane proportions to form a rich and peculiar brine. The resulting water of life is an emotional muddy liquid, filled with existential sediment swirling in the light of secret reality and reflecting prismatic colors of hope and wonder. If allowed to evaporate -- escape, flee, ascend into the ether and join the music of the spheres -- what remains is the quintessence; a precious concentrate that is elusive and volatile, neither fully solid nor so illusory as to be devoid of pithy substance. It is the Salt of the Air . In this debut collection from the critically acclaimed author of Dreams of the Compass Rose and Lords of Rainbow , the nineteen stories are distillations of myth and philosophy, eroticism and ascetic purity. Dipping into an ancient multi-ethnic well, they are the stuff of fantasy -- of maidens and deities and senior retirees, of emperors and artists and con artists, of warriors and librarians, of beings without a name and things very fey indeed.... Don't be afraid of ingesting ethereal salt. Open your mind and inhale. \"Cautionary, sensual stories of love, reversal and revenge upend fairy tale conventions in Nazarian's lush collection... Sumptuous detail, twisty plots and surprising endings lift these extravagant tales.\" -- Publishers Weekly \"These are beautiful, haunting confections, reminiscent of Tanith Lee's erotically charged tales... Fine shades of emotion, mythic grandeur, crystalline prose, sharp revisionist these are Vera Nazarian's hallmarks...\" -- Nick Gevers, Locus Vera Nazarian immigrated to the USA from the former USSR as a kid, sold her first story at the age of 17, and since then has published numerous works in anthologies and magazines, and has seen her fiction translated into eight languages. She made her novelist debut with the critically acclaimed novel Dreams of the Compass Rose , followed by epic fantasy about a world without color, Lords of Rainbow . Her novella The Clock King and the Queen of the Hourglass with an introduction by Charles de Lint made the Locus Recommended Reading List for 2005. This first collection Salt of the Air , with an introduction by Gene Wolfe , contains the 2007 Nebula Award-nominated \"The Story of Love.\" Recent work includes the 2008 Nebula Award-nominated, baroque novella The Duke in His Castle . Ancient myth, moral fables, eclectic philosophy, and her Armenian and Russian ethnic heritage play a strong part in all her work, combining the essences of things and places long gone into a rich evocation of wonder. In addition to being a writer and award-winning artist, she is also the publisher of Norilana Books. Official www.veranazarian.com",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fiction"
  ],
  "author": "Vera Nazarian",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/6431193-salt-of-the-air"
}