{
  "title": "The Shore of Destiny",
  "description": "The Shore of DestinyBook 3 of The Druids of DestinyShanna MurchisonIreland, 1147Bowen the Golden Bear is a Viking Berserker, blessed of the great war god Odin, and one of the most ferocious warriors ever to serve the great Norse Lord Horvath of Dublin. Horvath asks Bowen a personal favor, to rescue his niece Aislinn from her treacherous Irish clan, who seek to remove her as its head. Bowen uses his skills as a warrior and druid to make short work of the traitors, but terrifies the O'Neill clan in the process. His insistence upon marrying Aislinn, the beautiful woman he has worshipped from afar for many years, causes the feisty woman to openly defy him and thwart his wishes at every turn. Aislinn has gone from daughter to dynastic bride to war trophy in only three short years. Her first marriage was dreadful; how much worse will it be to be wed to a pagan savage? But Bowen's love for her sons and gentleness despite him being a powerful warrior soon begin to wear down her resistance to her stunningly handsome new husband. She learns of his original Welsh family, and his shadowy past. The more she discovers, the more she begins to wonder if Bowen is truly her destiny and the answer to all her prayers. Does she dare give in to the sensual thrall he has woven around her? Bowen is beset on all sides, battling with Aislinn and his enemies within his castle gates, and coping with treachery outside as well as more ambitions Vikings and the neighboring Irish clans come to see if his lovely new home Ardara is ripe for plunder. Bowen is determined to protect his beloved wife and new family no matter what the cost, even if it means turning his back on his druidic powers and laying down his life to save hers. Will Aislinn ever be able to accept the supernatural side of her husband Bowen's abilities, or will she too betray him? West Coast of Ireland, March 1146,The Feast of St PatrickAislinn stood on the battlements and stared in horror at the sea below her. This couldn't be happening. Never in all her twenty-three years...But it was. The dragon ships were even now beaching below her ramparts. Though only possessing six oars each side, the first one looked the most lethal she had ever seen.It was filled with the harbingers of doom. Not the Four Horsemen of the Apocalypse, she thought hysterically, but eleven naked screaming men wielding swords and axes, and two bears.No, one bear. A bear so golden and beautiful that she was sure she had to be imagining things, such was the contrast between it and its huge black companion.The second was as ebony as a raven's wing apart from some bald patches on its chest and legs and--God above, it wasn't a bear, it was a man. How could she have missed the huge--She blenched in shock and fear as he suddenly stopped his run along the sandy strand to look up at her. Straight at her.And she to her shame gazed down at him. Stared her fill. And then stared even more. The hot blush scalded her cheeks as she gaped at the man, who was completely naked save for his dark bearskin cloak and soft black leather boots. But she just couldn't seem to tear her eyes away from him.Nor did it seem could his be parted from her.But if he was going to lead his men he certainly couldn't do it from twenty yards back, Bowen scolded himself, and ran on. He had just been so astonished to see Aislinn again after all this time. After all the weeks of dreaming of this moment, ever since he had started to prepare for this expedition, and then had to row half way around Ireland to get here. He had worried the whole way about her safety. If she would even still be alive when he finally got here...Setting: Ireland, 1147Word Count=128,000Rating: SensualAlso by Shanna MurchisonThe Druid's WomanThe Wizard WomanThe Druids of Destiny SeriesThe Tide of DestinyThe Isle of DestinyThe Shore of Destiny",
  "genres": [
    "Medieval",
    "Historical Romance"
  ],
  "author": "Shanna Murchison",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/6427593-the-shore-of-destiny"
}