{
  "title": "Knight Moves",
  "description": "\"Knight Moves is an absolute treat!\" Ms. Layne's setting is perfect, her use of magic unique, her plotline full of surprises. Knight Moves is everything I love about erotic romance!\" --Crave More Romance (5 stars)\"Jamaica Layne's Knight Moves is a funny, naughty romp that takes full advantage of its fantastical setting to poke fun at a wide range of historical periods through the eyes of its spunky heroine, Louise Jackson of New Jersey. Kidnapped by a time-travelling knight, she discovers new sexual tastes and new inner strength as she finds a way to turn the tables and free herself from bondage.\" --Victoria Janssen, author of THE DUCHESS, HER MAID, THE GROOM, AND THEIR LOVER\"Fun, sexy and inventive!\" --Cheryl Brooks, author of THE CAT STAR CHRONICLESLouise Jackson - ---a sexually frustrated, thirty-year-old toll collection supervisor for the New Jersey Turnpike - is bored out of her gourd at Medieval Dinner and Tournament when she heads for the ladies' room. She soon encounters a gorgeous mystery knight in a bathroom stall that is actually a portal to another time and place - a castle in twelfth-century Europe, which is the knight's home. Louise is ecstatic - she believes she has found the incredible knight-in-shining-armor of her wildest fantasies. But the mystery knight is actually LordVerdigris, who has kidnapped her from the 21st century so she can become a sex slave in his Hall of Harlots, where she will grant sexual favors to Lord Verdigris and the knights of his garrison for all eternity!Determined to make the best of a bad situation, Louise settles into her new role as Lady Louisa of the Crossroads - by far the most popular and desirable of all the courtesans in Lord Verdigris's Hall of Harlots. Will she find a path back to her own century before the ruthless Lord Verdigris finds out and imprisons her forever? And will she find true love along the way?",
  "genres": [
    "Romance"
  ],
  "author": "Jamaica Layne",
  "average_rating": "2.33",
  "url": "https://www.goodreads.com/book/show/6434162-knight-moves"
}