{
  "title": "The Head Mistress",
  "description": "You were introduced to Milan, femme fatale of all femme fatales in Amid the Cacophony of Cries. What happens when this elite escort is given the keys to her on—again, off—again lover’s international cocaine trafficking empire? What happens when she’s expected to shoulder the burdens and blessings of spearheading all of his business operations, upscale call-girl ring, and handling his enemies? Milan is more ruthless than ever in The Head Mistress. She becomes the first woman to unwittingly inherit an international underground drug network which grosses over $12 million a month, in the formerly male dominated trafficking world of Kevin Restrepo and his Restrepo Cartel. An incest victim molested by her own uncle, turned elite call girl who came from the gritty streets of Los Angeles, Milan comes to terms with untold demons. Her Puerto Rican lover grants her access to the workings of his underground drug network. When he gets arrested by the feds she is expected to pick up where he leaves off. Sudden promotion puts her in the line of fire of a very wealthy, feared, and deadly man. She learns that she’s a marked woman and there’s a hit out on her life. Amid a cesspool of betrayal, Kevin’s younger brother and business partner falls madly in love with Milan. What ensues is a lusty, tempestuous, kinky, torrid triangle of sorts. Being the promiscuous scandal-magnet that she is, Milan befriends a married woman who is highly curious about a bisexual relationship but waffles because of her commitment to God and her marriage to a prominent pastor of a world-renowned mega church in Brooklyn. While Milan miraculously survives brush after brush with death, new enemies materialize and old enemies resurface. Strap on your seatbelt! Hold on as you plunge into the world of The Head Mistress.",
  "genres": [],
  "author": "Brandi L. Bates",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/6433112-the-head-mistress"
}