{
  "title": "It Takes a Pillage: Behind the Bailouts, Bonuses, and Backroom Deals from Washington to Wall Street",
  "description": "A former Wall Street manager turned muckraking journalist gets inside how the banks looted the Treasury, stole the bailout, and continued with business as usual We all watched as packs of former Big Financiers commandeered posts in Washington and lavished trillions in bailouts to \"save\" big Wall Street firms that used that money for anything and everything except to fill in Main Street's potholes. We all watched as Wall Street heavyweights fought tooth and nail to declaw financial reform and won.Former Wall Streeter Nomi Prins has been watching, too, and she is not going to let them get away with it. More than just an angry populist, commentator stuck on the sidelines, Prins understand Big Finance and big money and big schemes-and in this book she exposes the fundamental follies of our economic system and the schemes of the bigwigs who have no intention of letting it change.Remarkably combines detail, clarity, and narrative momentum, revealing all the ways in banks gamed the system to get the most money with the least oversight. Exposes the power-bankers who bagged more than $5 billion in compensation before and after their companies grabbed more than a trillion dollars in federal bailout subsidies-and how the government's indignation at this didn't lead to change. Shows how the most egregious pillagers work at the Fed and Treasury department, detailing how Hank Paulson, Ben Bernanke, and Tim Geithner siphoned off $10.7 trillion from the public's future for Big Finance's present, all the while telling us it was for our own good. Slams a financial system that will not change, if our government doesn't force it to change, no matter what happens in the so-called free market and why the 'sweeping' financial reform bill passed after Wall Street reconsolidated its power, is anything but sweeping or reformative. Written by a former managing director at Goldman Sachs, now a senior fellow at Demos, who writes regularly on corruption in Washington and Wall Street for news outlets ranging from Fortune to Mother Jones. If you're still enraged and frustrated with how the bank bailout went bust for the American people, or how Wall Street continues to operate as if the rest of the world doesn't matter, or how the banks are once again rolling in outsized profits and obscene bonuses while average Americans continue to struggle through a bleak landscape of foreclosures and job loss, It Takes a Pillage gives voice to your outrage, and provides a deeper insight into what we really have to be angry about and how we can fight for some real change.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "Finance",
    "Business",
    "History",
    "Banks"
  ],
  "author": "Nomi Prins",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/6434146-it-takes-a-pillage"
}