{
  "title": "Green Mountain, White Cloud: A Novel of Love in the Ming Dynasty",
  "description": "In a medieval abbey near Paris, in a room piled high with old Chinese texts, lies a manuscript gathering dust. Though ordinary in appearance, it first captures the eye of the narrator of François Cheng's novel. Then, once he begins to read, it captures his imagination and his heart. The book dates from the mid-seventeenth century, during the twilight of the Ming Dynasty. Barbarian armies are massing along the Empire's Northern borders, and a vast and sophisticated civilization-during whose heyday China had begun to emerge from its long isolation and undergone an explosion in the arts equal in its way to Europe's Renaissance-teeters on the brink of monumental and perhaps catastrophic change. Yet rather than filled with lore of military heroism, or with tales of palace intrigue, or with nostalgic memories of better days, the book tells a simple and very powerful love story.It opens to a spring day, when a middle-aged doctor named Dao-sheng leaves the mountaintop Taoist monastery where he has been living and sets out for the Region of the South, to the city he had once visited thirty years earlier and where his life had been irrevocably changed. He had then been a strapping but poor young musician traveling with theater troupe. One evening, during a performance, he caught the eye of well-born young woman named Lan-ying. Their contact lasted but a minute, but to them it felt like an eternity. For this act of audacity he was banished to hard labor by the girl's jealous fiancée, the dissipated scion of a powerful family, who had witnessed their exchange and grasped its significance. Across the decades of a life spent either on the run or hiding out in monasteries, where he mastered medicine and divination, Dao-sheng never forgot Lan-ying. One exchange of glances had sealed something forever, something whose enduring power would decide their fates.Written with radiant simplicity and wisdom, simultaneously heartbreaking and heart-warming, Green Mountain, White Cloud is a suspenseful tale of passion and revenge set against the backdrop of a great empire's last days. François Cheng gives us star-crossed lovers whose rekindled passion makes the pages of this novel glow. More than a love story, it takes us on a quest as much spiritual as physical, exploring the very essence of love's ageless and transformative power.",
  "genres": [
    "China",
    "Fiction",
    "France",
    "Historical Fiction",
    "Romance",
    "Asia",
    "French Literature"
  ],
  "author": "François Cheng",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/64324.Green_Mountain_White_Cloud"
}