{
  "title": "Een verhaal van liefde en duisternis",
  "description": "'Het hele huis werd in beslag genomen door boeken. Mijn vader kon zestien of zeventien talen lezen en elf spreken (allemaal met een Russisch accent). Mijn moeder sprak vier of vijf talen en las er zeven of acht. Ze spraken onder elkaar Russisch en Pools als ze wilden dat ik het niet begreep. (Meestal wilden ze dat ik het niet begreep. Toen mijn moeder een keer per ongeluk in het Hebreeuws in plaats van in een andere taal \"dekhengst\" zei waar ik bij was, berispte mijn vader haar in woedend Russisch: Tsjto s toboj?! Vidisj maltsjik rjadom s nami! - Wat bezielt je?! Je ziet toch dat de jongen erbij is!) Uit culturele overwegingen lazen ze vooral Duitse en Engelse boeken, en dromen deden ze vast en zeker in het Jiddisj. Maar mij leerden ze uitsluitend en alleen Hebreeuws: misschien waren ze bang dat talenkennis ook mij zou blootstellen aan de verleidingen van het schitterende, dodelijke Europa.'Amos Oz groeit op als enig kind van een afstandelijke, rationele vader en een romantische, depressieve moeder, in een kleine, volgepakte woning waar boeken de hoofdbewoners zijn. Zijn familieleden observeert hij als waren ze tragikomische personages uit het werk van Tsjechov en Tolstoj. Wanneer hij twaalf is, pleegt zijn moeder zelfmoord, een gebeurtenis waarover hij vervolgens jarenlang zwijgt en die zijn verdere leven tekent.In Een verhaal over liefde en duisternis ontrafelt en onthult Amos Oz het verleden dat tot deze daad zal leiden. Het is een fenomenaal geschreven boek, vol prachtige metaforen, humor en tederheid. Op meesterlijke wijze vervlecht hij het verhaal van zijn persoonlijke leven met honderdtwintig jaar familiegeschiedenis, die begint in Odessa en via Polen en Praag eindigt in het door vluchtelingen, pioniers en Holocaust-overlevenden bevolkte Israël.",
  "genres": [
    "Israel",
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "Jewish",
    "Literature"
  ],
  "author": "Amos Oz",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/6434617-een-verhaal-van-liefde-en-duisternis"
}