{
  "title": "My Visit To Venus",
  "description": "Legendary journalist Sean Casteel comments about MY VISIT TO VENUS. . . T. Lobsang Rampa is a legendary spiritual leader whose gifts to humanity have continued to offer his readers a true and trustworthy vision of the wondrous worlds that lie just within reach of our own. More than 20 years after his death, Rampa's writings still manage to touch the heart with their uncannily realistic stories about the Astral Plane, the marvels of outer space, and the beauty of the Tibet he loved so much. \"My Visit To Venus\" is an excellent example of Rampa's unique genius. It begins with a section of commentary by well-known researcher and author John Keel. Keel gives the reader a short course in Rampa's life story, including the engrossing tale of how Rampa became what may have been the first modern case of the Walk-In phenomenon. How a struggling British writer was transformed into a venerated New Age teacher and spiritual adventurer is beautifully told by Keel in his customary wonderful prose. A general history of the abduction phenomenon through history is also included, which helps put Rampa's experiences in the context of mankind's age-old hand-in-hand stroll with the unknown. Next comes an introduction by Gray Barker, one of the early pioneers of UFO research. Barker discusses his decision to publish some of Rampa's earliest work and gives a detailed account of the controversy that accompanied the publication of \"The Third Eye,\" Rampa's first book. Both Tibetans and the British media were up in arms about it, calling it a fraudulent piece of work and claiming that Rampa had never been to Tibet at all. Rampa answered his critics by saying that while he had never been there in his present body, the spirit of a Tibetan lama had entered his body under unusual circumstances. Barker's introduction also includes testimony from Rampa's wife as to the reality of the extreme personality changes in Rampa after the lama had moved in. From that fascinating beginning, the book moves on to Rampa's own telling of the tale, which this time around features a journey to the planet Venus, as the title implies.",
  "genres": [],
  "author": "T. Lobsang Rampa",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/643226.My_Visit_To_Venus"
}