{
  "title": "Sickles at Gettysburg: The Controversial Civil War General Who Committed Murder, Abandoned Little Round Top, and Declared Himself the Hero of Gettysburg",
  "description": "Finalist, 2009, Army Historical Foundation Distinguished Book AwardWinner, 2009, The Bachelder-Coddington Literary Award, given by the Robert E. Lee Civil War Round Table of Central New Jersey.Winner, 2009, Gettysburg Round Table's Distinguished Book Award. Sickles at Gettysburg: The Controversial Civil War General Who Committed Murder, Abandoned Little Round Top, and Declared Himself the Hero of Gettysburg, by licensed battlefield guide James Hessler, is the most deeply-researched, full-length biography to appear on this remarkable American icon. And it is long overdue.No individual who fought at Gettysburg was more controversial, both personally and professionally, than Major General Daniel E. Sickles. By 1863, Sickles was notorious as a disgraced former Congressman who murdered his wife's lover on the streets of Washington and used America's first temporary insanity defense to escape justice. With his political career in ruins, Sickles used his connections with President Lincoln to obtain a prominent command in the Army of the Potomac's Third Corps--despite having no military experience. At Gettysburg, he openly disobeyed orders in one of the most controversial decisions in military history.No single action dictated the battlefield strategies of George Meade and Robert E. Lee more than Sickles' unauthorized advance to the Peach Orchard, and the mythic defense of Little Round Top might have occurred quite differently were it not for General Sickles. Fighting heroically, Sickles lost his leg on the field and thereafter worked to remove General Meade from command of the army. Sickles spent the remainder of his checkered life declaring himself the true hero of Gettysburg.Although he nearly lost the battle, Sickles was one of the earliest guardians of the battlefield when he returned to Congress, created Gettysburg National Military Park, and helped preserve the field for future generations. But Dan Sickles was never far from scandal. He was eventually removed from the New York Monument Commission and nearly went to jail for misappropriation of funds.Hessler's book is a balanced and entertaining account of Sickles' colorful life. Civil War enthusiasts who want to understand General Sickles' scandalous life, Gettysburg's battlefield strategies, the in-fighting within the Army of the Potomac, and the development of today's National Park will find Sickles at Gettysburg a must-read.About the Author: James A. Hessler works in the financial services industry and is a Licensed Battlefield Guide at Gettysburg National Military Park. He has taught Sickles and Gettysburg-related courses for Harrisburg Area Community College and the Gettysburg Foundation. In addition to writing articles for publication, Hessler speaks regularly at Civil War Round Tables. A native of Buffalo, NY, he resides in Gettysburg with his wife and children.",
  "genres": [
    "Civil War",
    "History",
    "Biography",
    "Nonfiction",
    "American Civil War",
    "War",
    "American History"
  ],
  "author": "James A. Hessler",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/6435517-sickles-at-gettysburg"
}