{
  "title": "Life Without Lottie",
  "description": "The intense, very personal and deeply moving true story of how one mother coped (or didn't) after saying a nightmare goodbye to her only daughter leaving for her gap year. After the farewell hugs and tears, the story moves on to the very personal account of how Fiona Fridd coped, sometimes well, sometimes not at all with the emotional strain of being parted from someone so precious.Whether you are a mother, father, brother or sister, you will discover through the sense of loss Fiona conveys in this roller coaster ride of a story what it is like to be parted from a loved member of your family for the very first time. Being parted from Lottie in such circumstances was like enduring bereavement but without a body to mourn, leaving Fiona wondering how long it would take for her pain to ease. Contact between mother and daughter was chiefly maintained by text and email, most of which are transcribed, word-for-word. These build up into a fascinating picture of the realities of backpacker life 'down under'.Email from I've quit the Oxfam job. It turned out that working for them basically means you're a glorified promotions girl and to get people to sign up they tell you to make guys think they can sleep with you! I was told to say stupid stuff like 'Hey guys, why don't you come and talk to me, I'll make it worth your while'. Anyway, must dash as almost run out of internet credit! Missing you all lots and lots! XoxFiona 'It wasn't until months later that I discovered just how badly affected Lottie had been by the Oxfam job. At the end of her second day of standing on street corners she had phoned David in floods of tears. He and Stu hotfooted it into Sydney and found her in a dreadful state. All she wanted to do was come home there and then and quit the remainder of her gap year.'",
  "genres": [],
  "author": "FIONA FIRDD",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/6438111-life-without-lottie"
}