{
  "title": "Made in China: Women Factory Workers in a Global Workplace",
  "description": "As China has evolved into an industrial powerhouse over the past two decades, a new class of workers has the dagongmei , or working girls. The dagongmei are women in their late teens and early twenties who move from rural areas to urban centers to work in factories. Because of state laws dictating that those born in the countryside cannot permanently leave their villages, and familial pressure for young women to marry by their late twenties, the dagongmei are transient labor. They undertake physically exhausting work in urban factories for an average of four or five years before returning home. The young women are not coerced to work in the factories; they know about the twelve-hour shifts and the hardships of industrial labor. Yet they are still eager to leave home. Made in China is a compelling look at the lives of these women, workers caught between the competing demands of global capitalism, the socialist state, and the patriarchal family. Pun Ngai conducted ethnographic work at an electronics factory in southern China’s Guangdong province, in the Shenzhen special economic zone where foreign-owned factories are proliferating. For eight months she slept in the employee dormitories and worked on the shop floor alongside the women whose lives she chronicles. Pun illuminates the workers’ perspectives and experiences, describing the lure of consumer desire and especially the minutiae of factory life. She looks at acts of resistance and transgression in the workplace, positing that the chronic pains—such as backaches and headaches—that many of the women experience are as indicative of resistance to oppressive working conditions as they are of defeat. Pun suggests that a silent social revolution is underway in China and that these young migrant workers are its agents.",
  "genres": [
    "China",
    "Nonfiction",
    "Anthropology",
    "Feminism",
    "Asia",
    "Ethnography",
    "Labor"
  ],
  "author": "Pun Ngai",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/643573.Made_in_China"
}