{
  "title": "No Quarter: The Battle of the Crater, 1864",
  "description": "In this richly researched and dramatic work of military history, eminent historian Richard Slotkin recounts one of the Civil War’s most pivotal the Battle of the Crater on July 30, 1864. At first glance, the Union’s plan seemed A regiment of miners would burrow beneath a Confederate fort, pack the tunnel with explosives, and blow a hole in the enemy lines. Then a specially trained division of African American infantry would spearhead a powerful assault to exploit the breach created by the explosion. Thus, in one decisive action, the Union would marshal its mastery of technology and resources, as well as demonstrate the superior morale generated by the Army of the Potomac’s embrace of emancipation. At stake was the chance to drive General Robert E. Lee’s Army of North Virginia away from the defense of the Confederate capital of Richmond–and end the war.The result was something far different. The attack was hamstrung by incompetent leadership and political infighting in the Union command. The massive explosion ripped open an immense crater, which became a death trap for troops that tried to pass through it. Thousands of soldiers on both sides lost their lives in savage trench warfare that prefigured the brutal combat of World War I. But the fighting here was intensified by racial hatred, with cries on both sides of “No quarter!” In a final horror, the battle ended with the massacre of wounded or surrendering Black troops by the Rebels–and by some of their White comrades in arms. The great attack ended in bloody failure, and the war would be prolonged for another year.With gripping and unforgettable depictions of battle and detailed character portraits of soldiers and statesmen, No Quarter compellingly re-creates in human scale an event epic in scope and mind-boggling in its cost of life. In using the Battle of the Crater as a lens through which to focus the political and social ramifications of the Civil War–particularly the racial tensions on both sides of the struggle–Richard Slotkin brings to readers a fresh perspective on perhaps the most consequential period in American history.",
  "genres": [
    "Civil War",
    "History",
    "Nonfiction",
    "American Civil War",
    "American History",
    "War",
    "Military Fiction"
  ],
  "author": "Richard Slotkin",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/6435497-no-quarter"
}