{
  "title": "A Monster's Notes",
  "description": "What if Mary Shelley had not invented Frankenstein’s monster but had met him when she was a girl of eight, sitting by her mother’s grave, and he came to her unbidden? What if their secret bond left her forever changed, obsessed with the strange being whom she had discovered at a time of need? What if he were still alive in the twenty-first century?This bold, genre-defying book brings us the “monster” in his own words. He recalls how he was “made” and how Victor Frankenstein abandoned him. He ponders the tragic tale of the Shelleys and the intertwining of his life with that of Mary (whose fictionalized letters salt the narrative, along with those of her nineteenth-century intimates) in this riveting mix of fact and poetic license. He takes notes on all aspects of human striving—from the music of John Cage to robotics to the Northern explorers whose lonely quest mirrors his own—as he tries to understand the strange race that made yet shuns him, and to find his own freedom of mind.In the course of the monster’s musings, we also see Mary Shelley’s life from her childhood through her elopement with Percy Bysshe Shelley, her writing of Frankenstein, the births and deaths of her children, Shelley’s famous drowning, her widowhood, her subsequent travels and life’s work, and finally her death from a brain tumor at age fifty-four. The monster’s fierce bond with Mary and the tale of how he ended up in her fiction is a haunted, intense love story, a story of two beings who can never forget each other.A Monster’s Notes is Sheck’s most thrilling work to date, a luminous meditation on creativity and technology, on alienation and otherness, on ugliness and beauty, and on our need to be understood.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Historical Fiction",
    "Horror",
    "Retellings",
    "Poetry",
    "Novels"
  ],
  "author": "Laurie Sheck",
  "average_rating": "2.91",
  "url": "https://www.goodreads.com/book/show/6436536-a-monster-s-notes"
}