{
  "title": "LOVE The Beat Goes On",
  "description": "When you write a memoir, there's no place to hide.author Lynda Filler \"Powerful and unforgettable\" JackMagnus, 5 Star Readers' Favorite\"This is a book every human alive should read and take away the lessons given. If I could give it ten stars, I would. It's that good.\"J. SikesWhen your cardiologist tells you to “Get your affairs in order, your heart condition is incurable,” what do you do? Lynda shares her personal story in the typical fast-paced, edgy, in-your-face style she’s known for in her writing. She will walk you through her journey to self-love sharing her belief in journals, love, prayer, soul, spirituality, and positive mindset. She’s hard-hitting but compassionate. She writes about romantic experiences that may shock you but makes no apologies for her unconventional lifestyle. Nor does she hold back taking responsibility for the things that she believes created her dis-ease. You will definitely question a woman who walks around in denial; then makes a decision to drive, all alone, from Puerto Vallarta, Mexico to Whistler, Canada with undiagnosed Idiopathic Dilated Cardiomyopathy. Men and women are often self-care-challenged and Lynda was no the exception.If you are fighting any kind of illness or dis-ease, you are not alone! Lynda has walked her talk, and after an experience in the summer of 2015 relating to Dr. Wayne Dyer, she is now ready to release her storyLynda knows how it feels to be told you’re not healing or your condition is incurable. At no point will she undermine anything your physicians tell you to do. She is not a medical doctor. She will explain the powerful, yet simple concepts, beliefs, balance and faith that she believes led to her healing. Most of all, she will show you how she used these simple principles to design and live, the fully healed life she now enjoys in 2017.You will shake your head in wonder, laugh, and maybe cry too. If you want less pain, worry, and stress about dis-ease and life in general, you will want to read this simple yet powerful story.",
  "genres": [],
  "author": "Lynda Filler",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/64406473-love-the-beat-goes-on"
}