{
  "title": "Apex Predator",
  "description": "The Game Series • Book 11 • Primal Play • MMMM • D/s • Second Chances • Hurt Comfort • Vacation Romance Pack your sunscreen and strap in for a wild ride and a kinky vacation that doesn’t go as planned.Lane Sawyer had no complaints. Not really, anyway. After all, he’d just been invited to spend a week down in sunny Florida with his amazing boyfriend Macklin and some of his kinkster buddies. That was exactly what Lane needed. Uncomplicated fun and the promise of no drama—and hopefully a close encounter or two with the apex predator of the Everglades, the Burmese python. He loved, loved, loved reptiles.But Florida was home to more than one apex predator. When Lane arrived, he found himself face-to-face with their host for the week, his high school girlfriend’s dad. The man who’d once made Lane realize he was into men.Macklin McKenna couldn’t wait to get away. The problem was, he needed a vacation from himself more than DC. But maybe a week in South Florida with his friends and his adoring boyfriend Lane could distract him from the fact that he was never getting over the man he was still technically married to.Unfortunately, Macklin’s friends were fed up with his personal agony, and they’d ensured another apex predator was on his way down South.-The Game Series is a BDSM series where romance meets the reality of kink. Sometimes we fall for someone we don’t match with, sometimes vanilla business gets in the way of kinky pleasure, and sometimes we have to compromise and push ourselves to overcome trauma and insecurities. No matter what, one thing is certain. This is not a perfect world—and maybe that’s why the happily ever after feels so good.The characters in the Game Series cross over in multiple books, as we follow not only new love interests but the background friendships and dynamics of a thriving kink community. The story of Lane, Ty, Macklin, and Walker begins here—but if you’re interested in secondary characters and the Mclean House journey, you won’t regret starting at the beginning.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Contemporary",
    "M M M",
    "Second Chance",
    "Romance",
    "Polyamory"
  ],
  "author": "Cara Dee",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/64405811-apex-predator"
}