{
  "title": "THE IDEATION EQUATION: How a Handful of Habits Can Make You a Creative Genius",
  "description": "What if the POWER OF HABIT is what determines the POWER OF YOUR MIND?\nThe Ideation Equation\n establishes the core habits for becoming a highly creative thinker, similar to how other books focused on habits have helped millions of people to become better leaders, improve their general efficiency, enjoy superior health, have better relationships, and countless other great things.Through insights from neuroscience, psychology, and social science, as well as the author's own experience, this book examines the link between our habits and how we get the most amazing ideas, and provides a clear blueprint for more creative thinking in the process. It is an intense and deeply engaging learning experience, but also a joyful read, and not seldom funny.The Ideation Equation enables you Use creative thinking techniques already embedded in your brain;Explore the path to groundbreaking ideas used by Nobel Laureates, iconic inventors, and tech billionaires;Understand complex neuroscience concepts through engaging analogies;Unlock the potential of your own mind by learning new behaviors;See how your own creative mind works, so that you can use it at will. If you want to get past the platitudes, to 'think outside the box', 'connect the dots', and 'fail fast', to discover where and what these sayings are derived from, and what the true implications are for ideation and innovation, then this book is for you!Read The Ideation Equation and unleash your best thinking!Readers of The Ideation Equation come from all kinds of backgrounds and have diverse goals and needs motivating them. But the common interest is to find an actionable way, through habits, to more creative thinking. This is not least illustrated by the many different books recommended by readers, such as Atomic Habits, 7 Habits of Highly Effective People and The Power of Habit. But as well complementary works about exploring the mind, among them The Way of Zen, The Silva Method, The Master and His Emissary, and How to Meet Your Self.There is a creative genius inside your mind, waiting to be unleashed! The surprising fact for most people, is that it is doing everyday things differently that will lead to thinking differently, and much more creativity. The Ideation Equation is the ultimate habits book to design a lifestyle to make time to think and grow into the creative genius you really are!\"Absolutely brilliant in every way. Get a copy of it immediately and never look back!\"- Jonathan MacDonald, Sunday Times Bestselling Author of Leading Change",
  "genres": [],
  "author": "Linus Bille",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/64399952-the-ideation-equation"
}