{
  "title": "بيوغرافيا الجوع",
  "description": "تلك كانت أولى سنواتي الدراسية الجدية، ذلك أن الـ\"ليسه فرانسه\" في نيويورك مختلفة كل الاختلاف عن المدرسة الفرنسية في بكين. مؤسسة متكلفة الرقي، رجعية المبادئ، تزدري المؤسسات التعليمية الأخرى. فيها مدرسون متعجرفون يفهموننا كيف ينبغي لنا أن نتصرف بوصفنا نخبة. كنت لا أبالي بترهات كتلك الترهات. وكانت حجرة الصف مكتظة بأولاد يثيرون في نفسي الفضول فلا أكف عن مراقبتهم بكثير من الدهشة. غالبيتهم من الفرنسيين وإن كان في عدادهم بعض الأميركيين لأن ارتياد الـ\"ليسه فرانسه\"، في نظر أهل نيويورك، يمثل ذروة الترقي الاجتماعي. لم يكن بين التلاميذ أي بلجيكي آخر. ظاهرة خبرتها بشيء من الفضول في أنحاء أخرى من العالم: إذ لطالما كنت التلميذة البلجيكية الوحيدة بين أترابي، الأمر الذي جعلني عرضة لفنون متنوعة من السخرية كنت أنا أول المستمتعين بطرافتها. كان ذلك في الفترة التي لم يشهد فيها دماغي أية أعطال. غذ لا تستغرقه عمليات ضرب الكميات الصماء أكثر من ثانية واحدة مع تعداد كسورها بنبرة تنم عن السأم لشدة يقيني من صحتها. أما دروس قواعد اللغة فكانت لي كشرب الماء، فالجهل صفة تجهلها نفسي، لأن الأطلس بطاقة هويتي واللغات اصطفتني برج بابلها. كان من شأن ذلك أن يعمي بصيرتي بالغرور لولا وفائي لعدم اكتراثي بالتميز. وكان المدرسون يهللون لنباهتي سائلين المرة تلو المرة: هل أنت واثقة ن كونك بلجيكية الجنسية؟ فأجيب المرة تلو المرة مبددة عذاب الريبة في روعهم بلى، وأمي أيضاً بلجيكية، وأجدادي وأجداد أجدادي. كان في هذا ما يزيد من حيرة مدرسي اللغة الفرنسية. فيما الصبية الصغار يرمقونني بنظرات الريبة كأنهم يقولون في سرهم: \"لا بد أن في الأمر خدعة\".والفتيات الصغيرات يرمقنني بنظرات معسولة. ذلك أن الأعراف النخبوية السائدة في المدرسة تغلب على مشاعرهم فضيلة الإقرار بالأمر الواقع، فيعلن، جهاراً، ومن دون لبس: \"أنت الأفضل، فهل تقبلين أن تكوني صديقتي؟\" لقد بلغت آميلي نوثومب مرتبة أكثر الكتاب مبيعاً بسرعة، وصارت روايات تنتظر بشغف من القراء الذين تعرفوا إلى أعمالها. تسرج نوثومب بلغة شيقة سلسة، وتقول أشياء كثيرة بلغة قليلة. في هذه الرواية، تأخذنا الكاتبة في رحلة تبدأ من اليابان ثم تعبر الصين وأميركا وبنغلادش والهند وكومبوديا، فيما هي تسرد حياة تبدو أنها حياتها منذ أن كانت طفلة حتى صارت \"الكاتبة\". وفي كل هذه المحطات نجد صوراً لا ندركها عبر الكتب، فهي الصور بعين آميلي نوثومب، وهي جاذبية السرد والروي بحرارة التحديات التي تصنع حياة المرء.",
  "genres": [
    "Fiction",
    "France",
    "Contemporary",
    "Roman",
    "Novels",
    "French Literature",
    "Literature"
  ],
  "author": "Amélie Nothomb",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/6439157"
}