{
  "title": "The King's Captive",
  "description": "I can turn into a housecat.It’s a fun magic, except in a world filled with vampires and werewolves, it doesn’t exactly make me a powerhouse. Instead, the supernatural community has classified me as an outcast, which means one thing: Picking on me is open season all day, every day.The local fae are the worst of all, and it’s during one of their regular “capture the cat-girl” sessions that I shift into my cat form and meet HIM for the first time.Noctus is so powerful his magic radiates off him like a sun, and my fae captors can barely look in his general direction. And then my life gets even more terrifying when Noctus decides to take me with him. As a pet.Why did he pick today to “adopt don’t shop” a cat?It gets worse when I realize he’s an elf, a ruling race of supernaturals that was supposedly killed off centuries ago.But he’s not just any elf, no. He’s an elven king, with heaps of secrets to protect. Secrets that I am quickly learning since he includes his new pet in everything from breaking into buildings to inspect classified paperwork to tracking down sketchy supernaturals.All this means if he gets even a hint that I’m not a real cat, I’m going to find out firsthand how elves treat their prisoners.So, escaping Noctus is priority #1. How hard can it be? (Answer: very.)King’s Captive is the first book in the Gate of Myth and Power urban fantasy trilogy, and is part of the Magiford Supernatural City world. It features elves, fae, werewolves, and vampires, and contains an adventure-filled and hilarious take on the Hades and Persephone myth. It’s packed with humor, battles, and a sweet, slow burn romance between an outcast magic user and the deadly king of the elves.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Fae",
    "Romance",
    "Magic",
    "Vampires"
  ],
  "author": "K.M. Shea",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/64401958-the-king-s-captive"
}