{
  "title": "Susix",
  "description": "Being abducted by aliens is terrifying. Everything after that? Pretty boring.Cece Levine didn’t believe in aliens. That is, right up until she was abducted. Life in space is not what she expected. She lives in a cage. She's left alone all the time. And the boredom is driving her insane.That is until a snake man sets her free, and she decides he is her best bet for getting off this crazy planet. Unfortunately, he and his crew think she's an exotic pet. It's not too bad. She's fed, can walk around, and can spy on her new shipmates. They’re actually pretty fun to be around. When pirates attack her new home, Cece realizes her new 'friends' might be more dangerous than she thought.With a Crown on the line, Vesex Forthusis will take any advantage he can to keep his Nest ahead of the rest. And alive. Although, that might be asking for too much.Vesex Forthusis has no desire to be the Sovereign of Susurex. However, he will fight to the death to become the leader of his planet if it means his people will stop starving and can have a chance to thrive. All he has to do is find the Crown of Versetti, one of his people’s most valuable artifacts, and deliver it back home. Too bad it was stolen eons ago, and every bloodthirsty Susix in the galaxy is trying to steal it.He and his nestmates will need to use every dirty trick they have to survive the journey. What they do not need is a stray pet running around distracting everyone. But when their ship gets ambushed, it becomes obvious that there is much more to their new pet than they initially thought.Will Cece and this misfit crew of snake men be able to work past their differences to survive an onslaught of aliens with murder on their minds?Author’s This is a slow-burn, why choose series...and by slow-burn, I mean glacial. There’s not much spice in this book, but some situations are intended for a mature audience. The smut doesn't arrive until book two.",
  "genres": [
    "Reverse Harem",
    "Science Fiction",
    "Aliens",
    "Slow Burn",
    "Romance",
    "Science Fiction Romance",
    "M M Romance"
  ],
  "author": "Amelia Rademaker",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/64414455-susix"
}