{
  "title": "A Heart Divided",
  "description": "(Gay / Romance / Historical / American Civil War) Confederate Lieutenant Anderson Blanks has grown weary of the War Between the States. He is all too aware of the tenuous thread that ties him to this earth--as he writes a letter home to his sister, he realizes he may be among the dead by the time she receives the missive. His melancholy mood is shared by other soldiers in the campsite; in the cool Virginia night, the pickets claim to hear ghosts in the woods, and their own talk spooks them. Andy knows the 'ghost' is nothing more than a wounded soldier left on the battlefield, dying in the darkness. With compassion, Andy takes the picket's lantern and canteen in the hopes of easing the soldier's pain. After a tense confrontation with the soldier, Andy is shocked to discover none other than Samuel Talley, a young man Andy's father had chased from their plantation when the romantic relationship between the two boys came to light. The last time the two had seen each other, Sam had been heading west to seek his fortune, and had promised to send for Andy when he could. Then the war broke out, and Andy had enlisted in the Confederate Army to help ease the financial burden at home. Apparently Sam had similar ideas--he now wears the blue coat of a Union solider. Sam is severely wounded and infection has begun to set in. Andy can't sneak him into his own camp for treatment because all Union soldiers are taken prisoner. But Andy's Confederate uniform prevents him from seeking help from the nearby Union camp, as well. It's up to Andy to tend his lover's wound and get Sam the help he needs before it's too late...and before Andy's compatriots discover Sam's presence...",
  "genres": [
    "Historical",
    "M M Romance",
    "Romance",
    "Historical Fiction",
    "LGBT",
    "Novella",
    "Military Fiction"
  ],
  "author": "J.M. Snyder",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/6441726-a-heart-divided"
}