{
  "title": "Little Bird",
  "description": "From USA Today bestselling author Jenika Snow comes a new full-length standalone dark mafia romance set in the Underworld Kings world.The first time I met Dmitry Petrov, he was making a deal for my sister’s hand in marriage with his brother.I should have hated him for that alone, but when he stopped my father from hitting me, my young heart felt something new and wonderful for the first time.It was this incurable sensation that consumed me at his protection.But he was nearly fifteen years older than me, more dangerous than any man I’d ever met, and only saw me as his sister-in-law’s younger sibling.And when he was arrested and thrown into jail, five long years passed. I refused to give up the notion that one day he’d see me as a woman—a woman he wanted. So I wrote to him daily, confided in him, told him about what was going on in my life, what I hated and loved. I did this all in the hopes he’d write back, wishing he’d want me the way I wanted him.But year after year passed with no response. Until that changed. Until he wrote back. Dmitry was cruel and harsh, saying things that should have made me cry. Not make me want him more.I knew I was playing with fire, sending a criminal pictures of myself after my eighteenth birthday, thinking about him as I did private things alone in my room. But he was a virus deep inside of me, and there was no cure for what I had.And then my life completely changed when my brother tried to marry me off. I refused to be a pawn in the mafia world, and so my only option was to leave the only home I’d ever known.But when Dmitry’s released from prison, I came face-to-face with the Russian mafia leader everyone fears. And he made one thing very clear.I’m his. He’s taking me. And anyone who tries to stop him will die.",
  "genres": [
    "Dark Romance",
    "Mafia Romance",
    "Romance",
    "Dark",
    "Contemporary Romance",
    "Contemporary",
    "Slow Burn"
  ],
  "author": "Jenika Snow",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/64435515-little-bird"
}