{
  "title": "Moth and Flame",
  "description": "Benjamin Justice used to be one of Los Angeles's most respected journalists, but a scandal over invented sources cost him the Pulitzer, his job and his reputation. With his life in ruins, he's spent much of the past decade slowly piecing it back together. Now he's under contract to write his biography, but the writing is going slowly and he's in need of a job to tide him over financially. So when Bruce Bibby, a freelance writer, is murdered during an apparent burglary, Bibby's uncompleted assignment for the city of West Hollywood is a much needed opportunity for Justice. Hired to complete the dead man's assignment-researching and writing a booklet on the city's historically relevant buildings - Justice resists becoming involved in the murder investigation, wanting only to maintain his quiet, stable life. But it's not going to be that easy. There's a fight brewing over the fate of a set of rundown cottages - some believe them historically significant and wish to preserve them, others want them torn down to make way for a new condo project and both sides see Justice's pamphlet as the key to winning the fight. As Justice tries to go about his business, he finds himself intrigued by the complexities of the murder case - the young Russian immigrant tied to the Bibby murder scene may be damned by his father's notorious crimes; the detective leading the murder investigation is quietly searching for her own long missing father; the owner of the houses in question, the would-be developer, and their main opposition all share a secret connection that dates back nearly three decades. When the leader of the local preservation group is found murdered on the grounds of the controversial cottages, Justice must unravel the secrets that surround the murders or let an innocent suffer for another's crimes.",
  "genres": [
    "Mystery",
    "LGBT",
    "Gay",
    "Fiction",
    "M M Romance",
    "Suspense",
    "Thriller"
  ],
  "author": "John Morgan Wilson",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/644218.Moth_and_Flame"
}