{
  "title": "Born Round: The Secret History of a Full-time Eater",
  "description": "The New York Times restaurant critic's heartbreaking and hilarious account of how he learned to love food just enough after decades of wrestling with his weightFrank Bruni was born round. Round as in stout, chubby, and hungry, always and endlessly hungry. He grew up in a big, loud Italian family in White Plains, New York, where meals were epic, outsize affairs. At those meals, he demonstrated one of his foremost qualifications for his future career: an epic, outsize appetite for food. But his relationship with eating was tricky, and his difficulties with managing it began early.When he was named the restaurant critic for the New York Times in 2004, he knew enough to be nervous. He would be performing one of the most closely watched tasks in the epicurean universe; a bumpy ride was inevitable, especially for someone whose writing beforehand had focused on politics, presidential campaigns, and the Pope.But as he tackled his new role as one of the most loved and hated tastemakers in the New York restaurant world, he also had to make sense of a decades-long love-hate affair with food, which had been his enemy as well as his friend. Now he’d have to face down this enemy at meal after indulgent meal. His Italian grandmother had often said, \"Born round, you don’t die square.\" Would he fall back into his worst old habits? Or had he established a truce with the food on his plate?In tracing the highly unusual path Bruni traveled to become a restaurant critic, Born Round tells the captivating story of an unpredictable journalistic odyssey and provides an unflinching account of one person’s tumultuous, often painful lifelong struggle with his weight. How does a committed eater embrace food without being undone by it? Born Round will speak to every hungry hedonist who has ever had to rein in an appetite to avoid letting out a waistband, and it will delight anyone interested in matters of family, matters of the heart, and the big role food plays in both.",
  "genres": [
    "Memoir",
    "Food",
    "Nonfiction",
    "Biography",
    "Biography Memoir",
    "Audiobook",
    "Autobiography"
  ],
  "author": "Frank Bruni",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/6449638-born-round"
}