{
  "title": "Emma of 83rd Street",
  "description": "In this witty and romantic debut novel, Jane Austen’s Emma meets the misadventures of Manhattan’s modern dating scene as two lifelong friends discover that, in the search for love, you sometimes don’t have to look any further than your own backyard.Beautiful, clever, and rich, Emma Woodhouse has lived twenty-three years in her tight-knit Upper East Side neighborhood with very little to distress or vex her…that is, until her budding matchmaking hobby results in her sister’s marriage—and subsequent move downtown. Now, with her sister gone and all her friends traveling abroad, Emma must start her final year of grad school grappling with an entirely new emotion: boredom. So when she meets Nadine, a wide-eyed Ohio transplant with a heart of gold and drugstore blonde highlights to match, Emma not only sees a potential new friend but a new project. If only her overbearing neighbor George Knightley would get out of her way.  Handsome, smart, and successful, the only thing that frustrates Knightley more than a corked whiskey is his childhood friend, Emma. Whether it’s her shopping sprees between classes or her revolving door of ill-conceived hobbies, he is only too happy to lecture her on all the finer points of adulthood she’s so hellbent on ignoring. But despite his gripes—and much to his own chagrin—Knightley can’t help but notice that the girl-next-door is a woman now…one who he suddenly can’t get out of his head.  As Emma’s best laid plans collide with everyone from polyamorous hipster baristas to meddling family members to flaky playboy millionaires, these two lifelong friends slowly realize their need to always be right has been usurped by a new need entirely, and it’s not long before they discover that even the most familiar stories still have some surprises.",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Retellings",
    "Audiobook",
    "Chick Lit",
    "Contemporary Romance"
  ],
  "author": "Audrey Bellezza",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/64457334-emma-of-83rd-street"
}