{
  "title": "The Flames: A Fantasy",
  "description": "The Flames was Stapledon's last major work of fiction before he died. After having narrowed his scope from the huge cosmic histories of Last and First Men (history of humanity) and Star Maker (history of the universe, Dante-esque cameo by God at the end) to the earthbound Odd John (super-man) and Sirius (super-dog), The Flames reads like an attempt to stuff them all into a 50-page novella. It's supremely confused, but the evident moroseness of an author who, in the face of a second world war, has decided that his imagination will not help, gives The Flames an immediacy that you never see in other top-flight fantasists like Borges. It is written in Stapledon's trademark stiff prose, which places it stylistically closer to H.G. Wells than to any contemporaneous science fiction originating from the United States' pulps, and if Stapledon had read any of them, it doesn't show. Even though Stapledon had rejected Wells for being too cynical, The Flames has a sludgy melancholy that allows joy only in the most ironic way. The story consists of three segments, each of which undercuts the last. In the first, the sensitive narrator talks to a \"flame\" in a burning stone who tells of life on the sun and subsequent exile when the planets were formed, with a polite dispassion not so far from that of Hal Clement. Despite some ill-fitting foreshadowing, the revelations in the second part that the flames are hellbent on manipulating humanity to help them thrive and pursue their spiritual aims, through mind control if necessary. To this end the flame reveals that he and his comrades caused the narrator's wife to commit suicide, so the narrator could devote himself fully to his studies and establish contact with the flames. This is all vaguely silly and melodramatic, and trivializes the first section. I don't know if Stapledon read Charles Fort, but he treads on similar territory here, and with no better luck than Fort or Eric Frank Russell in The Sinister Barrier. But in the third segment, Stapledon plays down the mind-control aspect and the particulars of the flames' existence to focus on their religious history, which is a rewrite of the tail end of Star Maker: advanced beings, including the flames, join into a single cosmic mind that then searches the total vision of reality. This time, though, the revelation of the total indifference of the Maker (who, while not quite absent, is not as personified as it is in Star Maker) is catastrophic and the cosmic mind collapses. Star Maker ended with a little homily on the significance of humanity's efforts; \"The Flames\" ends with the flames deciding that a Loving God is such a great idea that He must exist, and stupidly start the whole process up again, killing the narrator in the process for questioning them. All this comes as a shock after the first two parts, which had alluded to the flames' abstract spirituality but had only used it as a differentiating point between their minds and human emotional experience. Stapledon suddenly seems possessed by a need to rewrite his previous optimism from fifteen years before. The only hint of this comes late in the first segment, where, after receiving a noetic emotional experience from the flames (a great idea that Stapledon abandons), the narrator thinks he's seen God, and the flame responds, in what sounds like a rebuke from Stapledon to his younger self: Just because you have had an exciting and clarifying experience you persuade yourself that you must have had a revelation of the heart of the universe. source: www.waggish.org",
  "genres": [
    "Science Fiction",
    "Speculative Fiction",
    "Fiction"
  ],
  "author": "Olaf Stapledon",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/6445312-the-flames"
}