{
  "title": "The Oxford Illustrated History of the Crusades",
  "description": "In The Oxford Illustrated History of the Crusades , the story of the Crusades is told as never before in an engrossing, authoritative, and comprehensive history that ranges from the preaching of the First Crusade in 1095 to the legacy of the crusading ideals and imagery that continues today.Here are the ideas of apologists, propagandists, and poets about the Crusades, as well as the perceptions and motives of the crusaders themselves and the means by which they joined the movement.The authors describe the elaborate social and civic systems that arose to support the Crusades--taxation, for example, was formalized by the Church and monarchs to raise enormous funds needed to wage war on this scale. And here are vivid descriptions of the battles themselves, frightening,disorienting, and dangerous affairs, with keen and insightful commentary on the reactions of the Muslims to a Christian holy war. Extensively illustrated with hundreds of photographs, paintings, drawings, maps, chronologies, and a guide to further reading, The Oxford Illustrated History of theCrusades even includes coverage of crusades outside the eastern Mediterranean region and post-medieval crusades.From descriptions of the battles and homefront conditions, to a thorough evaluation of the clash (and coalescence) of cultures, to the legacy of the crusading movement that continues into our conflict-torn twentieth-century, to the enduring artistic and social changes that the Crusades wrought,The Oxford Illustrated History of the Crusades offers an informative, engaging, and unsurpassed panorama of one of the great movements in western history.",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Religion",
    "Medieval History",
    "Reference",
    "Military History"
  ],
  "author": "Jonathan Riley-Smith",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/64537.The_Oxford_Illustrated_History_of_the_Crusades"
}