{
  "title": "Wrestling with Moses: How Jane Jacobs Took On New York's Master Builder and Transformed the American City",
  "description": "To a young Jane Jacobs, Greenwich Village, with its winding cobblestone streets and diverse makeup, was everything a city neighborhood should be. The activist, writer, and mother of three grew so fond of her bustling community that it became a touchstone for her landmark book The Death and Life of Great American Cities. But consummate power broker Robert Moses, the father of many of New York’s most monumental development projects, saw things differently: neighborhoods such as Greenwich Village were badly in need of “urban renewal.” Notorious for exacting enormous human costs, Moses’s plans had never before been halted–not by governors, mayors, or FDR himself, and certainly not by a housewife from Scranton.The epic rivalry of Jacobs and Moses, played out amid the struggle for the soul of a city, is one of the most dramatic and consequential in modern American history. In Wrestling with Moses, acclaimed reporter and urban planning policy expert Anthony Flint recounts this thrilling David-and-Goliath story, the legacy of which echoes through our society today.The first ordinary citizens to stand up to government plans for their city, Jacobs and her colleagues began a nationwide movement to reclaim cities for the benefit of their residents. Time and again, Jacobs marshaled popular support and political power against Moses, whether to block traffic through her beloved Washington Square Park or to prevent the construction of the Lower Manhattan Expressway, a ten-lane elevated superhighway that would have destroyed centuries-old streetscapes and displaced thousands of families and businesses.Like A Civil Action before it, Wrestling with Moses is the tale of a local battle with far-ranging significance. By confronting Moses and his vision, Jacobs forever changed the way Americans understood the city, and inspired citizens across the country to protest destructive projects in their own communities. Her story reminds us of the power we have as individuals to confront and defy reckless authority.",
  "genres": [
    "History",
    "Urban Planning",
    "Nonfiction",
    "Politics",
    "Biography",
    "New York",
    "Cities"
  ],
  "author": "Anthony Flint",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/6451819-wrestling-with-moses"
}