{
  "title": "Annie Freeman's Fabulous Traveling Funeral",
  "description": "The beloved author of Dancing Naked at the Edge of Dawn  returns with the story of five women who had nothing in common but one extraordinary friend. . . .“Move over, Thelma, and make way, Louise!  Annie Freeman's raucous and heart-tugging journey to eternity will put Kris Radish on the map—in a RED Cadillac!”—Jacquelyn Mitchard, author of The Deep End of the OceanFor Katherine Givens and the four women about to become her best friends, the adventure begins with a UPS package. Inside is a pair of red sneakers filled with ashes and a note that will forever change their lives. Katherine’s oldest and dearest friend, the irrepressible Annie Freeman, left one final request—a traveling funeral—and she wants the most important women in her life as “pallbearers.”From Sonoma to Manhattan, Katherine, Laura, Rebecca, Jill, and Marie will carry Annie’s ashes to the special places in her life. At every stop there’s a surprise encounter and a small miracle waiting, and as they whoop it up across the country, attracting interest wherever they go, they share their deepest secrets—tales of broken hearts and second chances, missed opportunities and new beginnings. And as they grieve over what they’ve lost, they discover how much is still possible if only they can unravel the secret Annie left them. . . .Praise for Annie Freeman’s Fabulous Traveling Funeral“Radish’s characters help readers realize they are not alone in the world and their struggles have been or will be experienced by other women.” — Albuquerque Journal“Radish sings the praises of sisterhood by creating an enticing world of women helping women to become the empowered individuals they were meant to be.” — Booklist",
  "genres": [
    "Fiction",
    "Book Club",
    "Chick Lit",
    "Humor",
    "Contemporary",
    "Friendship",
    "Adult Fiction"
  ],
  "author": "Kris Radish",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/129579.Annie_Freeman_s_Fabulous_Traveling_Funeral"
}