{
  "title": "Sexuality and Socialism: History, Politics, and Theory of LGBT Liberation",
  "description": "Sexuality and Socialism is a remarkably accessible analysis of many of the most challenging questions for those concerned with full equality for lesbian, gay, bisexual, and transgender (LGBT) people. Inside are essays on the roots of LGBT oppression, the construction of sexual and gender identities, the history of the gay movement, and how to unite the oppressed and exploited to win sexual liberation for all. Sherry Wolf analyzes different theories about oppression—including those of Marxism, postmodernism, identity politics, and queer theory—and challenges myths about genes, gender, and sexuality. “ Sexuality and Socialism is the most intelligent and enlightened discussion on sexuality to come from the Left in a long time. No other work that comes to my mind explains the history of sexuality and sexual repression in the United States as comprehensively and compellingly.”— Ron Jacobs , Dissident Voice “Sherry Lesbian, Activist, Communist & Badass-ist... spoke to a pre-National Equality March rally. She. Blew. It. Up.”— Austin Chronicle “Sherry speaks with such eloquence and plain common sense that I can't help but want to know more about her ideas and convictions.”— Derek Washington , “In the LV” radio host, Director of LGBT Outreach, Clark County Democratic Black Caucus “The icons of the new generation of activists are people like Lady Gaga, Dustin Lance Black, Judy Shephard, Lt. Daniel Choi (ret.) and Sherry Wolf (author of Sexuality and Socialism ).”— Don Gorton , Join the Impact Board Member “Surprisingly funny, very readable and a fitting tome for a new movement in these troubled times.”— Dave Zirin for Progressive 's Best Books of 2009 “‘What humans have constructed they can tear down.’ This is the powerful insight of this rare book that is at once politically important, theoretically and historically sophisticated, and clearly written. Sexuality and Socialism is enlivened in its engagement with a number of controversies, including those over the alleged biological determination of homosexuality, the myth of Black homophobia, and the consequences of postmodernist theories for the politics of gay liberation. Above all else, Wolf puts forward a cogent defense of the Marxist tradition—long and wrongly reviled as homophobic in itself—as a way to explain how LGBT oppression arose and what we can do to put it to bed.”— Dana Cloud , University of Texas at Austin Sherry Wolf is the associate editor of the International Socialist Review. She was on the executive committee of the National Equality March Oct. 11, 2009 and has written for publications including the Nation , MRZine , Counterpunch , Dissident Voice , and Socialist Worker and speaks frequently across the country on the struggle for LGBT liberation as well as a wide range of social and economic justice issue.",
  "genres": [
    "History",
    "LGBT",
    "Queer",
    "Politics",
    "Nonfiction",
    "Feminism",
    "Theory"
  ],
  "author": "Sherry Wolf",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/6457323-sexuality-and-socialism"
}