{
  "title": "Facing East from Indian Country: A Native History of Early America",
  "description": "In the beginning, North America was Indian country. But only in the beginning. After the opening act of the great national drama, Native Americans yielded to the westward rush of European settlers.Or so the story usually goes. Yet, for three centuries after Columbus, Native people controlled most of eastern North America and profoundly shaped its destiny. In Facing East from Indian Country, Daniel K. Richter keeps Native people center-stage throughout the story of the origins of the United States.Viewed from Indian country, the sixteenth century was an era in which Native people discovered Europeans and struggled to make sense of a new world. Well into the seventeenth century, the most profound challenges to Indian life came less from the arrival of a relative handful of European colonists than from the biological, economic, and environmental forces the newcomers unleashed. Drawing upon their own traditions, Indian communities reinvented themselves and carved out a place in a world dominated by transatlantic European empires. In 1776, however, when some of Britain's colonists rebelled against that imperial world, they overturned the system that had made Euro-American and Native coexistence possible. Eastern North America only ceased to be an Indian country because the revolutionaries denied the continent's first peoples a place in the nation they were creating.In rediscovering early America as Indian country, Richter employs the historian's craft to challenge cherished assumptions about times and places we thought we knew well, revealing Native American experiences at the core of the nation's birth and identity.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Native American",
    "Native American History",
    "Native Americans",
    "Grad School"
  ],
  "author": "Daniel K. Richter",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/64599.Facing_East_from_Indian_Country"
}