{
  "title": "The Secret History of Science Fiction",
  "description": "This ingeniously conceived anthology raises the intriguing question, If Thomas Pynchon’s Gravity’s Rainbow had won the Nebula award in 1973, would the future distinction between literary fiction and science fiction have been erased?  Exploring the possibility of an alternate history of speculative fiction, this literary collection reveals that the lines between genres have already been obscured. Don DeLillo’s “Human Moments in World War III” follows the strange detachment of two astronauts who are orbiting in a skylab while a third world war rages on earth. “The Ziggurat” by Gene Wolfe traverses a dissolving marriage, a custody dispute, and the visit of time travelers from the future. T. C. Boyle’s “Descent of Man” is the subversively funny tale of a man who suspects that his primatologist lover is having an affair with one of her charges. In “Schwarzschild Radius,” Connie Willis draws an allegorical parallel between the horrors of trench warfare and the speculative physics of black holes. Artfully crafted and offering a wealth of esteemed authors—from writers within the genre to those normally associated with mainstream fiction, as well as those with a crossover reputation—this volume aptly demonstrates that great science fiction appears in many guises.ContentsIntroduction by James Patrick Kelly & John Kessel“Angouleme” by Thomas M. Disch “The Ones Who Walk Away From Omelas” by Ursula K. Le Guin “Ladies and Gentlemen, This Is Your Crisis” by Kate Wilhelm “Descent of Man” by T. C. Boyle “Human Moments in World War III” by Don DeLillo “Homelanding” by Margaret Atwood “The Nine Billion Names of God” by Carter Scholz “Interlocking Pieces” by Molly Gloss “Salvador” by Lucius Shepard “Schwarzschild Radius” by Connie Willis “Buddha Nostril Bird” by John Kessel “The Ziggurat” by Gene Wolfe “The Hardened Criminals” by Jonathan Lethem “Standing Room Only” by Karen Joy Fowler “10^16 to 1” by James Patrick Kelly “93990” by George Saunders “The Martian Agent, A Planetary Romance” by Michael Chabon “Frankenstein’s Daughter” by Maureen F. McHugh “The Wizard of West Orange” by Steven Millhauser",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Speculative Fiction",
    "Literary Criticism",
    "Science Fiction Fantasy"
  ],
  "author": "James Patrick Kelly",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/6458631-the-secret-history-of-science-fiction"
}