{
  "title": "Why Not Kill Them All?: The Logic and Prevention of Mass Political Murder",
  "description": "Genocide, mass murder, massacres. The words themselves are chilling, evoking images of the slaughter of countless innocents. What dark impulses lurk in our minds that even today can justify the eradication of thousands and even millions of unarmed human beings caught in the crossfire of political, cultural, or ethnic hostilities? This question lies at the heart of Why Not Kill Them All? Cowritten by historical sociologist Daniel Chirot and psychologist Clark McCauley, the book goes beyond exploring the motives that have provided the psychological underpinnings for genocidal killings. It offers a historical and comparative context that adds up to a causal taxonomy of genocidal events.Rather than suggesting that such horrors are the product of abnormal or criminal minds, the authors emphasize the normality of these killing by category has occurred on every continent and in every century. But genocide is much less common than the imbalance of power that makes it possible. Throughout history human societies have developed techniques aimed at limiting intergroup violence. Incorporating ethnographic, historical, and current political evidence, this book examines the mechanisms of constraint that human societies have employed to temper partisan passions and reduce carnage.Might an understanding of these mechanisms lead the world of the twenty-first century away from mass murder? Why Not Kill Them All? makes clear that there are no simple solutions, but that progress is most likely to be made through a combination of international pressures, new institutions and laws, and education. If genocide is to become a grisly relic of the past, we must fully comprehend the complex history of violent conflict and the struggle between hatred and tolerance that is waged in the human heart.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Sociology",
    "Psychology",
    "Science",
    "Education"
  ],
  "author": "Daniel Chirot",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/645517.Why_Not_Kill_Them_All_"
}