{
  "title": "The Illuminati: Facts & Fiction",
  "description": "Secret societies have both fascinated and frightened people for hundreds of years. Often the infamous Illuminati is mentioned as the core of conspiracies which span the globe. The Illuminati is actually a historical secret society which had goals of revolutions and world domination dating back to the 1770s.Since then, rumors and conspiracy theories involving the Illuminati continue to spread, sometimes finding their way into popular novels like Dan Brown's Angels & Demons and Hollywood movies like Lara Croft: Tomb Raider. More recently, music videos, award shows, and sporting events are said to be somehow connected. Some men have even come forward claiming to be former members, offering details of what they allege are the inner workings of the organization.When you sift through all of the information available on the subject, you may be surprised that the truth is stranger than fiction. In The Illuminati: Facts & Fiction, conspiracy and occult expert Mark Dice separates history from Hollywood and shows why tales of the secret society won't die.- Original Writings and Documents  - Purported Texts  - Freemasonry's Connections  - The Georgia Guidestones  - Alleged Victims and Defectors  - Aliens and Reptillians  - Activists and Eyewitnesses  - Fictional Books  - Fictional Films  - TV references  - Mainstream Media Manipulation  - Documentary Films  - The Music Industry  - Rappers and Pop Stars- Pre-Illuminati Organizations  - The Luciferian Doctrine  - The Federal Reserve  - Skull and Bones  - The Bilderberg Group  - Bohemian Grove  - The Council on Foreign Relations  - The Franklin Cover-up  - Sex Magic - Election Fraud  - The Necronomicon  - The Secret Doctrine  - Emerald Tablet- The Book of Thoth  - The Book of Dzyan  - The Report From Iron Mountain  - Protocols of the Elders of Zion  - The Holy Grail  - MK-ULTRA Documents  - The Satanic Bible  - The Secret Doctrine  - David Rockefeller's Memoirs  - Memoirs Illustrating the History of Jacobinism  - Secret Societies and Subversive Movements  - Occult Theocrasy  - Externalization of the Hierarchy  - None Dare Call It Conspiracy- Magick: In Theory and Practice  - Bloodlines of the Illuminati  - The Lexicon of Freemasonry  - Morals and Dogma  - The Secret Teachings of All Ages - Myron Fagan  - Edith Miller  - Gary Allen  - Abbe Barruel  - Nesta Webster  - Anthony J. Hilder  - John Robison  - Johnny Gosch  - William Morgan- Chris Jones, former Bohemian Grove employee  - Ted Gunderson former FBI Agent  - John Todd  - Bill Schnoebelen  - Mike Warnke  - Cathy O'Brien  - Aleister Crowley  - Alice Bailey  - Benjamine Creme - William Cooper  - Carol Quigley  - Zeitgeist's Peter Joseph  - Helena Blavatsky  - Phil Schneider- Benjamin Fulford  - Hal Turner, FBI informant  - Manly P. Hall  - Fritz Springmeier  - Albert Pike  - Anton LaVey - David Icke  - And MoreBy the author of The New World Order: Facts & Fiction",
  "genres": [
    "Nonfiction",
    "Conspiracy Theories",
    "History",
    "Politics",
    "Government"
  ],
  "author": "Mark Dice",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/6455168-the-illuminati"
}