{
  "title": "You Don't Know Crazy",
  "description": "Wambui Bahati, a.k.a. John-Ann Washington, shares a powerful, personal and important story about mental illness, self-esteem, self-love and courage. She was born and raised in the segregated south during the 1950s and 1960s and has sprinkled the narrative with significant national historical events, and how they personally effected her life. She invites us in for a behind the scenes look at her years as an actress on Broadway and in national touring shows. At times hilariously funny and always relentlessly honest, You Don't Know Crazy presents an intelligent, informative portrayal of bipolar mood disorder and its effects on Bahati's self-esteem, career, relationships and day-to-day coping. Wambui also reveals exactly what she did that allowed her to reclaim her life, and she encourages the reader to understand that each and every one of us has an innate wisdom and strength that may have either been forgotten about, or the knowledge has been lost as to how to tap into that inner wisdom and strength. This book will show you how to find that within yourself, and reclaim your own life. She went from Broadway star to welfare mom - Some said she was dead - She was homeless - Others said she was on drugs - She was told she would spend her life in and out of mental institutions - She was told her children could no longer live with her. When it seemed like her life couldn't get any worse, she decided she only had two options - she could either live, or she could die. If she lived, she told herself it would be on her own terms. For the past 10 years she has researched, studied and explored various 'quality of life' altering strategies. Her mission was to find out how to have a life of joy, peace and fabulous health - the best life possible! This inspiring woman not only 'got up' when everyone thought she was 'out for the count', but rose to new heights, and continues to soar. You Don't Know Crazy gives you the inspiration and tools that will allow you to soar too!",
  "genres": [],
  "author": "Wambui Bahati",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/6458437-you-don-t-know-crazy"
}