{
  "title": "The Lady in the Tower: The Fall of Anne Boleyn",
  "description": "Nearly five hundred years after her violent death, Anne Boleyn, second wife to Henry VIII, remains one of the world's most fascinating, controversial, and tragic heroines. Now acclaimed historian and bestselling author Alison Weir has drawn on myriad sources from the Tudor era to give us the first book that examines, in unprecedented depth, the gripping, dark, and chilling story of Anne Boleyn's final days.The tempestuous love affair between Henry VIII and Anne Boleyn scandalized Christendom and altered forever the religious landscape of England. Anne's ascent from private gentlewoman to queen was astonishing, but equally compelling was her shockingly swift downfall. Charged with high treason and imprisoned in the Tower of London in May 1536, Anne met her terrible end all the while protesting her innocence. There remains, however, much mystery surrounding the queen's arrest and the events leading up to Were charges against her fabricated because she stood in the way of Henry VIII making a third marriage and siring an heir, or was she the victim of a more complex plot fueled by court politics and deadly rivalry?    The Lady in the Tower examines in engrossing detail the motives and intrigues of those who helped to seal the queen's fate. Weir unravels the tragic tale of Anne's fall, from her miscarriage of the son who would have saved her to the horrors of her incarceration and that final, dramatic scene on the scaffold. What emerges is an extraordinary portrayal of a woman of great courage whose enemies were bent on utterly destroying her, and who was tested to the extreme by the terrible plight in which she found herself.     Richly researched and utterly captivating, The Lady in the Tower presents the full array of evidence of Anne Boleyn's guilt—or innocence. Only in Alison Weir's capable hands can readers learn the truth about the fate of one of the most influential and important women in English history.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "Historical",
    "British Literature",
    "Biography Memoir"
  ],
  "author": "Alison Weir",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/6455879-the-lady-in-the-tower"
}