{
  "title": "Mediterranean Summer: A Season on France's Côte d'Azur and Italy's Costa Bella",
  "description": "“Saturday was dawning warm, with only a gentle wind under a light blue sky as we got under way. . . . With the motor cut out, I could hear the whispered splash of the sea against the hull as we knifed through the Mediterranean. The calming noise, along with the gentle rocking, lulled me into a Zen calm as I went about preparing the crew’s lunch. . . . By keeping just a couple of miles offshore, we had some beautiful sights to our starboard the harbor towns of La Napoule and quaint Théoule-sur-Mer, . . . the sensational coastline of the Corniche de l’Estérel. . . . All of this I could see through the porthole in the galley. . . . Italy was only a week away.”La Dolce Vita at sea. . .An alluring, evocative summer voyage on the Mediterranean and into the enchanting seaside towns of France’s Cote d’Azur and Italy’s Costa Bella by a young American chef aboard an Italian billionaire couple’s spectacular yacht.Having begun his cooking career in some of New York’s and San Francisco’s best restaurants, David Shalleck undertakes a European culinary adventure, a quest to discover what it really means to be a chef through a series of demanding internships in Provence and throughout Italy. After four years, as he debates whether it is finally time to return stateside and pursue something more permanent, he stumbles on a rare to become the chef on board Serenity , the classic sailing yacht owned by one of Italy’s most prominent couples. They present Shalleck with the ultimate to prepare all the meals for them and their guests for the summer, with no repeats, comprised exclusively of local ingredients that reflect the flavors of each port, presented flawlessly to the couple’s uncompromising taste— all from the confines of the yacht’s galley while at sea.Serenity ’s five-month journey starts on the French Riviera, continues along Italy’s western coast to Amalfi, crosses the Tyrrhenian Sea to Sardinia, up to Corsica, and back to St. Tropez for the season-ending regatta. Shalleck captures the glittery Riviera social scene, the distinctive sights and sounds of the unique ports along the way, the work hard/play hard life of being a crew member, and the challenges of producing world-class cuisine for the stylish and demanding owners and their guests. An intimate view of the most exclusive of worlds, Mediterranean Summer offers readers a new perspective on breathtaking places, a memorable portrait of old world elegance and life at sea, as well recipes and tips to recreate the delectable food.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Food",
    "Italy",
    "France",
    "Memoir",
    "Foodie"
  ],
  "author": "Erol Munuz",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/646375.Mediterranean_Summer"
}