{
  "title": "Push of the Sky",
  "description": "PUBLISHERS WEEKLY *Starred Review*: \"Alexa's impressive debut collection covers a wide variety of subgenres, among which she switches with ease. The highlight is the slightly absurdist \"Shades of White and Road,\" which develops the whimsy of a magic kingdom and talking objects into something touching and beautiful. Other standouts include the melancholy, postapocalyptic \"A Taste of Snow,\" the fun space frontier tale \"The Clone Wrangler's Bride\" and the clockwork-and-alchemy fantasy \"The Butterfly Assassins,\" which deftly mixes a murder mystery, court intrigue and a stutterer's plight in a world where magic requires verbal incantations. \"Paperheart,\" focusing on the last dragon, and \"They Shall Be as They Know,\" an eschatological zombie story, nicely revisit familiar themes. The poems are not as strong as the fiction but they show decent range. Alexa's voice is a welcome new addition to genre fiction.\"A girl and her mandroid wander the Twelve Domed Cities of Mars, looking for a place to call home... A young man in the age of practical alchemy eschews incantations he can't utter for fantastic creatures built of cogs and springs... A prehistoric inventor living at the cusp of change finds an ancient winged carcass at the edge of a melting glacier, and has the inspiration of a lifetime... Over two dozen short speculative works from the pages of Fantasy Magazine, ChiZine, Abyss & Apex, Space & Time Magazine and more, including SpaceWesterns.com's most-read story of all time, \"The Clone Wrangler's Bride\" and its sequel, \"Droidtown Blues.\" PLUS new stories never before published, collected here for the first time.Contents:Shades of White and Road • (2009)A Taste of Snow • (2009)The Clone Wrangler's Bride • (2009)The Butterfly Assassins • (2009)Paperheart • (2009)They Shall Be as They Know • (2009)The Italian • (2009)Plastic Personality Surgery • (2009)Cliffs of Cal'allat • (2009)Neither Wave Nor Wind • (2009)Poor Little Things • (2009)Kingdom at the Edge of Nowhere • (2009)Inclusions • (2007)The Beetle Eater's Dream • (2009)Baseball Trophies, Baby Teeth • (2009)I Consider My Cadaver • (2009)Flaming Marshmallow and Other Deaths • (2008)Weird Fruits • (2008)To Heroboy, from Tiffani • (2009)Droidtown Blues • (2009)Of Spice and Lime and Tea • (2009)Three Days Dead • (2009)Veilsight • (2008)Flying Solo • (2007)The Green Infinity • (2008)Virgin Soil • (2008)Observations of a Dimestore Figurine • (2009)The Pull of the World and the Push of the Sky • (2009)Milky Way Meat Market • (2009)Foreword (Push of the Sky) • essay by Jay Lake",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Science Fiction",
    "Witches",
    "Steampunk",
    "Robots",
    "Post Apocalyptic"
  ],
  "author": "Camille Alexa",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/6462501-push-of-the-sky"
}