{
  "title": "Writings",
  "description": "For two centuries, George Washington has stood “first in war, first in peace, and first in the hearts of his countrymen,” universally acknowledged as the one indispensable founder of the American republic. This Library of America volume—the most extensive and authoritative one-volume collection ever published—covers five decades of Washington’s astonishingly active life and brings together over 440 letters, orders, addresses, and other writings.Among the early writings included are the journal Washington kept at age sixteen while surveying the Shenandoah Valley frontier and the dramatic account of the winter journey he made through the Pennsylvania wilderness in 1753 while on a diplomatic mission. Some two dozen letters written during the French and Indian War, including first-hand accounts of the controversial forest skirmish that sparked those hostilities and of Braddock’s bloody defeat, record Washington’s early encounters with the harsh challenges of military command.An extensive selection of letters, orders, and addresses from the Revolutionary War make manifest Washington’s determined leadership of the Continental Army through the years of defeat and deprivation. Included are accounts of battles; letters to Congress and state governments vividly describing the army’s desperate need of supplies; Washington’s journal of the victorious Yorktown campaign; and letters and addresses showing how Washington upheld the supremacy of civil power in the new republic by peaceably disbanding the army at the end of the war.Letters from the Confederation period (1783–1789) show Washington’s pleasure at returning to his Mount Vernon home, his continued interest in Western land speculation and river navigation, his growing concern with the weaknesses of the Articles of Confederation, and his role in the framing and ratification of the Constitution. The writings from his two terms as President of the United States show how Washington strove to establish enduring republican institutions, to build public trust in the new government, to avoid the divisions of party and faction, and to maintain American neutrality during the war between Britain and Revolutionary France. Also included in the volume are letters revealing his close and careful management of Mount Vernon and his evolving attitudes toward slavery.Washington’s writings demonstrate the keen, practical intelligence that distinguished his leadership in war and peace, as well as the patriotism, dignity, and devotion to the cause of republican government that won the admiration and trust of his contemporaries and his heirs.",
  "genres": [
    "History",
    "American History",
    "Politics",
    "Biography",
    "Nonfiction",
    "American Revolution",
    "Classics"
  ],
  "author": "George Washington",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/6463.Writings"
}