{
  "title": "Iksion ali Beg iz prikazovalnice",
  "description": "Antiutopija, predstavljena v tem Remčevem romanu, je mojstrska. Dogajanje je konceptualizirano paralelno, in sicer v devetih prostorskih izsekih (poglavjih): neparni se dogajajo na vesoljskem plovilu /premičniku/ Iksion, ki s tričlansko posadko išče planet, kjer bi ljudje po katastrofi pričeli znova, parni pa so uprizarjani v bivalnikih na Zemlji.Družba je, zaradi življenja v posebnih pogojih, organizirana racionalno in z vsesplošno čvrsto hierarhijo oblasti, ki je odmaknjena in zakrita, pa zato nič manj manipulatorna, saj je vse predpisano in določeno. Oblast vse moči usmerja v obvladovanje družbe ter iskanje novega doma (planeta).Seme dvoma v ta perfekcionizem je zasajeno skozi telepate (\"senzorje\"), ki so edini še \"nezmehanizirani\" in kot taki osnova za zvezo na vesoljske ultra-daljave, med matico in premičniki. To so v bistvu nosilci samostojnega mišljenja, saj je ostalim odvzeta zmožnost čustvovanja, in tu se zgradba totalitarnosti zrahlja. S to izjemo, da je v vsako totalitarnost dvom praviloma in funkcionalno vgrajen, čeprav je morda sprva neopazen.Napor elite po popolnem obvladovanju je očiten tudi zaradi prepovedanega in za razliko od Prepoznavanja še sankcioniranega izhoda v zastrupljeno zunanjost (a je kljub vsemu vendar mogoč: \"Brez težav zleze skozi odprtino in vstopi v travo, ki se mu nežno ovija okrog gležnjev.\" - str. 224). Spomin nanjo je tako ohranjen in mogoč le preko selekcionirano memorirane slike, moč manipulacije pa s tem povečana.V seriji prvih treh Remčevih romanov lahko torej zasledimo razvoj kodifikacije sankcioniranega odnosa do okolja, ki se zaključi s prepovedjo, a težnja in gon po bivanju v pravem, dejanskem okolju s tem nista zatrta.Po ocenah poznavalcev, ki jim gre pritrditi, sodi Iksion tudi v sam vrh svetovne antiutopije, ob bok veliki trojki (Zamjatin - Mi, Huxley - Krasni novi svet, Orwell - 1984), in sicer tako po osnovni zamisli in izvedbi kot tudi po strukturi in zaključku. Le-ta je tu še bolj zaprt in grotesken, saj se preživela v vesoljskem plovilu rešita, vendar je ta rešitev le individualna in zgolj nujna, hkrati pa tudi začetek novega, začaranega kroga. In kaj je potem to - le konec, spet začetek, mar tudi nadaljevanje - kdo ve?Janez Majnič (Uvodni esej v Astralnih svetilnikih, 1993)",
  "genres": [],
  "author": "Miha Remec",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/6463172-iksion-ali-beg-iz-prikazovalnice"
}