{
  "title": "James Madison and the Making of America",
  "description": "In James Madison and the Making of America, historian Kevin Gutzman looks beyond the way James Madison is traditionally seen -- as \"The Father of the Constitution; -- to find a more complex and sometimes contradictory portrait of this influential Founding Father and the ways in which he influenced the spirit of today's United States.Instead of an idealized portrait of Madison, Gutzman treats readers to the flesh-and-blood story of a man who often performed his founding deeds in spite of himself: Madison's fame rests on his participation in the writing of The Federalist Papers and his role in drafting the Bill of Rights and Constitution. Today, his contribution to those documents is largely misunderstood. He thought that the Bill of Rights was unnecessary and insisted that it not be included in the Constitution, a document he found entirely inadequate and predicted would soon fail. Madison helped to create the first American political party, the first party to call itself Republican, but only after he had argued that political parties, in general, were harmful. Madison served as Secretary of State and then as President during the early years of the United States and the War of 1812; however, the American foreign policy he implemented in 1801-1817 ultimately resulted in the British burning down the Capitol and the White House. In so many ways, the contradictions both in Madison's thinking and in the way he governed foreshadowed the conflicted state of our Union now. His greatest legacy the disestablishment of Virginia's state church and adoption of the libertarian Virginia Statute for Religious Freedom is often omitted from discussion of his career. Yet, understanding the way in which Madison saw the relationship between the church and state is key to understanding the real man. Kevin Gutzman's James Madison and the Making of America promises to become the standard biography of our fourth President.",
  "genres": [
    "History",
    "Biography",
    "Presidents",
    "American History",
    "Nonfiction",
    "Politics",
    "American Revolution"
  ],
  "author": "Kevin R.C. Gutzman",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/12958753-james-madison-and-the-making-of-america"
}