{
  "title": "When God Talks Back: Understanding the American Evangelical Relationship with God",
  "description": "How does God become and remain real for modern evangelicals? How are rational, sensible people of faith able to experience the presence of a powerful yet invisible being and sustain that belief in an environment of overwhelming skepticism? T. M. Luhrmann, an anthropologist trained in psychology and the acclaimed author of Of Two Minds, explores the extraordinary process that leads some believers to a place where God is profoundly real and his voice can be heard amid the clutter of everyday thoughts.            While attending services and various small group meetings at her local branch of the Vineyard, an evangelical church with hundreds of congregations across the country, Luhrmann sought to understand how some members were able to communicate with God, not just through one-sided prayers but with discernable feedback. Some saw visions, while others claimed to hear the voice of God himself. For these congregants and many other Christians, God was intensely alive. After holding a series of honest, personal interviews with Vineyard members who claimed to have had isolated or ongoing supernatural experiences with God, Luhrmann hypothesized that the practice of prayer could train a person to hear God’s voice—to use one’s mind differently and focus on God’s voice until it became clear. A subsequent experiment conducted between people who were and weren’t practiced in prayer further illuminated her conclusion. For those who have trained themselves to concentrate on their inner experiences, God is experienced in the brain as an actual social his voice was identified, and that identification was trusted and regarded as real and interactive.Astute, deeply intelligent, and sensitive, When God Talks Back is a remarkable approach to the intersection of religion, psychology, and science, and the effect it has on the daily practices of the faithful.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Anthropology",
    "Psychology",
    "Christianity",
    "Theology",
    "Spirituality"
  ],
  "author": "T.M. Luhrmann",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/12958803-when-god-talks-back"
}