{
  "title": "Wistril Compleat",
  "description": "All three of Wistril's magical misadventures are included in this complete compilation of cantrips and catastrophes! Wistril Besieged -- Wizard Wistril's wants are simple -- four meals a day, a steady supply of honey-gold Upland beer, and above all else, peace and quiet. All but the latter are in plentiful supply at Castle Kauph. Despite secreting himself on the edge of the Wild, Wistril finds himself battling an army of relentless mercenaries while the entire population of the nearest village takes refuge in his home. Even Kern, Wistril's long-suffering, sharp-tongued apprentice, isn't sure whether the army or the houseguests will prove to be Wistril's undoing! Wistril Afloat -- Wistril doesn't believe in lake monsters -- until they invade the lake that just happens to provide Wistril's favorite fish dinners. Faced with the choice of adjusting his menus or daring the wilderness around Lake Ovinshoon, Wistril and Kern soon have bigger problems than mere lake monsters on their hands. Because while Wistril wishes only to study the beasts, others wish to hunt them and skin them. Will Wistril's peaceful White Chair magics prevail against a ruthless band of wyvern-hunters who have only profit on their minds? Wistril Betrothed -- If ever there was a determined bachelor, thought Kern, his name was surely Wistril. So when Wistril's wife-to-be shows up with a pursuing army on her heels, life at Castle Kauph is turned upside down. And when another suitor for Lady Emmerbee's hand arrives, with a dark and menacing wizard of his own in tow, it's up to Kern and the rest of Castle Kauph to get Wistril wed without losing his head! White Chair wizard, gourmand, beer fancier, scholar. Wistril of Kauph is all that, and more. Join him for a taste of classic high fantasy well seasoned with humor and a dash of adventure!",
  "genres": [
    "Fantasy",
    "Comedy",
    "Science Fiction Fantasy"
  ],
  "author": "Frank Tuttle",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/6465201-wistril-compleat"
}