{
  "title": "How I Became A Fearless Woman",
  "description": "This is my story about overcoming the effects of a traumatic brain injury, caused by a car accident. I'm just the average woman, in other words, I am not placing myself above anyone. I realized that I had been given a choice between, existing or living a full life. I chose the latter. I wanted to share this with the person who has lost any hope to see that change is possible. I am referring to the change in our outlook on ourselves. We must love ourselves. I believe, that is where inner peace and healing begins. I knew for a fact that God allowed me to remain here on earth, but there were times when the reasons seemed very cloudy. I also knew that every one of us had struggles of some sort or another, but life had become very challenging for this one. For instance, say that you've been striving very hard for something and you are just beginning to see the fruits. Out of the blue, there's this feeling of insignificance trying to tell you to just give up, that you will never achieve. Don't listen. All of us have that weak inner self that is so much against our succeeding because it is scared, and until we learn to recognize that voice, it has won. There finally came a time, after 25 years and over 30 surgeries, that I came to realize this is it, and it's OK to be different. I am enough. My goals in writing this book are not only to share my story with accident victims, but also for the person who has not experienced a physical loss, yet emotionally they are overcome.Ever since the day I began sharing my story with people, it was as if I had been buttered up and frosted like an angel food cake. It seemed as if no one wanted to see me hurt any more than I had been already. To them, Pam was such an over comer. What had yet to be witnessed though, was the anger inside, pushed down so deep that even I was not about to confront it. I was furious that this happened. Why me? Why not me was the question that I had to accept. I didn't come to a resolution for years.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Pamela Jansen",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/6466125-how-i-became-a-fearless-woman"
}