{
  "title": "Centuries Ago and Very Fast",
  "description": "The stories in this collection relate tales from the life of Vel, a gay immortal born in the Paleolithic who jumps time at will. We encounter him hunting mammoths, playing with reindeer tripping on hallucinogenic mushrooms, negotiating each successive wave of invaders to keep his family and its land intact, living as the minor god of a spring, witnessing the hanging of “mollies” in seventeenth-century London as well as the Stonewall riots in twentieth-century New York City. Vel has had more lovers than he can remember and is sometimes tempted to flirt with death. Centuries Ago and Very Fast offers fascinating, often erotic glimpses of the life of a man who has just about seen it all.Advance PraiseThe eminent novelist and critic Samuel R. Delany “Witty, vivid, and very thought provoking, these interwoven narratives of the most sophisticated of primitive lusts start with a gay caveman who happens to have been around over fourteen thousand years. Finishing an afternoon tryst with a Puerto Rican drag queen at the Chelsea Hotel in New York, he and his new friend wander back to Greenwich Village to end up smack in the Stonewall Riots of late June '69. Then we go hunting (and killing and dressing and eating and a few other things that might raise your eyebrow) a mammoth. But that's only the beginning. (Want to learn the right way to celebrate the winter solstice?) Ore's little book has intelligence and charm. Really, you've just got to read this!”Reviews“In Centuries Ago and Very Fast , Rebecca Ore pulls off an audacious using the raw language and deliberate focus on sexual encounters of 'slash' fiction to relate a series of linked episodes and moments of reflection from the stupendously long life of a gay male, from his earliest days as a mammoth-hunting caveman to around the present.”— Faren Miller, Locus June 2009“The tone of the stories is a balancing act between the serious and the comic. One of the most difficult books to describe I've read recently, this should appeal to fans of literary SF, satire, and nifty prose, and it is almost certainly not going to be what you're expecting.”—Donald D'Ammassa, Critical Mass 4/22/09“Ah, a true power chord is infinitely replenishable, given enough talent on the part of the author. And Rebecca Ore proves this to the max with her new novel in stories, Centuries Ago and Very Fast .... Vel is utterly believable—and believably strange—as a fusion of pre-modern, postmodern, and timeless attitudes and habits. He narrates most of the book, with some chapters from Thomas's POV, and he comes across as the ultimate alien in our midst.... A cousin to our species, yet not exactly in our direct lineage.”—Paul Di Filippo Asimov's Science Fiction , March 2010“ Centuries Ago and Very Fast by Rebecca Ore (from the truly amazing Aqueduct Press) has a kinetic energy and hard-to-define originality that held me captivated from first word to last. Profane—scandalous?—the book wraps stories around stories, combines the surreal with the mundane and every-day. A story like “Acid and Stoned Reindeer” that I thought was either genius or chaos when published by Clarkesworld works much better in the context of the other stories. I'm not really sure how to describe a book that includes lines like “We'd run out of mammoths. The ponies looked nervous.”, but I tend to come down on the side of finding it fascinating, although I know many readers will find this collection difficult.”—Jeff VanderMeer, Locus Online , February 11, 2010",
  "genres": [
    "Science Fiction",
    "Queer",
    "Fantasy",
    "LGBT"
  ],
  "author": "Rebecca Ore",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/6466358-centuries-ago-and-very-fast"
}