{
  "title": "Curveball: Spies, Lies, and the Con Man Who Caused a War",
  "description": "Curveball answers the crucial question of the Iraq How and why was America’s intelligence so catastrophically wrong? In this dramatic and explosive book, award-winning Los Angeles Times reporter Bob Drogin delivers a narrative that takes us to Europe, the Middle East, and deep inside the CIA to find the truth–the truth about the lies and self-deception that led us into a military and political nightmare.In 1999, a mysterious Iraqi applies for political asylum in Munich. The young chemical engineer offers compelling testimony of Saddam Hussein’s secret program to build weapons of mass destruction. He claims that the dictator has constructed germ factories on trucks, creating a deadly hell on wheels. His grateful German hosts pass his account to their CIA counterparts but deny the Americans access to their superstar informant. The Americans nevertheless give the defector his unforgettable code Curveball.The case lies dormant until after 9/11, when the Bush administration turns its attention to Iraq. Determined to invade, Bush’s people seize on Curveball’s story about mobile germ labs–even though it has begun to unravel. Ignoring a flood of warnings about the informant’s credibility, the CIA allows President Bush to cite Curveball’s unconfirmed claims in a State of the Union speech. Finally, Secretary of State Colin Powell highlights the Iraqi’s “eyewitness” account during his historic address to the U.N. Security Council. Yet the entire case is based on a fraud. America’s vast intelligence apparatus conjured up demons that did not exist. And the proof was clear before the war.Most of the events and conversations presented here have not been reported before. The portrayals–from an obdurate president to a bamboozled secretary of state to a bungling CIA director to case handlers conned by their snitch–are vivid and exciting. Curveball reads like an investigative spy thriller. Fast-paced and engrossing, it is an inside story of intrigue and incompetence at the highest levels of government. At a time when Americans demand answers, this authoritative book provides them with clarity and conviction.Just when you thought the WMD debacle couldn’t get worse, here comes veteran Los Angeles Times national-security correspondent Drogin’s look at just who got the stories going in the first place…Simultaneously sobering and infuriating–essential reading for those who follow the headlines. -- Kirkus ReviewsIn this engrossing account, Los Angeles Times correspondent Drogin paints an intimate and revealing portrait of the workings and dysfunctions of the intelligence community.-- Publishers WeeklyEnter Bob Drogin's new book… an insightful and compelling account of one crucial component of the war's origins… Had Drogin merely pieced together Curveball's story, it alone would have made for a thrilling book. But he provides something a frightening glimpse at how easily we could make the same mistakes again…The real value of Drogin's book is its meticulous demonstration that bureaucratic imperative often leads to self-delusion.--Washington MonthlyDrogin delivers a startling account of this fateful intelligence snafu.-- BooklistBut, again, the intelligence community was disappointing the Bush administration… Los Angeles Times correspondent Bob Drogin lays out the whole sorry tale in his forthcoming book, \" Spies, Lies, and the Con Man Who Caused a War.\" --NewsweekBy the time you finish this book you will be shaking your head with wonder, or perhaps you will be shaking with anger, about the misadventures that preceded the misadventures in Iraq. This book is so powerful, it almost refutes its The man called Curveball did not cause a war; he became a pretext -- one among many.-- George F. WillThere used to be an old rule that *real* journalists lived 'All governments are run by liars, and nothing they say should be believed.' We've come a long way from those days, to a media that has been cowed into submission and accepting the 'official story.' Thank God for Bob Drogin and his refusal to believe. It's journalists like him and books like CURVEBALL that give many of us a sliver of hope that we can turn things around. --Michael Moore, Director of \"Fahrenheit 9/11,\" and \"Sicko\"Curveball is the factual equivalent of Catch 22. It is impossible to read this book and then look at our world leaders without thinking, \"F*ck. Oh f*ck. Oh my God, oh f*ck.\"--Mark Thomas, comedian and political activist…the biggest fiasco in the history of secret intelligence over 500 years.--Frederick Forsyth, author of The Day Of The Jackal , The Odessa File and The AfghanBob Drogin struck journalistic gold in this story of a conman who told his intelligence handlers exactly what they wanted to hear. If this twisted tale could be read simply as a thrilling farce it would be pure delight -- but much more importantly, it is a history of our time.--Philip GourevitchBob Drogin is a brilliant reporter. In Curveball, he has produced a riveting and important investigation, full of startling and carefully documented detail, laying bare the anatomy of an intelligence failure and its contribution to a catastrophic war.--Steve Coll, author of GHOST The Secret History of the CIA, Afghanistan, and Bin Laden, from the Soviet Invasion to September 10, 2001Bob Drogin accomplishes what only the best reporters can; he forces you to wonder how he could possibly know that! If you want to know how the CIA could have possibly been so wrong about Iraq, here is a big part of the answer.--Mark Bowden, author of Black Hawk DownA crucial study in the political manipulation of intelligence, understanding how Curveball got us into Iraq will arm us for the next round of lies coming out of Washington.--Robert Baer, author of See No The True Story of a Ground Soldier in the CIA's War on TerrorismHere we go the self-deception, the corruption of intelligence, and the abuse of authority, amid a full cast of the usual suspects in the White House and the Pentagon. It's a crucially important story, and it comes wonderfully alive in Curveball. It would be almost fun to read if the message wasn't so important–and so devastating to the integrity of the American processes.--Seymour M. Hersh, author of Chain of The Road from 9/11 to Abu GhraibCurveball is a true story, marvelously reported, about a descent into the netherworld of deceit and duplicity, where the lies of a single man in an interrogation cell in Germany grew like a malign spore in the dark. When it emerged, on the lips of the President and the Secretary of State, it infected the course of world events.--Jonathan Harr, author of A Civil Action and The Lost Painting .",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "War",
    "Espionage",
    "Biography",
    "American History"
  ],
  "author": "Bob Drogin",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/646563.Curveball"
}