{
  "title": "Elizabeths Women The Hidden Story of the Virgin Queen",
  "description": "Elizabeth I was born into a world of women. As a child, she was served by a predominantly female household of servants and governesses, with occasional visits from her mother, Anne Bolyen, and the wives who later took her place. As Queen, Elizabeth was constantly attended by ladies of the bedchamber and maids of honor who clothed her, bathed her and watched her while she ate. Among her family, it was her female relations who had the greatest influence: from her sister Mary, who distrusted and later imprisoned her, to her cousin, Mary, Queen of Scots, who posed a constant and dangerous threat to her crown for almost thirty years. Despite the importance of women in Elizabeth's life, most historians and biographers have focused on her relationships with men. She has been portrayed as a 'man's woman' who loved to flirt with the many ambitious young men who frequented her court. Yet it is the women in her life who provide the most fascinating insight into the character of this remarkable monarch. With them she was jealous, spiteful and cruel, as well as loyal, kind and protective. She showed her frailties and her insecurities, but also her considerable shrewdness and strength. In short, she was more human than the public persona she presented to the rest of the court. It is her relationships with women that hold the key to the private Elizabeth. In this original chronicling of the life of one of England's greatest monarchs, historian Tracy Borman explores Elizabeth's relationships with the key women in her life. Beginning with her mother and the governesses and stepmothers who cared for the young princess, including her beloved Kat Astley and the inspirational Katherine Parr, \"Elizabeth's Women\" sheds new light on her formative years. Elizabeth's turbulent relationships with her rivals are examined: from her sister, 'Bloody' Mary, to the sisters of Lady Jane Grey, and finally the most deadly of all her rivals, Mary, Queen of Scots who would give birth to the man Elizabeth would finally, inevitably have to recognize as heir to her throne. It is a chronicle of the servants, friends and 'flouting wenches' who brought out the best - and the worst - of Elizabeth's carefully cultivated image as Gloriana, the Virgin Queen, in the glittering world of her court.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "Historical",
    "British Literature",
    "European History"
  ],
  "author": "Tracy Borman",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/6464019-elizabeths-women-the-hidden-story-of-the-virgin-queen"
}