{
  "title": "A Summons From the Duke",
  "description": "In JERRICA KNIGHT-CATANIA’s Loving Mister Lockwell, Lady Isabel Whitton has no use for people other than her twin sister -- she much prefers the company of her books. So when she discovers that all her cousins from near and far have been summoned to her home, Danby Castle, for Christmas, she isn't pleased. To make matters even worse, the deplorable Mister Lockwell has come uninvited. * Damien Lockwell, 3rd son of the Earl of Totterdown, has invited himself to Yorkshire for Christmas. Spending the holiday with the Whittons seems far preferable to watching his father drink himself into a stupor. And Lady Isabel proves to be just the kind of entertainment he was looking for -- she's smart as a whip and quite the most unique creature he's ever met -- not to mention she despises him, which is the most thrilling part of all for a man like Damien. In LILIA BIRNEY's A Second Chance For Christmas, Philip Whitton has been summoned back home by his grandfather after a wastrel existence in Italy, studying music and trying to forget his first love. Emily Barlow, nee Ware, is picking up the pieces of her shattered existence following her husband's death. Thrown together by chance on the road back home to Danby, Emily and Philip rekindle the flames of their old passion. Will the fire burn itself out like it did before, or are they ready to follow their hearts and live out the truth of their love?In SAMANTHA GRACE’s Twice Upon a Time - since her father’s untimely death, Felicity Halliday has relied on the medical knowledge learned at his side to treat London’s most disreputable in order to support her family. Life has been hard, but everything changes the night she is snatched from an alley behind a theatre and tossed into a nobleman’s carriage. * It has been less than a fortnight since Julian Beckford returned to London after a sojourn in India, and he’s already up to his top-boots in one of his cousin’s mad schemes. When his foolish cousin decides to engage an actress to play his wife over the holidays at Danby Castle, Julian becomes an unwilling party to the lady’s abduction. Along their journey to Yorkshire, Julian makes a stunning discovery about his cousin's pretend wife....and finds it’s possible to love Twice Upon a Time.",
  "genres": [
    "Anthologies",
    "Romance",
    "Historical",
    "Christmas",
    "Historical Romance"
  ],
  "author": "Jerrica Knight-Catania",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/12959725-a-summons-from-the-duke"
}