{
  "title": "Prince of Storms",
  "description": "Finally in control of the Ascendancy, Titus Quinn has styled himself Regent of the Entire. But his command is fragile. He rules an empire with a technology beyond human understanding; spies lurk in the ancient Magisterium; the Tarig overlords are hamstrung but still malevolent. Worse, his daughter Sen Ni opposes him for control, believing the Earth and its Rose universe must die to sustain the failing Entire. She is aided by one of the mystical pilots of the River Nigh, the space-time transport system. This navitar, alone among all others, can alter future events. He retires into a crystal chamber in the Nigh to weave reality and pit his enemies against each other.Taking advantage of these chaotic times, the great foe of the Long War, the Jinda ceb Horat, create a settlement in the Entire. Masters of supreme technology, they maintain a lofty distance from the Entire’s struggle. They agree, however, that the Tarig must return to the fiery Heart of their origins. With the banishment immanent, some Tarig lords rebel, fleeing to hound the edges of Quinn’s reign.Meanwhile, Quinn’s wife Anzi becomes a hostage and penitent among the Jinda ceb, undergoing alterations that expose their secrets, but may estrange her from her husband. As Quinn moves toward a confrontation with the dark navitar, he learns that the stakes of the conflict go far beyond the Rose versus the Entire--extending to a breathtaking dominance. The navitar commands forces that lie at the heart of the Entire’s geo-cosmology, and will use them to alter the calculus of power. As the navitar’s plan approaches consummation, Quinn, Sen Ni, and Anzi are swept up in forces that will leave them forever changed. In this rousing finale to Kenyon’s celebrated quartet, Titus Quinn meets an inevitable destiny, forced at last to make the unthinkable choice for or against the dictates of his heart, for or against the beloved land.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Audiobook"
  ],
  "author": "Kay Kenyon",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/6468603-prince-of-storms"
}