{
  "title": "The Noise of Infinite Longing",
  "description": "A beautifully written memoir about a Puerto Rican family, whose siblings reunite for the first time upon their mother's death, after having scattered to various places and various lives after they reached early adulthood. It is also a universal story about family connections and what happens to them as we grow up.Writing with great honesty and lyrical prose, Luisita Lopez Torregrosa gives us an incandescent memoir exploring the meaning of family connections and what happens to them as we grow up. The Noise of Infinite Longing is about a Puerto Rican family, its origins, its place in society, its illusions and, finally, what happened when the family dispersed, its members moving in different directions. It is a story unlike any others about the passage of Puerto Ricans and other Latin Americans to countries not their own. But it is, in every sense, a universal story - of personal and cultural roots that are too strong to be completely severed, and of the passionate and anguished search for what we call home. The book opens with the death of Luisita's mother, which brought together in one place, for the first time in almost ten years, all six of her children. Over four days of funeral arrangements, burial and mourning, the children's stories unfold, beginning with their parents' doomed romance set against the backdrop of upper-middle class San Juan society and the traditions and class differences that ruled such a society. Out of a childhood of privilege and pain, one of Luisita's sisters joins the Sandinista government in Nicaragua; their brother hungers for the life of a rock and roll performer but ends up a teacher in the Bronx; Luisita becomes a writer and editor and travels the far regions of the world, always looking for a place to call her own. The siblings experience a journey of exile from the family's native land, and they must deal with the wrenching pull is has on them.But finally, this is story of human struggle played out against the everyday joys and disappointments of life, and the myths and dreams that sustain us.",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Luisita López Torregrosa",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/646740.The_Noise_of_Infinite_Longing"
}