{
  "title": "The Glass Gate: A Retelling of Cinderella",
  "description": "Sometimes all a girl needs is a good dress and some magic shoes.Prince Charming is optional.My goal was create a killer fashion design portfolio, win the scholarship to the school of my dreams, and never have to clean my step-family’s house again. I just needed some inspiration. Something to set my portfolio apart from all the other up-and-coming designers. A little fashion magic.I didn’t expect literal magic.But then my friend dressed me up like a fae princess, and whisked me away to Faerie. The food! The dancing! The dresses! This was just the inspiration I needed, so when the crown prince asked me to stay and be his fake girlfriend, I jumped at the opportunity.Prince Tiernan is gorgeous and charming, but I’m just a part of a plot to find his bride. That’s fine by me. I’m just here for the fashion. No messy feelings. On the other hand, it’s very hard to not have my head turned by a boy who gives me a dragon egg.The longer I stay in Faerie with Tiernan, the more caught up I get in the magic of his kingdom, and I start to believe the stories we’re spinning for everyone. Stories of magic and sacrifice and maybe even true love.I can’t lose sight of my goals. I need to win that scholarship. Putting my heart on the line for a prince and his kingdom is just too risky. Am I brave enough to try? Maybe if I find the right dress.Where’s a fairy godmother when you need one?**If you think Ever After is the best Cinderella retelling, because they actually get to know each other, or that Project Runway would be improved by having a baby dragon, try The Glass Gate! This is a sweet, stand-alone retelling of Cinderella, set in the Faerie Tale Romances world**",
  "genres": [
    "Fantasy",
    "Romance",
    "Retellings",
    "Fairy Tales",
    "Cinderella",
    "Fae",
    "Young Adult"
  ],
  "author": "Hanna Sandvig",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/64679843-the-glass-gate"
}