{
  "title": "Sylvan Mist",
  "description": "Coira O'Donnell refuses to acknowledge the Scotsman haunting her. Why should she? She carries no magic and she's newly engaged. Well aware of the mysterious tie between the medieval MacLomains and her mother's clan, the Brouns, Coira will have no part of it. She much prefers a proper English gentleman to a barbarian living six hundred years in the past. However, as one whirlwind day will prove, she has little choice in the matter.Chieftain William MacLomain did not call her back, yet she arrives. Coira is not the woman meant for him. Or is she? Her arrival marks the start of a highland war unlike any Scotland has witnessed before, one born of magic. Soon, he finds himself in a tangled web of duty, loyalty and unexpected love. A love so unattainable and powerful it may cost him the war; and his heart.This novel contains strong sexual content and is recommended for a mature audience.\"If you're looking for that great summer beach read that will take your mind off all your worries this one is for you. If you love the time travel romances of Lynn Kurland, this one equals any of hers. \"   ~Long and Short Reviews The King's Druidess is the lead-in tale to The MacLomain Series. While The King's Druidess is a short Celtic story, Fate's Monolith (The MacLomain Series- Book 1), Destiny's Denial (The MacLomain Series- Book 2) and Sylvan Mist (The MacLomain Series- Book 3) are full length novels. In memory of Sky's beloved father, marketing manager and best friend, all will continue to remain at a reasonable price. He would have expected nothing less.\"I have never read any of Sky Purington's books before, but after reading \"Sylvan Mist\", I can't wait to read more. It is a great book, mixing magic with history and time travel with romance, all following a family line through time. I loved the storyline and the great characters.\"  ~Night Owl ReviewsPlease This is a re-launch of titles published years ago. The stories have been revised and tightened. And as aforementioned, the sensual heat level for all four has been turned way up.JUST RELEASED! Highland Defiance and Highland Persuasion, the first of many tales from The MacLomain Series- Early Years. Available NOW. Follow some of the characters from The MacLomain Series in the new Calum's Curse Series. Book One- The Victorian Lure, Book Two- The Georgian Embrace, Book Three- The Tudor Revival.",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Romance",
    "Scotland",
    "Paranormal",
    "Historical Fiction",
    "Fantasy"
  ],
  "author": "Sky Purington",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/12959701-sylvan-mist"
}