{
  "title": "تهذيب مدارج السالكين",
  "description": "تبدأ قصة هذا الكتاب من الإمام أبي إسماعيل عبد الله بن محمد بن علي الأنصاري الهروي المتوفى سنة481هـ، الذي ألَّف كتاب (منازل السائرين)، حيث قسَّم طريق سير المؤمن إلى الله تعالى إلى مائة منزلة، ألفه حين سأله جماعة من الراغبين في الوقوف على منازل السائرين إلى الحق من أهل هراة، فأجاب ورتَّب لهم فصولاً وأبواباً، فجعله مائة مقام مقسومة على عشرة أقسام كل منها يحتوي على عشر مقامات، لكنَّه وقع في بعض الأخطاء العقدية، واستفاض في كثير من المسائل، ثمَّ جاء بعده الإمام ابن قيم الجوزية المتوفى سنة 571هـ ليشرح تلك المنازل شرحاً منقى ومصفى من تلك الأخطاء، ليقدِّمها في صورة مشرقة ناصعة تحافظ على صفاء العقيدة ونقاء التوجيه التربوي.قال محمَّد رشيد رضا في تفسيره المنار: (ومنْ كان من أهل العلم والفهم، وأَحَبَّ أن يستفيد من كلام خيار الصُّوفِيَّة في الحقائق مع التزام السُّنَّة وسِيرَة السَّلف في العبادة فعليه بكتاب (مَدَارِجِ السَّالِكِينَ) للمحَقِّق ابن القَيِّمِ شرح (مَنَازِلِ السَّائِرِينَ) لشيخ الإسلامِ الهَرَوِيِّ الأنصاري، فإنَّ فيه خلاصة معارف الصُّوفيَّة الّتي لا تخالفُ الكتاب والسُّنَّة مع الرَّدِّ على ما خالفهما).اشترك في هذا المؤلف القيم ثلاثة علماء أفذاذ ومربين متميّزين كان لهم الأثر البالغ في الجيل الذي عايشوه، أمَّا الأول فهو الإمام الهروي رحمه الله عاش ما بين سنة 396هـ وسنة 481هـ، قال عنه الإمام الذهبي: (شيخ الإسلام الإمام القدوة، الحافظ الكبير، أبو إسماعيل، عبد الله بن محمد بن علي بن محمد بن أحمد بن علي بن جعفر بن منصور بن مت الأنصاري الهروي، مصنِّف كتاب (ذم الكلام)، وشيخ خراسان من ذرية صاحب النبي صلى الله عليه وسلم أبي أيوب الأنصاري).أمَّا الثاني فهو الإمام ابن قيم الجوزية عاش ما بين سنة 691هـ وسنة 751هـ، كان بارعاً في جميع العلوم وفاق الأقران واشتهر في الآفاق وتبحَّر في معرفة مذاهب السَّلف، قال عنه الشوكاني في البدر الطالع : (العلامة الكبير المجتهد المطلق المصنف المشهور).أمَّا ثالثهم فهو الإمام محمد أحمد الرّاشد، إنَّه الشيخ الداعية المجاهد المربي عبد المنعم صالح العلي العزي، هو الدَّاعية الذي قضى عمره في الدَّعوة إلى الله ونشر العلم النَّافع، وهو الأديب الكبير ذو البلاغة والأسلوب النَّادر المؤثر الذي يجمع بين الأدب والفقه والدَّعوة والتربية والاستشهاد بأقوال السَّلف والخلف مع إيحاءات جمالية تأخذ بلب العقول والقلوب.من موقع بصيرة أونلاين",
  "genres": [
    "Islam",
    "Religion",
    "Psychology",
    "Faith",
    "Nonfiction",
    "Spirituality"
  ],
  "author": "ابن قيم الجوزية",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/6472872"
}