{
  "title": "Crystal Clear: The Inspiring Story of How an Olympic Athlete Lost His Legs Due to Crystal Meth and Found a Better Life",
  "description": "In this gripping first-person account, former Olympian Eric LeMarque recounts a harrowing tale of survival—of eight days in the frozen wilderness, of losing his legs to frostbite, and coming face-to-face with death. But Eric’s ordeal on the mountain was only part of his struggle for survival—as he reveals, with startling candor, an even more harrowing and inspiring tale of fame and addiction, healing and triumph.On February 6, 2004, Eric, a former professional hockey player and expert snowboarder, set off for the top of 12,000-foot Mammoth Mountain in California’s vast Sierra Nevada mountain range. Wearing only a long-sleeve shirt, a thin wool hat, ski pants, and a lightweight jacket—and with only four pieces of gum for food—he soon found himself chest-high in snow, veering off the snowboard trail, and plunging into the wilderness. By nightfall he knew he was in a fight for his life…Surviving eight days in subfreezing temperatures, he would earn the name “The Miracle Man” by stunned National Guard Black Hawk Chopper rescuers.But Eric’s against-all-odds survival was no surprise to those who knew him. A gifted hockey player in his teens, he was later drafted by the Boston Bruins and a 1994 Olympian. But when his playing days were over, Eric felt adrift. Everything changed when he first tasted the rush of hard drugs—the highly addictive crystal meth—which filled a void left by hockey and fame. By the time Eric reached the peak of Mammoth Mountain in 2004, he was already dueling demons that had seized his soul.A riveting adventure, a brutal confessional, here Eric tells his remarkable story—his climb to success, his long and painful fall, and his ordeal in the wilderness. In the end, a man whose life had been based on athleticism would lose both his legs, relearn to walk—even snowboard—with prosthetics, and finally confront the ultimate test of what it takes to find your way out of darkness, and—after so many lies—to tell truth… and begin to live again.",
  "genres": [
    "Survival",
    "Nonfiction",
    "Memoir"
  ],
  "author": "Eric Le Marque",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/6474809-crystal-clear"
}