{
  "title": "Black Images in the Comics: A Visual History",
  "description": "This book spotlights over 100 comic strips, comic books, and graphic novels to feature black characters from all over the world over the last century, and the result is a fascinating journey to, if not enlightenment, then at least away from the horrendous caricatures of yore. The book begins with the habitually appalling images of blacks as ignorant 'coons' in the earliest syndicated strips (Happy Hooligan, Moon Mullins, and The Katzenjammer Kids); continues with the almost-quaint colonialist images of the often-suppressed Tintin book  Tintin in the Congo and such ambiguous figures as Mandrake the Magicians noble savage assistant Lothar in the 30s (not to mention Torchy Brown, the first syndicated black character), moving on to such oddities as the offensive Ebony character in Will Eisners otherwise classic The Spirit from the 40's and 50's. We then continue into the often earnest attempts at 60's integration in such strips as Peanuts (and comic books such as Fantastic Four), as well as the first wave of black strips like Wee Pals, juxtaposed with the shocking satire of underground comics such as R. Crumbs incendiary Angefood McSpade. Also investigated is the increased use of blacks in super-hero comic books as well as syndicated strips. Black Images in the Comics wraps up from the 80's to now, with the increased visibility of blacks, often in works actually produced by blacks, all the way to the South African strip Madam & Eve, Aaron McGruders pointed daily The Boondocks, and more including over a dozen new entries added to the out-of-print hardcover edition.  Each strip, comic, or graphic novel is spotlighted via a compact but instructive 200-word essay and a representative illustration. The book is augmented by a context-setting introduction, an extensive source list and bibliography, and a foreword by Charles R. Johnson, the recipient of a MacArthur Foundation fellowship and winner of the National Book Award for his 1990 novel Middle Passage.",
  "genres": [
    "Comics",
    "History",
    "Graphic Novels",
    "Race",
    "Nonfiction",
    "Art",
    "Criticism"
  ],
  "author": "Fredrik Strömberg",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/647186.Black_Images_in_the_Comics"
}