{
  "title": "In This Land: The Purple Book, Volume One",
  "description": "Bade, prince of the tiny, overlooked country of Nosupolis, doesn't have a plan for his life. His ambitious older brother Tiko, heir to the throne, seems to have everything under control without Bade or his twin brother's help. Bade hopes to marry well and find some way to be a credit to the crown, but never in his wildest dreams does he expect an invitation to court the Pharaoh of Orina Anoris, the divine ruler of the most powerful country in the world. Bade always thought that Tiko would be the one to change their homeland for the better, but now he has a chance to wed the pharaoh, ally their two nations through marriage, and do more for Nosupolis than anyone in centuries. Suddenly whisked away by Prince Orinakin, royal diplomat and handsome purple-haired child of the gods, Bade finds himself in an exotic land that dazzles his senses and opens his eyes like never before. The people of Orina Anoris are uninhibited, expressive, flirtatious, and don't seem to know the meaning of sexual repression. The handsome Seven Siblings are no exception. Boyfriends, lovers, harems--it boggles Bade's mind to witness a freedom he never even imagined. But the endless parade of beautiful men pales in comparison to the Pharaoh Anosukinom. Tall, gorgeous, and physically flawless, Anosukinom's beauty is literally perfection. And if that weren't enough, the rumors are he really is both god and man. Crackling with power, intimidating yet friendly, he is as unconventional as he is traditionally Anorian. Daunted in the face of his divinity, Bade isn't sure if he can win the heart of a deity, but at the very least he hopes to bring attention to the plight of his ignored, forgotten country. After being exposed to a vibrant, colorful new world, nights of sizzling passion, and the possibilities of true love, how can Bade face the thought of being rejected and returning home? Will he be able to win the pharaoh's heart and finally help his people? Experience the rich, luxurious fantasy world of Orina Anoris only in Matthew Haldeman-Time's series, \"In This Land,\" and watch as eight handsome brothers try to balance ruling a nation with finding true happiness. Find out what happens to Bade, Anosukinom, and the sexiest siblings in the world. Read Volume One to begin the erotic journey of a lifetime. In This The Purple Book, Volume One consists of the first 14 chapters of \"In This Land.\"",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Romance",
    "M M Fantasy",
    "LGBT"
  ],
  "author": "Matthew Haldeman-Time",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/6477522-in-this-land"
}