{
  "title": "Catch of the Day: Sherman's Lagoon Collection #8",
  "description": "Sherman's Lagoon is popular because it's funny-not just cute or silly, but truly laugh-out-loud funny. As in many other great cartoons, the main protagonists are animals; however, the residents of Sherman's Lagoon also are genuine, well-developed characters , complete with personalities, moods, neuroses, and their own unique points of view. Whimsically rendered yet written with sophisticated, edgy humor, Sherman's Lagoon has garnered a large, loyal, and diverse fan base.Welcome to the world of Sherman's Lagoon ! Sherman is a carefree shark; he's carefree because he doesn't know any better. Fillmore the Sea Turtle, Sherman's sidekick, is a philosophical sort who does what he can to make up for Sherman's lack of sense. Ernest is a fish of indeterminate species with the technical savvy and dubious intentions of an ace computer hacker-in fact, he is one. Sherman's wife, Megan, possesses a ruthless yet nurturing nature. Hawthorne, the macho hermit crab, is not actually a hermit, but he is actually crabby. Thornton is an expatriate polar bear who drifted into the tropical lagoon on a wayward iceberg and decided to stay. Captain Quigley, the token human (or \"hairless beach ape\" in the local dialect), is bent on Sherman's destruction. This ambition may be traced to the fact that Quigley is a crusty old fisherman and Sherman is a fish. Or it may be traced to a long-ago incident in which Sherman ate Quigley's leg!In addition to satirizing human behavior, Sherman and his friends occasionally have to contend with the threat of encroachment by the beach apes on their unspoiled tropical home. The strip has been lauded by activist groups for promoting the importance of marine conservation.",
  "genres": [
    "Comics",
    "Humor",
    "Cartoon",
    "Fiction",
    "Comic Strips"
  ],
  "author": "Jim Toomey",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/647642.Catch_of_the_Day"
}