{
  "title": "The Exodus Sagas: Of Spiders and Falcons",
  "description": "Let the Exodus begin! A new epic has surfaced from author Jason R Jones who promises an 18 part series of action packed high fantasy. Join Shinayne T’Sarrin the elven swordswoman, Azenairk Thalanaxe the dwarven priest, Saberrak the gray minotaur gladiator, Gwenneth Lazlette the prodigal wizard, and James Andellis the orphan knight of Southwind Keep as they battle their way across the mythical continent of Agara. The last age of myth and legend is at hand and the brave heroes must unite the lands to ensure the survival of liberty from the emperors of Altestan. The one race, the chosen men of the one God, and a nation of all powerful nobility without mercy, Altestan will need just one more victory to seal the fate of all elves, free men, dwarves, minotaurs, and the fey. Do the moons shine upon any remaining heroes with the heart to stand in the face of extinction? Follow our heroes across frozen Chazzrynn, wicked Harlaheim, the barren Misathi Mountains, into great Shanador, and beyond to where fate may lead them to take a stand against certain doom.The Exodus is set in a dark age of fantasy, blended with a biblical style saga, and topped with crusades and inquisitions galore. The one has driven out the many, the holy land has conquered, killed, and eradicated those of myth and legend to the point of extinction. All that remains is Agara, one southern continent with but a slim hope of a chance for survival. Our heroes are hunted, tracked, and betrayed as they grab hold of an ideal, a hope, and each other in their perilous trek across the realms. The assassins of the White Spider, the Knights of Harlaheim, the Crossguard legion of Shanador, and even dragon worshipping cults will try and stop them. Kendari of Stillwell and his deadly blades, Prince Johnas Valhera and his spies, savant doppelgangers, and ogre kings will try and kill them. Will they make it to the forgotten city of Mooncrest and the mines of Kakisteele that lie below? Did such a place of unity and divine power ever truly exist and can it be restored?Epic sagas, deadly bladed duels, detailed battles and magical conflicts, and the ever present force of the immortals and Gods spurns this series forward. Enjoy lords and knights, the lavish kings and queens, hate the villains, despise the monsters, fear the dragons and dark Gods, but love the heroes and the unforgettable journey of the Exodus.Of Spiders And Falcons is the first installment in which the heroes meet, the chase begins, and fate will give us one last chance to save a world of myth and fantasy.",
  "genres": [
    "Fantasy"
  ],
  "author": "Jason R. Jones",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/12960583-the-exodus-sagas"
}