{
  "title": "Making Rounds with Oscar: The Extraordinary Gift of an Ordinary Cat",
  "description": "A remarkable cat. A special gift. A life-changing journey. They thought he was just a cat. When Oscar arrived at the Steere House Nursing and Rehabilitation Center in Rhode Island he was a cute little guy with attitude. He loved to stretch out in a puddle of sunlight and chase his tail until he was dizzy. Occasionally he consented to a scratch behind the ears, but only when it suited him. In other words, he was a typical cat. Or so it seemed. It wasn't long before Oscar had created something of a stir. Apparently, this ordinary cat possesses an extraordinary he knows instinctively when the end of life is near. Oscar is a welcome distraction for the residents of Steere House, many of whom are living with Alzheimer's. But he never spends much time with them--until they are in their last hours. Then, as if this were his job, Oscar strides purposely into a patient's room, curls up on the bed, and begins his vigil. Oscar provides comfort and companionship when people need him most. And his presence lets caregivers and loved ones know that it's time to say good-bye. Oscar's gift is a tender mercy. He teaches by embracing moments of life that so many of us shy away from. Making Rounds with Oscar is the story of an unusual cat, the patients he serves, their caregivers, and of one doctor who learned how to listen. Heartfelt, inspiring, and full of humor and pathos, this book allows readers to take a walk into a world rarely seen from the outside, a world we often misunderstand. Praise for Making Rounds With Oscar \"I love this book -- Oscar has much to teach us about empathy and courage. I couldn't put it down.\"-Sarah Gruen, author of Water for Elephants \"At its heart, Dosa's search is more about how people cope with death than Oscar's purported ability to predict it.\"- The Associated Press \"Beautifully written, heartwarming [...] Told with profound insight and great respect for all involved, this is more than just a cat story (although it will appeal to fans of Vicki Myron's Dewey).\"- Library Journal \"You'll be moved.\"- People",
  "genres": [
    "Nonfiction",
    "Animals",
    "Cats",
    "Memoir",
    "Biography",
    "Medical",
    "Audiobook"
  ],
  "author": "David Dosa",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/6480137-making-rounds-with-oscar"
}