{
  "title": "ما وراء الخير والشر: تباشير فلسفة للمستقبل",
  "description": "هذا الكتاب وهو كتاب مركزي بين مؤلفات نيتشه، يأتي بعد هكذا تكلم زرادشت، وينتمي إلى المرحلة الختامية من سيرة نيتشه الفكرية، ويشكل حقل اختبار للأفكار الدينامية التي تميز بها نيتشه من سواه من الفلاسفة: من إرادة القدرة إلى العود الأبدي والفوق-إنساني، مروراً بتخطي الثنائية الميتافيزيقية في وهم الذات وحرية الإرادة وتناقض القيم.ونكرر القول بأن أهمية هذا الكتاب تكمن لا في ما يقول ويثبت، بل في كيف يقول ويثبت. أهمية نيتشه تكمن بالأحرى في منهجه النسابي (الجينايولوجيا). في كونه إذ يظهر تعدد المعاني المفترضة واحدة في الأفهوم، يهدم المنطق القائم على مبدأ الهوية من أساسه. ويفتح الباب، إذ يعاند الستمة، واسعاً على اللامتناهي. ويوقظ \"الروح الفلسفي\" من \"سباته الدغمائي\" فيغدو شرطاً لا بد منه من شروط إمكان القول الفلسفي وتجدده في طول القرن العشرين وعرضه.وبالعودة لمضمون هذا الكتاب تقول بأن نيتشه قد أعده بمثابة استراحة من الإفراط في أرفق الذي ميز زرادشت يحسن نيتشه، هذا \"الفيلولوجي العتيق\" استثمار الوسائل اللغوية المتاحة ويتقن \"استعمال\" لغته وألفاظه، يعيد إليها حياتها و\"يعمقها\" ويترك، مع ذلك أو بسبب من ذلك، مجالاً وفسحة للإضمار وحتى لسوء الفهم. فهو يريد \"نقل المشكلات كلها إلى الشعور وصولاً إلى الشغف\".ولذا جاءت مصطلحات الكتاب وأفاهيمه بحلة لم نعدها من قبل، فهي ليست مجردة ومنقاة و\"ذهنية\"، بل قاسية وصارمة وانفعالية، من دون أن تكون وليدة العشوائية. يستفيد نيتشه، على سبيل المثال، من مشتقات اللفظ Grund (أساس) فيستثمر Begrundung (تأسيس)، Abgrund (سحق) Abgrundig (سحيق الأغوار)، Vordergrund (واجهة)، Hintergrund (خلفية)، ليشير إلى شبهة دعاوى الفلاسفة أو يوحي باستعماله لفظي Wissen (علمان) وGewissen (وجدان) إلى علاقة قائمة بينهما، أو يقارن بين Erkenntnis (معرفة) و Erkennen (عرف) وzu Ende-Kennen (عرف نهائي)، أو يربط ويفرق، حسب الحاجة، بين Finden (عثر على) Erfinden (اختراع)، بل يخترع أحياناً اشتقاقاً معيناً لدعم وجهة نظره.وبالنظر لأهمية هذا الكتاب فقد اهتم بترجمته عن النص الأصلي (ما رواء الخير والشر\" الصادر في أواخر الستينات ضمن الطبعة النقدية لكامل أعمال نتيشه، بإشراف الإيطاليين ج. كولي وم. مونتناري، التي أعيد طبعها في الثمانينيات كـ \"طبعة أكاديمية نقدية\". وكان هذا الإصدار، وهو الأهم لأعمال نيتشه ثمرة للبحث الفيلولوجي للثنائي الإيطالي الذي انتقل في الستينيات إلى فايمار ليقوم بفحص جميع المخطوطات المحفوظة في أرشيف نيتشه فحصاً دقيقاً. وكانت الحصيلة لافتة ومهمة جداً، إذ أدت إلى \"إعادة تقييم\" تراث نيتشه بكامله.إلا أنها من أجل إغناء الطبعة العربية وإضفاء المزيد من الوضوح عليها، وإقتداء بما فعله نيتشه حيث زود معظم شذراته بعناوين تشير إلى مضمونها، أضافت إلى النص المذكور شذراته بعناوين تشير إلى مضمونها، أضافت إلى النص المذكور عناوين الفقرات التي عثرت عليها في الطبعة الألمانية الصادرة عام 1895 عند ناومان في لا ييتسغ (كان الكتاب قد صدر لأول مرة عام 1886، وكان نيتشه نفسه الناشر وكان ناومان الموزع الذي أعاد الطبعة أربع مرات في تسعينيات القرن نفسه).المؤلف:\"هذا الكتاب في جوهره، نقد للحداثة لا تستثني منه لا العلوم الحديثة ولا الفنون الحديثة. وهو إلى ذلك يضع الإصبع على طراز معاكس قليل الحداثة، طراز نبيل يقول: نعم والكتاب بهذا المعنى الأخير مدرسة لابن الحسب والنسب، بالمفهوم الأكثر روحية والأكثر جذرية الذي أعطى لهذا اللفظ حتى الآن. فعلى المرء أن يتحلى برباطه الجأش كي يتمكن من مجرد احتماله، وعليه أن لا يكون قد تعلم الخوف قط... إن الأشياء التي يفخر بها هذا العصر جميعها تحس بمثابة النقيض من هذا الطراز، وبمثابة قلة تهذيب تقريباً. ومثالها: الموضوعية الشهيرة، والعطف على كل ما يتألم، والحس التاريخي بانصياعه لذوق الغير وانبطاحه أمام الوقائع العلمية الصغيرة\"",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Classics",
    "Psychology",
    "German Literature",
    "Religion",
    "History"
  ],
  "author": "Friedrich Nietzsche",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/6481498"
}