{
  "title": "Daydreams at Work: Wake Up Your Creative Powers",
  "description": "Learn how to use the creative power of daydreaming at work to problem solve, brainstorm, energize, motivate, find personal satisfaction, and most important––come up with the next big idea!Everybody daydreams, but most people don’t know anything about the process. Isn’t it time you found out more about your most creative (and neglected) state of mind?Daydreams at * Shows you why daydreaming is literally your most creative state of mind.* Reveals the valuable & productive role mind wanderings and daydreams play in your life and work.* Gives you ideas—through stories and interviews with successful people—for tapping into your own daydreams for ideas, energy and motivation.Find out why Google, Gore & Associates (Gore-Tex), and 3M give their employees the time and space to daydream and how that’s helped them become some of the most innovative companies in the world.Daydreams at Work * Interviews with and stories from top psychologists, leading corporate executives, entrepreneurs, artists, writers, scientists, inventors, and athletes, including legendary mountain climber Ed Viesturs.* Questionnaires to help you determine your own daydreaming style and patterns.* Thought-provoking exercises and tips that will have you examining your daydreams in new and creative ways.Daydreams are not just wishful thinking; they are your source for ideas, energy, and motivation.* “In an era where our busyness has hijacked our creativity, this book is a wake-up call to the importance of daydreaming at work. Ideas will be the competitive edge for most organizations in this global and challenging economy. This book provides practical ways to reconnect with your creative powers and ignite idea-passion in those you lead.”—Nan S. Russell, corporate-workplace expert and author of Hitting Your Your Work, Your Way, HittingYourStride.com* “Daydreams at Work is an inspiring book about tapping into creativity and free thinking—which is where your best ideas come from. It’s books like this that get people into the right frame of mind to not only create better lives for themselves—but to change the world!”—Lauren Zander, co-founder of the Handel Group (HandelGroup.com), a business consulting and private coaching company.",
  "genres": [],
  "author": "Amy Fries",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/6483758-daydreams-at-work"
}