{
  "title": "سيرة ذاتية وأسئلة لا مفر منها",
  "description": "نبذة المؤلف:إن الصفحات التي بين يديكم تمثل أجزاء من حياتي، نظراً لأنني إما نسيت مقاطع كاملة منها أو لأنها خاصة بي وحدي، وما يتبقى هو عرض للأحداث أكثر من سيرة ذاتية، إنه وصف للأحداث التي مرت بي خلال حياتي أسوقها هنا، على أكبر درجة من الدقة والإخلاص التي يمكن أن تكون عليها الرواية الشخصية للأحداث.لا أعرف كيف تكتب المذكرات. فلقد أدركت عند قراءتي لمذكرات تشيرشل الشهيرة، أن الكاتب في هذا النوع من الأدب، وكما يقول تشيرشل نفسه، يربط سجله للأحداث العسكرية والسياسة \"بخيوط تجربته الشخصية\". ولذلك فإن المذكرات هي دوماً وجهة نظر شخصية وليست موضوعية. وإنها ليست تاريخاً، حيث إنه لا يجب أن تتم كتابة التاريخ من قبل أولئك الذين يصنعونه أو يكونون جزءاً منه، ويتألف جزء كبير من هذا الكتاب من رسائل أو أجزاء من رسائلي وخطاباتي ومقالاتي الصحفية خلال تلك الفترة.ولقد ارتأيت أن أقتبس بعضاً منها كاملة أو أجزاء طويلة منها، لأنها كانت ردود فعلي المباشرة، وتعليقاتي السريعة والفورية على الأحداث عند تكشفها. ولذلك فإني أعد ردود فعلي تلك أصدق شاهد على تلك الأحداث. ولقد كان اقتباس الرسائل والخطابات والتعليقات وسيلة لتفادي تقويم الأشياء بعد انقضائها الذي غالباً ما يطغي على الكتابات من هذا النوع. وباختصار فإن السطور التالية هي الحقيقية كما أراها حقبة صعبة من تاريخنا.=======علي عزت بيجوفتش الرئيس الذي استطاع أن يكافح بعزم وإخلاص من أجل نهاية عادلة للصراع الذي مزق بلاده في التسعينات من القرن الماضي.. إذ لم يأل جهدًا في المطالبة بتحقيق العدالة في داخل البوسنة وخارجها، بالرغم مما واجهه من عدم اكتراث أوروبا التي مضى خمسون عامًا على وعدها بعدم السماح بتكرار معسكرات الاعتقال.يراه فريقٌ صعبَ المراس، متشبثًا بموقفه.. فيما يراه فريقٌ آخر رجلاً سعى جاهدًا ليحيا حياة على أسمى المبادئ.كتب خلال الثمانينيات -عندما كان أحد سجناء الرأي- قائلاً: \"إنني سوف أموت عندما أفقد كل الأسباب التي تجعلني أبقى على قيد الحياة\".ـ",
  "genres": [
    "Biography",
    "History",
    "Politics",
    "Nonfiction",
    "Islam",
    "Autobiography",
    "Unfinished"
  ],
  "author": "Alija Izetbegović",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/6487818"
}