{
  "title": "Literary Life: A Second Memoir",
  "description": "\"I had expected to be thrilled when I received my first copy of my first book, but when I opened the package and held the first copy in my hand, I found that I just felt sort of flat,\" writes Larry McMurtry in Literary Life. \"I learned then and have relearned many times since, that the best part of a writer's life is actually doing it, making up characters, filling the blank page, creating scenes that readers in distant places might connect to. The thrill lies in the rush of sentences, the gradual arrival of characters who at once seem to have their own life.\" McMurtry is that rarest of artists, a prolific and genre-transcending writer as popular with reviewers as he is with his readers. The author of more than forty books -- including essay collections, memoirs, and novels ranging from the Duane Moore series that began with The Last Picture Show to the Pulitzer Prize-winning Lonesome Dove -- McMurtry has delighted generations with his witty and elegant prose. In Literary Life, the sequel to Books, McMurtry expounds on life on the private side: the trials and triumphs of being a writer.From his earliest inkling of his future career while at Rice University, to his tenure as a Wallace Stegner fellow at Stanford with Ken Kesey in 1960, to his incredible triumphs as a bestselling author, Literary Life retains all the intimacy and charm of McMurtry's previous autobiographical works. Replete with literary anecdotes and packed with memorable observations about writing, writers, and the author himself, the book provides a rare glimpse into the life and intellect of a brilliantly insightful man. It is a work that will be cherished not only by McMurtry's admirers, but by the innumerable aspiring writers who seek to make their own mark on American literature.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Writing",
    "Books About Books",
    "Audiobook",
    "Literature"
  ],
  "author": "Larry McMurtry",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/6485300-literary-life"
}