{
  "title": "The Rocking Horse",
  "description": "Can a family that has been savagely ripped apart find healing and redemption? Are the mysteries hidden in the human heart destined to reveal themselves? The Rocking Horse, Gloria Zachgo’s spellbinding suspense novel, charts the harrowing emotional journey of one family that is torn asunder, then magically drawn together again. Jenny Preston has been missing for twenty-two years after being taken at the age of two on the very night her mother Amanda, Aunt Ruth, and Uncle Don were brutally and senselessly murdered. While Jenny's grandparents learn to cope with the tragedies, the sheriff, Will Barclay, must grapple with his own guilt and secrets involving the murders. The crime, which rocked the small town of Shady Creek, Kansas, has never been solved. More than two decades later, a woman who calls herself Julie Hendricks is led by a childhood toy to Shady Creek, where she finds refuge from an abusive husband. Living on her own for the first time in her life, she starts to regain her self esteem and make new friends. Her life is then turned upside down again when she discovers she may be the child that was abducted from this very town so many years ago. With the encouragement of her new friends, and a very special someone, she returns to Chicago to learn the truth of her childhood history from her father. After a gripping turn of events, Julie returns to Shady Creek to wrestle with the emotional complexities of her new life and how her past life is starting to catch up with her. An unexpected hero comes to Julie’s aid. A story of family, home, and the grave consequences of actions, The Rocking Horse explores the aftermath of the most unimaginable the disappearance of a child. Fast-paced and full of intrigue, this riveting read mines the depths of the human heart on its road to recovery.",
  "genres": [
    "Mystery",
    "Romance",
    "Amazon",
    "Suspense"
  ],
  "author": "Gloria Zachgo",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/12961908-the-rocking-horse"
}