{
  "title": "My Dear Aunt Martha: A 19th Century American Epic from the Letters of Those Who Lived It",
  "description": "My Dear Aunt Martha is a 19th century pioneer epic that is based upon a collection of nearly 80 letters between Scots-Irish settlers of the Illinois Territory and the loved ones they left behind in Pennsylvania. These documents provide first-person perspectives upon ordinary and extraordinary events of the period 1811-1893 that we know only from history books. Described by one university archivist as “platinum,” this is the first publication of the complete collection. My Dear Aunt Martha; a 19th Century American Epic from the Letters of Those Who Lived It was selected by the Illinois State Historical Society for its 2011 Award of Excellence. Published in that year, the book was revised in 2013 and 2018.The 2018 version, shown here, includes a recently-discovered 1838 letter by the title character. It is also chock-full of new data on the families of this history. Toughened to frontier hardships by heritage, the men and women of these letters eagerly claimed land near the Mississippi River that was opened to settlement after the War of 1812. To America’s heartland they brought the Presbyterian ideals of independence and the rights and responsibilities of man upon which their parents had helped to found the nation. The history of 19th century America unfolds through these unique narratives.Written on tiny scraps, sealed with wax and transported by horseback, the earliest writings related hardships, fellowships, loneliness and such frustrations “The available men are mighty scarce around these parts.” After securing farmsteads and comfortable homes, the focus of the letters shifted to the establishment of community with commercial and medical services, a school, a church, singing groups, debating societies, and political rallies. Throughout, the writers gossiped and often concluded their messages with “Don’t tell anybody….” They also wrote of working on Mississippi River steamboats and of hostilities with Mormon neighbors that culminated in the mob murder of Joseph Smith, the founder of that religious sect. They served in the Mexican War, joined gold rushes to California and Colorado, and they joined the Union cause during the Civil War. Letters from the front told of this cataclysmic struggle. One soldier wrote of his service as an officer with the U.S. 50th Colored Infantry in Mississippi and another claimed that his commanding officer, George Armstrong Custer, deserved to be shot “for he is nothing but a tyrant.” While a young woman described the mournful passage of Lincoln’s funeral train through her college town, a young man encouraged his friend to take an emigrant train to California where “The orchards are yellow with golden fruit” and “You’ll see some of the finest scenery in the world.”The 456 pages of My Dear Aunt Martha are presented in The Foreword, The History (background to the letters and the letter writers), The Letters (sequential transcripts with historical and biographical annotations), The People (biographical index), The Appendix, The Muse (pertinent samplings of other articles by author, Barbara Shave), and The Epilogue. The font is 12 point for easy reading and photographs are abundant. Endorsed by academics at Illinois State University, Western Illinois University, and Brigham Young University, the content of My Dear Aunt Martha is destined to become a primary genealogy reference for Franklin County, Pennsylvania and Hancock County, Illinois. It will also serve as a significant resource for histories of the Scots-Irish in America, the development of the Midwest, the Mormon Church, the Civil War, and the movement for the equal treatment for women.",
  "genres": [],
  "author": "Barbara J. Shave",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/12962341-my-dear-aunt-martha"
}