{
  "title": "Noctuary",
  "description": "Noctuary is the third volume of Thomas Ligotti’s horror stories to appear in a revised, definitive edition from Subterranean Press. The first two collections in this series, Songs of a Dead Dreamer (2010; 1986; expanded edition, 1989) and Grimscribe: His Lives and Works (2011; originally published 1991), are now collector’s items. Like its predecessors, Noctuary received numerous plaudits from reviewers upon its initial appearance. According to Library Journal, Noctuary is “another colorful collection of horror stories…which spring on the unsuspecting reader the combination of supernatural characters, natural props, and ‘weird’ circumstanced.” As Booklist observed, “The most disturbing terror comes from within, springs unexpectedly from bland or half-formed memories of the past. This is the terror that Ligotti cultivates in the rich evocative tales of Noctuary…For those willing to immerse themselves in Ligotti’s world, the rewards are great.”When an interviewer asked Ligotti the derivation of the word “noctuary,” he replied that it was the nocturnal counterpart of “diary,” that is, a journal of what occurs on a nightly timetable rather than during the light of day. Echoing the tenebrous tone of the book’s name are the section titles into which Noctuary is divided—Studies in Shadow, Discourse on Blackness, Notebook of the Night. Shadow, Blackness, Night: these are substance and signification of the themes of Ligotti’s works and the signature of gloom in which they are signed.New to Noctuary are the terse pieces of the volumes’ third section. Composed of nineteen dreamy entries, Notebook of the Night is a journal—or perhaps only excerpts of a greater work—of insidious exploits, delirious freaks, hymns to the void, esoteric rituals, and carnivals of the abyss. As an introduction to this and the other segments of Noctuary is “In the Night, in the Dark: A Note on the Appreciation of Weird Fiction.” Perhaps the reader will fight guidance in the words of this meditation on what separates the aberrant from the norm, the diseased from the wholesome, and the night from the day.",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Weird Fiction",
    "Fantasy",
    "Lovecraftian",
    "Collections"
  ],
  "author": "Thomas Ligotti",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/12962473-noctuary"
}