{
  "title": "The Bricklayer",
  "description": "Someone gives you a dangerous puzzle to solve, one that may kill you or someone else, and you're about to fail... and there is no other option. No one who can help.No one but the Bricklayer. The Bricklayer is the pulse-pounding novel introducing Steve Vail, one of the most charismatic new heroes to come along in thriller fiction in many years. He's an ex–FBI agent who's been fired for insubordination but is lured back to the Bureau to work a case that has become more unsolvable — and more deadly — by the hour.A woman steps out of the shower in her Los Angeles home and is startled by an intruder sitting calmly in her bedroom holding a gun. But she is frozen with fear by what he has to say about the FBI — and what he says he must do...A young agent slips into the night water off a rocky beach. He's been instructed to swim to a nearby island to deposit a million dollars demanded by a blackmailer. But his mission is riddled with hazardous tests, as if someone wanted to destroy him rather than collect the money...Vail has resigned himself to his dismissal and is content with his life as a bricklayer. But the FBI, especially Deputy Assistant Director Kate Bannon, needs help with a shadowy group that has initiated a brilliant extortion plot. The group will keep killing their targets until the agency pays them off, the amount and number of bodies escalating each time the FBI fails. One thing is clear: someone who knows a little too much about the inner workings of the Bureau is very clever — and very angry — and will kill and kill again if it means he can disgrace the FBI. Steve Vail's options — and his time to find answers — are swiftly running out. Noah Boyd's The Bricklayer is written with the bracing authenticity only someone who has been a crack FBI investigator can provide. And in this masterful debut Noah Boyd has created a mind-bending maze of clues and traps inside a nonstop thrill ride that is sure to leave readers exhilarated and enthralled.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Suspense",
    "Crime",
    "Mystery Thriller",
    "Action"
  ],
  "author": "Noah Boyd",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/6497521-the-bricklayer"
}