{
  "title": "Circus of the Scars : The True Inside Odyssey of a Modern Circus Sideshow",
  "description": "If you ever wondered what happened to the original Jim Rose Circus Sideshow, then you will definitely want to read this book! This is the ONLY book that tells how it all began! The most imaginative casting agent couldn't have chosen the original troupe with more flair. The Amazing Mister Lifto The Torture King The Enigma Matt The Tube Crowley with Dolly the Doll Lady They were led by the maniacal hype-master himself, Jim Rose, who was assisted by Bebe the Circus Queen. These Human Marvels came together to revive the ancient art of Sideshow . . . which had been nearly lost . . . but not forgotten. Before rock-and-roll there was Sideshow, which also captivated, mystified and enraged audiences for over a hundred years. But by the end of the 20th century, you could count remaining Sideshows on one hand. Entertainment had become sanitized and corporatized for mass consumption; lukewarm safe with no sharp edges. There was a whole new generation that had been born and raised on rock-and-roll. Sideshow virgins who knew absolutely nothing about the eyeball-bulging, faint-inducing antics of the Human Marvels of Yesteryear. That is, until a modern Sideshow came to town. The contemporary tale--as told by tour manager Jan T. Gregor--is one of bannings, sex, drugs, fame, lust, longing, camaraderie and betrayal. Intertwined into the present-day story is an equally compelling historical the intimate passages from a long-lost and only recently discovered 142-year-old diary. The average person, inherently curious, has always been both fascinated and repulsed by Human Oddities and their unusual feats. Circus of the Scars is the ultimate rollercoaster ride, careening through two years of Sideshow present while simultaneously barreling down 150 years of Sideshow past. Circus of the Scars takes you on a bizarre odyssey around the globe with a Sideshow troupe that truly was live, real, raw and dangerous. Learn the hidden secrets behind one of the most emotion-inducing acts of the 20th Century.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Jan T. Gregor",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/650231.Circus_of_the_Scars_"
}