{
  "title": "The Good and Beautiful God: Falling in Love with the God Jesus Knows",
  "description": "Over 250,000 Sold Worldwide! \"God wants me to try harder.\"\"God blesses me when I'm good and punishes me when I'm bad.\"\"God is angry with me.\" We all have ideas that we tell ourselves about God and how he works in our lives. Some are true―but many are false. James Bryan Smith believes those thoughts determine not only who we are, but how we live. In fact, Smith declares, the most important thing about a person is what they think about God. The path to spiritual transformation begins here. Turning to the Gospels, Smith invites you to put your ideas to the test to see if they match up with what Jesus himself reveals about God. Once you've discovered the truth in Scripture, Smith leads you through a process of spiritual formation that includes specific activities aimed at making these new narratives real in your body and soul as well as your mind. At the end of each chapter you'll find an opportunity for soul training, engaging in spiritual practices that reinforce the biblical messages on your mind and heart. Because the best way to make a complete and lasting change is to go through the material in community, small group discussion questions also accompany each chapter. This deep, loving and transformative book will help you discover the narratives that Jesus lived by―to know the Lord he knew and the kingdom he proclaimed―and to practice spiritual exercises that will help you grow in the knowledge of our good and beautiful God. The Good and Beautiful Series includes four essential discipleship books from James Bryan Smith. Work through these proven Bible study resources individually or with a group to learn who God is, what it means to be a Christian, how to live in community, and how to address toxic self-narratives that hinder spiritual growth.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Christianity",
    "Faith",
    "Christian Living",
    "Religion",
    "Theology"
  ],
  "author": "James Bryan Smith",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/6499587-the-good-and-beautiful-god"
}