{
  "title": "Daybreak: Undoing the Imperial Presidency and Forming a More Perfect Union",
  "description": "\"[Daybreak is] a useful guide to restore the balance of powers and reclaim our constitutional system of government.\"—Majorie Cohn, president of the National Lawyers Guild\"Daybreak urgently reminds us that good political intentions are not sufficient to ensure the continuation of our democracy; informed vigilance is vital to that task.\"—Mark Karlin, editor of Buzzflash.com\"Daybreak offers a powerful and compelling picture of what real change in America could look like. The world needs more true advocates of democracy like David Swanson!\"—Thom Hartmann,Syndicated Radio Show host and author of The Last Hours of Ancient Sunlight“Daybreak is an eye-opener about how our nation was hijacked by the Bush administration and how much repair work we, as citizens, must do. David Swanson, who has been a one-man wonder leading the charge for accountability, writes a compelling narrative that inspires not just outrage, but ACTION.”—Medea Benjamin, Co-Founder of CODEPINK and Global Exchange“David Swanson is the most thoughtful, determined, and energetic progressive activist in America, and one of the most important voices of his generation. He's also a unique bridge between traditional real-world organizing and the brand new world of online activism. His combination of cheerful organizing, passionate speaking, and brilliant blogging is an inspiration to everyone who craves a more just, peaceful, and sustainable world.”—Bob Fertik, President of Democrats.comA lot more has gone wrong over the last eight years than meets the eye, and it will take more than a new president to create the kind of change that is necessary.Daybreak is a thorough investigation of how Bush/Cheney altered the way American government works and deteriorated the Constitution and Bill of Rights. It includes clear plans for how we may reclaim democracy, declare our rights, and truly set out for a new America.Shocking and inspirational, Daybreak provides a clear breakdown of all that we have lost,",
  "genres": [
    "Politics"
  ],
  "author": "David  Swanson",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6502630-daybreak"
}