{
  "title": "Criminal Injustice: Slaves and Free Blacks in Georgia's Criminal Justice System",
  "description": "Criminal Injustice is the most comprehensive study of the criminal justice system of a slave state to date. McNair traces the evolution of Georgia's legal culture by examining its use of slave codes and slave patrols, as well as presenting data on crimes prosecuted, trial procedures and practices, conviction rates, the appellate process, and punishment. Based on more than four hundred capital cases, McNair's study deploys both narrative and quantitative analysis to get at both the theory and the reality of the criminal procedure for slaves in the century leading up to the Civil War. He shows how whites moved from the utopian innocence of the colony's original Trustees, who envisioned a society free of slavery and the depravity it inculcated in masters, to one where slaveholders became the enforcers of laws and informal rules, the severity of which was limited only by the increasing economic value of their slaves as property. The slaves themselves, regarded under the law both as moveable property and--for the purposes of punishment--as moral agents, had, inevitably, a radically different view of Georgia's slave criminal justice system. Although the rules and procedures were largely the same for both races, the state charged and convicted blacks more frequently and punished them more severely than whites for the same crimes. Courts were also more punitive in their judgment and punishment of black defendants when their victims were white, a pattern of disparate treatment based on race that persists to this day. Informal systems of control in urban households and on rural plantations and farms complemented the formal system and enhanced the power of slaveowners. Criminal Injustice shows how the prerogatives of slavery and white racial domination trumped any hope for legal justice for blacks.",
  "genres": [
    "History"
  ],
  "author": "Glenn McNair",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/6503443-criminal-injustice"
}