{
  "title": "Don Quixote",
  "description": "Edith Grossman's definitive English translation of the Spanish masterpiece. Widely regarded as the world's first modern novel, and one of the funniest and most tragic books ever written, Don Quixote chronicles the famous picaresque adventures of the noble knight-errant Don Quixote of La Mancha and his faithful squire, Sancho Panza, as they travel through sixteenth-century Spain. Unless you read Spanish, you've never read Don Quixote.\"Though there have been many valuable English translations of Don Quixote, I would commend Edith Grossman's version for the extraordinarily high quality of her prose. The Knight and Sancho are so eloquently rendered by Grossman that the vitality of their characterization is more clearly conveyed than ever before. There is also an astonishing contextualization of Don Quixote and Sancho in Grossman's translation that I believe has not been achieved before. The spiritual atmosphere of a Spain already in steep decline can be felt throughout, thanks to her heightened quality of diction.Grossman might be called the Glenn Gould of translators, because she, too, articulates every note. Reading her amazing mode of finding equivalents in English for Cervantes's darkening vision is an entrance into a further understanding of why this great book contains within itself all the novels that have followed in its sublime wake.\"From the Introduction by Harold BloomMiguel de Cervantes was born on September 29, 1547, in Alcala de Henares, Spain. At twenty-three he enlisted in the Spanish militia and in 1571 fought against the Turks in the battle of Lepanto, where a gunshot wound permanently crippled his left hand. He spent four more years at sea and then another five as a slave after being captured by Barbary pirates. Ransomed by his family, he returned to Madrid but his disability hampered him; it was in debtor's prison that he began to write Don Quixote. Cervantes wrote many other works, including poems and plays, but he remains best known as the author of Don Quixote. He died on April 23, 1616.",
  "genres": [
    "Fiction",
    "Classics",
    "Literature",
    "Spanish Literature",
    "Adventure",
    "Historical Fiction",
    "Novels"
  ],
  "author": "Miguel de Cervantes Saavedra",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/6502946-don-quixote"
}