{
  "title": "Katz on Dogs: A Commonsense Guide to Training and Living with Dogs",
  "description": "In a nation where our love of dogs keeps growing and dog ownership has reached an all-time high, confusion about dogs and their behavioral problems is skyrocketing. Many dogs are out of control, untrained, chewing up furniture, taking medication for anxiety, and biting millions of people a year.Now, in this groundbreaking new guide, Jon Katz, a leading authority on the human-canine bond, offers a powerful and practical philosophy for living with a dog, from the moment we decide to get one to the sad day when one dies. Conventional training methods often fail dog owners, but Katz argues that we know our dogs better than anyone else possibly could, and therefore we are well suited to train them. It is imperative, he says, that we think rationally and responsibly about how we choose, train, and live with the dogs we love, and the more we learn about ourselves, the better we can recognize their wonderful animal natures. Misinterpreting dogs is a profound obstacle to understanding them.Katz believes that both people and dogs are unique–a chow differs from a Lab just as a city dweller differs from a farmer–and he describes how such individuality isn’t addressed by even the best and most popular training methods. Not every training theory is for everyone, notes Katz, but almost anyone can train a dog and live with him comfortably. Katz on Dogs is filled with no-nonsense advice and answers to such key questions • What kind of dog should I have? Is there is a specific breed or kind of dog for my personality, family, or living situation?• What is the best way to train a dog?• Can I trust my vet?• How often (and for how long) can a dog be left alone?• Is it preferable to have only one dog, or are more better?• What are the secrets to successful housebreaking?• What are my dogs thinking, if anything?• How can I walk my dog instead of having her walk me?• Is it ever okay to give away a dog you love?• When is it time to put my dog down?Katz draws from his own experience, his interactions with thousands of dog owners, vets, breeders, dog rescue workers, trainers, and behaviorists, and he has tested his approach with volunteer dog owners around the country. Their helpful and often inspiring stories illustrate how all of us can live well with our dogs. You can do it, Katz contends. You can live a loving and harmonious life with your dog.",
  "genres": [
    "Dogs",
    "Nonfiction",
    "Animals",
    "Memoir"
  ],
  "author": "Jon Katz",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/65058.Katz_on_Dogs"
}