{
  "title": "Mission to Paris",
  "description": "It is the late summer of 1938, Europe is about to explode, the Hollywood film star Fredric Stahl is on his way to Paris to make a movie for Paramount France. The Nazis know he’s coming—a secret bureau within the Reich Foreign Ministry has for years been waging political warfare against France, using bribery, intimidation, and corrupt newspapers to weaken French morale and degrade France’s will to defend herself.   For their purposes, Fredric Stahl is a perfect agent of influence, and they attack him. What they don’t know is that Stahl, horrified by the Nazi war on Jews and intellectuals, has become part of an informal spy service being run out of the American embassy in Paris.   From Alan Furst, the bestselling author, often praised as the best spy novelist ever, comes a novel that’s truly hard to put down. Mission to Paris includes beautifully drawn scenes of romance and intimacy, and the novel is alive with extraordinary characters: the German Baroness von Reschke, a famous hostess deeply involved in Nazi clandestine operations; the assassins Herbert and Lothar; the Russian film actress and spy Olga Orlova; the Hungarian diplomat and spy, Count Janos Polanyi; along with the French cast of Stahl’s movie, German film producers, and the magnetic women in Stahl’s life, the socialite Kiki de Saint-Ange and the émigré Renate Steiner.   But always at the center of the novel is the city of Paris, the heart and soul of Europe—its alleys and bistros, hotels grand and anonymous, and the Parisians, living every night as though it was their last. As always, Alan Furst brings to life both a dark time in history and the passion of the human hearts that fought to survive it.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Espionage",
    "Mystery",
    "Thriller",
    "World War II",
    "France"
  ],
  "author": "Alan Furst",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/12963396-mission-to-paris"
}