{
  "title": "Definitely Maybe",
  "description": "Definitely Maybe is a slightly alcohol tinged story of conflict between a group of Soviet scientists who are all working on pet projects to different ends, and some unknown enemy who wants to stop them from making further scientific discoveries in any field. The main character, Malianov, is a physicist who is working on a paper concerning the effect of stellar bodies on near by gas clouds, and though we are never told this, it seems that he is on the verge of making an enormous discovery that could change the way we use physics. Malianov works out of an apartment he shares with his wife and son who have both gone off on a vacation to his mother-in-law's home in the South. As Malianov sets down to working, which seems difficult to do because of the incredible heat wave that has struck the city, he is set upon by one distraction after another. First a merchant accidentally delivers boxes and boxes of food and alcohol. Then a stunning looking woman shows up who claims to be a long-lost friend of his wife's. Then neighbors begin visiting randomly. Eventually one of his neighbors is found dead in a way that is suggestive of suicide, though because of some signs of foul play, and the police begin to investigate Malianov as a suspect. During brief bouts of sobriety Malianov discusses what is going on in his life with friends of his who are scientists too, and learns that some experiencing the same phenomena. Some even have been visited by a mysterious red-haired man, very similar to the investigator who has been hounding Malianov over the murder. The red haired man tries to strong arm them to stop working on their various scientific projects.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Russia",
    "Russian Literature",
    "Novels",
    "20th Century",
    "Speculative Fiction"
  ],
  "author": "Arkady Strugatsky",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/650777.Definitely_Maybe"
}