{
  "title": "Field Notes on Democracy: Listening to Grasshoppers",
  "description": "\"Gorgeously wrought...pitch-perfect prose...In language of terrible beauty, she takes India's everyday tragedies and reminds us to be outraged all over again.\" — Time MagazineCombining fierce conviction, deft political analysis, and beautiful writing, this is the essential new book from Arundhati Roy. This series of essays examines the dark side of democracy in contemporary India. It looks closely at how religious majoritarianism, cultural nationalism, and neo-fascism simmer just under the surface of a country that projects itself as the world's largest democracy. Roy writes about how the combination of Hindu Nationalism and India's neo-liberal economic reforms, which began their journey together in the early 1990s, are now turning India into a police state. She describes the systematic marginalization of religious and ethnic minorities, the rise of terrorism, and the massive scale of displacement and dispossession of the poor by predatory corporations. She also offers a brilliant account of the August 2008 uprising of the people of Kashmir against India's military occupation and an analysis of the November 2008 attacks on Mumbai. Field Notes on Democracy tracks the fault-lines that threaten to destroy India's precarious democracy and send shockwaves through the region and beyond. Praise for Field Notes on Democracy : \"In her searing account of the actual practice of the world's largest democracy, Arundhati Roy calls for 'factual precision' alongside of the 'real precision of poetry.' Remarkably, she combines those achievements to a degree that few can hope to approach. Roy shows in painful detail how the beneficiaries of the highly admired 10 percent growth rate are enjoying a 'new secessionism,' leaving the great majority languishing in poverty and despair, with malnutrition reaching the same levels as sub-Saharan Africa. As surveillance and state terror extend, all under the guise of flourishing democracy, India is becoming 'a nation waiting to be accused,' a nation where a confession extracted under torture can lead to the brink of nuclear war, and where 'fascism's firm footprint has appeared' in ways reminiscent of the early years of Nazism. Most chilling of all is that much of the grim portrait is all too familiar in the West. Roy asks whether our shriveled forms of democracy will be 'the endgame of the human race'—and shows vividly why this is a prospect not to be lightly dismissed.\" —Noam Chomsky\"After so much celebratory salesmanship about India the 'emerging market,' Roy draws us into India the actual country, peeling away the gloss until we are confronted with perhaps the most challenging question of our who and what are we willing to sacrifice in the name of development? Roy is one of the most confident and original thinkers of our time.\"—Naomi Klein\"The notion of Democracy and the pleading for human compassion first came together in Sophocles and the Greek tragedies. More than two thousand years later we live under an economic world tyranny of unprecedented brutality, which depends upon the systematic abuse of words like Democracy or Progress. Arundhati Roy, the direct descendant of Antigone, resists and denounces all tyrannies, pleads for their victims, and unflinchingly questions the tragic. Reflect with her on the answers she receives from the political world today.\" —John Berger Arundhati Roy is a world-renowned Indian author and global justice activist. From her celebrated Booker Prize–winning novel The God of Small Things to her prolific output of writing on topics ranging from climate change to war, the perils of free-market development in India, and the defense of the poor, Roy's voice has become indispensable to millions seeking a better world.",
  "genres": [
    "Nonfiction",
    "Politics",
    "India",
    "Essays",
    "History",
    "Indian Literature",
    "Philosophy"
  ],
  "author": "Arundhati Roy",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6506581-field-notes-on-democracy"
}