{
  "title": "Hold On to Your Dreams: Arthur Russell and the Downtown Music Scene, 1973-1992",
  "description": "Hold On to Your Dreams is the first biography of the musician and composer Arthur Russell, one of the most important but least known contributors to New York’s downtown music scene during the 1970s and 1980s. With the exception of a few dance recordings, including “Is It All Over My Face?” and “Go Bang! #5,” Russell’s pioneering music was largely forgotten until 2004, when the posthumous release of two albums brought new attention to the artist. This revival of interest gained momentum with the issue of additional albums and the documentary film Wild Combination. Based on interviews with more than seventy of his collaborators, family members, and friends, Hold On to Your Dreams provides vital new information about this singular, eccentric musician and his role in the boundary-breaking downtown music scene.Tim Lawrence traces Russell’s odyssey from his hometown of Oskaloosa, Iowa, to countercultural San Francisco, and eventually to New York, where he lived from 1973 until his death from AIDS-related complications in 1992. Resisting definition while dreaming of commercial success, Russell wrote and performed new wave and disco as well as quirky rock, twisted folk, voice-cello dub, and hip-hop-inflected pop. “He was way ahead of other people in understanding that the walls between concert music and popular music and avant-garde music were illusory,” comments the composer Philip Glass. “He lived in a world in which those walls weren’t there.” Lawrence follows Russell across musical genres and through such vital downtown music spaces as the Kitchen, the Loft, the Gallery, the Paradise Garage, and the Experimental Intermedia Foundation. Along the way, he captures Russell’s openness to sound, his commitment to collaboration, and his uncompromising idealism.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "History",
    "Queer",
    "Biography Memoir",
    "LGBT"
  ],
  "author": "Tim Lawrence",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/6512666-hold-on-to-your-dreams"
}