{
  "title": "Richter 10",
  "description": "From the New York Times bestselling author of Rama Revealed comes a thrilling new collaborative novel of the race to avert a massive the apocalyptic \"big one\" that threatens to send California sliding off into the Pacific Ocean.Arthur C.  Clarke is the greatest living writer of science fiction, the mind that produced a string of blockbuster New York Times 2001: A Space Odyssey and its sequels, as well as Rama II, The Garden of Rama and Rama Rescaled.   Now, he turns his remarkable imaginative powers to a near-future novel of the struggle to avoid catastrophe in the form of a colossal earthquake more destructive than any in human history.  Written with Mike McQuay, this is a thrilling novel of man's will to survive against unstoppable forces of nature.Lewis Crane lived through the devastating Los Angeles earthquake of 1994.  He survived, but his family didn't--and at ten years old, his life was ripped apart.At the age of thirty-five, Lewis has devoted himself to the study of the most powerful force on earthquakes.  He is the foremost expert in the field of seismology; and when he predicts a gigantic quake, everyone prepares for disaster.  But to his relief and dismay, the quake never occurs, and suddenly Crane is the subject of ridicule from scientists around the world.  Then he discovers a mistake in his calculations, and realizes that the \"Big One\" is just around the corner.  The clock is ticking as he attempts to convince the world that this time, catastrophe is certain.Richter 10 is vintage Arthur C.  Clarke--a fast-paced novel of ideas and near-future imagination, realized by McQuay's talent for characterization andingenious plotting--and is the major science fiction event of the season.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Thriller",
    "Apocalyptic",
    "Audiobook",
    "Science Fiction Fantasy"
  ],
  "author": "Arthur C. Clarke",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/650942.Richter_10"
}