{
  "title": "Strange and Difficult Times: Notes on a Global Pandemic",
  "description": "\"We had hoped that we lived in a world that would rally in the face of a common threat. Instead, we found that the collective good is abandoned for the economic and political benefit of a handful of people, and nationalist myths of exceptionalism rob billions of their right to survive.\"Strange and Difficult Times is a new essay collection looking at the biases, assumptions and moral failures in Western responses (both individual and collective, psychological and practical) to the 'crises' of the early twenty-first century. Nanjala Nyabola focusses on the big crisis of the current moment, Covid-19, and the world that it may leave in its wake.Condemning the ways in which the pandemic has exacerbated global inequalities, she argues against the lazy lens that attributes agency to the West and subjecthood to Africans and others in the Global South-drawing all of the aspects of the pandemic together into one structurally racist and ethically indifferent political and economic order. This is the Global South writing back against a system that wasn't designed to include or benefit it, in the voice of a representative with a keen understanding and first-hand experience of living and thinking within that system.Nyabola offers reflections on the future of the state, the purpose of government and the dangers of post-truth democracy. She presents the deepening of inequality via the 'new normal' of the 'post-Covid world', but which is in fact divided into societies that are post-Covid and those that have not been permitted to protect themselves and recover. And she takes a historical look at how African countries, governments, peoples and individuals have been treated and written about during past pandemics, including HIV/AIDS in the 80s and 90s, Ebola in the 2010s, and Spanish flu a century ago.",
  "genres": [
    "Africa",
    "Nonfiction"
  ],
  "author": "Nanjala Nyabola",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/65113313-strange-and-difficult-times"
}