{
  "title": "Fantasies of the Master Race: Literature, Cinema & the Colonization of American Indians",
  "description": "Chosen as an “Outstanding Book on the Subject of Human Rights in the United States” by the Gustavus Myers Center for the Study of Human Rights. In this volume of incisive essays, Wa Chosen as an “Outstanding Book on the Subject of Human Rights in the United States” by the Gustavus Myers Center for the Study of Human Rights. In this volume of incisive essays, Ward Churchill looks at representations of American Indians in literature and film, delineating a history of cultural propaganda that has served to support the continued colonization of Native America. During each phase of the genocide of American Indians, the media has played a critical role in creating easily digestible stereotypes of Indians for popular consumption. Literature about Indians was first written and published in order to provoke and sanctify warfare against them. Later, the focus changed to enlisting public support for “civilizing the savages,” stripping them of their culture and assimilating them into the dominant society. Now, in the final stages of cultural genocide, it is the appropriation and stereotyping of Native culture that establishes control over knowledge and truth. The primary means by which this is accomplished is through the powerful publishing and film industries. Whether they are the tragically doomed “noble savages” walking into the sunset of Dances With Wolves or Carlos Castaneda's Don Juan, the exotic mythical Indians constitute no threat to the established order. Literature and art crafted by the dominant culture are an insidious political force, disinforming people who might otherwise develop a clearer understanding of indigenous struggles for justice and freedom. This book is offered to counter that deception, and to move people to take action on issues confronting American Indians today. \"One of the most outspoken of current Native American activists, Churchill . . . is an amazingly consistent and perceptive writer.\"— Publishers Weekly \"Ward Churchill has long since proven himself to be one of the most eloquent and powerful spokes[people] for American Indian rights.\"—Russell Means Ward Churchill has achieved an unparalleled reputation as a scholar-activist and analyst of indigenous issues. He is a political activist and an author of numerous books, including A Little Matter of Genocide , Struggle for the Land , and Fantasies of the Master Race . rd Churchill looks at representations of American Indians in literature and film, delineating a history of cultural propaganda that has served to support the continued colonization of Native America. During each phase of the genocide of American Indians, the media has played a critical role in creating easily digestible stereotypes of Indians for popular consumption. Literature about Indians was first written and published in order to provoke and sanctify warfare against them. Later, the focus changed to enlisting public support for “civilizing the savages,” stripping them of their culture and assimilating them into the dominant society. Now, in the final stages of cultural genocide, it is the appropriation and stereotyping of Native culture that establishes control over knowledge and truth. The primary means by which this is accomplished is through the powerful publishing and film industries. Whether they are the tragically doomed “noble savages” walking into the sunset of Dances With Wolves or Carlos Castaneda's Don Juan, the exotic mythical Indians constitute no threat to the established order. Literature and art crafted by the dominant culture are an insidious political force, disinforming people who might otherwise develop a clearer understanding of indigenous struggles for justice and freedom. This book is offered to counter that deception, and to move people to take action on issues confronting American Indians today. \"One of the most outspoken of current Native American activists, Churchill ... is an amazingly consistent and perceptive writer.\"— Publishers Weekly \"Ward Churchill has long since proven himself to be one of the most eloquent and powerful spokes[people] for American Indian rights.\"—Russell Means Ward Churchill has achieved an unparalleled reputation as a scholar-activist and analyst of indigenous issues. He is a political activist and an author of numerous books, including A Little Matter of Genocide , Struggle for the Land , and Fantasies of the Master Race .",
  "genres": [
    "History",
    "Native American",
    "Race",
    "Nonfiction",
    "Indigenous",
    "History and Politics",
    "Cultural"
  ],
  "author": "Ward Churchill",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/651471.Fantasies_of_the_Master_Race"
}