{
  "title": "The Courage to Be Free: Florida's Blueprint for America's Revival",
  "description": "No American leader has accomplished more for his state than Governor Ron DeSantis. Now he reveals how he did it.He played baseball for Yale, graduated with honors from Harvard Law School, and served in Iraq and in the halls of Congress. But in all these places, Ron DeSantis learned the same lesson: He didn’t want to be part of the leftist elite.His heart was always for the people of Florida, one of the most diverse and culturally rich states in the union. Since becoming governor of the Sunshine State, he has fought—and won—battle after battle, defeating not just opposition from the political left, but a barrage of hostile media coverage proclaiming the end of the world.When he implemented COVID-19 policies based on evidence and focused on freedoms, the press launched a smear campaign against him, yet Florida’s economy thrived, its education system outperformed the nation, and Florida’s COVID mortality rate for seniors was lower than that in thirty-eight states. When he enacted policies to keep leftist political concepts like critical race theory and woke gender ideology out of Florida’s classrooms, the media demagogued his actions, but parents across Florida rallied to his cause. Dishonest attacks from the media don’t deter him. In fact, DeSantis keeps racking up wins for Floridians. In 2022, the governor delivered a historic, record-setting victory, winning by nearly 20 points and more than 1.5 million votes.A firsthand account from the blue-collar boy who grew up to take on Disney and Dr. Fauci, The Courage to Be Free delivers something rare from an elected leader: stories of victory. This book is a winning blueprint for patriots across the country. And it is a rallying cry for every American who wishes to preserve our liberties.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Memoir",
    "Leadership",
    "American History"
  ],
  "author": "Ron DeSantis",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/65146137-the-courage-to-be-free"
}