{
  "title": "If a Pirate I Must Be: The True Story of Black Bart, \"King of the Caribbean Pirates\"",
  "description": "In a page-turning tale brimming with adventure, author Richard Sanders tells of the remarkable exploits of Bartholomew Roberts (better known as Black Bart), the greatest of the Caribbean pirates. He drank tea instead of rum. He banned women and gambling on his ships. He never made his prisoners walk the plank, instead inviting them into his cabin for a friendly chat. And during the course of his extraordinary two-and-a-half-year career as a pirate captain, he captured four hundred prizes and brought trade in the eastern Caribbean to a standstill. In If a Pirate I Must Be..., Richard Sanders tells the larger-than-life story of Bartholomew Roberts, aka Black Bart. Born in a rural town, Roberts rose from third mate on a slave ship to pirate captain in a matter of months. Before long, his combination of audaciousness and cunning won him fame and fortune from the fisheries of Newfoundland to the slave ports of West Africa. Sanders brings to life a fascinating world of theater and ritual, where men (a third of whom were black) lived a close-knit, egalitarian life, democratically electing their officers and sharing their spoils. They were highly (if surreptitiously) popular with many merchants, with whom they struck incredibly lucrative deals. Yet with a fierce team of Royal Navy pirate hunters tracking his every move, Roberts’ heyday would prove a brief one, and with his capture, the Golden Age of pirates would pass into the lore and legend of books and movies. Based on historical records, journals and letters from pirates under Roberts’ command, and on writings by Roberts himself, If a Pirate I Must Be... is the true story of the greatest pirate ever to sail the Caribbean.",
  "genres": [
    "History",
    "Nonfiction",
    "Pirates",
    "Biography",
    "Historical",
    "Adventure",
    "World History"
  ],
  "author": "Richard   Sanders",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/651642.If_a_Pirate_I_Must_Be"
}