{
  "title": "The Macho Paradox: Why Some Men Hurt Women and How All Men Can Help",
  "description": "Praise for The Macho Paradox\"An honest, intellectually rigorous and insightful work that challenges readers to truly engage in a political discourse that can change lives, communities and nations.\"--Rosalind Wiseman, author of Queen Bees and Wannabes\"Jackson Katz is an American hero! With integrity and courage, he has taken his message--that the epidemic of violence against women is a men's issue--into athletic terms, the military and frat houses across the country. His book explains carefully and convincingly why--and how--men can become part of the solution, and work with women to build a world in which everyone is safer.\"--Michael Kimmel, author of Manhood in America, spokesperson, National Organization for Men Against Sexism (NOMAS)\"If only men would read Katz's book, it could serve as a potent form of male consciousness-raising.\"--Publishers Weekly\"This book leaves no man behind when it comes to taking violence against women personally....After reading this book you can see how important it is to be a stand-up guy and not a standy-by guy, no matter what race or culture you come from.\"--Alfred L. McMichael, 14th Sergeant Major of the Marine Corps and now serving as the Sergeant Major of NATO\"A candid look at the cultural factors that lend themselves to tolerance of abuse and violence against women.\"--Booklist\"These pages will empower both men and women to end the scourge of male violence and abuse. Katz knows how to cut to the core of the issues, demonstrating undeniably that stopping the degradation of women should be every man's priority.\"--Lundy Bancroft, author of Why Does He Do That?: Inside the Minds of Angry and Controlling Men",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Gender",
    "Sociology",
    "Psychology",
    "Social Justice",
    "Gender Studies"
  ],
  "author": "Jackson Katz",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/651653.The_Macho_Paradox"
}