{
  "title": "Imperium",
  "description": "Ryszard Kapuscinski's last book, The Soccer War -a revelation of the contemporary experience of war -- prompted John le Carre to call the author \"the conjurer extraordinary of modern reportage.\" Now, in Imperium, Kapuscinski gives us a work of equal emotional force and evocative a personal, brilliantly detailed exploration of the almost unfathomably complex Soviet empire in our time.He begins with his own childhood memories of the postwar Soviet occupation of Pinsk, in what was then Poland's eastern frontier (\"something dreadful and incomprehensible...in this world that I enter at seven years of age\"), and takes us up to 1967, when, as a journalist just starting out, he traveled across a snow-covered and desolate Siberia, and through the Soviet Union's seven southern and Central Asian republics, territories whose individual histories, cultures, and religions he found thriving even within the \"stiff, rigorous corset of Soviet power.\"Between 1989 and 1991, Kapuscinski made a series of extended journeys through the disintegrating Soviet empire, and his account of these forms the heart of the book. Bypassing official institutions and itineraries, he traversed the Soviet territory alone, from the border of Poland to the site of the most infamous gulags in far-eastern Siberia (where \"nature pals it up with the executioner\"), from above the Arctic Circle to the edge of Afghanistan, visiting dozens of cities and towns and outposts, traveling more than 40,000 miles, venturing into the individual lives of men, women, and children in order to Understand the collapsing but still various larger life of the empire.Bringing the book to a close is a collection of notes which, Kapuscinski writes, \"arose in the margins of my journeys\" -- reflections on the state of the ex-USSR and on his experience of having watched its fate unfold \"on the screen of a television set...as well as on the screen of the country's ordinary, daily reality, which surrounded me during my travels.\" It is this \"schizophrenic perception in two different dimensions\" that enabled Kapuscinski to discover and illuminate the most telling features of a society in dire turmoil.Imperium is a remarkable work from one of the most original and sharply perceptive interpreters of our world -- galvanizing narrative deeply informed by Kapuscinski's limitless curiosity and his passion for truth, and suffused with his vivid sense of the overwhelming importance of history as it is lived, and of our constantly shifting places within it.",
  "genres": [
    "Nonfiction",
    "History",
    "Russia",
    "Travel",
    "Polish Literature",
    "Politics",
    "Journalism"
  ],
  "author": "Ryszard Kapuściński",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/651772.Imperium"
}