{
  "title": "The Attitude Girl",
  "description": "EMOTIONAL TEEN DRAMA ESCORTS GIRLSALONG ROCKY ROAD TO ADULTHOODEveryone thinks Vicky has an attitude problem, but in her eyes, she's simply being realistic and honest about what she thinks and feels. If people can't handle it, well... it's their problem.The novel recounts a young woman's coming of age, with a little bit of sassiness and a lot of heart. Jam-packed with emotional conflict, trials and tribulations, romance and humor, this winner of 8 literary awards follows outspoken, materialistic 17-year-old Victoria Benson on her rocky road to adulthood as she struggles with financial setbacks, bullying, first love, idealism, loss and forgiveness along the way.Raising children has never been easy... And guiding them through adolescence in our tumultuous modern world? Maddening! Today's teens want entertainment! What they need , however, is a little bit of guidance, especially given the challenges of the current US economy. Written for young adults, ages 15 and up, and their parents, The Attitude Girl is an inspirational, award-winning timely book that gives them both...Selected as the Best Young Adult Novel of the Year by the 2010 Premier Book Awards , The Attitude Girl also placed as a Finalist of the 2010 National Indie Excellence Awards , was named a First-place Winner in the Young Adult/Teenage category at the 2009 London Book Festival and in the Arizona Authors Association Annual Literary Awards contest (Novels), and additionally received four Honorable Mentions in 2009/2010 literary competitions.                                                                      ***\" The Attitude Girl , written by Mila Bernadkin, is a book that every mother and/or daughter should read. It is filled with real life, true to life situations that every teen-aged girl goes through at some point in her life.\"~ Phyllis PomettaEditor-in-Chief, Tots to Teens Magazine\"I could not put this book down as page after page was filled with turmoil through the eyes of a seventeen-year-old. There are some parts of this book that I laughed a little and cried a lot, something touched me about this book in a way that only one who has lived through some of the situations can feel.  A great story from front to back that I recommend to everyone, especially those with tween/teen age daughters. Loved this book!\"~ Jennifer LeetOwner and Publisher, The Dirty T-shirt Blog",
  "genres": [],
  "author": "Mila Bernadkin",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/6517957-the-attitude-girl"
}