{
  "title": "The Problem with Murmur Lee",
  "description": "The bestselling author of Before Women Had Wings spins a wild new tale about the strong bonds among a group of friends that loses its quirkiest member, Murmur Lee. Exploring new literary territory while keeping to her native Floridian roots, Fowler is here at her most original and entertaining.As a new year dawns over the island of Iris Haven, Murmur Lee Harp and her lover, Billy, go for a romantic sail without a care in the world. The evening comes to an abrupt halt when Murmur Lee discovers that she has drowned—but by whose hand?—in the Iris Haven river.Grief-stricken and haunted by the mysteries surrounding her death, Murmur Lee’s circle of friends sets out to discover what really happened to her, and in the process they learn as much about her failings and triumphs as their own. After years of self-exile in the North, Charlee Mudd returns to set her best friend’s affairs in order, only to confront her own ghosts. Edith Piaf, a former marine whose sex change at the age of sixty-two Murmur Lee supported unquestioningly, must find the confidence to carry on without the encouragement of her friend. Lonely widower Dr. Zachary Klein plummets into the depths of depression at the loss of the second woman he has ever loved. As for Murmur Lee—who lived her entire life on an island named by her great-great grandfather in honor of the Greek goddess who receives the souls of dying women—in death she experiences her own journey as she is plunged into her familial past and discovers the truth about who she really is.With poignancy and humor Fowler weaves the voices of Murmur and her friends into a compelling narrative. Part family saga, part murder mystery, The Problem with Murmur Lee is Fowler’s most rewarding and engrossing work yet.",
  "genres": [
    "Fiction",
    "Book Club",
    "Mystery",
    "Humor",
    "Grief",
    "Friendship",
    "Southern"
  ],
  "author": "Connie May Fowler",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/652039.The_Problem_with_Murmur_Lee"
}