{
  "title": "Across the Stars",
  "description": "Science Fiction/FantasySolae O'bora is the most successful bounty hunter around. She always gets her man and she's not above using her sexuality to do it. What she won't do is allow herself to become involved with any man who wants to control her.Raav Asirian makes war for money, a ruthless mercenary with a reputation for exotic sexual appetites. He'd like nothing better than to get his hands on luscious bounty hunter, Solae O'bora, but she continually declines his advances. Until a twist of fate brings them together on Cyntr-Rho, the pleasure planet.On R&R, Asirian spies Solae in a local hot spot, dancing seductively with a known felon. Assuming she's after a bounty, he makes a deal with the bar owner in an effort to bring the gorgeous hunter to heel. He's got something she wants, and to get it, she must agree to spend one night in his bed -- doing anything and everything he demands of her. Thus begins her initiation into the world of BDSM, where pleasure and pain are intimate bedfellows and giving up control is the biggest turn on of all.On her own again, Solae arrives on Toru Two to collect bounty papers on the pirate who’d killed her mother and sister. To her dismay, she learns she is to be partnered with Asirian. Despite their mutual fears, they fall in love, only to be torn apart by a secret Asirian has kept hidden from her -- a secret she may never be able to forgive.In a desperate bid for freedom, she steals his transport and flees, only to discover it's not so easy to leave a man willing to follow you across the stars.Publisher's This book contains explicit sexual content, graphic language, and situations that some readers may find Anal play/intercourse, domination/submission, dubious consent, exhibitionism, mild bondage, spanking, voyeurism.",
  "genres": [
    "BDSM",
    "Science Fiction",
    "Science Fiction Romance",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "Futuristic"
  ],
  "author": "India Masters",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/6521094-across-the-stars"
}