{
  "title": "Malignant Self-Love: Narcissism Revisited",
  "description": "You are not alone!Are YOU Abused? Stalked? Harassed? Victimized? Confused and Frightened? Were you brought up by a Narcissistic or Psychopathic Parent? Married to a Narcissist or a Psychopath - or Divorcing One? Afraid your children will turn out to be narcissists or psychopaths? Want to cope with this pernicious, baffling condition?OR: Are You a Narcissist or a Psychopath - or suspect that You may be one ...This book will teach you how to Cope, Survive, and Protect Your Loved Ones!\"Malignant Self-love: Narcissism Revisited\" is based on correspondence since 1996 with hundreds of people diagnosed with Narcissistic and Antisocial Personality Disorders (narcissists and psychopaths) and with thousands of their suffering family members, friends, therapists, and colleagues.The first ever book about narcissistic abuse, Malignant Self-love: Narcissism Re-Visited offers a detailed, first hand account of what it is like to have a Narcissistic Personality Disorder. It contains new insights and an organized methodological framework. The first part of the book comprises more than 100 Frequently Asked Questions (FAQs) regarding relationships with abusive narcissists and the Narcissistic Personality Disorder.What is a personality disorder? When the personality is rigid to the point of being unable to change in reaction to changing circumstances - we say that it is disordered. Such a person takes behavioral, emotional, and cognitive cues exclusively from others. His inner world is, so to speak, vacated. His True Self is dilapidated and dysfunctional. Instead he has a tyrannical and delusional False Self. Such a person is incapable of loving and of living. He cannot love others because he cannot love himself. He loves his reflection, his surrogate self. And he is incapable of living because life is a struggle towards, a striving, a drive at something. In other words: life is change. He who cannot change cannot live.The narcissist is an actor in a monodrama, yet forced to remain behind the scenes. The scenes take center stage, instead. The Narcissist does not cater at all to his own needs. Contrary to his reputation, the Narcissist does not \"love\" himself in any true sense of the word.He feeds off other people, who hurl back at him an image that he projects to them. This is their sole function in his world: to reflect, to admire, to applaud, to detest - in a word, to assure him that he exists. Otherwise, the narcissist feels, they have no right to tax his time, energy, or emotions.The posting of Malignant Self Love - Narcissism Re-Visited on the Web has elicited a flood of excited, sad and heart rending responses, mostly from victims of Narcissists but also from people suffering from the NPD. This is a true picture of the resulting correspondence with them.This book is not intended to please or to entertain. NPD is a pernicious, vile and tortuous disease, which affects not only the Narcissist. It infects and forever changes people who are in daily contact with the Narcissist. In other words: it is contagious. It is my contention that Narcissism is the mental epidemic of the twentieth century, a plague to be fought by all means.This tome is my contribution to minimizing the damages of this disorder.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Medicine",
    "Psychoanalysis",
    "Abuse"
  ],
  "author": "Sam Vaknin",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/651943.Malignant_Self_Love"
}