{
  "title": "The Corset: A Cultural History",
  "description": "The corset is probably the most controversial garment in the history of fashion. Although regarded as an essential element of fashionable dress from the Renaissance into the twentieth century, the corset was also frequently condemned as an instrument of torture and the cause of ill health. Why did women continue to don steel and whalebone corsets for four hundred years? And why did they finally stop? This lavishly illustrated book offers fascinating and often surprising answers to these questions. Valerie Steele, one of the world’s most respected fashion historians, explores the cultural history of the corset, demolishing myths about this notorious garment and revealing new information and perspectives on its changing significance over the centuries. Whereas most historians have framed the history of the corset in terms of oppression vs. liberation and fashion vs. health and comfort, Steele contends that women’s experiences of corsetry varied considerably and cannot be fully understood within these narrow frames.Drawing on extensive research in textual, visual, and materials sources, the author disproves the beliefs that the corset was dangerously unhealthy and was designed primarily for the oppression of women. Women persisted in wearing corsets—despite powerful male authorities trying to dissuade them—because corsetry had positive connotations of social status, self-discipline, youth, and beauty. In the twentieth century the garment itself fell out of fashion but, Steele points out, it has become internalized as women replace the boned corset with diet, exercise, and plastic surgery. The book concludes with insightful analyses of such recent developments as the reconception of the corset as a symbol of rebellion and female sexual empowerment, the revival of the corset in contemporary high fashion, and its transformation from an item of underwear to outerwear.",
  "genres": [
    "Fashion",
    "History",
    "Nonfiction",
    "Fashion History",
    "Historical",
    "Feminism",
    "Art"
  ],
  "author": "Valerie Steele",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/651979.The_Corset"
}