{
  "title": "Ni de Eva ni de Adán",
  "description": "Un año antes de la temporada infernal en una empresa nipona vivida en Estupor y temblores, Amélie Nothomb se sube en Tokio a la montaña rusa de una hilarante educación sentimental en brazos del muy delgado y muy oriental Rinri, un ávido lector de Stendhal que sueña con entrar en la orden del Temple. Amélie, decidida a aprender japonés enseñando francés a los autóctonos, conoce a Rinri en un bar. Pero, pocos días después, la relación entre maestra y alumno dará paso a una hermosa historia de amor. La primera noche de pasión se inicia con un cómico episodio en que profesora y alumno comparten una insípida imitación japonesa de la célebre fondue de queso francesa; le seguirán un viaje a Hiroshima y la lectura in situ de Hiroshima mon amour, un libro que Rinri detesta y no logra comprender, y el ascenso al monte Fuji, en el que la belga es poseída por el espíritu de la montaña.Éstos son sólo algunos de los episodios que nos sitúan, una vez más, ante una rica y peculiar visión de Japón, la de alguien nacido allí pero cuyos orígenes son occidentales. La percepción de la alteridad de la cultura japonesa cobra en el libro los más variopintos matices. La relación de Amélie con Rinri se reviste de un barniz proustiano en una comida.con los amigos de su amante en la que un okonomiyaki la catapulta a los sabores de su infancia. Y Nothomb también analiza sus experiencias desde una perspectiva casi antropológica, nunca exenta de ironía, en las reflexiones sobre la educación de los japoneses, o cuando la joven es examinada por los abuelos de Rinri, a quienes su mera presencia hace tronchar de risa.Cuando Amélie Nothomb se adentra en el terreno de lo biográfico jamás defrauda. Así sucedió con Estupor y temblores, Metafísica de los tubos y El sabotaje amoroso y sucede de nuevo con Ni de Eva ni de Adán. Tan ácida y desternillante como la primera, la segunda incursión japonesa de la escritora belga se lee con gran placer desde la primera hasta la última línea. La diversión está asegurada, pero también la ternura e incluso la melancolía... , porque cuando Nothomb escribe en primera persona fascina, divierte, hace pensar y hace reír.",
  "genres": [
    "Fiction",
    "Japan",
    "France",
    "Contemporary",
    "Romance",
    "Roman",
    "Belgium"
  ],
  "author": "Amélie Nothomb",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/6517761-ni-de-eva-ni-de-ad-n"
}