{
  "title": "The Risk It Takes to Bloom: On Life and Liberation",
  "description": "A passionate, powerful memoir by a trailblazing Black transgender activist, tracing her life of transformation and her work towards collective liberation.In 2017, Raquel Willis took to the National Women’s March podium just after the presidential election of Donald Trump, primed to tell her story as a young Black transgender woman from the South. Despite having her speaking time cut short, the appearance only deepened her commitment to speaking up for communities on the margins.Born in Augusta, Georgia, to Black Catholic parents, Raquel spent years feeling isolated, even within a loving, close-knit family. There was little access to understanding what it meant to be queer and transgender. It wasn’t until she went to the University of Georgia that she found the LGBTQ+ community, fell in love, and explored her gender for the first time. But the unexpected death of her father forced her to examine her relationship with herself and those she loved. These years of grief, misunderstanding, and hard-won epiphanies seeped into the soil of her life, serving as fertilizer for growth and allowing her to bloom within.Upon graduation, Raquel entered a career in journalism against the backdrop of the burgeoning Movement for Black Lives, intersectional feminism going mainstream, and unprecedented visibility of the trans community. After hiding her identity as a newspaper reporter, her increasing awareness of the epidemic of violence plaguing trans women of color and the heightened suicide of trans teens inspired her to come out publicly. Within just a few short years of community organizing in Atlanta, Oakland, and New York, Raquel emerged as one of the most formidable Black trans activists in history.In The Risk It Takes to Bloom, Raquel Willis recounts with passion and candor her experiences straddling the Obama and Trump eras, the possibility of transformation after tragedy, and how complex moments can push us all to take necessary risks and bloom toward collective liberation.",
  "genres": [
    "Memoir",
    "LGBT",
    "Nonfiction",
    "Queer",
    "Transgender",
    "Feminism",
    "Audiobook"
  ],
  "author": "Raquel Willis",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/65214654-the-risk-it-takes-to-bloom"
}