{
  "title": "Traitor of Redwinter",
  "description": "Traitor of Redwinter is the second in Ed McDonald’s Redwinter Chronicles, full of shady politics, militant monks, ancient powers... and a young woman navigating a world in which no one is quite what they seem.The power of the Sixth Gate grows stronger within Raine each day―to control it, she needs lessons no living Draoihn can teach her. Her fledgling friendships are tested to a breaking point as she tries to face what she has become, and her master Ulovar is struck by a mysterious sickness that slowly saps the vitality from his body, leaving Raine to face her growing darkness alone. There’s only one chance to turn the tide of power surging within her―to learn the secrets the Draoihn themselves purged from the world.The book can teach her. She doesn’t know where she found it, or when exactly, but its ever changing pages whisper power that has lain untouched for centuries.As the king’s health fails and the north suffers in the grip of famine, rebellious lords hunger for the power of the Crown, backed by powers that would see the Crowns undone. Amidst this growing threat, Raine’s former friend Ovitus brings a powerful new alliance, raising his status and power of his own. He professes support for the heir to the throne even as others would see him take it for himself, and desperately craves Raine’s forgiveness―or her submission.But the grandmaster has her own plans for Raine, and the deadly training she has been given has not been conducted carelessly. In Raine she seeks to craft a weapon to launch right into her enemy’s heart, as Redwinter seeks to hold onto power.Amidst threats old and new, Raine must learn the secrets promised by the book, magic promised by a queen with a crown of feathers. A queen to whom Raine has promised more than she can afford to give…",
  "genres": [
    "Fantasy",
    "Fiction",
    "Audiobook",
    "Adult",
    "Queer",
    "Epic Fantasy",
    "LGBT"
  ],
  "author": "Ed McDonald",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/65213676-traitor-of-redwinter"
}