{
  "title": "Surely You Can't Be Serious: The True Story of Airplane!",
  "description": "Surely You Can't Be Serious is an in-depth and hysterical look at the making of 1980's comedy classic Airplane! by the legendary writers and directors of the hit film.Airplane! premiered on July 2nd, 1980. With a budget of $3.5 million it went on to make nearly $200 million in sales and has influenced a multitude of comedians on both sides of the camera.Surely You Can’t Be Serious is the first-ever oral history of the making of Airplane! by the creators, and of the beginnings of the ZAZ trio (Zucker, Abrahams, Zucker) – charting the rise of their comedy troupe Kentucky Fried Theater in Madison, Wisconsin all the way to premiere night. The directors explain what drew them to filmmaking and in particular, comedy. With anecdotes, behind the scenes trivia, and never-before-revealed factoids – these titans of comedy filmmaking unpack everything from how they persuaded Peter Graves to be in the movie after he thought the script was a piece of garbage, how Lorna Patterson auditioned for the stewardess role in the back seat of Jerry’s Volvo, and how Leslie Nielsen’s pranks got the entire crew into trouble, to who really wrote the jive talk. The book also features testimonials and personal anecdotes from well-known faces in the film, television, and comedy sphere – proving how influential Airplane! has been from day one.Four decades after its release, Airplane! continues to make new generations laugh. Its many one-liners and visual gags have worked their way into the mainstream culture. This fully organic expansion of the ZAZ trio’s fan-base, prompted solely by word-of-mouth, comes as no surprise to longtime fans. When all around us is in flux – laughter is priceless.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Audiobook",
    "Film",
    "Memoir",
    "History",
    "Comedy"
  ],
  "author": "David Zucker",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/65214162-surely-you-can-t-be-serious"
}