{
  "title": "Yours for the Taking",
  "description": "The year is 2050. Ava and her girlfriend live in what's left of Brooklyn, and though they love each other, it's hard to find happiness while the effects of climate change rapidly eclipse their world. Soon, it won't be safe outside at all. The only people guaranteed survival are the ones whose applications are accepted to The Inside Project, a series of weather-safe, city-sized structures around the world.Jacqueline Millender is a reclusive billionaire/women’s rights advocate, and thanks to a generous donation, she’s just become the director of the Inside being built on the bones of Manhattan. Her ideas are unorthodox, yet alluring—she's built a whole brand around rethinking the very concept of empowerment.Shelby, a business major from a working-class family, is drawn to Jacqueline’s promises of power and impact. When she lands her dream job as Jacqueline’s personal assistant, she's instantly swept up into the glamourous world of corporatized feminism. Also drawn into Jacqueline's orbit is Olympia, who is finishing up medical school when Jacqueline recruits her to run the health department Inside. The more Olympia learns about the project, though, the more she realizes there's something much larger at play. As Ava, Olympia, and Shelby start to notice the cracks in Jacqueline's system, Jacqueline tightens her grip, becoming increasingly unhinged and dangerous in what she is willing to do—and who she is willing to sacrifice—to keep her dream alive.At once a mesmerizing story of queer love, betrayal, and chosen family, and an unflinching indictment of cis, corporate feminism, Yours for the Taking holds a mirror to our own world, in all its beauty and horror.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "LGBT",
    "Queer",
    "Dystopia",
    "Lesbian",
    "Audiobook"
  ],
  "author": "Gabrielle  Korn",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/65213204-yours-for-the-taking"
}