{
  "title": "Eat This Not That! 2010: The No-Diet Weight Loss Solution",
  "description": "Eat All Your Favorite Foods―And Watch the Pounds Disappear!Two years after the runaway success of the original Eat This, Not That! , co-authors Matt and Dave noticed an interesting trend: Restaurants were actually cleaning up their menus! With consumers avoiding the country's worst calorie offenses, some restaurants saw fit to remove them from the menu entirely. Consider this: · After Chili's Awesome Blossom took the runner-up spot on the \"Worst Foods in America\" list, Chili's removed the appetizer from their menu entirely.· Pepperidge Farm followed suit after being placed on the Worst Foods list and discontinued their Roasted Chicken Pot Pie.· When Jamba Juice earned a citation on the Worst Drinks in America list, the chain stopped serving the largest size of their Chocolate Moo'd smoothie and recommitted itself to becoming one of the healthiest restaurant chains in the nation. The problem is, as the old crop of calorie atrocities were eliminated, a new army of gut-bombs emerged in their place. That's why the authors created Eat This, Not That! 2010 , to empower you with the knowledge to battle a food industry bent on sabotage your waistline with unwanted and unnecessary calories. In this new-and-expanded edition, you'll find fresh restaurant and supermarket comparisons, an encyclopedia of food packaging lies, and the invaluable guide to eating healthy on a budget. Essentially you'll learn how to make effortless food swaps that will help you strip away 10, 20, 30 pounds or more. Did you know:· Choosing Prime Rib over Baby Back Ribs at Outback will save you more than 2,000 calories?· You can save nearly 500 calories and more than 20 grams of fat just by ordering your banana split at Dairy Queen instead of Baskin-Robbins?· A Stouffer's White Meat Chicken Pot Pie has as much saturated fat as 6 scoops of ice cream? (Choose our alternative and save more than 900 calories!)",
  "genres": [
    "Food",
    "Cookbooks",
    "Nonfiction",
    "Cooking",
    "Health",
    "Diets",
    "Reference"
  ],
  "author": "David Zinczenko",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/6526301-eat-this-not-that-2010"
}