{
  "title": "Animal Spirits: How Human Psychology Drives the Economy, and Why It Matters for Global Capitalism",
  "description": "From acclaimed economists George Akerlof and Robert Shiller, the case for why government is needed to restore confidence in the economyThe global financial crisis has made it painfully clear that powerful psychological forces are imperiling the wealth of nations today. From blind faith in ever-rising housing prices to plummeting confidence in capital markets, \"animal spirits\" are driving financial events worldwide. In this book, acclaimed economists George Akerlof and Robert Shiller challenge the economic wisdom that got us into this mess, and put forward a bold new vision that will transform economics and restore prosperity.Akerlof and Shiller reassert the necessity of an active government role in economic policymaking by recovering the idea of animal spirits, a term John Maynard Keynes used to describe the gloom and despondence that led to the Great Depression and the changing psychology that accompanied recovery. Like Keynes, Akerlof and Shiller know that managing these animal spirits requires the steady hand of government窶不imply allowing markets to work won't do it. In rebuilding the case for a more robust, behaviorally informed Keynesianism, they detail the most pervasive effects of animal spirits in contemporary economic life窶不uch as confidence, fear, bad faith, corruption, a concern for fairness, and the stories we tell ourselves about our economic fortunes窶病nd show how Reaganomics, Thatcherism, and the rational expectations revolution failed to account for them.Animal Spirits offers a road map for reversing the financial misfortunes besetting us today. Read it and learn how leaders can channel animal spirits窶付he powerful forces of human psychology that are afoot in the world economy today.",
  "genres": [
    "Economics",
    "Psychology",
    "Nonfiction",
    "Finance",
    "Business",
    "Politics",
    "Science"
  ],
  "author": "George A. Akerlof",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/6531261-animal-spirits"
}