{
  "title": "When God Looked the Other Way: An Odyssey of War, Exile, and Redemption",
  "description": "Often overlooked in accounts of World War II is the Soviet Union's quiet yet brutal campaign against Polish citizens, a campaign that included, we now know, war crimes for which the Soviet and Russian governments only recently admitted culpability. Standing in the shadow of the Holocaust, this episode of European history is often overlooked. Wesley Adamczyk's gripping memoir, When God Looked the Other Way , now gives voice to the hundreds of thousands of victims of Soviet barbarism.Adamczyk was a young Polish boy when he was deported with his mother and siblings from their comfortable home in Luck to Soviet Siberia in May of 1940. His father, a Polish Army officer, was taken prisoner by the Red Army and eventually became one of the victims of the Katyn massacre, in which tens of thousands of Polish officers were slain at the hands of the Soviet secret police. The family's separation and deportation in 1940 marked the beginning of a ten-year odyssey in which the family endured fierce living conditions, meager food rations, chronic displacement, and rampant disease, first in the Soviet Union and then in Iran, where Adamczyk's mother succumbed to exhaustion after mounting a harrowing escape from the Soviets. Wandering from country to country and living in refugee camps and the homes of strangers, Adamczyk struggled to survive and maintain his dignity amid the horrors of war.When God Looked the Other Way is a memoir of a boyhood lived in unspeakable circumstances, a book that not only illuminates one of the darkest periods of European history but also traces the loss of innocence and the fight against despair that took root in one young boy. It is also a book that offers a stark picture of the unforgiving nature of Communism and its champions. Unflinching and poignant, W hen God Looked the Other Way will stand as a testament to the trials of a family during wartime and an intimate chronicle of episodes yet to receive their historical due.“Adamczyk recounts the story of his own wartime childhood with exemplary precision and immense emotional sensitivity, presenting the ordeal of one family with the clarity and insight of a skilled novelist. . . . I have read many descriptions of the Siberian odyssey and of other forgotten wartime episodes. But none of them is more informative, more moving, or more beautifully written than When God Looked the Other Way .”—From the Foreword by Norman Davies, author of A History and Rising ’44: The Battle for Warsaw “A finely wrought memoir of loss and survival.”— Publishers Weekly“Adamczyk’s unpretentious prose is well-suited to capture that truly awful reality.” —Andrew Wachtel, Chicago Tribune Books “Mr. Adamczyk writes heartfelt, straightforward prose. . . . This book sheds light on more than one forgotten episode of history.”—Gordon Haber, New York Sun “One of the most remarkable World War II sagas I have ever read. It is history with a human face.”—Andrew Beichman, Washington Times",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "Poland",
    "World War II",
    "War",
    "Politics"
  ],
  "author": "Wesley Adamczyk",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/653078.When_God_Looked_the_Other_Way"
}