{
  "title": "Buddhist Philosophy: Essential Readings",
  "description": "The Buddhist philosophical tradition is vast, internally diverse, and comprises texts written in a variety of canonical languages. It is hence often difficult for those with training in Western philosophy who wish to approach this tradition for the first time to know where to start, and difficult for those who wish to introduce and teach courses in Buddhist philosophy to find suitable textbooks that adequately represent the diversity of the tradition, expose students to important primary texts in reliable translations, that contextualize those texts, and that foreground specifically philosophical issues.Buddhist Philosophy fills that lacuna. It collects important philosophical texts from each major Buddhist tradition. Each text is translated and introduced by a recognized authority in Buddhist studies. Each introduction sets the text in context and introduces the philosophical issues it addresses and arguments it presents, providing a useful and authoritative guide to reading and to teaching the text. The volume is organized into topical sections that reflect the way that Western philosophers think about the structure of the discipline, and each section is introduced by an essay explaining Buddhist approaches to that subject matter, and the place of the texts collected in that section in the enterprise.This volume is an ideal single text for an intermediate or advanced course in Buddhist philosophy, and makes this tradition immediately accessible to the philosopher or student versed in Western philosophy coming to Buddhism for the first time. It is also ideal for the scholar or student of Buddhist studies who is interested specifically in the philosophical dimensions of the Buddhist tradition.",
  "genres": [
    "Buddhism",
    "Philosophy",
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Eastern Philosophy",
    "Essays"
  ],
  "author": "William Edelglass",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/6531274-buddhist-philosophy"
}