{
  "title": "A Country Called Amreeka: Arab Roots, American Stories",
  "description": "Among the surfeit of narratives about Arabs that have been published in recent years, surprisingly little has been reported on Arabs in America -- an increasingly relevant issue. This book is the most powerful approach imaginable: it is the story of the last forty-plus years of American history, told through the eyes of Arab Americans. It begins in 1963, before major federal legislative changes seismically transformed the course of American immigration forever. Each chapter describes an event in U.S. history -- which may already be familiar to us -- and invites us to live that moment in time in the skin of one Arab American. The chapters follow a timeline from 1963 to the present, and the characters live in every corner of this country.These are dramatic narratives, describing the very human experiences of love, friendship, family, courage, hate, and success. There are the timeless tales of an immigrant community becoming American, the nostalgia for home, the alienation from a society sometimes as intolerant as its laws are generous. A Country Called Amreeka's snapshots allow us the complexity of its characters' lives with an impassioned narrative normally found in fiction.Read separately, the chapters are entertaining and harrowing vignettes; read together, they add a new tile to the mosaic of our history. We meet fellow Americans of all creeds and colors, among them the Alabama football player who navigates the stringent racial mores of segregated Birmingham, where a church bombing wakes a nation to the need to make America a truly more equal place; the young wife from Ramallah -- now living in Baltimore -- who had to abandon her beautiful home and is now asked by a well-meaning American, \"How do you like living in an apartment after living in a tent?\"; the Detroit toughs and the potsmoking suburban teenagers, who in different decades become politicized and serious about their heritage despite their own wills; the homosexual man afraid to be gay in the Arab world and afraid to be Arab in America; the two formidable women who wind up working for opposing campaigns in the 2000 presidential election; the Marine fighting in Iraq who meets villagers who ask him, \"What are you, an Arab, doing here?\" We glimpse how America sees Arabs as much as how Arabs see America. We revisit the 1973 oil embargo that initiated the American perception of all Arabs as oil-rich sheikhs; the 1979 Iranian hostage crisis that heralded the arrival of Middle Eastern Islam in the American consciousness; bombings across three decades in Los Angeles, Oklahoma City, and New York City that bring terrorism to American soil; and both wars in Iraq that have posed Arabs as the enemies of America.In a post-9/11 world, Arabic names are everywhere in America, but our eyes glaze over them; we sometimes don't know how to pronounce them or understand whence they come. A Country Called Amreeka gives us the faces behind those names and tells the story of a community it has become essential for us to understand. We can't afford to be oblivious.",
  "genres": [
    "Nonfiction",
    "History",
    "Book Club",
    "American",
    "Short Stories",
    "Literature"
  ],
  "author": "Alia Malek",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/6534576-a-country-called-amreeka"
}