{
  "title": "The Fateful Adventures of the Good Soldier Svejk During the World War, Book Two",
  "description": "In Book One of The Fateful Adventures of the Good Soldier Svejk During the World War Jaroslav Hasek wrote about the familiar world he lived in and wrote about his whole life before the onset of the \"War to End All Wars\". Book One introduces that world to those who are not familiar with it. For those \"in the know\" it is a hilarious stroll down the familiar the pubs, cops, politics, houses of ill repute, eking out a living. Even after Svejk already joined the military, life goes on as usual. He and his cohorts might be in uniform, but frequent the same pubs, interact with the same people under similar circumstances. The military is not much different than the police. It's just another uniformed service diminishing one's options and pleasure, only to be outwitted and largely ignored. Book One sets the stage for what follows once Svejk moves out with his outfit to go to the front. As the text, now continuing in Book Two, progresses, it becomes clear that The Good Soldier Svejk is not a book meant for the light entertainment of the leisure class. There have been quite a few \"livingers\", people making a living from interpreting what Hasek meant by what he wrote, who or what svejk is and arguing among themselves. If the common working people find the text funny or even hilarious, it is because, as Don DeGrazia put it, it is \"a bellowing barroom brawl of a book that will forever have everyday people doubled-up with the painful laughter of recognition\". Such laughing people know svejk without having to analyze him or the text he lives in. On the other hand, if you want to take that route, you will find a lot of material to confront at SvejkCentral.com.",
  "genres": [
    "Czech Literature",
    "Fiction",
    "Classics",
    "Humor",
    "Adventure",
    "Comedy",
    "Novels"
  ],
  "author": "Jaroslav Hašek",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/6533215-the-fateful-adventures-of-the-good-soldier-svejk-during-the-world-war-b"
}