{
  "title": "Screenshot",
  "description": "In this provocative and fast-paced novel, an interactive assassin broadcasts his deeds live to an eager online audience. The macabre genius behind the killings calls himself Screenshot and taunts his targets—a pedophile, a drug dealer, and a mob boss—by giving bizarre names to the horrific execution methods he devises. He then invites the audience members to bid on the right to pull the trigger. A reporter who has been manipulated into being Screenshot's spokesman to the world, a female cop, and an eccentric scientist with a grudge all form an unlikely alliance that must stop Screenshot before the next deadly broadcast, but two of the trio are soon captured and scheduled to be the next fatal attraction. This riveting techno-thriller poses the question: If killing an evil man will save many lives, can his murder be justified?Booklist Review:It was only a matter of time before someone took that next step in the digital world: murder, broadcast over the Internet for all the world to see. First a drug lord goes down, then a pedophile, then a mobster. The public is at once incensed and intrigued; the vigilante aspect—the victims are bad guys, after all—somehow makes the spectacle less appalling and adds to the sicko entertainment factor. When the killer announces that he will accept bids for the right to pull the cybertrigger for the next execution, the online world ponies up. The only ones who can stop the madness, apparently, are disgruntled FBI investigator Karen, freelance journalist Seth, and gifted but overlooked scientist Dr. Sicals. The unlikely trio joins forces to prevent further killings, and the pursuit keeps readers on the edge of their seats. The central question of whether killing one for the greater good of many should be tolerated is treated with a bit of a heavy hand, but the author’s message doesn’t distract overmuch from what is a satisfying debut thriller.Mary Frances Wilkens - Booklist, the official review magazine of The American Library Association",
  "genres": [
    "Thriller",
    "Mystery",
    "Mystery Thriller"
  ],
  "author": "John Darrin",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/6534251-screenshot"
}