{
  "title": "Betty Crocker's Cooky Book",
  "description": "Here is the complete cooky book-more than 450 recipes, dozens of appetizing full-color photographs, and many how-to-do-it sketches. This treasury of cooky baking embraces all tastes-from the old-fashioned and traditional to the new and sophisticated. Plus a large section devoted entirely to holiday cookies. Fun to use. . .perfect to give.Here's the classic treasury of cookie baking that so many people grew up with: the beloved 1963 edition of Betty Crocker's Cooky Book, now in a brand-new, authentic facsimile of the original book.Remember baking cookies with Mom or Grandma when you were a kid? The wonderful smell, the spatulas to lick and, best of all, delicious cookies you'd helped to make yourself? If you grew up baking with Betty Crocker, then you probably had this book, filled with all your favorites-from Chewy Molasses Cookies to Chocolate Crinkles to Toffee Squares and many more!Now, with this authentic reproduction of the original 1963 edition, you can relive those moments, taste the cookies you grew up with and share them with your loved ones. All the charm of the original and all the great recipes are here. Turn to Betty Crocker's Cooky Book to find:* An authentic facsimile of the classic 1963 edition packed with all your favorite cookie recipes* Over 450 recipes, dozens of nostalgic color photographs and charming how-to sketches* Scrumptious recipes for Holiday Cookies (dozens of Christmas specialties), Family Favorites (for lunchtime, snacktime, anytime), Company Best Cookies (fancy enough for company) and much moreThis book is a great gift for new and experienced bakers alike. Only one family copy of this favorite cookbook? Now everyone can have a copy of this classic book!",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Classics",
    "Health"
  ],
  "author": "Betty Crocker",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/129664.Betty_Crocker_s_Cooky_Book"
}