{
  "title": "Shem Creek",
  "description": "Pat Conroy has called her books “hilarious and wise”, noting that they are “funny, sexy and usually damp with sea water.” Anne Rivers Siddons said of Sullivans Island that it “roared with life.” Now Dorothea Benton Frank takes us back to the Lowcountry to introduce a whole new cast of characters whose lives will surely move your heart.Linda Breland has no experience managing a restaurant, but then neither did Brad Jackson, and he owns the place.Meet Linda Breland, single parent of two teenage daughters. The oldest, Lindsey, who always held her younger sister in check, is leaving for college. And Gracie, her Tasmanian devil, is giving her nightmares. Linda’s personal life? Well, between the married men, the cold New Jersey winters, her pinched wallet and her ex-husband who marries a beautiful, successful woman ten years younger than she is—let’s just say, Linda has seen enough to fill a thousand pages.As the story opens, she is barreling down Interstate 95, bound for Mount Pleasant, South Carolina, the land of her ancestors. Welcomed by the generous heart of her advice dispensing sister, Mimi, Linda and her daughters slowly begin to find their way and discover a sweeter rhythm of life.And then there’s Brad Jackson, a former investment banker of Atlanta, Georgia who hires her to run his restaurant on Shem Creek. Like everyone else, Brad’s got a story of his own—namely an almost ex-wife, Loretta who is the kind of gal who gives women a bad name.The real protagonist of this story is the Lowcountry itself. The magical waters of Shem Creek, the abundant wildlife and the astounding power of nature give this tiny corner of the planet its infallible reputation as a place for introspection, contemplation and healing.As in all her previous work, you’ll find Shem Creek to be compulsively readable, irreverent but warm and blazingly authentic—and you’ll dread reaching the last page. It is her vivid writing, colorful characters and rich narrative that have made Dorothea Benton Frank one of our nation’s greatest storytellers. Shem Creek is a triumphant novel that proves we are all entitled to a second chance. The challenge is to learn how to recognize it when it comes and to know which chance to take.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Southern",
    "Family",
    "Contemporary",
    "Adult"
  ],
  "author": "Dorothea Benton Frank",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/65398.Shem_Creek"
}