{
  "title": "The Best Horror of the Year: Volume One",
  "description": "An Air Force Loadmaster is menaced by strange sounds within his cargo; a man is asked to track down a childhood friend... who died years earlier; doomed pioneers forge a path westward as a young mother discovers her true nature; an alcoholic strikes a dangerous bargain with a gregarious stranger; urban explorers delve into a ruined book depository, finding more than they anticipated; residents of a rural Wisconsin town defend against a legendary monster; a woman wracked by survivor's guilt is haunted by the ghosts of a tragic crash; a detective strives to solve the mystery of a dismembered girl; an orphan returns to a wicked witch's candy house; a group of smugglers find themselves buried to the necks in sand; an unanticipated guest brings doom to a high-class party; a teacher attempts to lead his students to safety as the world comes to an end around them...What frightens us, what unnerves us? What causes that delicious shiver of fear to travel the lengths of our spines? It seems the answer changes every year. Every year the bar is raised; the screw is tightened. Ellen Datlow knows what scares us; the twenty-one stories and poems included in this anthology were chosen from magazines, webzines, anthologies, literary journals, and single author collections to represent the best horror of the year.Legendary editor Ellen Datlow (Poe: New Tales Inspired by Edgar Allan Poe), winner of multiple Hugo, Bram Stoker, and World Fantasy awards, joins Night Shade Books in presenting The Best Horror of the Year, Volume One.Table of Contents:“Summation 2008” Ellen Datlow“Cargo” E. Michael Lewis“If Angels Fight” Richard Bowes“The Clay Party” Steve Duffy“Penguins of the Apocalypse” William Browning Spencer“Esmeralda” Glen Hirshberg“The Hodag” Trent Hergenrader“Very Low-Flying Aircraft” Nicholas Royle“When the Gentlemen Go” Margaret Ronald“The Lagerstatte” Laird Barron“Harry and the Monkey” Euan Harvey“Dress Circle” Miranda Siemienowicz“The Rising River” Daniel Kaysen“Sweeney among the Straight Razors” JoSelle Vanderhooft“Loup-garou” R. B. Russell“Girl in Pieces” Graham Edwards“It Washed Up” Joe R. Lansdale “The Thirteenth Hell” Mike Allen“The Goosle” Margo Lanagan“Beach Head” Daniel LeMoal“The Man from the Peak” Adam Golaski“The Narrows” Simon Bestwick",
  "genres": [
    "Horror",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Paranormal"
  ],
  "author": "Ellen Datlow",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/6539039-the-best-horror-of-the-year"
}