{
  "title": "My Bread: The Revolutionary No-Work, No-Knead Method",
  "description": "When he wrote about Jim Lahey’s bread in the New York Times, Mark Bittman’s excitement was palpable: “The loaf is incredible, a fine-bakery quality, European-style boule that is produced more easily than by any other technique I’ve used, and it will blow your mind.” Here, thanks to Jim Lahey, New York’s premier baker, is a way to make bread at home that doesn’t rely on a fancy bread machine or complicated kneading techniques. Witnessing the excitement that Bittman’s initial piece unleashed worldwide among bakers experienced and beginner alike, Jim grew convinced that home cooks were eager for a no-fuss way to make bread, and so now, in this eagerly anticipated collection of recipes, Jim shares his one-of-a-kind method for baking rustic, deep-flavored bread in your own oven.The secret to Jim Lahey’s bread is slow-rise fermentation. As Jim shows in My Bread, with step-by-step instructions followed by step-by-step pictures, the amount of labor you put in amounts to 5 minutes: mix water, flour, yeast, and salt, and then let time work its magic—no kneading necessary. Wait 12 to 18 hours for the bread to rise, developing structure and flavor; then, after another short rise, briefly bake the bread in a covered cast-iron pot.The process couldn’t be more simple, or the results more inspiring. My Bread devotes chapters to Jim’s variations on the basic loaf, including an olive loaf, pecorino cheese bread, pancetta rolls, the classic Italian baguette (stirato), and the stunning bread stick studded with tomatoes, olives, or garlic (stecca). He gets even more creative with loaves like Peanut Butter and Jelly Bread, others that use juice instead of water, and his Irish Brown Bread, which calls for Guinness stout. For any leftover loaves, Jim includes what to do with old bread (try bread soup or a chocolate torte) and how to make truly special sandwiches. And no book by Jim Lahey would be complete without his Sullivan Street Bakery signature, pizza Bianca—light, crispy flatbread with olive oil and rosemary that Jim has made even better than that of Italy’s finest bakeries. Other pizza recipes, like a pomodoro (tomato), only require you to spread the risen dough across a baking sheet and add toppings before baking. Here—finally—Jim Lahey gives us a cookbook that enables us to fit quality bread into our lives at home.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Foodie",
    "Food and Wine"
  ],
  "author": "Jim Lahey",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/6540114-my-bread"
}