{
  "title": "Infatuation",
  "description": "To prove her love and save her man, she has to go above and beyond the call of duty.Infatuation: A Little Military Harmless RomanceFrancis McKade is a man in lust. He’s had a crush on his best friend’s little sister for years but he has never acted on it. Besides that fact that she’s Malachi’s sister, he’s a Seal and he learned his lesson with his ex-fiancé. Women do not like being left alone for long months at a time. Still, at a wedding in Hawaii anything can happen—and does. Unfortunately, after the best night of his life, he and Mal are called away to one of their most dangerous missions.Shannon is blown over by Kade. She’s always had a crush on him and after their night together, it starts to feel a little like love. But, after the mission, Kade never calls or writes and she starts to wonder if it was all a dream. Until one night, her brother Mal drags him into her bar and grill and Shannon gets the shock of her life.Kade isn’t the man Shannon knew in Hawaii, or even the last few years. Losing a friend and being injured changes a man, especially one who had never felt so vulnerable. He still can’t shake the terror that keeps him up at night. Worse, he is realizing that the career he loves just might be over.Shannon is still mad, but she can’t help but hurt for the man she loves. He is darker, a bit more dangerous, but beneath that, he is the Kade she's known for so many years. When he pushes her to her limits in the bedroom, Shannon refuses to back down. One way or another, this military man is going to learn there is no walking away from love—not while she still has breath in her body.Warning: This book contains two infatuated lovers, some drunken dancing, a hard-headed military man, a determined woman, some old friends, and a little taste of New Orleans. As always, ice water is suggested while reading. It might be the first military Harmless book, but the only thing that has changed is how hot our hero looks in his uniform—not to mention out of it.",
  "genres": [
    "Erotica",
    "BDSM",
    "Military Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Romance",
    "Military Romance"
  ],
  "author": "Melissa Schroeder",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/12967394-infatuation"
}