{
  "title": "F U, Penguin: Telling Cute Animals What's What",
  "description": "Perfect for the Scrooge in your life—a profane, hilarious takedown of all things cute and cuddly, by the author of the blog sensation of (almost) the same nameAttention, all you clumsy pandas, lovable puffins, huggable bunnies, and penguins that elicit ooohs and The jig is up! We have lived under your furry fists for too long.There is a cute and present danger lurking out there–in the wild, in the zoos, and sometimes even in our very own homes. Spurred on by the Cute Industrial Complex, these cuddly animals have taken over blockbuster films, inspirational posters, and computer desktops everywhere, further weakening the innocent civilians who are beguiled by these fuzzy frauds.But you are stronger than them, aren’t you? Those soft bellies and wet noses are no match for you–and their free ride has just come to an end.F U, Penguin is the rallying cry for those who choose to fight these power-hungry cute-mongers. Loaded with color photographs and hilarious commentary, this book will have you laughing out loud while it simultaneously saves you from the tragic fate of tossing yarn with big-eyed kittens and bottle-nursing baby pandas forever.___________________________\"Finally, a book for the rest of us! Most animals go about our business without playing to the audience like the elitists exposed in these chapters.I wasn't sure how many more times I could hear about those great penguins and pandas and kittens before I started eating people... well, more people, anyway.\"—Jerry the Shark\"Penguins killed my parents, and they would not hesitate to kill me. I thank the Crustacean God for Matthew Gasteier, a true saint and a decent human being in a world filled with heartless penguin accomplices.\"—Dennis the Krill\"It's all true. We're the worst.\"—Anonymous Penguin\"The average dolphin is far beyond this level of vulgarity, but I could see how this would be a very enjoyable book for humans. I should remember to hand these out to some of my slower relatives at the common ancestor reunion.\"—Edward the Dolphin\"Thank you for your submission. Unfortunately, this style of book is not something we are currently looking for. However, we wish you the best of luck with your human publishers!\"—Danielle the Bear, Editor-in-Chief, Random Cave Publishing",
  "genres": [
    "Humor",
    "Nonfiction",
    "Animals",
    "Comedy",
    "Photography"
  ],
  "author": "Matthew Gasteier",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/6544423-f-u-penguin"
}