{
  "title": "New World Monkeys",
  "description": "A savagely smart, darkly comic literary debut, New World Monkeys exposes the false idols of marital tranquillity, small-town idyll, and corporate Darwinism in the dazzling voice of a major new talent.Duncan and Lily, young and adrift in a prickly marriage and lackluster careers, flee Manhattan for the peaceful allure of a recently inherited crumbling Victorian home. But the two are left with little time to ponder the traditional \"he said, she said\" failings of a On an upstate road miles shy of their house, a wild boar leaps to his death in front of their Saab–an accident whose consequences will haunt them throughout the summer.That was no ordinary hog.Lily and Duncan arrive in the eccentric town of Osterhagen to discover the boar had a The Sovereign of the Deep Wood. That it was the town mascot. And, as the hapless urbanites are coerced into the vortex of tea socials, cannon fire, and communal history, they realize that the residents of the bizarre hamlet intend to seek justice for their fallen hero.Next come the bones.Duncan, an adman whose controversial new campaign could make or break his career, wants a temporary escape from the pressures of urban life. But his pastoral retreat darkens when an attempt at gardening turns up a human femur in the lawn, a headstone inscribed simply Tinker, 1902, and a sense that Lily’s family may have violence in its aristocratic blood.And then there’s Lloyd.Lily, conflicted about her marriage and her career, spends her days at the local library researching her impossibly arcane dissertation topic but can’t seem to make any progress. One day she observes the town pervert in action and befriends him.Lloyd, a Peeping Tom, invites her to follow him on a bird’s-eye tour of Osterhagen that may help her home in on her own flaws and failings.Keep digging.Thrown together in their complicity over the boar’s death, fueled to exhume Tinker’s bones from the garden, and inspired by Lloyd’s philosophical savoir faire, Duncan and Lily begin to excavate the profound truth about themselves and their marriage. But how deep can the two dig before the summer’s violent beginning catches up with them?",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Humor",
    "Novels",
    "Literary Fiction",
    "American"
  ],
  "author": "Nancy Mauro",
  "average_rating": "2.77",
  "url": "https://www.goodreads.com/book/show/6543803-new-world-monkeys"
}