{
  "title": "Glucose Control Eating: Lose Weight Stay Slimmer Live Healthier Live Longer",
  "description": "Glucose Control Eating© is a simple, sensible, solution to America's overweight epidemic. With Glucose Control Eating©, You will lose weight, stay slimmer, live healthier, and live longer. In this book, you'll learn all foods, not just sweets create blood glucose. Everything we eat—vegetables, fruits, meat, fat, fish, bread, cereal, sweets, eggs etc.—creates some amount of blood glucose. Some foods create a lot of blood glucose and are stored as body fat before you can burn that glucose. Other foods create less blood glucose, and you burn that glucose before it becomes body fat. This book shows which foods you can eat freely to lose weight and live slimmer, healthier, and longer Rick Mystrom, a Type 1 diabetic for 58 years, has self-tested his blood glucose over 85,000 times after eating. In this book, he convincingly demonstrates If you control your blood glucose, you control your weight. In his three previous books on controlling glucose for Type 1 and Type 2 diabetics, his readers are grateful about their glucose control improvement, but they are ecstatic and glowing about their weight loss. “I bought your book. 20 pounds gone, off diabetes meds and blood pressure meds, no more Tums. THANK YOU” “I can't say enough about how your book helped me and my husband. We turn the TV off and read it out loud together. I've lost 45 pounds and my husband has lost 15 pounds.” “I've changed my eating style and lost 34 pounds. Thank you, Mr. Mystrom.” “I have referred to your book countless times. Lost 20 pounds so far. the easiest weight I have ever lost.” “I have been following your diet recommendations (with occasional bad days). My weight is down 40 pounds and for the first time in 30 years all my bloodwork is in the normal range.” “A new patient came in for a physical a few months ago. He was quite overweight. I gave him a copy of your book. He just called me to tell me he had lost 65 pounds. Please send me another box of your amazing books.” “I want you to know, Rick, that your advice saved my father's life. Thank you. Thank you. Thank you.”",
  "genres": [
    "Contemporary",
    "Fiction",
    "Book Club",
    "Epic"
  ],
  "author": "Rick Mystrom",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/65498175-glucose-control-eating"
}