{
  "title": "The Mummy at the Dining Room Table: Eminent Therapists Reveal Their Most Unusual Cases and What They Teach Us About Human Behavior",
  "description": "\"A wife pretends to hang herself in the basement so she can time how long it will be before her husband comes to rescue her. . . .a woman whose dead aunt was made into a mummy so the family could better grieve her passing and on occasion dine with her at family gatherings . . . a man wants his nose cut off to escape an annoying smell that haunts him . . . a teenage boy would only come to therapy if he could bring his pet snake.\"These and other fascinating and revealing stories are told by some of the most famous therapists in the world. Collected in this extraordinary book, well known practitioners recount the most memorable case histories of their illustrious careers. Engaging and surprising stories of human behavior are dramatically and often humorously portrayed. Each chapter gives a behind-the-scenes look at how therapists work with clients whose problems and behaviors aren't found in standard psychology textbooks. The book also shows how these eminent therapists often cure these apparently intractable problems and learn something about themselves in the process.1 The Man Who Wanted His Nose Cut Off / Jeffrey A. Kottler 7 --2 The Mummy at the Dining Room Table / Jon Carlson 21 --3 Buzzy Bee's Oral Fixation / Frank Pittman 32 --4 An Oedipal Dilemma / Arnold Lazarus 45 --5 The Urge to Eat from Garbage Cans / William Glasser 55 --6 The Penis That Needed Permission from the Church / Domeena Renshaw 66 --7 Therapy with a Gopher Snake and a Horned Lizard / Violet Oaklander 74 --8 Getting Rid of Old Junk / Harville Hendrix 84 --9 The Terminator Finds Himself on a Mental Ward / Scott Miller 95 --10 They Learned to Live with Ghosts / Insoo Kim Berg 105 --11 The Woman Who Should Have Been Depressed / Michael Yapko 115 --12 The Woman Who Hated Everyone and Everything / Albert Ellis 126 --13 The Medicine Man Who Never Had a Vision / Bradford Keeney 136 --14 The Woman Who Hanged Herself to Check Her Husband's Response Time / Susan Johnson 147 --15 The Hip-Nose Doctor Finds the Michael Jackson Tickets / Ernest Rossi 157 --16 The Lawyer from Hell / Arthur Freeman 166 --17 Reconstructing the Jigsaw Puzzle of a Meter Man's Memory / Robert A. Neimeyer 178 --18 An Emergency Hypnosis to Solve the Crime at the Burger Joint / Pat Love 191 --19 Beauty and the Beast / Samuel Gladding 199 --20 The Lie That Hid in His Back / Gay Hendricks 208 --21 The Client Who Wanted His Therapist to Be Someone Else / Howard Kirschenbaum 217 --22 The Bride Wore a Tuxedo, the Groom Wore a Gown / Joel Bergman 228 --23 Recovering from Recovered Memories / David Scharff 238 --24 Panic Disorder from Sewer Grates, Amusement Parks, and Sex with Ministers / Howard Rosenthal 249 --25 The Eighty-Two-Year-Old Prostitute / Jay Haley 257 --26 Saved by a Ghost / Stephen Lankton 264 --27 He'll Always Be Black / James F.T. Bugental 275 --28 \"I Wouldn't Mind Being That Guy in the Mirror\" / Michael Mahoney 279 --29 The Three-Year-Old Who Was an Alcoholic / Laura S. Brown 291 --30 Every Parent's Worst Nightmare / Donald Meichenbaum 299 --31 The Third Sexual Identity / Peggy Papp 305 --32 The Bird Colonel Who Turned into an Elephant / Len Sperry 316",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Book Club",
    "Memoir",
    "Essays",
    "Science"
  ],
  "author": "Jeffrey A. Kottler",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/654824.The_Mummy_at_the_Dining_Room_Table"
}