{
  "title": "Gracefully Insane: The Rise and Fall of America's Premier Mental Hospital",
  "description": "Its landscaped ground, chosen by Frederick Law Olmsted and dotted with Tudor mansions, could belong to a New England prep school. There are no fences, no guards, no locked gates. But McLean Hospital is a mental institution-one of the most famous, most elite, and once most luxurious in America. McLean \"alumni\" include Olmsted himself, Robert Lowell, Sylvia Plath, James Taylor and Ray Charles, as well as (more secretly) other notables from among the rich and famous. In its \"golden age,\" McLean provided as genteel an environment for the treatment of mental illness as one could imagine. But the golden age is over, and a downsized, downscale McLean-despite its affiliation with Harvard University-is struggling to stay afloat. Gracefully Insane , by Boston Globe columnist Alex Beam, is a fascinating and emotional biography of McLean Hospital from its founding in 1817 through today. It is filled with stories about patients and the Ralph Waldo Emerson prot'g' whose brilliance disappeared along with his madness; Anne Sexton's poetry seminar, and many more. The story of McLean is also the story of the hopes and failures of psychology and psychotherapy; of the evolution of attitudes about mental illness, of approaches to treatment, and of the economic pressures that are making McLean-and other institutions like it-relics of a bygone age.This is a compelling and often oddly poignant reading for fans of books like Plath's The Bell Jar and Susanna Kaysen's Girl, Interrupted (both inspired by their author's stays at McLean) and for anyone interested in the history of medicine or psychotherapy, or the social history of New England.",
  "genres": [
    "Nonfiction",
    "History",
    "Psychology",
    "Mental Health",
    "Mental Illness",
    "Medical",
    "Psychiatry"
  ],
  "author": "Alex Beam",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/654819.Gracefully_Insane"
}