{
  "title": "Bare Bones",
  "description": "From number one internationally bestselling author Kathy Reichs comes a masterful new novel of cutting-edge forensics and gripping suspense.  It's a summer of sizzling heat in Charlotte where Dr. Temperance Brennan, forensic anthropologist for the North Carolina medical examiner, looks forward to her first vacation in years. A romantic vacation. She's almost out the door when the bones start appearing.  A newborn's charred remains turn up in a woodstove. The mother, Tamela Banks, hardly more than a child herself, has disappeared. Did she kill her infant, or is an innocent teenager also about to become a victim?  A small plane crashes in a North Carolina cornfield on a sunny afternoon. Both pilot and passenger are burned beyond recognition. Was it pilot error? Something more sinister? And what is the mysterious black substance covering the bodies?  Most puzzling of all are the bones discovered at a remote farm outside Charlotte. What has Tempe's dog, Boyd, unearthed? The remains seem to be of animal origin, but Tempe is shocked when she gets them to her lab.  With help from a special detective friend, Tempe must investigate a poignant and terrifying case that comes at the worst possible moment. Daughter Katy has a new boyfriend who Tempe fears may have something to hide. And important personal decisions face Tempe. Is it time for emotional commitment? Will she have the chance to find out?  Everything must wait on the bones. What story do they tell? Why are the X rays and DNA so perplexing? Who is trying to keep Tempe from the answers? Someone is following her. Someone is following Katy. That someone must be stopped before it's too late.  With the riveting authenticity that only world-class forensic anthropologist Kathy Reichs can bring to her fiction, Bare Bones asks important questions and thrills us to its pulsating end. Fresh from the success of Grave Secrets, Reichs proves once again that she is the consummate crime-writing star.",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Kathy Reichs",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/6552316-bare-bones"
}