{
  "title": "Crashing Through: A True Story of Risk, Adventure, and the Man Who Dared to See",
  "description": "In his critically acclaimed bestseller Shadow Divers , Robert Kurson explored the depths of history, friendship, and compulsion. Now Kurson returns with another thrilling adventure–the stunning true story of one man’s heroic odyssey from blindness into sight.Mike May spent his life crashing through. Blinded at age three, he defied expectations by breaking world records in downhill speed skiing, joining the CIA, and becoming a successful inventor, entrepreneur, and family man. He had never yearned for vision.Then, in 1999, a chance encounter brought startling a revolutionary stem cell transplant surgery could restore May’s vision. It would allow him to drive, to read, to see his children’s faces. He began to contemplate an astonishing new Would music still sound the same? Would sex be different? Would he recognize himself in the mirror? Would his marriage survive? Would he still be Mike May?The procedure was filled with risks, some of them deadly, others beyond May’s wildest dreams. Even if the surgery worked, history was against him. Fewer than twenty cases were known worldwide in which a person gained vision after a lifetime of blindness. Each of those people suffered desperate consequences we can scarcely imagine.There were countless reasons for May to pass on vision. He could think of only a single reason to go forward. Whatever his decision, he knew it would change his life.Beautifully written and thrillingly told, Crashing Through is a journey of suspense, daring, romance, and insight into the mysteries of vision and the brain. Robert Kurson gives us a fascinating account of one man’s choice to explore what it means to see–and to truly live.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Book Club",
    "Memoir",
    "Science",
    "Psychology",
    "Audiobook"
  ],
  "author": "Robert Kurson",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/655211.Crashing_Through"
}