{
  "title": "Boulevard of Dreams: Heady Times, Heartbreak, and Hope along the Grand Concourse in the Bronx",
  "description": "An enthralling story of the iconic Grand Concourse in the West BronxStretching over four miles through the center of the West Bronx, the Grand Boulevard and Concourse, known simply as the Grand Concourse, has gracefully served as silent witness to the changing face of the Bronx, and New York City, for a century. Now, a New York Times editor brings to life the street in all its raucous glory.Designed by a French engineer in the late nineteenth century to echo the elegance and grandeur of the Champs Elysées in Paris, the Concourse was nearly twenty years in the making and celebrates its centennial in November 2009. Over that century it has truly been a boulevard of dreams for various upwardly mobile immigrant and ethnic groups, yet it has also seen the darker side of the American dream. Constance Rosenblum unearths the colorful history of this grand street and its interlinked neighborhoods. With a seasoned journalist’s eye for detail, she paints an evocative portrait of the Concourse through compelling life stories and historical vignettes. The story of the creation and transformation of the Grand Concourse is the story of New York―and America―writ large, and Rosenblum examines the Grand Concourse from its earliest days to the blighted 1960s and 1970s right up to the current period of renewal. Beautifully illustrated with a treasure trove of historical photographs, the vivid world of the Grand Concourse comes alive―from Yankee Stadium to the unparalleled collection of Art Deco apartments to the palatial Loew’s Paradise movie theater.An enthralling story of the creation of an iconic street, an examination of the forces that transformed it, and a moving portrait of those who called it home, Boulevard of Dreams is a must read for anyone interested in the rich history of New York and the twentieth-century American city.",
  "genres": [
    "New York",
    "Nonfiction"
  ],
  "author": "Constance Rosenblum",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/6553206-boulevard-of-dreams"
}