{
  "title": "Billionaires, Bullets, Exploding Monkeys",
  "description": "Seattle's richest man has been taken hostage in a terrorist attack. He'll have to negotiate like his life depends on it!Software billionaire Jeff Pepper chose the wrong day to check on the research project he's been funding at a Seattle university. When gunmen seize control of the building, aiming to get their hands on a horrifying new weapon, the world-famous entrepreneur is ensnared in a nerve-wracking hostage situation, one in which he is an all-too-valuable pawn.As the body count rises, Pepper's fate rests in the hands of Brick Ransom, a SWAT team leader with a wry sense of humor and a slippery trigger finger. Time is running out, and if Brick and his team can't save him,Pepper will need to use every negotiating trick up his sleeve to see that he and his fellow captives make it out alive...What readers are saying about the Brick Ransom \"If you like your mysteries tinged with noir and humor, you'll love this book.\"\"Fast paced and action packed. Reads like a movie.\"\"Upped the ante with great character development. A potent and punchy storyline. If you like Brad Thor check this out.\"\"I had a hard time putting this book down - it's tough to find a good  spot to stop reading! The main character, Brick, is a refreshing alternate take on the \"macho\" hero.\"\"A great little popcorn action flick in book form. This is a fine way to spend a rainy Sunday afternoon, curled up on the couch with a cup of coffee and officer Brick Ransom. There are plenty of bullets, explosions, double-crosses, and enough grit to shake a stick at. If you like classic action and modern pulp, this is probably right up your alley.\"\"Intense scenes are balanced with believable dialogue and humorous moments that you can identify with. There's plenty of action and the exploding monkeys do not disappoint.\"\"With some great twists and turns, the adventure never seems to stop. Very entertaining read.\"",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Mike Attebery",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/6554576-billionaires-bullets-exploding-monkeys"
}