{
  "title": "A Song for Nagasaki: The Story of Takashi Nagai a Scientist, Convert, and Survivor of the Atomic Bomb",
  "description": "On August 9, 1945, an American B-29 dropped an atomic bomb on Nagasaki, Japan, killing tens of thousands of people in the blink of an eye, while fatally injuring and poisoning thousands more. Among the survivors was Takashi Nagai, a pioneer in radiology research and a convert to the Catholic Faith. Living in the rubble of the ruined city and suffering from leukemia caused by over-exposure to radiation, Nagai lived out the remainder of his remarkable life by bringing physical and spiritual healing to his war-weary people.A Song for Nagasaki tells the moving story of this extraordinary man, beginning with his boyhood and the heroic tales and stoic virtues of his family's Shinto religion. It reveals the inspiring story of Nagai's remarkable spiritual journey from Shintoism to atheism to Catholicism. Mixed with interesting details about Japanese history and culture, the biography traces Nagai's spiritual quest as he studied medicine at Nagasaki University, served as a medic with the Japanese army during its occupation of Manchuria, and returned to Nagasaki to dedicate himself to the science of radiology. The historic Catholic district of the city, where Nagai became a Catholic and began a family, was ground zero for the atomic bomb.After the bomb disaster that killed thousands, including Nagai's beloved wife, Nagai, then Dean of Radiology at Nagasaki University, threw himself into service to the countless victims of the bomb explosion, even though it meant deadly exposure to the radiation which eventually would cause his own death. While dying, he also wrote powerful books that became best-sellers in Japan. These included The Bells of Nagasaki , which resonated deeply with the Japanese people in their great suffering as it explores the Christian message of love and forgiveness. Nagai became a highly revered man and is considered a saint by many Japanese people.\"Christians and non-Christians alike were deeply moved by Nagai's faith in Christ that made him like Job of the in the midst of the nuclear wilderness he kept his heart in tranquility and peace, neither bearing resentment against any man nor cursing God.\"Shusaku Endo , from the Foreword",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Religion",
    "Japan",
    "Catholic",
    "Christian"
  ],
  "author": "Paul Glynn",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/6552272-a-song-for-nagasaki"
}