{
  "title": "Protective Artist",
  "description": "Cade Cade Booker spends his mornings on his surfboard, his afternoons in his studio creating works of art that are universally celebrated, and his evenings with a seemingly never-ending string of women. Cade is rich beyond measure and famous the world over. He’s a man living his best life. But when he goes in search of a new personal assistant, he runs into a woman who challenges the way he sees the world. Challenges the way he sees himself. She’s like catnip to him. But Cade knows she is forbidden fruit and that he needs to keep her at an arm’s distance. He can’t afford to lose yet another PA because he can’t keep it in his pants. But Briar gets under his skin in ways nobody ever has before, and he finds himself inexorably drawn to her. He tries hard though, to resist her siren song. But when she’s threatened by an obsessed classmate, Cade is surprised to learn just how far he’ll go to protect her—and to keep her in his life. Briar She was looking for a job. Something to help cover the cost of her tuition and give her a little money to live on while she worked her way through school. When she found a job listing for a personal assistant to one of biggest inspirations, Briar thought she’d found the perfect opportunity and a job that would provide her with not just money but valuable experience. Cade Booker was Briar’s hero. She grew up admiring his works of art and in large part, it was because of him that she decided to pursue her own artistic endeavors. Briar quickly learned that old saying about never meeting your heroes was coined for a reason. Despite his outward gruffness, Briar found that he was a very different man than the image he projected. Underneath that rough around the edges exterior was the heart of a good man. The heart of a man Briar found herself increasingly drawn to. The heart of a man she eventually found herself falling for. But when a classmate who was obsessed with her threatened everything she’d worked so hard to build, Briar found herself on the edge of losing it all. And when that fight comes, Briar finds out exactly who she is… and who Cade is too.",
  "genres": [],
  "author": "Lena Little",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/65534392-protective-artist"
}