{
  "title": "Demon Hunting in the Deep South",
  "description": "The warrior and the wallflower . . .Shy, self-conscious Evie Douglass tries to stay under the radar, especially when her nemesis Meredith Peterson, aka The Death Starr, is anywhere around. Meredith and her bitch posse of skinny girlfriends have tormented Evie since the seventh grade, calling her names like The Whale and Thunder Thighs.Evie tries to stay invisible, but that’s not an easy thing for a plus-sized gal to do in a small town like Hannah, Alabama. She finds it doubly hard to avoid Meredith’s wrath once she takes a job at the lumber mill. You see, Meredith’s husband is Evie’s new boss. Translation: more torture time for The Death Starr.Evie thinks things couldn’t get much worse until the morning she finds Meredith’s bloody body sprawled across her desk. Typical Meredith, she gets herself dead mere days after a very public scene in which Meredith accuses Evie of having an affair with her husband. Worse, the murder weapon is found in Evie’s car.Suddenly, Evie is the Number One suspect in a sensational murder case. But she’s got bigger problems. Hannah is infested with demons—soul sucking, body snatching creatures of evil—and, for some reason, they want Evie. The only thing standing between Evie and death or possible possession is a hunky blond demon slayer named Ansgar.Ansgar is a Dalvahni warrior, a supernaturally gorgeous race whose sole purpose is to hunt down and capture rogue demons.Evie could almost swear that Ansgar is interested in more than demons. He seems interested in her. Ridiculous, of course, because he’s sex on two legs and she’s…Well, she’s Whaley Douglass.To add to Evie’s troubles, Meredith doesn’t even have the decency to stay dead. She shows back up as a ghost and she’s more of a beyotch than ever. Meredith has deathnesia—she can’t remember who killed her—leaving Evie to solve the mystery herself, or go to jail for a murder she didn’t commit.",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Demons",
    "Magic",
    "Fantasy",
    "Urban Fantasy"
  ],
  "author": "Lexi George",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/12968299-demon-hunting-in-the-deep-south"
}