{
  "title": "Sealed in Lies",
  "description": "Jack Weaver, a sexy under cover operative for the CIA, can’t seem to escape a life of lies. Working undercover in the largest drug cartel in Columbia, Jack lives a life of guns, drugs and beautiful women. It all comes to an end when Jack uncovers a plot to assassinate the President-Elect on Inauguration Day. Suddenly things become infinitely worse when Jack is forced to kill his old SEAL Commander who is now a Deputy Director of the CIA. Jack is now on the run not only for his life but he’s the only one who knows about the assassination attempt, other than a mysterious man who calls himself the Emperor and seems to be calling all the shots. Jack is being haunted by terrifying dreams from his past that seem to be connected to this entire conspiracy involving his old SEAL team. Desperate for answers Jack breaks into the home of Vice-President elect Warren Walters, another SEAL teammate, where he is discovered by Warren’s abused wife Caroline. He forces Caroline to go with him with the intention of letting her go once he uses her as leverage to get the information he needs. Even as Caroline thinks of ways to escape her captor, she finds herself unexpectedly attracted to him. She begins to wonder if a night spent in his arms will erase years of abuse. When she is offered the opportunity to be set free Caroline refuses to leave, seeing this as an opportunity to escape her own life of lies. This starts a chain reaction of passionate feelings neither of them is prepared for. Desire sizzles as Jack and Caroline come closer and closer to the answers and each other. The key question is will they be able to save the President-elect’s life as well as their own, or will a blast from Jack’s past destroy them all?",
  "genres": [
    "Romantic Suspense",
    "Military Fiction",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Kelly Abell",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/6555922-sealed-in-lies"
}