{
  "title": "The Adventures of Baron Munchausen",
  "description": "The Adventures of Baron Munchausen is one of the most famous book of tall tales. It is based on stories told by Karl Friedrich von Münchhausen, a retired army captain, who was noted for his exaggerated and fantastic accounts of his war adventures and hunting experiences. The German scientist and librarian Rudolf Erich Raspe produced the first, small book based on these and some other stories. His work was followed by enlarged collections, composed by other authors, of whom Gottfried Bürger (1747-1794) is the most notable. (Quote from kirjasto.sci.fi)About the AuthorRudolf Erich Raspe (1736 - 1794) was a German librarian, writer and scientist, and he was called by his biographer John Carswell a \"rogue\". He is best known for his collection of tall The Surprising Adventures of Baron Munchausen, originally a satirical work with political aims.Raspe was born in Hanover, studied law and worked as a librarian for the university of Gottingen. Since 1767 he was responsible for some collections of the landgrave of Hesse-Cassel Frederic II before having to flee to England in 1775 after pilfering some gems that were supposedly in his care. He was employed by Matthew Boulton in the mines of Cornwall, and he was also publishing in geology and in the history of art. He also worked for the famous publisher John Nichols in several projects. In 1791 he moved to Scotland, and after an involvement in a mining swindle there, he left. He finally moved to Ireland where he managed a copper mine on the Herbert Estate. He died in Killarney, County Kerry, Ireland, of typhoid, in November of 1794.The Baron Munchausen tales were made famous when they were 'borrowed', translated into German, and embellished somewhat by G. A. Burger in 1786 - and have been a favourite read",
  "genres": [
    "Classics",
    "Fantasy",
    "Fiction",
    "German Literature",
    "Adventure",
    "Humor",
    "Childrens"
  ],
  "author": "Rudolf Erich Raspe",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/6558841-the-adventures-of-baron-munchausen"
}