{
  "title": "Dreams of the Dead",
  "description": "Perri O’Shaughnessy “will keep you turning pages into the night,” applauds USA Today, in praise of the celebrated novels of suspense starring the audacious yet all-too-human defense attorney Nina Reilly. Now, in a spellbinding new thriller, O’Shaughnessy plunges Nina back into the center of a murderous family game, and reawakens a very real nightmare she had every reason to believe was dead . . . and buried. A mix of slick and seamy, South Lake Tahoe, California, is the perfect setting for adventurers, criminals—and lawyers. In addition to coping with her demanding, sometimes creepy, clients, Nina Reilly is dealing with prickly personal issues involving her sixteen-year-old son Bob, his estranged father, and her investigator, confidante, and sometimes lover Paul van Wagoner. Then, in walks disaster. The millionaire owner of a Tahoe ski resort, Philip Strong is the father of Jim Strong, a sociopath who devastated many innocent lives, including Nina’s. Two years earlier, she had to defend Jim against charges of murder. He shattered her life, then vanished. Paul van Wagoner made sure of it. Now in negotiations to sell his ski resort, Philip has received a letter purportedly from his fugitive son in extradition-free Brazil, demanding his share of the profits. Philip is convinced it’s authentic. Nina’s certain it’s a con, but to prove that means exposing the secrets of someone very close to her. Then two local women are brutally murdered. Nina begins to question their links to her new client, and the truth about Jim Strong’s sudden disappearance. As Nina’s worst fears flood back, with time running out, she’s about to discover that the dreams of the dead can still destroy the living. With its breakneck pace, pulsing human drama, and serpentine twists, Dreams of the Dead establishes once again why Perri O’Shaughnessy has been hailed as “a master of the legal thriller” (Vincent Bugliosi).",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Legal Thriller",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "Perri O'Shaughnessy",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/6561743-dreams-of-the-dead"
}