{
  "title": "Parallel Mind, The Art of Creativity: The missing manual for your right brain",
  "description": "This book is about how to live a creative life; not how to paint or draw, but how to think like an artist, and how to find a joyous, complete life as a result. Author and artist Aliyah Marr uses practical examples and guides us through conceptual, transpersonal art experiments to demonstrate how we can use the power of art to access our inner child, express our buried emotions, and use any form of art as a catalyst to transform our lives. Artists have known this that the application of principle and skills learned in any art can be the springboard to creativity in any field, but when we finally release our inner creative genius we become empowered in every part of our lives. Aliyah Marr draws from her experience as a teacher, visual artist, poet, graphic designer, and author to demonstrate how you can change your body, your profession, your relationship, and your life just by changing your thoughts. Packed with practical examples and exercises from every visual art, theater, music, video, poetry, scriptwriting and dance, this book shows you how to use art to first express, and then clarify thoughts and emotions to create whatever you want. A powerful reference guide for artists, educators, psychologists, entrepreneurs, scientists, and for those who have an interest in a practical form of self-development. Jungian, Gestalt, and Neuro-Linguistic Programming all address the same subconscious that is ruling our lives, for good or bad. A powerful alliance with the personal subconscious gives us access to the most powerful creative force of all, the same power that fuels the stars and guides our lives. Artist Aliyah Marr shows us how we can use art to bring our subconscious to the surface, how to make a friend of this powerful force, and then how to use it to create the life of our dreams. A powerful alliance with the personal subconscious gives us access to the most powerful creative force of all, the same power that fuels the stars and guides our lives. Aliyah shows us how we can use art to bring our subconscious to the surface, how to make a friend of this powerful force, and then how to use it to create the life of our dreams. This book answers some essential questions, the most important what is creativity, and how can it bring me freedom and happiness? Pure creativity includes (but not limited to): a painter who paints from his heart, a musician who creates a symphony while toying at the piano, a writer who bases a screenplay on the people she knows at work, a scientist who discovers a new law of the universe by playing with raw materials and outlandish ideas. Applied creativity includes design, architecture, scientific inquiry, technological innovations, copywriting, and business development. Parallel Mind, The Art of Creativity shows you...",
  "genres": [],
  "author": "Aliyah Marr",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6559689-parallel-mind-the-art-of-creativity"
}