{
  "title": "Daring Young Men: The Heroism and Triumph of The Berlin Airlift-June 1948-May 1949",
  "description": "In the early hours of June 26, 1948, phones began ringing across America, waking up the airmen of World War II—pilots, navigators, and mechanics—who were finally beginning normal lives with new houses, new jobs, new wives, and new babies. Some were given just forty-eight hours to report to local military bases. The president, Harry S. Truman, was recalling them to active duty to try to save the desperate people of the western sectors of Berlin, the enemy capital many of them had bombed to rubble only three years before. Soviet dictator Joseph Stalin had ordered a blockade of the city, isolating the people of West Berlin, using hundreds of thousands of Red Army soldiers to close off all land and water access to the city. He was gambling that he could drive out the small detachments of American, British, and French occupation troops, because their only option was to stay and watch Berliners starve—or retaliate by starting World War III. The situation was impossible, Truman was told by his national security advisers, including the Joint Chiefs of Staff. His \"We stay in Berlin. Period.\" That was when the phones started ringing and local police began banging on doors to deliver telegrams to the vets. Drawing on service records and hundreds of interviews in the United States, Germany, and Great Britain, Reeves tells the stories of these civilian airmen, the successors to Stephen Ambrose’s \"Citizen Soldiers,\" ordinary Americans again called to extraordinary tasks. They did the impossible, living in barns and muddy tents, flying over Soviet-occupied territory day and night, trying to stay awake, making it up as they went along and ignoring Russian fighters and occasional anti-aircraft fire trying to drive them to hostile ground. The Berlin Airlift changed the world. It ended when Stalin backed down and lifted the blockade, but only after the bravery and sense of duty of those young heroes had bought the Allies enough time to create a new West Germany and sign the mutual defense agreement that created NATO, the North Atlantic Treaty Organization. And then they went home again. Some of them forgot where they had parked their cars after they got the call.",
  "genres": [
    "History",
    "Nonfiction",
    "Aviation",
    "Germany",
    "Military Fiction",
    "Military History",
    "Politics"
  ],
  "author": "Richard Reeves",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/6561769-daring-young-men"
}