{
  "title": "Gading-Gading Ganesha - 3G : Bahwa Cinta itu Ada",
  "description": "\"Membawa pembaca pada kehidupan kampus 1980-an dengan segala dinamikanya, terutama persahabatan dan cinta yang menegaskan bahwa hidup bukanlah kesia-siaan.” —Arya Gunawan, Kritikus Film dan Script Writer   Enam anak muda dari berbagai daerah di Indonesia—Slamet dari Trenggalek, Poltak dari Pematang Siantar, Ria dari Padang, Benny dari Jakarta, Gun Gun dari Ciamis, dan Fuad dari Surabaya—dipersatukan dalam sebuah persahabatan di kampus Jalan Ganesha, Institut Teknologi Bandung. Bersama-sama mereka mulai mengayunkan langkah dengan penuh idealisme dan cita-cita.  Bertahun-tahun, anak-anak muda dengan latar budaya dan sosial-ekonomi berbeda-beda itu mengalami berbagai suka-duka di kampus. Banyak kejadian lucu, seru, dan mengharukan yang mereka lalui bersama. Mulai dari kekonyolan-kekonyolan khas mahasiswa baru, persaingan cinta di antara mereka, hingga keterlibatan dalam gerakan mahasiswa menentang rezim politik yang represif. Semua itu semakin mempererat ikatan persahabatan di antara mereka.  Waktu berlalu dan satu per satu mereka pun lulus. Selepas dari ITB, mereka menjalani kehidupan menjadi dosen di almamater, pengusaha, pemusik, dan lain-lain. Berbagai kenyataan hidup menghadang mereka, mulai dari cinta, godaan materi, dan cobaan mempertahankan idealisme. Setelah bertahun-tahun, mereka bertemu kembali. Apakah persahabatan lama mereka masih berarti? Apakah segala cita-cita luhur mereka masih berbekas? Terwujudkah impian mereka?  Inilah sebuah kisah perjuangan anak bangsa meraih impian yang dipenuhi cerita-cerita mengharukan, kocak, sekaligus inspiratif.   ***  “Membaca 3G ini seperti merefleksikan perjalanan hidup kita di ITB dengan segala dinamikanya yang membentuk kepribadian alumnus ITB dalam berkiprah di masyarakat.” —Rinaldi Firmansyah, Direktur Utama PT Telekomunikasi Indonesia, Tbk.",
  "genres": [
    "Fiction",
    "Novels",
    "Romance",
    "Indonesian Literature"
  ],
  "author": "Dermawan Wibisono",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/6562972-gading-gading-ganesha---3g"
}