{
  "title": "Goddess of the Market: Ayn Rand and the American Right",
  "description": "Worshipped by her fans, denounced by her enemies, and forever shadowed by controversy and scandal, the novelist and philosopher Ayn Rand was a powerful thinker whose views on government and markets shaped the conservative movement from its earliest days. Drawing on unprecedented access to Rand's private papers and the original, unedited versions of Rand's journals, Jennifer Burns offers a groundbreaking reassessment of this key cultural figure, examining her life, her ideas, and her impact on conservative political thought.Goddess of the Market follows Rand from her childhood in Russia through her meteoric rise from struggling Hollywood screenwriter to bestselling novelist, including the writing of her wildly successful The Fountainhead and Atlas Shrugged . Burns highlights the two facets of Rand's work that make her a perennial draw for those on the her promotion of capitalism, and her defense of limited government. Both sprang from her early, bitter experience of life under Communism, and became among the most deeply enduring of her messages, attracting a diverse audience of college students and intellectuals, business people and Republican Party activists, libertarians and conservatives. The book also traces the development of Rand's Objectivist philosophy and her relationship with Nathaniel Branden, her closest intellectual partner, with whom she had an explosive falling out in 1968.One of the Denver Post 's Great Reads of 2009One of Bloomberg News 's Top Nonfiction Books of 2009\"Excellent.\"-- Time magazine\"A terrific book--a serious consideration of Rand's ideas, and her role in the conservative movement of the past three quarters of a century.\"-- The American Thinker\"A wonderful beautifully written, completely balanced, extensively researched. The match between author and subject is so perfect that one might believe that the author was chosen by the gods to write this book. She has sympathy and affection for her subject but treats her as a human being, with no attempt to cover up the foibles.\"-- Mises Economics Blog",
  "genres": [
    "Biography",
    "History",
    "Politics",
    "Philosophy",
    "Nonfiction",
    "Economics",
    "American History"
  ],
  "author": "Jennifer Burns",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/6562140-goddess-of-the-market"
}