{
  "title": "On the Irish Waterfront: The Crusader, the Movie, and the Soul of the Port of New York",
  "description": "Site of the world's busiest and most lucrative harbor throughout the first half of the twentieth century, the Port of New York was also the historic preserve of Irish American gangsters, politicians, longshoremen's union leaders, and powerful Roman Catholic pastors. This is the demimonde depicted to stunning effect in Elia Kazan's On the Waterfront (1954) and into which James T. Fisher takes readers in this remarkable and engaging historical account of the classic film's backstory. Fisher introduces readers to the real \"Father Pete Barry\" featured in On the Waterfront, John M. \"Pete\" Corridan, a crusading priest committed to winning union democracy and social justice for the port's dockworkers and their families. A Jesuit labor school instructor, not a parish priest, Corridan was on but not of Manhattan's West Side Irish waterfront. His ferocious advocacy was resisted by the very men he sought to rescue from the violence and criminality that rendered the port \"a jungle, an outlaw frontier,\" in the words of investigative reporter Malcolm Johnson. Driven off the waterfront, Corridan forged creative and spiritual alliances with men like Johnson and Budd Schulberg, the screenwriter who worked with Corridan for five years to turn Johnson's Pulitzer Prize-winning 1948 newspaper exposé into a movie. Fisher's detailed account of the waterfront priest's central role in the film's creation challenges standard views of the film as a post facto justification for Kazan and Schulberg's testimony as ex-communists before the House Committee on Un-American Activities.On the Irish Waterfront is also a detailed social history of the New York/New Jersey waterfront, from the rise of Irish American entrepreneurs and political bosses during the World War I era to the mid-1950s, when the emergence of a revolutionary new mode of cargo-shipping signaled a radical reorganization of the port. This book explores the conflicts experienced and accommodations made by an insular Irish-Catholic community forced to adapt its economic, political, and religious lives to powerful forces of change both local and global in scope.",
  "genres": [
    "New York",
    "History"
  ],
  "author": "James T. Fisher",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/6563992-on-the-irish-waterfront"
}