{
  "title": "La montagne aux sacrifices",
  "description": "D'après une légende qui remonte à des temps immémoriaux, régnera sur la Terre des Anciens celui ou celle qui parviendra à retrouver les trônes mythiques de Darius le Sage et de son ennemi juré, le sorcier Ulphydius. Depuis plus de sept siècles, les aspirants au pouvoir sont nombreux et s'affrontent sans relâche. Toutefois, seule une Fille de Lune de la lignée maudite pourrait redresser les torts causés par ses aïeules, responsables de ces luttes sans merci que se livrent des peuples autrefois pacifiques. Mais les descendantes de cette lignée sont toutes disparues. Du moins, semble-t-il... Naïla jubile : elle est enfin libre! Exultation qui sera pourtant de courte durée... Et pour cause! Bien qu'elle soit parvenue à faire faux bond à ses tortionnaires, duo formé du sire de Canac et de Mélijna, la jeune femme n'est toujours pas au bout de ses peines. Portant en son sein le fruit des assauts répétés d'Alejandre, traquée sans répit par les hommes de ce dernier, elle cherche désespérément à retourner dans le monde de Brume. Pour ce faire, elle doit d'abord se rendre à la Montagne aux Sacrifices, sanctuaire des Filles de Lune depuis des siècles. Mais qui donc acceptera de l'y conduire, puisque Alexis refuse toujours d'assumer son rôle de protecteur? La mauvaise volonté du Cyldias à l'égard de sa mission mène sans cesse à la confrontation entre ces deux êtres que tout sépare, mais que tout devrait unir, pour leur propre survie. En route pour la Montagne aux Sacrifices, où elle entrera en pleine possession de ses pouvoirs, Naïla fera la connaissance de Madox, un protecteur au passé mystérieux. De découvertes surprenantes en rencontres déplaisantes, l'Élue de la lignée maudite n'aspire bientôt plus qu'à une chose : rentrer chez elle et oublier la Terre des Anciens. Malheuresement, une terrible erreur de sa part la catapulte en plein cauchemar...",
  "genres": [
    "Fantasy",
    "France",
    "Roman",
    "Romance"
  ],
  "author": "Elisabeth Tremblay",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/6567083-la-montagne-aux-sacrifices"
}