{
  "title": "Reagan's Secret War",
  "description": "On February 6, 1981, at his first National Security Council meeting, Ronald Reagan told his “I will make the decisions.” As Reagan’s Secret War reveals, these words provide the touchstone for understanding the extraordinary accomplishments of the Reagan administration, including the decisive events that led to the end of the Cold War. In penning this book, New York Times bestselling authors Martin Anderson and Annelise Anderson drew upon their unprecedented access to more than eight million highly classified documents housed within the Ronald Reagan Presidential Library in Simi Valley, California—unseen by the public until now. Using his top secret clearances, Martin Anderson was able to access Ronald Reagan’s most privileged exchanges with subordinates and world leaders as well as the tactical record of how Reagan fought to win the Cold War and control nuclear weapons. The most revelatory of these documents are the minutes of Reagan-chaired National Security Council meetings, the dozens of secret letters sent by Reagan to world leaders, and the eyewitness notes from Reagan-Gorbachev summits. Along with these findings, the authors use Reagan’s speeches, radio addresses, personal diaries, and other correspondence to develop a striking picture of a man whose incisive intelligence, uncanny instincts, and quiet self-confidence changed the course of history. What emerges from this treasure trove of material is irrefutable evidence that Reagan intended from his first days in office to bring down the Soviet Union, that he considered eliminating nuclear weapons his paramount objective, and that he—not his subordinates—was the principal architect of the policies that ultimately brought the Soviets to the nuclear-arms negotiating table. The authors also affirm that many of Reagan’s ideas, including his controversial “Star Wars” missile-defense initiative, proved essential in dissolving the Soviet Union and keeping America safe.Riveting and eye-opening, Reagan’s Secret War provides a front-row seat to history, a journey into the political mind of a remarkable leader, and proof that one man can, through the force of his deep convictions, bring about sweeping global change.",
  "genres": [
    "History",
    "American History",
    "Biography",
    "Nonfiction",
    "Presidents",
    "Politics",
    "War"
  ],
  "author": "Martin Anderson",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/6571750-reagan-s-secret-war"
}