{
  "title": "Object of Desire",
  "description": "“It’s always been golden for you, Danny. You’ve always been the golden boy.” Danny Fortunato seemed to have it all. He was cute, funny, sexy, smart—the hottest go-go boy in West Hollywood. When he danced on stage, all eyes were upon him and all men desired him. But something always kept Danny from ever really believing he was the golden boy that others said he was...a secret that he'd carried with him ever since he was a teenager. Twenty years later, living in Palm Springs, Danny is celebrating his 41st birthday—although “celebrating” might not be the right word for how he feels about his life today. To the outside world, he's still he still has his looks, and he still loves Frank, his boyfriend of nearly two decades. But something is missing in his life. Passion. Romance. Adventure. The same something that's been missing ever since that day when he turned fourteen, when his sister Becky disappeared and his whole world flipped upside-down. Now into Danny's life walks a gorgeous young bartender named Kelly, who becomes for Danny an obsession, an object of desire and fascination. But Kelly's indifference to this onetime golden boy only confirms what Danny secretly that he’s “vanishing” into thin air—like his sister, so long ago. As he reflects on his angst-ridden childhood—the shattering of his family, the sex and drugs of his youth as one of L.A.’s most coveted boy toys—Danny begins to recognize certain patterns. Somewhere along the way, he gave up on his dreams—not only of becoming an actor, but his very lust for life. And yet—all that’s about to change, when a surprising, agonizing connection with Kelly sends Danny on a soul-searching quest to reclaim the things he has loved and lost. Filled with unforgettable warmth, incorrigible humor, and irresistible charm, Object of Desire takes readers through three milestone eras in one man’s life—his youth in the 1970s, his days of abandon in the 1980s, and his more sober, reflective existence today—and reaffirms William J. Mann’s reputation as one of gay fiction’s major narrative powers.",
  "genres": [
    "M M Romance",
    "Gay",
    "LGBT",
    "Fiction",
    "Gay Fiction",
    "Contemporary",
    "Romance"
  ],
  "author": "William J. Mann",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/6569353-object-of-desire"
}