{
  "title": "Switch: How to Change Things When Change Is Hard",
  "description": "Why is it so hard to make lasting changes in our companies, in our communities, and in our own lives?The primary obstacle is a conflict that's built into our brains, say Chip and Dan Heath, authors of the critically acclaimed bestseller Made to Stick. Psychologists have discovered that our minds are ruled by two different systems - the rational mind and the emotional mind - that compete for control. The rational mind wants a great beach body; the emotional mind wants that Oreo cookie. The rational mind wants to change something at work; the emotional mind loves the comfort of the existing routine. This tension can doom a change effort - but if it is overcome, change can come quickly.In Switch, the Heaths show how everyday people - employees and managers, parents and nurses - have united both minds and, as a result, achieved dramatic results:- The lowly medical interns who managed to defeat an entrenched, decades-old medical practice that was endangering patients (see page 242)- The home-organizing guru who developed a simple technique for overcoming the dread of housekeeping (see page 130)- The manager who transformed a lackadaisical customer-support team into service zealots by removing a standard tool of customer service (see page 199)In a compelling, story-driven narrative, the Heaths bring together decades of counterintuitive research in psychology, sociology, and other fields to shed new light on how we can effect transformative change. Switch shows that successful changes follow a pattern, a pattern you can use to make the changes that matter to you, whether your interest is in changing the world or changing your waistline.",
  "genres": [
    "Nonfiction",
    "Business",
    "Psychology",
    "Self Help",
    "Leadership",
    "Personal Development",
    "Management"
  ],
  "author": "Chip Heath",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/6570502-switch"
}