{
  "title": "Bring The Heat",
  "description": "Police Detective Riley Ellison has a new habit...stopping by a coffeehouse called the Java Pit on his way to work. The coffee's good, but it's not the rich flavor that lures him to drive blocks out of his way each morning, and it's not an addiction to caffeine either. He's half-embarrassed to admit it, but it's the man who keeps him coming back. The long-legged, painted-on-jeans-wearing, dark-haired, edgy sex god with the teasing eyes. He's everything Riley--who has a history of geekdom and being flustered around hot men--is not. Riley knows he should put a stop to the daily forays because nothing can ever come of it. Guys like that aren't interested in men like him. Yet every time the hunk meets his gaze across the crowded shop and aims a sizzling grin at him, Riley gives in and comes back to participate in the silent, sexy flirtation another day. Needless to say, the last thing he's expecting when he goes to question a witness about a murder at a local gay strip joint is to discover the witness is his coffeehouse hottie. Dane Scott works as a stripper strictly for fun. He doesn't need the money--he's got plenty in the bank from his other career. He just likes to have something to keep him busy a few nights a week. When one of his fellow dancers turns up murdered outside the strip club, the police detective who shows up on Dane's doorstep asking questions is none other than the sexy, blond cutie he's been flirting with at the coffeehouse for weeks. Riley Ellison's a fascinating contradiction--rugged, strong, serious-eyed hero and bashful boy next door. A combination Dane finds all too appealing and a refreshing change from the selfish, shallow men he's known and dated in the past. From the moment Riley flashes his badge, Dane's determined to show the skittish cop they can make magic together. The heat between them quickly soars to the boiling point and not even a murder investigation can cool the passion they share. That is, until new information on Riley's case implies Dane may not be all he seems... Genres: Gay / Contemporary",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Mystery",
    "Erotica",
    "Contemporary Romance",
    "Crime"
  ],
  "author": "M.L. Rhodes",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/6573623-bring-the-heat"
}