{
  "title": "Roasting in Hell's Kitchen: Temper Tantrums, F Words, and the Pursuit of Perfection",
  "description": "Everyone thinks they know the real Gordon Ramsay: rude, loud, pathologically driven, stubborn as hell\nFor the first time, Ramsay tells the full inside story of his life and how he became the world's most famous and infamous chef: his difficult childhood, his brother's heroin addiction, his failed first career as a soccer player, his fanatical pursuit of gastronomic perfection and his TV persona—all of the things that made him the celebrated culinary talent and media powerhouse that he is today. In Roasting in Hell's Kitchen Ramsay talks frankly about his tough and emotional childhood, including his father's alcoholism and violence and their effect on his relationships with his mother and siblings. His rootless upbringing saw him moving from house to house and town to town followed by the authorities and debtors as his father lurched from one failed job to another. He recounts his short-circuited career as a soccer player, when he was signed by Scotland's premier club at the age of fifteen but then, just two years later, dropped out when injury dashed his hopes. Ramsay searched for another vocation and, much to his father's disgust, went into catering, which his father felt was meant for “poofs.”He trained under some of the most famous and talented chefs in Europe, working to exacting standards and under extreme conditions that would sometimes erupt in physical violence. But he thrived, with his exquisite palate, incredible vision and relentless work ethic. Dish by dish, restaurant by restaurant, he gradually built a Michelin-starred empire.A candid, eye-opening look into the extraordinary life and mind of an elite and unique restaurateur and chef, Roasting in Hell's Kitchen will change your perception not only of Gordon Ramsay but of the world of cuisine.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Food",
    "Cooking",
    "Memoir",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Gordon Ramsay",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/6577189-roasting-in-hell-s-kitchen"
}