{
  "title": "Mendel in the Kitchen: A Scientist's View of Genetically Modified Foods",
  "description": "While European restaurants race to footnote menus, reassuring concerned gourmands that no genetically modified ingredients were used in the preparation of their food, starving populations around the world eagerly await the next harvest of scientifically improved crops. Mendel in the Kitchen provides a clear and balanced picture of this tangled, tricky (and very timely) topic. Any farmer you talk to could tell you that we've been playing with the genetic makeup of our food for millennia, carefully coaxing nature to do our bidding. The practice officially dates back to Gregor Mendel-who was not a renowned scientist, but a 19th century Augustinian monk. Mendel spent many hours toiling in his garden, testing and cultivating more than 28,000 pea plants, selectively determining very specific characteristics of the peas that were produced, ultimately giving birth to the idea of heredity-and the now very common practice of artificially modifying our food. But as science takes the helm, steering common field practices into the laboratory, the world is now keenly aware of how adept we have become at tinkering with nature-which in turn has produced a variety of questions. Are genetically modified foods really safe? Will the foods ultimately make us sick, perhaps in ways we can't even imagine? Isn't it genuinely dangerous to change the nature of nature itself? Nina Fedoroff, a leading geneticist and recognized expert in biotechnology, answers these questions, and more. Addressing the fear and mistrust that is rapidly spreading, Federoff and her co-author, science writer Nancy Brown, weave a narrative rich in history, technology, and science to dispel myths and misunderstandings. In the end, Fedoroff arues, plant biotechnology can help us to become better stewards of the earth while permitting us to feed ourselves and generations of children to come. Indeed, this new approach to agriculture holds the promise of being the most environmentally conservative way to increase our food supply.",
  "genres": [
    "Science",
    "Nonfiction",
    "Food",
    "Agriculture",
    "Genetics",
    "Cooking"
  ],
  "author": "Nina V. Fedoroff",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/657658.Mendel_in_the_Kitchen"
}