{
  "title": "Slavery's Constitution: From Revolution to Ratification",
  "description": "Taking on decades of received wisdom, David Waldstreicher has written the first book to recognize slavery’s place at the heart of the U.S. Constitution. Famously, the Constitution never mentions slavery. And yet, of its eighty-four clauses, six were directly concerned with slaves and the interests of their owners. Five other clauses had implications for slavery that were considered and debated by the delegates to the 1787 Constitutional Convention and the citizens of the states during ratification. This “peculiar institution” was not a moral blind spot for America’s otherwise enlightened framers, nor was it the expression of a mere economic interest. Slavery was as important to the making of the Constitution as the Constitution was to the survival of slavery.By tracing slavery from before the revolution, through the Constitution’s framing, and into the public debate that followed, Waldstreicher rigorously shows that slavery was not only actively discussed behind the closed and locked doors of the Constitutional Convention, but that it was also deftly woven into the Constitution itself. For one thing, slavery was central to the American economy, and since the document set the stage for a national economy, the Constitution could not avoid having implications for slavery. Even more, since the government defined sovereignty over individuals, as well as property in them, discussion of sovereignty led directly to debate over slavery’s place in the new republic.Finding meaning in silences that have long been ignored, Slavery’s Constitution is a vital and sorely needed contribution to the conversation about the origins, impact, and meaning of our nation’s founding document.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Politics",
    "Race",
    "Read For School",
    "American Revolution"
  ],
  "author": "David Waldstreicher",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/6576169-slavery-s-constitution"
}