{
  "title": "Oath of Fealty",
  "description": "Elizabeth Moon’s bestselling science fiction novels featuring Kylara Vatta have earned her rave reviews and comparison to such giants as Robert Heinlein and Lois McMaster Bujold. But as Moon’s devoted fans know, she started her career as a fantasy writer. The superb trilogy known as The Deed of Paksenarrion is widely judged to be one of the great post-Tolkien fantasies, a masterpiece of sustained world-building and realistic military action. Now Moon returns to this thrilling realm for the first time in nearly twenty years. The result: another classic in the making.Thanks to Paks’s courage and sacrifice, the long-vanished heir to the half-elven kingdom of Lyonya has been revealed as Kieri Phelan, a formidable mercenary captain who earned a title and enemies in the neighboring kingdom of Tsaia. Now, as Kieri ascends a throne he never sought, he must come to terms with his own half-elven heritage while protecting his new kingdom from his old enemies and those he has not yet discovered.Meanwhile, in Tsaia, Prince Mikeli prepares for his own coronation. But when an assassination attempt nearly succeeds, Mikeli suddenly faces the threat of a coup. Acting swiftly, Mikeli strikes at the powerful family behind the attack: the Verrakaien, magelords possessing ancient sorcery, steeped in death and evil. Mikeli’s survival and that of Tsaia depend on the only Verrakai whose magery is not tainted with innocent blood.   Two kings stand at a pivotal point in the history of their worlds. For dark forces are gathering against them, knit in a secret conspiracy more sinister and far more ancient than they can imagine. And even Paks may find her gods-given magic and peerless fighting skills stretched to the limit and beyond.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Science Fiction Fantasy",
    "Adventure",
    "Military Fiction"
  ],
  "author": "Elizabeth Moon",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/6579183-oath-of-fealty"
}