{
  "title": "السحاب الأحمر",
  "description": "\"السحاب الأحمر\" كتاب يجمع بين جمال الكلمة ورنين العبارة، بلغة الماضي الصافية كالحق المنزهة عن الريب كالواقع، يعبر كاتبه عن مشاعره وأحاسيسه، على صفحات كتابه مرآة نفسه، بقلم يئن في يديه وكلامٍ يَحنّ لديه.الكتاب –وهو في تسعة فصول- بمضمونه العام مجموعة مقالات في المرأة وحبها وبغضها ولؤمها ولكن بعض هذه المقالات اتخذ صفة الحكاية القصصية..وبعضها تأملات وخواطر في الحب والمرأة..عدّه بعضهم تكملة لكتاب رسائل الأحزان بينما رأى فيه بعضهم كتابا مختلفا لا يكمل الأول ..لكني أرى فيه تتمة للحديث عن الحب والمرأة كما في الرسائل .. حتى أن الرافعي رحمه الله يقول في مقدمة الطبعة الأولى لكتابه السحاب الأحمر:لما كتبت رسائل الأحزان في فلسفة الجمال والحب كنت في تدبيره والرأي فيه كمن يؤرخ عهدا من شبابه بعد أن رقّت سنّه وذهب يقينه من الدنيا ولم يبق إلا ظنه ..فهو يكتب والكلام يحن لديه والقلم يئن في يديه.. وكل وصف جاء به من الشباب قال رحمة الله عليه!......(تم الاختصار لطول المقدمة).....كنت أستوحي الرسائل من تلك النفس التي طارت بي طيرتها البطيء وقوعها فإني لأستعر بها فكرا واشتعل منها خيالا.. وكنت لأرى الفصول تخلص من يدي حين اكتبها كما تخلص سبائك الذهب بعناصرها لا بالصناعة..وكأن هذا القلم كالحديد إذا أحْمـِـي عليه.. ليست يد لمسته من أيدي المعاني إلا وضع فيها سمة النار..ثم جاء الكتاب وما أكاد أصدق أن الزمن مرّ به.. و تم قبل أن يُتم القمر دورة شهر واحد .. فنبهني ذلك إلى أن استوفي الكلام في الحب استمدادا من أرواح أخرى.. فوضعت هذا السحاب الأحمر..ثم يقول في ختام المقدمة:والناس في هذا الحب أصناف فواحد يجاهد زلات قد وقعت وهو المحب الآثم.. وآخر يجاهد شهوات تهمّ أن تقع وهو المحب المُمتحن.. وثالث أمن هذه وهذه وإنما يجاهد خطرات الفكر وهو المحب ليحب فقط.. ورابع كالقرابة والصديق عجز الناس أن يجدوا في لغاتهم لفظا يلبس هذه العاطفة فيهم فألحقوها بأدنى الأشياء إليها في المعنى وهو الحب..وعلى الثالث وحده بنيت رسائل الأحزان.. وعلى بعض الرأي في الباقيات كسرت هذا الكتاب..",
  "genres": [
    "Literature",
    "Philosophy",
    "Nonfiction",
    "Romance",
    "Poetry",
    "Essays"
  ],
  "author": "مصطفى صادق الرافعي",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/6577337"
}