{
  "title": "Bourbon Street Blues",
  "description": "Native boy Scotty Bradley knows how to bend his hometown's every unwritten rule. it doesn't hurt that he's buff, boyish, and completely irresistible, with a job by day as a personal trainer...and the occasional night gig dancing on the bar for rent money. Hey, it's a living. Scotty likes his relaxed life, living upstairs from the coddling lesbian couple he calls his aunties, and hanging out with his eccentric, close-knit family -- stoner-hippie parents, Uptown but well-meaning sister, and scheming lawyer brother. And with New Orleans's biggest circuit party -- Southern Decadence -- about to hit town, Scotty's looking forward to plenty of dancing, cruising, and maybe, just maybe, an adorable Mr. Right.But then Scotty discovers one of his best clients in front of his Decatur Street apartment, shot through the head, execution style. It's even more troubling when his friend Jeremy, he of the disappearing act a year ago, reappears briefly in the bar, begging Scotty to take care of a computer disk for him and spouting something crazy about people being after him. And things get really, really bad when everyone from the cops -- who don't believe anything Scotty says -- to a shadowy man claiming to be an FBI agent is tailing Scotty's every move, waiting for a chance to arrest him...or worse.Now, with help from his best friend David and a gorgeous new lover who just happens to be a cat burglar of the real and not-Cary Grant variety, Scotty's diving into a web of tawdry Southern secrets that stretches all the way to a corrupt political machine whose members would do anything and use anyone to get to Scotty and that disk. Suddenly, the Big Easy's liveliest gay celebration has just taken on asinister glow, and Scotty's carefree living is turning into a desperate race for his life.",
  "genres": [
    "Mystery",
    "Gay",
    "M M Romance",
    "LGBT",
    "Fiction",
    "Queer",
    "Contemporary"
  ],
  "author": "Greg Herren",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/657953.Bourbon_Street_Blues"
}