{
  "title": "La edad de oro",
  "description": "Originalmente concebido como una revista, La edad de oro es el libro infantil por excelencia de la literatura cubana del siglo XIX. Ilustrado por Adrien Emmanuel Marie, José Martí expone aquí su proyecto latinoamericanista para los niños del continente. Esta edición de La Edad de Oro incluye los cuatro números de la revista de recreo e instrucción que el poeta y revolucionario cubano José Martí escribió para los niños de América. La revista, de periodicidad mensual, se publicó en Nueva York de julio a octubre de 1889, durante el exilio de Martí en dicha ciudad. Aquí reproducimos en alta resolución los grabados originales. El título de la revista fue idea del editor Da Costa Gómez y alude al mito griego. Luego recreado por numerosos poetas como Novalis, que caracteriza a la infancia como el tiempo de la inocencia. La revista La edad de oro era un proyecto muy personal. Todos los números publicados los escribió Martí. Básicamente escribió la revista entera, desde la primera palabra hasta la última. Muy probablemente la traducción al español del poema de Ralph Waldo Emerson y el de Helen Hunt Jackson sean también obra del propio Martí. Asimismo los dos cuentos de Edouard René de Laboulaye y el de Hans Christian Andersen que llegó a publicar en la revista, fueron reescritos por él en una adaptación libre. En la nota introductoria a la primera entrega, correspondiente a julio de 1889, Martí escribió: «Para eso se publica La Edad de para que los niños americanos sepan cómo se vivía antes, y se vive hoy, en América, y en las demás y cómo se hacen tantas cosas de cristal y de hierro, y las máquinas de vapor, y los puentes colgantes, y la luz eléctrica; para que cuando el niño vea una piedra de color sepa por qué tiene colores la piedra, y qué quiere decir cada color; para que el niño conozca los libros famosos donde se cuentan las batallas y las religiones de los pueblos antiguos». También «Así queremos que los niños de América hombres que digan lo que piensan, y lo digan bien. Hombres elocuentes y sinceros».",
  "genres": [
    "Poetry",
    "Classics",
    "Spanish Literature",
    "Fiction",
    "Childrens",
    "Novels",
    "Latin American"
  ],
  "author": "José Martí",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/658374.La_edad_de_oro"
}