{
  "title": "The Saga of King Heidrek the Wise",
  "description": "A fiftieth anniversary reissue of Christopher Tolkien’s masterly translation of the Icelandic Heidrek’s Saga, including the dramatic Battle of the Goths and the Huns, the lyrical Waking of Angantyr, and the unique riddle-contest between King Heidrek and the god Odin. Heidrek’s Saga is a medieval entertainment - a ‘romance’, but a romance that derives little of its matter from the literature of France or Germany. It is an example of a kind of story-telling that was flourishing in Iceland by the beginning of the twelfth century, and which (in contrast to the more celebrated ‘Sagas of the Icelanders’) told of legendary figures whose origins lie far back in time beyond the settlement of the country. The elements of the story, diverse in age and atmosphere, are unified in the theme of a possession bearing an ancestral curse, as it passes down the generations; but the saga’s peculiar value lies in the older poems which the unknown author set into the framework of his narrative, including The Battle of the Goths and the Huns, perhaps the oldest of all the Northern heroic lays, The Waking of Angantyr, source of many eighteenth-century ‘Gothic Odes’, and the unique riddle-contest between King Heidrek and the god Odin in disguise. Translated from the Icelandic with Introduction, Notes and Appendices by Christopher Tolkien, then Lecturer in Old English at New College, Oxford, The Saga of King Heidrek the Wise was first published in 1960 in Nelson’s Icelandic Texts series and has since become extremely difficult to obtain. Marking its fiftieth anniversary of publication, this new hardback edition reproduces the original text so that new academics and devotees may once again study and enjoy the prose and the poetry of this famous saga from the same tradition as The Legend of Sigurd and Gudrun, which under Christopher Tolkien’s editorship became a worthy best-seller in 2009. This edition is available exclusively as a print-on-demand hardback from www.tolkien.co.uk",
  "genres": [
    "Mythology",
    "Medieval",
    "History",
    "Classics",
    "Poetry",
    "Historical",
    "Epic Poetry"
  ],
  "author": "Christopher Tolkien",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/6583457-the-saga-of-king-heidrek-the-wise"
}