{
  "title": "The Jazz Loft Project: Photographs and Tapes of W. Eugene Smith from 821 Sixth Avenue, 1957-1965",
  "description": "In 1957, Eugene Smith, a thirty-eight-year-old magazine photographer, walked out of his comfortable settled world—his longtime well-paying job at Life and the home he shared with his wife and four children in Croton-on-Hudson, New York—to move into a dilapidated, five-story loft building at 821 Sixth Avenue (between Twenty-eighth and Twenty-ninth streets) in New York City’s wholesale flower district. Smith was trying to complete the most ambitious project of his life, a massive photo-essay on the city of Pittsburgh.821 Sixth Avenue was a late-night haunt of musicians, including some of the biggest names in jazz—Charles Mingus, Zoot Sims, Bill Evans, and Thelonious Monk among them—and countless fascinating, underground characters. As his ambitions broke down for his quixotic Pittsburgh opus, Smith found solace in the chaotic, somnambulistic world of the loft and its artists. He turned his documentary impulses away from Pittsburgh and toward his offbeat new surroundings.From 1957 to 1965, Smith exposed 1,447 rolls of film at his loft, making roughly 40,000 pictures, the largest body of work in his career, photographing the nocturnal jazz scene as well as life on the streets of the flower district, as seen from his fourth-floor window. He wired the building like a surreptitious recording studio and made 1,740 reels (4,000 hours) of stereo and mono audiotapes, capturing more than 300 musicians, among them Roy Haynes, Sonny Rollins, Bill Evans, Roland Kirk, Alice Coltrane, Don Cherry, and Paul Bley. He recorded, as well, legends such as pianists Eddie Costa, and Sonny Clark, drummers Ronnie Free and Edgar Bateman, saxophonist Lin Halliday, bassist Henry Grimes, and multi-instrumentalist Eddie Listengart.Also dropping in on the nighttime scene were the likes of Doris Duke, Norman Mailer, Diane Arbus, Robert Frank, Henri Cartier-Bresson, and Salvador Dalí, as well as pimps, prostitutes, drug addicts, thieves, photography students, local cops, building inspectors, marijuana dealers, and others.Sam Stephenson discovered Smith’s jazz loft photographs and tapes eleven years ago and has spent the last seven years cataloging, archiving, selecting, and editing Smith’s materials for this book, as well as writing its introduction and the text interwoven throughout.W. Eugene Smith’s Jazz Loft Project has been legendary in the worlds of art, photography, and music for more than forty years, but until the publication of The Jazz Loft Project , no one had seen Smith’s extraordinary photographs or read any of the firsthand accounts of those who were there and lived to tell the tale(s) . . .",
  "genres": [
    "Photography",
    "Music",
    "Jazz",
    "Art",
    "Nonfiction",
    "History",
    "Biography"
  ],
  "author": "Sam Stephenson",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/6580194-the-jazz-loft-project"
}