{
  "title": "Here Comes the Vampire",
  "description": "Top matchmaker and owner of Manhattan’s primo hook-up service, Dead End Dating—and one scorching hot vampire herself—Lil Marchette knows a little something about happily ever afterlife. But the bat hits the fan when she wakes up in the Las Vegas Mayan Resort and Casino hung-over and hitched to an old friend (and fellow night-lifer) who is NOT her bounty-hunting steady Ty Bonner.Lil swipes some of the casino’s security tapes to shed light on the evening’s hazy events, but what she finds can make a vamp’s blood run even colder. Instead of her trip to the altar, the tapes reveal explosive footage of a poker game gone horribly wrong—a game which could launch an all-out war between the bloodsuckers and their werewolf brethren. Suddenly Lil finds herself catapulted into the middle of a hit man’s twisted scheme. But can this diva of the undead avert an epic battle, outrun a killer, and undo her “I do” before all hell breaks loose? Librarian's note: This book was cancelled by the publisher and will not be published with Ballantine. However, the author is self-publishing a Kindle edition: http://www.goodreads.com/book/show/18...From the author: \"Hi everyone,I am so sorry the release dates on this book keep getting moved. It has been a battle to get to the point where we can do this ourselves. I was hoping that another publisher would pick up the book, and there has been a chance of that, but I know fans are tired of waiting and shopping it around involves a lot more time. I've decided that I am going to do it myself because I know everyone is tired of waiting. I am tired of waiting to. Talked with my agent and we are going to release the book in November, 2013. A new cover should be up soon and the book will be available for pre-order. I will let everyone know when the new cover is up. Again, I thank you all so much for your patience and understanding. This sort of situation is very sticky because I didn't actually own rights to that last book and so I've had to sit on it. And sit on it. And sit on it. I know that's hard to understand, but it's the reality. My hands were tied. I hope you can understand and find it in your hearts to give Lil a chance in November. If the book does well, we are going to continue the series and just self pub it ourselves.\"",
  "genres": [
    "Paranormal Romance",
    "Vampires",
    "Paranormal",
    "Romance",
    "Chick Lit",
    "Fantasy",
    "Adult"
  ],
  "author": "Kimberly Raye",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/6580748-here-comes-the-vampire"
}