{
  "title": "Wild Ride: Buckling Down / Strong, Silent Type / The Real Deal",
  "description": "BUCKLING DOWN by Moira KeithLevi McKenna heads to Las Vegas with one simple goal: win the rodeo and cement his place in rodeo history. Then Lady Luck throws a wild card into the deck—Sydney Hart. Time and distance haven’t dulled the sharp edge of their attraction, but thanks to a long-ago promise, she will always be the forbidden fruit dangling just out of reach.Sydney wants to believe in fairy tales and happily ever after, but her past relationships leave her doubting such things exist. She’s ready to give up on love . . . until Levi walks into her bar. The man who’s always held the missing piece of her heart. Love may not be in the cards, but that doesn’t mean a girl can’t flirt.Neither expected passion this hot, this fast. Yet once the cards are dealt, the only thing left to do is play them out—and see if they have a winning hand.STRONG, SILENT TYPE by Lorelei JamesWyoming rancher Quinn McKay thought he'd only have to bide time until his levelheaded wife came to her senses and called a halt to this \"trial separation.\" He never believed the marital rough patch would drag on for a coon's age.Libby McKay knew when she married the gruff, laid-back cowboy that he wasn't prone to blathering about his feelings. But three months have passed and her stubborn-as-a-mule husband is still living by himself in the horse trailer. It seems he'd rather hold onto his pride than hold onto her.Quinn realizes Libby is determined to move on if he doesn't loosen his tongue and he'll lose the only woman he's ever loved. In a last-ditch effort to keep her in his life, he offers her one weekend of uninterrupted sexual decadence.Re-igniting the passion is easy. The hard part comes after the sheets have cooled and they find out if what remains is strong enough to survive past mistakes.THE REAL DEAL by Niki GreenWilla Tate left Millbrook, Texas, years ago along with her future, her fiancee and her heart. Now, as one of the headlining acts at a hot burlesque club, she looks into the crowd, sees a familiar face staring up at her and her past comes crashing back.Chase Kiel has some hard questions for the former love of his life. He spent forever looking for her, and now he wants answers?even if he has to throw her over his shoulder and drag her back to Millbrook to get them.He'd find it a hell of a lot easier if the chemistry weren't still there. If they didn't still fit together like keg of dynamite and fuse. If he didn't want not only his answers?but her heart.Chase is still certain he and Willa belong together and convincing Willa of it will be his pleasure.",
  "genres": [
    "Westerns",
    "Romance",
    "Erotica",
    "Anthologies",
    "Contemporary Romance",
    "Contemporary",
    "Western Romance"
  ],
  "author": "Niki Green",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/6584400-wild-ride"
}