{
  "title": "The Taos Truth Game",
  "description": "When Myron Brinig arrived in Taos in 1933, he thought he was just passing through on his way to a screenwriting job in Hollywood. But Brinig fell in love--with the landscape, the burgeoning art colony that centered around Mabel Dodge Luhan, and especially with Cady Wells, a talented young painter who had left his wealthy family in the East to settle in Taos. Brinig remained in the West off and on for the next twenty years. Earl Ganz centers this entertaining novel on Brinig's conflicted relationships with Taos and its denizens. Myron Brinig, a completely forgotten writer, is brought back to center stage, along with many of the people who made Taos the epicenter of the utopian avant garde in America between the world wars. Among the cast of characters are Frieda Lawrence, Robinson and Una Jeffers, and Frank Waters, with cameo appearances by Gertrude Stein and Henry Roth.\" The Taos Truth Game reminds us that Americans have historically romped through the surprisingly wide open recreational reserves of marriage, sexuality, and friendship. Mr. Ganz exposes the daily drama of life in Mabel Dodge Luhan's orbit, and offers a rare look at our queer heritage in the American West that goes beyond the usual footnote or erasure. By weaving this pastiche from a forgotten novelist's memoirs, Mr. Ganz delightfully resurrects the truth game and invites us to play a hand.\"--Karl Olson, PRIDE Inc., Montana's LGBT advocacy organization\"Earl Ganz pulls off the impossible trick. He raises the famous dead and restores them not just to animated life, but to the full psychological and spiritual life of the living. The Taos Truth Game is a major literary achievement. How Ganz manages to do this is one of fiction writing's enduring and humbling mysteries. This book will have a wide and enthusiastic audience, starting with me.\"--Rick DeMarinis, author of Apocalypse",
  "genres": [],
  "author": "Earl Ganz",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/658673.The_Taos_Truth_Game"
}