{
  "title": "House of Stone: The True Story of a Family Divided in War-Torn Zimbabwe",
  "description": "Blue mountains, golden fields, gin and tonics on the terrace--once it had seemed the most idyllic place on earth. But by August 2002, Marondera, in eastern Zimbabwe, had been turned into a bloody battleground, the center of a violent campaign. One bright morning, Nigel Hough, one of the few remaining white farmers, received the news he had been dreading. A crowd of war veterans was at his gates, demanding he hand over his homestead. The mob started a fire and dragged him to an outhouse. To his shock, the leader of the invaders was his family’s much-loved nanny Aqui. “Get out or we’ll kill you,” she said. “There is no place for whites in this country.”            Christina Lamb uncovered the astonishing saga she tells in House of Stone while traveling back and forth to report clandestinely on Zimbabwe. Her powerful narrative traces the history of the brutal civil war, independence, and the Mugabe years, all through the lives of two people on opposing sides. Although born within a few miles of each other, their experience growing up could not have been more different. While Nigel played cricket and piloted his own plane, Aqui grew up in a mud hut, sleeping on the floor with her brothers and sisters. “They had cars and went shopping in South Africa. We didn’t have food and had to walk an hour each way to fetch water,” she remembers.            House of Stone (“dzimba dza mabwe” or “Zimbabwe” in Shona) is based on a remarkable series of interviews with this white farmer and black nanny, set against the backdrop of the last British colony to become independent, and the descent into madness of Robert Mugabe, one of Africa’s most respected nationalist leaders.",
  "genres": [
    "Africa",
    "Nonfiction",
    "Zimbabwe",
    "History",
    "Memoir",
    "Biography",
    "Politics"
  ],
  "author": "Christina Lamb",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/658415.House_of_Stone"
}