{
  "title": "Voltaire's Bastards: The Dictatorship of Reason in the West",
  "description": "With a new Introduction by the author, this “erudite and brilliantly readable book” (The Observer, London) expertly dissects the political, economic, and social origins of Western civilization to reveal a culture cripplingly enslaved to crude notions of rationality and expertise.With a new introduction by the author, this “erudite and brilliantly readable book” (The Observer, London) astutely dissects the political, economic and social origins of Western civilization to reveal a culture cripplingly enslaved to crude notions of rationality and expertise.  The Western world is full of paradoxes. We talk endlessly of individual freedom, yet we’ve never been under more pressure to conform. Our business leaders describe themselves as capitalists, yet most are corporate employees and financial speculators. We call our governments democracies, yet few of us participate in politics. We complain about invasive government, yet our legal, educational, financial, social, cultural and legislative systems are deteriorating.  All these problems, John Ralston Saul argues, are largely the result of our blind faith in the value of reason. Over the past 400 years, our “rational elites” have turned the modern West into a vast, incomprehensible, directionless machine, run by process-minded experts—“Voltaire’s bastards”—whose cult of scientific management is empty of both sense and morality. Whether in politics, art, business, the military, entertain­ment, science, finance, academia or journalism, these experts share the same outlook and methods. The result, Saul maintains, is a civilization of immense technological power whose ordinary citizens are increasingly excluded from the decision-making process.  In this wide-ranging anatomy of modern society and its origins—whose “pages explode with insight, style and intellectual rigor” (Camille Paglia, The Washington Post)—Saul presents a shattering critique of the political, economic and cultural estab­lishments of the West.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "History",
    "Politics",
    "Economics",
    "Sociology",
    "Cultural"
  ],
  "author": "John Ralston Saul",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/6584.Voltaire_s_Bastards"
}