{
  "title": "Grave's End: A True Ghost Story",
  "description": "You leave us alone; we'll leave you alone.When Elaine Mercado and her first husband bought their home in Brooklyn, N. Y., in 1982, they had no idea that they and their two young daughters were embarking on a thirteen-year nightmare.Within a few days of moving in, Elaine and her older daughter began to experience the sensation of being watched. Then came scratching noises and weird smells, followed by voices whispering, maniacal laughter, shadowy figures scurrying along baseboards, and small balls of light bouncing along the ceilings. From the beginning of the haunting, \"suffocating dreams\" were experienced by everyone except the younger daughter. These eventually accelerated to physical aggression directed at Elaine and both the girls.This book is the true story of how one family tried to cope with living in a haunted house. It also describes how, with the help of parapsychologist Dr. Hans Holzer and medium Marisa Anderson, the family discovered the tragic and heartbreaking secrets buried in the house at Grave's End.I struggle to open my eyes, but achieve nothing but frustration and failure. I am not asleep. I am fully conscious, in a state of panic unthinkable during the day intolerable in the dark of night, held prisoner by some tortured, invisible presence, insistent on abruptly invading my slumber. The more I struggle toward freedom, the more I am pushed into the mattress, perspiring, heart palpitating, a scream involuntarily silenced within my throat. Some nights I experience my skin being stroked while I fight to regain control of my body, my sight. Thank God, this was not one of those nights. Tonight it lets me open my eyes, shaken but unviolated, frightened, but not as frightened as I know I can become.First Runner up for the 2001 Coalition of Visionary Resources (COVR) Award for Best Biographical/Personal Book",
  "genres": [
    "Paranormal",
    "Nonfiction",
    "Horror",
    "Ghosts",
    "Ghost Stories",
    "Memoir",
    "Supernatural"
  ],
  "author": "Elaine Mercado",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/6585862-grave-s-end"
}