{
  "title": "Artamène ou Le Grand Cyrus",
  "description": "Artamène ou le Grand CyrusMadeleine de Scudéry, femme de lettres française (1607–1701)Ce livre numérique présente «Artamène ou le Grand Cyrus», de Madeleine de Scudéry, édité en texte intégral. Une table des matières dynamique permet d'accéder directement aux différentes sections.Table des matières- Présentation- Première Partie. Artamène Ou Le Grand Cyrus- Seconde Partie. Artamène Ou Le Grand Cyrus- Craignant Donc De Mourir En Laissant Le Roy Dans L'opinion Où Il Estoit Il L'envoya Suplier Qu'il Luy Peust Parler : Et Ce Fut Justement Comme Je Revenois D'amathuse. Je Me Trouvay Donc Aupres De Ce Prince, Lors Qu'il Reçeut Ce Message : Et À L'instant Mesme Il Partit, Pour Aller Chez Philoxipe : Mais Avec Tant De Chagrin Qu'il M'en Faisoit Piti. Il S'estoit Repenti Plus D'une Sois, De Ce Qu'il Avoit Dit À Aretaphile : Et Ne Sçachant Si Effectivement Cette Princesse N'auroit Point Dit Quelque Parole Obligeante À Philoxipe, Apres Qu'il Les Eut Laissez Ensemble ; Il Retournoit Chez Luy Avec Une Inquietude Extréme. Comme Nous Y Fusmes, Il S'informa Si La Princesse Aretaphile Y Avoit Encore Esté Long Temps Apres Luy ? Et Ayant Sçeu Que Non, Il Entra Dans La Chambre De Philoxipe : Qui Me Voyant Avec Le Roy En Fut Fort Aise. Seigneur, Luy Dit Il, Je Voy Bien Qu'il Est Temps De Vous Adjoüer Ma Foiblesse, Et De Vous Desabuser : Le Roy Qui Ne Pouvoit Concilier Ces Deux Choses, Ne Luy Respondit Qu'en Soupirant : Et S'estant Assis Aupres De Son Lict, Philoxipe Reprenant La Parole, Luy Demanda Pardon De La Peine Qu'il Luy Avoit Donnée : Et Me Pria De Raconter Au Roy Ce Que Je Sçavois De Son Avanture : Le Suppliant De Ne Trouver Pas Mauvais Que Je Ne Luy Eusse Point Dit La Verité, Puis Qu'à Moins Que D'attirer Sur Moy Le Courroux Du Ciel Et D'estre Parjure, Je N'eusse Pû Reveler Son Secret, Apres Les Sermens Qu'il M'avoit Fait Faire. Je Commençay Donc De Dire Au Roy, Tout Ce Que Je Sçavois De L'amour De Philoxipe : Mais Seigneur, Tout Ce Que Je Luy Disois, Luy Paroissoit Tellement Incroyable, Et Parce Qu'en Effet La Chose N'estoit Pas Trop Dans La Vray-semblance ; Et Parce Qu'il Craignoit Qu'elle Ne Fust Pas Vraye ; Qu'il Fut Un Assez Long Temps À Ne Pouvoir Mesme Concevoir Qu'elle Fust Possible. Enfin Il Dit À Philoxipe, Qu'à Moins Que De Voir Policrite, Il N'adjousteroit Point De Soy À Mes Paroles. Philoxipe Voyant Donc L'obstination De Ce Prince, Luy Dit Qu'encore Qu'il Se Trouvast Fort Mal, Il Ne Laisseroit Pas De Se Faire Porter À Clarie, Pour Peu Qu'il Se Trouvast Mieux Le Lendemain : S'imaginant Qu'il Recouvreroit Plustost La Santé, En S'aprochant De Policrite, Qu'en Demeurant À Paphos. Cependant Quoy Que Le Roy Ne Creust Pas Encore Ce Que Je Luy Disois, Il Y Avoit Des Momens, Où L'on Ne Laissoit Pas De Voir Des Sentimens De Joye Dans Son Cœur. Ha Mon Cher Philoxipe, Luy Disoit Il, Seroit Il Bien Possible Que Vous Ne Fussiez Point Mon Rival, Et Que Je Me Fusse Trompé ? Si Cela Est, Adjoustoit Il Encore, Je Pense Que J'adoreray Cette Policrite Dont Vous Me Parlez, Au Lieu De Condamner L'amour Que Vous Dittes Avoir Pour Elle : Puis Que Par Là Je Ne Seray Plus Contraint De Ceder, Ce Que J'aime Plus Que Ma Vie, Et Que Mon Confident Ne Sera Point Mon Rival. Mais Admirez Seigneur, Les Effets Extraordinaires De L'amour ! Philoxipe Estoit Encore Assez Malade, Lors Qu'il Avoit Envoyé Prier Le Roy De Le Venir Revoir : Mais Des Qu'il Eut Formé La Resolution De Retourner À Clarie, Il Luy Amanda ; Il Dormit Toute La Nuit Suivante, Avec Assez De Tranquilité ; Et Le Lendemain Il Se Fit Porter En Litiere À Clarie, Où Le Roy Alla Coucher. Le Jour D'apres, Philoxipe Quitta Le Lict : Et Celuy Qui Suivit Malgré Sa Foiblesse, Il Monta À Cheval Avecque Le Roy, Accompagné De Peu De Monde : Et Fut Jusques Au Pied Des Rochers Où Il Faloit Descendre.- Troisième Partie. Artamène Ou Le Grand Cyrus- Quatrième Partie. Artamène Ou Le Grand Cyrus- Cinquième Partie. Artamène Ou Le Grand Cyrus",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Madeleine de Scudéry",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/12971589-artam-ne-ou-le-grand-cyrus"
}