{
  "title": "The Sweet Potato Queens' First Big-Ass Novel: Stuff We Didn't Actually Do, but Could Have, and May Yet",
  "description": "I have no pride. I tell anything, Jill Conner Browne is fond of saying. As Her Royal Highness, Boss Queen of the Sweet Potato Queens,® she has told legions of fans, known as SPQ Wannabes, her delectable secrets to living, loving - and eating - like a queen. In her words, More is more.How much more? The #1 New York Times bestselling author of five works of nonfiction now serves up The Sweet Potato Queens' First Big-Ass Novel: Stuff We Didn't Actually Do, But Could Have, and May Yet. The humor in this uproarious coming-of-queen novel is more delicious than a favorite dessert (the Queens favor Chocolate Stuff,  of course). In Jackson, Mississippi, Mary Bennett, Patsy, Gerald, and Jill are high school classmates whose daily routine is paced like a shuffle through the local red dirt - until the arrival of a redheaded newcomer banishes monotony forever. With her luxurious mane and voluptuous figure, Tammy Myers aspires to join the silver-spooners, who make things happen in their lives. When Jill convinces Tammy and the others that money might buy a certain kind of good time and that true friendship has no price tag, the Sweet Potato Queens are born. If it ain't fun, we ain't doin' it, runs their official club motto, and the Queens are true to their word.Together, the Queens laugh out loud as they step down the long - and not altogether pretty - road toward making their very own queen dust, the sparkle that comes from livin' and lovin' their own lives. The Sweet Potato Queens' First Big-Ass Novel: Stuff We Didn't Actually Do, But Could Have, and May Yet reveals that the journey isn't always easy, but in the company of the Queens, you can sparkle, too.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Humor",
    "Southern",
    "Book Club",
    "Comedy",
    "Audiobook"
  ],
  "author": "Jill Conner Browne",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6585391-the-sweet-potato-queens-first-big-ass-novel"
}