{
  "title": "Making Friends with Death: A Buddhist Guide to Encountering Mortality",
  "description": "Drawing from  The Tibetan Book of the Dead , a Buddhist teacher “provides [readers] with the essential guidepost for embarking on the journey of life and the journey beyond” ( Journal of Hospice and Palliative Nursing ) In  Making Friends with Death,  Buddhist teacher Judith Lief, who's drawn her inspiration from the  Tibetan Book of the Dead,  shows us that through the powerful combination of contemplation of death and mindfulness practice, we can change how we relate to death, enhance our appreciation of everyday life, and use our developing acceptance of our own vulnerability as a basis for opening to others. She also offers a series of guidelines to help us reconnect with dying persons, whether they are friends or family, clients or patients.Lief highlights the value of relating to the immediacy of death as an ongoing aspect of everyday life by offering readers a variety of practical methods that they can apply to their lives and work. These methods • Simple mindfulness exercises for deepening awareness of moment-by-moment change• Practices for cultivating loving-kindness• Helpful slogans and guidelines for caregivers to useMaking Friends with Death  will enlighten anyone interested in coming to terms with their own mortality. More specifically, the contemplative approach presented here offers health professionals, students of death and dying, and people who are helping a dying friend or relative useful guidance and inspiration. It will show them how to ground their actions in awareness and compassion, so that the steps they take in dealing with pain and suffering will be more effective.",
  "genres": [
    "Buddhism",
    "Spirituality",
    "Nonfiction",
    "Death",
    "Religion",
    "Philosophy",
    "Psychology"
  ],
  "author": "Judith L. Lief",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/658716.Making_Friends_with_Death"
}