{
  "title": "Heart of a Warrior",
  "description": "Heart of a Warrior by Margaret Westhttp://www.eternalpress.ca/heartofawa...Romance, 71,400 Words$ USHeat Rating: 2 FlamesCover Art © 2009 by Dawné DominiqueEdited by Pam SladeCopyedited by Rose V. StepneyLayout and Book Production by Ally RobertsoneBook ISBN: 978-1-926704-31-9Print ISBN: 978-1-926704-30-1Summary:When Belinda arrives fresh from England, at her father’s store on the edge of a Navajo reservation, she is faced with not only the news her father is ill in hospital, but the store is being run by Jez Lansdowne, a man she hates and distrusts. Until she can find out why Jez is suddenly her father’s new partner, Belinda is forced to live in Chief Yuma’s storage hut, next to the store.Yuma is annoyed the fiery English woman is living on his land, as the Res is soon closing to outsiders. They clash, but a deeper emotion grows into a love that makes Yuma question his culture and traditions.Excerpt:Belinda ran full pelt towards the sound of the waterfall. Just when she thought she was almost there, her feet left the ground and she screamed in angry frustration. Muscular arms encased her like tight bands of steel, and she clawed at them knowing in her heart that this man was way too strong for her to escape from.“Let me go,” she screamed, scratching and kicking with every bit of strength she possessed. “Get off me.” It took a few moments for her to register the soft, masculine voice in her ear. “Belinda, it’s all right. You’re safe now—with friends. No-one’s going to hurt you.”Belinda continued to struggle. Friends! She didn’t have any of them in this godforsaken country. A small sob pushed through her swollen lips, as her strength began to wane. “Belinda, stop. The fight is over. I promise you that while there is breath in my body, no one will hurt you like this again. You’re safe with me.”As the words penetrated her terror fuelled brain, Belinda slowly ceased her wild struggle. She didn’t know who held her, but for the first time since she was a child, she felt totally safe. Still locked inside the protective circle of the arms holding her, she slowly turned. A sob caught in her throat when she saw a single turquoise stone hanging on a silver chain. It was lying on a bare, golden chest, one she remembered very well.",
  "genres": [],
  "author": "Margaret West",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/6590156-heart-of-a-warrior"
}