{
  "title": "Conceived in Liberty",
  "description": "For anyone who thinks of Murray Rothbard as only a economictheorist or political thinker, these four spectacular volumes are nothing short of shocking. They offer a complete history of the Colonial period of American history, a period lost to students today, who are led to believe American history begins with the US Constitution.Rothbard's ambition was to shed new light on Colonial history and show that the struggle for human liberty was the heart and soul of this land from its discovery through the culminating event of the American Revolution. These volumes are a tour de force, enough to establish Rothbard as one of the great American historians.Although a detailed narrative history of the struggle between liberty and power, Rothbard offers a third alternative to the conventional interpretive devices. Against those on the right who see the American Revolution as a \"conservative\" event, and those on the left who want to invoke it as some sort of proto-socialist uprising, Rothbard views this period as a time of accelerating libertarian radicalism. Through this prism, Rothbard illuminates events as never before.The volumes were brought out in the 1970s, but the odd timing and uneven distribution prevented any kind of large audience. They were beloved only by a few specialists, and sought after by many thanks to their outstanding reputation. The Mises Institute is pleased to be the publisher of the newly available set.Volume One covers the discovery of the Americas and the colonies in the 17th century (531 pages, including index).Volume Two covers the period of \"salutary neglect\" in the first half of the 18th century (294 pages, including index).Volume Three covers the advance to revolution, from 1760-1775 (373 pages, including index). Volume Four covers the political, military, and ideological history of the revolution and after (470 pages, including index).ABOUT THE AUTHOR: Murray N. Rothbard (1926-1995) distinguished himself as an economist, writing a major treatise on theory, several important economic histories, and a highly praised history of economic thought. But he was also known as the pioneer thinker of libertarianism, the political philosophy that roots freedom in private property ownership and decries the state as inherently contrary to the ethics of a free society. Writing from this perspective, he gained a reputation as the most provocative and influential contributor to the anarchist tradition in our century.",
  "genres": [
    "History",
    "American History",
    "Economics",
    "Politics",
    "Nonfiction",
    "American Revolution",
    "Philosophy"
  ],
  "author": "Murray N. Rothbard",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/12971675-conceived-in-liberty"
}