{
  "title": "A Tree in a Forest. A Collection of Ajahn Chah's Similes",
  "description": "\"People have asked about my practice. How do I prepare my mind for meditation?There is nothing special. I just keep it where it always is.They ask, 'Then are you an arahant?'Do I know?I am like a tree in a forest, full of leaves, blossoms and fruit.Birds come to eat and nest, and animals seek rest in its shade.Yet the tree does not know itself.It follows its own nature.It is as it is.\"\"All the teachings\" Ajahn Chah taught, \"are merely similes and comparisons, means to help the mind see the truth. If we establish the Buddha within our mind, then we see everything, we contemplate everything, as no different from ourselves.Many of the similes that Ajahn Chah himself used to teach came out of his vast experience of living in the forest. His practice was simply to watch, all the while being totally open and aware of everything that was happening both inside and outside himself. He would say that his practice was nothing special. He was, in his own words, like a tree in a forest, \"A tree is as it is,\" he's say. And Ajahn Chah was as he was. But out of such \"nothing specialness\" came a profound understanding of himself and the world.Ajahn Chah used to say, \"The Dhamma is revealing itself in every moment, but only when the mind is quiet can we understand what it is saying, for the Dhamma teaches without words.\" Ajahn Chah had this uncanny ability to take that wordless Dhamma and convey its truth to his listeners in the form of a simile that was fresh, easy to follow, sometimes humorous, sometimes poetic, but always striking a place in the heart where it would jar or inspire the most: \"We are like maggots; life is like a falling leaf; our mind is like rain water.\"The teachings of Ajahn Chah teem with similes and comparisons like these. We thought it would be a good idea to collect them all in the form of a book as a source of inspiration for those who may want some respite from the \"heat\" of the world and seek some rest in the cool and abundant shade of \"a tree in the forest\".",
  "genres": [
    "Buddhism",
    "Philosophy",
    "Nonfiction",
    "Spirituality",
    "Religion",
    "Psychology"
  ],
  "author": "Ajahn Chah",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/658878.A_Tree_in_a_Forest_A_Collection_of_Ajahn_Chah_s_Similes"
}