{
  "title": "Blood of the Beast",
  "description": "There is a scent that fills the night, far more delicate than the beat of the heart, more fragile than the whisper of breath escaping human lungs.The echo that fills the darkness is the scent of blood pulsating through the mortal body.Commonly overlooked by those among the living, it is a sound fervently sought by those residing on the fringes of the world existing between the living and the undead.Blood is what the beast craves.Detective Valentina Kureyev had been assigned to one of the worst murder cases of the century. A serial killer haunted the streets of her city, depositing bloodless corpses throughout the section of town known as Little Europe.She hadn't a clue to the identity of the culprit.The case was hopeless.The terror was real.As real as Demetri Daskova.The Professor of Russian Antiquities had been targeted with the murderer's special form of a calling card. Val couldn't turn away from his offer of aide in the bizarre case, even though he whispered tales of 'those that walked on the dark side of the moon' and the beast that hungrily fed on human blood.He was the primary suspect.“Are you responsible for any of the bodies we've found?” She blurted out as she examined his suddenly pale features.“I asked you for a distraction, not an insult, dorogaya.” He managed with a wry chuckle, the smallest fraction of tenseness appearing to ease from him. Demetri looked down at her upturned face, his eyes heavily lidded, and his expression forbidding.“It's not an insult, Petronov.” Val responded, her expression serious. “I have to know.”“Shut up, Detective.” Demetri commanded imperiously in the silkiest of menacing tones. His large hands fell from his ribcage and remained, pale and unclenched, at his sides. The horror threatening to consume him began to wane slowly. “For once, shut that luscious mouth of yours, and don't speak my name aloud.”Professional … building tension and suspense made it almost impossible for me to put this one down until the last page…Maura -- Reviewer for Coffee Time Romance & More…pulls the reader in with this finely crafted tale of intriguing characters coupled with absorbing drama. An engaging portrait of loss and redemption. ..NIGHT OWL ROMANCE",
  "genres": [
    "Vampires",
    "Paranormal Romance",
    "Romance",
    "Adult",
    "Paranormal",
    "Fiction",
    "Mystery"
  ],
  "author": "Tamela Quijas",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/6588515-blood-of-the-beast"
}