{
  "title": "Too Good to Be True: The Rise and Fall of Bernie Madoff",
  "description": "Despite all the headlines about Bernard Madoff, who pleaded guilty to running a $65 billion Ponzi scheme, he is still shrouded in mystery. Why (and when) did he turn his legitimate business into a massive fraud? How did he fool so many smart investors for so long? Who among his family and employees knew the truth? The best person to answer these questions—and tell the full story of Madoff’s rise and fall—is Erin Arvedlund. In early 2001, she was suspicious of the amazing returns of Madoff’s hedge fund, which no one could explain. Her article in Barron’s, based on more than one hundred interviews, could have prevented a lot of misery, had the SEC followed up. But almost no one was willing to believe anything bad about “Uncle Bernie”—so nice, so humble, so generous to charities. As Arvedlund shows, Madoff was no ordinary liar, but a master of the type of lies people really wanted to believe. He kept his clients at a distance and allowed handsomely paid friends to solicit new ones for him; playing hard to get created an irresistible mystique. Now, Arvedlund tackles the tough questions that are still unanswered in the wake of Madoff’s collapse:  Did he start off as a legitimate money manager or was he a fraud from the beginning? Were there indications of larceny at the very start of his career? Why did Madoff’s biggest supporters within the industry, such as Walter Noel of Fairfield Greenwich and Ezra Merkin of Gabriel Capital, ignore the warning signs that were so apparent? Did they choose to remain ignorant as long as their commissions rolled in? Why did SEC investigations fail to catch Madoff’s Ponzi scheme even though several people had voiced concerns about his operation? Who else helped Madoff carry out his scam? His family and close associates have denied any involvement, but was it possible for one man to engineer a heist of such scope? With her keen investigative eye, Arvedlund presents a sweeping narrative of Madoff’s career—from his youth in Queens, New York, to his early days working for his father-in-law, to his time as chairman of the NASDAQ exchange, and finally to infamy as the world’s most notorious swindler. She offers a riveting glimpse of Madoff the man—an indifferent student with little ambition who transformed himself into a star with a talent for trading, a reputation for innovation, and an unmistakably erratic nature. Readers will be fascinated by Arvedlund’s portrayal of Madoff, his empire, and all those who never considered that he might be too good to be true.",
  "genres": [
    "Nonfiction",
    "Business",
    "Biography",
    "Finance",
    "True Crime",
    "Crime",
    "History"
  ],
  "author": "Erin Arvedlund",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/6595360-too-good-to-be-true"
}