{
  "title": "Deadly Kingdom: The Book of Dangerous Animals",
  "description": "How does a tiny box jellyfish, with no brain and little control over where it goes in the water, manage to kill a full-grown man? What harm have hippos been known to inflict on humans, and why? What makes our closest cousin, the chimpanzee, the most dangerous of all apes to encounter in the wild?In this elegantly illustrated, often darkly funny compendium of animal predation, Gordon Grice, hailed by Michael Pollan as “a fresh, strange, and wonderful new voice in American nature writing,” presents findings that are by turns surprising, humorous, and horrifying. Personally obsessed by both the menace and beauty of animals since he was six years old and a deadly cougar wandered onto his family’s farm, Grice now reaps a lifetime of study in this unique survey—at once a reading book and a resource.Categorized by kind and informed throughout by the author’s unsentimental view of the natural order and our place in it, here are the hard-to-stomach, hard-to-resist facts and legends of animal encounters. Whether it’s the elephant that collided with a fuel tanker and lived (the tanker exploded), the turn-of-the-century household cure for a copperhead bite (douse the infected area in kerosene), or the shark that terrorized the New Jersey coastline for a summer (later inspiring the film Jaws), everything you’ve ever wanted to know about animals but were afraid to ask is included in this hair-raising, heart-racing volume. By turns wondrous, mordant, and sobering, this book is ultimately a celebration of the animal world—in all its perilous glory—by a writer who’s been heralded by The New York Times for his ability to combine “the observations of a naturalist with a dry, homespun philosopher’s wit.”",
  "genres": [
    "Nonfiction",
    "Animals",
    "Nature",
    "Science",
    "Science Nature",
    "Natural History",
    "Wildlife"
  ],
  "author": "Gordon Grice",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/6592146-deadly-kingdom"
}