{
  "title": "Out of Breath",
  "description": "On a drizzly October night in the coastal town of Santa Cruz, California, seventeen-month-old Nevaeh drowns. Her mother, Alyssa Buchanan, is wild with rage and regret for placing her trust in her husband Seth, a former pro surfer who has a drug problem. Seth is adamant that he was clean the night of Nevaeh's death, yet a dirty drug test contradicts his story. His parental rights stripped and criminal charges looming, he battles to prove his innocence, love, and family devotion. Adding to the couple’s grief, their five-year-old daughter Daisy hasn’t uttered a word since her sister's death. Alyssa turns to childhood friend and local police officer, Greg Wallace, for comfort and support. Although Greg portrays heroic devotion and justice, inwardly he swims with loss, narcissism, and explosive rage. He has long despised Seth and is more than willing to meet Alyssa's needs that reach far beyond friendship.Into this fragile scene steps therapist Katherine Middlebrook. Her practice consumes nearly all her time--time that is even more precious now that her mother's cancer has returned. She hesitantly accepts three new clients--Greg Wallace, and Seth & Alyssa Buchanan, unaware of their intertwined history. Buried deep in Katherine's past is the loss of her own child. She's sure she can keep the boundaries of her past and her clients' lives clear until their intersecting tragedies awaken old demons.An award winner in the South West Writer's Contest for literary and mainstream novel, Out of Breath is an exploration of parental grief, addiction, compassion fatigue, and suicide; it's the prodigal story of grace undeserved. Salluce's expertise as a psychotherapist and grief specialist enables her to create dynamic characters that will leave you breathless as you jeer their shadow sides and cheer their heroic journeys.",
  "genres": [
    "Fiction"
  ],
  "author": "Susan Salluce",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/12971915-out-of-breath"
}