{
  "title": "The Lives They Left Behind: Suitcases from a State Hospital Attic",
  "description": "“The Lives They Left Behind is a deeply moving testament to the human side of mental illness, and of the narrow margin which so often separates the sane from the mad. It is a remarkable portrait, too, of the life of a psychiatric asylum-the sort of community in which, for better and for worse, hundreds of thousands of people lived out their lives. Darby Penney and Peter Stastny’s careful historical (almost archaeological) and biographical reconstructions give us unique insight into these lives which would otherwise be lost and, indeed, unimaginable to the rest of us.” -Oliver Sacks“Fascinating. . . . The haunting thing about the suitcase owners is that it’s so easy to identify with them.” -NewsweekWhen Willard State Hospital closed its doors in 1995, after operating as one of New York State’s largest mental institutions for over 120 years, a forgotten attic filled with suitcases belonging to former patients was discovered. Using the possessions found in these suitcases along with institutional records and doctors’ notes from patient sessions, Darby Penney, a leading advocate of patients’ rights, and Peter Stastny, a psychiatrist and documentary filmmaker, were able to reconstruct the lives of ten patients who resided at Willard during the first half of the twentieth century. The Lives They Left Behind tells their story. In addition to these human portraits, the book contains over 100 photographs as well as valuable historical background on how this state-funded institution operated. As it restores the humanity of the individuals it so poignantly evokes, The Lives They Left Behind reveals the vast historical inadequacies of a psychiatric system that has yet to heal itself.",
  "genres": [
    "Nonfiction",
    "History",
    "Psychology",
    "Mental Health",
    "Mental Illness",
    "Biography",
    "Medical"
  ],
  "author": "Darby Penney",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/6593820-the-lives-they-left-behind"
}