{
  "title": "Colinas negras",
  "description": "Pasar un verano en el rancho de sus abuelos en Dakota del Sur no es lo que a Cooper Sullivan, de once años, le parecía el mejor plan. Pero las cosas cambiaron y se tornaron más llevaderas cuando conoció a su vecina, Lil Chance, y su jaula de bateo casera, e incluso un paseo a cabello no le pareció tan desagradable como Coop pensaba. Y así, cada año que pasaba, con cada visita veraniega de Coop, la amistad entre ambos se fue transformando, y de los inocentes juegos pasaron a los besos robados... hasta el momento en que tuvieron que compartir una terrible experiencia que los persiguió para siempre: el descubrimiento del cadáver de un excursionista.Ahora, han pasado doce años. Años en los que Lil ha luchado por cumplir sus sueños de convertirse en bióloga y proteger su tierra, mientras que Coop ha lidiado con las demandas de su padre de ir a la Facultad de Derecho y unirse al despacho familiar. Y el destino ha vuelto a unirlos y traerlos a las Black Hills donde la gente y cosas que les son más cercanos, más los necesitan en estos momentos.Como detective de Nueva York, Coop ha dejado recientemente su estresante vida para cuidar de sus ancianos abuelos y el rancho al que llegó a llamar hogar. Por su parte, Lil, con el recuerdo de las caricias de su antiguo amigo aún en mente, no ha cejado en su empeño de abrir un refugio de fauna salvaje, pero alguien... o algo... ha estado observándola muy de cerca. Y cuando pequeños travesuras pasan a actos vandálicos y terminan con la muerte del amado puma de Lil, los recuerdos de un asesinato sin resolver hacen que Coop empiece a tomar cartas en el asunto para mantener a salvo a Lil.Tanto Lil como Coop conocen perfectamente los peligros que encierran las montañas de Black Hills, pero ahora deberán trabajar codo con codo para desenmascarar a un asesino con retorcidos instintos que los ha marcado como su siguiente presa.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Fiction",
    "Mystery",
    "Suspense",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Nora Roberts",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/10320842-colinas-negras"
}