{
  "title": "Deaf Child Crossing",
  "description": "The Barnes & Noble ReviewOscar-winning actor Marlee Matlin teaches us about friendship, differences, and patience in this buoyant and fulfilling novel featuring Megan, a deaf girl, and her new best friend.Young Cindy's family has just moved to Morton Street, and Megan is already at her doorstep. At first, outgoing Megan seems both exciting and overwhelming, with fast-as-lightning sign language skills, a \"voice that sounded different to others,\" and a personality that could put any neighborhood welcome wagon to shame. Soon the two girls are best buds, and Megan introduces Cindy to her world, chatting with friends online and teaching her signs. Yet whenever Cindy tries to help out her independence-focused friend, Megan gets a bit defensive, leaving Cindy on shaky ground. After Megan finds out she's going to summer camp, Cindy decides to join her friend, and the two are bunked together with the girls of Hot Pink Cabin, including Lizzie, another deaf girl who starts taking up much of Megan's attention. Megan also decides to test her self-sufficiency one night and takes off into the woods, only to get lost until Cindy finds her, much to Megan's frustration. When summer camp's over, however, and the girls return home on non-speaking terms, Megan finally realizes that \"no matter who you are, sometimes you're going to need help.\"Matlin's first foray into writing novels for young readers is compassionate and proud, addressing deafness head-on without letting the issue become too angelic. Megan is a well-rounded character and her temper sometimes gets the better of her, sending readers a clear message that should resonate long after the book is finished. A fair-minded novel that should change perceptions of folks with different abilities, Deaf Child Crossing will have children and adults sitting up and taking notice. Shana Taylor",
  "genres": [
    "Middle Grade",
    "Disability",
    "Fiction",
    "Realistic Fiction",
    "Childrens",
    "Young Adult",
    "Friendship"
  ],
  "author": "Marlee Matlin",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/659305.Deaf_Child_Crossing"
}