{
  "title": "The Hot Flash Club Chills Out",
  "description": "Since opening up their day spa, The Haven, the wonderful women of the Hot Flash Club have been busy indulging the beleaguered, nerve-frazzled throngs. Now, in Nancy Thayer’s hilarious new Hot Flash novel, it’s the friends’ turn to grab some soothing, and much-deserved R&R.When a long-time Haven client asks the gals to housesit her Nantucket hideaway for the summer, they’re beyond thrilled; the cozy island enclave is the perfect place to shop, swim, chill, and plan Marilyn’s upcoming wedding to Ian, her Scottish fiancé. And Marilyn desperately needs the break, since Ian’s grown son has crashed at the couple’s place with no departure date in sight.Soon after they arrive, the other hot flashers surrender to their own summer Shirley entertains a steamy dalliance with a scruffy, sexy local fisherman that could lead to something deeper; Faye finds her dream house, but restoring it could be a costly nightmare; craft-maven Polly is enthralled by the island’s bounty, from shell art to lightship baskets; and even hardboiled Alice swoons with romantic adventure–or is it seasickness?But this lovefest among the sand and ocean breezes is not without its consequences. Each woman must determine for herself what she is willing to give up in order to hold onto what she has found–and all of them fear that Shirley is on the brink of making a huge mistake, one that threatens their harmony and their business. But these concerns may be eclipsed by the mystery surrounding the disappearance of family heirlooms at the house where they are staying, and rumors that the place harbors spirits other than Grey Goose and Tanqueray.Nancy Thayer continues her hugely successful Hot Flash series with this wickedly funny, delightfully bawdy tale. These irresistible women spring to life–along with their passions, their sorrows, their joys, and, most importantly, their friendship. So pack your bags and join these fabulous five for a season of fun, sun, love, sex, and estrogen therapy.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Humor",
    "Mystery",
    "Contemporary",
    "Womens Fiction",
    "Audiobook"
  ],
  "author": "Nancy Thayer",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/65931.The_Hot_Flash_Club_Chills_Out"
}