{
  "title": "The Guide for the Perplexed",
  "description": "Translated by M. Friedlander This is an electronic edition of the complete book. This book features the table of contents linked to every chapter, section and part. The book was designed for optimal navigation on the Kindle, PDA, Smartphone, and other electronic readers. It is formatted to display on all electronic devices including the Kindle, Smartphones and other Mobile Devices with a small display. ****************** The Guide for the Perplexed (Hebrew translit. Moreh Nevuchim ) is one of the major works of Rabbi Moshe ben Maimon, better known as Maimonides or \"the Rambam\". It was written in the 12th Century in the form of a three-volume letter to his student, Rabbi Joseph ben Judah of Ceuta, the son of Rabbi Judah, and is the main source of the Rambam's philosophical views, as opposed to his opinions on Jewish law. Since many of the philosophical concepts, such as his view of theodicy and the relationship between philosophy and religion, are relevant beyond strictly Jewish theology, it has been the work most commonly associated with Maimonides in the non-Jewish world and it is known to have influenced several major non-Jewish philosophers. Following its publication, \"almost every philosophic work for the remainder of the Middle Ages cited, commented on, or criticized Maimonides' views.\" Within Judaism, the Guide became widely popular and controversial, with many Jewish communities requesting copies of the manuscript. -- Excerpted from Wikipedia, the free encyclopedia. More e-Books from MobileReference - Best Books. Best Price. Best Search and Navigation (TM) All fiction books are only $0.99. All collections are only $5.99Designed for optimal navigation on Kindle and other electronic devices Search for any enter mobi (shortened MobileReference) and a keyword ; for mobi ShakespeareTo view all books, click on the MobileReference link next to a book title Literary Over 10,000 complete works by Shakespeare, Jane Austen, Mark Twain, Conan Doyle, Jules Verne, Dickens, Tolstoy, and other authors. All books feature hyperlinked table of contents, footnotes, and author biography. Books are also available as collections, organized by an author. Collections simplify book access through categorical, alphabetical, and chronological indexes. They offer lower price, convenience of one-time download, and reduce clutter of titles in your digital library. The Illustrated King James Bible, American Standard Bible, World English Bible (Modern Translation), Mormon Church's Sacred Texts Rousseau, Spinoza, Plato, Aristotle, Marx, Engels Travel Guides and Phrasebooks for All Major New York, Paris, London, Rome, Venice, Prague, Beijing, Greece Medical Study Anatomy and Physiology, Pharmacology, Abbreviations and Terminology, Human Nervous System, Biochemistry College Study FREE Weight and Measures, Physics, Math, Chemistry, Organic Chemistry, Statistics, Languages, Philosophy, Psychology, Mythology Art History, American Presidents, U.S. History, Encyclopedias of Roman Empire, Ancient Egypt Acupressure Guide, First Aid Guide, Art of Love, Cookbook, Cocktails, Astrology The World's Biggest Mobile Encyclopedia; CIA World Factbook, Illustrated Encyclopedias of Birds, Mammals",
  "genres": [
    "Philosophy",
    "Religion",
    "Judaism",
    "Classics",
    "Nonfiction",
    "Theology",
    "Jewish"
  ],
  "author": "Maimonides",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/6596101-the-guide-for-the-perplexed"
}