{
  "title": "Parallel Play: Growing Up with Undiagnosed Asperger's",
  "description": "An affecting memoir of life as a boy who didn’t know he had Asperger’s syndrome until he became a man.In 1997, Tim Page won the Pulitzer Prize for Criticism for his work as the chief classical music critic of The Washington Post , work that the Pulitzer board called “lucid and illuminating.” Three years later, at the age of 45, he was diagnosed with Asperger's syndrome–an autistic disorder characterized by often superior intellectual abilities but also by obsessive behavior, ineffective communication, and social awkwardness.In a personal chronicle that is by turns hilarious and heartbreaking, Page revisits his early days through the prism of newfound clarity. Here is the tale of a boy who could blithely recite the names and dates of all the United States’ presidents and their wives in order (backward upon request), yet lacked the coordination to participate in the simplest childhood games. It is the story of a child who memorized vast portions of the World Book Encyclopedia simply by skimming through its volumes, but was unable to pass elementary school math and science. And it is the triumphant account of a disadvantaged boy who grew into a high-functioning, highly successful adult–perhaps not despite his Asperger’s but because of it, as Page believes. For in the end, it was his all-consuming love of music that emerged as something around which to construct a life and a prodigious career.In graceful prose, Page recounts the eccentric behavior that withstood glucose-tolerance tests, anti-seizure medications, and sessions with the school psychiatrist, but which above all, eluded his own understanding. A poignant portrait of a lifelong search for answers, Parallel Play provides a unique perspective on Asperger's and the well of creativity that can spring forth as a result of the condition.",
  "genres": [
    "Memoir",
    "Autistic Spectrum Disorder",
    "Nonfiction",
    "Psychology",
    "Biography Memoir",
    "Biography",
    "Autobiography"
  ],
  "author": "Tim   Page",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/6595779-parallel-play"
}