{
  "title": "When the Day of Evil Comes",
  "description": "Bizarre Encounter Initiates Extreme Spiritual BattleDylan Foster’s carefully constructed, orderly world begins to fray, thread by thread, the day the eyes of hell turn upon her. After a chance encounter with a creepy, sickly looking stranger, her days become punctuated with disturbing, inexplicable events. Desperate for answers, Dylan seeks not only to extricate herself from the nightmare, but to separate the spiritual from the earthly, friend from foe, angel from devil, good from evil. She’s smack in the eye of the battle with only God-issued spiritual armor and her own wits to protect her.I saw the first fly alight on the edge of my plate during supper. This was no ordinary fly. It was huge. The size of a small Volkswagen. I could have painted daisies on it and sold rides to small children.Hotter than the eyes of hell...School is back in session, but for psychology professor Dylan Foster, the promise of a new semester is dying in the heat of the late Texas summer. First, there is the bizarre encounter with a ghastly pale stranger. Then her mother’s engagement ring turns up—the same ring that was buried with her mother two years before.Soon, Dylan’s carefully ordered world is unraveling, one thread at a time. A former patient accuses her of impropriety, putting her career in jeopardy. A suicide plunges her deeper into shadow. Relationships with colleagues start to crumble. And then there are those flies in her house...Dylan Foster is about to get a crash course in spiritual warfare—and a glimpse of her own small but significant role in a vast eternal conflict. But when the dust settles, will anything be left of her life as she knows it?",
  "genres": [
    "Christian Fiction",
    "Christian",
    "Supernatural",
    "Suspense",
    "Mystery",
    "Horror",
    "Fiction"
  ],
  "author": "Melanie  Wells",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/65922.When_the_Day_of_Evil_Comes"
}