{
  "title": "Foxed",
  "description": "FOXED: To be thrown into a state of uncertainty—flustered, bamboozled, bewildered, puzzled, vexed.AKA, me. Jed Marshall. 55-year-old successful classic car mechanic; divorced, mostly closeted, and whose wholly inexperienced bisexuality has suddenly awakened after one smouldering look and said, ‘Damn, who’s the hottie?’ Or words to that effect.Cue, Nash Collingwood. 53-year-old scarily smart high school principal; out, gay, confident, and sexy as hell. He’s also my daughter’s boss. So, not complicated at all, right? Nash could ignite a bonfire with a single sultry look, comes fully accessorised with a charm offensive Churchill would be proud of, an easy-going flattery that thrills my heart far too effortlessly, and an impressive track record with men many decades my junior.In short, Nash is everything I’m not, and everything I’ve avoided for roughly my entire life. He’s the hot rod to my sensible family car, that is if you like your family cars with a few dents, creaky suspension, unexpected backfires, and a dodgy stick.The last thing I need is a relationship—especially with a man. I buried that pipe dream a long time ago and a little loneliness is a small price to pay. The festive season and long summer vacation are on our doorstep. I’m finally getting things right with my family who mean everything to me, and I don’t want to mess that up.But Nash doesn’t care about my awkward inexperience, or clumsy excuses, or any of my insecurities. Nash only sees me. He wants me. For the first time in years, I feel alive and sexy and a whole lot more than just a good father and grandfather.I should walk away, but the closer Nash and I become, the more he fills my grey world with colour, and the promise of a second chance at love I never thought possible.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Audiobook",
    "LGBT",
    "Contemporary Romance",
    "Friends To Lovers"
  ],
  "author": "Jay Hogan",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/65974903-foxed"
}