{
  "title": "Truck Stop",
  "description": "Before the events of Jack Kilborn's epic horror novel AFRAID...Before the events of J.A. Konrath's critically acclaimed thrillers FUZZY NAVEL and CHERRY BOMB...Before the events of Jack Kilborn's and Blake Crouch's #1 Amazon Kindle bestseller SERIAL...Three hunters of humans meet for the ultimate showdown at the TRUCK STOP.Taylor is a recreational killer, with dozens of grisly murders under his belt. He pulls into a busy Wisconsin truck stop at midnight, trolling for the next to die.Chicago Homicide cop Jacqueline \"Jack\" Daniels is a long way from home, driving to meet her boyfriend for a well-earned vacation. She pulls into the truck stop for a quick cup of coffee and stumbles into her worst nightmare.Jack's no stranger to dealing with psychos, but she's got her hands full trying to stop Taylor. Especially since he's getting help from someone just as deadly; a portly serial maniac named Donaldson...TRUCK STOP is a 15,000 word thriller novella that ties together Konrath's and Kilborn's works, with terrifying results.A prequel to SERIAL, which has been downloaded more than 70,000 times, TRUCK STOP is an eighteen-wheeled ride straight into hell. Not for the faint of heart. Let the reader beware.This ebook also includes an exclusive interview: JA Konrath talks with Jack Kilborn, plus excerpts from their latest books, CHERRY BOMB and AFRAID.Praise for JA Konrath's thriller FUZZY NAVEL:\"Fuzzy Navel is Konrath at his best – a hilariously heartstopping thriller.\" — Linda Fairstein, author of Lethal Legacy\"This gripping novel is an adrenalin rush.\" — Library Journal\"This book moves so fast it was like having the words fired into my head by a machine gun.\" — CrimespreePraise for AFRAID by Jack Kilborn:\"AFRAID is a masterpiece of unrelenting horror. And I'm not exaggerating. Masterpiece. It's the best piece of fiction I've read in several years. It simply NEVER lets up.\" — James Rollins, author of The Doomsday Key\"A bloody, terrifying, hurtling assault across a landscape of non-stop mayhem. A guilty, guilty pleasure.\" — F. Paul Wilson, creator of Repairman Jack“AFRAID is a true page turner, a novel that offers a million mile a minute action and suspense. Definitely, a must have with constant thrills and chills.\" — Heather Graham, author of Deadly Gift\"Never have I read a novel so gruesome and simultaneously relentless. This book throbs with unmitigated, inexorable. sheer friggin’ TERROR. You’ll probably need a shrink when you’re done.” — Edward Lee, author of The Golem\"Fast and ferocious, this is a dangerous thriller that will take a bite out of you. An absolute must read for anyone who loves the adrenaline rush of a shocking story told with style, speed and savage grace.\" — Jonathan Maberry, author of Patient Zero",
  "genres": [
    "Horror",
    "Thriller",
    "Short Stories",
    "Mystery",
    "Fiction",
    "Serial Killer",
    "Mystery Thriller"
  ],
  "author": "J.A. Konrath",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/6598913-truck-stop"
}