{
  "title": "Gengis-Kan",
  "description": "Vasili Yantchevetski -Vasili Yan- (1874-1954), escritor de novela histórica ruso poco conocido en Occidente debido a que la mayor parte de su carrera literaria se desarrolló durante la era soviética, sintió una gran fascinación y curiosidad por la historia del pueblo mongol tras contemplar las espléndidas ruinas de un mundo antiguo arrasado siete siglos atrás por sus imparables hordas de jinetes.Producto de esta obsesión son los muchos años de trabajos de investigación y documentación que dedicó Yan al pueblo mongol, y a uno de sus líderes más carismáticos: Gengis-Kan, que dieron su fruto en una trilogía: Gengis-Kan (1939), Batú (1941) y Hasta la última mar (1954).Los materiales que utiliza Yan en Gengis-Kan son los que dan sustancia narrativa a las «Bilinas», el equivalente ruso a los romances o cantares de gesta de occidente, uno de cuyos temas principales es la lucha de los pueblos rusos contra los tártaros y nómadas de la estepa. Al inicio de la novela encontramos una mención a un evento que nos sirve de referente histórico: la batalla en que los generales mongoles Subotai-Bagatur y Tokutchar-Noyon derrotaron a los merkitas a orillas del Djam en 1217. Para entonces Gengis-Kan ha unificado a todos los nómadas de la estepa y se dispone a someter al reino turco-mongol, de cultura china. La historia del conquistador mongol, el Gran Kan, es narrada por Yan con exactitud y fidelidad a lo conocido, pero sin renunciar a un elevado tono épico y un notable nivel literario. Comienza la narración en el reino de Jorezmia, donde el príncipe Djelal ed-Din, guerrero legendario, opone una resistencia homérica al avance mongol, pocos años antes de que la Horda de Oro mongola invadiera Rusia, destruyera Kiev y llegara a tomar Budapest.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Russia",
    "War",
    "Adventure",
    "Classics",
    "Historical"
  ],
  "author": "Vasily Yan",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/6599720-gengis-kan"
}