{
  "title": "The Lexicographer's Dilemma: The Evolution of \"Proper\" English, from Shakespeare to South Park",
  "description": "For language buffs and lexicographers, copy editors and proofreaders, and anyone who appreciates the connection between language and culture—the illuminating story of “proper English.” In its long history, the English language has had many lawmakers—those who have tried to regulate, or otherwise organize, the way we speak. The Lexicographer’s Dilemma offers the first narrative history of these endeavors, showing clearly that what we now regard as the only “correct” way to speak emerged out of specific historical and social conditions over the course of centuries.As literary historian Jack Lynch has discovered, every rule has a human history, and the characters peopling his narrative are as interesting for their obsession as for their erudition. The struggle between prescriptivists, who prescribe a correct approach, and descriptivists, who analyze how language works, is at the heart of Lynch’s story. From the sharp-tongued satirist Jonathan Swift, who called for a governmentsponsored academy to issue rulings on the language, and the polymath Samuel Johnson, who put dictionaries on a new footing, to John Horne Tooke, the crackpot linguist whose bizarre theories continue to baffle scholars; Joseph Priestley, whose political radicalism prompted riots; and the ever-crotchety Noah Webster, whose goal was to Americanize the English language—Lynch brings to life a varied cast as illuminating as it is entertaining.Grammatical “rules” or “laws” are not like the law of gravity, or laws against theft or murder—they’re more like rules of etiquette, made by fallible people and subject to change. Charting the evolution of English, Jack Lynch puts today’s debates—whether about Ebonics in the schools or split infinitives in the New York Times—in a rich historical context, and makes us appreciate anew the hard-won standards we now enjoy.",
  "genres": [
    "Language",
    "Nonfiction",
    "Linguistics",
    "History",
    "Books About Books",
    "Writing",
    "Words"
  ],
  "author": "Jack Lynch",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/6599315-the-lexicographer-s-dilemma"
}