{
  "title": "The Undaunted : The Miracle of the Hole-in-the-Rock Pioneers",
  "description": "The journey was impossible. But they had no other choice. At the call of their prophet, they left well-established farms and businesses to strike out yet again into the untamed wilderness. A small band of men, women, and children formed the 1879 pioneer company. Their mission: stand as a buffer between lawlessness and civilization. Their road: only what they created themselves, blasting out a perilous trail over slick rock and through desolate cliffs. Their hearts: UNDAUNTED When it comes to creating spellbinding historical fiction, nobody does it quite like Gerald N. Lund. In The Undaunted, he transports readers first to the coal mines of Yorkshire, then across the ocean and the plains to the territory of Utah, where, even in 1879, there is pioneering to be done. A little- known and perhaps even less- appreciated chapter in the Church s history comes to life in this gripping story of a stalwart group of Saints called to create a settlement to serve as a buffer between the established communities of Utah and the lawless frontier of the Four Corners area. Their challenge will be enormous but the biggest part of it just may be getting there in the first place. Skillfully interweaving historical figures and events with fictional characters, Gerald Lund takes us through the Hole in the Rock and over miles of uncharted country that even today is impassable without all- terrain vehicles. His account of the adventure, romance, and sacrifices of these undaunted pioneers will resonate with readers who love a good story as well as those who want to better understand the incomparable legacy and unconquerable faith of those valiant Saints.",
  "genres": [
    "Lds",
    "Religion",
    "Lds Fiction",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Church"
  ],
  "author": "Gerald N. Lund",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/6601008-the-undaunted"
}