{
  "title": "Green River, Running Red: The Real Story of the Green River Killer--America's Deadliest Serial Murderer",
  "description": "In the most extraordinary book Ann Rule has ever undertaken, America's master of true crime has spent more than two decades researching the story of the Green River Killer, who murdered more than forty-nine young women. The quest to discover the most prolific serial killer in American history has been an intimate part of Ann Rule's life, with some of the corpses found only a mile or so from where she lived and raised her own daughters. She did not know the killer, but he apparently knew her and attended many of her book signings. For twenty-one years, the killer carried out his self-described \"career\" as a killing machine, ridding the world of women he considered evil. His eerie ability to lure his victims to their deaths and hide their bodies made him far more dangerous than any infamous multiple murderer in the annals of crime. A few men -- including a law student, a truck painter, and a taxi driver -- eventually emerged as the prime suspects among an unprecedented forty thousand scrutinized by the Green River Task Force. Still, there was no physical evidence linking any of them to the murders until 2001, when investigators used a new DNA process on a saliva sample they had preserved since 1987, with stunning results. Ann Rule has followed the case since July 1982, when the first body -- that of teenager Wendy Lee Coffield -- was found in the Green River, snagged on pilings under a bridge. Rule has compiled voluminous files, working through an incredible 95,000 pages of official police records, transcripts, photographs, and maps, winnowing out the chaff and identifying what is truly important. Over the years, she gained unparalleled access to all the key players -- from King County Sheriff Dave Reichert to those close to the killer and his victims. When finally apprehended and convicted, the killer made a detailed confession -- of his twisted sexual obsessions -- that will shock even the most jaded reader. Green River, Running Red is a harrowing account of a modern monster, a killer who walked among us undetected. It is also the story of his quarry -- of who these young girls were, and who they might have become. A chilling look at the darkest side of human nature, this is the most important and most personal book of Ann Rule's long career.19 hours, 22 minutes",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "Mystery",
    "History",
    "Biography"
  ],
  "author": "Ann Rule",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/6603899-green-river-running-red"
}