{
  "title": "Legacy: A Black Physician Reckons with Racism in Medicine",
  "description": "“Legacy is an illuminating and stirring journey of a book.” —Ibram X. Kendi, #1 New York Times- bestselling author of How to Be an AntiracistThe rousing, captivating story of a Black physician, her career in medicine, and the deep inequities that still exist in the U.S. healthcare systemGrowing up in Brooklyn, New York, it never occurred to Uché Blackstock and her twin sister, Oni, that they would be anything but physicians. In the 1980s, their mother headed an organization of Black women physicians, and for years the girls watched these fiercely intelligent women in white coats tend to their patients and neighbors, host community health fairs, cure ills, and save lives.What Dr. Uché Blackstock did not understand as a child—or learn about at Harvard Medical School, where she and her sister had followed in their mother’s footsteps, making them the first Black mother-daughter legacies from the school—were the profound and long-standing systemic inequities that mean just 2 percent of all U.S. physicians today are Black women; the racist practices and policies that ensure Black Americans have far worse health outcomes than any other group in the country; and the flawed system that endangers the well-being of communities like theirs. As an ER physician, and later as a professor in academic medicine, Dr. Blackstock became profoundly aware of the systemic barriers that Black patients and physicians continue to face.Legacy is a journey through the critical intersection of racism and healthcare. At once a searing indictment of our healthcare system, a generational family memoir, and a call to action, Legacy is Dr. Blackstock’s odyssey from child to medical student to practicing physician—to finally seizing her own power as a health equity advocate against the backdrop of the pandemic and the Black Lives Matter movement.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Medicine",
    "Science",
    "Race",
    "Medical"
  ],
  "author": "Uché Blackstock",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/66087028-legacy"
}