{
  "title": "Singled Out: How Singles Are Stereotyped, Stigmatized, and Ignored, and Still Live Happily Ever After",
  "description": "People who are single are changing the face of America. Did you know More than 40 percent of the nation's adults---over 87 million people---are divorced, widowed, or have always been single. * There are more households comprised of single people living alone than of married parents and their children. * Americans now spend more of their adult years single than married. Many of today's single people have engaging jobs, homes that they own, and a network of friends. This is not the 1950s---singles can have sex without marrying, and they can raise smart, successful, and happy children. It should be a great time to be single. Yet too often single people are still asked to defend their single status by an onslaught of judgmental peers and fretful relatives. Prominent people in politics, the popular press, and the intelligentsia have all taken turns peddling myths about marriage and singlehood. Marry, they promise, and you will live a long, happy, and healthy life, and you will never be lonely again. Drawing from decades of scientific research and stacks of stories from the front lines of singlehood, Bella DePaulo debunks the myths of singledom---and shows that just about everything you've heard about the benefits of getting married and the perils of staying single are grossly exaggerated or just plain wrong. Although singles are singled out for unfair treatment by the workplace, the marketplace, and the federal tax structure, they are not simply victims of this singlism. Single people really are living happily ever after.Filled with bracing bursts of truth and dazzling dashes of humor, Singled Out is a spirited and provocative read for the single, the married, and everyone in between. You will never think about singlehood or marriage the same way again.Singled Out debunks the Ten Myths of Singlehood, #1: The Wonder of Marrieds know best.Myth #3: The Dark Aura of You are miserable and lonely and your life is tragic.Myth #5: Attention, Single Your work won't love you back and your eggs will dry up. Also, you don't get any and you're promiscuous. Myth #6: Attention, Single You are horny, slovenly, and irresponsible, and you are the scary criminals. Or you are sexy, fastidious, frivolous, and gay.Myth #7: Attention, Single Your kids are doomed.Myth #9: Poor You will grow old alone and you will die in a room by yourself where no one will find you for weeks.Myth #10: Family Let's give all of the perks, benefits, gifts, and cash to couples and call it family values.\"With elegant analysis, wonderfully detailed examples, and clear and witty prose, DePaulo lays out the many, often subtle denigrations and discriminations faced by single adults in the U.S. She addresses, too, the resilience of single women and men in the face of such singlism. A must-read for all single adults, their friends and families, as well as social scientists and policy advocates.\"---E. Kay Trimberger, author of The New Single Woman",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Sociology",
    "Feminism",
    "Relationships",
    "Self Help",
    "Cultural"
  ],
  "author": "Bella DePaulo",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/66086.Singled_Out"
}