{
  "title": "The Good Girl's Guide to Getting Kidnapped",
  "description": "The Good Girl's Guide to Getting Kidnapped is about a Los Angeles girl named Michelle Pena, who's a westside foster child, and a straight A student, as well as a record-smashing track star -- who also happens to come from gang royalty, as her mother, Reina, is a powerful gang leader in Montebello, and her brother, Samson, also ruled his own club. Moreover, Michelle was the girlfriend of the most talented warrior in the city, Silver Mendoza, who promised to always be there for her, and always protect her. Michelle's destiny as a Montebello Princess, however, looked over when Reina and Samson both went to jail for robbery and drug crimes. Despite her love for Silver, she left the gang life, and didn't look back. She made a new life in Westchester, a tony suburb in L.A., with her foster dad, Frank Redman, and her new best friend, aspiring filmmaker Kiki Markson. Michelle was doing so well, in fact, that both she and Kiki were applying for scholarships to the best prep school in L.A., Yale Westview -- but then Michelle finds all her fine hopes derailed when she and Kiki get kidnapped by her brother's old gang, the Snakes, who bring them to a safehouse in Palm Desert; the Snakes are holding them as hostage for a drug debt that Samson still owes. The worst part is, Silver has transformed from her true love into a heartless soldier known as an \"Ice Blood,\" or \"Stone Cold;\" now having joined the Snakes after the tragic deaths of his family members, he's the one who tracks down Michelle and brutally snatches her and Kiki from the safety of the westside. He warns her that terrible things will happen to them if Samson doesn't pay -- they could be killed, or sold to another, even more vile drug lord, \"The Burner.\" Though Michelle can't believe how much Silver has changed, he explains that that's what you get when you abandon and betray a savage warrior who once loved you. During her and Kiki's two day ordeal, Michelle begins slipping back into her old identity, to Kiki's horror: Soon, she's pickpocketing, picking locks, seducing boys, dirty dancing, fighting, stealing cars, and wielding a volcanic temper. But in the end, it's Michelle's amazing speed as a runner that may provide their best chance for an escape. Yet Michelle has to face hard questions in the midst of all this terror: How far is she willing to go to get out of this mess alive, and if she does go to her dark side to defend herself against her attackers, will she ever be able to return to her safe life with Frank? And -- perhaps most pressing of all -- after all he's done to her, and after all they've been through, does she still love Silver?",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Realistic Fiction"
  ],
  "author": "Yxta Maya Murray",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/6609622-the-good-girl-s-guide-to-getting-kidnapped"
}