{
  "title": "Disillusioned: Five Families and the Unraveling of America's Suburbs",
  "description": "\"Astonishingly important.” —Alex Kotlowitz, The AtlanticThrough the stories of five American families, a masterful and timely exploration of how hope, history, and racial denial collide in the suburbs and their schoolsOutside Atlanta, a middle-class Black family faces off with a school system seemingly bent on punishing their teenage son. North of Dallas, a conservative white family relocates to an affluent suburban enclave, but can’t escape the changes sweeping the country. On Chicago’s North Shore, a multiracial mom joins an ultraprogressive challenge to the town’s liberal status quo. In Compton, California, whose suburban roots are now barely recognizable, undocumented Hispanic parents place their gifted son’s future in the hands of educators at a remarkable elementary school. And outside Pittsburgh, a Black mother moves to the same street where author Benjamin Herold grew up, then confronts the destructive legacy left behind by white families like his.Disillusioned braids these human stories together with penetrating local and national history to reveal a vicious cycle undermining the dreams upon which American suburbia was built. For generations, upwardly mobile white families have extracted opportunity from the nation’s heavily subsidized suburbs, then moved on before the bills for maintenance and repair came due, leaving the mostly Black and Brown families who followed to clean up the ensuing mess. But now, sweeping demographic shifts and the dawning realization that endless expansion is no longer feasible are disrupting this pattern, forcing everyday families to confront a truth their communities were designed to The suburban lifestyle dream is a Ponzi scheme whose unraveling threatens us all.How do we come to terms with this troubled history? How do we build a future in which all children can thrive?  Drawing upon his decorated career as an education journalist, Herold explores these pressing debates with expertise and perspective. Then, alongside Bethany Smith—the mother from his old neighborhood, who contributes a powerful epilogue to the book—he offers a hopeful path toward renewal. The result is nothing short of a journalistic masterpiece.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Sociology",
    "Social Justice",
    "Education",
    "Urbanism"
  ],
  "author": "Benjamin  Herold",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/66086937-disillusioned"
}