{
  "title": "What Happens in Vegas...",
  "description": "When Jackie took her little sister, Karen, for a joy ride into Necropolis without telling her where they were really going, she only meant to have a good time. Give her a little scare. A desolate shell of its former self, Sin City still holds a certain temptation for those who like to gamble. But when the residents of the city awaken, what happens in Vegas... well, you know the rest. \"Wilson is a dark force to be reckoned with.\"--Trent Zelazny, author of Destination Unknown and Fractal Despondency What Happens in Vegas... is a fast-paced short story set in the Empire of Blood series. The critically-acclaimed first novel from the series, Shining in Empire of Blood Book One, is currently available to read for free in the Kindle Owners Lending Library. Praise for Shining in \"A big-scale vampire thriller that changes the rules.\"--Scott Nicholson, author of Liquid Fear, The Red Church, and They Hunger \"One of the best surprises I've had in a long while. Writing with a smart, self-assured ease, Robert S. Wilson has given us a gift with Shining in Crimson. Part Underworld, part Escape From New York, Shining in Crimson is genuinely frightening, genuinely thrilling, but above all, first-rate storytelling. I'm a Robert S. Wilson fan from now on!\"--Joe McKinney, author of Flesh Eaters and Apocalypse of the Dead \"Robert S. Wilson shows a lot of promise here with this debut novel. Now it's time to see where that promise will take him.\"--Ray Wallace, The Chiaroscuro \"You'll not find some glistening torsos and smouldering eyes in this book. What you will find is a brilliantly thought out society of Vampires.\"--Jim Mcleod, Ginger Nuts of Horror \"The Mesh of Religious symbolism and political commentary tucked neatly between pure horror and suspense is superb.\"--Lisa Lane, The Cerebral Writer",
  "genres": [
    "Horror",
    "Short Stories",
    "Vampires"
  ],
  "author": "Robert S.  Wilson",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/12974187-what-happens-in-vegas"
}