{
  "title": "Sindustry II",
  "description": "Rentboys, strippers, hookers, and porn stars--these men are making a buck the hard way. This is Sindustry, where a quick fuck is more likely than a romantic kiss. But while they face the harsh light of reality every day, unexpected love finds them in all sorts of crazy ways. Take a look at Sindustry from the outside in, because for these guys, happily ever after is just around the corner. Package Boy by Connie Bailey When your clients include the most powerful mobsters in Jersey, discretion is a way of life--but for escort Celino Sansone, falling in love with Jacky Niccolo, heir apparent to the deCavalcante crime family, could be deadly for them both. Lino has made up his mind to let Jacky go for his own good when he overhears a client ordering a hit on his lover, and only help from a most unexpected source will get them both out alive. Dance for Me by Maria Albert Former marine Michael Carrick is working as a bouncer at a gay erotic dance club when he rescues a young man from an abusive leather daddy. Carlo insists he can earn his way at the club as a dancer, but the attraction that sparks between them may be too much like the past he's struggling to escape. Unorthodox Utopia by G.S. Wiley Chicago stylist Steve is having trouble making ends meet at his new salon, Utopia, so he takes a second job as a hair and makeup artist for a low-budget Internet pornography operation. Against his better judgement, he develops a crush on one of the actors. When Jeff confides in Steve about an abusive boyfriend, Steve makes it his mission to save Jeff from both the relationship and the porn industry. Leather Dancer by Andrew Grey Denny's been admiring the hot guy in his apartment building from afar, until a chance meeting at the Gay Erotic Expo reveals even more of Robbie than he'd imagined in his fantasies. Despite his friend Kye's encouragement and Robbie's job as a dancer in a leather club, Denny is determined to take things slow, convinced that Robbie could be much more than just a quick hookup. Corona & Lime by Sonia Devereaux When James, a quiet, mid-20-something who hasn't been in a relationship in nearly a year, says he doesn't want to be set up anymore, overzealous friend Kyle devises a foolproof plan to help James regain his confidence. Dragging him to a gay sports bar, Kyle arranges for a gorgeous younger man, Race, to hit on James and seduce him. Though James leaves with Race, he realizes that sleeping with a stranger won't solve anything. But Race isn't used to being turned down--especially not when he's been paid for his company. Sunshine by J.L. Merrow Everyone has secrets. For Rob, it's wanting to get closer to the rent boy he sees every night on his way home from work. But for Daniel, earnng money the only way he can, it's something far more serious. Night Moves by Patric Michael A cocky, self assured hustler discovers much more in life than just turning tricks when he goes on a date--a real date--with the shy, soft-spoken driver of the black pickup that's often cruised by his corner but never stopped. Until tonight. Wanting More by Cari Z. After a late-night rendezvous is interrupted by the partner of the man who hired him, stripper and high-end escort Alex Kidman can't get James Fitzgerald out of his head. So when James comes to watch him dance a few weeks later, Alex knows it's time to make his move--but James isn't comfortable with him if he isn't paying for his time. The Cowboy and the Movie Star by Kate Roman Cowboy Jake Ryder is unimpressed when his boss rents the ranch out to an adult movie crew, but that changes when he meets the angelic, delicate and lonely Matthew Dove. Jake can't get Matthew out of his mind, and a late-night encounter proves Matthew feels the same way. But the next morning, Matthew's back on the set, and Jake feels like an idiot. Can Matthew convince Jake that he wants to quit the business, or will Jake's cowboy stubbornness get in the way? The Meaning of Perfection by Taylor Lochland Felix and his friend Jack are male escorts who need a discreet place to bring their clients. Hotel owner Julian offers them a discount on rooms in return for Jack servicing him once a week, but it's Felix who wants that honor--he's fallen for Julian. See Me, Feel Me by Zahra Owens Demme's only dream was to be a professional dancer, but a back injury put an end to that. Kip is a massage therapist who gives great back rubs... and to Demme's considerable surprise, admits to rubbing other parts of his clients' anatomy as well. Exposure by Marguerite Labbe & Fae Sutherland Sebastian Case has been photographing naked male models for years, but he's never had a reaction like the one he does when Angelo \"Angel\" Ferrara steps onto his calendar shoot. Sassy and flirtatious, the young man was made to be in front of Sebastian's camera and under his control. Angel loves everything about modeling, from following the commands to being naked and naughty for the camera. And as the camera snaps, sparks between them ignite the set, adding a whole new angle to their lives.",
  "genres": [
    "M M Romance",
    "Anthologies",
    "BDSM",
    "Contemporary",
    "Romance",
    "LGBT",
    "Erotica"
  ],
  "author": "Anne Regan",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/6615518-sindustry-ii"
}