{
  "title": "The Complete Fairy Tales",
  "description": "A pumpkin is transformed into a coach. Bluebeard's young wife unlocks the door of the forbidden room. Children lost in the forest find shelter, but the house belongs to an ogre. These and many other scenes from the stories of Charles Perrault reach deep into the imagination and are never forgotten.  Now, in this scintillating new translation, the fairy tales of Perrault--stories that are known and loved around the world--are available in a beautiful gift edition. This superb translation by Christopher Betts exactly captures the tone and flavor of Perrault's world, and the delightful spirit of the originals. In addition to the classic prose tales--including The Sleeping Beauty in the Wood, Little Red Riding-Hood, Bluebeard, Puss in Boots, Cinderella, and Hop o' my Thumb--this new translation adds Perrault's tales in verse: a long poem on the subject of Patient Griselda; the notorious Donkey-Skin, often expunged from nineteenth-century collections; and the comic Three Silly Wishes.Bett's introduction deftly illuminates why in Perrault's hands these humble fairly tales have such great imaginative power, showing how they transmute into vivid fantasies the hidden fears and conflicts by which children are affected--fears of abandonment, conflicts with siblings and parents--and resolve so satisfactorily the problems experienced by children during the process of growing up. The volume also includes appendices on related tales and selected variants, a bibliography, chronology, and notes. With twenty-six stunning illustrations by Gustave Dore, an attractive ribbon marker, and colorful end papers, this wonderful collection of Perrault's fairy tales will make a delightful gift for children of any age.\"",
  "genres": [
    "Classics",
    "Fantasy",
    "Fairy Tales",
    "Fiction",
    "Short Stories",
    "France",
    "Childrens"
  ],
  "author": "Charles Perrault",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/6614115-the-complete-fairy-tales"
}