{
  "title": "Celluloid Strangers",
  "description": "Lovingly researched and written over the past decade, Celluloid Strangers tells the story of four brothers who have left their native northeast and converge in Los Angeles just after WWII ends. A lawyer, a mobster, a screenwriter, and a shopkeeper, each of these men makes a profound impact on the emerging landscape of postwar California as they deal with the impact that their shared history—and our nation’s history—has had upon them. Old Hollywood, studio era union struggles, and recreated House Un-American Activities Committee investigations into supposed communist subversion in the motion picture industry abound.Praise of Eric Wasserman’s novel Celluloid Strangers:\"Rich in detail, atmosphere, insight, and info. For readers who crave a thick slice of L.A. lore and Hollywood noir as tasty as James Ellroy—but without the hysterics—Celluloid Strangers will satisfy. Eric Wasserman conveys the kick and curse of history and the grit of real life, along with the arc of a dark fable. A big, wise novel to lodge in the head and the heart.\"—Wesley Strick, author of Out There in the Dark and screenwriter of Martin Scorsese's Cape Fear“Celluloid Strangers wonderfully evokes a time and place in American life: Los Angeles before and after the HUAC hearings, blacklistings, and betrayals. It is rich in the way good novels are rich—in character and in story—and while it tellingly reminds us of why Hollywood looms so large in our lives, it also movingly depicts the dark underside of glitz and glamour. Eric Wasserman is a splendid novelist who has constructed a unique, memorable tale.”—Jay Neugeboren, author of The Stolen Jew, 1940, and Before My Life Began“With his big, ambitious, richly historical, and compulsively readable first novel, Eric Wasserman has delivered a knockout punch of a book. Celluloid Strangers puts our obsession with Hollywood in precise and intimate terms. Readers will relish its deeply moving story and remember it long after the final pages have been turned.”—Frederick Reiken, author of Day For Night and The Lost Legends of New Jersey",
  "genres": [],
  "author": "Eric Wasserman",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/12974656-celluloid-strangers"
}