{
  "title": "Finding Your Own North Star: Claiming the Life You Were Meant to Live",
  "description": "New York Times bestselling author and Life Designs, Inc. creator Martha Beck shares her step-by-step program that will guide you to fulfill your own potential and create a joyful life.In this book, you'll start by learning how to read the internal compasses already built into your brain and body--and why you may have spent your life ignoring their signals. As you become reacquainted with your own deepest desires, you'll identify and repair any unconscious beliefs or unhealed emotional wounds that may be blocking your progress.This will change your life, but don't worry--although every life is unique, major transformations have common elements, and Beck provides a map that will guide you through your own life changes. You'll learn how to navigate every stage, from the first flickering appearance of a new dream to the planning and implementation of your own ideal life.Based on Dr. Beck's work as a Harvard-trained sociologist, research associate at Harvard Business School, instructor at Thunderbird Business School, and especially on her experiences with her clients over the last six years, Finding Your Own North Star offers thoroughly tested case studies, questionnaires, and exercises to help you articulate your core desires and act on them to build a more satisfying life.“Explorers depend on the North Star when there are no other landmarks in sight. The same relationship exists between you and your right life, the ultimate realization of your potential for happiness. I believe that a knowledge of that perfect life sits inside you just as the North Star sits in its unaltering spot.” -- Martha Beck",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Psychology",
    "Spirituality",
    "Inspirational",
    "Philosophy"
  ],
  "author": "Martha N. Beck",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/66140.Finding_Your_Own_North_Star"
}