{
  "title": "Against Theory: Literary Studies and the New Pragmatism",
  "description": "\"Against Theory,\" the title essay in this volume, challenges the notion that literary theory has any real work to do, or any results to show. This challenge—issued by Steven Knapp and Walter Benn Michaels in Critical Inquiry (8:4)—strikes some critics as scandalous, others as provocative and productive.The argument is directed against both sides of the current debates in literary theory, criticizing theoretical \"objectivists\" like E. D. Hirsch, Jr., on the one hand, and proponents of indeterminacy like Paul de Man on the other. The attack is not just on a particular way of doing theory but on the entire project of literary theory. The challenge is not only to a way of thinking and writing but to a way of making a living.The resulting controversy has drawn so much attention among literary critics that it has been collected in a single volume so that the debate can be followed from start to finish. This collection includes the essay \"Against Theory,\" seven responses to it, and a rejoinder by Knapp and Michaels (originally published in Critical Inquiry 9:4); in addition, there are two new statements plus a final reply by Knapp and Michaels.The debate chronicled in this volume raises the most fundamental issues in the theory of meaning and the practice of interpretation. Are Knapp and Michaels confronting literary theory with a new \"pragmatic\" form of theory? Or are they (as some of their respondents suggest) arguing for a new form of nihilism? \"If it is a nihilism,\" writes editor W. J. T. Mitchell, \"it is one that demands an answer, not easy polemical dismissal, one that calls for theory to clarify its claims, not to mystify them and the easy assurance of intellectual fashion and institutional authority.\" It is the intention of Against Theory to aid in that clarification.",
  "genres": [
    "Literary Criticism",
    "Philosophy"
  ],
  "author": "W.J. Thomas Mitchell",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/662010.Against_Theory"
}