{
  "title": "The Dispossessed Majority",
  "description": "Wilmot Robertson's The Dispossessed Majority, first published in 1972, is arguably the single most important underground bestseller ever published in contemporary America. No one who reads this all-encompassing study of the American predicament will ever again view his country in the same light. The author brilliantly recounts the tragedy of a great people, the Americans of Northern European descent, who founded and built the U.S. and whose decline is the chief cause of America's decline. Although replete with cogent criticism of the people and events which have decimated traditional American culture, the book ends on a positive, optimistic note, which envisions a resurgent American Majority liberating its institutions from the control of intolerant intellectuals innately programmed to destroy what they could never create. A must-have book for every majority member's intellectual arsenal! Over 100,000 copies sold. This last revised, updated, expanded edition (new condition) is available in limited stock, complete with index, bibliography, and more than 1,000 footnotes.______________NOW AVAILABLE AGAIN, the book that a prominent Richmond, Virginia lawyer loaned to U.S. Supreme Court Justice Lewis F. Powell, Jr. and urged him to read….The book that was suppressed by the book publishing trade….The book that retail book sellers refused to stock despite repeated customer demands….The book that prominent daily newspapers refused to advertise….The book that New York book publisher Devin Garrity rated as \"a major book under any circumstances…. It is a forthright defense of traditional Americanism. Instead of meekly accepting the assigned role of has-been, Wilmot Robertson, speaking for the majority 'thinks the unthinkable and says the unsayable,' as one reader puts it. And he does it in superb English prose.\"The book deemed too controversial for student access in public high school libraries….In an age in which the ratio of books about American population groups has been 1,000 to one in favor of ethnic minorities and against the majority, this landmark book represents the interests and concerns of America's European descendents is long overdue.",
  "genres": [
    "Politics",
    "History",
    "Race",
    "Nonfiction",
    "Philosophy",
    "American"
  ],
  "author": "Wilmot Robertson",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/6619732-the-dispossessed-majority"
}