{
  "title": "Vesuvius: A Biography",
  "description": "The volcano that has fascinated scientists, writers, and poets for two millenniaCapricious, vibrant, and volatile, Vesuvius has been and remains one of the world's most dangerous volcanoes. In its rage, it has destroyed whole cities and buried thousands alive. In its calm, its ashes have fertilized the soil, providing for the people who have lived in its shadows. For over two millennia, the dynamic presence of this volcano has fascinated scientists, artists, writers, and thinkers, and inspired religious fervor, Roman architecture, and Western literature. In Vesuvius , Alwyn Scarth draws from the latest research, classical and eyewitness accounts, and a diverse range of other sources to tell the riveting story of this spectacular natural phenomenon.Scarth follows Vesuvius across time, examining the volcano's destruction of Pompeii and Herculaneum in 79 A.D., its eruptions during the Counter-Reformation that were viewed as God's punishment of sinners, and the building of the world's first volcano observatory on Vesuvius in the 1840s. Scarth explores the volcano's current position overlooking a population of more than three million people and the complex attitudes maintained by the residents, at once reverent, protective, and fearful. He also considers the next major eruption of Vesuvius, which experts have indicated could be the most powerful since 1631. The longer Vesuvius remains dormant, the more violent its reawakening will be, and despite scientific advances for predicting when this might occur, more people are vulnerable than ever before.Exploring this celebrated wonder from scientific, historical, and cultural perspectives, Vesuvius provides a colorful portrait of a formidable force of nature.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Italy",
    "Geology",
    "European History",
    "Archaeology"
  ],
  "author": "Alwyn Scarth",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/6618533-vesuvius"
}