{
  "title": "Reswyt",
  "description": "In this spellbinding new paranormal fantasy novel, Sabine Jahn has more than an average teen's share of problems. She’s been forced to leave behind everything she knew growing up in Oregon to start high school as a transfer student in California. She’s lost her father to an automobile accident, and her grandfather, preeminent Egyptologist Daniel Jahn, has mysteriously disappeared. She hasn’t slept in months, and no one can tell her why. And now, as she sits in detention for dozing off in class again, she finds herself drifting from her Cameron High detention hall to a vast, eerie forest where immense astral wolves roam past her. Sabine has discovered a way to enter a realm where dreaming minds appear nightly as noble hawks, fierce wolves, and stalwart bears. She learns that the wild, beautiful world she has found is slowly becoming corrupted by the acts of a dead mind trapped within it. Now, the fate of that realm – and our own world – rests in the hands of Sabine, a long-dead French soldier, an Egyptian god, and a mysterious, profoundly gifted boy trapped between worlds.Nekhet, the thrilling sequel to Reswyt, is available April 6, 2012 in the Kindle Store.\"I loved Reswyt...maybe it’s the lit-fiction quality writing; maybe it’s the research that’s clearly gone into backdropping [the] novel...Maybe it’s the innate charm of protagonist Sabine Jahn, who’s not waiting to be swept off of her feet (although she very nearly is, and by very much the wrong person). Or maybe it was the fact that Mayer has the cojones to run some tried-but-true fantasy tropes in reverse...It’s all got a deliciously haunting, innovative quality to it that pulled me along to the end.\" - Rebecca Hardy, Bibliotica\"David Mayer is a storytelling genius! Not since the days of my first discovering E. Lynn Harris have I been sucked into an author’s world like this. This is a fresh take that we are offered in Reswyt; one part mysticism, one part adventure, one part heart tuggingly romantic storyline, Reswyt’s storyline is imaginative and thought provokingly deep all at once.\" - D.S. White, BookZone\"...a crisply written blend of vivid dreamworld fantasy, contemporary romance, and history. ...Reswyt is an entertaining and intelligent read with a plot that grips. It’s great to see the Kindle taking terrific novels like this away from mainstream publishers, and giving them the audience they deserve.\" - David Haden, KindleBlog\"...glimmering with delightful insight and historical detail...Egyptology opens the door to a magical dreamland in Mayer’s young adult fantasy novel.\" - Rebecca Cramer, Kirkus Reviews\"It takes a lot for someone to come up with an idea that is unlike anything else that has been written, and even harder for them to tell that story well. Reswyt is different - and an interesting read. Too often I start reading novels and the rest of the read is not finding out what happens, but just sticking with it to find out how it is all going to happen…but Reswyt kept me reading; the story and characters kept developing as it went on. Fantasy readers, fiction readers looking for an original story, and young adults will all enjoy this book.\" - Opening Lines\"Five stars! I highly recommend it!\" - Crystal Newman, The Kindle Book Review\"David Mayer is an accomplished storyteller that knows how to grab a reader and create enough intrigue and detail to keep the reader hooked to the last page.\" - Book Readers' Chronicle",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Young Adult"
  ],
  "author": "David  Mayer",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/12974951-reswyt"
}