{
  "title": "Return to Your First Love",
  "description": "The Return to Your First Love – an inspiring true story – ten years in the making, is a timely message that edifies, exhorts and encourages in times of uncertainty. Author Teresa Jones walks readers through decades of her life, and share valuable lessons that have been both beneficial as well as costly. Her life experiences will speak to anyone no matter the stage of life. Readers will be compelled and encouraged to seek a loving relationship with Jesus Christ. Love is desired by all, yet it eludes many…\tStart anew with the Source. \tGod stands at door of the heart and knocks. His hand extends toward His children to lead them in a loving, intimate relationship with Himself and others. No one has to live a life of defeat. Teresa Jones shares her remarkable story of overcoming life struggles that hinder many, including … v\tFamily Dysfunctionv\tLow Self-Esteemv\tTeen Peer Pressurev\tDating Pitfallsv\tSexual Immoralityv\tForgiving Self & Othersv\tMarital Problems v\tFinancial HardshipYou too can be victorious over these life struggles and more.Return to Your First Love is not the typical self-help/relationships book filled with anecdotes and quotes from experts. Readers are invited to sit in the front row to experience actual events that dig deep and expose carnality and misconstrued ideas about Christianity, which will in turn guide them to a path of true intimacy with God. There are many people that question whether or not God is real. Return to Your First Love is an inspirational story about one woman’s life that will give an atheist second thought. Author, Teresa R. Jones is a woman that has believed in God her entire life. She was a zealous for God has a child. However, as she embarks upon adulthood, she commences a part-time relationship with God to indulge in the lures of the world. As a result, she suffers the consequences of carnality. By the time Teresa reaches her late twenties, she is weary and battered by the struggles of the world and the instability of living a double life. At this defining moment in her life, she repents and embraces the close walk with God, she relished as a child. As a result, she experiences a vicissitude of blessings. Teresa’s life is not absent from trials in struggles, but as she continues to seek Jesus Christ, she grows and evolves and discovers that life is much sweeter. Author Teresa Jones walks readers through decades of her life, and share valuable lessons that have been both beneficial as well as costly. Her life experiences will speak to anyone no matter the stage of life. Return to Your First Love is a timely message that edifies, exhorts and encourages in times of uncertainty. Readers will be compelled and encouraged to seek a loving relationship with Jesus Christ.",
  "genres": [],
  "author": "Teresa R. Jones",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/6618961-return-to-your-first-love"
}