{
  "title": "The Patience Stone",
  "description": "“For far too long, Afghan women have been faceless and voiceless. Until now. With The Patience Stone, Atiq Rahimi gives face and voice to one unforgettable woman–and, one could argue, offers her as a proxy for the grievances of millions…it is a rich read, part allegory, part a tale of retribution, part an exploration of honor, love, sex, marriage, war. It is without doubt an important and courageous book.” from the introduction by Khaled Hosseini, author of The Kite Runner and A Thousand Splendid SunsIn Persian folklore, Syngue Sabour is the name of a magical black stone, a patience stone, which absorbs the plight of those who confide in it. It is believed that the day it explodes, after having received too much hardship and pain, will be the day of the Apocalypse. But here, the Syngue Sabour is not a stone but rather a man lying brain-dead with a bullet lodged in his neck. His wife is with him, sitting by his side. But she resents him for having sacrificed her to the war, for never being able to resist the call to arms, for wanting to be a hero, and in the end, after all was said and done, for being incapacitated in a small skirmish. Yet she cares, and she speaks to him. She even talks to him more and more, opening up her deepest desires, pains, and secrets. While in the streets rival factions clash and soldiers are looting and killing around her, she speaks of her life, never knowing if her husband really hears. And it is an extraordinary confession, without restraint, about sex and love and her anger against a man who never understood her, who mistreated her, who never showed her any respect or kindness. Her admission releases the weight of oppression of marital, social, and religious norms, and she leads her story up to the great secret that is unthinkable in a country such as Afghanistan. Winner of the Prix Goncourt, The Patience Stone captures with great courage and spare, poetic, prose the reality of everyday life for an intelligent woman under the oppressive weight of the Taliban regime in Afghanistan.",
  "genres": [
    "Fiction",
    "Asia",
    "War",
    "France",
    "Novels",
    "Contemporary",
    "Literature"
  ],
  "author": "Atiq Rahimi",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/6624282-the-patience-stone"
}