{
  "title": "Playing Easy to Get",
  "description": "New York Times bestselling author Sherrilyn Kenyon and rising stars Jaid Black and Kresley Cole unlock the pleasures and perils of embracing the boldest and most powerful of lovers -- 100% alpha males -- in three sensually erotic tales. Discover the physical rapture of his muscular arms.... Become a prisoner of passion, swept away by an encounter with his primal side.... And get lost in the all-consuming thrill of white-hot pursuit by a relentless stranger who may be your most dangerous foe, the best lover you've ever had -- or both. Let your fantasies run wild with these unforgettable novellas where bigger is most definitely better -- and playing easy-to-get is the only way to go!\"Turn Up The Heat\" / Sherrilyn KenyonThe story of an average woman who wins the vacation of a lifetime - a trip to Sex Camp. But what Allison George gets is a race for her life with an ex-Mafia who is now being sought by his previous employer. Vince Cappelleti knew the island was a risky proposition, but he'd run out of options. Now the only thing he wants in his sights is Allison, but in order to have a future with her, he must first deal with his past.\"Hunter's Oath\" / Jaid BlackWhat was supposed to be a simple taxi ride to Fairbanks, Alaska for Sofia Rowley ends up becoming a terrifying fight for her freedom. Sold by the cab driver to a mysterious man who imprisons her in a lost Viking world, Sofia is forced to stand all but naked on a bride auction block, her fate now in the hands of the highest bidder.\"The Warlord Wants Forever\" / Kresley ColeNikolai Wroth, a ruthless vampire general, will stop at nothing to find his Bride, the one woman who can “blood” him, making his heart beat and filling him with strength. Coldly interested only in the power his mate will bring, he can hardly believe when Myst the Coveted, his army’s new immortal captive, awakens him body -- and soul. Famed throughout the world as the most beautiful Valkyrie, Myst has devoted her life to protecting a magical jewel and to fighting the vampires.",
  "genres": [
    "Paranormal Romance",
    "Romance",
    "Paranormal",
    "Anthologies",
    "Vampires",
    "Erotica",
    "Fantasy"
  ],
  "author": "Sherrilyn Kenyon",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/6625.Playing_Easy_to_Get"
}