{
  "title": "Silver",
  "description": "\"There is a plague coming....For forty days and forty nights fear shall savage the streets. Those steeped in sin shall burn. The dying begins now\" With this chilling message a wave of terror unlike anything the world has ever seen sweeps the streets of Europe. Thirteen martyrs burn themselves alive in thirteen major cities simultaneously. And this is just the beginning. A religious cult calling itself the Disciples of Judas has risen in the Middle East. They twist the words of ancient prophecies to drive home the fear. Everything you believe in will be proved wrong. Everything you hold true will fail. Day by day the West wakes to increasingly harrowing acts of terror. As fear cripples the capitals of Europe, the only question is where will be the next to fall? London? Rome? Berlin? In a race against time - believing the terrorists intend to assassinate the Pope - Sir Charles Wyndham's unique Special Ops team, codename Ogmios, track a labyrinthine course through truth, shades of truth and outright lies that takes them from the backstreets of London to the shadow of Checkpoint Charlie in Berlin and all the way into the heart of the Holy See itself. \"The mix of history, suspense, and action in Silver perfect for those DaVinci Code fans looking for another electrifying read combining Biblical history with modern-day Armageddon.\"-- Douglas Preston, NYT Bestselling author of IMPACT and BLASPHEMY \"With Silver, Steven Savile delivers a barn storming tale of action, intrigue and suspense in a plot laced with ancient secrets and modern terror.\"-- Matt Hilton, author of the the Joe Hunter thrillers. \"Silver is the best thing since Forsyth's Day of the Jackal.\"-- Robert W. Walker, author of the RANSOM and INSTINCT series. \"Silver is a cracker of a thriller. Savile's in a league of his own\"-- Jeremy Duns, author of FREE AGENT and FREE COUNTRY. \"Reminiscent of James Rollins and David Morrell.\"-- Joseph Nassise, international bestselling author of the TEMPLAR CHRONICLES. \"Fascinating, gripping, horrific, tragic and compelling.\"-- Steve Alten, NYT Bestselling author of MEG and THE SHELL GAME \"SILVER is a wild combination of Indiana Jones, The Da Vinci Code, and The Omen.\"-- Kevin J Anderson, international bestselling author of THE SAGA OF SEVEN SUNS and co-author of PAUL OF DUNE",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Fantasy",
    "Adventure",
    "Science Fiction",
    "Suspense"
  ],
  "author": "Steven Savile",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/6621534-silver"
}