{
  "title": "Rising Road: A True Tale of Love, Race, and Religion in America",
  "description": "It was among the most notorious criminal cases of its day. On August 11, 1921, in Birmingham, Alabama, a Methodist minister named Edwin Stephenson shot and killed a Catholic priest, James Coyle, in broad daylight and in front of numerous witnesses. The killer's motive? The priest had married Stephenson's eighteen-year-old daughter Ruth to Pedro Gussman, a Puerto Rican migrant and practicing Catholic.Sharon Davies's Rising Road resurrects the murder of Father Coyle and the trial of his killer. As Davies reveals with novelistic richness, Stephenson's crime laid bare the most potent bigotries of the a hatred not only of blacks, but of Catholics and \"foreigners\" as well. In one of the case's most unexpected turns, the minister hired future U.S. Supreme Court Justice Hugo Black to lead his defense. Though regarded later in life as a civil rights champion, in 1921 Black was just months away from donning the robes of the Ku Klux Klan, the secret order that financed Stephenson's defense. Entering a plea of temporary insanity, Black defended the minister on claims that the Catholics had robbed Ruth away from her true Protestant faith, and that her Puerto Rican husband was actually black.Placing the story in social and historical context, Davies brings this heinous crime and its aftermath back to life, in a brilliant and engrossing examination of the wages of prejudice and a trial that shook the nation at the height of Jim Crow.\"Davies takes us deep into the dark heart of the Jim Crow South, where she uncovers a searing story of love, faith, bigotry and violence. Rising Road is a history so powerful, so compelling it stays with you long after you've finished its final page.\"--Kevin Boyle, author of the National Book Award-winning Arc of Justice\"This gripping history...has all the makings of a Hollywood movie. Drama aside, Rising Road also happens to be a fine work of history.\"-- History News Network",
  "genres": [
    "Nonfiction",
    "History",
    "Book Club",
    "Religion",
    "Catholic",
    "American History",
    "True Crime"
  ],
  "author": "Sharon Davies",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/6623283-rising-road"
}