{
  "title": "Little Shop of Horrors: Script and Lyrics",
  "description": "Little Shop of Horrors is a rock musical, by composer Alan Menken and writer Howard Ashman, about a hapless florist shop worker (Seymour) who nurtures a plant (Audrey II) and discovers that it's bloodthirsty and highly intelligent, forcing him to kill to feed it. The musical is based on the low-budget 1960 black comedy film The Little Shop of Horrors, directed by Roger Corman. The music, composed by Menken in the style of early 1960s rock and roll, doo-wop and early Motown, includes several well-known tunes, including the title song, \"Skid Row (Downtown)\", \"Somewhere That's Green\", and \"Suddenly, Seymour\". Author's Little Shop of Horrors satirizes many science fiction, \"B\" movies, musical comedy itself, and even the Faust legend. There will, therefore, be a temptation to play it for camp and low comedy. This is a great and potentially fatal mistake. The script keeps its tongue firmly in cheek, so the actors should not. Instead, they should play with simplicity, honesty, and sweetness-- even when events are at their most outlandish. The show's individual \"style\" will evolve naturally from the words themselves and an approach to acting and singing them that is almost child-like in its sincerity and intensity. By way of example, AUDREY poses like Fay Wray from time to time. But she does this because she's in genuine fear and happens to see the world as her private \"B\" movie--not because she's \"commenting\" to the audience on the stillness of her situation. Having directed the original New York production of LITTLE SHOP myself, and subsequently having seen it in many versions and even many languages, I can vouch for the fact that when LITTLE SHOP is at its most honest, it is also at its funniest and most enjoyable. -- Howard Ashman",
  "genres": [
    "Plays",
    "Theatre",
    "Musicals",
    "Drama",
    "Horror",
    "Fiction",
    "Science Fiction"
  ],
  "author": "Howard Ashman",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/662495.Little_Shop_of_Horrors"
}