{
  "title": "The Dead Hand: The Untold Story of the Cold War Arms Race and its Dangerous Legacy",
  "description": "The Dead Hand is the suspense-filled story of the people who sought to brake the speeding locomotive of the arms race, then rushed to secure the nuclear and biological weapons left behind by the collapse of the Soviet Union—a dangerous legacy that haunts us even today.The Cold War was an epoch of massive overkill. In the last half of the twentieth century the two superpowers had perfected the science of mass destruction and possessed nuclear weapons with the combined power of a million Hiroshimas. What’s more, a Soviet biological warfare machine was ready to produce bacteria and viruses to sicken and kill millions. In The Dead Hand, a thrilling narrative history drawing on new archives and original research and interviews, David E. Hoffman reveals how presidents, scientists, diplomats, soldiers, and spies confronted the danger and changed the course of history. The Dead Hand captures the inside story in both the United States and the Soviet Union, giving us an urgent and intimate account of the last decade of the arms race. With access to secret Kremlin documents, Hoffman chronicles Soviet internal deliberations that have long been hidden. He reveals that weapons designers in 1985 laid a massive “Star Wars” program on the desk of Soviet leader Mikhail Gorbachev to compete with President Reagan, but Gorbachev refused to build it. He unmasks the cover-up of the Soviet biological weapons program. He tells the exclusive story of one Soviet microbiologist’s quest to build a genetically engineered super-germ—it would cause a mild illness, a deceptive recovery, then a second, fatal attack. And he details the frightening history of the Doomsday Machine, known as the Dead Hand, which would launch a retaliatory nuclear strike if the Soviet leaders were wiped out. When the Soviet Union collapsed, the dangers remained. Soon rickety trains were hauling unsecured nuclear warheads across the Russian steppe; tons of highly-enriched uranium and plutonium lay unguarded in warehouses; and microbiologists and bomb designers were scavenging for food to feed their families. The Dead Hand offers fresh and startling insights into Reagan and Gorbachev, the two key figures of the end of the Cold War, and draws colorful, unforgettable portraits of many others who struggled, often valiantly, to save the world from the most terrifying weapons known to man.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "War",
    "Russia",
    "Military Fiction",
    "Audiobook"
  ],
  "author": "David E. Hoffman",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/6623920-the-dead-hand"
}