{
  "title": "The White Racial Frame: Centuries of Racial Framing and Counter-Framing",
  "description": "In this book Joe Feagin extends the systemic racism framework in previous Routledge books by developing an innovative concept, the white racial frame. Now four centuries-old, this white racial frame encompasses not only the stereotyping, bigotry, and racist ideology emphasized in other theories of \"race,\" but also the visual images, array of emotions, sounds of accented language, interlinking interpretations and narratives, and inclinations to discriminate that are still central to the frame's everyday operations.Deeply imbedded in American minds and institutions, this white racial frame has for centuries functioned as a broad worldview, one essential to the routine legitimation, scripting, and maintenance of systemic racism in the United States. Here Feagin examines how and why this white racial frame emerged in North America, how and why it has evolved socially over time, which racial groups are framed within it, how it has operated in the past and in the present for both white Americans and Americans of color, and how the latter have long responded with strategies of resistance that include enduring counter-frames.In this new edition, Feagin has included much new interview material and other data from recent research studies on framing issues related to white, black, Latino, and Asian Americans, and on society generally. The book also includes a new discussion of the impact of the white frame on popular culture, including on movies, video games, and television programs as well as a discussion of the white racial frame's significant impacts on public policymaking, immigration, the environment, health care, and crime and imprisonment issues.",
  "genres": [
    "Race",
    "Sociology",
    "Nonfiction",
    "Social Justice",
    "Anti Racist",
    "History",
    "Politics"
  ],
  "author": "Joe R. Feagin",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/6627906-the-white-racial-frame"
}