{
  "title": "The Shadow of Your Smile",
  "description": "In The Shadow of Your Smile, worldwide bestselling author Mary Higgins Clark weaves a spellbinding thriller revolving around a long-held family secret that threatens to emerge and take the life of an unsuspecting heiress.At age eighty-two and in failing health, Olivia Morrow knows she has little time left. The last of her line, she faces a momentous choice: expose a long-held family secret, or take it with her to her grave.Olivia has in her possession letters from her deceased cousin Catherine, a nun, now being considered for beatification by the Catholic Church—the final step before sainthood. In her lifetime, Sister Catherine had founded seven hospitals for disabled children. Now the cure of a four-year-old boy dying of brain cancer is being attributed to her. After his case was pronounced medically hopeless, the boy’s desperate mother had organized a prayer crusade to Sister Catherine, leading to his miraculous recovery.The letters Olivia holds are the evidence that Catherine gave birth at age seventeen to a child, a son, and gave him up for adoption. Olivia knows the identity of the young man who fathered Catherine’s child: Alex Gannon, who went on to become a world-famous doctor, scientist, and inventor holding medical patents.Now, two generations later, thirty-one-year-old pediatrician Dr. Monica Farrell, Catherine’s granddaughter, stands as the rightful heir to what remains of the family fortune. But in telling Monica who she really is, Olivia would have to betray Catherine’s wishes and reveal the story behind Monica’s ancestry.The Gannon fortune is being squandered by Alex’s nephews Greg and Peter Gannon, and other board members of the Gannon Foundation, who camouflage their profligate lifestyles with philanthropy.Now their carefully constructed image is cracking. Greg, a prominent financier, is under criminal investigation, and Peter, a Broadway producer, is a suspect in the murder of a young woman who has been extorting money from him.The only people aware of Olivia’s impending choice are those exploiting the Gannon inheritance. To silence Olivia and prevent Monica from learning the secret, some of them will stop at nothing—even murder.Clark’s riveting new novel explores the juxtaposition of medical science and religious faith, and the search for identity by the daughter of a man adopted at birth.",
  "genres": [
    "Mystery",
    "Fiction",
    "Suspense",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Adult"
  ],
  "author": "Mary Higgins Clark",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/6629816-the-shadow-of-your-smile"
}