{
  "title": "Reflections of Eden: My Years with the Orangutans of Borneo",
  "description": "From the first, it was an adventure. In 1971, at age twenty-five, Galdikas left the placid world of American academia for the remote jungles of Indonesian Borneo. Living with her husband in a primitive camp, she became surrogate mother to a \"family\" of ex-captive orangutans - and gradually adjusted to the blood-sucking leeches, swarms of carnivorous insects, and constant humidity that rotted her belongings in the first year. Her first son spent the early years of his life at Camp Leakey with adopted orangutans as his only playmates. The wild orangutans Galdikas studied and the ex-captives she rehabilitated became an extended family of characters no less vivid than her human companions. Throatpouch, a huge and irritable grouch, fought off rivals for the right to claim adolescent Priscilla as his mate. Handsome Cara at first tried to rid the forest of its human intruder by hurling dead branches at Galdikas from the canopy above. Little Sugito, rescued from a cramped cage and returned to the jungle claimed Galdikas as his mother and clung to her fiercely, night and day, for months. A groundbreaking chronicler of the orangutans' life cycle, Galdikas also describes the threats that increasingly menace the battles with poachers and loggers, the illicit trade in infant orangutans, the frustrations of official bureaucracy. Her story is a rare combination of personal epiphany, crucial scientific discovery, and international impact - a life of human and environmental challenge. Reflections of Eden is the third act of a drama that has captivated the the story of a pioneering primatologist, a world leader in conservation, and a remarkable woman.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Science",
    "Nature",
    "Biography",
    "Memoir",
    "Wildlife"
  ],
  "author": "Biruté M.F. Galdikas",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/662953.Reflections_of_Eden"
}