{
  "title": "Asylum: Inside the Closed World of State Mental Hospitals",
  "description": "For more than half the nation's history, vast mental hospitals were a prominent feature of the American landscape. From the mid-nineteenth century to the early twentieth, over 250 institutions for the insane were built throughout the United States; by 1948, they housed more than a half million patients. The blueprint for these hospitals was set by Pennsylvania hospital superintendent Thomas Story Kirkbride: a central administration building flanked symmetrically by pavilions and surrounded by lavish grounds with pastoral vistas. Kirkbride and others believed that well-designed buildings and grounds, a peaceful environment, a regimen of fresh air, and places for work, exercise, and cultural activities would heal mental illness. But in the second half of the twentieth century, after the introduction of psychotropic drugs and policy shifts toward community-based care, patient populations declined dramatically, leaving many of these beautiful, massive buildings--and the patients who lived in them--neglected and abandoned. Architect and photographer Christopher Payne spent six years documenting the decay of state mental hospitals like these, visiting seventy institutions in thirty states. Through his lens we see splendid, palatial exteriors (some designed by such prominent architects as H. H. Richardson and Samuel Sloan) and crumbling interiors--chairs stacked against walls with peeling paint in a grand hallway; brightly colored toothbrushes still hanging on a rack; stacks of suitcases, never packed for the trip home. Accompanying Payne's striking and powerful photographs is an essay by Oliver Sacks (who described his own experience working at a state mental hospital in his book Awakenings). Sacks pays tribute to Payne's photographs and to the lives once lived in these places, \"where one could be both mad and safe.\"",
  "genres": [
    "Nonfiction",
    "Photography",
    "History",
    "Psychology",
    "Mental Health",
    "Art",
    "Mental Illness"
  ],
  "author": "Christopher J. Payne",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/6633620-asylum"
}