{
  "title": "The C.J. Sansom Shardlake CD Box Set",
  "description": "This box set contains all four titles from the critically acclaimed and extremely popular historical crime fiction series by C. J. Sansom. Matthew Shardlake, lawyer and reformist in London during the reign of Henry VIII. His investigation skills are tested in four cases where both his life and the lives of others are threatened. In \"Dissolution\" he travels to Scarnsea Monastery where one of Thomas Cromwell's Commissioner has been brutally murdered. Shardlake must expose the killer but his inquiries soon force him to question everything he hears, and everything that he intrinsically believes. In \"Dark Fire\" Shardlake returns to London and a new assignment from Cromwell. The formula for Greek Fire, a legendary Byzantine weapon, is discovered by an official of the Court of Augmentations. Shardlake is sent to retrieve the formula but instead finds the official and his alchemist brother murdered and the formula missing. \"Sovereign\" takes Shardlake to York, following Henry VIII and his Progress to the North. The murder of a local glazier involves Shardlake in a mystery connected not only to a prisoner in York Castle but to the royal family itself. And in \"Revelation\" when an old friend is horrifically murdered Shardlake promises his widow to bring the killer to justice. His search leads him to connections with the dark prophecies of the Book of Revelation. Shardlake follows the trail of a series of horrific murders that shakes him to the core, and which are already bringing frenzied talk of witchcraft and a demonic possession - for what else would the Tudor mind make of a serial killer...? Praise for the series: 'Dissolution is a remarkable, imaginative feat. It is a first-rate murder mystery and one of the most atmospheric historical novels I've read in years' - \"Mail on Sunday\". 'One of the author's greatest gifts is the immediacy of his descriptions, for he writes about the past as if it were the living present' - Colin Dexter.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Historical",
    "Crime"
  ],
  "author": "C.J. Sansom",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/6634098-the-c-j-sansom-shardlake-cd-box-set"
}