{
  "title": "The Predictioneer's Game: Using the Logic of Brazen Self-Interest to See and Shape the Future",
  "description": "Bruce Bueno de Mesquita can predict the future. He is a master of game theory, a rather fancy name for a simple idea: when people compete with each other they always do what they think is in their own best interest. Bueno de Mesquita uses game theory to foretell - and even engineer - political, financial, and personal events. In fact, Bueno de Mesquita's forecasts, for everyone from the CIA to major companies, have an astonishing ninety per cent success rate. In this startling and revelatory book, he describes his methods and allows us to play along.Bueno de Mesquita explores the origins of game theory as formulated by John Nash, the Nobel Prize winner who became the subject of the film \"A Beautiful Mind.\" He has developed Nash's ideas to create a rigorous and pragmatic system of calculation that enables us to think strategically about what our opponents want, how much they want it, and how they might react to our every move.Bueno de Mesquita applies his methods to many of the most pressing issues of our day. He advises how best to contain the nuclear ambitions of Iran and North Korea. He shows how the Israeli-Palestinian conflict might be resolved. He explains how corporate fraud can be anticipated and prevented. He addresses climate change and international terrorism: their likely evolution and our most effective response.But, as Bueno de Mesquita makes clear, game theory isn't just for saving the world. It can also help in your own life - to succeed in a legal dispute, to advance your career or that of a colleague, and even to buy a car at the lowest possible price.Shrewd, provocative and original, \"Predictioneer\" will change your understanding of the world - both now and in the future. If life's a game, then Bruce Bueno de Mesquita is the one essential member of your team.",
  "genres": [
    "Nonfiction",
    "Economics",
    "Politics",
    "Psychology",
    "Business",
    "Science",
    "Mathematics"
  ],
  "author": "Bruce Bueno de Mesquita",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/6637965-the-predictioneer-s-game"
}