{
  "title": "من تاريخ الإلحاد في الإسلام",
  "description": "يعتبر هذا \"الكتاب واحداً من أهم الكتب العربية التي صدرت في هذا القرن، فالمؤلف فيلسوف بارز ومفكر رائد هو الدكتور عبد الرحمن بدوي، أما الصفحات فرحلة علمية شيقة تضيء أكثر الجوانب إظلاماً في تاريخنا الإسلامي، ألا وهو \"تاريخ الإلحاد في الإسلام\" من هنا تأتي أهمية هذا الكتاب، ومن هنا تبرز قيمته كبحث نادر يتحول في هدوء بين أروقة التاريخ كاشفاُ الأستار عن كثير من الحقائق والمواقف والشخصيات التي بقيت دائماً في طي الظلمة والنسيان، بل لعله الكتاب الأول الذي يناقش بمثل هذه الدقة وتلك الموضوعية ظاهرة \"الإلحاد في الإسلام\"، معتبرا لأصولها ومبرزاً لتطورها ودارساً لأهم أعلامها، بداية من الزنادقة الأوائل، وانتهاءً بعالم كابن حيان أو فيلسوف كابن بكر الرازي، فمن خلاله يتوضح للقارئ ما دار حول إعدام ابن المقفع وأسبابه الكامنة في زندقته، كما يعثر على شذرة لابن الرواندي أشهر ملاحدة الإسلام، لذا فالكتاب جمع مادته من هنا وهناك فجاء جامعاً شارحاً ومفسراً لتلك الظاهرة وتلك قيمته الكبرى.هذا هو الإلحاد، تلك النتيجة اللازمة لحالة النفس التي استنفدت كل إمكانياتها الدينية، فلم يعد في وسعها بعد أن تؤمن. بهذه الرؤية يفتتح الفيلسوف البارز والمفكر الرائد د.عبد الرحمن بدوي كتابه، وبهذه الكلمات يبدأ رحلته الشيقة التي تضيء أكثر الجوانب إظلاماً في تاريخنا الإسلامي، ألا وهو تاريخ الإلحاد في الإسلام. ويمضي الكتاب راصداً حركة الإلحاد، بدايةً من الزنادقة الأوائل وانتهاءً بأشهر الملاحدة كابن الراوندي وابن حيان والرازي، وهو في رصده لهذه الحركة يفسر أولاً خصوصية الروح العربية والإلحاد العربي، ثم يطرح بعد ذلك معنى \"الزندقة\" كاشفاً عن أصولها وعلاقتها بالمذهب \" المانوي\"، ثم ينتهي أخيراً إلى أعلام الإلحاد مُتتبعاً أطروحاتهم الفكرية المختلفة.الكتاب إذن يتحرك داخل المنطقة الملغومة المحاصرة، والتي كانت من ثم دائماً مجهولةً غامضةً في وعينا العربي، ولعل صدوره الآن يشكّل إضافة مهمة في ذلك المنعطف الخطير من تاريخنا المعاصر",
  "genres": [
    "History",
    "Religion",
    "Philosophy",
    "Islam",
    "Atheism",
    "Nonfiction",
    "Humanities"
  ],
  "author": "عبد الرحمن بدوي",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/6637613"
}