{
  "title": "A Land Beyond Ravens",
  "description": "Mysterious dreams. A lost grail. Secret hoards of wealth. A country ruined by lies and betrayal.And one brief, shining chance to build a golden kingdom . . . No one in 5th century Britain knows more secrets than master spy Marcus ap Iorwerth, and that makes him a dangerous man. It also makes him a hunted one. For nearly three decades he has manipulated stubborn, irascible kings and warlords in a quest to not only unite them against foreign invasion but to stop them from destroying each other as well. And along with his beloved wife Claerwen, he has followed a greater, even more perilous pursuit-to forge a clear path for the fulfillment of Merlin the Enchanter's famed prophecy that one day a great king will take command, the king known as Arthur of the Britons.Now, with Arthur at last on the brink of adulthood and already showing great promise as a leader, Marcus discovers that the emerging Christian church is gaining enough power to dangerously shift control of Britain. At the same time Claerwen, gifted with second sight, is plagued with strange dreams that connect inexplicable doom to both Arthur and a long lost grail sacred to Britain's high kings. As foreboding mounts, Marcus struggles to prevent the church from crushing Arthur's chances of becoming an effective king. But how he goes about it sets up the very doom that Claerwen sees. Will she be able to stop him? Or will her visions send Marcus to his own doom as well?A Land Beyond Ravens is a tale filled with haunting memories, honor, courage, and dreams lost and won. Interweaving the history of Dark Age Britain with its mystical Celtic roots and Arthurian legend, it is the compelling final chapterof the multi-award winning Macsen's Treasure Series that includes Into the Path of Gods, In the Shadow of Dragons and The Anvil Stone.",
  "genres": [
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Kathleen Cunningham Guler",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/6640213-a-land-beyond-ravens"
}