{
  "title": "تحقيق ما للهند من مقولة مقبولة في العقل أو مرذولة",
  "description": "أهم وأوسع كتاب وصلنا في وصف عقائد الهندوسيين، وشرائعهم وعاداتهم في أنكحتهم وأطعمتهم وأعيادهم، ونظم حياتهم، وخصائص لغتهم. ورأى فيه بروكلمان (أهم ما أنتجه علماء الإسلام في ميدان معرفة الأمم). ألفه البيروني على فترات متباعدة، وفرغ منه في محرم سنة 423هـ بعد عام ونصف من وفاة السلطان محمود الغزنوي. وكان قد صحبه ثلاث عشرة مرة في غزواته للهند، أتيح له فيها أن يحيط بعلوم الهند، ويقرأ أسفارها ويخالط علماءها. وقد ألفه كما يقول على سبيل الحكاية، من غير رد ولا حجاج، وبناه على ثمانين باباً. قال: (ففعلته غير باهت على الخصم، ولا متحرج من حكاية كلامه، وإن باين الحق، فهو اعتقاده وهو أبصر به، وليس الكتاب كتاب حجاج وجدل، وإنما هو كتاب حكاية، فأورد كلام الهند على وجهه). وفيه قوله بعدما ذكر ما امتازت به الوثنية اليونانية من فلاسفة قاموا بتنقيح الأصول الخاصة دون العامة: (ولم يك للهند أمثالهم ممن يهذب العلوم، فلا تكاد تجد لذلك لهم خاص كلام إلا في غاية الاضطراب وسوء النظام، ومشوب في آخره خرافات العوام، مع تكثير العدد، حتى إني لا أشبه كتبهم في الحسابات والنجومية من جهة المعاني ومن جهة النظم والترتيب إلا بدر مختلط ببعر..إلخ) وعقد فصلاً طويلاً للكلام على عقيدة التناسخ عندهم، وأفاد: أن الإيمان بالتناسخ شعارالنحلة الهندية كما أن كلمة التوحيد شعار الإسلام، وكلمة التثليث شعار النصرانية. ونقل عن كتاب (باتنجل) خبر من كان يعتقد التوحيد من الهنود، وقواعدهم الثمان. وفي الكتاب شواهد عديدة تدل على تمكنه من ناصية اللغة السنسكريتية، وهو يصفها بأنها تشابه العربية في تسمية الشيء الواحد بعدة أسام، ووقوع الاسم الواحد على عدة مسميات، إلا أنها مركبة من حروف لا تكاد ألسنتنا ولهواتنا تنقاد لإخراجها. ولم يكن لأوربا اهتمام يذكر بالبيروني، فكان أول من نبه إلى أهميته المستشرق نيكولاس دي فانيكوف عام 1866م وتلاه الألماني ساخاو، الذي ترجم إلى الألمانية كتابه: (الآثار الباقية) سنة 1879م وفي عام (1887م) أصدر كتابه (تحقيق ما للهند) في (328) صفحة من القطع الكبير، معتمداً نسخة نقلت سنة (554هـ) عن نسخة المؤلف، وبعد عام، أصدر في لندرة ترجمة للكتاب باللغة الإنكليزية، واشتهر الكتاب في أوروبا بعنوان (تاريخ الهند). وفي عام (1913) تأسست لجنة البحث عن مؤلفات البيروني. وترجم الكتاب إلى الروسية ونشر في المجموعة المختارة في طشقند 1963مالمصدر: موقع الوراق الإلكتروني http://www.alwaraq.net/",
  "genres": [
    "History",
    "India",
    "Nonfiction",
    "Islam",
    "Travel",
    "Classics",
    "Medieval"
  ],
  "author": "Abu Rayhan al-Biruni",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/6638141"
}