{
  "title": "تخريج الدلالات السمعية على ما كان في عهد رسول الله صلى الله عليه وسلم من الحرف والصناعات والعمالات الشرعية",
  "description": "النيل والفرات:مؤلف هذا الكتاب هو علي بن محمد بن سعود الخزاعي -ويكنى أباً الحسن وأحياناً أبا السعود- من أسرة أندلسية عرفت بالفقه والعلم. تلقى علي دراسته في تلمسان فدرس على شيوخها وفي مقدمتهم العالم التلمساني الكبير أبو عبد الله ابن مرزوق (781) وله منه إجازة، ومن شيوخه أيضاً محمد بن أبي بكر البلفيقي الشهير بابن الحاج (741).ومهما يكن من شيء فإن نشأته الثقافية كانت تؤهله للكتابة في الديوان، فقد عرف بمهارته في الحساب. وكان حسن التحصيل في الأدب والنحو واللغة، هذا إلى إلمام بفروع الفقه والحديث وقدرة على نظم الشعر. وكان أيضاً معروفاً بجودة الخط، وكل هذه الوسائل الثقافية أعدته ليكون صاحب الأشغال السلطانية، تلك \"الوظيفة\" التي تشبه أن تكون وراثية في أسرته، لأنها تعتمد كثيراً على الشؤون الحسابية، ولعله اعتمد في إتقانها على والده قبل أي شيخ آخر، ولعله من أجل ذلك لم يتبحر في علم بعينه، ولم يكتب له البروز في اتجاه علمي محدد.ذلك مبلغ ما نعرفه عن ثقافته، فأما ما يتعلق بأبرز صفاته فلم يميز منها مترجموه إلا أنه كان مبسوط الكف سخاء. وقد عاش علي حتى ناهز الثمانين، إذ كانت وفاته يوم الأحد الخامس من ذي القعدة سنة 789، ودفن من غده يوم الاثنين بمدينة فاس.لم تكن الأعمال الديوانية ومشاغلها الكثيرة المتلاحقة تمنح علي بن محمد الخزاعي سعة من الوقت كي يتوفر على التأليف، ويبدو أنه أعفى من تلك الأعباء وهو في سن السادسة والستين أو قريباً من ذلك. وهو يصرح في مقدمة \"تخريج الدلالات\" أنه كان يلتقط الفوائد ويقتنص الشوارد التي سيبني منها كتابه أيام عزلته عن العمل، وأنه استمر يجمع ويرتب ويبوب حتى انتهى من ذلك سنة 786، وإذا به ينهي عملاً طويلاً شاقاً يسميه \"تخريج الدلالات السمعية على ما كان في عهد رسول الله صلى الله عليه وسلم من الحرف والصنائع والعمالات الشرعية\". وفي ربيع الأول من ذلك العام تولى السلطنة أبو فارس موسى بن المتوكل على الله المريني، فقدم الخزاعي كتابه هدية إليه.ويختصر المؤلف السبب الذي حدا به إلى تأليف كتابه بأنه رأى كثيراً ممن لم ترسخ في المعارف قدمه، وليس له من أدوات الطالب إلا مداده وقلمه، يظنون أن تولي الأعمال السلطانية بدعة، وأنها بدعة تجرّ على صاحبها الإثم، وأنه كان من الأجدر به الترفع عنها، وتبدياً لهذا الجهل جمع مادة كتابه ليثبت أن \"العمالات الشرعية\" ليست شيئاً مستحدثاً، وإنما هي خطط وجدت أيام الرسول، وتولاها كثير من الصحابة، فمن تولاها من بعد لم يخرج عن النهج المرضين بل إنه ليحرز الشرف الكبير لأنه يجد نفسه واقفاً في ركب صحابي جليل، وكذلك يقال أيضاً في أصحاب الحرف والصنائع، فإن أي قارئ لهذا الكتاب سيجد الحقيقية الصادقة التي تزيل عن أصحاب الخطط وأصحاب الحرف وصمة البدعة.وقد قسم الخزاعي كتابه في عشرة أجزاء: ثمانية منها في العمالات وواحد في الحرق والصناعات وباب ختامي، وانقسمت الجزاء العشرة في 178 باباً، وتبدو دقة المؤلف في هذا الترتيب الذي سار عليه في كتابه، في ألأجزاء والأبواب والفوائد، وتوزيعه للمادة في مواضعها. وتتجلى دقته في الإحالة على مصادره، وفي ذكر قائمة منها في آخر فصل من فصول كتابه، بحيث نقول إن الخزاعي يحترم النص ويعامله بأمانة، وقد جعل منهجه في كتابه أن يتحدث عن الخطة أو عن جانب منها في فصل من الفصول معتمداً على ما جاء في كتب الحديث بخاصة، ثم يعقد فصلاً تالياً للترجمة لمن تولوا تلك الخطة معتمداً في ذلك كتاب الاستيعاب لابن عبد البر في الأغلب.ثم إنه يبين ما يحتاجه القارئ من فوائد لغوية، ومراجعه في هذه الناحية كثيرة في طليعتها الصحاح للجوهري والمحكم لابن سيده وديوان الأدب للفارابي وكتب الأفعال والمخصص لابن سيده... الخ. تلك المصادر، فإذا كان الأمر يتعلق بشرح ألفاظ الأحاديث أحال على المشارق للقاضي عياض وعلى غيره مما يتصل بهذا الباب، وبهذا التخطيط الدقيق للكتاب لم يبق المؤلف مجالاً للمحقق، إلا مجالاً ضيقاً، في الشرح والتوضيح، ولكنه يكلف المحقق جهداً بالغاً في تتبع المصادر المعتمدة، والمقارنة والتأكد من مدى الصحة في المنقولات.وقد أفاد المؤلف كثيراً من خبرته في توليه ديوان العساكر مدة طويلة، ولذلك جاء الجزء الخامس وهو في العمالات الجهادية من أكبر الأجزاء إذ احتوى من الأبواب على خمسة وأربعين جمعت جميع الجوانب المتصلة بمهمات الحرب. وتعد الأجزاء: الرابع في العمالات الأحكامية، والسادس في العمالات الجبائية من أهم الأبواب مع الخامس في تبيان \"تركيب\" الدولة في عهد الرسول والخلفاء الراشدين. أما الباب الخاص بالحرف والصناعات (وهو التاسع) فإنه مكمل لتصور المجتمع الإسلامي بالإضافة إلى تصور بناء الدولة، ولكنه خارج عن غرض المؤلف في إزالة البدعة التي تلصق بأصحاب الخطط السلطانية، فلا أحد يقول إن بيع الطعام أو القيام بالنسج أو البناء أو الصيد أو الطبخ بدعة، وهذه الحرف لم تبدأ على عهد الرسول، وإنما هي حصيلة الحاجة والاجتماع الإنسانيين. ثم يقف المؤلف مدافعاً عن مثل هذه الحرف بما يورده من أحاديث وآثار.",
  "genres": [],
  "author": "علي بن محمد الخزاعي",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/6640256"
}