{
  "title": "Our Molecular Future: How Nanotechnology, Robotics, Genetics and Artificial Intelligence Will Transform Our World",
  "description": "In 2002, this book accurately forecasted what's happening today.Amazon customers were right when they and New Scientist magazine praised the foresight of Our Molecular Future . Today, our world is being transformed by what Douglas Mulhall forecasted. Read it to see what's coming next.       What Alvin Toffler's Future Shock was to the 20th century, Our Molecular Future is proving to be to the 21st. Douglas Mulhall foresaw what is happening today to our jobs, health care, and investments as the molecular revolution gains speed. He described how the convergence of A.I., nanotechnology, genetics, and robotics would drive changes faster than most imagined.         In 2002, he accurately forecasted technologies that can deflect asteroids with satellites (achieved in 2022), cars and clothes that can change color (already in use), and exotic products built in our own desktop factories (already in use). On the way are the machines that he predicted will scour arteries to prevent heart disease (in preclinical development today),       Our Molecular Future , envisaged how this technological convergence would start to transform our environment AND ourselves simultaneously. It vividly depicted how disruptions caused by climate and other environmental extremes could be addressed with the kind of disruption being caused by A.I. bots today. Using disruption to solve disruption.       Mulhall argued that while technology was making fantastic leaps, we'd also encounter surprises that threaten climate changes, large earthquakes & tsunamis, as well as the discovery of asteroid collision risks. However, he stressed that these are not the nightmare scenarios of sensationalists, nor are some of them human induced. Instead, they may be part of nature's cycle - recurring more often than we've thought possible.       Nor was Mulhall blindly optimistic. He carefully described the huge risks, but still argued that this convergence of technological transformation and catastrophic natural threats may work to our advantage, if we're smart (which is open to debate as he says). He lays out a plan for how we can use molecular machines to survive and prosper in the face of nature's worst extremes. His visionary link between future technology and coping with cyclical natural disasters is a guide for everyone who wants to prepare for the rest of the 21st century.        As the first author to explore The Singularity in this way, Mulhall connects two great trends of our time - Artificial Intelligence and environmental extremes. The solutions he envisaged years ago are more relevant today than ever before. As a recent Amazon customer posted in 2022 - \"This book...is still a valuable mind opener about how much emerging technologies can and will affect our lives...I thank the author for pointing me towards new horizons to explore.\"      You'll also see how a Publishers' Weekly reviewer got it wildly wrong when the book's forecasts of ubiquitous desktop fabricators and autonomous robots were dismissed as \"musings [that] seem more science fiction than science.\" Where are we now?     At a minumim the book is an invaluable collector's item for remembering the past into the future. At its best, it offers a vast array of insights into where we go from here.",
  "genres": [
    "Science"
  ],
  "author": "Douglas Mulhall",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/664068.Our_Molecular_Future"
}