{
  "title": "When Victims Become Killers: Colonialism, Nativism, and the Genocide in Rwanda",
  "description": "\"When we captured Kigali, we thought we would face criminals in the state; instead, we faced a criminal population.\" So a political commissar in the Rwanda Patriotic Front reflected after the 1994 massacre of as many as one million Tutsis in Rwanda. Underlying his statement is the realization that, though ordered by a minority of state functionaries, the slaughter was performed by hundreds of thousands of ordinary citizens, including even judges, human rights activists, and doctors, nurses, priests, friends, and spouses of the victims. Indeed, it is its very popularity that makes the Rwandan genocide so unthinkable. This book makes it thinkable.Rejecting easy explanations of the genocide as a mysterious evil force that was bizarrely unleashed, one of Africa's best-known intellectuals situates the tragedy in its proper context. He coaxes to the surface the historical, geographical, and political forces that made it possible for so many Hutu to turn so brutally on their neighbors. He finds answers in the nature of political identities generated during colonialism, in the failures of the nationalist revolution to transcend these identities, and in regional demographic and political currents that reach well beyond Rwanda. In so doing, Mahmood Mamdani usefully broadens understandings of citizenship and political identity in postcolonial Africa.There have been few attempts to explain the Rwandan horror, and none has succeeded so well as this one. Mamdani's analysis provides a solid foundation for future studies of the massacre. Even more important, his answers point a way out of a direction for reforming political identity in central Africa and preventing future tragedies.",
  "genres": [
    "History",
    "Africa",
    "Nonfiction",
    "Rwanda",
    "Politics",
    "Anthropology",
    "War"
  ],
  "author": "Mahmood Mamdani",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/66419.When_Victims_Become_Killers"
}