{
  "title": "Brick Lane",
  "description": "Text is in Swedish. Monica Ali's gorgeous first novel is the deeply moving story of one woman, Nazneen, born in a Bangladeshi village and transported to London at age eighteen to enter into an arranged marriage. Already hailed by the London Observer as \"one of the most significant British novelists of her generation,\" Ali has written a stunningly accomplished debut about one outsider's quest to find her voice. What could not be changed must be borne. And since nothing could be changed, everything had to be borne. This principle ruled her life. It was mantra, fettle, and challenge. Nazneen's inauspicious entry into the world, an apparent stillbirth on the hard mud floor of a village hut, imbues in her a sense of fatalism that she carries across continents when she is married off to Chanu, a man old enough to be her father. Nazneen moves to London and, for years, keeps house, cares for her husband, and bears children, just as a girl from the village is supposed to do. But gradually she is transformed by her experience, and begins to question whether fate controls her or whether she has a hand in her own destiny. Motherhood is a catalyst -- Nazneen's daughters chafe against their father's traditions and pride -- and to her own amazement, Nazneen falls in love with a young man in the community. She discovers both the complexity that comes with free choice and the depth of her attachment to her husband, her daughters, and her new world. While Nazneen journeys along her path of self-realization, her sister, Hasina, rushes headlong at her life, first making a \"love marriage,\" then fleeing her violent husband. Woven through the novel, Hasina's letters from Dhaka recount a world of overwhelming adversity. Shaped, yet not bound, by their landscapes and memories, both sisters struggle to dream -- and live -- beyond the rules prescribed for them.",
  "genres": [
    "Fiction",
    "India",
    "Book Club",
    "Contemporary",
    "Literary Fiction",
    "Bangladesh",
    "Novels"
  ],
  "author": "Monica Ali",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/6641893-brick-lane"
}