{
  "title": "Apaches",
  "description": "Remember these names: Boomer. Dead-Eye. Pins. Geronimo. Reverend Jim. Mrs. Columbo. They were great cops. The best cops. But they are cops no more.            Now they are apaches--a renegade unit working on their own.                      With this novel, the author of the stunning #1 bestseller Sleepers returns to the mean streets he knows so well. And in doing so, he has written his most explosive, electrifying, and startling book yet.                      It is the early 1980s. Crack cocaine has made its devastating appearance. Violence is escalating and so is an unnerving lack of morality. Things are happening that have never happened before. One of those things is the brutal kidnapping of an innocent 12-year-old girl. But the kidnapper has made a deadly mistake. He has brought Boomer Frontierie back to life, back to the streets. And back into action. A New York City detective forced to retire after being wounded in a drug bust, Boomer thirsts to return to the life he loved--the life of a cop. When an old friend turns to him for help, Boomer has the excuse he needs. And when the simple kidnapping turns into something more, something much more evil, even more horrifying, Boomer realizes that he can once again find a way to serve justice. There are others like Boomer. Cops who can no longer be cops. He brings them together, bringing them back to life as well. Even as they face almost certain death. Apaches is the story of an extraordinary band of cops. Some might call them criminals. Some might call them heroes. But theirs is a world where good is always shadowed by bad, where right is almost indecipherable from wrong, and where the living can, within mere moments, cross over to the world of the dead.        Lorenzo Carcaterra has written the most exciting novel of the year. Like Sleepers, it is a book that will never be forgotten.From the Hardcover edition.",
  "genres": [
    "Crime",
    "Thriller",
    "Fiction",
    "Mystery",
    "Suspense",
    "New York",
    "Action"
  ],
  "author": "Lorenzo Carcaterra",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/66407.Apaches"
}