{
  "title": "Red Chaser: A noir thriller of the 1950s, the cold war and the Brooklyn Dodgers",
  "description": "Jake would try.You'd know the names of these real-life celebs who were hush-hush Commies in the 1950s.They were on a secret list kept by the most beautiful Commie of the day. Joe McCarthy hired Jake to do one thing—steal that list.Jake McHenry spent five years in Germany after Hitler’s War, coming home rich with ill-gotten Nazi treasure.Back in Brooklyn, he becomes a private detective because he needed a pretend job to hide the source of his riches. Mostly he went to most Brooklyn Dodgers games at Ebbets Field and drank beer.Then Joe McCarthy enters the picture. McCarthy wants Jake to steal that secret list of celebrity American communists from the Ice Queen, a rich high-society Commie. The list features famous celebs like Orson Welles, Charlie Chaplin, and Edward G. Robinson.It’s easy for Jake to break into the Ice Queen’s brownstone in Manhattan and steal the list. However, the theft unleashes a wild flurry of Russians, North Koreans, J. Edgar Hoover, mobsters, and the most beautiful woman Jake had ever seen in a chase for the list.There's nothing like being young, handsome, and a private detective in Brooklyn in the Spring of the year.In the background is the greatest pennant race in the history of Major League Baseball. It’s 1951, and the New York Giants chase the Brooklyn Dodgers for the National League Pennant. That’s the year that Bobby Thompson hit the “shot heard ’round the world.”The pennant—and Jake’s life—comes down to the last inning and the last pitch at the Polo Grounds in New York City on Wednesday, October 3, 1951.If you’re a fan of historical fiction, then you’ll love this adventure into the 1950s because of the grit of Brooklyn, the historical figures, and the mystery that keeps you guessing.When you think you’ve figured it all out, you’ll find a surprise or two that snuck up on you. Have fun reading Red Chaser today.***** “If you are a fan of high-action espionage thrillers, you will eat this one up! Full of 1950’s tough guys and dames, this mystery/thriller is mostly set in the borough of Brooklyn!”***** “I love private eye books and this one delivered. There is excitement, intrigue, murder, sex, mystery, all the things that make up a good detective story.” *****” Throughout the book I questioned whether it was fiction or non-fiction. I would call it “embellished” non-fiction, with facts and fiction being wonderfully interwoven.”Being a private detective in Brooklyn in 1951 was good for Jake’s soul. Reading about it today just might soothe your soul or at least make you smile. Try it out today.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Espionage",
    "Thriller",
    "Noir",
    "Historical"
  ],
  "author": "Jon Spoelstra",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/6641733-red-chaser"
}