{
  "title": "Secrets Volume 12",
  "description": "Saskia Walker - Summer LightningSculptress Sally Richards is in heaven spending an idyllic getaway on a secluded cove, and then she spots a gorgeous Adonis walking naked on the beach. What more inspiration does a girl need? When Julian Keswick finds an attractive woman shacked up in his cove, it's his manly duty to check her out. But what will Julian do when he finds that she’s secretly been using him as a model?To My Picture you’re totally alone and enjoying the summer sun on an isolated beach. What would make it even better for you—seeing a gorgeous hunk walking naked in the waves? And if he arrived at your door in the middle of a storm, offering to help you out of a fix? Well, what’s a girl to do…Jess Michaels - Aphrodite's PassionWhen Selena Kelsey flees Victorian London just before her evil stepchildren can institutionalize her for hysteria, Gavin Fletcher is asked to bring her back home. Feeling beholden to the family, he agrees. But when he finds her living on the island of Cyprus with a group who worship Aphrodite (the Greek goddess of sensuality and sex), his need to have her begins to block out every other impulse, including duty and even personal safety.To My When I read about the ancient cults who worshipped the goddess Aphrodite, I knew immediately that there was an erotic, romantic story there. I hope you enjoy Gavin and Selena’s journey through passion, duty and ultimately, love.For Michael, who is everything I ever wanted, and everything I never knew I needed. Leigh Wyndfield - White HeatRaine has spent the last few years avenging her murdered team, but the cost has been high. She’s hiding in an icehouse in the middle of nowhere from one of the scariest men in the universes. Walker escapes from a burning prison, staggering to safety. Imagine their surprise when they find out they have the same man to blame for their miseries. Passion, revenge and love are in their future.To My On an ice planet in the middle of nowhere, two loners who never should have met find each other. One has decided to stop running. The other has just started…Dominique Sinclair - Good Girl Gone BadRaised a good girl, Reagan’s dreams are finally within reach. First she needs a topic for a four-segment article. Setting out to do research, nothing could have prepared Reagan for Luke, or his offer to teach her everything she needs to know about sex. Fighting the inner good girl, Reagan explores being bad under Luke’s guidance. Licentious pleasures, forbidden desires… inspiring the best writing she’s ever done. Only now women across America are reading about Reagan and Luke’s encounters. And he has no idea…To My When a man comes along who makes you want, makes you crave… When a man comes along who is everything you secretly desire, everything you secretly need… When a man comes along, go. Willingly, wantonly. Let there be no regret. Let there be seduction. Let there be love.",
  "genres": [
    "Erotica",
    "Anthologies",
    "Romance",
    "Erotic Romance",
    "Novella"
  ],
  "author": "Saskia Walker",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/6641106-secrets-volume-12"
}