{
  "title": "The Night Monster",
  "description": "The shadowy side of the Sunshine State, where blood runs cold even in the tropical heat, is the tantalizing, terrifying territory few know better than James Swain. His razor-sharp tales of criminals, cops, and South Florida—style suspense bite like a hungry gator and never let go.The past has come back to haunt P.I. Jack Carpenter, former head of the Broward County Missing Persons Unit. As a young cop he failed to stop the kidnapping of a college coed by a shockingly large assailant–and neither of them was ever seen again. The abduction has remained Carpenter’s most chilling cold case, and even now the mystery of the missing girl lurks in his darkest dreams. But after eighteen years, it’s about to become terrifying reality once more. When his daughter, Jessie, asks him to bird-dog a camera-toting creep who’s been shadowing her college basketball team, Carpenter’s hot pursuit of the video voyeur leads him smack into another run-in with his old hulking nemesis, who abducts one of Jessie’s teammates. While the Broward County cops are determined to pin the rap on a convenient suspect, Carpenter isn’t about to let grim history repeat itself–especially when he discovers a pattern of unsolved kidnappings involving the same massive perp.With the eager assistance of the kidnap victim’s high-powered tycoon father, the uneasy cooperation of his old unit’s new commander, and precious little time before the trail goes cold, Jack and his trusty dog, Buster, hit the ground running. And they’ll need all the help they can get–including backup from an FBI man with a personal stake in the hunt–as they follow a twisted trail from the ruins of a shuttered mental asylum with an infamous past to the streets of a sinister small town with a ghastly secret.With smooth-talking, uncompromising hero Jack Carpenter as guide, The Night Monster is an exhilarating journey into the heart of the American underworld. Bestselling author James Swain’s fiendish plotting and energetic pacing will keep you electrified straight through till morning.",
  "genres": [
    "Mystery",
    "Suspense",
    "Fiction",
    "Mystery Thriller",
    "Crime",
    "Thriller",
    "Detective"
  ],
  "author": "James Swain",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/6641123-the-night-monster"
}