{
  "title": "Hamlet",
  "description": "Perhaps the single most influential work of English drama, William Shakespeare's Hamlet is a timeless tragedy of the conflicted loyalties, madness, betrayal and terrible revenge. This Penguin Shakespeare edition is edited by T.J.B. Spencer with an introduction by Alan Sinfield. 'To be or not to be - that is the question' Something is rotten in the state of Denmark. When young prince Hamlet is confronted by his father's ghost on the battlements of Castle Elsinore, he is burdened with a terrible task: slay King Claudius, Hamlet's uncle, who the ghost alleges murdered him. Wrestling with his conscience, Hamlet feigns wild madness while plotting a brutal revenge, alienating his mother Queen Gertrude and spurning his lover Ophelia. But the act of insanity takes Hamlet perilously close to the reality, wreaking havoc on guilty and innocent alike. This book contains a general introduction to Shakespeare's life and Elizabethan theatre, a separate introduction to Hamlet, a chronology, suggestions for further reading, an essay by Paul Prescott discussing performance options on both stage and screen, and a commentary. William Shakespeare (1564-1616) was born to John Shakespeare and Mary Arden some time in late April 1564 in Stratford-upon-Avon. He wrote about 38 plays (the precise number is uncertain), many of which are regarded as the most exceptional works of drama ever produced, including Romeo and Juliet (1595), Henry V (1599), Hamlet (1601), Othello (1604), King Lear (1606) and Macbeth (1606), as well as a collection of 154 sonnets, which number among the most profound and influential love-poetry in English. If you enjoyed Hamlet, you might like Shakespeare's Macbeth, also available in Penguin Shakespeare. 'It has everything - intrigue, romance, politics, violence, revenge, jealousy, wit. It plays itself out on such a grand scale' Kenneth Branagh",
  "genres": [
    "Plays",
    "Fiction",
    "School",
    "Literature",
    "Read For School",
    "Poetry",
    "High School"
  ],
  "author": "William Shakespeare",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/129780.Hamlet"
}