{
  "title": "Redcoat: The British Soldier in the Age of Horse and Musket",
  "description": "Magnificent history of the common British soldier from 1700 to 1900 by one of Britain’s best-known and accomplished military writers and broadcasters. Red Coat is non-fiction Sharpe, filled with anecdote and humour as well as historical analysis.‘Redcoat is a wonderful book. It is not just a work of history – but one of enthusiasm and unparalleled knowledge.' BERNARD CORNWELLRedcoat is the story of the British soldier from c.1760 until c.1860 – surely one of the most enduring and magnetic subjects of the British past. Solidly based on the letters and diaries of the men who served and the women who followed them, the book is rich in the history of the period. It charts Wolfe's victory and death at Quebec, the American War of Independence, the Duke of York's campaign in Flanders, Wellington's Peninsular War, Waterloo,the retreat from Kabul, the Sikh wars in 1845-9, the Crimean war and the Indian Mutiny.The focus of Redcoat, however, is the individual recollection and experience of the ordinary soldiers serving in the wars fought by Georgian and early Victorian England.Through their stories and anecdotes – of uniforms, equipment,'taking the King's shilling', flogging, wounds, food, barrack life, courage, comradeship, death, love and loss – Richard Holmes provides a comprehensive portrait of a fallible but extraordinarily successful fighting force.'Such a scene of mortal strife from the fire of fifty men was never witnessed…' writes Harry Smith of the 95th Rifles, recounting the death of a brother officer in Spain in 1813. 'I wept over his remains with a bursting heart as, with his company who adored him, I consigned to the grave the last external appearance of Daniel Cadoux. His fame can never die.' Smith's account is typical of the emotions and experiences of the men who appear on every page of this book, sporting their red uniforms to fight for King and country.",
  "genres": [
    "History",
    "Nonfiction",
    "Military History",
    "War",
    "Military Fiction",
    "18th Century",
    "Historical"
  ],
  "author": "Richard   Holmes",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/664905.Redcoat"
}