{
  "title": "Why the Pharaohs Built the Pyramids with Fake Stones",
  "description": "In this book, Professor Joseph Davidovits explains the intriguing theory that made him famous. He shows how the Pyramids were built by using re-agglomerated stone (a natural limestone treated like a concrete), and not with huge carved blocks, hauled on fragile ramps. Archaeology bears him out, as well as hieroglyphic texts, scientific analysis, religious and historical facts. Several independant scientific studies reveal the ultimate proofs that the pyramids blocks are not natural. You may find various papers or opinions challenging the theory, but all prefer ignoring these analysis. Believing or not in the artificial stone theory is now simply irrelevant. It is a fact, a truth that is still fought by some people for irrational purposes. Here we finally have the first complete presentation on how and why the Egyptian pyramids were built. We discover its brilliant creator, the great scribe and architect, Imhotep. Joseph Davidovits sweeps aside the conventional image which cripples Egyptology and delivers a captivating and surprising view of Egyptian civilisation. He charts the rise of this technology, its apogee with the Pyramids at Giza, and the decline. Everything is logical and brilliant, everything fits into place. Chapter by chapter, the revelations are sensational, especially when Joseph Davidovits explains why the pharaohs stopped building great pyramids because of an over-exploitation of raw materials and a likely environmental disaster. We understand why Cheops and Ramses II represent two Egyptian civilisations completely different in their beliefs. On the one hand, the God Khnum mandates Cheops to build his pyramid in agglomerated stone, while on the other hand, the God Amun orders Ramses to carve stone for the temples of Luxor and Karnak. 30 years after the best seller The an enigma solved, after 30 years of new research, and new discoveries, you will understand why the theory is more alive than ever, why more and more scientists and archaeologists agree, simply because it is the truth.",
  "genres": [
    "Egypt",
    "Egyptology"
  ],
  "author": "Joseph Davidovits",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/6651440-why-the-pharaohs-built-the-pyramids-with-fake-stones"
}