{
  "title": "The Bizarre Truth: How I Walked Out the Door Mouth First . . . and Came Back Shaking My Head",
  "description": "Andrew Zimmern, the host of The Travel Channel’s hit series Bizarre Foods, has an extraordinarily well-earned reputation for traveling far and wide to seek out and sample anything and everything that’s consumed as food globally, from cow vein stew in Bolivia and giant flying ants in Uganda to raw camel kidneys in Ethiopia, putrefied shark in blood pudding in Iceland and Wolfgang Puck's Hunan style rooster balls in Los Angeles. For Zimmern, local cuisine — bizarre, gross or downright stomach turning as it may be to us -- is not simply what’s served at mealtime. It is a primary avenue to discovering what is most authentic — the bizarre truth — about cultures everywhere. Having eaten his way around the world over the course of four seasons of Bizarre Foods, Zimmern has now launched Bizarre Worlds , a new series on the Travel Channel, and this, his first book, a chronicle of his journeys as he not only tastes the “taboo treats” of the world, but delves deep into the cultures and lifestyles of far-flung locales and seeks the most prized of the modern traveler’s The Authentic Experience. Written in the smart, often hilarious voice he uses to narrate his TV shows, Zimmern uses his adventures in “culinary anthropology” to illustrate such themes  why visiting local markets can reveal more about destinations than museums; the importance of going to “the last stop on the subway” — the most remote area of a place where its essence is most often revealed; the need to seek out and catalog “the last bottle of coca-cola in the desert,” i.e. disappearing foods and cultures; the profound differences between dining and eating; and the pleasures of snout to tail, local, fresh and organic food. Zimmern takes readers into the back of a souk in Morocco where locals are eating a whole roasted lamb; along with a conch fisherman in Tobago, who may be the last of his kind; to Mississippi, where he dines on raccoon and possum. There, he writes, \"People said, 'That's roadkill!' ‘No it's not,’ I said. ‘It's a cultural story.’”Whether it’s a session with an Incan witch doctor in Ecuador who blows fire on him, spits on him, thrashes him with poisonous branches and beats him with a live guinea pig or drinking blood in Uganda and cow urine tonic in India or eating roasted bats on an uninhabited island in Samoa, Zimmern cheerfully celebrates the undiscovered destinations and weird wonders still remaining in our increasingly globalized world.",
  "genres": [
    "Food",
    "Nonfiction",
    "Travel",
    "Biography Memoir",
    "Autobiography",
    "Cooking",
    "Memoir"
  ],
  "author": "Andrew Zimmern",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/6648322-the-bizarre-truth"
}