{
  "title": "Eyes Of An Angel: Soul Travel, Spirit Guides, Soul Mates, And The Reality Of Love",
  "description": "Recent surveys reveal that more than eighteen million people in North America have survived a near-death experience. Thats an incredibly large number of people who have lived through a life-changing event. Remarkably, it is also estimated that as many as three times that number have experienced a mystical or spiritual encounter. A new book, Eyes of an Angel, carries a compelling message that these people and their families yearn to hear. Indeed, it is a message the whole world needs to hear. Eyes of an Angel is an amazing, true account of Soul Travel, Angels, Spirit Guides, Soul Mates, and the Reality of Love. Written in a compelling, easy to read style, it conveys a unique and fascinating story. Not only will it appeal to those who are believers in the spiritual and paranormal, but also to the general population who want to believe that these things are true. A former television news reporter and mayor of a Canadian city, Paul Elder is a survivor of two near-death experiences a drowning at the age of 12, and a heart attack at the age of 41. A previously avowed skeptic, Elder found, to his dismay, that his near-death encounters had opened within him a psychic doorway to the spirit world a doorway he has been able to return through, time and time again. With the assistance of angels and spirit guides, he was systematically led through a series of stunning revelations. From reunions with departed souls to the discovery of soul mates and past lives, his re-education left him with incredible insights as to our true nature and purpose in the universe. Eyes of an Angel is the true story of a mainstream politician who could not openly share or discuss the profound, spiritual experiences changing his perspective on life. Skillfully integrating near-death and out-of-body experiences in a way that has never been done before, Elders story will encourage readers to truly listen to their own intuition and guidance, striving to live from their heart centers, rather than just from their heads. A book of hope and courage, it can instantly change millions of lives. It will give readers of books like Conversations With God inspiration to create their own dialogue with their own spirit guides and God. Unlike any other book on the market, Eyes of an Angel offers a gripping first hand account of a remarkable spiritual adventure. Its story will keep you spellbound, while its message resonates deep within your soul.",
  "genres": [
    "Nonfiction",
    "Spirituality",
    "Paranormal",
    "New Age"
  ],
  "author": "Paul Elder",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/6651619-eyes-of-an-angel"
}