{
  "title": "The Guild of the Cowry Catchers, a story of pirates and Panamindorah",
  "description": "Imagine that the Chronicles of Narnia were written for adults and told with the gritty realism of George R. R. Martin’s Westross. The Guild of the Cowry Catchers is a dark, nautical fantasy for anyone who loves Robin Hobb, Stephen R. Donaldson, Pirates of the Caribbean, or any high seas fantasy adventure with complex, morally ambiguous characters.These characters inhabit a chain of island kingdoms called Wefrivain. The kingdoms’ querulous lords are united only by religion, a wyvern cult ruled by an eccentric High Priestess. The Temple is under attack by a gang of pirates, known as the Guild of the Cowry Catchers. They’ve been preying on Temple treasure ships. The Temple Police charged with eradicating this menace keep disappearing.Enter Gerard, a young prince, exiled from his small island kingdom for marrying the court minstrel. Chosen by the High Priestess as the new Captain of Police, Gerard is smart, honorable, and a little naïve. To break the pirate ring, he must cooperate with a wily, amoral admiral, who has already tried to kill him twice.As Gerard struggles to protect his talented wife, obey his seductive employer, and forge a complicated friendship with his dangerous coworker, he becomes increasingly aware that the pirates have a legitimate quarrel with the wyverns. Dark secrets lurk in the Temple dungeons, and solving them will cost Gerard far more than his honor.This download includes all 5 books in the Guild of the Cowry Catchers series. This 300,000-word series is DRM-free and carefully formatted. The books are:EmbersFlamesAshesOut of the AshesShores Beyond the WorldThese books are also available in individual illustrated versions. The illustrated version of Book 4 should be done around the end of 2011/beginning of 2012, and Book 5 will appear around fall of 2012. The single-volume download of the complete series is *not* illustrated (file size would be enormous).Learn more about the series on the author's website at cowrycatchers.com.",
  "genres": [
    "Fantasy",
    "Mystery",
    "Romance",
    "M M Romance",
    "Audiobook",
    "Fiction",
    "Queer"
  ],
  "author": "Abigail Hilton",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/12979085-the-guild-of-the-cowry-catchers-a-story-of-pirates-and-panamindorah"
}