{
  "title": "Saved by Her Enemy: An Iraqi woman's journey from the heart of war to the heartland of America",
  "description": "For her entire life, Rafraf, a devout Muslim, had been told that Americans were the enemy. Her understanding of the world, of her place in it, and of the United States had been steeped in the culture of Iraq under the rule of Saddam Hussein. Yet, in the midst of insurgents attempting to kidnap and kill her, she found herself on the receiving end of lifesaving help from those she considered her enemies.Rafraf suddenly finds herself living with a Christian family in the Bible Belt of America. Nothing had prepared her for this new reality—the life of a college student in a vastly foreign culture, in a community as far from her expectations as she could have imagined, and in a family that opens their hearts to enfold her.Saved by Her Enemy is a riveting journey of two very different people from opposite sides of the world, of faith, of experience, and of expectations. The dramatic intersection of their lives and their journey together is an inspiration to those who have ever felt there was more to life than the world they knew.A young Iraqi woman, an American war correspondent, and a true tale of friendship, faith, and family against the backdrop of war and the collision of culturesThis is a story of a very unlikely friendship—between American war correspondent Don Teague and Rafraf Barrak, an Iraqi college girl who won a job as a translator for NBC during the early months of violence in the wake of the American invasion of Iraq.While covering a story together, the two were nearly killed by a bomb, an experience that created a bond between them that led them down a path neither could have imagined.What follows is a story of transformation, as Rafraf—from a devout Muslim family—becomes the target of terrorist threats to kidnap and murder her. Don and his fellow correspondents mobilize to help save her life and suddenly Rafraf finds herself on the receiving end of an offer for safety and a new life in the United States.Dramatically transplanted from the streets of Iraq to the Bible Belt of middle America, Rafraf finds everything that she knew—or thought she knew—about herself, her values, her world, even faith and family, turned upside down. Meanwhile, Don; his wife, Kiki; and their children discover they’ve embarked on an adventure with Rafraf that reshapes their lives.This captivating story inspires us all to join Don and Rafraf in discovering that there is far more to life than the world we know.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Book Club",
    "Christian",
    "Biography Memoir",
    "Islam"
  ],
  "author": "Don Teague",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6649596-saved-by-her-enemy"
}