{
  "title": "Sisters in War: A Story of Love, Family, and Survival in the New Iraq",
  "description": "Caught up in a terrifying war, facing choices of life and death, two Iraqi sisters take us into the hidden world of women’s lives under U.S. occupation. Through their powerful story of love and betrayal, interwoven with the stories of a Palestinian American women’s rights activist and a U.S. soldier, journalist Christina Asquith explores one of the great untold sagas of the Iraq the attempt to bring women’s rights to Iraq, and the consequences for all those involved.On the heels of the invasion, twenty-two-year-old Zia accepts a job inside the U.S. headquarters in Baghdad, trusting that democracy will shield her burgeoning romance with an American contractor from the disapproval of her fellow Iraqis. But as resistance to the U.S. occupation intensifies, Zia and her sister, Nunu, a university student, are targeted by Islamic insurgents and find themselves trapped between their hopes for a new country and the violent reality of a misguided war.Asquith sets their struggle against the broader U.S. efforts to bring women’s rights to Iraq, weaving the sisters’ story with those of Manal, a Palestinian American women’s rights activist, and Heather, a U.S. army reservist, who work together to found Iraq’s first women’s center. After one of their female colleagues is gunned down on a highway, Manal and Heather must decide whether they can keep fighting for Iraqi women if it means risking their own lives.In Sisters in War , Christina Asquith introduces the reader to four women who dare to stand up for their rights in the most desperate circumstances. With compassion and grace, she vividly reveals the plight of women living and serving in Iraq and offers us a vision of how women’s rights and Islam might be reconciled.",
  "genres": [
    "Nonfiction",
    "War",
    "Memoir",
    "History",
    "Biography",
    "Asia",
    "Book Club"
  ],
  "author": "Christina Asquith",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/6653878-sisters-in-war"
}