{
  "title": "The Mummy Case",
  "description": "Radcliffe Emerson, the irascible husband of fellow archaeologist Amelia Peabody, has earned the nickname \"Father of Curses\"—and in Mazghunah he demonstrates why. Denied permission to dig at the pyramids of Dahshoor, he and Amelia are resigned to excavating mounds of rubble in the middle of nowhere. But before long Amelia, Emerson, and their precocious son, Ramses, find themselves entangled in The Mummy CaseIn Cairo, before setting out to the site, Amelia visits an antiquities dealer to inquire about some papyri for her brother-in-law, Walter. At the dealer's shop she interrupts a mysterious-sounding conversation. And then, even more alarmingly, the dealer attempts to refuse to sell her a scrap of papyrus Ramses discovers in the back room. When the dealer is found dead in his shop just a day later, Amelia becomes convinced that foul play is at hand, a suspicion that is further confirmed when she catches sight of the sinister stranger from the crime scene at her own excavation site.But it takes more than Amelia's keen instincts to convince Emerson of dastardly deeds. When Ramses's scrap of papyrus is stolen from their camp, and a neighboring tourist is relieved of an entire mummy, Emerson concedes that they may be facing something more ominous than a simple grave robber. Aided (to their dismay) by Ramses and his preternaturally intelligent cat, Bastet, Amelia and Emerson turn their detective skills to investigating the neighboring suspects, including a trio of missionaries, a widowed German baroness, and even the head of the Department of Antiquities. But when the Emersons start digging for answers in an ancient tomb, events take a darker and deadlier turn—and there may be no surviving the very modern terrors their efforts reveal.Filled with spine-tingling suspense, precise archaeological and historical detail, and Amelia Peabody's trademark witty, wry voice, Elizabeth Peters's The Mummy Case is a classic installment in the beloved Amelia Peabody series.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Egypt",
    "Historical Mystery"
  ],
  "author": "Elizabeth Peters",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/66534.The_Mummy_Case"
}