{
  "title": "The Gloria Anzaldúa Reader",
  "description": "Born in the Río Grande Valley of south Texas, independent scholar and creative writer Gloria Anzaldúa was an internationally acclaimed cultural theorist. As the author of Borderlands / La Frontera: The New Mestiza, Anzaldúa played a major role in shaping contemporary Chicano/a and lesbian/queer theories and identities. As an editor of three anthologies, including the groundbreaking This Bridge Called My Back: Writings by Radical Women of Color, she played an equally vital role in developing an inclusionary, multicultural feminist movement. A versatile author, Anzaldúa published poetry, theoretical essays, short stories, autobiographical narratives, interviews, and children’s books. Her work, which has been included in more than 100 anthologies to date, has helped to transform academic fields including American, Chicano/a, composition, ethnic, literary, and women’s studies.This reader—which provides a representative sample of the poetry, prose, fiction, and experimental autobiographical writing that Anzaldúa produced during her thirty-year career—demonstrates the breadth and philosophical depth of her work. While the reader contains much of Anzaldúa’s published writing (including several pieces now out of print), more than half the material has never before been published. This newly available work offers fresh insights into crucial aspects of Anzaldúa’s life and career, including her upbringing, education, teaching experiences, writing practice and aesthetics, lifelong health struggles, and interest in visual art, as well as her theories of disability, multiculturalism, pedagogy, and spiritual activism. The pieces are arranged chronologically; each one is preceded by a brief introduction. The collection includes a glossary of Anzaldúa’s key terms and concepts, a timeline of her life, primary and secondary bibliographies, and a detailed index.",
  "genres": [
    "Feminism",
    "Queer",
    "Poetry",
    "Nonfiction",
    "Essays",
    "Race",
    "LGBT"
  ],
  "author": "Gloria E. Anzaldúa",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/6652672-the-gloria-anzald-a-reader"
}