{
  "title": "Borderlands: The New Mestiza = La Frontera",
  "description": "Experimental, inventive, provocative and above all visionary, Gloria Anzaldúa's work is widely recognized among scholars of Chicano/Latino, Gay and Lesbian, Women's, Postcolonial, Ethnic and Cultural Studies as a foundational elaboration of the politics and poetics of cultural hybridity. Both Borderlands/La Frontera and Making Face/Making Haciendo Caras are all about understanding the complex and competing social, political and cultural forces that shape-sometimes quite brutally-the experiences of women of color in the U.S., and they are all about taking that understanding and mobilizing it toward creative and revisionary efforts for making social change.\"One of the 100 Best Books of the Twentieth Century\"- Hungry Mind Review (Spring 1999)\"Anzaldúa's voyage of discovery, focused on the border and the new mestiza, is a preparation for the future. The border is a bundle of contradictions and ambiguities... This hybrid crossroads is just the right kind of training ground. It is fertile area for mutations and transformations. In Borderlands/ La Frontera , Gloria Anzaldúa is our guide with an all-encompassing vision to charge the border with meaning.\"- The Americas Review\"[She] explores in prose and poetry the murky, precarious existence of those living on the frontier between cultures and languages. . . .she meditates on the conditions of Chicanos in Anglo culture, women in Hispanic culture, and lesbians in the straight world. ...a powerful document.\"- Library JournalA \"Best of 1987\" Library Journal selection.\"Anzaldúa's vision encompasses spiritual and experiential aspects of female power, as well as the day-to-day courage and struggle that has characterized Chicano survival.\"- The San Francisco Chronicle",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Feminism",
    "Theory",
    "Queer",
    "Race",
    "Memoir"
  ],
  "author": "Gloria E. Anzaldúa",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/665654.Borderlands"
}