{
  "title": "Lord of the Silent",
  "description": "Undeterred by world war and enemy submarines, Amelia Peabody -- Grandmaster Elizabeth Peters's indomitable archaeologist-sleuth -- once again sets sail for Egypt, where ghosts of an ancient past and specters of a present-day evil hover silently over an inscrutable land.With son Ramses, his wife, Nefret, and a few unwelcome additions in tow, the elder Peabody-Emersons embark on a dangerous sea voyage to Alexandria, ultimately ending up in Cairo for their annual excavations. But in this autumn of 1915 the exotic, alluring city is not what it used to be. Cairo has been transformed into an armed camp teeming with enemy agents, and shockingly bold tomb robbers are brazenly desecrating the ancient sites.Amelia's foremost priority is to prevent the War Office from pressing Ramses into service again, on the same sort of job that almost cost him his life the previous year. But in these terrible days of global conflict and relentless skullduggery, no place in Egypt is safe. Even remote Luxor provides no guarantee of safety, especially after Amelia discovers a fresh corpse resting in an ancient tomb.The grim discovery presages further trouble for the Emersons, as the sinister conundrum pulls them all into a bubbling morass of corruption, intrigue, and international espionage deeper and more fiendish than any they have hitherto encountered. Yet there is an even darker danger in store for the Emersons. Can it be that one of Amelia's oldest and most dangerous adversaries will intervene to alter the family's destiny? Tantalizing clues suggest that this may be so and point toward an archaeological discovery of unparalleled importance -- and the resurrection of a voice that has been silent for millennia.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Egypt",
    "Audiobook",
    "Historical Mystery"
  ],
  "author": "Elizabeth Peters",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/66537.Lord_of_the_Silent"
}