{
  "title": "Faux Beau",
  "description": "Who said a one-night-stand can’t last forever…Self-appointed hall-monitor of life, Milly Smartt is ready to take some chances and live life balls-to-the-wall. After all, it was her sister’s dying wish for Milly to chase happy, which is the only reason she accepts a dare to kiss a random stranger in a bar. Only the stranger isn’t a stranger at all—in fact, she’s pretty sure it’s her childhood crush, Lucas Macintyre. And when one kiss turns into a passion filled night, Milly couldn’t be happier—until she discovers she slept with Jaxon Macintyre—Luca’s playboy of a twin brother.Professional snowboarder and self-proclaimed bachelor, Jax Macintyre has a gold medal in one-night-stands. No fake promises, no morning after, and definitely no meeting the family. Only when Milly’s parents stage a surprise visit, he’s caught with his pants down—literally. He’s ready to climb out the window if necessary, when Milly introduces him as his twin brother, Lucas. Even worse, she panics and, rather than come clean about their no-strings fling, she tells her parents that he’s her boyfriend. Jax isn’t looking for a plus-one in life, especially a too peppy, too sunshiny, hopeless romantic who wears Mr. Darcy lingerie. But when he finds himself in a logistical nightmare heading up a snowboarding competition for his family’s lodge, he approaches her with a proposition. He’ll go along with this faux-mance until her parents leave town and, in exchange, she’ll help him plan the perfect competition.How hard can it be? A few appearances, maybe a date or two, easy-pesy. Only once word gets around that they’re dating, everyone has an opinion. Milly’s mom is practically planning the wedding, Jax’s family is inviting them over for dinner, and his siblings are finally seeing him as a reliable part of the lodge’s team. Then after an impromptu kiss intended for show, the fake begins to fade into something more real. Only Milly’s parents are leaving town, the event is coming to a close, and Jax is ready to jump back into the competition circuit, rendering their deal unnecessary. Will they abide by the original agreement, or will they chase happy?Faux Beau is a hilarious, pee-your-pants romcom featuring a swoon-worthy self-proclaimed boy-toy, a mistaken identity, and a fantasy of a one-night-stand, which leads to a fake relationship that will make you fall in love. It's book 1 in a series, but can be read as a standalone, and is guaranteed to make you laugh, cry and bring all the feels in-between.\nFaux Beau is a mistaken identity, one-night-stand, friends-to-lovers, fake relationship romcom with no cheating, no triggers and a satisfying happily ever after.",
  "genres": [
    "Romance",
    "Sports Romance",
    "Sports",
    "Contemporary",
    "Contemporary Romance",
    "Christmas",
    "Adult"
  ],
  "author": "Marina Adair",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/66591621-faux-beau"
}