{
  "title": "Supernatural Horror in Literature",
  "description": "H.P. Lovecraft (1890-1937), the most important American supernaturalist since Poe, has had an incalculable influence on all the horror-story writing of recent decades. Altho his supernatural fiction has been enjoying an unprecedented fame, it's not widely known that he wrote a critical history of supernatural horror in literature that has yet to be superceded as the finest historical discussion of the genre. This work is presented in this volume in its final, revised text. With incisive power, Lovecraft here formulates the esthetics of supernatural horror & summarizes the range of its literary expression from primitive folklore to the tales of his own 20th-century masters. Following a discussiom of terror-literature in ancient, medieval & renaissance culture, he launches on a critical survey of the whole history of horror fiction from the Gothic school of the 18th century (when supernatural horror found its own genre) to the time of De la Mare & M.R. James. The Castle of Otranto, Radcliffe, \"Monk\" Lewis, Vathek Charles Brockden Brown, Melmoth the Wanderer, Frankenstein, Bulwer-Lytton, Fouqué's Undine, Wuthering Heights, Poe (full chapter), The House of the Seven Gables, de Maupassant's The Horla, Bierce, The Turn of the Screw , M.P. Shiel, W.H. Hodgson, Machen, Blackwood & Dunsany are among those discussed in depth. He also notices a host of lesser writers--enough to draw up an extensive reading list. By charting so completely the background for his own concepts of horror & literary techniques, Lovecraft throws light on his own fiction as well as on the horror-literature which has followed. For this reason this book will be especially intriguing to those who've read his fiction as an isolated phenomenon. Any searching for a guide thru the inadequately marked region of literary horror, need search no further. Unabridged & corrected republication of 1945 edition. New introduction by E.F. Bleiler.",
  "genres": [
    "Horror",
    "Nonfiction",
    "Essays",
    "Lovecraftian",
    "Literary Criticism",
    "Literature",
    "Weird Fiction"
  ],
  "author": "H.P. Lovecraft",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/666634.Supernatural_Horror_in_Literature"
}