{
  "title": "Rainwater",
  "description": "A romantic historical novel from the #1 New York Times bestselling author of Seeing Red about an independent woman who runs a boarding house in Dust Bowl Texas.Ella Baron runs her Texas boarding house with the efficiency of a ship’s captain and the grace of a gentlewoman. She cooks, cleans, launders, and cares for her ten-year-old son, Solly, a sweet but challenging child whose busy behavior and failure to speak elicits undesired advice from others in town. Ella’s plate is full from sunup to sundown. When a room in her boarding house opens up, the respected town doctor brings Ella a new boarder―the handsome and gallant Mr. David Rainwater—but Ella is immediately resistant to opening up her home to this mysterious stranger. Even with assurances that Mr. Rainwater is a man of impeccable character, a former cotton broker and a victim of the Great Depression, Ella stiffens at the thought of taking him in. Dr. Kincaid tells Ella in confidence that Mr. Rainwater won’t require the room for long: he is dying. Begrudgingly, Ella accepts Mr. Rainwater’s application to board, but she knows that something is happening; she is being swept along by an unusual series of events. Soon, this strong-minded, independent woman will realize that the living that she has eked out for herself in the small bubble of her town is about to change, whether she likes it or not... Racial tensions, the financial strain of livelihoods in cotton drying up into dust, and the threat of political instability swirl together into a tornado on the horizon. One thing is certain: the winds of change are blowing all over Texas—and through the cracks in the life that Ella Barron has painstakingly built. This is the story of a woman who takes her life’s circumstances in both hands, but who will be forced to reckon with the chaos of her historical circumstances..",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Historical",
    "Historical Romance",
    "Book Club",
    "Audiobook"
  ],
  "author": "Sandra       Brown",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/6668592-rainwater"
}