{
  "title": "Metro 2034",
  "description": "The basis of two bestselling computer games Metro 2033 and Metro Last Light, the Metro books have put Dmitry Glukhovsky in the vanguard of Russian speculative fiction alongside the creator of Night Watch, Sergei Lukyanenko. A year after the events of METRO 2033 the last few survivors of the apocalypse, surrounded by mutants and monsters, face a terrifying new danger as they hang on for survival in the tunnels of the Moscow Metro.Featuring blistering action, vivid and tough characters, claustrophobic tension and dark satire the Metro books have become bestsellers across Europe.**Review\"The Metro universe is still one of the best realized apocalyptic settings around.\" —Nerd Like YouAbout the AuthorDmitry Glukhovsky is a Russian writer and journalist. His first novel, METRO 2033, a post-nuclear dystopia set in the Moscow subway, the world's biggest bomb shelter, was written as an online interactive experiment and published on his own website as a free project in 2002, then completed in 2004. Several years later, the novel came out as a printed book and became a success. It is translated into 37 languages has and has already sold over 2 million copies. Millions have read the free text of the novel in the original Russian language on its official website. Glukhovsky's following books, Metro 2034 and Metro 2035, Sumerki and Futu-re have also been published online and become an international success. Dmitry Glukhovsky is also known as one of the global pioneers of the transmedia storytelling. His 'Metro' saga is being told across his own novels 'Metro 2033' and 'Metro 2034', the two video games inspired by the books and continuing their storyline - 'Metro 2033' and 'Metro: Last Light', as well as novels written by other authors within and for 'The Universe of Metro 2033' international book franchise (70 books published by October 2015). Dmitry's most recent novel, a dystopia named 'Future', Dmitry Glukhovsky first published in a social network, Russia's leading 'VK'. Chapters of the novel were attached as free-download PDF documents, and were accompanied by a free-to-listen original soundtrack and illustrations; within few months, the page of 'Future' gathered over 300 000 subscribers. As a roving reporter for Russia Today and EuroNews, he traveled from Morocco and Guatemala to Iceland and Japan. He was deep in Chernobyl area to film the destroyed nuclear reactor, watched Russian rockets' launch at Baykonur, reported Israel's standoff with Hezbollah under the missiles in Kiryat-Shmona and made the world's first live report from the North Pole. Apart of his native Russian, Glukhovsky fluently speaks English, French, German, Hebrew and Spanish.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Post Apocalyptic",
    "Horror",
    "Dystopia",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Dmitry Glukhovsky",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/6667916-metro-2034"
}