{
  "title": "The Black Book",
  "description": "A new edition of the classic New York Times bestseller edited by Toni Morrison, offering an encyclopedic look at the black experience in America from 1619 through the 1940s with the original cover restored.“I am so pleased the book is alive again. I still think there is no other work that tells and visualizes a story of such misery with seriousness, humor, grace and triumph.”—Toni MorrisonSeventeenth-century sketches of Africans as they appeared to marauding European traders. Nineteenth-century slave auction notices. Twentieth-century sheet music for work songs and freedom chants. Photographs of war heroes, regal in uniform. Antebellum reward posters for capturing runaway slaves. An 1856 article titled “A Visit to the Slave Mother Who Killed Her Child.”In 1974, Middleton A. Harris and Toni Morrison led a team of gifted, passionate collectors in compiling these images and nearly five hundred others into one sensational narrative of the black experience in America—The Black Book. Now in a newly restored hardcover edition, The Black Book remains a breathtaking testament to the legendary wisdom, strength, and perseverance of black men and women intent on freedom. Prominent collectors Morris Levitt, Roger Furman, and Ernest Smith joined Harris and Morrison (then a Random House editor, ultimately a two-time Pulitzer Prize–winning Nobel Laureate) to spend months studying, laughing at, and crying over these materials—transcripts from fugitive slaves’ trials and proclamations by Frederick Douglass and celebrated abolitionists, as well as chilling images of cross burnings and lynchings, patents registered by black inventors throughout the early twentieth century, and vibrant posters from “Black Hollywood” films of the 1930s and 1940s. Indeed, it was an article she found while researching this project that provided the inspiration for Morrison’s masterpiece, Beloved.A labor of love and a vital link to the richness and diversity of African American history and culture, The Black Book honors the past, reminding us where our nation has been, and gives flight to our hopes for what is yet to come. Beautifully and faithfully presented and featuring a foreword and original poem by Toni Morrison, The Black Book remains a timeless landmark work.",
  "genres": [
    "History",
    "Nonfiction",
    "African American",
    "Race",
    "American History",
    "Historical",
    "Music"
  ],
  "author": "Middleton A. Harris",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/6669263-the-black-book"
}