{
  "title": "Jack Bruce Composing Himself: The authorised biography",
  "description": "When Cream broke up in 1968 it was by no means a foregone conclusion that it would be Eric Clapton who would enjoy continued commercial success. After all, it was Jack Bruce who had the looks, and who co-wrote and sang all the band’s major hits, including ‘Sunshine Of Your Love’, ‘I Feel Free’ and ‘White Room’. But he was a singular talent who wanted to be a pioneer, not just a pop star, and he was never happy resting on his reputation. Bruce’s formative years set the tone for a musical journey that has twisted and turned through the decades, moving through and combining many genres and styles. His background is in classical music and jazz; at 10 he was winning classical song contests, at 12 composing string quartets and improvising on piano. Then he fell in love with Thelonious Monk and Charlie Mingus and left home at 18 to find his fortune as a jazz bass player. He found his way into the London blues scene and played with luminaries such as John Mayall and Graham Bond before first tasting chart success with Manfred Mann. Then there was Cream, one of the most influential rock bands of their time, who sold 35 million albums during their two-year existence. Cream split in their prime but their influence endured, and when they reformed in 2005 tickets were selling for nearly £2,000 on eBay.In the 40 years since Cream split Bruce has continued his musical adventures with the likes of John McLaughlin, Billy Cobham, Carla Bley and Mick Taylor, never quite achieving the success and recognition he deserves. It has been an often troubled life — heroin addiction, management rip-offs, family tragedy, and a failed liver transplant, all of which he speaks about frankly in this book, telling a story that is sometimes funny, sometimes bleak, and always honest.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction"
  ],
  "author": "Harry Shapiro",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/6667845-jack-bruce-composing-himself"
}