{
  "title": "Circus Parade",
  "description": "A facsimile reprint of this classic tale of the seamier side of circus life “Jim Tully was one of the fine American novelists to emerge in the 1920s and ’30s. He gained this position with intelligence, sensitivity, and hard work. . . . No matter how crazily violent or fantastic his stories are, readers accept them as nonfiction. Tully makes the improbable seem true.” ―from the foreword by Harvey Pekar Jim Tully was an American writer who enjoyed critical acclaim and commercial success in the 1920s and ’30s. A former circus laborer, hobo, and professional boxer, his rags-to-riches career may qualify him as the greatest long shot in American literature. Following the death of his mother, Tully was sent from his home in St. Marys, Ohio, to an orphanage in Cincinnati. After his time at the orphanage, the young Tully spent six years as a vagabond, riding the rails and working for a small circus. He left the road and settled in Kent, Ohio, in 1907, working odd jobs while focusing on his new interest―writing. After getting a few pieces published in local papers, Tully returned to the road in 1912, eventually settling for good in Hollywood. He worked for Charlie Chaplin and later became one of the first reporters to cover Hollywood. His honest depictions of film stars and directors earned him the reputation as the most feared man in Hollywood. In addition to the celebrity pieces, Tully wrote numerous books, including Circus Parade (1927). Based on his time as a circus laborer, Circus Parade presents the sordid side of small-time circus life. Tully’s use of fast-paced vignettes and unforgettable characters made this book one of his most successful, both commercially and critically. Among the cast is Cameron, the shifty circus owner; Lila, the lonely four-hundred-pound strong woman; and Blackie, an amoral drug addict. This is by no means a romantic story about a boy joining the circus. Tully knows too well its seamier side. Instead, he paints a picture of life at the edges―earthy, wolfish, and brutal. Fans of Jack London, Jack Kerouac, John Steinbeck, Charles Bukowski, and hard-boiled writers of the 1930s will find a kindred spirit in Jim Tully.",
  "genres": [
    "Fiction"
  ],
  "author": "Jim Tully",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/6673299-circus-parade"
}