{
  "title": "Judas Unchained",
  "description": "After hundreds of years secretly manipulating the human race, the Starflyer alien has succeeded in engineering a war which should result in the destruction of the Intersolar Commonwealth. Now, thanks to Chief Investigator Paula Myo, the Commonwealth's political elite finally acknowledge the Starflyer's existence, and put together an unlikely partnership to track down this enegmatic and terrifying alien before it can cause any more damage.The invasion from Dyson Alpha continues with dozens of Commonwealth worlds falling to the enemy. The Commonwealth navy fights back with what it believes to be war-winning superweapons, only to find that the alien fleet has been given equally powerful weapons. How the aliens got them and why the weapons are so similar is the question which haunts Admiral Kime. Could it be that the Commonwealth's top-secret defence project has been compromised by the Starflyer's agents, or is the truth even worse?For Mark Vernon, mechanic and general repairman extraordinaire, it appears he's landed on his feet when he finds the perfect job on the most secure world in the Commonwealth. He and his family will never be in danger again now he's helping to build the starships that will evacuate the ultra-rich should the war be lost. Until one day when Nigel Sheldon arrives to ask him a small favour. You don't say no to the man who created the Commonwealth. But the problem with small favours is the way they tend to grow...With the war going badly and the Starflyer's treachery threatening the very heart of the Commonwealth, only the alien's destruction can turn the tide. As Paula Myo finally begins to close in on her prey the operation is sabotaged from within. If the nemesis is ever to be beaten Paula will have to work out which of her colleagues is plotting to betray the entire human race.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Audiobook",
    "Fantasy",
    "Science Fiction Fantasy",
    "Space"
  ],
  "author": "Peter F. Hamilton",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/667705.Judas_Unchained"
}