{
  "title": "Four Comedies: The Taming of the Shrew, A Midsummer Night's Dream, The Merchant of Venice, Twelfth Night",
  "description": "The Taming of the ShrewRobust and bawdy, The Taming of the Shrew captivates audiences with outrageous humor as Katharina, the shrew, engages in a contest of wills–and love–with her bridegroom, Petruchio, in a comedy of unmatched theatrical brilliance, filled with visual gags and witty repartee.A Midsummer Night's DreamFairy magic, love spells, and an enchanted wood turn the mismatched rivalries of four young lovers into a marvelous mix-up of desire and enchantment, all touched by Shakespeare’s inimitable vision of the intriguing relationship between dreams and the waking world.The Merchant of VeniceThis dark comedy of love and money contains one of the truly mythic figures in literature–Shylock, the Jewish moneylender. The “pound of flesh” he demands as payment of Antonio’s debt has become a universal metaphor for vengeance. Here, pathos and farce combine with moral complexity and romantic entanglements, to display the extraordinary power and range of Shakespeare at his best.Twelfth NightSet in a topsy-turvy world like a holiday revel, this comedy juxtaposes a romantic plot involving separated twins and mistaken identity with a more satiric one about the humiliation of a pompous killjoy. The hilarity is touched with melancholy, and the play ends, not with laughter, but with a clown’s plaintive song.Each Edition • Comprehensive explanatory notes• Vivid introductions and the most up-to-date scholarship• Clear, modernized spelling and punctuation, enabling contemporary readers to understand the Elizabethan English• Completely updated, detailed bibliographies and performance histories• An interpretive essay on film adaptations of the play, along with an extensive filmography",
  "genres": [
    "Classics",
    "Plays",
    "Drama",
    "Fiction",
    "Historical Fiction",
    "Humor",
    "Read For School"
  ],
  "author": "William Shakespeare",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/12983.Four_Comedies"
}