{
  "title": "Treading Water",
  "description": "Love is the last thing on Jack Harrington’s mind when he sets out to meet Andi Walsh’s flight. Recently back to work after spending more than a year tending to his comatose wife, Jack is focused on getting through each day and caring for his three daughters. However, the moment he sets eyes on Andrea Walsh, the interior designer who has come to decorate the hotel his company is building in Newport, Rhode Island, Jack begins to wonder if Andi might be his second chance. After a disastrous marriage, Andi, single mom to a hearing-impaired son, isn’t exactly looking for love, either, but that’s what she finds with Jack. The two embark on a long-distance relationship fraught with challenges as they balance the needs of their children and dueling careers while Jack continues to care for his wife, Clare. Just when Jack thinks his life is once again settled, he is confronted with a new challenge that tests him in ways he never could've imagined, leaving him to wonder if \"happily ever after\" is in the cards for him.\"This isn't your typical romance where you're positive you're going to get the happy ending you were hoping for at the beginning. It will rip your heart out at times and having you weeping for joy at others. A stunning story about learning to love again and learning when to let go to those you love.\" A Reviewer Top Pick at Night Owl Reviews. \"Treading Water is a definite must read! Treading Water creates an emotional firestorm within the reader. It shines the light on the good and the bad in life and proves that one moment can change everything and it’s never too late to find love. Marie Force grabbed my heart and squeezed every ounce of emotion out of it but most importantly her monumental story left me blissful. Treading Water may be fiction but it gives me hope; hope in everyday people and happily ever after. I cannot wait for the next book in this trilogy, Marking Time.\" —Joyfully Reviewed, a \"Recommended Read\" for November 2011!The Treading Water SeriesBook 1: Treading WaterBook 2: Marking TimeBook 3: Starting OverBook 4: Coming Home",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Fiction",
    "Amazon",
    "Family"
  ],
  "author": "Marie Force",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/12982950-treading-water"
}