{
  "title": "Man To Man",
  "description": "Josh Elliot was sick of a nine to five office job and the bad romance that had gone with it. Breaking up after a six month relationship with Luis, his partner and co-worker, Josh decided to make a total change in his life. Yearning the sun and sand, Josh tested to become a Los Angeles County lifeguard.Tanner Cameron was a permanent lifeguard and had made a career out of life-saving and being a paramedic. Divorced for a year after a five year marriage that ended badly, Tanner was trying to be content with his job and stayed away from the advances of the women he worked with. It seemed to Tanner that all the young ladies he met wanted marriage and babies, two things he no longer felt as essential. But Tanner was alone, and not happy about it.When Josh is assigned to Tanner during his mentorship program, Josh instantly falls for the tall, handsome guard in the red swimsuit. The only problem is, Tanner is straight. Very straight. And constantly reminds Josh of that fact when Josh's flirting gets carried away.The attraction and admiration Josh feels for Tanner soon sweeps him away. In a job where distractions can be fatal, Josh and Tanner struggle to keep their focus on the job as the chaos of nearly sixty million visitors flood the California coastline.As Josh’s good looks and seduction tactics begin to find a way through Tanner’s barrier of fear and intimidation, Josh finally makes some headway with the straight stud. But soon Josh wonders if all his efforts are in vain. Tanner is straight and always will be, and any hope Josh has to change him seem insurmountable. Or are they?Can Tanner get over the terror of the label he fears the most and open up his heart to the right partner? Or will he be unable to rescue his heart from a charming lifeguard whose idea of bliss is working it out, man to man?   This is a previously published work. The title, author, and/or publisher may have changed.",
  "genres": [
    "M M Romance",
    "Gay For You",
    "Romance",
    "Contemporary",
    "Gay",
    "Erotica",
    "LGBT"
  ],
  "author": "G.A. Hauser",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/6677462-man-to-man"
}