{
  "title": "Paul McCartney",
  "description": "More than a rock star, more than a celebrity, Paul McCartney is a cultural touchstone. As one half of the legendary Lennon-McCartney songwriting duo, he helped transform popular music, moving from the simplistic pop of \"Love Me Do\" to the avant-garde symphonics of \"A Day in the Life\" to generation-binding anthems such as \"Hey, Jude\" and \"Let It Be.\" Along the way the Beatles ascended from the dank basements of working-class Liverpool to heights of fame and wealth no previous entertainer could ever have imagined.  McCartney's own ambitions fueled much of the group's progress. But even as he steered himself from childhood tragedy to his meeting with John Lennon to the gestation of the Beatles and their rise to international acclaim, the same appetites that drove the group to its greatest creative and commercial heights also served to tear the band members apart.  Still, McCartney's career didn't end with the Beatles' breakup. Nor, for that matter, did the bonds between the Beatles. And in this definitive biography, Peter Ames Carlin examines McCartney's entire life, casting new light not just on the Beatles era, but also on his years with Wings and his thirty-year relationship with his first wife, Linda McCartney. He takes us on a journey through a tumultuous couple of decades in which Paul struck out on his own as a solo artist, reached the top of the charts with a new band, and once again drew hundreds of thousands of screaming fans to his concerts. Carlin presents McCartney as a musical visionary, capable of crafting pop gems such as \"Band on the Run\" and \"Maybe I'm Amazed.\" But he also reveals a layered and often conflicted figure, as haunted by his legacy -- and particularly his relationship with John Lennon -- as he was inspired by it.  Built on years of research and fresh, revealing interviews with friends, bandmates, and collaborators spanning McCartney's entire life, Carlin's lively biography captures the many facets of Paul McCartney and paints a vivid portrait of one of our era's living legends.",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "Audiobook",
    "Biography Memoir",
    "History",
    "British Literature"
  ],
  "author": "Peter Ames Carlin",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/6678031-paul-mccartney"
}