{
  "title": "Blackjack",
  "description": "As darkness fell, Viktor was standing in front of his headquarters. Despite the weather, he was wearing a thick coat made of bear fur and a hat of the same material.    \"Bolshe!\" he barked into a satellite phone. He listened to the response, then said, \"Ne vazhno!\" into the mouthpiece, and thumbed off the phone.    He signaled to a group of men standing close by. A line of five identical midnight blue Audi A8 sedans pulled to the empty curb. As Viktor prepared to enter the back seat of the middle car, the satellite phone in his hand seemed to change color, as if a shroud of shadow had been draped over it. A low sound, outside the human hearing threshold, came, short and     \"убил!\" #    Just before daylight, a Chicago cop stared through the windshield of his cruiser. \"Holy Jumping Jesus Christ! I've been on the force since before you were born, kid. And I've never seen anything like ... that.\"    Both the retirement-age sergeant and the rookie sitting next to him were staring at bodies draped over a row of identical dark blue sedans. Each body had been skinned, graphically displaying that all were missing large bones, from femurs to skulls.    Neither cop noticed the city-camo shark as it slipped past the scene. Running without headlights, it looked more like a shifting shadow than a car.    Inside that shark, Buddha said, \"Someone got to him first, boss.\" His gloved hands delicately fingered the thickly padded steering wheel as his eyes checked the instrument display projected on the lower windshield.    \"Viktor always was an optimist.\"    \"Huh?\"    \"He was a HALO jumper,\" Cross said. \"Absolutely positive his chute would open whenever he decided to pull the chord. This time, the ground got there first.\"    \"Chang sees a picture of this, he'll think you worked some magic, getting it done so fast.\"    \"Yeah. So will the Russians.\"    \" They paid, too?\"    \"More than Chang. The Russian Bear is a sacred icon to them. In their eyes, Viktor was looting a national treasure.\"    \"But it had to be some of their own people doing the actual poaching.\"    \"Sure. But that's their problem, at their end. We only got paid to solve the one at ours.\"    \"Comes out perfect, boss. It's like Viktor's number came up, and we hit that number at the same time.\"    \"Yeah,\" Cross says. \"Perfect.\"    \"What's wrong?\"    \"Come on, Buddha. You saw those bodies yourself. All of a sudden we got partners? Silent partners?\"",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Crime",
    "Action",
    "Noir"
  ],
  "author": "Andrew Vachss",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/12983880-blackjack"
}