{
  "title": "Lincoln for President: An Unlikely Candidate, an Audacious Strategy, and the Victory No One Saw Coming",
  "description": "The untold story of the drama, controversy, and incredible political genius of Lincoln's first presidential campaign In May of 1860, Republican delegates gathered in Chicago for their second-ever convention, with the full expectation of electing William Seward their next presidential candidate. But waiting in the wings was a dark horse no one suspected, putting the final touches on a plan that would not only result in a most unexpected candidacy, but the most brilliant, innovative, and daring presidential campaign in American history. He went by the name of Lincoln. Lincoln for President is the incredible story of how Lincoln overcame overwhelming odds to not only capture his party's nomination but win the presidency. His amazingly modern strategy included the first media campaign blitz, convention tactics that originated the concept of \"Chicago politics,\" and a deft manipulation of the electoral college. His bold tactics changed forever the way presidential campaigns are won…not to mention the course of American history. PRAISE FOR BRUCE CHADWICK \"Dr. Chadwick tells an exciting story… His analysis will provoke further debate about this momentous period in American history.\"Dr. Paul Clemens, Chairman of the Rutgers University Department of History \"In this remarkable new book, Bruce Chadwick reminds us of the three extraordinary men who worked state by state, individual by individual, to ensure passage of the Constitution. It's a fascinating tale, well told.\"Terry Golway, author of Washington's General and Ronald Reagan's America 1858:\"This book is a gem.\"Curled Up With a Good Book \"A gripping narrative.\"Kurt Piehler, author of Remembering War the American Way The First American \"To understand the Revolutionary War, really understand it, read this book.\"Dave R. Palmer, Lieutenant General, U.S. Army (Ret); author of The Way of the Fox George Washington's \"Chadwick pierces the fog of myth that has always surrounded our nation's father.\"Michael Aaron Rockland, professor, Rutgers University",
  "genres": [
    "History",
    "Politics",
    "Civil War",
    "Presidents",
    "Biography",
    "Nonfiction",
    "American History"
  ],
  "author": "Bruce Chadwick",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/6684335-lincoln-for-president"
}