{
  "title": "Draw Close to Jehovah",
  "description": "“Ha llenado un vacío en mi corazón”“QUISIERA transmitirles mi más profundo agradecimiento por el hermoso regalo Acerquémonos a Jehová. La verdad es que ha llenado un vacío en mi corazón, la necesidad de saber que Jehová me ama y me cuida. Ahora me siento mucho más cerca de él y de su amado Hijo. Deseo hablarle a todo el mundo de este libro y dárselo a todos mis seres queridos.” Así se expresó una testigo de Jehová sobre el nuevo libro de 320 páginas presentado en las asambleas de distrito “Celosos proclamadores del Reino”, celebradas en 2002 y 2003. Veamos algunas de sus características y por qué se ha publicado.Características del libro¿Qué contiene esta nueva publicación? Toda la información de los dos artículos de estudio de este número... ¡y muchísimo más! Se compone de 31 capítulos de un tamaño similar al de un artículo de estudio de La Atalaya. Después del prólogo y los primeros tres capítulos, el libro se divide en cuatro secciones, una por cada atributo cardinal de Jehová. Las secciones comienzan explicando en qué consiste esa cualidad en particular, y, a continuación, varios capítulos muestran cómo la manifiesta Jehová. En cada sección hay un capítulo sobre Jesús. ¿Por qué? Pues bien, Jesús dijo: “El que me ha visto a mí ha visto al Padre también” (Juan 14:9). Como reflejo perfecto de Jehová, en Jesús vemos impactantes ejemplos de las cualidades de Dios en acción. Todas las secciones concluyen con un capítulo que nos enseña a imitar la cualidad de Jehová de la que tratan. En su examen de tales atributos divinos, esta nueva publicación hace referencia a todos los libros de la Biblia.El libro Acerquémonos a Jehová también presenta algunas características especiales. En todos los capítulos, excepto en el primero, hay un recuadro titulado “Preguntas para meditar”. Los textos bíblicos y las preguntas que allí aparecen no tienen la finalidad de repasar el capítulo, sino de ayudarnos a emplear la Biblia para meditar profundamente sobre el tema. Le recomendamos que lea con atención todos los pasajes bíblicos citados y entonces reflexione en la pregunta, procurando ver cómo poner por obra lo que aprende. Tal meditación lo conmoverá y lo acercará más y más a Jehová (Salmo 19:14).Las láminas del libro Acerquémonos a Jehová fueron objeto de cuidadosa investigación y preparación a fin de que resultaran instructivas y motivadoras. Diecisiete capítulos contienen hermosas ilustraciones a toda plana de escenas bíblicas.¿Por qué se ha publicado?¿Por qué razón se ha publicado este libro? Su principal propósito es ayudarnos a conocer mejor a nuestro Dios Jehová para así cultivar una relación más estrecha con él.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Spirituality"
  ],
  "author": "Watch Tower Bible and Tract Society",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/6679142-draw-close-to-jehovah"
}