{
  "title": "Conundrum",
  "description": "A happily married man with three small children decides one day he no longer wants to live. He gives himself leukemia and nine months later is dead.This is the conundrum Lisa Sitteroff is determined to solve regarding her dead father—the tale her mother, Ruth, told Lisa and her two brothers, Rafferty and Neal, throughout their childhood. But Lisa, now thirty and watching Raff suffer from the ravages of bipolar illness, believes if she can solve this puzzle, she might somehow save her brother. For Raff’s pain is intrinsically tied up with feelings of parental abandonment. What starts as a noble goal for Lisa soon grows into a vicious family war, wreaking destruction on Lisa’s marriage. Lisa discovers details of her parents’ relationship that her mother has long hidden. Shocking clues appear as Lisa reads a letter her father, Nathan, wrote before he died, prompting her to visit Nathan’s former boss, Ed Hutchinson. From him, Lisa learns that her engineer father helped design a generator run by radioactive materials. Ed lets slip that Nathan participated in a dangerous secret experiment, a fact her mother discounts as Nathan’s cause of death. Accusations and excuses fly. Yet, how much of what Lisa uncovers is true? Is truth solely subjective? Lisa sifts through layers of lies as she journeys into her father’s story, seeking to understand this man she never knew. Meanwhile, her mother responds in fury and tries to destroy Lisa’s life, determined to keep Lisa from uncovering her dark secrets.Conundrum explores the rocky landscape of betrayal and truth, asking whether a search for truth is worth the price, and showing how separating from toxic family members might sometimes be the only recourse for survival. Lisa pays a high price for truth, but in the end finds it worthwhile.",
  "genres": [
    "Fiction",
    "Mystery"
  ],
  "author": "C.S. Lakin",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/12983762-conundrum"
}