{
  "title": "ALPHA…Directions",
  "description": "Dans cet album d'une folle ambition, l'auteur de Leviathan se penche sur les origines du monde. S'appuyant sur une synthèse des connaissances les plus actuelles dans tous les domaines du savoir (astrophysique, biologie, chimie, anthropologie, archéologie, etc.), il raconte l'histoire de la vie sur quatorze milliards d'années, depuis le Big Bang jusqu'à l'émergence des premières civilisations humaines.Passionné depuis le jeune âge par la nature et toutes les formes de vie, Harder donne à voir toutes les procédures et les ruses de l'Evolution, à travers tous les âges de notre monde : Jurassique, Crétacé, Ternaire, Quaternaire, etc. Et il confronte l'état le plus contemporain du savoir avec les croyances et représentations des époques antérieures, souvent naïves ou fantastiques, telles que l'iconographie en porte témoignage. OEuvre d'utilité publique à l'heure où les théories darwiniennes sont remises en cause par un nouvel obscurantisme (et alors que l'on commémore en 2009 le bicentenaire de Darwin), cet ouvrage démontre l'extraordinaire valeur pédagogique de la bande dessinée et s'impose comme une somme artistique impressionnante.Né en 1970 à Weisswasser, Jens Harder étudie les arts graphiques dans une école d'art berlinoise. Depuis 1999, il travaille au sein du collectif d'artistes « Monogatari » dont il est l'un des fondateurs. Il a publié Ruwen Strips et NuAera en 1999, Hotelführer Neue Mitte et Électricité Marseille en 2000. Il figure au sommaire de plusieurs revues et ouvrages collectifs.Déjà parus à l'An 2 : Leviathan (2003 ; nouvelle édition 2005) et La Cité de Dieu (2006). Une monographie sur l'oeuvre de Jens Harder, agrémentée de nombreux inédits, a été publiée en 2007 sous le titre MIKROmakro (Verlag für moderne Künst, Nüremberg).Alpha est le premier volume d'une trilogie. À venir : Beta (Civilisations) et Gamma (Visions).",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Nonfiction",
    "Science",
    "Art",
    "Bande Dessinée",
    "History"
  ],
  "author": "Jens Harder",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/6687683-alpha-directions"
}