{
  "title": "The Conversation: How Black Men and Women Can Build Loving, Trusting Relationships",
  "description": "In his first book for adults, New York Times bestselling author Hill Harper invites you to join the an honest dialogue about the breakdown of African—American relationships. For generations African Americans have turned to their families in times of need—but now, this proud and strong legacy is in peril. Black men and women have stopped communicating effectively and it threatens the very relationships and marriages necessary to sustain the Black family. Today, less than a third of Black children are being raised in two—parent households, a sharp decline from past generations. So, why is it so difficult for Black men and women to build long—term, loving and mutually beneficial relationships? What is happening in the community that makes it so hard for women and men to find their way to each other? And why are there so few people who manage to hold a marriage together, even after finding a person to love?In his moving yet practical book, Hill Harper undertakes a journey both universal and deeply personal in search of answers to these questions. He has conversations with friends and strangers—married, single and divorced—and learns about their private struggles, emotional vulnerabilities, and real concerns, and begins to see common themes emerge. As his journey picks up momentum, Hill begins to recognize his own struggles in other people's stories, and is encouraged to more deeply examine his own relationship issues.Why does so much misinformation and mistrust exist between the sexes? Hill addresses the stereotypes that have developed in the Black community, in the hope that by addressing the challenges, Black men and women can find their way to common ground. The Conversation aims to open up the lines of communication, and offers inspiration to those who want to take control of this crisis and start building successful, sustainable relationships.",
  "genres": [
    "Relationships",
    "Nonfiction",
    "Self Help",
    "African American",
    "Psychology"
  ],
  "author": "Hill Harper",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/6684638-the-conversation"
}