{
  "title": "The Best American Science Writing 2009",
  "description": "Edited by Natalie Angier, the Pulitzer Prize–winning New York Times columnist and bestselling author of Woman: An Intimate Geography, Best American Science Writing 2009 is the ninth edition of the popular annual series hailed as “superb brain candy” (Kirkus) and dedicated to collecting the most crucial, thought-provoking and engaging science writing of the year. Provocative and engaging, the Best American Science Writing 2009 as edited by Angier covers the full spectrum of scientific inquiry—from biochemistry, physics, and astronomy to genetics, evolutionary theory, and cognition.Introduction / by Natalie Angier --The itch / Atul Gawande --Twitchy / Sallie Tisdale --The first ache / Annie Murphy Paul --A journey inside the brain / Oliver Sacks --The truth about autism / David Wolman --Blocking the transmission of violence / Alex Kotlowitz --Reading the wounds / Jina Moore --A cloud of smoke / Jennifer Kahn --War! What is it good for? Absolutely nothing / John Horgan --Face-offs of the female kind / Marina Cords --Tough lessons from golden rice / Martin Enserink --Back to the future / J. Madeleine Nash --A tall, cool drink of ... sewage? / Elizabeth Royte --Contagious cancer / David Quammen --Looking up / Jennifer Margulis --Birdbrain / Margaret Talbot --Want to remember everything you'll ever learn? Surrender to this algorithm / Gary Wolf --Hello, HAL / John Seabrook --The anonymity experiment / Catherine Price --The sky is falling / Gregg Easterbrook --Big brain theory: have cosmologists lost theirs? / Dennis Overbye --The final frontier / Karen Olsson --Perhaps death is proud; more reason to savor life / Theresa Brown --Evolutionists flock to Darwin-shaped wall stain / The Onion",
  "genres": [
    "Science",
    "Nonfiction",
    "Essays",
    "Popular Science",
    "Anthologies",
    "Journalism",
    "Writing"
  ],
  "author": "Natalie Angier",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/6687101-the-best-american-science-writing-2009"
}