{
  "title": "German Literature of the Early Middle Ages",
  "description": "This second volume of the set not only presents a detailed picture of the beginnings of writing in German from its first emergence as a literary language from around 750 to 1100, but also places those earliest writings into a context. The first stages of German literature existed within a manuscript culture, so careful consideration is given to what constitutes the actual texts, but German literature also arose within a society that had recently been Christianized -- through the medium of Latin. Therefore what we understand by literature in Germany at this early period must include a great amount of writing in Latin. Thus the volume looks in detail at Latin works in prose and verse, but with an eye upon the interaction between Latin and German writings. Some of the material in the newly written German language is not literary in the modern sense of the word, but makes clear the difficulties and indeed the triumphs of the establishing of a written literary language. Individual chapters look first at the earliest translations and functional literature in German (including charms and prayers); next, the examination of heroic material juxtaposes the Hildebrandlied with the Christian Ludwigslied and with Latin writings like Waltharius and the panegyrics; Otfrid's work -- the Gospel-poem in German -- is given its due prominence; the smaller German texts and the later prose works are fully treated; as is chronicle-writing in German and Latin. Old High German literature was a trickle compared to the flood of the Latin that surrounded (and influenced) it, but its importance is undeniable: that trickle became a river. Contributors: Linda Archibald, Graeme Dunphy, Stephen Penn, Christopher Wells, Jonathan West, Brian Murdoch. Brian Murdoch is Professor of German at the University of Stirling, Scotland",
  "genres": [],
  "author": "Christopher Wells",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/6688964-german-literature-of-the-early-middle-ages"
}