{
  "title": "The Ode Less Travelled: Unlocking the Poet Within",
  "description": "I have a dark and dreadful secret. I write poetry... I believe poetry is a primal impulse within all of us. I believe we are all capable of it and furthermore that a small, often ignored corner of us positively yearns to try it. —Stephen Fry, The Ode Less Travelled  Stephen Fry believes that if one can speak and read English, one can write poetry. Many of us have never been taught to read or write poetry and think of it as a mysterious and intimidating form. Or, if we have been taught, we remember uncomfortable silence when an English teacher invited the class to \"respond\" to a poem. In The Ode Less Travelled, Fry sets out to correct this problem by giving aspiring poets the tools and confidence they need to write poetry for pleasure.  Fry is a wonderfully engaging teacher and writer of poetry himself, and he explains the various elements of poetry in simple terms, without condescension. His enjoyable exercises and witty insights introduce the concepts of Metre, Rhyme, Form, Diction, and Poetics. Aspiring poets will learn to write a sonnet, on ode, a villanelle, a ballad, and a haiku, among others. Along the way, he introduces us to poets we've heard of, but never read. The Ode Less Travelled is a lively celebration of poetry that makes even the most reluctant reader want to pick up a pencil and give it a try. BACKCOVER: Advanced Praise: “Delightfully erudite, charming and soundly pedagogical guide to poetic form… Fry has created an invaluable and highly enjoyable reference book.” —Publishers Weekly  “A smart, sane and entertaining return to the basics… If you like Fry’s comic manner… this book has a lot of charm… People entirely fresh to the subject could do worse than stick with his cheerful leadership.” —The Telegraph (UK)  “…intelligent and informative, a worthy enterprise well executed.” —Observer (UK)  \"If you learn how to write a sonnet, and Fry shows you how, you may or may not make a poem. But you will unlock the stored wisdom of the form itself.\" —Grey Gowrie, The Spectator (UK)  “…intelligent and informative, a worthy enterprise well executed.” —Observer (UK)",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Writing",
    "Reference",
    "Language",
    "Unfinished",
    "Literature"
  ],
  "author": "Stephen Fry",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/66856.The_Ode_Less_Travelled"
}