{
  "title": "American Original: The Life and Constitution of Supreme Court Justice Antonin Scalia",
  "description": "The first full-scale biography of the Supreme Court’s most provocative—and influential—justice If the U.S. Supreme Court teaches us anything, it is that almost everything is open to interpretation. Almost. But what’s inarguable is that, while the Court has witnessed a succession of larger-than-life jurists in its two-hundred-year-plus history, it has never seen the likes of Supreme Court Justice Antonin Scalia. Combative yet captivating, infuriating yet charming, the outspoken jurist remains a source of curiosity to observers across the political spectrum and on both sides of the ideological divide. And after nearly a quarter century on the bench, Scalia may be at the apex of his power. Agree with him or not, Scalia is “the justice who has had the most important impact over the years on how we think and talk about the law,” as the Harvard law dean Elena Kagan, now U.S. Solicitor General, once put it. Scalia electrifies to hear him speak is to remember him; to read his writing is to find his phrases permanently affixed in one’s mind. But for all his public grandstanding, Scalia has managed to elude biographers—until now. In American The Life and Constitution of Supreme Court Justice Antonin Scalia , the veteran Washington journalist Joan Biskupic presents for the first time a detailed portrait of this complicated figure and provides a comprehensive narrative that will engage Scalia’s adherents and critics alike. Drawing on her long tenure covering the Court, and on unprecedented access to the justice, Biskupic delves into the circumstances of his rise and the formation of his rigorous approach to the bench. Beginning with the influence of Scalia’s childhood in a first-generation Italian American home, American Original takes us through his formative years, his role in the Nixon-Ford administrations, and his trajectory through the Reagan revolution. Biskupic’s careful reporting culminates with the tumult of the contemporary Supreme Court—where it was and where it’s going, with Scalia helping to lead the charge. Even as Democrats control the current executive and legislative branches, the judicial branch remains rooted in conservatism. President Obama will likely appoint several new justices to the Court—but it could be years before those appointees change the tenor of the law. With his keen mind, authoritarian bent, and contentious rhetorical style, Scalia is a distinct and persuasive presence, and his tenure is far from over. This new book shows us the man in his world, his journey, and the far-reaching consequences of the transformed legal landscape.",
  "genres": [
    "Law",
    "Biography",
    "Politics",
    "History",
    "Nonfiction",
    "Biography Memoir",
    "American"
  ],
  "author": "Joan Biskupic",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/6687070-american-original"
}