{
  "title": "Lori's Song: The True Story of an American Woman Held Captive in Iran",
  "description": "Though she endured a childhood of physical and sexual abuse, nothing would ever equal what happened to her in Iran the weeks following 9/11. Lori, an American married to an Iranian, had been working and living as an ordinary member of Iranian society for almost 4 years when she had heard rumors that the U.S. was going to be attacked. That was on September 9, 2001. She tried and failed to call home and give warning. The news that all those rumors were horribly true came on September 11th 2001. That was when her husband suddenly announced that they had to go back to the States in case there were repercussions. On September 12, 2001, Lori and her husband were at the Shiraz bus terminal intending to catch a bus to Istanbul and from there to Heathrow and home to the U.S.A. They were totally unprepared for the convoy of troop carriers that suddenly drove up and the armed men who came pouring out to take the hapless couple prisoner. There was no explanation offered. The men took Lori's husband one direction and she another, pushing them blindfolded into the back of the troop carriers with other prisoners, mostly Iranian. Who the armed men were was anybody's guess but they took their prisoners to POW camp in unfamiliar territory and there, Lori was held, tortured, raped, and starved with them for over a month. Her husband was not to be seen again. Lori was rescued with one of her fellow inmates by the girl's family and, after riding a llama for 1-2 days over mountainous terrain; she arrived at the Iran Immigration center. By then, she weighed in at only 70 pounds, was still suffering from the many injuries she'd received at the hands of her torturers, and wanted badly to get home to her family in the USA. Even then, she had to fight Iranian Islamic bureaucracy to have permission to go, as the husband was unavailable to grant it. In any Islamic country, unknown to many western women, the husband or guardian's permission is always required for a woman to travel anywhere. Lori had been married to Mohammad for 9 years and thought she could trust him but, since their arrival in Iran in 1998, his personality and behavior had changed so radically as to make this most recent nightmare highly suspicious. The events told here are true. It was no coincidence that this American citizen had been placed into a concentration camp. In fact, it raises many questions and should be a caution to many!",
  "genres": [
    "Horror",
    "Travel",
    "Muslimah",
    "Nonfiction",
    "Memoir",
    "Biography"
  ],
  "author": "Lori Foroozandeh",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/6687062-lori-s-song"
}