{
  "title": "Sex, Botany, and Empire: The Story of Carl Linnaeus and Joseph Banks",
  "description": "Enlightenment botany was replete with sexual symbolism―to the extent that many botanical textbooks were widely considered pornographic. Carl Linnaeus's controversial new system for classifying plants based on their sexual characteristics, as well as his use of language resonating with erotic allusions, provoked intense public debate over the morality of botanical study. And the renowned Tahitian exploits of Joseph Banks―whose trousers were reportedly stolen while he was inside the tent of Queen Oberea of Tahiti―reinforced scandalous associations with the field. Yet Linnaeus and Banks became powerful political and scientific figures who were able to promote botanical exploration alongside the exploitation of territories, peoples, and natural resources. Sex, Botany, and Empire explores the entwined destinies of these two men and how their influence served both science and imperialism.Patricia Fara reveals how Enlightenment botany, under the veil of rationality, manifested a drive to conquer, subdue, and deflower―all in the name of British empire. Linnaeus trained his traveling disciples in a double mission―to bring back specimens for the benefit of the Swedish economy and to spread the gospel of Linnaean taxonomy. Based in London at the hub of an international exchange and correspondence network, Banks ensured that Linnaeus's ideas became established throughout the world. As the president of the Royal Society for more than forty years, Banks revolutionized British science, and his innovations placed science at the heart of trade and politics. He made it a policy to collect and control resources not only for the sake of knowledge but also for the advancement of the empire. Although Linnaeus is often celebrated as modern botany's true founder, Banks has had a greater long-term impact. It was Banks who ensured that science and imperialism flourished together, and it was he who first forged the interdependent relationship between scientific inquiry and the state that endures to this day.",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "Biography",
    "Nature",
    "Biology",
    "Plants"
  ],
  "author": "Patricia Fara",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/668973.Sex_Botany_and_Empire"
}