{
  "title": "Trans-Atlantyk",
  "description": "Trans-Atlantyk  Text by Witold Gombrowicz Translated by Carolyn French and Nina Karsov   Witold Gombrowicz (1904-1969), novelist, essayist, and playwright, is considered by many to be the most important Polish writer of the twentieth century. Author of four novels, several plays, and a highly acclaimed Diary, he was a candidate for the Nobel Prize in literature in 1968. Trans-Atlantyk is a semi-autobiographical, satirical novel that throws into heightened perspective all of Gombrowicz's major literary, philosophical, psychological, and social concerns. First published in Paris in 1953, it is based on the author's experience of being caught in Argentina at the outbreak of World War II. The narrator finds himself alone, without family and friends, at odds with the Argentinian literary world and with Polish émigré society. Throughout the book, Gombrowicz ridicules the self-centered pomposity of the Polish community in Argentina. More than this, he explores with prophetic vision the modern predicament of exile and displacement in a disintegrating world. \"Gombrowicz's language-abetted by this ingenious translation-subverts language and ideas to a cosmic meltdown, as if in a fun-house mirror. Gombrowicz manages to befuddle, amuse, insult and astonish with this tale of exile, uprootedness and identity.\" ~ Susan Miron, Boston Globe Witold Gombrowicz has received high praise from his contemporaries-ranging from Milan Kundera, who called him \"one of the great novelists of our century,\" to John Updike, who asserted he was \"one of the profoundest of the late moderns.\" His other novels, Ferdydurke, Pornografia, and Cosmos, his plays, and the three-volume Diary have together been translated into over thirty languages. Publishing Yale University Press, New Haven & London, 1995 SoftCover book measuring 5.5\" x 8.25\" x 0.25\" 122 pages English Language Version",
  "genres": [
    "Polish Literature",
    "Fiction",
    "Classics",
    "Poland",
    "Novels",
    "Literature",
    "School"
  ],
  "author": "Witold Gombrowicz",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/66918.Trans_Atlantyk"
}