{
  "title": "Commentary on the New Testament Use of the Old Testament: A Comprehensive Bible Commentary on Old Testament Quotations, Allusions & Echoes That Appear from Matthew through Revelation",
  "description": "An Exploration of Old Testament Quotations, Allusions, and Echoes Occurring from Matthew through Revelation\"This really is a new sort of commentary! For the first time we are given a continuous exegetical reading of the way each New Testament book quotes, alludes to, and evokes the Old Testament Scriptures. This volume will be an immensely useful resource for all kinds of study of the New Testament.\"—Richard Bauckham, University of St. Andrews\"Every scholar would profit by having a copy of this thorough and judicious work on his or her desk. The authors have collected for us an immense amount of material and insight in a relatively short space, and many of us will be grateful for their efforts. This commentary is a profound witness to the unity of the Testaments in the mystery of Christ.\"—Francis Martin, Sacred Heart Seminary\"Finally a volume that surveys the use of the Old Testament in each book of the New Testament. Written by top-tier scholars with unsurpassed expertise in New Testament exegesis, these essays model sound engagement with Scripture that quotes Scripture. This excellent collection is a must-read for all who wish to understand how the New Testament writers understood and used their Bible. This long-awaited volume deserves to become a standard text that will hopefully launch a new stage of fresh work in biblical research.\"--Karen H. Jobes, Wheaton College\"More than a generation ago, C. H. Dodd and a few other scholars began sowing the seeds of a new and fruitful approach to reading Scripture, by studying the New Testament writers' use of Old Testament texts. The present commentary thus represents the harvest of decades of research into the relationship between the Old and New Testaments. By carefully observing various factors, ranging from the textual to the theological, each contributor shows how the New Testament writers were not only careful readers of the Old Testament but also profound theologians themselves. The scholars on this superb team assembled by Beale and Carson distill many new and remarkable insights for exegesis and theology, all of which serve to demonstrate the explanatory power of this approach for the present and the future. This landmark volume should prove to be an invaluable resource for both the church and the academy--for pastors, teachers, and students alike, whether Protestant or Catholic--and for anyone wanting to go deeper into the heart of sacred Scripture. Indeed, Beale and Carson are to be thanked and congratulated for a momentous accomplishment.\"--Scott Hahn, Franciscan University of Steubenville\"Finally we have a work that examines the use of the Old Testament in the New Testament and covers the entirety of the New Testament in a single volume. Pastors, students, and scholars will profit from the careful attention to both the Old and New Testament contexts in which the citations occur, and they will be enriched by the theological depth represented in this important book.\"--Thomas R. Schreiner, Southern Baptist Theological Seminary\"Few areas of New Testament study are as often discussed as the New Testament's use of the Old. There has long been a need for a careful case-by-case treatment, since the use we see in the New Testament is so varied and diverse. This commentary meets that need admirably. It is thorough yet concise, clear yet detailed. All will be led into helpful reflection on this important area of study. Well done to the editors and authors of this useful and unique commentary.\"--Darrell L. Bock, Dallas Theological Seminary",
  "genres": [
    "Theology",
    "Reference",
    "New Testament",
    "Christian",
    "Christianity",
    "Old Testament",
    "Religion"
  ],
  "author": "Gregory K. Beale",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/669293.Commentary_on_the_New_Testament_Use_of_the_Old_Testament"
}