{
  "title": "Gabriel's Rule",
  "description": "March 2003A clandestine mission in the Middle East goes terribly wrong. An elite American soldier is captured and forced to endure excruciating torture. One thought keeps him alive. He will spend the rest of his life hunting down and killing those who betrayed him.Present DayAmerica is under attack. The wealthiest of the country are targets of an elite killer. He is a master of guile and disguise. He elevates assassination to an art. His name; Gabriel.The first to die would be the easiest. A blast from a cyanide cannon and the billionaire is dead before he hits the deck of his yacht. The next four would be the ultimate challenge.The assassination of one of America's privileged sends shock ways through the corridors of Washington. Could this be a clever attack by al Qaeda? The one person who foresaw the scenario is brought in to head off the possible threat. She is Alexis Brassly, a brilliant, yet acerbic, expert on terrorism. Once a rising star within the FBI she must cross bridges that she long since burned.The President also brings in the one man he can trust to eliminate a master killer. Bill Bowman's shadowy and lethal past makes him the perfect foil to Gabriel. For Bowman, hunting the ultimate assassin is his heaven, but working with Alexis Brassly is his hell. She is the woman he both loves and hates.Alexis and Bill's hunt spans the country. Gabriel eludes his pursuers and pulls off one spectacular killing after another. The world believes al Qaeda is responsible for the assassinations. No one suspects that other forces are at work. Forces within the government itself. This cabal works to ensure that Gabriel completes his revenge and will eliminate anyone who suspects their collusion with pre-war Iraqi leaders.Gabriel's executions escalate into stunning events horrifying the nation. The media thinks of him as the Angel of Death. Inside halls of power he is known as, The Ghost.The closer Alexis and Bill get to The Ghost, the closer they get to the truth. The puppet masters cannot allow the truth to ever be told. Alexis and Bill now become targets in this intricate web of deceit and greed.Only one man knows the entire truth. Only one man controls the lives and destiny of so many. They will all live or die by Gabriel’s Rule.",
  "genres": [],
  "author": "Bret Paris",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/10322595-gabriel-s-rule"
}