{
  "title": "What We See: Advancing the Observations of Jane Jacobs",
  "description": "A timely revisitation of renowned urbanist-activist Jane Jacobs' lifework, What We See invites thirty pundits and practitioners across fields to refresh Jacobs' economic, social and urban planning theories for the present day. Combining personal and professional observations with meditations on Jacobs' insights, essayists bring their diverse experience to bear to sketch the blueprints for the living city.The book models itself after Jacobs' collaborative approach to city and community building, asking community members and niche specialists to share their knowledge with a broader community, to work together toward a common goal of building the 21st-century city.The resulting collection of original essays expounds and expands Jacobs' ideas on the qualities of a vibrant, robust urban area. It offers the generalist, the activist, and the urban planner practical examples of the benefits of planning that encourages community participation, pedestrianism, diversity, environmental responsibility, and self-sufficiency.Bob Sirman, director of the Canada Council for the Arts, describes how built form should be an embodiment of a community narrative. Daniel Kemmis, former Mayor of Missoula, shares an imagined dialog with Jacobs, discussing the delicate interconnection between cities and their surrounding rural areas. And Roberta Brandes Gratz?urban critic, author, and former head of Public Policy of the New York State Preservation League?asserts the importance of architectural preservation to environmentally sound urban planning practices.What We See asks us all to join the conversation about next steps for shaping socially just, environmentally friendly, and economically prosperous urban communities.",
  "genres": [
    "Nonfiction",
    "Urbanism",
    "Architecture",
    "Cities",
    "Urban Studies"
  ],
  "author": "Stephen A. Goldsmith",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/6695710-what-we-see"
}