{
  "title": "A New Literary History of America",
  "description": "America is a nation making itself up as it goes along a story of discovery and invention unfolding in speeches and images, letters and poetry, unprecedented feats of scholarship and imagination. In these myriad, multiform, endlessly changing expressions of the American experience, the authors and editors of this volume find a new American history.In more than two hundred original essays, \"A New Literary History of America\" brings together the nation s many voices. From the first conception of a New World in the sixteenth century to the latest re-envisioning of that world in cartoons, television, science fiction, and hip hop, the book gives us a new, kaleidoscopic view of what Made in America means. Literature, music, film, art, history, science, philosophy, political rhetoric cultural creations of every kind appear in relation to each other, and to the time and place that give them shape.The meeting of minds is extraordinary as T. J. Clark writes on Jackson Pollock, Paul Muldoon on Carl Sandburg, Camille Paglia on Tennessee Williams, Sarah Vowell on Grant Wood s \"American Gothic,\" Walter Mosley on hard-boiled detective fiction, Jonathan Lethem on Thomas Edison, Gerald Early on \"Tarzan,\" Bharati Mukherjee on \"The Scarlet Letter,\" Gish Jen on \"Catcher in the Rye,\" and Ishmael Reed on \"Huckleberry Finn.\" From Anne Bradstreet and John Winthrop to Philip Roth and Toni Morrison, from Alexander Graham Bell and Stephen Foster to Alcoholics Anonymous, \"Life,\" Chuck Berry, Alfred Hitchcock, and Ronald Reagan, this is America singing, celebrating itself, and becoming something altogether different, plural, singular, new.Please visit www.newliteraryhistory.com for more information. \"",
  "genres": [
    "History",
    "Nonfiction",
    "Essays",
    "American History",
    "Literature",
    "Literary Criticism",
    "Books About Books"
  ],
  "author": "Greil Marcus",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/6694761-a-new-literary-history-of-america"
}