{
  "title": "Formação do Brasil Contemporâneo",
  "description": "Formação do Brasil contemporâneo é dos textos mais influentes sobre as relações entre nação e colônia no processo histórico que originou o Brasil. E é a ele, sobretudo, que Caio Prado Jr. deve seu lugar como grande intérprete do país.Marxista e militante ligado ao Partido Comunista Brasileiro (PCB), o autor não via, porém, o materialismo histórico como um conjunto de fórmulas a serem aplicadas, sem mediações históricas e analíticas, a qualquer realidade. Isso o levou, aguçado por uma grande sensibilidade em relação ao Brasil, desenvolvida também nas muitas viagens que fez pelo país e pelo gosto em fotografá-lo, a promover uma verdadeira \"nacionalização do marxismo\".Publicado em 1942, Formação do Brasil contemporâneo é um clássico do pensamento social e da historiografia brasileira que vem mobilizando estudiosos e atores políticos, seja para aceitar suas teses, problematizá-las ou mesmo rejeitá-las. Como poucos, o livro conseguiu formar nossa visão das origens coloniais do Brasil e do seu legado à nação. Divergindo daqueles que entendiam o período colonial em termos equivalentes ao feudalismo na Europa, Caio Prado Jr. o situa no processo de expansão ultramarina europeia resultante do capitalismo mercantil. Explicação tão bem-sucedida que dificilmente alguém acreditaria hoje num passado feudal brasileiro.Mas este livro é um clássico também pelo que nos permite entender de certos desafios tenazes, ainda hoje abertos à sociedade. Sua tese fundamental é a de \"sentido da colonização\", que expressa a reiteração, mesmo após a nossa independência política, do papel do Brasil como fornecedor de produtos primários demandados pelo mercado externo. Apesar das mudanças em curso desde então, e das novas configurações da cada vez mais complexa dialética entre centro e periferia, talvez bastasse constatar a importância no Brasil de hoje das commodities agrícolas e minerais para sugerir a atualidade da análise central do livro.",
  "genres": [
    "History",
    "Nonfiction",
    "Brazil",
    "Sociology",
    "Politics",
    "Classics",
    "Economics"
  ],
  "author": "Caio Prado Jr.",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/6695877-forma-o-do-brasil-contempor-neo"
}