{
  "title": "Power of the Dog: Things Your Dog Can Do That You Can't",
  "description": "“They’re so human!” we emote. But recent scientific findings point to dogs being very different than us humans. Dogs can do many things that we can’t, including things that we’d like to do but just don’t know how to. Among them are predicting earthquakes, picking up foreign languages almost instantly, detecting cancer and low blood sugar in humans, and even sensing impending death. The latest research points to dogs being able to do all these things naturally, and with training they can perform other amazing feats—some at a level surpassing humans or high-tech equipment. Power of the Dog relates up-to-date scientific findings in canine research and reveals how dogs perform extraordinary feats that even twenty-first century technology cannot duplicate. The fascinating stories Les Krantz offers in this volume reveal the remarkable powers of dogs, many of which we are just discovering. The anecdotal accounts in his text are accompanied by well-researched explanations by some of the world’s foremost canine behaviorists, zoologists, veterinarians, and scientists in many disciplines who have dedicated their careers to learning how dogs do what they do…sometimes a lot better than us. We have long known about the canine’s superior sense of smell and dogs' ability to hear what we often cannot. Scientists are finding that the dog’s enhanced sensory system explains many of its heretofore unexplained powers. But dogs also seem to possess a mysterious “sixth sense.” These mysterious powers have long puzzled animal behaviorists. Power of the Dog puts forth the latest theories of these unsolved mysteries, citing fascinating examples of how dogs achieve diverse feats, ranging from reading human emotions to sensing lingering threats to their masters to finding their way home from afar. Whether you are a scientist, an individual who works in the veterinary field, or a dog lover, Power of the Dog will both inform you and captivate you. It is a wonderful read that you will reflect on every time a dog amazes you with its incredible powers.",
  "genres": [
    "Dogs",
    "Animals"
  ],
  "author": "Les Krantz",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/6693704-power-of-the-dog"
}