{
  "title": "Republican Gomorrah: Inside the Movement that Shattered the Party",
  "description": "Over the last year, award-winning journalist and videographer Max Blumenthal has been behind some of the most sensational (and funniest) exposés of Republican machinations. Whether it was his revelation that Sarah Palin was \"anointed\" by a Kenyan priest famous for casting out witches, or his confronting Republican congressional leaders and John McCain's family at the GOP convention about the party's opposition to sex education (and hence, the rise in teen pregnancies like that of Palin's daughter), or his exposé of the eccentric multimillionaire theocrat behind California's Prop 8 anti-gay marriage initiative, Blumenthal has become one of the most important and most constantly cited journalists on how fringe movements are becoming the Republican Party mainstream.Republican Gomorrah is a bestiary of dysfunction, scandal and sordidness from the dark heart of the forces that now have a leash on the party. It shows how those forces are the ones that establishment Republicans-like John McCain-have to bow to if they have any hope of running for President. It shows that Sarah Palin was the logical choice of a party in the control of theocrats. But more that just an expose, Republican Gomorrah shows that many of the movement's leading figures have more in common than just the power they command within conservative ranks. Their personal lives have been stained by crisis and scandal: depression, mental illness, extra-marital affairs, struggles with homosexual urges, heavy medication, addiction to pornography, serial domestic abuse, and even murder. Inspired by the work of psychologists Erich Fromm, who asserted that the fear of freedom propels anxiety-ridden people into authoritarian settings, Blumenthal explains in a compelling narrative how a culture of personal crisis has defined the radical right, transforming the nature of the Republican Party for the next generation and setting the stage for the future of American politics.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Religion",
    "History",
    "United States",
    "American History",
    "Political Science"
  ],
  "author": "Max Blumenthal",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/6693566-republican-gomorrah"
}