{
  "title": "Seed",
  "description": "It’s the dawn of the 22nd century, and the world has fallen apart. Decades of war and resource depletion have toppled governments. The ecosystem has collapsed. A new dust bowl sweeps the American West. The United States has become a nation of migrants—starving masses of nomads roaming across wastelands and encamped outside government seed distribution warehouses. In this new world, there is a new power: Satori. More than just a corporation, Satori is an intelligent, living city risen from the ruins of the heartland. She manufactures climate-resistant seed to feed humanity, and bio-engineers her own perfected castes of post-humans Designers, Advocates and Laborers. What remains of the United States government now exists solely to distribute Satori product; a defeated American military doles out bar-coded, single-use seed to the nation’s hungry citizens. Secret Service Agent Sienna Doss has watched her world collapse. Once an Army Ranger fighting wars across the globe, she now spends her days protecting glorified warlords and gangsters. As her country slides further into chaos, Doss feels her own life slipping into ruin. When a Satori Designer goes rogue, Doss is tasked with hunting down the scientist-savant—a chance to break Satori’s stranglehold on seed production and undo its dominance. In a race against Satori’s genetically honed assassins, Doss’s best chance at success lies in an unlikely alliance with Brood—orphan, scavenger and small-time thief—scraping by on the fringes of the wasteland, whose young brother may possess the key to unlocking Satori’s power. As events spin out of control, Sienna Doss and Brood find themselves at the heart of Satori, where an explosive finale promises to reshape the future of the world.",
  "genres": [
    "Science Fiction",
    "Dystopia",
    "Fiction",
    "Post Apocalyptic",
    "Speculative Fiction",
    "Apocalyptic",
    "Science Fiction Fantasy"
  ],
  "author": "Rob Ziegler",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/12986297-seed"
}