{
  "title": "Jenniemae & James: A Memoir in Black and White",
  "description": "James Newman was a brilliant mathematician, the man who introduced the mathematical concept “googol” and “googolplex” (aka “google” and “googleplex”) to the world, and a friend of Einstein’s. He was also a notorious philanderer with an insatiable appetite for women and fast cars, a man who challenged intellectual and emotional limits, and a man of excess who oftentimes fell victim to his own anxiety. Jenniemae Harrington was an uneducated, illiterate African American maid from Alabama who began working for the Newman family in 1948—and who, despite her devout Christianity, played the illegal, underground lottery called “policy,” which she won with astonishing frequency. Though highly implausible, these two dissimilar individuals developed a deep and loyal friendship, largely because of their common love of numbers and their quick wits.Theirs was a friendship that endured even during an era when segregation still prevailed. For James, Jenniemae provided a particular ease and shared sense of irreverent humor that he found difficult to duplicate with his beautiful, intelligent, and artistic wife, Ruth. And when the Newman home was darkened by the tensions of the political climate during the Cold War, or by James’s affairs, or by Ruth’s bouts of depression, it was Jenniemae who maintained the point of gravity, caring for the family’s children when their parents were often lost in their own worlds. From Jenniemae’s perspective, James offered more than just a steady income. He became an unlikely and loyal friend. He taught her to read, and he drove her to and from his upscale suburban house and her home in the impoverished section of Washington, D.C. (and sometimes, much to her chagrin, in his Rolls-Royce), after she had been raped by a white bus driver. Intrigued by her uncanny wins at the lottery, James even installed a second telephone line in the house so that Jenniemae could keep track of her bets—a decision that raised a few eyebrows at the time.It is this extraordinary relationship that the Newmans’ daughter, Brooke, reveals in Jenniemae & James, as she elegantly weaves together the story of two very distinct and different people who each had a significant impact on her upbringing. In doing so, she also paints a vivid political and cultural picture of the time—when the world was terrified by the possibility of nuclear war; when America was reeling from the McCarthy hearings; when technological advances like televisions, satellites, and interstate highways were changing the country; when America was just beginning to venture into Vietnam; and when African Americans were still considered second-class citizens with limited rights, before the explosion of racial tensions in the early 1960s. Jenniemae & James is an inspiring, heartwarming memoir about friendship and love across the racial barrier.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "History"
  ],
  "author": "Brooke Newman",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/6697007-jenniemae-james"
}