{
  "title": "The Culprits",
  "description": "Hank Wallins is a broken man working the night shift in a meaningless job. Tormented by the tinnitus constantly ringing in his ears, he sleepwalks through life, too scarred by a tragic love affair to try again. When a madman pushes him into the path of an oncoming subway train, this scrape with death re-awakens Hank to the world. Craving a reengagement with passion, he reaches out to a young slightly cross-eyed Russian beauty who he locates on a website. He ventures by plane to meet the lovely and mysterious Anna in her hometown of St. Petersburg.Anna Verkoskova seeks to flee not only the hopelessness of her economic situation, but also the reminders of her own failed love affair with Ruslan, a womanizing Dagastani rock star look-alike from the Chechen region. Finding no particular reason to dislike the kind, lumbering Hank, she agrees to follow him to Canada. But once she has left Russia behind, she is overwhelmed by homesickness and a dread of disappearing into the grey Toronto winter. Then she receives a frightening Ruslan has been kidnapped. She races home immediately, carrying a bag stuffed with cash. Hank’s cash.Held captive and tortured by the FSB, Ruslan has been crippled by his tormentors and injected with N20, a mysterious CIA-developed serum that fills its victims’ brains with the totality of human knowledge, rendering them insane. Ruslan is traded to Chechen radicals and ransomed. As Anna is now associated with a “rich” Westerner, she is now a target for the ransom. Ruslan’s former political disengagement has been replaced by a new sort of apathy, one that renders him a pawn to whomever has control of the omniscient demons in his ears screaming for blood.Returned to St. Petersburg and reunited with Ruslan, Anna quickly realizes that her former lover has been lost to her forever, as has her nation. With few options, she returns to the safety of Hank and Canada and discovers that, with her passion for Ruslan faded, she has room for new passions to emerge. But she also carries with her a life-altering secret.The novel unfolds through the words of a narrator who describes himself as an abomination, yet he is heroic and compassionate, and capable of immense acts of love, including the creation of this very narrative itself–a gift for his unborn half-sister. His horrors have been formed as a result of untold millennia of blood hatred. But it is through his existence that our protagonists transcend their own human culpability.A kaleidoscopic and riotous tale, voiced by one of the most unusual narrators in literary history, Robert Hough’s The Culprits puts shape and flesh to the murky unknowns surrounding a real-life terrorist incident and all that led up to it, shining a light into some of humanity’s most inscrutable sins. This novel is at once a mind-blowing hallucination and a classic love story, exploring the human thirsts for love and passion, for allegiance and trust, and for terrible vengeance.",
  "genres": [
    "Fiction",
    "Canada"
  ],
  "author": "Robert Hough",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/670075.The_Culprits"
}