{
  "title": "Lucinella",
  "description": "Intelligence turns me on.Lore Segal's tour de force look at the New York literary scene was a hit when it was first released in the 1970s, winning the praise of the literary elite. John Garnder called it “magical.” William Gass said it was “witty, elegant, beautiful.” Stanley Elkin called it “a shamelessly wonderful novel, so flawless one feels civilized reading it.”It's been a cult classic ever since, and appears here in its full, original text, as fresh as the story of the whimsical New York poet Lucinella and her adventures among the literati. It starts at Yaddo writers colony, where life is idyllic, meals are served to you in your rooms, and cocktails are ready at day's end … and still the writers complain and compete. Then it moves back to New York City, where the pampered once again face reality, and Will a different husband … or the right publisher … or the perfect filing system … put life in order?Lucinella and her circle feel lacking and keep looking, busily going to parties and watching one another 's lives closely for signs of happiness, love and despair.Segal depicts it all with a perfect blend of love and malice. And at the center is Lucinella herself, so full of humanity and frailty that these divertissements do her to death. “Here,” as Cynthia Ozick says, “is the enchanted microcosm, the laughter of mortality.”The Contemporary Art of the Novella series is designed to highlight work by major authors from around the world. In most instances, as with Imre Kertész, it showcases work never before published; in others, books are reprised that should never have gone out of print. It is intended that the series feature many well-known authors and some exciting new discoveries. And as with the original series, The Art of the Novella, each book is a beautifully packaged and inexpensive volume meant to celebrate the form and its practitioners.",
  "genres": [
    "Fiction",
    "Novella",
    "Short Stories",
    "Literature",
    "Novels",
    "New York",
    "Literary Fiction"
  ],
  "author": "Lore Segal",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/6697955-lucinella"
}