{
  "title": "الجامع بين العلم والعمل النافع في صناعة الحيل",
  "description": "كان كتاب الجزري \"الجامع بين العلم والعمل النافع في صناعة الحيل\" من أوائل الكتب التي عكف معهد التراث العلمي العربي على تحقيقها. والكتاب واحد من أهم كتب الهندسة الميكانيكية العربية، إن لم يكن أهمها على الإطلاق. ونشر ضمن سلسلة تاريخ التكنولوجيا العربية التي يصدرها المعهد. وهذه السلسلة واحدة من عدة سلاسل تشكل بمجملها مجموعة \" مصادر ودراسات في تاريخ العلوم العربية الإسلامية\" التي تصدر عن المعهد. يقول سارتون عن كتاب الجزري \" هذا الكتاب أكثر الأعمال تفصيلا من نوعه، ويمكن اعتباره الذروة في هذا المجال بين الإنجازات الإسلامية\". ويتسم الكتاب بالطابع العملي. فقد كان الجزري مهندسا وصانعا ماهرا في آن واحد. والكتاب غني بالوصف الدقيق لمختلف أنواع الآلات. ومن هنا فإن أهميته لا يمكن أن تقدر بثمن بالنسبة لتاريخ الهندسة في العالم. ويقول هيل: \" لم تكن بين يدينا حتى العصور الحديثة أية وثيقة، من أية حضارة أخرى في العالم، فيها ما يضاهي ما في كتاب الجزري من غنى في التصاميم وفي الشروحات الهندسية المتعلقة بطرق الصنع وتجميع الآلات\". وفي مراجعته للترجمة الإنكليزية لكتاب الجزري يقول برايس بعد مطالعته للكتاب:\" إن أهم انطباع يكونه المرء هو أن هذه التكنولوجيا الفنية للألعاب الفلسفية التي سارت على منهج هيرون الاسكندراني ليست نوعا من اللهو التافه لمجتمع مترف أو مجتمع يكثر فيه استخدام العبيد بحيث تشغل الناس وتصرفهم عن الاهتمام بالآلات المفيدة، بل إنها تمثل الاتجاه أو التيار الرئيسي للمهارات الميكانيكية الدقيقة التي استمرت وازدهرت في الأجيال اللاحقة في ورشات صانعي الساعات وصانعي الأجهزة العلمية، تلك التكنولوجيا التي كانت القوة الدافعة الأساسية وراء كل من الثورتين العلمية والصناعية، وما من شك أننا نجد أمامنا في هذا الكتاب مجموعة من الآليات المبدعة المستندة إلى ذخيرة كبيرة وافرة من أنواع حلقات الآلات والوسائل الهيدروليكية والمهارات الميكانيكية المعقدة الأخرى التي لا بد وأنها انتقلت من الصانع المعلم إلى التلميذ جيلا بعد جيل، والتي انتقلت كذلك من خلال كتب من نوع هذا الكتاب\". وفي مجال مناقشة هذه المسألة بالذات لا بد من ذكر بعض الأمثلة على أن بعض ما وصفه الجزري في كتابه كان منفذا ومطبقا في أنحاء مختلفة من العالم الإسلامي، فالساعة الأولى التي وصفها الجزري في كتابه (وهي أهم آلاته) تشبه إلى حد بعيد ساعة باب حبيرون في دمشق التي صنعها محمد الساعاتي بين عامي 1146م و1169م أي قبل ازدهار الجزري مباشرة، والتي ألف عنها ابنه رضوان كتابا في عام 600 هـ (1203م) أي نفس عهد الجزري. وقد وصف ابن حبير هذه الساعة في عام 1184م ووصفها الرحالة الآخرون مثل القزويني وابن بطوطة. كان عمل الجزري حلقة في سلسلة من أعمال المهندسين العرب ومن سبقهم من مهندسي الحضارات السابقة للإسلام. ولكن الجزري لم يستوعب فقط فنون من سبقوه من المهندسين العرب وغيرهم، ولكنه كان مهندسا مبدعا أيضا أضاف إلى ما كان معروفا واخترع كثيرا من الآلات والوسائل الميكانيكية والهيدروليكية. ولا تزال آثار هذا التأثير في الهندسة الميكانيكية المعاصرة ظاهرة إلى اليوم. وتجدر الإشارة إلى أن الجزري كتب كتابه بلغة عربية سليمة، علمية، هندسية خلت من التكلف الأدبي.",
  "genres": [
    "Science",
    "History"
  ],
  "author": "ابن الرزاز الجزري Ibn al-Razzaz al-Jazari",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/6699891"
}