{
  "title": "Captain America: Truth - Red, White & Black",
  "description": "In 1940, Joe Simon and Jack Kirby created Captain America, a frail patriot who was transformed by a \"super-soldier serum\" into a physically perfect specimen to champion freedom, an American alternative to the Nazi uebermensch. Now, writer Morales pursues this idea and also draws inspiration from U.S. government experiments in the 1930s that left unwitting African-Americans infected with syphilis, leading to many deaths. Beginning his story in 1940, Morales incisively depicts the racism his various African-American characters confront both in civilian life and in the military. These black soldiers are compelled to act as test subjects for the super-soldier serum; some die, while others become deformed. Ultimately only one survives, Isaiah Bradley. Substituting for Captain America on a mission, Bradley discovers Jewish concentration camp inmates subjected to experiments. Ranging from heroic figures to pointed caricatures, artist Baker makes his varied styles gel. Drawing on copious research, Morales dramatizes how racism corrupted American history, yet verges close to asserting moral equivalency between America and Nazi Germany. Roosevelt was ultimately in charge of the super-soldier program: would he have approved these human experiments? Besides, how can one talk about \"truth\" regarding a fictional creation? Simon and Kirby devised a fable about an American everyman tapping his inner strength to combat genocidal fascism; Kirby helped pioneer positive depictions of blacks in comics. By adding Morales's backstory to Captain America's origin, Marvel has turned the character into a white superman who owes his powers to the deaths and exploitation of African-Americans.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Marvel",
    "Fiction",
    "Superheroes",
    "Graphic Novels Comics",
    "Comic Book"
  ],
  "author": "Robert Morales",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/670341.Captain_America"
}