{
  "title": "Awesome African Adventure",
  "description": "The Thrilling Adventure of a Young Girl and her Tiny Dog Malia has never seen an elephant stampede. She has never experienced scorpions, native rituals, spy plots, pirates or thieves. All that is about to change when too-curious Malia discovers the truth about her father half way around the world. Now hunted and haunted, Malia and her tiny dog, Teacup, race into hilarious and dangerous misadventures in the African jungle. Will Malia and Teacup survive their heart pounding challenges? Can Malia learn to value herself with the help of her eccentric grandparents? Or, will the evil Inspector ruin everything?\"Action packed adventure with one escapade after another, a terrific read for children from 9 to 13.\" Lynn Nolan, M.Ed. 34 years in elementary education. BOOKS THAT MAKE A DIFFERENCE WITH PSYCHOLOGICAL ARMOR FOR KIDS How can an adventure book empower children and make them safer? \"A spoonful of adventure makes the psychology go down,\" according to Dr. Molly Barrow, author of relationship books, Matchlines for Singles and Matchlines for Step Parenting and practicing psychotherapist. Just as Mary Poppins helped children take their medicine with a little sugar, Barrow uses exciting adventure books to embed subtle positive messages about building self esteem. \"Self esteem is the single most important factor for the safety of a child. Parents and educators should concentrate their efforts on inspiring children to value their self worth rather than compliance,\" says Barrow. \"High self esteem is psychological armor for children.\" Dr. Barrow's new fiction book for children, Malia and Teacup Awesome African Adventure illustrates complicated problem solving and demonstrates how to \"stay safe by staying strong.\" Malia's journey of self discovery is a fast paced and fun book to read, yet, the 342 page book with 30 illustrations contains hidden self esteem building messages. The book introduces young readers, ages 9 to 13, to important life lessons through the comedic misadventures of Malia and her tiny poodle. During the past twenty years counseling families, Dr. Barrow has used humorous storytelling to explain complicated therapy concepts to young children and troubled teenagers. Children responded so well to her stories utilizing the Barrow Empowerment Theory that Dr. Barrow created the Malia and Teacup trilogy to reach more children. How a child values themselves is the first line of defense in dangerous situations against school bullies, predators, and abuse. \"Prevention psychology is what we need now. Children must believe they deserve to be treated well,\" says Barrow. Experts link low self esteem with drug and alcohol use, rebellion, suicide and school dropouts. The book and web site provide parents and teachers help with challenging discussion topics. L. A. psychologist and author Gerald Amada says, \"Exciting books with social and moral themes, like Malia and Teacup and Harry Potter do have the effect of improving self esteem in children and will become a part of the large corpus of children's literature that fosters their emotional well being.\" \"Teachers, this book can lead to some great discussions, role playing and writing assignments. Boys and girls, get ready for a fast ride as you follow Malia from her home life with her wacky grandfather to her close calls in Africa with Teacup, her tiny dog. Will they make it safely home? Check out this book to find the answer.\" Lynn Nolan, M.Ed. Elementary education, 34 years. The Malia and Teacup Series encourages: High self-esteem, positive thinking and healthy self images, responsibility and kindness to animals, personal safety, overcoming fears and standing up to bullies, family relationships, step-family blending, friendship, loyalty, love and forgiveness, grandparents and unconditional love, independent ethical decision-making, \"doing the right thing,\" a global perspective and tolerance for differences.",
  "genres": [],
  "author": "Molly Barrow Dr",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/6706583-awesome-african-adventure"
}