{
  "title": "The Future of Islam",
  "description": "John L. Esposito is one of America's leading authorities on Islam. Now, in this brilliant portrait of Islam today-- and tomorrow-- he draws on a lifetime of thought and research to provide an accurate, richly nuanced, and revelatory account of the fastest growing religion in the world.Here, Esposito explores the major questions and issues that face Islam in the 21st century and that will deeply affect global Is Islam compatible with modern notions of democracy, rule of law, gender equality, and human rights? How representative and widespread is Islamic fundamentalism and the threat of global terrorism? Can Muslim minority communities be loyal citizens in America and Europe? In the midst of these questions, Esposito places an important emphasis on the issue of Islamophobia, the threat it poses, and its vast impact on politics and society in the US and Europe. He also turns the mirror on the US and Europe and paints a revealing portrait of how we appear to Muslims.Recent decades have brought extraordinary changes in the Muslim world, and in addressing these issues, Esposito paints a complex picture of Islam in all its diversity--a picture of urgent importance as we face the challenges of the coming century.Reviews\"A Georgetown University professor and well-known scholar of Islam, Esposito analyzes the current and future practice of Islam in this short but insightful volume... Esposito's enthusiasm for his topic makes his book an easy and enlightening read.\"--Publishers Weekly\"Esposito's book is a calculated appeal to the moderate middle ground upon whom the success of Obama's policies depends. Esposito is the right man for the he is a leading scholar of modern Islam, with more than 35 books on the subject to his credit, and heads a centre for Christian-Muslim understanding at Georgetown University. Through his scholarship and engaging writing, Esposito proposes the way forward for a better future for both Islam and the west.\"--The",
  "genres": [
    "Islam",
    "Religion",
    "Nonfiction",
    "History",
    "Terrorism",
    "Politics"
  ],
  "author": "John L. Esposito",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/6705976-the-future-of-islam"
}