{
  "title": "الشراع والعاصفة",
  "description": "حنا مينه، كانت حياته أسطورة ملهية. لقد قرأ كثيراً، ولكنه عاش أكثر. وكانت الحياة على حد تعبير أحد الأدباء تنضح من جلده. هذا الرجل الذي عاش المأساة أكثر مما عاشها أي أديب سوري هو الأكثر فرحاً وانتصاراً وأملاً. وكان يقول أبداً: \"يجب أن نفرح وإلا انهزم الإنسان فينا\". على شاطئ \"اللاذقية\". المدينة السورية الخضراء التي تستحم في البحر، وتندي ضفائرها بصنوبر جبال العلويين، ولد حنا مينه. تعرف حنا مينه على دنيا النشر وهو حلاق، صار يرسل بعض القصص إلى الصحف الدمشقية، وصار اسمه معروفاً ومحبوباً لدى القرّاء الذين افتنوا بهذا النفس الجديد الحنون، وهذا الروح الشعبي الأخّاذ. وروايته الأولى \"المصابيح الزرق\" كانت شيئاً جديداً في الأدب السوري، خط فيها الأسس الواقعية للرواية السورية.وقد أثارت مناقشات حامية في سورية ولبنان ومصر. لقد كانت روحها الشعبية الآسرة وأسلوبها الحي البسيط يعطيانها نكهة خاصة، ولكن ما فيها من انقطاع النفس حيناً، وتقصد السخرية أحياناً أخرى، والاندفاع في وصف الطبيعة بشكل يقطع حيوية الحادث، ثم بعض اللوحات التقريرية التي تأثر فيها حنا من عدائه لنظرية الفن للفن، فانصرف فيها إلى تأكيد التزامه السياسي دون كبير نجاح... كل هذه الأشياء كان انتقادها تجربة تنمية لحنا الذي اكتشف أبعاده بصورة أعمق. لم تكن \"المصابيح الزرق\" لتمثل حنا الحقيقي، لم تكن لتجسد حقاً ما يعرفه عن اللاذقية: مجرها وأحلامها وصياديها وطبقاتها الشعبية، فانصرف لكتابة روايته التي بين يدي القارئ \"الشراع والعاصفة\". التي هي قصة رجال البحر المردة، في صراعهم اليومي المرير مع الموت المتمثل في البحر الهائج، والعواصف الغادرة، يقابلونها بأشرعتهم الممزقة، وقواربهم العتيقة، وعزمهم المستمد من صخور الشطآن. إن فيها لروحاً أسطورياً حنوناً، ولكنه غائص الجذور بالأرض \"البحر ملك\" تلك هي صيحة الاحترام العميقة التي يطلقها كل بحار، والطروسي، بطل القصة الأول يؤمن بسلطنة البحر كما يؤمن بسلطنة المرأة، ولكنه، في عنفوان شعوره برجولته، يعرف كيف يكون ترويض النمور.إن البحر، صديقه اللدود، ليجتذبه بعيونه الرمادية الباردة ليبحر نحو جزر مهجورة، يغتض عذريتها بفتوة الفارس، لقد اكتشف معنى حياته، ولذلك أحس بثقل وقع أقدامه على الأرض. الشراع والعاصفة، قصة مدينة سورية ساحلية أثناء الحرب العالمية الثانية. لقد صور حنا مينه، وببراعة مدهشة، أثر هذه الحرب وما تركته من عواصف في بلاد يحتلها الفرنسيون، وأبرز التناقضات التي كانت تفترس مجتمعاً غير متجانس، ولكنها أولاً قصة رجال البحر، قصة الانتصار على عوامل الطبيعة القاسية، قصة الإرادة البشرية والمغامرة. إن حنا مينه من رواد البحر في الأدب العربي، وفي رواياته كل فتوة الريادة، وكل تعجلها أيضاً وحسبه هذا العطاء الرائع.",
  "genres": [
    "Novels",
    "Literature"
  ],
  "author": "حنا مينه",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/6704806"
}