{
  "title": "Kate Hannigan's Girl",
  "description": "Catherine Cookson was one of the world's most beloved writers. Her books have sold millions of copies, and her characters and their stories have captured the imagination of readers around the globe. She passed away in 1998, but luckily for her fans, Cookson left behind several unpublished works, including the magnificent Kate Hannigan's Girl -- her 100th book, the powerful companion to her first novel, Kate Hannigan.  Set in the English countryside in the early twentieth century, Kate Hannigan's Girl is the story of Kate's eldest daughter, the lovely, free-spirited Annie Hannigan. Blessed with silver-blond braids and a lighthearted disposition, Annie enjoys a life her mother never had. She is surrounded by material comforts and a loving family, protected from the poverty and shame her mother endured in the slums. But as Cookson fans have come to expect, no good life can go unmarred by heartache.  Annie grows into a beautiful young woman, and soon she draws the interest of both friends and neighbors. She falls in love with Terence Macbane, the elusive boy next door. But there are those who would keep them apart: Her childhood friend Brian Stannard is determined to have her for himself, and her more worldly rival, Cathleen Davidson, harbors a bitter jealousy that will prove dangerous to all. Tormented by unrequited love, the revelation of her own illegitimacy, and the demands of her deep-seated faith, Annie discovers that sometimes love is not enough -- she must fight for what she wants.  Kate Hannigan's Girl is vintage Cookson. With its larger themes of early twentieth-century romantic love and class conflict, this novel showcases Catherine Cookson at the height of her storytelling powers, and it is sure to satisfy devoted readers everywhere.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Historical Romance",
    "British Literature",
    "Historical",
    "Novels"
  ],
  "author": "Catherine Cookson",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/670369.Kate_Hannigan_s_Girl"
}