{
  "title": "Marvelous Possessions: The Wonder of a New World, with a new Preface",
  "description": "Marvelous Possessions is a study of the ways in which Europeans of the late Middle Ages and the early modern period represented non-European peoples and took possession of their lands, in particular the New World.In a series of innovative readings of travel narratives, judicial documents, and official reports, Stephen Greenblatt shows that the experience of the marvelous, central to both art and philosophy, was cunningly yoked by Columbus and others to the service of colonial appropriation. He argues that the traditional symbolic actions and legal rituals through which European sovereignty was asserted were strained to the breaking point by the unprecedented nature of the discovery of the New World. But the book also shows that the experience of the marvelous is not necessarily an agent of in writers as different as Herodotus, Jean de Léry, and Montaigne—and notably in Mandeville's Travels, the most popular travel book of the Middle Ages—wonder is a sign of a remarkably tolerant recognition of cultural difference.Marvelous Possession is not only a collection of the odd and exotic through which Stephen Greenblatt powerfully conveys a sense of the marvelous, but also a highly original extension of his thinking on a subject that has occupied him throughout his career. The book reaches back to the ancient Greeks and forward to the present to ask how it is possible, in a time of disorientation, hatred of the other, and possessiveness, to keep the capacity for wonder from being poisoned?\"A marvellous book. It is also a compelling and a powerful one. Nothing so original has ever been written on European responses to 'The wonder of the New World.'\"—Anthony Pagden, Times Literary Supplement\"By far the most intellectually gripping and penetrating discussion of the relationship between intruders and natives is provided by Stephen Greenblatt's Marvelous Possessions .\"—Simon Schama, The New Republic\"For the most engaging and illuminating perspective of all, read Marvelous Possessions .\"—Laura Shapiro, Newsweek",
  "genres": [
    "History",
    "Nonfiction",
    "Criticism",
    "European History",
    "Art History",
    "American History",
    "Cultural"
  ],
  "author": "Stephen Greenblatt",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/67090.Marvelous_Possessions"
}