{
  "title": "Cultural Intelligence: Improving Your CQ to Engage Our Multicultural World",
  "description": "Twenty-first-century society is diverse, and Christians must be able to understand other cultures and communicate effectively between and among them. Following up on the bestselling Hurt: Inside the World of Today's Teenagers, this new addition to the Youth, Family, and Culture series explores the much-needed skill of Cultural Intelligence (CQ), the ability to work effectively across national, ethnic, and even organizational cultures. While rooted in sound, scholarly research, Cultural Intelligence is highly practical and accessible to general readers. It will benefit students as well as guide ministry leaders interested in increasing their cultural awareness and sensitivity. Packed with assessment tools, simulations, case studies, and exercises, Cultural Intelligence will help transform individuals and organizations into effective intercultural communicators of the gospel.EXCERPTWhat do you do when you encounter someone who isn't like you? How do you feel? What goes on inside you? How do you relate to him or her? These are the kinds of questions we want to explore in this book. Few things are more basic to life than expressing love and respect for people who look, think, believe, act, and see differently than we do. We want to adapt to the barrage of cultures around us while still remaining true to ourselves. We want to let the world change us so that we can be part of changing the world. And we want to move from the desire to love across the chasm of cultural difference to the ability to express our love for people of difference. Relating lovingly to our fellow human beings is central to what it means to be human. And when it comes down to it, Christian ministry at its core is interacting with all kinds of people in ways that give them glimpses of Jesus in us.The billions of us sharing planet Earth together have so much in common. We're all born. We all die. We're all created in the image of God. We eat, sleep, persevere, and care for our young. We long for meaning and purpose, and we develop societies with those around us. But the way we go about the many things we have in common is deeply rooted in our unique personalities and cultures. So although we have so much in common, we have as much or more about us that's different.",
  "genres": [
    "Leadership",
    "Nonfiction",
    "Cultural",
    "Textbooks",
    "Sociology",
    "Theology",
    "School"
  ],
  "author": "David Livermore",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/6712421-cultural-intelligence"
}