{
  "title": "Out on a Limb",
  "description": "Malia and Out on a Limb ( 978-0-9825109-1-9) Early Reader Fiction Adventure The Thrilling Adventure of a Young Girl and her Tiny Dog in Africa. Father said Malia has only three weeks to train tiny Teacup, or else. Suddenly, the poodle disappears! Oh, no, this is trouble! Malia wonders what her stepbrother, Phillip, is hiding under his desk? Will Malia overcome her fears and believe in herself enough to rescue Teacup? Hanging upside down in a tree, Malia unravels the mystery of who dognapped little Teacup and discovers how to outsmart a wild animal with her courage. \"Action-packed terrific read for children from 7-9.\" Lynn Nolan, M.Ed. 34 years in elementary education. Dr. Barrow's new fiction book for children, Malia and Out On A Limb ( 978-0-9825109-1-9) illustrates complicated problem solving and a journey of self-discovery in a fast-paced and fun book to read, with 120 pages and 16 illustrations. The book introduces young readers, ages 7-9, to important life lessons through the comedic misadventures of Malia and her tiny poodle. BOOKS THAT MAKE A DIFFERENCE WITH PSYCHOLOGICAL ARMOR FOR KIDS How can an adventure book empower children and make them safer? \"A spoonful of adventure makes the psychology go down,\" according to Dr. Molly Barrow, author of relationship books Matchlines for Singles and Matchlines for Step Parenting and practicing psychotherapist. Just as Mary Poppins helped children take their medicine with a little sugar, Barrow uses exciting adventure books to embed subtle positive messages about building self-esteem. \"Self-esteem is the single most important factor for the safety of a child,\" says Barrow. \"High self-esteem is psychological armor for children.\" During the past twenty years counseling families, Dr. Barrow has used humorous storytelling to explain complicated therapy concepts to young children and troubled teenagers. Children responded so well to her stories utilizing the Barrow Empowerment Theory that Dr. Barrow created the Malia and Teacup books to reach more children. How a child values themselves is the first line of defense in dangerous situations against school bullies, predators, and abuse. \"Prevention psychology is what we need now. Children must believe they deserve to be treated well,\" says Barrow. Experts link low self-esteem with drug and alcohol use, rebellion, suicide and school dropouts. The book and web site provide parents and teachers help with challenging discussion topics. L. A. psychologist and author Gerald Amada says, \"Exciting books with social and moral themes, like Malia and Teacup and Harry Potter do have the effect of improving self-esteem in children...and will become a part of the large corpus of children's literature that fosters their emotional well-being.\" \"Teachers, this book can lead to some great discussions, role playing and writing assignments! Boys and girls, get ready for a fast ride as you follow Malia with her close calls in Africa as she rescues Teacup, her tiny dog!\" Lynn Nolan, M.Ed. Elementary education, 34 years. The Malia and Teacup Series High self-esteem, positive thinking and healthy self-images Responsibility and kindness to animals Personal safety, overcoming fears and standing up to bullies Family relationships, stepfamily blending Friendship, loyalty, love and forgiveness Grandparents and unconditional love Independent ethical decision-making - \"doing the right thing\" Global perspective and tolerance for differences Official web site www.MaliaandTeacup.com Malia and Out on a Limb 978-0-9825109-1-9 SC $11.95 Interview/schedule Dr. 1-888-DRMOLLY (376-6559) drmolly@drmollybarrow.com Press kit, Malia and Teacup children's www.maliaandteacup.com Official website, self-help books, relationship quizzes, video, www.drmollybarrow.com ###",
  "genres": [],
  "author": "Molly Barrow",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/6709486-out-on-a-limb"
}