{
  "title": "Citizens",
  "description": "A hard-hitting specialized anthology written by military veterans selected by armed forces veteran and New York Times best-selling author John Ringo and Hugo-nominated editor Brian M. Thomsen. Legendary science fiction writers, and citizen warriors, deliver science fiction military adventure tales on a grand scale. Asimov, Heinlein, Clarke, Laumer, Wolfe, and other greats. Giants of science fiction. Plus all new fiction by recent vets who have served in Iraq and Afghanistan. Military veterans all. Gritty takes on future combat. Penetrating looks into the warrior’s character, the harsh reality of a life under arms, and how society deals with those it desperately needs and often fails to honor as it should.Contents: Nature and Nurture (2010) • essay by John Ringo Field Test [Bolo] (1976) / short story by Keith Laumer Allamagoosa (1955) / short story by Eric Frank Russell Exploration Team [Colonial Survey] (1956)/ novelette by Murray Leinster Superiority (1951) / short story by Arthur C. Clarke The Horars of War (1970) / short story by Gene Wolfe Fireproof (1949) / short story by Hal Clement Peace with Honor [Falkenberg's Legion] (1971) / novelette by Jerry Pournelle Under the Hammer [Hammer's Slammers] (1974) / short story by David Drake Time Piece (1970) / short fiction by Joe Haldeman [as by Joe W. Haldeman] Neither Sleet, Nor Snow, Nor Alien Invasion ... (2010) / short fiction by Dave Freer Light (2010) / short fiction by Kacey Grannis The Question (2010) / short fiction by Patrick A. Vanner The Price [Freehold] (2010) / novelette by Michael Z. Williamson Earth's First Improved Chimp Gets a Job as a Janitor (2004) / short story by John Ringo The Long Watch [Future History] (1949) / short story by Robert A. Heinlein About the Authors (Citizens) (2010) • essay by uncredited About the Editors (Citizens) (2010) • essay by uncredited.",
  "genres": [
    "Science Fiction",
    "Anthologies",
    "Fiction",
    "Short Stories",
    "Fantasy",
    "Military Fiction"
  ],
  "author": "John Ringo",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/6713653-citizens"
}