{
  "title": "George, Nicholas and Wilhelm: Three Royal Cousins and the Road to World War I",
  "description": "In the years before the First World War, the great European powers were ruled by three first cousins: King George V of Britain, Kaiser Wilhelm II of Germany and Tsar Nicholas II of Russia. Together, they presided over the last years of dynastic Europe and the outbreak of the most destructive war the world had ever seen, a war that set twentieth-century Europe on course to be the most violent continent in the history of the world.Miranda Carter uses the cousins' correspondence and a host of historical sources to tell the tragicomic story of a tiny, glittering, solipsistic world that was often preposterously out of kilter with its times, struggling to stay in command of politics and world events as history overtook it. George, Nicholas and Wilhelm is a brilliant and sometimes darkly hilarious portrait of these men--damaged, egotistical Wilhelm; quiet, stubborn Nicholas; and anxious, dutiful George--and their lives, foibles and obsessions, from tantrums to uniforms to stamp collecting. It is also alive with fresh, subtle portraits of other familiar figures: Queen Victoria--grandmother to two of them, grandmother-in-law to the third--whose conservatism and bullying obsession with family left a dangerous legacy; and Edward VII, the playboy \"arch-vulgarian\" who turned out to have a remarkable gift for international relations and the theatrics of mass politics. At the same time, Carter weaves through their stories a riveting account of the events that led to World War I, showing how the personal and the political interacted, sometimes to devastating effect.For all three men the war would be a disaster that destroyed forever the illusion of their close family relationships, with any sense of peace and harmony shattered in a final coda of murder, betrayal and abdication.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "World War I",
    "Russia",
    "European History",
    "Germany"
  ],
  "author": "Miranda Carter",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/6709606-george-nicholas-and-wilhelm"
}