{
  "title": "Pumpkinnapper",
  "description": "Pumpkinnapper, Regency Halloween comedy, available from The Wild Rose Press. Buy Pumpkin thieves, a youthful love rekindled and a jealous goose. Oh my!Last night someone tried to steal the widowed Mrs. Emily Metcalfe's pumpkins. She's certain the culprit is her old childhood nemesis and the secret love of her youth, Henry, nicknamed Hank, whom she hasn't seen in ten years.Henry, Baron Grey, who's never forgotten the girl he loved but couldn’t pursue so long ago, decides to catch Emily's would-be thief. Even after she reveals his childhood nickname--the one he would rather forget. And even after her jealous pet goose bites him in an embarrassing place. Oh, the things a man does for love.\"Emily, even with Henry, formidable as he is--\" Hank glared at the goose. The goose glared back \"--you need protection. I will send over some footmen to guard the place.\" \"No. Turnip Cottage belongs to Charlotte's husband. What will the townspeople think, with Lord Grey's servants about my house?\" Her refusal increased his fury. The sight of her hand on that damned goose's head didn't improve his mood, either. He balled his fists as his patience thinned and something else thickened. \"I'll find you a guard dog. You must have some protection out here all alone.\" \"But I have Henry.\" She patted the goose's head and the bird snuggled into her hand. Again. Heat flooded Hank, part desire for Emily's touch, and part desire to murder that damned goose, who was where he wanted to be. His insides groaned. \"Very well, then, you leave me no choice. I will help you catch the culprits.\"\"But--\" He changed his voice to the voice that either melted a woman or earned him a slap in the face. \"Who knows, mayhap we would enjoy ourselves as I lie in wait with you.\" I would love to lie with you. Her eyes widened. Had she understood the innuendo? \"I cannot stay alone with you, and you know it,\" she said, her voice severe. \"You are a widow in your own home and no one will see. I will make sure of it.\" \"No.\" She marched back into her cottage and slammed the door. Henry smirked and waddled away. Hank grinned. He would be back, whether she liked it or not.",
  "genres": [],
  "author": "Linda Banche",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/6712163-pumpkinnapper"
}