{
  "title": "كارت أحمر للرئيس",
  "description": "عرض/ محمود جمعةيشهر الدكتور عبد الحليم قنديل في هذا الكتاب \"الكارت الأحمر\" بوجه الرئيس المصري حسني مبارك معللا ذلك بأنه أمر طبيعي لنظام أقصى إنجازاته التاريخية، هو أنه جعل المصريين يكرهون مصر ويهربون منها وأنه جعلهم \"نفايات بشر\" ينتظرون الموت المستعجل في بلادهم أو على أرصفة الغربة.ويمضي قنديل في كتابه مؤكدا أن عهد مبارك يمثل مرحلة انحطاط تاريخي تعد الأسوأ في تاريخ مصر، تلك المرحلة التي ازداد فيها فقر وبؤس المصريين وتحول الشعب المصري إلى شعب مريض بكل أمراض الدنيا.هذا الكتاب الصادر منذ أيام يتضمن 52 مقالا كتبها قنديل في عدد من الصحف المصرية والعربية، منها ثلاثة مقالات منعتها جهات أمنية في اللحظات الأخيرة قبل طبع جريدة صوت الأمة، بل وتسببت تلك المقالات في إقالة كاتبها من رئاسة تحرير الجريدة إثر ضغوط أمنية شديدة!ويوضح الكتاب أن نظام مبارك تجاوز منذ زمن مرحلة الخطأ السياسي إلى \"الخطيئة الفادحة\" وجرى في عهده تجريف الأصول الإنتاجية وشفط ونهب الثروة الوطنية بصورة غير مسبوقة، وجرت عملية إفقار منظمة لكل فئات الشعب المصري المكلوم.. بينما يقف النظام قلبا وقالبا مع المفسدين والفاسدين والمحتكرين بل والقاتلين على حد وصف الكاتب.ويورد الكتاب مجموعة من الحقائق والأرقام التي تؤكد أن \"الموت المستعجل هو القدر المفضل للمصريين في ظل حكم مبارك\". فمثلا هناك ثلاثة وسبعون ألفا من المصريين لقوا مصرعهم في حوادث الطرق في سنة واحدة ! وهو رقم يمثل ضعف عدد الشهداء في حروب مصر كلها.كما أن نصف مليون مصري مصابون بالتسمم من تلوث المياه، وربع مليون مصري يضافون سنويا إلى طابور السرطان القاتل، إضافة إلى أن مصر هي الأولى عالميا في عدد المصابين بالفشل الكلوي وبالتهاب الكبد الوبائي، فضلا عن الموتى في طوابير الخبز وفي العبارات الغارقة أو القطارات المحترقة أو الموت غرقا في مغامرات الهروب عبر البحر المتوسط.ويحفل الكتاب بمئات القصص والمواقف والأمثلة التي تؤكد استشراء الفساد في ربوع المحروسة، بعد أن وصل مبارك إلى الحكم بمنطق الصدفة ولا شرعية بمعاني التاريخ، وأنه كان أقصى أمانيه -أي مبارك- أن يكون سفيرا أو رئيسا لشركة فإذا به يفاجئ بتعينه نائبا لرئيس الجمهورية عام 1975 ليجلس على مقعد الحكم إثر النهاية الدرامية للسادات بالاغتيال على منصة العرض العسكري في 6 أكتوبر/ تشرين الأول 1981م، ليحول مبارك مصر كلها إلى شركة خاصة ثم تحولت إلى عائلة! أي انتهى الحال بمصر الكبيرة لعائلة صغيرة!! .. على حد وصف الكاتب.مخطط التوريثويخصص الكتاب أجزاء كبيرة من مساحته للحديث عن مخطط التوريث الذي يجرى في أروقة السلطة، حيث يشير إلى أن الأمر قد تجاوز بكثير مرحلة التمهيد للوريث \"مبارك الابن\" إلى مرحلة النزاع العائلي على الحكم، وممارسة جمال مبارك لمهام فعلية فهو يدير عمليا ملف الاقتصاد ويؤلف الحكومات ويختار رؤساء الوزارات، كما أن كل قرار جديد في مصر الآن أصبح موسوما بنفوذ الابن بدءا من قرارات الخصخصة وبيع الأصول وانتهاء بقرارات تعيين رؤساء تحرير الصحف الحكومية واستقبال فريق المنتخب المصري بعد عودته مهزوما في بطولة العالم للقارات!!ويخلص الكتاب إلى أن الرئاسة في مصر جرى تقسيمها فعليا فصارت أحيانا مزدوجة وأحيانا مثلثة، مع الأخذ في الاعتبار أن نفوذ الأم \"سوزان مبارك\" يضاف إلى نفوذ الابن، بينما يبدو مبارك الأب كرئيس شاخ، وتثاقلت حركته، ويقضي أغلب وقته تائها سابحا في خيالات المياه الزرقاء على شاطئ شرم الشيخ.ويرى الكاتب أن المشهد المصري يشير إلى أن النزاع عائلي على مائدة غداء وفي أطراف الصورة توجد أطراف أخرى ، فمبارك الابن يستند إلى نفوذ جماعة البيزنس وتبدو الأم راعية لأحلام الابن ومستعجلة لتوريثه في حياة عين الأب.بينما مبارك الأب يستند إلى نفوذ المؤسسة الأمنية ممثلة بالجيش والشرطة وأجهزة المخابرات، ويشير الكاتب إلى أن الجيش لا يبدو مستريحا تماما لصعود نفوذ جمال مبارك وتضخيم نفوذ جماعته.ويلفت الكتاب إلى وجود ظاهرة التضاغط المتبادل حينما يتضخم نفوذ الابن في ظل الغياب الفعلي للرئيس الذي لا يرضى بدور مدير الدكان، بينما لم يقتنع الابن بدور الشريك في رئاسة فعلية بل يطمح للرئاسة الرسمية للبلاد بعد أن جرى اتخاذ كافة خطوات التمهيد النهائي لها فعليا ودستوريا، حيث لم يعد أمام المصريين من فرص سوى تكرار الرئيس نفسه أو إحلال الابن، وفي المسافة الفاصلة والواصلة يجري تداول صيغ خداع أو توفيق من نوع إعطاء الفرصة لجنرال يقوم بدور المحلل للتوريث ويجعله رئيسا انتقاليا مع جعل جمال مبارك رئيسا للوزراء بصلاحيات مضافة إلى أن تأتي لحظة الوثوب للسلطة.على المستوى السياسي يغتصب مبارك ونظامه السلطة دون أي شرعية شعبية أو قواعد اجتماعية انتهت بالنظام في وضع الرأس المعلق، وبلا حتى شرعية دستورية، ويتضح ذلك من حكم المحكمة الدستورية -التاريخي- في عام 2000م بعدم شرعية كل انتخاب أو استفتاء جرى أو يجري بغير الإشراف القضائي الكامل، ولم يحدث أن جرى استفتاء في زمن مبارك كله بالإشراف القضائي الكامل -قاض لكل صندوق انتخابي- واستفتاءات مبارك 1981 و1987 و1993م وحتى (انتخابات) 2005 جرت جميعا بلا إشراف قضائي كامل!!إسرائيل أولا ولأن النظام المصري ومبارك كما يرى الكتاب ينتهجان سياسة \"إسرائيل أولا\"، وتحولوا إلى \"الذين جلبوا العار لمصر\" فما كان منهم إلا أن وقفوا في خانة العدو الصهيوني ضد أبناء غزة ونفذوا التعليمات الإسرائيلية والأميركية \"بحذافيرها\" بشأن إغلاق معبر رفح في وجه أبناء غزة البواسل.ولأن البلاد دخلت في عصر انحطاط تاريخي عام بل أشبه بالخروج الكلي من التاريخ فبعد أن كانت مصر -حتى عام 1973م - رأسا برأس مع كوريا الجنوبية في معدلات التنمية والتقدم والاختراق التكنولوجي، انتهت في عهد مبارك إلى الثقب الأسود وصارت في مكانة بوركينا فاسو وفي معدلات أدائها على مؤشر الفساد الدولي!!ويشير الكتاب إلى أن صرخة كفاية الأولى \"لا للتمديد .. لا للتوريث\" قد لاقت صداها في الاحتجاجات التي انتشرت في البلاد لتتحول إلى رياضة يومية في أماكن مختلفة تتوجت بتلاقي موجة الغضب السياسي بموجة الغضب الاحتجاجي وبمساعدة شبابية واعدة من شباب الفيس بوك لتتحول إلى انتفاضة شعبية في 6 أبريل 2008م وتعلن بقوة عن \"احتضار النظام\" وتحلله.مقالات الكتاب تحدث فيها قنديل عن كل شيء في مصر: كفاية، المؤسسة الأمنية، الفتنة الطائفية، بيع مصر بالقطعة، الثورة العنيدة التي لا تأتي، المصريون بمعناهم المؤلم، التوريث ... حديث الصباح والمساء، باراك أوباما ... نابليون الأسمر الذي غزا الأزهر وذكر أجزاء من القرآن والإنجيل والتوراة في نفس واحد، بؤس الأب والابن الذي يلاحق مصر، كل شيء تحدث عنه قنديل في حيثيات رفع الكارت الأحمر لمبارك التي ضمنها كتابه الجديد، دون أن يستثني أحدا من اللوم والإدانة لمسؤوليته فيما آلت إيه أوضاع مصر..في الكتاب ينتظر قنديل القدر ورأي العسكر بينما مصر تنزلق أمام عينيه نحو آزفة ليس لها من دون الله كاشفة، ولا يملك المصريون إزاء المجهول الذي يتجسد في الأفق إلا أمرين: إما الانتظار وهذا مقزز في نظر المصريين أو الانتظار، وهذا برد وسلام على الضمائر المثلجة في ثلاجة السيد الرئيس.. والسيد ابن السيد الرئيس.. والسادة رجال السيد ابن السيد الرئيس.العصيان هو الحلويضع الكاتب روشتة لإخراج البلاد من كبوتها من خلال رسم خارطة طريق تبدأ بالعصيان المدني والاعتصام بالمقاومة السلمية، ويرى الكاتب أن دخول الانتخابات -تشريعية أو رئاسية - هو نوع من العبث خاصة بعد تعديلات الانقلاب على الدستور في 2007 وإلغاء الإشراف القضائي على الانتخابات الأمر الذي حولها لمجرد تعيينات إدارية واتضح ذلك جليا في مهزلة مجلس الشورى والمحليات من بعدها.ويؤكد الكتاب على ضرورة الالتفاف حول ائتلاف المصريين من أجل التغيير الذي في وثيقة بيانه التأسيسي الموقع عليها أكثر من 250 شخصية عامة: \"أنه لا حل لأزمة مصر بغير التغيير السلمي للنظام القائم والتحول إلى حكم الشعب عبر فترة انتقالية لمدة سنتين تدير البلاد خلالها رئاسة محايدة وحكومة ائتلاف وطني تستعيد هيبة مصر ومكانتها ودورها القيادي عربيا وتسترد استقلالها وإرادتها الوطنية، وتقيم الديمقراطية وحكم القانون والتوزيع العادل للثروة، بإنهاء حالة وقانون الطوارئ وإيقاف العمل بتعديلات الانقلاب على الدستور وتصفية تركة الاعتقال السياسي والمحاكمات العسكرية والاستثنائية وإطلاق حريات الصحافة وتكوين الأحزاب والجمعيات والنقابات وهيئات التدريس واتحادات الطلاب والفلاحين\".ومؤلف الكتاب هو الدكتور عبد الحليم قنديل ولد بقرية الطويلة محافظة الدقهلية وتخرج في كلية الطب جامعة المنصورة، وعمل بمستشفيات وزارة الصحة بالدقهلية والقاهرة ثم ترك الطب عام 1985م وعمل بالصحافة .. أنشأ مجلة \"الغد العربي\" وترأس تحرير صحف \"العربي\" ، \" الكرامة\" ، \"صوت الأمة\".. خاض معارك قوية ضد نظام مبارك تعرض بسببها لملاحقات أمنية وصلت لحد الاختطاف والترويع والإقالة من الجرائد التي يترأس تحريرها ومنع مقالات له من المطبعة نتيجة لضغوط أمنية.وعلى المستوى السياسي، يعد من أصلب المعارضين لنظام مبارك، وأحد أهم مؤسسي حركة كفاية التي يشغل الآن منصب منسقها العام، وصاحب الدعوة لائتلاف المصريين من أجل التغيير وأحد أهم مؤسسيه وصاحب صياغة بيانه التأسيسي الذي وقع عليه الكثير من الشخصيات العامة والمناضلين السياسيين والكثير من الفئات العمالية والشبابية والقيادات النقابية.",
  "genres": [
    "Politics"
  ],
  "author": "عبد الحليم قنديل",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/6708361"
}