{
  "title": "The Firekeeper: A Narrative of the New York Frontier",
  "description": "An epic adventure based on the extraordinary historical story of Sir William Johnson and the author’s dreams of a Mohawk “woman of power” who lived three centuries ago.“To read The Firekeeper is to be transported to another time and place, and leave it measurably enlightened.” — James A. MichenerThe Firekeeper brings alive the world in which America was born, when the clash of empires produced the first worldwide war and Albany, New York, was the Casablanca of the age. Filled with great men—George Washington, Benjamin Franklin, the Mohawk Hendrick Tehayanoken—and the battles that opened the way for the American Revolution, The Firekeeper follows the exploits of Sir William Johnson, an Irish adventurer with a rage for life, who created a tribal kingdom on the New York frontier.Johnson defended the First Peoples against white men who were bent on genocide and led the Mohawks into battle on the English side in the French and Indian War. His story is interwoven with those of three extraordinary Catherine Weissenberg, the Palatine German girl who fled the wars of the Old World to make a life with Johnson in the Mohawk Valley; Island Woman, a Mohawk shaman and mother of the Wolf Clan; and her granddaughter, known to history as Molly Brant, the only woman who managed to tame Johnson. With Island Woman, we journey deep into the dream practices and ways of healing of the Onkwehonwe, the Real People, and through her The Firekeeper also becomes the indelible story of a native people’s struggle for survival, and of how dreaming can bring the soul back home.“Some rare novels defy labels. The Firekeeper is such a book. An intricately detailed historical novel, a mystical journey, a breathtaking adventure tale, and a passionate exploration of the human heart. This is a book to savor when you truly want to lose yourself in another world.” — Morgan Llywelyn, author of Lion of Ireland",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Robert Moss",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/6713034-the-firekeeper"
}