{
  "title": "Warriors",
  "description": "From George R. R. Martin's Introduction to Warriors: \"People have been telling stories about warriors for as long as they have been telling stories. Since Homer first sang the wrath of Achilles and the ancient Sumerians set down their tales of Gilgamesh, warriors, soldiers, and fighters have fascinated us; they are a part of every culture, every literary tradition, every genre. All Quiet on the Western Front, From Here to Eternity, and The Red Badge of Courage have become part of our literary canon, taught in classrooms all around the country and the world.Our contributors make up an all-star lineup of award-winning and bestselling writers, representing a dozen different publishers and as many genres. We asked each of them for the same thing — a story about a warrior. Some chose to write in the genre they're best known for. Some decided to try something different. You will find warriors of every shape, size, and color in these pages, warriors from every epoch of human history, from yesterday and today and tomorrow, and from worlds that never were. Some of the stories will make you sad, some will make you laugh, and many will keep you on the edge of your seat.\"Every story in this volume appears here for the first time. Included are a long novella from the world of Song of Ice and Fire by George R.R. Martin, a new tale of Lord John by Diana Gabaldon, an Emberverse story by S.M. Stirling, a Forever Peace sory by Joe Haldeman, and a long story of humanity at bay by David Weber. Also present are original tales by David Ball, Peter S. Beagle, Lawrence Block, Gardner Dozois, Robin Hobb, Cecelia Holland, Joe R. Lansdale, David Morrell, Naomi Novik, James Rollins, Steven Saylor, Robert Silverberg, Carrie Vaughn, Howard Waldrop, and Tad Williams.Many of these writers are bestsellers. All of them are storytellers of the highest quality. Together they make a volume of unforgettable reading.Contents:- Introduction: Stories from the Spinner Rack by George R.R. Martin- The King of Norway by Cecelia Holland- Forever Bound by Joe Haldeman- The Triumph by Robin Hobb- Clean Slate by Lawrence Block- And Ministers of Grace by Tad Williams- Soldierin' by Joe R. Lansdale- Dirae by Peter S. Beagle- The Custom of the Army by Diana Gabaldon- Seven Years from Home by Naomi Novik- The Eagle and the Rabbit by Steven Saylor- The Pit by James Rollins- Out of the Dark by David Weber- The Girls from Avenger by Carrie Vaughn- Ancient Ways by S.M. Stirling- Ninieslando by Howard Waldrop- Recidivist by Gardner Dozois- My Name is Legion by David Morrell- Defenders of the Frontier by Robert Silverberg- The Scroll by David Ball- The Mystery Knight: A Tale of the Seven Kingdoms by George R.R. Martin",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Science Fiction",
    "Historical Fiction",
    "Historical"
  ],
  "author": "George R.R. Martin",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/6714177-warriors"
}