{
  "title": "The Great God Pan And The Inmost Light",
  "description": "The Great God Pan And The Inmost Light is a collection of two novellas written by Arthur Machen and first published in 1894. The first novella, The Great God Pan, tells the story of a young woman named Helen Vaughan, who is the daughter of a mad scientist. Helen is subjected to a strange experiment that opens her mind to the supernatural world, and she becomes a conduit for a powerful and ancient deity known as the Great God Pan. The story explores themes of sexuality, madness, and the dangers of delving too deeply into the unknown.The second novella, The Inmost Light, follows a man named Mr. Dyson as he investigates a mysterious cult that worships an otherworldly entity known as the Inmost Light. Dyson becomes obsessed with the cult and its rituals, and he begins to experience strange and terrifying visions. The story delves into themes of obsession, the dangers of knowledge, and the thin line between reality and madness.Both novellas are considered to be classics of horror and supernatural fiction, and they have been praised for their evocative prose, vivid imagery, and unsettling atmosphere. Machen's work has been cited as an influence by many writers in the horror and fantasy genres, including H.P. Lovecraft and Neil Gaiman. The Great God Pan And The Inmost Light remains a seminal work of horror fiction, and it continues to captivate and terrify readers more than a century after its initial publication.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Horror",
    "Fiction",
    "Fantasy",
    "Classics",
    "Weird Fiction",
    "Gothic",
    "British Literature"
  ],
  "author": "Arthur Machen",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/6718910-the-great-god-pan-and-the-inmost-light"
}