{
  "title": "Whale Talk",
  "description": "“A truly exceptional book.” —Washington Post There's bad news and good news about the Cutter High School swim team. The bad news is that they don't have a pool. The good news is that only one of them can swim anyway. Bestselling author Chris Crutcher’s controversial and acclaimed novel follows a group of outcasts as they take on inequality and injustice in their high school. \"Crutcher's superior gifts as a storyteller and his background as a working therapist combine to make magic in Whale Talk . The thread of truth in his fiction reminds us that heroes can come in any shape, color, ability or size, and friendship can bridge nearly any divide.”— Washington Post T.J. Jones hates the blatant preferential treatment jocks receive at his high school, and the reverence paid to the varsity lettermen. When he sees a member of the wrestling team threatening an underclassman, T.J. decides he’s had enough. He recruits some of the biggest misfits at Cutter High to form a swim team. They may not have very much talent, but the All-Night Mermen prove to be way more than T.J. anticipated. As the unlikely athletes move closer to their goal, these new friends might learn that the journey is worth more than the reward. For fans of Andrew Smith and Marieke Nijkamp. \"Crutcher offers an unusual yet resonant mixture of black comedy and tragedy that lays bare the superficiality of the high-school scene. The book's shocking climax will force readers to re-examine their own values and may cause them to alter their perception of individuals pegged as 'losers.'\"— Publishers Weekly An American Library Association Best Book for Young AdultsNew York Public Library Books for the Teen Age",
  "genres": [
    "Young Adult",
    "Fiction",
    "Sports",
    "Realistic Fiction",
    "Teen",
    "Banned Books",
    "Contemporary"
  ],
  "author": "Chris Crutcher",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/6716186-whale-talk"
}