{
  "title": "Too Much Money",
  "description": "My name is Gus Bailey…It should be pointed out that it is a regular feature of my life that people whisper things in my ear, very private things, about themselves or others. I have always understood the art of listening. The last two years have been monstrously unpleasant for high-society journalist Gus Bailey. His propensity for gossip has finally gotten him into trouble—$11 million worth. His problems begin when he falls hook, line, and sinker for a fake story from an unreliable source and repeats it on a radio program. As a result of his flip comments, Gus becomes embroiled in a nasty slander suit brought by Kyle Cramden, the powerful congressman he accuses of being involved in the mysterious disappearance of a young woman, and he fears it could mean the end of him. The stress of the lawsuit makes it difficult for Gus to focus on the novel he has been contracted to write, which is based on the suspicious death of billionaire Konstantin Zacharias. It is a story that has dominated the party conversations of Manhattan's chattering classes for more than two years. The convicted murderer is behind bars, but Gus is not convinced that justice was served. There are too many unanswered questions, such as why a paranoid man who was usually accompanied by bodyguards was without protection the very night he perished in a tragic fire. Konstantin's hot-tempered widow, Perla, is obsessed with climbing the social ladder and, as a result, she will do anything to suppress this potentially damaging story. Gus is convinced she is the only thing standing between him and the truth. Dominick Dunne revives the world he first introduced in his mega-bestselling novel People Like Us , and he brings readers up to date on favorite characters such as Ruby and Elias Renthal, Lil Altemus, and, of course, the beloved Gus Bailey. Once again, he invites us to pull up a seat at the most important tables at Swifty's, get past the doormen at esteemed social clubs like The Butterfield, and venture into the innermost chambers of the Upper East Side's most sumptuous mansions.  Too Much Money is a satisfying, mischievous, and compulsively readable tale by the most brilliant society chronicler of our time—the man who knew all the secrets and wasn't afraid to share them.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Historical Fiction",
    "Mystery",
    "Adult",
    "True Crime",
    "Novels"
  ],
  "author": "Dominick Dunne",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/6715582-too-much-money"
}