{
  "title": "دمشق: صور من جمالها وعبر من نضالها",
  "description": "يضم هذا الكتاب تسع عشرة مقالة كُتبت بين عامي 1931 و1964، وقد صدرت الطبعات القديمة منه في 160 صفحة من القَطْع المعتاد (17×24)، ثم أعاد حفيد المؤلف، مجاهد مأمون ديرانية، إصداره مؤخراً في 300 صفحة من القطع المتوسط (14×21) بعدما أضاف إليه ملحقاً يضم نحو مئة صفحة من الصور، وهي صور رُتِّبَت في ثلاثة أبواب: \"رجال من دمشق\"، و\"من تاريخ دمشق\"، و\"من معالم دمشق\"، بالإضافة إلى بعض الخرائط المفيدة.الاسم الكامل لهذا الكتاب هو: \"دمشق: صور من جمالها، وعبر من نضالها\"، وهو اسم يوحي بأن مقالات الكتاب وصفية أو تاريخية. والحقيقة أن فيها من ذلك الكثير، لكن في الكتاب أيضاً صوراً من الأدب وفيضاً من المشاعر والأحاسيس هي أقرب إلى \"حديث النفس\"، بل إن فيه فصولاً من الذكريات، مثل مقالة \"ساقية في دمشق\" (وفيها أشتات من ذكريات الدراسة في الكتّاب) و\"مكتب عنبر\"، وهذه الأخيرة كانت في الأصل مقدمة كتبها المؤلف لكتاب أصدره ظافر القاسمي عن مكتب عنبر سنة 1963. ومكتب عنبر هو اسم المدرسة الثانوية التي درس فيها علي الطنطاوي والتي كان لها أثر كبير في حياته، ولذلك لم يكن غريباً أن تثير كتابة هذه المقدمة مشاعره وأن توقظ ذكرياته، فنجده قد استرسل -فيها- في هذه الذكريات وهو يقول مخاطباً مؤلف الكتاب: \"لقد حركتَ سواكن نفسي، وبعثت لي ذكريات أمسي، وهززتني هزاً، حتى لقد أحسستُ كأن قد عادت لي مواضي أيامي. وهل تعود الأيام الماضيات؟ لقد كان عهد مكتب عنبر جنتي التي خرجت منها ثم لم أعُد إليها، فرجَعْتَني إليها -يا أخي ظافر- بكتابك، أطير من فوق أسوارها العالية وأبوابها الموصدة بجناحين من ذكرى وخيال، حتى أدخلها مرة ثانية، فأعيش فيها في حلم ممتع فتّان\".وفي بعض المقالات صور أدبية تاريخية نكاد نحسّ، ونحن نقرؤها، أننا نعيش في دمشق في بعض أيامها القديمة؛ مثل مقالة \"العيد في دمشق\"، وفيها وصف للعيد في بيوت دمشق وأحيائها في مطلع هذا القرن، و\"دمشق التي عرفتها وأنا صغير\". وفي كثير من مقالات الكتاب تصوير أدبي لواقع تاريخي؛ مثل مقالة \"كارثة دمشق\"، ومن هذا الباب مقالات تتحدث عن مراحل من الجهاد والنضال سبقت استقلال الشام وجلاء الفرنسيين عنها، ومنها: \"أطفال دمشق\" و\"مقدمة كتاب عن دمشق\"، وهي تُختتم بمقالتي \"دموع ودموع\" و\"الجلاء عن دمشق\" اللتين نُشرتا عقب الجلاء في عام 1945.وفي مقالتَي \"حي الصالحية\" و\"منشئ حي المهاجرين في دمشق\" نقرأ أطرافاً من تاريخ المدينة؛ ففي الأولى تاريخ مفصل لهذا الحي من أحياء دمشق من يوم استوطنه آل قدامة (أسرة الفقهاء الحنابلة المشهورة، ومنهم الموفق صاحب المغني؛ أوسع كتب المذهب) حين التجؤوا إلى دمشق هرباً من الصليبيين في فلسطين، وفي الثانية تاريخ مفصل لحي \"المهاجرين\" الذي لم يكن شيئاً في أول القرن الهجري الماضي ثم استحال واحداً من أفضل أحياء دمشق في آخره، وفي المقالة -أيضاً- استعراض موجز لأعمال عدد من متأخري الولاة العثمانيين في دمشق.أما بقية مقالات الكتاب فتكاد تقتصر على وصف دمشق، فكأنها هي التي استحق الكتاب -من أجلها- أن يُضاف إلى اسمه: \"صور من جمالها\" كما استحق -لأجل المقالات السابقة- أن يُضاف إليه \"عِبَر من نضالها\". ومن هذه المقالات مقالة \"هذي دمشق\"، وفيها وصف للمدينة يحس القارئ -معه- أنه زارها وتنقل في شوارعها وبين أحيائها وجال على أهم معالمها، ومنها مقالة \"نهر دمشق\" التي يصف فيها المؤلف \"بردى\"، ومقالة \"الجادة الخامسة في دمشق\"، ومقالة \"على سفوح جبل الشيخ\"، وهي من أواخر ما أُلف من مقالات الكتاب، وقد نُشرت سنة 1964.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "علي الطنطاوي",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/6715549"
}