{
  "title": "Ιστορία της Νεοελληνικής Λογοτεχνίας",
  "description": "Πρόκειται για μια ιστορική επισκόπηση της νεοελληνικής λογοτεχνίας από τη βυζαντινή περίοδο ώς τις μέρες μας. Στο πρώτο μέρος παρουσιάζεται η λογοτεχνική δημιουργία από τις πρώτες αρχές μέχρι τον 18ο αιώνα: η λογοτεχνία πριν από την Άλωση (11ος-15ος αιώνας) και μετά την Άλωση (15ος-17ος αιώνας) ιδίως στην Κρήτη και την Κύπρο, καθώς και το έργο των λογίων της Διασποράς. Ιδιαίτερα κεφάλαια αφιερώνονται στη λογοτεχνική ακμή στην Κρήτη τον 17ο αιώνα και στο δημοτικό τραγούδι. Στο δεύτερο μέρος αναλύεται η λογοτεχνία στις δεκαετίες πριν από την Επανάσταση του 1821. Ένα κεφάλαιο αφιερώνεται στον Σολωμό και ένα στον Κάλβο και την Εφτανησιώτικη Σχολή. Ακολουθούν οι Ρομαντικοί της Αθηναϊκής Σχολής, η γενιά του 1880, με κεντρική μορφή τον Παλαμά, η πεζογραφία μετά το 1880 (Βιζυηνός, Παπαδιαμάντης κ.ά.), το γλωσσικό ζήτημα και ο Ψυχάρης, η ποίηση γύρω και ύστερα από τον Παλαμά, ο Καβάφης, ο Σικελιανός, ο Καζαντζάκης και η γενιά του Τριάντα. Στο τελευταίο κεφάλαιο αναπτύσσεται η μεταπολεμική ποίηση και πεζογραφία.ΠρόλογοςΕισαγωγήΟι αρχές. ΠερίοδοιΝέα ελληνική γλώσσαΤο γλωσσικό ζήτημαΝεοελληνική στιχουργικήΠΡΩΤΟ ΜΕΡΟΣ: ΑΠΟ ΤΙΣ ΠΡΩΤΕΣ ΑΡΧΕΣ ΩΣ ΤΟΝ ΔΕΚΑΤΟ ΟΓΔΟΟ ΑΙΩΝΑ1. Η λογοτεχνία πριν από την Άλωση (11ος - 15ος αιώνας)Το έπος του Διγενή ΑκρίταΣτην αυλή των ΚομνηνώνΗ Φραγκοκρατία. Ιπποτικά και άλλα μυθιστορήματαΑλληγορικά και άλλαΣαχλίκης και Φαλιέρος2. Μετά την Άλωση (15ος - 17ος αιώνας)Η λογοτεχνία στα φραγκοκρατούμενα μέρηΠοίηση της Αναγέννησης στην ΚρήτηΠετραρχισμός στην ΚύπροΗ πνευματική κίνηση στη Διασπορά και στον τουρκοκρατούμενο ελληνισμό. Δημοτική πεζογραφίαΟ δέκατος έβδομος αιώνας3. Η λογοτεχνική ακμή στην Κρήτη (1570 - 1669)Κρητικό θέατροΤραγωδίεςΚωμωδίεςΠοιμενική ποίησηΘυσία του Αβραάμ και Ερωτόκριτος4. Ο δέκατος όγδοος αιώνας. Νεοελληνικός διαφωτισμόςΠρώτη περίοδος: 1669-1770/80Δεύτερη περίοδος: 1770-1820. Η ακμή του διαφωτισμού. Το γλωσσικό ζήτημαΑ. Κοραής5. Το δημοτικό τραγούδιΗ τεχνικήΟι συλλογέςΔΕΥΤΕΡΟ ΜΕΡΟΣ: ΔΕΚΑΤΟΣ ΕΝΑΤΟΣ ΚΑΙ ΕΙΚΟΣΤΟΣ ΑΙΩΝΑΣ6. Οι δεκαετίες πριν από την επανάσταση. Ρήγας. Χριστόπουλος. Βηλαράς7. Σολωμός8. Ο Κάλβος. Η Εφτανησιώτικη σχολή και ο ΒαλαωρίτηςΑ. ΚάλβοςΕφτανησιώτικη σχολήΑ. Βαλαωρίτης9. Το ελληνικό κράτος. Οι Φαναριώτες και η Αθηναϊκή σχολή. Ελληνικός ρομαντισμόςΤο ελληνικό κράτοςΕλληνικός ρομαντισμόςΠεζογραφία και θέατρο10. Η γενιά του 1880. Νέα Αθηναϊκή σχολή. Κωστής ΠαλαμάςΗ δεκαετία 1870-1880Η γενιά του 1880. ΠαρνασσισμόςΚωστής Παλαμάς11. Η πεζογραφία μετά το 1880. Το ηθογραφικό διήγημα. Το γλωσσικό ζήτημα και ο ΨυχάρηςΤο ηθογραφικό διήγημαΤο γλωσσικό ζήτημα και ο ΨυχάρηςΝεώτεροι πεζογράφοι. Γρ. ΞενόπουλοςΤο θέατρο12. Η ποίηση γύρω και ύστερα από τον Παλαμά13. Καβάφης, Σικελιανός. Η ποίηση ως τα 1930Κ.Π. ΚαβάφηςΑ. ΣικελιανόςΗ ποίηση ως το 193014. Οι πρώτες δεκαετίες του αιώνα μας. Η πεζογραφία μετά τον Ψυχάρη. Ν. ΚαζαντζάκηςΟι πρώτες δεκαετίες του αιώνα μαςΗ πεζογραφία στα χρόνια 1900-1920Το θέατροΗ κριτικήΝ. Καζαντζάκης15. Η γενιά του 1930. ΠοίησηΓ. ΣεφέρηςΥπερρεαλισμός και νεώτεροι16. Η γενιά του 1930. ΠεζογραφίαΤο θέατρο και η κριτική17. Μεταπολεμική ποίηση και πεζογραφίαΗ ποίησηΗ πεζογραφίαΤο θέατρο και η κριτικήΣυγκριτικοί χρονολογικοί ΠινάκεςΕκλογή βιβλιογραφίαςΕυρετήριοΣυμπλήρωμα στην εκλογή βιβλιογραφίας",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Linos Politis",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/671552._"
}