{
  "title": "حوادث دمشق اليومية",
  "description": "ألف هذا الكتاب أحد أبناء الشعب الدمشقي في القرن الثامن عشر، وهو \"أحمد البديري الحلاق الدمشقي\"، وقد دون فيه (حوادث دمشق اليومية) في خلال إحدى وعشرين سنة من ذلك القرن، وهي الواقعية بين سنتي 1154 و1175 هجرية (1741-1762 ميلادية). لم يقصد البديري بكتابه أن يدون تاريخاً لبلده فمثل هذا العمل الكبير كان فوق ما تحتمله ثقافة الرجل، بل كان فوق إدراك أكثر علماء ذلك الزمان، ولكنه شهد أحداثاً انفعل بها، فانكب على أوراقه يسجل ما شهد وما سمع يوماً بعد آخر، دفعته إلى ذلك مجرد الرغبة في التسجيل خشبة النسيان، أو هوية الكتابة أو التعبير عن مشاعره والتنفيس عن كامن عواطفه وتسجيل رأيه في الناس وفي الحوادث، أو الرغبة في إفادة من يأتي بعده، على نحو ما عرف أو سمع عن كتابات من سبقه من الكتاب والمؤرخين. لم يقصد البدير بمؤلفه-إن كان قد قصد حقاً أن يضع مؤلفاً واضح الحدود والمعالم- أن يتقدم به إلى وزير أو يتملق به كبيراُ، فجاء كتابه-أو مذكراته-صورة صادقة من حياة الناس في دمشق في أواسط القرن الثامن عشر. وهذه الصورة التي قدمها لنا البديري عن دمشق في ذلك الوقت لا تكاد تختلف في خطوطها العريضة عن صور الحياة في غير دمشق من الحواضر العربية، لا تكاد تختلف عما نقرؤه في تاريخ الغزي عن حلب أو في تاريخ الجبرتي عن القاهرة أو في مطالع السعود عن بغداد، لا تكاد صور الحياة في هذه الولايات العربية تختلف إحداها عن الأخرى، لأن المقومات التي قامت عليها حياة المجتمعات فيها تكاد تكون واحدة، والأنظمة التي وضعها السلاطين العثمانيون لحكمها كانت واحدة. قلنا هذه الصور تتشابه في عمومياتها، وإن اختلفت جزئياتها باختلاف ظروف ولاية أو حاضرة عن أخرى، من جهة وبتفاوت المستوى الثقافي لأولئك الكتاب الذين قدموا لنا هذه الصور من جهة أخرى. إذا يصور البديري في هذا الكتاب الحياة في دمشق خلال إحدى وعشرين سنة من أواسط القرن الثاني عشر الهجري (الثامن عشر الميلادي) (1154-1175=1741-1762). وقد كاد المؤلف أن يقصر اهتمامه على تدوين ما يجري في دمشق وحدها: من تولي الباشوات وكبار أصحاب المناصب وعزلهم ومصادرة أموالهم كالمتسلم والدفتردار والقاضي والمفتي وأغوات العسكر. وأبناء الحاج في طلوعه وعودته وما جرى له في الطريق، وفتن الأجناد، ونهوض الأسعار واضطراب المن، وفساد الأخلاق وانتشار الأمراض وغزو الجراد ووفاة عالم أو متصوف أو نقيب حرفة وحدوث ظواهر طبيعية من ريح شديد وكسوف وخسوف وزلازل. على أن المؤلف سجل أيضاً بعض ما كان يصل إلى علمه من أحداث تجري في دمشق أو قريب منها، كحروب الباشا ضد الدروز أو المتاولة أو بعض عشائر البدو أو ظاهر العمر شيخ طبرية أو ما يتسامع به الناس عن فتنة في بغداد أو حرب بين الدولة وفارس أو بين أشراف الحجاز... والكتاب يصور لنا دمشق كحاضرة إسلامية، تكون وحدة سياسية وإدارية واقتصادية قائمة بنفسها، زاخرة بالحركة والنشاط فلها أدوات الحكم الخاصة بها، ولها قلعتها وسورها، ولها أجنادها، ولها علماؤها ومتصوفوها ومساجدها، وأحياؤها وحاراتها، وطوائف حرفهاـ ففيها كل العناصر التي كونت منها حاضرة، تستطيع-في السنوات العادية-أن يكفي نفسها بمواردها الخاصة.",
  "genres": [
    "History"
  ],
  "author": "أحمد البديري الحلاق",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/6715509"
}