{
  "title": "Jinnah: India-Partition-Independence",
  "description": "The partition of India, 1947, some call it vivisection as Gandhi had, has without doubt been the most wounding trauma of the twentieth century. It has seared the psyche of four plus generations of this subcontinent. Why did this partition take place at all? Who was/is responsible - Jinnah? The Congress party? Or the British? Jaswant Singh attempts to find an answer, his answer, for there can perhaps not be a definitive answer, yet the author searches. Jinnah's political journey began as 'an ambassador of Hindu-Muslim Unity' (Gopal Krishna Gokhale), yet ended with his becoming the 'sole spokesman' of Muslims in India; the creator of Pakistan, The Quaid-e-Azam: How and why did this transformation take place?No Indian or Pakistani politician/Member of Parliament has ventured an analytical, political biography of Quaid-e-Azam Mohammad Ali Jinnah, about whom views necessarily get divided as being either Hagiographical or additional demonology. The book attempts an objective evaluation. Jaswant Singh's experience as a minister responsible for the conduct of India's foreign policy, managing the country's defence (concurrently), had been uniformly challenging (Lahore Peace process; betrayed at Kargil; Kandahar; the Agra Peace Summit; the attack on Jammu and Kashmir Assembly and the Indian Parliament; coercive diplomacy of 2002; the peace overtures reinitiated in April 2003).He asks where and when did this questionable thesis of 'Muslims as a separate nation' first originate and lead the Indian sub-continent to? And where did it drag Pakistan to? Why then a Bangladesh? Also what now of Pakistan? Where is it headed? This book is special; it stands apart, for it is authored by a practitioner of policy, an innovator of policies in search of definitive answers. Those burning 'whys' of the last sixty-two years, which bedevil us still. Jaswant Singh believes that for the return of lasting peace in South Asia there is no alternative but to first understand what made it 'abandon' us in the first place. Until we do that, a minimum, a must, we will never be able to persuade peace to return.",
  "genres": [
    "History",
    "India",
    "Nonfiction",
    "Biography",
    "Politics",
    "Pakistan",
    "Banned Books"
  ],
  "author": "Jaswant Singh",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/6726938-jinnah"
}