{
  "title": "فصل الخطاب في سيرة أمير المؤمنين عمر بن الخطاب",
  "description": "The second caliph of Islam, ‘Umar ibn al-Khattâb faced more struggles than any other Muslim leader in the early onset of Islam. His life began in a time of ignorance and ended during the Golden Age of Islam. Under his leadership, the Muslim world was witnessing some of its most notable conquests in the history of Islam. The strength and resilience of Islam’s leaders were being tested, and ‘Umar ibn al-Khattâb’s true commitment to Allah shone to reveal an Islamic spirit unlike that found in any other Muslim leader. The standards by which he lived can teach us a lot about determination, hardship, and success. The two books which compose ‘Umar ibn al-Khattâb: His Life and Times are sold together as a set. They belong in Part II of the Islamic History Series, as the second set of The Rightly Guided Caliphs. The Table of Contents for Volume 1 of ‘Umar ibn al-Khattâb: His Life and Times may be viewed via the 'View Table of Contents' link located above. This book was translated into English by Nasiruddin al-Khattab. From the Translator: For those who would be leaders, this book offers the model of an ideal Muslim leader, one who felt responsible before Allah for the well being of all those under his rule, including his troops, women, infants, non-Muslim subjects and even animals. ‘Umar was a 'hands on' leader who kept himself informed and consulted scholars and experts before every major decision. For the rest of us, this book offers a window into an exciting and important period of Islamic history, and it also reminds of an important lesson, that our strength comes not from wealth or money or status, but from our submission to Allah and our commitment to the path of Islam.",
  "genres": [
    "Islam",
    "History",
    "Biography",
    "Religion",
    "Nonfiction",
    "Autobiography"
  ],
  "author": "Ali Muhammad As-Sallabi",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/6721258"
}