{
  "title": "Sins of the Seventh Sister",
  "description": "How many times have you thought, “this has got to be true—no one could make this up?” Well, in 1929, Huston Curtiss was seven years old, living with his beautiful, opinionated mother (whose image is on the cover of this book), and surrounded by their romantic, fiercely independent, and often certifiably insane relatives. Huston has never before written about that time—an era of racism and repression, a time when this country was still relatively young, an age of quirky individualism and almost frontier-style freedom that largely has ceased to exist. Fearful he would not be believed, on one hand, but desirous of the freedom to embellish, on the other, Curtiss chronicles that time in Sins of the Seventh Sister , a book he characterizes as “a novel based on a true story of the gothic South.”It is his story and the story of the people of Elkins, West Virginia, a small town whose inhabitants included his mother, Billy-Pearl Curtiss, and her many sisters—all stunning blondes. Billy-Pearl would prove to be an irresistibly romantic figure in her son’s life. She was the seventh of eleven children, all girls to her father’s consternation. By the time of her arrival, her father felt he had been patient enough and insisted on calling her Billy; he taught her everything he had intended to impart to his firstborn son. She would grow up to be one of the most beautiful women in the county, but also one of the most opinionated and liberal. Her aim was so precise that she was barred from the local turkey shoot because none of the men had a chance against her. When a Klansman accused her of attempted homicide after she shot him through the shoulder to stop him from setting fire to the home of her black neighbors, she told the sheriff, “If I had meant to kill him, he’d be dead.” And with that defense, she was exonerated.Curtiss Farm was large and the house had many rooms, which Billy-Pearl got in the habit of gathering people to fill, especially the downtrodden who had nowhere to go. In May 1929, Billy-Pearl brought home a boy from the local orphanage. Stanley was sixteen, the age at which the orphanage kicked children out, and Billy-Pearl, knowing his sad history, could not allow him to end up on the streets. Stanley had witnessed his father beat his mother to death in a drunken rage and had taken a straight razor and slit his father’s throat while he slept. A country judge had the boy castrated to control his aggressive ways. Not a boy, but not yet a man, Stanley was tall, willowy, and frightened as a colt upon his arrival at Curtiss Farm—not at all the playmate for whom Huston had hoped. But quickly a friendship developed between the two that would last a lifetime—a friendship that would survive murder, suicide, madness, and Stanley’s eventual transformation into Stella, a singer who would live her adult life as a glamorous woman.Sins of the Seventh Sister is brilliantly conceived and masterfully written, as alive with flamboyant characters and wildly uncontained emotions as any book to come out of the South.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Southern",
    "Historical"
  ],
  "author": "Huston C. Curtiss",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/672154.Sins_of_the_Seventh_Sister"
}