{
  "title": "Is There a Text in This Class? The Authority of Interpretive Communities",
  "description": "Stanley Fish is one of America's most stimulating literary theorists. In this book, he undertakes a profound reexamination of some of criticism's most basic assumptions. He penetrates to the core of the modern debate about interpretation, explodes numerous misleading formulations, and offers a stunning proposal for a new way of thinking about the way we read.Fish begins by examining the relation between a reader and a text, arguing against the formalist belief that the text alone is the basic, knowable, neutral, and unchanging component of literary experience. But in arguing for the right of the reader to interpret and in effect create the literary work, he skillfully avoids the old trap of subjectivity. To claim that each reader essentially participates in the making of a poem or novel is not, he shows, an invitation to unchecked subjectivity and to the endless proliferation of competing interpretations. For each reader approaches a literary work not as an isolated individual but as part of a community of readers. 'Indeed,\" he writes, \"it is interpretive communities, rather than either the text or reader, that produce meanings.\"The book is developmental, not static. Fish at all times reveals the evolutionary aspect of his work--the manner in which he has assumed new positions, altered them, and then moved on. Previously published essays are introduced by headnotes which relate them to the central notion of interpretive communities as it emerges in the final chapters. In the course of refining his theory, Fish includes rather than excludes the thinking of other critics and shows how often they agree with him, even when he and they may appear to be most dramatically at odds. Engaging, lucid, provocative, this book will immediately find its place among the seminal works of modern literary criticism.",
  "genres": [
    "Nonfiction",
    "Literary Criticism",
    "Theory",
    "Philosophy",
    "Criticism",
    "Academic",
    "Writing"
  ],
  "author": "Stanley Fish",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/672148.Is_There_a_Text_in_This_Class_The_Authority_of_Interpretive_Communities"
}