{
  "title": "I Don't Care About Your Band: Lessons Learned from Indie Rockers, Trust Funders, Pornographers, Felons, Faux-Sensitive Hipsters, and Other Guys I've Dated",
  "description": "In the tradition of Cynthia Heimel and Chelsea Handler, and with the boisterous iconoclasm of Amy Sedaris, Julie Klausner's candid and funny debut I Don't Care About Your Band sheds light on the humiliations we endure to find love--and the lessons that can be culled from the wreckage. I Don't Care About Your Band posits that lately the worst guys to date are the ones who seem sensitive. It's the jerks in nice guy clothing, not the players in Ed Hardy, who break the hearts of modern girls who grew up in the shadow of feminism, thinking they could have everything, but end up compromising constantly. The cowards, the kidults, the critics, and the contenders: these are the stars of Klausner's memoir about how hard it is to find a man--good or otherwise--when you're a cynical grown-up exiled in the dregs of Guyville. Off the popularity of her New York Times \"Modern Love\" piece about getting the brush-off from an indie rock musician, I Don't care About Your Band is marbled with the wry strains of Julie Klausner's precocious curmudgeonry and brimming with truths that anyone who's ever been on a date will relate to. Klausner is an expert at landing herself waist-deep in crazy, time and time again, in part because her experience as a comedy writer (Best Week Ever, TV Funhouse on SNL) and sketch comedian from NYC's Upright Citizens Brigade fuels her philosophy of how any scene should unfold, which is, \"What? That sounds crazy? Okay, I'll do it.\" I Don't Care About Your Band charts a distinctly human journey of a strong-willed but vulnerable protagonist who loves men like it's her job, but who's done with guys who know more about love songs than love. Klausner's is a new outlook on dating in a time of pop culture obsession, and she spent her 20's doing personal field research to back up her philosophies. This is the girl's version of High Fidelity. By turns explicit, funny and moving, Klausner's debut shows the evolution of a young woman who endured myriad encounters with the wrong guys, to emerge with real- world wisdom on matters of the heart. I Don't Care About Your Band is Julie Klausner's manifesto, and every one of us can relate.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Humor",
    "Comedy",
    "Biography",
    "Essays",
    "Biography Memoir"
  ],
  "author": "Julie Klausner",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/6723170-i-don-t-care-about-your-band"
}