{
  "title": "स्वामी [Swami]",
  "description": "The Maratha empire established in Maharashtra by Chhatrapati Shivaji Maharaj (d. 1680) against all odds later passed into the hands of the Peshwas (prime minister) who became the supreme lords. The Maratha Empire which stretched across a sizeable portion of Western, Central and Northern India suffered a severe setback when the Marathas lost the (Third) Battle of Panipat in 1761. It was an immense loss of men, money, and material. The then Peshwa Nanasaheb could not bear the brunt of the casualties which included his eldest son and younger brother, and soon passed away.For the sixteen year old Madhavrao who succeeded Nanasaheb, it was not a piece of cake. The coffers were empty, the royal court was fraught with internal dissensions. Madhavrao could not go along with his uncle, Raghunathrao, who wanted to be the Peshwa, and went to any extent including looting his own subjects. The Nizam, Hyder, and the British had set their eyes on the Maratha empire.Swami is based on the life and character of Madhavrao who resurrected the Maratha empire. He revived the lost glory and pride. The extent of the empire was now wider than before. He contained the enemy. Swami sketches the personal life of the Peshwa and specially poignant are the parts covering the discomfort he feels when Raghunathrao is a thorn in his flesh, and his untimely death. The novel throws light on the political, social and cultural history of the mid Peshwa era. The portrayal of the bond between Madhavrao and his wife, Ramabai, is a special feature.Ranjit Desai (1928-1992) tackled the genre of novels with such ease that his collection includes all types of novels: historical, social, mythological, and biographical. He was also a playwright and has to his credit short stories.",
  "genres": [
    "Marathi",
    "History",
    "Biography",
    "Historical",
    "Nonfiction",
    "Classics",
    "India"
  ],
  "author": "Ranjit Desai",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/6727758-swami"
}