{
  "title": "Poor Folk",
  "description": "Poor Folk (Russian: Бедные люди, Bednye lyudi), sometimes translated as Poor People,[note] is the first novel by Fyodor Dostoevsky, written over the span of nine months between 1844 and 1845. Dostoevsky was in financial difficulty because of his extravagant lifestyle and his developing gambling addiction; although he had produced some translations of foreign novels, they had little success, and he decided to write a novel of his own to try to raise funds.Inspired by the works of Gogol, Pushkin, and Karamzin, as well as English and French authors, Poor Folk is written in the form of letters between the two main characters, Makar Devushkin and Varvara Dobroselova, who are poor third cousins twice removed. The novel showcases the life of poor people, their relationship with rich people, and poverty in general, all common themes of literary naturalism. A deep but odd friendship develops between them until Dobroselova loses her interest in literature, and later in communicating with Devushkin after a rich widower Mr. Bykov proposes to her. Devushkin, a prototype of the clerk found in many works of naturalistic literature at that time, retains his sentimental characteristics; Dobroselova abandons art, while Devushkin cannot live without literature.Contemporary critics lauded Poor Folk for its humanitarian themes. While Vissarion Belinsky dubbed the novel Russia's first \"social novel\" and Alexander Herzen called it a major socialist work, other critics detected parody and satire. The novel uses a complicated polyphony of voices from different perspectives and narrators. Initially offered by Dostoyevsky to the liberal-leaning magazine Fatherland Notes, the novel was published in the almanac, St. Petersburg Collection, on January 15, 1846. It became a huge success nationwide. Parts of it were translated into German by Wilhelm Wolfsohn and published in an 1846/1847 magazine. The first English translation was provided by Lena Milman in 1894, with an introduction by George Moore, cover art design by Aubrey Beardsley, and publication by London's Mathews and Lane.",
  "genres": [
    "Fiction",
    "Russian Literature",
    "Russia",
    "Novels",
    "Literature",
    "Classics",
    "19th Century"
  ],
  "author": "Fyodor Dostoevsky",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/67326.Poor_Folk"
}