{
  "title": "منهج التربية النبوية للطفل",
  "description": "منهج التربية النبوية للطفل, مع نماذج تطبيقية من حياة السلف الصالح وأقوال العلماء العاملين:*كتاب قيّم مكث المهندس محمد نور بن عبد الحفيظ سويد على تأليفه عشر سنوات..!*اتبع فيه مؤلفه أن يكون النبع النبوي هو الأساس والمرتكز في استنباط الأفكار وترتيبها, ولم يكن لدى المؤلف ثمة أفكار مسبقة ليبحث لها عن دليل في الأحاديث النبوية, وإنما العكس هو الصحيح ..!فطريقة الاستنباط ـ كما يؤكد مؤلفه ـ كانت من الحديث مباشرة, على خلاف ما يفعله بعضهم من أخذ الأسلوب الغربي أو الشرقي, ثم البحث عن دليل له في الشرع,,إذ يرى المؤلف أن هذ العمل ترقيعي..!*الكتاب قدم له عدد من المشاهير كـ أبي الحسن الندوي, عبد الرحمن حسن حبنكة, محمود الطحان,,* طبع عدة طبعات, طبعتان منها في سنة واحدة, والطبعة التي عندي الطبعة السادسة 1427,.,فصول الكتاب:بدأ الكتاب بمقدمة عن منهج المؤلف بالكتاب, ثم تعريفات عنوان الكتاب,,والكتاب يتكون من قسمين:القسم الأول: إعداد وتهيئة الزوجين والمربين لتربية الطفل.الذي يحتوي على 5 فصول:الفصل الأول: مقدمات عامة إلى الوالدين(مسؤولية التربية, السعي للزواج من امرأة صالحة, ثواب الإنفاق على الزوجة والأولاد, أهداف الزواج, صفات المربي الناجح, ...)الفصل الثاني: الطفل من الولادة إلى الحولين.(عمل اليوم الأول من الولادة, عمل اليوم السابع, الرضاعة والفطام, ...)الفصل الثالث: الأساليب التربوية النبوية للطفل.ويحتوي على 3 أبواب: الباب الأول: الأساليب المخاطب المخاطب بها الوالدان والمربون(القدوة الحسنة, تحيّن الوقت المناسب, العدل والمساواة, الاستجابة لحقوق الأطفال, ...)الباب الثاني: الأساليب الفكرية المؤثرة في عقل الطفل(رواية القصص للطفل, الخطاب المباشر, خطاب الطفل على قدر عقله, الحوار الهادئ, ...)الباب الثالث: الأساليب النفسية المؤثرة في نفس الطفل(صحبة الطفل, إدخال السرور والفرح في نفس الطفل, زرع التنافس البناء بين الأطفال ومكافأة الفائز, ...)الفصل الرابع: أسلوب الترغيب في بر الوالدين والترهيب من عقوقهما.(في حياتها, وبعد وفاة أحدهما أو كليهما)الفصل الخامس: أسلوب تأديب الطفل.(التأديب ضرورة تربوية, تصحيح الخطأ فكريا ثم عمليا, التدرج في تأديب الطفل...)والقسم الثاني: بناء شخصية الطفل الإسلامية.ويحتوي على 9 أبواب هي: البناء العقدي, العبادي الاجتماعي, الأخلاقي, العاطفي والنفسي, الجسمي, العلمي والفكري, الصحي, تهذيب الدافع الجنسي للطفل.ثم ختم الكتاب بـ 40 حديثا خاطب بها النبي ـ صلى الله عليه وسلم ـ الآباء والمربين,,ثم 40 حديثا خاطب بها النبي ـ صلى الله عليه وسلم ـ الأطفال,,وهي كالملخص لما ورد في الكتاب عموما,,",
  "genres": [
    "Parenting",
    "Childrens"
  ],
  "author": "محمد نور بن عبد الحفيظ سويد",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/6730636"
}