{
  "title": "The Poet Prince",
  "description": "The Son of Man shall chooseWhen the time returns for the Poet Prince.He will inspire the hearts and minds of the peopleSo as to illuminate the path of serviceAnd show them the Way.This is his legacy,This, and to know a very great love. Worldwide controversy surrounds author Maureen Paschal as she promotes her new bestseller—the explosive account of her discovery of a gospel written in Jesus’ own hand. But a scandalous headline about her lover, Bérenger Sinclair, shatters Maureen’s plans and sends her to Florence. In Tuscany, Maureen and Bérenger seek out their spiritual teacher Destino, who insists the besieged couple study one of history’s great Poet Princes: Lorenzo de’ Medici, the godfather of the Italian Renaissance. Bérenger is a Poet Prince of the ancient bloodline prophecy, and even across the centuries, his fate is intertwined with Lorenzo de’ Medici’s. Bérenger must uncover the heretical secrets of the Medici family—and the shocking truth behind the birth of the Renaissance—if he is to fulfill his own destiny. These heretical secrets were hidden for a reason, and there are those who would stop at nothing to prevent Bérenger’s assumption of his rightful role.The Renaissance comes vividly to life as Maureen decodes the clues contained within the great masterpieces of Lorenzo the Magnificent’s friends: Donatello, Botticelli, and Michelangelo. Maureen uncovers truths connected to the legend of Longinus Gaius, the Roman centurion who used pierced the crucified Jesus with his spear. Could Longinus Gaius, doomed to live forever, be someone she knows? Could his infamous Spear of Destiny, sought even by Hitler, be the key to Bérenger’s fate? As Maureen and Bérenger race to find the answers, someone is after them, hell-bent on settling a five-hundred-year old blood feud and destroying the heresy once and for all.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Romance",
    "Historical",
    "Audiobook",
    "Thriller"
  ],
  "author": "Kathleen McGowan",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/6730191-the-poet-prince"
}