{
  "title": "Code Name Nimrod",
  "description": "“A volunteer was urgently required for a secret assignment of the highest priority. He must be of non-Jewish appearance, speak German perfectly, and preferably have a German or Austrian background. A good knowledge of French on a conversational level was also desirable. ...This man would be required to work in dangerous circumstances, totally on his own.”James Leasor first heard of The Unknown Warrior's unique assignment from Major General Sir Leslie Hollis, KCB, KBE, Senior Military Assistant Secretary to the War Cabinet and Chiefs of Staff Committee. Some years later, when more had been made public about the immense secret contribution to victory of these deception plans, Sir Ronald Wingate, Bt., CB, CMG, CIE, OBE, recalled this episode, in which he had played such an important part. At that time, James Leasor was working on Green Beach, which described an incident in the 1942 Dieppe landing, when another volunteer, Flight-Sergeant Jack Nissen, a radar expert in the RAF, accompanied the Canadians to assess a new German radar station at Pourville. Because of Nissen's knowledge of Allied radar, orders were given that if capture seemed likely he was to be killed by his escort of 12 soldiers. Lord Mountbatten was horrified at these orders. He remarked that there had been no need whatever to put radar secret at risk when members of X-Troop were trained for such tasks. He suggested that James Leasor should write a book based on the experiences of these men.The Unknown Warrior is the true story of one of these men and his amazing part in the deception plans to persuade the Germans that the invasion would happen near Calais and not in Normandy and thus ensure that they did not commit their reserves until too late. Born to a humble German background, with a Jewish father and Catholic mother, he was brought up as English due to a mix-up when he was very small. Not really sure of his real name or nationality he is initially interned by the British but enlists for service and ends up in X-Troop. He volunteers for an unknown secret mission which sees him dropped in France, pursued by both the Resistance and the Germans, briefing first Rommel and then Hitler in a role that saved perhaps thousands of lives.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "James Leasor",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/6728634-code-name-nimrod"
}