{
  "title": "36 Arguments for the Existence of God: A Work of Fiction",
  "description": "After Cass Seltzer’s book becomes a surprise best seller, he’s dubbed “the atheist with a soul” and becomes a celebrity. He wins over the stunning Lucinda Mandelbaum, “the goddess of game theory,” and loses himself in a spiritually expansive infatuation. A former girlfriend an anthropologist who invites him to join in her quest for immortality through biochemistry. And he is haunted by reminders of the two people who ignited his passion to understand his mentor and professor—a renowned literary scholar with a suspicious obsession with messianism—and an angelic six-year-old mathematical genius who is heir to the leadership of a Hasidic sect. Each encounter reinforces Cass’s theory that the religious impulse spills over into life at large. 36 Arguments for the Existence of God plunges into the great debate of our the clash between faith and reason. World events are being shaped by fervent believers at home and abroad, while a new atheism is asserting itself in the public sphere. On purely intellectual grounds the skeptics would seem to have everything on their side. Yet people refuse to accept their seemingly irrefutable arguments and continue to embrace faith in God as their source of meaning, purpose, and comfort. Through the enchantment of fiction, award-winning novelist and MacArthur Fellow Rebecca Newberger Goldstein shows that the tension between religion and doubt cannot be understood through rational argument alone. It also must be explored from the point of view of individual people caught in the raptures and torments of religious experience in all their variety. Using her gifts in fiction and philosophy, Goldstein has produced a true crossover novel, complete with a nail-biting debate (“ God Exists”) and a stand-alone appendix with the thirty-six arguments (and responses) that propelled Seltzer to stardom.",
  "genres": [
    "Fiction",
    "Philosophy",
    "Religion",
    "Atheism",
    "Jewish",
    "Novels",
    "Literature"
  ],
  "author": "Rebecca Goldstein",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/6734417-36-arguments-for-the-existence-of-god"
}