{
  "title": "The Lees of Virginia: Seven Generations of an American Family",
  "description": "There are few American families that feature such a collection of characters, both heroic and ignoble, who have made such a mark on history as the Lees. In The Lees of Virginia, Paul Nagel chronicles seven generations of Lees, covering over two hundred years of accolades and scandals. We meet Thomas Lee, who dreamed of America as a continental empire, and his son, Arthur Lee, who created a political storm with his accusations against Benjamin Franklin. Arthur's cousin was Light-Horse Harry Lee, a controversial cavalry officer in the Revolutionary War, whose wild real estate speculation led to imprisonment for debt and finally self-exile in the Caribbean. One of Harry's sons, Henry Lee, further disgraced the family by seducing his sister-in-law and frittering away Stratford, the Lees' ancestral home. It was a third son, Robert E. Lee, who would become the family's redeeming figure, a brilliant tactician still revered for his lofty character and military success. In these and numerous other portraits, Nagel discloses how, from 1640 to 1870, a family spirit united the Lees, making them a force in Virginian and American affairs. This Bicentennial Edition, celebrating the birth of Robert E. Lee in 1807, features a new Preface by the author in which he discusses the ways in which family biographies can contribute to the ongoing debate about what constitutes \"family values.\" Paul Nagel is a leading chronicler of families prominent in our history. His Descent from Glory, a masterful narrative account of four generations of Adamses, was hailed by Chicago Sun-Times as \"a magnificent embarrassment of biographical riches.\" Now, in The Lees of Virginia, Nagel brings his skills to bear on another major American family, taking readers inside the great estates of the Old Dominion and the turbulent lives of the Lee men and women.",
  "genres": [
    "Biography",
    "History",
    "Civil War",
    "Nonfiction",
    "American History"
  ],
  "author": "Paul C. Nagel",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1298798.The_Lees_of_Virginia"
}