{
  "title": "The Beauty of Humanity Movement",
  "description": "This deeply observed novel of contemporary Vietnam interweaves stories of a venerable soup seller, a young Vietnamese American curator, and an enterprising tour guide in ways that will mark all of their lives forever.Maggie, an art curator who is Vietnamese by birth but who has lived most of her life in the United States, has returned to her country of origin in search of clues to her dissident father's disappearance. She remembers him only in fragments, as an injured artist from whom she and her mother were separated during the war. In her journey, Maggie finds herself at a makeshift pho stall, where the rich aroma of beef noodle soup lures people off Hanoi's busy streets and into a quiet morning ritual. Old Man Hung, the enlightened proprietor of the beloved pho stall, has survived decades of poverty and political upheaval. Hung once had a shop that served as a meeting place for dissident artists. As Maggie discovers, this old man may hold the key to both her past and her future. Among Hung's most faithful customers is Tu', a dynamic young tour guide who works for a company called New Dawn. Tu' leads tourists through the city, including American vets on war tours, but he has begun to wonder what it is they are seeing of Vietnam-and what they miss entirely. In Maggie, he finds a young Americanized woman in search of something quite different, leading him beyond his realm of expertise. In sensual, interwoven narratives, Maggie, Hung, and Tu' come together in a highly charged season that will mark all of them forever. The Beauty of Humanity Movement is a skillfully wrought novel about the reverberation of conflict through generations, the enduring legacy of art, and the redemption and renewal of love. The story of these characters is tinged with longing for worlds and loved ones lost but also filled with the hope that faith can heal the pain of their shared country's turbulent past. This is the distinct and complex story of contemporary Vietnam, a country undergoing momentous change, and a story of how family is defined-not always by bloodlines, but by heart.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Asia",
    "Canada",
    "Historical",
    "Contemporary"
  ],
  "author": "Camilla Gibb",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/6738493-the-beauty-of-humanity-movement"
}