{
  "title": "The Scent of Water",
  "description": "The Scent of Water is a novel of love—love in its many aspects and love in its final, finest essence. It tells the story of Mary Lindsay, one of Miss Goudge's most absorbing and memorable characters, a mature, attractive woman who, after a distinguished career in the city, returns to the village of her childhood memories in quest of the personal fulfillments that have been denied her.In the beautiful village of Appleshaw, deep in the English countryside, each person Mary meets seems to be landlocked in the sea of life—torn by conflict, searching for self-realization and love. Like herself. Though loved, Mary feels that she has never experienced the giving of love, for her fiancé had been killed in the war and she had never married. Yet here, in the natural beauty of the country, surrounded by the gift of love from her Cousin Mary, who had willed to her the wonderful cottage called The Laurels, and in her relationships with the villagers, Mary learns in turn to give—and her selfless devotion to the young war veteran Paul Randall nourishes his broken spirit back to health, and his marriage back to happiness.As the modern story of Mary Lindsay unfolds, another story is spun with the haunting threads of nostalgia—the story of the beloved Cousin Mary whose posthumous gift of The Laurels had brought Mary to Appleshaw. Mortally ill, Cousin Mary had created this magnificent home for the fulfillment of someone other than herself, sustained through her long struggle by the conviction expressed in The Book of Job: \"For there is hope of a tree, if it be cut down, that it will sprout again, and that the tender branch thereof will not cease...through the scent of water it will bud, and bring forth boughs like a plant.\"As the living branch of the fallen tree, Mary Lindsay reaches out to the residents of Appleshaw, and their lives blossom under the warmth of her compassion and the wisdom of love she has learned from Cousin Mary: \"Nothing is ever over. You thread things on your life and think you've finished with them but you haven't because it's like beads on a string and they come around again. When it comes round again then if it is possible you give what you failed to give before to someone else. You will have made reparation for we are all one person.\"",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Classics",
    "Christian",
    "Book Club",
    "Novels",
    "Christian Fiction"
  ],
  "author": "Elizabeth Goudge",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/673799.The_Scent_of_Water"
}