{
  "title": "Flight of the Goose: A Story of the Far North",
  "description": "\"An) exquisite example of storytelling... A gifted writer with a sense of Alaska Native culture and tradition...\" ~ \"First Alaskans Magazine\"\"Flight of the Goose\" is an award-winning novel set in a traditional village and the wilds of the far north, where author Lesley Thomas grew up. praise by Fred Bigjim, Inupiaq author of \"Plants: A Novel, Echoes from the Tundra\"\"A remarkable achievement... About loss and loneliness, alienation and fear, acceptance and forgiveness, natural and supernatural (whose) characters seem drawn from life. Its complex treatment of problems that face us all in a world of unavoidable change and contact, will haunt the reader long after the covers have been closed.\"\"A serious work of modern literature... Portrays a world in which traditional values clash with modern expectations.\" ~ \"Alaska Anthropological Association\"Shamanism, sorcery, witchcraft...and science! Violence, villains, wildlife adventures! Culture clash, climate change, Big Oil and draft dodgers!Wolves, grizzly bears, polar bears, seals, walrus, fish, reindeer and birds birds birds! all within a haunting love story that one reviewer compared to \"Wuthering Heights,\" another calling it \"Romeo and Juliet of the Arctic\" - \"Amazing... I loved this book (and) am recommending it to everyone I meet.\" ~ Sandra Ingerman, author of \"Soul Retrieval\"\"Flight of the Goose\" won first place in several literary contests. It is endorsed by Alaska Native Elders, anthropologists, scientists, writers, missionaries and shamans.\"Moving and extremely well-written... Besides shamanic themes... the story addresses many other significant issues - climate change, environmental crisis, and indigenous rights - and it does so with both artistry and insight.\" ~ \"Shaman’s Drum Journal\" 1971, the Alaskan Arctic. \"It was a time when much was hidden, before outsiders came on bended knee to learn from the elders. Outsiders came, but it was not to learn from us; it was to change us. There was a war and a university, an oil company and a small village, all run by men. There was a young man who hunted geese to feed his family and another who studied geese to save them. And there was a young woman who flew into the world of spirits to save herself...\"So relates Kayuqtuq Ugungoraseok, \"the red fox\". An orphan traumatized by her past, she seeks respect in her traditional Inupiat village through the outlawed path of shamanism. Her plan leads to tragedy when she interferes with scientist Leif Trygvesen, who has come to research the effects of oil spills on salt marshes - and evade the draft. Told from both Kayuqtuq's and Leif's perspectives, Flight of the Goose is a tale of cultural conflict, spiritual awakening, redemption and love in a time when things were - to use the phrase of an old arctic shaman - \"no longer familiar\".\"What an extraordinary novel... (Thomas) deals with shamanism and sorcery in a very realistic way...\" ~ \"Sacred Hoop Magazine\" \"Masterful... Remarkable... Gripping...The authenticity palpable... A joy, a big broad deep river of a book, a work of substance and great beauty of both vision and style... I was moved by the characters and their fates as I have not been by a novel in a long time.\" ~ Richard Hoffman, author of \"Half the House\"Read at universities and schools, book-clubs and in academic libraries worldwide",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Indigenous",
    "Romance",
    "Fantasy",
    "Nature",
    "Outdoors"
  ],
  "author": "Lesley Thomas",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/673501.Flight_of_the_Goose"
}