{
  "title": "Toyota Kata: Managing People for Improvement, Adaptiveness and Superior Results",
  "description": "\"How any organization in any industry can progress from old-fashioned management by results to a strikingly different and better way.\"--James P. Womack, Chairman and Founder, Lean Enterprise Institute. This game-changing book puts you behind the curtain of Toyota, providing new insight into the legendary automaker's management practices and offering practical guidance for leading and developing people in a way that makes the best use of their brainpower. Drawing on six years of research into Toyota's employee-management routines, Toyota Kata examines and elucidates, for the first time, the company's organizational routines--called kata--that power its success with continuous improvement and adaptation. The book also reaches beyond Toyota to explain issues of human behavior in organizations and provide specific answers to questions such as: How can we make improvement and adaptation part of everyday work throughout the organization? How can we develop and utilize the capability of everyone in the organization to repeatedly work toward and achieve new levels of performance? How can we give an organization the power to handle dynamic, unpredictable situations and keep satisfying customers? Mike Rother explains how to improve our prevailing management approach through the use of two kata: Improvement Kata--a repeating routine of establishing challenging target conditions, working step-by-step through obstacles, and always learning from the problems we encounter; and Coaching Kata: a pattern of teaching the improvement kata to employees at every level to ensure it motivates their ways of thinking and acting. With clear detail, an abundance of practical examples, and a cohesive explanation from start to finish, Toyota Kata gives executives and managers at any level actionable routines of thought and behavior that produce superior results and sustained competitive advantage.",
  "genres": [
    "Business",
    "Management",
    "Leadership",
    "Nonfiction",
    "Audiobook",
    "Self Help",
    "Technology"
  ],
  "author": "Mike Rother",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/6736366-toyota-kata"
}