{
  "title": "Helmut Newton: Sumo",
  "description": "SUMO was a titanic book in every respect: a 480-page tribute to the 20th century’s most influential, intriguing and controversial photographer, it broke records for weight,  dimensions, and resale price. Helmut Newton (1920–2004) always demonstrated a healthy disdain for easy or predictable solutions. SUMO—a bold and unprecedented publishing venture—was an irresistible project. The idea of a spectacular compendium of images, a book with the dimensions of a private exhibition, reproduced to exceptional page size and to state-of-the-art origination and printing standards, emerged from an open, exploratory dialogue between photographer and publisher.With the physically commanding SUMO weighing in—boxed and shrink-wrapped—at 35.4 kilos, Newton created a landmark book that stood head and shoulders above anything previously attempted, either in terms of conceptual extravagance or technical specifications. Published in an edition of 10,000 signed and numbered copies, SUMO sold out soon after publication and quickly multiplied its value. This worldwide publishing sensation now features in numerous important collections around the world, including New York's Museum of Modern Art. Legendary SUMO copy number one, autographed by over 100 of the book's featured celebrities, also broke the record for the most expensive book published in the 20th century, selling at auction in Berlin on April 6, 2000 for 620,000 German Marks – approximately $430,000.Now, 10 years after the original publication, SUMO is back in a more economical edition, but one with the same DNA as its unique progenitor.SUMO established new standards for the art monograph genre, and secured a prominent place in photo-book history. This new edition is the fulfillment of an ambition conceived some years ago by Helmut Newton. He would surely be pleased that, a decade on from its first publication, SUMO—now in a format that allows for a more democratic distribution—will reach the widest possible audience.\n\nHowever, proud owners of the new edition won't wrestle with their copy of SUMO. It comes with a unique stand for displaying the book at home:",
  "genres": [
    "Photography",
    "Art",
    "Nonfiction",
    "Art and Photography",
    "Fashion"
  ],
  "author": "Helmut Newton",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/6737159-helmut-newton"
}