{
  "title": "The Moonlit Earth",
  "description": "“How long do I have to convince you that my brother is not capable of murdering sixty people?” Christopher Rice, the author of four New York Times bestselling novels by the age of thirty, returns with his first female protagonist since The Snow Garden. In The Moonlit Earth, he delivers a compelling psychological thriller about a young woman who must act to save her brother’s reputation and life when he is accused of being involved in a terrorist event.When Megan and Cameron Reynolds’s father walked out on their mother, they forged an unbreakable bond. If their father could not be there to take care of them, they would always be there to take care of each other. But life intervenes, and siblings go separate ways . . . until something happens to reforge that bond.At thirty, faced with disappointments in career and romance, Megan Reynolds returns to the safety of Cathedral Beach, the home of her mother, who lives among the wealthy with no money of her own. Cameron worries that his sister will lose herself around their mother’s frivolous life, but Megan worries more about her brother. She worries that Cameron’s care- free charm, which makes him popular in both his work as a flight attendant on a luxury airline and the West Hollywood party scene he enjoys, could lead him into danger.When a bomb goes off in a high-end hotel in Hong Kong, security-camera footage appears on television showing two men escaping: one Middle Eastern and one American. Megan and her mother recognize the young American as Cameron—and find that he has become enmeshed with a mysterious family of wealthy Saudis.In her desperate journey to save her brother’s life, Megan uncovers a trail of secrets and intrigue that snakes from the decadent beaches of southern Thailand to the glass skyscrapers of Hong Kong— and finds herself part of a dark global conspiracy that involves a member of her own family.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "LGBT",
    "Gay",
    "Mystery Thriller",
    "Gay Fiction"
  ],
  "author": "Christopher  Rice",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/6741498-the-moonlit-earth"
}