{
  "title": "The World of Henry Orient",
  "description": "The story is immediately recognizable in its theme and setting, but it exists in what seems to be another time and another place. Nora Johnson's The World of Henry Orient, published in 1958, is an amusing, affectionate satire of the last days of innocence in the lives of two New York girls, Marian \"Gil\" Gilbert and Valerie \"Val\" Boyd. The boredom and impatience of adolescence are richly caught, even as they inspire crazy escapades that will eventually open up the world for these two bright but naive girls.Val and Gil have become friends at an age when friendship is the most important thing. Boys have not entered the picture yet, but childhood has begun to recede and the world is beckoning them. The girls are growing up in comfortable upper-middle-class homes in Manhattan, which creates a special kind of tension and stress in their lives. They are just old enough to have some independence, to play at being grownups, with the city as their playground. At a Carnegie Hall concert, they see a pianist named Henry Orient, and they are immediately smitten with him -- not in the sexual sense, but moonstruck nonetheless. Henry Orient becomes the focus of their lives. They follow him around Manhattan, observing his routine, his \"world,\" unaware at first that they are observing the pianist bound up in a snarl of romantic liaisons. What happens to Val and Gil is what we now called \"bonding,\" the kind of friendship that smoothes the transition from innocence to worldliness, from the certainties of childhood to the infinite possibilities of adulthood.Engaging and exuberant, The World of Henry Orient treats its heroines with affection and good humor. These are silly girls, it seems, doing little more than playing games, but a great deal goes on beneath the surface of their lives. Nora Johnson is sensitive to the delicate stresses that threaten the security adolescents have always known.",
  "genres": [
    "Fiction",
    "Young Adult",
    "Coming Of Age",
    "Novels",
    "New York",
    "Classics"
  ],
  "author": "Nora Johnson",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/674113.The_World_of_Henry_Orient"
}