{
  "title": "Luke Skywalker and the Shadows of Mindor",
  "description": "Emperor Palpatine and Darth Vader are dead. The Empire has been toppled by the triumphant Rebel Alliance, and the New Republic is ascendant. But the struggle against the dark side and the Sith Order is not over. Luke Skywalker, Princess Leia, Han Solo, Lando Calrissian, and their faithful comrades have had little time to savor victory before being called on to defend the newly liberated galaxy.Powerful remnants of the vanquished Empire, hungry for retaliation, are still at large, committing acts of piracy, terrorism, and wholesale slaughter against the worlds of the fledgling New Republic. The most deadly of these, a ruthless legion of black-armored Stormtroopers, do the brutal bidding of the newly risen warlord Shadowspawn. Striking from a strategically advantageous base on the planet Mindor, they are waging a campaign of plunder and destruction, demolishing order and security across the galaxy–and breeding fears of an Imperial resurgence. Another reign of darkness beneath the boot-heel of Sith despotism is something General Luke Skywalker cannot, and will not, risk.Mobilizing the ace fighters of Rogue Squadron–along with the trusty Chewbacca, See-Threepio, and Artoo-Detoo–Luke, Han, and Leia set out to take the battle to the enemy and neutralize the threat before it’s too late. But their imminent attack on Mindor will be playing directly into the hands of their cunning new adversary. Lord Shadowspawn is no freshly anointed Sith Chieftain but in fact a vicious former Imperial Intelligence officer–and Prophet of the Dark Side. The Emperor’s death has paved the way for Shadowspawn’s return from exile in the Outer Rim, and mastery of ancient Sith knowledge and modern technology has given him the capability to mount the ultimate power play for galaxy wide dominion. Dark prophecy has foretold that only one obstacle stands in his way, and he is ready–even eager–for the confrontation.All the classic heroes, all the explosive action and adventure, all the unparalleled excitement of Star Wars come breathlessly alive as the adventures of Luke Skywalker continue.",
  "genres": [
    "Star Wars",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Space Opera",
    "Novels",
    "Adventure"
  ],
  "author": "Matthew Woodring Stover",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/6742792-luke-skywalker-and-the-shadows-of-mindor"
}