{
  "title": "Head Over Heels in the Dales",
  "description": "Head Over Heels in the Dales is the third volume in Gervase Phinn's bestselling Dales Series 'Could you tell me how to spell \"sex\" please?' Gervase Phinn thinks he's heard just about everything in his two years as a school inspector, but a surprising enquiry from an angelic six-year-old reminds him never to take children for granted. This year Gervase has lots of important things on his mind - his impending marriage to Christine Bentley (the prettiest headteacher for miles around), finding somewhere idyllic to live in the Yorkshire Dales, and the chance of a promotion. All of which generate their fair share of excitement, aided and abetted as usual by his colleagues in the office. In Head Over Hells in the Dales, join Gervase Phinn in the classroom where he faces his greatest keeping a straight face as teachers and children alike conspire to have him laughing out loud. 'Gervase Phinn's memoirs have made him a hero in school staff-rooms' Daily Telegraph Gervase Phinn is an author and educator from Rotherham who, after teaching for fourteen years in a variety of schools, moved to North Yorkshire to be a school inspector. He has written autobiographies, novels, plays, collections of poetry and stories, as well as a number of books about education. He holds five fellowships, honorary doctorates from Hull, Leicester and Sheffield Hallam universities, and is a patron of a number of children's charities and organizations. He is married with four adult children. His books include The Other Side of the Dale, Over Hill and Dale, Head Over Heels in the Dales, The Heart of the Dales, Up and Down in the Dales and Trouble at the Little Village School.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Humor",
    "Autobiography",
    "British Literature",
    "21st Century"
  ],
  "author": "Gervase Phinn",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/674411.Head_Over_Heels_in_the_Dales"
}