{
  "title": "Omega Rising",
  "description": "This book is an upcoming series. No known publication date\nZerin is nothing special. Just an average boy, trying to fit in to a world that doesn't seem to like him very much. Adopted by a prominent family, he's treated more like servant than a son.What he doesn't know is that he's actually the son of two human parents who imbued him with powers quite extraordinary, and his adoptive family are sympathizers who are terrified of being caught. One of the most amazing things about him is that in times of angst, he can call on the Ky-Chi and become a burly warrior who is practically invincible.Now he only has to learn to control it and keep it a secret from the Materians who are out to find him and exterminate him before he can locate more of his kind.Josiah's Proclamation (Prologue of Book 1)The virus ran swiftly on the hot summer breeze. Unseen. Unheard. Unknown. It swept through the entire earth in a matter of months, having mercy on no one. Young—old—it didn’t matter.Brought to us by the Drabs, it was the last thing we expected. But the Drabs knew. They even fought a war over whether or not they should save us.In the end, it was decided that we were diseased insects who were unfit to breathe their air.Our air.So they left the human race to die a miserable death of agonizing pain. Left us with no doctors or medicine. Their plan was to rid the earth of us and to take our home as their own.What they never expected was the change that would come after the plague. We didn’t all die as they’d planned. Those under the age of twenty somehow managed to survive the disease. We managed to pull through it, even alone, and we learned to hide ourselves while our bodies changed. Still human, but now something else. Something more powerful.More intuitive.More pissed off.We’re still here, on this earth, and we’re not leaving. This is our home. Our planet. Drabs take note and learn to be afraid. You’ve had a hundred years here on earth, but now your time here is done. You called us rodents. Insects. Diseased animals. The scraps of humanity—and that, my Drab friend, we certainly are. But what you should have realized is that you can’t kill a Scrap. Humanity isn’t dead. Not by a longshot. We still have our soldiers and we have our conviction.Most of all, we have our hope. And we will win in the end. Whatever it takes. Whatever it costs. We won’t allow you to take our planet from us. So count your days, Drabs. The war is on.",
  "genres": [
    "Young Adult",
    "Paranormal Romance",
    "Romance",
    "Adult"
  ],
  "author": "Sherrilyn Kenyon",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/6742332-omega-rising"
}