{
  "title": "Arcadia Falls",
  "description": "There once was a girl who liked to pretend she was lost. . . . Meg Rosenthal is driving toward the next chapter in her life. Winding along a wooded roadway, her car moves through a dense forest setting not unlike one in the bedtime stories Meg used to read to her daughter, Sally. But the girl riding beside Meg is a teenager now, and has exchanged the land of make-believe for an iPod and some personal space. Too much space, it seems, as the chasm between them has grown since the sudden, unexpected death of Meg’s husband.  Dire financial straits and a desire for a fresh start take Meg and Sally from a comfortable life on Long Island to a tucked-away hamlet in upstate New York: Arcadia Falls, where Meg has accepted a teaching position at a boarding school. The creaky, neglected cottage Meg and Sally are to call home feels like an ill portent of things to come, but Meg is determined to make the best of it and to make a good impression on the school’s dean, the diminutive, elegant Ivy St. Clare.St. Claire, however, is distracted by a shocking crisis: During Arcadia’s First Night bonfire, one of Meg’s folklore students, Isabel Cheney, plunges to her death in a campus gorge. Sheriff Callum Reade finds Isabel’s death suspicious, but then, he is a man with secrets and a dark past himself. Meg is unnerved by Reade’s interest in the girl’s death, and as long-buried secrets emerge, she must face down her own demons and the danger threatening to envelop Sally. As the past clings tight to the present, the shadows, as if in a terrifying fairy tale, grow longer and deadlier. In Arcadia Falls, award-winning author Carol Goodman deftly weaves a mesmerizing narrative of passion: for revenge, for art, for love.",
  "genres": [
    "Mystery",
    "Fiction",
    "Gothic",
    "Suspense",
    "Contemporary",
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "Carol Goodman",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/6740418-arcadia-falls"
}