{
  "title": "Sailing from Byzantium: How a Lost Empire Shaped the World",
  "description": "A gripping intellectual adventure story, Sailing from Byzantium sweeps you from the deserts of Arabia to the dark forests of northern Russia, from the colorful towns of Renaissance Italy to the final moments of a millennial city under siege…. the successor of Greece and Rome, this magnificent empire bridged the ancient and modern worlds for more than a thousand years. Without Byzantium, the works of Homer and Herodotus, Plato and Aristotle, Sophocles and Aeschylus, would never have survived. Yet very few of us have any idea of the enormous debt we owe them.The story of Byzantium is a real-life adventure of electrifying ideas, high drama, colorful characters, and inspiring feats of daring. In Sailing from Byzantium, Colin Wells tells of the missionaries, mystics, philosophers, and artists who against great odds and often at peril of their own lives spread Greek ideas to the Italians, the Arabs, and the Slavs.Their heroic efforts inspired the Renaissance, the golden age of Islamic learning, and Russian Orthodox Christianity, which came complete with a new alphabet, architecture, and one of the world’s greatest artistic traditions.The story’s central reference point is an arcane squabble called the Hesychast controversy that pitted humanist scholars led by the brilliant, acerbic intellectual Barlaam against the powerful monks of Mount Athos led by the stern Gregory Palamas, who denounced “pagan” rationalism in favor of Christian mysticism.Within a few decades, the light of Byzantium would be extinguished forever by the invading Turks, but not before the humanists found a safe haven for Greek literature. The controversy of rationalism versus faith would continue to be argued by some of history’s greatest minds.Fast-paced, compulsively readable, and filled with fascinating insights, Sailing from Byzantium is one of the great historical dramas–the gripping story of how the flame of civilization was saved and passed on.",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Ancient History",
    "Medieval History",
    "Russia",
    "Audiobook"
  ],
  "author": "Colin  Wells",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/675.Sailing_from_Byzantium"
}