{
  "title": "Aunt Phil's Trunk: An Alaska Historian's Collection of Treasured Tales",
  "description": "Alaska history decoded - Now in eBooks!Aunt Phil's Trunk Volume Four is a must read for anyone interested in Alaska's history!Following in the fast-paced and entertaining footsteps of the previous three volumes, Aunt Phil's Trunk Volume Four captures the essence of life in Alaska between 1935 and 1960. Its vivid nonfiction short stories and more-than 350 historical photographs highlight major events of World War II, the Cold War era and Alaska's struggle for statehood. Did you know?•\tThe Japanese bombed and occupied two islands in the Aleutian Chain during WWII?•\tThe U.S. Air Force song was written by an Alaskan?•\tEskimo Scouts guarded more than 2,000 miles of Alaska's coastline for no pay?These and dozens more little-known stories fill the pages of Aunt Phil's Trunk Volume Four and share Alaska's colorful past from 1935 to 1960.I've been touting these books since the first volume appeared three years ago. They combine clear writing and plenty of details without getting bogged down in minutia. They include both the big stories and many lesser-known incidents. And they are densely illustrated with photographs showing what life was like in Alaska's earlier days. It's a great package, and it hasn't failed yet ... If you haven't done so, take some time and open Aunt Phil's Trunk; you'll find plenty of treasures inside. - David James, Fairbanks Daily News MinerOur family has lived more than five generations in Alaska, witnessing and experiencing many of the historic moments Laurel Bill has written about in her comprehensive compilation of stories and events that shaped Alaska today ... The volumes of Aunt Phil's Trunk are a terrific, fast-paced read and should be required for all students of Alaska history. - Gail McIver Phillips, Former Speaker of the Alaska House of RepresentativesThousands of print books sold worldwide!Order your copy of Aunt Phil's Trunk Volume Four now!Read More Here:World War II brought big defense dollars north, which helped bolster Alaska's economy. It also brought:•\tA secret Russian mission to Fairbanks•\tInterment of Aleut people•\tA proliferation of tuberculosisDuring the Cold War era, Alaska saw another increase of money and people into the Last Frontier. This period of its colorful past also generated stories of heroic Alaska Airlines flights for freedom, Alaska Natives' battles against discrimination and the blossoming of Anchorage into a jewel on the tundra. The last section of this action-packed volume features Alaska's 91-year-old struggle for statehood. Tales of tenacity, hope and determination fill these pages, and they also showcase many of the movers and shakers of days gone by, Alaska's first elected governor and the discovery of crude oil that tipped the balance toward statehood.Many more entertaining, nonfiction stories fill the pages of Volume Four. It is a treasure trove of short stories, along with close to 350 rare historical photographs, suitable for ages 9 to 99!",
  "genres": [],
  "author": "Laurel Downing Bill",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/6748279-aunt-phil-s-trunk"
}