{
  "title": "Blues & Chaos: The Music Writing of Robert Palmer",
  "description": "Palmer's extraordinary knowledge and boundless love of music were evident in all his writing. He was an authority on rock & roll, blues, jazz, punk, avant-garde, and world music -- often discovering new artists and trends years (even decades) before they hit the mainstream. Now, noted music writer Anthony DeCurtis has compiled the best pieces from Palmer's oeuvre and presents them here, in one compelling volume.A member of the elite group of the defining rock critics who emerged in the 1960s and 1970s, Palmer possessed a vision so complete that, as DeCurtis writes, \"it's almost as if, if you read Bob, you didn't need to read anyone else.\" Blues & Chaos features some of his most memorable pieces, including gripping stories about John Lennon, Led Zeppelin, Moroccan trance music, Miles Davis, Jerry Lee Lewis, Philip Glass, and Muddy Waters.Wonderfully entertaining, infused with passion, and deeply inspiring, Blues & Chaos is a must for music fans everywhere.Flirtations with chaos / by Anthony DeCurtis --The big picture : \"The opinions expressed are dangerously subjective.\" --The blues : \"A post-Heisenberg-uncertainty-principle mojo hand\" --Jazz : \"A kinetic kaleidoscope\" --The originators : \"Where the hell did this man come from?\" --Soul and R&B : \"It had to come from somewhere, and the church is where it all came from\" --Classic rock : \"Musically, we weren't afraid to go in any direction whatsoever\" --John Lennon and Yoko Ono : \"Now the music's coming through me again\" --Punk rock and beyond : \"Fear and nothing\" --World music : \"The world is changing and so is our music\" --Morocco : \"We fell through each other, weightless, into the sky\" --On the edge : \"Listen, as if a new world had suddenly opened up\" --Sonic guitar maelstrom : \"All hail the overdriven amp.\"",
  "genres": [
    "Music",
    "Essays",
    "Nonfiction",
    "History",
    "Jazz",
    "Anthologies"
  ],
  "author": "Robert Palmer",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/6746915-blues-chaos"
}