{
  "title": "The Red Star of Cadiz",
  "description": "Spain was still under the domination of the Franco dictatorship in 1975, and Japan itself harbored fears of terrorism by the radical left... Freelance public relations expert Urushida Ryo is asked by one of his major clients to help locate a man sought by famous Spanish guitar craftsman Jose Ramos: a Japanese guitarist known as Santos, who had visited Ramos' workshop twenty years earlier. In spite of his outstanding guitar technique, it had proved impossible to find him in Japan's flamenco guitar world. Urushida begins to trace Santos' footsteps from the scarce leads remaining... Author Osaka draws heavily on his own experiences in the advertising industry to portray the intense competition surrounding advertising agencies and their musical instrument manufacturing clients, as well as behind-the-scenes deals with consumer action groups. The story delves into the secrets surrounding the \"Red Star of Cadiz,\" a legendary guitar created by a master craftsman during the Spanish Civil War, and the desires and losses of the people around it. And as Urushida probes deeper he is gradually pulled in a vortex of intrigue involving the Spanish ultra-left and secret police. Multiple story lines intersect, doubling back on one another and weaving a rich tapestry of memories, including Urushida's love for Risayo, at a rival PR firm; the activities of the staff at Urushida's agency; and the search that began as a simple and heartwarming request. The action shifts to Spain and accelerates, drawing the reader into a gripping story all the more real for the stunning visual imagery of Spain, and instilling a newfound love for flamenco guitar. Winner of three prestigious awards: the 96th Naoki Prize, the 40th Mystery Writers of Japan Prize, and the 5th Japan Adventure Fiction Association Prize. The perfect hard-boiled introduction to Japanese crime and suspense fiction",
  "genres": [
    "Japan",
    "Fiction",
    "Spain"
  ],
  "author": "Go Osaka",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/6747414-the-red-star-of-cadiz"
}