{
  "title": "Against Happiness: In Praise of Melancholy",
  "description": "Americans are addicted to happiness. When we're not popping pills, we leaf through scientific studies that take for granted our quest for happiness, or read self-help books by everyone from armchair philosophers and clinical psychologists to the Dalai Lama on how to achieve a trouble-free life: \"Stumbling on Happiness\"; \"Authentic Happiness: Using the New Positive Psychology to Realize Your Potential for Lasting Fulfillment\"; \"The Art of Happiness: A Handbook for Living.\" The titles themselves draw a stark portrait of the war on melancholy. More than any other generation, Americans of today believe in the transformative power of positive thinking. But who says we're \"supposed\" to be happy? Where does it say that in the Bible, or in the Constitution? In \"Against Happiness,\" the scholar Eric G. Wilson argues that melancholia is necessary to any thriving culture, that it is the muse of great literature, painting, music, and innovation--and that it is the force underlying original insights. Francisco Goya, Emily Dickinson, Marcel Proust, and Abraham Lincoln were all confirmed melancholics. So enough Prozac-ing of our brains. Let's embrace our depressive sides as the wellspring of creativity. What most people take for contentment, Wilson argues, is living death, and what the majority takes for depression is a vital force. In \"Against Happiness: In Praise of Melancholy,\" Wilson suggests it would be better to relish the blues that make humans people. Eric G. Wilson is the Thomas H. Pritchard Professor of English at Wake Forest University in Winston-Salem, North Carolina. The recipient of several important awards, including a National Humanities Center year-long fellowship, he is the author of five books on the relationship between literature and psychology. \"Mr. Wilson's basic thesis is that, without suffering, the human soul becomes stagnant and empty . . . We must live between the poles of sadness and joy and not try to expunge misery from our lives. Mr. Wilson makes a strong case . . . to deny our essential sadness in the face of a tragic world is to suppress a large part of what we are as human beings.\"--Colin McGinn, \"The Wall Street Journal\"\"[Wilson has] the passionate soul of a nineteenth-century romantic who, made wise by encounters with his own personal darkness, invites readers to share his reverence for nature and exuberance for life. Providing a powerful literary complement to recent psychological discussions of melancholy . . . this treatment is variously gloomy and ecstatic, infuriating and even inspiring.\"--\"Booklist\"\"An impassioned, compelling, dare I say poetic, argument on behalf of those who 'labor in the fields of sadness'. . . a loose and compelling argument for fully embracing one's existence, for it is a miracle itself -- a call to live hard and full, to participate in the great rondure of life and to be aware of the fact that no one perspective on the world is ever finally true.\"--\"Minneapolis Star Tribune\"\"[A] lively, reasoned call for the preservation of melancholy in the face of all-too-rampant cheerfulness . . . pithy and epigrammatic.\"--Bookforum\"Wilson's argument is important, and he makes it with passion.\"--\"Raleigh News and Observer",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Psychology",
    "Self Help",
    "Essays",
    "Science",
    "Mental Health"
  ],
  "author": "Eric G. Wilson",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/1298834.Against_Happiness"
}