{
  "title": "Isham G. Harris of Tennessee: Confederate Governor and United States Senator",
  "description": "In 1931, when the Nashville Banner conducted a survey to determine the \"Greatest Tennesseans\" to date, the state's Confederate \"War Governor,\" Isham G. Harris (1818--1897), ranked tenth on the list, behind such famous Tennesseans as Andrew Jackson, James K. Polk, Andrew Johnson, and Nathan Bedford Forrest. In 1976, however, when the Banner once again conducted the survey, Harris did not appear in even the top twenty-five. The result of fading memories and the death of the generation that knew him, the glaring omission of Harris's name still seemed striking and undeserved. In Isham G. Harris of Tennessee, Sam Davis Elliott offers the first published biography of this overlooked leader, establishing him as the most prominent Tennessean in the Confederacy and a dominating participant in nineteenth-century Tennessee politics.Harris grew up on the frontier in Middle Tennessee, the youngest in a large family. He left home as a teenager, and found and lost a fortune in the boom and bust times of the 1830s in Mississippi and West Tennessee. Admitted to the bar in 1841, he enjoyed almost immediate success as an attorney due to his quick intellect, aggressive nature, and native ability to influence people. He launched a political career in 1847 that lasted, with some interruption, for fifty years, during which he never lost an election. Harris rose to prominence in the 1850s as the leader of the Southern rights wing of the Democratic Party, fiercely advocating the right to hold property in slaves. He served in the Tennessee state Senate, as a U.S. congressman, and as governor during the secession crisis, when, Elliott contends, Harris used his political influence and constitutional power to trample on the state constitution to align Tennessee with the Confederacy.As governor, Harris tirelessly dedicated himself to the Confederate war effort, raising troops and money and establishing a logistical structure and armament industry. When the Federals overran large portions of Middle and West Tennessee in 1862, he attached himself to the headquarters of the Confederate Army of Tennessee. As a volunteer aide, he served each of the army's commanders on nearly every one of its famed battlefields and was deemed a possible successor to Jefferson Davis should the new republic survive.After the war, Harris went into voluntary exile in Mexico. He returned home in late 1867 and worked behind the scenes to \"redeem\" Tennessee from Radical rule, eventually becoming the most famous of the state's Bourbon Democrats. Elected to the U.S. Senate in 1877, he held that seat until his death in 1897. He successfully used the Senate's arcane parliamentary rules to block assertions of Federal power at the expense of states' rights, but advocated imaginative application of Federal power where clearly authorized by the Constitution.The story of nineteenth-century Tennessee remains incomplete without a thorough understanding of Isham Green Harris. Elliott's exhaustive and entertaining biography provides essential reading for anyone interested in the political and military history of the Volunteer State.",
  "genres": [],
  "author": "Sam Davis Elliott",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6749276-isham-g-harris-of-tennessee"
}