{
  "title": "American Food Writing: An Anthology with Classic Recipes: A Library of America Special Publication",
  "description": "In this groundbreaking anthology, celebrated food writer Molly O’Neill gathers the very best from over 250 years of American culinary history. This literary feast includes classic accounts of iconic American Henry David Thoreau on the delights of watermelon; Herman Melville, with a mouth-watering chapter on clam chowder; H. L. Mencken on the hot dog; M. F. K. Fisher in praise of the oyster; Ralph Ellison on the irresistible appeal of baked yam; William Styron on Southern fried chicken. American writers abroad, like A. J. Liebling, Waverly Root, and Craig Claiborne, describe the revelations they found in foreign restaurants; travellers to America, including the legendary French gourmet J. A. Brillat-Savarin, discover such native delicacies as turkey, Virginia barbecue, and pumpkin pie. Great chefs and noted critics discuss their culinary philosophies and offer advice on the finer points of technique; home cooks recount disasters and triumphs. A host of eminent American writers, from Nathaniel Hawthorne, Harriet Beecher Stowe, and Walt Whitman to Thomas Wolfe, Willa Cather, and Langston Hughes, add their distinctive viewpoints to the mix.American Food Writing  celebrates the astonishing variety of American foodways, with accounts from almost every corner of the country and a host of ethnic Dutch, Cuban, French, Italian, Jewish, Chinese, Irish, Indian, Scandinavian, Native American, African, English, Japanese, and Mexican. A surprising range of subjects and perspectives emerge, as writers address such topics as fast food, hunger, dieting, and the relationship between food and sex. James Villas offers a behind-the-scenes look at gourmet dining through a waiter’s eyes; Anthony Bourdain recalls his days at the Culinary Institute of America; Julia Child remembers the humble beginnings of her much-loved television series; Nora Ephron chronicles internecine warfare among members of the “food establishment”; Michael Pollan explores what the label “organic” really means.Throughout the anthology are more than fifty classic recipes, selected after extensive research from cookbooks both vintage and modern, and certain to instruct, delight, and inspire home chefs.",
  "genres": [
    "Food",
    "Nonfiction",
    "Cookbooks",
    "Food Writing",
    "Essays",
    "Anthologies",
    "History"
  ],
  "author": "Molly   O'Neill",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/675055.American_Food_Writing"
}