{
  "title": "The Third Wave: Democratization in the Late Twentieth Century",
  "description": "Between 1974 and 1990 more than thirty countries in southern Europe, Latin America, East Asia, and Eastern Europe shifted from authoritarian to democratic systems of government. This global democratic revolution is probably the most important political trend in the late twentieth century. In The Third Wave, Samuel P. Huntington analyzes the causes and nature of these democratic transitions, evaluates the prospects for stability of the new democracies, and explores the possibility of more countries becoming democratic. The recent transitions, he argues, are the third major wave of democratization in the modem world. Each of the two previous waves was followed by a reverse wave in which some countries shifted back to authoritarian government. Using concrete examples, empirical evidence, and insightful analysis, Huntington provides neither a theory nor a history of the third wave, but an explanation of why and how it occurred. Factors responsible for the democratic trend include the legitimacy dilemmas of authoritarian regimes; economic and social development; the changed role of the Catholic Church; the impact of the United States, the European Community, and the Soviet Union; and the \"snowballing\" change in one country stimulating change in others. Five key elite groups within and outside the nondemocratic regime played roles in shaping the various ways democratization occurred. Compromise was key to all democratizations, and elections and nonviolent tactics also were central. New democracies must deal with the \"torturer problem\" and the \"praetorian problem\" and attempt to develop democratic values and processes. Disillusionment with democracy, Huntington argues, is necessary to consolidating democracy. He concludes the book with an analysis of the political, economic, and cultural factors that will decide whether or not the third wave continues. Several \"Guidelines for Democratizers\" offer specific, practical suggestions for initiating and carrying out reform. Huntington's emphasis on practical application makes this book a valuable tool for anyone engaged in the democratization process. At this volatile time in history, Huntington's assessment of the processes of democratization is indispensable to understanding the future of democracy in the world.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Political Science",
    "History",
    "Sociology",
    "International Relations",
    "Academic"
  ],
  "author": "Samuel P. Huntington",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/67471.The_Third_Wave"
}