{
  "title": "El código da Vinci : edición especial ilustrada",
  "description": "Edición de lujo del mayor bestseller de los últimos tiempos, con más de 160 imágenes a todo color.Más de 160 imágenes son las que aportan a esta edición, una nueva forma de comprender la absorbente trama de la novela.Instantáneamente catapultado a los primeros puestos de las listas mundiales de bestsellers, El Código Da Vinci, es un thriller trepidante e inteligente, que aúna el gusto por el detalle erudito con la más amena de las lecturas, factores que han convertido a esta novela en el fenómeno literario de este inicio de siglo.Desde las primeras páginas de esta cautivadora novela, el autor nos sumerge en un apasionante juego de claves escondidas en la Mona Lisa y La última cena, y en hitos arquitectónicos como el Louvre, la abadía de Westminster y la Capilla de Rosslyn que conducen al lector hasta el secreto más celosamente guardado de todos los tiempos. Según palabras de el mismo Dan Brown, \"Cuando me propusieron la idea de crear una edición ilustrada de El Código Da Vinci me sentí intrigado. Una de las preguntas más frecuentes que me plantean los lectores es qué pueden hacer para ver todas las obras de arte y arquitectónicas, así como los lugares y símbolos descritos en la novela. Se me ocurre que esta edición ilustrada brinda la respuesta perfecta.Para mí, el proceso de reunir información sobre el rico contexto histórico y las imágenes relacionadas con la obra fue un maravilloso viaje de descubrimiento. Y ahora me resulta emocionante ver estas ilustraciones intercaladas entre el texto de El Código Da Vinci. Espero que las imágenes arrojen nueva luz, continúen suscitando preguntas y, sobre todo, sirvan como una entretenida guía visual de la novela.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "Historical Fiction",
    "Suspense",
    "Adventure"
  ],
  "author": "Dan    Brown",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/67555.El_c_digo_da_Vinci_"
}