{
  "title": "Just a Guy: Notes from a Blue Collar Life",
  "description": "What does it mean to be JUST A GUY?--A guy doesn't think before he speaks.--Eating and sleeping always come first. Always.--A guy may get married, but he doesn't have to like it.--It's tough to admit, but all guys are exactly the same.Blue Collar Comedy Star Bill Engvall is JUST A GUY. He's been one his whole life. He can't help it. He was born that way. And that makes him an expert on the subject.For the record, here's the official definition of a A person who doesn't think before he speaks. He can't. He's not that deep. Because a guy has only three basic eating, sleeping, and sex. That's it. JUST A GUY chronicles a lifetime in pursuit of those needs.In this hilarious and heartfelt memoir, Bill Engvall takes you on the rollicking ride of his life, beginning with his childhood in Texas and adolescence in Arizona, becoming a fixture in local emergency rooms, the result of massive amounts of non-thinking behavior trying to impress girls or torture his sisters; to high school in Dallas where he dabbled in an array of truly odd jobs, learned the trombone, and came of age, all strangely connected; to college and his tenure as his fraternity's social chairman, where he masterminded a series of legendary parties and attempted to rescue his pet bird while the house was burning down (not his fault, honest); to following his dream as a standup comic and, gulp, singer; to his brief stint in children's theater while sharing the stage and the back of a van with the director's dog, and as a movie extra with forked tongue and cloth claws; to his bumbling and riotous courtship, then marriage to Gail, the love of his life; and, finally, fatherhood, where he remains, to this day, a well-meaning, but flawed parent.Through it all, Bill gamely stumbles along, struggling to maintain a façade of confidence and control. Far from a superhero, Bill Engvall is an everyday Everyman, the poster boy for normal. The result is JUST A GUY who is disarming, perceptive, wildly funny, and unexpectedly moving.JUST A GUY will make you laugh out loud and tug at your heart.Hopefully, not at the same time.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Memoir",
    "Comedy",
    "Autobiography"
  ],
  "author": "Bill Engvall",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/675765.Just_a_Guy"
}