{
  "title": "Musashi, Volume II",
  "description": "Musashi, o grande romance épico japonês do século XX, com mais de 120 milhões de exemplares vendidos em suas diversas edições, além de inúmeras versões para cinema e televisão é a história de Miyamoto Musashi, na vida real o grande samurai do Japão da época dos xoguns. No Brasil, figura há 3 meses nas listas de livros mais vendidos de várias livrarias e publicações, já tendo atingido a marca de mais de 10.000 livros vendidos.Neste segundo volume, após o violento e histórico duelo de Ichioji, Musashi procura abrigo num templo do monte Hiei para recuperar-se física e mentalmente de seus ferimentos. Depois, segue seu caminho de samurai peregrino na rota do aperfeiçoamento filosófico e guerreiro, e também se envolve em duelo particular com a natureza, ao tentar dominá-la, o que não consegue apesar de todo o seu empenho.O jovem guerreiro incorporando força e agilidade ímpares torna-se também mais humano: desenvolve profunda amizade com um habilíssimo manejador do bastão que por muito pouco não o derrota, além de procurar formar um discípulo à sua imagem na pessoa de um garoto que passa a acompanhá-lo por longo trecho de sua missão. Para não falar da bela jovem que conquistou seu coração, amor que revela o lado sensível e frágil de Musashi, e que na verdade não logra dominar e fazer frutificar.As imagens de Edo, a futura Tóquio, em frenético desenvolvimento, cujo palpitante submundo deixa antever a metrópole que mais tarde virá a ser, constituem a incursão urbana desta obra predominantemente bucólica e com forte presença de um feudalismo em sofrida modernização.Toda a trama, no entanto, com suas múltiplas reviravoltas, está inscrita na lógica do esperado e inevitável duelo da ilha de Funashima com Sasaki Kojiro, o outro grande espadachim da época e rival de Musashi em habilidade, tenacidade e sabedoria guerreira. Para o eventual vencedor, não será apenas necessária a melhor técnica, mas também a maior nobreza de espírito.Eiji Yoshikawa dividiu sua obra em sete livros: A Terra, A Água, O Fogo, O Vento, O Céu, As Duas Forças e A Harmonia Final. Destes, os cinco primeiros são uma referência ao gorin, os cinco elementos básicos de que se compõe, segundo o Budismo, toda e qualquer matéria, ou ainda os ciclos por que passa o espírito humano para alcançar a perfeição, começando pela terra impura até atingir o estágio mais alto, o céu, ou segundo a concepção budista, a paz do nada, o nirvana.Tradução: Leiko Gotoda",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Japan",
    "Japanese Literature",
    "Historical",
    "Literature",
    "Fantasy"
  ],
  "author": "Eiji Yoshikawa",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/6757443-musashi-volume-ii"
}