{
  "title": "The Holocaust in Lithuania 1941-1945: A Book of Remembrance",
  "description": "In the brutality, misery and evil perpetrated by the Nazi regime during World War II, millions of Jews, wiped out from the face of the earth, were also denied a proper memorial, even to their names. In the more than half century since the end of the war, significant and vital progress has been made, by various institutions and historians, in recording the names of those who perished.The Holocaust in Lithuania is comprised of four volumes. The first is a detailed history of the Holocaust in Lithuania, providing a historical context in which to consider the final three volumes, which feature the lists of those who were interned in ghettos, and those who perished during the terrible years of 1941-1945. This comprehensive history also include important information, such as a list of Yahrzeit (Memorial)dates of Lithuanian Jewish communities, and detailed reference lists of films, books and articles on the Lithuanian Holocaust. The authors of this text have had the soul-destroying task of confronting the overwhelming power of the mass destruction of human life, knowing that even when this job is done, the work will never be completed.This extensive and important work is primarily a book about memory, and its aim is to record and document the names of Lithuanian Jews who perished in the Holocaust. The comprehensive record is a result of years of research and collation, using articles in journals and the daily press, mailings to survivors, and on-line submissions to the project website.The Holocaust in Lithuania: 1941-1945 A Book of Remembrance exceeds its aims. It not only serves as a memorial to Lithuanian Jewry, but at last provides a memorial to the names of the men, women and children who have their place in Jewish memory, and now too, have an eternal, physical remembrance.",
  "genres": [
    "Holocaust"
  ],
  "author": "Rose Lerer-Cohen",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/6756980-the-holocaust-in-lithuania-1941-1945"
}