{
  "title": "The Trials of Maria Barbella",
  "description": "This “gripping social history” (Publishers Weekly), with all the passion and pathos of a classic opera, chronicles the riveting first campaign against the death penalty waged in 1895 by American pioneer activist, Cora Slocomb, Countess of Brazzà, to save the life of a twenty-year-old illiterate Italian immigrant, Maria Barbella, who killed the man who had abused her. Previously published as The Trials of Maria Barbella. In 1895, a twenty-two-year-old Italian seamstress named Maria Barbella was accused of murdering her lover, Domenico Cataldo, after he seduced her and broke his promise to marry her. Following a sensational trial filled with inept lawyers, dishonest reporters and editors, and a crooked judge repaying political favors, the illiterate immigrant became the first woman sentenced to the newly invented electric chair at Sing Sing, where she is also the first female prisoner. Behind the scenes, a corporate war raged for the monopoly of electricity pitting two giants, Edison and Westinghouse with Nikola Tesla at his side, against each other. Enter Cora Slocomb, an American-born Italian aristocrat and activist, who launched the first campaign against the death penalty to save Maria. Rallying the New York press, Cora reached out across the social divide—from the mansions of Fifth Avenue to the tenements of Little Italy. Maria’s “crime of honor” quickly becomes a cause celebre, seizing the nation’s attention. Idanna Pucci, Cora’s great-granddaughter, masterfully recounts this astonishing story by drawing on original research and documents from the US and Italy. This dramatic page-turner, interwoven with twists and unexpected turns, grapples with the tragedy of immigration, capital punishment, ethnic prejudice, criminal justice, corporate greed, violence against women, and a woman’s right to reject the role of victim. Over a century later, this story is as urgent as ever.",
  "genres": [
    "True Crime",
    "History",
    "Nonfiction",
    "Crime",
    "Biography",
    "American History",
    "Italy"
  ],
  "author": "Idanna Pucci",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/675553.The_Trials_of_Maria_Barbella"
}