{
  "title": "Listen, You Pencil Neck Geeks",
  "description": "Classy Freddie Blassie was universally acknowledged as one of the most hated heels in wrestling history. Freddie really knew how to antagonize the fans -- how to \"get heat.\" Death threats were frequent, enraged fans stabbed him twenty-one times, and he was even doused with acid. Undeterred, Blassie just took the action up a level. He reveled in being the heel. It was commonplace to see him biting his opponents and then spitting out their blood. Blassie would routinely \"file\" his teeth during interviews. His matches in Los Angeles' Olympic Stadium brought him to the attention of Hollywood. Freddie's style and unpredictability made him a natural for the medium, and he became one of the biggest draws in the wrestling business. In the early '60s, he was invited to wrestle in Japan. Blassie both horrified and mesmerized sedate Japanese society.At seventeen, Freddie made his wrestling debut in a carnival. Unhappy with his choice of occupation, his family persuaded him to get a \"real\" job, and for a while he worked as a meatcutter. But after serving in the Navy in World War II, Freddie returned to wrestling. Here he picked up his catch \"pencil neck geek.\"Early in his career, Blassie wrestled for Jess McMahon, and would later work for both his son, Vincent James McMahon, and his grandson, Vincent Kennedy McMahon, the current owner of World Wrestling Entertainment. ™ When his days in the ring ended, \"Classy\" Freddie Blassie became the manager of heels, transferring to a whole new generation of wrestlers the style, moves, and ring knowledge that had made him a legend of wrestling.Released just prior to his death, Legends of \"Classy\" Freddie Blassie contains vibrant tales of his days in wrestling with the likes of Hulk Hogan, Killer Kowalski, and the Iron Sheik. He frankly chronicles his dealings with the wrestling fraternity and the promoters, even recounting the infamous \"boxer vs. wrestler\" match with Muhammad Ali, who was managed by Blassie.His out-of-the-ring stories are equally compelling. Freddie details his countless sexual exploits, and his three marriages. He reflects on the cult status that he gained after his song \"Pencil Neck Geek\" rocketed to the top of the Dr. Demento Show play list. He recounts his touching relationship with comedian Andy Kaufman, who cast him in Breakfast with Blassie -- an underground classic in which Blassie \"What the hell ever happened to the human race?\"Added to this edition is an epilogue, recounting Freddie's last days and his unforgettable funeral.",
  "genres": [
    "Biography",
    "Sports",
    "Nonfiction",
    "Autobiography",
    "History",
    "Memoir"
  ],
  "author": "Keith Elliot Greenberg",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/675964.Listen_You_Pencil_Neck_Geeks"
}