{
  "title": "Ric Flair: To Be the Man",
  "description": "\"Woooooo! ™\"With that triumphant cry, \"Nature Boy\" Ric Flair surpassed his predecessors and his peers to become one of the greatest professional wrestlers in history.To wrestling fans, the Nature Boy is a platinum-blond deity. A sixteen-time World Champion, \"Slick Ric\" could convince television viewers that a momentous life experience would pass them by if they missed an upcoming match. His opponents were challenged with this simple \"To be the man, you have to beat the man.\"From the moment he was born, Richard Morgan Fliehr was enmeshed in controversy. Like many of the other children adopted through the Tennessee Children's Home Society, he had apparently been stolen from his birth parents. Raised just outside Minneapolis, Ric was a distracted student, a brilliant athlete, and a wild party boy. Then, a chance meeting with Olympic weightlifter Ken Patera, directed Flair to the world of professional wrestling.In 1974, Flair relocated to Charlotte, North Carolina, igniting the Mid-Atlantic Wrestling promotion. He was almost forced to retire a year later when his back was broken in a plane crash. Flair recuperated, and in 1981 he would win his first National Wrestling Alliance championship. As the most traveled champion ever, he once wrestled eighteen hour-long cards during a fourteen-day stretch.Before purchasing World Championship Wrestling in 1988, Ted Turner was given assurance that the Nature Boy would come with the package. But Flair's clashes with WCW management would drive him to World Wrestling Entertainment. When he later returned to WCW, Flair collided in and out of the ring with Hulk Hogan and -- as the company disintegrated -- began losing his self-esteem.Arriving back at WWE in 2001, Flair was a broken man. What he didn't realize was that wrestlers who'd grown up idolizing him now inhabited the locker room. With their support, he was finally able to claim his legacy and receive the credit he so richly deserved.To Be the Man traces the rise of one of wrestling's most enduring superstars to the pinnacle of the sports entertainment universe, and is a must-read for every wrestling fan.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Sports",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "History"
  ],
  "author": "Ric Flair",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/675937.Ric_Flair"
}