{
  "title": "Facts and Fascism",
  "description": "\"This book names the most powerful forces in Europe which organized the Fascist and Nazi parties and movement, the powerful American forces which own, control and subsidize native Fascism, and the spokesmen, radio orators, writers and other agents of reaction in America.\" Facts and Fascism is the definitive account and source book on Fascism in the United States after the First World War and on into the Second. No doubt every subsequent work on this explosive topic owes a great debt to this original research. By crusading investigative journalist George Seldes, the book is in three parts: 1) The Big Money and Big Profits in Fascism, 2) Native Fascist Forces, and 3) Our Press as a Fascist Force. The first part reveals the backing of U.S. and British big business behind the rise of Fascism and militarism, with chapters on Germany, Italy, Japan, and Spain, the Nazi cartels and the National Association of Manufacturers. The author was a reporter in Italy in the early 20's as Fascism got its start, and wrote a full-length, critical portrait of Mussolini. In \"Native Fascist Forces,\" Seldes first tells the story of the botched putsch by J. P. Morgan and the American Legion against FDR in 1934 - surely one of the most hushed-up episodes in US history. Next Seldes dissects the Ford empire's support for Nazism and its repressive, even murderous labor practices, and Nazi apologists like Lindbergh, Father Coughlin and the Reader's Digest. The third part explores and deplores acts of treason by war-profiteering heavy industry and by the major newspaper chains. He exposes their habit of faking news for their political agenda, going back to the 1850's in support of black slavery, and white servitude - that is, with attacks on labor and social justice. The last chapter discusses profiteering from a different form of slavery, the tobacco addiction. Among the appendices is one on the definition of Fascism, and data on Who Owns America - thirteen plutocratic families.",
  "genres": [
    "History",
    "Politics"
  ],
  "author": "George Seldes",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/6763929-facts-and-fascism"
}