{
  "title": "River of Tears",
  "description": "A woman's struggle as she searches for her missing husband leads to shocking revelations about him, his family, and the crime of adult kidnapping.Abby meets Caiden when she is sixteen years old and knows she has met her soul mate. At nineteen Abby marries the love of her life and together they begin a family of their own. Life gives them a gift, but this gift is short lived. After seven years of marriage it ends.>Abby is left alone with her two children and the bloody clothes that Caiden was last seen in. With the horrifying revelations from her mother in law Abby sets out to prove her husband is indeed alive and that he's been taken against his will by his mother, brothers, and sisters in a sick and twisted game of keep-away.Knowing her husband isn't dead, Abby, with the help and support of her family, begins a search that takes her from Arizona to Arkansas and lasts for a span of eight years.On a visit to Caiden's birthplace, Abby and her brother Chase meet with Caiden's best friend who fills them in with the secrets of her husband's childhood and of the hell he endured. He tells them of the nightmares, the deceit, and the abuse Caiden suffered at the hands of his family.More determined than ever to locate her husband, before his family kills him, Abby hires a private investigator who opens the doors to Caiden's private world of hell and exposes his family for what they are, but will he be on time? Will Abby be on time to save her soul mate? Can she make him want to fight one last time?River of Tears is a tale of personal triumph over heartbreak, of unconditional love and bravery. It is a compelling modern-day story depicting how the power of love can overcome even the darkest facets of human nature. The story demonstrates how self-determination and loyalty can lead to unimaginable accomplishment, regardless of seemingly insurmountable obstacles. It is a story of faith in the face of tremendous loss, where fear and discouragement threaten to steal the last glimmer of hope. Will this shred of hope be enough to sustain, or will it ultimately crush Abby's dreams of lasting happiness?River of Tears will take you on a journey you will never forget, it will make you want to gather all you love close and keep them there, because we never know what's around the next corner of our lives.",
  "genres": [
    "Romance",
    "M F Romance",
    "Suspense",
    "Mystery"
  ],
  "author": "Michele L. Montgomery",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/6759294-river-of-tears"
}