{
  "title": "Four of Hearts",
  "description": "Marriage hasn't tamed Candace Callahan's sexual curiosity, something her husband Ryan is grateful for, but when she asks him to tie her up for her anniversary present, he knows he's going to need the help of their friends, Richard Wolfe and his wife, Fallon.Dr. Fallon Enright is the resident sex therapist aboard the Lothario - the cruise ship co-owned by her husband and Ryan Callahan. When Ryan asks to participate in one of their couple's rope bondage classes, Richard isn't sure it's a good idea, but Fallon assures him all will be well.What begins as innocent curiosity, blossoms into a polyamorous relationship none of them could have expected, but they are powerless to ignore. When the tabloids expose their new lifestyle, the foursome must choose between the love they feel for each other, or accepting society's moral constraints.FOUR OF HEARTS BY Roz LeeEXCERPTRyan froze with his lips against the pulse in Candace's neck. His erection surged with new vigor against her stomach. Why couldn't his wife ask for something easy for their anniversary? Something like diamonds, a villa in France, hell, even an expedition to the North Pole. The image in his brain coalesced, and he knew he would give her whatever she wanted. \"You want me to tie you up?\" he asked as soon as he found his voice. \"Don't even try to tell me it doesn't excite you.\" Candace wiggled her soft mound against his cock. \"I felt that.\" He had no intention of denying his interest. Only a fool would, and Ryan Callahan was no fool. He continued his exploration of his wife's creamy soft skin, all the while forming and reforming the new image in his head. His lips left her neck, slipped to her shoulder where he tasted every inch of skin, before angling lower toward the perfect swell of her breasts. His hands held hers pinned flat on either side of her head. He'd tied her hands once, when he'd spirited her away from the Lothario and onto the Vixen, but that had been role-playing more than anything else. He was pretty sure she had something more in mind. He hoped to God she did. Her request shouldn't have been a surprise. She'd spent a lot of time lately talking to his best friend's wife. Rope bondage was Fallon's new research topic, and a passion shared with her husband Richard. Ryan inched his way lower, and teased one nipple to a marble hard peak with his tongue, before taking it in his mouth. Candace drew in a sharp breath and arched her back, encouraging him to suck harder. He obliged his wife. His wife. The moniker still sent a thrill through his body every time he thought, or said the word. Candace Callahan. His wife. God, what a wondrous thing that was. For nearly a year, she'd been his constant companion, his ...",
  "genres": [
    "Menage",
    "BDSM",
    "Contemporary Romance"
  ],
  "author": "Roz Lee",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/12989251-four-of-hearts"
}