{
  "title": "Heartbreak & Triumph: The Shawn Michaels Story",
  "description": "Winning and losing. Heels and babyfaces. Kliqs and Curtain Calls. Tearing down house shows and tearing up hotel rooms. Ladders and cages. Vacated titles and unwarranted suspensions. Works and screwjobs. Heartaches and backbreaks. Forced retirements and redemption. Rock 'n' roll and Graceland. There are two sides to every story; for Shawn Michaels, there is \"Heartbreak & Triumph.\"World Wrestling Entertainment fans think they know \"The Heartbreak Kid.\" He's \"The Showstopper\" who pushes his high-flying abilities to the limit in the squared circle, on ladders, and in steel cages. He's the company's first \"Grand Slam\" champion. And of course, he's forever the guy who conspired with WWE Chairman Vince McMahon to screw Bret \"Hitman\" Hart out of the WWE Championship in Montreal at \"Survivor Series\" on November 9, 1997.But that's the side \"HBK\" has allowed you to see...until now. \"Heartbreak & Triumph: The Shawn Michaels Story\" introduces us to Michael Shawn Hickenbottom (\"Everyone called me Shawn\"), the youngest of four children whose \"really conservative upbringing\" made him shy and \"afraid that people wouldn't like me if I showed who I really was.\" But upon discovering Southwest Championship Wrestling (SWCW) on TV one Saturday night, the preteen Hickenbottom realized instantly what he wanted to become, and years later would convince his father -- a colonel in the U.S. Air Force -- to let him drop out of college and pursue his dream.From there, Hickenbottom fully recounts the events that led to \"Shawn Michaels's\" tutelage under Mexican wrestler Jose Lothario; working matches at Mid-South Wrestling under the guidance of Terry Taylor and the Rock 'n' Roll Express's Robert Gibson & RickyMorton; flying high with Marty Jannetty as \"The Midnight Rockers\" in the American Wrestling Association (AWA); and how a barroom confrontation in Buffalo almost prevented the tandem from ever joining the World Wrestling Federation. \"The Rockers\" would drop the \"Midnight\" and climb to the top of a tough World Wrestling Federation tag-team division in the late 1980s, though Michaels confesses how a \"fear of abandonment\" stagnated his desire to participate in singles competition, pressured him into a marriage he wasn't ready for, and drove him to drinking heavily and downing pills \"just to get through the day.\"With the impact of some \"Sweet Chin Music\" (Michaels's Superkick finisher), \"Heartbreak & Triumph\" expresses the \"sour note\" that dissolved Michaels's partnership with Jannetty and started his transformation into \"The Heartbreak Kid.\" You'll learn firsthand of the \"unfair\" allegation that brought about HBK's classic Ladder match with Razor Ramon at \"WrestleMania X\" (\"I lost the match, but I made my career\"); the incident in Syracuse that set the stage for Shawn's unbelievable \"comeback\" victories at \"Royal Rumble 1996,\" and in the Iron Man WWE Championship match with Bret Hart at \"WrestleMania XII\"; and how his escalating backstage feud with Hart inadvertently built toward the formation of \"D-Generation X,\" as well as the first-ever \"Hell in a Cell\" contest against The Undertaker at \"Badd Blood\" in October 1997.Beyond the squared circle, Michaels clears the air about his days running with \"The Kliq\" -- Kevin Nash (\"Diesel\"), Scott Hall (\"Razor Ramon\"), Paul Levesque (\"Triple H\"), and Sean Waltman (\"The 1-2-3 Kid\") -- their contributions to WWE's wildly successful \"Attitude\"era, and the consequences of their uncharacteristic Madison Square Garden \"Curtain Call\" in May 1996. And for the first time anywhere, Michaels shoots completely straight about his role in \"the biggest scandal in wrestling history,\" the infamous \"Montreal Screwjob\" at \"Survivor Series 1997.\"While reliving the crippling back injury that forced him to retire in his prime following his WWE Championship loss at \"WrestleMania XIV,\" Michaels credits the new loves in his life -- his second wife Rebecca, his children, and his newfound faith -- with giving him the strength to kick his habit, recover physically, and make a jubilant return to the ring at \"SummerSlam 2002\" (in a Street Fight against best friend Triple H, no less). Now back on top and doing what he enjoys most, the WWE Superstar regards \"Heartbreak & Triumph\" as the perfect means \"to review my life, and attempt to figure out how I became the person I am.\"",
  "genres": [
    "Biography",
    "Nonfiction",
    "Sports",
    "Autobiography",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Shawn Michaels",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/675946.Heartbreak_Triumph"
}