{
  "title": "Death Casts a Long Shadow",
  "description": "The victims were predictable – the murderer was not…Classic crime from one of the greats of the Detection ClubIt all starts with a personal ad in a newspaper. A middle-aged man is looking for a spouse, and a little too much emphasis is placed on her being without a family. The experienced lawyer and detective Arthur Crook can immediately work out that the man has no real intentions towards his future wife, but does he have it right?Would you marry the man you loved if he were suspected of shooting his first wife? That was Helen Wayland's problem. Blanch French had died of a gunshot wound, and a jury could not decide if it was accident, suicide or murder. Sour, selfish and worth several millions, Mrs. French was just the kind of woman you’d expect to be murdered. And so, in due course, she was. Young, beautiful, capable nurse Helen Wayland hears from a friend that people are saying unkind things about her behind her back. She made her choice, but two years later a second woman died in mysterious circumstances, and once again Paul French's name was involved. Paul's housekeeper, Mrs. Hoggett was the next to die – another murder predicted by all who, unfortunately, knew her well. Since there was no shortage of suspects, it was small wonder the killer eluded the law. And then a lovely young woman came forth with a story of bigamy and blackmail so bizarre it had to be true. All that was needed for proof was yet another corpse…It was thanks to Arthur Crook, that intrepid legal champion of lost causes, that the astonishing truth about both deaths was finally established and the innocent vindicated. Arthur Crook, a charming, unorthodox and brawny British lawyer and detective, cares a lot about his clients and less about formalities. He is the main character in the majority of Anthony Gilbert's crime novels, where he creatively solves murder mysteries and intrigues in 1900s England.The exceptional standards of entertainment and integrity for which Anthony Gilbert is famous are fully maintained when Death Takes a Wife.",
  "genres": [
    "Mystery",
    "Crime"
  ],
  "author": "Anthony Gilbert",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/6758481-death-casts-a-long-shadow"
}