{
  "title": "Imagine: A Vagabond Story",
  "description": "When Grant Lingel left Western New York in January of 2006, he had a bag of clothes, a few hundred dollars and a one-way ticket to Mexico. Like many at age twenty-two, Grant had no idea what to expect after school in the so-called ‘real world’. All he knew was that he needed to break free and do something extraordinary. The year that followed turned out to be an inspiring and eye-opening adventure through Mexico, Belize and Guatemala.When Grant moved to Mexico, he had no idea what was in store for him. However, the excitement of possibly finding a less trampled trail fueled his desire and the drive to make something happen. The beauty of such an endeavor is that no matter the result, overcoming the fear to step outside your comfort zone can lay out paths that never seemed possible to walk down. Comfort zones are abstract, created specifically to limit the actions of the individual. Overcoming the fear that lurks on its outer thresholds transforms dream worlds into reality. All it takes is an initial lunge in the right direction and the rest, given the right attitude, will snowball into place.Grant was able to parlay a few hundred dollars and a one-way plane ticket into a year of travel and jungle trekking, caving, cliff jumping, scuba diving, volcano climbing and more in the Latin world. Initially, the lure of cheap drugs and easy sex led Grant to a play-all-day, party-all-night lifestyle, mixing the business of working at a resort with the pleasures of being on the beach with rich guests and adventurous friends. So when the opportunity to join a group of strangers in a van headed south presented itself Grant knew he had to take it. He spent two weeks across three countries with six new companions before staying behind in southwestern Guatemala to volunteer in a hostel. It was there, working as a server in a small corner of Central America, that Grant encountered a global subculture of backpackers from different countries, speaking different languages yet sharing two defining features: a backpack and an open mind.Every day was exciting and fresh as he listened to countless stories from places that never existed in his world before the road. It was this long journey through Mexico, Belize and Guatemala that taught him it’s the people along the way who shape who you are and who you become. It is they who taught Grant about the world and more importantly, about himself.",
  "genres": [
    "Travel"
  ],
  "author": "Grant Lingel",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/6758452-imagine"
}