{
  "title": "Triple H Making the Game: Triple H's Approach to a Better Body",
  "description": "Love him or hate him, Triple H does what he wants, when he wants to do it. And now, for the first time anywhere, he tells you how he does it -- and how you can, too.Making The Game -- Triple H's Approach to a Better Body is Triple H's verbal and visual blueprint for building your body. He discusses how \"a Jones for bodybuilding and a love for wrestling\" morphed a skinny, 135-pound fourteen-year-old into one of the biggest Superstars in World Wrestling Entertainment. But be warned -- the \"Cerebral Assassin\" has two words for anyone who's not serious about the craft: \"Complacency sucks!\" He's spent the past twenty years living by the philosophy that training results in improved strength and conditioning, self-discipline, and an ability to focus on setting goals. This book isn't for pantywaists who'd rather exercise their egos.Triple H had help along the way. He didn't get to be \"that damn good\" without the support of a loving family. And over the years several bodybuilders (including world-renowned trainer Charles Glass) worked with him to develop the best training regimens. Their advice, plus hardcore commitment, helped Paul Levesque survive \"The Hard Way In\" through Walter \"Killer\" Kowalski's wrestling school and become \"Terra Rising\" in Kowalski's International Wrestling Federation; enabled him to adjust to a difficult life on the road as \"the French guy\" in World Championship Wrestling; and gave \"Hunter Hearst-Helmsley\" the self-assurance he needed to succeed.Making The Game breaks down and demonstrates the split-training workout program Triple H has embraced to achieve new levels of success in sculpting his body. Between drilling you with reps and sets, he relates how training gave him the inner strength to shoulder the brunt of a controversial \"Curtain Call\" in the ring and, later, to elevate his position with Stone Cold Steve Austin and The Rock as one of the \"Big Three\" in WWE. Relive the fateful Raw events of May 2001 that left Triple H with a torn quadriceps muscle. Then you too can feel \"The Triple H Burn,\" the series of exercises he endured through nine months of physical therapy so he could resume his wrestling career.Besides offering the lowdown with step-by-step exercises for both novice bodybuilders and those looking to radically advance their workout, Making The Game weighs in on the science behind progressive-training resistance and rest-pause techniques; the significance of exercise form over volume; the truth behind achieving \"six-pack abs\"; the dangers of overtraining and \"skullcrushing\" exercises that risk injury; and how creativity can go a long way in your workout. Triple H sees it as his mission to provide the guidelines for you to follow in the months and years ahead. And if there's one thing he knows how to do, it's succeed.It's time to stop playing The Game...and time to start Making The Game.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Self Help",
    "Sports"
  ],
  "author": "Triple H",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/675959.Triple_H_Making_the_Game"
}