{
  "title": "The Lady & Sons Just Desserts: More Than 120 Sweet Temptations from Savannah's Favorite Restaurant",
  "description": "As Paula Deen will tell y'all, there's just no satisfying way to finish a delicious meal without a scrumptious, mouthwatering dessert!In this beautiful hardcover edition of The Lady & Sons Just Desserts, Paula—author, restaurateur, and Food Network star—devotes her trademark southern charm to a tempting collection of more than 120 delightful recipes, guaranteed to indulge any sweet tooth. Whether you're baking for the holidays or an after-dinner treat, there are crowd-pleasers here for any occasion.These are the classic down-home recipes that have made Paula beloved to her fans everywhere, from her signature Gooey Butter Cake and Key Lime Grits Pie to Pecan Shortbread Bars, Hidden Mint Cookies, and Iron Skillet Brownies. Whether you're whipping up an Old South Jelly Roll Cake for a weekday treat or baking the Apple Butter Pumpkin Pie or Christmas Nut Pie for a holiday celebration, these treats are as easy to create as they are to enjoy. The Basic 1-2-3-4 Cake—in coconut (Jamie's favorite), caramel (Bobby's favorite), or chocolate—makes a wonderful birthday surprise, and the Tennessee Banana-Black Walnut Cake with Caramel Frosting is a southern favorite sure to become one of yours as well. There is also a wide array of cookies, bars, and candy, including Savannah Cheesecake Cookies, Orange Brownies, Chocolate Brickle, and Creamy Caramels. Even the most time-pressed cook will find it a snap to create these from-scratch recipes, using Paula's tips for reliable convenience ingredients and time-tested shortcuts that will impress and delight family and friends.Filled with warm baking memories and family stories, The Lady & Sons Just Desserts is already a kitchen classic. There are also helpful baking tips for measuring ingredients, storing leftovers, and even cutting a few calories, as well as tasty flavor variations and unique serving suggestions throughout. So bring the folks together to create your own memorable meals and occasions and remember to save room for dessert!",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Southern",
    "Own"
  ],
  "author": "Paula H. Deen",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/67656.The_Lady_Sons_Just_Desserts"
}