{
  "title": "After Every War: Twentieth-Century Women Poets",
  "description": "They are nine women with much in common―all German speaking, all poets, all personal witnesses to the horror and devastation that was World War II. Yet, in this deeply moving collection, each provides a singularly personal glimpse into the effects of war on language, place, poetry, and womanhood.After Every War is a book of translations of women poets living in Europe in the decades before and after World War II: Rose Ausländer, Elisabeth Langgässer, Nelly Sachs, Gertrud Kolmar, Else Lasker-Schüler, Ingeborg Bachmann, Marie Luise Kaschnitz, Dagmar Nick, and Hilde Domin. Several of the writers are Jewish and, therefore, also witnesses and participants in one of the darkest occasions of human cruelty, the Holocaust. Their poems, as well as those of the other writers, provide a unique biography of the time―but with a difference. These poets see public events through the lens of deep private losses. They chart the small occasions, the bittersweet family ties, the fruit dish on a table, the lost soul arriving at a railway station; in other words, the sheer ordinariness through which cataclysm is experienced, and by which life is cruelly shattered. They reclaim these moments and draw the reader into them.The poems are translated and introduced, with biographical notes on the authors, by renowned Irish poet Eavan Boland. Her interest in the topic is not abstract. As an Irish woman, she has observed the heartbreaking effects of violence on her own country. Her experience has drawn her closer to these nine poets, enabling her to render into English the beautiful, ruminative quality of their work and to present their poems for what they are: documentaries of resilience―of language, of music, and of the human spirit―in the hardest of times.",
  "genres": [
    "Poetry",
    "German Literature"
  ],
  "author": "Eavan Boland",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/1032332.After_Every_War"
}