{
  "title": "Paula Deen: It Ain't All About the Cookin'",
  "description": "Do you know the real Paula Deen? You may think you know the butter-loving, finger-licking, joke-cracking queen of melt-in-your-mouth Southern cuisine. You may have even visited The Lady & Sons to taste for yourself the down-home delicacies that made her famous and even heard some version of her Cinderella story (a single mom with two teenage sons started a brown-bag lunch business with $200 and wound up with a thriving restaurant, a fairy-tale second marriage, and wildly popular television shows), but you have never heard the intimate details of her often bumpy road to fame and fortune.Courageously honest, downright inspiring, and just a little bit saucy, Paula shares the highs and lows of her life in the inimitable charming and irreverent style that you know from her television shows and personal appearances. She talks about long childhood summers spent in a bathing suit and roller skates and hard years living in the back of her father's gas station; a buzzing high school social life of sleepovers, parties, cheerleading, and boys; and a difficult marriage. The death of her beloved parents precipitated a debilitating agoraphobia that crippled her for years. But even when the going got tough, Paula never lost the good grace and sense of humor that would eventually help carry her to success and stardom. Of course, you can't get by on charm alone: as Paula has learned, you need plenty of willpower, hard work, and, above all, the love and support of family and friends to finance, sustain, and run a successful restaurant.In each chapter, Paula shares new recipes: there's serious comfort food like her momma's Chocolate-Dippy Doughnuts, Courage Chili for when you know life's going to get tough, Sexy Oxtails for seducing that special someone, and the recipe for her new mother-in-law's Banana Nut Delight Cake that Paula finally got just right. And you'll love the never-before-seen photos of her family.In this memoir, Paula Deen speaks as frankly and intimately as few women in the public eye have ever dared. Whether she's telling tales of good times or bad, her story is proof that the old-fashioned American dream is alive and kicking, and there still is such a thing as a real-life happy ending.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Cookbooks",
    "Food",
    "Autobiography",
    "Cooking"
  ],
  "author": "Paula H. Deen",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/67659.Paula_Deen"
}