{
  "title": "Obedience to Authority",
  "description": "Obedience is as basic an element in the structure of social life as one can point to. Some system of authority is a requirement of all communal living, and it is only the man dwelling in isolation who is not forced to respond, through defiance or submission, to the commands of others. Obedience, as a determinant of behavior is of particular relevance to our time. It has been reliably established that from 1933 to 1945 millions of innocent people were systematically slaughtered on command. Gas chambers were built, death camps were guarded, daily quotas of corpses were produced with the same efficiency as the manufacture of appliances. These inhumane policies may have originated in the mind of a single person, but they could only have been carried out on a massive scale if a very large number of people obeyed orders.Obedience is the psychological mechanism that links individual action to political purpose. It is the dispositional cement that binds men to systems of authority. Facts of recent history and observation in daily life suggest that for many people obedience may be a deeply ingrained behavior tendency, indeed, a prepotent impulse overriding training in ethics, sympathy, and moral conduct. C. P. Snow (1961) points to its importance when he writes:When you think of the long and gloomy history of man, you will find more hideous crimes have been committed in the name of obedience than have ever been committed in the name of rebellion. If you doubt that, read William Sbirer's 'Rise and Fall of the Third Reich.' The German Officer Corps were brought up in the most rigorous code of obedience . . . in the name of obedience they were party to, andassisted in, the most wicked large scale actions in the history of the world. (p. 24)The Nazi extermination of European Jews is the most extremeinstance of abhorrent immoral acts carried out by thousands ofpeople in the name of obedience. Yet in lesser degree this type ofthing is constantly recurring: ordinary citizens are ordered todestroy other people, and they do so because they consider ittheir duty to obey orders. Thus, obedience to authority, longpraised as a virtue, takes on a new aspect when it serves amalevolent cause; far from appearing as a virtue, it is transformedinto a heinous sin. Or is it?The moral question of whether one should obey when commands conflict with conscience was argued by Plato, dramatized in \"Antigone,\" and treated to philosophic analysis in every historical epoch Conservative philosophers argue that the very fabric of society is threatened by disobedience, and even when the act prescribed by an authority is an evil one, it is better to carry out the act than to wrench at the structure of authority. Hobbes stated further that an act so executed is in no sense the responsibility of the person who carries it out but only of the authority that orders it. But humanists argue for the primacy of individual conscience in such matters, insisting that the moral judgments of the individual must override authority when the two are in conflict.The legal and philosophic aspects of obedience are of enormous import, but an empirically grounded scientist eventually comes to the point where he wishes to move from abstract discourse to the careful observation of concrete instances. In order to take a close look at the act of obeying, I set up a simple experimentat Yale University. Eventually, the experiment was to involve more than a thousand participants and would be repeated at several universities, but at the beginning, the conception was simple. A person comes to a psychological laboratory and is told to carry out a series of acts that come increasingly into conflict with conscience. The main question is how far the participant will comply with the experimenter's instructions before refusing to carry out the actions required of him.But the reader needs to know a little more detail about the experiment. Two people come to a psychology laboratory to take part in a study of memory and learning. One of them is designated as a \"teacher\" and the other a \"learner.\" The experimenter explains that the study is concerned with the effects of punishment on learning. The learner is conducted into a room, seated in a chair, his arms strapped to prevent excessive movement, and an electrode attached to his wrist. He is told that he is to learn a list of word pairs; whenever he makes an error, be will receive electric shocks of increasing intensity.The real focus of the experiment is the teacher. After watching the learner being strapped into place, he is taken into the main experimental room and seated before an impressive shock generator. Its main feature is a horizontal line of thirty switches, ranging from 15 volts to 450 volts, in 15-volt increments. There are also verbal designations which range from Slight SHOCK to Danger--Severe SHOCK. The teacher is told that he is to administer the learning test to the man in the other room. When the learner responds correctly, the teacher moves on to the next item; when the other man gives an incorrectanswer, the teacher is to give him an electric shock. He is to start at the lowest shock level ( 15 volts) and to increase the level each time the man makes an error, going through 30 volts, 45 volts, and so on.The \"teacher\" is a genuinely naive subject who has come to the laboratory to participate in an experiment. The learner, or victim, is an actor who actually receives no shock at all. The point of the experiment is to see how far a person will proceed in a concrete and measurable situation in which he is ordered to inflict increasing pain on a protesting victim.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Science",
    "Sociology",
    "Philosophy",
    "Politics",
    "Social Science"
  ],
  "author": "Stanley Milgram",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/676723.Obedience_to_Authority"
}