{
  "title": "رعشة الحرية",
  "description": "\"الطيران من جنيف إلى نيويورك يشبه الطيران من الصفاء إلى الهذيان، كأنك كنت تتنزه في حديقة للورود على ضفة بحيرة ثم وجدت نفسك داخل \"قاووش\" في مصح عقلي خاص بالعنف. لذا تنتابك وأنت تمشي في شوارع مانهاتن لحظات من الاختناق المفاجئ المذعور. تشعر بأن ناطحات السحاب المحيطة بك تتحرك وتميل ببطىء لتقع فوق رأسك، ويتصاعد البخار الأسود من فتحات إسفلت الشوارع كأن تمساحاً جحيمياً يختبئ وتحته نافثاً أنفاسه المسمومة كإيقاع جهنمي لنشيد نيويورك: زعيق سيارات البوليس والإسعاف. المشاة المهرولون كومى آلية يصطدمون بك ولا يلاحظونك كأنك الرجل اللامرئي. في نيويورك يصير المرء لا مرئياً إلا للنشالين والساديين! في لحظة من لحظات الضيق هذه في الجادة الخامسة (فيفث أفنيد) الشهيرة انسحبت من سبقا الفئران ودخلت إلى الفندق الفخم بحثاً عن واحة هدوء في أحد مقاصفه. كان البار خاوياً ولما يحن موعد الفداء بعد. استقبلني النادل بنظرة من يتهيأ لطردي. فالتلفزيون في ركن المكان يبث مباراة رياضية ما لعله كان يتابعها، بحكم العادة كلمته بالفرنسية وأنا أطلب قهوتي، تهللت أساريره، واكتشفت أنه فرنسي يفتقد بلده ولغته كأي مهاجر آخر… ويا للدلال الذي أحاطني به مقابل أن يثرثر معي بالفرنسية.. وحين عرف أنني جارة \"برج إيفل\" في باريس ونهر السين حيث مرابع طفولته بدأ يستجوبني عن الشارع والجسور، وهو استجواب كنت سأفعل مثله لو التقيت في نيويورك بشامي مقيم خلف الجامع الأموي أو في ساحة النجمة أو طريق الصالحية حيث مرابع الصبا\".متعة القراءة السلسة تأخذ بك وتعلن وبإصرار عزمك على المضي في قراءة غادة السمان؛ في قراءة أفكارها وتأملاتها وفلسفتها، التي لا تذوي، وفي استشفاف مشاعرها وأحاسيسها التي لا تنضب. متعة القراءة تستبد بك وتنساح مع غادة السمان عاشقة الحرية وهي تحكي عن رعشة تلك الحرية، تطوي صفحات كتابها كما هي تطوي أسفار رحلاتها المنطوية على الكثير من الأخبار عن تلك المدن القائمة في جانب العالم الآخر. ويستهويك أسلوبها السهل الممتنع الذي يشي بأن للحروف مفاتيح من يملكها يملك مفاتيح القلوب والعقول.ولن تعييك غادة السمان بفهم لغتها، لأنها إلى البساطة أقرب، ولن تصدمك بسطحيتها فمعانيها عميقة بعمق تجربتها الحياتية. وكما تأخذك فلسفتها إلى مناخاتٍ عقلك بحاجة إليها، تأخذك غادة السمان إلى محطات تأملية رائقة تفتقدها نفسك. وبعد هذا كله تأتي \"رعشة الحرية\" لتقول بأن إبداعات غادة السمان ما زالت غنية، ما زالت ثرية، وما زال في الحياة لديها متسع لتجارب تغنيها بعطاءات أدبية إنسانية السمة رائعة.",
  "genres": [],
  "author": "غادة السمان",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/6769795"
}