{
  "title": "The Hidden Christ: Beneath the Surface of the Old Testament",
  "description": "\"What if I don't like the Old Testament?\" Author James L. Ferrell admits that he used to ask himself that question. However, there came a time in his life when he discovered what he had been missing, and at that point he \"absolutely fell head over heals in love with the book.\" \"But I had to discover something before I fell in love,\" he writes. \"I had to discover that the most powerful messages--about the gospel and about life--lie hidden just below the surface of the stories in the book. When I learned to ask questions that penetrated the surface, the Old Testament opened up to reveal a wonderland of inspiring truth and practical insight.\"The Hidden Christ is the author's journey of discovery within the Old Testament, a journey that led him to find Christ in every story, every personality, every occurrence presented in that foundational work of scripture. This innovative and invigorating book explores many of these similitudes in depth, offering a perspective that illuminates Old Testament passages in surprising new ways.Here is the table of contents:PART ONE: CHRIST AND THE FOUNDATION OF THE WORLDChapter 1: The Parallel CreationChapter 2: The Fall and Redemption of AgencyChapter 3: God and Man after the FallPART TWO: CHRIST AND THE PATRIARCHSChapter 4: Exploring the Abrahamic CovenantChapter 5: Another Look at Abraham and IsaacChapter 6: Christ and the Patriarchal OrderPART THREE: CHRIST AND THE HOUSE OF ISRAELChapter 7: Temporal and Spiritual Salvation through JosephChapter 8: The Exodus: Deliverance through the DelivererChapter 9: The Temple As the Way of Escape and ReturnChapter 10: Understanding the Law of MosesChapter 11: Discovering DeuteronomyChapter 12: Early Years in the Promised Land: The Pattern of Fall and RedemptionChapter 13: Samuel and the Messianic KingdomChapter 14: David, Saul, Jonathan, and the Allegory of SalvationChapter 15: The Houses of the Kings and the House of the LordChapter 16: Elijah and the Four Great SeparationsChapter 17: The Lord's Question to JonahChapter 18: The House of Israel As a Type and ShadowChapter 19: The Dispensations of the Lord's PeoplePART FOUR: CHRIST AND THE WRITINGSChapter 20: Job, David, and the Suffering of the LordChapter 21: The Wisdom of the ScripturesChapter 22: The Old Testament's Unified Testimony",
  "genres": [
    "Religion",
    "Lds",
    "Nonfiction",
    "Church",
    "Spirituality",
    "Unfinished",
    "Faith"
  ],
  "author": "James L. Ferrell",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/6778409-the-hidden-christ"
}