{
  "title": "A Tale Of Two Continents: A Physicist's Life In A Turbulent World",
  "description": "People like myself, who truly feel at home in several countries, are not strictly at home anywhere, writes Abraham Pais, one of the world's leading theoretical physicists, near the beginning of this engrossing chronicle of his life on two continents. The author of an immensely popular biography of Einstein, Subtle is the Lord. Pais writes engagingly for a general audience. His tale describes his period of hiding in Nazi-occupied Holland (he ended the war in a Gestapo prison) and his life in America, particularly at the newly organised Institute for Advanced Study in Princeton, then directed by the brilliant and controversial physicist Robert Oppenheimer. Pais tells fascinating stories about Oppenheimer, Einstein, Bohr, Sakharov, Dirac, Heisenberg, and von Neumann, as well as about nonscientists like Chaim Weizmann, George Kennan, Erwin Panofsky, and Pablo Casals. His enthusiasm about science and life in general pervades a book that is partly a memoir, partly a travel commentary, and partly a history of science. Pais's charming recollections of this years as a university student become somber with the German invasion of the Netherlands in 1940. He was presented with an unusual deadline for his graduate a German decree that July 14, 1941, would be the final date on which Dutch Jews could be granted a doctoral degree. Pais received the degree, only to be forced into hiding from the Nazis in 1943, practically next door to Anne Frank. After the war, he went to the Institute of Theoretical Physics in Copenhagen to work with Niels Bohr. 1946 began his years at the Institute for Advanced Study, where he worked first as a Fellow and then as a Professor until his move to Rockefeller University in 1963. Combining his understanding of disparate social and political worlds, Pais comments just as insightfully on Oppenheimer's ordeals during the McCarthy era as he does on his own and his European colleagues' struggles during World War II.",
  "genres": [],
  "author": "Abraham Pais",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/677173.A_Tale_Of_Two_Continents"
}