{
  "title": "Comfort Women: Sexual Slavery in the Japanese Military During World War II",
  "description": "Available for the first time in English, this is the definitive account of the practice of sexual slavery the Japanese military perpetrated during World War II by the researcher principally responsible for exposing the Japanese government's responsibility for these atrocities. The large scale imprisonment and rape of thousands of women, who were euphemistically called \"comfort women\" by the Japanese military, first seized public attention in 1991 when three Korean women filed suit in a Toyko District Court stating that they had been forced into sexual servitude and demanding compensation. Since then the comfort stations and their significance have been the subject of ongoing debate and intense activism in Japan, much if it inspired by Yoshimi's investigations. How large a role did the military, and by extension the government, play in setting up and administering these camps? What type of compensation, if any, are the victimized women due? These issues figure prominently in the current Japanese focus on public memory and arguments about the teaching and writing of history and are central to efforts to transform Japanese ways of remembering the war.Yoshimi Yoshiaki provides a wealth of documentation and testimony to prove the existence of some 2,000 centers where as many as 200,000 Korean, Filipina, Taiwanese, Indonesian, Burmese, Dutch, Australian, and some Japanese women were restrained for months and forced to engage in sexual activity with Japanese military personnel. Many of the women were teenagers, some as young as fourteen. To date, the Japanese government has neither admitted responsibility for creating the comfort station system nor given compensation directly to former comfort women.This English edition updates the Japanese edition originally published in 1995 and includes introductions by both the author and the translator placing the story in context for American readers.",
  "genres": [
    "History",
    "Japan",
    "Nonfiction",
    "World War II",
    "Japanese History",
    "Japanese Literature",
    "Asian Literature"
  ],
  "author": "Yoshimi Yoshiaki",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/677767.Comfort_Women"
}