{
  "title": "The Last English King",
  "description": "On September 27, 1066, Duke William of Normandy sailed for England with hundreds of ships and over 8,000 men. King Harold of England, weakened by a ferocious Viking invasion from the north, could muster little defense. At the Battle of Hastings of October 14, he was outflanked, quickly defeated, and killed by William's superior troops. The course of English history was altered forever.Three years later, Walt, King Harold's only surviving bodyguard, is still emotionally and physically scarred by the loss of his king and his country. Wandering through Asia Minor, headed vaguely for the Holy Land, he meets Quint, a renegade monk with a healthy line of skepticism and a hearty appetite for knowledge. It is he who persuades Walt, little by little, to tell his extraordinary story.And so begins a roller-coaster ride into an era of enduring fascination. Weaving fiction round fact, Julian Rathbone brings to vibrant, exciting, and often amusing life the shadowy figures and events that preceded the Norman Conquest. We see Edward, confessing far more than he ever did in the history books. We meet the warring nobles of Mercia and Wessex; Harold and his unruly clan; Canute's descendants with their delusions of grandeur; predatory men, pushy women, subdued Scots , and wily Welsh. And we meet William of Normandy, a psychotic thug with interesting plans for the \"racial sanitation\" of the Euroskepics across the water.Peppered with discussions on philosophy. dentistry, democracy, devils, alcohol, illusions, and hygiene, The Last English King raises issues, both daring and delightful, that question the nature of history itself. Where are the lines between fact, interpretation, and re-creation? Did the French really stop for a two-hour lunch during the Battle of Hastings?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "British Literature",
    "Medieval",
    "11th Century",
    "Novels"
  ],
  "author": "Julian Rathbone",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/677842.The_Last_English_King"
}