{
  "title": "The Age of Reagan: The Conservative Counterrevolution: 1980-1989",
  "description": "“Those who say that we’re in a time when there are no heroes, they just don’t know where to look.”–President Ronald Reagan, January 20, 1981Hero. It was a word most Americans weren’t using much in 1980. As they waited on gas and unemployment lines, as their enemies abroad grew ever more aggressive, and as one after another their leaders failed them, Americans began to believe the country’s greatness was fading.Yet within two years the recession and gas shortage were over. Before the decade was out, the Cold War was won, the Berlin Wall came crashing down, and America was once more at the height of prosperity. And the nation had a new Ronald Wilson Reagan.Reagan’s greatness is today widely acknowledged, but his legacy is still misunderstood. Democrats accept the effectiveness of his foreign policy but ignore the success of his domestic programs; Republicans cheer his victories over liberalism while ignoring his bitter battles with his own party’s establishment; historians speak of his eloquence and charisma but gloss over his brilliance in policy and clarity of vision.From Steven F. Hayward, the critically acclaimed author of The Age of The Fall of the Old Liberal Order , comes the first complete, true story of this misunderstood, controversial, and deeply consequential presidency. Hayward pierces the myths and media narratives, masterfully documenting exactly what transpired behind the scenes during Reagan’s landmark presidency and revealing his real legacy.What emerges is a compelling portrait of a man who arrived in office after thirty years of practical schooling in the ways of politics and power, possessing a clear vision of where he wanted to take the nation and a willingness to take firm charge of his own administration. His relentless drive to shrink government and lift the burdens of high taxation was born of a deep appreciation for the grander blessings of liberty. And it was this same outlook, extended to the world’s politically and economically enslaved nations, that shaped his foreign policy and lent his statecraft its great unifying power.Over a decade in the making, and filled with fresh revelations, surprising insights, and an unerring eye for the telling detail, this provocative and authoritative book recalls a time when true leadership inspired a fallen nation to pick itself up, hold its head high, and take up the cause of freedom once again.",
  "genres": [
    "History",
    "Politics",
    "Biography",
    "American History",
    "Presidents",
    "Nonfiction",
    "American"
  ],
  "author": "Steven F. Hayward",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/6785194-the-age-of-reagan"
}