{
  "title": "Coal to Diamonds: A Memoir",
  "description": "A raw and surprisingly beautiful coming-of-age memoir, Coal to Diamonds tells the story of Mary Beth Ditto, a girl from rural Arkansas who found her voice. Born and raised in Judsonia, Arkansas—a place where indoor plumbing was a luxury, squirrel was a meal, and sex ed was taught during senior year in high school (long after many girls had gotten pregnant and dropped out) Beth Ditto stood out. Beth was a fat, pro-choice, sexually confused choir nerd with a great voice, an eighties perm, and a Kool Aid dye job. Her single mother worked overtime, which meant Beth and her five siblings were often left to fend for themselves. Beth spent much of her childhood as a transient, shuttling between relatives, caring for a sickly, volatile aunt she nonetheless loved, looking after sisters, brothers, and cousins, and trying to steer clear of her mother’s bad boyfriends. Her punk education began in high school under the tutelage of a group of teens—her second family—who embraced their outsider status and introduced her to safety-pinned clothing, mail-order tapes, queer and fat-positive zines, and any shred of counterculture they could smuggle into Arkansas. With their help, Beth survived high school, a tragic family scandal, and a mental breakdown, and then she got the hell out of Judsonia. She decamped to Olympia, Washington, a late-1990s paradise for Riot Grrrls and punks, and began to cultivate her glamorous, queer, fat, femme image. On a whim—with longtime friends Nathan, a guitarist and musical savant in a polyester suit, and Kathy, a quiet intellectual turned drummer—she formed the band Gossip. She gave up trying to remake her singing voice into the ethereal wisp she thought it should be and instead embraced its full, soulful potential. Gossip gave her that chance, and the raw power of her voice won her and Gossip the attention they deserved. Marked with the frankness, humor, and defiance that have made her an international icon, Beth Ditto’s unapologetic, startlingly direct, and poetic memoir is a hypnotic and inspiring account of a woman coming into her own.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Music",
    "Biography",
    "Queer",
    "Autobiography",
    "LGBT"
  ],
  "author": "Beth Ditto",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/6783579-coal-to-diamonds"
}