{
  "title": "Stillness Speaks",
  "description": "Los pensamientos que se contemplan en este libro no dicen\"míranos\"; sin embargo, te están sugiriendo\"mira más allá de nosotros\". Porque los pensamientos que proceden del silencio; ellos tienen poder, el poder de hacerte volver al mismo silencio del cual partieron. Ese silencio es también la paz interior, y silencio y paz son la esencia de nuestro Ser.La esencia del mensaje de Eckhart Tolle es fácil de cuando conectamos con la quietud interna, vamos más allá de nuestras ajetreadas mentes y emociones, para descubrir grandes profundidades de paz duradera, alegría y serenidad. Con su primer libro, El PODER DEL AHORA, su mensaje ha llegado a millones de personas en todo el mundo. Ahora, en este nuevo libro tan esperado, Tolle nos ofrece la esencia de su enseñanza en simples y breves sentencias que cualquier persona puede comprender fácilmente.El Silencio Habla está organizado en diez capítulos, que comprenden temas como\"Más allá de la mente pensante\"o\"Sufrimiento y el final del sufrimiento\". Cada capítulo es un mosaico de frases concisas y completas en sí mismas, pero profundamente transformadoras cuando se leen como una totalidad.Eckhart Tolle entiende las necesidades espirituales de nuestra época. Basándose en la esencia de las tradiciones espirituales, expresaésta de modo sorprendentemente nuevo. El resultado es este libro -paradójicamente tan antiguo como contemporáneo-, lleno de poderosos y oportunos mensajes.El Silencio Habla puede lograr un despertar en todos los lectores dispuestos a otorgar a las palabras una oportunidad de obrar su mágica quietud.ECKHART TOLLE es un maestro espiritual contemporáneo que no se halla alineado con religión o tradición alguna. En sus escritos y seminarios transmite un mensaje simple aunque profundo, sin ambages y con la claridad intemporal de los antiguos maestros el de que hay un camino para salir del sufrimiento y sentirse en paz. Eckhart viaja llevando sus enseñanzas por todo el mundo.",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Self Help",
    "Philosophy",
    "Psychology",
    "Personal Development",
    "Audiobook"
  ],
  "author": "Eckhart Tolle",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/67864.Stillness_Speaks"
}