{
  "title": "The Biologic Show, Number: 0",
  "description": "he Biologic Show is a comic book series written and drawn by Al Columbia. The first issue, #0, was released in October 1994 by Fantagraphics Books, and a second issue, #1, was released the following January. A third issue (#2) was announced in the pages of other Fantagraphics publications and solicited in Previews but was never published. \"I Was Killing When Killing Wasn't Cool\", a color short story with a markedly different art style originally intended for issue #2, appeared instead in the anthology Zero Zero. In a 2010 interview, Columbia recalled that the unfinished issue \"looked so different that it just didn’t look right, it didn’t look consistent, and it didn’t feel right to keep putting out that same comic book, to try to tell a story where the style is mutating.\"[1] The series' title is taken from a passage in the William S. Burroughs book Exterminator! (in the chapter \"Short Trip Home\"). The passage in question is quoted briefly in a story from issue #0, also titled \"The Biologic Show\".Each issue of The Biologic Show contains several short stories and illustrated poems. Many of the pieces deal with disturbing subject matter such as mutilation, incest, and the occult. Issue #0 introduces three of Columbia's recurring characters: the hapless, Koko the Clown-like Seymour Sunshine in the opening story \"No Tomorrow If I Must Return\", and the sibling duo Pim and Francie in \"Tar Frogs\". (Both \"Tar Frogs\" and the aforementioned \"The Biologic Show\" had originally appeared in the British comics magazine Deadline but were partially redrawn for Columbia's solo book.) Issue #1 is dominated by the 16-page Pim and Francie story \"Peloria: Part One\", intended as the start of an ongoing serial. It includes another character, Knishkebibble the Monkey-Boy, who reappears in Columbia's later work. Upon the demise of The Biologic Show Fantagraphics announced that Peloria would be released as a stand-alone graphic novel,[2] but this plan was also abandoned.",
  "genres": [
    "Comics",
    "Horror",
    "Graphic Novels",
    "Fiction",
    "Graphic Novels Comics",
    "Short Stories",
    "Comic Book"
  ],
  "author": "Al Columbia",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/6788013-the-biologic-show-number"
}