{
  "title": "Winterland",
  "description": "\"Timely, topical, and thrilling.\"-- John Connolly\"A terrific read...completely involving.\"-- George Pelecanos\"WINTERLAND sets a dramatically high benchmark for emerald noir. With all the operatic inevitability of Greek tragedy, it anatomises what greed has done to Ireland. A resonant, memorable and uncomfortable read.\"-- Val McDermid\"This is the colossus of Irish crime fiction, what Mystic River did for Dennis Lehane, WINTERLAND should do for Alan Glynn, it is a noir masterpiece, the bar against which all future works will be judged.\"-- Ken BruenWinterland is a blistering unputdownable novel about power, lies and the corrupting influence of money. It is the first in a series on the dark and clandestine underside of globalization and announces a compelling new voice in contemporary crime writing.The worlds of business, politics and crime collide when two men with the same name, from the same family, die on the same night—one death is a gangland murder, the other, apparently, a road accident. Was it a coincidence? That’s the official version of events. But when a family member, Gina Rafferty, starts asking questions, this notion quickly unravels.Devastated by her loss, Gina’s grief is tempered, and increasingly fuelled, by anger—because the more she’s told that it was all a coincidence, that gangland violence is commonplace, that people die on our roads every day of the week, the less she’s prepared to accept it. Told repeatedly that she should stop asking questions, Gina becomes more determined than ever to find out the truth, to establish a connection between the two deaths—but in doing so she embarks on a path that will push certain powerful people to their limits...",
  "genres": [
    "Fiction",
    "Mystery",
    "Crime",
    "Thriller",
    "Ireland",
    "Irish Literature",
    "Novels"
  ],
  "author": "Alan Glynn",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/6784681-winterland"
}