{
  "title": "False Mermaid",
  "description": "American pathologist Nora Gavin fled to Ireland three years ago, hoping that distance from home would bring her peace. Though she threw herself into the study of bog bodies and the mysteries of their circumstances, she was ultimately led back to the one mystery she was unable to the murder of her sister, Tríona. Nora can’t move forward until she goes back—back to her home, to the scene of the crime, to the source of her nightmares and her deepest regrets. Determined to put her sister’s case to rest and anxious about her eleven-year-old niece, Elizabeth, Nora returns to Saint Paul, Minnesota, to find that her brother-in-law, Peter Hallett, is about to remarry and has plans to leave the country with his new bride.Nora has long suspected Hallett in Tríona’s murder, though there has never been any proof of his involvement, and now she believes that his new wife and Elizabeth may both be in danger. Time is short, and as Nora begins reinvestigating her sister’s death, missed clues and ever-more disturbing details come to light. What is the significance of the \"false mermaid\" seeds found on Tríona’s body? Why was her behavior so erratic in the days before her murder? Is there a link between Tríona’s death and that of another young woman? Nora’s search for answers takes her from the banks of the Mississippi to the cliffs of Ireland, where the eerie story of a fisherman’s wife who vanished more than a century ago offers up uncanny parallels.As painful secrets come to light, Nora is drawn deeper into a past that still threatens to engulf her and must determine how much she is prepared to sacrifice to put one tragedy to rest . . . and to make sure that history doesn’t repeat itself.",
  "genres": [
    "Mystery",
    "Ireland",
    "Fiction",
    "Mystery Thriller",
    "Thriller",
    "Irish Literature",
    "Audiobook"
  ],
  "author": "Erin Hart",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/6789120-false-mermaid"
}