{
  "title": "رجب طيب أردوغان: قصة زعيم",
  "description": "نبذة النيل والفرات:\"لم أتغير؛ ولكنني تطورت\"، بهذه الكلمات الموجزة دشَّن \"رجب طيب أردوغان\" مرحلة جديدة في مسار حركة الإسلام السياسي، وارتاد تياراً وسطاً بين ثنائية (العلمانية/الإسلام)، عُرف بتيار \"الأردوغانية\".الكتاب الذي – بين أيدينا – يتضمن البيوغرافيا الرسمية لرجب طيب اردوغان حيث يحكي لنا قصة واقعية بطلها هو رئيس وزراء تركيا الحالي \"رجب طيب أردوغان\". ومؤلفا هذا الكتاب شخصيتان قريبتان من أردوغان، كتبا فصول هذا الكتاب من داخل الأحداث، واستنطقا الكثير من شهود العيان وأبطال هذه القصة الواقعية وأهمهم الرئيس الذي أشرف على توثيق الكتاب شخصياً.ما يميز هذا الكتاب أن القارئ سيجد نفسه أمام أسلوب جديد للسرد، ونمط مختلف إلى حد ما، على ثقافتنا العربية؛ فهو يمزج بين السرد القصصي والشواهد التوثيقية، والتحليل السياسي، ويعرض كذلك لآراء وتصريحات ساسة وعلماء أتراك، يمكن اعتبار كل واحد منهم شاهداً على عصر أردوغان، ومشواره السياسي، وتطوراته الفكرية والإيديولوجية.ويتناول الكتاب حياة أردوغان الشخصية ومشواره السياسي، وتطوره الفكري من خلال عرض تاريخي متسلسل، وكذا جهوده في العمل السياسي داخل حزب السلامة الوطني وحزب الرفاه انتهاءً بحزب الفضيلة. ويعرض الكتاب بالتفصيل لتجارب أردوغان في رئاسة بلديات اسطنبول المختلفة، ثم رئاسته لبلدية مدينة اسطنبول الكبرى، وما استحدثه من برامج انتخابية ووسائل وأدوات في الدعاية الانتخابية، وما قدمه من خدمات وحققه من مشروعات من أجل خدمة الوطن والمواطنين.ثم يعرض الكتاب بنوع من التفصيل التضييقات والضغوط التي تعرض لها أردوغان من داخل حزبه ومن خارجه، فضلاً عن التهديد بالقتل والفترة التي قضاها في السجن السياسي.كما يُفرد الكتاب جزءاً كبيراً لمرحلة الانشقاق عن حركة الفكر الوطني وتأسيس حزب العدالة والتنمية، والجهود التي بذلها أردوغان ومجموعته من أجل تشكيل الحزب، وصوغ برنامجه ولائحته الداخلية. يمكن القول إن هذا الكتاب بمثابة سيرة ذاتية وعملية، لم يكتبها أردوغان بنفسه بل شارك العديد من رفقاء دربه في كتابتها وتوثيقها، من أجل تدوين قصة الزعيم أردوغان لتصبح نموذجاً يحتذى للأجيال الشابة في الثبات على المبادئ، والمرونة في التخطيط، والقدرة على تطويع الاستراتيجيات لتطوير الأفكار وتجديدها بشكل مستمر، وهي مهمة لا ينوء بحملها إلا الشباب المجددون في كل عصر…",
  "genres": [
    "Biography",
    "Politics",
    "History",
    "Nonfiction",
    "Autobiography"
  ],
  "author": "Hüseyin Besli",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/12992260"
}