{
  "title": "Dear Prince Charming",
  "description": "Too short to be a model, too unartistically inclined to be a designer, Valerie Wagner has finally found her niche in the fashion world she loves as the publicist for Glass Slipper, Inc., and the mastermind behind the launch of their brand-new glossy magazine. She's signed up the perfect cover model - Prince Charming, an advice columnist who's won the hearts of millions of women with his acerbic wit and his on-target romantic insight. Best of all, he's never revealed his real name or shown his face. Until now. And it's Valerie who's about to bring him into the limelight. There's just one problem. America's sweetheart, the sexy and sensitive man who's helped millions of women get their man, is coming out of the closet with a vengeance.Valerie's new-found career is teetering on the brink of ruin. She can't crush the hopes of all the buyers of the magazine. She can't get Eric out of his seven-figure contract. And Prince Charming himself is tired of living a lie, and wants to find his own Mr. Right. Looks like there's no way out. Until Eric offers up his childhood best friend Jack, a sportswriter with a devilish smile and a chain of ruined relationships behind him. With Eric as the brains of the operation and Jack as the heartthrob that the media can sink its teeth into, they're an unbeatable team, and no one ever has to know... until Jack notices that behind Valerie's overachiever businesswoman personality is a woman with her very own kind of charm, and he decides to take matters into his own hands...Fresh, sexy, and funny enough to have come from the pen of Prince Charming himself, Donna Kauffman transcends the boundaries of romance and chick lit to take her own particular twist on a fairy tale.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "Fairy Tales"
  ],
  "author": "Donna Kauffman",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/679024.Dear_Prince_Charming"
}