{
  "title": "Worlds of Exile and Illusion: Rocannon’s World, Planet of Exile, City of Illusions",
  "description": "THREE REMARKABLE JOURNEYS INTO THE STARS. These novels, Rocannon's world, Planet of Exile, and City of Illusions, are set in the same Hanish universe as Le Guin's groundbreaking classic, The Left hand of Darkness, which told the story of Genly Ai, a man from Earth, a lone human emissary sent as an envoy to the planet Winter, a world without sexual prejudice, to facilitate Winter's inclusion in a growing intergalactic civilization...a civilization full of politics and a convoluted bureaucracy.Contents: Rocannon's World [Hainish] (1966) / novel by Ursula K. Le Guin: A world shared by three native humanoid races, the cavern-dwelling Gdemiar, elvish Fiia, and warrior clan Liuar, is suddenly invaded and conquered by a fleet of ships from the stars. Earth scientist Rocannon is on that world, and he sees his friends murdered and his spaceship destroyed. Marooned among alien peoples, he leads the battle to free this new world -- and finds that legends grow around him even as he fights. Planet of Exile [Hainish] (1966) / novel by Ursula K. Le Guin: The Earth colony of Landin has been stranded on Werel for ten years, and ten of Werel's years are over 600 terrestrial years. The lonely & dwindling human settlement is beginning to feel the strain. Every winter, a season that lasts for 15 years, the Earthmen have neighbors: the humanoid hilfs, a nomadic people who only settle down for the cruel cold spell. The hilfs fear the Earthmen, whom they think of as witches and call the farborns. But hilfs & farborns have common enemies: the hordes of ravaging barbarians called gaals and eerie preying snow ghouls. Will they join forces or be annihilated? City of Illusions [Hainish] (1967) / novel by Ursula K. Le Guin: He was a fully grown man, alone in dense forest, with no trail to show where he had come from and no memory to tell who, or what, he was. His eyes were not the eyes of a human. The forest people took him in and raised him almost as a child, teaching him to speak, training him in forest lore, giving him all the knowledge they had. But they could not solve the riddle of his past, and at last he had to set out on a perilous quest to Es Toch, the City of the Shining, the Liars of Earth, the Enemy of Mankind. There he would find his true self...and a universe of danger.Tor is pleased to return these previously unavailable works to print in this attractive new edition.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Classics",
    "Speculative Fiction",
    "Collections"
  ],
  "author": "Ursula K. Le Guin",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/67999.Worlds_of_Exile_and_Illusion"
}