{
  "title": "Lost in Trans Nation: A Child Psychiatrist's Guide Out of the Madness",
  "description": "Throughout our country, atrocities are taking place in doctor’s offices and hospital operating rooms. Physically healthy children and adolescents are being permanently disfigured and sometimes sterilized. Those youth say they’re transgender, and we—their parents, teachers, therapists, and doctors—are supposed to agree with their self-diagnosis and take a back seat as they make the most consequential decision of their to alter their bodies in order to, we are told, “align” them with their minds.   Medical, educational, and government authorities advise us to support the “gender journeys” of still developing kids, including medical interventions with poor evidence of long-term improvement.   This would not be acceptable in any other field of medicine. Indeed, the treatments our medical authorities and Washington call “crucial” and “life-saving” have been banned in progressive Sweden, Finland, and Britain.   Dr. Miriam Grossman is a child and adolescent psychiatrist whose practice consists of trans-identified youth and their families. In Lost in Trans Nation, she implores parents to reject the advice of gender experts and politicians and trust their guts—their parental instincts—in the face of an onslaught of ideologically driven misinformation that steers them and their children toward risky decisions they may end up mourning for the rest of their lives.   The beliefs that male and female are human inventions; that the sex of a newborn is arbitrarily “assigned”; and that as a result the child requires “affirmation” through medical interventions—these ideas are divorced from reality and therefore hazardous, especially to children. The core belief—that biology can and should be denied—is a repudiation of reality and a mockery of what hard science teaches about being male and female.   Dr. Grossman believes that parents know their child best; they especially know if they have a son or daughter. But currently in our country when it comes to gender identity, everyone knows better than mom and dad. Schools enable students to live double lives—Patrick at home, Patti at school. Activists tell kids their loving homes are “unsafe” when parents voice doubts about the child’s new identity. For refusing to see their son as their daughter, parents might be reported to protective services, a development that can lead to a family’s destruction.  Lost in Trans Nation arms parents with the ammunition to avoid, or, if necessary, fight what many families describe as the most difficult challenge of their lives. Parents will learn what to say and how—at home, at school, and if necessary, to police when they appear at the door.   “Don’t be blindsided like so many parents I know,” warns Grossman, “be proactive and get educated. Feel prepared and confident to discuss trans, nonbinary, or whatever your child brings to the dinner table.” Whether it’s the “trans is as common as red hair” claim, or the “I’m not your son, I’m your daughter” proclamation, or the “do you prefer a live son or a dead daughter’ threat, says Grossman, no family is immune, and every parent must be prepared.   No child is born in the wrong body, Dr. Grossman reassures us, their bodies are just fine; it’s their emotional lives that need healing. Whether you’re facing a gender identity battle in your home right now, or want to prevent one, you need this book to guide you and your loved ones out of the madness.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Politics",
    "Feminism",
    "Gender",
    "Parenting",
    "Health"
  ],
  "author": "Miriam Grossman",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/67958998-lost-in-trans-nation"
}