{
  "title": "Claude & Camille: A Novel of Monet",
  "description": "Sometimes he dreamt he held her; that he would turn in bed and she would be there. But she was gone and he was old. Nearly seventy. Only cool paint met his fingers. “Ma très chère . . .” Darkness started to fall, dimming the paintings. He felt the crumpled letter in his pocket. “I loved you so,” he said. “I never would have had it turn out as it did. You were with all of us when we began, you gave us courage. These gardens at Giverny are for you but I’m old and you’re forever young and will never see them. . . .” In the mid-nineteenth century, a young man named Claude Monet decided that he would rather endure a difficult life painting landscapes than take over his father’s nautical supplies business in a French seaside town. Against his father’s will, and with nothing but a dream and an insatiable urge to create a new style of art that repudiated the Classical Realism of the time, he set off for Paris. But once there he is confronted with an art world that refused to validate his style, extreme poverty, and a war that led him away from his home and friends. But there were bright spots as his deep, enduring friendships with men named Renoir, Cézanne, Pissarro, Manet – a group that together would come to be known as the Impressionists, and that supported each other through the difficult years. But even more illuminating was his lifelong love, Camille Doncieux, a beautiful, upper-class Parisian girl who threw away her privileged life to be by the side of the defiant painter and embrace the lively Bohemian life of their time. His muse, his best friend, his passionate lover, and the mother to his two children, Camille stayed with Monet—and believed in his work—even as they lived in wretched rooms, were sometimes kicked out of those, and often suffered the indignities of destitution. She comforted him during his frequent emotional torments, even when he would leave her for long periods to go off on his own to paint in the countryside. But Camille had her own demons – secrets that  Monet could never penetrate, including one that when eventually revealed would pain him so deeply that he would never fully recover from its impact. For though Camille never once stopped loving the painter with her entire being, she was not immune to the loneliness that often came with being his partner. A vividly-rendered portrait of both the rise of Impressionism and of the artist at the center of the movement, Claude and Camille is above all a love story of the highest romantic order.",
  "genres": [
    "Historical Fiction",
    "Art",
    "Fiction",
    "France",
    "Romance",
    "Historical",
    "Book Club"
  ],
  "author": "Stephanie Cowell",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/6797515-claude-camille"
}