{
  "title": "The Story of the Mongols Whom We Call the Tartars",
  "description": "Few Europeans knew anything reliable about the Far East before the 13th century.  In 1241, Mongols from central Asia conquered most of east Europe and quickly killed more than one hundred thousand knights and soldiers in Russia, Poland, and Hungary. In addition, the invaders laid waste to the land like no earlier force in history; no standing army in Europe met the challenge of this unfamiliar, lethal threat. Gregory IX, pope, understood the threat but died in 1241 amid a conflict with Frederick II, holy Roman emperor. Innocent IV succeeded as pope in 1243 and took refuge in Lyon. While preparing for the first council of Lyon, the pope put together a team of missionaries to go in 1245 to the great khan of the Mongols with the secret mission of gathering appropriate intelligence to bring back. Giovanni Carpini, a Franciscan friar, fulfilled exactly that mission. He traveled to the Mongol capital of Karakorum, gathered the information, wrote it in Latin, and presented it to the pope. He also carried the reply in Persian of Güyük Khan, then reigning as supreme khan of the Mongols, back to the pope. This book presents the report of the friar. Although the Mongols vanquished the Tatars circa 1206, people in west Europe, including the popes and the author, continued to call the inhabitants of the former Tatar domains as Tatars, not Mongols, hence the name of this book. People, however, neither published nor widely disseminated his extensive report. Erik Hildinger first translated this book into English and published it, perhaps still of a kind in the world. A few decades after Giovanni da Pian del Carpine, Marco Polo traveled beyond Karakorum and visited China.",
  "genres": [
    "History",
    "Nonfiction",
    "Travel",
    "Medieval",
    "Asia"
  ],
  "author": "Giovanni da Pian del Carpine",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/679551.The_Story_of_the_Mongols_Whom_We_Call_the_Tartars"
}