{
  "title": "The Happy Hollisters and the Haunted House Mystery",
  "description": "The Happy Hollisters and the Haunted House Mystery (#21 in the Happy Hollisters series)GHOST HUNTER WANTED TO RID A HAUNTED HOUSE OF SPOOKS! APPLY MRS. NEELEY. THE ANTIQUE HOUSE. Their curiosity aroused over this unusual advertisement, Pete and Pam Hollister visit Mrs. Neeley to apply for the job. At first, they think the elderly lady is imagining things when she tells them that the spinning wheel sings and the grandfather clock strikes thirteen. However, they quickly change their minds when they see a light flickering in one of the windows and hear frightening cries coming from the old mansion. Running from the house that night, Pam loses her shoe in a tangled shrub. When she returns with the other members of the Shoreham Detective Club, they cannot find the shoe nor any clue to its whereabouts. Instead, they spot a stranger watching the Antique House. Pete later catches the same man watching the Hollister home and suddenly the family finds itself involved in another mystery almost as baffling as the one surrounding the Antique House.How the Hollisters cleverly hunt down the “ghosts” hidden in the haunted house provides a thrilling climax to an adventure filled with danger, fun, and excitement.First published in 1962, this charming mystery-adventure story, faithfully reproduced, is now available in paperback and eBook for the first time! Written for boys and girls between the ages of six and twelve, The Happy Hollisters are wholesome books, with an accent on humor and good, clean fun. Integrity always pays off and right wins over wrong. This is a perfect gift for the young reader in your life. Parents, grandparents, and teachers love these books for their healthy celebration of life in simpler times. Kids are thrilled with the fast-paced action and will not want to put them down. The action-packed illustrations make the story – and the Hollister family – so vivid that the reader has a feeling of really sharing in on the adventures of this lovable and interesting family.",
  "genres": [
    "Mystery",
    "Fiction",
    "Childrens",
    "Middle Grade",
    "Classics",
    "Chapter Books",
    "Juvenile"
  ],
  "author": "Jerry  West",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/679969.The_Happy_Hollisters_and_the_Haunted_House_Mystery"
}