{
  "title": "رحلة ابن فضلان إلى بلاد الترك والروس والصقالبة",
  "description": "أقدم وصف أجنبي لروسيا كتبه بن فضلان عام 921-924م. فقد زار أحمد بن فضلان روسيا برسالة من الخليفة العباسي إلى ملك الصقالبة.ما زال الالتباس والادعاء يكتنفان واحدة من أهم رحلات الحوار الحضاري في العصور الوسطى. ففي عام 921 (309هـ) خرجت من بغداد -عاصمة النور آنذاك- بعثة دينية سياسية بتكليف من الخليفة العباسي \"المقتدر بالله\" إلى قلب القارة الآسيوية فى مكان عُرف وقتها باسم \"أرض الصقالبة\"؛ تلبية لطلب ملكهم في التعريف بالدين الإسلامي، عله يجد إجابة للسؤال المثار وقتها \"كيف استطاع ذلك الدين الآتي من قلب الصحراء أن يكوِّن تلك الإمبراطورية الضخمة التي لم تضاهها سوى إمبراطورية لإسكندر المقدوني؟ وفي بغداد كان أعضاء البعثة يرتبون أوراقهم بين فقيه ورجل دولة ومؤرخ، وفي مقدمتهم كان الرجل الموسوعي أحمد بن فضلان.حول الرحالة ورحلته لم يكن ابن فضلان رجلا موهوبا أو صاحب رؤية سياسية فحسب؛ بل كان قد درب عينيه الثاقبتين على رؤية ما وراء المشاهد المفردة، وشاغل عقله بالتحليل دون الرصد. وحينما عمل لعقد من الزمان الساعد الأيمن للقائد العسكري محمد بن سليمان -الذي قاد في نهاية القرن التاسع وبداية القرن العاشر الميلاديين حملات عسكرية امتدت من مصر في الغرب إلى حدود الصين في الشرق- تعلم ابن فضلان الكثير، وأهلته معارفه المتراكمة وثقافته بالشعوب التي خالطها إلى الوصول إلى بلاط السلطان \"المقتدر بالله\" كرجل دولة وفقيه عالم.ويستمر ابن فضلان في الترقي في بلاط السلطان حتى عام 921م، حينما وصلت رسالة قيصر البلغار \"ألموش بن يلطوار\" طلبا لإرسال سفارة إلى القيصرية البلغارية لشرح مبادئ الإسلام، على أن يرسل الخليفة من يبني للقيصر مسجدا يطل من محرابه على شعبه، وقلعة حصينة لمجابهة الأعداء، فاختاره الخليفة على رأس الرحلة تقديرا لمكانته وقدرته على الحوار (هذا وتنتشر في المعالجة الغربية رواية أن اختيار ابن فضلان جاء تخلصا منه، وطمعا في فتاة كان قد أوشك على الزواج بها!).ويعترف الغربيون بفضل الرحلة في تدوين اكتشافات حضارية نادرة، ويسطّرون اسم ابن فضلان بحروف بارزة في تاريخ التواصل الحضاري بين الإسلام و\"الآخر\"، ويؤكدون أنها نقلة نوعية في فن كتابة الرحلة العربية التي كانت غارقة في مفاهيم السرد، فنقلتها إلى مستوى التحليل الإثنوغرافي لشعوب وقبائل لم يكن العرب يعرفون عنها شيئا.. بل لم يكن العالم يعرف عنها شيئا",
  "genres": [
    "History",
    "Travel",
    "Nonfiction",
    "Classics",
    "Islam",
    "Medieval",
    "Russia"
  ],
  "author": "Ahmad ibn Fadlān",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/6798414"
}