{
  "title": "Windhaven",
  "description": "George R. R. Martin has thrilled a generation of readers with his epic works of the imagination, most recently the critically acclaimed New York Times bestselling saga told in the novels A Game of Thrones, A Clash of Kings, and A Storm of Swords. Lisa Tuttle has won acclaim from fans of science fiction, horror, and fantasy alike— most recently for her haunting novel The Pillow Friend. Now together they gift readers with this classic tale of a brilliantly rendered world of ironbound tradition, where a rebellious soul seeks to prove the power of a dream.The planet of Windhaven was not originally a home to humans, but it became one following the crash of a colony starship. It is a world of small islands, harsh weather, and monster-infested seas. Communication among the scattered settlements was virtually impossible until the discovery that, thanks to light gravity and a dense atmosphere, humans were able to fly with the aid of metal wings made of bits of the cannibalized spaceship.Many generations later, among the scattered islands that make up the water world of Windhaven, no one holds more prestige than the silver-winged flyers, who bring news, gossip, songs, and stories. They are romantic figures crossing treacherous oceans, braving shifting winds and sudden storms that could easily dash them from the sky to instant death. They are also members of an increasingly elite caste, for the wings—always in limited quantity—are growing gradually rarer as their bearers perish.With such elitism comes arrogance and a rigid adherence to hidebound tradition. And for the flyers, allowing just anyone to join their cadre is an idea that borders on heresy. Wings are meant only for the offspring of flyers—now the new nobility of Windhaven. Except that sometimes life is not quite so neat.Maris of Amberly, a fisherman's daughter, was raised by a flyer and wants nothing more than to soar on the currents high above Windhaven. By tradition, however, the wings must go to her stepbrother, Coll, the flyer's legitimate son. But Coll wants only to be a singer, traveling the world by sea. So Maris challenges tradition, demanding that flyers be chosen on the basis of merit rather than inheritance. And when she wins that bitter battle, she discovers that her troubles are only beginning.For not all flyers are willing to accept the world's new structure, and as Maris battles to teach those who yearn to fly, she finds herself likewise fighting to preserve the integrity of a society she so longed to join—not to mention the very fabric that holds her culture together.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Audiobook",
    "Adventure",
    "High Fantasy"
  ],
  "author": "George R.R. Martin",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/67957.Windhaven"
}