{
  "title": "Night Marchers",
  "description": "This special edition of Night Marchers was recently professionally edited. It includes newly edited scenes, a special Kai P.O.V., the first chapter of the sequel: Redemption, the first chapter of the first book in our new apocalyptic series: Project ELE and more!  This new Young Adult paranormal series will have you averting your eyes for years to come!  NEVER, EVER lock eyes with a Night Marcher! Everyone in Hawaii has heard this warning, except for seventeen-year-old Emma Townsend that is. For most Hawaiians know that looking into the eyes of Night Marcher can strike a curse that will end in death or eternal servitude.  Even though her father, who is a paranormal investigator, solely raised Emma, she has little experience in the realm of the supernatural. When she is forced to move with her father to Hawaii, only months before her graduation, Emma finds that her world as she knows it, is shaken when she starts seeing the unexplainable: fire balls in the distance, beating drums in the middle of nowhere and strangers who vanish into thin air. Then one day when she has a run in with a procession of Night Marchers, ancient Hawaiian spirits wandering from their burial grounds to their locations of battles past, Emma has no choice but to believe that the unbelievable does exist.  Now Emma must go on the run with the help of a mysterious stranger, as they seek out how to free Emma from the curse of a Night Marcher, who will stop at nothing to get her soul.  *We hope you enjoy this new edition of our best selling free book, which has had more than 100,000 downloads.  Praises for Night Marchers:  \"I read books but this one took me on a wild roller coaster ride of emotions. It is a hard book to put down. Be prepared to be up late reading! Can't wait to read the next book!\" ~Marella4  \"The story is original, thrilling, includes several twists in the romance department, and in the supernatural content as well.\" ~Sally  \"I am always interested in things based in some kind of paranormal \"truth\" and this story didn't fail to impress with the authors obviously having taken a great deal of time to do their research. By the time I got to the end I could not wait to pick up the second one and see where the story went.\" ~Chantress",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Fantasy",
    "Romance",
    "Magic",
    "Paranormal Romance",
    "Mythology"
  ],
  "author": "Rebecca Gober",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/12993500-night-marchers"
}