{
  "title": "Manchester 6",
  "description": "Praise for Manchester 6“Darkly funny, muscular prose with stark imagery. A must read.” – Richard Godwin, author of Apostle Rising.“Top selection filled with dark humour, pathos and gritty action.” – Matt Hilton, author of the Joe Hunter thriller series.“Snappy and powerful with realistic characters.” – Nick Quantrill, author of Broken Dreams.“Col Bury’s Manchester 6 may well be the epitome of Brit Grit.” – Paul D Brazill, widely published British noir writer.Product DescriptionManchester 6 focuses on the best and worst of human nature, personified in the gritty urban setting of Manchester, UK. It features a plethora of no-nonsense characters you’d ordinarily want to avoid. The six stories highlight generally decent folk who become embroiled with the lower echelons of society, aka scumbags. Whether it’s the paranoid, spliff-sucking writer who has an online spat, or an ex-soldier hunting a notorious gang, there’s conflict galore. Meanwhile, hell hath no fury, like a window cleaner ripped-off of his Christmas tips, and a heroic family man faces Al Qaeda and the decision of his life. When you add to the mix, the luckiest gambler in town having a ball, coked up in a lap-dancing club, and an eccentric ice cream van owner who pushes ‘friendship’ beyond the limit, you know something’s got to give, and, boy, does it! This collection oozes dark wit and has more twists and turns than a snake on speed. About the authorCol Bury was born and raised in Manchester, UK, and is the crime editor of award winning ezine, Thrillers, Killers ‘n’ Chillers. His short stories can be found in many anthologies, including, The Mammoth Book of Best British Crime 9. His fiction is scattered around the blogosphere, at the likes of A Twist Of Noir and The Flash Fiction Offensive. A New York agent enjoyed Col’s online stories so much that they’re now working together developing his crime novel series. When he’s not working, being a daddy, writing, reading or editing, Col shoots pool or watches his beloved Manchester City FC.",
  "genres": [],
  "author": "Col Bury",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/12993203-manchester-6"
}