{
  "title": "The Collaborators: Three Stories of Deception and Survival in World War II",
  "description": "'A multiple biography with overlapping chronology is a tricky feat and Buruma pulls it off magnificently.' Ben Macintyre, The Times On the face of it, the three characters here seem to have little in common - aside from the fact that each committed wartime acts that led some to see them as national heroes, and others as villains. All three were mythmakers, larger-than-life storytellers, for whom the truth was beside the point.  Felix Kersten was a plump Finnish pleasure-seeker who became Heinrich Himmler's indispensable personal masseur - Himmler calling him his 'magic Buddha'. Kersten presented himself after the war as a resistance hero who convinced Himmler to save countless people from mass murder. Kawashima Yoshiko, a gender fluid Manchu princess, spied for the Japanese secret police in China, and was mythologized by the Japanese as a heroic combination of Mata Hari and Joan of Arc. Friedrich Weinreb was a Hasidic Jew in Holland who took large amounts of money from fellow Jews in an imaginary scheme to save them from deportation, while in fact betraying some of them to the German secret police. Sentenced after the war as a traitor and a con artist, he is still regarded by supporters as the 'Dutch Dreyfus'. All three figures have been vilified and mythologized, out of a never-ending need, Ian Buruma argues, to see history, and particularly war, and above all World War II, as a neat tale of angels and devils. In telling their often-self-invented stories, The Collaborators offers a fascinating reconstruction of what in fact we can know about these fantasists and what will always remain out of reach. It is also an examination of the power and credibility of truth is always a relative concept but perhaps especially so in times of political turmoil, not unlike our own.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Japan",
    "China",
    "War",
    "Asia"
  ],
  "author": "Ian Buruma",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/68052215-the-collaborators"
}