{
  "title": "The Winds of Marble Arch and Other Stories",
  "description": "\"Variety is the soul of pleasure,\" And variety is what this comprehensive new collection of Connie Willis is all about. The stories cover the entire spectrum, from sad to sparkling to terrifying, from classics to hard-to-find treasures with everything in between -- orangutans, Egypt, earthworms, roast goose, college professors, mothers-in-law, aliens, secret codes, Secret Santas, tube stations, choir practice, the post office, the green light on Daisy's dock, weddings, divorces, death, and assorted plagues, from scarlet fever to \"It's a Wonderful Life.\" And a dog. Famous for her \"sure-hand plotting, unforgettable characters, and top-notch writing,\" Willis has been called, \"the most relentlessly delightful science fiction writer alive,\" and there are numerous examples here. Among them, Willis's most famous stories -- the Hugo- and Nebula-Award-winning \"Fire Watch\" and \"Even the Queen\" and \"The Last of the Winnebagos\" -- along with undiscovered gems like Willis's heartfelt homage to Jack Williamson, \"Nonstop to Portales.\" Her magical Christmas stories are here, too, from \"Newsletter\" to \"Just Like the Ones We Used to Know...\" which last year was made into the TV movie, Snow Wonder, starring Mary Tyler Moore. We've collected stories from throughout Willis's career, from early ones like \"Cash Crop\" and \"Daisy, in the Sun,\" right up to her newest stories, including the wonderful \"The Winds of Marble Arch.\" There's literally something for everyone here. If you're a diehard Willis fan, you'll be delighted with hard-to-find treasures like the until-now uncollected, \"The Soul Selects Her Own Society...\" If you've never read Connie Willis, this is your chance to discover \"A Letter from the Clearys\" and, well, \"Chance.\" To say nothing of, \"At the Rialto,\" the funniest story ever written about quantum physicists. And Willis's chilling, \"All My Darling Daughters.\" And...oh, there are too many great stories here to list and pleasures galore. So enjoy!",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fantasy",
    "Fiction",
    "Time Travel",
    "Science Fiction Fantasy",
    "Anthologies"
  ],
  "author": "Connie Willis",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/68010.The_Winds_of_Marble_Arch_and_Other_Stories"
}