{
  "title": "The New Atheism: Taking a Stand for Science and Reason",
  "description": "In recent years a number of bestselling books have forcefully argued that belief in God can no longer be defended on rational or empirical grounds, and that the scientific worldview has rendered obsolete the traditional beliefs held by Christianity, Judaism, and Islam. The authors of these books―Richard Dawkins, Daniel Dennett, Sam Harris, Christopher Hitchens, and Victor J. Stenger―have come to be known as the \"New Atheists.\" Predictably, their works have been controversial and attracted a good deal of critical reaction.In this new book, Victor J. Stenger, whose The Failed Hypothesis was on the New York Times bestseller list in 2007, reviews and expands upon the principles of New Atheism and answers many of its critics. He demonstrates in detail that naturalism―the view that all of reality is reducible to matter and nothing else―is sufficient to explain everything we observe in the universe, from the most distant galaxies to the inner workings of the brain that result in the phenomenon of mind. Stenger disputes the claim of many critics that the question of whether God exists is beyond the ken of science. On the contrary, he argues that absence of evidence for God is, indeed, evidence of absence when the evidence should be there and is not.Turning from scientific to historical evidence, Stenger then points out the many examples of evil perpetrated in the name of religion. He also notes that the Bible, which is still taken to be divine revelation by millions, fails as a basis for morality and is unable to account for the problem of unnecessary suffering throughout the world.Finally, he discusses the teachings of ancient nontheist sages such as Buddha, Lao Tzu, and Confucius, whose guidelines for coping with the problems of life and death did not depend upon a supernatural metaphysics. Stenger argues that this \"way of nature\" is far superior to the traditional supernatural monotheisms, which history shows can lead to a host of evils.The New Atheism is a well-argued defense of the atheist position and a strong rebuttal of its critics.",
  "genres": [
    "Religion",
    "Atheism",
    "Science",
    "Philosophy",
    "Nonfiction",
    "Skepticism",
    "Physics"
  ],
  "author": "Victor J. Stenger",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/6814897-the-new-atheism"
}