{
  "title": "Monolithos: Poems, 1962 and 1982",
  "description": "This is Jack Gilbert's first book since the now-legendary Views of Jeopardy appeared as the 1962 entry in the Yale Series of Younger Poets. Beat poetry was much in vogue at the time, a discursive poetry that rages against things as they are. Perhaps it was for this reason the strict compression of Jack Gilbert's work and its celebration of an ideal of romantic love caused such a sensation. The Times declared him \"one of the most exciting voices of the second half of our centruy.\" Standley Kunitz called him \"a civilization and an artist.\" There was praise from other notable poets—Stephen Spender, Muriel Rukeyser, and Theodore Roethke among them—such considerable praise that a nationwide tour was arranged. Gilbert set aside his solitary life abroad and returned to the United States to speak to the audience that now awaited him, so arousing those who came to hear him that only the readings offered by Dylan Thomas a decade earlier might be seen in the same exceptional light. But at the conclusion of that tour, Gilbert vanished—back to Italy, Greece, Japan—entering a silence that lasted twenty years and which now ends with the oublication of Monolithos , a selection of new work and of some of the poems first seen in Views of Jeopardy . These are poems about lust, how it succeeds, how it fails—not as the succumbing to desire, nor the getting of flesh, but as the honoring of the impulse to know, to possess \"the great knowledge of breasts with their loud nipples,\" to know everything that a man might know of a woman \"in all her fresh particularity of difference.\" Often harsh in their expression, and always rigorous in their displeasure with what is ornamental and easy, Gilbert's poems speak with the stern syntax of the mind, and yet their text is the ways of the heart, the effort to master a passion too great to be encompassed, to subdue it with the instrument of language, to claim the primacy of \"what abounds, what times there are, my fine house that love is.\" What issues from this concern is a poetry of the severest modulation and of an obsessive will for the exact—a poetry that is astringent, illuminated, and of the first importance.",
  "genres": [
    "Poetry",
    "20th Century"
  ],
  "author": "Jack Gilbert",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/682327.Monolithos"
}