{
  "title": "Play = Learning: How Play Motivates and Enhances Children's Cognitive and Social-Emotional Growth",
  "description": "Why is it that the best and brightest of our children are arriving at college too burned out to profit from the smorgasbord of intellectual delights that they are offered? Why is it that some preschools and kindergartens have a majority of children struggling to master cognitive tasks that are inappropriate for their age? Why is playtime often considered to be time unproductively spent?In Play=Learning , top experts in child development and learning contend that the answers to these questions stem from a single in the rush to create a generation of Einsteins, our culture has forgotten about the importance of play for children's development. Presenting a powerful argument about the pervasive and long-term effects of play, Singer, Golinkoff, and Hirsh-Pasek urge researchers and practitioners to reconsider the ways play facilitates development across domains. Over forty years of developmental research indicates that play has enormous benefits to offer children, not the least of which is physical activity in this era of obesity and hypertension. Play provides children with the opportunity to maximize their attention spans, learn to get along with peers, cultivate their creativity, work through their emotions, and gain the academic skills that are the foundation for later learning. Using a variety of methods and studying a wide range of populations, thecontributors to this volume demonstrate the powerful effects of play in the intellectual, social, and emotional spheres.Play=Learning will be an important resource for students and researchers in developmental psychology. Its research-based policy recommendations will be valuable to teachers, counselors, and school psychologists in their quest to reintroduce play and joyful learning into our school rooms and living rooms.",
  "genres": [
    "Parenting",
    "Education"
  ],
  "author": "Dorothy G. Singer",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/682205.Play_Learning"
}