{
  "title": "Legacy of a False Promise: A Daughter's Reckoning",
  "description": "The compelling story of a teenage girl caught up in the throes of the McCarthy era.Margaret Fuchs was thirteen in June 1955 when she learned that her parents had been Communists while working for the U.S. government in the 1930s and '40s. This book chronicles the years during which her parents were exposed and her father was subpoenaed before the House Un-American Activities Committee. Eventually he named names, and subsequently lost his job as a law professor at American University, and was blacklisted from teaching ever again. Legacy of a False Promise also details the author's quest as an adult to learn whether or not her parents ever spied for the Soviet Union.Based on eight years of research using family records, FBI files, American University archives, personal interviews, and the recently declassified Venona cables, Legacy of a False Promise offers unique insights into the McCarthy Era. Most \"red-diaper babies\" who have written on the subject had parents who refused to give in to HUAC's demands. Singer's work instead recounts the shame and series of betrayals that her father's decision to name names brought to her family. Furthermore, it explores the campaign of the liberal anti-Communist movement to publicize its political position while defending a fired ex-Communist professor, the nature and activities of secret Communist underground cells, and the motivation of New Deal government workers who spied for the Soviets.This is a poignant meditation on family secrets, father-daughter relationships in times of crisis, teenage loneliness in the midst of trauma, and the effects of parents' actions on the lives of their children. It also serves as a timely reminder of the dangers of sacrificing civil liberties in the name of national security.",
  "genres": [],
  "author": "Margaret Fuchs Singer",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/6831480-legacy-of-a-false-promise"
}