{
  "title": "The Rhythm of Life: Living Every Day with Passion and Purpose",
  "description": "Do you ever feel that if you weren't so busy you would be happier, healthier, more effective, more fulfilled...and maybe even a better person?  Once every twenty-five years or so, a book comes along that perfectly identifies our common search and struggle for happiness, and teaches us how to find lasting fulfillment in a changing world. This is that book. Not since M. Scott Peck published The Road Less Traveled have we experienced a voice as refreshing and authentic as Matthew Kelly's.  The Rhythm of Life will help you to bring into focus who you are and why you are here. Through this book Matthew Kelly will help you discover your legitimate needs, deepest desires, and unique talents. He will introduce you to the-best-version-of-yourself and lead you to a life filled with passion and purpose.  Here are just a few of the timeless creeds that he presents in The Rhythm of Life...  \"You were born to become the-best-version-of-yourself. This is your essential purpose. Embrace this one solitary truth and it will change your life more than anything you have ever learned. In every situation, ask yourself, Which of the options before me will help me become the-best-version-of-myself?\"  \"Everything is a choice. This is life's greatest truth and its hardest lesson. It is a great truth because it reminds us of our power. Not power over others, but the power to be ourselves and to live the life we have imagined. It is a hard lesson because it causes us to realize that we have chosen the life we are living right now.\"  \"The measure of your life will be the measure of your courage. Courage animates us, brings us to life, and makes everything else possible. Fear stops more people from doing something with their lives than lack of ability, contacts, resources, or any other single variable. Fear paralyzes the human spirit. Life takes courage.\"  \"Energy is our most valuable resource, not time. The rhythm of life is a way of life that brings our legitimate needs, our deepest desires, and our unique talents into harmony with each other. The result: passion, purpose, and energy.\"  Kelly has a way of thinking and writing that cuts through the stifling clutter of our everyday lives and delivers a clarity that is both refreshing and liberating.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Spirituality",
    "Religion",
    "Christian",
    "Catholic"
  ],
  "author": "Matthew Kelly",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/684383.The_Rhythm_of_Life"
}