{
  "title": "Shakespeare, Sex, and Love",
  "description": "Here is a lively look at how Shakespeare's treatment of human sexuality in his plays and poems relates to the sexual conventions, sexual mores, and actual sexual behaviors of his day.Pre-eminent Shakespeare critic Stanley Wells draws on historical and anecdotal sources to present an illuminating account of sexual behavior--and its consequences--in Shakespeare's time, particularly in Stratford-upon-Avon and London. Shakespeare's Stratford was a hotbed of small-town gossip; the town's records reveal many cases of slander involving accusations of cuckoldry and whoredom, as well as many prosecutions for fornication, sexual \"incontinence,\" and adultery. Wells thoroughly explores this milieu, demonstrating what we know or can deduce of the sex lives of Shakespeare and members of his family and providing a fascinating account of depictions of sexuality in the poetry of the period. Wells even points to specific recorded events that find their way into lines and subplots in the plays.In the second half of the book, Wells goes on to explore the variety of ways in which Shakespeare treats sexuality in his plays and how he relates sexuality to love. Chapters cover everything from the fun that Shakespeare gets out of sex in his comedies; to the ways he relates sexual desire to both lust and love; to sexual jealousy in four major plays; and to Romeo and Juliet as the play in which Shakespeare focuses most centrally on issues relating to sex, love, and the relationship between them. \"Whores and Saints\" looks at his portrayals of the extremes of womanhood, and a final chapter, \"Just Good Friends,\" investigates his depiction of same-gender relationships.Whether as a source of comedy, drama, debate, or passion, sex in Shakespeare's plays and poems is always intriguing, and there is no better guide to this subject than Stanley Wells.",
  "genres": [
    "Nonfiction",
    "Literary Criticism",
    "History",
    "Sexuality"
  ],
  "author": "Stanley Wells",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/6839400-shakespeare-sex-and-love"
}