{
  "title": "Making the American Self: Jonathan Edwards to Abraham Lincoln",
  "description": "Originally published in 1997 and now back in print, Making the American Self by Daniel Walker Howe, the Pulitzer Prize-winning author of What Hath God Wrought , charts the genesis and fascinating trajectory of a central idea in American history.One of the most precious liberties Americans have always cherished is the ability to \"make something of themselves\"--to choose not only an occupation but an identity. Examining works by Benjamin Franklin, Jonathan Edwards, Abraham Lincoln, Frederick Douglass, Henry David Thoreau, Ralph Waldo Emerson, Margaret Fuller, and others, Howe investigates how Americans in the 18th and 19th centuries engaged in the process of \"self-construction,\" \"self-improvement,\" and the \"pursuit of happiness.\" He explores as well how Americans understood individual identity in relation to the larger body politic, and argues that the conscious construction of the autonomous self was in fact essential to American democracy--that it both shaped and was in turn shaped by American democratic institutions. \"The thinkers described in this book,\" Howe writes, \"believed that, to the extent individuals exercised self-control, they were making free institutions--liberal, republican, and democratic--possible.\" And asthe scope of American democracy widened so too did the practice of self-construction, moving beyond the preserve of elite white males to potentially all Americans. Howe concludes that the time has come to ground our democracy once again in habits of personal responsibility, civility, and self-discipline esteemed by some of America's most important thinkers.Erudite, beautifully written, and more pertinent than ever as we enter a new era of individual and governmental responsibility, Making the American Self illuminates an impulse at the very heart of the American experience.",
  "genres": [
    "History",
    "Philosophy",
    "Biography",
    "Nonfiction",
    "Politics",
    "Education",
    "19th Century"
  ],
  "author": "Daniel Walker Howe",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/6835278-making-the-american-self"
}