{
  "title": "Desert Exile: The Uprooting of a Japanese American Family",
  "description": "In the spring of 1942, shortly after the United States entered into war with Japan, the federal government initiated a policy whereby 110,000 persons of Japanese ancestry were rounded up and herded into camps. They were incarcerated without indictment, trial, or counsel - not because they had committed a crime, but simply because they resembled the enemy. There was never any evidence of disloyalty or sabotage among them, and the majority were American citizens. The government's explanation for this massive injustice was military necessity.Desert Exile tells the story of one family who lived through these sad years. It is a moving personal account by a woman who grew up in Berkeley and was attending the University of California when the war began.To better unerstand how such a gross violation of human rights could have occurred in America, and how the Japanese reacted to it, the author takes a backward look at her parents' early years in this country and her own experiences as a Nisei growing up in California. She evokes the strong anti-Asian climate of the years preceding the war, and provides an intimate glimpse of life in one Japanese American household.With the attack on Pearl Harbor, everything changed in Yoshiko Uchida's life. She tells of her father's abrupt seizure by the FBI; one of the family's frantic efforts to vacate their home on ten days notice; of being forced to live in a horsestall, deprived of every human privacy; and of being sent on to a bleak camp in the Utah desert, ringed by barbed wire and armed guards and plagued by terrifying dust storms.But this is not simply an account of the day-to-day life in the Tanforan and Topaz concentration camps where the author lived; it is also the story of the courage and strength displayed by the incarcerated Japense. In particular, it is about the Issei (first generation immigrants) who, having already endured so much in a hostile society, still retained a remarkable resiliency of spirit as they established a sense of community, saw to the education of their children, and tried to live productive lives even behind barbed wire.This is a beautifully crafted book, written with clarity, conviction, and insight. It should be read by all Americans so they will know and never forget what once happened in this country, and through that knowledge will never allow such a travesty of justice to happen again.Replaced by ISBN 9780295994758",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "Historical",
    "Biography",
    "Japan"
  ],
  "author": "Yoshiko Uchida",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/68410.Desert_Exile"
}