{
  "title": "Future Cook: A Taste of Things to Come",
  "description": "\"By growing or buying good things and cooking them well you, and your neighbour, can effect the small but collectively crucial changes that could take the human race, and its fellow creatures, safely through the twenty-first century. People often ask me, when I proselytise in public places: 'but what can I do?' Cook, is the answer. Cook with knowledge. Cook and evangelize.\"Future Cook is for everyone who is interested in food - cooks, environmentalists and those who just enjoy eating. Written by Colin Tudge, a scientist with a lifelong love of good cooking, the book explains how we can rethink our eating habits and at the same time make delicious dishes, full of flavour and interest.In the past two decades, nutritional theory has come on apace: recommended protein intake has been radically reduced, attitudes to fats have become more subtle and intricate, and unrefined carbohydrates (or the fibre they contain) have achieved major significance. Our cuisine should be guided by these emerging nutritional principles and we should demand of our food that it neither debilitates us nor shortens our lives.Future Cook shows that eating healthily need in no way conflict with eating well. A sensible diet lays a foundation which the occasional indulgence (a pleasure not to be scorned) cannot destroy. Colin Tudge's recipes are examples of the kind of dishes that are examples of the kind of dishes that are both good to eat and good for you.Future Cook takes these new theories right into our kitchens and explains what the priorities should be when planning our meals. More than two hundred recipes, chosen from many cuisines, show that we can indulge in splendidly varied meals in spite of a changing world. Thirty-two pages of four-colour photographs illustrate the author's original and delightful recipes.Future Cook is the first of a new generation of cookbooks.Contains index and bibliography.",
  "genres": [],
  "author": "Colin Tudge",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/6851673-future-cook"
}