{
  "title": "Study of Revenge",
  "description": "\"Study of Revenge,\" the sequel to the New York Times best-seller \"Saddam Hussein and the Crisis in the Gulf,\" co-authored by Laurie Mylroie and Judith Miller, exposes the threat Saddam Hussein still poses to Americans and challenges the Clinton administration to explain why it has obscured that threat. The Gulf War never ended for Saddam Hussein. He had already recovered sufficiently by 1993 to undertake a campaign of terror, of which only the first two acts were planned in the January shootings outside CIA headquarters in Virginia and the February bombing of one tower of the World Trade Center in New York, in an attempt to topple it against its twin. \"Study of Revenge\" is, first of all, the story of the Trade Center bombing. Mylroie contends that the mastermind behind the bombing was an Iraqi intelligence agent, Ramzi Yousef, who escaped and left behind the Muslim fundamentalists who participated in the plot and were meant to be caught. She argues that the Clinton administration's mishandling of the event led to the emergence of a fraudulent and dangerous theory about Middle East terrorism--that it is no longer primarily state-sponsored but is carried out by individuals or \"loose networks.\" The misunderstanding is particularly dangerous in light of the prospects for biological terrorism. In addition to her account of events around the bombing, Mylroie describes how Saddam Hussein has steadily regained strength and eroded the system of postwar constraints that were supposed to hold him in check. She suggests that because of the proscribed unconventional-weapons capabilities Saddam retained in violation of the Gulf War cease-fire--and without the check of U.N. weapons inspectors--he is far more dangerous than is generally recognized. Mylroie bases her case on a meticulous analysis of the government's evidence in the terrorism trials that followed the Trade Center bombing. Her book is written as a detective story, and the reader is invited to conduct the investigation into state sponsorship of the terrorism that the U.S. government failed to conduct.",
  "genres": [
    "Terrorism"
  ],
  "author": "Laurie Mylroie",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/6855929-study-of-revenge"
}