{
  "title": "100 Suns",
  "description": "Between July 1945 and November 1962 the United States is known to have conducted 216 atmospheric and underwater nuclear tests. After the Limited Test Ban Treaty between the United States and the Soviet Union in 1963, nuclear testing went underground. It became literally invisible—but more the United States conducted a further 723 underground tests, the last in 1992. 100 Suns documents the era of visible nuclear testing, the atmospheric era, with one hundred photographs drawn by Michael Light from the archives at Los Alamos National Laboratory and the U.S. National Archives in Maryland. It includes previously classified material from the clandestine Lookout Mountain Air Force Station based in Hollywood, whose film directors, cameramen and still photographers were sworn to secrecy.The title, 100 Suns , refers to the response by J.Robert Oppenheimer to the world’s first nuclear explosion in New Mexico when he quoted a passage from the Bhagavad Gita, the classic Vedic “If the radiance of a thousand suns were to burst forth at once in the sky, that would be like the splendor of the Mighty One . . . I am become Death, the destroyer of worlds.” This was Oppenheimer’s attempt to describe the otherwise indescribable. 100 Suns likewise confronts the indescribable by presenting without embellishment the stark evidence of the tests at the moment of detonation. Since the tests were conducted either in Nevada or the Pacific the book is simply divided between the desert and the ocean. Each photograph is presented with the name of the test, its explosive yield in kilotons or megatons, the date and the location. The enormity of the events recorded is contrasted with the understated neutrality of bare data. Interspersed within the sequence of explosions are pictures of the awestruck witnesses.The evidence of these photographs is terrifying in its implication while at same time profoundly disconcerting as a spectacle. The visual grandeur of such imagery is balanced by the chilling facts provided at the end of the book in the detailed captions, a chronology of the development of nuclear weaponry and an extensive bibliography. A dramatic sequel to Michael Light’s Full Moon , 100 Suns forms an unprecedented historical document.",
  "genres": [
    "Photography",
    "History",
    "Art",
    "Nonfiction",
    "Science",
    "Physics",
    "Technology"
  ],
  "author": "Michael Light",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/685244.100_Suns"
}