{
  "title": "Hollywood Bloodshed: Violence in 1980s American Cinema",
  "description": "In Hollywood Bloodshed , James Kendrick presents a fascinating look into the political and ideological instabilities of the 1980s as studied through the lens of cinema violence. Kendrick uses in-depth case studies to reveal how dramatic changes in the film industry and its treatment of cinematic bloodshed during the Reagan era reflected shifting social tides as Hollywood struggled to find a balance between the lucrative necessity of screen violence and the rising surge of conservatism. As public opinion shifted toward the right and increasing emphasis was placed on issues such as higher military spending, family values, and “money culture,” film executives were faced with an epic the violent aspects of cinema that had been the studios’ bread and butter were now almost universally rejected by mainstream audiences. Far from eliminating screen bloodshed altogether, studios found new ways of packaging violence that would allow them to continue to attract audiences without risking public outcry, ushering in a period of major transition in the film industry. Studios began to shy away from the revolutionary directors of the 1970s—many of whom had risen to fame through ideologically challenging films characterized by a more disturbing brand of violence—while simultaneously clearing the way for a new era in film. The 1980s would see the ascent of entertainment conglomerates and powerful producers and the meteoric rise of the blockbuster—a film with no less violence than its earlier counterparts, but with action-oriented thrills rather than more troubling images of brutality. Kendrick analyzes these and other radical cinematic changes born of the conservative social climate of the 1980s, including the disavowal of horror films in the effort to present a more acceptable public image; the creation of the PG-13 rating to designate the gray area of movie violence between PG and R ratings; and the complexity of marketing the violence of war movies for audience pleasure. The result is a riveting study of an often overlooked, yet nevertheless fascinating time in cinema history. While many volumes have focused on the violent films of the New American Cinema directors of the 1970s or the rise of icons such as Woo, Tarantino, and Rodriguez in the 1990s, Kendrick’s Hollywood Bloodshed bridges a major gap in film studies. This comprehensive volume offers much-needed perspective on a decade that altered the history of Hollywood—and American culture—forever.",
  "genres": [
    "Film"
  ],
  "author": "James Kendrick",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/6852182-hollywood-bloodshed"
}