{
  "title": "Eagle Against the Sun: The American War with Japan",
  "description": "“The best book by far on the Pacific War” ( The New York Times Book Review ), this classic one-volume history of World War II in the Pacific draws on declassified intelligence files; British, American, and Japanese archival material; and military memoirs to provide a stunning and complete history of the conflict.This “superbly readable, insightful, gripping” ( Washington Post Book World ) contribution to WWII history combines impeccable research with electrifying detail and offers provocative interpretations of this brutal forty-four-month struggle. Author and historian Ronald H. Spector reassesses US and Japanese strategy and shows that the dual advance across the Pacific by MacArthur and Nimitz was more a pragmatic solution to bureaucratic, doctrinal, and public relations problems facing the Army and Navy than a strategic calculation. He also argues that Japan made its fatal error not in the Midway campaign but in abandoning its offensive strategy after that defeat and allowing itself to be drawn into a war of attrition.Spector skillfully takes us from top-secret strategy meetings in Washington, London, and Tokyo to distant beaches and remote Asian jungles with battle-weary GIs. He reveals that the US had secret plans to wage unrestricted submarine warfare against Japan months before Pearl Harbor and shows that MacArthur and his commanders ignored important intercepts of Japanese messages that would have saved thousands of lives in Papua and Leyte. Throughout, Spector contends that American decisions in the Pacific War were shaped more often by the struggles between the British and the Americans, and between the Army and the Navy, than by strategic considerations.Spector vividly recreates the major battles, little-known campaigns, and unfamiliar events leading up to the deadliest air raid ever, adding a new dimension to our understanding of the American war in the Pacific and the people and forces that determined its outcome.",
  "genres": [
    "History",
    "Nonfiction",
    "Military History",
    "World War II",
    "Military Fiction",
    "Japan",
    "War"
  ],
  "author": "Ronald H. Spector",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/685245.Eagle_Against_the_Sun"
}