{
  "title": "Rozijnen met amandelen : bitter en zoet in Joodse anekdotes",
  "description": "De moeder, dochter van Zion, die in het aan velen bekende joodse wiegeliedje ‘Rozijnkes mit Mandlen’, waaraan de titel van dit boek ontleend is, haar kind toezingt dat het later in deze lekkernij zal handelen, spiegelt het haast onmerkbaar de bitterheid in het zoete leven voor.Joodse anekdotes zijn, het spreekt vanzelf, een weerspiegeling van de bijzondere sociale en economische kenmerken van de vroegere joodse gemeenschappen in Oost-Europa: de nood die tot bedelen noopt (de figuur van de ‘Sjnorrer’), de joodse plicht armen bij te staan, de traditionele betekenis van huwelijk en kinderzegen (de ‘sjadchen’), de allesbeheersende rol die de religie en daarmee de ‘rebbe’ of ‘rav’ , de godsdienstleraar, speelt, de functie van de Joden in het economische leven van het land waar zij wonen met de veelal daaraan van buitenaf opgelegde beperkingen, enzovoorts.Dat de humor hierbij een wapen is van een minderheid in een vijandige omgeving, daarover kan men het eens zijn. Maar de joodse anekdote zoals die in zijn oorspronkelijke vorm in de kring van familievaders verteld werd, is wèl te onderscheiden van de later verbasterde, zo verbreide korte joodse witz met zijn pointe die vaak een boosaardig karakter draagt. Bij de laatste soort is de persoon van de jood dan ook object, bij de oorspronkelijke subject van de grap. De verteller van de echte, aloude joodse anekdote haast zich niet naar de pointe, maar schildert breedvoerig en opgesmukt, om het genoegen van het vertellen zelf.De taal waarin deze anekdotes van mond tot mond gingen, het Jiddisj, is, naar alle vertalers verzuchten, niet in de volle rijkdom van zijn uitdrukkingsmogelijkheden weer te geven - daarvoor zijn de taalverschillen te groot. De onderhavige bloemlezing wil een poging zijn de joodse witz in zijn ware gedaante onder de ogen van het lezerspubliek te brengen.",
  "genres": [],
  "author": "Thérèse Cornips",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/12996808-rozijnen-met-amandelen"
}