{
  "title": "Myth Adventures",
  "description": "Books 1-4 in the Myth Adventures series. Includes: Another Fine Myth Myth Conceptions Myth Directions Hit or MythFrom dust jacket: What does a half-trained apprentice magician do when his master is killed while conjuring up a demon - leaving him to face a green, pointy-eared creature with razor-sharp teeth? If the place is Klah and the apprentice is Skeeve, the answer is clear: Set off on a riotous odyssey through a universe where magic and science combine to create more trouble - and more laughs - than man or beast can imagine. Another Fine Myth introduces Skeeve to the green-skinned Aahz, dimension-traveler from Perv, who, it turns out, isn't such a bad fellow after all. Stripped temporarily of his powers, the pointy-eared Pervert (that's Pervect, he insists) offers to complete Skeeve's training and help him track down his master's murderer. The killer, a nasty sort of fellow from the dimension of Imper, is scheming to dominate the universe by controlling all magik. But Aahz and Skeeve, impervious to the Imp's charms, aim to stand in his way. Myth Conceptions finds Skeeve applying for the job of Court Magician in Possiltum. The cushy job Aahz has promised becomes quite something else, however, when Possiltum's tight-fisted rulers give Skeeve his first assignment: stop the virtually invincible army of the invading Empire...singlehanded. In Myth Directions, former Assassin Tanda takes Skeeve on a whirlwind tour of the other dimensions to find the perfect birthday present for her old friend Aahz. They find it on the planet Jahk: an enormous toadlike trophy that is the prize in the annual game between the rival cities of Veygas and Ta-hoe. When they're caught stealing it, Aahz and his teammates must take to the field in one of the zaniest sports competitions of all time - with Tanda's life hanging in the balance. Hit or Myth finds Aahz returning to Perv and Skeeve duped into standing in for a cowardly king wo's about to marry the ruthless, bloodthirsty, promiscuous Queen Hemlock. And with Don Bruce's irate Mob pressing their own impossible demands as well, Skeeve had better think fast.... Join Robert Lynn Asprin's engaging menagerie of wizards, demons, kings, dragons, gremlins, gargoyles and dimension-hopping gangsters. Even the most serious lover of fantasy won't be able to resist the spell of these myths. Jacket art by Walter Velez.",
  "genres": [
    "Fantasy",
    "Humor",
    "Fiction",
    "Anthologies",
    "Science Fiction Fantasy",
    "Speculative Fiction"
  ],
  "author": "Robert Lynn Asprin",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/6859705-myth-adventures"
}