{
  "title": "Understanding Early Civilizations: A Comparative Study",
  "description": "Arising independently in various parts of the world, early civilizations--the first class-based societies in human history--are of importance to social scientists interested in the development of complexity, while their cultural productions fascinate both humanists and the general public. This book offers the first detailed comparative study of the seven most fully documented early civilizations: ancient Egypt and Mesopotamia, Shang China, the Aztecs and their neighbors, the Classic Maya, the Inca, and the Yoruba. Unlike previous studies, equal attention is paid to similarities and differences in their sociopolitical organization, their economic systems, and their religious beliefs, knowledge, art, and values. Many of this study's findings are surprising and provocative. They challenge not only current understandings of early civilizations but also the theoretical foundations of modern archaeology and anthropology. Rival cultural and ecological approaches are demonstrated to be complimentary to one another, while a comprehensive understanding of human behavior is shown to require that more attention be paid to psychology and the neurosciences. Bruce G. Trigger is James McGill Professor in the Department of Anthropology at McGill University. He received his PhD from Yale University and has carried out archaeological research in Egypt and the Sudan. His current interests include the comparative study of early civilizations, the history of archaeology, and archaeological and anthropological theory. He has received various scholarly awards, including the Prix Leon-Gerin from the Quebec government, for his sustained contributions to the social sciences. He is an honarary fellow of the Society of Antiquaries of Scotland and an honarary member of the Prehistoric Society (U.K.). His numerous books include Sociological Evolution (Blackwell, 1998), Early Civilizations: Ancient Egypt in Context (Amer. Univ in Cairo, 1993), A History of Archaeological Thought (Cambridge, 1989), and The Children of Aataentsic: A History of the Huron People to 1660 (McGill-Queens Univ., 1976).",
  "genres": [
    "History",
    "Anthropology",
    "Archaeology",
    "Nonfiction",
    "Ancient History",
    "Ancient",
    "World History"
  ],
  "author": "Bruce G. Trigger",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/687306.Understanding_Early_Civilizations"
}