{
  "title": "Aimee Semple McPherson and the Resurrection of Christian America",
  "description": "From the Pilgrims who settled at Plymouth Rock to Christian Coalition canvassers working for George W. Bush, Americans have long sought to integrate faith with politics. Few have been as successful as Hollywood evangelist Aimee Semple McPherson. During the years between the two world wars, McPherson was the most flamboyant and controversial minister in the United States. She built an enormously successful and innovative megachurch, established a mass media empire, and produced spellbinding theatrical sermons that rivaled Tinseltown's spectacular shows. As McPherson's power grew, she moved beyond religion into the realm of politics, launching a national crusade to fight the teaching of evolution in the schools, defend Prohibition, and resurrect what she believed was the United States' Christian heritage. Convinced that the antichrist was working to destroy the nation's Protestant foundations, she and her allies saw themselves as a besieged minority called by God to join the \"old time religion\" to American patriotism. Matthew Sutton's definitive study of Aimee Semple McPherson reveals the woman, most often remembered as the hypocritical vamp in Sinclair Lewis's Elmer Gantry , as a trail-blazing pioneer. Her life marked the beginning of Pentecostalism's advance from the margins of Protestantism to the mainstream of American culture. Indeed, from her location in Hollywood, McPherson's integration of politics with faith set precedents for the religious right, while her celebrity status, use of spectacle, and mass media savvy came to define modern evangelicalism.",
  "genres": [
    "History",
    "Biography",
    "Religion",
    "Theology",
    "Nonfiction",
    "Politics",
    "American History"
  ],
  "author": "Matthew Avery Sutton",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/687244.Aimee_Semple_McPherson_and_the_Resurrection_of_Christian_America"
}