{
  "title": "You're Lucky You're Funny: How Life Becomes a Sitcom",
  "description": "The creator and executive producer of Everybody Loves Raymond dissects the art of comedy and the making of a sitcom classic \t In television, where programs can premiere and disappear in the same week, Everybody Loves Raymond reigned as America’s best-loved show for nine years with more than seventeen million viewers. As the number-one sitcom, it received more than seventy Emmy nominations, including two wins for best comedy. With You’re Lucky You’re Funny, Phil Rosenthal takes us onstage and inside the writer’s room.  Rosenthal’s meteoric ascent was preceded by odd jobs, including a stint as a museum security guard, running a deli, and writing for a slew of forgettable shows—including one starring Robert Mitchum as a curmudgeonly homeless man taken in by two orphans. But when he met comedian Ray Romano, they discovered a shared lifetime of family dysfunction—and endless material for a sitcom.  Not only a chronicle of one man’s rise to the peak of his profession, Rosenthal’s book is also an unprecedented look at the making of a hit series: how shows are written and character developed, how comedy is refined, how network executives are outsmarted, and most important, how egos are massaged. You’re Lucky You’re Funny is an inspiration to anyone involved in the creative process and a must read for the show’s millions of devoted fans. BACKCOVER: Advanced Praise: “In the Prologue, Mr. Rosenthal says ‘No one listens to me. Maybe the reader will...’ You should! He is the real deal, both as a human being and as an artist of comedy.” —Henry Winkler  \"I read YOU'RE LUCKY YOU'RE FUNNY and loved it! If you had the Everybody Loves Raymond bug during its 9 year run, this is the love letter you've been waiting for. If you've missed the bug, read it at the risk of being bitten and smitten.\" —Norman Lear",
  "genres": [
    "Nonfiction",
    "Humor",
    "Memoir",
    "Biography",
    "Audiobook",
    "Tv",
    "Writing"
  ],
  "author": "Phil Rosenthal",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/68789.You_re_Lucky_You_re_Funny"
}