{
  "title": "الغانية والعذراء",
  "description": "إبراهيم المصري : ----------------------يبقى من رواد القصة التاريخية القصيرة قبل سعد مكاوي ، إبراهيم المصري الذى يستحق أن نقف عنده وقفة طويلة \" فقد عمد إلى التاريخ ليتخذ منه منطلقاً لإبراز خياله الشاعرى ، ولإجراء تعادلية موفقة بين الخيال والواقع \"(16) , ذلك أن الروائي لا يهتم بالتاريخ لذاته ، إذ ليس هو بمؤلف يتخذ التاريخ حافزاً لإطلاق خياله المضطرم وملكاته الشعرية الجامحة ، بيد أنه لما كان قادراً على إجراء التعادل بين الخيال والواقع وبين الشعر والحقيقة ، كان فناناً عظيما كشكسبير ، وكلما طغى فيه الخيال والشعر كان فناناً رومانتيكياً مولعاً بالمتاهات والتهاويل وبعيداً عن الحقيقة كما كان \" فيكتور هوجو\" في مسرحياته\"(17)ويرى كاتب سيرة إبراهيم المصري أنه كان قادراً على إجراء هذا التعادل بين الخيال والواقع وبين الشعر والحقيقة ، وذلك لأن \"عامل الزمن يفسح مجال الخيال في تصور قصصه ، ويمكنه ذلك من خلال إضفاء ألوان شعرية مثالية خارقة وألوان مبهرجة وغريبة يقربها من واقع الحياة اليومي كما يبدع منها واقعاً أجمل وأروع يهيمن على الخيال وإن لم تختف منه الحقيقة \"(18).وبلا شك أن المصري يلتزم بالتاريخ وحقائقه ، ولكنه ذلك الالتزام الذي يصعب الوقوف عنده ، إذ هو لا يتعامل مع التاريخ بوصفه أحداثاً ووقائع بقدر مع يتعامل معه كحقائق تاريخية تكمن خلف هذه الأحداث وتلك الوقائع ، أى أنه يفسر التاريخ ، \" يقف عند مجرد الاهتمام به كإطار خارجي يمثل الهيكل المحتوى للمشكلة الإنسانية المعالجة حتى أنه لجأ إلى التاريخ الإنساني عامة كإطار شكلي لقصته التاريخية القصيرة\"(19) . لذلك فإن أجواء التاريخ لديه تختلف من قصة إلى أخرى ، ونجد أن المصري حريص على هذا الاختلاف والتنوع في الأجواء التاريخية ، وإن كان هذا التنوع لا يغير كثيراً من طريقة استخدام المادة التاريخية ، تلك المادة التي يحاول من خلالها عن طريق النص إظهار قيم معينه مثل ، الشرف والواجب ، وحب الأوطان وغيرها ، أو بث سلوك خلقي معين في القارئ المتلقي للعمل ، مما يشي بوجود وظيفة تعليمية للتاريخ ، وذلك نابع من مفهوم للتاريخ يقترب من المفهوم الإسلامي الذي يرى في التاريخ عظة وعبرة * .على أن ميزة \" إبراهيم المصري \" في قصصه التاريخية القصيرة تتمثل في تغليبه الفن على التاريخ ، فالقصة التاريخية تأخذ جانباً فنياً عالياً ، متماسكاً يتفوق فيه على سابقيه في هذا المجال ، وإن كانت هذه القصص تقل في مستواها الفنى عن قصصه الأخرى التحليلية التى تميز بها ، وربما تكون المادة التاريخية قد لعبت دوراً هاماً في ذلك ، فهو – أىالمصري – لا يميل إلى التحليل النفسي والاجتماعي في قصصه المستمدة من التاريخ ، ورغم ذلك نجد أن الحدث التاريخي لا يلعب دوراً أساسياً في بناء القصة ، إذ التاريخ لا يمثل إلا إطاراً تدور في فضاءه الأحداث والشخصيات ، فيمكن حذف اسم الشخصية التاريخية ، وكذا الإشارات التاريخية التى تشير إلى الأحداث لنجد أنفسنا أمام قصة عادية يمكن أن تروى في أى مكان وأي زمان .ففي قصصه يكتفي بالمقدمات التاريخية القصيرة ليحاول من خلالها أن يوجد للتجربة الإنسانية المعروضة انتماءاً زمنياً ومكانياً في التاريخ ، فيقدم قصة\" ساعة النصر\", بقوله: \" وقعت حوادث هذه في عهد أحمس وكان الهكسوس وهم قبائل آسيوية همجية ، قد اغتصبوا أرض مصر ، وظلوا يعيشون فيها ويسومون أهلها الاستبداد والظلم فلما ظهر في أواخر القرن السابع عشر قبل الميلاد فرعون أحمس ،قاتلهم وانتصر عليهم ورد فلولهم إلى أسيا ، ثم أقام إمبراطورية مصرية صميمة هي إمبراطورية طيبة\"(20) . وهكذا الحال في جميع قصصه التاريخية القصيرة وهو تقديم - كما نلاحظ – ليس له أهمية تذكر في إحياء الجو التاريخي ، وليس معنى هذا أننا نطالب الكاتب بإحياء الجو التاريخي لقصته من خلال مقدمات تاريخية للقصة .والتجربة المتناولة بعد ذلك في قصص \" إبراهيم المصري \" التاريخية القصيرة تجربة إنسانية عامة تتمثل أغلب المشاعر والقضايا الرومانسية خلال عنصري الحب والصراع\"(21)، بالإضافة إلى المبالغة في تصوير هذه المشاعر ، وهى مبالغة ترجع إلى ا تقاد الخيال الشعري عنده كما أدرك \"فوزي سليمان \" إذ يقول :\" فالمهم في المسرحية أو القصة التاريخية هو اتقاد الخيال الشعري ، مع الحرص على جوهر الحقيقة الإنسانية الأبدية ، وهذه هي الغاية التي تطلع إليها كاتبنا في قصصه التاريخي\"(22) .على أن هذه المبالغة قد تجور أحياناً على الصدق الفني والتاريخي معاً ، فنجد في قصة ، \" السادة والعبيد \" من مجموعة \" ساعة النصر\" ، بوريس بطل القصة يرميه سيده من المركبة ، فيسترد أنفاسه مع الفجر بعد أن نجح في قتل ذئب ، ليعود إلى القرية ، وهنا ينتظره الجلد بالسوط من قبل سيده ، حتى ليكاد يلفظ أنفاسه \" فلما أتى الفلاح على أخر سوط أرسل \" بوريس\" أنة طويلة مخفوقه ثم تداعت قواه وانهار على الأرض ، انهار على الأرض كالكتلة الصماء ، فارتمت أمه عليه ، وجعلت تحسه في جنون وتقلبه وهى تردد :-\tلم يمت ! لم يمت ! أسعفوه بكوب ماء .-\tفتقدم \" لاديلاس\" ليرى ، تقدم ليستمع ، تقدم ليتشفى ، عندئذ تململ \"بوريس\" وتحرك وفتح عينيه ، ونظر إلى سيده ، نظر إليه نظرة لم يرها مولى سوى في عين عبده ، نظرة سريعة نظرة هائلة ، نظرة منها كل عذاب العمر ، وكل الحنق على الظلم ، وكل الثورة الجارفة الطاغية على الجور والاستبداد ، فارتجف \" لاديلاس\" وتقهقر ، ولكن بوريس أمسك بذراعه وتشبث به ونهض ، نهض بالرغم منه ، نهض مدفوعاً بقوة طارئة خارقة لم يعلم من أين واتته ، نهض كالجبار واستقام كالطود ، وتلفت … تلفت وهو مخبول ، تلفت وهو دهش من يقظته ، مأخوذ بنشوته ، غير شاعر بجراحة ، مذهول من عزيمته وقوته وفكرته … ولم يتردد وفى مثل ومض البرق ، دفع\" لاديلاس\" في عنف ثم انقض على الصبي \" يافيل\" واختطفه ، ثم غافل الكل وأسرع إلى جواد السيد فامتطاه ، وانطلق بالجواد والصبي إلى قمة الربوة الواقعة في مؤخرة المزرعة والمشرفة على الواد السحيق\"(23) .آثرت أن أنقل هذه الفقرة الطويلة من القصة لأدلل من خلالها أيضاً على المبالغة في استخدام اللغة ، فاللغة تبدو حماسية انفعالية تلاحق الأحداث السريعة وإن أثقلها المؤلف بتكرار الأفعال وكثرة استخدام حروف العطف .وتقوم قصص \" المصري \" التاريخية القصيرة في بنائها على حبكة تقليدية ، أى أن القصة ، تستمد بناءها من حبكة قائمة على صراع ومؤدية إلى فعل ، ففي القصة السابقة ، يقوم الصراع فيها بين السيد صاحب المزرعة وبين العبد \"بوريس\" ، ينتهي الصراع بعد سلسلة من الأحداث تتكشف وتتنامى أمامنا في أسلوب فني ، يستخدم فيه الكاتب طريقة الاسترجاع ، فنعرف سر الحقد الدفين بين \" السيد \" وبين \" بوريس\" ، إذ تزوج الأول حبيبة الثاني ، ثم أخيراً ختم هذا برميه من المركبة إلى الذئب وسط الطريق ، وإذا كان في قصص الحبكة لابد أن\" ينتهي فيها الفعل بحسم الصراع ، وبذلك تكتسب القصة وجهة نظر \"(24) فإننا ، في هذه القصة - السادة والعبيد - نجد أن إبراهيم المصري يحسم الصراع في القصة ، لينتهي بموت ، بوريس رمياً بالرصاص من فوق قمة الجبل ، ووجهة النظر التى كان يمكن أن تحملها القصة هو أن الصراع محسوم لصالح \"بوريس\" ، بوصفه صاحب قرار موته بنفسه ، وهو ما كان يجب أن تنتهى عنده القصة ، لكن المصرى أفسد القصة ، بإضافته فقرة ذكر فيها توبة المالك وسعيه فى سبيل حرية الفلاحين بعتقهم ومنحهم حقوق المواطنين ، ثم يختم القصة بقوله ، \" وهكذا تحقق حلم بوريوس ؛ ولكن بعد أن أصبح جثه هامدة \"(25).وإذا انتقلنا إلى طبيعة السرد ووظيفته عند الكاتب وجدناه يمزج فى قصصه بين السرد الو صفى الذى غالباً ما يكون وصفاً شاعرياً مبهماً يضفى نوعاً من التشويق والإثارة على القصة ، وبين الحوار مما يكسب القصة حضوراً فى ذهن القارئ ، ويخليها من السرد التاريخي التقليدي الذى يبتعد بالقصة وأحداثها إلى أزمان سحيقة . يبدأ قصة\" بنت الطبيعة\"( من مجموعة شروق الإسلام ) ، بقوله :\" كانت الشمس الساقطة تريق أضوائها على الرمال الناعمة والأبدان نصف العارية ، فيتقد الشاطئ بأسره تحت لأ لائها ويزداد فتنه ، وبهجة وحياة \"(26).أما الحوار فيأتى فصيحاً بعيداً عن اللغة العامية المبتذلة ، مقطراً يساعد على اضطراد السرد واستمراره فى خطه المرسوم إلى جانب وظيفته فى الكشف عن الطبيعة الداخلية الشخصيات ففى قصة ، \"نداء الحب\" من مجموعة \"ساعة النصر\" ، يدور الحوار التالي بين رستم وزوجته :-\tأنيتك تستولي على هذا المال ؟فأجاب ضاحكاً :-\tهل تريدين أن أسلمه إلى القائد وأموت ؟فقالت وهى ترتجف :-\tولكن هذا المال هو ثمن خيانتك ، وهو ثمن أرواح إخوانك ، وهو ثمن جثة الرجل العظيم الذي مات شهيداً من أجلك !فقال ساخراً :-\tوإذن فيجب أن أبعث الأموات ، وأقتل الأحياء وألقى بهذه الثروة من النافذة \"(27) .ليكشف لنا الكاتب من خلاله عن طبيعة الشخصيتين المتحاورتين : أنانية رستم وخيانته في مقابل وفاء الزوجة وحرصها على كرامة زوجها ، وفدائها لوطنها .ولعل ما يعيب الحوار فى قصص \" إبراهيم المصري \" التاريخية القصيرة هو طول الجمل الحوارية على لسان الشخوص المتحاورة ، مما يدخله في باب السرد ، وهذا يرجع إلى الأسلوب الخطابي الذي يتبعه المؤلف ، حيث يحمل الشخصية بآرائه الخاصة ، على أية حال فإن لغة الكاتب الشاعرية تعوض كل هذا ، مما يحدو بالكاتب فى النهاية إلى الوصول بالقصة التاريخية القصيرة إلى شكل إجمالي على مستوى عال من الجودة . ولن نبتعد عن الحقيقة كثيراً إذا اعتبرنا إبراهيم المصري أفضل من كتبوا هذا النوع من القصص الذي نحن بصدده فيمن كتبوه قبل سعد مكاوى .وعن علاقة القصة بالحاضر عند \" إبراهيم المصرى \" ، فإنها تبدو فى الظاهر بعيدة الارتباط بالظروف التاريخية الآنية ، ربما بسبب تنوع أجوائها التاريخية ، مبتعدة بذلك عن التاريخ القومى ، إلا أن الاستقراء العميق لهذه القصص يكشف عن أنها شديدة الارتباط بالواقع ، وأن هذا الارتباط يتمثل فى قيم إنسانية وبث عواطف نبيلة فى المتلقي لهذه القصص ، محققة بذلك الفائدة ممتزجة بالمتعة الجمالية ، ولعل إبراهيم المصري ، كان حريصاً على ذلك ، فنجده يقدم مجموعة \" شروق الإسلام \" فيقول : \" الإنسان جسد وروح ، غريزة وعقل ، قلب وضمير ، . هذه المجموعة من القصص التاريخى تمثل الإنسان وهو يبذل ويضحى ويغالب نوازع الجسد ليتوفق بالإيمان والروح ، كما تمثله في صراعه بين ثورة غرائب وضوابط عقله ، وبين مشتهيات قلبه وصوت ضميره ، هذا الصراع الأبدي الذي يكتوي الإنسان بناره ، فيحترق وينسحق ، أو يخرج بطلاً ثابت الجنان ، صلب العزيمة ، مشرئب الفكر والروح نحو النور والهدى .فإلى القارئ هذه الصور الواقعية الحية تضرم في صدره شعلة الإيمان وفى وجدانه حافز القوة والإرادة والتفوق \"(28)",
  "genres": [],
  "author": "إبراهيم المصري",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/6875216"
}