{
  "title": "The Quantum Story: A history in 40 moments",
  "description": "The twentieth century was defined by physics. From the minds of the world's leading physicists there flowed a river of ideas that would transport mankind to the pinnacle of wonderment and to the very depths of human despair. This was a century that began with the certainties of absolute knowledge and ended with the knowledge of absolute uncertainty. It was a century in which physicists developed weapons with the capacity to destroy our reality, whilst at the same time denying us the possibility that we can ever properly comprehend it.Almost everything we think we know about the nature of our world comes from one theory of physics. This theory was discovered and refined in the first thirty years of the twentieth century and went on to become quite simply the most successful theory of physics ever devised. Its concepts underpin much of the twenty-first century technology that we have learned to take for granted. But its success has come at a price, for it has at the same time completely undermined our ability to make sense of the world at the level of its most fundamental constituents.Rejecting the fundamental elements of uncertainty and chance implied by quantum theory, Albert Einstein once famously declared that 'God does not play dice'. Niels Bohr claimed that anybody who is not shocked by the theory has not understood it. The charismatic American physicist Richard Feynman went he claimed that nobody understands it.This is quantum theory, and this book tells its story.Jim Baggott presents a celebration of this wonderful yet wholly disconcerting theory, with a history told in forty episodes -- significant moments of truth or turning points in the theory's development. From its birth in the porcelain furnaces used to study black body radiation in 1900, to the promise of stimulating new quantum phenomena to be revealed by CERN's Large Hadron Collider over a hundred years later, this is the extraordinary story of the quantum world.Oxford Landmark Science books are 'must-read' classics of modern science writing which have crystallized big ideas, and shaped the way we think.",
  "genres": [
    "Science",
    "Physics",
    "Nonfiction",
    "History",
    "Quantum Mechanics",
    "History Of Science",
    "Popular Science"
  ],
  "author": "Jim Baggott",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/10324174-the-quantum-story"
}