{
  "title": "The Anatomy Murders: Being the True and Spectacular History of Edinburgh's Notorious Burke and Hare and of the Man of Science Who Abetted Them in the Commission of Their Most Heinous Crimes",
  "description": "Up the close and down the stair, Up and down with Burke and Hare.Burke's the butcher, Hare's the thief, Knox the man who buys the beef.--anonymous children's songOn Halloween night 1828, in the West Port district of Edinburgh, Scotland, a woman sometimes known as Madgy Docherty was last seen in the company of William Burke and William Hare. Days later, police discovered her remains in the surgery of the prominent anatomist Dr. Robert Knox. Docherty was the final victim of the most atrocious murder spree of the century, outflanking even Jack the Ripper's. Together with their accomplices, Burke and Hare would be accused of killing sixteen people over the course of twelve months in order to sell the corpses as \"subjects\" for dissection. The ensuing criminal investigation into the \"Anatomy Murders\" raised troubling questions about the common practices by which medical men obtained cadavers, the lives of the poor in Edinburgh's back alleys, and the ability of the police to protect the public from cold-blooded murder.Famous among true crime aficionados, Burke and Hare were the first serial killers to capture media attention, yet The Anatomy Murders is the first book to situate their story against the social and cultural forces that were bringing early nineteenth-century Britain into modernity. In Lisa Rosner's deft treatment, each of the murder victims, from the beautiful, doomed Mary Paterson to the unfortunate \"Daft Jamie,\" opens a window on a different aspect of this world in transition. Tapping into a wealth of unpublished materials, Rosner meticulously portrays the aspirations of doctors and anatomists, the makeshift existence of the so-called dangerous classes, the rudimentary police apparatus, and the half-fiction, half-journalism of the popular press.The Anatomy Murders resurrects a tale of murder and medicine in a city whose grand Georgian squares and crescents stood beside a maze of slums, a place in which a dead body was far more valuable than a living laborer.",
  "genres": [
    "True Crime",
    "History",
    "Nonfiction",
    "Crime",
    "Scotland",
    "Medicine",
    "Science"
  ],
  "author": "Lisa Rosner",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/6878453-the-anatomy-murders"
}