{
  "title": "Comfort Found in Good Old Books",
  "description": "Comfort Found in Good Old Books is a book written by George Hamlin Fitch. In this book, the author talks about the importance of reading classic literature and how it can provide comfort and solace in difficult times. Fitch shares his personal experiences and reflections on various classic works of literature, including Shakespeare, Dickens, and Thoreau. He discusses how these books have helped him navigate through life's challenges and how they continue to offer wisdom and insight to readers today. The book is a tribute to the enduring power of classic literature and a reminder of the comfort and inspiration it can provide. It is a must-read for anyone who loves books and seeks solace in their pages.1911. Fitch writes in the These short essays on the best old books in the world were inspired by the sudden death of an only son, without whom I had not thought life worth living. To tide me over the first weeks of bitter grief I plunged into this work of reviewing the great books from the Bible to the works of the eighteenth century writers. The suggestion came from many readers who were impressed by the fact that in the darkest hour of sorrow my only comfort came from the habit of reading, which Gibbon declared he would not exchange for the wealth of the Indies. If these essays induce any one to cultivate the reading habit, which has been so great a solace to me in time of trouble, then I shall feel fully repaid. Comfort Found in Good Old Books; The Greatest Book in the World; Shakespeare Stands Next to the Bible; How to Read the Ancient Classics; The Arabian Nights and Other Classics; The Confessions of St. Augustine; Don Quixote, One of the World's Great Books; The Imitation of Christ; The Ruba-iyat of Omar Khayyam; The Divine Comedy by Dante; How to Get the Best Out of Books; Milton's Paradise Lost and Other Poems; Pilgrim's Progress the Finest of all Allegories; Old Dr. Johnson and His Boswell; and Robinson Crusoe and Gulliver's Travels.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [],
  "author": "George Hamlin Fitch",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/6885132-comfort-found-in-good-old-books"
}