{
  "title": "Signs of War",
  "description": "Former hedge fund manager, billionaire Cris De Niro and his new counter-terrorism firm, The Watchman Agency just prevented a nuclear attack on the city of Las Vegas, but not without cost. Charley Santappia, the Agency’s Vice President of Operations sacrificed his life to save the city. While at Santappia’s funeral, a remorse-filled De Niro announces to his shocked staff that he needs to decide whether he wants to continue with their mission.In front of Santappia’s coffin, the squad leaders of The Watchman Agency’s paramilitary arm, ARCHANGEL, decide to raise one last toast to their fallen commander. They’re joined by a ‘small man dressed in black’ who is something of a legend to members of the Special Forces. A Delta Forces hero turned rogue operative, respected as much as he was feared … enter Scipio, a very different type of warrior, but could he be the one to replace Santappia? Back at The Watchman Agency’s headquarters, undercover CIA agent Felix Salazar shows up with a problem he brings to his old boss from Langley now the Agency’s V.P. of Intelligence Services, Michelle Wang. Salazar is convinced that Venezuela has just received a shipment of Iranian medium-range missiles and he thinks he’s tracked the missiles to a Venezuelan port closest to the United States. De Niro and company decide to get involved, sending Salazar back to Venezuela to investigate with a fire team from ARCHANGEL as backup.There is also more strange activity at the border. Soldiers of Tuco Ramirez’s Pacifico Drug Cartel have been infiltrating en masse onto the Tohono O’odham reservation. This time, Bryan Ahiga head of the legendary DHS/ICE Shadow Wolves doesn’t have his border patrol unit to patrol the tribal lands, so he asks De Niro if his team could lend a hand.At the same time, De Niro is contacted by his old friend, David Nicholls. The usually incorrigible British playboy is frantic. He just found out that his dear friends were kidnapped by Somali pirates aboard their yacht, and he wants De Niro and his people to rescue them. De Niro is hesitant to offer assistance, but Scipio proposes to take care of it, as long as he can borrow Santana, De Niro’s newly battle-equipped mega-yacht and her crew. The Watchman Agency is spread thin and, once again, on their own!Cris De Niro & The Watchman Agency return to deal with Somali pirates, an imminent threat from an Iranian/Venezuelan alliance and a Mexican drug cartel’s plot of immense proportions.These are the SIGNS of WAR …",
  "genres": [],
  "author": "Gerard de Marigny",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/12998506-signs-of-war"
}