{
  "title": "A Journey Through Literary America",
  "description": "This 304 page coffee table book takes a look at 26 of America s great authors and the places that inspired them. Unique to this book of literary biography is the element of the photograph. With over 140 photographs throughout, the images add mood and dimension to the writing and they are often shockingly close to what the featured authors described in their own words. Lushly illustrated, and beautifully designed, the book is as much of a pleasure to look at as it is to read.Rags to riches. Forbidden loves. Supernatural experiences. Narrow escapes. Some of the greatest stories of American literature are the stories of the scribes themselves and of the places that sparked their imaginations. In 2007, writer Thomas Hummel and photographer Tamra Dempsey set out in search of the sources of inspiration for 26 of this country's greatest authors. Two years and twenty thousand miles later, the result is A Journey Through Literary America -- a literary pilgrimage in photography and prose. In the words of one reviewer, \"this is a beautiful and necessary book.\"Through seven sections, ranging from New England's Early Leafs to The Inner Migration, from America's Main Streets to Twentieth Century Excursions, A Journey Through Literary America examines the facets of the American literary experience by combining captivating biographies, arresting images, hand drawn maps by Sinclair Lewis and William Faulkner, and the words of the authors themselves. Unique in its approach and invigorating in its outlook, this may be the book you never realized you needed.The featured authors exhibit a range of Sherwood Anderson * Raymond Carver * Willa Cather * James Fenimore Cooper * Rita Dove * Ralph Waldo Emerson * William Faulkner * Richard Ford * Robert Frost * Nathaniel Hawthorne * Ernest Hemingway * Langston Hughes * Washington Irving * Robinson Jeffers * Sinclair Lewis * Herman Melville * Henry Miller * Toni Morrison * Flannery O Connor * E. Annie Proulx * Philip Roth * Wallace Stegner * John Steinbeck * Henry David Thoreau * John Updike * Thomas Wolfe.",
  "genres": [
    "Travel",
    "Nonfiction"
  ],
  "author": "Thomas Hummel",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/6884778-a-journey-through-literary-america"
}