{
  "title": "Pretty Girls",
  "description": "They don’t call themselves pretty girls but Amazons—these three young women at the University of North Carolina. Alexandria, Penelope, and Caroline are too tall, too smart, too striking, and too uncertain to be standard “pretty girls.” But as they struggle through a critical semester in their lives, pretty girls is often what they want to be. Garrett Weyr's Pretty Girls is the story of how the Amazons grow together and grow apart, fall in and out of love, and try to figure out what it means today to be a woman.Penelope, the daughter of the American ambassador to France, is brash, stylish, highly critical, very European, and very vulnerable. Her best friend, Alex, is a New York native with a snappy comeback for every situation; she is constantly dieting, as if to purge herself of the harsh secret she’ll tell no one, not even the other Amazons. Caroline, who loves both her friends more than she loves herself, is haunted by the memory of the man who left her and by the death of her much older brother in Vietnam.Starting with their arrival in Chapel Hill in late August, through tea parties, first dates, football games, mid-term forays off campus, and bull sessions in “the Pit,” events threaten to erode the bond among the Amazons. All three are emotionally involved with a man named Edward who is almost as smart as they are, but not smart enough to like an Amazon as much as he likes Susan, a sorority princess. But Susan is not what she seems; just as the Amazons sometimes long to be pretty girls, a pretty girl like Susan can long to be an Amazon.From simple jealousies to a failed romance, bulimia, sexual violence, an unwanted pregnancy, and even suicide, Alex, Caroline, and Penelope suddenly confront overwhelmingly adult problems. By Thanksgiving, they are not just pretty girls, not just Amazons, but women with a measure of earned pain and experience.Pretty Girls, Garrett Weyr’s funny and moving first novel, is a chronicle of young women who have grown up taking feminist values for granted—only to enter into a lifelong struggle to accept themselves and make a precise place for themselves in the world. It is an impressive debut.",
  "genres": [
    "Fiction"
  ],
  "author": "Garret Weyr, also Freymann-Weyr",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/688158.Pretty_Girls"
}