{
  "title": "Prince Miro's Submission",
  "description": "READER'S REVIEWS\"OUSTANDING\"    Sarki, Bookstrand  THIS IS A RAVISHMENT SEX FANTASY THAT MIGHT BE OFFENSIVE TO SOME.AN AMAZON US TOP 90 EROTICA AND NUMBER ONE EROTIC KINDLE BESTSELLER IN AMAZON GERMANY!The strikingly beautiful Prince Miro has become a sex slave in his enemy's camp. He is publicly displayed and degraded. His lush, firm buttocks are beaten repeatedly with a riding crop.But the night awaits him with further torments. Prince Miro must now pleasure six battle-hardened generals . . . who will use him in ways he has never imagined possible.This is Volume Two of 'The Royal Captive' series.READ AN EXCERPTSpirus makes a face at her. He produces a fat wooden rod from behind his back. It is attached to a tail made from real chestnut horsehair. Several leather straps trail from its base. I gaze at it in wonder.Spirus turns me around. \"Bend over.\"With mounting dread, I obey. Spirus parts my buttock cheeks and feels for my asshole.\"No.\" Tia stays his hand. \"He is hurt enough already. He needs to heal. If you must do it, he needs lubrication.\"Gratefully, I observe Tia as she covers the rod with a generous coating of unguent.Spirus forces my upper body down on the bed as he prizes my anus open. I close my eyes as the cold, sticky rod slides into my numbed rectum, filling it. It's not as large as King Jai's cock, thank goodness, but it is extremely solid and hard. If I try to move, I can feel its ramrod presence within me, causing me to straighten my pelvic region.Spirus secures its leather straps around my hips and waist. The horsetail sprouts from between my buttocks in a lavish plume.I am now a beast of burden. Embarrassment washes in tides from my cheeks to my chest. Surely he does not mean to make me walk amongst the soldiers like this?But Spirus has not finished humiliating me.Massaging my cock back and forth in front of the watchful Tia, he ensures that it is firmly tumescent. He then reveals a thin black leather strap with several metal hooks. He ties this around the base of my penis, restricting my circulation so that my shaft is further engorged.Spirus proceeds to clasp more thin black straps around my shaft - four in succession - as though my cock is a skein of hair that must be braided. My raised cock is now studded with these straps. The final one encircles my bulging purple glans tightly.\"Beautiful,\" Spirus breathes, admiring his handiwork.He proceeds to clamp my nipples with two metal clips that bite down hard on my quivering, sensitive flesh. The clips are attached to two thin metal chains. He fastens these to the hooks on the black strap around my penis base so that I can barely stand straight.My nipples are pulling my cock up in a contest of tightness. Or maybe my cock is pulling my nipples down.Spirus goes to the entrance of the tent and lifts a flap.\"Bring it in,\" he orders.Two guards enter, carrying a medium-sized wooden stock - the kind used to display prisoners at a marketplace to make them objects of ridicule and scorn. The stock has three holes - a large one in the middle and two smaller ones at the sides. A foot long wooden appendage juts out from the thin side of the stock at the level of the central hole. Releasing several clasps, the guards part the stock longitudinally.\"Stand straight and lift your arms,\" Spirus commands me.Tia looks away.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Fantasy",
    "Abuse",
    "Erotica"
  ],
  "author": "Aphrodite Hunt",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/12998455-prince-miro-s-submission"
}