{
  "title": "Orchards of Eden: White Bluffs on the Columbia 1907-1943",
  "description": "America's early 1900's dream of greening the western desert through irrigation drew hundreds of would-be farmers to the Columbia River hamlet of White Bluffs in Washington State. Yearning for a healthy, possibly lucrative life in the wild desert setting, they struggled with nature, railroads, power companies, commission houses, water systems and the ever-disappointing market. Through oral histories, letters, photographs and meticulous research, author Nancy Mendenhall tells the story of how, despite all the adversities, the orchardists built a remarkable, thriving community until it was cut short by events of World War Two. At times reading like an epic novel, this rich social history shows in detail the hard roles of pioneer women, children and their men, and delves deeply into their emotional and intellectual lives.“[Orchards of Eden] gives us important insights…a well-documented story.” ~ Journal of Rural and Community Development“Orchards of Eden” goes far beyond the story of one family to illustrate the historical period and the economic system that many small farmers struggled with…especially those in the arid west.” ~ Carlyn Syvanen, educator, Sequim, WA.“Mendenhall has brought to life in vivid detail the birth, maturation, and death of a tiny desert town. A richly woven human story…a history that reads like a novel.” ~ Dr. William Keep, retired English professor“Vivid and authentic! The life of an isolated river community before the Hanford Project ushered in the firestorm of the atomic age.” ~ Helen Hastay, raised in White Bluffs, WA“Mendenhall’s excellent and exhaustive research shines a spotlight on the distant, hidden influences that were at work while the early farmers toiled in the dry sandy soil to bring their dreams of Eden to life.”  ~ Margaret Wood, retired campus director, University of Alaska, and descendent of Eastern Washington farmers",
  "genres": [],
  "author": "Nancy Danielson Mendenhall",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/6891425-orchards-of-eden"
}