{
  "title": "Lone Star Nation: How a Ragged Army of Volunteers Won the Battle for Texas Independence - and Changed America",
  "description": "From bestselling historian and long-time Texan H. W. Brands, a richly textured history of one of the most fascinating and colorful eras in U.S. history—the Texas Revolution and the forging of a new America. “For better or for worse, Texas was very much like America. The people ruled, and little could stop them. If they ignored national boundaries, if they trampled the rights of indigenous peoples and of imported bondsmen, if they waged war for motives that started from base self-interest, all this came with the territory of democracy, a realm inhabited by ordinarily imperfect men and women. The one saving grace of democracy—the one that made all the difference in the end—was that sooner or later, sometimes after a terrible strife, democracy corrected its worst mistakes.” —from Lone Star Nation Lone Star Nation is the gripping story of Texas’s precarious journey to statehood, from its early colonization in the 1820s to the shocking massacres of Texas loyalists at the Alamo and Goliad by the Mexican army, from its rough-and-tumble years as a land overrun by the Comanches to its day of liberation as an upstart republic. H. W. Brands tells the turbulent story of Texas through the eyes of a colorful cast of characters who have become a permanent fixture in the American Stephen Austin, the state’s reluctant founder; Sam Houston, the alcoholic former governor who came to lead the Texas army in its hour of crisis and glory; William Travis, James Bowie, and David Crockett, the unforgettable heroic defenders of the doomed Alamo; Santa Anna, the Mexican generalissimo and dictator whose ruthless tactics galvanized the colonists against him; and the white-haired President Andrew Jackson whose expansionist aspirations loomed large in the background. Beyond these luminaries, Brands unearths the untold stories of the forgotten Texans—the slaves, women, unknown settlers, and children left out of traditional histories—who played crucial roles in Texas’s birth. By turns bloody and heroic, tragic and triumphant, this riveting history of one of our greatest states reads like the most compelling fiction, and further secures H. W. Brands’s position as one of the premier American historians.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Westerns",
    "Audiobook",
    "Historical",
    "American"
  ],
  "author": "H.W. Brands",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/6893.Lone_Star_Nation"
}