{
  "title": "Privilege, Power, and Difference",
  "description": "This brief book is a groundbreaking tool for students and non-students alike to examine systems of privilege and difference in our society. Written in an accessible, conversational style, Johnson links theory with engaging examples in ways that enable readers to see the underlying nature and consequences of privilege and their connection to it. This extraordinarily successful book has been used across the country, both inside and outside the classroom, to shed light on issues of power and privilege.Allan Johnson has worked on issues of social inequality since receiving his Ph.D. in sociology from the University of Michigan in 1972. He has more than thirty years of teaching experience and is a frequent speaker on college and university campuses. Johnson has earned a reputation for writing that is exceptionally clear and explanations of complex ideas that are accessible to a broad audience.Instructors and students can now access their course content through the Connect digital learning platform by purchasing either standalone Connect access or a bundle of print and Connect access. McGraw-Hill Connect(R) is a subscription-based learning service accessible online through your personal computer or tablet. Choose this option if your instructor will require Connect to be used in the course. Your subscription to Connect includes the following:- SmartBook(R) - an adaptive digital version of the course textbook that personalizes your reading experience based on how well you are learning the content.- Access to your instructor's homework assignments, quizzes, syllabus, notes, reminders, and other important files for the course.- Progress dashboards that quickly show how you are performing on your assignments and tips for improvement.- The option to purchase (for a small fee) a print version of the book. This binder-ready, loose-leaf version includes free shipping.Complete system requirements to use Connect can be found here: http: //www.mheducation.com/highered/platform...",
  "genres": [
    "Nonfiction",
    "Social Justice",
    "Sociology",
    "Race",
    "Education",
    "Feminism",
    "School"
  ],
  "author": "Allan G. Johnson",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/68988.Privilege_Power_and_Difference"
}