{
  "title": "A Lion Called Christian: The True Story of the Remarkable Bond Between Two Friends and a Lion",
  "description": "NEW YORK TIMES  BESTSELLER • “A stirring tale of a rare bond formed between humans and an animal.”— Time Two men. One baby lion. What could go wrong? A Lion Called Christian  tells the remarkable story of how Anthony “Ace” Bourke and John Rendall, visitors to London from Australia in 1969, bought a boisterous lion cub in the pet department of Harrods. For several months, the three of them shared a flat above a furniture shop on London’s King’s Road, where the charismatic and intelligent Christian quickly became a local celebrity, cruising the streets in the back of a Bentley, popping in for lunch at a local restaurant, even posing for a fashion advertisement. But the lion cub was growing up— fast —and soon even the walled church garden where he went for exercise wasn’t large enough for him. How could Ace and John avoid having to send Christian to a zoo for the rest of his life? A coincidental meeting with English actors Virginia McKenna and Bill Travers, stars of the hit film Born Free, led to Christian being flown to Kenya and placed under the expert care of the “father of lions” George Adamson. Incredibly, when Ace and John returned to Kenya to see Christian a year later, they received a loving welcome from their lion, who was by then fully integrated into Africa and a life with other lions. A video of this reunion has become a YouTube classic.  Originally published in 1971, and now fully revised and updated with more than 50 photographs of Christian from cuddly cub in London to magnificent lion in Africa,  A Lion Called Christian  is a touching and uplifting true story of an indelible human-animal bond. It is destined to become one of the great classics of animal literature.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Biography",
    "Memoir",
    "Nature",
    "Africa",
    "Cats"
  ],
  "author": "Anthony Bourke",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/6895758-a-lion-called-christian"
}