{
  "title": "Atkinson & Hilgard's Introduction to Psychology",
  "description": "This 15th edition of Atkinson & Hilgard's Introduction to Psychology retains all the qualities which have established it as one of the leading psychology textbooks of the last 50 years: an accessible student-centered approach, a keen awareness of the latest research developments, and a thorough understanding of the classic landmark studies which have shaped psychology as an academic discipline. Covering all major areas of psychology, this text examines the theories, research and ideas that underpin the subject, providing students with an engaging and rigorous introduction to psychology. By consistently relating psychological concepts to everyday life, and drawing from an internationally diverse range of research, this edition continues to be the relevant, dynamic introductory text for students around the globe. Benefits: NEW! Cutting Edge Research ? A vignette in each chapter highlighting recent research NEW! Seeing Both Sides ? Two contrasting essays at the end of each chapter debating a particular point or concept from divergent perspectives NEW! Interim Summaries ? Bulleted summaries at the end of subsections NEW! Critical Thinking Questions ? Open-ended questions designed to prompt debate and analysis NEW! Concept Review Tables ? Condensing concepts/terminology into easily digestible chunks NEW! Atkinson & Hilgard can be packaged with CengageNow, a teaching and learning resource that offers assignments, grading and quizzing for students and lecturers, as well as a diagnostic Personalized Study Plan that empowers students to master concepts, prepare for exams, and get a better grade. NEW! The text is also available with Psyk.Trek 3.0. This fun and interactive multimedia tool allows students to explore the main topics in psychology through extensive graphics, animations, videos, narration, as well as testing facilities and interactive experiments that allow students to really connect with psychological concepts and phenomena.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Science",
    "Reference",
    "Textbooks",
    "Academic",
    "School"
  ],
  "author": "Susan Nolen-Hoeksema",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/6896497-atkinson-hilgard-s-introduction-to-psychology"
}