{
  "title": "Promise of the Flame",
  "description": "Three hundred people in a starship low on life support--they must land fast, or they’ll run out of air. Captain Jesse Sanders is their only pilot. How can he choose where to locate their colony with no chance to explore the raw new world? How can he shuttle them all to the surface within a few short hours? And when the site proves less than adequate, how can he live with the knowledge that his own astrogation error was what got them into such a fix?Isolated by choice on a world they have reached in secret, the colonists hope to establish a culture based on psi powers that can someday shape the future of humankind. If they don't starve first. And if they don't lose heart in the face of hardships beyond any they imagined. Jesse hasn't expected to be responsible for the settlement. Peter is the leader, the visionary on whose inspiration they all depend. But Peter has his hands full, not only with maintaining morale but with a grueling ordeal of his own. So the job of ensuring the colony's survival falls on Jesse. And in the end, he must stake his life in a desperate attempt to prevent the loss of all they have gained.Although this is the second book of the Founder of Maclairn duology, it is an independent and quite different story that can stand alone. However, reading them in reverse order will affect some of the earlier book's suspense. Please note that unlike some of Engdahl's earlier novels, this is not a Young Adult novel and it contains some material inappropriate for readers below high school age.From the reviews:“It is not necessary to read the first [book] in order to be enthralled by the second. . . . Engdahl’s gift is to make her characters seem comfortable and familiar to the reader, even though their circumstances are not. Although clearly a work of science fiction, the ideas and futuristic possibilities are disturbingly real and will remain with the reader long after they’ve finished the book.” —IndieReader Staff Review“Outsoars its predecessor. . . . This is a book written by somebody at once holding firm convictions as to the potential human life can have but with enough political intelligence to note that even a society far improved over its predecessor will have its own problems, will be only a half-utopia. But even a half-utopia equipped with freedom and the possibility for optimal human interconnection is better than a society that disciplines and denies these. . . . As with all of Engdahl’s work, science-fiction fans will recognize the tropes she uses, but it is not just ‘for’ them, no more than the work of a great artist who happens to work in, say, ceramics is just for adepts of that medium. Engdahl has produced high-quality work over a forty-year period, but this is one of her finest achievements.” —Literary critic Nicholas Birns",
  "genres": [
    "Science Fiction"
  ],
  "author": "Sylvia Engdahl",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/6899607-promise-of-the-flame"
}