{
  "title": "Paranormal Payload",
  "description": "Futuristic SciFi Shapeshifter Paranormal RomanceDestiny lies along an uncharted course...Project Exorcism, Book 1Long ago, the Commission thought it had succeeded in ridding Earth of all supernatural beings. They were dead wrong. The supernaturals have not only survived the cold reaches of space, they have thrived. And grown more powerful.Commission Captain Sevan Vasil has enough problems without the strange, erotic dreams that seem to be his mind's version of a cruel joke. No woman could be that perfect a lover...except perhaps a mate. That's the joke--no woman alive would dare answer a lion-shifter's call. Until sassy, raven-haired Lorelei Janelle appears on his communication screen. The familiar face and angelic voice are straight out of his dreams.Lorelei's gut tells her not to let Sevan's damaged vessel anywhere near her uncharted planet, but her hormones overrule her head. The all-too-cocky, all-too-sexy captain is all she ever wanted--and everything it's not safe to have. Getting him and his crew safely off the planet before the planet's ruling vampire sorcerer awakes will be nip and tuck.Getting Sevan out of her heart...impossible.This book has been previously published and has been revised from its original Contains an entirely-too-full-of-himself alpha male, a vixen who is out of this world and a bad guy you love to hate.This novel contains adult content and is intended for mature audiences only. Must be 18 years or older to read. Project Exorcism Books Paranormal Payload (B002FK3TZQ)Force of Attraction (B002R2OF64)Point of No Return (B003MQM74G)Civil Twilight (B007VHANDY)If you enjoyed The Project Exorcism Series by Mandy M. Roth you might also like, Immortal Ops, King of Prey, Sacred Places and Gypsy Nights, all by Mandy as well.",
  "genres": [
    "Paranormal",
    "Romance",
    "Vampires",
    "Science Fiction",
    "Fantasy",
    "Paranormal Romance",
    "Shapeshifters"
  ],
  "author": "Mandy M. Roth",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/6899735-paranormal-payload"
}