{
  "title": "Edmund Persuader",
  "description": "Brand new in original shrinkwrap from the publisher. This item is actually a set consisting of volume 1 and volume 2; the price shown is the price for both--that is, for the complete novel. Beware of nonauthorized retailers selling only one volume. It also includes the original set packaging. This novel is subtitled “A Romance,” but in the preface the author “I use the term [romance] playfully in one of its several older senses, particularly that of a story of action with a heroic protagonist and a strong love interest. . . . I might cite as a model for my own use of the word the haunting classic of a later period, R. D. Blackmore’s Lorna Doone, which is in fact subtitled A Romance of Exmoor. The present book, then, could be called A Romance of Hampshire.” ***** The book is set in Antigua and England, 1810–1814. The jacket copy “An epic, a romance, and a mystery, Edmund Persuader is the tale of a man both blessed and cursed by his powers of persuasion. Those powers seem to perform the greatest wonders when they work him ill, yet fail when he needs them most—until he can emerge from the depths of moral error and climb toward the exaltation of redeeming love.” ***** Highly recommended to those who love Jane Austen’s works, though it is not a clone or a sequel. Readers find it more readable than Austen but equally satisfying. ***** “I look forward to re-reading it many times and gaining more from it each time. It is bursting with wisdom and some passages are so beautifully written they nearly moved me to tears. . . . I shudder to think what I would have missed if I had not read this book. It is . . . a spiritual feast.”***** You will receive the item well-packaged against damage within a sturdy cardboard box (box-within-box packaging) cushioned with biodegradable starch foam. We can ship anywhere in the United States via US Media Mail for $3.99. (Sorry--we CANNOT ship this two-volume set via Priority Mail or Expedited Shipping.)",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Historical Romance",
    "Epic",
    "Regency",
    "Novels"
  ],
  "author": "Stuart Shotwell",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/10324348-edmund-persuader"
}