{
  "title": "Astrology for Life: How to Be Your Own Vedic Astrologer",
  "description": "A practical guide to creating and interpreting horoscopes for yourself, your family and friends. By David M. Hawthorne and Professor V.K. Choudhry Now, you can learn to read astrology charts the quick and easy way. And, with greater accuracy than you ever thought possible. With this revolutionary new book, you will discover how easy it is to: CREATE CHARTS. The book includes step-by-step instructions for creating charts without having to learn mathematical computations. The book includes the Internet website addresses for both: A FREE Vedic Astrology software program that is easy to download and install. An online World Atlas resource you can go to in order to retrieve longitude, latitude, and time-zone information. With this book to guide you, it is easy to create and print Vedic Astrology charts with the planetary positions and time periods you will need in order to read charts and predict events. LEARN THE ESSENTIALS.There are only four elements in astrology: 1. The planets; 2. The signs; 3. The houses; and, 4. The planetary periods. You will quickly learn the fundamentals for each of these elements and how they interact with each other. For example, you will learn which planets become functional benefics or functional malefics for the various rising signs, and why planets and houses become strong or weak. You will also learn what to look for in any chart to see the past, present or future circumstances of any individual, organization, or significant event. READ HORSCOPES. This book will provide you with a simple, systematic approach to interpreting horoscopes. With the Systems' Approach, you will learn a proper order of sequence in which to read charts and to apply proven principles in order to make clear and relevant predictions. You will learn why the planets operate differently in various charts, and why their significations will or will not manifest. And, when they will manifest.",
  "genres": [
    "Astrology"
  ],
  "author": "David Hawthorne",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/6908694-astrology-for-life"
}