{
  "title": "Arbella: England's Lost Queen",
  "description": "An extraordinary life lost in history: the compelling biography of Arbella Stuart spans both Tudor and Stuart courts and encompasses espionage, a clandestine marriage, imprisonment and eventual death in the Tower of London.Arbella Stuart was the niece of Mary Queen of Scots and first cousin to James VI of Scotland. Acknowledged as her heir by Elizabeth 1, Arbella's right to the English throne was equaled only by James. Raised under close supervision by her grandmother, but still surrounded by plots -- most of them Roman Catholic in origin -- she became an important pawn in the struggle for succession, particularly during the long, tense period when Elizabeth lay dying. The accession of her cousin James thrust her into the colourful world of his extravagant and licentious court, and briefly gave her the independence she craved at the heart of Jacobean society. At thirty-five, however, Arbella's fate was sealed when she risked everything to make a forbidden marriage, for which she was forced to flee England. She was intercepted off the coast of Calais and escorted to the Tower where she died some years later, alone and, most probably, from starvation.This is a powerful and vivid portrait of a woman forced to carve a precarious path through turbulent years. But more remarkably, the turmoil of Arbella's life never prevented her from claiming the right to love freely, to speak her wrongs loudly, and to control her own destiny. For fans of historical biography, Arbella is possibly the most romantic heroine of them all. Hers was a story just waiting to be told.Sarah Gristwood is a journalist and broadcaster, specializing in the arts and women's issues. She is the author of one previous book, Recording Angels, a study of women's diaries through the ages.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Historical",
    "Tudor Period",
    "British Literature",
    "Biography Memoir"
  ],
  "author": "Sarah Gristwood",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/690539.Arbella"
}