{
  "title": "Inventing L.A.: The Chandlers and Their Times",
  "description": "In 1882, when General Harrison Gray Otis began working for the paper that was to become the Los Angeles Times , the city of Los Angeles was still a sleepy little town with fewer than a hundred thousand residents. However, Otis was the first of a dynasty of men to build what would later become a world-renowned and award-winning newspaper. Created as the companion book to the Peter Jones Productions documentary film, this book tells the century-long story of Los Angeles’ most famous family and their dominion over the Times , as they worked to create a city of international fame. The story follows the history of the paper as it was passed down from the hands of General Harrison Gray Otis, to his son-in-law, Harry Chandler, to Norman Chandler, and finally to Otis Chandler. With each generation, the paper changed more and more, from a paper used to win support for the family’s own interests (such as keeping labor unions out of Southern California, the creation of the Los Angeles Harbor, and the election of Richard Nixon) to a more unbiased and representative journalistic icon on par with the New York Times and the Washington Post . Inventing The Chandlers and Their Times is the tale of the Chandlers’ reign over Los Angeles with the help of their mighty scepter, the Times, and their entwinement with politics, family feud, and fortune. This is truly the story of the building of one of the most famous, populated, and culturally rich cities in the world. In his 30 years with the Los Angeles Times , Bill Boyarsky was a political writer, featured columnist, and city editor. He was a member of reporting teams that won three Pulitzer Prizes. He is the author of two biographies of Ronald Reagan. He is author of Big Jesse Unruh and the Art of Power Politics and Los City of Dreams ; with his wife, Nancy, he coauthored Backroom Politics . Native Angeleno Peter Jones began his career as a broadcast journalist. In 1987, he formed Peter Jones Productions, originally specializing in documentaries related to the history of the film industry. His special on Judy Garland won a 1997 Primetime Emmy Award for Outstanding Informational Series, the first for the A&E Network. The Bette Davis Story had its U.S. premiere on Turner Classic Movies in 2006, garnering Jones and his team an Emmy nomination for Outstanding Nonfiction Special and an Emmy Award for Outstanding Writing for Nonfiction Programming.",
  "genres": [
    "History"
  ],
  "author": "Bill Boyarsky",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/6908202-inventing-l-a"
}