{
  "title": "Railroads and Regulation, 1877-1916",
  "description": "Government regulation of the railroads is probably the most important example of federal intervention in the economy from the Civil War to World War I. It is also a key to an assessment of the impulses and motives behind Progressivism. In Railroads and Regulation, Gabriel Kolko presents a case study of the relationship of the economy to the political process in the United States during the years from 1877 to 1916.The author discusses the extent to which the railroad industry encouraged and relied on national political solutions--such as the creation of the first significant federal regulatory agency, the Interstate Commerce Commission, in 1887--to its economic problems. He shows how this reliance created a pattern of interdependence between economic and political power that set a precedent for government regulation of the economy in the twentieth century. Drawing on new material and manuscript sources, Dr. Kolko describes the roles of the railroad men in the movement for federal regulation. The attitudes of the railroads toward regulation are placed in the broader context of the determination of governmental economic policies--policies frequently formulated in response to railroad pressure.Dr. Kolko traces the continuity in governmental regulation between 1877 and 1900 and during the administration of Roosevelt, Taft, and Wilson, with fresh material of Progressive leaders in the period from 1910 to 1916. He analyzes the origin of each major federal railroad act and the contending forces trying to shape the legislation, and gives an illuminating discussion of the relationship of the state and federal regulation.Railroads and Regulation, 1877-1916 was awarded the Transportation History Prize of the Organization of American Historians.",
  "genres": [
    "History",
    "Railways",
    "Politics",
    "Nonfiction"
  ],
  "author": "Gabriel Kolko",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6905923-railroads-and-regulation-1877-1916"
}