{
  "title": "أصل الإنسان بين العلم والكتب السماوية",
  "description": "Gagasan Bucaille perlu dan penting disimak untuk memperkaya wawasan kita dalam menelisik asal-usul manusia.  --Dr. Taufikurahman  Dosen Sekolah Ilmu dan Teknologi Hayati ITB   Buku ini ditulis berdasarkan pengkajian mendalam untuk menjawab masalah-masalah di sekitar pertentangan-pertentangan lama antara sains dan agama. Selama lebih dari empat puluh tahun, penulisnya—seorang dokter senior Prancis—mencurahkan perhatian pada bidang biologi molekuler dan genetika serta menelaah dari dekat Kitab-Kitab Suci agama-agama monoteistik—Yahudi, Nasrani, dan Islam.  Berdasarkan penelitiannya, ia menyimpulkan bahwa sains dan agama, alih-alih bertentangan, justru benar-benar selaras dalam hal ini. Terbukti sekali lagi dari pengkajiannya itu, betapa Al-Quran—berbeda dengan kitab-kitab suci lainnya—sepenuhnya bebas dari pernyataan-pernyataan yang bertentangan dengan penemuan-penemuan sains modern. Hal itu sekaligus membuktikan, bahwa kata per kata Al-Quran sepenuhnya merupakan wahyu samawi yang bebas dari kesalahan-kesalahan manusiawi yang bisa ditemukan pada kitab-kitab suci lain yang merupakan hasil penulisan kembali oleh orang lain.  Buku ini memberikan jawaban bagi umat beriman di zaman modern ini yang ingin memegang teguh keimanan mereka tanpa harus memusuhi kemajuan sains. Sekaligus pula, ia menjawab klaim sekuler yang ingin memisahkah sepenuhnya sains dari agama.   \"Pisau bedah nalar' dr. Maurice Bucaille memang sangat tajam. Satu per satu fenomena ia bedah dengan sistematika yang dapat dipertanggungjawabkan secara rasional. Buku ini mampu mengantarkan kita untuk menyadari bahwa ada keteraturan dan keterencanaan yang terorkestrasi dengan indahnya di alam semesta.\"  -Tauhid Nur Azhar, Pengajar dan psikobiolog",
  "genres": [
    "Science",
    "Religion",
    "Nonfiction",
    "Anthropology",
    "Islam"
  ],
  "author": "Maurice Bucaille",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/6905760"
}