{
  "title": "YOU: Having a Baby: The Owner's Manual to a Happy and Healthy Pregnancy",
  "description": "Can I get a cavity filled while pregnant? Will avoiding spicy foods make my kid a picky eater? Can I really increase my baby's IQ while she's in utero?Whether you're pregnant for the first time, are trying to start your family, or already have enough children to start your own basketball team, you're bound to have questions about what it means to be pregnant -- and how you can increase your odds of having a healthy and happy pregnancy. But no matter how much you've read, watched, studied, or talked about this amazing biological journey, you have never read anything like this.In this groundbreaking book, Dr. Michael Roizen and Dr. Mehmet Oz act as mythbusters for the hundreds of questions surrounding pregnancy in the same scientific, informative, and entertaining ways that have made them America's Doctors. In these pages, you'll learn everything you need to know about the miracles of fetal development, your health throughout the pregnancy, and providing the best possible environment for your growing child.Pregnancy is a complicated balancing act, but it doesn't have to be frightening. The doctors will help you de-stress as they describe accurately and rationally what happens during a thrilling nine months of life. While every pregnant body is different, odds are you'll experience some of the cravings, crying, and discomfort that almost all women go through. Your best tactic? Learn why these things are happening -- and what you should do about them. Having a Baby will teach you everything you need to know about what to eat (should I be eating for two?), how much to exercise, and what guilty pleasures will actually make pregnancy easier on you (and the loved ones who get to be around you for the whole thing). Each phase of pregnancy has different challenges, but the right information will prepare you for what's ahead. The interactive week-by-week calendar inside provides an even more detailed guideline for how and what you should feel through every step of the process.Exciting, cutting-edge scientific research in the fi eld of epigenetics has changed the way the medical profession looks at pregnancy, and now it can change your perspective, too. Epigenetics explores what makes us develop in certain ways -- why some people thrive at math while others are prone to chronic diseases. It turns out that there are easy things you can do that will not just help your baby's development in utero but will actually improve his or her chances of living a healthy, fulfi lling adult life.Filled with recipes for nutritious, satisfying snacks and meals even Pop can cook (yes, he can!), safe exercises for staying fit, and tons of YOU tips that will help you stay comfortable, Having a Baby is the ultimate guidebook for what to do from the moment of conception to the weeks after your child has arrived home. From morning sickness and food cravings to choosing a doctor and changing a diaper, Having a Baby will give you the real scoop about what's in store for you during this amazing time in your life.",
  "genres": [
    "Nonfiction",
    "Parenting",
    "Health",
    "Reference",
    "Audiobook"
  ],
  "author": "Michael F. Roizen",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/6905448-you"
}