{
  "title": "Sapphistries: A Global History of Love between Women",
  "description": "A lyrical and meticulously researched mapping of the ways in which diverse societies have shaped female same-sex sexuality across time and geograhyFrom the ancient poet Sappho to tombois in contemporary Indonesia, women throughout history and around the globe have desired, loved, and had sex with other women. In beautiful prose, Sapphistries tells their stories, capturing the multitude of ways that diverse societies have shaped female same-sex sexuality across time and place.Leila J. Rupp reveals how, from the time of the very earliest societies, the possibility of love between women has been known, even when it is feared, ignored, or denied. We hear women in the sex-segregated spaces of convents and harems whispering words of love. We see women beginning to find each other on the streets of London and Amsterdam, in the aristocratic circles of Paris, in the factories of Shanghai. We find women’s desire and love for women meeting the light of day as Japanese schoolgirls fall in love, and lesbian bars and clubs spread from 1920s Berlin to 1950s Buffalo. And we encounter a world of difference in the twenty-first century, as transnational concepts and lesbian identities meet local understandings of how two women might love each other.Giving voice to words from the mouths and pens of women, and from men’s prohibitions, reports, literature, art, imaginings, pornography, and court cases, Rupp also creatively employs fiction to imagine possibilities when there is no historical evidence. Sapphistries combines lyrical narrative with meticulous historical research, providing an eminently readable and uniquely sweeping story of desire, love, and sex between women around the globe from the beginning of time to the present.",
  "genres": [
    "History",
    "Nonfiction",
    "LGBT",
    "Queer",
    "Feminism",
    "Lesbian",
    "Historical"
  ],
  "author": "Leila J. Rupp",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/6905436-sapphistries"
}