{
  "title": "Sophie and the Rising Sun",
  "description": "A radiant novel that gets the rhythms and cadences of small-town life exactly right. An unforgettable story of a time when the world lost its innocence--and of a town that finds its redemption in an extraordinary love.Salty Creek is a sleepy Georgia town where everyone knows everyone else's business, along with their place in the hierarchy of color, class, and family history. Strangers rarely enter their midst, and a mysterious arrival in the spring of 1939 soon sets tongues wagging.A quiet, unassuming man with a secret history of his own, Mr. Oto is taken in as a gardener by Miss Anne, the town's conscience-and its heart with no illusions about Salty Creek, or its inhabitants. One of these is Sophie, who lost her love during World War I and has resigned herself to a passionless existence taking care of her mother and two maiden aunts. Then one day, she and Mr. Oto speak for the first time. To Mr. Oto, whose heart has been full from the moment he saw Sophie, it is one of life's miracles--when they finally break the silence of \"the beauty of words unspoken.\"When the Japanese bomb Pearl Harbor and Mr. Oto's newfound life comes under siege, it is Miss Anne who once again comes to his rescue in an act of uncommon courage and sacrifice. As for Sophie, who has fallen in love with Mr. Oto, she must decide how much she is willing to risk for a future with this man who has brought such joy into her life.A radiant novel that gets the rhythms and cadences of small-town life exactly right, Sophie and the Rising Sun tells an unforgettable story of a time when the world lost its innocence-and of a town that finds its redemption in an extraordinary love. It is a major achievement from a novelist of rare grace and power.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "World War II",
    "Historical",
    "Book Club",
    "Southern"
  ],
  "author": "Augusta Trobaugh",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/691012.Sophie_and_the_Rising_Sun"
}