{
  "title": "Sword and Sorceress II",
  "description": "What better guide could there be through the realms of witchery and wonder, of combat and danger, of romance and magic than the hand and mind of Marion Zimmer Bradley, author of best-sellers CITY OF SORCERY, THENDARA HOUSE and MISTS OF AVALON? So come with her now through the second convocation of swordswomen and spellbinders.Here you will meet dragons and goddesses. Here you will venture forth with priestesses and assassins. Here be unicorns and mythical beasts of darkness.Here is adventure!Fifteen original tales by such writers as C.J. Cherryh, Diana Paxson, Phyllis Ann Karr, Charles Saunders, Jennifer Roberson, and more, selected and introduced by the Wise Woman of Darkover, Marion Zimmer Bradley herself.Marion Zimmer Bradley's Sword and Sorceress series has always featured the best in contemporary women's fantasy, and this outstanding new volume carries on the tradition! These original stories of brave, talented, and heroic women will take readers through enchanted realms of the imagination into danger both physical and mystical, where the only way to survive is through the power of sword and spell.Introduction · Marion Zimmer BradleyA Night at Two Inns · Phyllis Ann KarrThe Red Guild · Rachel PollackShadow Wood · Diana L. PaxsonUnicorn's Blood · Bruce D. ArthursThe Unshadowed Land · C.J. CherryhShimenege's Mask · Charles R. SaundersThe Black Tower · Stephen L. BurnsThe Lady and the Tiger · Jennifer RobersonFireweb · Deborah WheelerCold Blows the Wind [Angharad] · Charles de LintSword of the Mother · Dana Kramer RollsHunger · Russ GarrisonOn First Looking into Bradley's Guidelines, or Stories I Don't Want to Read Either · Elizabeth ThompsonThe Chosen Maiden · Raul ReyesRed Pearls · Richard CorwinWound on the Moon · Vera Nazarian",
  "genres": [
    "Fantasy",
    "Anthologies",
    "Short Stories",
    "Science Fiction Fantasy",
    "Sword and Sorcery",
    "Fiction",
    "Magic"
  ],
  "author": "Marion Zimmer Bradley",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/691214.Sword_and_Sorceress_II"
}