{
  "title": "جرائم العاطفة في مصر النازفة",
  "description": "للباحث والكاتب والصحافي المصري، الذي يعمل حالياً كرئيس لتحرير قناة العربية في دبي، هذه الدراسة المشوّقة والفريدة من نوعها، بموضوعها وأخبارها، تدمج التطرف بشقيه الغرامي والإجرامي، وتكشف عن أسرار وقصص الحب والعشق والوله، المعلن منه أو المحرّم والسري، الذي وصل بتطرفه إلى حد القتل والجريمة المنفذّة بشتى الطرق والوسائل من استعمال الرصاص إلى دسّ السم، والتي شهد وقائعها تاريخ مصر. نهايات مأساوية \"تستحق أن تُروى..وبدايات جديرة بأن تستعاد\" لحكايا وقصص هذا الكتاب.معظم حالات الجريمة العاطفية كانت \"تقع عادة تحت جنح الليل..ربما لأن الظلام سترٌ لأصحاب الخيبات كما هو مطلبّ للّصوص\". أما الأمكنة التي كانت تتم فيها، فكانت تتراوح بين القصور وبين المنازل المتواضعة، في مدن مصر وخارج حدودها، في بلد عربي أو أوروبي أو أميركي. كما أمتد زمانها إلى مختلف العصور من \"عصور الفراعنة والمماليك والعثمانيين وما بعد ذلك طبعا، وصولا إلى اليوم\".\"لم يكن الأمر سهلا، فقد تطلبت الكتابة عن تلك الحكايات وشخصياتها المحورية البحث في مئات الكتب والمراجع والدوريات والصحف باللغتين العربية والإنكليزية\"، ومنها ما ينشر لأول مرة باللغة العربية. \"إنها حكايات هدهدتها الأحلام، قبل أن تتحول إلى كوابيس، ولوحة من ألوان البهجة وحب الحياة قبل أن تصبح ملطخة بالدم. والأبطال في هذه الحكايات من كل صنف ولون: رجال أعمال وفنانات، ملوك وأميرات، قضاة وربات بيوت، نصابون ومطلقات..\". من بين هذه القصص: \"المسرحية المأساوية التي لعب أدوار البطولة فيها كل من الملك فاروق ووالدته الملكة نازلي، وابنتها الأميرة فتحية وزوجها رياض غالي\"، ومسرحية أخرى أبطالها الأمير أحمد سيف الدين والأمير أحمد فؤاد \"الذي أصبح فيما بعد السلطان فؤاد ثم \"صاحب الجلالة الملك فؤاد\"..والد الملك فاروق الأول\"، وقصة كامل فهمي و\"هو نجل الفريق علي باشا كامل، أحد ضباط الخديوي العاملين في القصر\"، وغيرهم من أبطال الكثير من القصص المؤثرة والمثيرة للفضول والمعرفة بالتفاصيل والأحداث والأسباب.كتاب عن الحب والعشق وقصصه وأحواله وجنونه، من زاوية خاصة تتناوله من طرفه أو تطرفه الأقصى ومن ردة فعله الأخيرة التي تطال حد إلغاء الآخر وتنفيذ جريمة القتل",
  "genres": [
    "Egypt",
    "History"
  ],
  "author": "ياسر ثابت",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/6913143"
}