{
  "title": "Surviving the Cataclysm: Your Guide Through the Greatest Financial Crisis in Human History",
  "description": "The Book that Shows the Way out of the World Depression Here is the indispensable hand-book for the present breakdown crisis and disintegration of the world financial, currency, and banking system. Webster Tarpley builds on his prophetic work of 1999, which showed the world heading for a financial cataclysm and economic depression due to deregulated derivatives specula-tion, the destruction of modern productive industry, the collapse of the US standard of living, and a globalized hot money casino run by a tiny financier oligarchy. Tarpley calls for a return to the American System of political economy as exemplified by such figures as Hamilton, Clay, Lincoln, FDR, and JFK. He shows the criminal futility of the Bush-Paulson-Bernanke bailout of the $1.5 quadrillion derivatives bubble, now continued under cynical and demagogic left cover by the Obama - Geithner - Summers - Bernanke clique. Obama is exposed as the worst Wall St. puppet in recent US history, an anti-FDR peddling a New Deal in reverse for the benefit of zombie bankers, while the American people get the crumbs. Surviving the Cataclysm advances a benchmark program for world economic recovery, full employ-ment, scientific and technological progress, third world development, and the defense of our threatened civilization. It is a call for wiping out derivatives, banning foreclo-sures, and nationalizing the failed Federal Reserve System. Cheap, no-interest Federal credit for pro-duction can build 1,000 hospitals, 100,000 miles of high-speed mag-lev rail, 100 fourth-generation high-temperature pebble bed nu-clear reactors, while rebuilding the interstates, and water systems - creating tens of millions of high-paid, capital-intensive modern jobs in the process. Tarpley makes the case for science drivers in explo-ration, colonization, and industri-alization on the moon and Mars; high-energy physics; and biomedi-cal research. A special chapter discusses ways individuals and families can survive the crisis. If you read one book on eco-nomics, let it be this one.",
  "genres": [
    "Economics",
    "Politics"
  ],
  "author": "Webster Griffin Tarpley",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/6919692-surviving-the-cataclysm"
}