{
  "title": "Going Rogue: An American Life",
  "description": "On September 2, 2008 Alaska Governor Sarah Palin gave a speech at the Republican National Convention that electrified the nation and instantly made her one of the most recognizable women in the world. As chief executive of America's largest state, she had built a record as a reformer who cast aside politics-as-usual and pushed through changes other politicians only talked Toward energy independence. Ethics reform. And the biggest private sector infrastructure project in U.S. history. And while revitalizing public school funding and ensuring the state met its responsibilities to seniors and Alaska Native populations, Palin also beat the political 'good ol' boys club' at their own game and brought Big Oil to heel. Like her GOP running mate, John McCain, Palin wasn't a packaged and over-produced 'candidate.' She was a Main Street American a working mom, wife of a blue collar union man, and mother of five children, the oldest serving his country in Iraq and the youngest, an infant with special needs. Palin's hometown story touched a populist nerve, rallying hundreds of thousands of ordinary Americans to the GOP ticket. But as the campaign unfolded, Palin became a lightning rod for both praise and criticism. Supporters called her 'refreshing,' 'honest,' a kitchen-table public servant they felt would fight for their interests. Opponents derided her as a wide-eyed Pollyanna unprepared for national leadership. But none of them knew the real Sarah Palin. In this eagerly anticipated memoir, Palin paints an intimate portrait of growing up in the wilds of Alaska, meeting her lifelong love, her decision to enter politics, the importance of faith and family, and the unique joys and trials of life as a high-profile working mother. She also opens up for the first time about the 2008 presidential race, providing a rare, mom's-eye view of high-stakes national politics - from patriots dedicated to Country First to slick politicos bent on winning at any cost. Going Rogue traces one ordinary citizen's extraordinary journey, revealing Palin's vision of a way forward for America and her unfailing hope in the greatest nation on earth.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Politics",
    "Autobiography",
    "Memoir",
    "History",
    "Biography Memoir"
  ],
  "author": "Sarah Palin",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/6922622-going-rogue"
}