{
  "title": "اسمه الغرام",
  "description": "لم تتخل الكاتبة في روايتها الثالثة هذه، عن مجهرها في رؤية الواقع، لتبرز تفاصيل الموضوع الذي تتناوله، والتي تشكّل أهمية قصوى على درب معرفة الحقائق، وتعرية النفوس من ما يعتمل فيها، وكشف المستور الذي يبرع الآخرون في إخفائه، وحتى التشدق بعكسه. لم تتخل أيضا عن دفاعاتها المسبقة، فلم تنس الإعلان أن \"الكتابة دايمًا ناقصة\"، وأنها لا تتعدى على مسيرة حياة أبطالها ولا تتحكم بهم، ولا تفرض رؤيتها عليهم، فتعلن أن \"نهلا تلكزني كي أكتب حكايتها\"، \"المليئة بالحب والحياة..\"، فالبطلة نهلا اختفت وقد تكون ضحية من ضحايا حرب تموز على لبنان عام 2006، وهي الفترة التي تدور فيها أحداث الرواية، فـ\"إن لم أكتب حياتها، ألن أجعلها تتحول إلى مجرد اسم مكتوب على كيس نايلون مثل مصير وحيوات أولئك الأطفال والضحايا الأبرياء\". لكنها تعود للشك في مصداقية الكتابة نفسها: \" لم أعد أدرك إن كنت أعرف امرأة اسمها \"نهلا\" حَكت لي حكايتها لأكتبها، أم أني أتخيّل حياة امرأة من بين الذين رأيتهم ينتشلونهم من تحت أنقاض منازلهم\". كما أنها لا تنفي وجود المبرر الذاتي والهدف الشخصي: \"لم يكن أمامي سوى أن أطاوع نهلا لأقاوم موتي بالكتابة\".رواية غنية بالقصص المتعددة والمصائر المتنوعة، وبشخصيات نسائية مركبّة بين الواقع وبين خيال التركيب الروائي. نهلا وسعاد وعزيزة ومنى ونادين وميرنا، كلهن سيعبّرن وسيكنّ إطاراً للحديث عن الأهم وهو الموضوع. ألا تنتهي حياة الشخصيات والأفراد والأسماء وتبقى المواضيع...وهذه المرة كان \"الغرام\" هو الموضوع الأهم الذي اختارته الكاتبة. \"ما اسم هذا الغرام الذي يفتك بي ويحييني في آن\"؟! تقول البطلة التي تعود إلى غرامها الأول هاني، بعد أن انفصلا وبنى كل منهما حياته بعيداً عن الآخر، فتزوج وانجب. فحبهما \"جمر بقي متوقدا\"ً، وبحسب تعبيرها: \"كنت مختبئة فيه، وهو يختبئ فيّ طوال الوقت الذي لم نر فيه واحدنا الآخر. ومن أجل ذلك، لم أنسه، لأن الأشياء التي نختبئ فيها لا تُنسى أبداً\".يفيض الكلام بمشاعر الحب ويختلف باختلاف حدّتها. فالحب أنواع :\"الحب هو اللي ما فيكي تقمعيه وتحديه متل النهر\"، وحب الودّ والمحبة، و\"الحب اللي فيه ولع وتيه ومفردات كثيرة\".في جولتها وبحثها عن كشف حقيقة ما \"اسمه الغرام\"، لن تبخل الكاتبة في عرض محتوياته على أرض الميدان، ومصطلحاته المستعملة، ومفاهيمه المطبّقة، وكل ما يدور حوله: الزواج والتقاليد، والحب والعلاقة المختلفة التي تربط بين قطبيه، والرغبة الجنسية واكتشاف الجسد، وعدم الاكتفاء والحرمان، والتعويض عن هذا الحرمان..تتخذ الكاتبة موقعاً واقعياً كاشفاً في طريقة تناولها لهذا الموضوع المتشعب والشديد الخصوصية. لكنها حتى في تدّخلها الذاتي ورؤيتها الخاصة، لا تدين ولا تحلل ولا تطرح حلولا، بل هي تقدم تفاصيل واقع تزج نفسها به، لتخرج بحصيلة رؤى ومشاهد، تسجل أحداثها وظواهرها وتدون تعابيرها، وتدع للقارئ المهام الأخرى من الاستنتاج والتحليل",
  "genres": [
    "Lebanon",
    "Novels",
    "Literature",
    "Romance"
  ],
  "author": "علوية صبح",
  "average_rating": "2.95",
  "url": "https://www.goodreads.com/book/show/6923183"
}