{
  "title": "The Comfort Table: Recipes for Everyday Occasions",
  "description": "Food has a nostalgic power. Just like hearing a favorite song, cooking and eating can transport us to a moment in Sunday family suppers or brunch with friends, a Fourth of July barbecue or a Chrismukkah feast. Katie Lee grew up in a small West Virginia town where her grandmother's kitchen was not far away, and her warmest memories are of being around the table with loved ones. In The Comfort Recipes for Everyday Occasions , she brings her roots in southern hospitality to the table with year-round menus for occasions big and small.Whether she's throwing a Super Bowl party for friends or putting a pot roast in the oven for the first snowfall of the year, Katie shares her favorite home-cooked menus for making holiday feasts delicious and ordinary meals special. With more than 100 mouthwatering, easy-to-prepare seasonal recipes, she provides sumptuous soup-to-nuts menus, along with practical tips for effortless entertaining, including suggested wine pairings, playlists, hostess gifts, and general cooking tips.Welcome autumn with the rustic elegance of a home-baked apple pie. Roast an irresistible turkey rubbed in herb butter for Thanksgiving (and stir up a spicy gumbo with the leftovers). Host a relaxing day for your friends with a healthy vegetarian spread and spa recipes for postprandial pampering. From the decadent -- Nutella French toast sandwiches and juicy lamb burgers -- to the sublime -- creamy curried chicken salad and crispy zucchini chips -- Katie serves up a rich assortment of seasonal recipes for the home cook for breakfast, lunch, and dinner.A guide to enjoying great food with good friends around the Comfort Table, Katie Lee's simple recipes for cooking and entertaining guarantee the best kind of meals -- ones prepared with love that turn every occasion into a celebration.",
  "genres": [
    "Cookbooks",
    "Food",
    "Nonfiction"
  ],
  "author": "Katie Lee",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/6920082-the-comfort-table"
}