{
  "title": "A Distant Magic",
  "description": "Mary Jo Putney’s passionate, vivid characters and captivating stories have earned enthusiastic acclaim from reviewers and readers everywhere. Now the New York Times bestselling author weaves a new tale in the Guardian series–a dazzling romantic fantasy that takes readers not only from the elegant streets of London to a dangerously tempting Mediterranean island but across time.Jean Macrae’s family is one of the most prominent clans of Guardians, humans whose magical powers come from nature, but Jean considers her skills modest at best. She has never been able to summon the intense, earth-altering ability that has marked the most talented Guardians, and she is content without the adventure that such skill brings . . . until the day she is confronted by a handsome stranger whose magic imprisons her on his pirate ship.Captain Nikolai Gregorio is convinced that Jean’s father abandoned him, as a child, to slavers. Now he seeks vengeance against the Macraes, no matter the cost. But Jean soon finds his untrained magical gifts far more dangerous than his thirst for revenge, especially when they intensify her own powers to an unthinkable–and enticing–degree. And when Jean and Nikolai’s irresistible connection summons a woman from the future, they are charged with a formidable protect those who will oppose slavery’s evil and forever change the future of two nations. This quest will sweep Jean and Nikolai into the most fantastic of realms and try their powers beyond even what the Guardians themselves would dare. And when ultimate disaster threatens, they will stake everything on a shattering test of love that could secure the fate of generations . . . or destroy them and all they cherish.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Fantasy",
    "Historical",
    "Paranormal Romance",
    "Paranormal",
    "Magic"
  ],
  "author": "Mary Jo Putney",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/692946.A_Distant_Magic"
}