{
  "title": "The Works of Anne Bradstreet",
  "description": "Anne Bradstreet, the first true poet in the American colonies, wrote at a time and in a place where any literary creation was rare and difficult and that of a woman more unusual still. Born in England and brought up in the household of the Earl of Lincoln where her father, Thomas Dudley, was steward, Anne Bradstreet sailed to Massachusetts Bay in 1630, shortly after her marriage at sixteen to Simon Bradstreet. For the next forty years she lived in the New England wilderness, raising a family of eight, combating sickness and hardship, and writing the verse that made her, as the poet Adrienne Rich says in her Foreword to this edition, \"the first non-didactic American poet, the first to give an embodiment to American nature, the first in whom personal intention appears to precede Puritan dogma as an impulse to verse.\" All Anne Bradstreet's extant poetry and prose is published here with modernized spelling and punctuation. This volume reproduces the second edition of Several Poems , brought out in Boston in 1678, as well as the contents of a manuscript first printed in 1857. Adrienne Rich's Foreword offers a sensitive and illuminating critique of Anne Bradstreet both as a person and as a writer, and the Introduction, scholarly notes, and appendices by Jeannine Hensley make this an authoritative edition. Adrienne Rich observes, \"Intellectual intensity among women gave cause for uneasiness\" at this period--a fact borne out by the lines in the Prologue to the early \"I am obnoxious to each carping tongue/ Who says my hand a needle better fits.\" The broad scope of Anne Bradstreet's own learning and reading is most evident in the literary and historical allusions of The Tenth Muse , the first edition of her poems, published in London in 1650. Her later verse and her prose meditations strike a more personal note, however, and reveal both a passionate religious sense and a depth of feeling for her husband, her children, the fears and disappointments she constantly faced, and the consoling power of nature. Imbued with a Puritan striving to turn all events to the glory of God, these writings bear the mark of a woman of strong spirit, charm, delicacy, and in their intimate and meditative quality Anne Bradstreet is established as a poet of sensibility and permanent stature.",
  "genres": [
    "Poetry",
    "Classics",
    "School",
    "American",
    "Nonfiction",
    "Literature",
    "17th Century"
  ],
  "author": "Anne Bradstreet",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/692842.The_Works_of_Anne_Bradstreet"
}