{
  "title": "The Marriage Spell",
  "description": "New York Times bestselling author Mary Jo Putney is acclaimed by critics and readers alike for unforgettable storytelling and arresting characters. Now she introduces a Regency England you’ve never seen before, where dazzling magic is practiced in all but the highest reaches of Society, and where desire is the most mysterious and seductive force of all.One of the Duke of Wellington’s most respected officers, Jack Langdon, Lord Frayne, takes his family’s honor very seriously. He also hides a shameful a talent for sorcery he has been raised to suppress and openly reject. But after an injury lands Jack at death’s door, his only chance at survival lies with Abigail Barton, a peer’s daughter and a skilled wizard. Her Jack’s hand in marriage. It isn’t long before Jack feels an irresistible attraction to his forthright new wife, whose allure is as intense as the reawakening magical abilities he can no longer deny.Abigail had to make a great sacrifice to perform a spell powerful enough to save Lord Frayne, and although she cannot help but be drawn to her reluctant husband’s surprising sensitivity and kindness, she knows all too well his distaste for magic. Once she has Jack’s name and the child she has always longed for, she is determined to live apart from him so that he can preserve his reputation–and so that she herself can stay true to her gifts.But neither Abby nor Jack reckons on the deep, long-simmering passions her spell ignites. They challenge each other’s extraordinary powers and deepest desires for the sake of a love that may cost them all they cherish most.With breathtaking skill and vivid historical detail, Mary Jo Putney weaves a tale of enchantment, mystery, and romance that will forever hold you spellbound.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Fantasy",
    "Historical",
    "Paranormal",
    "Magic",
    "Paranormal Romance"
  ],
  "author": "Mary Jo Putney",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/692947.The_Marriage_Spell"
}