{
  "title": "The Years of Extermination: Nazi Germany and the Jews, 1939-1945",
  "description": "With The Years of Extermination, Saul Friedländer completes his major historical work on Nazi Germany and the Jews. The book describes and interprets the persecution and murder of the Jews throughout occupied Europe. The enactment of German extermination policies and measures depended on the cooperation of local authorities, the assistance of police forces, and the passivity of the populations, primarily of their political and spiritual elites. This implementation depended as well on the victims’ readiness to submit to orders, often with the hope of attenuating them or of surviving long enough to escape the German vise.This multifaceted study—at all levels and in different places—enhances the perception of the magnitude, complexity, and interrelatedness of the many components of this history. Based on a vast array of documents and an overwhelming choir of voices—mainly from diaries, letters, and memoirs—Saul Friedländer avoids domesticating the memory of these unprecedented and horrific events. The convergence of these various aspects gives a unique quality to The Years of Extermination. In this work, the history of the Holocaust has found its definitive representation.\nAcclaim for Nazi Germany and the Jews: The Years of Persecution, 1933-1939:\n\"This will be the standard work for many years to come\" –Daniel Johnson, The Times\"There have been many books about Nazism's persecution of the Jews, but none as magisterial or comprehensive as this\" –Richard Evans, Sunday Telegraph\"The merits of this work are many; it is easily the best book of a distinguished historian. It is based on a great variety of sources, published and unpublished, and the judgement of the author cannot be faulted on any major issue...This is a very good, very important book. It needed to be written before the last historians disappear who, because of the date and place of their birth and their personal experience, know certain things in their bones about the period of the Holocaust.\" –Walter Lacquer, Los Angeles Times\"Saul Friedlander is the most astute, sophisticated and stylish historian of the Holocaust working in any language today.\" –Michael Burleigh",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "World War II",
    "Germany",
    "War",
    "European History"
  ],
  "author": "Saul Friedländer",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/692474.The_Years_of_Extermination"
}