{
  "title": "Elisabeth Sladen the Autobiography",
  "description": "A unique, insider's view of the world's longest running science fiction series, from one of the fans' favorite companions. David Tennant's foreword caps this warm, witty memoir — a fitting tribute to a woman who will be sadly missed by legions of fans. When Elisabeth Sladen first appeared as plucky journalist Sarah Jane Smith in 1973 Doctor Who story \"The Time Warrior,\" little did she know the character would become one of the most enduring and fondly remembered in the series' history. Here she shares the story of her years as Sarah Jane—traversing time and space alongside classic Doctors Jon Pertwee and Tom Baker, while a generation of children were terrified but transfixed as their heroine found herself menaced by Daleks, dinosaurs, Cybermen, man-eating alien flora, Egyptian mummies, extras in Bubble Wrap, and even the Loch Ness Monster. By the time she quit the TARDIS in 1976, making front page news, Elisabeth had become one of the most familiar faces of a TV golden age. But that wasn't the end of Sarah Jane. Elisabeth discusses the many times she has reprised her role—anniversary specials, a 1981 spin-off pilot with robotic sidekick K-9, and radio plays. She discusses touring the weird, wide, and wonderful world of Doctor Who fandom. And lastly, she shares details of Sarah Jane's most recent incarnation—when TV wunderkind Russell T. Davies approached her to come back again, this time to a Doctor Who backed by lavish budgets and garlanded with critical plaudits, how could she possibly say no? Funny, ridiculous, insightful, and entertaining, hers is the story of another girl, another planet, completed just months before she died.",
  "genres": [
    "Doctor Who",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "Memoir",
    "Tv",
    "Audiobook"
  ],
  "author": "Elisabeth Sladen",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/6928115-elisabeth-sladen-the-autobiography"
}