{
  "title": "Dois irmãos",
  "description": "Onze anos depois da publicação de Relato de um certo Oriente, Milton Hatoum retoma os temas do drama familiar e da casa que se desfaz. O enredo desta vez tem como centro a história de dois irmãos gêmeos — Yaqub e Omar — e suas relações com a mãe, o pai e a irmã. Moram na mesma casa Domingas, empregada da família, e seu filho, um menino cuja infância é moldada justamente por esta condição: ser o filho da empregada.Dois irmãos é a história de como se constroem as relações de identidade e diferença nessa casa. Mas o lugar da família se estende ao espaço de Manaus, o porto à margem do rio Negro: a cidade e o rio, metáforas das ruínas e da passagem do tempo, acompanham o andamento do drama familiar.O narrador busca a identidade de seu pai entre os homens da casa, entre os restos de outras histórias. Tenta reconstruir os cacos do passado, ora como testemunha, ora como quem ouviu e guardou, mudo, as histórias dos outros. Do seu canto, ele vê personagens que se entregam ao incesto, à vingança, à paixão desmesurada. Num jogo de inventar a memória, tenta transformá-la em ponto de convergência do passado. Sua fala nos mostra Halim, o pai, sempre à espera da decisão mais acertada diante dos abismos familiares: a desmedida dedicação de sua mulher ao filho preferido, Omar; o trauma de Yaqub, o filho que, adolescente, foi levado a se separar da família; a relação amorosa entre Rânia e seus irmãos. De Domingas, o que ele nos diz é que esta é uma mulher que não fez escolhas.Em Dois irmãos os conflitos são alimentados pela rede de interditos no interior da família, e somente quando se passaram mais de trinta anos, quando quase todos já estão mortos, é que o narrador parece motivado a olhar para eles. Mas o relato que escreve — se é corroído pela dúvida e se dá todos os sinais de empenho em descobrir uma verdade qualquer — não parece amenizar o silêncio que o habita.O romance de Milton Hatoum impressiona pela verticalidade e delicadeza na composição do enredo e dos personagens. Há um jogo minucioso com a linguagem cujo resultado é a impossibilidade de estabelecer um sentido prévio à narrativa. Esse sentido será, aos poucos, construído no próprio ato da leitura.",
  "genres": [
    "Fiction",
    "Brazil",
    "Romance",
    "Portuguese Literature",
    "Historical Fiction",
    "Drama",
    "Classics"
  ],
  "author": "Milton Hatoum",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/6931717-dois-irm-os"
}