{
  "title": "Rock and Roll Will Save Your Life: A Book by and for the Fanatics Among Us",
  "description": "Drooling fanatic, n. 1. One who drools in the presence of beloved rock stars. 2. Any of a genus of rock-and-roll wannabes/geeks who walk around with songs constantly ringing in their ears, own more than 3,000 albums, and fall in love with at least one record per week. With a life that’s spanned the phonographic era and the digital age, Steve Almond lives to Rawk. Like you, he’s secretly longed to live the life of a rock star, complete with insane talent, famous friends, and hotel rooms to be trashed. Also like you, he’s content (sort of) to live the life of a rabid fan, one who has converted his unrequited desires into a (sort of) noble obsession.    Rock and Roll Will Save Your Life traces Almond’s passion from his earliest (and most wretched) rock criticism to his eventual discovery of a music-crazed soul mate and their subsequent production of two little superfans. Along the way, Almond reflects on the delusional power of songs, the awkward mating habits of drooling fanatics, and why Depression Songs actually make us feel so much better. The book also  • sometimes drunken interviews with America’s finest songwriters• a recap of the author’s terrifying visit to Graceland while stoned• a vigorous and credibility-shattering endorsement of Styx’s Paradise Theater• recommendations you will often choose to ignore• a reluctant exegesis of the Toto song “Africa”• obnoxious lists sure to piss off rock critics But wait, there’s more. Readers will also be able to listen to a special free mix designed by the author, available online at www.stevenalmond.com, for the express purpose of eliciting your drool. For those about to rock—we salute you!",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Humor",
    "Essays",
    "Pop Culture",
    "Biography"
  ],
  "author": "Steve Almond",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/6933118-rock-and-roll-will-save-your-life"
}