{
  "title": "Armageddon des Kommunismus: Strategie Wirtschaft und die DDR, 1970 - 1990",
  "description": "In particular, Schulte's work illustrates how critical it is for the historian of international conflict to be aware of the industrial-economic potential of the competing powers and to understand how this as a \"structure de longue durée\" impacts on policy making. Schulte is very interested in the economies of the Soviet bloc countries in general and that of the former GDR in particular. It was crucial that during the East- West conflict these so-called command economies could deliver the necessary means to ensure that their military capacity could approximate that of the West. Schulte's work lays bare the economic realities of the Warsaw pact countries and highlights their underlying dependence on trade with the capitalist West. In all this the renowned economic strength of the Federal Republic of Germany from Adenauer to Kohl was a factor of the highest importance. Ultimately the economy of the rival German Democratic Republic was dependent upon both the formal political and the behind-the scenes economic arrangements made between the leaders of West German industries, particularly automobile concerns, and their communist counterparts. John Moses, University of Brisbane, Austral Prof. Joerg Roesler Schwierige Geburt eines deutsch-deutschen Automobildeals. Der Autor, ein Hamburger Sozial- und Wirtschaftshistoriker, erhielt 1986 das Angebot, einen Film zum Thema \"100 Jahre Geschichte der deutschen Automobilindustrie\" produzieren. Er versuchte an die in sächsischen Archiven lagerten Akten der Auto Union heranzukommen und scheiterte. Zehn Jahre später beantragte Schulte bei der Gauck-Behörende ein Forschungsprojekt, welches die Beziehungen zwischen der west- und der ostdeutschen Autoindustrie zum Gegenstand hatte. Zwischen 1996 und 2003 hat der Autor intensiv in die Akten der MfS-Hauptabteilung XVIII \"Volkswirtschaft\" studiert und aus dem Wust von Unterlagen wesentliche Informationen zu den Beziehungen zwischen westdeutschen Konzernen und ostdeutschen Partei- und Re",
  "genres": [],
  "author": "Schulte",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/6932133-armageddon-des-kommunismus"
}