{
  "title": "A Ticket to the Circus: A Memoir",
  "description": "A great American love story, this warm, funny, revealing memoir introduces the world to Norman Mailer’s greatest inspiration, his wife of more than thirty years. Like Zelda Fitzgerald before her, Norris Church Mailer has led a life as large and as colorful as her husband’s—and every bit as engaging.Growing up a strict Free Will Baptist in the South of the 1950s, Norris Church, christened Barbara Jean Davis, was crowned “Little Miss Little Rock” at the age of three and always knew that life had more to offer her than the comforts of small-town Arkansas. But she could never have guessed that in her early twenties she would date future president Bill Clinton (and predict his national victory even after he lost his first run for Congress), or that the following year she would meet Norman Mailer, who was passing through town giving a lecture at the local college. They fell in love in one night—and their marriage lasted thirty-three years.Despite her enduring love for the man, Norris found life with the writer full of challenges—from carving out her own niche in the wake of five ex-wives and numerous former girlfriends, to easing her way into the hearts of her seven stepchildren, to negotiating the ferocious world of Mailer’s fame, friends, and literary life. The couple’s New York parties were legendary, and their social circle included such luminaries as Muhammad Ali, Jacqueline Kennedy, Truman Capote, Gore Vidal, and Imelda Marcos.Their decades-long obsession with each other, as seen in the intimate letters that Norris reveals here for the first time, was not without tests and infidelities; theirs was a marriage full of friendship, betrayal, doubts, understanding, and deep, complicated, lifelong passion.With southern charm and wit, Norris Church Mailer depicts the full evolution of her life, from her childhood all the way through her intense marriage with Norman and his heartbreaking death. This unforgettable memoir will enchant readers with its honesty and insight into how we grow up and how we love.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "History",
    "Book Club",
    "Family"
  ],
  "author": "Norris Church Mailer",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/6933081-a-ticket-to-the-circus"
}