{
  "title": "Fakta om Finland",
  "description": "\"Fakta om Finland\" handler om en brosjyreskaper som frykter vann og flyt, og som hele tiden selv flyter, mens han jobber på en brosjyre som skal få flere nordmenn til å reise til Finland, et land han overhodet ikke har noe forhold til.Jeg drømmer om vann igjen. Drømmer at vannet er på meg og i meg og rundt meg, og at det flyter og flommer og drypper, og jeg har hørt at det å drømme om vann betyr forandring og hver gang jeg drømmer om vann tenker jeg; satan, forandring nå igjen. Skal det aldri ta slutt?Slik åpner Erlend Loes fjerde roman. Hovedpersonen er brosjyreskaper, og han har nettopp fått en forespørsel fra den finske ambassaden om å skrive en brosjyre om Finland for å øke nordmenns interesse for ferielandet i øst. Samtidig oppdager han at bilen hans er borte fra den faste parkeringsplassen, stjålet antar han, og ankommer derfor Finlands ambassade i drosje. Her lyver han på seg en finsk bestemor og hennes finske matretter i aspik, samt en ikke ubetydelig forståelse for finsk språk, og dermed er jobben hans.Senere forstår han at bilen er tauet vekk, for tredje år på rad, i anledning den årlige feiingen av gatene før 17.mai. Så snart forskuddet fra ambassaden er inne på kontoen, drar han for å løse ut bilen. I luken treffer han en ung kvinne som gjør et visst inntrykk på ham, så pass at han sørger for å feilparkere igjen allerede samme kveld. Den unge kvinnen har en lillebror som heter Bim, som har forlest seg på islandske ættesagaer og dermed havnet i dårlig politisk selskap. Søsteren setter sin lit til at brosjyreskaperen skal ordne opp.Fakta om Finland er preget av Erlend Loes særegne humor, men samtidig fornemmer man en understrøm av lengsel og ensomhet hos hovedpersonen. Han frykter vann og flyt, han frykter forandring. Han er en sær og ganske skrudd person som lett lar seg besnære av sine egne fantasier og tanker i brosjyreskapingen hvor Sibelius, retter i aspik, Marimekko, og ikke til å unngå vannet (nesten tohundretusen sjøer!) er viktige komponenter.",
  "genres": [
    "Fiction",
    "Humor",
    "Contemporary",
    "Novels",
    "Roman",
    "Scandinavian Literature",
    "Audiobook"
  ],
  "author": "Erlend Loe",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/693259.Fakta_om_Finland"
}