{
  "title": "The China Bride",
  "description": "Award-winning author Mary Jo Putney captivated the hearts of readers everywhere with her breathtaking hardcover debut, The Wild Child. Now, in her spectacular new novel The China Bride, she has created another brilliantly moving love story, and a very special heroine--a rare beauty torn between two cultures who valiantly struggles to discover the woman she is destined to be.Born to a Scottish father and now living in China, Troth Montgomery grew up speaking several languages and thinking of faraway England as home. Enduring life as a concubine, she never imagined that one day she would leave the Orient, arriving in bitter winter at the estate of a stranger--the brother of the man who had briefly been her husband. Kyle Renbourne, Viscount of Maxwell, had taken Troth as his bride shortly before his apparent execution in a Chinese prison. Now, as his widow, she is entitled to the home she always dreamed of but remains haunted by the memory of a dashing husband and the brief, forbidden love they shared.Then Kyle seemingly returns from the dead. Though he has survived, his mind and body are badly wounded. He needs time to heal and retreats from the exotic wife he barely knows. Bitterly aware that she will never be a fitting English wife, Troth defiantly embraces her foreign traditions, hoping that the ancient arts of her ancestors will restore Kyle's spirit and her own battered heart. Together they embark on a miraculous journey of hope and faith as Kyle becomes enchanted with the intimate tranquillity he shares with his bewitching Troth. But before he can win back his China bride, Kyle must first face a deadly menace that has followed them halfway across theworld. . . .Written with exquisite elegance and gentle passion, The China Bride is a stirring tale of everlasting love and the power of forgiveness, by a master storyteller.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Regency Romance",
    "Fiction"
  ],
  "author": "Mary Jo Putney",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/692948.The_China_Bride"
}