{
  "title": "Cast Member Confidential: A Disneyfied Memoir",
  "description": "What do you do when everything in your life falls apart? If you're Chris Mitchell, you run away from home--all the way to Disney World, a place where no one ever dies--and employees, known as Cast Members, aren't allowed to frown. Mitchell shares the behind-the-scenes story of his year in the Mouse's army. From his own personal Disneyfication, to what really happens in the hidden tunnels beneath the Magic Kingdom and what not to eat at the Mousketeria, it was a year filled with more adventure--and surprises--than he could ever have \"imagineered.\"Funny and moving, Mitchell tracks his ascent through the backstage social hierarchy in which princesses rule, and his escapades in the \"Ghetto\" where Cast Members live and anything goes. Along the way, he unmasks the misfits and drop-outs, lifers and nomads who leave their demons at the stage door as they preserve the magic that draws millions to this famed fantasyland--the same magic that Mitchell seeks and ultimately finds in the last place he ever expected.Chris Mitchell is an action sports photographer and journalist who grew up in Los Angeles. He was a senior at UCLA when he started his first magazine, an inline skating publication, and sold it to Sports & Fitness Publishing. Within a few years, he was working on five magazines within The Surfer Group. He continues to work closely with a number of publications and websites, as well as event and TV production companies like ESPN, ASA Entertainment and Lifelounge. He is a recognized expert in action sports, and as such, has stunt coordinated dozens of productions, including Batman and Robin, Brink! and Airborne. He is also the Chairman of the International Inline Stunt Federation for the advancement of extreme skating as a healthy and safe activity. After spending a year working as a photographer at Disney World in Orlando, Florida, he moved back to Los Angeles, where he currently lives.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Travel",
    "Biography Memoir",
    "Autobiography",
    "Humor"
  ],
  "author": "Chris Mitchell",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/6936341-cast-member-confidential"
}