{
  "title": "Journey's End: Bomber Command's Battle from Arnhem to Dresden and Beyond",
  "description": "A comprehensive account of the final year of the bomber war, filled with personal accounts of what it was like to fly over Arnhem, Dresden, and dozens of other missionsIn February 1945, British and American bombers rained down thousands of tons of incendiaries on the city of Dresden, creating one of the greatest firestorms in history. Their bombs killed an estimated 25,000 people, and wiped one of the most beautiful cities in Europe from the map. The controversy that erupted shortly afterwards, and which continues to this day, has long overshadowed the other events of the bomber war, and blighted the memory of the young men who gave their lives to fight in the skies over Germany. This book does not seek to condemn the bombing of Dresden, nor to excuse it, but simply to put it in its proper context as a particularly devastating set of raids in a much larger campaign. To the crews who flew over Germany night after night there were other much more pressing worries: the V2 rockets that threatened their loved ones at home, the brand new German jet fighters that could strike them at speeds of over 600mph, the deadly flak over the cities of the Ruhr Valley. They lived life at a heightened tempo, when hopes, ambitions, and desperate love affairs could be cut short in a single flash in the night sky. The bomber war had entered its final unforgiving months, and no quarter was given on either side. Kevin Wilson has interviewed more than 100 people, some of whom flew on the Dresden raids, and many more who experienced other aspects of bombing, both in the air and on the ground. As the final volume in his bomber war trilogy, it chronicles the climactic period in a conflict that caused devastation and tragedy on both sides.",
  "genres": [
    "World War II",
    "Nonfiction",
    "Military History"
  ],
  "author": "Kevin   Wilson",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/6936395-journey-s-end"
}