{
  "title": "On Hallowed Ground: The Story of Arlington National Cemetery",
  "description": "An intimate, behind-the-scenes chronicle of America’s most sacred ground.\n\n“Along Eisenhower Drive, as far as the eye could see, the grave markers formed into bone-white brigades, climbed from the flats of the Potomac River, and scattered over the green Virginia hills in perfect order. They reached Arlington’s highest point, where they encircled an old cream-colored mansion with thick columns and a commanding view of the cemetery, the river, and the city beyond. The mansion’s flag, just lowered to half-staff, signaled that it was time to start another day of funerals, which would add more than twenty new conscripts to Arlington’s army of the dead.”\nSo does Robert Poole describe a day like so many others in the long and storied history of Arlington National Cemetery. Created towards the end of our greatest national crucible, the Civil War, its story—as revealed in On Hallowed Ground—reflects much of America’s own over the past century and a half. The mansion at its heart, and the rolling land on which it sits, had been the family plantation of Robert E. Lee before he joined the Confederacy; strategic to the defense of Washington, it became a Union headquarters, a haven for freedmen, and a burial ground for indigent soldiers before Secretary of War Edwin Stanton made it the latest in the newly established national cemetery system. It would become our nation’s most honored resting place.\nNo other country makes the effort the United States does to recover and pay tribute to its war dead—an effort Poole reveals in poignant details from the aftermaths of the Civil War, Spanish-American War, World Wars I and II, Korea, Vietnam, and the conflicts in the Gulf and Afghanistan today. Every tombstone at Arlington tells a story: from Private William Christman, the first soldier buried at Arlington on May 13, 1864, to Union General Montgomery Meigs, whose idea Arlington was; from Lieutenant Thomas Selfridge, the first casualty of powered flight, to Audie Murphy, America’s most decorated soldier; from the Tomb of the Unknown Soldier, so lovingly tended today, to John F. Kennedy’s eternal flame; from scientists and slaves to jurists and generals and tens of thousands of ordinary citizen-warriors, among the more than 300,000 interred on Arlington’s 624 acres. Their sagas, and the rites and rituals that have evolved at Arlington—the horse-drawn caissons, marble headstones, playing of taps, and rifle salutes—speak to us all.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "American History",
    "Civil War",
    "War",
    "Military History"
  ],
  "author": "Robert M. Poole",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/6933281-on-hallowed-ground"
}