{
  "title": "The Secret of the Glass",
  "description": "The Murano glassmakers of Venice are celebrated and revered. But now three are dead, killed for attempting to leave the city that both prized their work and kept them prisoner. For in this, the 17th century, the secret of their craft must, by law, never leave Venetian shores. Yet there is someone who keeps the secret while defying tradition. She is Sophia Fiolario, and she, too, is a glassmaker. Her crime is being a woman. . .Sophia is well aware that her family would be crushed by scandal if the truth of her knowledge and skill with glass were revealed. But there has never been any threat. . .until now. A wealthy nobleman with strong connections to the powerful Doge has requested her hand in marriage, and her refusal could draw dangerous attention. Yet having to accept and cease her art would devastate her. If there is an escape, Sophia intends to find it.Now, between creating precious glass parts for one of Professor Galileo Galilei's astonishing inventions and attending lavish parties at the Doge's Palace, Sophia is crossing paths with very influential people--including one who could change her life forever. But in Venice, every secret has its price. And Sophia must decide how much she is willing to pay.Praise for Donna Russo Morin's The Courtier's Secret\"As opulent and sparkling as Louis XIV's court and as filled with intrigue, passion and excitement as a novel by Dumas. . .a feast for the senses.\" -- Romantic Times (4 stars)\"Vivid, delightful, spirited. . .a page-turner as smooth as fine cognac.\"–Steven Manchester, author of The Unexpected Storm\"A wonderfully spun gem of a story.\" -- Armchair ReviewsReading Group Guide Inside",
  "genres": [
    "Historical Fiction",
    "Italy",
    "Historical",
    "Fiction",
    "Romance",
    "17th Century",
    "Adult"
  ],
  "author": "Donna Russo Morin",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/6935197-the-secret-of-the-glass"
}