{
  "title": "Racial Americana (Volume 104)",
  "description": "If sociologist and cultural critic W. E. B. Du Bois proved prophetic about the twentieth century and its color lines, the beginning of the twenty-first century has given rise to divergent pronouncements about the potential of race relations and racial discourse in American society. Older categories of black victims and white victimizers hardly seem up to the task of making social sense out of today’s complex racial issues. Racial Americana explores new modes of racial theorizing that provide a more nuanced framework for understanding the social facts that underpin race (as belief system, as common sense, and as biological mythmaking), examining what those underpinnings forewarn about the future of social difference in the United States. Imagining America’s racialist future, the diverse contributors to this special issue—anthropologists, sociologists, historians, poets, and literary critics—offer their conceptualizations of race today, discuss how racial ideology has changed through the years, and explain its continuing ability to morph according to geopolitical, cultural, and economic strictures. Essays focus on how notions of race have helped constitute varied definitions of Americanness in the past and the present; offer critiques and recuperations of antiessentialist efforts; excavate the affective links between racism and patriotism after September 11; examine how race and gender intersect in the lives of African American jazz musicians; and determine what Du Bois's earlier arguments say about contemporary representations of “Latinidad.” Contributors . Elizabeth Alexander, Amiri Baraka, Tess Chakkalakal, Theodore A. Harris, John Hartigan Jr., Sharon P. Holland, John L. Jackson Jr., Marcyliena Morgan, Vijay Prashad, Don Robotham, Nichole T. Rustin, Brackette F. Williams",
  "genres": [],
  "author": "John L. Jackson Jr.",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/693332.Racial_Americana_Volume_104_"
}