{
  "title": "Milkweed [Hardcover] by Jerry Spinelli",
  "description": "Newbery Medal-winning author Jerry Spinelli (Maniac McGee, Stargirl) paints a vivid picture of the streets of the Nazi-occupied Warsaw during World War II, as seen through the eyes of a curious, kind, heartbreakingly naïve orphan with many names. His name is Stopthief when people shout \"Stop! Thief!\" as he flees with stolen bread. Or it's Jew, \"filthy son of Abraham,\" depending on who's talking to him. Or, maybe he's a Gypsy, because his eyes are black, his skin is dark, and he wears a mysterious yellow stone around his neck. His new friend and protector Uri forces him to take the name Misha Pilsudski and to memorize a made-up story about his Gypsy background so that no one will mistake him for a Jew and kill him. Misha, a very young boy, is slow to understand what's happening around him. When he sees people running, he thinks it's a race. Nazis (Jackboots, as the children call them) marching through the streets appear to him as a delightful parade of magnificent boots. He wants to be a Jackboot! (Uri smacks him for saying this.) He compares bombs to sauerkraut kettles, machine guns to praying mantises, and tanks to \"colossal gray long-snouted beetles.\" The story of Misha and his band of orphans trying to survive on their own would have a deliciously Dickensian quality, if it weren't for the devastation around them--people hurrying to dig trenches to stop Nazi tanks, shops exploding in flames, the wailing of sirens, buzzing airplanes, bombs, and human torture. Spinelli has written a powerfully moving story of survival--readers will love Misha the dreamer and his wonderfully poetic observations of the world around him, his instinct to befriend a Jewish girl and her family, his impulse to steal food for a local orphanage and his friends in the ghetto, and his ability to delight in small things even surrounded by the horror of the Holocaust. A remarkable achievement. (Ages 11 and older) --Karin Snelson",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Holocaust",
    "Fiction",
    "Historical",
    "World War II",
    "Middle Grade"
  ],
  "author": "Jerry Spinelli",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/69393.Milkweed_Hardcover_by_Jerry_Spinelli"
}