{
  "title": "The Mosaic of Shadows",
  "description": "Perfect for fans of Conn Iggulden, Lindsey Davis, Steven Pressfield, this breathtaking and captivating novel brings the Crusades to life in all their triumphant and tragic glory. 'Gripping from the first page, the reader is swept up in this colourful and convincing portrayal of an Emperor and his realm under siege.' - Ink'Superb read. Thoroughly enjoyed it' -- ***** Reader review'Highly enjoyable read' -- ***** Reader review'Brilliant.' -- ***** Reader review'Holds your interest from [the first] to the last page' -- ***** Reader review********************************************************************AN ASSASSIN IS ON THE LOOSE...AND AN EMPIRE STANDS IN PERILByzantium, 1096: When a mysterious assassin fires his arrow at the Emperor, he has more than a man in his sights; as the keystone of a crumbling empire, if he falls, then the mightiest power in Christendom will be torn apart. Aware of the stakes, the Emperor hires Demetrios Askiates, the unveiler of mysteries, to catch the would-be-killer.But Demetrios is entering an unknown and mysterious world and must edge his way through a glittering maze of treachery and deceit before time runs out. Nor are all enemies within the city walls. With the Turks rampant across Asia, the Emperor has sent to the west for mercenaries to reinforce his position.When a great army, tens of thousands strong, appears before the gates, he gets more than he bargained for. The first crusaders have arrived, intent on making their fortunes in war, and they have no allegiance to an empire they eye with jealousy and suspicion.As the armies of east and west confront each other, and the assassin creeps ever closer to his prey, Demetrios must untangle the golden web of intrigue which surrounds the Emperor before the city - and the empire - are drowned in blood.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Thriller",
    "Medieval"
  ],
  "author": "Tom Harper",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/693957.The_Mosaic_of_Shadows"
}