{
  "title": "Grand Central Arena",
  "description": "From Book 1: It was supposed to be a simple test flight, one that pilot Ariane Austin was on only as a last-ditch backup; intelligent, superhumanly fast automation would handle the test activation and flight of humanity's first faster-than-light vessel. But when the Sandrisson Drive activated, every automated system crashed, the nuclear reactor itself shut down, and only the reflexes and training of a racing pilot saved the test vessel Holy Grail from crashing into the impossible wall that had appeared before them, a wall which is just part of a monstrous enclosure surrounding a space twenty thousand kilometers across. With all artificial intelligences inert and their reactor dead, they had to find some other source of power to reactivate the Sandrisson Drive and—hopefully—take them home.And that was only the beginning. As Ariane, Dr. Simon Sandrisson, darkly enigmatic power engineer Marc C. DuQuesne, and the rest of the Holy Grail's crew explore the immense artifact, they discover that they are not alone; they have entered a place the alien inhabitants call \"The Arena,\" and there is no way out without joining one of the alien factions . . . or winning recognition as a faction in their own right, playing by the Arena's rules—and by the Arena's rules, one failed challenge could mean death or worse—perhaps for the entire human race. Surrounded by alien factions, each with its own secret plans and motivations, some wielding powers so strange as to be magical, Ariane sets out to beat the Arena at its own game. With DuQuesne's strategies, Sandrisson's genius, and her own unyielding determination, she's going to bring the Holy Grail home—even if she has to beat every faction in the Arena to do it!At the publisher's request, this title is sold without DRM (Digital Rights Management).",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Space",
    "Adventure"
  ],
  "author": "Ryk E. Spoor",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/6948420-grand-central-arena"
}