{
  "title": "City Of Fear",
  "description": "It's the height of the tourist season in Rome, and security is tight as world leaders gather for a G8 summit. While politicians bicker behind the walls of the illustrious Palazzo del Quirinale, a terrible threat is lurking outside--a threat that's been dormant for a long time but is now very much awake. In David Hewson's powerful new thriller, Detective Nic Costa and the men and women of the Questura must work in secret to thwart a conspiracy that reaches higher than any of them could have imagined.In the early hours of a sultry summer evening, a government car comes under fire along the narrow Via delle Quattro Fontane. When the shots die away, one person lies dead and another--Ministry of Interior official Giovanni Batisti--has been abducted.The terrible fate of the missing bureaucrat is soon revealed--leaving all of Italy in shock. Who would do such a thing? And why? All signs point to a mysterious terrorist group that calls itself the Blue Demon, an organization whose last campaign of violence ended two decades ago.For Detective Nic Costa, solving this case is an all-consuming obsession. But as he and his team begin their investigation, they find themselves reduced to expensive bodyguards--and their hands tied with red tape--until tragedy strikes and claims one of their own.Hampered at every turn by the Ministry of Interior's meddling security chief and a cagey and powerful prime minister, Costa and the members of his team are determined to pursue their quest for justice. As one terror attack after another sends the Eternal City spiraling into panic, Nic Costa vows that nothing will stop him from catching a vengeful madman bent on tearing apart his city, its people, and its very history.",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Italy",
    "Thriller",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "David Hewson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/6949490-city-of-fear"
}