{
  "title": "Bitter Waters: Life And Work In Stalin's Russia",
  "description": "One dusty summer day in 1935, a young writer named Gennady Andreev-Khomiakov was released from the Siberian labor camp where he had spent the last eight years of his life. His total assets amounted to 25 rubles, a loaf of bread, five dried herrings, and the papers identifying him as a convicted “enemy of the people.” From this hard-pressed beginning, Andreev-Khomiakov would eventually work his way into a series of jobs that would allow him to travel and see more of ordinary life and work in the Soviet Union of the 1930s than most of his fellow Soviet citizens would ever have dreamed possible. Capitalizing on this rare opportunity, Bitter Waters is Andreev-Khomiakov’s eyewitness account of those tumultuous years, a time when titanic forces were shaping the course of Russian history.Later to become a successful writer and editor in the Russian émigré community in the 1950s and 1960s, Andreev-Khomiakov brilliantly uses this memoir to explore many aspects of Stalinist society. Forced collectivization, Five Year Plans, purges, and the questionable achievements of “shock worker brigades” are only part of this story. Andreev-Khomiakov exposes the Soviet economy as little more than a web of corruption, a system that largely functioned through bribery, barter, and brute force—and that fell into temporary chaos when the German army suddenly invaded in 1941.Bitter Waters may be most valuable for what it reveals about Russian society during the tumultuous 1930s. From remote provincial centers and rural areas, to the best and worst of Moscow and Leningrad, Andreev-Khomiakov’s series of deftly drawn sketches of people, places, and events provide a unique window on the hard daily lives of the people who built Stalin’s Soviet Union.",
  "genres": [
    "History",
    "Nonfiction",
    "Russia",
    "Memoir",
    "Russian History",
    "Russian Literature"
  ],
  "author": "Gennady Andreev-Khomiakov",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/694442.Bitter_Waters"
}