{
  "title": "دوي الصمت",
  "description": "هذا العمل الروائي عاش كاتبه بالفعل أغلب صفحاته يواجه الهلاك مواجهة بدت لا فكاك منها، وهو يخوض كضابط بالجيش أهوال حروب رافقته رحلة حياته في يونيو 1967م ، حرب الاستنزاف، أكتوبر1973م يعاني ويلاتها بكل قلبه وإحساسه مكتوياً بلظاها، مكتسباً تلك المعرفة التي لا تقدر بثمن.من هنا تصنع الحروب روائييها، وكما تعلم أن مَنْ يتصدى للكتابة عن الحرب لا بد أن يكون أديباً خاض غمارها بنفسه، وعندما نتناول الأعمال التي كُتبت عن الحروب نجد مؤلفيها قد شاركوا في تلك الحروب الداميةعلى سبيل المثال:كتب ليو تولستوي روايته (الحرب والسلام) ، وأرنست هيمنجواي (وداعاً للسلاح) وإليك نماريا ريماك روايته (كل شيء هادئ في الميدان الغربي)، وذلك يعد دليلاً عظيماً على أن من يكتب عن الحرب لا بد أن يكون أديباً تمرس في تجربتها.ولكن الأعمال الروائية التي تناولت حرب أكتوبر المجيدة إما أنها لأدباء لم يعيشوا تجربة الحرب أو عسكريين طغى الجانب التاريخي على كتاباتهم... ولأول وهلة قد يظن البعض أن هذه الرواية (دويُّ الصمت) جاءت لتمجد بطولات مؤلفها علاء مصطفى كضابط مع جنوده وفدائيتهم أثناء الحرب، كما توقع البعض أن تسخر الرواية من العدو الإسرائيلي وتحقر من قوته، ولكن خالفت الرواية كل الظنون والتوقعات وانطلق مؤلفها ناقماً على أهوال الحروب ومآسيها ومعبراً عن أعظم المواقف الإنسانية في الحب والحرب في لغة شاعرية رقيقة تجعلها تتربع بعبقرية واقتدار بين الروايات التي تناولت ملحمة أكتوبر العظيمة.وهي ليست تأريخاً لبطولات عسكرية فحسب أو عملاً أدبياً بحتاً، بل هي رواية تحقق المعادلة الصعبة في المزج بين التفاصيلالفنية لسير المعارك العسكرية، والجانب الأدبي المفعم بالمشاعر والروح الإنسانية الفياضة المتضمنة مآثر الحرب والنضال وقصص الحب العارم التي تدور أحداثها بين دول متفرقة.و(دوي الصمت) لم يقتصر صداه على جبهة القتال فقط، بل تردد في القرية والمدينة وتجاوز الحدود أيضاً.ولم يقتصر كذلك على القنابل أو الطائرات، بل كانت متأججة به القلوب والمشاعر والحناجر، ومن خلال أحداث الرواية نلمس مدى صدق المؤلف في نقل الآلام والأهوال التي ترتبت على الحرب \"ومنهم من شقت جماجمهم أو يركضون بسيقان مبتورة دامية بين تعالي صرخات الجرحى الممددين على الأرض الذين كانوا يتشبثون بأقدامهم والشظايا مشتعلة تصفر بجوار آذانهم من كل صوب\" (ص 16).\"وفي اللحظة نفسها تراجع في براعة خوفاً من أن تصيبه دفعة طلقات وانحنى من جديد، فطارت شظية ذبحته واقفاً ففصلت الرأس عن جسده وفي الثانية الأولى لانفصال الرأس امتدت يد الملازم وأمسكت برأسه ووضعتها فوق الرقبة ثم هوى على الأرض \" (ص 28).والحرب لا تفرق بين عسكري ومدني إنها مثل الطوفان يكتسح كل شيء أمامه أخضر أو يابس \" وحينما سُئلت عن مكان إخفائهم رجال المقاومة كانت لا تنظر إلى أحد وتعصر صغيرها إلى صدرها وتتكلم معه طوال الوقت: ماما معك .. ماما معك.. ماما ستبقى معك طوال الوقت.. ماما معك ورقدت دون مقاومة بعد تلقيها دفعة رشاش وكان الصغير يتعثر بجثة أمه الهامدة وهو يرفع يدين صغيرتين ناحية الجندي وهو يظن أنه يداعبه\" (ص 53).وكثيرون هم الذين أصابتهم ويلات الحرب دون ذنب أو جريمة اقترفوها، \"وعلى أرض شققتها الانفجارات وتعرجت بركام الانهياراتمضى الآلاف من المهجرين ممن انهالت عليهم الحرب بمصائب لا تطاق تاركين أموالهم وممتلكاتهم طلباً للنجاة ويسير بينهم متخبطاً عشرات الأطفال بوجوه ناحلة تعبة دون أن يدري أحد إلى أين يذهبون\" (ص 147).وتعد رواية ( دويُّ الصمت) شاهد إثبات على جرائم قتل آلاف الأسرى المصريين خلال حرب يونيو 1967م حيث تجسدها لنا الرواية. \"تلاعبت ابتسامة رقيقة على شفتي الطبيب وقال: إن أحد أبنائنا أصيبت عيناه أثناء الحرب وحتى يبصر سأحتاج إلى أخذ عينيك وكانت ابتسامة الطبيب آخر ما وقع عليه بصر الأسير إلى الأبد\"(ص 156)وفي الحرب عندما تندلع آلاتها الصماء، فإنها تغتال البراءة والحلم، \"اندفعت الأم نحوهما كالطفلة وقد تميز بوضوح أزيز الطائرات... ترددت صرخة الأم لا يماثلها في الهول شيء... غير أن سبق احتضانها طفليها مشاهدتها القنابل تسقط من كوة الطائرة في هجوم صاعق لم تبخل فيه القيادة الإسرائيلية بكميات هائلة من آليات الدمار، محت البيت الجميل عن سطح الأرض ساحقة الأم وطفليها مختلطة أشلاؤهم بالحوائط والقواعد الخرسانية\"(ص 142).وكما سبق القول هذه الرواية تخاطب الضمير الإنساني، وتتيح للقارئ فرصة التعرف على نبض الآلة الجبارة للحرب وتخاطب داخله النضال ضد الحرب والعمل من أجل قضايا السلام والحرية والحياة السعيدة على الأرض \" تلاعب ابتسامة عجيبة على شفتيه وانفرجتا تتمتمان بلغة الشحوب: إنني أفارق الحياة، لم تكتب لي سعادة رؤية الحياة التي ناضلنا من أجلها ولكن كتب لي أن أهب حياتي من أجلها.. يا لها من حياة ستكون رائعة\" (ص 439).ويمكننا القول بأن أحداث الرواية قد تناولت الجانب الإنساني دون تحيز مغرض أو مفتعل.. وكان هذا العمل (دويُّ الصمت) أمانة في عنق المؤلف والمقاتل الذي أخرج ما بداخله من تضحيات وبطولات وأحلام وقدمه \"إلى الذين أطبقت عليهم ميادين القتال وماتوا أبطالاً لم يدر عنهم أحد...\".إن هذا العمل كُتب لكي تقرأه الأجيال القادمة التي قد تكون ملحمة أكتوبر العظيمة مجرد ذكرى بالنسبة لهم دون أن يستطيعوا استيعابها بالأذن والعين والوجدان.",
  "genres": [],
  "author": "علاء مصطفى",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/6946134"
}