{
  "title": "Mrs. Searwood's Secret Weapon",
  "description": "(Found on the jacket cover)Mrs. Searwood, a mature widow, lived alone in England while the Second World War went on and on. One day she was adopted by the three-hundred-year-old spirit of a lonely American Indian. Then, suddenly, she gave in to her only daughter's \"truly awful drive for organizing,\" and left the dangers of London for the tranquility of Lower Pupton le Soeur. She was not lonely any more. For in Lower Pupton she met Parson Pendlebury, a tall spare man whose brown eyes had a chuckle in them and whose carriage told of a youth more athletic than clerical. At their very first meeting they joined forces. There was to be a garden party to raise funds, for the ancient structure of St. Cedric's Church badly needed restoring. Especially the stained-glass window picturing Cedric himself--who since early Saxon times had in some way become known as a patron saint of lovers. In Berlin in 1935, Mrs. Searwood had called the Germans a dirty lot; she could hardly have foreseen then that the slight would cause Hitler to single her out so many years later for his special revenge--bombing first her apartment and then the warehouse that held her belongings. After such trials in London, she found life in Lower Pupton a great relief. Here the people were so friendly--Mr. Wedge and his irrepressible wife; young Ronnie Briggs, RAF, and his fiancee; Mrs. Skipton the housekeeper. But that was before the extraordinary climax of Leonard Wibberley's unusual novel--an explosive event that sent Mrs. Searwood out to clear her name before all of Lower Pupton and all of England. Though none of this surprised Mrs. Manners, who was \"just like a broadcasting station that has to go on the air at regular intervals with the latest news.\" Mrs. Manners might well have been surprised to see Mrs. Searwood chatting pleasantly with the Prime Minister at No. 10 Downing Street; but once she had spread her theory that the newcomer was Rudolph Hess's wife, still spying for Germany, there were few in Lower Pupton who were not set wondering. Mrs. Searwood's Secret Weapon combines fantasy, wit, and lovable common sense to show, in the author's words, \"that it is not necessary for people to live dull and drab lives because they are middle-aged. They can still fall in love, still be stirred by the coming of spring and summer, still plan for a future rather than brood over the past.\"",
  "genres": [],
  "author": "Leonard Wibberley",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/10325045-mrs-searwood-s-secret-weapon"
}