{
  "title": "Defying Mental Illness: Finding Recovery With Community Resources and Family Support",
  "description": "Defying Mental Illness is a plain-language guide to recovery from mental illness. Its strengths-based approach makes mental health disorders and treatment understandable. Covers schizophrenia, depression, bipolar disorder, PTSD, autism, suicide prevention, childhood mental illness and more.The book is simply written but very complete. It is suitable for community outreach work and as a basic textbook.Includes brief descriptions of mental illness symptoms such as hallucinations, delusions, mood swings and other behavior changes, and describes major mental health disorders including schizophrenia, bipolar disorder, depression, anxiety disorder, post-traumatic stress disorder, and borderline personality disorder.Uses a developmental approach to childhood mental illness, contrasting ordinary childhood patterns with the extreme symptoms that may require intervention. The book suggests using benign, safe parenting techniques that improve structure and reduce stress, and supports a thoughtful approach to initiating treatment. Also covered are developmental disabilities like autism and fetal alcohol syndrome, as well as special education, including individualized education plans (IEPs) and so-called 504 plans.Sections on treatment discuss both therapy and medication, offering brief notes on various categories of medication. The book emphasizes the need to understand risks and benefits when deciding about any course of treatment.The book discusses planning for safety in advance of a mental health crisis, and covers responding to a person in crisis, assessing risk of violence, and preventing suicide. The book suggests ways to help people who become involved in the criminal justice system, and covers involuntary hospitalization and guardianship.Further chapters discuss ways to locate treatment, find or retain housing, maintain employment or access vocational rehabilitation services. There is coverage of Social Security and SSI disability benefits and claims process, plus information about Medicare and Medicaid.The book concludes with chapters on allies and advocacy, including grievances within treatment programs, plus a planning process that helps create opportunities for people with mental illness and their families to reckon with their challenges and move forward with their lives.",
  "genres": [],
  "author": "Paul Komarek",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13005482-defying-mental-illness"
}