{
  "title": "The Oxford Companion to Food",
  "description": "Twenty years in the making, the first edition of Alan Davidson's magnum opus appeared in 1999 to worldwide acclaim. Its combination of serious food history, culinary expertise, and entertaining serendipity was recognized as utterly unique. Including both an exhaustive catalogue of the foodsthat nourish humankind-fruit from tropical forests, mosses scraped from adamantine granite in Siberian wastes, or ears, eyeballs and testicles from a menagerie of animals-and a richly allusive commentary on the culture of food, whether expressed in literature and cookbooks, or as dishes peculiar toa country or community, the Oxford Companion to Food immediately found distinction.The study of food and food history was a new discipline at the time, but one that has developed exponentially in the years since. There are now university departments, international societies, and academic journals, in addition to a wide range of popular literature exploring the meaning of food inthe daily lives of people around the world.Alan Davidson famously wrote eighty percent of the first edition, which was praised for its wit as well as its wisdom. Tom Jaine, the editor of the second edition, worked closely with Jane Davidson and Helen Saberi to ensure that new contributions continue in the same style. The result is anexpanded volume that remains faithful to Davidson's peerless work. The text has been updated where necessary to keep pace with a rapidly changing subject, and Jaine assiduously alerts readers to new avenues in food studies. Agriculture; archaeology; food in art, film, literature, and music;globalization; neuroanatomy; and the Silk Road are covered for the first time, and absorbing new articles on confetti; cutlery; doggy bags; elephant; myrrh; and potluck have also found their way into the Companion.",
  "genres": [
    "Food",
    "Cookbooks",
    "Reference",
    "Cooking",
    "Nonfiction",
    "Food and Drink",
    "History"
  ],
  "author": "Alan Davidson",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/130058.The_Oxford_Companion_to_Food"
}