{
  "title": "Amandine",
  "description": "Marlena de Blasi, the acclaimed author of such delectable memoirs as A Thousand Days in Venice and That Summer in Sicily, now brings her luminous prose to the world of fiction with this remarkable debut novel. Set against the backdrop of Europe as it moves inexorably toward World War II, Amandine follows a young orphan’s journey in search of her heritage.The story opens in Krakow in 1931, as a baby girl is conceived out of wedlock, the byproduct of a foolish heart and a tragic inheritance. The child’s grandmother, a countess, believes that she is protecting her daughter when she claims that the baby didn’t survive. In truth, however, she deposits the infant at a remote convent in the French countryside, leaving her with a great sum of money and in the care of a young governess named Solange. Solange takes it upon herself to give the child a distinctive name, Amandine, and the two form a special bond. But even Solange’s unconditional love cannot protect her charge. Mistrusted by both the abbess and the convent girls, the unusually astute and curious Amandine finds her childhood filled with challenges and questions: Who is she? Where does she come from?    Eventually, Solange is forced to choose between the terrors of the convent and those of a global war looming outside its doors. Thus, with a purse full of worthless francs and a sack of provisions, the two flee north toward Solange’s childhood home. But what should have been a two-day journey by train becomes a perilous, years-long odyssey across Occupied France—and deeper into the treacheries of war.Tracing the flight of Amandine and Solange while peering into the lives of the countess and her daughter, Amandine’s mother, who still mourns and dreams of the child she thinks she lost forever, Marlena de Blasi’s epic novel winds its way toward a dramatic and compelling conclusion, as mother and daughter draw ever nearer. Amandine is a sumptuous tale of identity and survival, persistent hope and unexpected love.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "France",
    "Historical",
    "War",
    "Italy",
    "World War II"
  ],
  "author": "Marlena de Blasi",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/6950200-amandine"
}