{
  "title": "Rediscovering Values: On Wall Street, Main Street, and Your Street",
  "description": "When we start with the wrong question, no matter how good an answer we get, it won’t give us the results we want. Rather than joining the throngs who are asking, When will this economic crisis be over? Jim Wallis says the right question to ask is How will this crisis change us?The worst thing we can do now, Wallis tells us, is to go back to normal. Normal is what got us into this situation. We need a new normal, and this economic crisis is an invitation to discover what that means. Some of the principles Wallis unpacks for our new normal are . . .• Spending money we don’t have for things we don’t need is a bad foundation for an economy or a family.• It’s time to stop keeping up with the Joneses and start making sure the Joneses are okay.• The values of commercials and billboards are not the things we want to teach our children.• Care for the poor is not just a moral duty but is critical for the common good.• A healthy society is a balanced society in which markets, the government, and our communities all play a role.• The operating principle of God’s economy says that there is enough if we share it.• And much, much more . . .In the pages of this book, Wallis provides us with a moral compass for this new economy—one that will guide us on Wall Street, Main Street, and Your Street.Embracing a New EconomyGetting back to \"the way things were\" is not an option. It is time we take our economic uncertainty and use it to find some moral clarity. Too often we have been ruled by the maxims that greed is good, it’s all about me, and I want it now. Those can be challenged only with some of our oldest and best values—enough is enough, we are in it together, and thinking not just for tomorrow but for future generations.Jim Wallis shows that the solution to our problems will be found only as individuals, families, friends, churches, mosques, synagogues, and entire communities wrestle with the question of values together .",
  "genres": [
    "Religion",
    "Nonfiction",
    "Politics",
    "Christian",
    "Christianity",
    "Economics",
    "Philosophy"
  ],
  "author": "Jim Wallis",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/6949666-rediscovering-values"
}