{
  "title": "Pearl of China",
  "description": "From the bestselling author of Red Azalea and Empress Orchid comes the powerful story of the friendship of a lifetime, based on the life of Pearl S. Buck.In the small southern town of Chin-kiang, in the last days of the nineteenth century, two young girls bump heads and become thick as thieves. Willow is the only child of a destitute family, Pearl the headstrong daughter of zealous Christian missionaries. She will ultimately become the internationally renowned author Pearl S. Buck, but for now she is just a girl embarrassed by her blonde hair and enchanted by her new Chinese friend. The two embark on a friendship that will sustain both of them through one of the most tumultuous periods in Chinese history. Moving out into the world together, the two enter the intellectual fray of the times, share love interests and survive early marriages gone bad. Their shared upbringing inspires Pearl's novels, which celebrate the life of the Chinese peasant and will eventually earn her both a Pulitzer and a Nobel Prize. But when a civil war erupts between the Nationalists and Communists, Pearl is forced to flee the country just ahead of angry mobs. Willow, despite close ties to Mao’s inner circle, is punished for loyalty to her 'cultural imperialist' friend. And yet, through love and loss, heartbreak and joy, exile and imprisonment, the two women remain intimately entwined. In this ambitious new novel, Anchee Min brings to life a courageous and passionate woman who is now hailed in China as a modern heroine. Like nothing before it, Pearl of China tells the story of one of the twentieth century’s greatest writers, from the perspective of the people she loved and of the land she called home.",
  "genres": [
    "Historical Fiction",
    "China",
    "Fiction",
    "Asia",
    "Historical",
    "Book Club",
    "Asian Literature"
  ],
  "author": "Anchee Min",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/6951073-pearl-of-china"
}