{
  "title": "No Treason: The Constitution of No Authority",
  "description": "2009 Reprint of the original 1870 edition. Paperback 55pp. Lysander Spooner (January 19, 1808 - May 14, 1887) was an American anarchist, entrepreneur, political philosopher, abolitionist, supporter of the labor movement, and legal theorist of the nineteenth century. He is also known for competing with the U.S. Post Office with his American Letter Mail Company, which was forced out of business by the United States government. He has been identified by some contemporary writers as an anarcho-capitalist, while other writers and activists are convinced by his advocacy of self-employment over working for an employer for wages, that he was an anti-capitalist or a socialist, notwithstanding his support for private ownership of the means of production and a free-market economy. No Treason has it origins in The Union government's actions during the Civil War. In response, Spooner published one of his most famous political tracts, No Treason. In this lengthy essay, Spooner argued that the Constitution was a contract of government which had been irreparably violated during the war and was thus void. Furthermore, since the government now existing under the Constitution pursued coercive policies that were contrary to the Natural Law and to the consent of the governed, it had been demonstrated that document was unable to adequately stop many abuses against liberty or to prevent tyranny from taking hold. Spooner bolstered his argument by noting that the Federal government, as established by a legal contract, could not legally bind all persons living in the nation since none had ever signed their names or given their consent to it - that consent had always been assumed, which fails the most basic burdens of proof for a valid contract in the courtroom. Spooner widely circulated the No Treason pamphlets, which also contained a legal defense against the crime of treason itself intended for former Confederate soldiers (hence the name of the pamphlet, arguing that \"no treason\" had been committed in the war by the south). These excerpts were published in DeBow's Review and some other well known southern periodicals of the time.",
  "genres": [
    "Politics",
    "Philosophy",
    "Nonfiction",
    "History",
    "Law",
    "Economics",
    "Essays"
  ],
  "author": "Lysander Spooner",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/6950913-no-treason"
}