{
  "title": "Blood Will Have Its Season",
  "description": "The dark, forbidding alleys of our ruined cityscapes; the hopeless lives of brutalized whores, amoral hit-men, and vengeful victims of violence-these are the landscapes and characters that fill the stories, poems, and prose-poems of Joseph S. Pulver, Sr. in his first collection. And yet, there is a strange and intoxicating beauty to Pulver’s creations, for they transport the reader out of the mundane and into the unearthly by the effortless stroke of a dazzling metaphor.Many of Pulver’s stories are innovative riffs on the enigmatic mythology of The King in Yellow, pregnant with the demonic witchery of the original. With this collection, Pulver has placed himself in the forefront of contemporary fantasy and horror literature.“The prose of Joe Pulver can take its place with that of the masters of our genre-Poe, Lovecraft, Campbell, Ligotti-while his imaginative reach is something uniquely his own.” — From S.T. Joshi’s Foreword“In this innovative, hypnotic collection, Joseph S. Pulver, Sr. has proven himself to be a perversely masterful sculptor of our dreams.”—Jeffrey Thomas“Joe Pulver is a dark star in the merciless cosmos of weird fiction. His work is as brutal as it is beautiful.” — Wilum Pugmire“In an earlier day I feel sure Joe Pulver would have been arrested for writing some of the stuff in this collection. Maybe he will be yet! How can he write, with such intricate delicacy, thunderous prose that fairly rips up the pages it is printed on? I wish I knew!” — Robert M. PriceJoseph S. Pulver, Sr. is the acclaimed author of the Lovecraftian novel Nightmare’s Disciple and author of many short stories that have appeared in magazines and anthologies. He has received several Honorable Mentions in Datlow & Windling’s The Year’s Best Fantasy and Horror.Table of Contents Choosing Carl Lee and Cassilda Line of Questions PITCH nothing I, Like the Coyote Blood Will Have Its Season mr wind sits The Prisoner An American Tango Ending in Madness Orchard Fruit The Songs Cassilda Shall Sing, Where Flap the Tatters of the King The Night Music of Oakdeene Dogs Begin to Bark All Over My Neighborhood Chasing Shadows But The Day Is A Tomb of Claws In This Desert Even The Air Burns And She Walks Into The Room . . . a certain Mr. Hopfrog, Esq., Nightwalker The Black Litany of Nug and Yeb Erendira An Engagement of Hearts An Event Without Knives or Rope One Side’s Ice, One’s Fire A Spider in the Distance PAIN A Night of Moon and Blood, Then Holstenwall Under The Mask Another Mask W a t e r l i l i e s Yvrain’s Black Dance No Exit Sign Lovecraft’s Sentence Midnight on a Dead End Street in Noir City The Master and Margeritha Hello Is A Yellow Kiss The Faces Of She Good Night And Good Luck Patti Smith, Lovecraft & I The Collector And The Hand Puppet The Only Thing We Have To Fear . . . The Corridor Stone Cold Fever",
  "genres": [
    "Horror",
    "Lovecraftian",
    "Short Stories"
  ],
  "author": "Joseph S. Pulver Sr.",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/6953004-blood-will-have-its-season"
}