{
  "title": "The Oxford Book of American Poetry",
  "description": "Here is the eagerly awaited new edition of The Oxford Book of American Poetry brought completely up to date and dramatically expanded by poet David Lehman. It is a rich, capacious volume, featuring the work of more than 200 poets-almost three times as many as the 1976 edition. With a succinct and often witty head note introducing each author, it is certain to become the definitive anthology of American poetry for our time.Lehman has gathered together all the works one would expect to find in a landmark collection of American poetry, from Whitman's Crossing Brooklyn Ferry to Stevens's The Idea of Order at Key West , and from Eliot's The Waste Land to Ashbery's Self-Portrait in a Convex Mirror . But equally important, the editor has significantly expanded the range of the anthology. The book includes not only writers born since the previous edition, but also many fine poets overlooked in earlier editions or little known in the past but highly deserving of attention. The anthology confers legitimacy on the Objectivist poets; the so-called Proletariat poets of the 1930s; famous poets who fell into neglect or were the victims of critical backlash (Edna St. Vincent Millay); poets whose true worth has only become clear with the passing of time (Weldon Kees). Among poets missing from Richard Ellmann's 1976 volume but published here are W. H. Auden, Charles Bukowski, Donald Justice, Carolyn Kizer, Kenneth Koch,Stanley Kunitz, Emma Lazarus, Mina Loy, Howard Moss, Lorine Niedecker, George Oppen, James Schuyler, Elinor Wylie, and Louis Zukosky. Many more women are outstanding poets such as Josephine Jacobsen, Josephine Miles, May Swenson. Numerous African-American poets receive their due, and unexpected figures such as the musicians Bob Dylan, Patti Smith and Robert Johnson have a place in this important work.This stunning collection redefines the great canon of American poetry from its origins in the 17th century right up to the present. It is a must-have anthology for anyone interested in American literature and a book that is sure to be consulted, debated, and treasured for years to come.",
  "genres": [
    "Poetry",
    "Reference",
    "Anthologies",
    "Fiction",
    "Classics",
    "American",
    "School"
  ],
  "author": "David Lehman",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/69553.The_Oxford_Book_of_American_Poetry"
}