{
  "title": "Marie-Thérèse, Child of Terror: The Fate of Marie Antoinette's Daughter",
  "description": "The first major biography of one of France's most mysterious women―Marie Antoinette's only child to survive the revolution.Susan Nagel, author of the critically acclaimed biography Mistress of the Elgin Marbles , turns her attention to the life of a remarkable woman who both defined and shaped an era, the tumultuous last days of the crumbling ancien régime . Nagel brings the formidable Marie-Thérèse to life, along with the age of revolution and the waning days of the aristocracy, in a page-turning biography that will appeal to fans of Antonia Fraser's Marie Antoinette and Amanda Foreman's Duchess of Devonshire .In December 1795, at midnight on her seventeenth birthday, Marie-Thérèse, the only surviving child of Marie Antoinette and Louis XVI, escaped from Paris's notorious Temple Prison. To this day many believe that the real Marie-Thérèse, traumatized following her family's brutal execution during the Reign of Terror, switched identities with an illegitimate half sister who was often mistaken for her twin. Was the real Marie-Thérèse spirited away to a remote castle to live her life as the woman called \"the Dark Countess,\" while an imposter played her role on the political stage of Europe? Now, two hundred years later, using handwriting samples, DNA testing, and an undiscovered cache of Bourbon family letters, Nagel finally solves this mystery. She tells the remarkable story in full and draws a vivid portrait of an astonishing woman who both defined and shaped an era. Marie-Thérèse's deliberate choice of husbands determined the map of nineteenth-century Europe. Even Napoleon was in awe and called her \"the only man in the family.\" Nagel's gripping narrative captures the events of her fascinating life from her very public birth in front of the rowdy crowds and her precocious childhood to her hideous time in prison and her later reincarnation in the public eye as a saint, and, above all, her fierce loyalty to France throughout.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "France",
    "Historical",
    "French Revolution",
    "European History"
  ],
  "author": "Susan Nagel",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/695689.Marie_Th_r_se_Child_of_Terror"
}