{
  "title": "A History of Christianity: The First Three Thousand Years",
  "description": "The author of The Reformation returns with the definitive history of Christianity for our time. Once in a generation a historian will redefine his field, producing a book that demands to be read--a product of electrifying scholarship conveyed with commanding skill. Diarmaid MacCulloch's Christianity is such a book. Ambitious, it ranges back to the origins of the Hebrew Bible and covers the world, following the three main strands of the Christian faith. Christianity will teach modern readers things that have been lost in time about how Jesus' message spread and how the New Testament was formed. It follows the Christian story to all corners of the globe, filling in often neglected accounts of conversions and confrontations in Africa and Asia. It discovers the roots of the faith that galvanized America, charting the rise of the evangelical movement from its origins in Germany and England. This book encompasses all of intellectual history--we meet monks and crusaders, heretics and saints, slave traders and abolitionists, and discover Christianity's essential role in driving the Enlightenment and the age of exploration, and shaping the course of WWI and WWII.We live in a time of tremendous religious awareness, when both believers & non-believers are engaged by questions of religion and tradition, seeking to understand the violence sometimes perpetrated in the name of God. The son of an Anglican clergyman, MacCulloch writes with feeling about faith. His last book, The Reformation, was chosen by dozens of publications as Best Book of the Year & won the Nat'l Book Critics Circle Award. This inspiring follow-up is a landmark new history of the faith that continues to shape the world.",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Christianity",
    "Theology",
    "Church History",
    "Christian"
  ],
  "author": "Diarmaid MacCulloch",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/6957725-a-history-of-christianity"
}