{
  "title": "Southern Horrors: Women and the Politics of Rape and Lynching",
  "description": "Between 1880 and 1930, close to 200 women were murdered by lynch mobs in the American South. Many more were tarred and feathered, burned, whipped, or raped. In this brutal world of white supremacist politics and patriarchy, a world violently divided by race, gender, and class, black and white women defended themselves and challenged the male power brokers. Crystal Feimster breaks new ground in her story of the racial politics of the postbellum South by focusing on the volatile issue of sexual violence.Pairing the lives of two Southern women--Ida B. Wells, who fearlessly branded lynching a white tool of political terror against southern blacks, and Rebecca Latimer Felton, who urged white men to prove their manhood by lynching black men accused of raping white women--Feimster makes visible the ways in which black and white women sought protection and political power in the New South. While Wells was black and Felton was white, both were journalists, temperance women, suffragists, and anti-rape activists. By placing their concerns at the center of southern politics, Feimster illuminates a critical and novel aspect of southern racial and sexual dynamics. Despite being on opposite sides of the lynching question, both Wells and Felton sought protection from sexual violence and political empowerment for women.\"Southern Horrors\" provides a startling view into the Jim Crow South where the precarious and subordinate position of women linked black and white anti-rape activists together in fragile political alliances. It is a story that reveals how the complex drama of political power, race, and sex played out in the lives of Southern women.",
  "genres": [
    "History",
    "Nonfiction",
    "Feminism",
    "Race",
    "American History",
    "Politics",
    "Gender"
  ],
  "author": "Crystal N. Feimster",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/6957610-southern-horrors"
}