{
  "title": "Annie's Ghosts: A Journey into a Family Secret",
  "description": "Beth Luxenberg was an only child. Or so everyone thought. Six months after Beth's death, her secret emerged. It had a Annie.Praise for Annie's Ghosts\" Annie's Ghosts is one of the most remarkable books I have ever read . . . From mental institutions to the Holocaust, from mothers and fathers to children and childhood, with its mysteries, sadness, and joy--this book is one emotional ride.\"--Bob Woodward, author of The War Within and State of Denial\"Steve Luxenberg sleuths his family's hidden history with the skills of an investigative reporter, the instincts of a mystery writer, and the sympathy of a loving son. His rediscovery of one lost woman illuminates the shocking fate of thousands of Americans who disappeared just a generation ago.\"--Tony Horwitz, author of A Voyage Long and Strange and Confederates in the Attic\"I started reading within minutes of picking up this book, and was instantly mesmerized. It's a riveting detective story, a moving family saga, an enlightening if heartbreaking chapter in the history of America's treatment of people born with what we now call special needs.\" -- Deborah Tannen, author of You Just Don't Understand and You're Wearing That\"This is a memoir that pushes the journalistic envelope . . . Luxenberg has written a fascinating personal story as well as a report on our communal response to the mentally ill.\" -- Helen Epstein, author of Where She Came From and Children of the Holocaust\"A wise, affecting new memoir of family secrets and posthumous absolution.\" -- The Washington Post\" Annie's Ghosts will resonate for many, whether the chords have to do with family secrets, the Depression, memories of a thriving Detroit, the Holocaust's horrors, or the immigrant experience.\" -- The Detroit Free Press",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Book Club",
    "History",
    "Mental Illness",
    "Mystery"
  ],
  "author": "Steve Luxenberg",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/6957510-annie-s-ghosts"
}