{
  "title": "Confession of a Buddhist Atheist",
  "description": "Written with the same brilliance and boldness that made Buddhism Without Beliefs a classic in its field, Confession of a Buddhist Atheist is Stephen Batchelor’s account of his journey through Buddhism, which culminates in a groundbreaking new portrait of the historical Buddha.Stephen Batchelor grew up outside London and came of age in the 1960s. Like other seekers of his time, instead of going to college he set off to explore the world. Settling in India, he eventually became a Buddhist monk in Dharamsala, the Tibetan capital-in-exile, and entered the inner circle of monks around the Dalai Lama. He later moved to a monastery in South Korea to pursue intensive training in Zen Buddhism. Yet the more Batchelor read about the Buddha, the more he came to believe that the way Buddhism was being taught and practiced was at odds with the actual teachings of the Buddha himself. Charting his journey from hippie to monk to lay practitioner, teacher, and interpreter of Buddhist thought, Batchelor reconstructs the historical Buddha’s life, locating him within the social and political context of his world. In examining the ancient texts of the Pali Canon, the earliest record of the Buddha’s life and teachings, Batchelor argues that the Buddha was a man who looked at human life in a radically new way for his time, more interested in the question of how human beings should live in this world than in notions of karma and the afterlife.  According to Batchelor, the outlook of the Buddha was far removed from the piety and religiosity that has come to define much of Buddhism as we know it today. Both controversial and deeply personal, Confession of a Buddhist Atheist is a fascinating exploration of a religion that continues to engage the West. Batchelor’s insightful, deeply knowledgeable, and persuasive account will be an essential book for anyone interested in Buddhism.",
  "genres": [
    "Buddhism",
    "Nonfiction",
    "Philosophy",
    "Religion",
    "Spirituality",
    "Memoir",
    "Biography"
  ],
  "author": "Stephen Batchelor",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/6957758-confession-of-a-buddhist-atheist"
}