{
  "title": "Задочни репортажи за България",
  "description": "За какво всъщност става дума в тази книга?Става дума за хора, които са предали комунистическите си идеали и под железния благослов на сталинската десница, в името на висши партийни повели и утопично бъдеще, лишават от елементарни права други хора, множат себеподобни, ограждат се с лакеи и копои, гаврят се с националния дух и го покваряват, рушат националната икономика и обзети от чувство за безнаказаност, водят злачното съществуване на американски милиардери.Става дума за такива явления в тоталитарното общество, като врагоманията и култа, всеобщото подозрение и безличие, партийния патриотизъм и погазването на националните чувства, автоцензурата и доносничеството, разпадането на семейството и експлоатацията на еманципираната жена, вещоманията и чуждопоклонството, проституирането и сводничеството с „разузнавателни“ цели, поголовното крадене и бягане от държавата.Става дума за паразитиращата на гърба на народа симбиоза между власт и култура, когато, за да омилостиви партийното божество, творецът е принуден да принася в жертва съвестта си и дадената му от Бога дарба, да вдъхва живот на мъртви доктрини и да представя действителността такава, каквато искат да я видят покровителите му, като по този начин обезличава и себе си, и хората, за които твори.Но също така става дума и за българския народ, чиито жилави корени не могат да се унищожат от социалистически химикали; за неговата търпимост към раси и вери и пословичното му хладнокръвие към всякакви божества; за чувството му за реализъм и справедливост, за презрението му към празните приказки и съзнанието, че само той момее да си помогне; за природната му мъдрост и спасителния хумор…И покрай отблъскващите фигури на властолюбиви функционери и литературни сановници, на фанатични партийци и пияни министри, на зловещи майори и вероломни следователи, на келнери и черноборсаджии ти ще стигнеш, читателю, и до Републиката на работниците, където като „остров на старомодната честност“ стои директорката Маня Енчева или предизвикателно кърши снага пресьорката Любка, където огнярят бай Димитър изкачва с детинско безразсъдство фабричния комин, за да оповести със сирената смъртта на другаря Сталин, а монтьорът Драго води жена си да абортира, защото не иска да създава още един нещастник на тоя свят. Ще срещнеш обзетите от мрачна решителност инженер Узунов и изпълнения с тъжно достойнство учител Пеев. Ще зърнеш милосърдната сестра Мария и далновидния търговец на мебели в Княжево Голдщайн. Докато не започнеш да се превиваш от смях като в самодеен театър на абсурда, през чиято сцена многозначително преминават неподкупни ревизори и двусмислени шапкари, хора без паспорти и хора със зелени мустаци, началници на станции за пречистване на отпадъчни води, честни крадци и крадци на истини, кухи особи с пардесюта от сив габардин и мистериозни касиери, които искат сметката за изиграното човешко доверие…„Колко похабени теми, колко опропастени книги!“ — ще възкликне свикналият да се самоизтезава в сладострастно боричкане със словото литератор.И ще е прав. За Георги Марков не е било важно как, а какво ще каже. Измъчвал се е от мисълта, че талантът му няма да е вечен, че няма да има кой да обърне пясъчния часовник на времето. Истините и прозренията, които са зреели в него, вече са се носели като електричество из въздуха, били са на върха на езиците. Е, шепнели са ги само — с намеци, с недомлъвки, с подмигвания, с озъртания. Стига толкова сме се упражнявали в метафори, алегории, символи. Трябва някой да изрече все пак истината. Без да цепи басма на изящната словесност. Без да приглася на райските птици. Без да приема на хайдушка вяра басните за преходен период, безкористна любов, положителни герои.Така замислените като серия предавания по радио „Свободна Европа“ репортажи започват да се превръщат в остри публицистични статии, критически есета, исторически обзори, документални и хумористични разкази, социологически изследвания, бегли портретни скици, очерци и спомени, литературни анекдоти, миниатюри. Натежават и олекват, изместват се и се наместват, но странно: не се разпадат. И както и да ги погледнеш, откъдето и да ги подхванеш, заемат причудливи, ту строго геометрични, ту неуловими в движението си форми, които неудържимо те привличат и ти ги следиш със затаен дъх.",
  "genres": [
    "Nonfiction",
    "Bulgarian Literature",
    "History",
    "Bulgaria",
    "Politics",
    "Classics",
    "Audiobook"
  ],
  "author": "Georgi Markov",
  "average_rating": "4.66",
  "url": "https://www.goodreads.com/book/show/6965573"
}