{
  "title": "Portrait of a Priestess: Women and Ritual in Ancient Greece",
  "description": "In this sumptuously illustrated book, Joan Breton Connelly gives us the first comprehensive cultural history of priestesses in the ancient Greek world. Connelly presents the fullest and most vivid picture yet of how priestesses lived and worked, from the most famous and sacred of them--the Delphic Oracle and the priestess of Athena Polias--to basket bearers and handmaidens. Along the way, she challenges long-held beliefs to show that priestesses played far more significant public roles in ancient Greece than previously acknowledged.Connelly builds this history through a pioneering examination of archaeological evidence in the broader context of literary sources, inscriptions, sculpture, and vase painting. Ranging from southern Italy to Asia Minor, and from the late Bronze Age to the fifth century A.D., she brings the priestesses to life--their social origins, how they progressed through many sacred roles on the path to priesthood, and even how they dressed. She sheds light on the rituals they performed, the political power they wielded, their systems of patronage and compensation, and how they were honored, including in death. Connelly shows that understanding the complexity of priestesses' lives requires us to look past the simple lines we draw today between public and private, sacred and secular.The remarkable picture that emerges reveals that women in religious office were not as secluded and marginalized as we have thought--that religious office was one arena in ancient Greece where women enjoyed privileges and authority comparable to that of men. Connelly concludes by examining women's roles in early Christianity, taking on the larger issue of the exclusion of women from the Christian priesthood. This paperback edition includes additional maps and a glossary for student use.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Mythology",
    "Anthropology",
    "Greece",
    "Ancient History"
  ],
  "author": "Joan Breton Connelly",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/6962915-portrait-of-a-priestess"
}