{
  "title": "The Black Moth",
  "description": "\"Stylish, romantic, sharp, and witty.\"Margaret DrabbleA disgraced lord, a notorious highwaymanJack Carstares, the disgraced Earl of Wyndam, left England seven long years ago, sacrificing his honor for that of his brother when he was accused of cheating at cards. Now Jack is back, roaming his beloved South Country in the disguise of a highwayman.And the beauty who would steal his heartNot long after Jack's return, he encounters his old adversary, the libertine Duke of Andover, attempting the abduction of the beautiful Diana Beauleigh. At the point of Jack's sword, the duke is vanquished, but foiled once, the \"Black Moth\" has no intention of failing again?This is Georgette Heyer's first novel?a favorite of readers and a stirring tale to be enjoyed again and again.\"A tale of love and adventure, clearness and charm, and an originality to delight?a tale to stir one's blood.\"BOSTON EVENING TRANSCRIPT\"A romance of the eighteenth century, with a wicked Duke, self-sacrificing elder brother, weak younger brother, highwayman, gambling, abduction, and rescue all complete.\"THE SATURDAY REVIEW\"A well-filled story which keeps the reader pleased.\"THE TIMES LITERARY SUPPLEMENT\"Wonderful characters, elegant, witty writing, perfect period detail, and rapturously romantic. Georgette Heyer achieves what the rest of us only aspire to.\"KATIE FFORDEPRAISE FOR GEORGETTE HEYER:\"Our Georgette Heyer display of the Sourcebooks reprints has been a huge success, not only to those early fans like myself, but to many new readers who appreciate her style and wit.\"Nancy Olson, Quail Ridge Books, Raleigh, NC\"Reading Georgette Heyer is the next best thing to reading Jane Austen.\"Publishers Weekly\"Wonderful characters, elegant, witty writing, perfect period detail, and rapturously romantic. Georgette Heyer achieves what the rest of us only aspire to.\" Katie Fforde\"Perfect craftsmanship.\" New York Times Book Review",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical Romance",
    "Historical",
    "Fiction",
    "Regency",
    "Classics"
  ],
  "author": "Georgette Heyer",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/6963840-the-black-moth"
}