{
  "title": "Amber's Mysterious Death",
  "description": "Amber's Mysterious DeathBy C.L. ExlineThe game's afoot when Sheryl Locke Holmes spots Amber's husband, Roger, who’d disappeared without a trace after Amber's tragic death. With the help of her sidekick, Dot Watson, Sheryl follows Roger and a trail of amber jewelry which leads to duplicity, mayhem and murder. As different as day and night, Sheryl, Dot and Amber bonded like sisters during college. Their friend's death left unanswered questions and an unidentifiable body. This time Sheryl won't stop until she gets answers—and avenges her friend’s death.  Excerpt:  With the next flash of light, Sheryl caught a glimpse of a familiar face and gasped. Oh my God. It couldn’t be. She had to have been wrong. Disoriented, she stumbled backward, bumped her hip into the corner of the desk, and fell to the floor. When she tried to get to her feet, she cracked her head on the desk. Stars whirled in front of her eyes, alternating with that face she'd seen. She blinked and blinked to stop the kaleidoscope whizzing around. But the next flash came and she saw no one. Thunder rumbled, lightning lit up the heavens and the windows. Suddenly, a dark figure stepped out of the shadows and ran across the room. Dot gasped. Before Sheryl could give chase to the person dressed in dark clothes, the overhead light came on and Roger stood at the doorway. She searched the room. Now, Dot was nowhere in sight. “I knew you’d come,” Roger said. “Where have you been the last couple of years?” “You need to let this vendetta go and move on. I did.” He glanced around the library. “Amber was one of my dearest friends. I want to know who murdered her.” “Don’t underestimate these people.” “Who, Roger? God knows you don’t have the balls or the brains to have done that to Amber. Tell me who?” She watched a wave of crimson creep up his neck. “I tried my best to protect her.” He sat down in the desk chair and sighed. “It’s true, it’s my fault she was murdered. They wouldn’t listen to me.” “Who, Roger?”",
  "genres": [],
  "author": "C.L. Exline",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/6966590-amber-s-mysterious-death"
}