{
  "title": "The Yom Kippur War: The Epic Encounter That Transformed the Middle East",
  "description": "In this galvanizing account of the most dramatic of the Arab-Israeli hostilities, Abraham Rabinovich, who reported the conflict for the Jerusalem Post, transports us into the midst of the 1973 Yom Kippur War.Rabinovich’s masterly narrative begins as Israel convinces itself there will be no war, while Egypt and Syria plot the two-front conflict. Then, on Yom Kippur, Saturday, October 6, 1973, we see Arab armies pouring across the shattered Bar-Lev Line in the Sinai and through the Golan defenses. Even the famed Israeli air force could not stop them. On the Golan alone, Syria sent 1,460 tanks against Israel’s 177, and 115 artillery batteries against Israel’s 11. And for the first time, footsoldiers wielding anti-tank weapons were able to stop tank charges, while surface-to-air missiles protected those troops from air attackRabinovich takes us into this inferno and into the inner sanctums of military and political decision making. He allows us to witness the dramatic turnaround that had the Syrians on the run by the following Wednesday and the great counterattack across the Suez Canal that, once begun, took international intervention to halt.Using extensive interviews with both participants and observers, and with access to recently declassified materials, Rabinovich shows that the drama of the war lay not only in the battles but also in the apocalyptic visions it triggered in Israel, the hopes and fears it inspired in the Arab world, the heated conflicts on both sides about the conduct of the war, and the concurrent American face-off with the Soviets in Washington, D.C., Moscow, and the Mediterranean. A comprehensive account of one of the pivotal conflicts of the twentieth century.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Israel",
    "War",
    "Military History",
    "Military Fiction",
    "Politics"
  ],
  "author": "Abraham Rabinovich",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/6966183-the-yom-kippur-war"
}