{
  "title": "سدرة المنتهى",
  "description": "هذه الحلقة الأخيرة من هذه السلسلة نتوقف فيها مع القعود الأخير في الصلاة تلك النهاية التي تتجدد فيها البداية وتشرق فيها روح الانطلاق من جديد، وتتجدد فيها الطاقة من جديد لمواصلة الرحلة.. تلك الطاقة المنبعثة من المفاهيم.. هذه المفاهيم التي تُنحَت عبر تلك الكلمات التي ليست ككل الكلمات إنها “التحيات” لماذا كانت في نهاية الصلاة وليس في أولها؟وما المعاني التي تتضمنها الثلاثية المتلازمة: السلام – الرحمة – البركات؟ وهل هناك صورة غير صالحة لعباد الله الصالحين؟ ثم يتوقف الكاتب مع معنى جديد واستنباط جديد حول الفرق بين النبي والرسول مستنتجًا أفقـًا جديدًا يتعلق بهذا الفرق، ثم يأتي بنا إلى الصلاة على رسول الله -صلى الله عليه وسلم- مشيرًا إلى ورود الأمر بالصلاة عليه إنما كان في سورة الأحزاب.. مستنتجًا أبعادًا عميقة في العلاقة القائمة بين ما ورد في هذه السورة من أحكام وتشريعات تتعلق بعلاقتنا برسول الله وبين مناسبة هذه السورة التي نزلت في خضم أحداث سورة الأحزاب، فآيات الأحكام في هذه السورة جاءت لتضع النقاط على الحروف وكأنها تحفر الخنادق وتوضح حدود العلاقات بين الأفراد في الوقت الذي كان فيه الصحابة يحفرون الخندق على أرض الواقع لإنقاذ دولة الإسلام.. ثم يتوقف الكاتب ليوضح شروط العلاقة مع الشخص الأهم في حياتنا مع رسول الله -عليه الصلاة والسلام-، وكيف وضعت سورة الأحزاب خطين أحمرين لهذه العلاقة، وكيف جاء الأمر بالصلاة عليه ضمانة لنا ضد هذين الخطين، ثم يتوقف الكاتب مع معان رائعة تتضمنها الصلاة على رسول الله، وكيف أنها صلاة من أجل الإنسان، وكيف أن كل معاني الصلاة كامنة في الصلاة عليه، ثم يتوقف ليسأل: لماذا الملائكة؟ ولماذا إبراهيم؟في الفصل الأخير من الكتاب يتوقف الكاتب مع المفهوم المضيء للآل مبينًا كيف أنه مفهوم حركي ديناميكي، وكيف أنه يمنحنا منصةً للانطلاق لتحقيق ما خُلقنا لأجله، موضحًا كيف أن الاتباع يحقق لنا الانتماء إلى آل محمد..هذا الاتباع الذي هو حجر الأساس للنهضة هذا الحجر الذي لا بد أن يمر “بكيمياء الصلاة” فوحدها كيمياء الصلاة ستتمكن من إعادة المعدن الإنساني إلى جوهره وتحقيق الممكن الذي علينا دومًا أن نؤمن به إنه التغيير التغيير لأجل النهضة.ـ",
  "genres": [
    "Religion",
    "Nonfiction",
    "Islam",
    "Spirituality"
  ],
  "author": "أحمد خيري العمري",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/6966717"
}