{
  "title": "The Master and His Emissary: The Divided Brain and the Making of the Western World",
  "description": "In a book of unprecedented scope, Iain McGilchrist presents a fascinating exploration of the differences between the brain’s left and right hemispheres, and how those differences have affected society, history, and culture.McGilchrist draws on a vast body of recent research in neuroscience and psychology to reveal that the difference is profound: the left hemisphere is detail oriented, while the right has greater breadth, flexibility, and generosity. McGilchrist then takes the reader on a journey through the history of Western culture, illustrating the tension between these two worlds as revealed in the thought and belief of thinkers and artists from Aeschylus to Magritte.Emisfero destro ed emisfero sinistro: una delle poche cose che tutti sanno è che il nostro cervello è anatomicamente diviso in due metà. Già gli antichi greci speculavano sulla possibile esistenza di un cervello bipartito, ma oggi siamo ormai al luogo comune, che tutti hanno sentito o letto da qualche parte, secondo il quale l'emisfero destro, quello \"femminile\", sarebbe adibito alla creatività e alla sensibilità, mentre quello sinistro, più \"maschile\", sarebbe predisposto alla logica e alla praticità: due modi inconciliabili di vedere il mondo. Ma qual è la vera natura di questa dicotomia? Quanto c'è di scientifico e quanto di impreciso o fuorviante? Lo psichiatra, neuroscienziato e studioso di letteratura Iain McGilchrist ha dedicato una vita di studi a questo problema, ricavandone una tesi tanto affascinante e profonda quanto rigorosa e solida, basata su un approccio interdisciplinare che spazia da Platone a Freud, da Shakespeare a Roger Sperry, neuroscienziato vincitore del Nobel per le sue ricerche sulla specializzazione emisferica. Secondo McGilchrist, ciascun emisfero decifra la medesima realtà in un modo coerente, ma incompatibile con quello dell'altro: l'emisfero destro fa esperienza del mondo nella sua interezza e complessità tralasciando i dettagli, mentre l'emisfero sinistro è analitico ma per forza di cose frammentario. Quale delle due modalità guida il nostro comportamento? In Il padrone e il suo emissario, McGilchrist racconta l'inevitabile lotta per il potere di cui i due emisferi sono protagonisti. I segni di questo confronto sono rintracciabili nella storia della nostra civiltà, e ancora ben visibili nei contrasti che animano la cultura occidentale contemporanea. Oggi, in un mondo sempre più disincarnato e dominato dalle tecnologie digitali, sembrerebbe che l'emisfero sinistro stia prendendo pericolosamente il sopravvento su quello destro, forse cambiando per sempre il nostro modo di pensare e di comprendere la realtà in cui viviamo.",
  "genres": [
    "Psychology",
    "Science",
    "Nonfiction",
    "Philosophy",
    "Neuroscience",
    "History",
    "Brain"
  ],
  "author": "Iain McGilchrist",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/6968772-the-master-and-his-emissary"
}