{
  "title": "Clara Callan",
  "description": "The Values of Belonging breaks new ground by examining human value systems from the perspective of how we live, not our gender. \"There is a way of being in the world that recoils from aggressiveness, cunning, and greed,\" writes bestselling author Carol Lee Flinders. This way of being arose out of the relationships our hunter-gatherer ancestors had with the natural world, one another, and Spirit -- relationships that are most acutely understood in terms of trust, inclusion, and mutual reciprocity. This society's core values, which include intimate connection with the land, empathetic relationship with animals, self-restraint, balance, expressiveness, generosity, egalitarianism, playfulness, and nonviolent conflict resolution, are what Flinders calls the \"values of Belonging.\" But with the Agricultural Revolution, as people took charge of what they could grow and where, the nature of human society changed, Once we could produce enough food to have surpluses, food could be bartered. The concept of ownership took on new meaning; more complex economies evolved, and with them came social and economic inequities. Qualities that had been reviled, such as competitiveness, acquisitiveness, and ambition, became under these new conditions the means to success. God underwent a transformation as well, becoming masculine, supreme, and finally located above and beyond us in the heavens. Flinders observes that these \"values of Enterprise\" have played a crucial role in the development of human society, having given us our passion for innovation and exploration of our world. But, whether negative or positive, the values of Enterprise, which became associated with men, overwhelmed the values of Belonging, which were identified with women. This division has impoverished us all. The values that shaped the hunter-gatherer's life reflected the need for connection, while those that fueled the Agricultural Revolution, and the subsequent rise of civilization as we know it, resulted in disconnection -- from nature, other people, and Spirit. The two value systems could not be more deeply at odds. Because the values of Enterprise have prevailed, the entire world stands in acute and perilous imbalance. And yet there are those who have managed to keep the values of Belonging alive, while successfully negotiating Enterprise culture. In this fresh look at gender relationships, Flinders moves away from the dichotomy of male as oppressor and female as victim. She sees models for a new balance in the lives of visionaries, artists, and mystics such as the Buddha, Baal Shem Tov, Teresa of Avila, Elizabeth Candy Stanton, John Muir, and Martin Luther King Jr., each of whom mirrors the essence of Belonging values for the world. This thought-provoking book adds an exciting dimension to the debate about Western values and where we are headed.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Canada",
    "Book Club",
    "Literary Fiction",
    "Canadian Literature",
    "Novels"
  ],
  "author": "Richard B. Wright",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/6969390-clara-callan"
}