{
  "title": "How Long Can the Moon Be Caged?: Voices of Indian Political Prisoners",
  "description": "‘Those who want to understand the nature of today’s political regime in India need to read this book’ — Christophe Jaffrelot, Professor, King’s College London ‘A telling account of repression and resistance in the new India’ — Jean Drèze, Indian economist ‘A brave and necessary record of how behind tall prison walls, some of India’s finest hearts and minds are locked away by a state fearful of their dreams. A book of aching, terrible beauty’ — Harsh Mander, writer, human rights and peace worker, teacher ‘An important testament to the dystopian state of the nation’ — Alpa Shah, author of Among India’s Revolutionary Guerrillas Silencing and punishing critical voices is a project that lies at the heart of Modi’s authoritarian regime in India. In this unique book, Suchitra Vijayan and Francesca Recchia look at present-day India through the lived experiences of political prisoners. Combining political and legal analysis with firsthand testimonies, the authors explore the small gestures that constitute resistance inside and outside jail for the prisoners and their families, telling a story of the destruction of institutions and erosion of rights. How Long Can the Moon Be Caged? includes visual testimonies and prison writings from those falsely accused of inciting the Bhima Koregaon violence, by student leaders opposing the new discriminatory citizenship law passed in 2020 and by activists from the Pinjra Tod’s movement. In bringing together these voices, the book celebrates the courage, humanity and moral integrity of those jailed for standing in solidarity with marginalised and oppressed communities. Suchitra Vijayan is the author of the critically acclaimed Midnight’s Borders . She teaches at NYU Gallatin and is the Executive Director of The Polis Project. Francesca Recchia is an independent educator, researcher and writer. She is the Creative Director of The Polis Project.",
  "genres": [
    "India",
    "Politics",
    "Nonfiction"
  ],
  "author": "Suchitra Vijayan",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/69707502-how-long-can-the-moon-be-caged"
}