{
  "title": "Breaking the Big Story: Great Moments in Indian Journalism",
  "description": "As a watchdog of public interest and the voice of the small man, it is the duty of the media to uphold democracy by exposing what those in authority may prefer to gloss over or hide. But in this age of instant communication and twenty-four-hour television, the focus is on breaking the story as it happens, with little attempt to interpret and analyse. In this context, when everything appears big and yet superficial, has the big story become defunct or is it more important than ever before? Breaking the Big Story showcases great moments of Indian journalism, when journalists chose to lead rather than follow the mob, to investigate and forewarn, to expose corruption at the highest level, to intervene as ghastly events unfolded in a bid to pre-empt them, to cover ethnic strife in foreign lands, to tear away the blinkers from the eyes of a gullible nation that sought refuge in its sporting icons, to pose as arms dealers and investigate dubious aspects of defence purchases, to cover communal clashes and point to a new direction. In short, to break a big story. This volume brings together nine essays on major stories or exposés by their authors in the Indian print or electronic media. Raajkumar Keswani writes about his attempts to warn people of the looming dangers posed by Union Carbide in Bhopal and the death three years later of thousands of people following the gas leak. Sampad Mahapatra questions the 100-year-old definition of death by starvation and discovers that people will eat anything to keep death at bay. Sanjoy Hazarika, Teesta Setalvad and Muzamil Jaleel relive the horrors perpetuated in the name of ethnicity and identity in Assam, Gujarat and Kashmir. Anita Pratap recollects similar problems across the waters in Sri Lanka. Chitra Subramaniam retraces the trail of kickbacks in the Bofors-India howitzer deal to high offices in the country. Tarun Tejpal goes a step further to show that corruption cuts across party hues. And Pradeep Magazine writes about his meeting with a bookie and how the subsequent exposure of cricket match-fixing did not really come as a surprise. The nine essays in this collection, written long after the big stories were first published, evoke a range of compassion, shame, horror, outrage, disgust. They raise issues of media and governmental responsibility and document how democracy and the fourth estate have matured in India.",
  "genres": [],
  "author": "B.G. Verghese",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6971009-breaking-the-big-story"
}