{
  "title": "Self-Therapy: A Step-By-Step Guide to Creating Inner Wholeness Using IFS, a New, Cutting-Edge Therapy",
  "description": "Understand your psyche in a clear and comprehensive way, and resolve deep-seated emotional issues. Self-Therapy makes the power of a cutting-edge psychotherapy approach accessible to everyone. Internal Family Systems Therapy (IFS) has been spreading rapidly across the country in the past decade. It is incredibly effective on a wide variety of life issues, such as self-esteem, procrastination, depression, and relationship issues. IFS is also user-friendly; it helps you to comprehend the complexity of your psyche. Dr. Earley shows how IFS is a complete method for psychological healing that you can use on your own.Self-Therapy is also helpful for therapists because it presents the IFS model in such detail that it is a manual for the method.Many times in the past I used to say to friends, \"I am at least two people.\" I often found myself doing something I really did not want to do, thinking things that I did not want to think, and feeling emotions I did not want to feel and over which I felt I did not have control. It seemed like there was another person inside me. On reading Self Therapy, I was so excited to find out what was going on. Many things I could not previously figure out quickly fell into place. For me it was a very exciting experience--finding out so much about myself. Not only that but this book also taught me how to 'rehabilitate' the 'other me'--or many other 'me's!Reading this book was one of the most enlightening experiences I have had. It is very well written and the author's attitude comes across very clearly and powerfully. There is no doubt but it written with a kind and altruistic heart and with the purpose of really helping individuals to understand and help  themselves and integrate all their part. Self Therapy takes its place among the most treasured books on my bookshelves.-- Paddy Linehan, ThailandSelf-Therapy was a big help to me in the beginning when I didn't have muchknowledge of IFS or myself. The transcripts were intriguing because I looked atother people's experience in the book and recognized my parts. This helped meto realize that I'm not the only one with these difficult feelings. In my journal Iwrote out the answers to each of the questions for my parts, and this brought it alltogether for me.-- Mindy Lamberson, Des Moines, Iowa",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Mental Health",
    "Counselling",
    "Personal Development",
    "Spirituality"
  ],
  "author": "Jay Earley",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/6969927-self-therapy"
}