{
  "title": "What Is Posthumanism?",
  "description": "What does it mean to think beyond humanism? Is it possible to craft a mode of philosophy, ethics, and interpretation that rejects the classic humanist divisions of self and other, mind and body, society and nature, human and animal, organic and technological? Can a new kind of humanities-posthumanities-respond to the redefinition of humanity's place in the world by both the technological and the biological or \"green\" continuum in which the \"human\" is but one life form among many?Exploring how both critical thought along with cultural practice have reacted to this radical repositioning, Cary Wolfe-one of the founding figures in the field of animal studies and posthumanist theory-ranges across bioethics, cognitive science, animal ethics, gender, and disability to develop a theoretical and philosophical approach responsive to our changing understanding of ourselves and our world. Then, in performing posthumanist readings of such diverse works as Temple Grandin's writings, Wallace Stevens's poetry, Lars von Trier's Dancer in the Dark, the architecture of Diller+Scofidio, and David Byrne and Brian Eno's My Life in the Bush of Ghosts, he shows how this philosophical sensibility can transform art and culture.For Wolfe, a vibrant, rigorous posthumanism is vital for addressing questions of ethics and justice, language and trans-species communication, social systems and their inclusions and exclusions, and the intellectual aspirations of interdisciplinarity. In What Is Posthumanism? he carefully distinguishes posthumanism from transhumanism (the biotechnological enhancement of human beings) and narrow definitions of the posthuman as the hoped-for transcendence of materiality. In doing so, Wolfe reveals that it is humanism, not the human in all its embodied and prosthetic complexity, that is left behind in posthumanist thought.",
  "genres": [
    "Philosophy",
    "Theory",
    "Nonfiction",
    "Animals",
    "Academic",
    "Criticism",
    "Research"
  ],
  "author": "Cary Wolfe",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/6968406-what-is-posthumanism"
}