{
  "title": "Appetite for America: How Visionary Businessman Fred Harvey Built a Railroad Hospitality Empire That Civilized the Wild West",
  "description": "The legendary life and entrepreneurial vision of Fred Harvey helped shape American culture and history for three generations—from the 1880s all the way through World War II—and still influence our lives today in surprising and fascinating ways. Now award-winning journalist Stephen Fried re-creates the life of this unlikely American hero, the founding father of the nation’s service industry, whose remarkable family business civilized the West and introduced America to Americans.Appetite for America is the incredible real-life story of Fred Harvey—told in depth for the first time ever—as well as the story of this country’s expansion into the Wild West of Bat Masterson and Billy the Kid, of the great days of the railroad, of a time when a deal could still be made with a handshake and the United States was still uniting. As a young immigrant, Fred Harvey worked his way up from dishwasher to household name: He was Ray Kroc before McDonald’s, J. Willard Marriott before Marriott Hotels, Howard Schultz before Starbucks. His eating houses and hotels along the Atchison, Topeka, and Santa Fe railroad (including historic lodges still in use at the Grand Canyon) were patronized by princes, presidents, and countless ordinary travelers looking for the best cup of coffee in the country. Harvey’s staff of carefully screened single young women—the celebrated Harvey Girls—were the country’s first female workforce and became genuine Americana, even inspiring an MGM musical starring Judy Garland.With the verve and passion of Fred Harvey himself, Stephen Fried tells the story of how this visionary built his business from a single lunch counter into a family empire whose marketing and innovations we still encounter in myriad ways. Inspiring, instructive, and hugely entertaining, Appetite for America is historical biography that is as richly rewarding as a slice of fresh apple pie—and every bit as satisfying.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "Food",
    "Historical",
    "Business"
  ],
  "author": "Stephen Fried",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/6971469-appetite-for-america"
}