{
  "title": "An Assassin's Touch",
  "description": "This book contains male homoerotica.Nobody realizes better than Shane that he has no real future. As a Leopard, he's destined to live alone and be reviled by his fellow feline shifters. Instead of letting that hurt him, Shane just throws himself into his work as the coalition's top assassin. A job that his breeding makes him perfect for. He tells himself that he doesn't need anyone else--that he's fine living a solitary life. Then one, brief encounter with a bratty, Panther shifter named, Trevor, changes everything. Now all Shane can think about is the Panther and how to get the man back in his bed. The only problem is Trevor hasn't given Shane so much as a second glance since their one time together. A situation that frustrates and intrigues Shane even more.Trevor has always enjoyed playing the field. With so many sexy temptations at his disposal, he doesn't see why he should have to settle for the same warm body in his bed night after night. While the sex with Shane had been great, Trevor is determined to put the encounter behind him. A task that's not as easy as it would seem. Not when every night he continues to dream of the Leopard. Or how, whenever they're in the same room, Trevor can't stop himself from wanting to reach out and caress the Leopard. Trevor knows that there can never be anything between them and resolves to put his desires behind him.Then Shane needs help on one of his assignments and he turns to Trevor. The mission proves more dangerous than either one realizes. They soon find themselves fighting for their lives. Will they be able to learn to trust each other in time to save themselves, or will their past doubts destroy them?",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Erotica",
    "Paranormal Romance",
    "Fantasy"
  ],
  "author": "Stephani Hecht",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/10325799-an-assassin-s-touch"
}