{
  "title": "Tales of the Jazz Age",
  "description": "'I tender these tales of the Jazz Age into the hands of those who read as they run and run as they read.'Tales of the Jazz Age (1922) was Fitzgerald's second collection of short stories, and it contains some of the best examples of his talent as a writer of short fiction. Often overshadowed by his major novels, Fitzgerald's short stories demonstrate the same originality and inventive range, as he chronicles with wry and astute observation the temper of the hedonistic 1920s. In 'May Day' and 'The Diamond as Big as the Ritz', two of his greatest stories, he conjures up the spirit of the age; in other stories he adopts a variety of forms - parody, a one-act play, fantasy - with unrivalled versatility. 'The Curious Case of Benjamin Button', a tale of a man living his life backwards, features among the 'Fantasies' in Fitzgerald's self-deprecatory Table of Contents, alongside the groupings 'My Last Flappers' and 'Unclassified Masterpieces'.Fitzgerald chose the stories for his second collection when he was just twenty-five years old, and in the full flush of wild literary success. Tales of the Jazz Age is a quirky, electrifying selection reaching back into his college days, showing Fitzgerald's strengths not only as one of America's leading short story authors in the early 1920s, but as a playwright, farcical satirist, melodramatist, and fantastical novella-writer. He went in all these directions with equal ease and flash in 1922. Tales of the Jazz Age was a sensation then, and remains so now.ABOUT THE For over 100 years Oxford World's Classics has made available the widest range of literature from around the globe. Each affordable volume reflects Oxford's commitment to scholarship, providing the most accurate text plus a wealth of other valuable features, including expert introductions by leading authorities, helpful notes to clarify the text, up-to-date bibliographies for further study, and much more.",
  "genres": [
    "Classics",
    "Short Stories",
    "Fiction",
    "American",
    "Literature",
    "20th Century",
    "Literary Fiction"
  ],
  "author": "F. Scott Fitzgerald",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/130085732-tales-of-the-jazz-age"
}