{
  "title": "Voyageur: Across the Rocky Mountains in a Birchbark Canoe",
  "description": "Traveling across the Rocky Mountains by canoe, discovering the desolate wonders of Canada's unspoilt wilderness.Fifteen years before Lewis and Clarke Scotsman Alexander Mackenzie, looking to open up a trade route, set out from Lake Athabasca in central Northern Canada in search of the Pacific Ocean. Mackenzie travelled by bark canoe and had a cache of rum and a crew of Canadian voyageurs, hard-living backwoodsmen, for company. Two centuries later, in a spirit of organic authenticity, Robert Twigger follows in Mackenzie's wake. He too travels the traditional way, having painstakingly built a canoe from birch bark sewn together with pine roots, and assembled a crew made up of fellow travellers, ex-tree-planters and a former sailor from the US Navy. After the ice has melted, Twigger and his crew of wandering spirits finally nose out into the Athabasca River . . . Three Years . . . two thousand miles . . .over one thousand painfully towing the canoe against the current . . . several had tried before them but they were the first people to successfully complete Mackenzie's diabolical route over the Rockies in a birch bark canoe since 1793. Subsisting on a diet of porridge, elk and jackfish, supplemented with whisky and a bag of grass for the tree planters, and with an Indian medicine charm bestowed by the Cree People of Fox Lake, the voyageurs embark on an epic road trip by canoe . . . a journey to the remotest parts of the wilderness, through Native American reservations, over mountains, through rapids and across lakes, meeting descendants of Mackenzie and unhinged Canadian trappers, running out of food, getting lost and miraculously found again, disfigured for life (the ex-sailor loses his thumb), bears brown and black, docile and grizzly. Voyageur is a moving tale of contrasts from the bleak industrial backwaters of Canada to the desolate wonder of the Rocky Mountains.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Adventure"
  ],
  "author": "Robert Twigger",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/697362.Voyageur"
}