{
  "title": "Scepters",
  "description": "The popular creator of Recluce and of the Spellsong world of Liedwahr has built a whole new fantasy world on Corus. With each new volume of the Corean Chronicles we learn more about the magical underpinnings of this fascinating realm as we follow the continuing adventures of his reluctant hero, Alucius. In Legacies he became the first Iron Valley militiaman to escape sorcerous enslavement in Madrien. In Darknesses , he found a way to defeat a would-be conqueror who revived the fearsome creatures and potent weaponry of the legendary past. Now he returns to face the greatest challenges yet to both his courage and his magical Talent.Alucius is happy back on his nightsheep stead with his beloved wife Wendra, who is expecting their first child. But the country is beset by enemies on all sides. Although the Lord Protector of Lanachrona keeps his promise not to order Alucius back to active duty, Alucius finds his request for help no easier to ignore.Newly promoted to higher rank, and given command of a combined force of the Northern and Southern Guards, Alucius must first quell a strange religiously-inspired rebellion and then find a way to destroy the powerful weapons of ancient design again being used by the forces of Madrien. Unlike the Lord Protector, Alucius can see that a third, covert, threat must be behind the other two. He will have to confront an alien evil that seeks to enslave the whole world of Corus in the guise of bringing back a lost golden age. Only the timely assistance of the mysterious ancient Soarers and the addition of Wendra's Talent to his own give him any hope of success. Scepters is a stirring climax to the first Corean trilogy.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Epic Fantasy",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Military Fiction"
  ],
  "author": "L.E. Modesitt Jr.",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/1300861.Scepters"
}