{
  "title": "Feet on the Street: Rambles Around New Orleans",
  "description": "“Betcha I can tell ya / Where ya / Got them shoooes. / Betchadollar, / Betchadollar, / Where ya / Got them shoooes. / Got your shoes on your feet, / Got your feet on the street, / And the street’s in Noo / Awlins, Loo- / Eez-ee-anna. Where I, for my part, first ate a live oyster and first saw a naked woman with the lights on. . . . Every time I go to New Orleans I am startled by something.”So writes Roy Blount Jr. in this exuberant, character-filled saunter through a place he has loved almost his entire life—a city “like no other place in America, and yet (or therefore) the cradle of American culture.” Here we experience it all through his eyes, ears, and taste buds: the architecture, music, romance (yes, sex too), historical characters, and all that glorious food. The book is divided into eight Rambles through different parts of the city. Each closes with lagniappe—a little bit extra, a special treat for the reader: here a brief riff on Gennifer Flowers, there a meditation on naked dancing. Roy Blount knows New Orleans like the inside of an oyster shell and is only too glad to take us to both the famous and the infamous sights. He captures all the wonderful and rich history—culinary, literary, and political—of a city that figured prominently in the lives of Jefferson Davis (who died there), Truman Capote (who was conceived there), Zora Neale Hurston (who studied voodoo there), and countless others, including Andrew Jackson, Lee Harvey Oswald, William Faulkner, Tennessee Williams, Jelly Roll Morton, Napoléon, Walt Whitman, O. Henry, Thomas Wolfe, Earl Long, Randy Newman, Edgar Degas, Lillian Hellman, the Boswell Sisters, and the Dixie Cups.Above all, though, Feet on the Street is a celebration of friendship and joie de vivre in one of America’s greatest and most colorful cities, written by one of America’s most beloved humorists.Also available as a Random House AudioBook",
  "genres": [
    "Travel",
    "Nonfiction",
    "Humor",
    "History",
    "Audiobook"
  ],
  "author": "Roy Blount Jr.",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/697793.Feet_on_the_Street"
}