{
  "title": "The Secrets of Dr. Taverner",
  "description": "Of the many authors who have turned their hands to the creation of 'supernatural sleuths', few have been so colourful, and as contradictory, as Dion Fortune. She was, in her time, a highly significant and influential figure within spiritualistic a one-time member of the Order of the Golden Dawn, she left it to create another society, the Fraternity of the Inner Light, which (under another name) still exists today; and which refuses to discuss her. During the 1920s and 1930s she wrote books, pamphlets, and articles about her spiritual philosophies and various sociological and sexual issues, including vegetarianism, the servant problem, and contraception. She also turned her hand to fiction, writing novels which contained such elements as black and white magic, the great god Pan, astral bodies, reincarnation, and the lost city of Atlantis. When she died in 1946, Fortune left her final novel, MOON MAGIC, uncompleted; the last two chapters are said to have been dictated by her from beyond to one of the Inner Light mediums. Her first work of fiction, however, was THE SECRETS OF DR TAVERNER, first published in 1926. The stories concern some of the psychic adventures of the Holmes-like Taverner, as narrated by his assistant, Dr Rhodes. In addition to containing the eleven stories from the first edition, this volume also includes a twelfth Dr Taverner tale, 'A Son of the Night', which was not published until some years after Fortune's death, and which has been the cause of some speculation regarding its authorship. In his lengthy introduction, Jack Adrian examines the enigma who was Dion Fortune, and provides a possible solution to the question of which real person served as the basis for Dr Taverner.",
  "genres": [
    "Fiction",
    "Occult",
    "Fantasy",
    "Short Stories",
    "Magic",
    "Magick",
    "Horror"
  ],
  "author": "Dion Fortune",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/697886.The_Secrets_of_Dr_Taverner"
}