{
  "title": "Long Time Leaving: Dispatches from Up South",
  "description": "“I left the South in search of the Enlightenment. I’m pro-choice, in favor of gay marriage, and against creationism and the war in Iraq. But both my parents’ people are deep Southern from many generations, and I spent a little over a third of my life, including the presumably most formative years (toilet training through college), living in the South. Mathematically, that makes me just about exactly as Southern as the American people, 34 percent of whom are Southern residents. But it goes deeper than math—my roots are Southern, I sound Southern, I love a lot of Southern stuff, and when my [Northern] local paper announces a festival to ‘celebrate the spirit of differently abled dogs,’ I react as a Southerner. I believe I care as much about dogs’ feelings as anybody. It is hard for me to imagine that a dog with three legs minds being called a three-legged dog.”A sly, dry, hilarious collection of essays—his first in more than ten years—from the writer who, according to The New York Times Book Review , is “in serious contention for the title of America’s most cherished humorist.”This time Blount focuses on his own dueling loyalties across the great American divide, North vs. South. Scholarly, raunchy, biting and affable, ol’ Roy takes on topics ranging from chicken fingers to yellow-dog Democrats to Elvis’s toes. And he shares chatting with Ray Charles, rounding up rattlesnakes, watching George and Tammy record, meeting an Okefenokee alligator (also named George, or Georgette), imagining Faulkner’s tennis game, and being swept up, sort of, in the filming of Nashville . His yarns, analyses, and flights of fancy transcend all standard shades of Red, Blue, and in between.Roy on “Remember when there was lots of agitated discussion of Ebonics, pro and con? I kept waiting for someone to say that if you acquire white English, you can become Clarence Thomas, whereas if you acquire black English, you can become Quentin Tarantino.”Roy on “The way folks were meant to eat is the way my family ate when I was growing up in Georgia. We ate till we got tired . Then we went “Whoo!” and leaned back and wholeheartedly expressed how much we regretted that we couldn’t summon up the strength, right then, to eat some more.”Roy on “Anybody who claims . . . not to have ‘a racist bone’ in his or her body is, at best, pre racist and has a longer way to go than the rest of us.”Blount’s previous books have included reflections on a Southern president (Jimmy Carter), a novel about a Southern president (Clementine Fox), a biography of Robert E. Lee, a celebration of New Orleans, a memoir of growing up in Georgia, and the definitive anthology of Southern humor. Long Time Leaving is the capper. Maybe it won’t end the Civil War at last, but it does clarify, or aptly complicate, divisive delusions on both sides of the longstanding national rift. It’s a comic ode to American variety and also a droll assault on complacency North and South—a glorious union of diverse pieces reshaped and expanded into an American classic, from one of the most definitive and esteemed humorists of our time.",
  "genres": [
    "Humor",
    "Essays",
    "Nonfiction",
    "Audiobook",
    "Southern",
    "Memoir",
    "Unfinished"
  ],
  "author": "Roy Blount Jr.",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/697794.Long_Time_Leaving"
}