{
  "title": "Secretary: The Screenplay",
  "description": "\"Secretary is the companion volume to the hit film starring Maggie Gyllenhaal and James Spader. We are proud to announce that it is the first release in our new Soft Skull Screen Print series, the goal of which is, in the first instance, to publish screenplays as literature, and, in the second instance, to give the reader insight into the process whereby text becomes image. \"Secretary is the darkly comic tale of a young woman who finds love in a satisfying sadomasochistic relationship with her boss. Simultaneously sweet and subversive, the success of the film is due to Erin Cressida Wilson's masterful adaptation of Mary Gaitskill's 1989 short story. Some may be tempted by squeamishness when Maggie Gyllenhaal's character is bent over and methodically spanked in the office--punishment for her typos--but the twist is in her surprised joy and redemption from her own psychic distress. This un-PC version of romantic comedy is provocative in its ability to transcend stereotypes. \"Secretary combines a close-up look at the adaptation and screenwriting process with a behind-the-scenes view of film from the perspective of its creators. In addition to the screenplay, the book also includes Erin Cressida Wilson's provocative introductory essay about how she came to write the film (and in which she confesses her own penchant for spanking), an interview with director Steven Shainberg by David Breskin, drawings and blocking notes from Shinberg's director's note-books, and previously unpublished photos from the set. Bonus materials include a foreword by Molly Haskell, author of \"From Reverence to Rape: The Treatment of Women in the Movies, as well as an excerpt from the original short story \"Secretary\"by Mary Gaitskill. \"Secretary is an essential and fascinating study of independent movie making at its best.",
  "genres": [
    "Film",
    "Drama",
    "Romance"
  ],
  "author": "Steven Shainberg",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/697885.Secretary"
}