{
  "title": "Comes the Peace: My Journey to Forgiveness",
  "description": "\"I packed a blue Samsonite suitcase with my belongings -- a couple of pairs of jeans and shirts, UB40 tapes, the Swiss army knife I had stolen from my mother, my Tibetan prayer book, and a red plastic Camay soap dish I bought in Dharamsala that had become a good luck charm for me.\"    With these, all his worldly possessions at the age of seventeen, Daja Wangchuk Meston caught an airliner to America, the unfamiliar land of which he was a citizen, and began his arduous personal journey to discover and mend his long-severed ties to his family, his country, and, in a very real sense, his own identity.   In this moving memoir, the author tells the incredible story of a young man who used his Buddhist upbringing and the love of a good woman -- his young wife -- to learn that forgiving others can play a critical role in healing a damaged soul.   Daja had much to forgive. In the early 1970s, at the age of three, he was taken by his hippie American parents to Nepal and left in the care of a Tibetan family. The Tibetans in turn placed him in a Buddhist monastery where, at the age of six, he was ordained to be a monk. There, in scenes reminiscent of the novels of Charles Dickens, he was ostracized by the other boy monks, who taunted him for his Caucasian physical traits, left so hungry he stole scraps of bread, and slept on a flea-infested straw mat. He was an outsider in an insular monastic world, unable to understand what had befallen him and longing for the warmth of his mother's embrace.   His mother became a Buddhist nun, and caring for a child, she thought, would impede her spiritual journey. Her occasional and brief visits with young Daja became increasingly rare. As he grew up, there were often years without a single maternal visit. His father, unbeknownst to the boy, had suffered a mental breakdown and returned, helpless, to Los Angeles.   The story of Daja's self-generated ouster from the monastery as an adolescent (he pretended to have slept with a prostitute), his eventual migration to his homeland, his lifelong attempt to understand and reconnect with his parents, and his eventual and dangerous work on behalf of Tibetan rights under Chinese oppression make for a compelling reading experience.   But more than that, the story of Daja Meston reminds us of the universal human need for roots and family bonds. It is ultimately an unforgettable story of love, hope, and forgiveness and of a gentle man with an enormous capacity for all three.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Daja Wangchuk Meston",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/6984550-comes-the-peace"
}