{
  "title": "Balance of Power",
  "description": "#1 NEW YORK TIMES BESTSELLING AUTHORRICHARD NORTH PATTERSONBALANCE OF POWERRichard North Patterson's masterful portrayals of law and politics at the apex of power have made him one of our most important writers of popular fiction. Combining a compelling narrative, exhaustive research, and a sophisticated grasp of contemporary society, his bestselling novels bring explosive social problems to vivid life through characters who are richly imagined and intensely real. Now in Balance of Power Patterson confronts one of America's most inflammatory issues–the terrible toll of gun violence.President Kerry Kilcannon and his fiancée, television journalist Lara Costello, have at last decided to marry. But their wedding is followed by a massacre of innocents in a lethal burst of gunfire, challenging their marriage and his presidency in ways so shattering and indelibly personal that Kilcannon vows to eradicate gun violence and crush the most powerful lobby in Washington–the Sons of the Second Amendment (SSA).Allied with the President's most determined rival, the resourceful and relentless Senate Majority Leader Frank Fasano, the SSA declares all-out war on Kerry Kilcannon, deploying its arsenal of money, intimidation, and secret dealings to eviscerate Kilcannon's crusade–and, it hopes, destroy his presidency. This ignites a high-stakes game of politics and legal maneuvering in the Senate, the courtroom, and across the country, which the charismatic but untested young President is determined to win at any cost. But in the incendiary clash over gun violence and gun rights, the cost to both Kilcannonsmay be even higher than he imagined. And others in the crossfire may also pay the price: the idealistic lawyer who has taken on the gun industry; the embattled CEO of America's leading gun maker; the war-hero senator caught between conflicting ambitions; the female senator whose career is at risk; and the grief-stricken young woman fighting to emerge from the shadow of her sister, the First Lady.The insidious ways money corrodes democracy and corrupts elected officials . . . the visceral debate between gun-rights and gun-control advocates . . . the bitter legal conflict between gun companies and the victims of gun violence . . . a ratings-driven media that both manipulates and is manipulated–Richard North Patterson weaves these engrossing themes into an epic novel that moves us with its force, passion, and authority.Richard North Patterson's eleven novels include seven consecutive international bestsellers; critics compared his most recent novel, Protect and Defend, to such novels as Allen Drury's Advise and Consent and Gore Vidal's Lincoln. Formerly a trial lawyer, Mr. Patterson served as the SEC's liaison to the Watergate Special Prosecutor, and is now on the boards of several Washington-based advocacy groups dealing with gun violence, political reform, and reproductive rights. He lives with his wife, Laurie, and their family on Martha's Vineyard.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Politics",
    "Legal Thriller",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "Richard North Patterson",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/6985149-balance-of-power"
}