{
  "title": "Late Bloomer",
  "description": "The biggest, richest and most delightful collection of Tyler's work to date. Tales of loss, difficult relatives and questionable relationships are infused with Tyler's rueful humor, pitiless wit and deep empathy. Carol Tyler has been a professional (and highly acclaimed) cartoonist for over 20 years, appearing in such venues as Robert Crumb's Weirdo, Wimmen's Comix , and Drawn & Quarterly magazine.But over the years her status as a working mother has drastically curtailed her ability to set aside time for her cartooning. Thus each rare new story from her pen has been greeted with hurrahsas well they should be, because she's one of the most skillful, caustic, and emphatic cartoon storytellers of her generation. This new book presents the biggest, richest and most delightful collection of Tyler's work to date featuring many new and previously unpublished works.In \"Migrant Mother\" Tyler tells the grueling story of a cross-country trip with the flu and her terrible twos toddler using her trademark combination of rueful humor and emphathy. The full-color \"Just A Bad Seed\" is a meditation on a problem child who might not be such a problem after all, while \"The Return of Mrs. Kite\" chronicles a family crisishow her widowed grandmother fell in with a beau of questionable character. \"Gone\" (also in full color) is a stirring meditation on all kinds of loss, and \"Why I'm A-gin' Southern Men\" is a classic rant that dissects that particular breed of maleor at least a certain subspecies of \"ex\"eswith pitiless wit.Other stories include \"Sweet Miss Lee\" (a reminiscence of an immigrant roommate and her fate), \"There's Something Wrong with a Perfect Lawn\" (a tale of suburban obsessiveness), \"Little Crosshatch Mind\" (where artistic impulses come from), and \"Uncovered Property\" (discovering the power of sexuality at an early age).Tyler works equally well in delicately crisp black-and-white penstrokes and lushly watercolored paintings (this book will feature 60 pages of her stunning full-color work). All told, the three-dozen stories here will cement Tyler's reputation as a cartoonist to be reckoned with. 136 pages, 60 pages in color.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Memoir",
    "Comix",
    "Historical",
    "Graphic Novels Comics",
    "Nonfiction"
  ],
  "author": "Carol Tyler",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/698078.Late_Bloomer"
}