{
  "title": "Home Before Dark",
  "description": "In her career as a photojournalist, free-spirited Jessie Ryder has seen the world through her camera lens. But she's never traveled far enough to escape a painful moment that has haunted her for the past sixteen years: the day she gave her baby daughter away. Now, facing a life-altering crisis, she's decided to fix the broken pieces of her heart and seek out Lila, even if it means she has to upset the world of Lila's adoptive mother her very own sister, Luz. Like a Technicolor tornado bursting into Luz's picture-perfect life, Jessie returns to her Texas hometown with a shattering request. She wants to tell Lila the truth. As Luz and her husband struggle with what Jessie's return may mean to the rebellious Lila, their seemingly solid marriage falters. Old secrets are exposed. Then, just as Jessie comes to terms with the past, life's bittersweet irony plays its hand. She meets Dustin Matlock, a young father who has survived a devastating loss. And Jessie begins to see the hopeful possibilities that lie buried in the most wrenching tragedies. Though she aches to reach out to those she loves, Jessie stands at the crossroads. She is leaving behind the only life she knows and leaping blindly into the unknown. Now the choice she makes will affect the life of her daughter and challenge the meaning of sisterhood. As Jessie and Luz examine the true meaning of love, loyalty and family, they are drawn into an emotional tug-of-war filled with moments of unexpected humor, surprising sweetness and unbearable sadness. But as the pain, regrets and mistakes of the past slowly rise to the surface, a new picture emerges a picture filled with hope and promise and the redeeming power of the human heart.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Family",
    "Adult Fiction"
  ],
  "author": "Susan Wiggs",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/698465.Home_Before_Dark"
}