{
  "title": "The Day I Became an Autodidact and the Advice, Adventures, and Acrimonies That Befell Me Thereafter",
  "description": "Kendall Hailey, an avid reader and the daughter of two writers, seems the girl most likely to go to college, but one summer, on receiving a mandatory reading list from her high school, she decides to sidestep formal education. She graduates early and at age sixteen begins her own course of self-education. Her extraordinary family -- \"a father, a mother (not too odd yet), a younger sister (getting odder), a grandmother (approaching the bend), and an uncle (already around it)\" -- demand neither college nor a job. Not only are they satisfied to have her at home, they are thrilled by her decision. Her college-bound friends, however, are convinced she's lost the chance for a productive life, and there are days when she thinks they are right. But when halfway through college many of her friends still have no idea what they want to do with their lives and speak of going on to graduate school, Kendall knows she is on the right track.Her reading ranges from great novels to hits of the Broadway state to Greek and Roman classics to Beowulf himself. She learns to drive a car, writes a play (\"a screwball comedy\"), a mystery, and a novel. She discovers she could be a talented actress but not too great a painter. She travels with her family; she spends hours on the phone with her boyfriend Matthew; she watches as her father struggles with an illness; she comes to terms with her mother. The glimpses she gets of college life, through her friend Julie's letters, cause her no regrets. She's autodidactic to the core.This captivating, refreshing book shows a young writer's quest to remain true to bedrock values as she makes the complicated journey of growing up in an unusual family.Kendall Hailey is the oldest daughter of playwright Oliver Hailey and novelist Elizabeth Forsythe Hailey. She lives in California with her family.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Education",
    "Biography",
    "Biography Memoir",
    "School"
  ],
  "author": "Kendall Hailey",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/698417.The_Day_I_Became_an_Autodidact_and_the_Advice_Adventures_and_Acrimonies_That_Befell_Me_Thereafter"
}