{
  "title": "The Art of Fiction",
  "description": "The articles with which David Lodge entertained and delighted readers of the Independent on Sunday and The Washington Post are now revised, expanded, and collected together in book form. The art of fiction is considered under a wide range of headings, such as the Intrusive Author, Suspense, the Epistolary Novel, Time-shift, Magic Realism and Symbolism, and each topic is illustrated by a passage or two taken from classic or modern fiction. Drawing on writers as diverse as Henry James and Martin Amis, Jane Austen and Fay Weldon and Henry Fielding and James Joyce, David Lodge makes accesible to the general reader the richness and variety of British and American fiction. Technical terms, such as Interior Monologue, Metafiction, Intertextuality and the Unreliable Narrator, are lucidly explained and their applications demonstrated.Bringing to criticism the verve and humour of his own novels, David Lodge has provided essential reading for students of literature, aspiring writers, and anyone who wishes to understand how literature works.Beginning (Jane Austen, Ford Madox Ford) --The intrusive author (George Eliot, E.M. Forster) --Suspense (Thomas Hardy) --Teenage Skaz (J.D. Salinger) --The epistolary novel (Michael Frayn) --Point of view (Henry James) --Mystery (Rudyard Kipling) --Names (David Lodge, Paul Auster) --The stream of consciousness (Virginia Woolf) --Interior monologue (James Joyce) --Defamiliarization (Charlotte Bronte) --The sense of place (Martin Amis) --Lists (F. Scott Fitzgerald) --Introducing a character (Christopher Isherwood) --Surprise (William Makepeace Thackeray) --Time-shift (Muriel Spark) --The reader in the text (Laurence Sterne) --Weather (Jane Austen, Charles Dickens) --Repetition (Ernest Hemingway) --Fancy prose (Vladimir Nabokov) --Intertextuality (Joseph Conrad) --The experimental novel (Henry Green) --The comic novel (Kingsley Amis) --Magic realism (Milan Kundera) --Staying on the surface (Malcolm Bradbury) --Showing and telling (Henry Fielding) --Telling in different voices (Fay Weldon) --A sense of the past (John Fowles). Imagining the future (George Orwell) --Symbolism (D.H. Lawrence) --Allegory (Samuel Butler) --Epiphany (John Updike) --Coincidence (Henry James) --The unreliable narrator (Kazuo Ishiguro) --The exotic (Graham Greene) --Chapters etc. (Tobias Smollett, Laurence Sterne, Sil Walter Scott, George Eliot, James Joyce) --The telephone (Evelyn Waugh) --Surrealism (Leonora Carringotn) --Irony (Arnold Bennett) --Motivation (George Eliot) --Duration (Donald Barthelme) --Implication (William Cooper) --The title (George Gissing) --Ideas (Anthony Burgess) --The non-fiction novel (Thomas Carlyle) --Metafiction (John Barth) --The uncanny (Edgar Allen Poe) --Narrative structure (Leonard Michaels) --Aporia (Samuel Beckett) --Ending (Jane Austen, William Golding)",
  "genres": [
    "Nonfiction",
    "Writing",
    "Literary Criticism",
    "Literature",
    "Books About Books",
    "Reference",
    "Essays"
  ],
  "author": "David Lodge",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/69926.The_Art_of_Fiction"
}