{
  "title": "Let the Great World Spin",
  "description": "NATIONAL BOOK AWARD WINNER • Colum McCann’s beloved novel inspired by Philippe Petit’s daring high-wire stunt, which is also depicted in the film The Walk starring Joseph Gordon-LevittIn the dawning light of a late-summer morning, the people of lower Manhattan stand hushed, staring up in disbelief at the Twin Towers. It is August 1974, and a mysterious tightrope walker is running, dancing, leaping between the towers, suspended a quarter mile above the ground. In the streets below, a slew of ordinary lives become extraordinary in bestselling novelist Colum McCann’s stunningly intricate portrait of a city and its people.Let the Great World Spin is the critically acclaimed author’s most ambitious novel yet: a dazzlingly rich vision of the pain, loveliness, mystery, and promise of New York City in the 1970s.Corrigan, a radical young Irish monk, struggles with his own demons as he lives among the prostitutes in the middle of the burning Bronx. A group of mothers gather in a Park Avenue apartment to mourn their sons who died in Vietnam, only to discover just how much divides them even in grief. A young artist finds herself at the scene of a hit-and-run that sends her own life careening sideways. Tillie, a thirty-eight-year-old grandmother, turns tricks alongside her teenage daughter, determined not only to take care of her family but to prove her own worth. Elegantly weaving together these and other seemingly disparate lives, McCann’s powerful allegory comes alive in the unforgettable voices of the city’s people, unexpectedly drawn together by hope, beauty, and the “artistic crime of the century.”A sweeping and radical social novel, Let the Great World Spin captures the spirit of America in a time of transition, extraordinary promise, and, in hindsight, heartbreaking innocence. Hailed as a “fiercely original talent” ( San Francisco Chronicle ), award-winning novelist McCann has delivered a triumphantly American masterpiece that awakens in us a sense of what the novel can achieve, confront, and even heal.Praise for Let the Great World Spin“This is a gorgeous book, multilayered and deeply felt, and it’s a damned lot of fun to read, too. Leave it to an Irishman to write one of the greatest-ever novels about New York. There’s so much passion and humor and pure lifeforce on every page of Let the Great World Spin that you’ll find yourself giddy, dizzy, overwhelmed.” —Dave Eggers“Stunning . . . [an] elegiac glimpse of hope . . . It’s a novel rooted firmly in time and place. It vividly captures New York at its worst and best. But it transcends all that. In the end, it’s a novel about families—the ones we’re born into and the ones we make for ourselves.” — USA Today“The first great 9/11 novel . . . We are all dancing on the wire of history, and even on solid ground we breathe the thinnest of air.” — Esquire“Mesmerizing . . . a Joycean look at the lives of New Yorkers changed by a single act on a single day . . . Colum McCann’s marvelously rich novel . . . weaves a portrait of a city and a moment, dizzyingly satisfying to read and difficult to put down.” — The Seattle Times“Vibrantly whole . . . With a series of spare, gorgeously wrought vignettes, Colum McCann brings 1970s New York to life. . . . And as always, McCann’s heart-stoppingly simple descriptions wow.” — Entertainment Weekly“An act of pure bravado, dizzying proof that to keep your balance you need to know how to fall.” — O: The Oprah Magazine",
  "genres": [
    "Fiction",
    "Book Club",
    "Historical Fiction",
    "New York",
    "Literary Fiction",
    "Novels",
    "Contemporary"
  ],
  "author": "Colum McCann",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/6989438-let-the-great-world-spin"
}