{
  "title": "The Seven Daughters of Eve",
  "description": "In 1994 Professor Bryan Sykes, a leading world authority on DNA and human evolution, was called in to examine the frozen remains of a man trapped in glacial ice in northern Italy. News of the discovery of the Ice Man and his age, which was put at over five thousand years old, fascinated the world. But what made the story particularly extraordinary was that Professor Sykes was also able to track down a living genetic relative of the Ice Man, a woman living in Britain today.How was he able to locate a living relative of a man who died thousands of years ago? In The Seven Daughters of Eve, Bryan Sykes gives us a first hand account of his research into a remarkable gene which passes undiluted from generation to generation through the maternal line and shows how it is being used to track our genetic ancestors through time and space. After plotting thousands of DNA sequences from all over the world he found that they had clustered around a handful of distinct groups. In Europe there are only seven. The conclusion: almost everyone of native European descent, wherever they live in the world, can trace their ancestry back to one of seven women, the Seven Daughters of Eve. He has named them Ursula, Xenia, Helena, Velda, Tara, Katrine and Jasmine.In this remarkable scientific adventure story we learn exactly how our origins can be traced, how and where our ancient genetic ancestors lived, what their lives were like and how we are each living proof of the almost miraculous strength of our DNA which has survived and prospered over so many thousands of years to reach us today. It is a book that not only presents the story of our evolution in a wholly new light, but also strikes right at the heart of ourselves as individuals and of our sense of identity.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Genetics",
    "Biology",
    "Anthropology",
    "Evolution"
  ],
  "author": "Bryan Sykes",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/6992.The_Seven_Daughters_of_Eve"
}