{
  "title": "Tears of the Desert: A Memoir of Survival in Darfur",
  "description": "“[Halima Bashir’s] mesmerizing tale of against-all-odds endurance is a piercing lament—and a clear-eyed call to action.”— Vogue “This memoir helps keep the Darfur tragedy open as a wound not yet healed.”—Elie Wiesel, author of  Night Born into the Zaghawa tribe in the Sudanese desert, Halima Bashir received a good education away from her rural surroundings (thanks to her doting, politically astute father) and at twenty-four became her village’s first formal doctor. Yet not even Bashir’s degree could protect her from the encroaching conflict that would consume her homeland. Janjaweed Arab militias savagely assaulted the Zaghawa, often with the backing of the Sudanese military. Then, in early 2004, the Janjaweed attacked Bashir’s village and surrounding areas, raping forty-two schoolgirls and their teachers. Bashir, who treated the traumatized victims, some as young as eight years old, could no longer remain quiet. But breaking her silence ignited a horrifying turn of events.  Raw and riveting,  Tears of the Desert  is the first memoir ever written by a woman caught up in the war in Darfur. It is a survivor’s tale of a conflicted country, a resilient people, and an uncompromising spirit. Praise for  Tears of the Desert “This is a brave book. And a valuable one. Halima’s story of the atrocities and immeasurable losses she has endured must be told.” —Mia Farrow, actor and advocate  “Vivid, poignant and brutally candid . . .  Tears of the Desert  is that rarest of literary endeavors, not just a book you read but a book you experience.” — The Washington Post Book World “An extraordinary memoir . . . Halima Bashir’s bravery contrasts with the world’s fecklessness and failures.” —Nicholas D. Kristof,  The New York Times “Searing . . . Tears of the Desert gives voice to the unspeakable.” — USA Today“Powerful, harrowing and brave.” — The Economist“A luminous tale of growing up in rural Darfur . . . a wonderful and moving African memoir.” — The New York Review of Books",
  "genres": [
    "Nonfiction",
    "Africa",
    "Memoir",
    "Biography",
    "History",
    "War",
    "Biography Memoir"
  ],
  "author": "Halima Bashir",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/6998357-tears-of-the-desert"
}