{
  "title": "The Sissy Duckling",
  "description": "The Barnes & Noble ReviewLet's just say that Elmer's not your run-of-the-mill duck. He likes to decorate cookies, enjoys building sand castles instead of forts, and would rather put on puppet shows than play sports. Being different is fine for sweet Elmer—he's as happy as a duck in water doing everything he loves. So what's the problem? Papa Duck and the other guys just don't understand. Papa tries to teach Elmer to play baseball, but the results are simply disastrous for the unathletic duckling. That night, Elmer overhears Papa saying that the flock is calling his son a sissy, and he turns to Mama for some quality reassurance. After school the next day, Elmer suffers some tormenting from an enormous bully and flees instead of fighting, only to hear more scathing words from his embarrassed father. A dejected Elmer decides that his only option is to run away from home. Later in the forest, he's horrified to see that his father has been shot while the flock is heading south, but Elmer doesn't leave Papa to die—he hoists him on his back, carries him home, and cares for him the whole winter! Not only does Papa get better; he learns during his recovery that Elmer is a brave little duck whose courage is something to be admired.Noted playwright and actor Harvey Fierstein delivers a heartwarming story about diversity, based on the Hans Christian Andersen tale of the Ugly Duckling. Lovable Elmer's story will make readers cheer, and his difference will help children recognize and appreciate the qualities that make them—along with other people in their communities—special. Henry Cole's tender yet hilarious illustrations are just the right touch for Elmer, who even sports a pink flowered backpack and heart-shaped sunglasses. Elmer is one extraordinary duck whose \"sissyhood\" is something to celebrate! (Matt Warner)",
  "genres": [
    "Picture Books",
    "LGBT",
    "Childrens",
    "Animals",
    "Fiction",
    "Banned Books",
    "Queer"
  ],
  "author": "Harvey Fierstein",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/699812.The_Sissy_Duckling"
}