{
  "title": "The War in the Air",
  "description": "* Illustrated  (This title belongs to the STEAMPUNK ADVENTURES series. The STEAMPUNK ADVENTURES comprise an illustrated selection of classic Victorian speculative fiction, with each title being chosen for its quality, modern appeal and resonance with the steampunk movement of retro-futurism.)  OUR AIRSHIP ESCAPADES into “a Dystopian Retro-Future which never was” continue in the epic Zeppelin war novel by H. G. Wells, THE WAR IN THE AIR. Young Bert Smallways, a brilliant mechanist and accidental aeronaut, finds himself as a reluctant stowaway upon the very same airship which begins the Great War. This is “dieselpunk” at its finest, featuring petrol-powered war machines, ironclads, bombardments, espionage, intrigue and daring adventures in the wild skies of the earliest 1900s. Smallways is swept away aboard the Vaterland, the flagship piloted by a belligerent German Prince, whose mastery of technology shall herald in a new age of war. How long can Smallways keep his identity a secret from the Prince? Will Bert survive THE WAR IN THE AIR?  (Astute readers may notice that this novel served as the inspiration for a certain steampunk trilogy with titles such as LEVIATHAN, BEHEMOTH and GOLIATH.)  Enriching and supplementing Wonderland Imprints’ well-received series of classic Illustrated Master Editions, the STEAMPUNK ADVENTURES series is devoted to reviving the very finest forgotten rarities which were originally published during the golden age of technology. The series explores the origins of retro-futurist elements, such as airships, mechanical men, goggled gentlemen of war, sophisticated adventuresses, gadgetry and weaponry, and global cataclysm. These are the tales of the Age of Steam, the lore of the ornate technology which reigned in a golden future that never was. Above all, this series is focused on telling great Victorian stories you’ve probably never heard of!  Episode 3, THE WAR IN THE AIR (inspired by the George Griffith works featured in Episodes 1 and 2, THE ANGEL OF THE REVOLUTION and THE SYREN OF THE SKIES), is considered to be one of H. G. Wells’s greatest novels. This Wonderland Imprints edition features over 30 illustrations, an active table of contents, 11 chapters, 98,000 words and 310 pages of mayhem, secret agents and aerial adventure. Come aboard, and sail the crimson skies of war once again!",
  "genres": [
    "Science Fiction",
    "Classics",
    "Fiction",
    "War",
    "Steampunk",
    "Novels",
    "Speculative Fiction"
  ],
  "author": "H.G. Wells",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/699808.The_War_in_the_Air"
}