{
  "title": "1923: A Memoir Lies and Testaments",
  "description": "1923 is the first book of Harry Leslie Smith. Smith is is the well known author of Harry's Last Stand and Love Among the Ruins who also contributes to the Guardian newspaper. 1923 chronicles Harry Leslie Smith's life from his birth in poverty in Barnsley, Yorkshire through his youth and adolescence that was punctuated with hunger and homelessness. The odyssey of 1923 ends at the end of the Second World War in Hamburg where Harry Leslie Smith was part of the RAF and attached to the allied occupation army. This book vividly describes the austerity of another time and acts as a reminder not to let Harry Leslie Smith's past become our future. Editorial Reviews It's a personal as well as a social history. Smith has the knack of bringing the times to life in a way that few writers can manage. It's the ability to tell a story, the knowledge of when to move on & not labour a point. --The Bookbag 1923 is a book that succeeds in two ways with ease, both as a personal memoir of a life lived in a volatile age and as a record of that age for all time. --The Current Reader \"1923\" is uplifting and highly recommended. --Midwest Book Review 1923: A Memoir is a protest against social injustice, corruption, war, famine, poverty, and societies blinded by greed. More importantly, it is the story of hope and the notion that anything can be overcome if desired. --The Publishing Guru \"Smith stays true to himself and his inner voice as he recounts the events of his early life.\"-Feeding My Book Addiction 1923: A Memoir presents the story of a life lyrically described, capturing a time both before and during World War II when personal survival was dependent upon luck and guile. During this time, failure insured either a trip to the workhouse or burial in a common grave. Brutally honest, Smith’s story plummets to the depths of tragedy and flies up to the summit of mirth and wonder, portraying real people in an uncompromising, unflinching voice. 1923: A Memoir tells of a time and place when life, full of raw emotion, was never so real.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "World War II",
    "British Literature",
    "Biography"
  ],
  "author": "Harry Leslie Smith",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/13011075-1923"
}