{
  "title": "الفردوس المستعار والفردوس المستعاد",
  "description": "ثوابت وأركان من أجل خيار حضارة أخرى~~~الكتاب من ثلاثة محاور أساسية..* المحور الأول عنوانه \"وجهٌ آخر للصراع\"، يطرح في فصليه فكرة أن الصراع الحالي ليس صراعًا عسكريًا بالضرورة، بل هو حضاري ثقافي وقيمي في أساسه..في الفصل الأول من هذا المحور، \"دينٌ جديد\"، يناقش فكرة أن أمريكا أصبحت بمثابة دينٍ جديدٍ يغزو العالم بأفكاره ومعتقداته ونمط حياته أكثر منها مجرد دولةٍ إمبراطوريةٍ عظمى كسالف الدول التي سادت العالم سابقـًا. لبُّ هذا الدين الجديد وأساسه المتين يرتكز على فكرة الحلم الأمريكي: الرفاهة والترف، والعيش في فردوس السلع الأرضية.في الفصل الثاني، \"سيناريو الفقدان وخطة الاستعادة\"، يربط الكتاب بين الحلم الأمريكي الذي اجتاح العالم، وبين محاولات الإنسان العودة إلى الفردوس منذ خروجه منه، عبر تكوين فردوسٍ أرضيٍّ، وهي الرحلة التي ابتدأت بآدم خروجًا، وبإبراهيم بحثًا، وبسيدنا محمدٍ (ص) انتهاءً، وهو يقلب وجهه بين مختلف الوجهات.المحور الثاني من الكتاب \"ثوابت الأركان\"، يناقش ثوابت الفردوس الأمريكي الخمسة: المادية، الفردية، الاقتصاد الحر، الاستهلاك، العيش في الحاضر (الآن وهنا), ويحاول أن يقارن ويمايز بينها وبين ثوابتنا وأركاننا: هل يمكن لهذه الثوابت أن تتأسلم وتشهر إسلامها بمجرد وضعنا لشعاراتٍ إسلاميةٍ عليها؟ أم أن الفرق والتمايز بينهما أبعد من ذلك بكثير؟ينتهي المحور الثالث باستشرافٍ لضرورة وجود بديلٍ للأفكار التقليدية السائدة التي انتهت مدة فعاليتها وصلاحيتها، دون أن يعني ذلك أبدًا أن يكون البديل نسخةً مستعارةً من فردوسٍ أمريكي، حتى لو كان هذا الفردوس واقعًا حقيقيًا عندهم.~~~الإهداء---إهداء من نوع خاص جدًا...أُهدي هذا الكتاب إلى القناص الامريكي الذي قتل -بدم بارد- الخالة \"منى عبد الهادي العبيدي\" وزوجها الدكتور \"أحمد الراوي\"، وخمس وعشرين شخصًا آخرين من المدنيين، تصادف أنهم مَرّوا من أمام مكمنه على مشارف مدينة \"الرمادي\" ظهيرة يوم الرابع عشر من تموز 2004م..بدلاً من رصاصات مماثلة كالتي أطلقها عليهم، أُهدي هذا الكتاب إليه وإلى كل زملائه الآخرين..أُهديه إليه، وإلى دقته في التصويب: رصاصة واحدة فقط على رأس زوجها.. وتسلية بإطلاقه بضعة عشر رصاصة عليها..أُهديه إلى القيم التي دفعت به إلى هنا.. وإلى رأسه الفارغ إلا من نظرته المحددة سلفًا لكل الأمور.. وإلى حضارة الرجل الأبيض التي جاء لينوب عنها.. وإلى ثقافة البوب كورن التي جاء لينشرها..أُهديه إليه، عندما يعود إلى بلاده.. سواء بكفن، أو على عكازة أو عكازتين.. أو سالمًا يمشي على قدميه..وأُهديه إليه، عندما يحتضن زوجته وأولاده، ويجلس بينهم؛ بينما يحكي بطولاته مع أولئك المتوحشين -الذين هم نـحن-.. ورسالته التي أدّاها في جَرّنا إلى درب الحضارة..لقد أدّى قسطه للعلى في حوار الحضارات، الذي يتحدثون عنه..كانت تلك الرصاصات المنفلقة هي سطوره التي أدّاها بشكل عملي.. أبلغ وأكثر تأثيرًا من كل الأقوال!هذا الكتاب هو ردي عليه، وهو سطوري أنا في ذلك الحوار..و كما كان هو دقيقــًا في التصويب، آمل أن أكون أكثر دقة..~د. أحمد",
  "genres": [
    "Religion",
    "Nonfiction",
    "Politics",
    "Philosophy",
    "Sociology",
    "Islam",
    "Spirituality"
  ],
  "author": "أحمد خيري العمري",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/6996965"
}