{
  "title": "All Over the Map",
  "description": "What's a wise, witty travel writer to do when she reaches forty and is still single? Wander the globe searching for romance and adventure, of course.On a trip to Oaxaca, Mexico, to celebrate her fortieth birthday, Laura Fraser confronts the unique trajectory of her life. Divorced and childless in her thirties, she found solace in the wanderlust that had always directed her heart—and found love and comfort in the arms of a dashing Frenchman. Their Italian affair brought her back to herself—but now she wonders if her passion for travel (and for short-lived romantic rendezvous) has deprived her of what she secretly wants most from a husband, a family, a home.When her Parisian lover meets her in Oaxaca and gives her news that he’s found someone new, Laura is stunned and hurt. Now, it seems, she has nothing but her own independence for company—and, at forty, a lot more wrinkles on her face and fewer years of fertility. How is Laura going to reconcile what seem to be two opposite for adventure, travel, great food, and new experiences, but also a place to call home—and a loving pair of arms to greet her there?And so, she globe hops. What else is a travel writer to do? From Argentina to Peru, Naples to Paris, she basks in the glow of new cultures and local delicacies, always on the lookout for the “one” who might become a lifelong companion. But when a terrible incident occurs while she’s on assignment in the South Pacific, Laura suddenly finds herself more aware of her vulnerability and becomes afraid of traveling. It seems as if she might lose the very thing that has given her so much pleasure in her life, not to mention the career she has built for herself as a world traveler and chronicler of far-flung places.Finding herself again will be both more difficult and more natural than she imagined. Ultimately, Laura realizes the most important journey she must take is an internal one. And the tale of how she reaches that place will captivate every woman who has ever yearned for a different life.",
  "genres": [
    "Travel",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Italy",
    "Chick Lit",
    "Womens"
  ],
  "author": "Laura Fraser",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/6993647-all-over-the-map"
}