{
  "title": "Hallowe'en: Its Origin, Spirit, Celebration, and Significance as Related in Prose and Verse, Together With Hallowe'en Stories, Plays, Pantomimes; and Suggestions for Games, Stunts, Parties, Feasts and Decorations",
  "description": "American HALLOWE'EN Its Origin, Spirit, Celebration, and Significance as Related in Prose and Verse, Together with Halloween Stories, Plays, Pantomimes; and Suggestions for Games, Stunts, Parties, Feasts and Decorations. COMPILED AND EDITED, WITH AN INTRODUCTION, BY ROBERT HAVEN SCHAUFFLER ( Editor of The Poetry Cure, etc.) NEW YORK DODD, MEAD AND COMPANY. 1933 ACKNOWLEDGMENTS For their courteous permission to include copyrighted material in this volume, thanks are due to the following : THE AMERICAN CITY: A National Occasion for Merry making. ERNEST BENN, LTD. i The Palace, from CURSORY RHYMES, by Humbert Wolfe. THE BOBBS-MERRILL COMPANY i Little Orphant Annie/' from RHYMES OF CHILDHOOD, by James Whitcomb Riley. Copyright 1890 and 1918. Used by special permission of the Publishers, THE BOBBS-MERRILL COMPANY. THE CATHOLIC WORLD: Hallowe'en and All Souls' Day Customs, by Miss F. M. Verrall. THE CENTURY COMPANY : When Good Spooks Get To gether, from PARTIES AND OCCASIONS, by Claire Wallis and Nellie Ryder Gates. And from ST. NICHOLAS MAGAZINE: The Straw Phantom, a Pantomime for Hallowe'en, by Dorothy B. Blackall; A Children's Celebration of Hal lowe'en, by Isabel G. Curtis; The ' Bob White's' Hal lowe'en, by Josephine Scribner Gates. All copyrighted by THE CENTURY COMPANY. COWARD-MCCANN, INC.: The Shadow People, from COMPLETE POEMS OF FRANCIS LEDWIDGE, by permission of COWARD-MCCANN, INC., Publishers. DODD, MEAD & COMPANY, INC.: The Hallowe'en Party, from THE BOOK OF GAMES AND PARTIES, by Theresa Hunt Wolcott ; Notes on Hallowe'en Decorations, Social Games for Hallowe'en, A Hallowe'en Post Mortem, Two Old Games, Tricks for Hallowe'en, The Hallowe'en Mur der, all from GAMES AND GAME LEADERSHIP, by Charles F. Smith; With Peter Pan, from HOBNAILS IN EDEN, by Robert Haven Schauffler ; A Vagabond Song, by Bliss Car man; At Candle-Lightin' Time, from THE COMPLETE POEMS OF PAUL LAURENCE D UNBAR. vi ACKNOWLEDGMENTS DOUBLEDAY, DORAN & COMPANY: Hallowe'en, from THE CUSTOMS OF MANKIND, by Lillian Eichler; A Hallowe'en Party/' from MY BOOK OF PARTIES, by Madeline Snyder; A Hallowe'en Memory, from CHIMNEYSMOKE, by Christopher Morley; The Fairies, from FAIRIES AND CHIMNEYS, by Rose Fyleman. All copyrighted by DOUBLE DAY, DORAN & COMPANY. GOOD HOUSEKEEPING: A Friday Hallowe'en Party, by Elaine; ' The Witch of the Glen Gives a Party, by Elaine ; Spirit o' Hallowe'en, by Katherine Norris; For the Hallowe'en Feast, by Lois Ann Stevens. HARPER AND BROTHERS: A Hallowe'en Pantomime, from FESTIVALS AND PLAYS, by Percival Chubb. By permis sion of the publishers. HENRY HOLT & COMPANY : I Saw Three Witches, from DOWN A DOWN DERRY, by Walter de la Mare. By permis sion of the publishers. DAVID MCKAY COMPANY: A Tarn o' Shanter Hallowe'en Party, from THE MARY DAWSON GAME BOOK, by Mary Dawson. NATIONAL RECREATION ASSOCIATION : The Spooks' Tryst ing Place ; Fun for Hallowe'en ; What Killed Groogan?. THE NORMAN REMINGTON COMPANY: Pud-WudjieS, by Patrick R. Chalmers; Ghost Night, from WILD CHERRY, by Lizette Woodworth Reese. THE PARENTS' MAGAZINE: Games for Hallowe'en, by Alice Crowell Hoffman. THE POETRY BOOKSHOP : Overheard on a Saltmarsh, by Harold Monro. POPULAR MECHANICS MAGAZINE: Stunts for Your Hal lowe'en Party, by Sam Brown. SAFETY EDUCATION: The Fire Ghost, by Margaret Mochrie; The Safety Council's Hallowe'en/* CHARLES SCRIBNER'S SONS: Seem' Things, by Eugene Field. By permission of the publishers. FREDERICK A. STOKES COMPANY: October Hallowe'en Fun. Reprinted by permission from THE COMPLETE PLAY CRAFT BOOK, by Patten Beard. Copyright 1926 by FREDERICK A. STOKES COMPANY. ACKNOWLEDGMENTS vii WOMAN'S HOME COMPANION: When You Entertain, by Mary A. Bliss. THE WOMANS PRESS : An Old-Fashioned Hallowe'en Frolic, from PARTIES AND STUNTS AROUND THE YEAR, by Era Betzner. Used by permission of the National Board of the Young Women's Christian Association of The United States of America. MOLLY CAPES : Hallowe'en, repr",
  "genres": [
    "Halloween"
  ],
  "author": "Robert Haven Schauffler",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/6999396-hallowe-en"
}