{
  "title": "Hard Work: A Life On and Off the Court",
  "description": "One of the most respected and successful basketball coaches in the nation, Coach Roy Williams traveled an unlikely path to a career that boasts the highest winning percentage among all active college coaches. Now, for the first time, he tells the story of his life, from his turbulent childhood to the North Carolina Tar Heels’ 2009 national championship season.With unbridled honesty, Williams recounts his rough early years in the mountains of Western North Carolina. During the troubled times of his adolescence, Roy’s escape was a basketball court—whether it was a neighbor's dirt court or the local school gym where he’d shoot for hours at night. There was nowhere else to go, but as it turned out, no place he’d rather be. The first in his family to go to college, Williams wound up at the University of North Carolina with the dream of becoming a coach and learning under the celebrated Dean Smith.He also recalls his long tenure as head coach at the University of Kansas and his two heart-wrenching decisions—to stay in Kansas at the program he built, and later, to return to UNC, to the one that built him—and the accusations that followed both.Williams' autobiography lays plain how he recruits, teaches, and motivates his players, and how he’s shepherded teams through some of the most nail-biting games at both Kansas and UNC. His approach helped earn him the third-highest winning percentage in NCAA better than Mike Krzyzewski, Bobby Knight, and even John Wooden. So far, the Hall of Famer has coached in seven Final Fours, winning two NCAA championships in the last five seasons.In Hard Work , Williams reveals the determination that took him from the humblest of beginnings to the pinnacle of coaching success, sharing his story because he believes that anyone can be inspired by its hard work really can make dreams come true.",
  "genres": [
    "Sports",
    "Basketball",
    "Biography",
    "Nonfiction",
    "Leadership",
    "Memoir",
    "Audiobook"
  ],
  "author": "Roy Williams",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/7002027-hard-work"
}