{
  "title": "The White Man's Burden: Why the West's Efforts to Aid the Rest Have Done So Much Ill and So Little Good",
  "description": "William Easterly's The White Man's Burden is about what its author calls the twin tragedies of global poverty. The first, of course, is that so many are seemingly fated to live horribly stunted, miserable lives and die such early deaths. The second is that after fifty years and more than $2.3 trillion in aid from the West to address the first tragedy, it has shockingly little to show for it. We'll never solve the first tragedy, Easterly argues, unless we figure out the second. The ironies are many: We preach a gospel of freedom and individual accountability, yet we intrude in the inner workings of other countries through bloated aid bureaucracies like the International Monetary Fund (IMF) and World Bank that are accountable to no one for the effects of their prescriptions. We take credit for the economic success stories of the last fifty years, like South Korea and Taiwan, when in fact we deserve very little. However, we reject all accountability for pouring more than half a trillion dollars into Africa and other regions and trying one \"big new idea\" after another, to no avail. Most of the places in which we've meddled are in fact no better off or are even worse off than they were before. Could it be that we don't know as much as we think we do about the magic spells that will open the door to the road to wealth? Absolutely, William Easterly thunders in this angry, irreverent, and important book. He contrasts two approaches: (1) the ineffective planners' approach to development--never able to marshal enough knowledge or motivation to get the overambitious plans implemented to attain the plan's arbitrary targets and (2) a more constructive searchers' approach--always on the lookout for piecemeal improvements to poor peoples' well-being, with a system to get more aid resources to those who find things that work.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "International Development",
    "History",
    "Africa",
    "Poverty"
  ],
  "author": "William Easterly",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/7002264-the-white-man-s-burden"
}