{
  "title": "Child 44",
  "description": "A Selection of Barnes & Noble RecommendsA gripping novel about one man's dogged pursuit of a serial killer against the opposition of Stalinist state security forces, Child 44 is at once suspenseful and provocative. Tom Rob Smith's remarkable debut thriller powerfully dramatizes the human cost of loyalty, integrity, and love in the face of totalitarian terror. A decorated war hero driven by dedication to his country and faith in the superiority of Communist ideals, Leo Demidov has built a successful career in the Soviet security network, suppressing ideological crimes and threats against the state with unquestioning efficiency. When a fellow officer's son is killed, Leo is ordered to stop the family from spreading the notion that their child was murdered. For in the official version of Stalin's worker's paradise, such a senseless crime is impossible an affront to the Revolution. But Leo knows better: a murderer is at large, cruelly targeting children, and the collective power of the Soviet government is denying his existence. Leo's doubt sets in motion a chain of events that changes his understanding of everything he had previously believed. Smith's deftly crafted plot delivers twist after chilling twist, as it lays bare the deceit of the regime that enveloped an impoverished people in paranoia. In a shocking effort to test Leo's loyalty, his wife, Raisa, is accused of being a spy. Leo's refusal to denounce her costs him his rank, and the couple is banished from Moscow. Humiliated, renounced by his enemies, and deserted by everyone save Raisa, Leo realizes that his redemption rests on finding the vicious serial killer who is eviscerating innocent children and leaving them to die in the bleak Russian woods. The narrative unfolds at a breathless pace, exposing the culture of fear that turns friends into foes and forces families to hide devastating secrets. As Leo and Raisa close in on the serial killer, desperately trying to stay a step ahead of the government's relentless operatives, the reader races with them through a web of intrigue to the novel's heart-stopping conclusion. About the Author The serial killer in Child 44, Tom Rob Smith's first novel, was suggested by the true story of Andrei Chikatilo, who murdered over 50 women and children in Russia during the 1980s. By setting his fiction three decades before Chikatilo's crimes, the author has added powerful elements of political suspense to his page-turning tale. \"I moved it to the 1950s,\" Smith explains, \"because that's when opposing the state was most dangerous. You'd lose your life in the '50s; if you did it in the '80s you'd lose your apartment.\" His considerable research into Stalin's Soviet Union supports the powerful human drama at his story's heart. Though Child 44 is Smith's first novel, his skill as a storyteller and his experience as a screenwriter are apparent in the book's absorbing plot and suspenseful pacing. He points to his days on commuter trains as another influence. \"There was no way to do that journey without a book: a book you could get wrapped up in, a book you could read standing up, a book you'd miss your tube stop for. That was the kind of book I wanted to write.\" Originally from Norbury in South London, the 28-year-old Smith started writing plays in school and continued while he attended Cambridge, from which he graduated in 2001. After spending a year in Italy on a creative writing scholarship, he became assistant story editor for a British soap opera, then moved to Phnom Penh with the BBC to be the story consultant for Cambodia's first soap opera. He currently lives in London. From Our BooksellersA pulse-raising, edge-of-your-seat thriller!--Laura Brauman, Bourbonnais, ILExpertly atmospheric and brilliantly quease-inducing.--Seth Christenfeld, White Plains, NYIf Thomas Harris had set a story in the Gulag, this would have been it.--Melissa Willits, Carmel, INA fascinating look into Stalinist Russia.--Michele Williams, Long Beach, CAA brilliant debut thriller that fans of Gorky Park will devour.--Margie Turkett, Annapolis, MD",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Thriller",
    "Mystery",
    "Crime",
    "Russia",
    "Historical"
  ],
  "author": "Tom Rob Smith",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/7008145-child-44"
}