{
  "title": "Finding It: And Satisfying My Hunger for Life Without Opening the Fridge",
  "description": "Welcome back to chez Bertinelli, where life is as crazy and comical as ever. Valerie gets even more personal about her inner her maternal anxieties about her son, Wolfie (he's fallen in love and, as she writes, \"getting your sex talk from Eddie Van Halen wasn't recommended in any of the parenting books I read\"); her mother's own new diet adventure; and a craving for a deeper relationship with a Higher Power. And as if these everyday challenges weren't enough, Valerie is working to maintain her own very public weight loss. She even gets to thinking she might kick it up a notch, shed more weight and get so buff she can wear a bikini -- in public. In Finding It , Valerie comes face-to-face with hard questions of family, faith, and beachwear, and realizes that she's hungering for another transformation -- to become better, not just thinner. Forget the scale; the real change is happening inside, and Valerie realizes that this is the part of dieting that no one ever talks about -- the reality of keeping the pounds off. Dieting fixes one problem, she discovers, but to maintain that weight loss, she has to work on everything else -- all the reasons she got fat in the first place. Warm and friendly, honest and self-aware -- like a talk with your BFF -- Finding It tells of the common worries and frustrations, the funny and fabulous moments in Valerie's publicly private life. With the same winning wit and candor that touched several generations of fans in Losing It , Finding It is an optimistic story for trying times. It's about believing in love and happiness, having faith that both are possible, and finding out that God does want you to enjoy life's desserts -- even when you're on a diet.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Autobiography",
    "Biography Memoir",
    "Self Help"
  ],
  "author": "Valerie Bertinelli",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/7010937-finding-it"
}