{
  "title": "The Bronze Horseman",
  "description": "Special PerfectBound e-book exclusive feature! Paullina Simons's tribute to her still-living grandparents, survivors of Russia's twentieth century from World War I and the Russian Revolution through the siege of Leningrad and the regimes of Lenin and Stalin. Leningrad, 1941: The European war seems far away in this city of fallen grandeur, where splendid palaces and stately boulevards speak of a different age, when the city was known as St. Petersburg. Two sisters, Tatiana and Dasha Metanov, live in a cramped apartment, sharing one room with their brother and parents. Such are the harsh realities of Stalin's Russia, but when Hitler invades the country, the siege of its cities makes the previous severe conditions seem luxurious. Against this backdrop of danger and uncertainty, Tatiana meets Alexander, an officer in the Red Army whose self-confidence sets him apart from most Russian men and helps to conceal a mysterious and troubled past. Once the relentless winter and the German army's blockade take hold of the city, the Metanovs are forced into ever more desperate measures to survive. With bombs falling and food becoming scarce, Tatiana and Alexander are drawn to each other in an impossible love that threatens to tear her family apart and reveal his dangerous secret -- a secret as destructive as the war itself. Caught between two deadly forces, the lovers find themselves swept up in a tide of history at a turning point in the century that made the modern world. From the author of the international bestseller Tully comes an epic tale of passion, betrayal, and survival in World War II Russia. Mesmerizing from the very first page to the final, breathtaking end, The BronzeHorseman brings alive the story of two indomitable, heroic spirits and their great love that triumphs over the devastation of a country at war.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Historical",
    "Historical Romance",
    "Fiction",
    "War",
    "Russia"
  ],
  "author": "Paullina Simons",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/7011255-the-bronze-horseman"
}