{
  "title": "After America",
  "description": "March 14, 2003, was the day the world changed forever. A wave of energy slammed into North America and devastated the continent. The U.S. military, poised to invade Baghdad, was left without a commander in chief. Global order spiraled into chaos. Now, three years later, a skeleton U.S. government headquartered in Seattle directs the reconstruction of an entire nation—and the battle for New York City has begun.Pirates and foreign militias are swarming the East Coast, taking everything they can. The president comes to the Declared Security Zone of New York and barely survives the visit. The enemy—whoever they are—controls Manhattan’s concrete canyons and the abandoned flatlands of Long Island. The U.S. military, struggling with sketchy communications and a lack of supplies, is mired in a nightmare of urban combat.Caught up in the violence is a Polish-born sergeant who watches the carnage through the eyes of an intellectual and with the heart of a warrior. Two smugglers, the highborn Lady Julianne Balwyn and her brawny partner Rhino, search for a treasure whose key lies inside an Upper East Side Manhattan apartment. Thousands of miles away, a rogue general leads the secession of Texas and a brutal campaign against immigrants, while Miguel Pieraro, a Mexican-born rancher, fights back. And in England, a U.S. special ops agent is called into a violent shadow war against an enemy that has come after her and her family.The president is a stranger to the military mindset, but now this mild-mannered city engineer from the Pacific Northwest needs to make a soldier’s choice. With New York clutched in the grip of thousands of heavily armed predators, is an all-out attack on the city the only way to save it?   From the geopolitics of post-American dominance to the fallout of Israel’s nuclear strike, After America provides a gripping, intelligent, and harrowing chronicle of a world in the maw of chaos—and lives lived in the dangerous dawn of a strange new future.",
  "genres": [
    "Science Fiction",
    "Alternate History",
    "Fiction",
    "Thriller",
    "Post Apocalyptic",
    "Military Fiction",
    "Apocalyptic"
  ],
  "author": "John Birmingham",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/7010246-after-america"
}