{
  "title": "Killing the Buddha: A Heretic's Bible",
  "description": "\"If you meet the Buddha on the road, kill him.\"The ninth-century sage Lin Chi gave this advice to one of his monks, admonishing him that this Buddha would only be a reflection of his unexamined beliefs and desires. Peter Manseau and Jeff Sharlet took Lin Chi's advice to heart and set out on a car trip around America, looking for Buddhas along the road and the people who meet prophets in G-strings dancing to pay the rent, storm chasers hunting for meaning in devastating tornados, gangbangers inking God on their bodies as protection from bullets, cross-dressing terrorist angels looking for a place to sing.Along the way Manseau and Sharlet began to wonder what the traditional scripture they encountered everywhere -- in motels, on billboards, up and down the radio dial -- would look like remade for today's world. To find out, they called upon some of today's most intriguing writers to recast books of the Bible by taking them apart, blowing them up with ink and paper.Rick Moody recasts Jonah as a modern-day gay Jewish man living in Queens. A.L. Kennedy meditates on the absurdity of Genesis. In Samuel, April Reynolds visits a man of tremendous vision in Harlem. Peter Trachtenberg unravels the Gordian logic of Job by way of the Borscht Belt. Haven Kimmel dives into Revelation and comes out in a swoon. Woven through these divine books are Manseau and Sharlet's dispatches from the road, their Psalms of the people.What emerges from this work of calling is not an attack on any religion, but a many-colored, positively riveting look at the facets of true belief. Together these curious minds tell the strange, funny, sad, and true story of religion in America for the spiritual seeker in all of A Heretic's Bible.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Philosophy",
    "Sociology",
    "Short Stories"
  ],
  "author": "Peter Manseau",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/7006434-killing-the-buddha"
}