{
  "title": "The Not So Big House: A Blueprint for the Way We Really Live",
  "description": "Ten years ago, Sarah Susanka started a revolution in home design with a deceptively simple quality should always come before quantity. Now, the book that celebrated that bold declaration is back in this special 10th anniversary edition featuring a new introduction and 16 additional pages that explore three new homes. Nearly a quarter-million people bought this ground-breaking book when it was published in Fall 1998 . Since then, the book's simple message ― that quality should come before quantity ― has started a movement in home design. Homeowners now know to expect more. And the people responsible for building our homes have also gotten the message. Architects and builders around the country report clients showing up with dog-eared copies of The Not So Big House , pages marked to a favorite section. Why are we drawn more to smaller, more personal spaces than to larger, more expansive ones? Why do we spend more time in the kitchen than we do in the formal dining room? The Not So Big House proposes clear, workable guidelines for creating homes that serve both our spiritual needs and our material requirements, whether for a couple with no children, a family, empty nesters, or one person alone. In 1999, Sarah Susanka was then architect and principal with Mulfinger, Susanka, Mahady & Partners, the firm selected to design the 1999 Life Dream House brought Frank Lloyd Wright's same common-sense, human-scale design principles to our generation. Consider which rooms in your house you use and enjoy most, and you have a sense of the essential principles of The Not So Big House . Whether you seek comfort and calm or activity and energy at home, The Not So Big House offers a place for every mood.",
  "genres": [
    "Nonfiction",
    "Architecture",
    "Design",
    "Reference",
    "How To",
    "Art",
    "Construction"
  ],
  "author": "Sarah Susanka",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/7011307-the-not-so-big-house"
}