{
  "title": "The Merlot Murders: A Wine Country Mystery",
  "description": "\"Finely ladled suspense,\" says the Sun-Sentinel about the complex flavor of Ellen Crosby's debut mystery set in the wealthy Blue Ridge wine country of northern Virginia, where vineyard heiress Lucie Montgomery must find a killer or lose her cherished family heritage.A phone call at two thirty in the morning is never good news. Lucie Montgomery's semiestranged brother, Eli, calls her in France to tell her their father, Leland, has been killed in a hunting accident on the family's five-hundred-acre Virginia vineyard just as the fall harvest is about to begin. By the time he calls, Eli has already made funeral arrangements with what Lucie argues is indecent haste.It is an emotional trip home -- the first since an automobile accident two years ago, which left Lucie disabled and dependent on a cane. Her family's once elegant home and winery are now shabby and run-down, thanks to her father's penchant for fringy business deals. Eli, also cash-strapped and desperate to support his new wife's extravagant lifestyle, has already convinced their rebellious younger sister, Mia, to sell the debt-ridden estate and reap the profits from the valuable land it sits on, overruling Lucie's protests.On the eve of the funeral Lucie's godfather, Fitz, a partner in the family business, tells her Leland's death was no accident. Whoever killed him was motivated by the potential sale of the vineyard. It is the last conversation she will have with Fitz. Now the lone holdout preventing the vineyard sale, Lucie realizes she's next in line for another \"accident.\" With her greedy brother, hell-raising sister, and a seemingly cut-rate vintner hired by Leland just before he died, all the suspects are disturbingly close to home. Unsure whom she can trust, Lucie must uncover the truth about the deaths of her father and godfather -- and oversee a successful harvest to save the vineyard she loves.",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Cozy",
    "Audiobook",
    "Book Club",
    "Mystery Thriller"
  ],
  "author": "Ellen Crosby",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/7007009-the-merlot-murders"
}