{
  "title": "Buffalito Destiny",
  "description": "BOOKLIST: \"Makes for a fun read, especially given such a fantastic cast of characters.\" \"BUFFALITO DESTINY is a charming, cheerfully improbable, and delightfully entertaining tale.\" - Jay Lake, author of ESCAPEMENT and GREEN. \"Artfully drawn, extremely original, and delightfully described. Highly recommended.\" - Walter H. Hunt, author of the DARK WING series and A SONG IN STONE. \"Schoen makes the unlikely and the implausible into a thoroughly entertaining and uttlerly believable romp.\" - Launa Anne Gilman, author of the RETRIEVERS series. A former stage hypnotist, the Amazing Conroy really just wants to have a good meal. He's now the wealthy CEO of a company that leases buffalo dogs, alien creatures capable of biting into and devouring nearly anything. When he attempts to implement a solution for cleaning up massive industrial waste sites, Conroy becomes targeted by ecological terrorists who resent the use of alien technology (living or otherwise) to heal the Earth. But kidnapping and the destruction of his corporate headquarters are the least of Conroy's problems. An unknown, telepathic intelligence has begun invading his dreams, warning of geological disasters that hinge on what Conroy does next. Further complicating his life are several groups of aliens, each believing that he has a special destiny to fulfil, though they don't necessarily agree what it is. Accompanied by his pet buffalito, Reggie, Conroy must elude terrorists, confound alien zealots, withstand temporal distortions throughout the former state of Texas, and explore ancient Mayan ruins. His adventures will result in his reunion with a long dead relative, a chance to experience the world's greatest sandwiches, exposure to alien bliss, a battle with a megalomaniac on the slope of an active volcano, and a trip to the asteroid belt for a final face-to-face confrontation with the creature that had been invading his dreams. Somewhere in the midst of it all, he has to find his true destiny.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Lawrence M. Schoen",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/7018900-buffalito-destiny"
}