{
  "title": "Safe Harbor",
  "description": "Readers across the country have embraced the moving, magical novels of Luanne Rice, among them her acclaimed bestsellers Firefly Beach , Follow the Stars Home , and Cloud Nine .The New York Times Book Review has called Rice's work \"exciting, emotional, terrific,\" and praises her \"rare combination of realism and romance.\" Now from this gifted writer comes a new novel -- the story of two generations of sisters and the indelible bonds among them, set on the timeless New England coastline she has made her own.Dana Underhill's artistic gift has led her all over the world in search of new oceanscapes. Her breathtaking underwater canvases evoke all the beauty and romance of the seas she and her beloved sister, Lily, have sailed since childhood. But when a shattering event takes Lily from her forever, Dana must leave her nomadic artist's life for the salt marshes and tidal creeks of her childhood home at Hubbard's Point, Connecticut, to become a mother to Lily's two young daughters, Quinn and Allie.Twelve-year-old Quinn may be Dana's toughest challenge. With a mass of wiry braids as uncontrollable as she is, Quinn hides her secret diary in a remote cove and clings fiercely to private mementos of her parents. Already an expert sailor herself, Quinn is convinced their deaths at sea were no accident. Dana, too, is troubled by the puzzle of what could have gone so terribly wrong on that clear, moonlit night. Support comes to Dana with the unexpected reappearance of an old friend, marine biologist Sam Trevor, whom readers will remember from Firefly Beach . When Sam was eight years old, Dana taught him to sail and unlocked his dreams of the undersea world. Now he's a tall, laughing-eyed pro, researching dolphins. And he's been in love with Dana for all the years that have passed between them.Dana cannot begin to contemplate opening her heart again, especially now, especially to a man she can only allow herself to see as a young student. But together, she and Sam begin to discover that Hubbard's Point is the center of endless mysteries, and that many of the answers lie in the blue-purple depths that surge through Dana's paintings and into all of their lives, revealing the transcendence of love even in the face of grief and death. Haunting and powerful, Safe Harbor is an unforgettable story of family bonds, love lost and found, and of a painter's unfolding vision of herself, as an artist -- and as a woman.From the Hardcover edition.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Family",
    "Contemporary Romance",
    "Contemporary",
    "Mystery"
  ],
  "author": "Luanne Rice",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/7013886-safe-harbor"
}