{
  "title": "The Black History of the White House",
  "description": "“Clarence Lusane is one of America’s most thoughtful and critical thinkers on issues of race, class and power.”—Manning Marable\"Barack Obama may be the first black president in the White House, but he's far from the first black person to work in it. In this fascinating history of all the enslaved people, workers and entertainers who spent time in the president's official residence over the years, Clarence Lusane restores the White House to its true colors.\" --Barbara EhrenreichThe Black History of the White House presents the untold history, racial politics, and shifting significance of the White House as experienced by African Americans, from the generations of enslaved people who helped to build it or were forced to work there to its first black First Family, the Obamas.Clarence Lusane juxtaposes significant events in White House history with the ongoing struggle for democratic, civil, and human rights by black Americans and demonstrates that only during crises have presidents used their authority to advance racial justice. He describes how in 1901 the building was officially named the “White House” amidst a furious backlash against President Roosevelt for inviting Booker T. Washington to dinner, and how that same year that saw the consolidation of white power with the departure of the last black Congressmember elected after the Civil War. Lusane explores how, from its construction in 1792 to its becoming the home of the first black president, the White House has been a prism through which to view the progress and struggles of black Americans seeking full citizenship and justice.Dr. Clarence Lusane has published in The Washington Post, The Miami Herald, The Baltimore Sun, Oakland Tribune, Black Scholar, and Race and Class. He often appears on PBS, BET, C-SPAN, and other national media. The author of several books and former",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Politics",
    "Race",
    "African American",
    "Social Justice"
  ],
  "author": "Clarence Lusane",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/7016269-the-black-history-of-the-white-house"
}