{
  "title": "Lake of Sorrows",
  "description": "Acclaimed by the critics for her luminous first novel, \"Haunted Ground,\" Erin Hart returns with a magnificent new tale of death and destiny, past and present, in an Ireland rich with tradition, myth, and mystery.American forensic pathologist Nora Gavin has been called to an archaeological site in the bleak midlands west of Dublin to assist at an excavation where a well-preserved Iron Age body has been found buried in a peat bog.How many hundreds or thousands of years ago was the man killed? Was his a ritual death, some kind of human sacrifice? These academic questions are intriguing, but of much more urgent interest is the second body found nearby -- of a man wearing a wristwatch, hardly an Iron Age accessory. But his corpse does show strange similarities to that of his ancient counterpart. Both bodies bear signs of \"triple death,\" a primitive practice in which a victim was ritually slain three ways, perhaps to appease some pagan trinity.Nora and archaeologist Cormac Maguire, embroiled in a tumultuous love affair, must team up again professionally, and are soon enmeshed in the web of tangled desires and terrible secrets that surround this untimely death. When the triple deaths continue, Nora and Cormac know they are in the middle of a deadly game.Everyone they meet seems to have something to hide: archaeologist Ursula Downes and bog manager Owen Cadogan can barely contain their mutual antipathy; bog worker Charlie Brazil and archaeology student Rachel Briscoe are eccentric misfits with family troubles; police detective Liam Ward has never completely recovered from his wife's suicide. And watching them all from the periphery is the shadowy figure of Brona Scully, whohasn't uttered a word in the last ten years.The danger mounts, fueled by illicit liaisons, rumors of ancient gold, and one person's thirst for vengeance. Nora and Cormac must tread carefully, for as they draw closer to the truth, they come ever nearer to becoming the next victims of a ruthless killer.A gripping follow-up to Hart's sensational debut, weaving together history, folklore, and forensics, and following in the evocative tradition of writers such as Elizabeth George and Daphne du Maurier, \"Lake of Sorrows\" is a passionate novel of suspense from a superbly gifted new crime-writing star.",
  "genres": [
    "Mystery",
    "Ireland",
    "Fiction",
    "Mystery Thriller",
    "Crime",
    "Archaeology",
    "Thriller"
  ],
  "author": "Erin Hart",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/702188.Lake_of_Sorrows"
}