{
  "title": "One Door Away from Heaven",
  "description": "This edition contains an excerpt from Dean Koontz's The City.Hailed as “America’s most popular suspense novelist” (Rolling Stone) Dean Koontz has entered a rich new phase of his writing career that is yielding his most imaginative, meaningful, and popular work yet. At the height of his powers as a literary craftsman, he has won the acclaim of critics as well as the allegiance of millions of fans the world over, transforming the greatest fears and hopes of our time into masterworks of dazzling originality and emotional resonance. Now, with the stunning depth and virtuosity of his storytelling, he brings to readers one of his most gripping and richly imagined novels to date—an intoxicating story of adventure and suspense, mystery and revelation, told with humor, heart, and high art. One Door Away From Heaven In a dusty trailer park on the far edge of the California dream, Michelina Bellsong contemplates the choices she has made. At twenty-eight, she wants to change the direction of her troubled life but can’t find her way—until a new family settles into the rental trailer next door and she meets the young girl who will lead her on a remarkable quest that will change Micky herself and everything she knows—or thinks she knows—forever. Despite the brace she must wear on her deformed left leg, and her withered left hand, nine-year-old Leilani Klonk radiates a buoyant and indomitable spirit that inspires Micky. Beneath Leilani’s effervescence, however, Micky comes to sense a quiet desperation that the girl dares not express. Leilani’s mother is little more than a child herself. And the girl’s stepfather, Preston Maddoc, is educated but threatening. He has moved the family from place to place as he fanatically investigates UFO sightings, striving to make contact, claiming to have had a vision that by Leilani’ s tenth birthday aliens will either heal her or take her away to a better life on their world. Slowly, ever more troubling details emerge in Leilani’s conversations with Micky. Most chilling is Micky’s discovery that Leilani had an older brother, also disabled, who vanished after Maddoc took him into the woods one night and is now “gone to the stars.” Leilani’s tenth birthday is approaching. Micky is convinced the girl will be dead by that day. While the child-protection bureaucracy gives Micky the runaround, the Maddoc family slips away into the night. Micky sets out across America to track and find them, alone and afraid but for the first time living for something bigger than herself. She finds herself pitted against an adversary, Preston Maddoc, as fearsome as he is cunning. The passion and disregard for danger with which Micky pursues her quest bring to her side a burned-out detective who joins her on a journey of incredible peril and startling discoveries, a journey through terrible darkness to unexpected light. One Door Away From Heaven is an incandescent mix of suspense and humor, fear and wonder, a story of redemption and timeless wisdom that will have readers cheering. Filled with tragedy and joy, with terror and hope, it solidifies Dean Koontz’s reputation as one of the foremost storytellers of our time. This is Dean Koontz at his very best—and it doesn’t get any better than that.",
  "genres": [
    "Horror",
    "Fiction",
    "Thriller",
    "Suspense",
    "Mystery",
    "Science Fiction",
    "Fantasy"
  ],
  "author": "Dean Koontz",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/7020115-one-door-away-from-heaven"
}