{
  "title": "Normal Women: Nine Hundred Years of Making History",
  "description": "The #1 New York Times bestselling historical novelist delivers her magnum opus—a landmark work of feminist nonfiction that radically redefines our understanding of the extraordinary roles ordinary women played throughout British history.Most histories have been written by men, about men, relegating women—with the exception of a few queens—to the shadows of time. Now, bestselling author Philippa Gregory reveals the importance of ordinary women, providing a more balanced and truer chronicle that expands and adds rich detail to the story of Great Britain.In Normal Women, Gregory draws on an enormous archive of primary and secondary sources to rewrite British history, focusing on the agency, persistence, and effectiveness of everyday women throughout periods of social and cultural transition. She sweeps from the making of the Bayeux tapestry in the eleventh century to the Black Death in 1348—after which women were briefly paid the same wages as men, the last time for seven centuries—to the 1992 ordination of women by the Church of England, when the church accepted, for the first time, that a woman could perform the miracle of the mass.Through the stories of the female soldiers of the civil war, the guild widows who founded the prosperity of the City of London, highwaywomen and pirates, miners, ship owners, international traders, the women who ran London theaters and commissioned plays from Shakespeare, and the \"female husbands\" who married each other legally in church and lived as husband and wife, Gregory redefines \"normal\" female behavior to include heroism, rebellion, crime, treason, money-making, and sainthood. As she makes clear, normal women make history. Normal Women will include black-and-white illustrations throughout and a full-color insert.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Audiobook",
    "Historical",
    "Womens",
    "Politics"
  ],
  "author": "Philippa Gregory",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/70240521-normal-women"
}