{
  "title": "World War II: London Blitz Diary, Volume 2",
  "description": "This is volume two of a four volume series of diaries written in London, England during World War ll. The first volume was comprised of 1939-1940. This volume is 1941 and are Ruby’s outpourings of her experience during that year of the War Blitz bombings. In this very personal and historical account in which Ruby writes about her truth of the war which she shares with no one but the diary. She describes the terror she experiences night after night, wondering if she will see the next day. What these citizen's managed is mind-boggling and is a reminder of how atrocious war really is. Ruby says: \"September 21, 1941 . . . We are hypnotized by propaganda; by the impact of particular places and persons; by religion, by war, and by ourselves, by our own terrible easy suggestibility. We are sheep, dumb fool sheep. Consider this huge derision of patriotism and of war. As I looked over Kent yesterday, so peaceful, all the harvest in, so green, so quiet, the sense of the folly of the war enveloped me ever more tightly and suffocating then in Blitzed London. Much of London is offensive to the sight, so that when one sees portions of it utterly destroyed unconsciously one is reconciled to the destruction. . . . The further I went from London the more I was convinced that war is only made by the few bad men in power, for their own profit. War pays the armament makers. The puzzle is: Why do common men obey the warlords? Why? Because they are hypnotized by words, deluded by propaganda and patriotism. Oh God! What fools men are! . . . One thing I determined, and that is, to guard my own mind. That seems the most important thing to me today, to protect my mind and to keep out the crazy propaganda and all the world’s false beliefs. The everlasting verities, those are what I want to discern and the realities, and mainly the beautiful and good realities. War is a reality and Hitler is a reality, but neither Hitler nor war is enduring; both will pass away, but the grass will remain, beauty will remain. Ruby says \"This world is hell, and Hitler is Satan himself. The last war convinced me of the reality of the Devil: this war reinforces that conviction. I say, men create war; yes, but the evil in men’s hearts, which creates this sort of war, is the devil’s evil itself. . This is devilish fiendish air-war, every casualty a civilian.Oh the damn foolishness of war, and the ineptitude of politicians!Where will the bombs drop tonight? London, Berlin, Athens, Romford.\"",
  "genres": [
    "Nonfiction",
    "World War II",
    "History",
    "Memoir",
    "British Literature"
  ],
  "author": "Ruby Side Thompson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/13013311-world-war-ii"
}