{
  "title": "Seven Miracles That Saved America: Why They Matter and Why We Should Have Hope",
  "description": "When the odds were stacked against us, and there have been many times when the great experiment we call America could have and should have failed, did God intervene to save us? That question, posed by authors Chris and Ted Stewart, is the foundation for this remarkable book. And the examples they cite provide compelling evidence that the hand of Providence has indeed preserved the United States of America on multiple occasions. Skillfully weaving story vignettes with historical explanations, they examine seven instances that illustrate God's protecting -The unlikely discovery of America by Christopher Columbus -How (and why) desperate English colonists were able to survive the starving time at Jamestown -The Battle of New York during the Revolutionary War -The miraculous creation of the United States Constitution -Abraham Lincoln's desperate prayer that turned the tide of the Civil War at Gettysburg -How a series of extraordinary events changed the Battle of Midway during World War II -The preservation of Ronald Reagan's life from an assassin's bullet, allowing him the time he needed to help extend freedom around the world Never, at any of these critical junctures, was a positive outcome certain or even likely. Yet America prevailed. Why? \"No man is perfect,\" write the authors. \"And neither is any nation. Yet, despite our weakness, we are still, as Abraham Lincoln said, the best nation ever given to man. Despite our faults, this nation is still the last, best hope of earth.\" In short, God still cares what happens here. This reassuring message is a bright light in a world that longs for such hope.",
  "genres": [
    "History",
    "Nonfiction",
    "Book Club",
    "Historical",
    "Religion",
    "American History",
    "Inspirational"
  ],
  "author": "Chris Stewart",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/7024307-seven-miracles-that-saved-america"
}