{
  "title": "The Colony of New Netherland: A Dutch Settlement in Seventeenth-Century America",
  "description": "The Dutch involvement in North America started after Henry Hudson, sailing under a Dutch flag in 1609, traveled up the river that would later bear his name. The Dutch control of the region was short-lived, but had profound effects on the Hudson Valley region. In The Colony of New Netherland, Jaap Jacobs offers a comprehensive history of the Dutch colony on the Hudson from the first trading voyages in the 1610s to 1674, when the Dutch ceded the colony to the English. As Jacobs shows, New Netherland offers a distinctive example of economic colonization and in its social and religious profile represents a noteworthy divergence from the English colonization in North America. Centered around New Amsterdam on the island of Manhattan, the colony extended north to present-day Schenectady, New York, east to central Connecticut, and south to the border shared by Delaware, New Jersey, and Pennsylvania, leaving an indelible imprint on the culture, political geography, and language of the early modern mid-Atlantic region. Dutch colonists' vivid accounts of the land and people of the area shaped European perceptions of this bountiful land; their own activities had a lasting effect on land use and the flora and fauna of New York State, in particular, as well as on relations with the Native people with whom they traded. Sure to become readers' first reference to this crucial phase of American early colonial history, The Colony of New Netherland is a multifaceted and detailed depiction of life in the colony, from exploration and settlement through governance, trade, and agriculture. Jacobs gives a keen sense of the built environment and social relations of the Dutch colonists and closely examines the influence of the church and the social system adapted from that of the Dutch Republic. Although Jacobs focuses his narrative on the realities of quotidian existence in the colony, he considers that way of life in the broader context of the Dutch Atlantic and in comparison to other European settlements in North America.",
  "genres": [
    "History",
    "American History"
  ],
  "author": "Jaap Jacobs",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/7022158-the-colony-of-new-netherland"
}