{
  "title": "Teaming: How Organizations Learn, Innovate, and Compete in the Knowledge Economy",
  "description": "New breakthrough thinking in organizational learning, leadership, and change Continuous improvement, understanding complex systems, and promoting innovation are all part of the landscape of learning challenges today's companies face. Amy Edmondson shows that organizations thrive, or fail to thrive, based on how well the small groups within those organizations work. In most organizations, the work that produces value for customers is carried out by teams, and increasingly, by flexible team-like entities. The pace of change and the fluidity of most work structures means that it's not really about creating effective teams anymore, but instead about leading effective teaming. Teaming shows that organizations learn when the flexible, fluid collaborations they encompass are able to learn. The problem is teams, and other dynamic groups, don't learn naturally. Edmondson outlines the factors that prevent them from doing so, such as interpersonal fear, irrational beliefs about failure, groupthink, problematic power dynamics, and information hoarding. With Teaming, leaders can shape these factors by encouraging reflection, creating psychological safety, and overcoming defensive interpersonal dynamics that inhibit the sharing of ideas. Further, they can use practical management strategies to help organizations realize the benefits inherent in both success and failure. * Presents a clear explanation of practical management concepts for increasing learning capability for business results * Introduces a framework that clarifies how learning processes must be altered for different kinds of work * Explains how Collaborative Learning works, and gives tips for how to do it well * Includes case-study research on Intermountain healthcare, Prudential, GM, Toyota, IDEO, the IRS, and both Cincinnati and Minneapolis Children's Hospitals, among others Based on years of research, this book shows how leaders can make organizational learning happen by building t",
  "genres": [
    "Leadership",
    "Business",
    "Nonfiction",
    "Management",
    "Psychology",
    "Buisness",
    "Audiobook"
  ],
  "author": "Amy C. Edmondson",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/7023600-teaming"
}