{
  "title": "When the Planet Rages: Natural Disasters, Global Warming and the Future of the Earth",
  "description": "In New England, 1816 was called the Year Without a Summer. Crops failed throughout America and, in Western Europe, it was even worse, with food riots and armed groups raiding bakeries and grain markets. All this turmoil followed a catastrophic volcanic eruption--a year earlier on the other side of the world--the eruption of Tambora, a blast heard almost a thousand miles away.In When the Planet Rages , Charles Officer and Jake Page describe some of the great events of environmental history, from calamities such as the Lisbon earthquake of 1755 (the greatest in recorded history) and the ice ages, to recent man-made disasters such as Chernobyl, acid rain, and the depletion of the ozone layer. Officer and Page provide fascinating discussions of meteorites and comets; of the demise of mammoths, mastodons, and dinosaurs; and of great floods that have swept the earth. But they also show that human activity can make trouble for nature, discussing the depletion of natural resources (we burn coal and oil at millions of times their natural rate of production), air pollution in Los Angeles and London (where the Killer Smog of 1952 caused the death of some four thousand people), and the pollution of major waterways, like the Chesapeake Bay and Lake Erie. For the paperback edition, the authors have included a new preface, have added material on the recent Sichuan,China earthquake, the Indian Ocean Tsunami, and Hurricane Katrina, and discuss such topics as of the (un)predictability of symptoms of global warming.Ranging from the monumental eruption at Krakatoa to industrial disasters such as the mercury poisoning in Japan's Minamata Bay, When the Planet Rages will engage anyone concerned with the environment and the natural world.",
  "genres": [],
  "author": "Charles Officer",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/7020379-when-the-planet-rages"
}