{
  "title": "Breathless",
  "description": "Synopsis:The body of a man is found as Provincetown prepares for Mates weekend, a popular leather gathering. Corey thinks a BDSM scene went past its extreme limit. He tours the town's dark dungeons, looking for a murderer preying on young men. Can Corey find him before becoming a victim to the ultimate BDSM fantasy of execution? Excerpt:“All of the victims were killed in the same manner, in cities where a major leather event was being held,” Corey said.“And you think that this maniac is here in Provincetown?”“You saw the body yourself, Chief.”“But none of the others.”“You will very shortly.”“What do you mean?” Chief Stewart said in surprise.“The files from those cases are being emailed to all communities involved to each other,” Corey answered. “You’ll be able to make your own conclusions. Please ask Agent Seger to forward anything she finds back to them.”Chief Stewart began to grasp the scope of the crime. “Any connections between the victims?”“So far, none that we can tell,” Corey sighed. “They were all young men from around the country, just visiting leather events.”“San Francisco, New York City, Chicago and Washington, DC are all huge compared to Provincetown. They always have hundreds of events going on all the time. Can they say for certain that those guys were in those cities for those events?”“In a couple of the cases, surviving relatives knew what their kin were up to, attending a leather gathering. Unfortunately some of the men were closeted, it seems, and the families had no idea where their family members went. It was only after the death that the relations realized there was a part of him they had never expected. In the two cases where the victim has not been identified, not counting ours, it’s theorized that he was so far in the closet, he gave his family and friends no clue to where he was going, so they have no idea where to start looking for him.”“Or,” Chief Stewart held up a finger. “The family knows where he went but so disapproved of their man’s lifestyle that they don’t care if he’s missing. It doesn’t matter to them if he’s dead, as long as he’s not bugging them anymore.”Corey nodded throughout the chief’s hypothesis. “Sad but very possibly true.”",
  "genres": [
    "M M Romance",
    "BDSM",
    "Mystery",
    "Paranormal",
    "Paranormal Romance"
  ],
  "author": "Alex Morgan",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/7029682-breathless"
}