{
  "title": "'Salem's Lot",
  "description": "Stephen King’s second novel, the classic vampire bestseller ’SALEM’S LOT, tells the story of evil in small-town America. For the first time in a major trade edition, this terrifying novel is accompanied by previously unpublished material from King’s archive, two short stories, and eerie photographs that bring King’s fictional darkness and evil to vivid life. When Stephen King’s classic thriller’SALEM’S LOT hit the stands in 1975, it thrilled and terrified millions of readers with tales of demonic evil in small-town America. Now, thirty years later and still scaring readers witless, ’SALEM’S LOT reemerges in a brilliant new edition, complete with photographs, fifty pages of deleted and alternate scenes, and two short stories related to the events of the novel. While the original edition of ’SALEM’S LOT will forever be a premier horror classic, ’SALEM’S ILLUSTRATED EDITION, with the inclusion of material from King’s archive, is destined to become a classic in its own right and a must-have for all Stephen King fans. In this edition, the hair-raising story of Jerusalem’s Lot, a small town in Maine whose inhabitants succumb to the evil allure of a new resident, is told as the author envisioned it, complete with fifty pages of alternate and deleted scenes. With a new introduction by the author, two short stories related to the events and residents of Jerusalem’s Lot, the lavishly creepy photographs of Jerry Uelsmann, and a stunning new page design, this edition brings the story to life in words and pictures as never before. No library will be complete without this ideal collector’s item for any King aficionado, the definitive illustrated edition of the great ’SALEM’S LOT.",
  "genres": [
    "Horror",
    "Fiction",
    "Vampires",
    "Fantasy",
    "Thriller",
    "Paranormal",
    "Audiobook"
  ],
  "author": "Stephen        King",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/7025587-salem-s-lot"
}