{
  "title": "My Empire of Dirt: How One Man Turned His Big-City Backyard into a Farm",
  "description": "For seven months, Manny Howard—a lifelong urbanite—woke up every morning and ventured into his eight-hundred-square-foot backyard to maintain the first farm in Flatbush, Brooklyn, in generations. His goal was to subsist on what he could produce on this farm, and only this farm, for at least a month. The project came at a time in Manny’s life when he most needed it—even if his family, and especially his wife, seemingly did not. But a farmer’s life, he discovered—after a string of catastrophes, including a tornado, countless animal deaths (natural, accidental, and inflicted), and even a severed finger—is not an easy one. And it can be just as hard on those he shares it with.Manny’s James Beard Foundation Award–winning New York magazine cover story—the impetus for this project—began as an assessment of the locavore movement. We now think more about what we eat than ever before, buying organic for our health and local for the environment, often making those decisions into political statements in the process. My Empire of Dirt is a ground-level examination—trenchant, touching, and outrageous—of the cultural reflex to control one of the most elemental aspects of our feeding ourselves.Unlike most foodies with a farm fetish, Manny didn’t put on overalls with much of a philosophy in mind, save a healthy dose of skepticism about some of the more doctrinaire tendencies of locavores. He did not set out to grow all of his own food because he thought it was the right thing to do or because he thought the rest of us should do the same. Rather, he did it because he was just crazy enough to want to find out how hard it would actually be to take on a challenge based on a radical interpretation of a trendy (if well-meaning) idea and see if he could rise to the occasion.A chronicle of the experiment that took slow-food to the extreme, My Empire of Dirt tells the story of one man’s struggle against environmental, familial, and agricultural chaos, and in the process asks us to consider what it really takes (and what it really means) to produce our own food. It’s one thing to know the farmer, it turns out—it’s another thing entirely to be the farmer. For most of us, farming is about food. For the farmer, and his family, it’s about work.",
  "genres": [
    "Nonfiction",
    "Gardening",
    "Memoir",
    "Food",
    "Biography",
    "Autobiography",
    "Agriculture"
  ],
  "author": "Manny Howard",
  "average_rating": "2.78",
  "url": "https://www.goodreads.com/book/show/7031533-my-empire-of-dirt"
}