{
  "title": "And Then There Was Life!",
  "description": "Miles Jacob at twenty-two years old is graduating from the University of Florida on top of the world, with the love of his life by his side. Reigning two-time Heisman Trophy winner and the current National Championship title in his back pocket, Miles just has one more goal - being the overall number one draft pick of the 2013 National Football League.Inking an eighty-two million dollar contract along with several mega million endorsement deals what more could he ask for? Love - Sydney Crain, the love of his life - he had that too. Miles goes on to a series of life changing events. Having an unbelievable rookie season – winning the league’s Most Valuable Player Award and getting his team, New England Patriots into the 2014 Super Bowl title game. Life is good – but - and there is always a but – there’s just one small problem. Miles’ electrifying game winning catch leaves him exposed for a life changing one on one crushing hit in the end zone. Maintaining his hold on the football throughout unconsciousness with just seconds left in the game, Miles is soon revived only to have his entire world turned upside down. Now with a grade four concussion Miles is stripped of most his memory and must leave the game he so dearly loves. With the help of Sydney, Miles begins to start his life over. Now living in Boston, Miles begins graduate school at the famed institute of Harvard University. While attending Harvard Business School, Miles starts to live what many would call the normal life until the NSA comes-a-calling. Recruited into the underworld of the NSA - Miles Jacob is pushed deep into the underground world of lies and deceit. A world that includes an elite Double Blind Black Ops unit that’s sole mission is to handle the government’s dirty little financial secrets. From international spying to assassinations - Miles is soon left to face the United States government after refusing to complete his last mission before the World Banking Summit. Now turned government enemy number one - Miles Jacob is on the run. Running out of time and fearing for his own life Miles turns to Special Agent Jeff Armstrong for help. With detailed secrets that climb the governmental ladder, Miles must bide his time and head to prison for his own safety. Now convicted on NSA charges of compromising the economically security of the United States - Miles is now facing a minimum of twenty-six plus years in federal prison. Still having one more card up his sleeve Miles must risk it all for his freedom. After three years of being locked away; there’s still some unfinished business with the dark world of the NSA. The NSA isn’t taking any chances when it comes to Miles Jacob. They want the information only he holds and they want it now. Trying to force his hand they make the single biggest mistake in NSA history - they kidnap Sydney Crain. With Sydney Crain now in the hands of his enemies Miles is willing to do anything to get her back – which is unfortunate for the NSA. Taking matters in his own hands Miles uses the skills once taught to him by the government to hunt down Sydney’s capturers. What happens next is anyone’s guess. Follow this globe jumping - fast pace - sports energizing - drama packed - action romance novel that will have you turning the pages so fast that your own eyes will start to spin. There isn’t enough time in the day to read what happens next to Miles Jacob. Don’t blame the author if you don’t make it to work on time the next morning. This novel will give the reader a very real feeling in the life of Miles Jacob. From telephone numbers, email addresses to a virtual website that will include maps, photos, and clues.",
  "genres": [],
  "author": "André Jacob",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/13014526-and-then-there-was-life"
}