{
  "title": "Hooked!: Buddhist Writings on Greed, Desire, and the Urge to Consume",
  "description": "At one time or another, most of us have experienced an all-consuming desire for a material object, a desire so strong that it seems like we couldn't possibly be happy without buying this thing. Yet, when we give in to this impulse, we often find ourselves feeling frustrated and empty. Advertisers, of course, aim to hook us in this way, and, from a global perspective, our tendency to get hooked fuels the rampant over-consumption that is having a devastating impact on the world's stability and on the environment. According to the contributors to this unique anthology, Buddhism can shed valuable light on our compulsions to consume. Craving and attachment—how they arise and how to free ourselves of them—are central themes of Buddhist thought. The writings in this volume, most of which have never been previously published, offer fresh perspectives and much-needed correctives to our society's tendency to believe that having more will make us happier. Hooked! includes a range of writings on how to apply Buddhist thought and ethics to understand and combat the problem of over-consumption as individuals and collectively. Contributors include popular Western teachers, Asian masters, scholars, and practitioners such as:    •  Pema Chödrön—on what is actually happening at the moment we're \"hooked,\" and how to get beyond that.    •  Joseph Goldstein—on how mindfulness training can help us stop \"wanting to want.\"    •  Bhikshuni Thubten Chödrön—on how consumer mentality influences spiritual practice.    •  Judith Simmer-Brown—on how cultivating spiritually based activism and compassionate action can help us address the negative effects of consumerism.    •  Rita Gross—on how understanding moderation can curb overconsumption.    •  Santikaro Bhikkhu—on practicing generosity in a consumer world.",
  "genres": [
    "Buddhism",
    "Nonfiction",
    "Spirituality",
    "Religion",
    "Philosophy",
    "Economics",
    "Self Help"
  ],
  "author": "Stephanie Kaza",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/703494.Hooked_"
}