{
  "title": "The Vagrants",
  "description": "Brilliant and illuminating, this astonishing debut novel by the award-winning writer Yiyun Li is set in China in the late 1970s, when Beijing was rocked by the Democratic Wall Movement, an anti-Communist groundswell designed to move China beyond the dark shadow of the Cultural Revolution toward a more enlightened and open society. In this powerful and beautiful story, we follow a group of people in a small town during this dramatic and harrowing time, the era that was a forebear of the Tiananmen Square uprising.Morning dawns on the provincial city of Muddy River. A young woman, Gu Shan, a bold spirit and a follower of Chairman Mao, has renounced her faith in Communism. Now a political prisoner, she is to be executed for her dissent. Her distraught mother, determined to follow the custom of burning her only child’s clothing to ease her journey into the next world, is about to make another bold decision. Shan’s father, Teacher Gu, who has already, in his heart and mind, buried his rebellious daughter, begins to retreat into memories. Neither of them imagines that their daughter’s death will have profound and far-reaching effects, in Muddy River and beyond.In luminous prose, Yiyun Li weaves together the lives of these and other unforgettable characters, including a serious seven-year-old boy, Tong; a crippled girl named Nini; the sinister idler Bashi; and Kai, a beautiful radio news announcer who is married to a man from a powerful family. Life in a world of oppression and pain is portrayed through stories of resilience, sacrifice, perversion, courage, and belief. We read of delicate moments and acts of violence by mothers, sons, husbands, neighbors, wives, lovers, and more, as Gu Shan’s execution spurs a brutal government reaction.Writing with profound emotion, and in the superb tradition of fiction by such writers as Orhan Pamuk and J. M. Coetzee, Yiyun Li gives us a stunning novel that is at once a picture of life in a special part of the world during a historic period, a universal portrait of human frailty and courage, and a mesmerizing work of art.",
  "genres": [
    "Fiction",
    "China",
    "Historical Fiction",
    "Asia",
    "Historical",
    "Book Club",
    "Asian Literature"
  ],
  "author": "Yiyun Li",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/7038264-the-vagrants"
}