{
  "title": "The Sea Captain's Wife",
  "description": "Growing up on the Bay of Fundy, Azuba Galloway dreams of going to sea. She watches magnificent ships slowly making their way into Whelan’s Cove, the sense of exoticism bursting from their holds along with foreign goods. As a young woman, Azuba marries a seasoned merchant sea captain, Nathaniel Bradstock. Unwilling to have him away at sea for most of their married life, and anxious to see far shores, she extracts a promise that he will take her with him. But Azuba becomes pregnant soon after they marry and Nathaniel knows too well the perils of life on a ship. He reneges on his promise and refuses to allow Azuba to join him. When Nathaniel leaves on his journey, Azuba desperately misses her husband. Days turn into weeks and months – voyages can take two, three years before the ship and crew return home. Despite her loneliness, Azuba becomes a strong, independent woman, caring for her child and her home. With her parents and beloved grandmother nearby, she settles into a life of quietude and predictability, all the while yearning to be by her husband’s side aboard his ship. Her loneliness eventually propels her into a friendship with the local vicar, Reverend Simon Walton. He is a quiet, kind and contemplative man, and Azuba takes comfort and enjoyment in their increasingly intimate friendship. One afternoon, despite her misgivings, Azuba goes on a picnic with the vicar and becomes trapped by the tide. When they return home the next morning, Azuba and Reverend Walton have become a topic of gossip. When Nathaniel returns home he is enraged by her impropriety. Reluctantly he decides to take Azuba and their young daughter, Carrie, with him on his next voyage. Mother and child are loaded from a rowboat and hauled onto the weather deck along with barrels of coal and crates of chickens. Nathaniel has drawn a line across the deck. “You’ll never again cross that line,” he instructs Azuba.It is October 1862. It will be three years before Azuba sees the shores of Whelan’s Cove again. Aboard Traveller , the small family visits places Azuba dreamed she would one day London, San Francisco and exotic countries in Europe. But she also experiences the terror that can come during a life at a harrowing passage around Cape Horn, half-starvation while listlessly floating in the doldrums, and a stop at the Chincha Islands to pick up a load of guano, where she witnesses a mass suicide by slaves. She begins to question her decision to join her husband, particularly when she realizes there is “no way to erase horror from a child’s memory.”Misery follows misfortune and Azuba feels alone in a male world, surrounded by the splendour and the terror of the open sea. The voyage tests not only her already precarious marriage, but everything Azuba believes in. With a sure hand, Beth Powning captures life aboard a sailing ship – ferocious storms, the impossibly isolated ports of call, the gruelling daily routine – and shows how love evolves even in the most extreme circumstances. The Sea Captain’s Wife is an awe-inspiring tour that captures the vigour of life in the last days of the Age of Sail and gives us an unforgettable young heroine who shows compassion, courage and love while under incredible duress.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Canada",
    "Historical",
    "Romance",
    "Adventure"
  ],
  "author": "Beth Powning",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/7031413-the-sea-captain-s-wife"
}