{
  "title": "The Ghost Orchid",
  "description": "In her enthralling novels of literary suspense, Carol Goodman writes stories that resonate with emotion set in lush landscapes that entice the senses. Now, with The Ghost Orchid, a narrative that seamlessly weaves together the past and the present, Goodman creates her most lyrical and haunting work to date.For more than one hundred years, creative souls have traveled to Upstate New York to work under the captivating spell of the Bosco estate. Cradled in silence, inspired by the rough beauty of overgrown gardens and crumbling statuary, these chosen few fashion masterworks–and have cemented Bosco’s reputation as a premier artists’ colony. This season, five talented artists-in-residence find themselves drawn to the history of Bosco, from the extensive network of fountains that were once its centerpiece but have long since run dry to the story of its enigmatic founder, Aurora Latham, and the series of tragic events that occurred more than a century ago.Ellis Brooks, a first-time novelist, has come to Bosco to write a book based on Aurora and the infamous summer of 1893, when wealthy, powerful Milo Latham brought the notorious medium Corinth Blackwell to the estate to help his wife contact three of the couple’s children, lost the winter before in a diphtheria epidemic. But when a séance turned deadly, Corinth and her alleged accomplice, Tom Quinn, disappeared, taking with them the Lathams’ only surviving child.The more time she spends at Bosco, the more Ellis becomes convinced that there is an even darker, more sinister end to the story. And she’s not biographer Bethesda Graham uncovers stunning revelations about Milo and Corinth; landscape architect David Fox discovers a series of hidden tunnels underneath the gardens; poet Zalman Bronsky hears the long-dry fountain’s waters beckoning him; and novelist Nat Loomis feels something lingering just out of reach.After a bizarre series of accidents befalls them, the group cannot deny the connections between the long ago and now, the living and the dead . . . as Ellis realizes that the tangled truth may ensnare them all in its cool embrace.",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Gothic",
    "Thriller",
    "Ghosts",
    "Suspense"
  ],
  "author": "Carol Goodman",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/70393.The_Ghost_Orchid"
}