{
  "title": "هدي السيرة النبوية في التغيير الاجتماعي",
  "description": "كثيرون كتبوا في سيرة النبي صلى الله عليه وسلم، وقدموا آلاف المجلدات.. ومع هذا فإن في السيرة العطرة النيِّرة جوانب مهمة لم تأخذ حقها من التأمل والدراسة.ولقد عرضت المؤلفة خلال هذه الصفحات معالم ومواقف من هدي النبي صلى الله عليه وسلم استفادتها من سيرته الشريفة.. تقدمها إلى الشباب وإلى جيل الغد لينظروا فيها.وإذن فليس هذا البحث عرضًا لأحداث جرت في حياة النبي صلى الله عليه وسلم، وإنما هي دروس راقية تنظر بعين جديدة إلى تلك الحياة الزاخرة التي استمرت في الأرض المقدسة ثلاثًا وعشرين سنة غيرت وجه الدنيا تغييرًا جذريًا.~~~إن سيرة الرسول -صلى الله عليه وسلم- معين لا ينضب لكل دارس ومتأمل، ففيها الوقائع والسير والدروس والعبر التي تمد من يتأملها ويعمل بهديها بالعون على مصاعب الحياة متاعبها.في هذه الرواية الجديدة للسيرة تبدأ المؤلفة باستعراض البيئة التي نشأ فيها الرسول الأعظم، والحالة الاجتماعية التي كانت سائدة في ذلك الوقت وكيف كانت الأسر والقبائل والعشائر تتصارع وتتعايش أحيانًا، في هذه المنطقة، رغم اختلافاتها الدينية.ثم كيف عانى الرسول -صلى الله عليه وسلم- من اليتم والحياة الصعبة بعدأن توفي جده ومن ثم كفله عمه، لتبدأ معها رحلة ثانية مختلفة في مهمتها ومسؤوليتها وهي رحلة الدعوة إلى الله الواحد الأحد.ماذا قدمت للرسول -صلى الله عليه وسلم- أسرته وزوجته وأعمامه وعشيرته؟ وماهي مواقفها من دعوته التي كانت جديدة عليهم في نهجها وأفكارها؟ما نوع الصراع الذي جرى بين الدعوة الجديدة، والمجتمع الآبائي الذي يأبى أن يغير ما رباه عليه الآباء والأجداد.ثم كيف أسس الرسول -صلى الله عليه وسلم- المجتمع المؤمن المتكافل والمتراحم في المدينة؟ ليصبح مثالاً وحلمًا لكل فرد ومجتمع مسلم، برغم شح الموارد وضيق ذات اليد. ولكن لم يرضِ هذا الوضع أهل مكة الجاهليين فبدأ الصراع المسلح يأخذ مجراه مع المسلمين في شكل غزوات والمعارك المتتالية.ولكن شاء الله أن تكون النصرة للدعوة التوحيد والسلم والعدل والإحسان على قوى الشر السائدة.إن السيرة النبوية نبراس لكل مسلم يهتدي بها في حياته. وكتاب \"هدي السيرة النبوية\" جاء من هذا الباب ليمد المسلم بالدروس والعبر المستخلصة والعمل بها.~~~يتناول هذا الكتاب معالم ومواقف من هدي السيرة النبوية في التغيير الاجتماعي، وكيف اختار الله النبي محمدًا -صلى الله عليه وسلم- وأعده فكريًا ونفسيًا وأخلاقيًا واجتماعيًا.ويتحدث عن نزول الوحي وبدء التكليف بالدعوة وخطتها في مكة، وعالميتها، وظهورها، والمقاطعة القرشيّة للمؤمنين، وهجرة بعضهم، ومواساة الله للنبي -صلى الله عليه وسلم- في عام الحزن بالإسراء والمعراج، أول رحلة فضائية للإنسان، والهجرة إلى المدينة وتأسيس المجتمع المؤمن فيها.ويسجل الإذن بالقتال وبدء السرايا والغزوات مع التأمل في بدايتها وفي غزوات بدر وأحد والخندق ونقض اليهود لعهودهم، وحكم سعد بن معاذ في بني قريظة.ويتناول أحداثًا في الحبشة، وزواجًا بأمر الله، وأخبار بني المصطلق، والغارة على المدينة، ومنع قريش النبي -صلى الله عليه وسلم- من أداء العمرة، والتوصل إلى صلح الحديبية، ثم الخروج إلى خيبر وإنهاء الكيان السياسي لليهود في الجزيرة، وأداء النبي -صلى الله عليه وسلم- عمرة القضاء، وإسلام عمرو بن العاص، ويبحث في غزوة مؤتة، وإرسال النبي -صلى الله عليه وسلم- الكتب إلى ملوك الدول ورؤسائها.ويعرض لفتح مكة وحصار الطائف وغزوة تبوك، وعام الوفود وعام البعوث، وإمارة أسامة بن زيد الشاب على جيش فيه كبار الصحابة، وحجة الوداع وخطبته فيها، وآخر وصاياه، وموقف الناس وأبي بكر الصديق من موته، مع لقطات أخيرة في مباشرته إلغاء الرق، وأمره بتعلم كتاب يهود، وبيان السر في نجاح الدعوة الإسلامية في دروس راقية تزخر بالحياة.",
  "genres": [
    "Religion",
    "Islam",
    "History",
    "Sociology",
    "Biography"
  ],
  "author": "حنان اللحام",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/7045275"
}