{
  "title": "New Ideas from Dead CEOs: Lasting Lessons from the Corner Office",
  "description": "New Ideas from Dead CEOs uncovers the secrets of success of great CEOs by giving readers an intimate look at their professional and personal lives. Why did Ray Kroc's plan for McDonald's thrive when many burger joints failed? And how, decades later, did Krispy Kreme fail to heed Kroc's hard-won lessons? How did Walt Disney's most dismal day as a young cartoonist radically change his career? When Estée Lauder was a child in Queens, New York, the average American spent $8 a year on toiletries. Why did she spot an opportunity in selling high-priced cosmetics, and why did she pound on Saks's doors? How did Thomas Watson Jr. decide to roll the dice and put all of IBM's chips on computing, when his father thought it could be a losing idea? We learn about these CEOs' greatest challenges and failures, and how they successfully rode the waves of demographic and technological change. New Ideas from Dead CEOs not only gives us fascinating insights into these CEOs' lives, but also shows how we can apply their ideas to the present-day triumphs and struggles of Sony, Dell, Costco, Carnival Cruises, Time Warner, and numerous other companies trying to figure out how to stay on top or climb back up. The featured CEOs in this book were not candidates for sainthood. Many of them knew \"god\" only as a prefix to \"dammit.\" But they were devoted to their businesses, not just to their egos and their personal bank accounts and yachts. Extraordinarily fresh and deeply thoughtful, Todd G. Buchholz's New Ideas from Dead CEOs is a truly enjoyable and fun—yet serious and realistic—look at what we still have to learn and absorb from these decomposing CEOs.",
  "genres": [
    "Business",
    "Nonfiction",
    "Leadership",
    "Economics",
    "Biography",
    "Politics"
  ],
  "author": "Todd G. Buchholz",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/704078.New_Ideas_from_Dead_CEOs"
}