{
  "title": "The Trials of Zion",
  "description": "\"No one knows more about Israel's existential dilemma than Alan Dershowitz-or writes about it better. From its explosive beginning to its startling climax, The Trials of Zion excites and intrigues, even as it depicts the unique dangers of a lethal part of the world. This is a terrific novel.\" -- Richard North Patterson\"For a legalist, mired for years in towers of ivory not even hewn from the teeth of endangered elephants but constructed, indeed, and solely, of the casuistic and notional, Mr. Dershowitz writes a real good rip-snorter.\" -- David Mamet\"A thought-provoking thriller set in two of the world's most gripping arenas of conflict, the Middle East and the courtroom.\" -- Steven Pinker, author of The Stuff of Thought ,and Rebecca Newberger Goldstein, author of 36 Arguments for the Existence of God: A Work of Fiction\"As in all his essays, in his novel also, Alan Dershowitz demonstrates his great love for Israel as well as his inspired passion for Jewish memory, justice, and storytelling.\" -- Elie WieselA shocking act of terror brings the Middle East to the point of explosion. As the resulting political conflict threatens to erupt, a young Jewish-American lawyer joins the defense team of an arrested but possibly innocent Palestinian. Soon the lawyer's father, a famed criminal attorney, must win the Palestinian's case or risk losing his daughter forever. To do so, he must take into account the tormented history of the Holy Land from every possible angle. The Trials of Zion combines the tension of the greatest courtroom dramas with the action of a fast-moving thriller, all set against the colorful backdrop of one of the most complex cultural settings in the world. Filled with memorable characters, this novel offers readers not only compelling suspense, but a panoramic view of the history of a beloved and bitterly contested land, and a sharply controversial perspective on the sources of--and the possible solutions to--the world's longest and most crucial international crisis.",
  "genres": [
    "Fiction",
    "Thriller",
    "Religion",
    "Historical Fiction"
  ],
  "author": "Alan M. Dershowitz",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/7041161-the-trials-of-zion"
}