{
  "title": "Wij, twee jongens",
  "description": "West-Vlaanderen, anno 1910. Het gezin De Belder laat de armoede achter zich en zet de grote stap in het onbekende. Met het schip De Kroonland zullen ze de oversteek wagen naar Amerika. Maar de meningen over het land van belofte zijn verdeeld. Vader en Alexander zijn rotsvast overtuigd van het betere leven dat hen daar wacht. Maar moeder is bang, en ook Adriaan deelt het enthousiasme van zijn tweelingbroer niet. Zo onbesuisd als Alexander is, zo afwachtend is hij.Toch is Adriaan de enige die daadwerkelijk in New York terechtkomt. Hij is moederziel alleen, wordt er meteen bestolen, kan niemand verstaan. Adriaan voelt zich doodongelukkig in de wereldstad. Hij haat de drukte, de massa, de smerigheid, de kleffe hitte en heeft heimwee naar de boerderij, de velden en de geur van vers stro. Het enige wat hij wil, is zo snel mogelijk geld verdienen om terug te keren naar zijn familie.Maar dan ontmoet hij Jack.En alles verandert.Hij begint van Jack te houden en weet niet hoe hij hier mee moet omgaan. Onbewust heeft hij gevoelens gekregen, en gelukkig Jack ook voor hem. Ze beginnen een relatie, maar Adriaan voelt zich er ongemakkelijk mee. Niet voor Jack, maar voor de buitenwereld.Als uiteindelijk zijn broer, Alexander, naar New York komt, verandert alles. Jack en Alexander zijn niet de beste vrienden, ook omdat Alexander van niks weet van hun relatie. Alexander wil Adriaan terug meenemen en samen ergens een boerderij opstarten. Maar dat ziet Adriaan niet zitten, want hij is verliefd en wil Jack niet achterlaten. Uiteindelijk moet hij een beslissing nemen. Het Alexander vertellen of niet. Meegaan met Alexander of bij zijn geliefde blijven. Hij beslist uiteindelijk om toch bij Jack te blijven, en schrijft het hele verhaal aan Alexander, zoals in het boek staat geschreven.Voor jongeren vanaf 16 jaar",
  "genres": [
    "Young Adult",
    "LGBT",
    "Historical Fiction",
    "Queer",
    "Gay",
    "Fiction",
    "Romance"
  ],
  "author": "Aline Sax",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/7040840-wij-twee-jongens"
}