{
  "title": "The Sonnet Lover",
  "description": "For how thy memory has lingered on–In spite of cruelest winter’s drear and howl–By inner mirror seen; I’ve dwelled upon,I must confess, my treachery most foul.Did Shakespeare pen a series of passionate sonnets, unknown to modern scholarship, ardently praising a mysterious dark-haired beauty? This tantalizing question is raised in a letter to literature professor Rose Asher. But the letter’s author, Rose’s star pupil, is not telling. A troubled, enigmatic young man, he plunged to his death in front of the college’s entire faculty, an apparent suicide. Determined to find the truth, Rose journeys from New York to Italy, back to the magnificent Tuscan villa where as an undergraduate she first fell in love.La Civetta is a dreamlike place, resplendent with the heady scent of lemon trees and the sunset’s ocher wash across its bricks and cobbles. Once there Rose finds her first love still in residence. Torn between her mission and her rekindled feelings, Rose becomes enmeshed in a treacherous tangle of secrets and scandal. A folio containing what some believe to be one of Shakespeare’s lost sonnets has vanished, and literary immortality awaits whoever finds the manuscript–as do a vast Italian estate and a Hollywood movie deal. Uncertain whom she can trust and where she can turn, Rose races against time and unseen enemies in a bid to find the missing masterpiece.Lush, lyrical, and enthralling, The Sonnet Lover vividly brings to life the Tuscan countryside and the fascinating world of the Renaissance poets. Unmatched in her ability to evoke atmosphere and intrigue, Carol Goodman delivers her most ambitious and satisfying work to date, a seductive novel that skillfully propels its reader headlong to the final suspenseful page.",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Italy",
    "Suspense",
    "Contemporary",
    "Gothic"
  ],
  "author": "Carol Goodman",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/70398.The_Sonnet_Lover"
}