{
  "title": "Tessia: Zrození čarodějky",
  "description": "Další román z pera bestsellerové spisovatelky Trudi Canavan, tentokrát o vzniku Společenství čarodějů a o dějinách sachakanské války, jež se odehrála stovky let před událostmi Trilogie o černém mágovi.Tessia se touží stát léčitelkou a zachraňovat lidské životy, stejně jako to dělá její otec, vesnický léčitel v Mandrynu na jednom z okrajových panství Kyralie. Její velký sen se však rozplývá v jediném okamžiku. Při ošetřování pacienta v domě lorda Dakona, místního čaroděje, se jí pánův host, sachakanský mág Takado, pokusí násilně zmocnit. Tessia se brání a instinktivně při tom použije magii – ukazuje se, že je předurčená…Stává se Dakonovou učednicí a stěhuje se do jeho přepychového domu, nosí překrásné šaty a k dispozici má početné služebnictvo. Nové poslání však s sebou nese také dlouhé hodiny studia a tvrdé sebekázně. Přináší jí velký díl zodpovědnosti, a jak se později ukáže, také bolesti. Takado se totiž hodlá za ponížení, které mu uštědřila, mstít. Události nezadržitelně směřují k válce mezi dvěma zeměmi – k magické válce, jež navždy změní životy všech zúčastněných.Dobrodružný a poutavý příběh o sachakanské válce je plný nečekaných zvratů a událostí, o nichž kyralijské kroniky dosud mlčely nebo lhaly: Co se stalo se Zásobním kamenem, zdrojem nepředstavitelné ničivé síly, a kdo má na svědomí vznik pustin na sachakansko-kyralijské hranici? Jak ve skutečnosti vzniklo Společenství čarodějů? Především se však ukazuje, že nejtěžší nemusí být porazit nepřítele, ale vyhrát nad sebou samým.Za román The Magician’s Apprentice (česky Tessia: Zrození čarodějky) získala Trudi Canavan v roce 2009 již podruhé cenu Aurealis a řadí se tak mezi nejúspěšnější autory fantasy literatury posledních deseti let. Její knihy se stávají bestsellery a oblíbili si je čtenáři takřka na celém světě – v Anglii, v Německu a Polsku stejně jako například v Indonésii. Mnoho fanoušků si získaly zejména její knihy o Sonee (Trilogie o černém mágovi, Trilogie Zrádkyň) a o Auraye (Věk pěti – trilogie).",
  "genres": [
    "Fantasy",
    "Magic",
    "Fiction",
    "Young Adult",
    "High Fantasy",
    "Epic Fantasy",
    "Adventure"
  ],
  "author": "Trudi Canavan",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/13015701-tessia"
}