{
  "title": "The Last Tortilla & Other Stories",
  "description": "\"She asked me if I liked them. And what could I say? They were wonderful.\" From the very beginning of Sergio Troncoso's celebrated story \"Angie Luna,\" we know we are in the hands of a gifted storyteller. Born of Mexican immigrants, raised in El Paso, and now living in New York City, Troncoso has a rare knack for celebrating life. Writing in a straightforward, light-handed style reminiscent of Grace Paley and Raymond Carver, he spins charming tales that reflect his experiences in two worlds. Troncoso's El Paso is a normal town where common people who happen to be Mexican eat, sleep, fall in love, and undergo epiphanies just like everyone else. His tales are coming-of-age stories from the Mexican-American border, stories of the working class, stories of those coping with the trials of growing old in a rapidly changing society. He also explores New York with vignettes of life in the big city, capturing its loneliness and danger. Beginning with Troncoso's widely acclaimed story \"Angie Luna,\" the tale of a feverish love affair in which a young man rediscovers his Mexican heritage and learns how much love can hurt, these stories delve into the many dimensions of the human condition. We watch boys playing a game that begins innocently but takes a dangerous turn. We see an old Anglo woman befriending her Mexican gardener because both are lonely. We witness a man terrorized in his New York apartment, taking solace in memories of lost love. Two new stories will be welcomed by Troncoso's readers. \"My Life in the City\" relates a transplanted Texan's yearning for companionship in New York, while \"The Last Tortilla\" returns to the Southwest to explore family strains after a mother's death--and the secret behind that death. Each reflects an insight about the human heart that has already established the author's work in literary circles. Troncoso sets aside the polemics about social discomfort sometimes found in contemporary Chicano writing and focuses instead on the moral and intellectual lives of his characters. The twelve stories gathered here form a richly textured tapestry that adds to our understanding of what it is to be human.",
  "genres": [
    "Short Stories"
  ],
  "author": "Sergio Troncoso",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/705188.The_Last_Tortilla_Other_Stories"
}