{
  "title": "Dark Liaison",
  "description": "Librarian's note: This is an alternate cover edition for ASIN B005V257FKIn DARK LIAISON, A Christian Suspense Novel, Book One in the COIL Series by D.I. Telbat, we jump into an intense scene where things are not as they seem for Memphis as he is unknowingly tested. And then we meet protagonist Corban Dowler.It is an age of prophetic strife when spiritual darkness collides with servants of the Cross. Christians worldwide are persecuted on a heightened level, and while no safety seems to exist, one man steps forward to lend a hand to the defenseless laborers.Corban Dowler is an old-school spy. Six years ago, he accepted Christ's gift of salvation and then resigned from the morally compromising C.I.A. As Corban desires to fulfill God's Great Commission, he builds an organization called the Commission of International Laborers, (COIL), where he devotes his skills and resources to assist persecuted or kidnapped Christian servants in the most dangerous environments worldwide.There are times in this age when Corban Dowler must hastily extract missionary families and Christian workers from danger zones before death steals them from their righteous work. For these operations, Corban has developed commando-style teams using non-lethal weapons to extract the threatened or persecuted servants of the Lord.These covert multiethnic teams are ex-military or ex-CIA, and all believers in Christ.Satan is every bit the adversary as he operates through his demonic workers of iniquity. They are set on claiming the lives of the righteous that stand for Truth. While COIL is working tirelessly to rescue Christians in need, Satan's followers are placing roadblocks, destroying, and kidnapping believers in Christ to thwart the efforts of COIL. The operatives find themselves prey to the very wickedness that they are committed to fight, and a battle between good and evil emerges. With new cover design by Streetlight Graphics, Dark Liaison is an 83,000-word Christian action-suspense novel of espionage and spiritual warfare. This Book One in the COIL Series contrasts the lives of satanic antagonists bent on hatred with the COIL laborers who protect the Christian men and women servants standing for righteousness. And we learn that...there is no redemption without sacrifice.",
  "genres": [
    "Christian Fiction",
    "Christian",
    "Suspense",
    "Fiction"
  ],
  "author": "D.I. Telbat",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/13015938-dark-liaison"
}