{
  "title": "Impossible Subjects: Illegal Aliens and the Making of Modern America",
  "description": "This book traces the origins of the illegal alien in American law and society, explaining why and how illegal migration became the central problem in U.S. immigration policy--a process that profoundly shaped ideas and practices about citizenship, race, and state authority in the 20th century.Mae Ngai offers a close reading of the legal regime of restriction that commenced in the 1920s--its statutory architecture, judicial genealogies, administrative enforcement, differential treatment of European and non-European migrants, and long-term effects. In well-drawn historical portraits, Ngai peoples her study with the Filipinos, Mexicans, Japanese, and Chinese who comprised, variously, illegal aliens, alien citizens, colonial subjects, and imported contract workers.She shows that immigration restriction, particularly national-origin and numerical quotas, re-mapped the nation both by creating new categories of racial difference and by emphasizing as never before the nation's contiguous land borders and their patrol. This yielded the illegal alien, a new legal and political subject whose inclusion in the nation was a social reality but a legal impossibility--a subject without rights and excluded from citizenship. Questions of fundamental legal status created new challenges for liberal democratic society and have directly informed the politics of multiculturalism and national belonging in our time.Ngai's analysis is based on extensive archival research, including previously unstudied records of the U.S. Border Patrol and Immigration and Naturalization Service. Contributing to American history, legal history, and ethnic studies, Impossible Subjects is a major reconsideration of U.S. immigration in the 20th century.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "Race",
    "Grad School",
    "School"
  ],
  "author": "Mae M. Ngai",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/70553.Impossible_Subjects"
}