{
  "title": "Detik-Detik Yang Menentukan: Jalan Panjang Indonesia Menuju Demokrasi",
  "description": "Sejarah tidak layak untuk dilupakan begitu saja. Pak Habibie menganggap, peristiwa Reformasi adalah catatan terpenting kehidupan bangsa Indonesia, termasuk detik-detik pergantian kekuasaan 21 Mei 1998.Mengingat bahwa buku ini ditulis berdasarkan catatan harian beliau dan komentar berbagai surat kabar nasional pada masa itu maka buku ini seolah-olah merupakan rekaman ulang sebuah realitas politik yang amat mencekam saat itu. Meskipun demikian sisi-sisi kelembutan, di tengah-tengah ketegasan sikapnya, seorang anak bangsa yang bernama B.J. Habibie sangat jelas tergambarkan pula di dalam buku ini. (Hermawan K. Dipojono)Tokoh yang dengan reformasi berubah dari wakil presiden menjadi presiden dan kemudian meninggalkan kursi kepresidenannya dengan bibir yang tersenyum dan kepala yang tegak. Semua berlaku dengan konstitusional, damai, tanpa setetes darahpun yang tertumpahkan, dan kemudian membuka pintu lebar-lebar untuk para pemimpin penerusnya agar dapat mengisi momentum-momentum yang hadir dengan lebih sukses. (Hidayat Nur Wahid)Banyak hal yang sangat menarik dari buku B.J. Habibie \"Detik-Detik yang Menentukan\", banyak juga yang menarik dari kepribadian penulisnya, setelah membaca buku itu. Namun demikian tidak meleset jika disimpulkan bahwa: \"Buku dan penulisnya menyatu dalam kata \"Demokrasi\". Itulah uraian buku ini dan itu pula kunci kepribadian penulisnya yang taat beragama Islam itu. Dengan demikian terbukti bahwa tidak ada pertentangan sedikit pun antara penegakan demokrasi dan pelaksanaan ajaran Islam. (M. Quraish Shihab)As those move further into the past, the scale and scope of Habibie's achievement seems ever more astounding and surprising. How was it that an administrative technologist with weak political skills and almost no political support could change Indonesia so rapidly, decisively and fundamentally, and in ways that no one could have expected? (Robert.E. Elson)Kesalahfahaman seolah-olah Presiden Habibie menciptakan \"bom waktu disintegrasi\" melalui kebijakan desentralisasinya adalah sesuatu yang berangkat dari argumen yang keliru dan tidak berdasar. (Ryaas Rasyid)Whether one believes in the 'Great Man' or 'Great Idea' concept of leadership, Pak Habibie succeeded, within the shortest time possible, in mobilizing every resource that was available, to launch a 'new Indonesia'. (Bilveer Singh)",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "True Story",
    "Indonesian Literature"
  ],
  "author": "Bacharuddin Jusuf Habibie",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/1301768.Detik_Detik_Yang_Menentukan"
}