{
  "title": "Franz Liszt: The Virtuoso Years, 1811-1847",
  "description": "Franz Liszt--child prodigy, virtuoso pianist, co-founder with Chopin and Schumann of the Romantic movement in music--has been the subject of literally hundreds of biographies, but it is only in the last few decades that the importance of Liszt the composer, as opposed to Liszt the Romantic hero, has been recognized. This new perspective has created the need for a fresh, full-scale approach, biographical and critical, to the evaluation of the man and his music.For more than ten years Alan Walker, a leading authority on nineteenth-century music and the author of important studies of Chopin and Schumann, has traveled throughout Europe discovering unpublished material in museums and private collections, in the parish registries of tiny villages in Austria and Hungary, and in major archives in Weimar and Budapest, seeking out new information and corroborating or correcting the old. He has left virtually no source unexamined--from the hundreds of contemporary biographies (many of them more fiction than fact) to the scores of memoirs, reminisces, and diaries of his pupils and disciples (the list of his students from his Weimar masterclasses reads like a Burke's Peerage of pianists). Dr. Walker's efforts have culminated in a study that will stand as definitive for years to come. A feat of impeccable scholarship, it also displays a strong and compelling narrative impulse and a profound understanding of the complicated man Liszt was.In this, the first of three volumes, Dr. Walker examines in greater detail than has ever before been amassed Liszt's family background and his early years. We see \"Franzi,\" a deeply religious and mystical child, whose extraordinary musical gifts lead to studies with the great Carl Czerny in Vienna and propel him into overnight fame in Paris--his youthful opera, Don Sanche, performed when he is fourteen--and in a disorderly and impulsive way of life by the time he is sixteen....We see Liszt drifting into obscurity after a nervous breakdown at the age of seventeen, then hearing Paganini for the first time and being so fired by the violinist's amazing technique that he sets for himself a titanic program of work, his aim no less than to create an entirely new repertoire for the piano....We see him, after years if successful touring, returning triumphantly to Hungary, his homeland, and publishing in the same year his \"Transcendental\" and \"Paganini\" studies. the signposts of his astonishing technical breakthrough....Finally, we see Liszt at the height of his artistic powers, giving well over a thousand concerts across Europe and Russia during the years 1839-47: \"inventing\" the modern piano recital, playing entire programs from memory, performing the complete contemporary piano repertoire, breaking down the barriers that had traditionally separated performing artists from their \"social superiors,\" fostering the Romantic view of the artist as superior bring, because divinely gifted....until--his colossal career virtually impossible to sustain--he gives his last paid performance at the age of thirty-five.Alan Walker explores as well Liszt's relationships with Berlioz, Chopin, and Schumann; his long, tumultuous affair with Countess Marie d'Agoult (who abandoned husband, family and social standing in order to follow the twenty-one-year-old genius and who, later, in her thinly disguised roman à clef Nélida, depicted him as an artistically impotent painter, and herself as a callously abandoned noblewoman); and his close associations with Lamennais, Lamartaine, Victor Hugo, George Sand, and other leading figures of the Romantic era. Dr. Walker reveals the origin and development of the psychological and emotional influences that so strongly informed Liszt's art throughout his life; and he analyzes individual pieces of music and discusses, in considerable detail, Liszt's piano technique.Unparalleled in its completeness, its soundness of documentation, and in the quality of its writing, The Virtuoso Years is the first volume of what will unquestionably be the most important biography of Franz Liszt in English or any other language.",
  "genres": [
    "Music",
    "Biography",
    "History",
    "Nonfiction",
    "Classical Music",
    "Art",
    "Hungary"
  ],
  "author": "Alan Walker",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/705679.Franz_Liszt"
}