{
  "title": "Nico: The Life and Lies of an Icon",
  "description": "Nico was revered as 'the most beautiful creature who ever lived'. She was Andy Warhol's femme fatale and the High Priestess of Weird, yet few knew her real name or her wretched origins. When she called herself 'a Nazi anarchist junkie', they thought she was joking.Bob Dylan wrote a song about her, Jim Morrison a poem, Jean Baudrillard an essay, Andy Warhol a film, Ernest Hemingway a story - yet she fought against the idolatory of men to assert her independence as a composer of dissident songs.Nico's contribution as an artist (17 films and 7 LPs) was smothered by gossip of her alleged affairs with men and women, whether Jimmi Hendrix or Jeanne Moreau, Brian Jones of the Rolling Stones or Coco Chanel.She drifted through society like a phantom. Each era celebrated a different Nico - the top covergirl of the Fifties, the Siren of the Sixties (as The Times acclaimed her), the Moon Goddess of the Seventies, and the High Priestess of Punk when rock stars like Siouxsie Sioux and Pattie Smith acknowledged her pre-eminence. Ironically, they did so at the lowest point of her life. For behind the Garbo-esque veneer lived a lonely woman trying to stand autonomous in a fast-changing world, seeking to survive her heroin addiction and to cope with her tormented mother and her troubled son, his existence denied by his film-star father.In this pioneering biography, which Nico asked the author to write shortly before her outlandish death in 1988, Richard Witts uncovers the reasons for her subterfuge, and examines the facts surrounding her encounters with terrorist Andreas Baader, the Black Panthers, and the Society for Cutting Up Men. Exclusive contributions from artists such as Jackson Browne, Iggy Pop, Viva, John Cale, David Bowie, Siouxsie Sioux - and many others including her relatives, friends and enemies - make this the definitive biography of an icon who was not only a testament to an era but a hitherto unrecognised influence on popular music and style.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Rock N Roll"
  ],
  "author": "Richard Witts",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/7052555-nico"
}