{
  "title": "American Subversive",
  "description": "As the twenty-first century enters its second decade, foreign wars, the lingering recession and a caustic political environment are taking their toll on Americans. But the party hasn't ended for Aidan Cole and his friends, a band of savvy -- if cynical -- New York journalists and bloggers who thrive at the intersection of media and celebrity. At wine-sodden dinner parties or in dimly lit downtown bars, their frenetic talk -- of scoops and page views, sexual adventures and trendy restaurants -- continues unabated. Then, without warning, the specter of terrorism reenters their lives. A bomb rips through the deserted floor of a midtown office tower. Middle Eastern terrorists are immediately suspected. But four days later, with no arrests and a city on edge, an anonymous email arrives in Aidan's in-box. Attached is the photograph of an attractive young white woman, along with a chilling \"This is Paige Roderick. She's the one responsible.\" So begins an extraordinary journey into the dark soul of modern America -- from a back-to-the-land community in the Smoky Mountains to a Weather Underground-like bomb factory in Vermont; from Fishers Island, isolated getaway of the wealthy elite, to the hip lofts of Manhattan's Meatpacking District. American Subversive is David Goodwillie's sharp and penetrating take on the paranoia of our times -- and its real, untold dangers. In examining the connection between our collective apathy and the roots of insurrection, Goodwillie has crafted an intoxicating story of two young Americans grasping for a foothold in a culture -- and a country -- that's crumbling around them. Hailed as a \"clever, compelling, page-turner\" in the Washington Post , Goodwillie's memoir Seemed Like a Good Idea at the Time was a \"breakout first book\" ( Elle ) and a \"searing sketch of a decade in decline\" ( Louisville Courier-Journal ). Now, with his debut novel, David Goodwillie announces himself as a major new voice in American fiction. Expertly written, relentlessly suspenseful, and bitingly funny, American Subversive is both an unnervingly realistic tale of domestic terrorism and a perfectly observed portrait of Manhattan in the digital age.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Politics",
    "Terrorism",
    "Contemporary",
    "Book Club"
  ],
  "author": "David Goodwillie",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/7061732-american-subversive"
}