{
  "title": "Birdology: Adventures with a Pack of Hens, a Peck of Pigeons, Cantankerous Crows, Fierce Falcons, Hip Hop Parrots, Baby Hummingbirds, and One Murderously Big Living Dinosaur",
  "description": "Meet the a flock of smart, affectionate, highly individualistic chickens who visit their favorite neighbors, devise different ways to hide from foxes, and mob the author like she’s a rock star. In these pages you’ll also meet Maya and Zuni, two orphaned baby hummingbirds who hatched from eggs the size of navy beans, and who are little more than air bubbles fringed with feathers. Their lives hang precariously in the balance—but with human help, they may one day conquer the sky.Snowball is a cockatoo whose dance video went viral on YouTube and who’s now teaching schoolchildren how to dance. You’ll meet Harris’s hawks named Fire and Smoke. And you’ll come to know and love a host of other avian characters who will change your mind forever about who birds really are.Each of these birds shows a different and utterly surprising aspect of what makes a bird a bird—and these are the lessons of Birdology : that birds are far stranger, more wondrous, and at the same time more like us than we might have dared to imagine. In Birdology, beloved author of The Good Good Pig Sy Montgomery explores the essence of the otherworldly creatures we see every day. By way of her adventures with seven birds—wild, tame, exotic, and common—she weaves new scientific insights and narrative to reveal seven kernels of bird wisdom.The first lesson of Birdology is that, no matter how common they are, Birds Are Individuals, as each of Montgomery’s distinctive Ladies clearly shows. In the leech-infested rain forest of Queensland, you’ll come face to face with a cassowary—a 150-pound, man-tall, flightless bird with a helmet of bone on its head and a slashing razor-like toenail with which it (occasionally) eviscerates people—proof that Birds Are Dinosaurs. You’ll learn from hawks that Birds Are Fierce; from pigeons, how Birds Find Their Way Home; from parrots, what it means that Birds Can Talk; and from 50,000 crows who moved into a small city’s downtown, that Birds Are Everywhere. They are the winged aliens who surround us.Birdology explains just how very \"other\" birds Their hearts look like those of crocodiles. They are covered with modified scales, which are called feathers. Their bones are hollow. Their bodies are permeated with extensive air sacs. They have no hands. They give birth to eggs. Yet despite birds’ and humans’ disparate evolutionary paths, we share emotional and intellectual abilities that allow us to communicate and even form deep bonds. When we begin to comprehend who birds really are, we deepen our capacity to approach, understand, and love these otherworldly creatures. And this, ultimately, is the priceless lesson of Birdology : it communicates a heartfelt fascination and awe for birds and restores our connection to these complex, mysterious fellow creatures.",
  "genres": [
    "Nonfiction",
    "Birds",
    "Animals",
    "Nature",
    "Science",
    "Biology",
    "Memoir"
  ],
  "author": "Sy Montgomery",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/7059341-birdology"
}