{
  "title": "God in Two Minutes",
  "description": "[Author's Note: The book is available in 3 editions: Paperback Color Edition: ISBN 9789334208474, Paperback B&W Edition: ISBN 9789334196986 Ebook/Kindle Edition: ISBN 9788184659337To view all formats in Amazon, click on \"See all formats and editions\"]You have often wondered how technology has changed everything that we do. Everything? Well, almost but not everything. Some things have not changed at all. While the way we commute, communicate and compute has changed so much from the stone age to this day, one thing that has not changed over thousands of years is the way we pray or follow religion. The religious methods have not changed at all. While we have moved from the bullock cart to the jet age in our physical processes, religious methods are still what they were ages ago, or at best, a more distorted version of our old methods. Is it because they were the best methods and there was no scope of improvement? No. It is because you and I did not want to change. Whereas we are instinctively looking for better methods every where else, why is it that we are wedded to the same old methods in matters of religion? Not for centuries, but for thousands of years. It is because \nthe method of religion, while beneficial in most cases, has a major flaw\n which prevents any improvements.\nThe author has identified a special characteristic of religion which makes religion a double edged sword.\n It forms the most essential part of religion because without it, you cannot benefit from religion. At the same time it is responsible for the most deadly side effects of religion. \nThe greatest strength of religion is also its greatest flaw\n. This flaw stops us from even looking for improvements in the religious methods. Not only has this flaw prevented any further improvement in the methods, it has divided the world resulting in religious hatred, bloodshed and killing.When the world has benefited immensely from scientific developments in physical processes, why is it that our religious methods are going from bad to worse – they are making us more intolerant and further dividing the world?What is this ghastly flaw in religion? The book provides deep insight on this.A reader has beautifully summarized the book in his comments in facebook page of God in Two Minutes:\"Found the book captivating, and read it in one single reading session! Building upon examples from the physical sciences, Kamble deftly touches a “hot potato” – god and religion. Unlike other rationalists who reject these concepts, Kamble chronicles the evolution of religion, and while accepting its presence in today’s world and some benefits it may have to offer, he elaborates on its obsolescence and offers an alternate framework for society to seek an elevation in their emotional well-being.\"",
  "genres": [],
  "author": "Prem Kamble",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/13018149-god-in-two-minutes"
}