{
  "title": "Cumberland Island: Strong Women, Wild Horses",
  "description": "In September 1996, Cumberland Island blasted onto the national news scene when it was revealed that John Kennedy, Jr., and Carolyn Bessette were married on the island in the First African Baptist Church―a simple one-room frame structure with eight handmade pews. When the flotilla of writers and photographers arrived on the island a few days later only to find themselves itching, sweating, and swatting at pestiferous gnats and bloodthirsty mosquitoes, they wondered why such a worldly and sophisticated couple had chosen such a tick-infested spot. In  Cumberland Island , Charles Seabrook uses his talent as an award-winning environmental writer to describe the island’s natural bounty and to tell its long and intriguing history. You’ll meet Catherine “Caty” Greene Miller, the widow of Revolutionary War hero Nathanael Greene and the woman who inspired Eli Whitney to invent the cotton gin. There’s Miss Lucy Ferguson, considered by many to be the toughest and orneriest of all the strong women who inhabited the island, reigning over it during the 1960s and ’70s. The present-day generation is represented by Janet “GoGo” Ferguson, Miss Lucy’s granddaughter, who made the arrangements for the Kennedy and Bessette wedding and crafted their wedding rings as well. Today, the island serves as a lightning rod for controversy. Although the island is currently under the purview of the National Park Service, some descendants still reside on the island. The dispute over the sale of land by cash-strapped landowners to commercial developers creates as much heated debate as the discussion of how the Park Service should balance the management of a wilderness area with the privileges accorded the residents. Included in these two debates are the questions of whether the island’s signature wild-horse herd should be dispersed because of the environmental damage it wreaks and whether the historic mansions that still pepper the island be allowed to crumble to ruin for the sake of wilderness preservation. Charles Seabrook has been a long-time environmental writer for the  Atlanta Journal-Constitution . His popular weekly column called \"Wild Georgia\" was the victim of cutbacks. However, in 2008, the paper reinstituted the column due to reader demand. In 1981, Seabrook was one of the first reporters in the world to write about a mysterious and burgeoning disease that would soon be known as AIDS. In addition, he has written extensively on global warming, air and water pollution, and songbird decline. He has won awards from the National Wildlife Federation, the Southern Environmental Law Center, and various press organizations. His newspaper series about Georgia’s mining industry won the Investigative Reporters and Editors “Best Story of the Year” award in 1994. In 2001, the state of Georgia gave him the R. L. \"Rock\" Howard Award, its highest conservation award. He lives in Decatur, Georgia.",
  "genres": [
    "History",
    "Nonfiction",
    "Southern",
    "Book Club",
    "American History"
  ],
  "author": "Charles Seabrook",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/706936.Cumberland_Island"
}