{
  "title": "Secrets of the Gnomes",
  "description": "Rien Poortvliet and Wil Huygen, collaborating once again as they did so successfully in Abrams' best-selling GNOMES, now reveal to thousands of eager readers their recent encounters in the mysterious world of those tiny folk. SECRETS OF THE GNOMES is the fascinating account of a long, arduous journey undertaken by the authors at the request of the gnomes. It is overflowing with the authors' on-the-scene sketches and firsthand observations.Poortvliet and Huygen are not invited as mere observers, however, for after a meal of mushrooms and cream-tasting as if were made of \"everything that light, air, sun, moon, and earth could produce\"-they find that they have been turned into gnomes themselves! The authors take a penetrating look at their subjects: they learn of the tender emotional life of a gnome; they see and diagram the mechanics of the ingenious gnome technology; they observe how gnomes administer justice in the wild; they are told how fairy tales first began (Little Red Riding Hood was actually a gnome). And, best of all, they are allowed to see parts of the magical Secret Book.Endowed with gnome characteristics (which include exceptional vision and heightened senses of touch, smell taste, and hearing), complete with peaked gnome caps, Poortvliet and Huygen are led from Lapland across the Siberian wilderness by Nicholas, their gruff by kindly guide who teaches them the secrets of survival in the icy north. Because of the gnomes' rapport with living creatures, the three travel in a troika pulled by lemmings, they are borne on a fox's back and on the head of a moose-they are even carried by the abominable snowman!Lovers of gnomes will celebrate the arrival of this new volume and will delight in the opportunity to know these elusive creatures better. Scores of enchanting illustrations by Dutch artist Rien Poortvliet record the comings and goings of gnomes and the loving interaction with nature for which they are so famous.",
  "genres": [
    "Fantasy",
    "Art",
    "Fiction",
    "Childrens",
    "Folklore",
    "Picture Books",
    "Humor"
  ],
  "author": "Wil Huygen",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/707243.Secrets_of_the_Gnomes"
}