{
  "title": "Sperm Counts: Overcome by Man's Most Precious Fluid",
  "description": "2007 Choice Outstanding Academic TitleWinner of the Passing the Torch Award from the Center for Lesbian and Gay StudiesIt has been called sperm, semen, seed, cum, jizz, spunk, gentlemen's relish, and splooge. But however the \"tacky, opaque liquid that comes out of the penis\" is described, the very act of defining \"sperm\" and \"semen\" depends on your point of view. For Lisa Jean Moore, how sperm comes to be known is based on who defines it (a scientist vs. a defense witness, for example), under what social circumstances it is found (a doctor's office vs. a crime scene), and for what purposes it will be used (in vitro fertilization vs. DNA analysis). Examining semen historically, medically, and culturally, Sperm Counts is a penetrating exploration of its meaning and power.Using a \";follow that sperm\" approach, Moore shows how representations of sperm and semen are always in flux, tracing their twisting journeys from male reproductive glands to headline news stories and presidential impeachment trials. Much like the fluid of semen itself can leak onto fabrics and into bodies, its meanings seep into our consciousness over time. Moore's analytic lens yields intriguing observations of how sperm is \"spent\" and \"reabsorbed\" as it spurts, swims, and careens through penises, vaginas, test tubes, labs, families, cultures, and politics.Drawn from fifteen years of research, Sperm Counts examines historical and scientific documents, children's \"facts of life\" books, pornography, the Internet, forensic transcripts and sex worker narratives to explain how semen got so complicated. Among other things, understanding how we produce, represent, deploy and institutionalize semen-biomedically, socially and culturally-provides valuable new perspectives on the changing social position of men and the evolving meanings of masculinity. Ultimately, as Moore reveals, sperm is intimately involved in not only the physical reproduction of males and females, but in how we come to understand ourselves as men and women.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Sociology",
    "Sexuality",
    "Gender"
  ],
  "author": "Lisa Jean Moore",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/707360.Sperm_Counts"
}