{
  "title": "The Pack: Winter Kill",
  "description": "INCLUDES EXCERPT OF BOOK \"Lie with the Dead\"The idea for this werewolf noir series started with a murder.I walked out of a store on some crummy errand or another and I saw it plain as day. A young man falls down in the desert. A boot appears on the back of his neck, and the camera floats up a uniformed leg to a .45. Higher still and we see a grizzled sheriff staring down at the young man.Bang!A young woman runs past him, screaming. A deputy chases her. The sheriff raises his pistol.Bang!The camera follows the path of the bullet. It streaks past the deputy’s ear toward the woman. It slams into the back of her head. The screen goes dark, then the bullet and the camera reach daylight on the other side.I sat in the car for a few minutes to write it all down in my notebook. It had been so vivid I could see the characters’ features, the sheriff’s boots, badge and uniform, the girl’s red, flower-print sundress flowing in the breeze. I didn’t care where it came from, what I wanted to figure out was what to do with it.I sat down at the keyboard to write, and promptly realized I had no idea why the sheriff killed these kids. Was he an anti-hero or a villain? What did they do to deserve this? Even better, what happened next?I had just finished an abortive attempt at a crime novel, so I had crime on the brain. I thought maybe the kid was a drug dealer and the antihero cop took him down. Or maybe the kids saw something they shouldn’t have. I kicked around a few more possibilities, but none of them really grabbed me or answered the question, “what next?”So why not make it a supernatural thriller? Make the kid a monster of some kind, and now the sheriff has a reason to blow him away. Make him a werewolf, and now the sheriff has silver bullets. That’s when the “what next?” clicked into the rest of his pack comes looking for him. That turned into his brother, and from there the first comic book miniseries, \" Call of the Wild,\" came to be. It would eventually be published by Moonstone Books.When Nina (then only known as “Mom”) made a cameo in the first issue, I had a pretty good idea of the family’s backstory. Each of the family members had their own story to tell, and they fit together in a nice arc.About that time, A.N. Ommus, Editorial Director at Evileye Books, started flirting with me. I initially discussed a different book with him, but as he shared his formula for world domination, it became clear that book just wasn’t big enough. Evileye wanted a series, and I wanted in on his plans, so I pitched him \"The Pack.\"Which brings us to this book. \"Winter Kill\" is a new beginning for the Tyler family, the first book in a series. So what’s the story? Here’s the official “For generations, the northern Minnesota mountain region has been a haven for peaceful hikes and breath-taking scenery. But when tourists suddenly turn up dead, FBI special agents Angela Wallace and Brian Shilling are called in to investigate, only to discover that the murders are part of a deadlier, supernatural mystery. In the series fiction debut, \"Winter Kill,\" Bram Stoker Award winning author, Mike Oliveri gives us the first salvo in a crime, supernatural thriller that reimagines the werewolf mythos in a way you'll never see coming.”Each book will feature a stand-alone story, but the events of each volume will be inter-connected.",
  "genres": [
    "Horror",
    "Paranormal",
    "Werewolves",
    "Mystery",
    "Fiction",
    "Fantasy",
    "Thriller"
  ],
  "author": "Mike Oliveri",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/7083228-the-pack"
}