{
  "title": "Destroy All Movies!!! The Complete Guide to Punks on Film",
  "description": "The most dazzlingly insane film reference book of all time, Destroy All Movies!!! is an informative, hilarious and impossibly complete guide to every appearance of a punk (or new waver!) to hit the screen in the 20th Century. This wildly comprehensive release contains A-to-Z coverage of over 1100 feature films from around the world, as well as dozens of exclusive interviews with the cast/creators of crucial titles like Repo Man, Return of the Living Dead, The Decline of Western Civilization and Valley Girl . Also examined are several hundred prime examples of straight-to-VHS slasher trash, Brooklyn skid row masterpieces, Filipino breakdancing fairytales, no-budget apocalyptic epics and movies that shouldn't even have been released, many of which have never been written about. Plus hundreds of eyeball-smashing stills and posters, many in full color!Interviewees include screen veteran punk musicians Richard Hell, Ian MacKaye of Minor Threat, Lee Ving of Fear, Exene Cervenka and John Doe of X, Keith Morris of Black Flag and Circle Jerks, Chris D. of The Flesh Eaters, Youth Brigade's Shawn Stern, Sickie Wifebeater of The Mentors, Ivan Kral of the Patti Smith Group and many others. Also featured are conversations with filmmakers Penelope Spheeris (the Decline of Western Civilization documentaries, Suburbia ), Mark Lester ( Class of 1984 ), Martha Coolidge ( Valley Girl ), Alex Cox ( Repo Man ), Lech Kowalski ( D.O.A. ), Allan Arkush ( Rock 'n' Roll High School ), Amos Poe ( The Blank Generation ), Susan Seidelman ( Smithereens ), Slava Tsukerman ( Liquid Sky ), Alan Sacks ( Du-beat-e-o ), Eric Mitchell ( Underground USA ), Brian Trenchard-Smith ( Dead End Drive-In ), Dave Markey ( Desperate Teenage Lovedolls ), Bruce LaBruce, and NYC transgressor Nick Zedd. Performers like Mary Woronov, Eddie Deezen, Clint Howard, Jon Gries, P.J. Soles and Dick Rude speak out, plus countless other actors and creators from the frontlines of punk's big-screen explosion.Destroy All Movies!!! nails down decades of insanity with superhuman research, vicious precision and electrically charged stills and images, and is the first and final definitive armchair roadmap to punk and new wave on celluloid. Five years in the making, this pulse-bursting monument to lowbrow cultural obsession is a must for all film fanatics, music maniacs, anti-fashion mutants, '80s nostalgists, sleazoids, cop-killers and spazzmatics!",
  "genres": [
    "Film"
  ],
  "author": "Zack Carlson",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/7079862-destroy-all-movies-the-complete-guide-to-punks-on-film"
}