{
  "title": "Sylvia",
  "description": "\"It began with a woman's name: Sylvia. I loved the name, I loved the song, 'Who is Sylvia and what is she?' And the other sweet song 'Sylvia's hair is like the night.' Dark hair, raven black, a tall woman and beautiful. I could envision her as I might a living person.\" So writes Howard Fast in his introduction to Sylvia, first published thirty-two years ago under the pseudonym of E. V. Cunningham. Fast, one of America's finest storytellers, had written the book at a time when he was hounded by J. Edgar Hoover and the FBI for his then radical views and was eventually blacklisted by same of America's most prestigious publishers. But Fast could not stop writing. He told his agent, Paul R. Reynolds, \"I have a book in my mind and it's seething there and driving me crazy.\" \"Write it,\" Reynolds replied. \"And the blacklist?\" Fast inquired. \"We'll worry about that when we have the manuscript,\" Reynolds said. Fast then sat down to write Sylvia, the story of a woman born into unspeakable poverty who, against all odds, saves her soul from destruction and emerges, defiantly, as a woman of stature, talent, and great beauty. The novel would also be a tale of suspense, mystery, and action - the search of a down-on-his-luck private investigator hired by a millionaire to find out who his bride-to-be - Sylvia - actually is. When Fast completed the book and gave it to Reynolds, the agent told him that publishers were still intimidated by the blacklist, and as a result, at Reynolds's suggestion, Fast took the pseudonym E. V. Cunningham. Now, for the first time, Sylvia is being published under Howard Fast's own name. Howard Fast, a bestselling author, has published more than eighty books, including Citizen Tom Paine, Freedom Road, Spartacus, The Immigrants, ten plays, and twenty books of non-fiction. Once labeled prolific, he detests the term and insists, \"I'm not prolific. I'm just here a long time.\" In France, where the blacklist has no meaning, Sylvia was published under Fast's n",
  "genres": [
    "Mystery",
    "Fiction"
  ],
  "author": "E.V. Cunningham",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/708375.Sylvia"
}