{
  "title": "The Great South Carolina Ku Klux Klan Trials, 1871–1872",
  "description": "It is remarkable that the most serious intervention by the federal government to protect the rights of its new African American citizens during Reconstruction (and well beyond) has not, until now, received systematic scholarly study.In The Great South Carolina Ku Klux Klan Trials , Lou Falkner Williams presents a comprehensive account of the events following the Klan uprising in the South Carolina piedmont in the Reconstruction era. It is a gripping story―one that helps us better understand the limits of constitutional change in post-Civil War America and the failure of Reconstruction.The South Carolina Klan trials represent the culmination of the federal government's most substantial effort during Reconstruction to stop white violence and provide personal security for African Americans. Federal interventions, suspension of habeas corpus in nine counties, widespread undercover investigations, and highly publicized trials resulting in the conviction of several Klansmen are all detailed in Williams's study.When the trials began, the Supreme Court had yet to interpret the Fourteenth Amendment and the Enforcement Acts. Thus the fourth federal circuit court became a forum for constitutional experimentation as the prosecution and defense squared off to present their opposing views. The fate of the individual Klansmen was almost incidental to the larger constitutional issues in these celebrated trials. It was the federal judge's devotion to state-centered federalism―not a lack of concern for the Klan's victims―that kept them from embracing constitutional doctrine that would have fundamentally altered the nature of the Union.Placing the Klan trials in the context of postemancipation race relations, Williams shows that the Klan's campaign of terror in the upcountry reflected white determination to preserve prewar racial and social standards. Her analysis of Klan violence against women breaks new ground, revealing that white women were attacked to preserve traditional southern sexual mores, while crimes against black women were designed primarily to demonstrate white male supremacy.Well-written, cogently argued, and clearly presented, this comprehensive account of the Klan uprising in the South Carolina piedmont in the late 1860s and early 1870s makes a significant contribution to the history of Reconstruction and race relations in the United States.",
  "genres": [
    "History",
    "Nonfiction",
    "American History"
  ],
  "author": "Lou Falkner Williams",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/70871.The_Great_South_Carolina_Ku_Klux_Klan_Trials_1871_1872"
}