{
  "title": "Operation Familia",
  "description": "How does a modern, educated latina, disconnected from her traditional Mexican-American family, discover her true identity and \"orgullo\" (cultural pride)? Dina Salazar likes to think she has it together. Dodging the bullet of early marriage and motherhood that every other female in her family has succumbed to, she's her own woman. Or is she? Is she free ...or just lost? Adventurous, athletic Dina has a satisfying career and her freedom from emotional entanglements. She has it all. All except the love of her life, Rick Ramos-THE HATED ONE-who ended up marrying another woman nearly six years before. All except the closeness of her blue-collar family, who live in a Latino barrio of Salinas, ninety miles south of Silicon Valley. All except the feeling of belonging to her cultural heritage. She speaks Spanish but who is she really? An American disguised as an Hispanic woman? Or an Hispanic disguised as an American? Is she a mixed mutt with an American mind and a latino heart? In her attempts at educating herself and climbing the socio-economic ladder, has Dolores Salazar lost her latino heart and soul? When Dina learns that her stern, disapproving Mexican-born grandmother has a shameful secret, a son Abuelita Gómez had to abandon in Mexico sixty years before, Dina is reluctant at first to get involved. The uncle she has never known (a drug lord) has died mysteriously-killed, her grandmother believes, by a rival in the Juarez drug cartel. In time the family learns that the rival and suspect is the late drug lord's son-in-law, and Abuelita's grand-daughter, Dina's Mexican cousin, Teresa, has no choice but to flee her ruthless husband. To Dina's dismay, her grandmother urges HER to find out where her grand-daughter and great grandson are seeking refuge in Mexico. Her grandmother tells her that Dina is the only one that can rescue Teresa and her son, for Dina is the smart and brave one of the family-and the only one who speaks Spanish. What's a girl to do when la familia calls? * * * \"A delightful, endearing story! You can't help but root for Dina in her journey of self-discovery.\" --Brenda Novak, Nationally Best-selling Author \"Dina is a character that many Latinos can identify with-a woman trying to weave her own place between cultures. Around Dina, Donna Del Oro has done her own a heady plot .of crime, romance, family conflict and intrigue.\" --Carlos Alcala, Sacramento Bee Columnist",
  "genres": [],
  "author": "Donna Del Oro",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/7090172-operation-familia"
}