{
  "title": "How Did You Get This Number: Essays",
  "description": "A brand-new book of hilarious and insightful personal essays by the iconic, irresistible Sloane Crosley.  From the author of the sensational bestseller I Was Told There'd Be Cake comes a new book of personal essays brimming with all the charm and wit that have earned Sloane Crosley widespread acclaim, award nominations, and an ever-growing cadre of loyal fans. In Cake readers were introduced to the foibles of Crosley's life in New York City-always teetering between the glamour of Manhattan parties, the indignity of entry-level work, and the special joy of suburban nostalgia-and to a literary voice that mixed Dorothy Parker with David Sedaris and became something all its own.Crosley still lives and works in New York City, but she's no longer the newcomer for whom a trip beyond the Upper West Side is a big adventure. She can pack up her sensibility and take us with her to Paris, to Portugal (having picked it by spinning a globe and putting down her finger, and finally falling in with a group of Portuguese clowns), and even to Alaska, where the \"bear bells\" on her fellow bridesmaids' ponytails seemed silly until a grizzly cub dramatically intrudes. Meanwhile, back in New York, where new apartments beckon and taxi rides go awry, her sense of the city has become more layered, her relationships with friends and family more complicated.As always, Crosley's voice is fueled by the perfect witticism, buoyant optimism, flair for drama, and easy charm in the face of minor suffering or potential drudgery. But in How Did You Get This Number it has also become increasingly sophisticated, quicker and sharper to the point, more complex and lasting in the emotions it explores. And yet, Crosley remains the unfailingly hilarious young Every woman, healthily equipped with intelligence and poise to fend off any potential mundanity in maturity.Show me the doll --Lost in space --Take a stab at it --It's always home you'll miss --Light pollution --If you sprinkle --An abbreviated catalog of tongues --Le Paris! --Off the back of a truck",
  "genres": [
    "Humor",
    "Nonfiction",
    "Essays",
    "Memoir",
    "Short Stories",
    "Audiobook",
    "Biography"
  ],
  "author": "Sloane Crosley",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/7091863-how-did-you-get-this-number"
}