{
  "title": "The Return of the Dead: Ghosts, Ancestors, and the Transparent Veil of the Pagan Mind",
  "description": "How the ghost stories of pagan times reveal the seamless union existing between the world of the living and the afterlife• Demonstrates how Medieval Christianity transformed the more corporeal ghost encountered in pagan cultures with the disembodied form known today• Explains how the returning dead were once viewed as either troublemakers or guarantors of the social orderThe impermeable border the modern world sees existing between the world of the living and the afterlife was not visible to our ancestors. The dead could--and did--cross back and forth at will. The pagan mind had no fear of death, but some of the dead were definitely to be dreaded: those who failed to go peacefully into the afterlife but remained on this side in order to right a wrong that had befallen them personally or to ensure that the law promoted by the ancestors was being respected. But these dead individuals were a far cry from the amorphous ectoplasm that is featured in modern ghost stories. These earlier visitors from beyond the grave--known as revenants--slept, ate, and fought like men, even when, like Klaufi of the Svarfdaela Saga , they carried their heads in their arms.Revenants were part of the ancestor worship prevalent in the pagan world and still practiced in indigenous cultures such as the Fang and Kota of equatorial Africa, among others. The Church, eager to supplant this familial faith with its own, engineered the transformation of the corporeal revenant into the disembodied ghost of modern times, which could then be easily discounted as a figment of the imagination or the work of the devil. The sanctified grounds of the church cemetery replaced the burial mounds on the family farm, where the ancestors remained as an integral part of the living community. This exile to the formal graveyard, ironically enough, has contributed to the great loss of the sacred that characterizes the modern world.",
  "genres": [
    "Folklore",
    "History",
    "Witchcraft",
    "Occult",
    "Nonfiction",
    "Paganism",
    "Death"
  ],
  "author": "Claude Lecouteux",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/7089241-the-return-of-the-dead"
}