{
  "title": "Somme Mud: The war experiences of an Australian infantryman in France, 1916–1919",
  "description": "It's the end of the 1916 winter and the conditions are almost unbelievable. We live in a world of Somme mud. We sleep in it, work in it, fight in it, wade in it and many of us die in it. We see it, feel it, eat it and curse it, but we can't escape it, not even by dying.' Somme Mud tells of the devastating experiences of Edward Lynch, a young Australian private (18 when he enlisted) during the First World War when he served with the 45th battalion of the Australian Infantry Forces on the Western Front at the Somme, which saw the most bloody and costly fighting of the war. In just eight weeks, there were 23,000 Australian casualties. The original edition of twenty chapters, was written in pencil in twenty school exercise books in 1921, probably to help exorcise the horrendous experiences Private Lynch had witnessed during his three years at war from mid-1916 until his repatriation home in mid-1919. Lynch had been wounded three times, once seriously and spent over six months in hospital in England. Published here for the first time, and to the great excitement of historians at the War Memorial Somme Mud is a precious find, a discovered treasure that vividly captures the magnitude of war through the day-to-day experiences of an ordinary infantryman. From his first day setting sail for France as the band played 'Boys of the Dardanelles' and the crowd proudly waved their fresh-faced boys off, to the harsh reality of the trenches of France and its pale-faced weary men, Lynch captures the essence and contradictions of war. Somme Mud is Australia's version of All Quiet on the Western Front. Told with dignity, candour and surprising wit, it is a testament to the power of the human spirit, a moving true story of humanity and friendship. It will cause a sensation when it is published.",
  "genres": [
    "History",
    "Nonfiction",
    "World War I",
    "War",
    "Military History",
    "Memoir",
    "Biography"
  ],
  "author": "E.P.F. Lynch",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/7093256-somme-mud"
}