{
  "title": "Adrian Mole The Prostrate Years",
  "description": "ADRIAN MOLE is thirty-nine and a quarter. Unable to afford the mortgage on his riverside apartment, pay his credit-card bills or keep up with the payments on his store-cards, he has been forced to move to a dismal part of the Leicestershire countryside, just outside the village of Mangold Parva, and live in a semi-detached converted pigsty next door to his parents, George and Pauline. He ekes out a living in a second-hand bookshop, owned by the patrician Mr Carlton-Hayes, a man he wishes he could call 'father'. His sophisticated and ravishing wife Daisy loathes the countryside, longs for Dean Street and has yet to buy a pair of wellingtons; they are both aware the passion has gone out of their marriage, but neither knows how to reignite the flame. To cap it all, Adrian is leaving his bed five times a night to go to the lavatory and has other alarming symptoms, which lead him to suspect prostate trouble. Meanwhile, his mother Pauline is writing a fictitious misery memoir about her childhood - A Girl Called Shit - and thinks that an appearance on The Jeremy Kyle Show might solve the mystery of her daughter's paternity once and for all. Is Mr Lucas, the Moles' ex-next-door neighbour, Rosie's dad? And when George is asked to provide a paternity sample, will the shock kill him? He is already disabled, though he is still chain-smoking and has had an ashtray welded on to the arm of his wheelchair. As Adrian's worries multiply, a slightly drunken phone call to his old flame Dr Pandora Braithwaite, BA, MA, Ph.D., MP and Junior Minister in the Foreign Office (where her fluent Mandarin comes in useful), ignites memories of shared passion and makes him wonder, is she the only one who can save him now?",
  "genres": [
    "Fiction",
    "Humor",
    "Comedy",
    "Young Adult",
    "Contemporary",
    "British Literature",
    "Novels"
  ],
  "author": "Sue Townsend",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/7093487-adrian-mole-the-prostrate-years"
}