{
  "title": "The Changing Environment of Northern Michigan: A Century of Science and Nature at the University of Michigan Biological Station",
  "description": "Northern Michigan is undergoing unprecedented changes in land use, climate, resource extraction, and species distributions. For the last hundred years, the University of Michigan Biological Station has monitored these environmental transformations. Stretching 10,000 acres along Burt and Douglas Lakes in the northern Lower Peninsula and 3,200 acres on Sugar Island near Sault Ste. Marie, Michigan, the station has played host to nearly 10,000 students and a steady stream of top scientists in the fields of biology, ecology, geology, archeology, and climatology. The Changing Environment of Northern Michigan collects essays by some of these scientists, who lead readers on virtual field trips exploring the history of people and science at the station itself, the relations of indigenous people to the land, the geophysical history of the region, characteristics of terrestrial and aquatic ecosystems, key groups of organisms and their relations to local habitats, and perspectives on critical environmental challenges of today and their effects on the region. Accompanying the chapters are color illustrations and photographs that bring the station's pristine setting to life. Like the station itself, the book provides a solid background for better appreciating the relationships among living and nonliving parts of northern Michigan, for anyone interested in exploring the region's forests, fields, and wetlands; wading or paddling down its rivers; or swimming or floating across its lakes. Knute J. Nadelhoffer is Director of the University of Michigan Biological Station and Professor of Ecology and Evolutionary Biology at the University of Michigan. Alan J. Hogg, Jr., teaches science writing at the University of Michigan as a faculty member of the Sweetland Writing Center. His Ph.D. research explored the effects of ozone and nitrogen oxides on University of Michigan Biological Station forests. Brian A. Hazlett is Professor Emeritus of Zoology at the University of Michigan.",
  "genres": [
    "Science"
  ],
  "author": "Alan J. Hogg",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/7094923-the-changing-environment-of-northern-michigan"
}