{
  "title": "San'ya Blues: Laboring Life in Contemporary Tokyo",
  "description": "Over the years, Edward Fowler, an American academic, became a familiar presence in San'ya, a run-down neighborhood in northeastern Tokyo. The city's largest day-labor market, notorious for its population of casual laborers, drunks, gamblers, and vagrants, has been home for more than half a century to anywhere from five to fifteen thousand men who cluster in the mornings at a crossroads called Namidabashi (Bridge of Tears) in hopes of getting work. The day-labor market, along with gambling and prostitution, is run by Japan's organized crime syndicates, the yakuza. Working as a day laborer himself, Fowler kept a diary of his experiences. He also talked with day laborers and local merchants, union leaders and bureaucrats, gangsters and missionaries. The resulting oral histories, juxtaposed with Fowler's narrative and diary entries, bring to life a community on the margins of contemporary Japan. Located near a former outcaste neighborhood, on what was once a public execution ground, San'ya shows a hidden face of Japan and contradicts the common assumption of economic and social homogeneity. Fowler argues that differences in ethnicity and class, normally suppressed in mainstream Japanese society, are conspicuous in San'ya and similar communities. San'ya's largely middle-aged, male day-laborer population contains many individuals displaced by Japan's economic success, including migrants from village communities, castoffs from restructuring industries, and foreign workers from Korea and China. The neighborhood and its inhabitants serve as an economic buffer zone―they are the last to feel the effects of a boom and the first to feel a recession. They come alive in this book, telling urgent stories that personify such abstractions as the costs of modernization and the meaning of physical labor in postindustrial society.",
  "genres": [
    "Japan",
    "Nonfiction",
    "Asia",
    "Anthropology"
  ],
  "author": "Edward  Fowler",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/71020.San_ya_Blues"
}