{
  "title": "Still Standing: The Untold Story of My Fight Against Gossip, Hate, and Political Attacks",
  "description": "There’s nothing the liberal media love to attack more than a conservative celebrity. Unless it’s a female conservative celebrity. Make that a beautiful female conservative celebrity.So, when a California beauty queen had the audacity – the nerve – to stand up for traditional marriage in front of a national televised audience, well then, the liberal media went crazy. They called her every vile name in the book – while feminists around the country were oddly silent. Like Sarah Palin, Laura Bush, Ann Coulter and so many before her, Carrie Prejean was vilified for not being the modern American woman that NOW had in mind.But through it all, Carrie Prejean, former Miss California, maintained her composure, courage, faith—and stood her ground. Not many 22-year-old women find themselves thrust into the national spotlight. Fewer still are willing to stand up for what they believe, even when it costs them a national title and subjects them to vicious personal attacks.In her new book, Still Standing, Carrie gives readers the inside story, and the clear message that conservative women are here to stay. From the pageant’s political and manipulative tactics, to Carrie’s fight against unfair attacks from Hollywood and the media, and her never-before-published conversations with Donald Trump and Sarah Palin, Carrie reveals the story the media didn’t report but America wants to hear. Carrie has a message for Hollywood and the mainstream media – but she also has a message for young women everywhere. Still Standing exposes the media’s hypocritical practice of “free speech for me but not for thee” and shatters the myth that a woman can’t be influential and Conservative.Carrie Prejean has already been a media sensation. Still Standing proves that she’s more than just a pretty face – she’s a strong woman of admirable religious, political, and moral substance, and she’s one of the leaders in a new movement championing conservative women everywhere.",
  "genres": [
    "Memoir",
    "Politics"
  ],
  "author": "Carrie Prejean",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/7100278-still-standing"
}