{
  "title": "Lovesong",
  "description": "Seeking shelter in a Parisian cafe from a sudden rainstorm, John Patterner meets the exotic Sabiha and his carefully mapped life changes forever. Resonant of the bestselling Conditions of Faith, Alex Miller's keenly awaited new novel tells the deeply moving story of their lives together, and of how each came undone by desire.Strangers did not, as a rule, find their way to Chez Dom, a small, rundown Tunisian cafe on Paris' distant fringes. Run by the widow Houria and her young niece, Sabiha, the cafe offers a home away from home for the North African immigrant workers working at the great abattoirs of Vaugiraud, who, like them, had grown used to the smell of blood in the air. But when one day a lost Australian tourist, John Patterner, seeks shelter in the cafe from a sudden Parisian rainstorm, the quiet simplicities of their lives are changed forever. John is like no-one Sabiha has met before - his calm grey eyes promise her a future she was not yet even aware she wanted. Theirs becomes a contented but unlikely marriage - a marriage of two cultures lived in a third - and yet because they are essentially foreigners to each other, their love story sets in train an irrevocable course of tragic events.Years later, living a small, quiet life in suburban Melbourne, what happened at Vaugiraud seems like a distant, troubling dream to Sabiha and John, who confides the story behind their seemingly ordinary lives to Ken, an ageing, melancholy writer. It is a story about home and family, human frailties and passions, raising questions of morals and purpose - questions have no simple answer.Lovesong is a simple enough story in many ways - the story of a marriage, of people coming undone by desire, of ordinary lives and death, love and struggle - but when told with Miller's distinctive voice, which is all intelligence, clarity and compassion, it has a real gravitas, it resonates and is deeply moving. Into the wonderfully evoked contemporary settings of Paris and Melbourne, memories of Tunisian family life, culture and its music are tenderly woven.",
  "genres": [
    "Fiction",
    "Australia",
    "Romance",
    "Book Club",
    "France",
    "Historical Fiction",
    "Contemporary"
  ],
  "author": "Alex  Miller",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/7100633-lovesong"
}