{
  "title": "I Am a Red Dress: Incantations on a Grandmother, a Mother, and a Daughter",
  "description": "In I Am A Red Dress acclaimed writer and performer Anna Camilleri confronts the ghosts of her past as she seeks to find her rightful place in the world. Part memoir, part storytelling, Anna writes with passion and conviction about family and identity, and how the wounds of personal history can be healed through the imagination. Like a flashing red light, these eloquent stories and narratives speak to the heart of three generations of women — Anna, her mother, and her grandmother — as they deal with a cycle of family abuse; in them, the red dress appears as a symbol of defiance and empowerment. Throughout the book, Anna unravels memory that is inextricably tied to culture, class, and tradition, in a strong and beautiful voice that bravely asserts its right to be heard.Combining the political with the intensely personal, Camilleri’s intimate writings are premised on a search for selfhood—strong, queer, female—within and outside of her bonds to other women in her family. She says, “My work is motivated by a deep desire to understand, and in the words of Dorothy Allison, to ‘remake the world.’”Despite the perception that we live in a progressive society, Camilleri is not convinced that we live in a world that is necessarily better for women, indigenous people and people of color, queer people, or the poor and the working class. But she recognizes that the imagination is a powerful force that can lead to better lives, and a better world.Her voice is the sound the status quo makes as it crashes to the ground.Anna Camilleri is a Toronto-based writer and performance poet. She was co-editor of Brazen Femme, shortlisted for a Lambda Award, and co-founded Taste This, with whom she collaborated to publish Boys Like Her, winner of a ForeWord Magazine Literary Award.",
  "genres": [
    "Queer",
    "LGBT",
    "Poetry",
    "Fiction",
    "Feminism",
    "Canada"
  ],
  "author": "Anna Camilleri",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/710260.I_Am_a_Red_Dress"
}