{
  "title": "Poseidon's Gold",
  "description": "A.D. 72: To many, Rome is the center of the Empire. To Marcus Didius Falco, Imperial spy and casual informer, it is the home of his mother, the domineering matriarch who has kept the Didius clan together since her husband absconded with a redhead some twenty years before. Trouble is the last thing Falco wants on his return from a six-month mission to the German legions. But trouble is in store: his apartment has been wrecked by squatters and an ex-legionnaire friend of his colorfully heroic brother, Festus, has parked himself in the only other possible refuge, his mother's kitchen. What's worse, the man is demanding money allegedly owed him and his legion from one of Festus's wild schemes. Worse still, the only client Falco can get is his mother, who wants him to clear the family name. But little does he realize that trouble is only just beginning: the legionnaire is found viciously stabbed to death, with Falco the prime suspect. His friend Petronius is investigating the case, and while the intrepid Falco treads the dingy streets of Rome, his girlfriend, Helena Justina, is arrested as an accomplice, leaving her aristocratic family even more certain that this plebeian will not make a suitable husband. Even if her family were to agree to the marriage, Falco still needs an impossible 400,000 sesterces to buy himself into the middle rank. And to clear the family name, he has to find Geminus, the father who left all those years before, for he is the only one who knows what Festus was really up to. Compelled to face the past he deplores and a future he despairs of, Falco has just three days to prove he is not a murderer, to trace the real suspect, amass evidence, and win a fortune...",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Crime",
    "Historical Mystery",
    "Roman"
  ],
  "author": "Lindsey Davis",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/71084.Poseidon_s_Gold"
}