{
  "title": "بيروت مدينة العالم - الجزء الأول",
  "description": "\"كانت الشمس تغيب. وأنفاس الخريف عطرة في الهواء. سال الشعاع البرتقالي في أزقة البلد وعطى بقشرة رقيقة كالشمع الأبواب والحيطان والنوافذ والوجوه. انعكس النور على زجاج في العمارات عند الميناء فبدت العمارات كأنها تشتعل بالنار. عبد الجواد أحمد البارودي ترك البازركان ونزل إلى \"محطة الشام\" وجلس يدخن أرجيلة مع ابنه ويتأمل توهج الغروب في الأفق. كان قلبه يثقل بمرور كل لحظة. وفكر في رحلة قديمة. لم يفكر تدفقت الذكريات في رأسه وجسمه. ذراعه كلّها ارتعشت ونربيش الأرجيلة كاد أن يسقط من بين أصابعه. عادت إليه ذكرى نهارٍ شتوي بعيدٍ وخيّل غليه أنه ما زال يركض تحت ذلك المطر. كان مطراً رمادياً، لم يلبث أن صار أسود، وكان ينهمر بلا توقف. سال العالم. سالت السماء وسالت الأرض وسال جسم عبد الجواد أحمد البارودي. عادت إليه الذكريات فرأى نفسه يسيل راكضاً من الشام، من الدكان الصغير حيث سال دم أخيه على الأرض.. كان يركض ولون الخوخ في عينيه. انتشرت بقعة الدم على وجه الشمس. انطفأ نور الكون وحلّ الظلام. ذراعه كلها ارتجفت وخيل إليه أن السكينة تسقط من بين أصابعه الآن فقط. كأن هذا العمر كله لم يعبر... التفت وعاد يحدق إلى الأفق... وسمعت ذلك الصوت من جديد: قعق، قعق، قعق. لكن هذه المرة لم يرفع رأسه. عبد الجواد نظر إلى الغروب القاتم ولم يرفع رأسه إلى السماء: كان تائهاً في ظلمات تتمدد وفي أعماقه. كأنه يسقط في بئر بلا قعر..\".ربيع جابر يجتاز خياله حدود الزمان وحدود المكان منطلقاً إلى ذلك الزمن البعيد الذي سبق نشوب الحرب العالمية الأولى وقدوم جمال باشا إلى بيروت، انطلق إلى حارة البارودي، ليروي قصتها وقصة الرجل صاحب الذراع الواحد الذي بنى البيت الصغير الأول لهذه العائلة، في المكان الذي عرف لاحقاً بحارة البارودي ففي ذلك الشتاء البعيد جاء الجد الأكبر لعائلة البارودي إلى بيروت بين 1820 و1822، جاء عبد الجواد أحمد البارودي صاحب الذراع الواحدة، جاء إليها هارباً من الشام. يسحب ربيع جابر القارئ إلى عالم الأسلاف إلى آثارهم، إلى مبانيهم التي رمت عليها الحداثة ثوباً جديداً، كما يسحب ربيع جابر نفسه يسحب أيضاً القارئ معه إلى ذلك كله في محاولة لإيقاظ الزمن النائم في الحجارة لإخضاعه لعملية مساءلة عما كان في ذلك الزمن. وهل ما جرى ما هو إلى مقدمات لما هو آت. ومع شخصية عبد الجواد أحمد البارودي المرسومة بدقة ينتقل الكاتب وبخفة إلى ذلك الزمن البعيد إلى ما قبل الحرب العالمية الأولى، مسترسلاً من خلالها في التأريخ لبيروت تلك الفترة. ومندمجاً مع شخصيته إلى حدّ التماهي. مقنعاً القارئ بأنه كان أحد شهود أحداث تلك الرواية بكل خيالاتها. وربما ببعض واقعها.",
  "genres": [
    "Novels",
    "Literature"
  ],
  "author": "ربيع جابر Rabee Jaber",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/7106520--"
}