{
  "title": "Samba Dreamers",
  "description": "Rosea spoke, her voice steady. “I was in jail a long time, you know. I’m paying for my sins. Now I live in a dingy apartment. I get to watch my neighbors’ kids play and have a normal life that I’ll never have. I smell their barbecues. I’m already in hell, believe me.” Joe turned to go back to the car. “You don’t know what hell is. You have no idea.” When José Francisco Verguerio Silva arrives at LAX, fleeing the brutal dictatorship in his native Brazil, he is determined to become Americanized at all costs. He lands a job driving a Hollywood tour bus and posing as Ricky Ricardo. He marries a blonde waitress and becomes the father of twins. Yet happiness remains elusive for Joe as he is haunted by flashbacks of prison torture. And soon a torrid affair with Rosea Socorro Katz, the crazed daughter of Hollywood’s Brazilian star Carmen Socorro, proves to be even more dangerous than the life he has fled. Rosea spent her childhood watching her mother unravel as the celebrity system toyed with and eventually destroyed her career. Carmen had always claimed to be descended from Amazons, the woman warriors of legend, but she was tamed by Hollywood. Not Rosea. She has just finished serving jail time for setting fire to the home of her ex-husband—in an attempt to destroy his collection of Brazilian artifacts—and sets out to salvage her life. Along the way, she manages to tear down the lives of everyone she meets. The Brazil of the imagination is shattered in this novel of two tortured souls wrestling with the myths of movies, politics, and the American Dream. Laced with fantastic tales of bird-boys and cannibal rituals, it spins a compelling story of desperation as it reminds us that American freedom and the myth of unbridled opportunity can also consume and destroy.",
  "genres": [
    "Fiction",
    "Novels",
    "Literary Fiction",
    "American",
    "Literature"
  ],
  "author": "Kathleen De Azevedo",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/711173.Samba_Dreamers"
}