{
  "title": "The Lacuna",
  "description": "'You had better write all this in your notebook, she said, the story of what happened to us in Mexico. So when nothing is left of us but bones, someone will know where we went.' Bo rn in the US, reared in a series of provisional households in Mexico, Harrison Shepherd is mostly a liability to his social-climbing mother, Salome. From a coastal island jungle to the unpaved neighbourhoods of 1930s Mexico City, his fortunes never steady as Salome finds her rich men-friends always on the losing side of the Mexican Revolution. He aims for invisibility, observing his world and recording everything with a peculiar selfless irony in his notebooks. Life is whatever he learns from servants putting him to work in the kitchen, errands he runs in the streets, and one fateful day, by mixing plaster for famed Mexican muralist Diego Rivera. Making himself useful in the household of the muralist, his wife Frida Kahlo, and exiled Bolshevik leader Lev Trotsky, young Shepherd inadvertently casts his lot in with art and revolution. A violent upheaval sends him north to a nation newly caught up in the internationalist goodwill of World War II. In Carolina, he remakes himself in America's hopeful image. Under the watch of his peerless stenographer, Violet Brown, he finds an extraordinary use for his talents of observation. But political winds continue to push him between north and south, in a plot that turns many times on the unspeakable breach - the lacuna - between truth and public presumption. The Lacuna is a gripping story of identity, connection with our past, and the power of words to create or devastate. Crossing two decades, from the vibrant revolutionary murals of Mexico City to the halls of a Congress bent on eradicating the colour red, The Lacuna is as deep and rich as the New World itself.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Historical",
    "Literary Fiction",
    "Novels",
    "Art"
  ],
  "author": "Barbara Kingsolver",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/7110648-the-lacuna"
}