{
  "title": "The Killing Edge",
  "description": "Chloe Marin was lucky. She was just a teenager when a party at a Florida beachside mansion turned into a savage killing spree, and she was one of the few to survive. Bloody handwriting on the walls pointed to a cult whose rituals included human sacrifice. Chloe's sketch of one of the killers linked two dead cult members found in the Everglades to the massacre, closing the case as far as the cops were concerned.Ten years later Chloe works as a psychologist specializing in art therapy to help traumatized victims, and on the side she finds release in her passion for the martial arts. Police who hire her as a consultant know she's a literal kick-ass advocate for victims who can't always speak for themselves.The current disappearance of a young swimsuit model ranks low on the cops' priority list. Everyone assumes the girl has run off for some fun in the sun, instead of getting ready for a photo shoot. Everyone but Chloe, who suspects a killer is using the modeling agency to stalk his prey. When the ghost of the model appears, asking Chloe for help, she knows that she has to do everything she can.So does Luke Cane, a British ex-cop-turned-P.I. investigating the disappearance of the model on behalf of her father. Chloe and Luke have trouble trusting each other, but they can't help their strong attraction for one another. Luckily they agree on the important things: someone needs to find those missing girls, and if a few laws have to get bent so lives can be saved, too bad.When Chloe arrives late for an appointment at the modeling agency, she discovers a gruesome mass murder eerily similar to the one she witnessed a decade ago—and can't help thinking that if she hadn't run late, she would have been there when the killer arrived. Ten years ago she hadn't been convinced the police had identified the real killers, and now she's sure of it. The same evil mind is behind the current murders, and she's afraid she's the target— and terrified that she won't be able to cheat death a third time. She has no choice now but to trust Luke on every level, because with a killer closing in, he's the only one who's willing to do whatever it takes to keep her alive.",
  "genres": [
    "Mystery",
    "Romance",
    "Paranormal",
    "Romantic Suspense",
    "Thriller",
    "Suspense",
    "Fiction"
  ],
  "author": "Heather    Graham",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/7113444-the-killing-edge"
}