{
  "title": "Dog Man: An Uncommon Life on a Faraway Mountain",
  "description": "As Dog Man opens, Martha Sherrill brings us to a world that Americans know very little about—the snow country of Japan during World War II. In a mountain village, we meet Morie Sawataishi, a fierce individualist who has chosen to break the law by keeping an Akita dog hidden in a shed on his property. During the war, the magnificent and intensely loyal Japanese hunting dogs are donated to help the war effort, eaten, or used to make fur vests for the military. By the time of the Japanese surrender in 1945, there are only sixteen Akitas left in the country. The survival of the breed becomes Morie's passion and life, almost a spiritual calling. Devoted to the dogs, Morie is forever changed. His life becomes radically unconventional—almost preposterous—in ultra-ambitious, conformist Japan. For the dogs, Morie passes up promotions, bigger houses, and prestigious engineering jobs in Tokyo. Instead, he raises a family with his young wife, Kitako—a sheltered urban sophisticate—in Japan's remote and forbidding snow country. Their village is isolated, but interesting characters are always dropping by—dog buddies, in-laws from Tokyo, and a barefoot hunter who lives in the wild. Due in part to Morie's perseverance and passion, the Akita breed strengthens and becomes wildly popular, sometimes selling for millions of yen. Yet Morie won't sell his spectacular dogs. He only likes to give them away. Morie and Kitako remain in the snow country today, living in the traditional Japanese cottage they designed together more than thirty years ago—with tatami mats, an overhanging roof, a deep bathtub, and no central heat. At ninety-four years old, Morie still raises and trains the Akita dogs that have come to symbolize his life. In beautiful prose that is a joy to read, Sherrill opens up the world of the Dog Man and his wife, providing a profound look at what it is to be an individualist in a culture that reveres conformity—and what it means to live life in one's own way—while expertly revealing Japan and Japanese culture as we've never seen it before.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Dogs",
    "Biography",
    "Japan",
    "History",
    "Historical"
  ],
  "author": "Martha Sherrill",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/7112939-dog-man"
}