{
  "title": "The Jewish Enemy: Nazi Propaganda During World War II and the Holocaust",
  "description": "The sheer magnitude of the Holocaust has commanded our attention for the past sixty years. The extent of atrocities, however, has overshadowed the calculus Nazis used to justify their deeds. According to German wartime media, it was German citizens who were targeted for extinction by a vast international conspiracy. Leading the assault was an insidious, belligerent Jewish clique, so crafty and powerful that it managed to manipulate the actions of Roosevelt, Churchill, and Stalin. Hitler portrayed the Holocaust as a defensive act, a necessary move to destroy the Jews before they destroyed Germany.Joseph Goebbels, Minister of Propaganda, and Otto Dietrich’s Press Office translated this fanatical vision into a coherent cautionary narrative, which the Nazi propaganda machine disseminated into the recesses of everyday life. Calling on impressive archival research, Jeffrey Herf recreates the wall posters that Germans saw while waiting for the streetcar, the radio speeches they heard at home or on the street, the headlines that blared from newsstands. The Jewish Enemy is the first extensive study of how anti-Semitism pervaded and shaped Nazi propaganda during World War II and the Holocaust, and how it pulled together the diverse elements of a delusionary Nazi worldview. Here we find an original and haunting exposition of the ways in which Hitler legitimized war and genocide to his own people, as necessary to destroy an allegedly omnipotent Jewish foe. In an era when both anti-Semitism and conspiracy theories continue to influence world politics, Herf offers a timely reminder of their dangers along with a fresh interpretation of the paranoia underlying the ideology of the Third Reich.",
  "genres": [
    "History",
    "Holocaust",
    "Politics",
    "Nonfiction",
    "World War II",
    "War",
    "Germany"
  ],
  "author": "Jeffrey Herf",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/711593.The_Jewish_Enemy"
}