{
  "title": "Say Little, Do Much: Nursing, Nuns, and Hospitals in the Nineteenth Century",
  "description": "Say Little, Do Much Nursing, Nuns, and Hospitals in the Nineteenth Century Sioban Nelson \"A convincing picture.\"--\"New York Times\" \"A convincing picture.\"--\"New York Times\" \"The most significant contribution to the literature on nursing history in decades.\"--\"Journal of Community Nursing\" \"Required reading for all nurse historians who seek to understand the difficult and complex role of religious women who served nursing prior to our modern era.\"--\"Nursing History Review\" \"Well-researched, scholarly, clearly written, and nicely analyzed, this work makes a significant addition to the historiography of nursing.\"--\"Choice\" In the nineteenth century, more than a third of American hospitals were established and run by women with religious vocations. In \"Say Little, Do Much,\" Sioban Nelson casts light on the work of these women's religious communities. According to Nelson, the popular view that nursing invented itself in the second half of the nineteenth century is historically inaccurate and dismissive of the major advances in the care of the sick as a serious and skilled activity, an activity that originated in seventeenth-century France with Vincent de Paul's Daughters of Charity. In this comparative, contextual, and critical work, Nelson demonstrates how modern nursing developed from the complex interplay of the Catholic emancipation in Britain and Ireland, the resurgence of the Irish Church, the Irish diaspora, and the mass migrations of the German, Italian, and Polish Catholic communities to the previously Protestant strongholds of North America and mainland Britain. In particular, Nelson follows the nursing Daughters of Charity through the French Revolution and the Second Empire, documenting the relationship that developed between the French nursing orders and the Irish Catholic Church during this period. This relationship, she argues, was to have major significance for the development of nursing in the English-speaking world. Sioban Nelson is Senior Lecturer in the School of Postgraduate Nursing at The University of Melbourne. Studies in Health, Illness, and Caregiving 2001 240 pages 6 x 9 8 illus. ISBN 978-0-8122-3614-9 Cloth $59.95s 39.00 ISBN 978-0-8122-1783-4 Paper $24.95s 16.50 ISBN 978-0-8122-0290-8 Ebook $24.95s 16.50 World Rights History, Medicine Short copy: Nearly half a century before Florence Nightingale became a legendary figure for her pioneering work in the nursing trade, nursing nuns made significant but little-known accomplishments in the field.",
  "genres": [],
  "author": "Sioban Nelson",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/7118927-say-little-do-much"
}