{
  "title": "The Signifying Monkey: A Theory of African-American Literary Criticism",
  "description": "Henry Louis Gates, Jr.'s original, groundbreaking study explores the relationship between the African and African-American vernacular traditions and black literature, elaborating a new critical approach located within this tradition that allows the black voice to speak for itself.Examining the ancient poetry and myths found in African, Latin American, and Caribbean culture, and particularly the Yoruba trickster figure of Esu-Elegbara and the Signifying Monkey whose myths help articulate the black tradition's theory of its literature, Gates uncovers a unique system forinterpretation and a powerful vernacular tradition that black slaves brought with them to the New World. His critical approach relies heavily on the Signifying Monkey--perhaps the most popular figure in African-American folklore--and signification and Signifyin(g).Exploring signification in black American life and literature by analyzing the transmission and revision of various signifying figures, Gates provides an extended analysis of what he calls the \"Talking Book,\" a central trope in early slave narratives that virtually defines the tradition ofblack American letters. Gates uses this critical framework to examine several major works of African-American literature--including Zora Neale Hurston's Their Eyes Were Watching God , Ralph Ellison's Invisible Man , and Ishmael Reed's Mumbo Jumbo --revealing how these works signify on the blacktradition and on each other.The second volume in an enterprising trilogy on African-American literature, The Signifying Monkey --which expands the arguments of Figures in Black --makes an important contribution to literary theory, African-American literature, folklore, and literary history.",
  "genres": [
    "Nonfiction",
    "Literary Criticism",
    "African American",
    "Theory",
    "Criticism",
    "History",
    "American"
  ],
  "author": "Henry Louis Gates Jr.",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/711651.The_Signifying_Monkey"
}