{
  "title": "المنقذ من الضلال",
  "description": "النيل والفرات:ألف الغزالي المنقذ من الضلال بعد عودته من عزلته التي قضاها متنقلا بين الشام والقدس ومكة. إذن فهو يقع في المرحلة الثانية من حياة الغزالي، مرحلة النضج وتوضيح الخيارات النهائية. وفي المنقذ من الضلال يذكر أن سنه قد نافت على الخمسين مما يحدد وضعه الكتاب أواخر عام 499هـ وبدايات عام 500هـ في نيسابور،حين عاد إلى التدريس في نظاميتها لتبيان حقيقة النبوة. أما دافع الغزالي إلى تأليف كتابه هذا وهدفه منه، وكما يبدو من مقدمته، أنه رسالة إلى أخ في الدين، يطلب فيها هذا الأخير من الغزالي أن يبث إليه \"غاية العلوم وأسرارها, وغائلة المذاهب وأغوارها، وأحكي لك ما قاسيته في استخلاص الحقائق بين اضطراب الفرق\". وإذا كان ذلك هو الدافع الحقيقي، أو أن هناك دوافع أخرى، فإن الملاحظ أن الغزالي أراد من خلال منقذه أن يبين لنا مسار حياته الفكرية والروحية، وكيفية خروجه من الشك وصولا إلى خياراته النهائية في الحصول على نور اليقين، والتصديق النهائي. إن دواعي التصديق لم يجدها الغزالي لا في علم الكلام ولا في الفلسفة ولا في مذهب التعليمية. بل عند الصوفية فهل يكون الهدف من كتاب المنقذ تبيان صحة مذهب الصوفية. وما هي الاعتبارات التي حدته إلى اعتماد هذا الخيار؟ هل هي اعتبارات فكرية، روحية، أم سياسية. الإجابة عن هذه التساؤلات توجب قراءة واعية لهذا الكتاب، ومهما يكن من أمر وكيفما جاءت الإجابات فان المرء لا يستطيع أن ينكر بأن غرض الغزالي الأساسي هو إنقاذ الناس من الضلال والإفصاح عن الأحوال، ولا يكون ذلك إلا بنشر حقيقة النبوة، وما بان من خلال هذه الحقيقة. وتجدر الإشارة ‘إلى أن مخطوط هذا الكتاب يعود نسخه إلى عامين فقط بعد وفاة الغزالي أي عام 507 هجرية وهي أقدم نسخ عثر عليها حتى الآن، وبالتالي فإنها ستكون أكثر دقة من غيرها وأقل ابتعاداً عن المصدر الأساسي، وما يمكن أن يكون قد دخل عليها من تحريفات مقصودة أو إسقاطات غير مقصودة. وقد تميزت هذه الطبقة بعمل المحقق الذي شمل تعريفاً بعصر الغزالي وحياته ووصف للمخطوط وتحليل لمضمون كتاب \"المنقذ من الضلال\" مع شرح له وتعليق عليه.",
  "genres": [
    "Philosophy",
    "Islam",
    "Nonfiction",
    "Theology",
    "Spirituality",
    "Biography",
    "Mysticism"
  ],
  "author": "Abu Hamid al-Ghazali",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/7124192"
}