{
  "title": "The Idle Parent: Why Laid-Back Parents Raise Happier and Healthier Kids",
  "description": "This wise and funny book presents a revolutionary yet highly practical approach to childcare: leave them alone.\" The Idle Parent came as a huge relief to the whole family. Suddenly, it was okay to leave the kids to sort it out among themselves. Suddenly, it was okay to be responsibly lazy. This is the most counterintuitive but most helpful and consoling child-raising manual I've yet read.\"--Alain de Botton, author of The Pleasures and Sorrows of Work and The Consolations of Philosophy\"The most easy-to-follow-without-being-made-to-feel-inadequate parenting manifesto ever written . . . A godsend to parents.\"-- The Sunday Times\"Add liberal doses of music, jovial company and deep woods to play in--all central to the idle, not to say Taoist, life--and you have a recipe for bright, happy people with need of neither television nor shrink. Who could ask for more?\"-- The Evening StandardIn The Idle Parent , the author of The Freedom Manifesto and How to Be Idle applies his trademark left-of-center theories of idleness to what can be one of the thorniest aspects of adult life: parenting.Many parents today spend a whole lot of time worrying and wondering--frantically \"helicoptering\" over their children with the hope that they might somehow keep (or make?) them flawless. But where is this approach to childcare getting us? According to Hodgkinson, in our quest to give our kids everything, we fail to give them the two things they need most: the space and time to grow up self-reliant, confident, happy, and free. In this smart and hilarious book, Hodgkinson urges parents to stop worrying and instead start nurturing the natural instincts toward creativity and independence that are found in every child. And the great irony: in doing so, we will find ourselves becoming happier and better parents.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Philosophy",
    "Self Help",
    "Childrens",
    "Education",
    "Humor"
  ],
  "author": "Tom Hodgkinson",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/7124706-the-idle-parent"
}