{
  "title": "Best in Show",
  "description": "Murder's on the ticket when intrepid Poodle breeder Melanie Travis travels to Maryland for a world famous dog show where the competition isn't the only thing that's cutthroat...There are dog shows, and then there's PCA: the Poodle Club of America National Specialty show. For Poodle purists, it's the pinnacle of the show season, drawing thousands of competitors and spectators from all over the world. And though she has her own Standard Poodle puppy to show, Melanie gets leashed into helping out on the raffle committee by her formidable aunt. Selling tickets and sprucing Eve up for competition won't leave Melanie much time to spend with her almost-fiance, Sam on their first trip together without their usual chaperone, Melanie's seven year old son, Davey.Once in Maryland, Melanie is put to work selling raffle tickets by the co-chairs of the committee, Betty Jean and Edith Jean Boone. Sixtyish steel magnolias from Georgia, the reclusive sisters make few appearances. But this year they have a silver Toy puppy that has already caused quite a buzz on the show circuit.Even though the Poodles remain well behaved, it's their owners and handlers who start acting up. And then murder takes center stage. Betty Jean is found dead at the host hotel. But this is PCA--and the show must go on. As Edith Jean staunchly resumes her raffle duites, Melanie instinctively starts searching for clues, and comes up with a compelling cast of suspects: a rival owner whose bite may be just as bad as his bark, a handler with a nasty reputation, and a possibly fraudulent pet psychic.With all the attention rivted on the ring, someone out in the crowd is about to get away with murder. Melanie is getting ever closer to the killer and soon she's shocked to discover that in the dog-eat-dog world of showing a life can be lost as easily as a blue ribbon. And unlike cats, dogs--and their owners--only have one to risk...",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Dogs",
    "Animals",
    "Audiobook"
  ],
  "author": "Laurien Berenson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/712307.Best_in_Show"
}