{
  "title": "Grease Monkey",
  "description": "Caught in the crossfire of an interstellar war, our Earth was bombed to flinders--and then repaired. The mysterious alien Benefactors who healed the planet also offered \"uplift\" to our dolphins and gorillas. The dolphins turned them down. The gorillas said yes. As a result, we're now sharing our world with language-using, tool-making simians. Tensions are inevitable, in both directions, but it's gradually working out.Decades later, teenage cadet Robin Plotnik has been assigned to Fist of Earth, a defense station high above Earth, keeping watch against further attacks by the interstellar Horde. Robin's a spacecraft mechanic-in-training, apprenticed to Chief \"Mac\" Gimbensky, a cranky but basically benign gorilla with issues of his own.Fist of Earth is a challenging place to grow up. Robin and Mac maintain fighter craft for the all-woman \"Barbarian Squadron\", which constantly competes for prestige with the other squadrons based on Fist of Earth. Robin's trying to romance a young librarian, and he's far from sure he knows what he's doing. Most of all, he's constantly struggling to figure out his moody, mercurial boss.Then he and his best friend become entangled in a burgeoning scandal over betting on the squadrons' standings. And just when things look like they've hit rock bottom, the worst thing imaginable arrives at Fist of an efficiency expert from Earth, determined to reorganize Robin's hard-won life, and the whole squadron system, out of existence.Fresh and engaging, crammed with likeable characters and science-fictional inventiveness, Grease Monkey is like a classic \"Heinlein juvenile\" in sequential-art mode.Introduction by Kurt Busiek, author of Astro City",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Science Fiction",
    "Young Adult",
    "Fiction",
    "Speculative Fiction",
    "Fantasy"
  ],
  "author": "Tim Eldred",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/712113.Grease_Monkey"
}