{
  "title": "Get Capone: The Secret Plot That Captured America's Most Wanted Gangster",
  "description": "Drawing on thousands of pages of recently discovered government documents, wiretap transcripts, and Al Capone’s handwritten personal letters, New York Times bestselling author Jonathan Eig tells the dramatic story of the rise and fall of the nation’s most notorious criminal in rich new detail.From the moment he arrived in Chicago in 1920, Capone found himself in a world of limitless opportunity. He was an impetuous, affable young man of average intelligence, ill prepared for fame and fortune, whose most notable characteristic was his scarred left cheek. Yet within a few years, Capone controlled an illegal bootlegging business with annual revenue rivaling that of some of the nation’s largest corporations. Along the way he corrupted the Chicago police force and local courts while becoming one of the world’s first international celebrities.A furious President Herbert Hoover insisted that Capone be brought to justice because the criminal was making a mockery of federal law. Legend credits Eliot Ness and his “Untouchables” with apprehending Capone. But it was the U.S. attorney in Chicago and little-known agents working on direct orders from the White House who compromised their ethics—and risked their lives—to get their man.The most infamous crime attributed to Capone was the St. Valentine’s Day Massacre, a crime that Capone insisted he didn’t commit. Using newly discovered FBI records, Eig offers a surprising explanation for the murders.Get Capone explores every aspect of the man called “Scarface,” paying particular attention to the myths that have for so long surrounded and obscured him. Capone emerges as a worldly, emotionally complex man, doomed as much by his ego as by his vicious criminality. This is the real Al Capone.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Biography",
    "Crime",
    "Biography Memoir",
    "American History"
  ],
  "author": "Jonathan Eig",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/7123692-get-capone"
}