{
  "title": "Seeing Further: Ideas, Endeavours, Discoveries and Disputes — The Story of Science Through 350 Years of the Royal Society",
  "description": "Edited and introduced by Bill Bryson, and with contributions from Richard Dawkins, Margaret Atwood, David Attenborough, Martin Rees and Richard Fortey amongst others, this is a remarkable volume celebrating the 350th anniversary of the Royal Society.On a damp weeknight in November, 350 years ago, a dozen or so men gathered at Gresham College in London. A twenty-eight year old — and not widely famous — Christopher Wren was giving a lecture on astronomy. As his audience listened to him speak, they decided that it would be a good idea to create a Society to promote the accumulation of useful knowledge.With that, the Royal Society was born. Since its birth, the Royal Society has pioneered scientific exploration and discovery. Isaac Newton, Charles Darwin, Albert Einstein, Robert Hooke, Robert Boyle, Joseph Banks, Humphry Davy, Isambard Kingdom Brunel, John Locke, Alexander Fleming — all were fellows.Bill Bryson’s favourite fellow was Reverend Thomas Bayes, a brilliant mathematician who devised Bayes’ theorem. Its complexity meant that it had little practical use in Bayes’ own lifetime, but today his theorem is used for weather forecasting, astrophysics and stock market analysis. A milestone in mathematical history, it only exists because the Royal Society decided to preserve it — just in case. The Royal Society continues to do today what it set out to do all those years ago. Its members have split the atom, discovered the double helix, the electron, the computer and the World Wide Web. Truly international in its outlook, it has created modern science.Seeing Further celebrates its momentous history and achievements, bringing together the very best of science writing. Filled with illustrations of treasures from the Society’s archives, this is a unique, ground-breaking and beautiful volume, and a suitable reflection of the immense achievements of science.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Essays",
    "History Of Science",
    "Popular Science",
    "Science Nature"
  ],
  "author": "Bill Bryson",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/7125991-seeing-further"
}