{
  "title": "Masters of the Air: America's Bomber Boys Who Fought the Air War Against Nazi Germany",
  "description": "Masters of the Air is the deeply personal story of the American bomber boys in World War II who brought the war to Hitler's doorstep. With the narrative power of fiction, Donald Miller takes readers on a harrowing ride through the fire-filled skies over Berlin, Hanover, and Dresden and describes the terrible cost of bombing for the German people.Fighting at 25,000 feet in thin, freezing air that no warriors had ever encountered before, bomber crews battled new kinds of assaults on body and mind. Air combat was deadly but intermittent: periods of inactivity and anxiety were followed by short bursts of fire and fear. Unlike infantrymen, bomber boys slept on clean sheets, drank beer in local pubs, and danced to the swing music of Glenn Miller's Air Force band, which toured U.S. air bases in England. But they had a much greater chance of dying than ground soldiers. In 1943, an American bomber crewman stood only a one-in-five chance of surviving his tour of duty, twenty-five missions. The Eighth Air Force lost more men in the war than the U.S. Marine Corps.The bomber crews were an elite group of warriors who were a microcosm of America -- white America, anyway. (African-Americans could not serve in the Eighth Air Force except in a support capacity.) The actor Jimmy Stewart was a bomber boy, and so was the \"King of Hollywood,\" Clark Gable. And the air war was filmed by Oscar-winning director William Wyler and covered by reporters like Andy Rooney and Walter Cronkite, all of whom flew combat missions with the men. The Anglo-American bombing campaign against Nazi Germany was the longest military campaign of World War II, a war within a war. Until Allied soldiers crossed into Germany in the final months of the war, it was the only battle fought inside the German homeland.Strategic bombing did not win the war, but the war could not have been won without it. American airpower destroyed the rail facilities and oil refineries that supplied the German war machine. The bombing campaign was a shared enterprise: the British flew under the cover of night while American bombers attacked by day, a technique that British commanders thought was suicidal.Masters of the Air is a story, as well, of life in wartime England and in the German prison camps, where tens of thousands of airmen spent part of the war. It ends with a vivid description of the grisly hunger marches captured airmen were forced to make near the end of the war through the country their bombs destroyed.Drawn from recent interviews, oral histories, and American, British, German, and other archives, Masters of the Air is an authoritative, deeply moving account of the world's first and only bomber war.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Military Fiction",
    "Military History",
    "Aviation"
  ],
  "author": "Donald L. Miller",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/71318.Masters_of_the_Air"
}