{
  "title": "The Cure",
  "description": "An action-packed, unabashed medical thriller that openly examines the disturbing elements of the breast cancer drug machine that remain largely hidden behind \"pink-ribbon\" promises made by profit-consumed conspirators that sell dangerous drugs with no concern for the women who die in pain.Dr. Bernard Clouseau, the world's leading breast cancer research investigator, was murdered during an awards dinner in his honor. Dr. Carol Anderson, head of The Office of Communications & Public Liaison for the National Institutes of Health, is asked to reprise her former role as a clinical trial examiner. Carol reluctantly agrees to conduct a routine investigation to verify the late scientists' trial results, which have been questioned by the New England Journal of Medicine.Dr. Thomas Christian, a clinical trial fraud investigator for the Office of Research Integrity, requested to take the case. Thomas spent his residency under Dr. Clouseau's tutelage, but gave up the opportunity to join his team to conduct trial fraud investigations as payment for his wealthy family's history. Thomas is certain that the trial results are valid, and is committed, right or wrong, to preserving his former mentor's legacy.Carol and Thomas have a history, but have not spoken since she broke off an intense and emotional relationship they shared during medical school. They soon learn that Dr. Clouseau was diverting funds from his research to fund unauthorized tests that may have led to a cure for breast cancer. As they search for the formula, Carol and Thomas discover a world of corporate espionage and institutional corruption they never knew existed.The ruthless CEO of a major pharmaceutical company wants the formula for himself, and is willing to eliminate anyone who stands between him and the discovery of the century. His closest colleagues have no idea what his next move will be. Sell the cure for a one-time fortune, or bury the formula and preserve the perpetually lucrative drug treatment regime?Fast-paced and hard to put down, The Cure, based on a bizarre National Cancer Institute clinical trial fraud case, is a thought-provoking primer on the truth behind breast cancer drug research. It's not about saving women.",
  "genres": [
    "Thriller"
  ],
  "author": "Antoine Maurice Devine",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/7131669-the-cure"
}