{
  "title": "Digger, Volume Four",
  "description": "In this fourth volume of Digger, covering chapters seven and eight of Ursula Vernon's webcomic, our wombat Heroine finds herself under the scrutiny of the universally feared matriarch of the Cerulean Hills hyena tribe, Boneclaw Mother. Should she survive, there is only the small matter of a ceremonial feast for the late hyena hunter Skull Ridges, which Digger unwittingly helped avenge — much to the consternation of all. (It's complicated...) A hyena long feast is no place for a vegetarian wanting to avoid offense and a one-way-trip to the dessert course.And there is still the matter of getting home without getting any deeper into the matter of nearly-dead Gods, insane acolytes, talking statues, or amoral shadow critters with a penchant for existential crises. When Surka (the ex-pirate captain shrew turned professional bridge troll) and Ed (the outcast hynena artist and master of the warrior-tea ceremony) are among the saner beings in your social circle, you KNOW things are just not turning out like you hoped.Despite her humble protests, Digger continues to get rave reviews from the critics. Publishers Weekly says that Digger \"...has inspired comparisons to Bone and Finder.\" Eric Lindberg of Broken Frontier describes Digger as \"...a rich fantasy adventure, a bitingly sarcastic satire, a meditation on myth and religion, and possessed of a quirky and beautiful black and white art style...\" And Eric Burns of Websnark reminds us that \"...Ursula Vernon didn't come to comics via comics, but instead was a fine artist and illustrator who kind of segued into comics. It shows in her style, which is perhaps the most beautiful pen and ink work on the web. Vernon knows how to take black and negative space and make them into astounding pieces.\"This collection also contains an excerpt from Hyena Hierarchies Today, courtesy of the collection of Librarian Vo, specifically dealing with the members of the Cerulean Hills Boneclaw tribe.Winner of the Web Cartoonists' Choice Awards in the categories of Outstanding Black and White Art (2005, 2006) & Outstanding Anthropomorphic Comic (2006), as well as the Broken Frontier award for Best Webcomic Creator (2007), Digger has also attracted the attention of the wider comics industry — garnering Ursula Vernon a 2006 Will Eisner Comics Industry Awards nomination in the category of Talent Deserving of Wider Recognition.",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "Comics",
    "Fiction",
    "Webcomic",
    "Adventure",
    "Comic Book"
  ],
  "author": "Ursula Vernon",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/7134386-digger-volume-four"
}