{
  "title": "Gods of Green Mountain",
  "description": "What if mere mortals could meet their Gods and learn the answers to life's most mysterious questions? Now they can.\nImagine a planet with two blazing suns. A world inhabited by mortals with flaming red hair, saffron colored skin, and violet eyes. A place where extreme and often violent weather conditions force the people underground where they will be safe...until the next furious storm strikes. This strange land is El Sod-A-Por, the ill-favored one, and in the far distance sits the Green Mountain, home of the Gods—Gods who have no mercy. But everything changes when a fearless young man, Far-Awn, defies his father's warnings and travels tirelessly, in search of a star-shaped opalescent flower.  This miraculous plant becomes the source of never-ending food and can even be made into clear atmospheric domes, which enclose entire cities to ensure peace and protection.  Years later El Sod-A-Por is known as El Dorriane, the ideal, and Ras-Far, grandson of the revered Far-Awn, is king. The people happily live a life of plenty—until an entire city is mysteriously wiped out. A civil war between the Upper and Lower Dorrianians ignites, forcing the king to send an entourage of the bravest and strongest men from each province to the Green Mountain to seek answers to this unexpected unrest.  Ras-Far's only child, the beautiful and headstrong Sharita, demands to go with the men across the arid desert plains to meet the Gods.  The handsome barbarian Dray-Gon, from Lower Dorriane, leads the expedition, but he sees the princess as an unnecessary burden. Now he will have to shield her from the ruthless sandstorms and evil outlaws who will attempt to enslave her at any opportunity. As the unprecedented journey begins, their love-hate relationship transforms into an enthralling passion, as the princess's icy exterior begins to thaw and Dray-Gon turns from a hard-edged savage into a gentle hero. But when they finally reach the Green Mountain, they are met with a shocking revelation that challenges everything they ever believed to be true...",
  "genres": [
    "Horror",
    "Science Fiction",
    "Young Adult",
    "Aliens",
    "Gothic"
  ],
  "author": "V.C. Andrews",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/7133912-gods-of-green-mountain"
}