{
  "title": "The Mayor of Casterbridge",
  "description": "The Mayor of Casterbridge , by Thomas Hardy , is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics : New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.Thomas Hardy ’s first masterpiece, The Mayor of Casterbridge opens with a scene of such heartlessness and cruelty that it still shocks readers today. A poor workman named Michael Henchard, in a fit of drunken rage, sells his wife and baby daughter to a stranger at a country fair. Stricken with remorse, Henchard forswears alcohol and works hard to become a prosperous businessman and the respected mayor of Casterbridge. But he cannot erase his past. His wife ultimately returns to offer Henchard the choice of redemption or a further descent into his own self-destructive nature. A dark, complex story, The Mayor of Casterbridge brims with invention, vitality, and even wit.Phillip Lopate , a professor at Hofstra University in New York City, is best known as an essayist (“Bachelorhood,” “Against Joie De Vivre,” “Portrait of My Body”). He is the editor of the anthology Art of the Personal Essay and has written a novel, The Rug Merchant , and a book of poetry, The Daily Round .",
  "genres": [
    "Fiction",
    "Classics",
    "Literature",
    "19th Century",
    "Victorian",
    "Historical Fiction",
    "Novels"
  ],
  "author": "Thomas Hardy",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/713865.The_Mayor_of_Casterbridge"
}