{
  "title": "How the Garcia Girls Lost Their Accents",
  "description": "From the international bestselling author of In the Time of the Butterflies  and Afterlife , How the Garcia Girls Lost Their Accents   is \"poignant...powerful... Beautifully captures the threshold experience of the new immigrant, where the past is not yet a memory.\" ( The New York Times Book Review )Julia Alvarez’s new novel, The Cemetery of Untold Stories, is coming April 2, 2024. Pre-order now!Acclaimed writer Julia Alvarez’s beloved first novel gives voice to four sisters as they grow up in two cultures. The García sisters—Carla, Sandra, Yolanda, and Sofía—and their family must flee their home in the Dominican Republic after their father’s role in an attempt to overthrow brutal dictator Rafael Trujillo is discovered. They arrive in New York City in 1960 to a life far removed from their existence in the Caribbean. In the wondrous but not always welcoming U.S.A., their parents try to hold on to their old ways as the girls try find new by straightening their hair and wearing American fashions, and by forgetting their Spanish. For them, it is at once liberating and excruciating to be caught between the old world and the new. Here they tell their stories about being at home—and not at home—in America.\"Alvarez helped blaze the trail for Latina authors to break into the literary mainstream, with novels like In the Time of the Butterflies and How the García Girls Lost Their Accents winning praise from critics and gracing best-seller lists across the Americas.\"—Francisco Cantú,  The New York Times Book Review\"A clear-eyed look at the insecurity and yearning for a sense of belonging that are a part of the immigrant experience . . . Movingly told.\" — The Washington Post Book World",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Young Adult",
    "Book Club",
    "Classics",
    "Coming Of Age",
    "Novels"
  ],
  "author": "Julia Alvarez",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/7133770-how-the-garcia-girls-lost-their-accents"
}