{
  "title": "Don't Look Now and Other Stories",
  "description": "Collecting five stories of suspense, mystery, and slow, creeping horror, Daphne Du Maurier's Don't Look Now and Other Stories includes an introduction by Susan Hill, author of The Woman in Black, in Penguin Modern Classics.John and Laura have come to Venice to try and escape the pain of their young daughter's death. But when they encounter two old women who claim to have second sight, they find that instead of laying their ghosts to rest they become caught up in a train of increasingly strange and violent events. Adapted into a terrifying film starring Julie Christie and Donald Sutherland, 'Don't Look Now'. The four other haunting, evocative stories in this volume also explore deep fears and longings, secrets and desires: 'Not After Midnight', in which a lonely teacher investigates a mysterious American couple; 'A Border Line Case', in which a young woman confronts her father's past and his associations with the IRA; 'The Way of the Cross', in which a party of pilgrims to Jerusalem encounter strange phenomena in the Garden of Gethsemane; and 'The Breakthrough', in which a scientist claims to be able to trap the soul at the point of death ...Daphne du Maurier (1907-89) - English novelist, biographer, and playwright, who published romantic suspense novels, mostly set on the coast of Cornwall. Du Maurier is best known for Jamaica Inn (1936), filmed by Alfred Hitchcock in 1939, Rebecca (1938), filmed by Hitchcock in 1940, and The Birds (1952), filmed by Hitchcock in 1963.If you enjoyed Don't Look Now and Other Stories, you might like Shirley Jackson's The Haunting of Hill House, also available in Penguin Modern Classics.'Daphne du Maurier has no equal' Sunday Telegraph'Du Maurier created a scale by which modern women can measure their feelings'Stephen King",
  "genres": [
    "Short Stories",
    "Horror",
    "Fiction",
    "Classics",
    "Gothic",
    "Mystery",
    "Suspense"
  ],
  "author": "Daphne du Maurier",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/713898.Don_t_Look_Now_and_Other_Stories"
}