{
  "title": "The Black Nile: One Man's Amazing Journey Through Peace and War on the World's Longest River",
  "description": "A spectacular modern-day adventure along the Nile River from Lake Victoria to the Mediterranean Sea With news of tenuous peace in Sudan, foreign correspondent Dan Morrison bought a plank-board boat, summoned a childhood friend who'd never been off American soil and set out from Uganda, paddling the White Nile on a quest to reach Cairo-a trip that tyranny and war had made impossible for decades. Morrison's chronicle is a mashup of travel narrative and reportage, packed with flights into the frightful and the absurd. Through river mud that engulfs him and burning marshlands that darken the sky, he tracks the snarl of commonalities and conflicts that bleed across the Nile valley, bringing to life the waters that connect the hardscrabble fishing villages of Lake Victoria to the floating Cairo nightclubs where headscarved mothers are entertained by gyrating male dancers. In between are places and lives invisible to cable news and opinion blogs: a hidden oil war that has erased entire towns, secret dams that will flood still more and contested borderlands where acts of compassion and ingenuity defy appalling hardship and waste of life. As Morrison dodges every imaginable hazard, from militia gunfire to squalls of sand, his mishaps unfold in strange harmony with the breathtaking range of individuals he meets along the way. Relaying the voices of Sudanese freedom fighters and escaped Ugandan sex slaves, desert tribesmen and Egyptian tomb raiders, The Black Nile culminates in a visceral understanding of one of the world's most elusive hotspots, where millions strive to claw their way from war and poverty to something better-if only they could agree what that something is, whom to share it with, and how to get there. With the propulsive force of a thriller, The Black Nile is rife with humor, humanity and fervid insight-an unparalleled portrait of a complex territory in profound transition.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Africa",
    "Egypt",
    "Adventure",
    "Memoir",
    "Sudan"
  ],
  "author": "Dan     Morrison",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/7143956-the-black-nile"
}