{
  "title": "Tales of the Otherworld",
  "description": "'There is something for everyone between the covers. Fans of the Otherworld can find out more about their favourite characters, and many new readers will be intrigued enough to pursue the novels. The book is a win-win situation for any reader.' - The Globe and Mail 'Armstrong's longtime fans . . . will be delighted.' - Publishers Weekly A young vampire learns the heavy price of his new existence; black witch Eve Levine meets Kristof Nast, her soul mate and her nemesis; Lucas Cortez, lawyer, sorcerer and unwilling heir to his father's Cabal, sets out on a case that will change his destiny; Paige Winterbourne discovers just how fraught a white (witch) wedding can be and Elena Michaels begins her unwitting journey to a new life - as the only female werewolf in the world . . . These brilliant, self-contained stories are a perfect introduction to the series and a wonderful addition to the existing novels. Tales From the Otherworld will delight fans and curious new readers alike. Kelley Armstrong's gripping and imaginative short stories are brought together in a fantastic new collection. Books by Kelley Women of the Otherworld seriesBittenStolenDime Store MagicIndustrial MagicHauntedBrokenNo Humans InvolvedPersonal DemonLiving with the DeadFrost BittenWalking the WitchSpellboundThirteen Nadia StaffordExit StrategyMade to be BrokenWild Justice RocktonCity of the LostA Darkness AbsoluteThis Fallen PreyWatcher in the WoodsAlone in the Wild Darkest PowersThe SummoningThe AwakeningThe Reckoning Otherworld TalesMen of the OtherworldTales of the OtherworldOtherworld NightsOtherworld SecretsOtherworld Chills Darkness RisingThe GatheringThe CallingThe Rising CainsvilleOmensVisionsDeceptionsBetrayalsRituals",
  "genres": [
    "Urban Fantasy",
    "Paranormal",
    "Fantasy",
    "Vampires",
    "Romance",
    "Werewolves",
    "Paranormal Romance"
  ],
  "author": "Kelley Armstrong",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/7141610-tales-of-the-otherworld"
}