{
  "title": "Second Time Around: A Romance Anthology",
  "description": "Love's more comfortable the second time around. Just as wonderful with both feet on the ground...\n\n\nFrom betrayal, to broken hearts, to finding love again, Second Time Around has a story for just about anyone.\n\n\n\n\n\n\n\nCynthia Breeding - Winds Of Destiny\n\nSitting alone in a bar on her fortieth birthday wasn't something Katherine Armand had ever planned. With her marriage over, better to pay attention to her career. A big-shot developer was flying into her sleepy, coastal fishing village to discuss building a resort. Katherine was a top-notch negotiator for her law firm. Anderson was eager for the land. This should be as smooth as sailing gentle Gulf waters.\nExcept Anderson sent his top man to broker the deal... and Katherine hadn't planned on having to bargain with Michael Whitfield, the man who had broken her heart fifteen years ago, ever again.\n\n\n\n\nKirsten Scott - Lizzie's Laces\n\nTwo years ago, Lizzie Rawlston left her home in Boston for Liverpool, determined to start a new life and forget all about Tony Sinclair, the handsome packet captain who had once been her best friend - and with whom she had the misfortune of falling in love.\nHowever, Tony had made it clear he wanted only one thing in life: the sea. He didn't want to be bothered with a family, or worse, a wife. Now, with Lizzie's father sick, possibly dying, Tony has appeared to bring Lizzie home. As they race against time to get Lizzie home before her father passes away, Tony and Lizzie rediscover the magic they've always shared.\nBut when a storm blows up, threatening the ship and all of their lives, Tony will have to confront his greatest fear. Can he love Lizzie and still love the sea? Does being the fastest also have to mean being alone?\n\n\n\n\nKaren Michelle Nutt - The Spirit Of Love\n\nA tragic accident leaves Brynna and Travis devastated. Instead of turning to each other for comfort, they drift apart. However, they must complete one more assignment - set on an old ship, The Queen Mary, during Yule, one of the most haunted times in the Celtic calendar. It is believed souls of the dead prevail and anam cara-soul friends can visit.\n\n\nWill Travis and Brynna confront the spirit of love, allowing them a chance to heal and find their way back to each other?\n\n\n\n\n\n\nErin E.M. Hatton - The Garden Swing\n\nTess Murphy loves hearing stories from her elderly patient, Emmeline. When the woman dies, she leaves a dilapidated Victorian house that may be more trouble than it's worth. But when Tess tries out an old, unique swing in the garden, she hurtles back in time, and to the arms of the house's handsome owner, Hugh MacAllister. She faces the hardest choice of her life: to return to her own time, or to stay and become a part of history.\n\n\n\n\nGerri Bowen - Only And Always You\n\nTen years ago, two hearts were broken. Will Viscount Seton and Lady Claire be able to set aside their hurt and betrayal to have a second chance at love with each other?\n\n\n\n\nKimberly Ivey (Kimberly Ivey Wuttke) - Special Of The Day\n\nNick Delatorre's college sweetheart who dumped him years ago is back in town. Trouble is, she's opened a restaurant next door to his and is stealing all his customers.\n\n\nFor Nick, revenge has never tasted sweeter, and now he's going to dish it back out-a la mode!",
  "genres": [],
  "author": "Cynthia Breeding",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/7149469-second-time-around"
}