{
  "title": "Taming the Wolf",
  "description": "This is the first book in The Wolf Pack series.\nSamara Layton needs a pot of gold.\nHer community outreach organization in Washington, D.C. is in dire financial straits. As executive director, it's up to Samara to rescue the non-profit organization from bankruptcy, and time is running out. As a last-ditch resort, she seeks help from her estranged mother, world-renowned fashion designer Asha Dubois. In exchange for her mother's financial assistance, Samara agrees to model in Asha's spring fashion show in New York City. She gets more than she bargained for when she steps onto the runway and into the smouldering gaze of the sexiest man she's ever seen. Life has taught Samara to be skeptical of all men, so she's convinced Marcus Wolf is up to no good when he asks her out after the fashion show. When she rudely turns down his dinner invitation, she has no idea that she will soon need his help to rescue her business. And little does she know that Marcus is the man who will take her body to heights of ecstasy, and ultimately claim her heart and soul... Prominent civil rights attorney Marcus Wolf is in New York City on an important business trip. Attending a fashion show is not on his itinerary, until a friend talks him into it. From the moment Samara Layton steps onto the runway in a breathtakingly sheer gown, Marcus is captivated. When their eyes meet, the electricity between them is enough to light up all of Manhattan. But while Marcus would like nothing more than to seduce the exotic beauty, he has no interest in pursuing a serious relationship with her. All his life, women have brought him nothing but heartache -- starting with his very own mother, who betrayed him in the worst imaginable way. This confirmed bachelor definitely isn't looking for love. But when Samara comes to him for help, she makes him an offer he can't possibly refuse....",
  "genres": [
    "Romance",
    "African American Romance",
    "Erotica",
    "African American",
    "Contemporary Romance",
    "Erotic Romance",
    "Contemporary"
  ],
  "author": "Maureen Smith",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/714868.Taming_the_Wolf"
}