{
  "title": "Blood Done Sign My Name: A True Story",
  "description": "\"Daddy and Roger and 'em shot 'em a nigger.\"Those words, whispered to ten-year-old Tim Tyson by one of his playmates in the late spring of 1970, heralded a firestorm that would forever transform the small tobacco market town of Oxford, North Carolina.On May 11, 1970, Henry Marrow, a 23-year-old black veteran, walked into a crossroads store owned by Robert Teel, a rough man with a criminal record and ties to the Ku Klux Klan, and came out running. Teel and two of his sons chased Marrow, beat him unmercifully, and killed him in public as he pleaded for his life. In the words of a local \"They shot him like you or I would kill a snake.\"Like many small Southern towns, Oxford had barely been touched by the civil rights movement. But in the wake of the killing, young African Americans took to the streets, led by 22-year-old Ben Chavis, a future president of the NAACP. As mass protests crowded the town square, a cluster of returning Vietnam veterans organized what one termed \"a military operation.\" While lawyers battled in the courthouse that summer in a drama that one termed \"a Perry Mason kind of thing,\" the Ku Klux Klan raged in the shadows and black veterans torched the town's tobacco warehouses.With large sections of the town in flames, Tyson's father, the pastor of Oxford's all-white Methodist church, pressed his congregation to widen their vision of humanity and pushed the town to come to terms with its bloody racial history. In the end, however, the Tyson family was forced to move away.Years later, historian Tim Tyson returned to Oxford to ask Robert Teel why he and his sons had killed Henry Marrow. \"That nigger committed suicide, coming in here wanting to four-letter-word my daughter-in-law,\" Teel explained.The black radicals who burned much of Oxford also told Tim their stories. \"It was like we had a cash register up there at the pool hall, just ringing up how much money we done cost these white people,\" one of them explained. \"We knew if we cost 'em enough goddamn money they was gonna start changing some things.\"In the tradition of To Kill a Mockingbird , Blood Done Sign My Name is a classic work of conscience, a defining portrait of a time and place that we will never forget. Tim Tyson's riveting narrative of that fiery summer and one family's struggle to build bridges in a time of destruction brings gritty blues truth, soaring gospel vision, and down-home humor to our complex history, where violence and faith, courage and evil, despair and hope all mingle to illuminate America's enduring chasm of race.",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "Race",
    "True Crime",
    "Book Club",
    "African American"
  ],
  "author": "Timothy B. Tyson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/715438.Blood_Done_Sign_My_Name"
}