{
  "title": "The House",
  "description": "The restoration of a majestic old home provides the exhilarating backdrop for Danielle Steel’s 66th bestselling novel, the story of a young woman’s dream, an old man’s gift, and the surprises that await us behind every closed door...Perched on a hill overlooking San Francisco, the house was magnificent, built in 1923 by a wealthy man for the woman he adored. For her and for this house, he would spare no expense and overlook no detail, from the endless marble floors to the glittering chandeliers. Almost a century later, with the once-grand house now in disrepair, a young woman walks through its empty rooms. Sarah Anderson, a perfectly sensible estate lawyer, is about to do something utterly out of character. An elderly client has died and left her two gifts. One is a generous inheritance. The other, a priceless message: to use his money for something wonderful, something daring. And in this old house, surrounded by crumbling grandeur, Sarah knows just what it is.A respected attorney and self-described workaholic, Sarah had always lived life by the book. With a steady, if sputtering, relationship and a tiny apartment that has suited her just fine, Sarah cannot explain the force that draws her to the mansion and its history–to the story of a woman who once lived in the house, then mysteriously left it, to a child who grew up there, and a drama that unfolded in war-torn France...and to a history she never knew she had.Taking the biggest risk of her life, Sarah enlists the help of architect Jeff Parker, who shares Sarah’s passion for bringing the exquisite old house back to life. As she and Jeff work to restore the home’s every detail, as one relationship shatters and another begins, Sarah makes a series of powerful discoveries: about the true meaning of a dying man’s last gift...about the extraordinary legacies that are passed from generation to generation...and about a future she’s only just beginning to imagine.<In a novel of daring and hope, of embracing life and taking chances, Danielle Steel brilliantly captures one woman’s courageous choice to pour herself into a dream–and receive its gifts in return.From the Hardcover edition.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Audiobook",
    "Contemporary Romance",
    "Novels"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/715217.The_House"
}