{
  "title": "Wednesday Comics",
  "description": "This outsized hardcover edition collects the entire critically acclaimed Wednesday Comics series that revisited the classic weekly newspaper full-page comics section. It features 16-different stories starring the World's Greatest Super Heroes including Superman, Batman, Wonder Woman, Green Lantern, the Flash, Metamorpho and the Metal Men, written and Illustrated by some of the comic industry's top talents. The 11\" x 17\" trim size to approximate the Sunday funnies was spearheaded by DCU Editorial Art Director Mark Chiarello, whose past editing credits include BATMAN BLACK AND WHITE, and DC: THE NEW FRONTIER. The full list of featured stories and creators is as follows:  BATMAN, by the Eisner Award-winning 100 BULLETS team of writer Brian Azzarello and artist Eduardo Risso ADAM STRANGE, by writer/artist Paul Pope (BATMAN: YEAR 100) METAMORPHO, written by New York Times best-selling writer Neil Gaiman with Art by Eisner Award-winner Michael Allred (Madman) THE DEMON AND CATWOMAN, written by Walter Simonson (Thor, MANHUNTER) with Art by famed DC cover artist Brian Stelfreeze DEADMAN, written by Dave Bullock and Vinton Heuck, Art by Dave Bullock KAMANDI, written by Dave Gibbons (WATCHMEN, GREEN LANTERN CORPS) with Art by Ryan Sook (Buffy The Vampire Slayer, ARKHAM ASYLUM: LIVING HELL) SUPERMAN, written by John Arcudi (The Mask) with Art by Lee Bermejo (JOKER) WONDER WOMAN, written and illustrated by Ben Caldwell (Dare Detectives) GREEN LANTERN, written by Kurt Busiek (TRINITY, ASTRO CITY) with Art by Joe Quiñones (TEEN TITANS GO!) TEEN TITANS, written by Eddie Berganza with Art by Sean Galloway SUPERGIRL, written by Jimmy Palmiotti (JONAH HEX) with Art by Amanda Conner (POWER GIRL) HAWKMAN, written and illustrated by Kyle Baker (PLASTIC MAN, Special Forces) SGT. ROCK, written by Adam Kubert (SUPERMAN: LAST SON), ilustrated by legendary comics artist Joe Kubert THE FLASH, written by Karl Kerschl (TEEN TITANS YEAR ONE, THE FLASH: THE FASTEST MAN ALIVE) and Brenden Fletcher, illustrated by Karl Kerschl METAL MEN, written by Dan DiDio with Art by Ian Churchill (SUPERGIRL)",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Dc Comics",
    "Superheroes",
    "Fantasy",
    "Anthologies",
    "Comic Book"
  ],
  "author": "Mark Chiarello",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/7155567-wednesday-comics"
}