{
  "title": "No Easy Answers: The Truth Behind Death at Columbine",
  "description": "On April 20, 1999, Dylan Klebold and Eric Harris, two seniors at Columbine High School in Littleton, Colorado, walked into their school and shot to death twelve students and one teacher, and wounded many others. It was the worst single act of murder at a school in U.S. history. Few people knew Dylan Klebold or Eric Harris better than Brooks Brown. Brown and Klebold were best friends in grade school, and years later, at Columbine, Brown was privy to some of Harris and Klebolds darkest fantasies and most troubling revelations After the shootings, Brown was even accused by the police of having been in on the massacre simply because he had been friends with the killers.Now, for the first time, Brown, with journalist Rob Merritt, gets to tell his full version of the story. He describes the warning signs that were missed or ignored, and the evidence that was kept hidden from the public after the murders. He takes on those who say that rock music or video games caused Klebold and Harris to kill their classmates and explores what it might have been that pushed these two young men, from supposedly stable families, to harbor such violent and apocalyptic dreams.Shocking as well as inspirational and insightful, No Easy Answers is an authentic wake-up call for all the psychologists, authorities, parents, and law enforcement personnel who have attempted to understand the murders at Columbine High School. As the title suggests, the book offers no easy answers, but instead presents the unvarnished facts about growing up as an alienated teenager in America today.Brooks Brown graduated from Columbine High School in 1999; this is his first book. Most recently, Brooks worked and consulted on Michael Moores latest documentary called Bowling for Columbine. He lives in Littleton, Colorado. Rob Merritt graduated from the University of Iowa School of Journalism in 1998 and currently works as a newspaper writer in Marshalltown, Iowa.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Memoir",
    "History",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Brooks Brown",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/716094.No_Easy_Answers"
}