{
  "title": "The Philosophy of Horror",
  "description": "Sitting on pins and needles, anxiously waiting to see what will happen next, horror audiences crave the fear and exhilaration generated by a terrifying story; their anticipation is palpable. But they also breathe a sigh of relief when the action is over, when they are able to close their books or leave the movie theater. Whether serious, kitschy, frightening, or ridiculous, horror not only arouses the senses but also raises profound questions about fear, safety, justice, and suffering. From literature and urban legends to film and television, horror's ability to thrill has made it an integral part of modern entertainment. Thomas Fahy and twelve other scholars reveal the underlying themes of the genre in The Philosophy of Horror. Examining the evolving role of horror, the contributing authors investigate works such as Mary Shelley's Frankenstein (1818), horror films of the 1930s, Stephen King's novels, Stanley Kubrick's adaptation of The Shining (1980), and Alfred Hitchcock's Psycho (1960). Also examined are works that have largely been ignored in philosophical circles, including Truman Capote's In Cold Blood (1965), Patrick Süskind's Perfume (1985), and James Purdy's Narrow Rooms (2005). The analysis also extends to contemporary forms of popular horror and \"torture-horror\" films of the last decade, including Saw (2004), Hostel (2005), The Devil's Rejects (2005), and The Hills Have Eyes (2006), as well as the ongoing popularity of horror on the small screen. The Philosophy of Horror celebrates the strange, compelling, and disturbing elements of horror, drawing on interpretive approaches such as feminist, postcolonial, Marxist, and psychoanalytic criticism. The book invites readers to consider horror's various manifestations and transformations since the late 1700s, probing its social, cultural, and political functions in today's media-hungry society.",
  "genres": [
    "Horror",
    "Nonfiction",
    "Philosophy",
    "Film",
    "Media Tie In",
    "Essays",
    "Halloween"
  ],
  "author": "Thomas Fahy",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/7158300-the-philosophy-of-horror"
}