{
  "title": "حرمة أهل العلم",
  "description": "بعض مواضع من كتاب \"حرمة أهل العلم\" للعلامة الشيخ محمد إسماعيل المقدم –حفظه الله-يقول الشيخ: \"إن الميدان الدعوي اليوم يموج بحالة من الخلل الناشيء عن ( التضخم الكمي ) الذي فرضنفسه على حساب التربية النوعية ، الأمر الذي أفرز الكثير من الظواهر المرضية منأخطرها تطاول الصغار على الكبار ، والجهال على العلماء وطلبة العلم بعضهم على بعضحتى أن الواحد منهم ينسى قاموس التآخي وما أسرع ما يخرج إلى العدوان على إخوانهويجردهم من كل فضل فلا يحلم ولا يعفو ولا يصبر .. ولكن يجهل فوق جهل الجاهلين ، بلإن من طلاب آخر الزمان من غاص في أوحال السب والشتم والتجريح وانتدب نفسه للوقيعةفي أئمة كرام اتفقت الأمة على إمامتهم وهو لا يدري أنما ذلكم الشيطان يستدرجه لوحلالعدوان وهو يحسب أنه يحسن صنعا ، ويتوهم أنه يؤدي ما قد وجب عليهشرعاً. فرحم الله من جعل عقله على لسانه رقيبا ، وعمله على قوله حسيباً.\" يقول الشيخ: \"و انطلاقاً من قول الله تبارك وتعالى}فاتقوا الله وأصلحوا ذات بينكم {ومن قوله عليه الصلاة والسلام (( إياكم وسوء ذاتالبين ، فإنها الحالقة )) تأتي هذه التذكرة لمن كان له قلب أو ألقى السمع وهو شهيد، في وقت اختلطت فيه الأوراق ، وتشعبت السبل ، وهجرت فيه الآداب الشرعية ، والسننالمحمدية صلوات ربي وسلامه عليه ، والأخلاق الإسلامية. وروي عن أبي هريرة رضي الله عنه قال رسول الله صلى الله عليه وسلم: إن أحبكم إلي أحاسنكم أخلاقا ، الموطئون أكنافا ، الذين يألفون ويُؤلفون ، وإنأبغضكم إلي المشاؤون بالنميمة ، المفرقون بين الأحبة ، الملتمسون للبرءاء العنت\"يقول الشيخ: \"إن المسيء العلماء والطاعن عليهم بغياً وعدواً قد ركب متن الشطط ، ووقعفي أقبح الغلط ، لأن حرمة العلماء مضاعفة ، وحقوقهم متعددة فلهم كل ما ثبت من حقوقالمسلم على أخيه المسلم ، ولهم حقوق المسنين والأكابر ، ولهم حقوق حملة القرآنالكريم ، ولهم حقوق العلماء العاملين ، والأولياء الصالحين.من أعظم حقوق المسلم صيانة عرضه ورعاية حرمتهلقد خطب رسول الله صلى الله عليه وسلم على مسمع يزيدعن مائة ألف نفس من صحابته الأبرار في حجة الوداع فقال: إن دمائكم وأموالكموأعراضكم حرام عليكم كحرمة يومكم هذا ، في بلدكم هذا ، ألا هل بلغت؟؟والأعراض: جمع عرض ، ( وهو موضع المدح والذم من الإنسان ، سواءً كان فينفسه أو في سلفه ، أو من يلزمه أمره ، وقيل: هو جانبه الذي يصونه من نفسه وحسبهويحامي عنه أن ينتقص أو يثلب).وعن أبي هريرة رضي الله عنه قال رسول اللهصلى الله عليه وسلم: كل المسلم على المسلم حرام ، دمه وماله وعرضه )) . ونظرعبدالله بن عمر رضي الله عنهما يوماً إلى الكعبة ، فقال: \"ما أعظمك وأعظم حرمتك!! والمؤمن أعظم حرمة منك\".وعن جابر رضي الله عنه قال رسول الله صلى الله عليهوسلم المسلم من سلم المؤمنين من لسانه ويده)).\"",
  "genres": [],
  "author": "محمد إسماعيل المقدم",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/7160971"
}