{
  "title": "The Philosopher's Stone",
  "description": "Wilson probably has earned a reputation more as a scholar & biographer than as a novelist; but this novel, originally published in 1969, proves that he possesses significant skills in the area of fiction as well. He weaves a great deal of speculation into the meaning of existence & the future of the species into the plot; so much so that the book at times seems as much a work of philosophy as of fiction. The story centers on the experiences of Howard Lester, an enterprising young intellectual whose work with fellow researcher Henry Littleway leads to the discovery that implanting a minute bit of a metallic alloy into the prefrontal cortex can introduce a higher state of conciousness. (As in the case with Carlos Castaneda in his thematically-similar Don Juan chronicles, the researchers later discover that the artificial catalyst is unnecessary, but rather a convenient means to overcome years of conditioning). Lester & Littleway perform the operation upon themselves & proceed to refine their new skills until they are able to employ a sort of time vision that allows them to tap into racial memories. With this knowledge comes the realization that there are shadowy periods in our species' past that have been kept hidden from us by more powerful beings. Lester relates his moment of insight: \"I knew with certainty that there is something in the world's prehistory that cannot be found in any of the books on the past. & it was obscurely connected with [a] sense of evil...\" In the course of discovering how the Earth & humankind truly evolved, this tale touches upon everything from Mayan civilization to Abraham Maslow to H.P. Lovecraft's elder Gods.--From Independent Publisher (edited)",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Horror",
    "Philosophy",
    "Fantasy",
    "Lovecraftian",
    "Cthulhu Mythos"
  ],
  "author": "Colin Wilson",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/715738.The_Philosopher_s_Stone"
}