{
  "title": "The Woman in the Shaman's Body: Reclaiming the Feminine in Religion and Medicine",
  "description": "A distinguished anthropologist–who is also an initiated shaman–reveals the long-hidden female roots of the world’s oldest form of religion and medicine. Here is a fascinating expedition into this ancient tradition, from its prehistoric beginnings to the work of women shamans across the globe today.Shamanism was not only humankind’s first spiritual and healing practice, it was originally the domain of women. This is the claim of Barbara Tedlock’s provocative and myth-shattering book. Reinterpreting generations of scholarship, Tedlock–herself an expert in dreamwork, divination, and healing–explains how and why the role of women in shamanism was misinterpreted and suppressed, and offers a dazzling array of evidence, from prehistoric African rock art to modern Mongolian ceremonies, for women’s shamanic powers.Tedlock combines firsthand accounts of her own training among the Maya of Guatemala with the rich record of women warriors and hunters, spiritual guides, and prophets from many cultures and times. Probing the practices that distinguish female shamanism from the much better known male traditions, she reveals:• The key role of body wisdom and women’s eroticism in shamanic trance and ecstasy• The female forms of dream witnessing, vision questing, and use of hallucinogenic drugs• Shamanic midwifery and the spiritual powers released in childbirth and monthly female cycles• Shamanic symbolism in weaving and other feminine arts• Gender shifting and male-female partnership in shamanic practiceFilled with illuminating stories and illustrations, The Woman in the Shaman’s Body restores women to their essential place in the history of spirituality and celebrates their continuing role in the worldwide resurgence of shamanism today.",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Feminism",
    "History",
    "Anthropology",
    "Womens",
    "Health"
  ],
  "author": "Barbara Tedlock",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/715881.The_Woman_in_the_Shaman_s_Body"
}