{
  "title": "Dead Center: Behind the Scenes at the World's Largest Medical Examiner's Office",
  "description": "A city with eight million people has eight million ways to dieFor fifteen years, Shiya Ribowsky worked as a medicolegal investigator in New York City’s medical examiner’s office—the largest, most sophisticated organization of its kind in the world. Utilizing his background in medicine, he led the investigations of more than eight thousand individual deaths, becoming a key figure in some of New York’s most bizarre death cases and eventually taking charge of the largest forensic investigation ever attempted: identifying the dead in the aftermath of the September 11 tragedies.Now, in this mesmerizing book, Ribowsky pulls back the curtain on the New York City’s medical examiner’s office, giving an enthralling, never-before-seen glimpse into death and the city. Born and raised in New York City’s orthodox Jewish community, Ribowsky seems an unlikely candidate for this macabre profession. Nevertheless he has forsaken a promising career of medical work with the living, descending instead into the realm of the dead, enticed by the challenge of confronting death on a daily basis. Taking you through the vermin-infested Bowery flophouses and posh Upper East Side apartments of the city’s dead, Ribowsky explores in gruesome detail the skeletons that hang in the Big Apple’s closets. Combing through the autopsy room, he also exposes the grim secrets that only a scalpel and a dead body can tell and explains how forensic investigation does not merely solve crimes—it saves lives.But it is in the aftermath of September 11 that the ME’s office is handed its biggest challenge: to identify as many of the fallen as possible. With poignant descriptions, Ribowsky provides a dramatic account of the office’s diligent and unflappable work with the families of the victims, helping them emerge from the ashes of this tragedy while displaying the strength, grit, intelligence, and compassion that Americans expect from true New Yorkers.At once compelling and heartbreaking, Dead Center is a story of New York unlike any other, blending the haunting with the sublime, while painting a striking portrait of death (and life) in the city that never sleeps.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Medical",
    "Science",
    "Death",
    "Medicine",
    "Memoir"
  ],
  "author": "Shiya Ribowsky",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/716799.Dead_Center"
}