{
  "title": "Peter, Paul & Mary Magdalene: The Followers of Jesus in History & Legend",
  "description": "Bart Ehrman, author of the highly popular Truth and Fiction in The Da Vinci Code and Lost Christianities , here takes readers on another engaging tour of the early Christian church, illuminating the lives of three of Jesus' most intriguing Simon Peter, Paul of Tarsus, and MaryMagdalene.What do the writings of the New Testament tell us about each of these key followers of Christ? What legends have sprung up about them in the centuries after their deaths? Was Paul bow-legged and bald? Was Peter crucified upside down? Was Mary Magdalene a prostitute? In this lively work,Ehrman separates fact from fiction, presenting complicated historical issues in a clear and informative way and relating vivid anecdotes culled from the traditions of these three followers. He notes, for instance, that historians are able to say with virtual certainty that Mary, the follower ofJesus, was from the fishing village of Magdala on the shore of the Sea of Galilee (this is confirmed by her name, Mary Magdalene, reported in numerous independent sources); but there is no evidence to suggest that she was a prostitute (this legend can be traced to a sermon preached by Gregory theGreat five centuries after her death), and little reason to think that she was married to Jesus. Similarly, there is no historical evidence for the well-known tale that Peter was crucified upside down. Ehrman also argues that the stories of Paul's miracle working powers as an apostle are legendaryaccounts that celebrate his importance.A serious book but vibrantly written and leavened with many colorful stories, Peter, Paul, and Mary Magdalene will appeal to anyone curious about the early Christian church and the lives of these important figures.",
  "genres": [
    "Religion",
    "History",
    "Nonfiction",
    "Christianity",
    "Theology",
    "Christian",
    "Biography"
  ],
  "author": "Bart D. Ehrman",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/71656.Peter_Paul_Mary_Magdalene"
}