{
  "title": "Maimonides: The Life and World of One of Civilization's Greatest Minds",
  "description": "This authoritative biography of Moses Maimonides, one of the most influential minds in all of human history, illuminates his life as a philosopher, physician, and lawgiver. A biography on a grand scale, it brilliantly explicates one man’s life against the background of the social, religious, and political issues of his time.Maimonides was born in Córdoba, in Muslim-ruled Spain, in 1138 and died in Cairo in 1204. He lived in an Arab-Islamic environment from his early years in Spain and North Africa to his later years in Egypt, where he was immersed in its culture and society. His life, career, and writings are the highest expression of the intertwined worlds of Judaism and Islam.Maimonides lived in tumultuous times, at the peak of the Reconquista in Spain and the Crusades in Palestine. His monumental compendium of Jewish law, the Mishneh Torah , became a basis of all subsequent Jewish legal codes and brought him recognition as one of the foremost lawgivers of humankind. In Egypt, his training as a physician earned him a place in the entourage of the great Sultan Saladin, and he wrote medical works in Arabic that were translated into Hebrew and Latin and studied for centuries in Europe. As a philosopher and scientist, he contributed to mathematics and astronomy, logic and ethics, politics and theology. His Guide of the Perplexed , a masterful interweaving of religious tradition and scientific and philosophic thought, influenced generations of Christian, Muslim, and Jewish thinkers.Now, in a dazzling work of scholarship, Joel Kraemer tells the complete story of Maimonides’ rich life. MAIMONIDES is at once a portrait of a great historical figure and an excursion into the Mediterranean world of the twelfth century. Joel Kraemer draws on a wealth of original sources to re-create a remarkable period in history when Jewish, Christian, and Muslim traditions clashed and mingled in a setting alive with intense intellectual exchange and religious conflict.",
  "genres": [
    "Philosophy",
    "Biography",
    "History",
    "Nonfiction",
    "Religion",
    "Judaism",
    "Jewish"
  ],
  "author": "Joel Kraemer",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/7162696-maimonides"
}