{
  "title": "Beyond Empathy: A Therapy of Contact-in Relationships",
  "description": "In this book, the authors focus on the importance of relationship in psychotherapy. Relationships between people form the basis of our daily lives. We require this contact with others, the sense of respect and value it produces, the relational needs it fulfills. As we face the inevitable traumas of life, large and small, our ability to make full contact with others is often disrupted. As this reduction in contact increases, relational needs go unfulfilled, producing psychological dysfunction. Beyond Empathy offers therapists a methodology for assisting people in rediscovering their ability to maintain genuine, contactful relationships and thus, better psychological health.The authors describe an integrative psychotherapy approach that they have developed and now teach at the Institute for Integrative Psychotherapy in New York City. It draws from Rogers' client-centered therapy, Berne's transactional analysis, Perls' Gestalt therapy, Kohut's self psychology, and the work of British object-relations theorists. Written in a conversational style, the book introduces the theory behind the approach while using real life interchanges between therapists and clients to illustrate the concepts it presents. The second part of the book details the application of this method in therapy work and provides almost complete transcripts from seven therapy sessions. These include examples of psychotherapeutic regression, working with a parental introject, couples psychotherapy, and more.The open writing style of this book makes it accessible to both beginners and seasoned practitioners within the field of mental health. This versatile approach to therapy promises to be effective across a wide range of therapeutic situations, making this a valuable book for both students and practicing clinicians throughout the spectrum of mental healthcare providers.",
  "genres": [
    "Psychology",
    "Counselling"
  ],
  "author": "Richard G. Erskine",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/717266.Beyond_Empathy"
}