{
  "title": "Inside of a Dog: What Dogs See, Smell, and Know",
  "description": "Alexandra Horowitz offers readers a fresh look at the world of dogs--from the dog's point of view.The bestselling book that asks what dogs know and how they think, now in paperback.The answers will surprise and delight you as Alexandra Horowitz, a cognitive scientist, explains how dogs perceive their daily worlds, each other, and that other quirky animal, the human. Horowitz introduces the reader to dogs' perceptual and cognitive abilities and then draws a picture of what it might be like to be a dog. What's it like to be able to smell not just every bit of open food in the house but also to smell sadness in humans, or even the passage of time? How does a tiny dog manage to play successfully with a Great Dane? What is it like to hear the bodily vibrations of insects or the hum of a fluorescent light? Why must a person on a bicycle be chased? What's it like to use your mouth as a hand? In short, what is it like for a dog to experience life from two feet off the ground, amidst the smells of the sidewalk, gazing at our ankles or knees? Inside of a Dog explains these things and much more. The answers can be surprising—once we set aside our natural inclination to anthropomorphize dogs. Inside of a Dog also contains up-to-the-minute research—on dogs' detection of disease, the secrets of their tails, and their skill at reading our attention—that Horowitz puts into useful context. Although not a formal training guide, Inside of a Dog has practical application for dog lovers interested in understanding why their dogs do what they do. With a light touch and the weight of science behind her, Alexandra Horowitz examines the animal we think we know best but may actually understand the least. This book is as close as you can get to knowing about dogs without being a dog yourself.",
  "genres": [
    "Nonfiction",
    "Dogs",
    "Animals",
    "Science",
    "Psychology",
    "Audiobook",
    "Nature"
  ],
  "author": "Alexandra Horowitz",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/7171944-inside-of-a-dog"
}