{
  "title": "Mary Berry's Complete Cookbook",
  "description": "Voted No. 1 IndyBest Celebrity CookbookYour favourite TV chef, Mary Berry, is back! Her classic recipe book is updated and filled with hundreds of delicious dishes and easy step-by-step instructions so you can make the perfect dish every time!\n\"It's easy to see why this book has already sold over one million copies. This is a new, updated edition of an old favourite, and we love how comprehensive it is.\" IndyBest\nInside the pages of this updated Mary Berry cookbook, you'll find: - More than 650 recipes, each with a photo of the finished dish, as well as over 300 variations, techniques, and tips - Mary offers her trusted guidance in more than 40 pages of illustrated step-by-step techniques- \"Cook's know-how\" sections provide additional insight into hundreds of recipes and ingredients, making it easy to cook every meal to perfection - A new and updated version with a fresh new design and stunning new images!Mary Berry's Complete Cookbook is back and looking better than ever! Now with a stunning photograph of every recipe, you can explore over 650 delicious recipes and create beautiful meals at home. This compendium is filled with Mary's special tips, tricks, and cooking techniques, making it ideal for everyone from kitchen novices to confident cooks! It's the tried and tested recipe collection that no kitchen should be without! Page through Mary Berry's recipes and be inspired by all the gorgeous food you can create using foolproof step-by-step instructions. This large recipe book has something for everyone - traditional dishes, family favourites, and classic Mary Berry recipes. These tried and tested Mary Berry recipes include mouth-watering dishes for family and friends no matter the occasion, including hummus, paella, dairy-free lasagne, prawn, tacos, chicken pot pie, English roast beef, croissants, cherry cheesecake, and knock-out baking recipes, such as her best-ever chocolate brownies!Perfect for everyday cooks, baking enthusiasts, and Mary Berry fans alike, Mary Berry's Complete Cookbook is the crowning glory of every cook's shelf.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Reference",
    "Nonfiction",
    "Food"
  ],
  "author": "Mary Berry",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/716982.Mary_Berry_s_Complete_Cookbook"
}