{
  "title": "Sweetwater Creek",
  "description": "From bestselling author Anne Rivers Siddons comes a bittersweet and finely wrought story of friendship, family, and Charleston society.At twelve, Emily Parmenter knows alone all too well. Left mostly to herself after her beautiful young mother disappeared and her beloved older brother died, Emily is keenly aware of yearning and loss. Rather than be consumed by sadness, she has built a life around the faded plantation where her remote father and hunting-obsessed brothers raise the legendary Lowcountry Boykin hunting spaniels. It is a meager, narrow, masculine world, but to Emily it has magic: the storied deep-sea dolphins who come regularly to play in Sweetwater Creek; her extraordinary bond with the beautiful dogs she trains; her almost mystic communion with her own spaniel, Elvis; the dreaming old Lowcountry itself. Emily hides from the dreaded world here. It is enough.And then comes Lulu Foxworth, troubled daughter of a truly grand plantation, who has run away from her hectic Charleston debutante season to spend a healing summer with the quiet marshes and river, and the life-giving dogs. Where Emily's father sees their guest as an entrée to a society he thought forever out of reach, Emily is at once threatened and mystified. Lulu has a powerful enchantment of her own, and this, along with the dark, crippling secret she brings with her, will inevitably blow Emily's magical water world apart and let the real one in—but at a terrible price.Poignant and emotionally compelling, Anne Rivers Siddons's Sweetwater Creek draws you into the luminous landscape of the Lowcountry. With characters that linger long after you've turned the last page, this engaging tale is destined to become an instant classic.",
  "genres": [
    "Fiction",
    "Southern",
    "Chick Lit",
    "Coming Of Age",
    "Audiobook",
    "Contemporary",
    "Dogs"
  ],
  "author": "Anne Rivers Siddons",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/717709.Sweetwater_Creek"
}