{
  "title": "Rachael Ray 2, 4, 6, 8: Great Meals for Couples or Crowds",
  "description": "If you’re like Rachael Ray, mealtime is a time to hang out and reconnect with family and friends. That means you could be making a late dinner for you and your sweetie one night and making brunch for your entire family the next day. No matter how many people join the party, Rachael firmly believes that cooking should be fun, easy–and done in 30 minutes or less.Transforming recipes for four into recipes for two or eight can be a tricky guessing game. If you use twice the amount of chicken will you have to cook it twice as long? Is it possible to make a satisfying pot of soup for two without having to eat leftovers for a week? What’s the best–and most economical–way to feed a crowd of eight? With Rachael 2, 4, 6, 8 there’s no need to guess, because Rachael has designed right-sized menus for every occasion, with perfect meals for two, four, six, or eight.For date night you don’t want tons of food, so Rachael’s Croque Madame sandwich with a Strawberry Balsamic Vinaigrette salad and a killer vodka cocktail strike just the right note. For family dinners, double dates, or those who love leftovers, Rachael whips up classic meals for four like Wingless Buffalo Chicken Pizza or Grilled Shrimp with Chorizo Skewers. For poker night with your buddies, Rachael knows exactly which ingredients stretch into a 30-minute meal for six, like Uptown Sweet and Spicy Sausage Hoagies. Throwing a dinner party is a pleasure when you’re armed with stress-free meals for eight like Italian Chicken Pot Pie and Boozy Berries and Biscuits. With complete menus for family dinners as well as easy and impressive meals for entertaining plus lots of super simple desserts that taste like a million, no matter what the occasion, the perfect meal for your crowd is never more 30 minutes away.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference"
  ],
  "author": "Rachael Ray",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/71802.Rachael_Ray_2_4_6_8"
}