{
  "title": "A Taste of Honey: Stories",
  "description": "Poignant and powerful, this debut collection from preeminent writer and critic Jabari Asim heralds his arrival as an exciting new voice in African American fiction._________________________________________________ Through a series of fictional episodes set against the backdrop of one of the most turbulent years in modern history, Asim brings into pin-sharp focus how the tumultuous events of '68 affected real people's lives and shaped the country we live in today.   The sixteen connected stories in this exciting debut are set in the fictional Midwestern town of Gateway City, where second generation off-spring of the Great Migrators have pieced together a thriving, if fragile existence.  With police brutality on the rise, the civil rights movement gaining momentum, and wars raging at home and abroad, Asim has conjured a community that stands on edge.  But it is the individual struggles with love, childrearing, adolescence, etc, lyrically chronicled here, that create a piercing portrait of humanity. In I'd Rather Go Blind and Zombies, young Crispus Jones, who while sensitive to the tremors of upheaval around him is still much more concerned with his crush on neighbor Polly and if he's ever going to be as cool as his brother.   When Ray Mortimer, a white cop, kills the owner of his favorite candy store, Crispus becomes aware of malice even more scary than zombies and the ghost that he thinks may be haunting his house.   In The Wheat from the Tares and A Virtuous Woman, Rose Whittier deals with her abusive husband with a desperate resignation until his past catches up with him and she's given a second chance at love.  And Gabriel, her suitor, realizes that his whole-hearted commitment to The Struggle may have to give way for his own shot at romance. And in Ashes to Ashes we see how a single act of despicable violence in their childhoods cements a lasting connection between two unlikely friends.  From Crispus' tender innocence to Ray Mortimer's near pure evil, to Rose's quiet determination, the characters in this book and their journeys showcase a world that is brimming with grace and meaning and showcases the talents of a writer at the top of his game.",
  "genres": [
    "Short Stories",
    "Fiction",
    "African American",
    "Historical Fiction",
    "Anthologies",
    "Drama",
    "Historical"
  ],
  "author": "Jabari Asim",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/7182218-a-taste-of-honey"
}