{
  "title": "If You Have to Cry, Go Outside: And Other Things Your Mother Never Told You",
  "description": "<!--[if gte mso 9]> Normal 0 false false false EN-US X-NONE X-NONE <![endif]--><!--[if gte mso 9]> <![endif]--> <!-- /* Font Definitions */ @font-face {\"Cambria Math\"; 4 5 3 5 4 6 3 2 4; 1107304683 0 0 159 0;} @font-face { 15 5 2 2 2 4 3 2 4; 1073750139 0 0 159 0;} @font-face { 11 6 4 3 5 4 4 2 4; 0 0 0 415 0;} /* Style Definitions */ p.MsoNormal, li.MsoNormal, div.MsoNormal { \"\"; %; \"Calibri\",\"sans-serif\"; \"Times New Roman\";} .MsoChpDefault { } @page Section1 { 11.0in; 1.0in 1.0in 1.0in; } div.Section1 {} --> <!--[if gte mso 10]> /* Style Definitions */ table.MsoNormalTable {\"Table Normal\"; \"\"; 5.4pt 0in 5.4pt; \"Calibri\",\"sans-serif\"; \"Times New Roman\"; \"Times New Roman\"; } <![endif]--> Kelly Cutrone has long been mentoring women on how to make it in one of the most competitive industries in the world. She has kicked people out of fashion shows, forced some of reality television's shiny stars to fire their friends, and built her own company—one of the most powerful PR firms in the fashion business—from the ground up. Through it all, she has refused to be anything but herself. Kelly writes in her trademark, no-bullshit style, combining personal and professional stories to share her secrets for success without selling out. Let's face this is a different world than the one in which our mothers grew up, and Kelly has created a real girl's guide to making it in today's world. Offering a wake-up call to women everywhere, she challenges us to stop the dogged pursuit of the “perfect life” and discover who we are and what we really want. Then she shows us how to go out there and get it. Much of our culture teaches us to muzzle our inner voice and follow the crowd; Kelly enables us to stop pretending and start truly living. With chapters on how to find your tribe (those like-minded souls who make your heart sing), how sometimes a breakdown is really a breakthrough, and how there is no such thing as perfection, Kelly also shares practical advice, such as how to create a personal brand and how sometimes you have to fake it to make it. Raw, hilarious, shocking, but always the honest truth, If You Have to Cry, Go Outside calls upon you to gather up your courage like an armful of clothes at a McQueen sample sale and follow your soul wherever it takes you. Whether you're just starting out in the world or looking to reinvent yourself, If You Have to Cry, Go Outside will be the spark you need to figure out what you have to say to the world—and how you're going to say it.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Memoir",
    "Fashion",
    "Business",
    "Biography",
    "Feminism"
  ],
  "author": "Kelly Cutrone",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/7187116-if-you-have-to-cry-go-outside"
}