{
  "title": "Twenty Thousand Roads: The Ballad of Gram Parsons and His Cosmic American Music",
  "description": "Gram Parsons lived fast, died young, and left a beautiful corpse–a corpse his friends stole, took to Joshua Tree National Monument, and set afire in its coffin. The theft and burning of his body marked the end of Gram Parsons’ life and the beginning of the Gram Parsons legend.As a singer and songwriter, Gram Parsons stood at the nexus of countless musical crossroads, and he sold his soul to the devil at every one. Parson hung out with glamorous women and the coolest friends. His intimates and collaborators on his journey included Keith Richards, William Burroughs, Marianne Faithfull, Peter Fonda, Roger McGuinn, Clarence White, and Emmylou Harris. Parsons had everything–looks, charisma, money, style, the best drugs, the most heartbreaking voice–and threw it all away with both hands. His ballad is one of gigantic talent colliding with epic self-destruction.Parsons led the Byrds to create the seminal country rock masterpiece Sweetheart of the Rodeo. He formed the Flying Burrito Brothers, helped to guide the Rolling Stones beyond the blues in their appreciation of American roots music, and found his musical soul mate in Emmylou Harris. Parsons’ solo albums, GP and Grievous Angel, are now recognized as visionary masterpieces of the transcendental jambalaya of rock, soul, country, gospel, and blues Parsons named “Cosmic American Music.” Four months before Grievous Angel was released, Parsons died of a drug and alcohol overdose at age twenty-six.In this beautifully written, raucous, meticulously researched biography, David N. Meyer gives Parsons’ mythic life its due. From Parsons’ privileged Southern Gothic upbringing to his early career in Greenwich Village’s folk music scene to his Sunset Strip glory days, Twenty Thousand Roads paints an unprecedented portrait of the man who linked country to rock. Parsons’ creative genius gave birth to a new sound that was rooted in the past but heralded the future.From interviews with hundreds of the famous and obscure who knew and worked closely with Parsons–many who have never spoken publicly about him before–Meyer conjures a dazzling panorama of the artist and his era. Shedding new light and dispelling old myths, Twenty Thousand Roads is a breakthrough in rock-and-roll biography and more–a chronicle of creativity, drugs, excess, culture, and music in the ferment of late-1960s America.Visit the official website: www.twentythousandroads.comFrom the Hardcover edition.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Pop Culture",
    "Biography Memoir",
    "Rock N Roll",
    "History"
  ],
  "author": "David N. Meyer",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/718432.Twenty_Thousand_Roads"
}