{
  "title": "Faking It With the Grump",
  "description": "Alternative cover edition of ASIN B0BN7D6X6GHe’s grumpy, boring, and thinks it’s okay to wear a suit and tie to a smalltown bar full of lumberjacks. But when I kiss him? Let’s just say I wasn’t expecting THAT.Harper ColeIt's one thing to be dumped by the huge Hollywood star you thought you were going to marry. It’s quite another to move back to the small town you're both from.As a booby prize for being shown the door by Dex Ryan, everyone is trying to set me up with their son, their nephew, or their long-lost cousin’s gardener. Either that or they’re throwing me pitying looks that say, “You’re a big loser.”I’m not going to put up with their patronizing sympathy anymore.So, when I spot new-guy-in-town Christopher Young, I set out to make him mine. Or you know, pretend to make him mine. I’m still in a horrible funk over Dex, and Christopher is an uptight grump. Not exactly my type.The fact that despite appearances, he’s gorgeous and doing weird things to my blood pressure doesn't mean a thing.Really.Not. A. Thing.Christopher YoungHunter’s Creek, population next to nothing, is the reason I work all the time. I’m solely focused on buying the town’s lumber mill so I can go back to NYC and get my big promotion. This small town is a means to an end. Nothing more.That is until the prettiest girl I've ever seen superglues her lips to mine in an unexpected and very public way. She’s not the kind of woman I usually go for with her boho dress and ankle boots, but that kiss…I’m disappointed when she comes up for air and tells me it’s all for show. But if Harper Cole wants me to be her fake boyfriend while I'm here in town, who am I to turn her down? Being attached to a local might ingratiate me to the townsfolk and make my job that much the easier.After all, dating Harper can only be make believe. Nothing more. Not when my entire future is at stake.Faking It With The Grump is a grumpy-sunshine, opposites attract, fake relationship romance set in the small town of Hunter's Creek, Washington. It's the first book in the new Second Chance Café series. Each book follows a different sister's love story and can be read as a standalone novel or as part of a series.",
  "genres": [
    "Romance",
    "Contemporary",
    "Clean Romance",
    "Fiction",
    "Audiobook",
    "Contemporary Romance",
    "Romantic Comedy"
  ],
  "author": "Kate O'Keeffe",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/71872274-faking-it-with-the-grump"
}