{
  "title": "White as Snow: The Sleeping Kingdom Book 1",
  "description": "GAME OF THRONES meets BROTHERS GRIMM in this fairy tale re-telling crossover fantasy series.When young Schneewittchen, Princess of Allemand, meets her new stepmother Elspeth, she believes she finally has the maternal figure her life has been missing. But when her father dies of a sudden illness, Schneewittchen finds herself at the mercy of Elspeth's wrath. Turned from princess to a servant, she does all that she can to please her stepmother in hopes that one day, she will love her like she was her own. Elspeth wants nothing to do with Schneewittchen. She can't even properly pronounce the girl's name and resorts to using the Common Tongue's Snow White. When her crown becomes jeopardized with the king's death, an unsettling jealousy towards her stepdaughter consumes her. But the crown isn't the only thing on Elspeth's mind. Locked in a tower on the outskirts of the kingdom is Elspeth's daughter, just one of the many secrets she is desperate to keep from coming to light. And when an unexpected visit from a prince threatens to unravel everything she has worked towards, Elspeth knows there is only one kill Snow White. As Elspeth conspires to destroy the princess, her daughter Rapunzel begins to feel neglected. Hidden from the world because of the black markings on her arm, Rapunzel contemplates her purpose and whether her life is worth living. Little does she know that she is one of nine keys crucial to lifting a curse her mother is hellbent on keeping alive…WHITE AS SNOW is book one of The Sleeping Kingdom series, a fairy tale re-telling fantasy crossover featuring retellings of \"Snow White and the Seven Dwarfs,\" \"Cinderella,\" \"Rapunzel,\" and \"Peter Pan.\" Mild spice and the start of a thrilling adventure, if you love fairy tales, you won't want to miss this!",
  "genres": [
    "Fantasy",
    "Retellings",
    "Fiction",
    "Fairy Tales",
    "Romance",
    "Magic",
    "Romantasy"
  ],
  "author": "Veronica Bonn",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/71874861-white-as-snow"
}