{
  "title": "Mirror Kingdoms: The Best of Peter S. Beagle",
  "description": "When New York Times Bestselling writer Tad Williams described Peter S. Beagle as a 'bandit prince out to steal reader's hearts' he touched on a truth that readers have known for fifty years. Beagle, whose work has touched generations of readers around the world, has spun rich, romantic and very funny tales that have beguiled and enchanted readers of all ages.Undeniably, his most famous work is the much loved classic, The Last Unicorn, which tells of unicorn who sets off on quest to discover whether she is the last of her kind, and of the people she meets on her journey. Never prolific, The Last Unicorn is one of only five novels Beagle has published since A Fine and Private Place appeared in 1960, and was followed by The Folk of the Air, The Innkeeper's Song, and Tamsin.During the first forty years of his career Beagle also wrote a small handful, scarcely a dozen, short stories. Classics like 'Come Lady Death,' 'Lila and the Werewolf,' 'Julie's Unicorn,' 'Professor Gottesman and the Indian Rhinoceros,' and the tales that make up Giant Bones. And then, starting just five years ago, he turned his attention to short fiction in earnest, and produced a stunning array of new stories including the Hugo and Nebula Award winning follow up to The Last Unicorn, 'Two Hearts,' WSFA Small Press Award winner 'El Regalo,' and wonderful stories like the surrealist 'The Last and Only,' the haunting 'The Rabbi s Hobby' and others.Mirror The Best of Peter S. Beagle collects the very best of these stories, over 200,000 words worth, ranging across 45 years of his career from early stories to freshly minted tales that will surprise and amaze readers. It's a book which shows, more than any other, just how successful this bandit prince from the streets of New York has been at stealing our hearts and underscores how much we hope he ll keep on doing so.",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Speculative Fiction",
    "Childrens",
    "Science Fiction Fantasy"
  ],
  "author": "Peter S. Beagle",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/7193004-mirror-kingdoms"
}