{
  "title": "Why Johnny Can't Come Home",
  "description": "Gosch self-published a book in 2000 titled Why Johnny Can't Come Home. The book presents her understanding of what her son went through, based on the original research of various private investigators and her son's visit.\"This case is SO MUCH BIGGER than you think. It goes to the very HIGHEST levels; we have to keep pulling the strings.\"—William Colby, Former Director of the CIA, Investigator of The Franklin Cover Up\"I can state without hesitation, that there is, indeed, a national cult network including satanic, witchcraft, pedophile and occult groups, which is operating at full throttle within our society today. The activities of these groups include the kidnapping, molestation, torture and murder of children. Their favorite victims are children and newborn babies: the younger, the better.\"The cult thrives on drugs, pornography and prostitution. The cult network is responsible for a violent rash of 'snuff' films, which are sold at high prices to people who crave this sick, degenerate material. Children are kidnapped and literally 'owned' by the cult and are sold on the open market to the highest bidder. These children are taken right off the streets of our cities, and traded through a national pedophile network.\"—Ted L. Gunderson, FBI Special Agent, Los Angeles (Retired)\"America's Most Wanted was about to air the Johnny Gosch Story. I received a call from Paul Sparrow saying 'The FBI contacted them and told them to KILL THE GOSCH STORY.' In other words, the FBI did not want Johnny's story aired by America's Most Wanted. John Walsh and Paul Sparrow stood up to the FBI and told them they were going ahead with our story no matter what they said or did. The FBI evidently backed down because the show aired November 1992. The show received more telephone calls from the public than any other show in its history.\"—Noreen N. Gosch",
  "genres": [
    "True Crime",
    "Conspiracy Theories",
    "Nonfiction",
    "Crime"
  ],
  "author": "Noreen N. Gosch",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/718918.Why_Johnny_Can_t_Come_Home"
}