{
  "title": "The Hermitage",
  "description": "A disgraced Earl in disguise and a Miss on a mission . . .When an unspeakable secret is uncovered, threatening to destroy the Earl of Westbridge’s tranquil life, he seeks refuge while he plots an honorable course of action. Disguised as Robbie Darkwood, he finds sanctuary as a hermit on the newly acquired estate of Mr. George Gardiner. His obligations as a hermit are to be seen but not heard, to resist any interference from others on the estate, and to provide a romantic presence at an unobtrusive distance.His duties seem simple until Miss Laurel Gardiner, Mr. Gardiner’s spirited daughter, returns from the London season bored and disillusioned, wanting nothing more than the sanctuary of her secret library in her father’s hermitage. When she finds her sacred space occupied by a handsome and enigmatic hermit, she decides to set aside her passion for reading and invest that energy in something infinitely more pleasurable: remaking the common hermit into a gentleman and a romantic interest for her recently jilted friend.The Earl of Westbridge does his best to avoid Miss Gardiner, but she’s a force to be reckoned with, and soon he finds himself falling in love with her. But he knows that his love is ill-fated, for no respectable woman will have him once this unspeakable secret is revealed . . .Sharon Sobel is the author of ten historical and two contemporary romance novels. She also served as Secretary and Chapter Liaison of Romance Writers of America. Her short story, The Jilt , has been selected for inclusion in the second RWA anthology of romantic fiction. She has a PhD in English Language and Literature from Brandeis University and is an English professor at a Connecticut college, where she co-chaired the Connecticut Writers’ Conference for five years. An eighteenth century New England farmhouse, where Sharon and her husband raised their three children, has provided inspiration for either the period or the setting for all of her books.",
  "genres": [],
  "author": "Sharon Sobel",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/7193112-the-hermitage"
}