{
  "title": "Damaged Goods: Things You Must Know About Healing From Abuse",
  "description": "What's stopping you from acknowledging those feelings? From being your authentic self and living a truly happy life? From healing? For many, it's not feeling they deserve it or they simply don't know HOW.. This book is for you if you've ever experienced wanting more... Even if you think you've recovered from past abuse of any type, emotional, psychological, sexual, physical; chances are there may be unhealed wounds still lingering that cause behaviors you may not insecurity, unhappiness, jealousy, self-loathing, feeling unlovable, unworthy, low self-esteem. The list can go on...This book is NOT for you if you're happy with being stuck, living a lie, coasting through life wondering why others seem to have it better than you. Always wishing you could have more, be more, be loved, be happy, have great relationships- or even believe these things even exists... but you aren't ready to do anything about it. Don't buy this book if you're not interested in LIVING.But if you do want to heal, it's time YOU do. Because all that good stuff that happens to \"other people\", is possible for you too.Maybe your answer as to why you're still hurting from your past abuse is because you're treating the wrong thing... I was. Working on the symptoms of abuse is not going to heal abuse... It will only keep you spinning; asking yourself \"what's wrong with me?\" Until you realize this and understand HOW to heal, you will keep perpetuating the abuse and only putting a bandaid on an open wound by treating the symptoms.Start living your authentic truth... You will never be happy worrying about pleasing other people. Your purpose for being born is to live, to be ALIVE.\"Don't ask yourself what the world needs. Ask yourself what makes YOU come alive, and then go do it. Because what the world needs is people who have come alive.\" - Harold Thurman Whitman",
  "genres": [],
  "author": "Tammy Lang",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/13031613-damaged-goods"
}