{
  "title": "Pretty Little Things",
  "description": "Thirteen-year-old Lainey Emerson is the middle child in a home police are already familiar her mother works too much and her stepfather favors his own blood over another man’s problems—namely Lainey and her wild older sister, Liza. So when Lainey does not come home from a Friday night out with her friends, it is dismissed by the Coral Springs P.D. as just another disillusioned South Florida teen running away from suburban drama and an unhappy home life. But FDLE Special Agent Bobby Dees, who has headed up the Department’s difficult Crimes Against Children (CAC) Squad in Miami for more than a decade, is not quite so sure. Nicknamed “The Shepherd” by colleagues, he has an uncanny ability to find the missing and bring them back home— dead or alive. Haunted by the still-unsolved disappearance of his own daughter, Bobby recognizes the all too familiar up-swell inside him, the gut feeling that Lainey Emerson is no runaway. A search of her computer and a talk with her best friend reveal Lainey was involved in a secret internet relationship, spawned over a chat room, and nurtured through untraceable instant messages. Bobby fears she may be the victim of an online predator, and when chilling hand-painted portraits of other possible victims are mailed to a local television station, he realizes she may not be the only one. The faceless monster from cyberspace, who has gone to remarkable lengths to stay invisible, now seeks a captive audience. And it is Bobby Dees he wants watching. Can Bobby win this deadly game of cat and mouse, one involving the most prolific killer he has ever encountered? And will he be able to save Lainey and the others before it is too late?",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Contemporary"
  ],
  "author": "Jilliane Hoffman",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/7193563-pretty-little-things"
}