{
  "title": "Storied Independent Automakers: Nash, Hudson, and American Motors",
  "description": "With roots extending back to the first decade of the twentieth century, Nash Motor Company and the Hudson Motor Car Company managed to compete and even prosper as independent producers until they merged in 1954 to form the American Motors Company, which itself remained independent until it was bought in 1987 by the Chrysler Corporation. In Storied Independent Automakers,  renowned automotive scholar Charles K. Hyde argues that these companies, while so far neglected by auto history scholars, made notable contributions to automotive engineering and styling and were an important part of the American automobile industry.Hyde investigates how the relatively small corporations struggled in a postwar marketplace increasingly dominated by the giant firms of Ford, General Motors, and Chrysler, which benefited from economies of scale in styling, engineering, tooling, marketing, and sales. He examines the innovations that kept the independents' products distinctive from those of the Big Three and allowed them to survive and sometimes prosper against their larger competitors. Hyde also focuses on the visionary leaders who managed the companies, including Charles Nash, Roy D. Chapin, Howard Coffin, George Mason, George Romney, and Roy D. Chapin Jr., who have been largely unexamined by other scholars. Finally, Hyde analyzes the ultimate failure of the American Motors Company and the legacy it left for carmakers and consumers today.Storied Independent Automakers is based on extensive research in archival collections generated by the three companies. Residing in large part in the DaimlerChrysler Corporate Collection, these sources have been seldom tapped by other scholars before this volume. Auto historians and readers interested in business history will enjoy Storied Independent Automakers.",
  "genres": [],
  "author": "Charles K. Hyde",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/7199462-storied-independent-automakers"
}