{
  "title": "Ben Jonson: A Life",
  "description": "Ben Jonson's contemporaries admired him above all other playwrights and poets of the English Renaissance. He was the “great refiner” who alchemized the bleakest aspects of everyday life into brilliant images of folly and deceit. He was also a celebrated reprobate and an ambitious entrepreneur. David Riggs illuminates every facet of this extraordinary career, giving us the first major biography of Jonson in over sixty years.The story of Jonson's life provides a broad view of the literary procession in early modern England and the milieu in which Elizabethan drama was produced. Beginning as a journeyman actor, Jonson was soon a novice playwright; his first important play was staged in 1598, with Shakespeare in the cast. He was by turns the self-styled leader of a literary elite, a writer of court masques, the first dramatist to publish his own Works , a royal pensioner, and a genteel poet. As Jonson transformed himself from an artisan into a gentleman, his need to transcend his class origins led him to murder, to his notorious quarrels with Thomas Dekker, John Marston, and Inigo Jones, and to his lifelong rivalry with Shakespeare. Riggs traces the roots of Jonson's aggressiveness back to the turmoil of his childhood and adolescence. He offers new and convincing accounts of Jonson's latent hostility toward his bricklayer stepfather, his reckless marriage to Anne Lewis, and his conflicted relationships with his children.This vivid portrait synthesizes six decades of scholarship and new historical evidence. Sixty halftones beautifully illustrate the story and capture the spirit of the age. With Riggs' original interpretations of Jonson's masterpieces and lesser known works, Ben A Life will prove the standard account of this complex man's life and works for many years to come.",
  "genres": [
    "Biography",
    "British Literature"
  ],
  "author": "David Riggs",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/719925.Ben_Jonson"
}