{
  "title": "The White Witch",
  "description": "Set in England during the early years of the Civil War period, and concludes after the restoration of Charles II to the English throne. Most of the story takes place around a small English village in rural Oxfordshire, one like many others, with its church and squire’s manor house. As the tide of war ebbs and flows, its inhabitants must deal with the changes it brings and look within themselves for strength and courage.Froniga Haslewood is the white witch of the title, a wise-woman of two worlds, skilled in herb-craft and healing and gifted with unusual powers. She is not necessarily the main protagonist of the story, but she is its central point, the person who links all the other characters, both Puritan and Royalist. Froniga is the result of an impetuous, loving marriage between the son of a local squire and a Romanichal woman, a gypsy of the Heron clan. Froniga is a strong, independent woman of striking beauty, protected, as are her gypsy relatives, by the current squire, her cousin Robert. A place of safety is rare for the gypsy tribe, whose nomadic life is dogged by suspicion, persecution and violence.Robert has recently espoused the Puritan cause, under the auspices of his patron, Lord Hampden, but unknown to him two Royalist spies are at work in his demesne; Froniga’s love, Yoben, a mysterious, tormented man adopted by the gypsies, and Francis, Lord Leyland, a Catholic nobleman posing as a journeyman portrait painter. The fates of both spies become inextricably entwined with each other's, and with the lives of the Haslewood family.Despite being set during a time of war, “White Witch” is a novel about spiritual conflict and redemption rather than military action, though we do see battle several times from both Parliamentarian and Royalist points of view, through the eyes of Robert Haslewood and Francis, Lord Leyland - most notably, the first major battle of the Civil War at Edgehill. We also see many of the leading figures of the day; King Charles and Queen Henrietta Maria, the dashing, ruthless Prince Rupert, driven to frustration by the King’s cautious advisors, and the Parliamentarians, Lord Hampden and his cousin Oliver Cromwell amongst them.Goudge writes of this small world in vivid, luminous prose. Her descriptions of the natural world are redolent with divine mystery which at times verges on the pagan - the hand of the Goddess can be seen in the woodland spring which brings comfort and never runs dry, the unicorn which appears as a premonition of death in the Haslewood family and in the beneficent moonlight which blesses Froniga and her gypsy aunt, Madona.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Witches",
    "Historical",
    "Classics",
    "Romance",
    "Fantasy"
  ],
  "author": "Elizabeth Goudge",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/7205245-the-white-witch"
}