{
  "title": "The Collected Short Stories of Harriette Simpson Arnow",
  "description": "Harriette Simpson Arnow is an American treasure. Of the twenty-five stories in this collection, fifteen were previously unpublished. Until now, the short fiction of Arnow has remained relatively obscure despite the literary acclaim given to her novels The Dollmaker and Hunter’s Horn . These stories, written early in her career for the most part, reveal an artistic vision and narrative skill and serve as harbingers for her later work. They echo her interest in both agrarian and urban communities, the sharpening of her social conscience, and her commitment to creating credible and complex characters. This collection is organized against the backdrop of her life, from Kentucky in the 1920s to Ohio and Kentucky in the 1930s and to Michigan in the 1940s. As Arnow fans read these early gems, they will be led from gravel roads to city pavement and open layers of Arnow’s development as a novelist to expose the full range of her contributions to American literature.     In 1938, Esquire purchased \"The Hunters,\" which was eventually published as \"The Two Hunters,\" a chilling story of a seventeen-year- old boy’s confrontation with a deputy sheriff. At the time, Esquire did not accept submissions from women, and its editors had no idea that writer H. L. Simpson was not a man. Years later, she admitted in an interview, \"it worried me a little, that big lie, but I thought if they wanted a story, let them have it.\" Esquire paid her $125 for this story. The contributor’s notes at the back of the magazine include a photo of \"H.L.Simpson,\" actually a photo of one of her brothers-in-law. It was her little joke on a publisher that discriminated against women....—from the Introduction",
  "genres": [
    "Short Stories"
  ],
  "author": "Harriette Simpson Arnow",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/720149.The_Collected_Short_Stories_of_Harriette_Simpson_Arnow"
}