{
  "title": "The Secretary of Dreams, Volume Two",
  "description": "World Fantasy Award winner Cemetery Dance Publications, critically acclaimed artist Glenn Chadbourne, and New York Times bestselling author Stephen King are proud to announce The Secretary of Dreams (Volume Two). This second venture into the world of Stephen King's stories contains even more artwork and detailed illustrations that could only have come from the inspired hands of artist Glenn Chadbourne!The Secretary of Dreams (Volume Two) continues where the first acclaimed volume left off: combining classic tales of terror from the mind of Stephen King with the haunting artwork of Maine artist Glenn Chadbourne. This unique book displays an incredible and original blend of King's words with Chadbourne's one-of-a-kind B&W illustrations: text and artwork brought together to tell these chilling stories in a whole new way.As you venture into this new volume of The Secretary of Dreams you'll discover \"The Monkey,\" \"Strawberry Spring,\" and \"In the Deathroom\" presented on beautifully designed oversized pages. These stories are heavily illustrated with spot artwork, full page illustrations, and even multiple-page art spreads. Dozens of painstakingly crafted illustrations bring King's characters to life.Also within this collection are \"Gray Matter,\" \"One for the Road ,\" and \"Nona,\" which appear for the very first time in full graphic format as imagined by Chadbourne. Not one word from King's original manuscripts has been left out. Instead Chadbourne presents the stories through a variety of techniques: traditional paragraphs of text merged directly into the artwork, handwritten bursts of dialogue to convey emotion, and even multiple fonts to match the mood of each scene.Like the first volume of The Secretary of Dreams, this is a new collection of Stephen King's greatest short stories presented in a way never before imagined. Glenn Chadbourne has spent over two years creating the artwork within these pages, digging deep inside the text to make each of these classic tales burst off the page.An original Cemetery Dance Publications publishing event, this deluxe oversized hardcover edition is the World's First Edition and there are no other editions planned of this title at this time.",
  "genres": [
    "Horror",
    "Fiction",
    "Graphic Novels",
    "Short Stories",
    "Anthologies"
  ],
  "author": "Stephen        King",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/7204621-the-secretary-of-dreams-volume-two"
}