{
  "title": "Misadventures in Infidelity",
  "description": "Misadventures In Infidelity by Johnny StoneMisadventures in Infidelity is sexy string of stories revolving around a married woman’s untamed desires. Each story begins with a flashback, as Erin recalls her earlier days of infidelity. Erin Porter is a slut and a tease, she always has been. Nothing changed after she’s married, as she thought it would, except having a ring on her finger and a man who has no idea what she’s doing when he’s away from home.In A Rude Awakening, Erin gets together with friends for a night of carefree and innocent partying when her husband is away. She wakes up the next morning to discover she had a wild night of raunchy, unprotected sex with two men. Too bad she doesn’t remember it. Lucky for her there is a video that shows what a dirty whore she really is.During Mr. Harley and his Unwanted Guests, Erin makes a fledging effort to openly cheat on her husband, but hunting for guys isn’t as easy as she thought it would be. After meeting a rough and tumble biker at a strip club she’s convinced to enter a wet t-shirt contest with the promise of drinks if she loses. Things never work out for Erin the way she plans, and she gets much more then she bargained for, or was emotionally prepared to deal with.In The Working Girl, Erin is unexpectedly offered the job of becoming a house slave and sexual pet to the rich and powerful Miss Olivia Waters. In her desperation for money she accepts, despite what her humiliating ‘duties’ will entail. Everything at her Mistress’ mansion seems to be going well, as Erin gradually learns her place as an obedient submissive, but when the striking Mr. Olan enters the picture, finally acting on his desires for her, things really heat up!From the author of The Devil's Dance and Steam & Spurs, comes an entertaining collection of stories that have something for everyone. Scandalous cheating, lesbian sex, anal and oral sex, threesomes and more!",
  "genres": [
    "Menage",
    "Erotica",
    "Short Stories"
  ],
  "author": "Johnny Stone",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/13032431-misadventures-in-infidelity"
}