{
  "title": "This Dream Called Death",
  "description": "Stephen Janis is an awarding-winning investigative reporter. The urban crime scene is his beat. His engrossing, surreal novel, “This Dream Called Death,” is his second book.The fast-paced story is set in the decaying, crime-saturated and once-highly industrialized, “City of Balaise.” It’s a look into a grim, but maybe a not-too-distant future, where your worst fears of an ultra-controlling “Homeland Security-like” agency running amuck are a reality. Preventing crimes means the municipal bureaucrats, at the urgings of a paranoid “Deputy Mayor,” can check out your “dreams” for any “negative” thoughts, and if necessary, restrict your liberties.Janis told the audience at his book reading, on Feb. 18, 2010: “Baltimore is Balaise!” He once wrote for the now-defunct “Baltimore Examiner” and he’s currently part of the staff of the “Investigative Voice.” If you ask me, he looks like a character right out of HBO’s “The Wire.” Janis had his book-reading at the “Atomic Books” store in quirky Hampden, a neighborhood that the film-making icon, John Waters, used as a base for so many of his comic flicks, such as “Cry-Baby.” In fact, “Atomic Books” is also a “mail drop” for Waters! (I’m not making this up.)The unnamed narrator in “This Dream Called Death,” we learn from his memoirs, is a plodding bureaucrat in the “Bureau of Dreams,” aka as the “Bureau.” He’s charged with “reviewing dreams” in “district four, section three” of the city. If warranted, the narrator can grant or deny a “request for a waiver” for a dreamer slated for the dreaded “Waking Recidivist Complex”–the most severe form of therapy.In the beginning, the narrator doesn’t reflect on the moral or social implications of his work. To him, it’s just a job, a way to grind out a living. He says: “It is what it is.” However, he will soon be jarred by fate into embracing a totally different point of view.We learn that Blacks are targeted for “negative” dreams more than Whites. Dreams “about death” pose the highest threat to the deputy mayor. As for the media, well, don’t get your hopes up. Even the narrator refers to the evening news as, “Nightlies!”This pre-crime type of theme was popularized by Philip K. Dick in his short story, “The Minority Report,” which was later made into a sci-fi film (2002). It starred Tom Cruise. Another of Dick’s novels was the basis for the movie, “Blade Runner.”Here’s the narrator quoting the Deputy Mayor, on the day he took office: “This is no time for celebration…I am declaring ‘a state of emergency.’ A state of emergency born of the reality that Balaise is sick–a dying patient in need of surgery. And Balaise is dying because she is not safe.” He then has a huge banner, the size of the City Hall itself unfurled. It reads: “Be Conscious!”If I didn’t know any better, I’d would have thought the model for Janis’ deputy mayor was NYC’s gift to the absurd–that raving Neocon, Rudy Giuliani! He’s that same lock-them-all-up politico, whose inept and corrupt Police Commissioner, Bernie Kerik, just got four years in the federal slammer for tax evasion.However, closer to home, some might see a wee bit of ex-Baltimore City Mayor, now Maryland Governor, Martin O’Malley, in the persona of the overly-ambitious deputy mayor. When he was the City Hall boss, his disputed “arrest policy” led some innocent people, mostly in the Black community, to get police records, even though the charges against many of them were later dropped. O’Malley denied any wrongdoing on his part. Also, when he was mayor, his theme for the populous was–“Dream!”In any event, two of the keys that make “This Dream Called Death,” such a compelling read for me are; first: Janis knows what the hell he’s writing about and it shows in the details of his novel. He has experienced Balaise (read Baltimore) and its crime-drug-infested areas, along with its dysfunctional criminal justice system. And secondly: The dismal human conditions that Janis describes ring mostly true and, unless reversed, will create, for the generations to come, a living hell on earth. To some, tragically, that hell has already arrived.The sinister game plan of the screw-loose Deputy Mayor, who also suffers from a George W. Bush, Jr.-complex, can be reduced to this: He wants to “fix Balaise by fixing the dreams” of its citizens. He also wants the people to “believe” again. The demagogue vows to “declare war on those who do not ‘believe’” in order to “save” the city itself. Isn’t that like Dubya “saving” Iraq by destroying it?Consider also the narrator’s view of the bleak wasteland that is a huge part of a dying Balaise: “Tight brick courtyards gave way to large vacant weed-filled lots, pockets of dust and trash, molting dogs and rats. Barren stretches of naked land were punctuated by a lone structure, a shack wrestled into the ground.”I think the above fits right in as a metaphor for our country today, which is now subject to the “USA Patriot Act.” A place, too, where if the President labels you as an “enemy combatant,” you can then be locked away, indefinitely, without “due process of law,” and probably, end up being waterboarded as well. The celebrated author Naomi Wolf predicted that if the current administration does not undo all of the excesses of the Bush-Cheney Gang, America could easily slip into “a police state.”Janis builds his tale in one bone-chilling scene after another with a writing style of clipped sentences that suits the genre. His urban landscape descriptions are first rate. As the tension escalates, the character of the narrator evolves, too, into a much more sympathetic figure. As you begin to care about him, Janis takes you for a ride into a history, a nightmare, which I fear, may be only one more 9/11 incident away from becoming our reality!",
  "genres": [],
  "author": "Stephen Janis",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/7201564-this-dream-called-death"
}