{
  "title": "Voices of the Lost and Found",
  "description": "Voices of the Lost and Found is the first full-length collection of fiction from accomplished Metro Detroit writer Dorene O Brien. In eleven first-person stories, a variety of authentic and unexpected voices come to the forefront to confess or retell stories of lost innocence or betrayal from the urban graffiti artist who plots the downfall of a rival gang, to the middle-aged woman reliving a harrowing childhood abduction, to the young man who remodels his house in a misguided attempt to win back his wife, to the teenager who is lured into a crime spree after trusting a dark and disturbed friend.The startlingly real speakers of Voices of the Lost and Found are drawn directly from contemporary culture, and together they present a striking portrait of alienation, volatility, diversity, and violence in postmodern America. O Brien s characters inhabit diverse yet familiar landscapes, including abandoned buildings, convenience stores, university dorms, crisis intervention centers, Buddhist retreats, and psychiatrists offices. Here, the lonely and troubled characters face tremendous obstacles that will ultimately transform their lives. When they meet tragedy, as they often do, they are forced to confront their liability and the realization that faulty decisions have irrevocable consequences. Told with honesty and intense emotion, the stories allow readers to experience the full weight of each character s particular burden and to understand his or her complex personal motivations firsthand.Though the voices change, the tone of the collection is consistently strong and convincing, bringing forth a fresh perspective on both contemporary social issues and modern angst. This adventurous and memorable collection of short fiction will appeal to a diverse audience.",
  "genres": [],
  "author": "Dorene O'Brien",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/721656.Voices_of_the_Lost_and_Found"
}