{
  "title": "Being Logical: A Guide to Good Thinking",
  "description": "An essential tool for our post-truth world: a witty primer on logic—and the dangers of illogical thinking—by a renowned Notre Dame professorLogic is synonymous with reason, judgment, sense, wisdom, and sanity. Being logical is the ability to create concise and reasoned arguments—arguments that build from given premises, using evidence, to a genuine conclusion. But mastering logical thinking also requires studying and understanding illogical thinking, both to sharpen one’s own skills and to protect against incoherent, or deliberately misleading, reasoning.Elegant, pithy, and precise,  Being Logical  breaks logic down to its essentials through clear analysis, accessible examples, and focused insights. D. Q. McInerney covers the sources of illogical thinking, from naïve optimism to narrow-mindedness, before dissecting the various tactics—red herrings, diversions, and simplistic reasoning—the illogical use in place of effective reasoning.An indispensable guide to using logic to advantage in everyday life, this is a concise, crisply readable book. Written explicitly for the layperson, McInerny’s  Being Logical  promises to take its place beside Strunk and White’s  The Elements of Style  as a classic of lucid, invaluable advice.Praise for Being Logical“Highly readable . . . D. Q. McInerny offers an introduction to symbolic logic in plain English, so you can finally be clear on what is deductive reasoning and what is inductive. And you’ll see how deductive arguments are constructed.” — Detroit Free Press“McInerny’s explanatory outline of sound thinking will be eminently beneficial to expository writers, debaters, and public speakers.” — Booklist“Given the shortage of logical thinking,And the fact that mankind is adrift, if not sinking,It is vital that all of us learn to think straight.And this small book by D.Q. McInerny is great.It follows therefore since we so badly need it,Everybody should not only but it, but read it.”—Charles Osgood",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Logic",
    "Self Help",
    "Psychology",
    "Science",
    "Personal Development"
  ],
  "author": "D.Q. McInerny",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/721564.Being_Logical"
}