{
  "title": "Morevi: The Chronicles of Rafe and Askana",
  "description": "Off the coast of Ireland, concealed by fog and rock, is an area known to sailors as \"The Graveyard of Lost Ships.\" A twist of fate forces a lone privateer ship and its crew to discover in this Graveyard a rift in the space-time continuum and a realm known as Morevi, a landlocked kingdom shrouded by jungles and mystery. This kingdom falls under the rule of Askana Moldarin, known in her realm as \"The Black Widow\" following her swift and bloody ascent to the throne. An archaic regime of hardship, cruelty and ruthlessness inspires young Askana Moldarin to lead a revolution. The downfall of the old government is duly replaced by a rule of women, Askana crowned First Queen of Morevi. In the dawn of this New Age, the predatory neighboring kingdom of Eyrie and hidden traitors in her own regime threaten to destroy everything she has won. She knows that her kingdom hangs in a delicate balance and that someone close to the throne is about to move against her. Askana, independent of council, seeks help outside of Morevi to reveal the conspiracy against her... Enter Rafe Rafton, captain of the Defiant. With a sum agreed upon, Rafe devises a plan to smuggle the queen and her personal guards out of the city walls. Once in Eyrie the captain would begin to play Askana's own counter-intrigue. but his \"trusted Eyriener connections\" double-cross him. He had taken precautions, but the privateer does not escape unscathed. The Defiant returns to England in hope of winning the support of King Henry the VIII, but now it falls upon Askana to save the life of Rafe Rafton, the one-time outlaw of her realm, now her link to a new world and powerful allies. As Askana traverses The Rift, movement against HouseMoldarin begins in Morevi. Accusations against the queen are led by a young lady of House Annaki, Min-Lu. She leads her own campaign against the Black Widow and rallies the Council of a hundred Turi into a fervor, claiming that Askana Moldarin is about to lead them into one of the bloodiest ages of their country. Following her address, Min-Lu shares a private audience with High Lord Ruain, an enigmatic ally from Eyrie. Their hushed voices reseolve a pledge to gain control of Morevi. With reports of Rafe and Askana as \"guests\" of the Tudor King, the High Lord Ruain journeys across The Rift to fulfill his own agenda, an agenda independent of Min-Lu's and carried out under his true identity...",
  "genres": [
    "Fantasy",
    "Fiction",
    "Audiobook",
    "Science Fiction Fantasy"
  ],
  "author": "Lisa Lee",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/7218114-morevi"
}