{
  "title": "Hungry Ghosts",
  "description": "Longlisted for the Swansea University Dylan Thomas Prize“This is a deeply impressive book, and I think an important one. Its intensity, its narrative attack, the fascinations of its era and setting, make it impossible to tear the attention away. Energy and inventiveness distinguish every page.” — Hilary MantelFrom an unforgettable new voice in Caribbean literature, a sweeping story of two families colliding in 1940s Trinidad—and a chilling mystery that shows how interconnected their lives truly areTrinidad in the 1940s, nearing the end of American occupation and British colonialism. On a hill overlooking Bell Village sits the Changoor farm, where Dalton and Marlee Changoor live in luxury unrecognizable to those who reside in the farm’s shadow. Down below is the Barrack, a ramshackle building of wood and tin, divided into rooms occupied by whole families. Among these families are the Saroops—Hans, Shweta, and their son, Krishna, all three born of the barracks. Theirs are hard lives of backbreaking work, grinding poverty, devotion to faith, and a battle against nature and a social structure designed to keep them where they are.But when Dalton goes missing and Marlee’s safety is compromised, farmhand Hans is lured by the promise of a handsome stipend to move to the farm as a watchman. As the mystery of Dalton’s disappearance unfolds, the lives of the wealthy couple and those who live in the barracks below become insidiously entwined, their community changed forever and in shocking ways.A searing and singular novel of religion, class, family, and historical violence, and rooted in Trinidad’s wild pastoral landscape and inspired by oral storytelling traditions, Hungry Ghosts is deeply resonant of its time and place while evoking the roots and ripple effects of generational trauma and linked histories; the lingering resentments, sacrifices, and longings that alter destinies; and the consequences of powerlessness. Lyrically told and rendered with harrowing beauty, Hungry Ghosts is a stunning piece of storytelling and an affecting mystery, from a blazingly talented writer.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Literary Fiction",
    "Historical",
    "Thriller",
    "Novels"
  ],
  "author": "Kevin Jared Hosein",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/72092843-hungry-ghosts"
}