{
  "title": "Dennison's Bogie Book: A 1924 Guide for Vintage Decorating and Entertaining at Halloween and Thanksgiving",
  "description": "Originally published in 1922, this Bogie Book features the following ideas and suggestions for planning and decorating for vintage Halloween celebrations: Halloween auction bridge; party invitations; from cellar to attic; where to eat; supper in the witch's garden (with table layout suggestion); table decorations; the children's good time; children's party table; cafeteria supper; for the large affair; Halloween games including sailing walnut boats, apple paring charm, blowing out candles, cellar stairs test, and more; owl and pussy cat party; the dance (decorations and advertising ideas); ceiling decorations; decorative hints; halloween lanterns; matching partners; 12 costume ideas including instructions for making, and decorations for Thanksgiving.Centerpieces, favors and novelty suggestions and ideas fill this book as well as instructions for mounting crepe paper designs, making fringed crepe, sewing crepe, wrapping wires and fluting edges to make each of your projects a success. For Thanksgiving, the book illustrates a table layout and a great novelty idea with instructions for making a Jack Horner pie with little ribbons guests can pull revealing a personalized party favor. Other ideas are given including a pumpkin centerpiece, cup decorations, crepe paper flowers and more. The Dennison Bogie books featured amazingly creative displays of festooned crepe swags and garland, hanging decorations depicting witches, ghosts, scary pumpkins, black cats and other symbols we associate with Halloween as well as a vast array of games and favors. The Bogie Books were a great source for party planning, each year showing different ideas to match the new products being released by Dennison. They continue to be a great resource for party planning and provide interesting old-time party tips and suggestions. Sample book pages are shown at the top of this page. ***FOR MORE BOGIE BOOKS, please see our other listings***",
  "genres": [
    "Halloween"
  ],
  "author": "Dennison Manufacturing Company",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/7219309-dennison-s-bogie-book"
}