{
  "title": "The Knight, the Lady & the Priest: The Making of Modern Marriage in Medieval France",
  "description": "This ambitious study sets out to discover what marriage meant in the daily lives of the nobles of the tenth, eleventh, and twelfth centuries. Through entertaining anecdotes, family dramas, and striking quotations, Duby succeeds in bringing his subjects to life, making us feel as if we understand the motives and conflicts of those who inhabited the distant past.\"It is typical of Duby's modest spirit and his book-long concern with the ancient status of beleaguered wives that he ends his study with a 'We must not forget the women. Much has already been said about them. But how much do we really know?' Not everything, certainly, but far more than we did before the author began these charmingly erudite investigations.\"—Ken Turan, Time\"It is refreshing to find a historian who is always conscious that we simply do not know what or how people thought 1000 years ago. . . . Duby explains the complicated machinations of the medieval churchman and the paterfamilias in a scholarly but lively style.\"—Sarah Lawson, New Statesman\"Duby has written an extraordinarily rich book—a panoramic view of medieval marriage and the relations between men and women, full of arresting insights and human detail. . . . It is the work of a master historian at the peak of his powers on a subject of central relevance, compulsive and essential reading.\"—P. Stafford, British HistoryGeorges Duby (1919-1996) was a member of the Académie française and for many years held the distinguished chair in medieval history at the Collège de France. His books include The Three Orders; The Age of Cathedrals; The Knight, the Lady, and the Priest; Love and Marriage in the Middle Ages; and History Continues, all published by the University of Chicago Press.",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Medieval History",
    "France",
    "Religion",
    "Research"
  ],
  "author": "Georges Duby",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/721190.The_Knight_the_Lady_the_Priest"
}