{
  "title": "The Complete Guide to Asperger's Syndrome",
  "description": "The Complete Guide to Asperger's Syndrome is the definitive handbook for anyone affected by Asperger's syndrome (AS). Now including a new introduction explaining the impact of DSM-5 on the diagnosis and approach to AS, it brings together a wealth of information on all aspects of the syndrome for children through to adults.Drawing on case studies and personal accounts from Attwood's extensive clinical experience, and from his correspondence with individuals with AS, this book is both authoritative and extremely accessible. Chapters examine:* causes and indications of the syndrome* the diagnosis and its effect on the individual* theory of mind * the perception of emotions in self and others* social interaction, including friendships* long-term relationships* teasing, bullying and mental health issues* the effect of AS on language and cognitive abilities, sensory sensitivity, movement and co-ordination skills* career development.There is also an invaluable frequently asked questions chapter and a section listing useful resources for anyone wishing to find further information on a particular aspect of AS, as well as literature and educational tools.Essential reading for families and individuals affected by AS as well as teachers, professionals and employers coming in contact with people with AS, this book should be on the bookshelf of anyone who needs to know or is interested in this complex condition.'I usually say to the child, \"Congratulations, you have Asperger's syndrome\", and explain that this means he or she is not mad, bad or defective, but has a different way of thinking.' - from The Complete Guide to Asperger's Syndrome.",
  "genres": [
    "Nonfiction",
    "Autistic Spectrum Disorder",
    "Psychology",
    "Aspergers",
    "Self Help",
    "Science",
    "Parenting"
  ],
  "author": "Tony Attwood",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/72242.The_Complete_Guide_to_Asperger_s_Syndrome"
}