{
  "title": "Don't Eat the Marshmallow Yet! The Secret to Sweet Success in Work and Life",
  "description": "Learn how to achieve success—and eat your marshmallows, too—with this motivational, life-changing book.What explains the difference between success and failure? And what does it mean to you and your children?The answer lies in a landmark Stanford University study. Children were left in a room, each with a marshmallow, and given the choice of eating it then or fifteen minutes later, when they were promised an extra marshmallow as a reward for waiting. Some ate theirs right away. Others waited. But the study’s real significance came a decade later when the researchers discovered that the children who held out for the reward had become more successful adults than the children who gobbled their marshmallows immediately.The lesson wasn’t lost on Joachim de Posada, a world-renowned motivational speaker to thousands of corporate executives and professional athletes. The “marshmallow theory” answered a thirty-year quest to find a compelling explanation for why some people succeed and others fail. Posada was convinced that the key difference between success and failure is not merely hard work or superior intelligence but the ability to delay gratification. “Marshmallow resisters” achieve high levels of success while the rest of us eat all our marshmallows at once, so to speak—accumulating debt and dissatisfaction no matter what our occupations or incomes. But it doesn’t have to be that way.Using a simple parable and real-life examples (including basketball great Larry Bird and major league baseball catcher Jorge Posada, Joachim’s cousin), this book shows you how the moves you make today can pay off big tomorrow— if you just don’t eat the marshmallow…yet !",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Business",
    "Psychology",
    "Personal Development",
    "Audiobook",
    "Buisness"
  ],
  "author": "Joachim de Posada",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/722268.Don_t_Eat_the_Marshmallow_Yet_The_Secret_to_Sweet_Success_in_Work_and_Life"
}