{
  "title": "For Those I Loved",
  "description": "\"Those who cannot remember the past are condemned to repeat it.\" --George Santayana We need only to look back to Rwanda, and now to Darfur, to see that once again we are living the worst of times. Who better to guide our understanding and give us hope than Martin Gray--a man who survived the worst of times, flourished, and still managed to find joy in living? Martin has come full circle since his boyhood world was turned upside down by the German invasion of Poland in 1939. Overnight, the teenage Martin and his family were immersed in the horrors of the Holocaust and held captive in the Warsaw Ghetto. It was a nightmare of brutality, starvation, and death. Martin became a clever smuggler to help his family survive--until the \"butchers\" of Treblinka took his mother and brothers. Against impossible odds, Martin survived and returned to fight in the Warsaw Ghetto Uprising. As the Nazis incinerated the ghetto, he escaped to fight with the partisans, and then the Red Army. After the war, Martin made his way to New York. The cunning and skills he developed during the war enabled him to learn the language and create a successful business. At 35, he retired to France with a fortune and a beautiful Dutch wife, starting a family and living in happiness and peace. But his world was shattered once again by a forest fire that engulfed his fleeing family. In a tragic repeat of history, Martin alone survived. Martin Gray's past could be our future if we don't heed his call to be the change. In this 35th anniversary expanded edition of For Those I Loved, a book beloved by millions of readers worldwide, Martin reminds us that the past is connected to the present. Only we can ensure that history is not repeated. Martin Gray still lives in the South of France and has devoted his life to his family, writing, human rights, and environmental and cultural causes. He received the United Nations Dag Hammar­skjöld Award and the Gold Medal of European Merit.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Holocaust",
    "World War II",
    "France",
    "Memoir"
  ],
  "author": "Martin Gray",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/72266.For_Those_I_Loved"
}