{
  "title": "Dennison's Bogie Book: A 1923 Guide For Vintage Decorating And Entertaining At Halloween And Thanksgiving",
  "description": "Originally published in 1923, this Bogie Book features the following ideas and suggestions for planning and decorating for vintage Halloween and Thanksgiving Halloween party at your home; black cat party; when the refreshments are served; club Halloween banquet; gobolink gambol party; halloween party decorations; gay costumes are half the fun (for plans and instructions for more Halloween costumes, please see our Dennison Costume listings); decorating posts and balconies; lantern and chandelier decorations; hall bedecked for the Halloween party; Halloween dance; favors and features for the dance; Halloween games and stunts mermaid's fortune, three fates, stepping through a piece of paper, empty handed game, blind fate, murderer's dagger and more; harvest party; \"first Thanksgiving\" table decorations; Thanksgiving turkey table decorations; seasonable table decorations. Centerpieces, favors and novelty suggestions and ideas fill this book as well as instructions for making rows of petals or scallops in crepe, making fluted edges, making fringed crepe, and wrapping wires to make each of your projects a success. The Dennison Bogie books featured amazingly creative displays of festooned crepe swags and garland, hanging decorations depicting witches, ghosts, scary pumpkins, black cats and other symbols we associate with Halloween as well as a vast array of games and favors. The Bogie Books were a great source for party planning, each year showing different ideas to match the new products being released by Dennison. They continue to be a great resource for party planning and provide interesting old-time party tips and suggestions. Sample book pages are shown at the top of this page. ***FOR MORE BOGIE BOOKS, please see our other listings***",
  "genres": [
    "Halloween"
  ],
  "author": "Dennison Manufacturing Company",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/7219310-dennison-s-bogie-book"
}