{
  "title": "The Investigation",
  "description": "A wild, Kafka-esque romp through a dystopian landscape, probing the darkly comic nature of the human condition. The Investigator is a man quite like any other. He is balding, of medium build, dresses conservatively—in short, he is unremarkable in every way. He has been assigned to conduct an Investigation of a series of suicides (twenty-two in the past eighteen months) that have taken place at the Enterprise, a huge, sprawling complex located in an unnamed Town. The Investigator's train is delayed, and when he finally arrives, there's no one to pick him up at the station. It is alternating rain and snow, it's getting late, and there are no taxis to be seen. Off sets the Investigator, alone, into the night, unsure quite how to proceed. So begins the Investigator's series of increasingly frustrating attempts to fulfill his task. In the course of hours of wandering looking for the entrance to The Enterprise, he bumps into a stranger hurrying past and spills open his luggage, soaking his clothes. When he finally reaches the Enterprise, he is told he does not posses the proper authorization documents to enter after regular hours. Asking for directions to a hotel, he is informed \"We're not the Tourist Office,\" and must set off to find one himself. Time and time again, regulations hamstring him, street layouts befuddle him, and all the while he senses someone watching him, recording his every movement. In a highly original work that is both absorbing and fascinating, Claudel undertakes a sweeping critique of the contemporary world through a variety of modes. Like Kafka, Beckett, and Huxley, he has crafted a dark fable that evokes the absurdity and alienation of existence with piercing intelligence and considerable humor.",
  "genres": [
    "Fiction",
    "France",
    "Mystery",
    "Literature",
    "Crime",
    "Dystopia",
    "Roman"
  ],
  "author": "Philippe Claudel",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/13033956-the-investigation"
}