{
  "title": "The Exile Empire",
  "description": "Live. Run. The last message from Central Command was more a plea than an order, and running is exactly what the last remnants of humanity did to escape The Death as Earth was destroyed. Among the survivors is James Ursidae, a fearsome warrior whose despair now outweighs his expectations for the future. After months of drifting through intergalactic space, Ursidae and what humanity remains have found a spark of hope on the planet Lintalla and in the company of its native Illani. Unfortunately, starting anew comes at a price, and even in a strange system violence and war are a constant. A new enemy, the Tarin’Tal, hold the system’s inhabitants in a vice-like grip that continues to tighten. Can Ursidae and the Earthlings burn bright yet again and save their new world from the destruction they’d hoped to leave behind?This science fiction novel contains some of the most epic warfare you could ask for in a SciFi. By combining a style similar to Orison Scott Card with a practical, down to earth feel of Jim Butcher The Exile Empire throws you into a new world of real people, real machines, and real sci-fi action. If you enjoy the adventure and technology of science fiction but are tired of contrived drama and characters who act according to desires, motivations, and morals different then actual people then you will enjoy The Exile Empire. If you like advanced weaponry, technology, and gadgetry but are tired of unrealistic assumptions and deus ex machina application of indescribable concepts then you will enjoy The Exile Empire. The Exile Empire is jam packed with non-stop action pushing the reader to the edge of their metaphorical, literal, and digital seat. With alien armadas, incalculably powerful warships, antimatter, plasma, and energy weapons the Exile Empire has everything a scifi fan can ask for and more.Rather than rely only on endless grunt soldiers, or orbiting starships the Exile Empire takes a more practical look at life and warfare in the future.With machines and technology entwining every soldier and every aspect of life the Exile Empire takes a truly scientific look at fiction, building a practical world of might and mind. In the war for survival every life counts. If every life counts one must protect it with all one’s power, and in science fiction, that power can change the course of human events.\"",
  "genres": [
    "Science Fiction",
    "Space Opera"
  ],
  "author": "Joshua Done",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/7236682-the-exile-empire"
}