{
  "title": "Invisible City",
  "description": "\"As thrilling as a rollercoaster ride, this fantastical world of spies, spirits, ancient prophecies and hidden cities tests Josh to his limits...\" The Booktrust, 2009  by \"sci-fi author M.G. Harris, creator of the best-selling Joshua Files.\" Radio Times Magazine, 5th September 2013. Teenage Josh Garcia is propelled into an urgent race to find a lost book of the ancient Maya - the Ix Codex. Could the mysterious document, lost for centuries, contain the secret to surviving a prophecy of apocalyptic doom? Josh might be the only person alive who can find it - but there are forces out there who'll do anything to make the prophecy come true.  Can Josh survive long enough to unravel the secret of the missing codex?Invisible City is the first in a five-part action-adventure series for readers who love sci-fi thrills firmly grounded in a contemporary setting. This debut novel launched an author who later went on to work with Thunderbirds creator Gerry Anderson to develop Gemini Force One. \"Puppet-master Gerry Anderson conceived the story for Gemini Force One, but wasn't able to complete it due to the onset of Alzheimer's. The series of novels will now be written by sci-fi author MG Harris, creator of the best-selling Joshua Files.\" Radio Times Magazine, 5th September 2013.When his archaeologist father goes missing after an air crash in Mexico, UFO-obsessed Josh suspects alien abduction. He starts a blog to voice his fears and finds like-minded friends. But after he discovers his dad was murdered, Josh is caught up in a race to find the legendary Ix Codex - a lost book of the ancient Maya containing a prophecy about the end of the world.Praise for The Joshua Files - Invisible \"A splendid adventure story of UFOs, ancient Mayan documents and a lost city. The hero is eminently likeable, there is a splendid only-you-can-save-the-World denouement and you'll come away with a degree of esoteric knowledge about ancient Central America as well.\" Louisa Young, 23 March 2008, Mail on Sunday\"A fast-paced, first-person thriller. Her book's Mexico setting is richly evoked, and its historical and conspiracy elements are convincingly delineated.\" James Lovegrove, 2 Feb 2008, Financial Times\"A gripping survival story begins...a boy's fantasy of pyramids, caves and tunnels. Josh's quest for a long-lost Mayan text giving the key to salvation is bound up with his personal destiny in an unexpected way. But he is also, like all 13-year-olds, uncertain of what the future will bring. Harris cleverly captures this pivotal period.\" Carole Mansur, 15 March 2008, The Telegraph\"Indiana Jones would have stiff competition in young Joshua Garcia . . . This novel is well written, with the action unfolding at a fast and satisfying clip. This series is destined to be a hit...the many mysteries and unanswered questions will have the reader begging for the rest of the series. Highly Recommended.\" Library Media Connection, September 2010, starred review \"An exciting adventure and coming-of-age story with plot twists and cliffhanger chapter endings that will keep you up all night to finish .\"  San Jose Mercury News, 2010 \"MG Harris proves she has a deft touch and a real skill for writing heart-stopping adventure in her code-cracking debut The Joshua Invisible City. After finding a secret manuscript hidden in the back of a photograph frame, Josh is propelled into a high-speed chase across Mexico. Harris has paced this fast-moving adventure with expertise.\" Vanessa Curtis, 16 February 2008, The Glasgow Herald",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Adventure",
    "Mystery",
    "Science Fiction",
    "Fiction",
    "Novels"
  ],
  "author": "M.G. Harris",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/7241901-invisible-city"
}