{
  "title": "Rewriting the Soul",
  "description": "Twenty-five years ago one could list by name the tiny number of multiple personalities recorded in the history of Western medicine, but today hundreds of people receive treatment for dissociative disorders in every sizable town in North America. Clinicians, backed by a grassroots movement of patients and therapists, find child sexual abuse to be the primary cause of the illness, while critics accuse the \"MPD\" community of fostering false memories of childhood trauma. Here the distinguished philosopher Ian Hacking uses the MPD epidemic and its links with the contemporary concept of child abuse to scrutinize today's moral and political climate, especially our power struggles about memory and our efforts to cope with psychological injuries.What is it like to suffer from multiple personality? Most diagnosed patients are why does gender matter? How does defining an illness affect the behavior of those who suffer from it? And, more generally, how do systems of knowledge about kinds of people interact with the people who are known about? Answering these and similar questions, Hacking explores the development of the modern multiple personality movement. He then turns to a fascinating series of historical vignettes about an earlier wave of multiples, people who were diagnosed as new ways of thinking about memory emerged, particularly in France, toward the end of the nineteenth century. Fervently occupied with the study of hypnotism, hysteria, sleepwalking, and fugue, scientists of this period aimed to take the soul away from the religious sphere. What better way to do this than to make memory a surrogate for the soul and then subject it to empirical investigation?Made possible by these nineteenth-century developments, the current outbreak of dissociative disorders is embedded in new political settings. Rewriting the Soul concludes with a powerful analysis linking historical and contemporary material in a fresh contribution to the archaeology of knowledge. As Foucault once identified a politics that centers on the body and another that classifies and organizes the human population, Hacking has now provided a masterful description of the politics of memory : the scientizing of the soul and the wounds it can receive.",
  "genres": [
    "Philosophy",
    "Psychology",
    "Nonfiction",
    "History",
    "Psychiatry",
    "Medicine",
    "Anthropology"
  ],
  "author": "Ian Hacking",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/724142.Rewriting_the_Soul"
}