{
  "title": "الرجل الذي حسب زوجته قبعة",
  "description": "هذا الكتاب هو فريد من نوعه بحق، ألفّه طبيب الأعصاب المعاين في مستشفيات نيويورك، والكاتب ذو الأصل البريطاني، الشهير عالمياً بمؤلفاته العديدة والتي تعنى بدراسة حالات وتصرفات الأفراد الذين يعانون من اضطراب أو خلل وظيفي في أدمغتهم. \"يشكل المرضى محور عملي وحياتي\"، يقول في كتابه هذا، محدداً محيط عمله المهني والإنساني والذي يفرض عليه المعايشة اليومية والدائمة مع المرض الذي يثير فيه أسئلة \"جوهرية بطبيعتها\"، ومع مرضاه الذين يجرّونه \"باستمرار إلى السؤال\" الذي يجرّه بدوره باستمرار إليهم. لذا سيجد القارئ \"في القصص والدراسات التالية حركة مستمرة من هذا الاتجاه إلى ذاك\".قصص غريبة من واقع آخر غريب عن واقعنا الاعتيادي، وشخصيات تعيش كل منها في عالمها المتفرّد والخاص و\"الحقيقي\" لأنه نابع من حقيقة تفّرد عقل نعتبره \"أصيب بخلل\" لأن تركيبته باتت مختلفة عن تركيبة عقلنا الإعتيادي. يقص المؤلف حكايات غريبة عن أشخاص \"يمكننا القول أنهم مسافرون إلى بلاد لا يمكن تخيّلها\" -بلاد لا يمكن، بغير ذلك، أن تكون لدينا أية فكرة أو تصوّر عنها\". كالبحّار الضائع الذي فقد إحساسه بالزمن، يعيش سجين لحظة معينة متكررة على الدوام، وكالتوأم المتّخلف عقلياً والذي يملك القدرة الفائقة على القيام بالعمليات الحسابية بسرعة خيالية، وكالسيدة العجوز التي ترصد حركات المّارة على الطريق وتقوم بتضّخيمها لتصبح مخيفة ومرعبة، وكالرجل الذي يظن نفسه كلباً، وكالموسيقي فاقد القدرة على تمييز الأشكال، والذي ظنّ أن القبعة هي رأس زوجته، وغيرها من الشخصيات التي يروي المؤلف قصصها في أقسام الكتاب الأربعة.يؤكد الطبيب المؤلف على العلاقة المرّكبة بين الجسد والذهن والعقل، ويؤكد على أن توّحد عناصرها هو ما يشكّل الإنسان، فيطرح بذلك قضية الحاجة إلى طب جديد أكثر تكاملاً، والذي لا يعالج الجسد بمعزل عن الذهن والروح.كتاب لا بد من قراءته، للحصول على معرفة نادرة وعلى حقائق \"ولكن أية حقائق! وأية اقاصيص! وبماذا سنقارنها؟ قد لا تكون لدينا أية نماذج قائمة، أو استعارات أو أساطير. هل حان الوقت، ربما، لرموز جديدة، وأساطير جديدة؟\"",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Science",
    "Medicine",
    "Neuroscience",
    "Medical",
    "Short Stories"
  ],
  "author": "Oliver Sacks",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/7235945"
}