{
  "title": "For the Win",
  "description": "In the virtual future, you must organize to surviveAt any hour of the day or night, millions of people around the globe are engrossed in multiplayer online games, questing and battling to win virtual \"gold,\" jewels, and precious artifacts. Meanwhile, others seek to exploit this vast shadow economy, running electronic sweatshops in the world's poorest countries, where countless \"gold farmers,\" bound to their work by abusive contracts and physical threats, harvest virtual treasure for their employers to sell to First World gamers who are willing to spend real money to skip straight to higher-level gameplay.Mala is a brilliant 15-year-old from rural India whose leadership skills in virtual combat have earned her the title of \"General Robotwalla.\" In Shenzen, heart of China's industrial boom, Matthew is defying his former bosses to build his own successful gold-farming team. Leonard, who calls himself Wei-Dong, lives in Southern California, but spends his nights fighting virtual battles alongside his buddies in Asia, a world away. All of these young people, and more, will become entangled with the mysterious young woman called Big Sister Nor, who will use her experience, her knowledge of history, and her connections with real-world organizers to build them into a movement that can challenge the status quo.The ruthless forces arrayed against them are willing to use any means to protect their power—including blackmail, extortion, infiltration, violence, and even murder. To survive, Big Sister's people must out-think the system. This will lead them to devise a plan to crash the economy of every virtual world at once—a Ponzi scheme combined with a brilliant hack that ends up being the biggest, funnest game of all.Imbued with the same lively, subversive spirit and thrilling storytelling that made LITTLE BROTHER an international sensation, FOR THE WIN is a prophetic and inspiring call-to-arms for a new generation",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Young Adult",
    "Dystopia",
    "Audiobook",
    "Teen",
    "Gaming"
  ],
  "author": "Cory Doctorow",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/7241373-for-the-win"
}