{
  "title": "Steel Seduction",
  "description": "Under the Spell of Her Captor! Beautiful Jessica Condrum wants nothing more than to belong to a man, totally and completely. She dreams of submitting, of crawling naked and helpless to a strong master who will ruthlessly take what he wants from her, showing no mercy. Rejected by her philandering lawyer husband Robert, Jessy turns to the man's chief rival, Caesar Bustamonte. A former boxer, the muscular Caesar is more than happy to give the pretty little filly just the kind of working over she craves--again and again. The game soon turns real, however, as Robert employs former mercenary John Steel to teach his wayward wife a little lesson. Steel wants Condrum to represent his nephew on a trumped up murder charge and in exchange he will 'kidnap' Robert's wife to a remote mountain cabin for a few days of persuasive domination. The thoroughly professional Steel has no intention of falling for the curvy brunette, but having her in his grasp, not to mention his chains and ropes, proves to awaken not only his libido, but his heart as well. After a night of passionate love making, in which she confesses herself to be the man's slave, Jessy tricks Steel and runs off into the woods. The ex-commando easily tracks her. Using a switch, he inflicts justice on her bare behind as she hangs from a tree. More passion follows at which point Condrum himself calls and announces a slight change of plans. The man now wants his wife dead, and he expects Steel to do the deed. Steel must now decide between his nephew and the girl he's suddenly grown so fond of. Stalling for time, he kidnaps her for real, heading west. The pair is forced to elude a gang of sadistic bikers intent on Jessy's body as well as apair of Robert's hired killers. Will Steel be able to save her or will she fall victim to her own bottomless desire for submission?",
  "genres": [
    "Erotica",
    "BDSM",
    "M F Romance",
    "Romance",
    "Menage"
  ],
  "author": "Reese Gabriel",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/7236244-steel-seduction"
}