{
  "title": "Divine Intimacy: Meditations on the Interior Life for Every Day of the Liturgical Year",
  "description": "Divine Intimacy is undoubtedly the classic Carmelite work on meditation---a book that helps one arrive at intimate union with God by the practice of considering holy truths. It is a book that shows how to join prayer and action and put the Catholic doctrine on the spiritual life into practice daily. Divine Intimacy has been translated into all principal languages and has met with extraordinary success, bringing encouragement and spiritual profit to lay people as well as priests and religious. For each day of the year, Fr. Gabriel gives 1) a brief introduction, 2) a two-part meditation, followed by 3) a colloquy---holy acts of love, thanksgiving, petition, resolution, etc., addressed to Our Lord and based on the truths just meditated upon. About three pages are devoted to each day, so it reads quickly, and even the busiest person can use it regularly. The meditations for Sundays are based on the Sunday Gospel readings of the traditional liturgical calendar. Grounding his work on a firm Thomistic basis, Fr. Gabriel (1893-1953) draws from Sacred Scripture and the teachings of the great Carmelite Saints, including St. John of the Cross, St. Teresa of Avila, St. Therese of the Child Jesus and Blessed Elizabeth of the Trinity. His goal---marvelously achieved---is to cover the whole doctrine of the spiritual life in the course of a year. This is a lifetime book---one that is conceived to be used each day and to be read over and over. Divine Intimacy imparts an absolutely Catholic view of life and prepares the reader for the greatest possible union with God this side of Heaven. Made in U.S.A. No. 2107. 5 1/4\" x 8 1/4\" 1,227 Pp. Leatherbound.",
  "genres": [
    "Catholic",
    "Religion",
    "Spirituality",
    "Prayer",
    "Christianity",
    "Theology",
    "Nonfiction"
  ],
  "author": "Gabriel of St. Mary Magdalen",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/724457.Divine_Intimacy"
}