{
  "title": "Pinstripes: The Unknown Story of the World's Best Pinstriper",
  "description": "The craft of pinstriping dates back centuries, when carriages of royalty were painted with fine lines of exquisite detail and design.Twelve-year-old Derek Moody lives at The Greasy Spoon, a struggling roadside mart and garage. Over three days he learns that the man he calls \"Dad\" is not his father, and he meets Kelly Williams, the cute niece of a big customer. When the two are later caught behaving as curious adolescents, the Moodys lose the Williams business and Derek loses his new best friend.Anxious to make amends, Derek begins pinstriping customers' cars with seasoned expertise, skill he attributes to Kelly and their last encounter. He leaves home at 18, well on his way to fortune and fame.At a hot rod show he meets Cecil Caldwell, a Matchbox car vendor, and his personal life appears equally successful. Until a freak injury threatens his career at age 26.For anyone who ever grinned at a nicely-painted car, and everybody who never completely forget their first love, and anyone who ever knew the joy of a dog or the bliss of a dysfunctional family, Pinstripes is about trust and duplicity, faith and despair, cherry Chapstick and cherry-flavored pancake syrup.And the fine lines that separate all of them.After writing copy for the San Francisco offices of three international advertising agencies, John Frazier began freelancing in 1987. He has written for clients from almost all industries, including high technology, financial, automotive, publishing, food and consumer goods, and for virtually every medium. Clients have included Apple, IBM, AT&T, Hewlett-Packard, Blue Cross and Blue Shield, and Levi Strauss.After writing copy for the San Francisco offices of three international advertising agencies, John Frazier began freelancing in 1987. He has written for clients from almost all industries, including high technology, financial, automotive, publishing, food and consumer goods, and for virtually every medium. Clients have included Apple, IBM, AT&T, Hewlett-Packard, Blue Cross and Blue Shield, and Levi Strauss.For an even longer period of time, John has been fascinated by cars shiny and fast. He had his first Hot Wheels track as a young grade schooler, and attended the famed Oakland Roadster Show as a young teenager, providing his first serious look at mag wheels, chrome head covers and pinstriping, the fine lines of paint adorning the hottest of rods with flames and flourishes.Although his first car, a 1970 Plymouth Roadrunner, did not sport pinstripes, it did go fast. Among his favorite movies of the era were Vanishing Point and Dirty Mary and Crazy Larry, two tributes to muscle cars and man's insatiable need for speed.In his spare time John listens to too much Sinatra.",
  "genres": [],
  "author": "John Frazier",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/7247448-pinstripes"
}