{
  "title": "The Age of Deception: Nuclear Diplomacy in Treacherous Times",
  "description": "For the first time, the Nobel Prize laureate and \"man in the middle\" of the planet's most explosive confrontations speaks out--on his dealings with America, negotiations with Iran, reform and democracy in the Middle East, and the prospects for a future free of nuclear weapons.For the past two decades, Mohamed ElBaradei has played a key role in the most high-stakes conflicts of our time. Unique in maintaining credibility in the Arab world and the West alike, ElBaradei has emerged as a singularly independent, uncompromised voice. As the director of the UN's International Atomic Energy Agency, he has contended with the Bush administration's assault on Iraq, the nuclear aspirations of North Korea, and the West's standoff with Iran. For their efforts to control nuclear proliferation, ElBaradei and his agency received the 2005 Nobel Peace Prize.Now, in a vivid and thoughtful account, ElBaradei takes us inside the international fray. Inspector, adviser, and mediator, ElBaradei moves from Baghdad, where Iraqi officials bleakly predict the coming war, to behind-the-scenes exchanges with Condoleezza Rice, to the streets of Pyongyang and the trail of Pakistani nuclear smugglers. He dissects the possibility of rapprochement with Iran while rejecting hard-line ideologies of every kind, decrying an us-versus-them approach and insisting on the necessity of relentless diplomacy. Above all, he illustrates that the security of nations is tied to the security of individuals, dependent not only on disarmament but on a universal commitment to human dignity, democratic values, and the freedom from want.Probing and eloquent, The Age of Deception is an unparalleled account of society's struggle to come to grips with the uncertainties of our age.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "History and Politics"
  ],
  "author": "Mohamed ElBaradei",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/10328748-the-age-of-deception"
}