{
  "title": "Manning",
  "description": "From the early career of Indianapolis Colts quarterback Peyton Manning, and the early life of Giants quarterback Eli Manning, Manning provides a compelling look at football from the perspectives of two generations of players in the only family to claim four Superbowl victories and 18 Pro Bowl wins. Manning  is an autobiographical history of the football industry written by football legend Peyton Manning and his father, an all-star in his own right, Archie Manning.  At the time, one was an experienced and battle-scarred father, and the other was a son who has exploded on to the national scene as one of the best young quarterbacks in the history of the NFL.  Together, they take a hard look at their own careers and comb through all of American dissecting the big-money madness, race relations within the NFL (and in sports in general), the rituals of bribery that mark college recruiting, and fans who can no longer identify with the insatiable cash fever in pro sports. They discuss organizational sports and why white youngsters aren’t out there playing the game like they used to; the college game as compared to the pros; coaches, good and bad; and why the quarterback position is the most difficult one in all of sports. This is the story of Peyton's dizzying rise to the elite of the NFL, and the story of his father, himself a #1 draft pick for the New Orleans Saints in 1971, who harkens back to a time when football and gallantry were one and the same. Archie helps guide Peyton through the money, the endorsements, and the everyday life in the NFL. Meanwhile, Archie’s youngest son, Eli, picks up the gauntlet as he begins playing quarterback for Archie's alma mater, Ole Miss. MANNING is a truly personal and inspiring story of a family, a tradition and a legacy, providing a stirring multigenerational — and at times controversial — look at football over the past 50 years.",
  "genres": [
    "Sports",
    "Biography",
    "Nonfiction",
    "Football"
  ],
  "author": "Archie Manning",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/725096.Manning"
}