{
  "title": "The Invention of Enterprise: Entrepreneurship from Ancient Mesopotamia to Modern Times",
  "description": "A sweeping global history of entrepreneurial innovationWhether hailed as heroes or cast as threats to social order, entrepreneurs―and their innovations―have had an enormous influence on the growth and prosperity of nations. The Invention of Enterprise gathers together, for the first time, leading economic historians to explore the entrepreneur's role in society from antiquity to the present. Addressing social and institutional influences from a historical context, each chapter examines entrepreneurship during a particular period and in an important geographic location.The book chronicles the sweeping history of enterprise in Mesopotamia and Neo-Babylon; carries the reader through the Islamic Middle East; offers insights into the entrepreneurial history of China, Japan, and Colonial India; and describes the crucial role of the entrepreneur in innovative activity in Europe and the United States, from the medieval period to today. In considering the critical contributions of entrepreneurship, the authors discuss why entrepreneurial activities are not always productive and may even sabotage prosperity. They examine the institutions and restrictions that have enabled or impeded innovation, and the incentives for the adoption and dissemination of inventions. They also describe the wide variations in global entrepreneurial activity during different historical periods and the similarities in development, as well as entrepreneurship's role in economic growth. The book is filled with past examples and events that provide lessons for promoting and successfully pursuing contemporary entrepreneurship as a means of contributing to the welfare of society.The Invention of Enterprise lays out a definitive picture for all who seek an understanding of innovation's central place in our world.",
  "genres": [
    "History",
    "Economics",
    "Nonfiction",
    "Business",
    "Microhistory"
  ],
  "author": "David S. Landes",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/7250330-the-invention-of-enterprise"
}