{
  "title": "The Time in Between",
  "description": "The inspiring international bestseller of a seemingly ordinary woman who uses her talent and courage to transform herself first into a prestigious couturier and then into an undercover agent for the Allies during World War II.Between youth and adulthood...At age twelve, Sira Quiroga sweeps the atelier floors where her single mother works as a seamstress. At fourteen, she quietly begins her own apprenticeship. By her early twenties she has learned the ropes of the business and is engaged to a modest government clerk. But everything changes when two charismatic men burst unexpectedly into her neatly mapped-out life: an attractive salesman and the father she never knew.Between war and peace...With the Spanish Civil War brewing in Madrid, Sira leaves her mother and her fiancé, impetuously following her handsome lover to Morocco. However, she soon finds herself abandoned, penniless, and heartbroken in an exotic land. Among the odd collection of European expatriates trapped there by the worsening political situation back on the Continent, Sira reinvents herself by turning to the one skill that can save her: her gift for creating beautiful clothes.Between love and duty...As England, Germany, and the other great powers launch into the dire conflict of World War II, Sira is persuaded to return to Madrid, where she takes on a new identity to embark upon the most dangerous undertaking of her career. As the preeminent couturier for an eager clientele of Nazi officers’ wives, Sira becomes embroiled in the half-lit world of espionage and political conspiracy rife with love, intrigue, and betrayal.An outstanding success around the world, The Time in Between has sold more than two million copies and inspired the Spanish television series based on the book, dubbed by the media as the “Spanish Downton Abbey .” In the US it was a critical and commercial hit, and a New York Times bestseller in paperback. It is one of those rare, richly textured novels that enthrall down to the last page. María Dueñas reminds us how it feels to be swept away by a masterful storyteller.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Spain",
    "Book Club",
    "Historical",
    "Spanish Literature",
    "Romance"
  ],
  "author": "María Dueñas",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/13035138-the-time-in-between"
}