{
  "title": "The Everborn",
  "description": "Nicholas Grabowsky's award-winning, widely-praised aliens-among-us horror/science fiction epic, available for the first time packaged and edited the way it was intended to be!The Everborn concerns the offspring of fallen angels that have lived among us since the dawn of man. Throughout the ages, they live life after life in normal society until each one falls in love and fathers his own child. Before that child is born, they undergo a rapid degeneration into a fetal state before they disappear entirely and become reborn into a new life, essentially becoming their own fathers.All of them male, they live out their commonplace lives under the covert protection of Watchmaids, inter-dimensional female beings whose purpose is to ensure no harm comes to them under penalty of banishment into a state of eternal loneliness.When an Everborn is reborn as a set of twins, one a soulless serial killer on a quest to be born again into a sinless life and the other a kind-hearted ghostwriter for a world-famous rock-and-roll horror novelist, a banished Watchmaid claims her role in an ancient prophecy to use the soulless twin as a means to re-enter our world and bring about its destruction.Praise concerning The Everborn and its author:______________________________\"My Dear Nicholas: You seem to me---in a way that's entirely admirable----a man out of time. You're writing horror epics when the audience has become increasingly numbed by cinematic hokum and stale ideas. I SALUTE YOU: your ambition, your dedication, your achievements. I have no doubt in my mind that there is much, much more to come from your fertile and blissfully complex imagination, and I'll await the next work with much anticipation!\" ----Clive Barker (Hellraiser, director, producer, artist and bestselling author)“Grabowsky has melded Horror with Science Fiction with such expertise that I am left speechless. This is a novel of epic proportions and told in such a unique way that it defies explanation. By utilizing ideas from religious history, the reader is given a totally surreal reason for what UFOs really are and you will start to believe it’s true.”---Garry Charles, Gorezone Magazine \"Grabowsky's writing is at times touching and emotional, however, his real talent is his ability to infuse his writing with a sense of dread and loathing that I have not experienced since H.P. Lovecraft..........(a) unique and often terrifying world that Sacramento novelist Nicholas Grabowsky launches us into......(it) has the feel of an \"X-Files\" episode, at other very twisted turns it delves into the psychedelic. For those of us looking for something new in the alien horror genre, look not to the stars, but look to Nicholas Grabowsky's \"The Everborn.\" -----Tahoe Daily Tribune“Nicholas Grabowsky has succeeded in creating an entire world that is situated over our own, shading our every move with darkness and its ghostly alien presence....leaving the reader in utter astonishment as to the amazing detail that Grabowsky’s world has been created with. The detailed mythology that he creates with his alien forces ties together more than one earthly superstition, weaving a web that connects the world of the supernatural and the extraterrestrial.........the reader will be unable to get the terrifying and original visions out of their head!” ------Heidi Martinuzzi, E! Entertainment Television, Pretty/Scary.net\"Grabowsky exploits (the story) to explore concepts such as being, death & immortality in a fabulist world where more than a half-dozen major characters shift identities with Cronenberg-like regularity....a solid storyline, fresh ideas on everything from relationships to religion and blood-chilling violence makes Grabowsky's latest offering a compelling read!\" ----Sacramento News & Review***** 5 stars (highest rating) \"ALL HAIL GRABOWSKY! .....a captivating plot completely unique...with a story so imaginative and profound, even I was astounded....satisfying a reader's interest in alternative science fiction, classic horror, suspense and yes, folks, even gore. The atmosphere is complex, murky and entraps you. The style of writing is blunt, audacious and head-on.....this book rises above the average horror/science fiction novel!\" ------Horror-web.com\".....an amazingly original way to treat the done-to-death alien motif. (This) really is an outstanding book.....\" ----Garret Peck (Bram Stoker Award nominee, Personal Demons)“Nicholas Grabowsky has been around a while and I have read several of his books but this one will always remain my favorite as it is with most of his \"fans\". I say \"fans\" because once you begin reading his novels you will get hooked. He has a style unlike any other writer in this genre. He is really not just good at what he does - he is great! \"The Everborn\" is a classic and will be long read after he is gone from the face of this earth.”-----W. H. McDonald Jr., 128th Assault Helicopter Company (South Vietnam, 1966 & ’67, awarded The Distinguished Flying Cross, The Bronze Star, 14 Air Medals and the Purple Heart “...a well-crafted novel that seamlessly blends elements of horror and science fiction. This novel has it all: demons, apparitions, aliens, and serial killers. This novel will reach out and touch you on many levels and Grabowsky's compelling storytelling will have you reading well into the night, afraid to put it down.....------Holly Catanzarita, Sinisteria Magazine“THE EVERBORN is a terrifying collision of genetics-gone-wrong science fiction and they-are-already-here UFO thriller. This is a nail biter!”--Jonathan Maberry, New York Times bestselling author of DEAD OF NIGHT and ASSASSIN’S CODEGolden Award winner! Best Science Fiction Novel of 2004…..--American Author's Association, Northern California",
  "genres": [
    "Horror",
    "Fiction",
    "Fantasy",
    "Mystery",
    "Suspense",
    "Paranormal"
  ],
  "author": "Nicholas Grabowsky",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/7249771-the-everborn"
}