{
  "title": "Lycidas",
  "description": "Ein wahres Feuerwerk an Ideen brennt Christoph Marzi in seinem Romandebüt Lycidas ab. Wie das Titelbild schon sehr stimmungsvoll suggeriert, geht es in dem Buch um London und seine Geheimnisse. Diese sind viel unglaublicher als man das vor der Lektüre dieses Buches dachte. Auch der jungen Emily Laing, die unter erbärmlichen Verhältnissen im Waisenhaus des Mr. Dombey aufwächst, offenbaren sich nach und nach die Ungeheuerlichkeiten, die unter dem uns bekannten London verborgen sind. Emily’s Abenteuer beginnen damit, dass ihr eine sprechende, adlige Ratte begegnet. Als ein Werwolf ein anderes Kind aus dem Waisenhaus entführt, muss sie sich auf die Suche nach der Entführten machen. Ein Alchemist nimmt sie unter seine Fittiche. Auch ein Elf und ihre beste Freundin schließen sich der Suche an. Erst allmählich lernt Emily das Geheimnis ihrer Herkunft und der Uralten Metropole kennen und muss feststellen, dass es um mehr geht als nur um ein entführtes Kind.  Christoph Marzis Ideenreichtum ist überbordend. Er füllt seine Stadt unter der Stadt mit Wundern und Mythen aus aller Welt an. Luzifer, Seraphim und ägyptische Götter geben sich dort ebenso ein Stelldichein wie Elfen, Ratten, Spinnenmenschen, Werwölfe und Golems. Wer hätte gedacht, dass man mit einer geheimen Londoner Undergroundlinie geradewegs in Dantes Hölle fahren kann? Oder dass die Engel am Oxford Circus leben?  Durch diese bunte Welt führt Marzi seinen Leser mit einiger Sprachgewalt. Dabei klingt häufig sein Vorbild Charles Dickens an, dem er auch einen Gutteil der Namen für seine Figuren entnommen hat. Weitere Einflüsse -- wie zum Beispiel China Miéville -- sind nicht zu übersehen und machen aus dem Text ein Mosaik unterschiedlicher Stile und Erzählweisen, die schon auch mal für Verwirrung sorgen können. Alles in allem eine sehr eigenwillige Fantasy Geschichte, die abseits der herkömmlichen Pfade so manchen Reiz zu bieten hat. --Solveig Zweigle",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Young Adult",
    "Fiction",
    "German Literature",
    "Adventure",
    "Audiobook"
  ],
  "author": "Christoph Marzi",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1303536.Lycidas"
}