{
  "title": "Oryx and Crake",
  "description": "In Oryx and Crake, a science fiction novel that is more Swift than Heinlein, more cautionary tale than \"fictional science\" (no flying cars here), Margaret Atwood depicts a near-future world that turns from the merely horrible to the horrific, from a fool's paradise to a bio-wasteland. Snowman (a man once known as Jimmy) sleeps in a tree and just might be the only human left on our devastated planet. He is not entirely alone, however, as he considers himself the shepherd of a group of experimental, human-like creatures called the Children of Crake. As he scavenges and tends to his insect bites, Snowman recalls in flashbacks how the world fell apart. While the story begins with a rather ponderous set-up of what has become a clichéd landscape of the human endgame, littered with smashed computers and abandoned buildings, it takes on life when Snowman recalls his boyhood meeting with his best friend Crake: \"Crake had a thing about him even then.... He generated awe ... in his dark laconic clothing.\" A dangerous genius, Crake is the book's most intriguing character. Crake and Jimmy live with all the other smart, rich people in the Compounds--gated company towns owned by biotech corporations. (Ordinary folks are kept outside the gates in the chaotic \"pleeblands.\") Meanwhile, beautiful Oryx, raised as a child prostitute in Southeast Asia, finds her way to the West and meets Crake and Jimmy, setting up an inevitable love triangle. Eventually Crake's experiments in bioengineering cause humanity's shockingly quick demise (with uncanny echoes of SARS, ebola, and mad cow disease), leaving Snowman to try to pick up the pieces. There are a few speed bumps along the way, including some clunky dialogue and heavy-handed symbols such as Snowman's broken watch, but once the bleak narrative gets moving, as Snowman sets out in search of the laboratory that seeded the world's destruction, it clips along at a good pace, with a healthy dose of wry humor. --Mark Frutkin, Amazon.ca",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Dystopia",
    "Post Apocalyptic",
    "Fantasy",
    "Audiobook",
    "Book Club"
  ],
  "author": "Margaret Atwood",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/72586.Oryx_and_Crake"
}