{
  "title": "The Inferno",
  "description": "The Inferno, by Dante Alighieri, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. The Inferno remains literature’s most hallowed and graphic vision of Hell. Dante plunges readers into this unforgettable world with a deceptively simple—and now legendary—tercet:Midway upon the journey of our lifeI found myself within a forest darkFor the straightforward pathway had been lost.With these words, Dante plunges readers into the unforgettable world of the Inferno—one of the most graphic visions of Hell ever created. In this first part of the epic The Divine Comedy, Dante is led by the poet Virgil down into the nine circles of Hell, where he travels through nightmare landscapes of fetid cesspools, viper pits, frozen lakes, and boiling rivers of blood and witnesses sinners being beaten, burned, eaten, defecated upon, and torn to pieces by demons. Along the way he meets the most fascinating characters known to the classical and medieval world—the silver-tongued Ulysses, lustful Francesca da Rimini, the heretical Farinata degli Uberti, and scores of other intriguing and notorious figures.This edition of the Inferno revives the famous Henry Wadsworth Longfellow translation, which first introduced Dante’s literary genius to a broad American audience. “Opening the book we stand face to face with the poet,” wrote William Dean Howells of Longfellow’s Dante, “and when his voice ceases we may marvel if he has not sung to us in his own Tuscan.” Lyrically graceful and brimming with startlingly vivid images, Dante’s Inferno is a perpetually engrossing classic that ranks with the greatest works of Homer and Shakespeare.Features a map of Hell and illustrations by Gustave Doré. Peter Bondanella is Distinguished Professor of Comparative Literature and Italian at Indiana University and a past president of the American Association for Italian Studies. His publications include a number of translations of Italian classics, books on Italian Renaissance literature and Italian cinema, and a dictionary of Italian literature.",
  "genres": [
    "Classics",
    "Poetry",
    "Fiction",
    "Literature",
    "Religion",
    "Fantasy",
    "School"
  ],
  "author": "Dante Alighieri",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/725418.The_Inferno"
}