{
  "title": "Bomb Power: The Modern Presidency and the National Security State",
  "description": "From Pulitzer Prize-winning historian Garry Wills, a groundbreaking examination of how the atomic bomb profoundly altered the nature of American democracy and has left us in a state of war alert ever since.In Bomb Power , Garry Wills reveals how the atomic bomb transformed our nation down to its deepest constitutional roots-by dramatically increasing the power of the modern presidency and redefining the government as a national security state-in ways still felt today. A masterful reckoning from one of America's preeminent historians, Bomb Power draws a direct line from the Manhattan Project to the usurpations of George W. Bush.The invention of the atomic bomb was a triumph of official secrecy and military discipline-the project was covertly funded at the behest of the president and, despite its massive scale, never discovered by Congress or the press. This concealment was perhaps to be expected in wartime, but Wills persuasively argues that the Manhattan Project then became a model for the covert operations and overt authority that have defined American government in the nuclear era. The wartime emergency put in place during World War II extended into the Cold War and finally the war on terror, leaving us in a state of continuous war alert for sixty-eight years and counting.The bomb forever changed the institution of the presidency since only the president controls \"the button\" and, by extension, the fate of the world. Wills underscores how radical a break this was from the division of powers established by our founding fathers and how it in turn has enfeebled Congress and the courts. The bomb also placed new emphasis on the president's military role, creating a cult around the commander in chief. The tendency of modern presidents to flaunt military airs, Wills points out, is entirely a postbomb phenomenon. Finally, the Manhattan Project inspired the vast secretive apparatus of the national security state, including intelligence agencies such as the CIA and NSA, which remain largely unaccountable to Congress and the American people.Wills recounts how, following World War II, presidential power increased decade by decade until reaching its stunning apogee with the Bush administration. Both provocative and illuminating, Bomb Power casts the history of the postwar period in a new light and sounds an alarm about the continued threat to our Constitution.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "War",
    "Presidents",
    "Military Fiction"
  ],
  "author": "Garry Wills",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/7254108-bomb-power"
}