{
  "title": "The Stormchasers",
  "description": "Twins are forced to confront a violent secret from their past in Jenna Blum's first novel since her runaway bestseller, Those Who Save UsHow far would you go to protect a sibling-and at what cost to yourself?In Those Who Save Us , Jenna Blum proved herself a master storyteller with brilliant insight into the spectrum of human emotion. Now, Blum turns her sights to the most intimate and mysterious of family relationships-that between twins-in her powerful and provocative second novel.As a teenager, Karena Jorge had always been the one to look out for her twin brother Charles, who suffers from bipolar disorder. But as Charles begins to refuse medication and his manic tendencies worsen, Karena finds herself caught between her loyalty to her brother and her fear for his life. Always obsessed with the weather-enraptured by its magical unpredictability that seemed to mirror his own impulses—Charles starts chasing storms, and his behavior grows increasingly erratic . . . until a terrifying storm chase with Karena ends with deadly consequences, tearing the twins apart and changing both of their lives forever.Two decades later, Karena gets a call from a psychiatric ward in Wichita, Kansas, to come pick up her brother, whom she hasn't seen or spoken to for twenty years. She soon discovers that Charles has lied to the doctors, taken medication that could make him dangerously manic, and disappeared again. Having exhausted every resource to try and track him down, Karena realizes she has only one last chance of finding the storms. Wherever the tornadoes are, that's where he'll be. Karena joins a team of professional stormchasers-passionate adventurers who will transform her life and give her a chance at love and redemption—and embarks on an odyssey to find her brother before he reveals the violent secret from their past and does more damage to himself . . . or to someone else.Watch a Video",
  "genres": [
    "Fiction",
    "Contemporary",
    "Book Club",
    "Drama",
    "Adult",
    "Adventure",
    "Roman"
  ],
  "author": "Jenna Blum",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/7249506-the-stormchasers"
}