{
  "title": "This Is a Soul: The Mission of Rick Hodes",
  "description": "Dr. Rick Hodes arrived in Africa more than two decades ago to help the victims of a famine, but he never expected to call this extremely poor continent his home. Twenty-eight years later, he is still there. This is a Soul tells the remarkable story of Rick Hodes’s journey from suburban America to Mother Teresa’s clinic in Addis Ababa, Ethiopia.As a boy, Rick was devoted to helping those in need, and eventually he determined that becoming a doctor would allow him to do the most good. When he heard about famine in Africa, that’s where he went, and when genocide convulsed Rwanda, he went into the refugee camps to minister to the victims. When he was told that Ethiopia was allowing its Jews to emigrate to Israel, he went to help. While there, he was drawn to Mother Teresa’s mission in Addis Ababa. It was there that Rick found his calling when he began caring for the sickest children in one of the world's poorest countries. But he did more than that—he began taking them into his home and officially adopted five of them.Marilyn Berger went to Africa to write about Dr. Hodes, but while there, she became involved with the story. When she came upon a small, deformed, and malnourished boy begging on the street, she recognized immediately that he had the exact disease Rick could cure. She took him to Rick, who eventually arranged for the boy to have a complicated and risky surgery, which turned out to be incredibly successful. The boy’s story—intertwined with Rick’s, and Marilyn's as well—is unforgettable in its pathos and subtle humor.This is a Soul is not just a story of the savior and the saved, it is a celebration of love and wisdom, and an exploration of how charity and devotion can actually change lives in an overcrowded, unjust, and often harsh world.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Africa",
    "Ethiopia",
    "Medicine",
    "Adoption",
    "Health Care"
  ],
  "author": "Marilyn Berger",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/7263071-this-is-a-soul"
}