{
  "title": "Dominion",
  "description": "Sweet Revenge?When two senseless killings hit close to home, columnist Clarence Abernathy seeks revenge for the murders--and, ultimately, answers to his own struggles regarding race and faith. After being dragged into the world of inner-city gangs and racial conflict, Clarence is encouraged by fellow columnist Jake Woods to forge an unlikely partnership with a redneck homicide detective. Soon the two find themselves facing dark forces, while unseen eyes watch from above. This re-release of Randy Alcorn's powerful bestseller spins off from Deadline and offers a fascinating glimpse inside heaven.Can One Man's Search for Justice Stand Up to the Forces of Evil Threatening to Destroy Him? A shocking murder drags black newspaper columnist Clarence Abernathy into the disorienting world of inner-city gangs and racial conflict. In a desperate hunt for answers to the violence (and to his own struggles with race and faith), Clarence forges an unlikely partnership with redneck detective Ollie Chandler. Despite their differences, Clarence and Ollie soon find themselves sharing the same mission: victory over the forces of darkness vying for dominion.Filled with insight--and with characters so real you'll never forget them--Dominion is a dramatic story of spiritual searching, racial reconciliation, and hope.I don't know when I have read a novel that affected me so profoundly. Randy Alcorn has combined a superb mystery/detective story with a lesson in racial relations in America, gang dynamics and symbols, Christian values, and spiritual warfare. --Dave Kirby, Troy (Alabama) Broadcasting CorporationEven better than its predecessor...Alcorn's writing remains top-notch. --Sean Taylor, CBA MarketplaceREADER'S GUIDE INCLUDED Story Behind the BookRandy Alcorn thoroughly researched his characters, spending time in the inner city with homicide and gang detectives to better create the scenes for this bestselling novel. He set the story in his hometown of Portland, Oregon, and the main character, Clarence Abernathy, is a black journalist whose unforgettable father played baseball in the old Negro Leagues. Randy has received many letters from readers who assume he is African American due to his accurate portrayals of racial issues.",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Christian",
    "Mystery",
    "Thriller",
    "Novels",
    "Suspense"
  ],
  "author": "Randy Alcorn",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/7264.Dominion"
}