{
  "title": "Land of Sunshine, State of Dreams: A Social History of Modern Florida",
  "description": "From New Spain, to Old South, to New South, to Sunbelt, the story of how and why millions have come to Florida and created a megastate of constant social, cultural, and economic change.Florida is a story of astonishing growth, a state swelling from 500,000 residents at the outset of the 20th century to some 16 million at the end. As recently as mid-century, on the eve of Pearl Harbor, Florida was the smallest state in the South. At the dawn of the millennium, it is the fourth largest in the country, a megastate that was among those introducing new words into the American space coast, climate control, growth management, retirement community, theme park, edge cities, shopping mall, boomburbs, beach renourishment, Interstate, and Internet. Land of Sunshine, State of Dreams attempts to understand the firestorm of change that erupted into modern Florida by examining the great social, cultural, and economic forces driving its transformation.Gary Mormino ranges far and wide across the landscape and boundaries of a place that is at once America’s southernmost state and the northernmost outpost of the Caribbean. From the capital, Tallahassee--a day's walk from the Georgia border--to Miami--a city distant but tantalizingly close to Cuba and Haiti--Mormino traces the themes of Florida’s the echoes of old Dixie and a vanishing Florida; land booms and tourist empires; revolutions in agriculture, technology, and demographics; the seductions of the beach and the dynamics of a graying population; and the enduring but changing meanings of a dreamstate. Beneath the iconography of popular culture is revealed a complex and complicated social framework that reflects a dizzying passage from New Spain to Old South, New South to Sunbelt.",
  "genres": [
    "History",
    "Nonfiction",
    "American History"
  ],
  "author": "Gary R. Mormino",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/726414.Land_of_Sunshine_State_of_Dreams"
}