{
  "title": "Atlanta's Concealment of the Baby Gun Club Landfill",
  "description": "A concealment of any kind by our government to keep secrets of their criminal activities must not be tolerated especially when the government, in this case the municipality of the City of Atlanta trespasses on private properties and illegally dumps for years their hazardous waste. If they will do this, how can we the public, trust them with our drinking water 100% transparency is required! I've inscribed these pages after a number of alarming experiences dating back to the mid-1960s through present day. Imagine, all three levels of government have been and are allowing the ongoing concealment of a deeply massive hazardous illegal dumpsite. This site created by a dominant municipality, whose authoritative power extends throughout the entire Southeastern section of the USA. From 1960s through 2000, this city's illegal trespassed entirely upon private properties of low-income blacks who lived adjacent the notorious all-black Perry Homes Housing Project. This city disposed more than three hundred thousand cubic yards of hazardous waste there. To make matters worse, the city zealously concealed and deceived every effort to expose their illegal activities for more than two decades to present day. My efforts and litigations have been relentlessly thwarted for years, due to the city's predominant goal to obtain the last parcel of land they disposed waste thereon, which unfortunately I still own. The City of Atlanta's law department and Public Works department deceptive method of condemning only my four properties has left me no other choice but to write this book. Public safety and health concerns have yet to be considered by any government, concerning this illegal dumpsite, consistently releases contamination into the air and directly into state and national waterways. My eight years of investigations reveal extensive ongoing damage to the public and environment. The publication of these facts will give insight into the evidence that our government doesn't want revealed. Ultimately, there is no such law on the books that address a rogue government agency; therefore, we as citizens in the USA, are left helpless to concealment consequences of a never-ending contamination source affecting a minimum of three states and the Gulf of Mexico. This book aspired me to create the movement called Our Public Trust (OurPublictrust.com). We must unite globally to speak up and DEMAND TRANSPARENCY WHEN IT COMES TO OUR PUBLIC HEALTH AND SAFETY! May God protect us!",
  "genres": [],
  "author": "Jerry Brow",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/72619232-atlanta-s-concealment-of-the-baby-gun-club-landfill"
}