{
  "title": "Creeping Death from Neptune: Horror and Science Fiction Comics",
  "description": "Basil Wolverton s work refuses to die. Following a well-received exhibit of original art in New York City s Gladstone Gallery (which The New York Times called exuberantly grotesque ) came 2009 s publication of The Wolverton Bible (Fantagraphics Books). Though his comic book work has been reprinted endlessly, it has either been modernized with digital colors or presented in austere black and white. The time has come for a robust volume of Wolverton s comics taken from their original printed source the comic books themselves.A pioneer from the first generation of comic book artists, Wolverton arrived just as publishers began embracing original material, turning away from the newspaper-strip reprints that had been sustaining the industry since its inception our years earlier. One of the first to realize the value of in-house features was Centaur Publications, whose art director Lloyd Jacquet gave Wolverton his big break in comics in 1938, accepting Meteor Martin for Amazing Man Comics and Space Patrol for Amazing Mystery Funnies. Jacquet soon established an independent comics packager, Funnies, Inc., for which he asked Wolverton to invent a new science-fiction character. The artist came up with the iconic Spacehawk, who made thirty appearances in Target Comics. Prime examples of Wolverton s iconic space hero will be featured in Creeping Death from Neptune.Fed up with the publisher s constant meddling with Spacehawk, Wolverton dropped his creation in 1942 and concentrated on humorous features for the rest of the decade. His short-lived return to serious subjects in 1951 resulted in some of the most intense horror and science-fiction stories of the pre-code era, including the classics Brain Bats of Venus, Escape to Death, and Robot Woman, all of which appear in this volume.Created with the full cooperation of the Wolverton estate, Creeping Death from Neptune will also examine, for the first time, the artist s personal ledgers and diaries, shedding new light on his working methods and his day-to-day life as a freelance comic book artist. The digital restoration of the printed art will be performed with subtlety and restraint, mainly to correct registration and printing errors, with every effort made to retain the flavor of the original comic books.",
  "genres": [
    "Comics",
    "Biography",
    "Graphic Novels",
    "Horror",
    "Nonfiction",
    "Art",
    "Comix"
  ],
  "author": "Basil Wolverton",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/13035391-creeping-death-from-neptune"
}