{
  "title": "Unexpectedly, Milo",
  "description": "Milo Slade, a thirty-three year old home healthcare aide, is witnessing the rapid dissolution of his three-year marriage to a polished, high-powered attorney named Christine. Though Milo doesn't quite know the root of his marital problems, he inevitably blames himself, or more specifically, he faults the demands his obsessive compulsive personality place upon him—the need to open a jar of Smuckers grape jelly or sing “99 Luftballons” in front of an audience, to name just a couple.Yet Christine is still none the wiser about these inexplicable quirks as Milo has painstakingly hidden them from her and everyone else for years. No one knows the true—and in his mind more insidious—Milo, and such is the root of his profound loneliness, especially now that he and Christine are living apart during a trial separation.Then one day Milo stumbles across a video camera and tapes, left behind in a park. He watches the first tape, which is a heartfelt confessional by a young woman who begins to reveal her secrets, starting small at first, and finally revealing that she blames herself for a tragic death of a friend. But not all the details add up and Milo is struck with the urge to free the sweet confessor from her guilt. He is, after all, an expert in keeping secrets…In typical screwball fashion, Milo sets out on a cross-country journey to crack the case, but quickly gets sidetracked when he can no longer ignore the demands of his compulsions. But it is during these sidetracks that the true meaning of his adventure takes shape. Milo is weird, but as he discovers, so is everyone else. UNEXPECTEDLY, MILO is a humorous and touching novel about finding oneself, embracing the journey, and, unexpectedly, love.",
  "genres": [
    "Fiction",
    "Humor",
    "Mystery",
    "Contemporary",
    "Novels",
    "Mental Health",
    "Drama"
  ],
  "author": "Matthew Dicks",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/7264081-unexpectedly-milo"
}