{
  "title": "Tubes: A Journey to the Center of the Internet",
  "description": "“Andrew Blum plunges into the unseen but real ether of the Internet in a journey both compelling and profound….You will never open an email in quite the same way again.”—Tom Vanderbilt, New York Times bestselling author of Traffic When your Internet cable leaves your living room, where does it go? Almost everything about our day-to-day lives—and the broader scheme of human culture—can be found on the Internet. But what is it physically? And where is it really? Our mental map of the network is as blank as the map of the ocean that Columbus carried on his first Atlantic voyage. The Internet, its material nuts and bolts, is an unexplored territory. Until now. In  Tubes , journalist Andrew Blum goes inside the Internet's physical infrastructure and flips on the lights, revealing an utterly fresh look at the online world we think we know. It is a shockingly tactile realm of unmarked compounds, populated by a special caste of engineer who pieces together our networks by hand; where glass fibers pulse with light and creaky telegraph buildings, tortuously rewired, become communication hubs once again. From the room in Los Angeles where the Internet first flickered to life to the caverns beneath Manhattan where new fiber-optic cable is buried; from the coast of Portugal, where a ten-thousand-mile undersea cable just two thumbs wide connects Europe and Africa, to the wilds of the Pacific Northwest, where Google, Microsoft, and Facebook have built monumental data centers—Blum chronicles the dramatic story of the Internet's development, explains how it all works, and takes the first-ever in-depth look inside its hidden monuments. This is a book about real places on the their sounds and smells, their storied pasts, their physical details, and the people who live there. For all the talk of the \"placelessness\" of our digital age, the Internet is as fixed in real, physical spaces as the railroad or telephone. You can map it and touch it, and you can visit it. Is the Internet in fact \"a series of tubes\" as Ted Stevens, the late senator from Alaska, once famously described it? How can we know the Internet's possibilities if we don't know its parts? Like Tracy Kidder's classic  The Soul of a New Machine  or Tom Vanderbilt's recent bestseller  Traffic ,  Tubes  combines on-the-ground reporting and lucid explanation into an engaging, mind-bending narrative to help us understand the physical world that underlies our digital lives.",
  "genres": [
    "Nonfiction",
    "Technology",
    "Science",
    "Internet",
    "History",
    "Audiobook",
    "Computers"
  ],
  "author": "Andrew  Blum",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/13036199-tubes"
}