{
  "title": "The Shifting Tide",
  "description": "In her new masterpiece featuring private inquiry agent William Monk, New York Times bestselling novelist Anne Perry displays her prodigious writing talent. With insight, compassion, and a portraitist’s genius, Perry illuminates the shifting tide of emotions encompassing Queen Victoria’s London and the people who live there—aristocrats, brothel owners, thieves, Dickensian ruffians, and their evil keepers. She takes us through dangerous backstreets where the poor eke out their humble livings, and into the mansions of the rich, safe and secure in their privileged lives. Or so they believe. . . .William Monk knows London’s streets like the back of his hand; after all, they are where he earns his living. But the river Thames and its teeming docks— where towering schooners and clipper ships unload their fabulous cargoes and wharf rats and night plunderers ply their trades—is unknown territory.Only dire need persuades him to accept an assignment from shipping magnate Clement Louvain to investigate the theft of a cargo of African ivory from Louvain’s recently docked schooner, the Maude Idris . Monk is desperate for work, not only to feed himself and his wife, Hester, but to keep open the doors of Hester’s clinic, a last resort for sick and starving street women.But he Why didn’t Louvain report the ivory theft directly to the River Police? Why did he warn Monk not to investigate the murder of one of the Maude Idris crew? Even more mysterious, why has Louvain brought to Hester’s clinic a desperately ill woman who he claims is the discarded mistress of an old friend? Neither Hester nor Monk anticipates the nightmare answers to these questions . . . nor the trap that soon so fatefully ensnares them.In this magnificent novel, Anne Perry holds the reader spellbound, as Monk and Hester struggle to save themselves and their world from a catastrophe whose dimensions they can scarcely measure.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Fiction",
    "Historical",
    "Victorian",
    "British Literature"
  ],
  "author": "Anne Perry",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/72738.The_Shifting_Tide"
}