{
  "title": "Memoirs of a Geisha",
  "description": "According to Arthur Golden's absorbing first novel, the word \"geisha\" does not mean \"prostitute,\" as Westerners ignorantly assume--it means \"artisan\" or \"artist.\" To capture the geisha experience in the art of fiction, Golden trained as long and hard as any geisha who must master the arts of music, dance, clever conversation, crafty battle with rival beauties, and cunning seduction of wealthy patrons. After earning degrees in Japanese art and history from Harvard and Columbia--and an M.A. in English--he met a man in Tokyo who was the illegitimate offspring of a renowned businessman and a geisha. This meeting inspired Golden to spend 10 years researching every detail of geisha culture, chiefly relying on the geisha Mineko Iwasaki, who spent years charming the very rich and famous. The result is a novel with the broad social canvas (and love of coincidence) of Charles Dickens and Jane Austen's intense attention to the nuances of erotic maneuvering. Readers experience the entire life of a geisha, from her origins as an orphaned fishing-village girl in 1929 to her triumphant auction of her mizuage (virginity) for a record price as a teenager to her reminiscent old age as the distinguished mistress of the powerful patron of her dreams. We discover that a geisha is more analogous to a Western \"trophy wife\" than to a prostitute--and, as in Austen, flat-out prostitution and early death is a woman's alternative to the repressive, arcane system of courtship. In simple, elegant prose, Golden puts us right in the tearoom with the geisha; we are there as she gracefully fights for her life in a social situation where careers are made or destroyed by a witticism, a too-revealing (or not revealing enough) glimpse of flesh under the kimono, or a vicious rumor spread by a rival \"as cruel as a spider.\"  Golden's web is finely woven, but his book has a serious flaw: the geisha's true romance rings hollow--the love of her life is a symbol, not a character. Her villainous geisha nemesis is sharply drawn, but she would be more so if we got a deeper peek into the cause of her motiveless malignity--the plight all geisha share. Still, Golden has won the triple crown of fiction: he has created a plausible female protagonist in a vivid, now-vanished world, and he gloriously captures Japanese culture by expressing his thoughts in authentic Eastern metaphors.Running time: 18:09:13",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Romance",
    "Historical",
    "Book Club",
    "Adult",
    "Novels"
  ],
  "author": "Arthur Golden",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/727474.Memoirs_of_a_Geisha"
}