{
  "title": "The Filmmaker's Book of the Dead: How to Make Your Own Heart-Racing Horror Movie",
  "description": "In The Filmmaker's Necronomicon, or book of the dead, award-winning director Danny Draven unlocks the crypt and shows you how to translate your idea into a successful movie that gives your audience nightmares. Budget need not be a the real-world advice and experience from the author--plus a host of horror directors, producers, writers, cast, and crew--offer a variety of tips, short-cuts, and ideas for producing a quality movie on the cheap.It all starts with the story. You'll learn the storytelling elements that make a horror movie truly frightening to the audience, then master the process of making a horror film from concept to completion, avoiding the pitfalls along the way. This full-color, highly illustrated book also shows you the production techniques that add to the chill factor, including camera techniques, properly showcasing your star (the monster), creating atmosphere through music, adding tension through editing, and more.Distribution and marketing are covered in depth, so you can get your movie out there once you've made it. The book includes access to over an hour of video. Get inspiration and ideas * A 20 Minute behind-the scenes featurette from Danny Draven's new 2009 award winning film GHOST MONTH, coming soon from Lions Gate Entertainment. * A 10-minute behind-the-scenes featurette from Danny Draven's film CRYPTZ * A 10-minute behind-the-scenes featurette from Danny Draven's film DEATHBED * A 10-minute behind-the-scenes featurette from Danny Draven's film DARKWALKER * The Danny Draven Trailer Reel -- Trailers for all 6 feature films * Horror Script Samples (PDF files) -- Ghost Month and Cryptz* Write, produce, and distribute your own low-budget but high-quality horror film* Includes an hour of behind-the-scenes video footage and movie trailers!* Understand the horror genre, its conventions and expectations, so you can make a truly frightening movie",
  "genres": [
    "Nonfiction"
  ],
  "author": "Danny Draven",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/7268288-the-filmmaker-s-book-of-the-dead"
}