{
  "title": "Shoulder the Sky",
  "description": "In the firmament of great historical novelists, Anne Perry is a star of the greatest magnitude. First there were her acclaimed Victorian mysteries, sparkling with passion and suspense. Now readers have embraced this bestselling new series of World War I novels–which juxtapose the tranquil life of the English countryside with the horrors of war.By April of 1915, as chaplain Joseph Reavley tends to the soldiers in his care, the nightmare of trench warfare is impartially cutting down England’s youth. On one of his rescue forays into no-man’s-land, Joseph finds the body of an arrogant war correspondent, Eldon Prentice. A nephew of the respected General Owen Cullingford, Prentice was despised for his prying attempts to elicit facts that would turn public opinion against the war. Most troublesome to Joseph, Prentice has been killed not by German fire but, apparently, by one of his own compatriots. What Englishman hated Prentice enough to kill him? Joseph is afraid he may know, and his sister, Judith, who is General Cullingford’s driver and translator, harbors her own fearful suspicions.Meanwhile, Joseph and Judith’s brother, Matthew, an intelligence officer in London, continues his quiet search for the sinister figure they call the Peacemaker, who, like Eldon Prentice, is trying to undermine the public support for the struggle–and, as the Reavley family has good reason to believe, is in fact at the heart of a fantastic plot to reshape the entire world. An intimate of kings, the Peacemaker kills with impunity, and his dark shadow stretches from the peaceful country lanes of Cambridgeshire to the twin hells of Ypres and Gallipoli.In this mesmerizing series, Anne Perry has found a subject worthy of her gifts. Illuminating the murderous conflict whose violence still resounds in our consciousness–as well as the souls of men and women who lived it– Shoulder the Sky is a taut, inspiring masterpiece.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "World War I",
    "War"
  ],
  "author": "Anne Perry",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/72750.Shoulder_the_Sky"
}