{
  "title": "Angels in the Gloom",
  "description": "With this latest entry in a bestselling series that evokes all the passion and heroism of history’s most heartbreaking conflict–the war that was meant to end all wars–Anne Perry adds new luster to her worldwide reputation.Angels in the Gloom is an intense saga of love, hate, obsession, and murder that features an honorable English family–brothers Joseph and Matthew Reavley and their sisters, Judith and Hannah.In March 1916, Joseph, a chaplain at the front, and Judith, an ambulance driver, are fighting not only the Germans but the bitter cold and the appalling casualties at Ypres. Scarcely less at risk, Matthew, an officer in England’s Secret Intelligence Service, fights the war covertly from London. Only Hannah, living with her children in the family home in tranquil Cambridgeshire, seems safe.Appearances, however, are deceiving. By the time Joseph returns home to Cambridgeshire, rumors of spies and traitors are rampant. And when the savagely brutalized body of a weapons scientist is discovered in a village byway, the fear that haunts the battlefields settles over the town–along with the shadow of the obsessed ideologue who murdered the Reavleys’ parents on the eve of the war. Once again, this icy, anonymous powerbroker, the Peacemaker, is plotting to kill.Perry’s kaleidoscopic new novel illuminates an entire world, from the hell of the trenches to the London nightclub where a beautiful Irish spy plies her trade; from the sequestered laboratory where a weapon that can end the war is being perfected to the matchless glory of the English countryside in spring. Steeped in history and radiant with truth, Angels in the Gloom is a masterpiece that warms the heart even as it chills the blood.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "World War I",
    "British Literature"
  ],
  "author": "Anne Perry",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/72735.Angels_in_the_Gloom"
}