{
  "title": "Ignition City Volume 1",
  "description": "Where did the space heroes go to die? From Warren Ellis, the writer who reinvented science fiction in comics, in the alternate-world style of the award-winning Ministry Of Space and Aetheric Mechanics, comes a retropunk future of the past where spaceships still belched smoke and arguments were still settled with laser pistols. Grounded space pilot Mary Raven has come to the interzone settlement in the middle of Ignition City, Earth's last spaceport, to recover the effects of her dead father or so people think. Mary really wants to know how he died, and who did it. Mary Raven is out to spoil a great many people's days. Today might be her last day on Earth, trapped on the last spaceport where no-one cares about murder and the only real currency is fear. She has her dead father's raygun, and that's enough for space hero turned arms dealer Lightning Bowman to want her dead. But she also has her dead father's diary. And when she finds out something no-one else in the settlement knows... they'll want her dead for that, too! Featuring the art of Aetheric Mechanics' Gianluca Pagliarani, this full-color volume collects all five issues of the sci-fi epic with a gorgeous cover gallery full of design sketches, ray-gun fights and giant metal machines!Grounded space pilot Mary Raven has come to the interzone settlement in the middle of Ignition City, Earth's last spaceport, to recover the effects of her dead father -- or so people think. Mary really wants to know how he died, and who did it. Mary Raven is out to spoil a great many people's days.Today might be her last day on Earth, trapped on the last spaceport where no-one cares about murder and the only real currency is fear. She has her dead father's raygun, and that's enough for space hero turned arms dealer Lightning Bowman to want her dead. But she also has her dead father's diary. And when she finds out something no-one else in the settlement knows... they'll want her dead for that, too.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Science Fiction",
    "Steampunk",
    "Fiction",
    "Alternate History",
    "Comic Book"
  ],
  "author": "Warren Ellis",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/7276362-ignition-city-volume-1"
}