{
  "title": "Dark Assassin",
  "description": "For countless readers, one of life’s great pleasures is the mesmerizing magic of a Victorian mystery by New York Times bestselling author Anne Perry. Her dramas of good and evil unfolding inside London’s lavish mansions and teeming slums hold us spellbound. Now, in Dark Assassin, she sweeps us into a darkly compelling world that we never dreamed existed.A Thames River Police superintendent struggling to win the respect of his men, William Monk is on a patrol boat near Waterloo Bridge when he notices a young couple standing at the bridge railing, apparently engaged in an intense discussion. The woman waves her arms and places her hands on the man’s shoulders. A caress or a push? The man grasps hold of her. To save her or to kill her? Seconds later, the pair plunge to their death in the icy waters. Monk can’t help but wonder, was it an accident, a suicide, or a murder? It seems impossible to determine the truth, but haunted by the woman’s somber beauty, he is impelled to try.Mary Havilland was her name, and she had planned to marry Toby Argyll, the fair-haired man who shared her fate. Mary’s father, an engineer employed by the Argyll Company, had recently died–a suicide, according to the police and Mary’s sister. But Mary’s friends tell Monk that she suspected her father had been murdered because of his stubborn insistence that the Argyll Company’s current project–the construction of a splendid new sewer system for the metropolis–was so badly flawed that it put the entire city in peril from flood and fire.Monk is now faced with the mysteries of the three deaths. Aided by his intrepid wife Hester, he starts looking for answers and is soon treading a slippery path that takes him from the luxurious drawing rooms where powerful men hatch their unscrupulous plots to a world beneath the city where poor folk fight starvation. In nightmarish tunnels, Monk and Hester find true friends, among them Scuff, a young mudlark; Sutton the ratcatcher; and Snoot, Sutton’s clever terrier. For once, even Monk’s old enemy, Superintendent Runcorn, is on his side. As rainfall strains the fragile manmade underground, Monk must connect the clues before death strikes again.With characters as vivid as Dickens’s, gripping courtroom scenes, breathless horrors beneath the earth, and a plot that twists and turns toward a stunning denouement, Dark Assassin is absolutely one of Anne Perry’s best.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Fiction",
    "Historical",
    "Victorian",
    "Crime"
  ],
  "author": "Anne Perry",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/72755.Dark_Assassin"
}