{
  "title": "Outsmart The Unexpected: Grow Your Creativity The Edge-Of-Your-Seat Way",
  "description": "Take a Walk on the Creative Side of Your Mind!Outsmart the Unexpected is a collection of suspense-filled, no-time-to-lose, unusual, impossible predicaments where it's up to you to figure a way out of the fix the central character ultimately finds themselves in. How will things end? - Happily? In a twist? In more of a muddle?Use them to sharpen your ability to find creative solutions to sudden predicaments and strengthen your ability to think on your feet.In the course of life, problems may suddenly arise and they may sometimes be things you've never dealt with before. So your mental filing cabinet of experiences and skills can only partially assist in coming up with a solution. Most of the predicaments in this book you will hopefully never encounter. You'll need to apply your creativity and work the problem in order to find a solution. You won't just be able to grab onto the familiar. You'll also have to decide where your and the character's boundaries are -- what you're capable of mentally, morally, and emotionally when faced with a situation you didn't see coming.In some, you may need to suspend your disbelief to play along (Read that sentence one more time!). Some will make your head spin. Others may make your heart pound. Still others will make you go hmmm. But, all will stretch your brain and help you develop your creativity and ability to make successful decisions when there's little information to work with and you have to come up with a response in a hurry.Try your hand at inventing different endings and discussing and debating the possible solutions or interesting outcomes that you came up with. Your mission in reading this book (should you choose to accept it) is to put your creativity in overdrive and start thinking in different directions searching for possibilities.Do you think that the best solutions come from asking the right questions? Get your brain humming thinking up what those questions would be. Do you enjoy dreaming up your own endings? Let your imagination run wild. Dive in and bring your creative side with you!",
  "genres": [
    "Nonfiction",
    "Writing"
  ],
  "author": "Regina Pacelli",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/7275591-outsmart-the-unexpected"
}