{
  "title": "Death of a Stranger",
  "description": "Few authors have written more mesmerizingly about Victorian London than Anne Perry. Readers enter her world with exquisite anticipation, and experience a rich variety of characters and aristocrats living in luxury, flower sellers on street corners, ladies of the evening seeking customers on gaslit streets, gentlemen in hansom cabs en route to erotic diversions unknown in their Mayfair mansions. Now Perry gives her myriad fans the book they’ve been waiting for—the novel in which William Monk breaks through the wall of amnesia and discovers at last who he once was.DEATH OF A STRANGERFor the prostitutes of Leather Lane, nurse Hester Monk’s clinic is a lifeline, providing medicine, food, and a modicum of peace—especially welcome since lately their ailments have escalated from bruises and fevers to broken bones and knife wounds. At the moment, however, the mysterious death of railway magnate Nolan Baltimore in a sleazy neighborhood brothel overshadows all else. Whether he fell or was pushed, the shocking question in everyone’s mind What was such a pillar of respectability doing in a seedy place of sin?Meanwhile, brilliant private investigator William Monk acquires a new client, a mysterious beauty who asks him to ascertain beyond a shadow of a doubt whether or not her fiancé, an executive in Nolan Baltimore’s thriving railway firm, has become enmeshed in fraudulent practices that could ruin him.As Hester ventures into violent streets to learn who is responsible for the brutal abuse of her patients, Monk embarks upon a journey into the English countryside, where the last rails are being laid for a new line. But the sight of tracks stretching into the distance revives memories once stripped from his consciousness by amnesia—as a past almost impossible to bear returns, eerily paralleling a fresh tragedy that has already begun its inexorable unfolding.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Fiction",
    "Victorian",
    "Historical",
    "British Literature"
  ],
  "author": "Anne Perry",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/72771.Death_of_a_Stranger"
}