{
  "title": "Secrets of a Jewish Baker: Recipes for 125 Breads from Around the World [A Baking Book]",
  "description": "For more than twenty years, George Greenstein owned and operated a Long Island bakery that produced all sorts of baked goods, from all sorts of ethnic traditions—focaccia and Irish soda bread, Bavarian pumpernickel and naan—including many from his own culture, such as Jewish corn bread, challah, and bagels. His bakery was one of those neighborhood treasures where every weekday evening commuters picked up brown paper bags filled with a dozen Vienna rolls straight from the oven, and every weekend morning lines extended out the door for hours.In this James Beard Award-winning cookbook, Greenstein reveals 125 recipes for the yeasted and quick breads that have been handed down through his family by three generations of bakers—the breads that made his bakery so well-loved for so many years. And now that most neighborhood bakeries like Greenstein's are long since closed, this classic collection serves not only to teach bakers everywhere how to make those delicious, classic breads, but it also preserves authentic versions of the included Jewish recipes for all to enjoy.With the same helpful features that made this a cherished cookbook upon its original publication—separate instructions for mixing each recipe by hand, food processor, and stand mixer; tips for baking a week's worth of bread in as few as two hours; invaluable baker's secrets; and a very approachable style throughout—this revised edition also includes twelve new recipes to satisfy both old fans and new. So bring the spirit of that great old bakery back to life right in your very own kitchen, filling every room of your house with the wonderful aroma of freshly baked bread. And rest assured you'll bake with ease and success every time, thanks to George and his long-learned, very happily shared SECRETS OF A JEWISH BAKER.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Jewish"
  ],
  "author": "George Greenstein",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/728049.Secrets_of_a_Jewish_Baker"
}