{
  "title": "Bitter Chocolate: Child Sexual Abuse in India",
  "description": "A book that challenges our notions of family honour and morality. Sometime, somewhere, the conspiracy of silence around Child Sexual Abuse (CSA) in Indian homes had to be shattered. This path-breaking book—the first of its kind in the country and subcontinent—attempts to give that sexually abused child a powerful voice. It provides damning disclosures about men, and some women, in middle and upper-class families who sexually abuse their children, then silence them into submission. Based on studies, reports and investigation, this book reveals that a minimum of 20% of girls and boys under the age of 16 are regularly being sexually abused; half of them in their own homes, by adults who have the child's trust. In Bitter Chocolate, journalist and best-selling author Pinki Virani travels across the country to record the testimonies of the police, doctors, child psychologists, mental health professionals, social workers, lawyers and the traumatized victims themselves. The book opens with an account—brave and devoid of self-pity—of the author's own experience. Going beyond blaming, Pinki Virani then proceeds with her insightful analysis of the issue in three notebooks. The first spells out what constitutes CSA, why and how this happens, its devastating after-effects which haunt the victims as they grow into adulthood. The second notebook describes these effects through two real-life stories of women who were betrayed as children by men of their family. The third provides practical solutions on how to counter CSA, including a framework involving the law, the parent and their child. A special chapter addresses adults who have never before disclosed their sexual abuse as children. Plus: a nationally coordinated helpline. Accessible yet comprehensive, Bitter Chocolate is written for the young parent and guardian, principal and teacher, judge and police, lawyer and public prosecutor, teenager and tomorrow's citizen.",
  "genres": [
    "Nonfiction",
    "India",
    "Social Issues",
    "Feminism",
    "Indian Literature"
  ],
  "author": "Pinki Virani",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/727587.Bitter_Chocolate"
}