{
  "title": "Chicago Noir",
  "description": "\"The population of Chicago Noir is as diverse as any crowd at the lakefront fireworks show...As representative of Chicago as Oprah, MJ and a Gold Coast hot dog.\"--Chicago Sun-Times\" Chicago Noir asks us to consider whether Chicago is, specifically, a noir city and, more significantly, how noir plays out in the current landscape...Its stories push us to think about how noir might still be relevant beyond a bad-ass sort of nostalgia.\"--American Book Review\"Chicago shouts noir from the top of the Sears Tower to the nether regions of Wacker Drive, from the crime-ridden West Side to the moneyed taint of the North...Perhaps most impressive about Pollack's collection is the wide variety of writers selected to contribute.\"--Newcity\"The stories that editor Pollack has chosen to represent his former hometown vary wildly in voices, approaches and style...New interpretations, juxtaposed with classic structures, bring together the different faces of North and South, old and new.\"--TimeOut Chicago\"Marshaling the talents of eighteen award winning and acclaimed writers, most of whom have professional and/or personal ties to Chicago, Pollack . . . pays homage to the city that epitomizes the noir genre . . . Demonstrating crisp, riveting pacing, dialog redolent with sardonic despair, and dark, nihilistic atmosphere, nearly all the entries are stellar examples of noir at its best.\"--ForeWord\"The latest urban noir anthology provides the audience with eighteen delightful tales that pay homage to the ethnic neighborhoods and to the sports teams.\"--Midwest Book Review\" Chicago Noir is a highly readable story collection which offers numerous fresh, inventive takes on the well-worn noir genre . . . A very enjoyable effort overall.\"--Pete Lit\" Chicago Noir is a legitimate heir to the noble literary tradition of the greatest city in America. Nelson Algren and James Farrell would be proud.\"--Stephen Elliott, author of Happy Baby\"If ever a city was made to be the home of noir, it’s Chicago. These writers go straight to Chicago’s noir heart.\"--Aleksandar Hemon, author of Nowhere ManBrand new stories Neal Pollack, Achy Obejas, Alexai Galaviz-Budziszewski, Adam Langer, Joe Meno, Peter Orner, Kevin Guilfoile, Bayo Ojikutu, Jeffery Renard Allen, Luciano Guerriero, Claire Zulkey, Andrew Ervin, M.K. Meyers, Todd Dills, C.J. Sullivan, Daniel Buckman, Amy Sayre-Roberts, and Jim Arndorfer.The city of Chicago has spent much time and money over the last decade marketing itself as a tourist-friendly place for the whole family. It's got a shiny new Millennium Park, a spaceship in the middle of Soldier Field, and thousands of identical faux-brick condo buildings that seem to spring from the ground overnight. Chicago's rough-and-tumble tough-guy reputation has been replaced by a postcard with a lake view.But that city's not gone. The hard-bitten streets once represented by James Farrell and Nelson Algren may have shifted locales, and they may be populated by different ethnicities, but Chicago is still a place where people struggle to survive and where, for many, crime is the only means for their survival. The stories in Chicago Noir reclaim that territory.Chicago Noir is populated by hired killers and jazz men, drunks and dreamers, corrupt cops and ticket scalpers and junkies. It's the Chicago that the Department of Tourism doesn't want you to see, a place where hard cases face their sad fates, and pay for their sins in blood. These are stories about blocks that visitors are afraid to walk. They tell of a Chicago beyond Oprah, Michael Jordan, and deep-dish pizza. This isn't someone's dream of Chicago. It's not even a nightmare. It's just the real city, unfiltered. Chicago Noir .",
  "genres": [
    "Short Stories",
    "Fiction",
    "Noir",
    "Mystery",
    "Crime",
    "Anthologies"
  ],
  "author": "Neal Pollack",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/72830.Chicago_Noir"
}