{
  "title": "Hauntings and Other Fantastic Tales",
  "description": "Vernon Lee writes in the Preface to Hauntings, “My ghosts are what you call spurious ghosts... of whom I can affirm only one thing, that they haunted certain brains, and have haunted, among others, my own.” First published in 1890, Lee’s most famous volume of supernatural tales occupies a special place in the literature of the fantastic for its treatment of the femme fatale and the allure of the past, along with the themes of thwarted artistic creativity and psychological obsession. This collection, which includes the four stories originally published in Hauntings and three others, enables readers to consider Lee’s work anew for its subtle redefinitions of gender and sexuality during the Victorian fin-de-siècle.The appendices, which include extensive excerpts from writings by Lee’s predecessors and peers, including Algernon Charles Swinburne, Walter Pater, and Lee’s brother Eugene Lee-Hamilton, allow the reader to see how Lee takes on the themes and preoccupations of the late-Victorian period but adapts them to her own purposes.Preface to Hauntings (1890) -- Amour dure (1887, 1890) -- Dionea (1890) -- Oke of Okehurst (1886, 1890) -- A wicked voice (1887, 1890) -- Prince Alberic and the snake lady (1896) -- A wedding chest (1904) -- Preface to The virgin of the seven daggers (1927) -- The virgin of the seven daggers (1896, 1909,1927) -- Appendix A: From Algernon Charles Swinburne, \"Notes on designs of the old masters at Florence\" (1868, 1875) -- Appendix B: From Walter Pater, \"Pico della Mirandula\" (1871, 1873) -- Appendix C: From Walter Pater, \"Lionardo da Vinci\" (1869, 1873) -- Appendix D: Vernon Lee, \"Faustus and Helena: notes on the supernatural in art\" (1880, 1881) -- Appendix E: A. Mary F. Robinson, \"Before a bust of Venus\" (1881) -- Appendix F: Eugene Lee-Hamilton, \"The mandolin\" (1882) -- Appendix G: A. Mary F. Robinson, \"The ladies of Milan\" (1889) -- Appendix H: Eugene Lee-Hamilton, \"On a surf-rolled torso of Venus\" (1884, 1894) -- Appendix I: Vernon Lee, \"Out of Venice at last\" (1925).",
  "genres": [
    "Horror",
    "Short Stories",
    "Classics",
    "Fiction",
    "Gothic",
    "19th Century",
    "Victorian"
  ],
  "author": "Vernon Lee",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/728787.Hauntings_and_Other_Fantastic_Tales"
}