{
  "title": "Zero Percentile – Missed IIT Kissed Russia",
  "description": "Zero Percentile is not merely a book, but a pile of memories which everyone inadvertently carries with him. You identify with one character or the other and thus find bits of your own life in the story.It is a heady cocktail of the fascinating adventures of Pankaj, a less favoured son of destiny across two completely different countries, India and Russia.As a brilliant young boy Pankaj never imagines that he will ever be swamped with problems. Life with his friends Motu and Priya is fun. Always destined to go to IIT, a cruel accident makes him end up in a place he had never heard of before, Volgograd – a Russian ‘City of Heroes’, so-called for its role in the Second World War for stopping Hitler’s assault on Russia. At hostel, in Volgograd, life is entirely different. There, not brain but brawn rules, which makes him land in jail after being induced into a gruesome brawl over food, with other very powerful and aggressive hostellers. Desperate for a win, he masterminds a coup, but makes the Dean his enemy instead who becomes hell-bent on destroying him. The journey never eases for him after that. Under extreme peer pressure he tries hard to lose his virginity and then cope with the agony of his best friend Nitin getting infected with HIV. After his father’s death, he struggles to sustain himself in a highly expensive, newly capitalist Russia. His seniors, who he always looks upto as Gods unexpectedly turn into his enemy and conspire to ruin him with the help of the local mafia. He takes the gauntlet of fighting all these adversities and emerges victorious ultimately only to succumb to love.Zero Percentile does a few firsts in the history of fiction - Never before has IIT been written about from the perspective of someone who did not study there. Zero Percentile delves into this aspect and tells readers that there is life beyond IIT, beyond failure and you just need the courage to get on with it- Russia has always been portrayed as the enemy by the west. Zero Percentile takes a look at the humane side of the Russian society, a far cry from the evil people they are always shown as. The time explored in the book is the tumultuous 90s when Russia was converting from a communist to a capitalist state, one of the more turbulent times for their huge population trying to cope with the extreme changes brought about by the rapid transformation.- Interwoven in the story is the part about the lives of Russian War Heroes who were a part of the II world war and played a major role in stopping Hitler’s onslaught, an obscure fact not known much outside the Eastern Bloc. This part talks about Volgograd, one of the five ‘Hero Cities’ in Russia which had more than two million casualties in World War II.",
  "genres": [
    "Fiction",
    "India",
    "Indian Literature"
  ],
  "author": "Neeraj Chhibba",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/7289733-zero-percentile-missed-iit-kissed-russia"
}