{
  "title": "Through The Eyes of God",
  "description": "Through the Eyes of God exposes the people and places-community, family, friends, and workplace-that are responsible for feelings of unworthiness and self-hatred, which can lead to an identity crisis. This problem is universal, crossing all socioeconomic backgrounds, races, classes and genders, because we all have struggled at some point in our lives with the need to be validated by others. This book solves the problem and brings healing to the whole person-mind, body, and spirit.\"Through the Eyes of God will change how you look at your life. It deals with issues and battles we face within ourselves every day.\"Jean Holloway, author of Ace of Hearts and Black Jack\"Sheila L. Jackson tackles self-esteem issues head-on.\"Shelia M. Goss, national best-selling author of My Invisible Wife and Double Platinum\"Through the Eyes of God by Sheila L. Jackson will help you to see yourself in a better, more spiritual light. Great book.\"Lenora Worth, a Steeple Hill author\"Mrs. Jackson challenges the readers to take an honest and sometimes brutal look at how they truly perceive their own beauty and self-worth.\"Crystal Brown-Tatum, award-winning public relations consultant\"Sheila L. Jackson has penned a survival tool for men and women alike. With all the mixed messages from society and the media, the message from God has been lost. I recommend this book to everyone.\"TL James, author of The MPire Trilogy\"Jackson, with love and grace, ushers the reader into a self-examination that will enhance, transform, and revitalize their inner spirit.\"Pastor Danyelle Scroggins, author of Not Until You're ReadySHEILA L. JACKSON is the author of The Enemy Within and has penned many articles, such \"Only the Strong Survive,\" \"Count It All Joy,\" and \"Suffering in Silence.\" She lives in Shreveport, Louisiana, with her husband, Timothy, and two daughters, Brittany and Amber. Mrs. Jackson is an anointed speaker, teacher, and writer who utilizes her gifts to meet the needs of others. She serves as a missionary in her church and community, carrying the Word of God to those in need of spiritual soul food.",
  "genres": [],
  "author": "Sheila L. Jackson",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/7299533-through-the-eyes-of-god"
}