{
  "title": "The Politician: An Insider's Account of John Edwards's Pursuit of the Presidency and the Scandal That Brought Him Down",
  "description": "“The greatest political saga, the one that has it all, that gets to the real heart of American politics, is the John Edwards story... This isn’t just politics, it’s literature. It’s the great American novel, the kind that isn’t written anymore.” --Michael Wolff on John Edwards's trajectory, on VanityFair.com The underside of modern American politics -- raw ambition, manipulation, and deception -- are revealed in detail by Andrew Young’s riveting account of a presidential hopeful’s meteoric rise and scandalous fall. Like a non-fiction version of All the King’s Men , The Politician offers a truly disturbing, even shocking perspective on the risks taken and tactics employed by a man determined to rule the most powerful nation on earth. Idealistic and ambitious, Andrew Young volunteered for the John Edwards campaign for Senate in 1998 and quickly became the candidate’s right hand man. As the senator became a national star, Young’s responsibilities grew. For a decade he was this politician’s confidant and he was assured he was ‘like family.” In time, however, Young was drawn into a series of questionable assignments that culminated with Edwards asking him to help conceal the Senator’s ongoing adultery. Days before the 2008 presidential primaries began, Young gained international notoriety when he told the world that he was the father of a child being carried by a woman named Rielle Hunter, who was actually the senator’s mistress. While Young began a life on the run, hiding from the press with his family and alleged mistress, John Edwards continued to pursue the presidency and then the Vice Presidency in the future Obama administration. Young had been the senator’s closest aide and most trusted friend. He believed that John Edwards could be a great president, and was assured throughout the cover-up that his boss and friend would ultimately step forward to both tell the truth and protect his aide’s career. Neither promise was kept. Not only a moving personal account of Andrew Young’s political education, THE POLITICIAN offers a look at the trajectory which made John Edwards the ideal Democratic candidate for president, and the hubris which brought him down, leaving his career, his marriage and his dreams in ashes.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Biography",
    "Memoir",
    "History",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Andrew  Young",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/7299626-the-politician"
}