{
  "title": "The Twisted Sisterhood: Unraveling the Dark Legacy of Female Friendships",
  "description": "You know all about so-called \"mean girls\" and competitive, judgmental women. Maybe you had a cruel high school experience straight out of the movie Carrie . Maybe you find yourself anxious because your daughter's peers are excluding her. Maybe you've been harassed or marginalized by other females for being something they were fat, acne-prone, too pretty, not pretty enough, brainy, religious, anxious, overconfident, a different kind of mother. Maybe you have a difficult female boss or co-workers who are wreaking havoc on your ability to thrive or trust them in the workplace. Maybe you've shrugged it all off and That's just the way human beings sometimes operate , or I'm not going to feed the cultural or media stereotypes by whining about other women.  But have you ever considered what all this negativity is doing to our gender? The stories differ, and the consequences of our incivility range in severity, but one thing seems almost women carry powerful impressions and memories of their female-inflicted wounds. The hurt lingers.In The Twisted Sisterhood , Kelly Valen picks up where her arresting New York Times essay about a painful sorority encounter left off. Praised by the likes of Oprah magazine, Good Morning America , the Washington Post , Associated Press, Marie Claire and More magazines, among many others, TTS pulls back the curtain on the darker aspects of female relationships, revealing the troubling findings from her unique survey of more than three thousand women from all walks of life. Leaving males out of the equation for purposes of this book only, Valen reveals the demoralizing fallout of our shenanigans and shines a light on the paradox of women supporting -- and, often gratuitously -- sabotaging one another. Her interviews and research show that although women are often each other's best, most life-sustaining sources of support, there is a dark underbelly to female relationships worth exploring. The vast majority of women in Valen's survey, for example, report that although they have at least one girl-friendship they wouldn't want to live without, well over half still approach female camaraderie with a wariness or flat-out distrust and admit that they are unable--or unwilling--to extend themselves to certain types or groups of women. An overwhelming majority have endured serious knocks from other girls or women to explain this wariness. A staggering 97% of those polled believe it is crucial that we work to improve the female culture. Laying bare the legacy of the belittled \"girl wars\" across a woman's life, The Twisted Sisterhood  offers up groundbreaking research and anecdotal findings about the hidden, long-term effects of our manipulations, competitions, judgments, and outright bullying. Capturing the true attitudes of contemporary women, TTS gives voice to the lingering memories, ambivalence, and struggles so many of us quietly experience, and considers the net effect of our darker an increasingly inhospitable and dysfunctional society of women. Valen also looks to the future, offering hope and practical ideas for how girls and their mothers, women, and \"sisters\" can come together and improve their profoundly needed female connections. No matter how content or supported you feel with your current circle of girlfriends or colleagues, and no matter how placid a daughter's navigation of GirlWorld might appeaer, Valen explains, each of us holds a stake in listening to other's experiences and helping foster a more mindful civility within the gender.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Relationships",
    "Psychology",
    "Self Help",
    "Womens",
    "Friendship"
  ],
  "author": "Kelly Valen",
  "average_rating": "2.99",
  "url": "https://www.goodreads.com/book/show/7303644-the-twisted-sisterhood"
}