{
  "title": "By Heart: Poetry, Prison, and Two Lives",
  "description": "Judith Tannenbaum and Spoon Jackson met at San Quentin State Prison in 1985. For over two decades they have conferred, corresponded and sometimes collaborated, producing very different bodies of work resting on the same that human beings have one foot in darkness, the other in light. In this beautifully crafted exploration – part memoir, part essay – Tannenbaum and Jackson consider art, education, prison, possibility, and which children our world nurtures and which it shuns. At the book's core are two stories that speak for human imagination, spirit, and expression. Q&A with Judith Tannenbaum Co-author of By Poetry, Prison, and Two Lives How did you meet Spoon? I first came to San Quentin in 1985 to give a poetry reading to a small group of men. I was then asked to come back to teach and Spoon was part of our class from almost the beginning. He was my most intriguing student. Each week he constructed a circle of chairs he sat within, and for the first year, said nearly nothing. But he kept showing up. Why did you write this book? Spoon suggested that we write a two-person memoir. I’ve shared poetry with public school children and maximum security prisoners for over thirty-five years, and I welcomed the opportunity to describe both this work and the values it rests on. Also, I looked forward to memoir’s invitation to re-enter childhood, young motherhood, becoming a poet. Why a two-person memoir? Point-of-view is one of my deepest interests. Encouraging my capacity to see the world first from one perspective, and then from another, strengthens not only my vision, but also my heart. I loved that Spoon proposed a book in which we would tell our individual and shared stories in alternate chapters. By Heart seems to me stronger because it allows readers to move back and forth between Spoon’s experience and mine. Why should anyone read a book by a convicted murderer? One reason is practical. An enormous percentage of most state budgets goes to pay for prison; the public is asked to make many decisions about who is sent behind bars and for how long. We need every report we can get about this world we’re paying for. Practical, too, is that the best chance we have to prevent future violence is to hear from those who have known violence. Besides, people in prison are people. I believe our humanity is deepened when we open to the humanity of others. Do you have a main point you’d like a reader to take away after reading By Heart? Spoon writes about the many doors and windows through which a reader might enter our book. After so many years working in public schools and prisons, one main point for me is noticing which children our world nurtures and which it shuns. I hope readers of By Heart take away the recognition that all children are our children; I hope readers are encouraged to support, listen to, educate, and care for each child as they would for their own child. Q&A with Spoon Jackson Co-author of By Poetry, Prison, and Two Lives What are you in prison for? I was convicted of first degree murder. I have served thirty-two years for the killing and I take full responsibility for that loss of life. Do you have remorse? Every day, sometimes every moment. I messed up big time and I know I cannot bring back the life that I took. This is a forever wound on my soul and heart. But I can make sure my walk on Mother Earth for the rest of my life is one of service, peace, and love. Why did you write this book? Because I am a writer and I wanted to do a writing project with Judith Tannenbaum. Since the days we met at San Quentin in the 1980s, my dream has been for the two of us to do poetry readings and projects. Also, I hope the book will help me make amends for the wrong I did. Why should anyone read a book by a convicted murderer? Hopefully By Heart will open the eyes of, inspire, and detour wayward youth and others from the dark path that led me to prison. I know such is a reoccurring theme of authors who are serving, or have served, time in prison. Yet this kind of enlightenment is what happens sometimes when you wake up to the you want to do what is healing and self-rehabilitating. Do you think you deserve a second chance? No, I don’t think I deserve anything. Sometimes I think I owe my life for taking a life. My finding, or creating, redemption for the wrong I’ve done does not depend on my ever seeing the streets again. My hope and dream is that I’ve made amends and peace. I have not given up on getting out of prison. I have just let go and live as I live in the moment. If Mother Earth, karma, Goddess, God, the universe, or whatever forces govern love, life or time prefer that I spend the rest of my physical life behind bars, who am I to complain? Do you have a main point you’d like a reader to take away after reading By Heart? By Heart has many doors through which a reader can enter, and if someone doesn’t find a door, he or she can climb in through a window. One main point is that, as human beings, we all have one foot in darkness and one foot in light. I hope readers will feel that I’ve balanced my walk by creating By Heart .",
  "genres": [
    "Nonfiction"
  ],
  "author": "Judith  Tannenbaum",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/7305362-by-heart"
}