{
  "title": "Roman Dusk",
  "description": "Rome is crumbling. The child-emperor, Heliogabalus, diverts the Roman populace with parties, circuses, and celebrations, while his mother and grandmother jockey for power behind the scenes. The government is riddled with scandal and no business is conducted without bribes which grow ever larger. Religions joust for prominence, with factions of Christians seeking to overthrow the ancient Roman pantheon. Courtesans, once honored for their skills and protected by special guards, have become targets of opprobrium.The vampire Ragoczy Germanius Sanct' Franciscus, already subject to extra taxes and regulations because he is a foreigner, falls under the maleficent eye of Telemachus Batsho, a minor functionary who dreams of power and wealth. When Franciscus thwarts his attempts to extort ever-increasing sums from a young Roman of good birth, Batsho swears revenge. Franciscus finds his activities closely monitored and is accused of treason and conspiracy. His friends, threatened with similar scrutiny, abandon him to Batsho's mercies or urge him to leave the Eternal City.But Franciscus has many ties to Rome. He has taken under his protection a beautiful courtesan who was brutally beaten by the very men who should have been protecting her. She has been the vampire's sustenance for many months.Franciscus is also held in the city by the plight of the family Laelius. The Domina's health is failing despite the vampire's great medical skills; her son has converted to Christianity and rails against his mother's beliefs; her daughter Ignatia, who has sacrified her own life to care for her mother, realizes that when her mother dies, her fate will rest in the hands of her increasingly fanatical brother.Determined to claim pleasure for herself, Ignatia invites Franciscus's attentions, inflaming him with the power of her untapped sexuality. Unfortunately, they are not unobserved, and their simple yet powerful act of love sparks a conflagration that destroys Ignatia's family and nearly brings about the vampire's True Death.",
  "genres": [
    "Vampires",
    "Historical Fiction",
    "Horror",
    "Historical",
    "Fiction",
    "Fantasy",
    "Italy"
  ],
  "author": "Chelsea Quinn Yarbro",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/73043.Roman_Dusk"
}