{
  "title": "Conferences Are Murder",
  "description": "Lindsay Gordon, Scottish journalist and amateur sleuth, was the first creation of international bestseller Val McDermid. Report for Murder introduced the United Kingdom’s first lesbian detective, and the series has been perennially popular ever since. Lindsay is tenacious to the point of stubbornness, intrepid to the point of stupidity, and loyal to the point of laying her life on the line. With the support of friends, family, and lovers, she takes on the world with wit and brio, unraveling criminal conspiracies and unmasking murderers. She’s feisty, feminist, and funny. Each novel plunges Lindsay into a different milieu. Report for Murder is set against the backdrop of an exclusive girls’ boarding school; Common Murder features a women’s peace protest, where feelings run deadly; Deadline for Murder forces Lindsay to confront the darker side of her own world of journalism; Conferences Are Murder explores the deadly underbelly of trade unionism; Booked for Murder lifts the lid on publishing, showing it’s no longer a gentleman’s game; and Hostage to Murder brings Lindsay face-to-face with child custody battles and the gangsters who inhabit the world of terrorism. The hallmark of McDermid’s novels is a compassionate understanding of human relationships and a shrewd insight into contemporary society. The Lindsay Gordon novels have been published to great critical acclaim on both sides of the Atlantic. Booked for Murder , the fifth Lindsay Gordon mystery, was nominated for a Lambda Literary Award. McDermid has been praised for the way her storytelling interweaves the various elements of the novel into a seamless, balanced whole. “I don’t write about issues, I write about characters,” McDermid says. The books have won a wide general readership among fans of the mystery genre. Val McDermid grew up in a Scottish mining community and read English at Oxford. She lives in northern England.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "LGBT",
    "Audiobook",
    "Lesbian Fiction",
    "Lesbian"
  ],
  "author": "Val McDermid",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/1303836.Conferences_Are_Murder"
}