{
  "title": "Mexican Whiteboy",
  "description": "This is one of multiple covers/editions with ISBN 9780440239383.Newbery Award-winning and New York Times bestselling author Matt de la Pena's Mexican WhiteBoy is a story of friendship, acceptance, and the struggle to find your identity in a world of definitions.Danny is tall and skinny. Even though he's not built, his arms are long enough to give his pitch a power so fierce any college scout would sign him on the spot. Ninety-five mile an hour fastball, but the boy's not even on a team. Every time he gets up on the mound, he loses it.But at his private school, they don't expect much else from him. Danny is brown. Half-Mexican brown. And growing up in San Diego that close to the border means everyone else knows exactly who he is before he even opens his mouth. Before they find out he can't speak Spanish, and before they realize his mom has blond hair and blue eyes, they've got him pegged. But it works the other way too. And Danny's convinced it's his whiteness that sent his father back to Mexico.That's why he's spending the summer with his dad's family. But to find himself, he may just have to face the demons he refuses to see--the demons that are right in front of his face. And open up to a friendship he never saw coming.Matt de la Pena's critically acclaimed novel is an intimate and moving story that offers hope to those who least expect it. \"[A] first-rate exploration of self-identity.\" --SLJ\"Unique in its gritty realism and honest portrayal of the complexities of life for inner-city teens...de la Pena poignantly conveys the message that, despite obstacles, you must believe in yourself and shape your own future.\" --The Horn Book Magazine\"The baseball scenes...sizzle like Danny's fastball. Danny's struggle to find his place will speak strongly to all teens, but especially to those of mixed race.\" --Booklist\"De la Pena blends sports and street together in a satisfying search for personal identity.\" --Kirkus Reviews \"Mexican WhiteBoy...shows that no matter what obstacles you face, you can still reach your dreams with a positive attitude. This is more than a book about a baseball player--this is a book about life.\" --Curtis Granderson, New York Mets outfielderAn ALA-YALSA Top Ten Best Book for Young Adults A Junior Library Guild Selection",
  "genres": [
    "Young Adult",
    "Sports",
    "Realistic Fiction",
    "Fiction",
    "Contemporary",
    "Cultural",
    "Baseball"
  ],
  "author": "Matt de la Peña",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/7307555-mexican-whiteboy"
}