{
  "title": "قتل الأرانب",
  "description": "تصدير المؤلف\"ما يوحدنا أهم\"أكتب هذه الكلمات يوم 25 يوليو 2005 ، الشهر الذي قام فيهانتحاريون بضرب لندن بالقنابلِ والمتفجراتِ للمرة الأولى .الشعور العام في المملكة المتحدة في هذه اللحظة هو الحدسبأن مثل تلك الهجمات سوف تحدث أكثر وأكثر بشكل متكررفي المستقبل، وثمة كلام كثير وجدلٌ حول كيف يمكن السيطرةوالتعامل مع موقف يبدو جديدا كل الجدة على الشعب .المواطن الإنجليزي العادي يحاول أن يفهم ما الذي حدث كييصبح العالم على هذه الصورة، ويسأل نفسه أسئلة لم يسألهاحقيقة من قبل.الحاجة إلى تواصل البشر عبر حواجز الدين والعِرق، من أجلالالتقاء والسعي الحقيقي ليفهم بعضهم بعضا، لم يكن ملِحاوحتميا مثل الآن.أؤمن أن السرد القصصي –كلّ ألون الكتابة الإبداعية في واقعالحال – هو بالأساس معني بفكرة التواصل. الرغبة فيالاتصال والتواصل مع الآخرين هي أحد المحثات الأساسيةالتي تحرك حاجتي الخاصة للكتابة. من أجل ذلك كنتمبتهجا للغاية حينما أخبرتني الشاعرة المصرية فاطمة ناعوتعن عزمها على ترجمة مجموعة من قصصي إلى العربية،ومن ثم وافقت على الفور. أحببت الفكرَة، فكرَة أن تصلكلماتي إلى قراء أبعد من المتحدثين والناطقين بالإنجليزية،قراء آخرين نشئوا في بيئة وثقافة شديدتي الاختلاف عن بيئتيوثقافتي. وهذا ما سوف يكون عبر ترجمات قصصٍ مثل \"أحلام أسامة، أحوال المادة، البومة، الأشياء التي تركتِوراءك،\" وغيرها من القصص التي سوف تقرأونها الآن.لا أستطيع أن أوفي فاطمة شكرا من أجل كل هذا الجهد، وآملأن يحدث يوم وألتقي بها مباشرة كي أُظهر لها امتناني العميقشخصيا.قراء كثيرون أخبروني أن سردي القصصي يتمحور حولعلاقات بين أشخاص غير سعداء : أشخاص خبروا الفقدوالخسارة، أو هؤلاء الذين مروا بألم ما. ورغم أنني لا أبدأالكتابة بنية مسبقة عن إنتاج ذلك النوع تحديدا من القص، أوحين أشرع في رسم شخوص سردي – زوجان مفجوعان بفقدطفلتهما في \"البومة\" على سبيل المثال، أو هذان الرجلانالمحطمان في \"أحول المادة\" - إلا أنه من الواضح أن تلكالتيمات بالفعل تظهر بجلاء على سطح أعمالي مجددا ومجددا.حسنا، لقد قيل مرات عديدة أن الكّتاب لا خيار لهم إلا الكتابةعن آلامهم، وأن سرد وخيال الكاتب يخففان من ضغوطهوأزماته النفسية. أظن أن ذلك صحيح بالنسبة لي مثلما هوصحيح بالنسبة للكّتاب الآخرين.مع هذا أتمنى أن يجد القارئ شيئا أبعد من استكشاف الألم فيقصصي. أتمنى أن يجد مساحة من الأمل، بعض خيوطالبهجة التي لابد أن تمنحها الحياة رغم كل شيء . إذا مااستطاع قارئٌ أن يخرج من قصصي بشعور يقول إن الحياةرغم صعوبتها وتعنتها بوسعها أن تكون، بين وقت وآخر،شيئا مجيدا رائعا، شيئا يجب أن نرعاه ونعتز به، إذا استطاعذلك سأكون قد نجح ُ ت ككاتب.أرجو أي ضا أن أؤكد بطريقة ما عبر بعض قصص هذا الكتابعلى شيء أثق أنكم تعرفونه بالفعل جيد ا– أن البشر سواء فيكل أركان الأرض، بصرف النظر عن موقعهم، وجنسهم،وعِرقهم، ودينهم . يجب في النهاية أن نتعلم الدرس الجلي فيذاته : أن ما يوحدنا أهم بكثير جدا مما يشتتنا ويقسمن ا.وبمجرد أن نتعلم ذلك الدرس، يجب أن نعمل رأسا علىالاحتفال بحقيقة أننا جميعنا مخلوقات غير مكتملة، سوى أنناجميعنا نتشارك في شيء أهم: الإنسانية.لو أخفقنا في عمل هذا، سيلوح المستقبل موحشا بالفعل.من أجل ذلك يجب ألا نخفق.أشكركم على قراءة مجموعتي القصصية.جون ريفنسكروفت",
  "genres": [
    "Short Stories"
  ],
  "author": "John Ravenscroft",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/7311852"
}