{
  "title": "His Indecent Proposal",
  "description": "His Indecent ProposalErotic Romance/NovellaApproximately 21,000 wordsWhen Jenna Hardin is approached with a business proposition that involves a short-term marriage arrangement, she hesitatingly agrees. It doesn't take long before she realizes the business involved is only a smokescreen and she is the ultimate sat in first class and fiddled with the platinum band on her left ring finger. She watched David sitting next to her from the corner of her eye. His hand still held hers loosely even in sleep, his fingers laced between hers in a hold of ownership, a hold of possession that he had rarely allowed her away from the entire day.They were approaching the Greater Cincinnati airport and her mind raced over the day that had just passed. It was almost midnight, and everything had been accomplished in less than twenty-four hours. When they left his house that morning, the first thing they did was meet with his lawyer, and she had signed a pre-nuptial agreement. Then they had left to board a flight to Vegas, and the minute they had gotten there, he hustled her into a twenty-four hour wedding chapel. They were married quickly without benefit of rings, but he found a jewelry store when they left the chapel and had one on her finger with what to her now seemed to be an obscene lack of consideration and time. Leaving the jewelers, they went into a hotel restaurant and had a quick meal, and her mind shied away from what had happened next. They hadn't packed for an overnight stay, and she hadn't understood why he checked into the hotel after they ate. Her stomach had been tied in knots through the meal anyway, and apprehension and nerves screamed in her bloodstream as he pulled her by the hand up the elevators to a room.The minute the door had clicked shut, he turned to her and began unbuttoning her blouse. Panic attacked her and she put her fingers over his to stop him. \"What are y-you doing?\"He brushed her hands aside and continued to strip her. \"Consummating the marriage.\" His voice was harsh.\"Why? Can't w-we wait?\"\"No. I want it consummated now.\"Disturbed by what they were doing and his reasons for it, she tried to slow him down and lighten the atmosphere. \"Why?\" Her voice was soft, trying to soothe him. \"I'm not going anywhere.\"His eyes lifted from her buttons and tangled with hers. \"No. You can bet your ass you're not going anywhere.\" His voice dripped ruthless possession.Her pulse went spinning as he unhooked her bra and pushed it out of his way. He pulled her over to the king sized bed, and unhooked her skirt. \"Step out of it.\"Her mind in a daze at the speed of his movements, she stepped from her clothes and moved onto the bed. He quickly stripped and pushed her legs apart and climbed on top of her. Her heartbeat going wild, she spoke in a whisper of defiance. \"Just for two years.\"It was a mistake.His nostrils flared at her words and he grabbed her wrists and lifted them over her head. Holding her captive, he began to push into her. He stretched her completely, transferred her wrists to one strong hand, and lifted her face to his with the other. \"When I'm good and goddamn ready. And not a day before.\"",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "Novella",
    "Erotic Romance",
    "Short Stories"
  ],
  "author": "Lynda Chance",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/13038344-his-indecent-proposal"
}