{
  "title": "A Stranger's Wife",
  "description": "It Was Supposed to Be a Charade...With his big shoulders and bold ideas, Quinn Westin is hellbound to be the first governor of the newly-created state of Colorado. One obstacle stands in his way... the threat of scandal after his wife mysteriously runs off. But Westin has an audacious solution -- find a woman who is the spitting image of his vanished Miriam.They Weren't Supposed to Fall in Love.After 5 years in prison, Lily Dale finally wins her freedom...for a price. Under Westin's smoldering gaze, Lily slowly transforms from a rough frontier woman to the polished beauty fit for the arm -- but never the bed -- of a future governor. Never, that is, until Westin's searing touch overcomes her growing suspicions about her predecessor's true fate... and until hot, whispered words dangerously defy his carefully-written script.Setting: Colorado Territory, late 1800s Sensuality: 7 Lily Dale is no lady. In fact, she's spent the past five years in Yuma Women's Prison for aiding and abetting a holdup. Men have been her downfall her whole life, and when she's unexpectedly paroled from prison her only goal is to return to Missouri and to her 6-year-old daughter. But someone has pulled the strings to get Lily released from jail, and that someone wants a favor in return, namely her cooperation in impersonating another woman for the next seven months. The woman a politician named Kazinsky wants her to impersonate is none other than Marian Westin, the missing wife of Colorado candidate-for-Governor, Quinn Westin. Stunned, Lily refuses but quickly learns that Quinn won't take no for an answer. Compelled to cooperate by both the threat of returning to jail and the promise of a new life for her and her daughter in Europe, Lily reluctantly agrees and begins intensive lessons acting out the role of the mysterious Mrs. Westin. Lily is quickly drawn to Quinn with an overwhelming attraction that is returned by the influential man. Despite the knowledge that Lily must disappear in seven months while Quinn goes on to govern Colorado, the two find themselves giving in to their growing love.  Lily Dale is a woman of courage and conviction, an out-of-the-ordinary heroine--a Maggie Osborne trademark. Quinn Westin is a hero powerful enough to balance Lily's strength and clever enough to value her wisdom. Combine Lily and Quinn with an entertaining plot, a dash of mystery, and plenty of steamy romance, and the result is a novel not to be missed.--Lois Faye Dyer",
  "genres": [
    "Historical Romance",
    "Romance",
    "Westerns",
    "Historical",
    "Western Romance",
    "Historical Fiction",
    "Western Historical Romance"
  ],
  "author": "maggie-osborne",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/731540.A_Stranger_s_Wife"
}