{
  "title": "The Songs of Blind Folk: African American Musicians and the Cultures of Blindness",
  "description": "\"Rowden has wedded ethnomusicology and disability studies to offer a fresh approach to the study of African American popular music. The Songs of Blind Folk undermines many of the defining mythologies and tropes of blind musicians, including the perception that they are successful because they compensate for the loss of vision.\"---Mark Anthony Neal, Duke University \"Illuminates how the enduring phenomenon of blind African American musicians emerged from brutal conditions, how these musicians were deployed in the burgeoning American iconography of race and 'freakdom,' and how they negotiated this hazardous cultural terrain . . . the book is timely, well-historicized, and rich in insight.\"---Kari Winter, University at BuffaloThe Songs of Blind Folk explores the ways that the lives and careers of blind and visually impaired African American musicians and singers have mirrored the changes in America's image of African Americans and the social positioning and possibilities of the entire black community. The book offers a historically grounded consideration of African American performers and their audiences, and the ways that blindness, like blackness, has affected the way the music has been produced and received. Author Terry Rowden considers the controversial nineteenth-century prodigy Blind Tom Bethune; blues singers and songwriters such as Blind Lemon Jefferson, who achieved an unprecedented degree of visibility and acceptance in the 1920s and '30s; spiritual and gospel musicians such as the Blind Boys of Alabama; celebrated jazz and rhythm and blues artists Art Tatum, Rahsaan Roland Kirk, and Ray Charles; and finally, perhaps the best known of all blind performers, Stevie Wonder. Terry Rowden is Assistant Professor of English at the City University of New York, Staten Island. He is coeditor of Transnational The Film Reader.",
  "genres": [
    "Disability",
    "Music",
    "History"
  ],
  "author": "Terry Rowden",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/7317596-the-songs-of-blind-folk"
}