{
  "title": "Shakespeare by Another Name: The Life of Edward de Vere, Earl of Oxford, the Man Who Was Shakespeare",
  "description": "The debate over the true author of Shakespeare’s body of work (some of which was published under the name “Shake-speare”) began not long after the death of William Shakespeare, the obscure actor and entrepreneur from Stratford-upon-Avon who was conventionally assumed to be the author. There were natural doubts that an uneducated son of a glover who never left England and apparently owned no books could have produced some of the greatest works of Western literature. Early investigators into the mystery argued for such eminent figures as Christopher Marlowe or Francis Bacon as possible authors, but recent scholarship has turned to Edward de Vere, 17th Earl of Oxford, as the true Shakespeare.  “Shakespeare” by Another Name is the first complete literary biography of Edward de Vere that tells the story of his action-packed life—as student, soldier, courtier, lawyer, political intriguer, sophisticate, traveler, and, above all, writer—finding in it the background material for all of Shakespeare’s plays. Anderson brings to bear a wealth of new evidence, most notably de Vere’s personal copy of the Bible (recently analyzed to show the correlation between his underlinings and the biblical allusions in Shakespeare’s work) and has employed it all to at last give a complete portrait and background to the man who was “Shakespeare.” BACKCOVER: “Makes a compelling case. . . . Anderson’s demonstration of how de Vere’s real life matches the characters and circumstances found in the plays attributed to Shakespeare is especially impressive.” —THE ATLANTA JOURNAL-CONSTITUTION  “Deserves serious attention. . . . Mr. Anderson shows there are myriad Shakespeare authorship connections for de Vere.” —THE NEW YORK TIMES  “Tantalizing parallels between the plays and Oxford’s life certainly exist. . . . Anderson has a knack for finding fishy aspects of the traditional view that Shakespeare was Shakespeare.” —NEW YORK SUN",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Audiobook",
    "Literature",
    "Historical",
    "European History"
  ],
  "author": "Mark  Anderson",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/73159.Shakespeare_by_Another_Name"
}