{
  "title": "A Crack in the Sky",
  "description": "Thirteen-year-old Eli Papadopoulos is worried. Even though he’s a member of the most powerful family in the world. Even though his grandfather founded InfiniCorp, the massive corporation that runs everything in the bustling dome-cities. Even though InfiniCorp ads and billboards are plastered everywhere,  DON'T WORRY! INFINICORP IS TAKING CARE OF EVERYTHING! Recently, Eli noticed that there’s something wrong with the artificial sky. It keeps shorting out, displaying strange colors and random images. And though the Department of Cool and Comfortable Air is working overtime, the dome-city is hotter than it’s ever been.     Eli has been raised to believe that the dome-cities are safe, that the important thing is to keep working and consuming, and that everyone is secure and comfortable in InfiniCorp’s capable hands.     But now he begins asking questions.     All of a sudden, operatives from a dangerous band of terrorists keep contacting him. The Friends of Gustavo—or Foggers—want to tear down everything InfiniCorp has created. They promise Eli that they have the truth he seeks—if he’s brave enough to handle it.     Eli isn’t convinced. And he’s about to find out that in the dome-cities, being a Papadopoulos isn’t enough to save a rule-breaker like him from being sent far away to learn right-thinking. In his new home, the Tower, Eli meets Tabitha, once at the top of her Internship class, now a forgotten slave. Together, and with help from Eli’s beloved pet mongoose, Marilyn, they just might be able to escape . . . and try to make a life for themselves in the scorched wilderness outside the domes. This sweeping, high-concept eco-thriller recalls Disney/Pixar’s Wall•E and Lois Lowry’s classic The Giver, yet it is completely original, a remarkable, fully realized fantasy that will change the way you look at how we live.",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Dystopia",
    "Middle Grade",
    "Adventure",
    "Fiction",
    "Fantasy"
  ],
  "author": "Mark Peter Hughes",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/7327258-a-crack-in-the-sky"
}