{
  "title": "Keeping Time",
  "description": "Daisy Phillips is tired of being treated like an old lady. Sure, there was that incident with the lawn mower and the mud. And she did get trapped at the top of a ladder. But that doesn’t make her incapable of living on her own, as her son Dennis seems to think. Now Dennis is pushing her to sell the family home in Liverpool and move into a retirement community. To make matters worse, her best friend is going away for the summer and the new boss at the library politely informed her that her services as a volunteer are no longer needed. Is it any wonder that Daisy is feeling distressed?But the unflappable Daisy won’t go down without a fight. What she needs to boost her spirits is an adventure. A long-forgotten watch found in a box in the basement provides the perfect start. The watch belonged to her first love, an American soldier stationed in England during World War II. With a decades-old Brooklyn address as her only clue, Daisy embarks on a trip to New York City with plans to track him down and return the valuable keepsake, and maybe get a peek at the life she might have had.But first there’s a haphazard family reunion, where she meets and settles in with her colorful American cousins on Long Island. Elisabeth is the harried working mother who’s engaged in a fashion battle with one of her five sons. Richard, her attorney husband, might be taking his enthusiasm for the game of darts too far. And their sullen teenage son Michael is on the brink of failing all his final exams. Though Elisabeth can barely keep up with the life she already has, she eagerly jumps on board with Daisy and her quixotic quest, determined to help Daisy find her long-lost love—an adventure that holds surprises for all involved.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Womens Fiction",
    "Family",
    "Contemporary",
    "Historical Fiction"
  ],
  "author": "Stacey McGlynn",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/7323722-keeping-time"
}