{
  "title": "Identity Economics: How Our Identities Shape Our Work, Wages, and Well-Being",
  "description": "How identity influences the economic choices we makeIdentity Economics provides an important and compelling new way to understand human behavior, revealing how our identities―and not just economic incentives―influence our decisions. In 1995, economist Rachel Kranton wrote future Nobel Prize-winner George Akerlof a letter insisting that his most recent paper was wrong. Identity, she argued, was the missing element that would help to explain why people―facing the same economic circumstances―would make different choices. This was the beginning of a fourteen-year collaboration―and of Identity Economics .The authors explain how our conception of who we are and who we want to be may shape our economic lives more than any other factor, affecting how hard we work, and how we learn, spend, and save. Identity economics is a new way to understand people's decisions―at work, at school, and at home. With it, we can better appreciate why incentives like stock options work or don't; why some schools succeed and others don't; why some cities and towns don't invest in their futures―and much, much more.Identity Economics bridges a critical gap in the social sciences. It brings identity and norms to economics. People's notions of what is proper, and what is forbidden, and for whom, are fundamental to how hard they work, and how they learn, spend, and save. Thus people's identity―their conception of who they are, and of who they choose to be―may be the most important factor affecting their economic lives. And the limits placed by society on people's identity can also be crucial determinants of their economic well-being.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Psychology",
    "Sociology",
    "Science",
    "Politics",
    "Business"
  ],
  "author": "George A. Akerlof",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/7322362-identity-economics"
}