{
  "title": "Plant Life: A Novel",
  "description": "Her luminous first novel, Moon Women, won the hearts of both readers and critics. Now Pamela Duncan returns to the rich landscape of the human heart with a lush, resonant novel about mothers and daughters, about family and friendship, about a woman at a turning point in her life and the extraordinary world she discovers in a place called home…It’s Christmastime in Russell, North Carolina. For Laurel Granger, the holiday can’t pass quickly enough. With her fifteen-year marriage ending, the visit to her hometown is bound to be even more painful than usual. And the worst part will be looking at the lives of her mother, Pansy, and Pansy’s gossipy group of friends, for whom life revolves around the plant, the aging textile mill where for decades they have found companionship, a modest livelihood, and a purpose.But with her own marriage disintegrating—the full scope of the disaster hasn’t become clear to her yet—Laurel has nowhere else to turn except Russell, and to the women of the plant. And soon what Laurel begins to see is not the stifling town she couldn’t wait to leave, nor women whose lives seem petty and plain, but a place where powerful secrets have been kept...where hearts and lives have been broken...and where a group of extraordinary women may have a thing or two to teach her about life. Most of all, as Laurel starts to live and even love a little again, she is faced with her mother, and her mother before her, and what their complex relationship has meant for Laurel all these years.Weaving together the voices of several remarkable women across generations, Pamela Duncan tells a story of faith and forgiveness, acts of love and acts of betrayal. With the same artful brushstrokes that made Moon Women a wonder, Duncan paints a masterful portrait of seemingly ordinary lives, and of what it means to grow a life and a future—in the rich soil of the past.",
  "genres": [
    "Fiction",
    "Southern",
    "Chick Lit"
  ],
  "author": "Pamela  Duncan",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/733011.Plant_Life"
}