{
  "title": "More Than 85 Broads: Women Making Career Choices, Taking Risks, and Defining Success On Their Own Terms",
  "description": "More Than 85 Broads introduces us to a remarkable group of strong, passionate, and talented women who all define success on their own terms. Along with author Janet Hanson's riveting account of how she built 85 Broads into a groundbreaking global network community, each of these women candidly tells her own powerful story.Meet Trailblazers who need no roadmap or formula for success-just their own optimism, confidence, and gut instincts. Meet Adventurers who push past boundaries and find new ways to define success for themselves. Meet Parents who are building true partnerships rather than just \"balancing\" their lives and careers. And meet Visionaries who are answering the questions: \"What's my passion?\" \"What's my destiny?\" \"What's my gift?\"Whether you're striving to align your passion with your career, standing at a crossroads deciding which path to choose, or well on the road to fulfilling your lifelong dreams, you can tap into the enormous power and potential of \"some of the most incredible women on the planet\" and . . .Discover how building a strong network gives you your own unique platform for creating new opportunities, connections, and personal definitions of success.Learn how women are blazing their own trails as business leaders, entrepreneurs, survivors, philanthropists, and parents.Find out how smart, successful and courageous women really think about their careers, their lives, their families, and their futures-all in their own voices.\"The most powerful and courageous voice any of us can listen to is our own, but it is often the one that we spend the least time cultivating and tuning into...\" writes Hanson.More Than 85 Broads is an essential read for women and men at every stage of their careers and lives. It will surprise you, motivate you, and inspire you to connect with others. Most importantly, it will help you find your own passion, build your own network, and define success on your own terms.",
  "genres": [
    "Business"
  ],
  "author": "Janet Hanson",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/732838.More_Than_85_Broads"
}