{
  "title": "For Love of the Dead",
  "description": "Leave all your preconceptions about zombies on page one!Hal Bodner's For Love of the Dead brings an entirely new twist to the Risen Dead in a sultry, steaming hot novel of paranormal erotic romance that will rock your very soul in a story of lost hope, missed opportunities and sensual ecstasy.Hunky mortician Jake Marshall is seeking true love - and a funeral home is definitely the wrong place to look. Or is it...?Emotionally paralyzed by the untimely death of his first lover, Jake finally meets young Mario - the answer to Jake's prayers and the key to his finding love once again. But a specter of indescribable beauty and horrifying evil rises inexplicably from a mortuary table.Mark Hartner has the face of an angel, the body of a young god... and the soul of a demon from Hell. And Mark would like nothing more than to drag Jake back down to Hell with him.The fiend wastes no time in squandering his chance to redeem himself in an orgy of violence, sex and blood. And the only one who can stop him is Jake.How far will Jake go to thwart Mark's terrifying attacks on innocent young men? What sacrifices is the handsome mortician willing to make?Will Mario, the man with whom Jake can finally find happiness, be one of them?From an island paradise hiding terrible secrets to the hushed and sterile halls of a small mortuary, For Love of the Dead will take you on a darkly erotic journey like you've never known, bringing a shiver to your spine and a tingle to your body.Bodner combines heart-breaking emotional impact with the forbiddenallure of dark sex in a truly riveting tale of lust and revenge.Fighting against almost insurmountable obstacles from beyond the grave, his characters struggle against the odds to reach their ultimate reward - a pure and perfect love.Find out how far one man will go, what risks he will take and what dangers he will face... For Love of the Dead.",
  "genres": [
    "M M Romance",
    "Horror",
    "Paranormal",
    "Zombies",
    "Urban Fantasy"
  ],
  "author": "Hal Bodner",
  "average_rating": "2.60",
  "url": "https://www.goodreads.com/book/show/7333604-for-love-of-the-dead"
}