{
  "title": "Elizabeth's London: Everyday Life in Elizabethan London",
  "description": "Liza Picard immerses her readers in the spectacular details of daily life in the London of Queen Elizabeth (1558-1603). Beginning with the River Thames, she examines the city on the north bank, still largely confined within the old Roman walls. The wealthy lived in mansions upriver, and the royal palaces were even farther up at Westminster. On the south bank, theaters and spectacles drew the crowds, and Southwark and Bermondsey were bustling with trade. Picard examines the streets and the traffic in them; she surveys building methods and shows us the decor of the rich and the not-so-rich. Her account overflows with particulars of domestic life, right down to what was likely to be growing in London gardens.Picard then turns her eye to the Londoners themselves, many of whom were afflicted by the plague, smallpox, and other diseases. The diagnosis was frequently bizarre and the treatment could do more harm than good. But there was comfort to be had in simple, homely pleasures, and cares could be forgotten in a playhouse or the bull-baiting and bear-baiting rings, or watching a good cockfight. The more sober-minded might go to hear a lecture at Gresham College or the latest preacher at Paul's Cross.Immigrants posed problems for Londoners who, though proud of their nation's religious tolerance, were concerned about the damage these skilled migrants might do to their own livelihoods, despite the dominance of livery companies and their apprentice system. Henry VIII's destruction of the monasteries had caused a crisis in poverty management that was still acute, resulting in begging (with begging licenses!) and a \"parochial poor rate\" paid by the better-off.Liza Picard's wonderfully vivid prose enables us to share the satisfaction and delights, as well as the vexations and horrors, of the everyday lives of the denizens of sixteenth-century London.",
  "genres": [
    "History",
    "Nonfiction",
    "British Literature",
    "Tudor Period",
    "16th Century",
    "Historical",
    "Elizabethan Period"
  ],
  "author": "Liza Picard",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/733558.Elizabeth_s_London"
}