{
  "title": "The Little Locksmith",
  "description": "The Little Locksmith, Katharine Butler Hathaway's luminous memoir of disability, faith, and transformation, is a critically acclaimed but largely forgotten literary classic brought back into print for the first time in thirty years. The Little Locksmith begins in 1895 when a specialist straps five-year-old Katharine, then suffering from spinal tuberculosis, to a board with halters and pulleys in a failed attempt to prevent her being a \"hunchback.\" Her mother says that she should be thankful that her parents are able to have her cared for by a famous surgeon; otherwise, she would grow up to be like the \"little locksmith,\" who does jobs at their home; he has a \"strange, awful peak in his back.\" Forced to endure \"a horizontal life of night and day,\" Katharine remains immobile until age fifteen, only to find that she, too, has a hunched back and is \"no larger than a ten-year-old child.\" The Little Locksmith charts Katharine's struggle to transcend physical limitations and embrace her life, her body and herself in the face of debilitating bouts of frustration and shame. Her spirit and courage prevail, and she succeeds in expanding her world far beyond the boundaries prescribed by her family and society: she attends Radcliffe College, forms deep friendships, begins to write, and in 1921, purchases a house of her own in Castine, Maine. There she creates her home, room by room, fashioning it as a space for guests, lovers, and artists. The Little Locksmith stands as a testimony to Katharine's aspirations and desires-for independence, for love, and for the pursuit of her art.\"We tend to forget nowadays that there is more than one variety of hero (and heroine). Katharine Butler Hathaway, who died last Christmas Eve, was the kind of heroine whose deeds are rarely chronicled. They were not spectacular and no medal would have been appropriate for her. All she did was to take a life which fate had cast in the mold of a frightful tragedy and redesign it into a quiet, modest work of art. The life was her own.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Classics",
    "Biography",
    "History",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Katharine Butler Hathaway",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/733977.The_Little_Locksmith"
}