{
  "title": "Henry Clay: The Essential American",
  "description": "The epic life and times of one of the most important political figures in our history. He was the Great Compromiser, a canny and colorful legislator and leader whose life mirrors the story of America from its founding until the eve of the Civil War. Speaker of the House, senator, secretary of state, five-time presidential candidate, and idol to the young Abraham Lincoln, Henry Clay is captured in full at last in this rich and sweeping biography that vividly portrays all the drama of his times.David S. Heidler and Jeanne T. Heidler present Clay in his early years as a precocious, witty, and optimistic Virginia boy, raised on a farm, who at the age of twenty transformed himself from bumpkin to attorney—a shrewd and sincere defender of the ordinary man who would be his eventual political base. The authors reveal Clay’s tumultuous career in Washington, one that transformed the capital and the country. Nicknamed “the Western Star,” Clay became the youngest Speaker of the House shortly before the War of 1812 and transformed that position into one of unprecedented power. Then, as a senator, he joined and sometimes fought John Calhoun and Daniel Webster to push through crucial legislation affecting everything from slavery to banking. Commonly regarded as the greatest U.S. senator in history, Clay served under ten presidents and overshadowed most of them, with the notable exception of his archrival Andrew Jackson. Clay ran unsuccessfully for president five times, and his participation in the deadlocked election of 1824 brought about the “Corrupt Bargain” with John Quincy Adams that made Clay secretary of state—and haunted him for the rest of his career. As no other book, Henry Clay humanizes Clay’s marriage to plain, wealthy Lucretia Hart, a union rumored to be mercenary on his part but that lasted fifty-three years and produced eleven children.Featuring an inimitable supporting cast including Aaron Burr, Thomas Jefferson, James Madison, James Monroe, James Polk, and Abraham Lincoln, Henry Clay is beautifully written and replete with fresh anecdotes and insights. But it is Henry Clay who often rises above them all. Horse trader and risk taker, arm twister and joke teller, Clay was the consummate politician who gave ground, made deals, and changed the lives of millions. His life is an astounding tale—and here superbly told.",
  "genres": [
    "History",
    "Biography",
    "American History",
    "Nonfiction",
    "Politics",
    "Biography Memoir",
    "Historical"
  ],
  "author": "David Stephen Heidler",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/7341501-henry-clay"
}