{
  "title": "Critical Terrorism Studies: A New Research Agenda",
  "description": "In response to the growth of a critical perspective on contemporary issues of terrorism, this edited volume brings together a number of leading scholars to debate the new subfield of 'critical terrorism studies'. In the years since the 9/11 attacks, terrorism studies has undergone a major transformation from minor subfield of security studies into a large stand-alone field, and is probably one of the fastest expanding areas of research in the Western academic world. However, much of the literature is beset by a number of problems, limiting its potential for producing rigorous empirical findings and genuine theoretical advancement. In response to these weaknesses in the broader field, a small but increasing number of scholars have begun to articulate a critical perspective on contemporary issues of terrorism. This volume brings together a number of leading scholars to debate the need for and the shape of this exciting new subfield.The first part of the volume examines some of the main shortcomings and limitations of orthodox terrorism studies, while the second examines exactly what a 'critical' terrorism studies would look like. Contributors from a variety of methodological and disciplinary perspectives give this volume diversity, and it will lay the foundations for, and provoke debate about, the future research agenda of this new field. This book will be of much interest to students of critical security studies, terrorism studies and IR theory in general. Richard Jackson is Reader in the Department of International Politics, Aberystwyth University, where he is also Senior Researcher at the Centre for the Study of Radicalisation and Contemporary Political Violence (CSRV). He is the founding editor of the journal, Critical Studies on Terrorism. Marie Breen Smyth is Director of the Centre for the Study of Radicalisation and Contemporary Political Violence (CSRV) at Aberystwyth University. She is a Reader in International Politics and co-editor of the journal, Critical Studies on Terrorism. Jeroen Gunning is Lecturer in International Politics at Aberystwyth University, Deputy Director of the Centre for the Study of Radicalisation and Contemporary Political Violence and co-editor of the journal, Critical Studies on Terrorism.",
  "genres": [
    "Terrorism",
    "Reference",
    "Law",
    "Crime",
    "Politics"
  ],
  "author": "Richard   Jackson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/7339780-critical-terrorism-studies"
}