{
  "title": "The Ecological Rift",
  "description": "Humanity in the twenty-first century is facing what might be described as its ultimate environmental catastrophe: the destruction of the climate that has nurtured human civilization and with it the basis of life on earth as we know it. All ecosystems on the planet are now in decline. Enormous rifts have been driven through the delicate fabric of the biosphere. The economy and the earth are headed for a fateful collision--if we don't alter course.In The Ecological Rift: Capitalism's War on the Earth environmental sociologists John Bellamy Foster, Brett Clark, and Richard York offer a radical assessment of both the problem and the solution. They argue that the source of our ecological crisis lies in the paradox of wealth in capitalist society, which expands individual riches at the expense of public wealth, including the wealth of nature. In the process, a huge ecological rift is driven between human beings and nature, undermining the conditions of sustainable existence: a rift in the metabolic relation between humanity and nature that is irreparable within capitalist society, since integral to its very laws of motion.Critically examining the sanguine arguments of mainstream economists and technologists, Foster, Clark, and York insist instead that fundamental changes in social relations must occur if the ecological (and social) problems presently facing us are to be transcended. Their analysis relies on the development of a deep dialectical naturalism concerned with issues of ecology and evolution and their interaction with the economy. Importantly, they offer reasons for revolutionary hope in moving beyond the regime of capital and toward a society of sustainable human development.",
  "genres": [
    "Science",
    "Nonfiction",
    "Environment",
    "Politics",
    "Ecology",
    "Economics",
    "Climate Change"
  ],
  "author": "John Bellamy Foster",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/7351218-the-ecological-rift"
}