{
  "title": "Jack's Christmas Wish",
  "description": "She'd been nice - so Santa brought her heart's desire, a sexy new master! Aside from being broke, stalked and groped by Santa, Lissa Monroe wondered what would happen to her next? She never expected it would be love at first sight. Times are hard for Lissa, with her mother’s illness and her own financial problems. She took a job as Santa’s sexy helper in a department store. Her ex-boyfriend Rex is stalking her and leaving dirty messages on her answering machine. She thinks she can handle him, but things turn deadly causing her to have an accident. Being a widowed single father isn’t easy. Derek Baxter knows this first hand, but when your son wants a new mom for Christmas what are you to do? It’s not like you can go out and find one or is it? Jack thinks so when he meets Lissa as he sits atop Santa’s lap. Outwardly Derek is the polite, shy widower and devoted father to his son Jack. In truth Derek is a wolf in sheep's clothing. He harbors a naughty secret that would surprise his friends and neighbors. Derek is a BDSM-Dominant with a playroom hidden in his basement loaded with BDSM toys. Derek's not looking for a relationship; at least he doesn’t think he is until Lissa and Jack have an instant bond, causing Derek to wonder if maybe his son’s instincts have found him a new Wife. Derek and Lissa embark on a whirlwind relationship which accelerates and leaves them both breathless. They both want the same thing—each other, but Lissa’s past hurts in the name of love hold her back. Derek is determined to break down her walls one way or another and win her heart. He determines she is the perfect submissive and uses it to his advantage, winning her over one sexual encounter at a time. She caves and agrees to marry him, making Jack and Derek happy that Jack got his Christmas wish.",
  "genres": [
    "Erotica"
  ],
  "author": "Bonni Sansom",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/13041589-jack-s-christmas-wish"
}