{
  "title": "Teodora e o Segredo da Esfinge",
  "description": "Na tradição popular portuguesa costuma dizer-se que a sétima filha de um casal se transforma em fada ao atingir os 12 anos. Teodora, a heroína desta história, está quase a completar essa idade, e ao ser a sétima filha da família vai entrar num mundo cheio de mistério.Teodora nasceu nos Açores, mas com a morte da mãe veio morar no continente, junto da madrinha, onde foi obrigada a aprender e fazer todo o serviço doméstico, como uma verdadeira criada. Mas durante toda a sua vida dois seres estiveram sempre presentes, a ajudá-la e a protegê-la – os elfos invisíveis - até ao dia em que Teodora é convocada para o Congresso das Fadas, nos Açores, um universo mágico e fascinante, onde existem gnomos, duendes, trolls, sílfides, ondinas, ninfas, a Fada do Açúcar, o Mago Saramago, caldeirões borbulhantes, grifos e outros monstros fantásticos, viagens feitas através de Gallitraps, círculos de cogumelos brilhantes e passagens secretas através de poças de água.No decorrer do Congresso, Teodora demonstra a sua inteligência e capacidade para se tornar numa Fada de grande poder e sabedoria, capaz de ocupar o lugar em aberto. Mas a sua entrada neste mundo não vai ser pacífica. Terá que se defender de Pooka, uma fada de um clã rival que, pelo uso nefasto dos seus poderes, foi expulsa da Congregação de Fadas, e a quem Teodora vem suceder. E terá ainda de resolver o enigma da Esfinge, uma entidade poderosa que Teodora irá enfrentar para desvendar o estranho mistério que reside no seu interior…Este é um livro onde as tradições celta e portuguesa se cruzam, repleto de magia, encantamento, muito humor e aventura, e que é também, o primeiro de muitas aventuras da Teodora a ser publicado na colecção Estrela do Mar.",
  "genres": [
    "Fantasy",
    "Childrens",
    "Portuguese Literature",
    "Portugal",
    "Middle Grade"
  ],
  "author": "Luísa Fortes da Cunha",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/7350309-teodora-e-o-segredo-da-esfinge"
}