{
  "title": "A Puzzle in a Pear Tree",
  "description": "The Chicago Sun-Times crowns Parnell Hall’s Puzzle Lady mysteries “a joy for lovers of both crosswords and frothy crime detection...Cora Felton is a lovable and unique sleuth.” Now the crime-solving powers of the inimitable Cora and her clever niece, Sherry Carter, are put to the ultimate test as they square off against a yuletide killer who hides within the white-and-black shadows of an acrostic....A Puzzle In A Pear Tree’Tis the season to be jolly, but Cora Felton, shanghaied into “The Twelve Days of Christmas” as a most reluctant maid-a-milking, has every right to feel like a grinch. When someone steals the partridge from the pear tree and replaces it with a cryptic puzzle she has no hope of solving, it’s almost more than the Puzzle Lady can bear. But then smug crossword creator Harvey Beerbaum solves the acrostic, and it turns out to be a poem promising the death of an actress. This is more like it! Could the threat be aimed at Cora and her thespian debut? Or at Sherry, one of the ladies-dancing? Or at Sherry’s nemesis, the pageant’s predatory lead, Becky Baldwin?Cora and Sherry barely have time for a mystery, what with trimming Christmas trees and buying Christmas presents, but rehearsals go on, under police protection--until a killer strikes elsewhere in a most unexpected manner.Ordinarily Cora Felton would be delighted to have two murders to solve. But this time she finds herself vying with a visiting Scotland Yard inspector who appears to have an all-too-personal stake in solving the crimes. Cora does too when her own niece becomes a prime suspect and the murderer strikes again.Is someone trying to shut down the Christmas pageant? Cora would be only too happy if that were the case, but she fears the secrets lie deeper. Now she is interviewing witnesses, breaking into motel rooms, finding evidence, planting evidence, and having a merry old time. In fact, she would be perfectly happy--if this wasn’t turning out to be a Christmas to die for!",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Christmas",
    "Cozy",
    "Holiday",
    "Mystery Thriller"
  ],
  "author": "Parnell Hall",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/735091.A_Puzzle_in_a_Pear_Tree"
}