{
  "title": "سرد الذات",
  "description": "الإطلالة الخاصة على حياة حاكم الشارقة ستتيح للقراء التعرف إلى الأحداث التاريخية الكبيرة التي شهدتها المنطقة من الأربعينات وحتى السبعينات من القرن الماضي، كما ستثير فضولهم للتعرف إلى المزيد من المنعطفات المهمة التي عاشتها إمارة الشارقة خصوصاً، والخليج والعالم العربي عموماً، ومن ذلك المدّ القومي العربي والتطور الثقافي والتعليمي السريع في الإمارة.ومن جانبه، قال صاحب السمو الشيخ الدكتور سلطان بن محمد القاسمي: \"إنني آمل من وراء نشر هذا الكتاب أن يعيد القراء إحياء تجاربي، وأن يتعرفوا إلى المزيد بشأن تلك الحقبة التاريخية. إن الحجم الهائل للإرث التراثي والعلاقة الوطيدة التي ربطت بين الناس وبعض المعالم الخاصة في الشارقة، ساعدتهم حقاً في تحديد شخصيتهم، وأعطت للشارقة هوية ثقافية فريدة من نوعها\".ومن أبرز الجوانب التي تلفت انتباه القارئ لهذا الكتاب قدرة المؤلف على المناقشة الموضوعية الدقيقة للتاريخ الزاخر للمنطقة وعلاقته بحياته الشخصية والسفر والتجارب التي اكتسبها.وأوضح سموه في كتابه قائلاً: \"لقد شرعت في إعداد هذا الكتاب لتوثيق 26 عاماً من التاريخ الذي شمل عائلتي وشعبي ودولتي. ولكي أروي القصة بلغة عربية جزلة وقوية، عمدت خلال العمل إلى تجربة الكثير من أساليب الكتابة، وقمت بتحرير وتنقيح اللغة، إلى أن وصلت إلى القناعة المطلوبة، لأقرر حينها أن أطلق على هذا الكتاب اسم \"سرد الذات\".وأسهم التعليم المكثف الذي حظي به صاحب السمو الشيخ الدكتور سلطان، وما تلاه من حصوله على درجة الدكتوراه، وتخصصه في شؤون الخليج والبلاد العربية، في تكوين معرفته الواسعة حول هذا الموضوع، حيث سبق لسموه أن نشر ما مجمله 29 كتاباً حول موضوعات مختلفة. وبفضل ما تتمتع به هذه الإصدارات من شهرة واسعة النطاق، فإن الكثير منها ترجم إلى لغات أخرى، كما اعتمد بعضها في المناهج التدريسية في مختلف المدارس والجامعات المحليةوقد أوقف صاحب السمو حاكم الشارقة ريع بيع كتب “منشورات القاسمي” كاملاً لـ “مدينة الشارقة لخدمات الإنسانية” - وهي مؤسسة غير ربحية تقوم على رعاية وتعليم وتأهيل ودمج المعاقين في مجتمعهم",
  "genres": [
    "Autobiography",
    "Biography",
    "History"
  ],
  "author": "سلطان بن محمد القاسمي",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/7351060"
}