{
  "title": "For the Strength of Youth: Fulfilling Our Duty to God",
  "description": "NUESTROS ESTIMADOS HOMBRES Y MUJERES JÓVENES, tenemos gran confianza en ustedes. Ustedes son amados hijos e hijas de Dios y Él los tiene presentes; han venido a la tierra en una época de grandes oportunidades y también de grandes desafíos. Las normas de este folleto les ayudarán con las decisiones importantes que están tomando ahora y las que tomarán en el futuro. Les prometemos que, si guardan los convenios que han hecho y estas normas, serán bendecidos con la compañía del Espíritu Santo, su fe y testimonio serán más firmes y disfrutarán de mayor felicidad.En todo lo que hagan, mantengan su mira en el templo. En el templo recibirán las más grandes de todas las bendiciones del Señor, incluso el matrimonio por el tiempo de esta vida y por toda la eternidad. Guardar las normas de este librito les ayudará a ser dignos de asistir al templo, donde podrán efectuar ordenanzas sagradas por sus antepasados ahora y hacer convenios esenciales por ustedes en el futuro.Nuestro Padre Celestial ha depositado gran confianza en uste- des y tiene una obra para que lleven a cabo. Procuren Su guía con oración y deliberen en consejo con sus padres y líderes. Las decisiones que tomen ahora fijarán el curso que seguirán durante gran parte de su vida mortal y por la eternidad.Testificamos que Dios vive. Nuestra ferviente oración es que permanezcan firmes y valientes a lo largo de toda su vida y que confíen en el Salvador y en Sus promesas. Al hacerlo, serán una influencia para bien al ayudar a edificar el reino de Dios y prepa- rar al mundo para la Segunda Venida del Salvador.La Primera Presidencia",
  "genres": [
    "Religion",
    "Lds",
    "Nonfiction",
    "Church",
    "Lds Non Fiction",
    "Parenting",
    "Inspirational"
  ],
  "author": "The Church of Jesus Christ of Latter-day Saints",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/7363861-for-the-strength-of-youth"
}