{
  "title": "Seeking God: The Way of St. Benedict",
  "description": "Bestseller!For over fifteen hundred years St. Benedict's Rule has been a source of guidance, support, inspiration, challenge, comfort and discomfort for men and women. It has helped both those living under monastic vows and those living outside the cloister in all the mess and muddle of ordinary, busy lives in the world. Esther de Waal's Seeking God serves as an introduction to this life-giving way and encourages people to discover for themselves the gift that St. Benedict can bring to individuals, to the Church, and to the world, now and in the years to come.Through this definitive classic Esther de Waal has become known as an authority for the lay person on the Rule of St. Benedict. Her ability to communicate clearly the principal values of the Rule when applied to lay people is the ultimate strength of this book. She follows each chapter with a page or two of thoughts and prayers, contributing to its meditative quality.Esther de Waal is an Anglican lay woman, married with four sons and a number of grandchildren. She lives on the Welsh Borders where she grew up and spends her time gardening, writing, traveling, and taking retreats. She became interested in Benedictine monasticism as a result of living for ten years in Canterbury and has written several books on the Rule of St. Benedict including a life-Giving Way, published by The Liturgical Press, 1995. She holds a PhD. from Cambridge and was given an honorary doctorate from St. John's University for her contribution to Benedictine studies and for her ecumenical work. She was awarded the Templeton Prize for having started the Benedictine Experience weeks which are now widely held throughout America and England.",
  "genres": [
    "Spirituality",
    "Christian",
    "Christianity",
    "Nonfiction",
    "Religion",
    "Theology",
    "Christian Living"
  ],
  "author": "Esther de Waal",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/735839.Seeking_God"
}