{
  "title": "A Bound Man: Why We Are Excited About Obama and Why He Can't Win",
  "description": "In Shelby Steele's beautifully wrought and thoughtprovoking new book, A Bound Man , the award-winning and bestselling author of The Content of Our Character attests that Senator Barack Obama's groundbreaking quest for the highest office in the land is fast becoming a galvanizing occasion beyond mere presidential politics, one that is forcing a national dialogue on the current state of race relations in America. Says Steele, poverty and inequality usually are the focus of such dialogues, but Obama's bid for so high an office pushes the conversation to a more abstract level where race is a politics of guilt and innocence generated by our painful racial history -- a kind of morality play between (and within) the races in which innocence is power and guilt is impotence.Steele writes of how Obama is caught between the two classic postures that blacks have always used to make their way in the white American bargaining and challenging. Bargainers strike a \"bargain\" with white America in which they say, I will not rub America's ugly history of racism in your face if you will not hold my race against me. Challengers do the opposite of bargainers. They charge whites with inherent racism and then demand that they prove themselves innocent by supporting black-friendly policies like affirmative action and diversity.Steele maintains that Senator Obama is too constrained by these elaborate politics to find his own true political voice. Obama has the temperament, intelligence, and background -- an interracial family, a sterling education -- to guide America beyond the exhausted racial politics that now prevail. And yet he is a Promethean figure, a bound man.Says Steele, Americans are constrained by a racial correctness so totalitarian that we are afraid even to privately ask ourselves what we think about racial matters. Like Obama, most of us find it easier to program ourselves for correctness rather than risk knowing and expressing what we truly feel. Obama emerges as a kind of Everyman in whom we can see our own struggle to accept and honor what we honestly feel about race. In A Bound Man , Steele makes clear the precise constellation of forces that bind Senator Obama, and proposes a way for him to break these bonds and find his own voice.The courage to trust in one's own careful judgment is the new racial progress, the \"way out\" from the forces that now bind us all.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Race",
    "Political Science",
    "History",
    "Biography"
  ],
  "author": "Shelby Steele",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/736413.A_Bound_Man"
}