{
  "title": "مختارات من القصص القصيرة الأوزبكية",
  "description": "يبحث الكتاب في بعض مظاهر تطور فن القصة القصيرة في هذا الأدب. إذ بدأت مرحلة التحديث في فن القصة الأوزبكية في الستينات من حيث تحول نهجها وأسلوبها إلى اللغة العاطفية والعلاقات الإنسانية, على يد الكاتب الأديب سيد أحمد؛ الذي كتب قصص(مصابيح الإقبال), و(دوتار), والأمواج), و(مياه الربيع). ويذكر الكتاب أن الأدب الأوزبكي قد تميز بالقصص التاريخية مثل قصص (شيراق), و(تيمورمليك) للكاتب مير كريم عاصم والذي يعتبرأهم من وضع حجر الأساس في فن القصة التاريخية الأوزبكية.. فيعرض الكتاب مختارات من القصص القصيرة لكتاب يمثلون الأدب الأوزبكي بكتاباتهم. في الفصل الأول يعرف الكتاب بمظاهر تطور الفن القصصي في هذا الأدب, بما لهذا الفن من تقاليد عريقة وغنية. كما تعود جذور النماذج الأولى التي أفاد منها الأدب الأوزبكي عموماً إلى قرون بعيدة. يضم الكتاب عشرين قصة قصيرة تطرّقت إلى وصف حياة شعوب هذه البلدان. في قصة (الزار) يقول عبد الله قادري :«عندما كان والدي يبدأ قصته هذه كان الخوف يتملكني, وكنت أقول في نفسي وأنا ألتجئ إلى الله تعالى :«اللهم لا تجعلني ألاقي جنّا مثلها!». في قصصه يعتمد عبد الله قادري على عناصر واقعية, وهو يعبر عن فكرة القصة من خلال تصرفات البطل وأقواله ومعنوياته. أما في قصة (زنبقة في غضون الثلج) لكاتبها جولبان عبد الحميد سليمان أوغلي, فيعلن الكاتب عن نواياه بوضوح, لتغلب العناصر الرومانسية على قصته, وكلا الكاتبين القادري و جولبان يعدان من أوائل الأدباء الذين دعوا الشعب إلى سلوك طريق المعرفة, حيث نرى اتجاه الأدب الأوزبكي من خلال هذه القصص إلى وصف القضايا الحيوية المهمة, ولتتناول وصف القضايا الاجتماعية. ومن القصص التي يضمها الكتاب أيضا نذكر «معلن الآداب» لـ عبد الله قهار, وقصة «أمانة القيامة»لـ(أولماس عمربيكوف), و»الوليمة»لـ (أوتكير هاشيموف), و»الثلج الأبيض»لـ (آمان مختار). أما في قصة «عروس من المدينة» لـ (نرجيزة غلاموفا), فأتت كقصة واقعية استطاعت أن تعرف القارئ من خارج المجتمع الأوزبكي على إحدى أهم المسائل الصعبة في حياة المجتمع الأوزبكي, وهي العلاقة بين الحماة والكنة, وفي العادة، فإن ما نسبته نحو تسعين في المئة من الفتيات عندما يتزوجن يعشن في بيت العائلة, أي مع والدي الزوج, وعلى العروس خدمة الأسرة, والقيام بتنظيف فناء الدار من الداخل(كما ورد في القصة من خلال التفاصيل المذكورة ). وآخر قصة في الكتاب كانت قصة «الزنبقة» لـ (أولوغ بيك حمدم), أيضاً هي قصة كتبت بالاعتماد على التفاصيل، لكن بأسلوب مختلف عن غيره, فلك كاتب كان في قصته نكهته الخاصة المميزة عن بقية الكتاب, تقول تفاصيل القصة :«استفاد شخص من شرودي وتفكيري, فقد وضع رجله على كتفي ودفع نفسه مستنداً إليّ, وثبت يده على حجارة في الأعلى...». قراءة القصص الأوزبكية في هذا الكتاب, ومن خلال تسليطها الضوء على الحياة الأوزبكية بتفاصيلها الصغيرة، بينت أن المجتمع الأوزبكي مجتمع له ما يتشابه به مع بقية المجتمعات وما يختلف عنها في المقابل, وهذا من خصائص كل مجتمع، سواء كان أوزبكياً أم غيره .",
  "genres": [],
  "author": "Abdulla Qodiriy",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/7375771"
}