{
  "title": "Bound to the Bikers",
  "description": "For three hot bikers, off-limits just became no limitsMy father will kill them if they touch me, but when our family's dark past crashes into my quiet life, my cute little bookstore goes up in smoke and I'm thrown into the arms of three wickedly irresistible bikers.All dads are protective, but mine is the president of the Screaming Eagles MC, so he really means it. To keep me safe, he sends three trusted men to be my bodyguards: Alpha, Blade and Ripper.They're everything my mother warned me about. Brash, deadly, sizzlingly hot, and really bad at following the rules. Now that we're trapped together on the run, is loyalty enough to keep them from worshiping the body they were sent to guard? Mine.Alpha is the big, muscular shield that stands between me and everything that wants to hurt me. When he snaps an order, he expects it to be obeyed. I'm not one of his men, though, so why does his masterful voice make me want to submit to whatever he demands?Ripper is rough, inked and missing one hand, but that doesn't make him any less lethal. When the nights grow dark, and my thoughts even darker, he's there to make me smile and pleasure it all away.Blade is lean muscle and coiled strength, scars and tattoos. He wields knives like they're part of him. There’s a darkness in his eyes, but when he looks at me, all I feel is the heat of flames, not the shadows that lurk in his past.A secret from my father's past has turned my life upside down and there are killers on our heels, but this time I'm not afraid.Not with Ripper, Blade and Alpha here to protect me.BOUND TO THE BIKERS is a motorcycle club reverse harem romance with a happy ever after ending. It's book 3 in the Screaming Eagles MC Series of standalone romances with characters who continue to make appearances.",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Erotica",
    "Contemporary",
    "Contemporary Romance",
    "Crime",
    "Dark"
  ],
  "author": "Stephanie Brother",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/73762386-bound-to-the-bikers"
}