{
  "title": "Fires of Eden",
  "description": "From the award-winning author of Hyperion and Carrion Comfort comes a harrowing tale of natural disaster, all-devouring greed, and wrathful gods.Real estate mogul Byron Trumbo is the owner of the Mauna Pele, a deluxe Hawaiian resort that until recently was the playground of the rich and famous. Yet instead of making money hand over fist, Trumbo has a bit of a problem: guests keep disappearing. Hoping to sell the resort to Japanese investors, he invites them to the Mauna Pele to finalize the deal—but strange and fantastic events complicate the weekend. Giant beasts capable of human speech are spotted, visitors turn up dead and dismembered, and volcanic eruptions fill the sky with smoke and flame as fast-moving lava flows dangerously close to the resort. Trumbo refuses to allow these minor inconveniences to impede his sales pitch to the Japanese.Other guests find themselves at the Mauna Pele this weekend, with agendas that extend beyond enjoying the sun and sand. For college professor Eleanor Perry, this “vacation” is a pilgrimage to a place once visited by her spinster aunt. Equipped with her aunt’s diary, which details adventures with Mark Twain more than one hundred years ago, Eleanor has uncommon insight into the frightening and mystical events about to unfold. And thrice-married Cordie Stumpf, whose housewifely appearance belies her keen mind and fearless resolve, is at the resort to pursue her own goal. The two women join forces as an astonishingly self-reliant duo prepared to do battle with the immortal enemies of the volcano goddess Pele and thereby restore harmony to the island.Against the mythic backdrop of an island paradise filled with vengeful gods and brooding menace, Dan Simmons weaves a stunning tale of ancient rivalries tested in the modern world.",
  "genres": [
    "Horror",
    "Fantasy",
    "Fiction",
    "Thriller",
    "Mythology",
    "Novels",
    "Horror Thriller"
  ],
  "author": "Dan Simmons",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/737315.Fires_of_Eden"
}