{
  "title": "Kevin My Military Man",
  "description": "....might have been entitled, 'Kevin Military Man'. What then? The 1970's. The 21st Century. Military Romance. But much more. Intriguing. Complicated. They say that for each one of us on this planet that there are potentially 30,000 people with whom we might find a partner in life. But what about the concept of the SOULMATE ? Does it exist only in one's dreams or imagination? They share but 5 words between them in high school but somehow, their eyes connect their souls. Five year later, they meet again, have a summer but Kevin enlists. Letters sustain their relationship but not indefinitely. The circumstances of life.... The distance.... Then - different directions.... Time goes by.... 17 years later, it is Gina's young adult sons who find the letters, the photos. Gina decides to search for Kevin online using 'buddyfinder' on the military.com website. -Chris watched as Will pulled out the photos without acknowledged permission that this was fine to do. .. Chris picked them right up. \"Is this Kevin ? Kevin from beach? Dana and Zeik's dad ?\" Chris asked ....\"It looks like it doesn't it ?\" Will said. \"He and mom were friends ?\" Chris asked trying to elicit more feedback. \"I think that they were more than friends.\" -Donna defended herself. \"I learn from fiction. Some of it's historical and other plots expose me to things that I would never experience.\" -It involved explaining to them the mindset of Marines. 'Marines are Marines'. There is mutual respect between 'Enlisted' and 'Officers'. -\"Why is that ?\" \"If your boyfriend is a looker, than you'll always feel insecure - there will always be girls chasing him.\" \"You're rationalizing,\" Jeannie quickly replied then added,\"It is sort of true with Tim.\" - .. and just sat on her bed. ..didn't think before pulling it out to read it. \"Hear my soul speak; the very instant that I saw you, did my heart ..\" ..but Kevin - he was something. Tim had no idea how to compete with a guy like this.",
  "genres": [
    "Romance"
  ],
  "author": "Shane Kaelle",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/7378169-kevin-my-military-man"
}