{
  "title": "الحب كلب من الجحيم",
  "description": "يضع كثيرون تشارلز بوكوفسكي ضمن \"جيل البيت\" أو في دائرته. لكن هذا التصنيف يغفل كونه لم يكن في واقع الأمر جزءاً من هذه الحركة ولا قريبأً من روادها (كرواك، بوروز، غينسبرغ، فرلينغتي، كروسو... الخ)، لا جغرافياً (فهو كان مقيماً طوال حياته في لوس أنجليس، في حين استقرت الحركة غالباً في نيويورك) ولا من حيث المعرفة الإنسانية أو الصداقة الأدبية أو التواطؤ الفكري والسياسي المباشر. غير أن التصنيف له ما يبرره أيضاً، خصوصاً اليوم، بعد رحيل بوكوفسكي ومعظم رواد الجيل الأول من \"البيت\"، أي النظر بشيء من المسافة إلى هذه التجربة الأدبية التي انطلقت منذ الخمسينات من القرن العشرين، وازدهرت في الستينات منه، ولا تزال مستمرة حتى أيامنا هذه. فوضع بوكوفسكي ضمن تيار \"البيت\" ينبع اليوم من اعتبار مختلف عن اعتبارات المرحلة التي ظهر فيها التيار، وظهر فيها أدب بوكوفسكي نفسه، وهو اعتبار يقيمه القراء غالباً أكثر مما يحدده النقاد أو الدارسون. فقد كان بوكوفسكي يشترك وشعراء وكتاب \"البيت\" بخواص عدة تقيم نوعاً من النسب غير المباشر بينه وبينهم. فهو مثلهم انطلق من خارج المؤسسة الأدبية والسياسية والاجتماعية الرسمية في أمريكا، فاعتبر من كتاب الهامش أو \"الأندرغراوند\" وهو مثلهم أحدث انقلاباً على صعيد مفهوم الكتابة سواء في صلتها بالسائد والمكرس أو في مقاربتها للحياة والواقع، أو في معاييرها الكتابية والإبداعية واللغوية. وإذا كانت المسافة الزمنية ضرورية لإقامة مثل هذا النسب فلأن بوكوفسكي في هذا الإطار تحديداً كان مهملاً في زمنه. بمعنى أنه لم يكن ينظر إليه كواحد من \"نجوم\" الهامش أو دعاته إذا جاز القول، ومعظمهم من \"البيت\" الذين أقاموا في مراحل مختلفة وبطرق عدة صلة قوية بالجيل الاحتجاجي الشاب الذي كانت تغلي به أمريكا وأوروبا والعالم في الستينات من القرن الماضي. ففي الوقت الذي انطلقت فيه شهرة كل أفراد \"البيت\" ولا سيما بوروز وكرواك وغينسبرغ وكورسو، من خلال أعمال اعتبرت علامات ومنعطفات تاريخية، كان بوكوفسكي يقع على هامشهم، أي على هامش الهامش. وقد احتاج إلى زمن أطول بكثير منهم ليصبح معروفاً، أو بالأحرى ليتعرف بأدبه على الرغم من مساهمته الكثيفة كما ونوعاً في صوغ الحساسية الأدبية الأمريكية الجديدة، حتى ذهب بعضهم إلى اعتباره \"أعظم شعراء أمريكا\" (جان بول سارتر). هناك اعتبار آخر مهم يفصل بوكوفسيكي عن جيل \"البيت\". فعلى الرغم من أنه كرس مثلهم الكتابة اليومية، وأدخل العنصر الاحتجاجي وحياة المهملين والبائسين والمهمشين في صلب الكتابة، فإنه لم يسع إلى صوغ بيان أدبي/سياسي سواء مباشراً أن مضمراً في النص أو الرواية أو القصيدة. كما أنه لم يشارك في الحياة السياسية المباشرة (محاضرات في الجامعات أو تجمعات أوتظاهرات)، ولم ينتم أيضاً إلى التيار الروحي الذي انتسب إليه معظم كتاب \"البيت\"، أي البوذية كمخرج روحي من قلق العصر وتخبطاته. بقي بوكوفسكي فرداً يغرد خارج سرب التيارات والمدارس والحركات (وإن صفنه بعضهم ضمن ما يعرف بمرحلة \"الشعر الاعترافي\" التي ازدهرت كذلك في الستينات من القرن العشرين، كما يصنف ككثيرين من أبناء جيله ضمن شعراء ما بعد الحرب العالمية الثانية، وهي تسمية عامة مثلما هو واضح). وبقيت سيرته الذاتية، التي تعتبر في الواقع سيراً عدة، ولا سيما ذكرياته، تشكل جزءاً كبيراً من أدبه، ذلك الأدب الخاص بامتياز. سجل بوكوفسكي وعلى امتداد نحو سبعين كتاباً بين مجموعات شعرية وروايات ومسرحيات، سيرته الموزعة بين الماضي والحاضر الذي احتلت النساء والكحول والشخصيات الهامشية النافرة جزءاً أساسياً منه. وإذا كان الواقع شديد الحضور في بنائه الأدبي فدائماً من زاوية التورط الشخصي، والنظرة الفاحصة إلى هذا الواقع الذي لم تعد تفاصيله مجرد ذريعة أو استعارة لتعبير سياسي مضمر، بل أصبحت واقعاً بديلاً قائماً في ذاته.الناشر:أفقت على الجفاف وكانت السراخس ميتة، والنباتات اصفرت أوراقها كالذرة في القدور، ولم أجد امرأتي بل حفنة زجاجات فارغة حاصرتني، كجثث مدماة، بلا جدواها، ومع ذلك كانت الشمس مشرقة ورسالة مالكة البيت تكسرت في اصفرار مناسب.",
  "genres": [
    "Classics",
    "Fiction",
    "Poetry",
    "Literature",
    "American",
    "Contemporary",
    "Love"
  ],
  "author": "Charles Bukowski",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/7372918"
}