{
  "title": "Tedious Brief Tales of Granta and Gramarye",
  "description": "CLASSIC EARLY HORROR IN THE STYLE OF MR JAMES BY A FRIEND AND COLLEAGUE “This Society consisteth of seven Everlastings, who may be Corporeal or Incorporeal, as Destiny shall determine.” So dictates the first rule of The Everlasting Club, the ghastly and debauched history of which is faithfully recorded herein. Assembled alongside are further narratives of supernatural misadventure and menace, including the curious tale of the death of mathematician Thomas Allen, possible necromancer, definite murder victim; the story of the final days of alchemist Anthony Fryar, discoverer of the Magisterium – the ‘master-cure for all human ailments’, but sadly not soon enough; and Matthew Makepeace’s cautionary tale of unforeseen regret wrought from the dark art of soul transference. These and more ghoulish, macabre classics are reproduced as originally presented in 1919, in this deliciously dark collection. Stunning, digitally re-mastered illustrations ‘Ingulphus’ was the pseudonym of Arthur Gray (1852–1940), Master of Jesus College, Cambridge from 1912–40. It is this location that acts as the setting for the series of stories originally written for magazines and then collected as Tedious Brief Tales of Granta and Gramarye. A contemporary of M.R. James, Gray wrote these stories in similar style as a compliment to the King's College Provost. With digitally remastered illustrations and a completely re-set text, Oleander's reproduction of this long-lost and much sought-after collection of ghost stories is bound to delight lovers of this classic style of supernatural literature. OTHER RARE, CLASSIC HORROR LITERATURE FROM OLEANDER RANDALLS ROUND by Eleanor Scott (Cut & Paste 9780900891953 to search)THE HOLE OF THE PIT by Adrian Ross (Cut & Paste 9780900891861 to search)STONEGROUND GHOST TALES by EG Swain (Cut & Paste 9780906672433 to search)",
  "genres": [
    "Short Stories",
    "Horror",
    "Fiction"
  ],
  "author": "Arthur  Gray",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/7376088-tedious-brief-tales-of-granta-and-gramarye"
}