{
  "title": "The Last Train from Hiroshima: The Survivors Look Back",
  "description": "Recently, there have been questions about the accuracy of some parts of this book. At this time, Tantor Media will continue to make it available to our customers, but we wanted to make you aware of the issues. Here is a statement from the hardcover publisher of the book, Henry Holt and Company: \"It is with deep regret that Henry Holt and Company announces that we will no longer print, correct or ship copies of Charles Pellegrino's The Last Train from Hiroshima due to the discovery of dishonest sources of information for the book. It is easy to understand how even the most diligent author could be duped by a source, but we also understand that this opens that book to very detailed scrutiny. The author of any work of non-fiction must stand behind its content. We must rely on our authors to answer questions that may arise as to the accuracy of their work and reliability of their sources. Unfortunately, Mr. Pellegrino was not able to answer the additional questions that have arisen about his book to our satisfaction.\"The Last Train from Hiroshima offers listeners a stunning \"you are there\" time capsule, gracefully wrapped in elegant prose. Charles Pellegrino's scientific authority and close relationship with the A-bomb's survivors make his account the most gripping and authoritative ever written. At the narrative's core are eyewitness accounts of those who experienced the atomic explosions firsthand—the Japanese civilians on the ground and the American fliers in the air. Thirty people are known to have fled Hiroshima for Nagasaki—where they arrived just in time to survive the second bomb. One of them, Tsutomu Yamaguchi, is the only person who experienced the full effects of the cataclysm at ground zero both times. The second time, the blast effects were diverted around the stairwell in which Yamaguchi had been standing, placing him and a few others in a shock cocoon that offered protection, while the entire building disappeared around them. Pellegrino weaves spellbinding stories together within a narrative that challenges the \"official report,\" showing exactly what happened in Hiroshima and Nagasaki—and why.",
  "genres": [
    "History",
    "Nonfiction",
    "Japan",
    "War",
    "World War II",
    "Historical",
    "Science"
  ],
  "author": "Charles Pellegrino",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/7384321-the-last-train-from-hiroshima"
}