{
  "title": "Stahl's Illustrated Mood Stabilizers",
  "description": "All of the titles in the Stahl’s Illustrated Series are designed to be fun. Concepts are illustrated by full-color images that will be familiar to all readers of Stahl’s Essential Psychopharmacology, Third Edition and The Prescriber’s Guide. The texts in this user-friendly series can be supplements to figures, images, and tables. The visual learner will find that these books make psychopharmacology concepts easy to master, while the non-visual learner will enjoy a shortened text version of complex psychopharmacology concepts. Within each book, each chapter builds on previous chapters, synthesizing information from basic biology and diagnostics to building treatment plans and dealing with complications and comorbidities. Novices may want to approach Stahl’s Illustrated Series by first looking through all the graphics and gaining a feel for the visual vocabulary. Readers more familiar with these topics should find that going back and forth between images and text provides an interaction with which to vividly conceptualize complex pharmacologies. And, to help guide the reader toward more in-depth learning about particular concepts, each book ends with a Suggested Reading section. ************************************** CME Information Sponsor This activity is sponsored by Neuroscience Education Institute. Support This activity is supported solely by the sponsor, Neuroscience Education Institute. Neither the Neuroscience Education Institute nor Stephen M. Stahl, MD, PhD, has received any funds or grants in support of this educational activity. Accreditation and Credit Designation Statements The Neuroscience Education Institute is accredited by the Accreditation Council for Continuing Medical Education to provide continuing medical education for physicians. The Neuroscience Education Institute designates this educational activity for a maximum of 3.0 AMA PRA Category 1 Credits TM. Physicians should only claim credit commensurate with the extent of their participation in the activity. Non-physicians may receive a certificate of participation for completing this activity. CME Credit Expiration June, 2011",
  "genres": [],
  "author": "Stephen M. Stahl",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/7383140-stahl-s-illustrated-mood-stabilizers"
}