{
  "title": "الخوف أبقاني حياً",
  "description": "النيل والفرات:في هذه الرواية: (الخوف أبقاني حياً) وضمن غابة كثيفة الرمز وكوكبة من الشخصيات شديدة التعقيد والخصوصية، والحكاية المتشابكة التي تتساقط مكوناتها أمامنا بترتيب وهدوء غاية في الدقة والبراعة يدخل عبد الله الغزال بالرواية العربية مدخلاً جديداً يمكن تسميته بسرد الأعماق المشوهة، ومن تلك الأعماق الغائرة وباستخدام كم هائل من الفواعل المختلفة والمتباينة يبدأ في رسم فجاعة المشهد الداخلي الخفي لشخصياته وعوالمهم غير الظاهرة. يبدأ في ذلك مع حرص واضح على تقليص الدفق الشعري شعرية لغته الروائية (التي كانت على أشدها في مجموعته القصصيو السوأة، ثم في النصف الأول من روايته القوقعة) لتكون أداته هذه المرة أو شخصيته المحورية طبيب أطفال شاب يعاني من خالة تشوه نفسي وجسدي.ينطلق السرد من أعماق هذه الذات المأزومة في لحظة من أشد لحظاتها عتواً وعصفاً وضياعاً بين رياح الشك والشعور باليقين المهزوم، ومعها ومع هدوئها القاتل وفي تقف على حافة الجنون نبدأ رحلة النكش عن أسرار مجتمع روائي متكامل مثخن بالمحن، والتحول الوجل بين مناطق لا يصلها ضوء هي غاية في العمق والاستغلاق في النفس الإنسانية، عندما يقف الإنسان في مواجهة دامية انتحارية مع ذاته. تلك النفس المتفسخة المرهقة التي لا تبتعد كثيراً على أن تكون أنت وأنا.وعلى عكس رواية التابوت التي قامت أساساتها على بناء محكم للشخصيات المحورية وهي تستعد للسفر للجنوب الليبي لخوض تجربة الحرحرب، التي يعبر فيها الراوي بواسطة قوى الطبيعة (أشعة الشمس ووهج قائلة الظهيرة) على حدة احتدام وتأزم الشخصيات من الداخل، وكذلك على عكس رواية القوقعة التي تقوم روحها التأملية العالية منذ الدباية على أسطرة الشمال من داخل وعي أهل الجنوب (ميكال الشاب الزنجي القادم من النيجر) حيث الحديث عن البحر العظيم بلغة الإجلال التي تتاخم الحدود المطلقة للأشياء، على عكس كل ذلك نجد في رواية (الخوف أبقاني حياً) لغة الوهن والاستكانة والموت الصامت البطئ، لغة التجارب الخاسرة والشعور المقيت بالعار وعدم الاحترام للذات.هذا التأزم بطول النص لا يتخذ مستوى فردياً واحداً، إنما يحدث على كافة المستويات بحيث تنساب الرواية انسياباً منظماً ملفعاً بالفجيعة، ولا يخلو أحياناً من بهجة سوداء عبر وعي ذلك الطبيب المشوه مبتور الأصابع الذي يتناهبه وهي برص مقطوع الذيل فقد القدرة على إعادة ذيله المقطوع، وتتآكله نيران الغيرة والشك وأوهام السيطرة الروحية على الأشياء حوله وهو يترجم لنا انعكاسات العالم من حوله على صفحة كينونته العميقة التضررة لتصبح عوالمه الباطنة صورة حية للواقع الليبي والعربي المعاصر، وليصبح هذا الواقع (الذي صار مجتمع الرواية) أداة الروائي يطرق بها كل ما يريد طرقه من أبواب أزمات الأوطان المخلخلة.في المدينة يجف النبع الحار وسط غابة النخيل العتيقة وتهاجم الجرذان والصراصير البيوت وتشك إبر الشك الحادة والهواجس المعقدة المؤججة بيأس غامض ذهن ذلك الطبيب، وهو يتابع بخوف حكاية صديقه (حامد) الفنان الذي بدأ موته الغامض المباغت منطوياً على سر كبير. ثم (يوسف) الفنان التشكيلي الذي يعيش حالة يأس وجودي هو الاخر. وتشتد حدة وعي بطل الرواية بكينونته المشوهة داخلياً وخارجياً خاصة عندما يرى صورته في عين الأنثى، أي أنثى، تلك الأنثى الزوجة شديدة الطهر (مالكة) المشكوك بعفتها بالرغم من كل ذلك، أو أنثى أخرى غريبة منحطة (فتاة الملهى). ومع انطلاق حركة دفة السرد في بحار تلك الذوات العميقة تبدأ الأشياء في التساقط والتهاوي أمامنا بوهن وهدوء قاتل مصبوغة بعمق وفلسفة الشاعر.",
  "genres": [],
  "author": "عبد الله الغزال",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/7381581"
}