{
  "title": "The Liberators: America's Witnesses to the Holocaust",
  "description": "At last, the everyday fighting men who were the first Americans to know the full and horrifying truth about the Holocaust share their astonishing stories. Rich with powerful never-before-published details from the author’s interviews with more than 150 U.S. soldiers who liberated the Nazi death camps, The Liberators is an essential addition to the literature of World War II—and a stirring testament to Allied courage in the face of inconceivable atrocities.Taking us from the beginnings of the liberators’ final march across Germany to V-E Day and beyond, Michael Hirsh allows us to walk in their footsteps, experiencing the journey as they themselves experienced it. But this book is more than just an in-depth account of the liberation. It reveals how profoundly these young men were affected by what they saw—the unbelievable horror and pathos they felt upon seeing “stacks of bodies like cordwood” and “skeletonlike survivors” in camp after camp. That life-altering experience has stayed with them to this very day. It’s been well over half a century since the end of World War II, and they still haven’t forgotten what the camps looked like, how they smelled, what the inmates looked like, and how it made them feel. Many of the liberators suffer from what’s now called post-traumatic stress disorder and still experience Holocaust-related nightmares. Here we meet the brave souls who—now in their eighties and nineties—have chosen at last to share their stories. Corporal Forrest Robinson saw masses of dead bodies at Nordhausen and was so horrified that he lost his memory for the next two weeks. Melvin Waters, a 4-F volunteer civilian ambulance driver, recalls that a woman at Bergen-Belsen “fought us like a cat because she thought we were taking her to the crematory.” Private Don Timmer used his high school German to interpret for General Dwight Eisenhower during the supreme Allied commander’s visit to Ohrdruf, the first camp liberated by the Americans. And Phyllis Lamont Law, an army nurse at Mauthausen-Gusen, recalls the shock and, ultimately, “the hope” that “you can save a few.”From Bergen-Belsen in northern Germany to Mauthausen in Austria, The Liberators offers readers an intense and unforgettable look at the Nazi death machine through the eyes of the men and women who were our country’s witnesses to the Holocaust. The liberators’ recollections are historically important, vivid, riveting, heartbreaking, and, on rare occasions, joyous and uplifting. This book is their opportunity, perhaps for the last time, to tell the world.",
  "genres": [
    "History",
    "Holocaust",
    "World War II",
    "Nonfiction",
    "War",
    "American History",
    "Biography"
  ],
  "author": "Michael Hirsh",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/7379695-the-liberators"
}