{
  "title": "Men Who Hate Women and Women Who Kick Their Asses: Stieg Larsson's Millennium Trilogy in Feminist Perspective",
  "description": "Stieg Larsson was an unabashed feminist in his personal and professional life and in the fictional world he created, but The Girl with the Dragon Tattoo, The Girl Who Played with Fire,  and The Girl Who Kicked the Hornet s Nest are full of graphic depictions of violence against women, including stalking, sexual harassment, child abuse, rape, incest, serial murder, sexual slavery, and sex trafficking, committed by vile individual men and by corrupt, secretive institutions. How do readers and moviegoers react to these depictions, and what do they make of the women who fight back, the complex masculinities in the trilogy, and the ambiguous gender of the elusive Lisbeth Salander? These lively and accessible essays expand the conversation in the blogosphere about the novels and films by connecting the controversies about gender roles to social trends in the real world.PART IMisogyny and mayhem. Always ambivalent : Why media is never just entertainment / Abby L. FerberKick-ass feminism : Violence, resistance, and feminist avengers in Larsson's trilogy / Kristine De WeldeLisbeth Salander as \"final girl\" in the Swedish \"Girl who\" films / Karen A. RitzenhoffAccounts of violence against women : The potential of realistic fiction / Roberta VillalnState complicity in men's violence against women / Patricia Yancey MartinPART IIGender and power in the new millennium. The gender ambiguity of Lisbeth Salander : Third-wave feminist hero? / Judith LorberThird-wave rebels in a second-wave world : Polyamory, gender,. and power / Mimi SchippersMen who love women : Pro-feminist masculinities in the millennium trilogy / Michael KimmelTiny, tattooed, and tough as nails : Representation of Lisbeth Salander's body / Catherine (Kay) G. ValentineHacker republic : Cyberspace and the feminist appropriation of technology / Sophie Statzel Bjork-JamesIs this what equality looks like? : Working women in the millennium trilogy / Diane E. LevyPART IIISwedish perspectives. Corporations, the welfare state, and covert misogyny in The Girl with the Dragon Tattoo / Anna Westersthl Stenport and Cecilia Ovesdotter AlmLisbeth Salander and her Swedish crime fiction \"sisters\" : Stieg Larsson's hero in a genre context / Kerstin BergmanIs Mikael Blomkvist the man of the millennium? : A Swedish perspective on masculinity and feminism in Larsson's millennium trilogy / Sara Krrholmpt. IV. Readers' responses. An open letter to the next Stieg Larsson / LeeAnn KrieghPippi and Lisbeth : Fictional heroes across generations / Meika LoeFeminist bloggers kick Larsson's ass : Reading resistance online / Jessie DanielsFeminist avenger or male fantasy? : Reading the reception of the millennium trilogy / Caryn Murphy",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Sociology"
  ],
  "author": "Donna  King",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13043619-men-who-hate-women-and-women-who-kick-their-asses"
}