{
  "title": "The Puppeteers: The People Who Control the People Who Control America",
  "description": "AN INSTANT NEW YORK TIMES BESTSELLERWhy does it feel like no matter what happens in American politics, the Democrats still get their way?When he left Congress in 2017, Jason Chaffetz still thought elections could save us. For generations, conservatives have hoped that freedom-loving congressional majorities could turn back the tide and restore America’s liberties and prosperity.But now, he says, winning elections will not be enough.Increasingly, the work of government is being done by people outside the government—unelected power brokers who are invisible to the American public but who pull the strings, set the agendas, create the incentives, and write the rules we must all live by. Using both government and non-governmental institutions, leftists have bypassed the legislative process to compel institutional compliance with partisan goals. The White House or the Congress may change hands, but the left remains in power.In The Puppeteers, Chaffetz reveals Susan Rice was put in charge of using the bureaucracy to make sure Republicans never win another electionThe federal government now could be deployed to harvest ballots from DemocratsPresident Biden hired a Blackrock executive to run his economic agenda for the first two years of his presidencyState treasurers planned to use billions of government dollars to “address climate change” and “racial inequality,” with almost no way for voters to stop themRandi Weingarten makes more decisions for the education department than people who actually work thereElecting the right leaders is no longer enough. To take back our country, the American people need to understand that they’re in a new fight. But it’s a fight that’s still eminently winnable, and Chaffetz reveals the playbook.",
  "genres": [
    "Politics",
    "Nonfiction",
    "American"
  ],
  "author": "Jason Chaffetz",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/73836893-the-puppeteers"
}