{
  "title": "Beyond the Gardens",
  "description": "She was a shy artist, who was afraid to blossom into the beautiful flower she was meant to grow into. At the age of 18, Esperanza Ignacio begins her college years at an upscale Los Angeles art school, where she studies to fulfill her long-term dream in Animation. But she soon learns the truth to the old folktale: \"you can take the girl out of the barrio, but you can't take the barrio out of the girl.\" Even though she's getting financial aid, Esperanza works a part-time job during her break from classes just to make ends meet. Her roommate, Anna, is what she calls a \"chicana from Beverly Hills\" because of the rich daddy and the new car she got for her quinceaera. Things get a little confusing for Esperanza when an old friend comes looking for her, hoping to start a meaningful relationship. But is Carlos the right guy for her? She never even considered him to be anything more than a friend since high school. Then comes Jake, a gorgeous mechanic, who shares her passion for books and loves her for who she is. What's a girl to do? Strength and determination help pave the way for the future. And, as she approaches her graduation, she is faced with a difficult decision: should she leave Los Angeles and leave behind her family, her home, and everything she's known? Ever since she was born in the California barrio of Hawaiian Gardens, she's always had to look over the fence, wondering what she's been missing. Now she's taking a flying leap over to see what's beyond the little barrio. What's beyond her family, her friends, and her past? What's beyond the little nothing town, where dreams don't exist? What's beyond The Gardens? Is it life, love, a future? The story of Esperanza is finally concluded in this wildly entertaining and heart-warming sequel.",
  "genres": [
    "Romance",
    "Fiction"
  ],
  "author": "Sandra C. Lopez",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/7383845-beyond-the-gardens"
}