{
  "title": "Memories of Silk and Straw: A Self-Portrait of Small-Town Japan",
  "description": "Over 50 reminiscences of pre-modern Japan—illustrations of a way of life that has virtually disappeared. Voted \"Best Book of the Year\" by Japan's foreign press.This is a collective biography, based on interviews taped by a small-town doctor, recording the lives of a cotton dyer, blacksmith, tofu maker, undertaker, carter, tenant farmer, local gangster, casual laborer, horse-meat butcher, magistrate's wife, apprentice geisha, rice merchant, thatcher, carpenter, midwife, county hangman, pawnbroker, draper, fisherman, hairdresser, servant, charcoal burner, and so on-over fifty in all. Their memories are all related to a lakeside town and its rural suburbs northeast of Tokyo.Born in the early years of this century, these people have both seen the old Japan and lived through the changes brought about by modernization and the onset of affluence. In a real sense, they provide the sole surviving links with a feudal way of life and its attitudes which have altered, in thespace of fifty years or so, beyond recognition.Through plain-spoken anecdote—their voices by turns amused, nostalgic, disturbing but unsensational—they describe their youth in a tougher world where poverty was commonplace, where unwanted children were sometimes \"thinned out'' at birth, where poorer families cooked out-of-doors and fishermen insummer went almost naked. By saving their memories for posterity, the author hoped to close, just a fraction, the gap in perception between a traditional past and the Japan we know today. The result—as the distinguished anthropologist, Ronald Dore, says in his preface—is \"a book to savor, and a bookto learn from.\"These reminiscences are accompanied by illustrations painted by the author's father, Dr. Susumu Saga—themselves a record of an old man's past.",
  "genres": [
    "Japan",
    "History",
    "Nonfiction",
    "Memoir",
    "Asia",
    "Japanese Literature",
    "Travel"
  ],
  "author": "Junichi Saga",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/740082.Memories_of_Silk_and_Straw"
}