{
  "title": "Catch Me If I Fall",
  "description": "Twins Ashleigh and Aiden have always promised to protect each other, but after an accident on a school trip, Aiden starts behaving strangely. Are they just growing apart, or is something more sinister going on? In a future Australia ravaged by climate change, twins Ashleigh and Aiden Delatour have always promised to protect and be there for each other, no matter what. Their privileged upbringing and loving, wealthy parents leave them with little to worry about. But when Aiden is seriously injured during a school trip, the twins’ entire world begins to unravel.  Back home from the hospital, something about Aiden seems different and Ashleigh’s quest to find out why will uncover dark truths about the world they thought they knew, challenge their bond as twins and push how far they are willing to go to keep their promises. Catch Me If I Fall is a thrilling, timely examination of the possible future of our planet, the true meaning of family and our responsibilities to each other.Key Text FeatureschaptersdialogueepilogueexplanationprologueCorrelates to the Common Core State Standards in English Language CCSS.ELA-LITERACY.RL.4.3Describe in depth a character, setting, or event in a story or drama, drawing on specific details in the text (e.g., a character's thoughts, words, or actions).CCSS.ELA-LITERACY.RL.5.6Describe how a narrator's or speaker's point of view influences how events are described.CCSS.ELA-LITERACY.RL.6.3Describe how a particular story's or drama's plot unfolds in a series of episodes as well as how the characters respond or change as the plot moves toward a resolution.CCSS.ELA-LITERACY.RL.6.6Explain how an author develops the point of view of the narrator or speaker in a text.",
  "genres": [
    "Young Adult",
    "Dystopia",
    "Science Fiction",
    "Fiction",
    "Middle Grade",
    "Family",
    "Friendship"
  ],
  "author": "Barry Jonsberg",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/73994060-catch-me-if-i-fall"
}