{
  "title": "The Fellowship: The Untold Story of Frank Lloyd Wright and the Taliesin Fellowship",
  "description": "Frank Lloyd Wright was renowned during his life not only as an architectural genius, but as a subject of controversy -- from his radical design innovations to his turbulent private life, including the notorious mass murder that occurred at his Wisconsin estate, Taliesin, in 1914. Yet, as this landmark new book reveals, that estate also gave rise to one of the most fascinating and provocative experiments in American cultural history: the Taliesin Fellowship, an extraordinary architectural colony where Wright trained hundreds of devoted apprentices, while using them as the de facto architectural practice where all of his late masterpieces -- Fallingwater, Johnson Wax, the Guggenheim Museum -- were born. A decade in the making, The Fellowship draws on hundreds of new and unpublished interviews, along with countless unseen documents from the Wright archives, to create a captivating portrait of Taliesin and the three mercurial figures at its center: Wright, his imperious wife Olgivanna Hinzenberg, and her spiritual master, the Greek-Armenian mystic Georgi Gurdjieff. Authors Roger Friedland and Harold Zellman reveal how the idealistic community of Taliesin became a kind of fiefdom, where young apprentices were both inspired and manipulated by the architect and his wife. They trace the decades-long war of wills between Wright and Olgivanna, in which organic architecture was pitted against esoteric spiritualism in a struggle for the soul of Taliesin. They chronicle Wright's perennial battles with clients, bankers, and the government, which suspected him of both communist and fascist sympathies. And through it all they tell the stories of Wright's devoted apprentices -- many of them gay men -- who found an uncertain refuge in the architect s Wisconsin and Arizona compounds, and who helped the master realize his dreamlike architectural visions, often at great personal cost. Epic in scope yet intimate in its detail, The Fellowship is an unforgettable story of genius and ego, sex and violence, mysticism and utopianism -- a magisterial work of biography that will forever change how we think about Frank Lloyd Wright and his world.",
  "genres": [
    "Biography",
    "Architecture",
    "History",
    "Nonfiction",
    "Art History",
    "Biography Memoir",
    "Design"
  ],
  "author": "Roger Friedland",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/73909.The_Fellowship"
}