{
  "title": "The Language Police: How Pressure Groups Restrict What Students Learn",
  "description": "Before Anton Chekhov and Mark Twain can be used in school readers and exams, they must be vetted by a bias and sensitivity committee. An anthology used in Tennessee schools changed \"By God!\" to \"By gum!\" and \"My God!\" to \"You don't mean it.\" The New York State Education Department omitted mentioning Jews in an Isaac Bashevis Singer story about prewar Poland, or blacks in Annie Dillard's memoir of growing up in a racially mixed town. California rejected a reading book because The Little Engine That Could was male. Diane Ravitch maintains that America's students are compelled to read insipid texts that have been censored and bowdlerized, issued by publishers who willingly cut controversial material from their books--a case of the bland leading the bland. The Language Police is the first full-scale expose of this cultural and educational scandal, written by a leading historian. It documents the existence of an elaborate and well-established protocol of beneficent censorship, quietly endorsed and implemented by test makers and textbook publishers, states, and the federal government. School boards and bias and sensitivity committees review, abridge, and modify texts to delete potentially offensive words, topics, and imagery. Publishers practice self-censorship to sell books in big states. To what exactly do the censors object? A typical publisher's guideline advises that - Women cannot be depicted as caregivers or doinghousehold chores.- Men cannot be lawyers or doctors or plumbers. They must be nurturing helpmates.- Old people cannot be feeble or dependent; they must jog or repair the roof.- A story that is set in the mountains discriminates against students from flatlands.- Children cannot be shown as disobedient or in conflict with adults.- Cake cannot appear in a story because it is not nutritious. The result of these revisions are--no surprise!--boring, inane texts about a cotton-candy world bearing no resemblance to what children can access with the click of a remote control or a computer mouse. Sadly, data show that these efforts to sanitize language do not advance learning or bolster test scores, the very reason given for banning allegedly insensitive words and topics. Ravitch offers a powerful political and economic analysis of the causes of censorship. She has practical and sensible solutions for ending it, which will improve the quality of books for students as well as liberating publishers, state boards of education, and schools from the grip of pressure groups. Passionate and polemical, The Language Police is a book for every educator, concerned parent, and engaged citizen.",
  "genres": [
    "Nonfiction",
    "Education",
    "Politics",
    "Language",
    "Sociology",
    "History",
    "Linguistics"
  ],
  "author": "Diane Ravitch",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/1304525.The_Language_Police"
}