{
  "title": "Belly of the Beast",
  "description": "Lady Mariel has no clue her life is forfeit until the Trull, Behsart, comes to collect her to take her to the Castle Valdamer to be sacrificed to the demons. She has only one ally—Cavan, Lord of Reugal, whose body the lesser demon, Behsart, occupies. Her only weapon is the one Behsart has given her--his lust for her. Each time he succumbs to carnal pleasure, he grows weaker and Cavan grows stronger, but time is not something she has in plenty. Behsart is to take her on pilgrimage to each of the seven demons so that they may sample their bride. If she can not escape Behsart, or please the demons and convince them that she is worth more to them as a concubine than a sacrifice, her spirit will be yielded up to them for eternity once she has reached the Castle Valdamer. This is an almost no-holds-barred BDSM erotica. Contains explicit sex and language, some F/F scenes, multiple partners, bondage, domination/submission, anal sex, oral sex, sexual mastery as well as a sub plot of romance. Fantasy Erotica.The Road to RomanceReviewed by Ansley VelardeBELLY OF THE BEAST is an extremely dark, sensual journey into Ms. Acuna’s imagination. By her own admission, in the introduction to the novel, she writes that she pushed the envelope with this one, and tested the boundaries of her imagination. Lady Mariel’s journey into submission and obedience is at times horrifying and at other times arousing. Her body is subjected to relentless sexual rituals and countless acts of humiliation. While I was horrified by some of the content, I couldn’t stop reading to see how it ended. I had to know if Mariel would keep her life or lose it as a human sacrifice. At the same time, I found myself attracted to Behsart’s character, also known as Cavan, whose body he inhabits. He is dark and seemingly dangerous, yet he takes Mariel to new heights of pleasure and attempts to protect her from her harsh treatments. BELLY OF THE BEAST is indeed a dark journey. It is shocking and appalling, yet devastatingly sexual, sensual, and arousing.The Romance Studio Torie WestOverall 4 HEARTS!. . . the plot and unfolding of the story are superb and make up for the shortcomings. Plus the Trull is a romantic figure despite his sometimes-brusque treatment of Mariel. I highly recommend this book for fans of erotic romance that like a more razor sharp edge to their plots.",
  "genres": [
    "Demons",
    "BDSM",
    "Erotica",
    "Menage",
    "Fantasy",
    "Multiple Partners"
  ],
  "author": "Desiree Acuna",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/7414776-belly-of-the-beast"
}