{
  "title": "Florida: A Short History",
  "description": "\"An exciting voyage through Florida’s past. . . . Almost every page could make you say, I didn’t know that!\"Tampa Tribune\"Gannon’s love for Florida comes through in a marvelous narrative style [that] doesn’t bog down in dates and reams of facts that historians find interesting, but others don’t.\"--Miami Herald\"First rate . . . desperately needed . . . entertaining . . . fun!\"--Orlando Sentinel\"Gannon is a lifelong student of the history of his state, an acclaimed teacher, a masterful and tireless raconteur, and a superb stylist. A Short History showcases each of these strengths and talents and contains the latest archaeological and historical scholarship.\"--Florida Historical QuarterlyAs if Ponce de León, who happened on the peninsula in 1513, returned today to demand a quick reckoning (“Tell me what happened after I was there, but leave out the boring parts!”), Michael Gannon recounts the longest recorded history of any state in the nation in twenty-seven brisk, fully illustrated chapters.From indigenous tribes who lived along spring-fed streams to environmentalists who labor to \"Save Our Rivers,\" from the first conquistadors whose broad black ships astonished the natives to the 123,000 refugees whose unexpected immigration stunned South Floridians in 1980, the story of the state is as rich and distinctive as the story of America.And it’s older than most people think. As Gannon writes, “By the time the Pilgrims came ashore at Plymouth, St. Augustine was up for urban renewal. It was a town with fort, church, seminary, six-bed hospital, fish market, and about 120 shops and houses. Because La Florida stretched north from the Keys to Newfoundland and west to Texas, St. Augustine could claim to be the capital of much of what is now the United States.”Gannon tells his fast-marching saga in chronological fashion. Starting with the wilderness of the ancient earth, he fills the landscape with Indians, colonists, pioneers, entrepreneurs, politicians, and the panorama of Florida today--“the broad superhighways that wind past horse farms, retirement communities, international airports, launch pads, futuristic attractions, and come to rest, finally, amidst the gleaming towers of Oz?like cities.” This revised edition concludes with a look into the twenty-first century, including “in-migration,” restoration of the Everglades, education, the work force, and the infamous 2000 presidential election.Michael Gannon is distinguished service professor emeritus of history at the University of Florida. Among other honors, he has received the first Arthur W. Thompson Prize from the Florida Historical Society and the decoration Knight Commander of the Order of Isabel la Católica from King Juan Carlos I of Spain. He is the author of the best-selling Operation Drumbeat and editor of The New History of Florida.",
  "genres": [
    "Nonfiction",
    "American History"
  ],
  "author": "Michael Gannon",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/741455.Florida"
}