{
  "title": "The New History of Florida",
  "description": "The New History of Florida, the first comprehensive history of the state to be written in a quarter of a century, is the culmination of the most recent and significant work from a galaxy of specialists. Each of the 22 chapters, which weave together in one continuous narrative, was written especially for this volume. Their authors present here not only political, economic, military, and religious information but also social history and personal experiences. Endnotes and a bibliography are appended to each chapter.  Florida's first inhabitants entered the peninsula and panhandle about 10,000 years ago. The Spaniard Juan Ponce de León stumbled ashore near Melbourne Beach in 1513. He called the place La Florida, the first permanent geographic name of European origin to be etched upon the maps of the American continent. Over three centuries of Spanish and English colonial history followed before the United States acquired Florida in 1821. The first state flag was raised over a new capitol in Tallahassee on May 26, 1845. Written to observe the sesquicentennial of statehood, this work will document the rich history of the Sunshine State for general readers, students, and scholars well into the twenty-first century. ContentsIntroduction, by Michael GannonOriginal Inhabitants, by Jerald T. MilanichFirst European Contacts, by Michael GannonSettlement and Survival, by Eugene LyonRepublic of Spaniards, Republic of Indians, by Amy Turner BushnellThe Missions of Spanish Florida, by John H. HannRaids, Sieges, and International Wars, by Charles W. ArnadePensacola, 1686-1763, by William S. CokerBritish Rule in the Floridas, by Robin F. A. FabelThe Second Spanish Period in the Two Floridas, by William S. Coker and Susan R. ParkerFree and Slave, by Jane LandersFlorida's Seminole and Miccosukee Peoples, by John K. Mahon and Brent R. WeismanU.S. Territory and State, by Daniel L. SchaferThe Civil War, 1861-1865, by Canter Brown, Jr.Reconstruction and Renewal, 1865-1877, by Jerrell H. ShofnerPrelude to the New Florida, 1877-1919, by Samuel ProctorFortune and The Paradoxical Twenties, by William W. RogersThe Great Depression, by William W. RogersWorld War II, by Gary R. MorminoFlorida Politics in the Twentieth Century, by David R. ColburnThe African American Experience in Twentieth-Century Florida, by Maxine D. JonesFrom Migration to A History of Florida Immigration, by Raymond A. Mohl and George E. PozzettaThe Big Change in the Sunshine A Social History of Modern Florida, by Raymond A. Mohl and Gary R. MorminoMichael Gannon, volume editor, is Distinguished Service Professor of History and director of the Institute for Early Contact Period Studies at the University of Florida. He is the author of Rebel Bishop (1964), The Cross in the The Early Catholic Church in Florida, 1513-1870 (UPF, 1965, 1983), Operation Drumbeat (1990), and the novel Secret Missions (1994); as well as the bestselling A Short History (UPF, 1993), which won a Certificate of Commendation from the American Association for State and Local History.",
  "genres": [
    "History",
    "Essays",
    "American History"
  ],
  "author": "Michael Gannon",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/741456.The_New_History_of_Florida"
}