{
  "title": "Christy Miller Collection, Vol. 4",
  "description": "The first twelve books in the popular Christy Miller series are now available in four treasured volumes!The last three books, collected in one page-turning volume, conclude the bestselling Christy Miller series with hope and promise! At the start of her senior year, Christy looks forward to growing closer to Todd, but her friendship with Katie is on the rocks, threatening the year she was certain would be A Time to Cherish . With Sweet Dreams comes the start of a romantic summer. She’d be entirely swept off her feet if it wasn’t for the most difficult decision she’s ever had to make. And in A Promise Is Forever , Christy discovers foreign adventure is just her cup of tea. Follow Christy Miller as she stays true to her identity in Christ, drawing closer to God for help in realizing her dreams and dealing with her disappointments.Whether you’re meeting her for the first time or have known her for years—Christy Is a Forever FriendA Time to CherishFor Labor Day weekend, Christy Miller is on a houseboat at Lake Shasta. What could be better? She’s about to find out! Before they know it, both Christy and her best friend, Katie, are receiving some unexpected male attention. But somehow these best friends are at odds just when they should be having the most fun together. Christy soon realizes that sometimes you have to stand back and let people make their own decisions, even when they’re headed for a fall. And although life is never perfect, this is definitely a time to cherish.Sweet DreamsChristy Miller’s senior year is delicious, especially the time she spends with Todd. But her best friend, Katie, is struggling—she’s realized she needs to break up with Michael. It’s not easy! Fortunately both Doug and Disneyland help Katie to cheer up. Christy is learning to let go and get out of the way so that her friends can become who they’re meant to be...even when it jeopardizes her own sweet dreams.A Promise Is ForeverChristy Miller’s going to Europe! It’s a three-week missions trip with Doug, Katie, and Tracy. First London for some sightseeing, and then a castle in the English countryside for group training. Christy is so excited to be headed for Belfast with her friends—despite some tension among them. But when plans go topsy-turvy at the last minute, Christy must face her fears and realize that some things are more important than her own comfort...and that even when she can’t foresee the end result, a promise truly is forever.Story Behind the Book“The Christy Miller series was actually born when a group of thirteen-year-olds challenged me to write a novel. I’d been questioning the content of their favorite books when they said, ‘Why don’t you write a book for us?’ I told them no, I only wrote picture books. But they ‘How hard could it be? We’ll even tell you what to write! We want a love story with teenagers at the beach.’ And there you go. Summer Promise first released seventeen years ago and is now translated into five languages. I continue to hear from readers all over the world, many girls saying that they gave their life to Christ after reading Summer Promise . I love that!” —Robin Jones Gunn",
  "genres": [
    "Christian Fiction",
    "Christian",
    "Young Adult",
    "Romance",
    "Fiction",
    "Contemporary",
    "Childrens"
  ],
  "author": "Robin Jones Gunn",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/74023.Christy_Miller_Collection_Vol_4"
}