{
  "title": "The King Arthur Flour Baker's Companion: The All-Purpose Baking Cookbook",
  "description": "Every kitchen comes equipped with a fundamental, dependable cookbook classic such as Joy of Cooking or Better Homes Gardens New Cookbook. Now bakers have a modern classic of their own. From leavening, mixing, proofing, and kneading, through shaping and baking, the experts at King Arthur Flour lead you through hundreds of easy and foolproof recipes from tricky yeast breads and sourdoughs, to trendy flatbreads and crackers, to family favorites such as pancakes and waffles. They also present fried doughs, quick breads, batter breads, biscuits, quiches, cobblers and crisps, cookies, cakes, brownies, pies, tarts, and pastries. For more than 200 years King Arthur Flour has been in the business of making the highest quality key ingredient in all of baking: flour. They've done decades of experimentation and research in their famous test kitchens on how the various ingredients in baked goods behave and why. The King Arthur Flour Baker's Companion now brings you more than 350 recipes that will teach you which ingredients work together, as well as what doesn't, and why. It is this knowledge that will allow you to unleash your own creativity and to experiment in the kitchen. You'll get a complete overview of ingredients in chapters on flours, sweeteners, leavens, fats, and more. You'll find information on substitutions and variations, as well as troubleshooting advice from the pros at King Arthur. Recipes are enhanced with sidebars that share baking secrets and provide clear-step-by-step instructions, and each recipe is accompanied by a detailed nutritional analysis. Techniques are further explained with easy-to-follow illustrations by culinary illustrator Laura Hartman Maestro. The King Arthur Flour Baker's Companion is the definitive kitchen resource. Exhaustive in scope, authoritative in style, and offering clear, practical, and encouraging instruction, it is the one book you'll turn to every time you bake. Like your set of measuring cups and favorite wooden spoon, it will become an essential kitchen tool. No kitchen in America should be without a copy.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Cuisine",
    "Culinary"
  ],
  "author": "King Arthur Baking Company",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/74044.The_King_Arthur_Flour_Baker_s_Companion"
}