{
  "title": "The Good Fight: Why Liberals - and Only Liberals - Can Win the War on Terror and Make America Great Again",
  "description": "Once upon a time, liberals knew what they believed. They believed America must lead the world by persuasion, not command. And they believed that by championing freedom overseas, America itself could become more free. That liberal spirit won America's trust at the dawn of the cold war. Then it collapsed in the wake of Vietnam. Now, after 9/11, and the failed presidency of George W. Bush, America needs it back. In this powerful and provocative book, Peter Beinart offers a new liberal vision, based on principles liberals too often forget: That America's greatness cannot simply be asserted; it must be proved. That to be good, America does not have to be pure. That American leadership is not American empire. And that liberalism cannot merely define itself against the right, but must fervently oppose the totalitarianism that blighted Europe a half century ago, and which stalks the Islamic world today. With liberals severed from their own history, conservatives have drawn on theirs—the principles of national chauvinism and moral complacency that America once rejected. The country will reject them again, and embrace the creed that brought it greatness before. But only if liberals remember what that means. It means an unyielding hostility to totalitarianism—and a recognition that defeating it requires bringing hope to the bleakest corners of the globe. And it means understanding that democracy begins at home, in a nation that does not merely preach about justice, but becomes more just itself. Peter Beinart's The Good Fight is a passionate rejoinder to the conservatives who have ruled Washington since 9/11. It is an intellectual lifeline for a Democratic Party lying flat on its back. And it is a call for liberals to revive the spirit that swept America, and inspired the world.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Terrorism"
  ],
  "author": "Peter Beinart",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/741347.The_Good_Fight"
}