{
  "title": "In Spite of the Gods: The Strange Rise of Modern India",
  "description": "India remains a mystery to many Americans, even as it is poised to become the world’s third largest economy within a generation, outstripping Japan. It will surpass China in population by 2032 and will have more English speakers than the United States by 2050. In In Spite of the Gods, Edward Luce, a journalist who covered India for many years, makes brilliant sense of India and its rise to global power. Already a number-one bestseller in India, his book is sure to be acknowledged for years as the definitive introduction to modern India. In Spite of the Gods illuminates a land of many contradictions. The booming tech sector we read so much about in the West, Luce points out, employs no more than one million of India’s 1.1 billion people. Only 35 million people, in fact, have formal enough jobs to pay taxes, while three-quarters of the country lives in extreme deprivation in India’s 600,000 villages. Yet amid all these extremes exists the world’s largest experiment in representative democracy—and a largely successful one, despite bureaucracies riddled with horrifying corruption. Luce shows that India is an economic rival to the U.S. in an entirely different sense than China is. There is nothing in India like the manufacturing capacity of China, despite the huge potential labor force. An inept system of public education leaves most Indians illiterate and unskilled. Yet at the other extreme, the middle class produces ten times as many engineering students a year as the United States. Notwithstanding its future as a major competitor in a globalized economy, American. leaders have been encouraging India’s rise, even welcoming it into the nuclear energy club, hoping to balance China’s influence in Asia. Above all, In Spite of the Gods is an enlightening study of the forces shaping India as it tries to balance the stubborn traditions of the past with an unevenly modernizing present. Deeply informed by scholarship and history, leavened by humor and rich in anecdote, it shows that India has huge opportunities as well as tremendous challenges that make the future “hers to lose.”",
  "genres": [
    "India",
    "Nonfiction",
    "History",
    "Politics",
    "Economics",
    "Asia",
    "Indian Literature"
  ],
  "author": "Edward Luce",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/74121.In_Spite_of_the_Gods"
}