{
  "title": "Lilies Without",
  "description": "\"She has, like all good poets, created a music of her own, one suited to her concerns. When denizens of the 22nd century, if we get there, look back on our era and ask how we lived, they will take an interest both in the strangest personalities who gave their concerns verbal form, and in the most representative. The future will not—should not—see us by one poet alone. But if there is any justice in that future, Kasischke is one of the poets it will choose.” — Boston Review “Kasichke’s poems are powered by a skillful use of imagery and the subtle, ingenious way she turns a phrase.” — Austin American-Statesman Laura Kasischke in her own \"I realized while ordering and selecting the poems for this collection that much of my more recent work concerns body parts, dresses, and beauty queens. These weren't conscious decisions, just the things that found their way into my poems at this particular point in my life, and which seem to have attached to them a kind of prophetic potential. The beauty queens especially seemed to crowd in on me, in all their feminine loveliness and distress, wearing their physical and psychological finery, bearing what body parts had been allotted to them. For some time, I had been thinking about beauty queens like Miss Michigan, but also the Rhubarb Queen, and the Beauty Queens of abstraction—congeniality. And then—Brevity, Consolation for Emotional Damages, Estrogen—all these feminine possibilities to which I thought a voice needed to be given.\" Laura Kasischke is the author of six books of poetry, including Gardening in the Dark (Ausable Press, 2004) and Dance and Disappear (winner of the 2002 Juniper Prize), and four novels. Her work has received many honors, including the Alice Fay Di Castagnola Award from the Poetry Society of America, the Beatrice Hawley Award, the Pushcart Prize, and the Elmer Holmes Bobst Award for Emerging Writers. She teaches at the University of Michigan in Ann Arbor.",
  "genres": [
    "Poetry"
  ],
  "author": "Laura Kasischke",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/1304602.Lilies_Without"
}