{
  "title": "Evolution's Captain: The Dark Fate of the Man Who Sailed Charles Darwin Around the World",
  "description": "Evolution's Captain is the story of a visionary but now forgotten English naval officer but for whom the \"Darwinian Revolution\" would never have occurred. When Captain Robert FitzRoy, the twenty-six-year-old captain of the H.M.S. Beagle , set out for Tierra del Fuego in the fall of 1831, he invited a young naturalist to accompany him. That twenty-two-year-old gentleman was Charles Darwin, and perhaps no single voyage in history had a greater impact on how we would come to understand the world -- in both religious and scientific terms. When the Beagle 's first captain committed suicide while at sea in 1828, he was replaced by a young naval officer of a new mold. Robert FitzRoy was the most brilliant and scientific sea captain of his age. He used the Beagle , a survey vessel, as a laboratory for the new field of the natural sciences. But his plan to bring four \"savages\" home to England to civilize them as Christian gentlefolk backfired when scandal loomed over their sexual misbehavior at the Walthamstow Infants School. FitzRoy needed to get them out of England fast, and thus was born the second and most famous voyage of the Beagle . FitzRoy feared the loneliness of another long voyage -- with madness in his own family, he was haunted by the fate of the Beagle 's previous captain -- so for company he took with him the young amateur naturalist Charles Darwin. Like FitzRoy, Darwin believed, at the beginning of the voyage, in the absolute word of the Bible and the story of man's creation. The two men spent five years circling the globe together, but by the end of their voyage they had reached startlingly different conclusions about the origins of the natural world. In naval terms, the voyage was a stunning scientific success. But FitzRoy, a fanatical Christian, was horrified by the heretical theories Darwin began to develop. As these began to influence the profoundest levels of religious and scientific thinking in the nineteenth century, FitzRoy's knowledge that he had provided Darwin with the vehicle for his sacrilegious ideas propelled him down an irrevocable path to suicide. This true story -- part biography, part sea drama, and a subtle study of one of the defining moments in the history of science -- reads like the finest historical fiction. It is a chronicle of the remarkable chain of events without which Darwin would most likely have lived and died an obscure English country parson with a fondness for collecting beetles.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Science",
    "Evolution",
    "History Of Science",
    "Travel"
  ],
  "author": "Peter   Nichols",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/741622.Evolution_s_Captain"
}