{
  "title": "War Made New: Technology, Warfare, and the Course of History: 1500 to Today",
  "description": "A monumental, groundbreaking work of history that shows how technological and strategic revolutions have transformed the battlefield—from the Spanish Armada to the War on Terror— and how mastery of these innovations has shaped the rise and fall of nations and empires  In War Made New, acclaimed author Max Boot explores how innovations in warfare mark crucial turning points in modern history, influencing events well beyond the realm of combat. Combining gripping narrative history with wide-ranging analysis, Boot focuses on four “revolutions” in military affairs and describes key battles from each period to explain how inventions ranging from gunpowder to GPS-guided air-strikes have remade the field of battle— and shaped the rise and fall of empires.  Bringing to life battles from the defeat of the Spanish Armada to Wellington’s victory at Assaye, War Made New analyzes the Gunpowder Revolution and explains warfare’s evolution from ritualistic, drawn-out engagements to much deadlier events, precipitating the rise of the modern nation state. He next explores the triumph of steel and steam during the Industrial Revolution, including the British triumph at Omdurman and the climax of the Russo-Japanese war at Tsushima, showing how it powered the spread of European colonial empires. Moving into the twentieth century and the Second Industrial Revolution, Boot examines three critical clashes of World War II—the German army’s blitzkrieg, Pearl Harbor, and the firebombing of Tokyo—to illustrate how new technology such as the tank, radio, and airplane ushered in terrifying new forms of warfare that aided the rise of highly centralized, and even totalitarian, world powers. Finally, in his section on the Information Revolution, Boot focuses on the Gulf War, the invasion of Afghanistan, and the Iraq war, arguing that even as cutting-edge technologies such as stealth aircraft have made America the greatest military power in world history, advanced communications systems have allowed decentralized, “irregular” forces to become an increasingly significant threat to Western power. BACKCOVER: Advance Praise for War Made New “Max Boot traces the impact of military revolutions on the course of politics and history over the past 500 years. In doing so, he shows that changes in military technology are limited not to warfighting alone, but play a decisive role in shaping our world. Sweeping and erudite, while entirely accessible to the lay reader, this work is key for anyone interested in where military revolutions have taken us—and where they might lead in the future.” —U.S. Senator John McCain  “While much has been in written in recent years about the so-called ‘Revolution in Military Affairs,’ Max Boot is the first scholar to place it within the broad sweep of history, and in the context of the rise of the West in world affairs since 1500. In so doing, he not only tells a remarkable tale, but he compels us all, even those obsessed solely with contemporary military affairs, to ask the right questions and to distinguish what is truly new and revolutionary from what is merely ephemeral. He has rendered a valuable service, and given us a fascinating read at the same time, so we are doubly in his debt.” —Paul Kennedy, Professor of History at Yale University and author of The Rise and Fall of the Great Powers  “War Made New is impressive in scope. What is equally impressive is its unique interpretation of the causal relationship between technology, warfare and the contemporary social milieu. This is a superb thinking person's book which scrutinizes conventional historical wisdom through a new lens.” —Lt. Gen. Bernard E. Trainor, USMC (ret.), co-author of Cobra II: The Inside Story of the Invasion and Occupation of Iraq  “Max Boot's book takes hundred of years of tactical battle history and reduces it to an incisive narrative of how war has changed. By providing such a coherent view of the past, he has pointed us toward the future. What is doubly impressive is how he draws surprising, fresh lessons from wars we thought we knew so much about but in fact didn't.” —Robert D. Kaplan, author of Imperial Grunts",
  "genres": [
    "History",
    "Military Fiction",
    "War",
    "Military History",
    "Nonfiction",
    "Technology",
    "World History"
  ],
  "author": "Max Boot",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/74175.War_Made_New"
}