{
  "title": "Pitch Black",
  "description": "On the subway, do ever notice that people are always looking, but they only see what they want to? Things can be sitting right in front of them and still they can’t see it.That’s your guide Anthony speaking. He’ll show you how he lives in the tunnels underneath the New York City subway system—that is, if you’ll let him. Which is exactly what Youme decided she would do one afternoon when she and Anthony began a conversation in the subway about art. It turns out that both Youme and Anthony Horton are artists. While part of Youme’s art is listening long and hard to the stories of the people she meets, part of Anthony’s is making art out of what most people won’t even look at. Thus began a unique collaboration and conversation between these two artists over the next year, which culminated in Anthony’s biography, the graphic novel Pitch Black. With art and words from both of them, they map out Anthony’s world—a tough one from many perspectives, startling and undoing from others, but from Anthony’s point of view, a life lived as art.Youme Landowne (known as Youme) is a painter and book artist who thrives in the context of public art. She studied cross-cultural communication through art at the New School for Social Research and Friends World College. She has interned in public schools and has been a student at the Friends World College at the Nairobi and Kyoto campuses. Youme has lived in and learned from the United States, Kenya, Japan, Haiti, Laos, and Cuba. She currently lives in Brooklyn, New York.Anthony Horton lived most of his life as a homeless artist, surviving and creating in the secret underground tributaries of the NYC subway system. On February 5, 2012 Anthony died in a fire in an abandoned subway room under the city. \"Mr. Horton found solace in the blackness of the tunnels. He made the subway the subject of his canvases, the muse for a graphic novel that he co-wrote, and the place he called home for the better part of his adult life, even when he had other places to stay.\" —New York Times, Feb. 6, 2012",
  "genres": [
    "Graphic Novels",
    "Young Adult",
    "Graphic Novels Comics",
    "Art",
    "Adult",
    "African American",
    "Teen"
  ],
  "author": "Youme Landowne",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1304644.Pitch_Black"
}