{
  "title": "No Apology: The Case for American Greatness",
  "description": "On his first presidential visit to address the European nations, President Obama felt it necessary to apologize for America’s international power. He repeated that apology when visiting Latin America, and again to Muslims worldwide in an interview broadcast on Al-Arabiya television. In No Apology , Mitt Romney asserts that American strength is essential—not just for our own well-being, but for the world’s. Governments such as China and a newly-robust Russia threaten to overtake us on many fronts, and radical Islam continues its dangerous rise. Drawing on history for lessons on how great powers collapse, Romney shows how and why our national advantages have eroded. From the long-term decline of our manufacturing base, our laggard educational system that has left us without enough engineers, scientists, and other skilled professionals, our corrupted financial practices that led to the current crisis, and the crushing impact of entitlements on our future obligations, America is in debt, overtaxed, and unprepared for the challenges it must face. We need fresh ideas to cut through complicated problems and restore our strength. Creative and bold, Romney proposes simple solutions to rebuild industry, create good jobs, reduce out of control spending on entitlements and healthcare, dramatically improve education, and restore a military battered by eight years of war. Most important, he calls for a new commitment to citizenship, a common cause we all share, rather than a laundry list of individual demands. Many of his solutions oppose President Obama’s policies, many also run counter to Republican thinking, but all have one strategic to move America back to political and economic strength. Personal and dynamically-argued, No Apology is a call to action by a man who cares deeply about America’s history, its promise, and its future.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Audiobook",
    "Business",
    "History"
  ],
  "author": "Mitt Romney",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/7427700-no-apology"
}