{
  "title": "Weimar: A Cultural History 1918-1933",
  "description": "The 4-note motif running thru the chorus of The Threepenny Opera’s Barbara Song is a crowded bunch of notes–-it moves like a dancer stepping on his own toes–-& seems to be just about the most cynical, corrupt, sleazy & sexually knowing 4-note motif in music. “Nice chaps” who knew “how to treat a girl with due respect” once tried courting young Polly Peachum. But Polly was armed with a code of chaste behavior that, in Joanna von Koczian’s '58 performance, is explained 1st with a facetious tone of wide-eyed sincerity & then with a shocking cynical \"Oh, you can’t lie back, you must stay cold at heart!/Oh you must not let your feelings show./Oh, whenever you feel it might start,/Ah, then your only answer’ No.\" Dropping the punchline to her sick joke, Polly reveals to her horrified parents the reason why this code has allowed her to be seduced by the murderous criminal Macheath/Mac the “someone who didn’t ask at all…as he’d no idea of treating a girl with due respect, I could not tell him ‘No.’” Kurt Weill & Bertolt Brecht’s vision of Victorian Soho–-a doppelgänger for 20s Berlin–-is totally corrupt. Polly’s father Jonathan Jeremiah Peachum is an entrepreneur who supplies the city’s beggars costumes & prosthetics “that will touch the hardest of hearts.” Macheath’s best friend is Sheriff Tiger Brown. This crooked pair remember army days in India in the Cannon \"If it should rain one night/& they should chance to sight/Pallid or swarthy faces/Of uncongenial races/They’ll maybe chop them up to make some beefsteak tartare!\" Here we have Weimar as it's lodged in popular a place of sexual debauchery, poverty, corruption & violence. The idea of decadence–-not just in the moral sense, but also in the sense of civilization's end, a doom–-was prominent on both right & left amid the political & economic shambles of postwar Germany; according to Laqueur in A Cultural History, it was a sense of finis Germaniae. But this sense of doom is also a retrospective attribution on our part; Weimar is colored by our knowledge of the horror that was to totally destroy it.The period left behind cultural relics, many still The Magic Mountain ('24), The Threepenny Opera ('28), Metropolis ('27) & M ('31), The Cabinet of Dr Caligari ('20), Nosferatu ('22), Kokoschka, Kandinsky. Weimar settings of films such as Cabaret ('72, based on Christopher Isherwood’s Sally Bowles stories), Woody Allen’s Shadows & Fog ('92), even Ingmar Bergman’s maligned Serpent’s Egg ('78), as well as the performances of cabaret revival singers like Ute Lemper, have maintained the milieu in the public imagination.Laqueur calls Weimar “the 1st truly modern culture”. He covers the establishment of the Republic after WWI; the intellectual hostility to the Republic from both the factional idealistic left & the chauvenistic idealistic right; novels, plays, music, art & architecture; university life; operetta, cafes, cinema, jazz & cabarets. Yet “as much a part of the Zeitgeist as the Bauhaus, The Magic Mountain, Prof Heidegger & Dr Caligari,” writes Laqueur, “[were] knickerbockers (even Th Mann wore them), mass tourism, the growth of department-stores, the death mask of l’Inconnue de la Seine, the hit songs of the period, occultism, nudism, the immense impact of radio & the cinema.”To left intellectuals, the democratic Weimar consitution didn't compare to their utopian vision & had to be scorned. As in many other countries, the left was viciously factional & hence politically ineffective. Inevitably there was much hatred & squabbling between communists & Social Democrats.On the other hand, the right intellectuals (they resented the description) viewed the new constitution as an unpatriotic insult & Weimar culture as decadence & cultural Bolshevism. This was a vague term “assuming in all earnest that Dada, Brecht’s refrain 'Feed us before you preach to us' or Walter Mehring’s Merchant of Berlin represented the esthetic theory & the moral philosophy of Marxism-Leninism.” In reality the contemporaneous Soviet attitude to the arts was equally anti-Modern in this period of girl-meets-tractor socialist realism. But Laqueur concludes that these intellectuals played little part in the rise of the Nazi thugs. The Nazis were bluntly anti-intellectual.According to Laqueur Berlin was not the sole cultural locus of Weimar. Frankfurt, Munich, Dresden, Hamburg, Breslau & Leipzig were each centres for arts & ideas. German literature at the time had “no spiritual or geographical centre”–-not even, as might be expected, at the famous Romanische Café in Berlin which is evoked as a “literary caravanserai” populated by school reformers, revolutionaries, thieves, junkies, vegetarians & the salonkommunisten, a group that included such fascinating characters as the great Dada painter Georg Grosz.Laqueur puts Th Mann in the category of ‘Republican Classics,’ the “real representatives of the spirit of the new Republic.” Mann was a bürger, “a conservative socialist in politics, a conservative innovator in literature,” who didn't assume roles of “educator or prophet.” Major writers of the '20s included Stefan George & Hermann Hesse, but those who best captured the zeitgeist were Heinrich Mann (Thomas' elder brother), Jakob Wassermann, Alfred Döblin (whose Berlin Alexanderplatz, '29, is “unrivalled in world literature as a symphony of big city life”), Arnold Zweig, Leonard Frank & Lion Feuchtwanger.The stage was most expressive of the spirit of the most notably in the productions of Max Reinhardt, as well as Reinhardt’s antithesis Leopold Jessner & the proletarian theatre impresario Erwin Piscator. Bertolt Brecht–-“anti-bourgeois, anti-establishment, anti-respectability” & for all his Marxism “basically not a political animal”–-wrote Baal ('23), In The Jungle of Cities ('23) & with Weill the very successful Threepenny Opera & Rise & Fall of the City of Mahogonny ('30). Laqueur is somewhat puzzled by Brecht’s impact & he feels the plays inconsistent in quality, & Brecht’s idea of “Non-Aristotelean epic theatre,” which was “meant to show man not just in his individuality but in his dependence on society,” didn't take off. Laqueur’s praise goes to Carl Zuckmayer’s comedy The Captain of Köpenick ('31).On the limitations of looking to literature to explain Weimar, Laqueur “It is possible to understand the spirit of the 20s without George, Hesse, The Magic Mountain; it cannot be understood without reference to the mood of the survivors of Langemark, Verdun & the Somme.”Altho we tend to associate Weimar with the apex of the Expressionism, “periods of cultural history hardly ever coincide with those of political history,” Laqueur explains. “Roughly speaking, the great break with cultural tradition occurred, in Germany as elsewhere, between '05 & '14.”Laqueur considers it “a movement in the Romantic tradition, perhaps the most extreme form of Romanticism that ever existed.”Germany had world-class orchestras & conductors such as Furtwangler, Klemperer, Walter, Kleiber, Toscanini. But musical revolution had occured before the war in Vienna & Debussy’s impressionism, Stravinsky’s Rite of Spring, Schönberg’s atonality. By the time of the Republic even Richard Strauss was a “classic rather than a revolutionary.”Likewise with visual the most important artists of the Weimar period had exhibited before the war. The Dresden group Die Brücke (centred on Karl Schmidt-Rottluff, Erich Heckel, Ludwig Kirchner & Emile Nolde) painted ambivalent city scenes reflecting the same malaise as the Expressionist poets. But after '13 the group split & the Expressionist mode diminished, particularly in the work of Schmidt-Rottluff & Heckel. Still, the work of alumni of Die Brücke as well as that of Oskar Kokoschka, Max Beckmann, Carl Hofer, Georg Grosz & Otto Dix has left an imaginative vision of the Weimar era. The working class never took to this avant garde; as Paul Klee said, “We are not rooted in the people & are not supported by it”. Modern art, particularly work by Kandinsky & Klee, was denounced by critics as “gangsterism, un-German, a ferment of decomposition, Bolshevist.” But the greatest attacks were aimed at modern architecture, particularly towards Walter Gropius & the Bauhaus. Ironically, it was this architecture that became Weimar’s most enduring legacy in the rest of the world.Why was Weimar Germany such a dynamic place for the arts? Laqueur concludes that the era had “an abundance of talent as well as of sources of conflict, combined with the political freedom which made experimentation possible.” His book is a useful cultural survey of an era in 20th century history that inevitably continues to fascinate.--Matthew Asprey (edited)",
  "genres": [
    "History",
    "Germany",
    "Nonfiction"
  ],
  "author": "Walter Laqueur",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/7429167-weimar"
}