{
  "title": "11 Birthdays; Finally; and 13 Gifts",
  "description": "11 BirthdaysIt's Amanda's 11th birthday and she is super excited-after all, 11 is so different from 10. But from the start, everything goes wrong. The worst part of it all is that she and her best friend, Leo, who has the same birthday, are on the outs, and this will be the first birthday they haven't celebrated together. When Amanda turns in for the night, glad to have her unhappy birthday behind her, she wakes up happy for a new day. Or is it? Her birthday seems to be repeating itself. Can she fix it? Only with time, friendship, and a little luck.FinallyWhen you're 12, you can pierce your ears. You can go to the mall with your friends-without parents. You can baby-sit little Timmy next door, get a cell phone, and even ride in the front passenger-side seat. Rory Swenson has been waiting to turn 12 her whole life, and in exactly 18 hours, 36 minutes, and 52 seconds, it will finally happen. Her life will begin...or will it?13 GiftsWhen Tara, a self-proclaimed shrinking violet, steals the school mascot (a goat) in order to make friends with the popular crowd, she gets herself in a heap of trouble. As if getting caught weren't bad enough, her parents decide that instead of taking her on their summer trip to Madagascar to study the courtship rituals of the bamboo lemur, she must go stay with her aunt and uncle and her bratty cousin Emily St. Claire in Willow Falls. Tara thinks it's a good time to start over. After all, she'll be turning 13, so she might as well make the best of a bad vacation. What Tara doesn't know is that this charmed town has something big in store for her on her 13th birthday. It's not a typical birthday. Then again, nothing in Willow Falls is exactly typical!",
  "genres": [
    "Realistic Fiction",
    "Mystery",
    "Childrens",
    "Middle Grade",
    "Fantasy"
  ],
  "author": "Wendy Mass",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/13046593-11-birthdays-finally-and-13-gifts"
}