{
  "title": "العطر الفرنسي",
  "description": "يقدم لنا الروائي أمير تاج السر روايته الجديدة بعنوان \"العطر الفرنسي\"، إنها قصة الكثير من الناس، يمكن أن نشاهدهم في حياتنا اليومية، جميعهم يحلمون بغدٍ أفضل، ولكنهم لا يملكون في حياتهم سوى الرتابة والجمود والألم والحسرة، فيفقدون معها الأمل في غدٍ مشرق فيتحولون إلى شخصيات منسية وممحية. تدور أحداث الرواية في \"حي غائب\" الشعبي وتلقُف علي جرجار بطل الرواية بخبر وصول الفرنسية \"كاتيا\" التي تنوي الإقامة في الحي فترة من الوقت، ضمن دراسة عالمية.. هذا الخبر أجج داخل سريرته مشاعر وانفعالات كانت منسية فبدأ يضفي في ذاكرته أحلاماً كان قد محاها قطار العمر السريع، ولكن هل سيعود الزمن إلى الوراء ليمحو ظلمة الأيام وتعب السنين، فالفتاة القادمة هي \"فرنسية\"، \"فهل هي في العشرين\"، لا، يقول علي جرجار، فتاة في العشرين لن تأتي لتقيم في تلك الفوضى. وفي حبكة درامية رائعة للأحداث والمواقع المتعددة لشخوص الرواية، التي تدور في ثناياها الأحداث، نجد شخصيات متنوعة في أحلامها، وكبريائها حيث ينقل لنا الكاتب صوراً متعددة لهذا الحي الشعبي \"حي غائب\" ومنها \"حليمة المرضعة\" \"أعطني أعطك\". الكتابة العريضة بالفحم على باب حليمة المرضعة، قارئة المصائر. ويدي ثابتة تطرق الباب رأتني زهورات الأثيوبية فاندلعت شياطينها في وجهي. اذهب.. ستموت قبل أن ترى الفرنسية... اذهب. كانت مسنة بالفعل. ربما على حافة الستين أو بعد ذلك، ولم تنس أبداً ليلة الزفاف تلك التي لم تر بعدها ليلة تخوضها كأنثى. كان وجهها عظماً يابساً. شعرها مصبوغاً بحناء لم تُعده أسوداً، لكنها شوّهت هيبة بياضه.. ويداها اللتان لم ترحمهما الخدمة طيلة أربعين عاماً، ترتعشان. أشفقت على نفسي أيضاً لأنني كنت أكثر منها انحناء، فقط أحاول أن أسير منتصباً، وأكثر يبساً في الجلد، لكن أعوّضه بري العاطفة. رمت بثقلها على الباب تغلقه، ورميت بثقلي لأبقيه مفتوحاً، وهزمتها. بلهاء.. صحت.. أعرف.. ردت. رواية ممتعة، غنية بأحداثها وبتنوع شخصياتها، وبعواطفها وانفعالاتها، وفي سرد قصصي مشوق، وتحليل عميق لما يدور في أعماق شخصيات الرواية عكس لنا صورة واقعية عن فوضى تعيشها معظم مجتمعاتنا العربية.",
  "genres": [
    "Novels",
    "Fiction"
  ],
  "author": "Amir Tag Elsir",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/7431861"
}