{
  "title": "Chaos Walking: A Trilogy",
  "description": "Series 1 & 3 3 Books Set 2 Paperback 1 Hardback £ 30.97 Brand New Titles in This Set The Knife of Never Letting Go The Ask and the Answer Monsters of Men Description in This Set The Knife of Never Letting Go Imagine you're the only boy in a town of men. And you can hear everything they think. And they can hear everything you think. Imagine you don't fit in with their plans... Todd Hewitt is just one month away from the birthday that will make him a man. But his town has been keeping secrets from him. Secrets that are going to force him to run... The Ask and the Answer Fleeing before a relentless army, Todd has carried a desperately wounded Viola right into the hands of their worst enemy, Mayor Prentiss. Immediately separated from Viola and imprisoned, Todd is forced to learn the ways of the Mayor's new order. But what secrets are hiding just outside of town? And where is Viola? Is she even still alive? And who are the mysterious Answer? And then, one day, the bombs begin to explode... The Ask and the Answer is a tense, shocking and deeply moving novel of resistance under the most extreme pressure. Monsters of Men \"War,\" says the Mayor. \"At last.\" Three armies march on New Prentisstown, each one intent on destroying the others. Todd and Viola are caught in the middle, with no chance of escape. As the battles commence, how can they hope to stop the fighting? How can there ever be peace when they're so hopelessly outnumbered? And if war makes monsters of men, what terrible choices await? But then a third voice breaks into the battle, one bent on revenge... The electrifying finale to the award-winning Chaos Walking trilogy, Monsters of Men is a heart-stopping novel about power, survival, and the devastating realities of war.",
  "genres": [
    "Young Adult",
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Dystopia",
    "Adventure",
    "Science Fiction Fantasy"
  ],
  "author": "Patrick Ness",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/13047567-chaos-walking"
}