{
  "title": "Circe's Recruits",
  "description": "\"Neither human nor animal, but something in between, Circe's Recruits stop rogues bent on killing...\"RoaneRun by Elliot Pearl, a ruthless millionaire, Pearson Labs continues to create Circs, people who have been genetically changed. When needed, these Circs take on an altered form, one neither man nor animal, but something in between. But unlike Roane Weston and his squad, known as Circe's Recruits, the Circs coming out of Pearson Labs aren't sane... Except for Caitlyn Chase, a female Roane can't get out of his mind.As Caitlyn matures into the female Circ she was meant to be, she sets in motion a chain of events that will forever alter her future and those of Circe's Recruits. Only with Roane and her newfound friends can she hope to keep the PPA at bay while they crush an agenda that may spell the end of them all.Zack & AceZack and Ace have been dancing around their \"just friends\" relationship for years. Being Circ means unavoidable intimacy when the mating heat strikes, and it's putting a strain on their friendship. They're finally nearing an understanding about what they truly mean to each other when they're stunned by Kelly, the woman they've been lusting after for years. Suddenly she's available to both in a way she's never been before. Lust and love confuse the issue, until wounded emotions pull the threesome apart and Kelly is captured by the enemy. Can Zack and Ace come to grips with their differences in time to save Kelly, or will their difficulties lose them the loves of their lives?\"Publisher's Note: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: Anal play/intercourse, domination, male/male sexual practices, menage (m/f/m), multiple partners, sex while in shifted form, violence.\"",
  "genres": [
    "Shapeshifters",
    "M M F",
    "Paranormal",
    "Adult",
    "Menage"
  ],
  "author": "Marie Harte",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/7443157-circe-s-recruits"
}