{
  "title": "North by Northwestern: A Seafaring Family on Deadly Alaskan Waters",
  "description": "NOW A  NEW YORK TIMES  BESTSELLER!In the tradition of Sebastian Junger and Linda Greenlaw comes Captain Sig Hansen’s rags-to-riches epic of his immigrant family’s struggle against deadly Alaskan seas, freezing shipwrecks, and dangerously brutal conditions to achieve the American Dream Sig Hansen has been a star of the Discovery Channel’s Deadliest Catch from the pilot to the present. Seen in over 150 countries, the show attracts more than 49 million viewers per season, making it one of the most successful series in the history of cable TV. With its daredevil camera work, unpredictably dangerous weather, and a setting as unforgivable and unforgettable as the frigid Bering Sea, The Deadliest Catch is unlike anything else on television. But the weatherworn fishermen of the fishing vessel Northwestern have stories that don’t come through on TV. For Sig Hansen and his brothers, commercial fishing is as much a part of their Norwegian heritage as their names. Descendants of the Vikings who roamed and ruled the northern seas for centuries, the Hansens’ connection to the sea stretches from Alaska to Seattle and all the way to Norway. And after twenty years as a skipper on the commercial fishing vessel the Northwestern-- which was his father’s before him--Sig has lived to tell the tales.  To be a successful fisherman, you need to be a mechanic, navigator, welder, painter, carpenter, and sometimes, a firefighter. To be a successful fisherman year after year, you need to be a survivor. This is the story of a family of survivors; part memoir and part adventure tale, North by Northwestern brings readers on deck, into the dockside bars and into the history of a family with a common destiny. Built around a gripping tale of a deadly shipwreck like The Perfect Storm, North By Northwestern is the multi-generational tale of the Hansen family, a clan of tough Norwegian-American fishermen who, through the popularity of The Deadliest Catch, have become modern folk-heroes.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Adventure",
    "History",
    "Family"
  ],
  "author": "Sig Hansen",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/7437793-north-by-northwestern"
}