{
  "title": "Gaymes",
  "description": "AnthologyHighland Gaymes by Carol LynneThere's more to a man than what's under his kilt.Shaw Fitzgerald loves touring the United States with his brothers. A fiddle player since an early age, music is the only thing he's ever been passionate about. That is, until he sees Curt Macaula compete for the first time.As a competitor in the Highland Games, Curt knows how important it is to concentrate on the individual events. Getting distracted while tossing a one hundred and fifty pound pole isn't an option. Away from his events, Curt is free to ogle the very pretty member of the Brothers Fitzgerald band.Toward the end of the season, Curt knows it's time to make his move. With Shaw being guarded by four macho brothers, it won't be easy, but Curt is determined to win the man of his dreams.Good Cop, Bad Cop by Jenna Byrnes and Jude MasonTwo hot studs, an evening of scorching sex, a pub, and the gaymes begin...or have they?Officer Kevin Sands and his lover get off on playing games - role playing games. When one of their escapades goes awry, will someone else pay the price for their fun? Or can the lovers solve a mystery that could mean the end of everything they hold dear?Elliot's War by Kim DareThe Welsh and the English. Celts and invaders. Captors and prisoners. Victors and slaves. Let the war games begin!The woodland war is billed by the university as an important exploration of differing cultural traditions within the British Isles. As far as Elliot understands it, the game involves the local Welsh students and those who invade the university from across the border, waging a war in the woodlands that surround the university.Elliot's not quite sure how he ended up agreeing to take part in the war game. Nor is he entirely sure how he ended up running through the forest wearing a skimpy toga while being chased by a dozen Celtic warriors - all of them painted a very historically inaccurate shade of blue woad.For better or worse, Elliot's about to get an education that wasn't advertised in the university prospectus.Crossed Hearts by Lisabet SaraiWhen love is the prize, everyone wins.For the past six years, Jason Hofstadter has attended the Four States Annual Scrabble Tournament. Jason comes to the Four States for two reasons - to play Scrabble and to get laid. Every year since his first, he has managed to hook up with one of the other players for some sexual fun. This year he has a chance at the grand prize in the tournament. Meanwhile, he figures he has hit the jackpot when he spots handsome, bookish Matt Sawyer, who's competing at the Four States for the first time.Shy and seemingly innocent, Matt turns out to be full of surprises. First, he jumps Jason in the rest room at Starbucks. Then he reveals that he's into BDSM and encourages Jason to experiment with topping him. Finally, despite his lack of experience with tournament play, Matt ends up competing with Jason in the semi-final round. When Matt throws the game he should have won, Jason is forced to confront his own feelings - about winning, about casual sex, and about Matt.Rough Riders by Devon RhodesPlaying by different rules can lead to heartbreak, but changing the game plan can be the tiebreaker.Luke Briscoe has a good reason to stay in the closet with his team, the Rough Riders. Bitter past experience has taught him to be cautious around athletic teams. But after Mario, his teammate and lover of ten years, leaves him, tired of the secrecy, Luke is forced to confront his fears, especially since the sexy and confident new member of the team, Derek Grimm, has no problem with being out and proud.Derek has wanted Luke from the first moment he saw him. But he knows the timing is all wrong, and vows to let Luke have the time he needs to recover from his breakup. As time goes on, though, Derek becomes frustrated with Luke's determination to stay in the closet. Derek and Mario are out, and the team is fine with it. Why is Luke still holding back? Derek wonders if any amount of time will ever be enough. Maybe it's time to try a different game plan...Contact Point by Gwendolyn CeaseWhen two men who have nothing to lose and come together for one night, they both discover a connection they never thought possible.Jesse Chandler needed a place to get out of the storm. What he found was a bar catering exclusively to wolf shifters. Cade Reynolds, pack Alpha and bar owner, sees nothing but trouble when the small human wanders into his bar. When Jesse signs up for the pool tournament, Cade decides to let him participate, so he'll lose and leave. Instead, Jesse wins every game he plays until a storm puts the brakes on everything.Jesse desperately needed to win the tournament prize money, but instead of a nice cosy room, he ends up squatting under a tree for shelter. When Cade invites him home for the night, Jesse has no choice, but to accept. Sit under a tree in the pouring rain or sleep in a house...No one ever said Jesse was a fool.All Cade wanted was to offer Jesse a place to stay for the night. But one touch from the smaller male made him realise that sleeping wasn't what was on his mind. Cade wanted Jesse, but the wolf wanted to keep Jesse forever.",
  "genres": [
    "M M Romance",
    "Anthologies",
    "Erotica",
    "Romance",
    "BDSM",
    "Sports",
    "Contemporary"
  ],
  "author": "Carol Lynne",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/7446708-gaymes"
}