{
  "title": "Setting the World Ablaze: Washington, Adams, Jefferson, and the American Revolution",
  "description": "Setting the World Ablaze is the story of the three men who, perhaps more than any others, helped bring the United States into George Washington, John Adams, and Thomas Jefferson. Braiding three strands into one rich narrative, John Ferling brings these American icons down from theirpedestals to show them as men of flesh and blood, and gives us a new understanding of the passion and uncertainty of the struggle to form a new nation.A leading historian of the Revolutionary era, Ferling draws on an unsurpassed command of the primary sources and a talent for swiftly moving narrative to give us intimate views of each of these men. More than any scholar before him, Ferling shows us both the overarching historical picture of theera and a gripping sense of how these men encountered the challenges that faced them. At close quarters, we see Washington, containing a profound anger at British injustice within an austere demeanor; Adams, far from home, struggling with severe illness and French duplicity in his crucialnegotiations in Paris; and Jefferson, distracted and indecisive, confronting uncertainties about his future in politics. John Adams, in particular, emerges from the narrative as the most underappreciated hero of the Revolution, while Jefferson is revealed as the most overrated of the Founders,although the most eloquent.Setting the World Ablaze shows in dramatic detail how these conservative men--successful members of the colonial elite--were transformed into radical revolutionaries, and in doing so, it illuminates not just the special genius of these three leaders, but the remarkable transformation of HisMajesty's colonies into the United States.",
  "genres": [
    "History",
    "Nonfiction",
    "American Revolution",
    "American History",
    "American Revolutionary War",
    "Biography",
    "Us Presidents"
  ],
  "author": "John Ferling",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/745369.Setting_the_World_Ablaze"
}