{
  "title": "Black Athena: Afroasiatic Roots of Classical Civilization, Vol. 1: The Fabrication of Ancient Greece, 1785-1985",
  "description": "Could Greek philosophy be rooted in Egyptian thought? Is it possible that the Pythagorean theory was conceived on the shores of the Nile and the Euphrates rather than in ancient Greece? Could it be that Western civilization was born on the so-called Dark Continent? For almost two centuries, Western scholars have given little credence to the possibility of such scenarios.In Black Athena, an audacious three-volume series that strikes at the heart of today's most heated culture wars, Martin Bernal challenges Eurocentric attitudes by calling into question two of the longest-established explanations for the origins of classical civilization. The Aryan Model, which is current today, claims that Greek culture arose as the result of the conquest from the north by Indo-European speakers, or \"Aryans,\" of the native \"pre-Hellenes.\" The Ancient Model, which was maintained in Classical Greece, held that the native population of Greece had initially been civilized by Egyptian and Phoenician colonists and that additional Near Eastern culture had been introduced to Greece by Greeks studying in Egypt and Southwest Asia. Moving beyond these prevailing models, Bernal proposes a Revised Ancient Model, which suggests that classical civilization in fact had deep roots in Afroasiatic cultures.This long-awaited third and final volume of the series is concerned with the linguistic evidence that contradicts the Aryan Model of ancient Greece. Bernal shows how nearly 40 percent of the Greek vocabulary has been plausibly derived from two Afroasiatic languages-Ancient Egyptian and West Semitic. He also reveals how these derivations are not limited to matters of trade, but extended to the sophisticated language of politics, religion, and philosophy. This evidence, according to Bernal, confirms the fact that in Greece an Indo-European people was culturally dominated by speakers of Ancient Egyptian and West Semitic.Provocative, passionate, and colossal in scope, this volume caps a thoughtful rewriting of history that has been stirring academic and political controversy since the publication of the first volume.",
  "genres": [
    "History",
    "Nonfiction",
    "Classics",
    "Race",
    "Ancient History",
    "Greece",
    "Politics"
  ],
  "author": "Martin Bernal",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/745332.Black_Athena"
}