{
  "title": "Late for the Wedding",
  "description": "New York Times bestselling author Amanda Quick returns with a thrilling new venture into romance and mystery, featuring the most unusual, highly compatible--undeniably combustible--pairing of Tobias March and his mesmerizing partner, Lavinia Lake.An invitation to a country house party at Beaumont Castle provides a perfect solution to Tobias and Lavinia’s most exasperating how to escape the chaos of London for a remote, relaxing--and above all romantic--retreat from prying eyes and wagging tongues. But the lovers’ plans are foiled when their first cozy interlude of the weekend is disrupted by the appearance of a stunning woman from Tobias’s past. Aspasia Gray’s beauty is as haunting as her connection to Tobias. Her long-deceased fiancé was a friend of his--in addition to being an eccentric assassin. The mysterious nature of the bond between Tobias and Aspasia makes Lavinia more than a little uncomfortable. Especially as her first encounter with Aspasia occurs when she finds her in Tobias’s bedchamber...It seems Aspasia is seeking protection--and solace--after receiving an ominous message that eerily recalls the past. Suddenly the obstacles standing between Tobias and Lavinia appear greater than just a little London gossip--and far more deadly.When events at the castle suggest someone is imitating the dead killer’s methods, the team of Lake and March fervently pursue the investigation--and each other--as their leads take them from Society’s most elegant haunts--and most discreet hideaways--to London’s shadiest backstreets. As their relationship heats up, so does the intrigue. Soon Lavinia will have to employ all her talents to flummox the scoundrel who so rudely interrupted her rendezvous. And then she and Tobias can get back to more pleasurable affairs.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Regency"
  ],
  "author": "Amanda Quick",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/74483.Late_for_the_Wedding"
}