{
  "title": "The Naked Traveler 2",
  "description": "Selama ini, tulisan perjalanan di media kebanyakan isinya tentang yang indah-indah saja. Seperti brosur yang menggunakan kalimat yang berbunga-bunga dan foto-foto hasil rekayasa digital agar pembaca tergerak untuk mengunjungi suatu tempat. Padahal traveling tidak selalu enak dan nyaman. Suatu tempat tidak selalu indah dan bagus. Kenangan perjalanan yang paling Trinity ingat pun bukanlah tentang keindahan arsitektur suatu bangunan atau putihnya pasir pantai, tapi pesawat yang delay atau orang lokal yang tidak ramah. Pengalaman (yang sering tidak terduga) saat melakukan perjalanan adalah jauh lebih berwarna. Seperti kata it’s not the destination, but the journey.Like climbing to the top of the hill to gaze down on the view I love to get a different picture, a different perspective, looking at the world through someone else’s eyes always adds another flavour to our travels. I fell in love with Indonesia on my first trip through South-East Asia way back in 1972 and now I can get a glimpse of the world through Trinity’s Indonesian eyes. I may have been to many of these places before, but The Naked Traveler takes me there by a whole new route.-- Tony Wheeler, pendiri Lonely Planet, penerbitan buku perjalanan terbesar di duniaSeorang penulis – seperti juga seorang jurufoto – haruslah terlebih dulu seorang pengamat yang baik. Seorang yang memiliki kamera, bisa saja menjepret seribu foto ketika baru tiba di sebuah tempat yang baru dikunjunginya. Tetapi, mungkin hanya ada satu-dua foto saja yang benar-benar unik dan menarik. Seorang pengelana harus mampu menyeleksi semua pengalaman baru yang diserapnya, dan kemudian menuliskannya secara menarik. Perucha berhasil sekaligus menjadi pengamat dan penulis yang baik. Saya menikmati tulisan-tulisannya tentang kunjungan ke berbagai tempat.-- Bondan Winarno, penulis, wartawan, dan pendiri komunitas wisata boga Jalansutra",
  "genres": [
    "Travel",
    "Nonfiction",
    "Indonesian Literature",
    "Adventure",
    "Travelogue",
    "Biography",
    "True Story"
  ],
  "author": "Trinity",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/7456263-the-naked-traveler-2"
}