{
  "title": "Irreplaceable",
  "description": "One windy April afternoon, a young woman bicycles alone along a stretch of Iowa highway. She's pedaling hard, hurrying to get home in time for dinner . . .Alex Voormann is a cerebral thirty-year-old archaeologist married to the woman of his dreams--a beautiful, ambitious botanist named Isabel. When Isabel, an organ donor, is killed by a reckless driver, Alex reluctantly consents to donate her heart. Janet Corcoran is a young, headstrong mother of two, an art teacher at an inner-city school in Chicago. Sick with heart disease, she is on the waiting list for a transplant, but her chances are slim. She watches the Weather Channel, secretly praying for foul weather and car accidents, a miracle. The day Isabel dies, she gets her wish.Flash forward a year. Janet sends Alex a long letter. She'd like to learn something about the woman who saved her life. Alex isn't interested in talking to the recipient of his dead wife's heart. Since Isabel's accident, he's become grief-stricken and bewildered. His closest companion is his mother-in-law, Bernice. They spend their nights reminiscing about Isabel and hiding out from the world. Meanwhile, a local blues musician named Jasper, the man responsible for Isabel's death, attempts to atone for his misdeed. Jasper is devastated by the knowledge that he destroyed a life but attracted to the idea that he was partially responsible for saving another life -- Janet's. He sees her as his ultimate salvation.Irreplaceable is the story of what happens after the transplant -- not only to Alex but within the concentric circles of family that spiral outward from him and from Janet. Stephen Lovely takes us vividly inside the lives of these characters to reveal their true intentions -- however misguided -- and gives us a stunning debut novel of loss and love.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Drama",
    "Novels",
    "Roman",
    "Family"
  ],
  "author": "Stephen Lovely",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/7454684-irreplaceable"
}