{
  "title": "بدينة ... ولكن",
  "description": "هذه هي الطبعة العربية من رواية \"Big Girl\" تحت عنوان \"بدينة.. ولكن\"، للروائية الأميركية الأكثر شهرة \"دانيال ستيل Danielle Steel\". هي رواية جدية صادرة من القلب، تحتفل فيها دانييل ستيل بفضائل الجمال غير التقليدي، وتسبر غور مجاهل الوزن الزائد، وصورة الذات، والأخوّة، والعائلة. كفتاة صغيرة بدينة، صاحبة شعر أشقر، وعينين زرقاوين، وطلَّة عادية، لطالما شعرت فيكتوريا داوسون بأنها منبوذة في عائلتها، خصوصاً من حيث مظهرها الخارجي. فوالدها جيم طويل ونحيل، وأمها كريستين صاحبة جمال فائق وذات شعر أسود. كلاهما أنانيان، وصريحان، ويشعران بالخيبة من مظهر ابنتهما. عندما كانت فيكتوريا في السادسة من عمرها، رأت صورة فوتوغرافية للملكة فيكتوريا التي لطالما قال لها والدها إنها تشبهها كثيراً. وبعد ولادة الأخت الصغرى لفيكتوريا، غرايسي، أحب والدها القول عن ابنته الكبرى إنها كيك الاختبار. وحين شاهد الجميع غرايسي، أجمعوا على أن جيم وكريستين محقّان. فبينما يستطيع أهلها وأختها تناول أي شيء من دون زيادة غرام واحد في الوزن، يجدر بفيكتوريا مراقبة كل ما تأكله، وكذلك تحمُّل تعليقات والدها الساخرة بشأن جسمها وإنجازاتها الأكاديمية التي لا يعتبرها محط تقدير. لذا، كانت تلجأ إلى تناول الآيس كريم وحصص كبيرة الحجم من كل الأطعمة غير الصحية لتشعر بالارتياح، وإنما لفترة وجيزة فقط. الشيء الوحيد الذي تعرفه هو أن عليها الابتعاد عن المنزل، وبعد التخرج من الكلية في شيكاغو، تنتقل إلى مدينة نيويورك. عملت في مهنتها الحلم كأستاذة ثانوية، فأحبت فيكتوريا العمل مع تلاميذها، وشنّت حرباً على وزنها في النادي الرياضي. وبالرغم من توتر علاقتها مع والديها، بقيت فيكتوريا قريبة من أختها. وبالرغم من أنهما تختلفان كثيراً من حيث المظهر الخارجي، إلاّ أنهما تحبان بعضهما من دون أي تحفظ. لكن، بغض النظر عن إنجازاتها، يعرف والدا فيكتوريا ما يجب قوله لتحطيمها. ستبقى دوماً الفتاة البدينة برأي والدها، فيما استهجان أمها القاسي من وزنها مستمر أيضاً. عندما تعلن غرايسي خطوبتها من رجل هو نسخة طبق الأصل عن والدهما النرجسي، تقلق فيكتوريا بشأن سعادة أختها المستقبلية، ومن دون وجود رجل في حياتها، تشعر مجدداً بفشلها كإنسانة. وفيما يقترب موعد الزفاف، يحصل لقاء مصادفة، وخيانة مذهلة، ومواجهة عائلية تؤدي إلى نقطة تحول.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Audiobook",
    "Family",
    "Drama"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/13049123"
}