{
  "title": "Becoming Queen Victoria: The Tragic Death of Princess Charlotte and the Unexpected Rise of Britain's Greatest Monarch",
  "description": "In her lauded biography' England’s Mistress', Kate Williams painted a vivid and intimate portrait of Emma Hamilton, the lover of English national hero Lord Horatio Nelson. Now, with the same keen insight and gift for telling detail, Williams provides a gripping account of Queen Victoria’s rise to the throne and her early years in power—as well as the tragic, little-known story of the princess whose demise made it all possible.Toward the end of the eighteenth century, monarchies across Europe found themselves in crisis. With mad King George III and his delinquent offspring tarnishing the realm, the English pinned their hopes on the only legitimate heir to the throne: the lovely and prudent Princess Charlotte, daughter of the Prince of Wales and granddaughter of the king. Sadly, those dreams faded when, at age twenty-one, she died after a complicated pregnancy and stillbirth. While a nation grieved, Charlotte’s power-hungry uncles plotted quickly to produce a new heir. Only the Duke of Kent proved successful in his endeavor, with the birth of a girl named Victoria.Writing with a combination of novelistic flair and historical precision, Williams reveals an energetic and vibrant woman in the prime of her life, while chronicling the byzantine machinations behind Victoria’s struggle to occupy the throne—scheming that continued even after the crown was placed on her head.Upon hearing of the death of her predecessor, King William IV, Victoria—in her bold first act as queen—banished her overambitious mother from the room, a simple yet resolute move that would set the tone for her reign. The queen clashed constantly not only with her mother and her mother’s adviser, the Irish adventurer John Conroy, but with her ministers and even her beloved Prince Albert, all of whom, in one way or another, attempted to seize control from her.By connecting Charlotte’s sad fate to Victoria’s majestic rule, Kate Williams lays bare the passions that swirled around the throne—the court secrets, the sexual repression, and the endless intrigue. The result is a grand and satisfying tale of a woman whose destiny began long before she was born and whose legacy lives on.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Historical",
    "Victorian",
    "British Literature",
    "Biography Memoir"
  ],
  "author": "Kate Williams",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/7458615-becoming-queen-victoria"
}