{
  "title": "روابط عائلية",
  "description": "انطلاقاً من عنوان هذه الرواية “روابط عائلية “ Family Ties للروائية الأميركية \"دانيال ستيل؛ يلفتنا حجم القيم الأخلاقية في الرواية، فكان الأجمل أن نطلق عليها \"حب بلا حدود\". هكذا تبدو بطلة دانيال ستيل هذه المرة أنموذجاً للمرأة التي تكون على قدر كبير من المثالية والتضحية من أجل الغير. كانت آني فيرغوسون مهندسة معمارية شابة ولامعة تعيش في مانهاتن. وهي موهوبة، وجميلة. بدأت للتو وظيفتها الأولى، ولديها شقة جديدة وصديق جديد، وكان العالم بين يديها، إلى أن تلقت اتصالاً هاتفيّاً بدَّل حياتها إلى الأبد. بين ليلة وضحاها، أصبحت أمّا لأولاد أختها الثلاثة الأيتام، وأقسمت على تنفيذ وعدٍ لم تندم عليه قطّ، حتى لو عنى ذلك وضع حياتها الخاصة على الرف إلى ما لانهاية. الآن، في عمر الثانية والأربعين، بدت مستقلة أكثر من أي وقت مضى، مع مهنة رائعة وعائلة تعني بها. تشعر آني بالارتياح لكونها عازبة ولأنها بقيت هكذا. يبدو وكأنها لا تملك الوقت لأي شيء آخر. بعد أن أصبح أولاد أختها الآن شباباً، ويواجهون التحديات في حيواتهم، تعبر آني مرحلة صعبة، وهي في حيرة بين تقديم المساعدة لهم والتخلي عنهم، وتجد نفسها فجأة في منزل فارغ. فالبنت الكبرى، ليز البالغة من العمر ثمانية وعشرين عاماً محررة تعمل بكدّ كبير في وظيفة مهمة في مجلة فوغ، ولم تسمح لأي رجل بالاقتراب منها كفاية كي لا يؤذيها. تيد، في الرابعة والعشرين من عمره. وهو طالب في كلية الحقوق، جدي ويعمل بكد، ومفتون بامرأة أكبر منه سناً وأكثر منه خبرة ولديها ولدان، تأخذه أبعد بكثير مما يريد. والصغيرة كايت، ابنة الواحد والعشرين عاماً، عفوية، فنانة، متمردة. وهي طالبة فنون على وشك اتخاذ خيار سيقودها إلى عالم مختلف تماماً ليست مستعدة له أبداً وإنما هي مصممة على المضي فيه. وفي وقت غير متوقع البتة، يغير لقاء يحصل صدفة حياة آني مجدداً، ويأخذها في اتجاه غير متوقع على الإطلاق. من مانهاتن إلى باريس ووصولاً إلى طهران، روابط عائلية هي رواية تذكّرنا كم أن الحياة مليئة بالتحديات والمفاجآت، وأن الروابط العائلية القوية تبقى الأقوى على الإطلاق. ومعها تبدو الحياة أجمل عندما نحب الآخرين ويحبوننا...",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Audiobook",
    "Adult",
    "Adult Fiction",
    "Drama"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13049139"
}