{
  "title": "The Milk Bitch Trilogy",
  "description": "BDSM Erotica. During lunch at a DC power restaurant, the striking brunette journalist Gina can't take her eyes off a ruggedly handsome man on the other side of the dining room. An advance on him is rebuffed by the maitre'd, but that doesn't stop Gina from trading a night of sex with the restaurant owner for information on her mystery man. Before that night is over Gina will be drugged and later wake up in a warehouse, where she sees shocking scenes of young women being examined, sold, crated and wheeled away. She listens in horror as her mystery man, Ward, and a powerful Sheikh make a deal that will turn Gina into Ward's property. Though Gina finally lands safely back at home, her world has been upended. Even her sister and good friend are in the clutches of this slave trade, and some of the powerful in Washington are in on this shocking commerce in women. Gina is now at Ward's beck and call as he tortures and humiliatingly degrades her in acts that bring her to intensely powerful orgasms. She'll be subjected to a systematic program of sexual breeding and forced lactation. To perfect the alternations, she's left at the doctor's farm where she and the other girls are kept in stalls like cattle. Once Gina returns to DC, her bulbous milk-filled breasts become the object of much attention. Her transformation from DC journalist to Ward's Milk Bitch is now complete. More brutal subjugation follows, as Gina's story continues in MILK BITCH LOST. She's taken to the Sheikh's home where Ward shows off her special milking talents and arranges to transform other females who will serve the Sheikh in the same manner. Finally in book three, MILK BITCH PAWN, Gina is back in the US where she's againforced into more dehumanizing scenes of abject submission, and becomes a integral part of her 'Daddy' Ward's scheme to blackmail a former US Vice President and his son. The stories of Gina and her fellow milk bitch slaves are told in a beautifully written masterpiece of S&M perversion, with graphic depictions woven though suspenseful plots that will keep readers turning pages until the very end. Combined into one volume, over 350 pages in paperback. Strong graphic content. Adults only.",
  "genres": [
    "BDSM",
    "Erotica",
    "Horror",
    "M F Romance",
    "Own"
  ],
  "author": "Frances Gaines Bennett",
  "average_rating": "2.88",
  "url": "https://www.goodreads.com/book/show/7466260-the-milk-bitch-trilogy"
}