{
  "title": "Sting",
  "description": "Iris – Since my mother died, my only goal has been to get custody of my sister Jerrica and keep her safe. I was on my way, too -- getting emancipated by the court so I could get a job and prove I had the means to take responsibility for my little sister. I promised I’d keep her safe and I’d never abandon her. I was with her every day until I came to her group home one morning to find she’d been adopted out overnight. It’s obvious there’s something sinister at work, but no amount of threats and demands will override a closed adoption order. It looks like Jerrica is gone from my life forever, but I’ve got one more trick up my sleeve. Jerrica made friends with a woman from a local motorcycle club. I have no idea if the woman will help, but I have no where else to go. What I didn’t count on is him. Sting. President of Iron Tzars MC. He doesn’t know it yet, but once I get Jerrica back, he's next on my list. Sting – I wasn’t ready to be president of an MC like Iron Tzars, but my father left me little choice. I grew up in the club. At twenty-nine, most of the men still see me as no more than a kid. But my daddy taught me well. I tolerate no disloyalty or disrespect and always, always put the club first. Then I met Iris. She’s a heap of trouble in a small package and she pings my radar from the moment I first lay eyes on her. I know she’s going to be mine -- which means she has to trust me to take care of her. But Iris trusts no one when it comes to her sister. With both of them in danger, I now have to make a decision. Changing plans will put the club at risk, but doing nothing will risk them both. I’m not willing to take that risk. Putting a woman above the club is what got my father in trouble. Now I’m in the same boat. Stupid. Especially since Iris has no idea I’ve already claimed her.",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Marteeka Karland",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/74714348-sting"
}