{
  "title": "Jiná rasa",
  "description": "Doba je rozervaná a temná a v Čechách dosud křesťanství nezvítězilo nad pohanskými rituály. Nerudný pan Ješek si na svou čelákovickou tvrz blízko Prahy odváží Graen, osiřelou dceru své švagrové a záhadného medika (či snad rovnou mága) Marlina. Z její přítomnosti není ale nijak nadšený. Graen zase netuší, že nad krajem leží podivná krvavá kletba. Za nocí se kolem stavení plíží strašný Stín... Co jsou pověry ustrašených vesničanů a co děsivá, syrová pravda? Graen se na svých toulkách seznámí s uhrančivým mužem, jehož pokládá za pána sousedního boleslavského panství. Skutečnost je však mnohem hroznější. Ten, s nímž se tak bezstarostně schází, je jedním ze Stínů, vznešených, dravčích vampýrů, kteří přežívají v nedalekém podzemním labyrintu a zoufale se snaží o záchranu své rasy. Možná že jsou už poslední... Zdá se však, že jejich snaha je korunována úspěchem - po brutálním znásilnění je Graen těhotná. Po devíti měsících porodí syna, polovičního vampýra, jemuž dá jeho nemrtvý otec jméno Adreen. V prastaré řeči, starší než lidstvo samo, to znamená Darovaný... Graen je spolu se synem držena v podzemí, ale místo nenávisti začíná své věznitele chápat. V ní, stejně jako v Dakhovi, otci dítěte, se dokonce ozývá cosi vzdáleně podobného náklonnosti. Obě rasy jsou však tak odlišné, že si nikdy nemohou doopravdy porozumět. Graen umírá, paradoxně nikoli rukou vampírů, ale nevědomých vesničanů, kteří v ní vidí oživlý přízrak. Orhea, Dakhova nesmrtelná sestra, se s malým Adreenem vydává do Francie, aby tam na břehu moře v ruinách pradávného chrámu dovršila jeho zasvěcení a definitivní proměnu. Kniha vychází ze skutečných dobových reálií a zejména z archeologických nálezů čelákovického pohřebiště, kde byly v šedesátých letech objeveny kostry s prokazatelnými protivampyrickými zásahy. Jedná se vlastně o jakousi možnou \"rekonstrukci událostí\"...",
  "genres": [
    "Fantasy",
    "Vampires",
    "Czech Literature"
  ],
  "author": "Jenny Nowak",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/7467777-jin-rasa"
}