{
  "title": "Really Angelic: Pride and Prejudice with a steamy paranormal twist",
  "description": "In Pride and Prejudice, Jane Austen mentioned angels several times. What if there were real angels inhabiting England then? In this spicy tale of Austen's historical novel, the romance of Fitzwilliam Darcy and Elizabeth Bennet takes on a bumpy paranormal twist. Challenged by the intervention of demons and deities, can our favourite couple find the strength to forge their love? Will Mr. Darcy and Elizabeth overcome pride as well as prejudice, and find each other?This steamy, emotional Pride and Prejudice retelling will take fans of the perennial favorite on an exhilarating journey that transcends dimensions. But be this book is not suitable for Jane Austen purists.\"Mr. Darcy and Elizabeth Bennet are hot together and come off as more believable characters than the original intended\" - 5 Stars from, Acquanetta Ferguson, San Diego Examiner (17 Jan 2010)\"If I started reading REALLY ANGELIC with a well-manicured coif, freshly ironed clothes, and were primly sitting in my comfortable, leather arm chair, I came out of the read thrown on the floor, hair sexily tussled, a youthful rosy tinge to my cheeks, and a look of pure satisfaction that reached down from my eyes to the corners of my upturned lips. That's what reading this story was like. Mr. Darcy is sometimes awkward, always aloof, and occasionally haughty; but he's also insatiable and sexy and truth be told - a little bit dirty. And I liked it! Elizabeth is sharp, intelligent, and while part of her wants to stay proper, she enjoys being wanton. Now that's an angel I could relate to and appreciate!\" - 4 Blue Ribbons from Romance Junkies\"I highly recommend this one for anyone who loves Pride and Prejudice...\" - 5 Stars from Reading with Monie (22 Jan 2010).This is Enid Wilson's second Pride and Prejudice inspired Regency romance. Her previous work, Bargain with the Devil, has been ranked in the top 50 best-selling historical romances on Amazon USA.",
  "genres": [
    "Fantasy",
    "Paranormal Romance",
    "Comedy",
    "Fiction"
  ],
  "author": "Miss Enid Wilson",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/7471098-really-angelic"
}