{
  "title": "The Pickton File",
  "description": "Stevie Cameron turns her renowned analytical eye from the \"crooks in suits\" of her previous books to the case of Vancouver's missing women and the man who has been charged with killing 27 of them, who if convicted will have the horrific distinction of being the worst serial killer in Canadian history.It's a shocking story that may not be over anytime soon. When the police moved in on Pickton's famous residence, the \"pig farm\" of Port Coquitlam, in February 2002, the entire 14-acre area was declared a crime scene -- the largest one in Canadian history. Well over 150 investigators and forensics experts were required, including 102 anthropology students from across the country called in to sift through the entire farm, one shovelful of dirt at a time.A woman who is considered by many to be this country's best investigative journalist, Cameron has been thinking about the missing women of Vancouver's Downtown Eastside since 1998, when the occasional newspaper story ran about families and friends of some of the 63 missing women agitating for action -- and being ignored by police and politicians. Robert William \"Willie\" Pickton has been on her mind since his arrest, that February five years ago, for the murders of two of the women, Mona Wilson and Sereena Abotsway, both drug-addicted prostitutes from the impoverished neighbourhood where all the missing women had connections.Living half-time in Vancouver for the last five years, Stevie Cameron has come to know many of the people involved in this case, from families of the missing women to the lawyers involved on both sides. She writes not only with tireless investigative curiosity, but also with enormous compassion for the women who are gone and the ones who still struggle to ply their trade on the Downtown Eastside.\"We had no idea [in 2002] how massive the investigation would be. We had no notion that the police would sift every inch of dirt on the Pickton farm, a process that lasted from the spring of 2002 to late 2004. We did not foresee the broad publication ban that would prevent any word printed or broadcast of what was being said in court in case it influenced a potential juror. We couldn't know that there would be, by 2006, 27 charges of first-degree murder against Pickton and that the police would continue to investigate him on suspicion of many other deaths. And we didn't know that the police and other personnel involved in the case, under threat of ruined careers, were forbidden to talk to reporters. In blissful ignorance, all I could do was begin…\"--Excerpt from The Pickton File",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Canada",
    "Crime"
  ],
  "author": "Stevie Cameron",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/748016.The_Pickton_File"
}