{
  "title": "Olives: A Violent Romance",
  "description": "\"McNabb’s attempt to portray a more complicated Middle East is important. Its potential impact on Western audiences shouldn’t be underestimated.\" Daoud Kuttab \"The intensity of Paul and Aisha’s love story is the novel’s defining strength with their intimacy heating up to a feverish pitch as disasters escalate and put them at risk.\" The NationalWhen Paul Stokes runs out of choices, his only path is betrayal.The fragile peace is holding. Behind the scenes, the Israelis are competing for dwindling water resources as Jordan and Palestine face drought. Daoud Dajani has the solution to Jordan’s water problems and is bidding against the British for the privatisation of Jordan’s water network. When journalist Paul Stokes befriends Dajani’s sister, Aisha, British intelligence agent Gerald Lynch realises Paul offers access to Dajani - the man threatening to drain Israel’s water supply and snatch the bid from the British.Blackmailed by Lynch into spying on Dajani, his movements seemingly linked to a series of bombings, Paul is pitched into a terrifying fight for survival that will force him to betray everyone around him. Even the woman he loves. Olives explores love in conflict, the pull of home set against the excitement of the new and a people trying to live alongside the conflict we see on television, the human stories behind glib media coverage that reduces the ebb and flow of existence to a few throwaway catchphrases.Forced to spy for his country, Paul finds himself embroiled in a struggle for survival between good and evil where the people he wants to see as the good guys are worse than he could ever have imagined.\"There is love, sensitivity and inner conflict that make this book an emotional read.\" Expatwoman.com\"McNabb has created a world that is uniquely Arab and foreign at once. He obviously understands the region, its politics and its culture. And that is its greatest strength. It is able to draw in the reader early on, creating a world that is at once familiar and strange.\" Joseph Mayton writing in BikyarMasr \"If you take Tailor of Panama, add a sprinkle of Lawrence of Arabia, introduce rich and memorable characters, a modern concern about water scarcity, and bring up the speed, you will get 'Olives – A Violent Romance'. Reading this book was an absolute delight, with an intriguing ending that still keeps me thinking.\" Hanging Out Globally \"A hard-hitting novel tackling real-life issues coming out of the Palestine-Israel conflict.\"  Middle East Monitor \"A gripping and realistic novel that displays elements of what residents in the Middle East live and breathe on a daily basis.\"Huffington Post \"I was gripping my iPad near the end as it all came together. Right up to the end I wasn't sure who the \"bad guys\" are (and, really, both sides have good and bad, which is shown in this novel). I love that it isn't clear who is stalking whom until the very end.\" Helen’s Book Blog",
  "genres": [
    "Fiction",
    "Mystery Thriller"
  ],
  "author": "Alexander McNabb",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/13050921-olives"
}