{
  "title": "Wildblood",
  "description": "A thrilling new fantasy from New York Times bestselling author Lauren Blackwood!Eighteen-year-old Victoria is a Wildblood. Since she was kidnapped at the age of six and manipulated by the Exotic Lands Touring Company, she’s worked as a tour guide ever since with a team of fellow Wildbloods who take turns using their magic to protect travelers in a Jamaican jungle teeming with ghostly monsters.When the boss denies Victoria an earned promotion to team leader in favor of Dean, her backstabbing ex, she’s determined to prove herself. Her magic may be the most powerful on the team, but she’s not the image the boss wants to send their new client, Thorn, a renowned goldminer determined to reach an untouched gold supply deep in the jungle.Thorn is everything Victoria isn't - confident, impossibly kind, and so handsome he leaves her speechless. And when he entrusts the mission to her, kindness turns to mutual respect, turns to affection, turns to love. But the jungle is treacherous, and between hypnotic river spirits, soul-devouring women that shed their skin like snakes, and her ex out for revenge, Victoria has to decide - is promotion at a corrupt company really what she wants?A fierce, lush fantasy by New York Times bestselling author Lauren Blackwood, Wildblood tells the story of a girl who must find the strength to defeat the demons of the jungle as well as her own to find where she truly belongs.\"A lyrically told story of healing after trauma and finding home, Wildblood is as fierce as it is beautiful, and as hopeful as it is heartbreaking.\" - Hannah Whitten, New York Times bestselling author of For the Wolf\"Wildblood is a poignant, thrilling, emotionally complex story of love and sacrifice. Victoria's tense journey through the haunted jungle is filled with terror and beauty, both supernatural and human, and will grip you until the very last page.\" - L. Penelope, award-winning author of the Earthsinger Chronicles",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Fiction",
    "Adventure",
    "Young Adult Fantasy",
    "Magic"
  ],
  "author": "Lauren Blackwood",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/74811808-wildblood"
}