{
  "title": "The Diamond Hunters",
  "description": "The Van Der Byl Diamond Company, willed by its founder to his son Benedict, daughter Tracey and estranged foster-child Johnny Lance, turns out to be a bequest not of love, but of hatred. For it is couched in such terms as to offer Benedict an instrument of destruction of his bitterest rival. 'Destroy Johnny' was the old man's implacable message to his son, and, obsessively jealous of his foster-brother, Benedict sets out in ruthless pursuit of this goal.In a desperate bid to support Johnny, Tracey acquires for him the concession in the diamond-rich seabed round the coral islands of Thunderbolt and Suicide off the savage South West African coast, and Johnny throws all his resources into the construction of a vessel that will recover the stones from the ocean floor and repair his fortune at last. But Benedict, already involved in illegal diamond-dealing as a sideline, seizes this chance to attack his rival and, with a network of accomplices and some ingenious electronic tampering, plots to syphon off the diamonds. Johnny will not only be ruined by his liabilities, he will also be a laughing stock.However, Benedict's obsessive jealousy is his undoing. He cannot resist stripping his rival of his beautiful but bitchy wife Ruby as well, and when he then discards her, she takes her revenge, precipitating a climax of murder and destruction that consumes Benedict at last.Narrated with Wilbur Smith's irresistible driving thrust, The Diamond Hunters is a tale of brotherly hatred, redeemed only by the deepening love between Johnny and Tracey. It is set in London, Cape Town, on the thunderous seas around the ocean diamond fields and ends in a final confrontation between Johnny and Benedict in the blistering hyena-infested desert.",
  "genres": [
    "Fiction",
    "Adventure",
    "Thriller",
    "Historical Fiction",
    "Africa",
    "Action",
    "Suspense"
  ],
  "author": "Wilbur Smith",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/74779.The_Diamond_Hunters"
}