{
  "title": "مئة عام من العزلة",
  "description": "تعتبر هذه الرواية من أهم الأعمال الأسبانية - الأمريكية خاصة, ومن أهم الأعمال الأدبية العالمية عموما. وتروي الرواية قصة عائلة بوينديا على مدى ستة أجيال التي تعيش في قرية خيالية تدعى \"ماكوندو\".يسجل ماركيز قصة حياة عائلة \"بوينديا\" في قرية ماكوندو على الساحل الكاريبي، بدءاً من قدوم الجد الأكبر \"خوزيه أركاديو بوينديا\" والجدة الكبرى \"أورسولا\" و \"بيلار تيريزا\" التي تقرأ مستقبل الناس من خلال ورق اللعب، ومجموعة متنوعة من المهاجرين. ثم تكوين مجتمع ماكوندو الغريب الذي يتسم كل شيء فيه بالعزلة النسبية. فكل فرد ومكان طبع على شخصيته سمات خاصة تجعل تفرده حالة مستعصية.ثم يأتي إلى القرية الجديدة الغجر بألعابهم السحرية التي لا تنتهي، فتطبع على القرية وأهلها شكل آخر من أشكال الخرافة، ويأتي مع الغجر الشخصية الغريبة \"ملكياديس\" والذي يفعل أشياءا غريبة ويرحل مخلفا وراءه كنزا غريبا بعض الشيء، وهو مجموعة من الأوراق التي تسجل بدقة تاريخ القرية وكل سكانها من لحظة وجودها وحتى لحظة فناء القرية وأهلها، ولكن هذه الأوراق لا تقرأ إلا بعد مرور مائة عام على كتابتها !ثم يتنوع نسل عائلة بوينديا إلى مجموعة من الأبناء والأحفاد مصنفين لنوعين ؛ الأول يمتلك صفات جسدية خارقة للعادة وقدرة جنسية فائقة ، والآخرون يحملون صفات العزلة والتمرد المطلوبة لقائد.يأتي المستعمر الأجنبي إلى القرية الهادئة بصخبه وشركاته وينشئ على الطرف الآخر من البلدة شركة الموز، والتي استغلها المستعمر ليستعبد أهل القرية وخيرات القرية بحماية من قوات الجيش الوطني وحزب المحافظين. حيث صاح العقيد الدموي المستبد الثائر أوريليانو بوينديا \"إنظرو البلاء الذي جلبناه لأنفسنا لمجرد أننا دعونا أمريكياً لأكل الموز عندنا !!\".أحداث الرواية الخيالية متقاطعة مع تاريخ كولومبيا و إنفصالها عن أسبانيا و إعلان إستقلالها و حربها الأهلية التي إندلعت في عام 1885 قبل أن تنتهي بتوقيع معاهدة نيرلانديا سنة 1902 بواسطة زعيم الثوار الكابتن رافائيل يريبي و الذي حارب جد الكاتب تحت إمرته.ثم يأتي على القرية سنوات من الثراء الرهيب، حتى أن أحد الأحفاد كان يغطي جدار البيت بالأوراق النقدية، وموّل عدة مشروعات للسكك الحديدية والنقل البحري، وتزوج من ملكة أندلسية ، قبل أن تأتي مجددا سنوات الفقر مع طوفان من الأمطار استمر لسنوات وسنوات، وأخيرا عندما توقف كانت الحياة قد تغيرت تماما في قرية ماكوندو إلى أسوأ حال، ولكن الحياة تستمر على الرغم من هذا.",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Fantasy",
    "Literature",
    "Historical Fiction",
    "Novels",
    "Book Club"
  ],
  "author": "Gabriel García Márquez",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/7480676"
}