{
  "title": "Terrorizing Women: Feminicide in the Americas",
  "description": "More than 600 women and girls have been murdered and more than 1,000 have disappeared in the Mexican state of Chihuahua since 1993. Violence against women has increased throughout Mexico and in other countries, including Argentina, Costa Rica, Guatemala, and Peru. Law enforcement officials have often failed or refused to undertake investigations and prosecutions, creating a climate of impunity for perpetrators and denying truth and justice to survivors of violence and victims’ relatives. Terrorizing Women is an impassioned yet rigorously analytical response to the escalation in violence against women in Latin America during the past two decades. It is part of a feminist effort to categorize violence rooted in gendered power structures as a violation of human rights. The analytical framework of feminicide is crucial to that effort, as the editors explain in their introduction. They define feminicide as gender-based violence that implicates both the state (directly or indirectly) and individual perpetrators. It is structural violence rooted in social, political, economic, and cultural inequalities. Terrorizing Women brings together essays by feminist and human rights activists, attorneys, and scholars from Latin America and the United States, as well as testimonios by relatives of women who were disappeared or murdered. In addition to investigating egregious violations of women’s human rights, the contributors consider feminicide in relation to neoliberal economic policies, the violent legacies of military regimes, and the sexual fetishization of women’s bodies. They suggest strategies for confronting feminicide; propose legal, political, and social routes for redressing injustices; and track alternative remedies generated by the communities affected by gender-based violence. In a photo essay portraying the justice movement in Chihuahua, relatives of disappeared and murdered women bear witness to feminicide and demand accountability. Contributors : Pascha Bueno-Hansen, Adriana Carmona López, Ana Carcedo Cabañas, Jennifer Casey, Lucha Castro Rodríguez , Angélica Cházaro, Rebecca Coplan, Héctor Domínguez-Ruvalcaba, Marta Fontenla, Alma Gomez Caballero, Christina Iturralde, Marcela Lagarde y de los Ríos, Julia Estela Monárrez Fragoso, Hilda Morales Trujillo, Mercedes Olivera, Patricia Ravelo Blancas, Katherine Ruhl, Montserrat Sagot, Rita Laura Segato, Alicia Schmidt Camacho, William Paul Simmons, Deborah M. Weissman, Melissa W. Wright",
  "genres": [
    "Feminism",
    "Nonfiction"
  ],
  "author": "Rosa-Linda  Fregoso",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/7472698-terrorizing-women"
}