{
  "title": "Satan: The Early Christian Tradition",
  "description": "Undeniably, evil exists in our world; we ourselves commit evil acts. How can one account for evil's ageless presence, its attraction, and its fruits? The question is one that Jeffrey Burton Russell addresses in his history of the concept of the Devil the personification of evil itself. In the predecessor to this book, The Devil: Perceptions of Evil from Antiquity to Primitive Christianity, Russell traced the idea of the Devil in comparative religions and examined its development in Western thought through ancient Hebrew religion and the New Testament. This volume follows its course over the first five centuries of the Christian era.Like most theological problems, the question of evil was largely ignored by the primitive Christian community. The later Christian thinkers who wrestled with it for many centuries were faced with a seemingly irreconcilable paradox: If God is benevolent and omnipotent, why does He permit evil? How, on the other hand, can God be all-powerful if one adopts a dualist stance, and posits two divine forces, one good and one evil?Drawing upon a rich variety of literary sources as well as upon the visual arts, Russell discusses the apostolic fathers, the apologetic fathers, and the Gnostics. He goes on to treat the thought of Irenaeus and Tertullian, and to describe the diabology of the Alexandrian fathers, Clement and Origen, as well as the dualist tendencies in Lactantius and in the monastic fathers. Finally he addresses the syntheses of the fifth century, especially that of Augustine, whose view of the Devil has been widely accepted in the entire Christian community ever since.Satan is both a revealing study of the compelling figure of the Devil and an imaginative and persuasive inquiry into the forces that shape a concept and ensure its survival.\"",
  "genres": [
    "Religion",
    "History",
    "Nonfiction",
    "Christianity",
    "Philosophy",
    "Mythology",
    "Psychology"
  ],
  "author": "Jeffrey Burton Russell",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/1305142.Satan"
}