{
  "title": "The 272: The Families Who Were Enslaved and Sold to Build the American Catholic Church",
  "description": "“An absolutely essential addition to the history of the Catholic Church, whose involvement in New World slavery sustained the Church and, thereby, helped to entrench enslavement in American society.”—Annette Gordon-Reed, Pulitzer Prize–winning author of The Hemingses of Monticello and On Juneteenth\nNew York Times Book Review Editors’ Choice • Longlisted for the Andrew Carnegie MedalA BEST BOOK OF THE The New Yorker, The New York Times Book Review, The Washington Post, Time, Chicago Public Library, Kirkus ReviewsIn 1838, a group of America’s most prominent Catholic priests sold 272 enslaved people to save their largest mission project, what is now Georgetown University. In this groundbreaking account, journalist, author, and professor Rachel L. Swarns follows one family through nearly two centuries of indentured servitude and enslavement to uncover the harrowing origin story of the Catholic Church in the United States. Through the saga of the Mahoney family, Swarns illustrates how the Church relied on slave labor and slave sales to sustain its operations and to help finance its expansion. The story begins with Ann Joice, a free Black woman and the matriarch of the Mahoney family. Joice sailed to Maryland in the late 1600s as an indentured servant, but her contract was burned and her freedom stolen. Her descendants, who were enslaved by Jesuit priests, passed down the story of that broken promise for centuries. One of those descendants, Harry Mahoney, saved lives and the church’s money in the War of 1812, but his children, including Louisa and Anna, were put up for sale in 1838. One daughter managed to escape, but the other was sold and shipped to Louisiana. Their descendants would remain apart until Rachel Swarns’s reporting in The New York Times finally reunited them. They would go on to join other GU272 descendants who pressed Georgetown and the Catholic Church to make amends, prodding the institutions to break new ground in the movement for reparations and reconciliation in America.Swarns’s journalism has already started a national conversation about universities with ties to slavery. The 272 tells an even bigger story, not only demonstrating how slavery fueled the growth of the American Catholic Church but also shining a light on the enslaved people whose forced labor helped to build the largest religious denomination in the nation.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Race",
    "American History",
    "Audiobook",
    "African American"
  ],
  "author": "Rachel L. Swarns",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/74872266-the-272"
}