{
  "title": "Women in the Classical World: Image and Text",
  "description": "Information about women is scattered throughout the fragmented mosaic of ancient history: the vivid poetry of Sappho survived antiquity on remnants of damaged papyrus; the inscription on a beautiful fourth century B.C.E. grave praises the virtues of Mnesarete, an Athenian woman who died young; a great number of Roman wives were found guilty of poisoning their husbands, but was it accidental food poisoning, or disease, or something more sinister. Apart from the legends of Cleopatra, Dido and Lucretia, and images of graceful maidens dancing on urns, the evidence about the lives of women of the classical world--visual, archaeological, and written--has remained uncollected and uninterpreted.Now, the lavishly illustrated and meticulously researched Women in the Classical World lifts the curtain on the women of ancient Greece and Rome, exploring the lives of slaves and prostitutes, Athenian housewives, and Rome's imperial family. The first book on classical women to give equal weight to written texts and artistic representations, it brings together a great wealth of materials--poetry, vase painting, legislation, medical treatises, architecture, religious and funerary art, women's ornaments, historical epics, political speeches, even ancient coins--to present women in the historical and cultural context of their time. Written by leading experts in the fields of ancient history and art history, women's studies, and Greek and Roman literature, the book's chronological arrangement allows the changing roles of women to unfold over a thousand-year period, beginning in the eighth century B.C.E. Both the art and the literature highlight women's creativity, sexuality and comingof age, marriage and childrearing, religious and public roles, and other themes. Fascinating chapters report on the wild behavior of Spartan and Etruscan women and the mythical Amazons; the changing views of the female body presented in male-authored gynecological treatises; the \"new woman\" represented by the love poetry of the late Republic and Augustan Age; and the traces of upper- and lower-class life in Pompeii, miraculously preserved by the eruption of Mount Vesuvius in 79 C.E. Provocative and surprising, Women in the Classical World is a masterly foray into the past, and a definitive statement on the lives of women in ancient Greece and Rome.",
  "genres": [
    "History",
    "Nonfiction",
    "Textbooks",
    "Ancient History",
    "Greece",
    "Classics",
    "Classical Studies"
  ],
  "author": "Elaine Fantham",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/748658.Women_in_the_Classical_World"
}