{
  "title": "Venetia Kelly's Traveling Show: A Novel of Ireland",
  "description": "“She sprang from the womb and waved to the crowd. Then smiled and took a bow.” And so we first meet Venetia Kelly, the beguiling actress at the center of this new, spellbinding, and epic novel by Frank Delaney, the bestselling author of Ireland and Shannon .January 1932: While Ireland roils in the run-up to the most important national election in the Republic’s short history, Ben MacCarthy and his father watch a vagabond variety revue making a stop in the Irish countryside. After a two-hour kaleidoscope of low comedy, Shakespearean recitations, juggling, tumbling, and other entertainments, Ben’s father, mesmerized by Venetia Kelly, the troupe’s magnetic headliner, makes a fateful to abandon his family and set off on the road with Miss Kelly and her caravan. Ben’s mother, shattered by the desertion, exhorts, “Find him and bring him back,” thereby sending the boy on a Homeric voyage into manhood, a quest that traverses the churning currents of Ireland’s fractious society and splinters the MacCarthy family.Interweaving historical figures including W. B. Yeats, and a host of unforgettable creations—“King” Kelly, Venetia’s violent, Mephistophelean grandfather; Sarah Kelly, Venetia’s mysterious, amoral mother; and even a truth-telling ventriloquist’s dummy named Blarney—Frank Delaney unfurls a splendid narrative that spans half the world and a tumultuous, eventful decade. Teeming with intrigue, pathos, and humor, Venetia Kelly’s Traveling Show explores two of Ireland’s great national theater and politics. Writing with his signature mastery and lyrical prose, Frank Delaney once again delivers an unforgettable story as big and boisterous as the people and events it chronicles. From the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Ireland",
    "Fiction",
    "Irish Literature",
    "Historical",
    "Audiobook",
    "Adult Fiction"
  ],
  "author": "Frank Delaney",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/7493799-venetia-kelly-s-traveling-show"
}