{
  "title": "Codependent No More: How to Stop Controlling Others and Start Caring for Yourself",
  "description": "Three years on the New York Times bestseller list, CODEPENDENT NO MORE first identified attitudes, feelings, and behaviors now recognized as hallmarks of codependency. Checklists, activities, and self-tests provide concrete tasks to help readers examine the nuances of codependency in their lives.RECOVERY AND WELLNESSAN Expert Guide to Achieving Serenity for Codependents Who Want to Take Care of Themselves.*Have you become so absorbed in other people's problems that you don't have time to identify, or solve, your own?*Do you care so deeply about other people that you've forgotten how to care for yourself?*Do you need to control events and people around you because you feel everything around and inside you is out of control?*Do you feel responsible for so much because the people around you feel responsible for so little?By its nature, alcoholism and other compulsive disorders create victims out of everyone close to the afflicted person. Whether the person you love is an alcoholic, a gambler, a foodaholic, a workaholic, a sexaholic, a criminal, a rebellious teenager, or a neurotic parent, this book is for you—the codependent. This inspiring new overview of codependency by Melody Beattie, a recovering alcoholic and former chemical dependency counselor, details its characteristics, where the behavior comes from, and how it affects us and those around us. Offering hope and guidance, Codependent No More discusses several options to controlling behavior and helps us understand that letting go will set us free.\"We're so careful to see that no one gets hurt. No one, that is, but ourselves.\"-Anonymous Al-Anon memberCover design by David Marty",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Relationships",
    "Mental Health",
    "Personal Development",
    "Audiobook"
  ],
  "author": "Melody Beattie",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/749442.Codependent_No_More"
}