{
  "title": "Kings of the Earth",
  "description": "Following up Finn, his much-heralded and prize-winning debut whose voice evoked “the mythic styles of his literary predecessors . . . William Faulkner, Toni Morrison, Cormac McCarthy and Edward P. Jones” (San Francisco Chronicle), Jon Clinch returns with Kings of the Earth, a powerful and haunting story of life, death, and family in rural America. The edge of civilization is closer than we think.It’s as close as a primitive farm on the margins of an upstate New York town, where the three Proctor brothers live together in a kind of crumbling stasis. They linger like creatures from an older, wilder, and far less forgiving world, until one of them dies in his sleep and the other two are suspected of murder.Told in a chorus of voices that span a generation, Kings of the Earth examines the bonds of family and blood, faith and suspicion, that link not just the brothers but their entire community.Vernon, the oldest of the Proctors, is reduced by work and illness to a shambling shadow of himself. Feebleminded Audie lingers by his side, needy and unknowable. And Creed, the youngest of the three and the only one to have seen anything of the world (courtesy of the U.S. Army), struggles with impulses and accusations beyond his understanding. We also meet Del Graham, a state trooper torn between his urge to understand the brothers and his desire for justice; Preston Hatch, a kindhearted and resourceful neighbor who’s spent his life protecting the three men from themselves; the brothers’ only sister, Donna, who managed to cut herself loose from the family but is then drawn back; and a host of other living, breathing characters whose voices emerge to shape this deeply intimate saga of the human condition at its limits.",
  "genres": [
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Contemporary",
    "Literary Fiction",
    "Book Club",
    "Family"
  ],
  "author": "Jon Clinch",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/7493646-kings-of-the-earth"
}