{
  "title": "Shakespeare: For All Time",
  "description": "From the entry of Shakespeare's birth in the Stratford church register to a Norwegian production of Macbeth in which the hero was represented by a tomato, this enthralling and splendidly illustrated book tells the story of Shakespeare's life, his writings, and his afterlife.Drawing on a lifetime's experience of studying, teaching, editing, and writing about Shakespeare, Stanley Wells combines scholarly authority with authorial flair in a book that will appeal equally to the specialist and the untutored enthusiast. Chapters on Shakespeare's life in Stratford and in London offer a fresh view of the development of the writer's career and personality. At the core of the book lies a magisterial study of the writings themselves--how Shakespeare set about writing a play, his relationships with the company of actors with whom he worked, his developing mastery of the literary and rhetorical skills that he learned at the Stratford grammar school, the essentially theatrical quality of the structure and language of his plays. Subsequent chapters trace the fluctuating fortunes of his reputation and influence. Here are accounts of adaptations, productions, and individual performances in England and, increasingly, overseas; of great occasions such as the GarrickJubilee and the tercentenary celebrations of 1864; of the spread of Shakespeare's reputation in France and Germany, Russia and America, and, more recently, the Far East; of Shakespearian discoveries and forgeries; of critical reactions, favorable and otherwise, and of scholarly activity; of paintings, music, films and other works of art inspired by the plays; of the plays' use in education and the political arena, and of the pleasure and intellectual stimulus that they have given to an increasingly international public.Shakespeare, said Ben Jonson, was not of an age but for all time. This is a book about him for our time.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Literary Criticism",
    "Criticism"
  ],
  "author": "Stanley Wells",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/749394.Shakespeare"
}