{
  "title": "Mr. China's Son: A Villager's Life",
  "description": "He Liyi belongs to one of China's minorities, the Bai, and he lives in a remote area of northwestern Yunnan Province. In 1979 his wife sold her fattest pig to buy him a shortwave radio. He spent every spare moment listening to the BBC and VOA in order to improve the English he had learned at college between 1950 and 1953. For \"further practice,\" he decided to write down his life story in English. Humorous and unfiltered by translation, his autobiography is direct and personal, full of richly descriptive images and phrases from his native Bai language. At the time of He Liyi's graduation, English was being vilified as the language of the imperialists, so the job he was assigned had nothing to do with his education. In 1958 he was labeled a rightist and sent to a \"reeducation-through-labor farm.\" Spirited away by truck on the eve of his marriage, Mr. He spent years in the labor camp, where he schemed to garner favor from the authorities, who nevertheless shamed him publicly and told him that all his problems \"belong to contradictions between the people and the enemy.\" After his release in 1962, the talented Mr. He had no choice but to return to his native village as a peasant. His stratagems for survival, which included stealing \"nightsoil\" from public toilets and extracting peach-pit oil from thousands of peaches, personify the peasant's universal struggle to endure during those difficult years. He Liyi's autobiography recounts nearly all the major events of China's recent history, including the Japanese occupation, the Communist victory over the Nationalists in 1949, Mao's disastrous Great Leap Forward and Cultural Revolution, the experience of the labor camps, and changes brought about by China's dramatic re-opening to the world since Deng Xiaoping came to power in 1978, No other book so poignantly reveals the travails of the common person and village life under China's tempestuous Communist government, which He Liyi ironically refers to as \"Mr. China.\" Yet he describes his saga of poverty and hardship with humor and a surprising lack of bitterness. And rarely has there been such an intimate, frank view of how a Chinese man thinks and feels about personal relationships, revealed in dialogue and letters to his two wives. He Liyi's autobiography stands as perhaps the most readable and authentic account available in English of life in rural China. He Liyi's previous book is The Spring of Butterflies (London and New York, 1985), a translation of Chinese folk tales.",
  "genres": [
    "China",
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "World History"
  ],
  "author": "Liyi He",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/75019.Mr_China_s_Son"
}