{
  "title": "The Enigma of Capital and the Crises of Capitalism",
  "description": "For over forty years, David Harvey has been one of the world's most trenchant and critical analysts of capitalist development. In The Enigma of Capital, he delivers an impassioned account of how unchecked neoliberalism produced the system-wide crisis that now engulfs the world. Beginning in the 1970s, profitability pressures led the capitalist class in advanced countries to shift away from investment in industrial production at home toward the higher returns that financial products promised. Accompanying this was a shift towards privatization, an absolute decline in the bargaining power of labor, and the dispersion of production throughout the developing world. The decades-long and ongoing decline in wages that accompanied this turn produced a dilemma: how can goods--especially real estate--sell at the same rate as before if workers are making less in relative terms? The answer was a huge expansion of credit that fueled the explosive growth of both the financial industry and the real estate market. When one key market collapsed--real estate--the other one did as well, and social devastation resulted. Harvey places today's crisis in the broadest possible context: the historical development of global capitalism itself from the industrial era onward. Moving deftly between this history and the unfolding of the current crisis, he concentrates on how such crises both devastate workers and create openings for challenging the system's legitimacy. The battle now will be between the still-powerful forces that want to reconstitute the system of yesterday and those that want to replace it with one that prizes social justice and economic equality. The new afterword focuses on the continuing impact of the crisis and the response to it in 2010. One of Huffington Post's Best Social and Political Awareness Books of 2010 Winner of the Isaac and Tamara Deutscher Memorial Prize for 2010 Praise for the Hardcover: \"A lucid and penetrating account of how the power of capital shapes our world.\"--Andrew Gamble, Independent \"Elegant... entertainingly swashbuckling... Harvey's analysis is interesting not only for the breadth of his scholarship but his recognition of the system's strengths.\"--John Gapper, Financial Times",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "Philosophy",
    "Sociology",
    "History",
    "Theory"
  ],
  "author": "David Harvey",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/7502073-the-enigma-of-capital-and-the-crises-of-capitalism"
}