{
  "title": "So You Call Yourself a Man",
  "description": "The acclaimed national bestselling author of such smart, sexy novels as The Preacher's Son and Player Haters returns with a tale of three best friends who've grown from boys to men together. But now that they're each either married or about to be, they're coming up against some of the real tests of manhood- James Robinson and his wife, Cathy, have had their rough patches. But seven years into their marriage, things are better, and hotter, than ever- until the not-so-distant past catches up with James. During a particularly rocky period, James hooked up with a woman on his UPS route, and he wasn't just delivering packages. Now, three years later, the fling has come back to haunt him- with a baby in tow. James has to decide whether to tell his wife, or keep the affair a secret and give in to his ex-mistress's outrageous child support demands. The choice might not be so tough if he wasn't falling in love- with his newfound son. Meanwhile, James's best friend, Brent Williams, has got his own romantic complications. He's a fine brother who's had women throwing themselves at him all his life, but it's taken Brent a while to find someone who wants him for the man he is on the inside. He thinks he's found her in his fiancée, Alison Jones. The plus-size beauty isn't his usual type, but more important to Brent, she's a born-again Christian, like him. They seem like a match made in heaven until a sexy third party threatens to come between them- someone Brent has been praying to resist. Ever since he got married and moved to Seattle, Sonny Harrison has missed his friends in New York. But that's going to change now that James has pulled some strings and gotten him a job at UPS. There's just one problem- Sonny's wife. When Sonny tells her the good news, she promptly sends him packing. Sonny's heartbroken- until he reunites with his high school sweetheart, Tiffany. But his quick devotion soon turns suffocating- and scary. Tiffany wants out, but the harder she tries to end things, the harder Sonny hangs on. As his behavior becomes more and more obsessive, Brent and James may be the only ones who can intervene. But will helping Tiffany mean losing their friend forever?",
  "genres": [
    "African American",
    "Urban",
    "Fiction",
    "Romance",
    "Audiobook",
    "Drama",
    "Christian Fiction"
  ],
  "author": "Carl Weber",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/130529.So_You_Call_Yourself_a_Man"
}