{
  "title": "The Famous Flower of Serving Men",
  "description": "Certainly some of the events are real---or, to be more accurate, they are partly hidden in a genuine English ballad that was composed and sung centuries ago. Just as the song in Grabien's well-received first novel in this unusual series, The Weaver and the Factory Maid, tells a story that may or may not be based on an actual event---but that in any case reflects perfectly the world in which it is set. And once again our two very modern principals, Penelope Wintercraft-Hawkes (\"Oh, please, just 'Penny' \") and her lover, Ringan Laine, find themselves in uncomfortably closer contact with a long-gone world than they would like.It all starts when a solicitor informs Penny that an elderly aunt, a woman she never met, has died and left Penny some \"property in East Central London.\" The \"property\" turns out to be a realization of Penny's dream. She heads a touring theatre troupe that performs classic drama to audiences all over Britain and abroad. But Penny has yearned for a \"home\"---a theatre in London where she could prepare her season and launch her tours. And now, wonder of wonders, Aunt Mary--- Mary Therese Isabel Heatherington - whom Penny has never even met---has given her the very thing.At first look, the condition of the building is dismaying. It is very old and needs considerable work. But practical Aunt Mary has left money toward that purpose, and Ringan Laine is a well-known and very talented restoration architect, who when he isn't singing and playing old English songs with the other musicians in his own traveling troupe, eagerly applies his skills to Penny's theatre. And then, when Ringan is working alone late one afternoon, he is surprised to hear someone singing, singing a song so drenched with sadness he shudders at the sound.. The voice begins to be heard often during the day, and not only by Ringan. Who is the singer, what is the song that seems to have soaked into the old building's walls? Penny begins to dig into the history books and learns that there was much violence at the site centuries ago, violence that has left frightening remnants in the present. It is clear that before Penny can use her heritage they must find what terrible thing happened to the woman whose story the song seems to be telling, and what they can do to lay her ghost to final rest. Only when that is done can the curtain go up without mishap.",
  "genres": [
    "Mystery",
    "Fiction",
    "British Literature",
    "Ghosts",
    "Music",
    "Supernatural",
    "Adult"
  ],
  "author": "Deborah Grabien",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/750352.The_Famous_Flower_of_Serving_Men"
}