{
  "title": "The First Date Prophecy",
  "description": "Danny Tamberelli, 90’s Nickelodeon star from All That and The Adventures of Pete and Pete, teams up with his real-life wife Kate Tamberelli for a zany, big-hearted, and truly laugh-out-loud debut rom-com set in Brooklyn, steeped in 90’s nostalgia, and inspired by their very own love story. Perfect for fans of Christina Lauren & Emily Henry!For two talented romantic misfits who’ve been looking for love for so long, a prophecy from a psychic could be just another disastrous-first-date anecdote—or it could be the beginning of a love story for the ages . . .Brooklyn-based aspiring writer Lucy Minninger has no trouble putting the comedy in her rom-coms. It’s the romance part of the equation that’s the problem. But even as the rejection slips pile up, and her second dates dwindle, Lucy refuses to give up hope—or her HeartThrobs™ dating profile . . .Former child star Rudy Riziero made his mark on some of the most popular kids shows of the ՚90s. But that early success has pigeonholed him into a stand-up routine riffing on his past work, while the slick single life he envisioned was clearly a fantasy. He’s actually ready for a relationship, if he could just find someone uninterested in who he used to be . . .When Lucy and Rudy match online, they’re eager to meet. But after their first date ends in a psychic’s prophecy that is equal parts great fortune and certain doom, their flirty quips end and their search for answers to some of life’s big questions begins: Is there really one person for everyone? Do destinies really intertwine? Where can you find the best tacos in Brooklyn?And when it matters most, will they throw caution—and fate—to the wind, trust their instincts—and write their own futures?",
  "genres": [
    "Romance",
    "Contemporary",
    "Audiobook",
    "Fiction",
    "Chick Lit",
    "New York",
    "Humor"
  ],
  "author": "Kate Tamberelli",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/75018184-the-first-date-prophecy"
}