{
  "title": "The Three Signs of a Miserable Job: A Fable For Managers",
  "description": "A bestselling author and business guru tells how to improve your job satisfaction and performance.In his sixth fable, bestselling author Patrick Lencioni takes on a topic that almost everyone can relate to: the causes of a miserable job. Millions of workers, even those who have carefully chosen careers based on true passions and interests, dread going to work, suffering each day as they trudge to jobs that make them cynical, weary, and frustrated. It is a simple fact of business life that any job, from investment banker to dishwasher, can become miserable. Through the story of a CEO turned pizzeria manager, Lencioni reveals the three elements that make work miserable -- irrelevance, immeasurability, and anonymity -- and gives managers and their employees the keys to make any job more fulfilling.As with all of Lencioni's books, this one is filled with actionable advice you can put into effect immediately. In addition to the fable, the book includes a detailed model examining the three signs of job misery and how they can be remedied. It covers the benefits of managing for job fulfillment within organizations -- increased productivity, greater retention, and competitive advantage -- and offers examples of how managers can use the applications in the book to deal with specific jobs and situations.Patrick Lencioni (San Francisco, CA) is President of The Table Group, a management consulting firm specializing in executive team development and organizational health. As a consultant and keynote speaker, he has worked with thousands of senior executives and executive teams in organizations ranging from Fortune 500 companies to high-tech startups to universities and nonprofits. His clients include AT&T, Bechtel, Boeing, Cisco, Sam's Club, Microsoft, Mitsubishi, Allstate, Visa, FedEx, New York Life, Sprint, Novell, Sybase, The Make-A-Wish Foundation, and the U.S. Military Academy at West Point. Lencioni is the author of six bestselling books, including The Five Dysfunctions of a Team. He previously worked for Oracle, Sybase, and the management consulting firm Bain & Company.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Management",
    "Self Help",
    "Audiobook",
    "Personal Development"
  ],
  "author": "Patrick Lencioni",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/749937.The_Three_Signs_of_a_Miserable_Job"
}