{
  "title": "The Empathic Civilization: The Race to Global Consciousness in a World in Crisis",
  "description": "In this sweeping new interpretation of the history of civilization, bestselling author Jeremy Rifkin looks at the evolution of empathy and the profound ways that it has shaped our development–and is likely to determine our fate as a species. Today we face unparalleled challenges in an energy–intensive and interconnected world that will demand an unprecedented level of mutual understanding among diverse peoples and nations. Do we have the capacity and collective will to come together in a way that will enable us to cope with the great challenges of our time? In this remarkable book Jeremy Rifkin tells the dramatic story of the extension of human empathy from the rise of the first great theological civilizations, to the ideological age that dominated the 18th and 19th centuries, the psychological era that characterized much of the 20th century and the emerging dramaturgical period of the 21st century. The result is a new social tapestry–The Empathic Civilization–woven from a wide range of fields. Rifkin argues that at the very core of the human story is the paradoxical relationship between empathy and entropy. At various times in history new energy regimes have converged with new communication revolutions, creating ever more complex societies that heightened empathic sensitivity and expanded human consciousness. But these increasingly complicated milieus require extensive energy use and speed us toward resource depletion. The irony is that our growing empathic awareness has been made possible by an ever–greater consumption of the Earth′s resources, resulting in a dramatic deterioration of the health of the planet. If we are to avert a catastrophic destruction of the Earth′s ecosystems, the collapse of the global economy and the possible extinction of the human race, we will need to change human consciousness itself–and in less than a generation. Rifkin challenges us to address what may be the most important question facing humanity today: Can we achieve global empathy in time to avoid the collapse of civilization and save the planet? One of the most popular social thinkers of our time, Jeremy Rifkin is the bestselling author of The European Dream, The Hydrogen Economy¸ The End of Work, The Biotech Century, and The Age of Access. He is the president of the Foundation on Economic Trends in Washington, D.C.",
  "genres": [
    "Nonfiction",
    "History",
    "Psychology",
    "Philosophy",
    "Sociology",
    "Politics",
    "Cultural"
  ],
  "author": "Jeremy Rifkin",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/7502392-the-empathic-civilization"
}