{
  "title": "Dark Spells: Four Books",
  "description": "Boxed set of six bestselling supernatural novels by #1 bestselling authors, J.R. Rain and Scott Nicholson, 1. BAD BLOODMeet Spider, the go-to guy for supernatural problems. When teenager Parker Cole seeks his help regarding her father's cult at Mount Shasta and her friend's mysterious death, Spider suspects a fellow vampire's involvement. Dive into a gripping tale of intrigue and vampire vigilante justice.2. SPIDER WEBSpider, the reluctant vampire with a heart, faces chaos on a Caribbean cruise. Join him as he navigates through gluttony, a stolen zombie finger, and a crime lord's quest for a supernatural artifact. The cruise turns deadly when passengers are threatened with zombification. Spider must save lives and keep himself and Parker alive in this humorous and action-packed sequel.3. SPIDER BITESpider, the vampire with a conscience, strives to make amends for his dark past. As he falls in love with mortal Parker Cole, they face challenges when Parker's cousin, Dylan, is cursed. Spider embarks on a mission involving a necrophiliac ghost, the Devil, and true love. Experience a blend of romance, redemption, and supernatural battles in this captivating installment.4. CURSEDAlbert Shipway is an ordinary guy who's made an extraordinary mistake... a mistake that has left a family in ruins. Unfortunately for Albert, he picked the wrong family. Now he thinks the past is forgotten and today is just another day, another lunch, another order of kung pao chicken. Little does he know that he's about to meet a little old lady who knows his greatest fear. A little old lady who knows what's hiding in his heart. A little old lady who dishes up a big stew of supernatural revenge. In just a matter of minutes, Albert's simple life is about to be turned upside down. Indeed, Albert is about to enter a world where magic and evil lurk just beneath the fabric of southern California, where all his past choices have brewed a perfect storm of broken hearts, broken promises, and shattered families... and he's about to pay the ultimate price. Unless he can start righting some wrongs... and fast.5. GHOST COLLEGEParanormal investigators Ellen and Monty Drew tackle mysterious voices at a Southern California bible college. Skepticism turns to reality as they encounter the ghost of a young girl and a Latin phrase hinting at a dark history. Facing a Dark Master with a century of demonic deeds, the Drews embark on a battle transcending reality's boundaries.6. THE VAMPIRE CLUBEnter the world of The Vampire Club, a group of college misfits searching for a centuries-old vampire in rural Pennsylvania. As they unearth the first documented case of a real vampire, a secret society of vampire hunters aims to keep the undead permanently buried. The journey involves humor, romance, and the quest to resurrect an actual vampire.Click BUY NOW or READ FOR FREE today!",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Mystery",
    "Fiction",
    "Vampires",
    "Horror",
    "Suspense"
  ],
  "author": "J.R. Rain",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/13052395-dark-spells"
}