{
  "title": "The Journalist and the Murderer",
  "description": "A seminal work and examination of the psychopathology of journalism. Using a strange and unprecedented lawsuit by a convicted murder againt the journalist who wrote a book about his crime, Malcolm delves into the always uneasy, sometimes tragic relationship that exists between journalist and subject.Featuring the real-life lawsuit of Jeffrey MacDonald, a convicted murderer, against Joe McGinniss, the author of Fatal Vision.In Malcolm's view, neither journalist nor subject can avoid the moral impasse that is built into the journalistic situation. When the text first appeared, as a two-part article in The New Yorker , its thesis seemed so radical and its irony so pitiless that journalists across the country reacted as if stung.Her book is a work of journalism as well as an essay on it at once exemplifies and dissects its subject. In her interviews with the leading and subsidiary characters in the MacDonald-McGinniss case -- the principals, their lawyers, the members of the jury, and the various persons who testified as expert witnesses at the trial -- Malcolm is always aware of herself as a player in a game that, as she points out, she cannot lose. The journalist-subject encounter has always troubled journalists, but never before has it been looked at so unflinchingly and so ruefully. Hovering over the narrative -- and always on the edge of the reader's consciousness -- is the MacDonald murder case itself, which imparts to the book an atmosphere of anxiety and uncanniness.The Journalist and the Murderer derives from and reflects many of the dominant intellectual concerns of our time, and it will have a particular appeal for those who cherish the odd, the off-center, and the unsolved.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Journalism",
    "Crime",
    "Psychology",
    "Writing",
    "Essays"
  ],
  "author": "Janet Malcolm",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/750596.The_Journalist_and_the_Murderer"
}