{
  "title": "Sympathy for the Devil",
  "description": "The Devil is known by many names: Serpent, Tempter, Beast, Adversary, Wanderer, Dragon, Rebel. His traps and machinations are the stuff of legends. His faces are legion. No matter what face the devil wears, Sympathy for the Devil has them all. Edited by Tim Pratt, Sympathy for the Devil collects the best Satanic short stories by Neil Gaiman, Holly Black, Stephen King, Kage Baker, Charles Stross, Elizabeth Bear, Jay Lake, Kelly Link, China Mieville, Michael Chabon, and many others, revealing His Grand Infernal Majesty, in all his forms. Thirty-five stories, from classics to the cutting edge, exploring the many sides of Satan, Lucifer, the Lord of the Flies, the Father of Lies, the Prince of the Powers of the Air and Darkness, the First of the Fallen... and a Man of Wealth and Taste. Sit down and spend a little time with the Devil.The price / Neil Gaiman --Beluthahatchie / Andy Duncan --Ash City stomp / Richard Butner --Ten for the devil / Charles de Lint --A reversal of fortune / Holly Black --Young Goodman Brown / Nathaniel Hawthorne --The man in the black suit / Stephen King --The power of speech / Natalie Babbitt --The redemption of Silky Bill / Sarah Zettel --Sold to Satan / Mark Twain --MetaPhysics / Elizabeth M. Glover --Snowball's chance / Charles Stross --Non-disclosure agreement / Scott Westerfeld --Like riding a bike / Jan Wildt --Bible stories for adults, no. 31: the covenant / James Morrow --And the deep blue sea / Elizabeth Bear --The goat cutter / Jay Lake --On the road to New Egypt / Jeffrey Ford --That hell-bound train / Robert Bloch --The god of dark laughter / Michael Chabon --The king of the djinn / David Ackert and Benjamin Rosenbaum --Summon, bind, banish / Nick Mamatas --The bottle imp / Robert Louis Stevenson --Two old men / Kage Baker --With [text struck through] By good intentions / Carrie Richerson --Nine Sundays in a row / Kris Dikeman --Lull / Kelly Link --We can get them for you wholesale / Neil Gaiman --Details / China Mieville --The devil disinvests / Scott Bradfield --Faustfeathers / John Kessel --The professor's teddy bear / Theodore Sturgeon --The Heidelberg cylinder / Jonathan Carroll --Mike's place / David J. Schwartz --This I refute Beelzy / John Collier --Inferno: canto XXXIV / Dante Alighieri (trans. by Henry Wadsworth Longfellow)",
  "genres": [
    "Horror",
    "Short Stories",
    "Fantasy",
    "Anthologies",
    "Fiction",
    "Demons",
    "Science Fiction"
  ],
  "author": "Tim Pratt",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/7505560-sympathy-for-the-devil"
}