{
  "title": "Royal Enigma",
  "description": "The unsettling politics of India and Nepal as a backdrop, where the popular leaders have to be assassinated mostly, Nawin lives through the Maoist-war in the country, bearing the hardship it caused to the ordinary people like him. He finally discovers how much his step-mother had helped him, when his mother has died recently, when he and his brother were too young. He also feels his helplessness for not being to support her, in her efforts to maintain her mentally-invalid son, at a late age. Also is described the rule of monarchy in Nepal, when it held the absolute power, and the royal massacre, which eliminated the entire family of the king. During the Maoist-war, the violence unleashed by them and counter-violence by the security forces too is dealt in fair-details. This book is an effort to define the socio-politics of the Indian subcontinent, through fiction, which has been remarkably violent--as far as one could remember.\t Epic and dramaticNepal is an enigma to outsiders but a new novel opens a stunning window into the country and its society. The Royal Enigma uniquely mixes fiction and fact to tell the epic story of the 2001 assassination of the Nepalese royal family and its ongoing impact on the people of Nepal. Chapters detailing actual events alternate with the fictional life of Nawin, his life a personal mirror on the larger tragic national events. The Royal Enigma tells a real life story in a very different and appealing way. For years, Nepal was savaged by a civil war. On one side were the King and the democratically elected government (not quite the same thing), on the other side were brutal Maoist revolutionaries who terrorized the countryside. After years of war, one night most of the Nepalese royal family was assassinated. The official story? The Crown Prince shot all of them and then himself because he could not marry the woman he loved. The story most Nepalese believe? The King was assassinated because he was secretly working with the Maoists to destroy the democratically elected government. The Royal Enigma presents all the known facts and theories behind the assassinations. It is a great novel for anyone interested in real life political conspiracies! The story of the civil war is paralleled by chapters focusing on the disruption and corruption it brought to Nepalese society. That story is personified in Nawin and his family and friends. He leaves his family responsibilities of looking after his step-mother and disabled half-brother, and instead becomes a pharmaceutical salesperson working from Kathmandu. Nawin and the colourful people he meets illustrate traditional Nepalese culture along with the intrusion of outside elements. The two stories are epic and dramatic, spanning decades.Victor Schwartzman",
  "genres": [],
  "author": "K.B.",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/13054033-royal-enigma"
}