{
  "title": "13 Bankers: The Wall Street Takeover and the Next Financial Meltdown",
  "description": "Even after the ruinous financial crisis of 2008, America is still beset by the depredations of an oligarchy that is now bigger, more profitable, and more resistant to regulation than ever. Anchored by six megabanks—Bank of America, JPMorgan Chase, Citigroup, Wells Fargo, Goldman Sachs, and Morgan Stanley—which together control assets amounting, astonishingly, to more than 60 percent of the country’s gross domestic product, these financial institutions (now more emphatically “too big to fail”) continue to hold the global economy hostage, threatening yet another financial meltdown with their excessive risk-taking and toxic “business as usual” practices. How did this come to be—and what is to be done? These are the central concerns of 13 Bankers, a brilliant, historically informed account of our troubled political economy. In 13 Bankers, Simon Johnson—one of the most prominent and frequently cited economists in America (former chief economist of the International Monetary Fund, Professor of Entrepreneurship at MIT, and author of the controversial “The Quiet Coup” in The Atlantic )—and James Kwak give a wide-ranging, meticulous, and bracing account of recent U.S. financial history within the context of previous showdowns between American democracy and Big from Thomas Jefferson to Andrew Jackson, from Theodore Roosevelt to Franklin Delano Roosevelt. They convincingly show why our future is imperiled by the ideology of finance (finance is good, unregulated finance is better, unfettered finance run amok is best) and by Wall Street’s political control of government policy pertaining to it. As the authors insist, the choice that America faces is whether Washington will accede to the vested interests of an unbridled financial sector that runs up profits in good years and dumps its losses on taxpayers in lean years, or reform through stringent regulation the banking system as first and foremost an engine of economic growth. To restore health and balance to our economy, Johnson and Kwak make a radical yet feasible and focused reconfigure the megabanks to be “small enough to fail.” Lucid, authoritative, crucial for its timeliness, 13 Bankers is certain to be one of the most discussed and debated books of 2010.",
  "genres": [
    "Economics",
    "Finance",
    "Nonfiction",
    "Business",
    "History",
    "Politics",
    "Banking"
  ],
  "author": "Simon Johnson",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/7510517-13-bankers"
}