{
  "title": "تكوين المفكر",
  "description": "\"فإني لا أُخفي أنني تردت كثيراً قبل الإقدام على تأليف هذا الكتاب ، وذلك خشية أن يتوهم متوهم أنه إذا اطلع على كتاب أو كتابين أو عشرة كتب ... في تحسين المحاكمة العقلية وتحسين أسلوب ممارسة التفكير وفي تنمية الحس النقدي ... فإنه يصبح مفكراً ، وهذا بالطبع غير صحيح ، لما سأذكره بعد ، لكن الذي جعلني أتجاوز التردد في الشروع في هذا العمل هو الاتصالات التي تأتيني من كثير من الشباب الذين يرغبون في الولوج في عالم الفكر والتفكير والمفكرين ، وذلك بسبب جاذبية ما تدل عليه هذه الألفاظ في هذه الأيام ، تلك الجاذبية التي نشأت بسبب ما يراه الناس من تباين بين ما يطرحه المتحدثون والمؤلفون في تخصصاتهم وبين ما يطرحه من يُلقبون ب(المفكرين) حول القضايا والمشكلات السياسية والاجتماعية والحضارية على نحو عام . وإذا عدنا إلى الوراء نحواً من عشرين سنة ، فسنجد أن كثيراً من طلاب العلم لم يكونوا يُظهرون أي قدر من الارتياح والاطمئنان لتحليلات المفكرين ومقارباتهم ، ولعل ذلك يعود إلى هشاشة المعرفة الشرعية لدى كثير منهم ، مما ولّد لدى المتابعين لهم ، الخوف من الابتعاد عن النصوص والضوابط والآداب الشرعية أثناء التنظير لتوصيف المشكلات المعاصرة وأثناء البحث عن حلول لها ...\"____________________دراسة عميقة عن شخصية المفكر، وتكوينه، وصفاته، وكيفية تأثره وتفاعله مع المحيط من حوله.محور الكتاب يدور على مفهوم التفكير باعتباره السمة الأساس التي ترسم هوية المفكر، وقد تناولها الدكتور بالتفصيل موضحا علاقتها باللغة والعواطف تأثيرا وتأثرا، إيجابا وسلبا. يقدم الكتاب دراسة نقدية لواقع التفكير ومشكلاته، كما أنه يعرض خطوات وتطبيقات عملية تعين على فهم عملية التفكير، وتساعد على إدراك تفاعلاتها مع الوسط المحيط ، ويوضح حلولا عملية لتجاوز بعض المشكلات التي قد تعرض للمفكر بشكل موجز ويسير. المحتويات بشكل وجز : 1- من هو المفكر ؟. 2- من صفات المفكر. 3- العقل والدماغ. 4- الحقيقة (مفهومها وخصائصها وطريقة تعامل المفكر معها). 5- التفكير (ما التفكير - التفكير والعاطفة - التفكير واللغة - التفكير والعقل الجمعي). 6- الإبداع (طرقه وتنميته). 7- التفكير النقدي وعقباته. 8- الواقع (كيفية فهمه والحكم عليه). 9- المطلق والنسبي . 10 المعرفة (أهميتها وطرق التعامل معها) 11- أمور تستحق الحذر . 12- تطوير الأفكار .",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Parenting",
    "Unfinished",
    "Self Help"
  ],
  "author": "عبدالكريم بكار",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/7518170"
}