{
  "title": "The Facebook Effect: The Inside Story of the Company That is Connecting the World",
  "description": "The inside story of Facebook, told with the full, exclusive cooperation of founder Mark Zuckerberg and the company's other leaders.In little more than half a decade, Facebook has gone from a dorm-room novelty to a company with 500 million users. It is one of the fastest growing companies in history, an essential part of the social life not only of teenagers but hundreds of millions of adults worldwide. As Facebook spreads around the globe, it creates surprising effects—even becoming instrumental in political protests from Colombia to Iran.Veteran technology reporter David Kirkpatrick had the full cooperation of Facebook’s key executives in researching this fascinating history of the company and its impact on our lives. Kirkpatrick tells us how Facebook was created, why it has flourished, and where it is going next. He chronicles its successes and missteps, and gives readers the most complete assessment anywhere of founder and CEO Mark Zuckerberg, the central figure in the company’s remarkable ascent. This is the Facebook story that can be found nowhere else.How did a nineteen-year-old Harvard student create a company that has transformed the Internet and how did he grow it to its current enormous size? Kirkpatrick shows how Zuckerberg steadfastly refused to compromise his vision, insistently focusing on growth over profits and preaching that Facebook must dominate (his word) communication on the Internet. In the process, he and a small group of key executives have created a company that has changed social life in the United States and elsewhere, a company that has become a ubiquitous presence in marketing, altering politics, business, and even our sense of our own identity. This is the Facebook Effect.",
  "genres": [
    "Business",
    "Nonfiction",
    "Technology",
    "Biography",
    "Entrepreneurship",
    "History",
    "Social Media"
  ],
  "author": "David   Kirkpatrick",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/7518289-the-facebook-effect"
}