{
  "title": "The Wind in the Willows",
  "description": "The Wind in the Willows, by Kenneth Grahame, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate. All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences - biographical, historical, and literary - to enrich each reader's understanding of these enduring works.When Mole decides he has had enough tiresome spring-cleaning for one day, the scrappy nonesuch throws down his broom and bolts out of his house looking for fun and adventure. He quickly finds it in the form of the Water Rat, who takes the wide-eyed Mole boating and introduces him to the mysteries of life on the river and in the Wild Wood. Mole also meets Ratty's good friends: the kindly, solid Badger and the irrepressible Toad. Soon, the quartet's escapades - including car crashes, a sojourn in jail, and a battle with the weasels who try to take over Toad Hall - become the talk of the animal kingdom. Filled with familiar human types disguised as animals, Kenneth Grahame's The Wind in the Willows, like all exemplary children's literature, has always appealed greatly to grown-ups as well. Though first published in 1908, when \"motor-cars\" were new and rare, The Wind in the Willows presents surprisingly contemporary, and uproariously funny, portraits of speed-crazed Mr. Toad, generous Badger, poetic Ratty, and newly-emancipated Mole. And lurking all the while within the humor and good spirits, Grahame's deeply felt commentary on courage, generosity, and above all, friendship.Gardner McFallis the author of two children's books and a collection of poetry. She teaches children's literature at Hunter College in New York City.",
  "genres": [
    "Fiction",
    "Childrens",
    "Fantasy",
    "Classics",
    "Animals",
    "Young Adult",
    "Middle Grade"
  ],
  "author": "Kenneth Grahame",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/7515669-the-wind-in-the-willows"
}