{
  "title": "Broken: The Failed Promise of Muslim Inclusion",
  "description": "PROSE Award- Media and Cultural Studies FinalistHow diversity initiatives end up marginalizing Arab Americans and US MuslimsOne of Donald Trump’s first actions as President was to sign an executive order to limit Muslim immigration to the United States, a step toward the “complete shutdown of Muslims entering the United States” he had campaigned on. This extraordinary act of Islamophobia provoked unprecedented Hollywood movies and mainstream television shows began to feature more Muslim characters in contexts other than terrorism; universities and private businesses included Muslims in their diversity initiatives; and the criminal justice system took hate crimes against Muslims more seriously. Yet Broken argues that, even amid this challenge to institutionalized Islamophobia, diversity initiatives fail on their promise by only focusing on crisis moments.Evelyn Alsultany argues that Muslims get included through “crisis diversity,” where high-profile Islamophobic incidents are urgently responded to and then ignored until the next crisis. In the popular cultural arena of television, this means interrogating even those representations of Muslims that others have celebrated as refreshingly positive. What kind of message does it send, for example, when a growing number of “good Muslims” on TV seem to have arrived there, ironically, only after leaving the faith? In the realm of corporations, she critically examines the firing of high-profile individuals for anti-Muslim speech―a remedy that rebrands corporations as anti-racist while institutional racism remains intact. At universities, Muslim students get included in diversity, equity, and inclusion plans but that gets disrupted if they are involved in Palestinian rights activism. Finally, she turns to hate crime laws revealing how they fail to address root causes.In each of these arenas, Alsultany finds an institutional pattern that defangs the promise of Muslim inclusion, deferring systemic change until and through the next “crisis.”",
  "genres": [
    "Nonfiction",
    "Islam"
  ],
  "author": "Evelyn Alsultany",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/75268277-broken"
}