{
  "title": "Red: The Next Generation of American Writers--Teenage Girls--On What Fires Up Their Lives Today",
  "description": "A vivid portrait of what it means to be a teenage girl in America today, from 58 of the country's finest, most credentialed writers on the subjectIf you're a teenage girl today, you live your life in words-in text and instant messages, on blogs and social network pages. It's how you conduct your friendships and present yourself to the world. Every day, you're creating a formidable body of personal written work.This generation's unprecedented comfort level with the written word has led to a fearless new American literature. These collected essays, at last, offer a key to understanding the inscrutable teenage girl-one of the most mislabeled and underestimated members of society, argues editor and writer Amy Goldwasser, whose work has appeared in Seventeen , Vogue , The New York Times , and The New Yorker . And while psychologists and other experts have tried to explain the teen girl in recent years, no book since Ophelia Speaks has given her the opportunity to speak for herself-until now.In this eye-opening collection, nearly sixty teenage girls from across the country speak out, writing about everything from post-Katrina New Orleans to Johnny Depp; from learning to rock climb to starting a rock band; from the loneliness of losing a best friend to the loathing or pride they feel about their bodies. Ranging in age from 13 to 19, and hailing from Park Avenue to rural Nevada, Georgia to Hawaii, the girls in RED-whose essays were selected from more than 800 contributions-represent a diverse spectrum of socioeconomic, political, racial, and religious backgrounds, creating a rich portrait of life as a teen girl in America today.Revealing the complicated inner lives, humor, hopes, struggles, thrills, and obsessions of this generation, RED ultimately provides today's teen girl with much-needed community, perspective, and validation-and helps the rest of us to better understand her.",
  "genres": [
    "Nonfiction",
    "Essays",
    "Short Stories",
    "Feminism",
    "Anthologies",
    "Writing",
    "Gender"
  ],
  "author": "Amy Goldwasser",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/751887.Red"
}