{
  "title": "The Last Lion of Karkov",
  "description": "\"Emotionally compelling protagonists and an action-packed storyline make this a rousing fantasy read.\" - Kirkus Reviews\"Commanding attention, the novel is propelled toward its gripping end: the world into which the twins were born is not the world that they will leave behind. Intelligent and brave, they inspire a new generation of citizens.\" - Foreword Reviews  Raised in Karkov, a military, male-dominant kingdom, twins Natalia and Jillian know nothing but battle. When Jillian emerges as the dominant twin and apparent heir to the throne, Natalia, the softer and more diplomatic sister, ceases her military training. As Natalia prepares to marry the prince of her father’s favored Western ally, Jillian is set to become the first woman Lion of Karkov. But things don’t go as planned when the older generation of warriors values her womb over her sword. Suddenly, the role Jillian has fought for all her life is slipping through her fingers…and she’s not about to let it go without a fight.At first, Jillian wants to destroy the young male warrior that the older generation favors. But soon, the two begin to fall for each other, and dark secrets behind Karkov’s past come to light. Now, Jillian finds herself in the unthinkable position of defending her former rival…and defying her father. Her defiance inspires a younger generation of warriors, who dub her the Lioness of Karkov.Furious, her father ousts Jillian and the warriors who swore allegiance to her, setting in motion a chain of events that will disrupt everything he swore to protect. As innocent lands suffer invasion, greedy monarchies fall to revolution, and the wedding of the century threatens to live up to its name, Jillian and Natalia must reckon with the consequences of love and war. When four nations converge on a battlefield, one sister must decide whether to embrace the life she always wanted—or stand up for the destiny that was never meant for her.",
  "genres": [
    "Fantasy",
    "Romance"
  ],
  "author": "Dale  Griffin",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/75210274-the-last-lion-of-karkov"
}