{
  "title": "The Trials of Madame Restell: Nineteenth-Century America’s Most Infamous Female Physician and the Campaign to Make Abortion a Crime",
  "description": "The biography of one of the most famous abortionists of the nineteenth century—and a story that has unmistakable parallels to the current war on reproductive rightsFor fifty years in the mid-nineteenth century, “Madame Restell,” the nom du guerre of the most successful female physician in America, sold birth control medication, attended women during their pregnancies, delivered their children, and performed abortions in a series of clinics run out of her home in New York City. It was the abortions that made her famous. “Restellism” became the term her detractors used to indict her.Restell began practicing when abortion was largely unregulated in most of the United States, including New York. Vilifying her became one strategy for controlling women and criminalizing abortion and birth control. But as a sense of disquiet arose about single women flocking to the city for work; greater sexual freedoms; a changing view of the roles of motherhood and childhood; and an unease about fewer children being born to white, married, middle-class women, Restell came to stand for everything that threatened the status quo. From 1829 onward, restrictions on abortion began to put Restell in legal jeopardy. For much of this period she prevailed—until she didn’t.A story that is all too relevant to the current attempts to criminalize abortion in our own age, The Trials of Madame Restell paints an unforgettable picture of the changing society of nineteenth-century New York and brings Restell to the attention of a whole new generation of women whose fundamental rights are under siege.",
  "genres": [
    "History",
    "Nonfiction",
    "Feminism",
    "Biography",
    "Audiobook",
    "Medicine",
    "Gender and Sexuality"
  ],
  "author": "Nicholas L. Syrett",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/75277339-the-trials-of-madame-restell"
}