{
  "title": "Genesis of the Pharaohs: Dramatic New Discoveries Rewrite the Origins of Ancient Egypt",
  "description": "For generations, tourists, scholars, and armchair travelers have beenintrigued by the puzzle of the ancient Egyptians' origins. Was civilization brought to the Nile Valley by invaders from other lands, even refugees from Atlantis? Or did civilization develop, over a long period, within Egypt itself? Most archaeologists favor the latter theory, yet nagging doubts have always remained because many of ancient Egypt's most distinctive elements seem to have appeared quite suddenly, as if from nowhere.Now the quest for the elusive \"missing link\" is finally over, and, in the light of dramatic new discoveries, the genesis of the pharaohs is coming into focus. Ancient Egypt, it seems, did not begin by the banks of the Nile but in a much harsher environment. The ancestors of the pyramid-builders were not village-dwelling farmers but wandering cattle-herders, and pharaonic civilization was forged in a remote region, one of the most forbidding places on earth. These are the startling conclusions of Egyptologist Toby Wilkinson, based on his own discoveries in the heart of the Eastern Desert, between the Nile Valley and the Red Sea. Here, the pharaohs' distant ancestors left a stunning legacy that has remained hidden for 6,000 years: hundreds of intricate rock carvings that tell us about their lifestyle and their deepest beliefs. Pharaonic imagery such as the afterlife journey by boat, royal hunting, and the iconography of gods and kings all find their origins in this inhospitable terrain.Genesis of the Pharaohs traces the discovery of these ancient records, dates them, and identifies the artists who made them. As the story unfolds, we travel back in time to a remarkable early period of human creativity and discover the answer to the question of where, when, and how ancient Egypt began.",
  "genres": [
    "History",
    "Egyptology",
    "Egypt",
    "Archaeology",
    "Africa",
    "Nonfiction",
    "Ancient History"
  ],
  "author": "Toby Wilkinson",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/751950.Genesis_of_the_Pharaohs"
}