{
  "title": "As If an Enemy's Country: The British Occupation of Boston and the Origins of Revolution",
  "description": "In the dramatic few years when colonial Americans were galvanized to resist British rule, perhaps nothing did more to foment anti-British sentiment than the armed occupation of Boston. As If an Enemy's Country is Richard Archer's gripping narrative of those critical months between October 1, 1768 and the winter of 1770 when Boston was an occupied town.Bringing colonial Boston to life, Archer deftly moves between the governor's mansion and cobblestoned back-alleys as he traces the origins of the colonists' conflict with Britain. He reveals the maneuvering of colonial political leaders such as Governor Francis Bernard, Lieutenant Governor Thomas Hutchinson, and James Otis Jr. as they responded to London's new policies, and he evokes the outrage many Bostonians felt towards Parliament and its local representatives.Archer captures the popular mobilization under the leadership of John Hancock and Samuel Adams that met the oppressive imperial measures--most notably the Sugar Act and the Stamp Act--with demonstrations, Liberty Trees, violence, and non-importation agreements. When the British government decided to garrison Boston with troops, it posed a shocking challenge to the people of Massachusetts. The city was flooded with troops; almost immediately, tempers flared and violent conflicts broke out. Archer's vivid tale culminates in the swirling tragedy of the Boston Massacre and its aftermath, including the trial and exoneration of the British troops involved.A thrilling and original work of history, As If an Enemy's Country tells the riveting story of what made the Boston townspeople, and with them other colonists, turn toward revolution.",
  "genres": [
    "History",
    "American Revolution",
    "Nonfiction",
    "American History",
    "18th Century",
    "American Revolutionary War"
  ],
  "author": "Richard Archer",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/7521583-as-if-an-enemy-s-country"
}