{
  "title": "City At My Feet: Mannahatta Series Book 1",
  "description": "\"Thomas More cleverly combines futuristic technology with Native American imagery in descriptions of Mannahatta and gives dazzling details to his intricately crafted universe with plenty to explore in this action-packed saga.\"\n\n- Kirkus Reviews\n\nStep into Mannahatta, a vibrant parallel world where legends whisper truth and spirits guide the brave. Sakima Tamanend, a fiery soul yearning for warriorhood, stumbles upon a chilling secret: her brother-in-law has unleashed a mythical terror upon the Land Below, the concrete jungle we call New York City.Driven by unwavering love and fierce spirit, Sakima plunges through the portal, leaving behind all she knows. In this strange new world, she'll confront towering monsters, forge unlikely alliances, and discover the truth about her own hidden powers.Brace yourself for intense action as you jump into fights with legendary beasts and real-world dangers. Watch Sakima grow with a group of friends who have special talents and secrets. Discover a world from the future filled with mixed cultures and old magic. Go on a quest to find out who you are, feeling the pain of defeat, the joy of friends, and the victory of overcoming challenges.\nPraise for City At My Feet\n\"It's clear that More has a deep respect for the Lenape and indigenous peoples of America and this is an intriguing take on a hero's journey and her motto - why live, if you can't be who you were meant to be - rings true.\" - BookLife Reviews\"Thomas More is adept at pairing a quest with experiences that involve Sakima's entire family, considering the influence of spirit-world connections, and the intersection between Native American and fantasy elements.\" - Midwest Book Review\"More blends adrenaline-packed action scenes with intricate worldbuilding and character work for a coming-of-age narrative that will appeal to everyone.\" - The BookLife Prize\"More writes a gripping and intricate science fiction novel in which a would-be warrior travels through an interdimensional portal to rescue her sister and keep all worlds safe from unimaginable monstrosities.\" - Foreword Reviews\"Thrilling, captivating, and entertaining, this book is a must-read YA Sci-Fi and Fantasy novel and a great start to the Mannahatta series that brings new worlds to life for a brilliant reading experience.\" - Anthony Avina Book Review\"Sakima is coming into herself as a warrior while dealing with loss and the pressure of her own fear, but still taking action. I wish growing up as a young Native American we had books like this to read.\" - From the Book Reviewer's Desk\"City At My Feet\" is a unique sci-fi novel that has indigenous representation with parallel universes, mythology, and time travel. The fusion of these elements is a refreshing and unique take, drawing readers into an imaginative narrative rarely explored in literature.\" - The Reading Life Blog",
  "genres": [
    "Science Fiction"
  ],
  "author": "Thomas    More",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/75273766-city-at-my-feet"
}