{
  "title": "A Brief History of Nakedness",
  "description": "As one common story goes, Adam and Eve, the first man and woman, had no idea that there was any shame in their lack of clothes; they were perfectly confident in their birthday suits among the animals of the Garden of Eden. All was well until that day when they ate from the Tree of Knowledge of Good and Evil and went scrambling for fig leaves to cover their bodies. Since then, lucrative businesses have arisen to provide many stylish ways to cover our nakedness, for the naked human body now evokes powerful and often contradictory ideas—it thrills and revolts us, signifies innocence and sexual experience, and often marks the difference between nature and society. In A Brief History of Nakedness psychologist Philip Carr-Gomm traces our inescapable preoccupation with nudity.             Rather than studying the history of the nude in art or detailing the ways in which the naked body has been denigrated in the media, A Brief History of Nakedness reveals the ways in which religious teachers, politicians, protesters, and cultural icons have used nudity to enlighten or empower themselves as well as entertain us. Among his many examples, Carr-Gomm discusses how advertisers and the media employ images of bare skin—or even simply the word “naked”—to garner our attention, how mystics have used nudity to get closer to God, and how political protesters have discovered that baring all is one of the most effective ways to gain publicity for their cause. Carr-Gomm investigates how this use of something as natural as nakedness actually gets under our skin and evokes complicated and complex emotional responses.             From the naked sages of India to modern-day witches and Christian nudists, from Lady Godiva to Lady Gaga, A Brief History of Nakedness surveys the touching, sometimes tragic and often bizarre story of our relationships with our naked bodies.",
  "genres": [
    "History",
    "Nonfiction",
    "Microhistory",
    "Art",
    "Sexuality",
    "Psychology",
    "Photography"
  ],
  "author": "Philip Carr-Gomm",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/7520292-a-brief-history-of-nakedness"
}