{
  "title": "Eat. Stop. Eat",
  "description": "Now you can lose weight through a 4-week intermittent fasting challenge! Learn how with the Eat Stop Eat program.The discovery of Brad made after years of real research? Why most diets actually won’t work long term? Find the real truth why the eating style in real North America has been really molded to support the interests of real major food companies? Learn what happens to real people in a “Fasted” state? How many actual hours into a fast will it actually take to start really burning stored fat? Does your real metabolism slow when really entering into a fast? Does fasting really actually have any negative affect on real anerobic activity such as real lifting weights or ‘cardio’ training? Will your real muscles waste away during the fasting? What are the other real myths or real misconceptions of fasting? Learn the real secret if skipping breakfast really bad for you? Should we be really eating a small frequent meals as we often hear? Discover if actually losing weight the same as really losing body fat? When and how will actually your body start to really burn body fat? Learn why the real Eat Stop Eat lifestyle is so actually easy to accomplish and also maintain for long time. What is the real ideal amount for time for a real fast? How many times per week actually to fast? How you can real fast without losing muscle mass? how much actually resistance weight training is really needed? How do you work out with really ESE? Determine if Eat Stop Eat is a actual diet or lifestyle? Do you really need to follow certain foods or any recipes, or just eat as you really normally would? Learn the real secret if women have actual special considerations for fasting? Now, that you’ve actual lost the weight, how do I really keep it off? How do you really keep the weight off for good?",
  "genres": [
    "Health",
    "Nonfiction",
    "Nutrition",
    "Fitness",
    "Self Help",
    "Diets",
    "Food"
  ],
  "author": "Brad Pilon",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/7529642-eat-stop-eat"
}