{
  "title": "Of Time and Turtles: Mending the World, Shell by Shattered Shell",
  "description": "National Book Award finalist for The Soul of an Octopus and  New York Times  bestseller Sy Montgomery turns her journalistic curiosity to the wonder and wisdom of our long-lived cohabitants—turtles—and through their stories of hope and rescue, reveals to us astonishing new perspectives on time and healing. When acclaimed naturalist Sy Montgomery and wildlife artist Matt Patterson arrive at Turtle Rescue League, they are greeted by hundreds of turtles recovering from injury and illness. Endangered by cars and highways, pollution and poachers, these turtles—with wounds so severe that even veterinarians would have dismissed them as fatal—are given a second chance at life. The League’s founders, Natasha and Alexxia, live by one creed. Never give up on a turtle. But why turtles? What is it about them that inspires such devotion? Ancient and unhurried, long-lived and majestic, their lineage stretches back to the time of the dinosaurs. Some live to two hundred years, or longer. Others spend months buried under cold winter water. Montgomery turns to these little understood yet endlessly surprising creatures to probe the eternal question  How can we make peace with our time? In pursuit of the answer, Sy and Matt immerse themselves in the delicate work of protecting turtle nests, incubating eggs, rescuing sea turtles, and releasing hatchlings to their homes in the wild. We follow the snapping turtle Fire Chief on his astonishing journey as he battles against injuries incurred by a truck. Hopeful and optimistic,  Of Time and Turtles  is an antidote to the instability of our frenzied world. Elegantly blending science, memoir, philosophy, and drawing on cultures from across the globe, this compassionate portrait of injured turtles and their determined rescuers invites us all to slow down and slip into turtle time.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Science",
    "Animals",
    "Audiobook",
    "Environment",
    "Biology"
  ],
  "author": "Sy Montgomery",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/75302956-of-time-and-turtles"
}