{
  "title": "The Wolves of Eternity",
  "description": "From the internationally bestselling author Karl Ove Knausgaard, a sprawling and deeply human novel that questions the responsibilities we have toward one another and ourselves—and the limits of what we can understand about life itselfIn 1986, twenty-year-old Syvert Løyning returns from the military to his mother’s home in southern Norway. One evening, his dead father comes to him in a dream. Realizing that he doesn’t really know who his father was, Syvert begins to investigate his life and finds clues pointing to the Soviet Union. What he learns changes his past and undermines the entire notion of who he is. But when his mother becomes ill, and he must care for his little brother, Joar, on his own, he no longer has time or space for lofty speculations.In present-day Russia, Alevtina Kotov, a biologist working at Moscow University, is traveling with her young son to the home of her stepfather, to celebrate his eightieth birthday. As a student, Alevtina was bright, curious and ambitious, asking the big questions about life and human consciousness. But as she approaches middle-age, most of that drive has gone, and she finds herself in a place she doesn’t want to be, without really understanding how she got there. Her stepfather, a musician, raised her as his own daughter, and she was never interested in learning about her biological father; when she finally starts looking into him, she learns that he died many years ago and left two sons, Joar and Syvert.Years later, when Syvert and Alevtina meet in Moscow, two very different approaches to life emerge. And as a bright star appears in the sky, it illuminates the wonder of human existence and the mysteries that exist beyond our own worldview. Set against the political and cultural backdrop of both the 1980s and the present day, The Wolves of Eternity is an expansive and affecting book about relations—to one another, to nature, to the dead.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Literature",
    "Scandinavian Literature",
    "Mystery",
    "Audiobook",
    "Magical Realism"
  ],
  "author": "Karl Ove Knausgård",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/75293514-the-wolves-of-eternity"
}