{
  "title": "The Sushi Economy: Globalization and the Making of a Modern Delicacy",
  "description": "From the sea to your plate, the first international tour of sushi’s journey in the global marketplace  One generation ago, sushi’s narrow reach ensured that sports fishermen who caught tuna in most of the world sold the meat for pennies as cat food. Today, the fatty cuts of tuna known as toro are among the planet’s most coveted luxury foods, worth hundreds of dollars a pound and capable of losing value more quickly than any other product on earth. So how has one of the world’s most popular foods gone from being practically unknown in the U.S. to being served in towns all across America, and in such a short span of time? Sushi aficionados and newcomers alike will be surprised to learn the true history, intricate business, and international allure behind this fascinating food.  A riveting combination of culinary biography, behind-the-scenes restaurant detail, and a unique exploration of globalization’s dynamics, journalist Sasha Issenberg traces sushi’s journey from Japanese street snack to global delicacy. THE SUSHI ECONOMY takes you through the stalls of Tokyo’s massive Tsukiji market, where the auctioneers sell millions of dollars of fish each day, and to the birthplace of modern sushi--in Canada. He then follows sushi’s evolution in America, exploring how it became LA’s favorite food. You’re taken behind the sushi bar with the chef Nobu Matsuhisa, whose distinctive travels helped to define the flavors of global sushi cuisine, and with a unique sushi chef blazing a path in Texas. Issenberg also delves into the complex economics of the fish trade, following the ups and downs of the hunt for bluefin off New England, the tuna cowboys on the southern coast of Australia who invented the art of tuna ranching, and uncovering the mysterious underworld of pirates, smugglers, and the tuna black market.  Few businesses reveal the complex dynamics of globalization as acutely as the tuna’s journey from the sea to the sushi bar. After traversing the pages of THE SUSHI ECONOMY, you’ll never see the food on your plate — or the world around you — quite the same way again.",
  "genres": [
    "Nonfiction",
    "Food",
    "Japan",
    "Economics",
    "History",
    "Business",
    "Food and Drink"
  ],
  "author": "Sasha Issenberg",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/753972.The_Sushi_Economy"
}