{
  "title": "The Peabody Sisters of Salem",
  "description": "The Peabody Sisters of Salem is a classic biography illuminating one of the most fascinating periods of American history: the intellectual \"flowering\" of New England, the golden age of such figures as Hawthorne, Thoreau, Channing, Emerson, Mann and Melville. \"Louise Hall Tharp.\" writes Louis Auchincloss in his introduction to this edition \"limns this era of seething intellects in the vision of three sisters, each unlike the other two. The result is a brilliant assessment of the role of women in that time and place.\" The Peabody sisters were at the hub of this whirlwind. All three taught school, a commitment reflected at all stages of their lives. Elizabeth Peabody, the oldest, is known as the founder of kindergarten in the United States. She worked as Channing's secretary for several years, unpaid and unacknowledged, and published the Dial, which Emerson edited. She ran the famous bookshop on Boston's West Street, where Hawthorne, Emerson, Margaret Fuller, Alcott and others gathered to discuss issues and literature of the time. Her enthusiasm and vigor were so memorable Henry James used her as his model for Miss Birdseye in the Bostonians. Like her sister Elizabeth, Mary was a teacher and naturally attracted to that great man of education, Horace Mann. But while it was Elizabeth whose long intimate conversations with Mann often resulted in her combing his hair, it was Mary who married him and went west with him to help found Antioch College. Their poignant love story is told with the sensitivity and humor that mark all of the sisters. None of the sisters was more sensitive or more creatively talented than Sophia, whose frailty was marked by a series of ailments. As a painter, her primary activity was the scrupulously detailed reproduction of other painters' works. But she was an intellectual and spiritual match for her husband, Nathaniel Hawthorne, and she supported him through the days of poverty and denigration as well as the times of genius and acclaim.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History"
  ],
  "author": "Louise Hall Tharp",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/753496.The_Peabody_Sisters_of_Salem"
}