{
  "title": "House of Mist And, the Shrouded Woman: Novels by Maria Luisa Bombal",
  "description": "\"Bombal--with her bold disregard for simple realism in favor of a heightened reality in which the external world reflects the internal truth of the characters' feeling, and with her deliberate mingling of fantasy, memory and event--is the precursor of the magical realism that is the flower of South American writing today. . . . Both [novels] awake a feeling of genuine discovery, of minds and hearts not borrowed from European literature but indigenous to a New World of thought and feeling.\" --Chicago Tribune \"María Luisa Bombal is the mother of us all.\" --Carlos Fuentes \"One of the most outstanding representatives of the avant-garde in Latin America. [Her] themes of erotic frustration, social marginality, and cosmic transcendence must be considered as a profound expression of women's predicament presented through a feminine perspective.\" --Women Writers of Spanish America The shrouded woman, a corpse reviewing her life as she views the mourners at her wake, perceives in the personal ties that made up her life a failure of all parties to benefit from the possibilities of true intimacy. Helga, the heroine of House of Mist, has a powerfully imaginative inner life entirely unappreciated by her husband until he finally learns to value her as something more than a trophy. In these two evocative novels, a daring blend of magical elements, innovative style, and unsparing social criticism opens a window on the privileged yet artificially useless lives of upper-class Chilean women of the earlier twentieth century. House of Mist was first published in 1935 as La última niebla and translated into English by the author in 1947. The Shrouded Woman (La amortajada) was published in Spanish in 1938 and in English in 1948, again in the author's own translation.",
  "genres": [
    "Fiction",
    "Classics",
    "Short Stories",
    "Romance",
    "Spanish Literature",
    "Magical Realism",
    "Womens"
  ],
  "author": "María Luisa Bombal",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/753343.House_of_Mist_And_the_Shrouded_Woman"
}