{
  "title": "The Rest of the Story",
  "description": "Let me earn it.I keep things simple. I’m a classic one-night wonder. Relationships? Are you out of your mind? No. No way. Not interested. My heart is vulcanized rubber, puck hard, and that’s the way I like it.Then I'm traded to the absolute worst team in the NHL, the Rocky Mountain Outlaws, and I’m hit with a one-two punch.First: I’m asked to step up and lead the team, which is every kind of bad idea you can imagine. I'm a head-down, mind-my-business kind of guy. Mr. Uninvolved, Mr. No, Not Me, Mr. Find Someone Else. But these players have been through a mess of hell, and someone thinks I can help pull them together.The Outlaws are made up of jaded veterans and wide-eyed rookies, and we have no business whatsoever succeeding. We are scrappy and plucky and built out of spit and duct-tape… and whatever we’re doing, it’s working.Second: The first day I’m in Boulder, I go over the boards and come face-to-face with a pair of blue eyes and lose my heart. Boy, howdy: meet my new co-captain, Shea Darling.He’s way, way off-limits. It's a stratospherically terrible idea to want or crave him. This crush, this infatuation, is going nowhere fast.Yeah, right. I’m gone for Shea. I’m head over heels, and I’m all tangled up in something I can’t understand or control. This isn’t me. I don’t fall in love. And there’s nothing simple about Shea, or about the Outlaws. This team is finally putting up the wins, and we are making something of ourselves. Falling for my co-captain while we’re on a Cinderella run could jeopardize everything we’re striving for.But then there’s this one night.And this one kiss.And everything changes.Eighty-two games in a season.Twenty men hungry for redemption.One co-captain who could be my forever.This is the rest of the story.*****The Rest of the Story is a friends-to-lovers, hockey players/teammates MM romance, and includes themes of survivorship.The Rest of the Story is set in the same universe as \nGravity\n, but each novel can be read independently. You do not need to read Gravity first to enjoy The Rest of the Story.",
  "genres": [
    "M M Romance",
    "Sports",
    "Romance",
    "Sports Romance",
    "Hockey",
    "Contemporary",
    "Friends To Lovers"
  ],
  "author": "Tal Bauer",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/75364705-the-rest-of-the-story"
}