{
  "title": "Speeches and Writings 1859–1865",
  "description": "Abraham Lincoln, America’s heroic Civil War president, was also the greatest writer ever to occupy the White House. His addresses at Gettysburg and at his inaugurals, his presidential messages and public lectures, are an essential record of the war and have forever shaped the nation’s memories of it. This Library of America volume collects writings from 1859 to 1865 and contains 555 speeches, messages, proclamations, letters, memoranda, and fragments. They record the words and deeds—the order to resupply Fort Sumter, the emancipation of the slaves held in the Confederacy, and proposals to offer the South generous terms of reconstruction—by which he hoped to defend and preserve the Union.The speeches and letters Lincoln wrote in 1859 and 1860 show his unyielding opposition to the spread of slavery and his canny appraisals of the upcoming election in which he was to win the presidency. His victory triggered the secession that he would oppose in his First Inaugural, with its appeal to logic, history, and “the better angels of our nature.”Lincoln’s wartime writings record the nearly overwhelming burdens of office during a fratricidal war, and the added burden of self-seeking Cabinet members, military cliques, and a bitter political opposition. He was savagely criticized both for being too harsh and for being too mild. He ordered the blockade of ports, suspended habeas corpus, jailed dissenters, and applauded Sherman’s devastating march to the sea; at the same time he granted clemency to individual Union deserters and releases to Confederate prisoners. “I expect to maintain this contest until successful,” he declared, and toward that end he was prepared, not without his characteristic drolleries, to suffer the paradoxes of leadership in a nation at war with itself. His writings here include pleas to his own party to spare him their patronage feuds and to generals that they act more resolutely in the field. The struggles that taxed his physical endurance also tempered his prose style, as evidenced in the nobility of his state papers, his sparse words at Gettysburg, and his poignant letter to Mrs. Bixby, consoling her for the deaths of her sons in battle.In a message to Congress in December 1862, Lincoln wrote of the fiery trial through which the nation was passing: “We shall nobly save, or meanly lose, the last best, hope of earth.” By 1865, he was ready to offer the nation his view of the Almighty’s purposes and did so in his Second Inaugural Address with a beauty, clarity, and severity unsurpassed in American letters. Soon after, he fell to an assassin’s bullet, joining six hundred thousand of his countrymen killed in the war. He became part of what he called “the cherished memory of the loved and lost,” all those who had died that “this nation, under God, shall have a new birth of freedom.”",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Biography",
    "Civil War",
    "American History",
    "Classics"
  ],
  "author": "Abraham Lincoln",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/753796.Speeches_and_Writings_1859_1865"
}