{
  "title": "The Last Crusader: A Novel about Don Juan of Austria",
  "description": "Don Juan of Austria, one of history’s most triumphant and inspiring heroes, is reborn in this opulent novel by Louis de Wohl. Because of the circumstances of his birth, this last son of Emperor Charles the Fifth spent his childhood in a Spanish peasant’s hut. Acknowledged by King Philip as his half-brother, the attractive youth quickly became a central figure in a Court where intrigues and romances abounded. Don Juan’s intelligence, kindness and devout attachment to the Church enabled him to live unscathed in an environment of luxury, violence and treachery. De Wohl paints in brilliant color the vivid scenes and characters at the Court of King Philip, Juan’s campaign against rebel Moriscos in Andalusia, and the amazing climatic victory at Lepanto where he saved the Christian world from Islamic dominance. Here is a novel of high adventure which brings to life the turbulence of the sixteenth century with its conflicts of wickedness and piety, its sins of pride and conquest, its seething heresies and its great faith. “Written with zest and excitement; the battle scenes are excellent.” – Los Angeles Times “A novel of heroic proportions . . . richly rewarding.” – Christian Herald “Color . . . action . . .romance, splendor and intrigue reaches a flaming climax.” – Chicago Tribune “A page-turning thriller. Exhilarating!” — Joseph Pearce, Author, The Quest for Shakespeare “In his epic poem, Lepanto, Chesterton called Don Juan the ‘the last knight of Europe.’ This thrilling tale is about things that really happened!” — Dale Ahlquist, Editor, Lepanto – The Annotated Edition “De Wohl novels are always mentioned by my radio audience as among their favorite reads.” — Al Kresta, Host, Kresta in the Afternoon Louis de Wohl was a highly acclaimed novelist who wrote numerous best selli",
  "genres": [
    "Historical Fiction",
    "Catholic",
    "Fiction",
    "Religion",
    "Spirituality",
    "Adventure",
    "Historical"
  ],
  "author": "Louis de Wohl",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/7539811-the-last-crusader"
}