{
  "title": "Winning the Future: A 21st Century Contract with America",
  "description": "According to former House Speaker Newt Gingrich, America currently faces five threats that could undermine, if not eliminate, the United States if immediate steps are not taken to correct them. The threats as he sees them are Islamic terrorists and rogue dictatorships armed with nuclear or biological weapons; the removal of God from American public life; a loss of patriotism and sense of America's history; a decline in economic supremacy because of poor science and math education; and the increasing budgetary burden of Social Security and Medicare. To tackle these problems, Gingrich offers his \"21st Century Contract with America,\" which he outlines in great detail in this bold and thought-provoking book. His updated contract, which comes a decade after the original Republican Contract with America that marked the high point of Gingrich's national power, calls for a dramatically simplified tax code that favors savings and investment; government investment in science and technology, particularly regarding space, energy, and the environment; transforming Social Security into personal savings accounts; overhauling the civil justice system to reduce the burden of lawsuits; and updating the federal government, including the privatization of some functions, so that it moves at the speed and effectiveness of the information age. And that's just the beginning. He also calls for tripling the size of America's intelligence community, reforming its election system, developing a more intelligent health care system that creates jobs and increases quality of life, and balancing the federal budget.Gingrich believes that this ambitious agenda can be accomplished, but only if it receives grassroots support. The entrenched political system, with its lobbyists, bloated bureaucracies, and the complicity of the media, is too self-serving to fix itself, he stresses. Concise and clearly presented, Winning the Future is long on specifics and short on rhetoric, and it succeeds as a springboard for political discourse. Gingrich's aim is clearly to inspire citizens to take responsibility for the county's direction by demanding more of their government and their leaders.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Political Science"
  ],
  "author": "Newt Gingrich",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/7539.Winning_the_Future"
}