{
  "title": "Murder at Waldenmere Lake",
  "description": "A murder shocks the small town of Walden. And it’s only the beginning…Walden, 1921. Local reporter Iris Woodmore is determined to save her beloved lake, Waldenmere, from destruction.After a bloody and expensive war, the British Army can no longer afford to keep the lake – and a deadly battle for ownership begins.Sir Henry Ballard of London and South Western Railway has the deepest pockets and plans to build a lakeside hotel where General Cheverton’s historic mansion stands.When the popular General is found murdered in his home, the town of Walden is in turmoil. Little do the townsfolk know that far worse is to come.A desperate Iris tries to take on the might of the railway company and find the killer. But it appears someone will stop at nothing to win the fight for Waldenmere…An addictive cosy murder mystery with everyone's favourite amateur sleuth. Ideal for fans of Jacqueline Winspear, Claire Gradidge, Verity Bright, Emily Organ and Helena Dixon.Readers are enjoying Murder at Waldenmere Lake‘A cracking addition to the series … superbly written… lots of drama, intrigue, twists and turns’ Gingerbookgeek‘WOW!! Another fantastic addition to my favorite historical series by Michelle Salter… So many unexpected developments, twists, shocking revelations, my god!!’ thebookdecoder‘I have fallen head over heels for this series’ Booksbybindu‘A terrific historical cozy mystery that will keep readers gripped …With plenty of tension, intrigue and suspense, Murder at Waldenmere Lake is an addictive historical cozy mystery … perfect for Anne Perry and Verity Bright fans’ bookishjottings‘A real page turner and couldn't put it down. So much so that I stayed up until the early hours to find out what happened! Reader Review‘What a great book! I loved the characters and the ever deepening plot’ Reader Review‘An incredibly well-written historical mystery … interspersed with fascinating tit-bits of information both about the suffragettes and their sister organisation, the suffrage societies’ Reader Review‘Starts well and then gets better! ’ Reader Review‘I recommend this book to anyone who loves a twisty plot line that keeps you guessing’ Reader Review‘As soon as I started reading, I knew that I was reading something special … Iris Woodmore … is such a fun, feisty and determined young lady’ Reader Review‘Excellent read … Brilliant storyline' Reader Review‘The writer's attention to detail and historical fact was very good … The characters are well drawn and believable’ Reader Review‘The characters are brilliantly written and swept me along’ Reader ReviewPraise for the Iris Woodmore Mysteries:'The mystery itself is intriguing, with plenty of twists and unexpected developments. If you enjoy 1920s mysteries and learning about the suffragettes and all they stood for, then I highly recommend Death at Crookham Hall.' Verity Bright, author of The Lady Eleanor Swift Mysteries'A fabulous, well-written, mystery that holds all the promise of much more to come... The Iris Woodmore mysteries are fast becoming some of my favourites.' M J Porter, author of King of Kings'A joy to read! Such a well-researched mystery. I absolutely loved the unconventional heroine, 1920s setting, engaging characterisation and poignant ending, all of which provide a captivating start to the Iris Woodmore cosy mystery series.' Anita Davison, author of the Flora Maguire Mysteries‘Death at Crookham Hall is a lovely, murder mystery by a gifted writer.’ Helena Dixon, author of The Miss Underhay Mysteries",
  "genres": [
    "Mystery",
    "Historical",
    "Historical Fiction",
    "Crime",
    "Cozy Mystery",
    "Cozy",
    "Romance"
  ],
  "author": "Michelle Salter",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/75377066-murder-at-waldenmere-lake"
}