{
  "title": "They'd Rather Be Right",
  "description": "Bossy was right. Always. Invariably. She was limited only in that she had to have facts -- not assumptions -- with which to work. Given those facts, her conclusions and predictions were inevitably correct. And that made Bossy a 'ticking bomb.'Bossy had been designed as a servomechanism for guiding airplanes. But she became something much greater: a hypercomputer. Soon the men who worked with Bossy found themselves able to solve their problems, to erase their prejudices - in short, to think.Did the world welcome Bossy with open arms and glad cries? No, because for four decades the world had been in the grip of opinion control, and Bossy represented a serious threat to that dominance. So Bossy had to go underground, and work in hiding. Which was why Joe Carter, the worlds only true telepath, and two brilliant Professors had to assume the role of Skid Row bums. All this is only the beginning of one of the most thoughtfully written, and thought provoking, science fiction novels ever written. It shows convincingly and compellingly, what would happen if everyone in the world were given a single blunt command: Think or die.Only a small handful of people are mature enough to realize that they don’t know all the answers. And it was only to this handful that Bossy offered the greatest gift of all: immortality. But all people wanted immortality, wanted it with a fixed and burning desire. And gradually the tension increased, the mobs grew restless, the military became more demanding—and the 'bomb' ticked swiftly on. And it was up to Joe Carter to stave off catastrophe. THE FOREVER MACHINE is full of excitement, both physical and mental. It is full, too, of rich rewards for the reader who appreciates genuinely mature philosophy tinged with gentle irony. And among other things, it is that rare event: a science fiction novel based on a brand-new idea.Cover art by Wallace Wood.",
  "genres": [
    "Science Fiction",
    "Hugo Awards",
    "Fiction",
    "Speculative Fiction",
    "Science Fiction Fantasy",
    "Classics",
    "Novels"
  ],
  "author": "Mark Clifton",
  "average_rating": "3.02",
  "url": "https://www.goodreads.com/book/show/754001.They_d_Rather_Be_Right"
}