{
  "title": "Publica Gratuit si Vinde-ti Singur Cartea",
  "description": "Editia a II-a, actualizata si imbunatatita a cartii \"Publica Gratuit si Vinde-ti Singur Cartea\". Daca ai citit prima editie, este superfluu sa o citesti si pe aceasta. Citeste, mai degraba, celelalte carti de auto-ajutor si pentru dezvoltare personala unde motivatia si gandirea pozitiva sunt la ele acasa: Motivatie, Indrumari si Afirmatii Pozitive pentru Artisti & Creatori Afirmatii Pozitive – Gandire Noua – Puterea Subconstientului Ce Esti Azi, ai Decis Ieri Iti place sa scrii si visul tau este sa incanti cititorii cu povestile tale, dar nu stii de unde sa incepi. Ori poate nu crezi ca ai dreptul sa scrii ori sa publici. Am fost in locul tau odata. Drag visator, eu te asigur ca poti si trebuie sa scrii si sa publici, daca asta vrei. Publica GRATUIT singur – adica pe contul tau –, si vinde-ti singur operele. Publica de acasa, la orice ora din zi si din noapte fara bani. Poti si ai dreptul sa scrii si sa publici!  Nu conteaza ce educatie ai, unde te-ai nascut si traiesti, daca esti barbat sau femeie. Eu cred ca oricine poate scrie, daca asta vrea sa faca. O carte motivationala de auto-ajutor, pentru dezvoltare personala si cresterea emotionala a scriitorilor si poetilor care doresc sa-si ia destinul in propriile maini. Paginile sunt pline de imbolduri, inspiratie, sugestii utile si practice.Orice romantic care nu crede in capacitatile sale si drepturile sale, va gasi curajul sa lupte pentru visurile sale.Ce esti azi, ai decis ieri. Tu ai un potential ilimitat! Daca tu nu ai interes sa ajungi scriitor, ofera cartea cadou unei persoane dragi. Lucrul acesta va demonstra sprijinul si incurajarea ta. Cel mai pretios cadou pentru orice visator care iubeste literele. ****Multumiri speciale cititorilor care au recenzat asa de generos prima editie si celor care mi-au scris personal, ca sa-mi multumeasca pentru ajutorul dat. A fost placerea mea absoluta sa motivez si sa incurajez pe fiecare creator cu visuri marete si suflet sensibil.Eu cred in cei determinati!",
  "genres": [],
  "author": "Cristina Gherghel",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/75426564-publica-gratuit-si-vinde-ti-singur-cartea"
}