{
  "title": "Female Masculinity",
  "description": "Masculinity without men. In Female Masculinity Jack Halberstam takes aim at the protected status of male masculinity and shows that female masculinity has offered a distinct alternative to it for well over two hundred years. Providing the first full-length study on this subject, Halberstam catalogs the diversity of gender expressions among masculine women from nineteenth-century pre-lesbian practices to contemporary drag king performances.Through detailed textual readings as well as empirical research, Halberstam uncovers a hidden history of female masculinities while arguing for a more nuanced understanding of gender categories that would incorporate rather than pathologize them. He rereads Anne Lister's diaries and Radclyffe Hall's The Well of Loneliness as foundational assertions of female masculine identity. He considers the enigma of the stone butch and the politics surrounding butch/femme roles within lesbian communities. He also explores issues of transsexuality among \"transgender dykes\"---lesbians who pass as men---and female-to-male transsexuals who may find the label of \"lesbian\" a temporary refuge. Halberstam also tackles such topics as women and boxing, butches in Hollywood and independent cinema, and the phenomenon of male impersonators.Female Masculinity signals a new understanding of masculine behaviors and identities, and a new direction in interdisciplinary queer scholarship. Illustrated with nearly forty photographs, including portraits, film stills, and drag king performance shots, this book provides an extensive record of the wide range of female masculinities. And as Halberstam clearly demonstrates, female masculinity is not some bad imitation of virility, but a lively and dramatic staging of hybrid and minority genders.",
  "genres": [
    "Queer",
    "Nonfiction",
    "Feminism",
    "Gender",
    "LGBT",
    "Theory",
    "Gender Studies"
  ],
  "author": "J. Jack Halberstam",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/75407.Female_Masculinity"
}