{
  "title": "Fires Of Ballian",
  "description": "The Draegan Lords, Book 3A hundred years ago, the high sorcerer of Velensperia launched a swift and deadly attack against the draegans—a race of dragon shapeshifters who’d always lived in harmony with the humans. The draegans were all but destroyed, with the few who remained, scattered and in hiding. But after a century of cruel repression, a group of them have united and begun to fight back. Their leader, Keiran Hareldson, is determined to free his people from the high sorcerer’s tyranny. For years he hid the secret of his heritage, knowing the truth would make him and those around him a target of the sorcerer’s wrath. But the time has come to fight the sorcerer in the open, and once the news spreads that Keiran is the sole surviving draegan lord, draegans and humans alike begin to flock to the draegan camp for protection.Gaige Rizik used to be the captain of the sorcerer’s High Guard. His last assignment was to infiltrate the draegan rebel’s camp, identify the leader, and eliminate him. No one, least of all him, expected him to fall in love with the very man he’d sworn to kill. Gaige defects to the draegans’ side, and he and Keiran bind themselves to one another not only by love, but by blood when they go through the true mate ritual. With their blood merged, it allows Gaige to inherit the powerful magick of the draegan lords. But inheriting it and using it are two different things. Gaige has trouble tapping into the magick because he feels unworthy of the gift. Only half-draegan, he fears his human side and his past as the high sorcerer’s right hand will forever tarnish his future as Keiran’s mate and second in command.When Keiran is stolen by an ancient demon from the shadow world, Gaige is left with the fate of the draegan people in his hands. They turn to him as their new lord, and he’s torn between his duty to them, and his desperate need to find his mate. Through shadow and torment, fire and darkness, Gaige and Keiran struggle to hold back the tide of the sorcerer’s ever-expanding war and stop the new and even deadlier evil that threatens their lands. In their darkest hour, only their fierce love for one another, and Gaige’s acceptance of his power, stand between them and the destruction of all they know.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Shapeshifters",
    "Dragons",
    "Romance",
    "Paranormal",
    "Magic"
  ],
  "author": "M.L. Rhodes",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/7543927-fires-of-ballian"
}