{
  "title": "Motivatie pentru Artisti & Creatori – Gandire Pozitiva",
  "description": "Ai un vis maret si muncesti de ani de zile sa ti-l indeplinesti, facand un sacrificiu dupa altul, compromisuri fara numar, insa succesul ajunge la cei care nu merita. Peste noapte.Deja te indoiai de tine, acum te indoiesti de operele si de lucrarile tale. Flamand si infrigurat, incerci inca o data, pentru ultima data.Cei dragi nu cred in reusita ta.Apropiatii te descurajeaza.Critica te tranteste si te tine la pamant...Si-ntr-o zi, ranit de moarte, renunti la visurile de succes si stabilitate financiara, ca nu este dreptate pe lumea asta si nu e scris in cartea vietii tale sa stii ce-i implinirea.Sa-ti urmezi visurile este dificil si te inteleg mai bine decat crezi. E complicat sa te indepartezi de oameni care te descurajeaza, sa fugi de situatii si atmosfere toxice.E dificil sa devii actor, scriitor, cantaret de succes, dansator, comediant, sculptor, pictor de succes cand atatia altii fac exact ceea ce faci si tu.E greu, foarte greu sa fii arteficele destinului tau, dar nu imposibil. Daca succesul ar fi usor de atins, cine ar sti cum se simte izbanda?Capul sus, trage aer in piept si ia-o de la capat!Artist si creator, ramai pe baricade, apara-ti visul si munca, caci numai tu poti sa faci ceea ce faci in modul in care il faci.Doar cei care renunta, nu-si indeplinesc visurile.Eu cred in tine! Cred ca daca cineva a putut sa ajunga un om de succes in ciuda tuturor vicisitudinilor, si tu ai aceasta putere.Aceasta carte pentru dezvoltare personala, plina de motivatie pentru succes si reusite, a fost scrisa din pretuire pentru artistii si creatorii care se indoiesc de capacitatile si munca lor. Ce gasesti in cartea asta de auto-ajutor si pentru dezvoltare personala?Motivatie instrinseca – ai inteles deja, o spune si titlul InspiratieIncurajariAfirmatii pozitive cu vibratii inalteIndrumari, sugestii si resurse utile  Notiuni despre Gandirea Noua  Vibratiile Universului si Legea atractieiVizualizare creativa si manifestarePuterea mintii si a inimiiPuterea subconstientului si multe, multe alteleTot ce ai nevoie este in mainile tale. La indemana ta. Ce este succesul pentru tine?Ce esti dispus sa faci ca sa-l atingi?Cand vrei sa incepi?Acum este momentul!Eu cred in tine.Cred in puterile tale.Cred ca ce ai nevoie este deja in mainile tale.Tu stii cum sa scrii un destin nou in cartea vietii tale.Puterea de a fauri viitorul pe care ti-l doresti este in tine.Ia ce iti apartine.Tu poti! Tu meriti!",
  "genres": [],
  "author": "Cristina Gherghel",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/75426442-motivatie-pentru-artisti-creatori-gandire-pozitiva"
}