{
  "title": "The Trouble with Trying to Love a Hellion",
  "description": "Edovard:Um…I was told I’m supposed to summarize my story here, but recently I’ve learned that blurbs are hard so I’m not sure what to say.My name is Edovard Durand Folange. I’m twenty seven years old from Fresno, California, and recently I moved across the country to live with my new parents and brother. Oppa kills people for a living, and Papa is his announcer guy, and my brother is like his assistant, and I guess it turns out I’m the person the magic tells who needs to die—it’s called being an Augur. I don’t really know what that word means, but even though it’s scary, I’m getting used to it.It’s nice to have a job, but Santanos (he’s the Avatar of Evil) offered me a second job, and I’m really excited about that because I get to work with him and help him fix the minions. A lot of them aren’t doing very well, so my second job is to make sure that everyone gets as much love as they need in their lives. Sometimes that means killing people who are stealing all the love away from them. I guess maybe I’m a little evil too, because I don’t mind letting Oppa kill those people to save the minions.The Trouble with Trying to Love a Hellion is a 50k MM+ paranormal romance, featuring a cinnamon roll narrator with more than the usual amount of love to give and a sultry incubus who happens to be the Avatar of Evil. If the minions are especially affectionate with the cinnabun, well, who can blame them when he’s the best cuddler they’ve ever met?Contents include: blood, viscera, someone dies because they call Edovard dumb, and Edovard accidentally creates a polycule, but that’s ok because he’s just making sure everyone gets enough love to be emotionally healthy.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Magic",
    "Demons",
    "Urban Fantasy"
  ],
  "author": "Jennifer Cody",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/75424220-the-trouble-with-trying-to-love-a-hellion"
}