{
  "title": "Firecracker",
  "description": "Isaac Lang is deeply in love with his live-in life-partner, Baltimore City police officer Jeff Clark, and has a serious kink for risky role-play sex with strangers. Jeff finds Isaac's wild ways incredibly hot, and he's more than willing to help facilitate Isaac's lustful cravings. Jeff trusts Isaac to be emotionally faithful despite the sexual experimentation, and Isaac trusts Jeff to watch his back and keep him safe from harm. Not a lifestyle everyone might aspire to or could successfully manage, but Isaac and Jeff make their quest for kink work to keep the sparks flying in their relationship. Excerpt: Isaac sniffed, gave his head a subtle shake and moved on. The second guy didn't trip Isaac's trigger any more than the first guy did. A little taller, a little leaner, and by the sour smell of bourbon wafting off the guy's breath, a little drunker than Isaac wanted to deal with. He took another pass. Bachelor number three-and that described how Isaac felt by now, as if this were some sort of tawdry, dirty, back-alley version of \"The Dating Game\"-smelled worse than the dumpster across the street. He waved the guy off with a dismissive hand. The fourth guy appeared passable enough. Nothing particularly gruesome, but not prime real estate either. Guy five-short blond hair, brown eyes, a pretty kind of healthy skinny-might have garnered Isaac's attention had the dude looked him in the face. Moot point, anyway. By the time Isaac progressed that far down the line and his eyes adjusted to the dim light, he'd already decided on the guy standing on the rightmost end of the row. \"Oh, yeah.\"  About an inch taller than Isaac's six-feet-two, whipcord lean, with chin-length black hair shiny enough to reflect the waning moon. Isaac zeroed in on him. The crunch of gravel underfoot behind Isaac announced new arrivals, but he didn't bother turning around. In his peripheral vision, Isaac saw two of the men leaning against the wall depart to be immediately replaced by two newcomers. Two more of the original men now had other men kneeling in the gravel before them. The remaining man from the original group-the blond standing next to Isaac's choice-waited patiently, perhaps still hoping Isaac would drop to his knees in front of him. Isaac quashed any lingering optimism the blond man might've held by moving closer to the guy on the end.  Isaac put his left shoulder to the wall, his back to the rest of the lineup. He ran his gaze, from head to toe and back again, along the black-haired guy's streamlined body. \"Nice,\" Isaac said, loud enough to be heard by the guy and no louder, and then he wet his lips with his tongue. \"Leo,\" the guy said. Isaac snorted a quick laugh. \"That your sign or your name?\" \"Both.\" A hungry smile spread Leo's perfect lips. \"Saves me time.\" \"You in a hurry?\" Leo nodded. Isaac licked his lips again. \"For?\" \"I think you know.\" Leo swept a black leather motorcycle boot back and forth, side to side, over the ground in front of him several times. Chrome buckles on the boot clinked. Gravel crunched and scattered. Leo plucked slim, well-manicured fingers at the tab on Isaac's jacket zipper and tugged downward. \"Nice coat. It'll make a good kneeler. You might be down there for a while, and I wouldn't want you to be uncomfortable.\" A soft snicker puffed the back of Isaac's hair, but he ignored the blond guy behind him. The wet, slurping, sucking sounds a little farther back were less easy to disregard, as were the soft grunts and quiet moans. Isaac's cock responded, swelling in the commando confines of his tight Levi's 501 blues.",
  "genres": [
    "M M Romance",
    "M M M",
    "M M Contemporary",
    "Contemporary",
    "Romance",
    "Gay"
  ],
  "author": "Jaye Valentine",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/7543595-firecracker"
}