{
  "title": "The Wisdom of the Rooms - Volume Three",
  "description": "In this enchanting Third Volume of The Wisdom of the Rooms , Michael Z once again captures the Wisdom found in 12 Steps quotes and sayings heard daily in the rooms of recovery from around the world. These quotes enlighten, entertain and encourage the reader to deepen their understanding and experience of their spiritual journey, and the six reflection questions are wonderful tools for journaling and for use as discussion starters at meetings. Join Michael Z as he guides you through The Wisdom of the Rooms and reveals the Wisdom in us all. Reading this book is like having an intimate chat with a very wise but unassuming friend. I highly recommend it to anyone in recovery and as an appealing treatment resource for pastoral and substance abuse counselors. - Katherine van Wormer, Professor of Social Work, co-author of Addiction A Strengths Perspective In this third volume of The Wisdom of the Rooms , Michael Z continues to make an important contribution to the recovery literature. This book is a wonderful tool for both the newcomer and the old timer - Stephanie S. Covington, Ph.D., author of A Woman's Way through the Twelve Steps The Wisdom of the Rooms is perfect for reading a snippet at a time and is highlyrecommended. - Doug Thorburn, EA, CFP, Alcoholism Researcher, author of Alcoholism Myths and Realities Michael Z has once again captured some of the greatest bits of homegrown Wisdom and packaged them into his latest volume, ready to read, re-read and share with those you care about. - Joe Herzanek, author of Why Don't They Just Quit? What families and friends need to know about addiction and recovery It's like having the wisdom of the old timers in the palm of your hand - Jeff Jay, coauthor of Love First and At Wit's End About Michael Michael Z, M.A., lives and writes in Los Angeles, CA. As a spiritual counselor and life skills coach, he uses the 12 Steps as a guide for spiritual, emotional and physical recovery. He shares his experience, strength and hope in meetings around the world and conducts workshops and retreats on the 12 Step journey.",
  "genres": [],
  "author": "Michael Z.",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/7540431-the-wisdom-of-the-rooms---volume-three"
}