{
  "title": "Stay Sane in an Insane World: How to Control the Controllables and Thrive",
  "description": "“What I learned from Greg is still a part of who I am today.”—Tom Brady, 7-time Super Bowl championGreg Harden changes lives.This is why hundreds of world-class athletes, doctors, lawyers, teachers, business leaders, college students, and professionals from all walks of life have come to him for advice and direction—including 7-time Super Bowl Champion Tom Brady, 23-time Olympic Gold Medalist Michael Phelps, Heisman Trophy winners Desmond Howard and Charles Woodson, CEOs of major companies, and championship coaching staffs from all over the world.Harden teaches his students how to practice, train, and rehearse to give 100 percent, 100 percent of the time, and challenges them by If you don’t believe in yourself, why should I believe in you?Champions aren’t born. They’re built. Greg Harden spent over 30 years building them at the University of Michigan, including 400 future professional athletes, 50 NFL first-round draft picks, and 120 Olympians from over 20 countries. He gained national recognition when 60 Minutes Sports profiled him as “Michigan’s Secret Weapon.”Now, in his first book, Greg Harden is reaching out to help\n \nanyone who wants to live their best life by offering powerful and practical advice.You will learn Stop being afraid of being  Fear and self-doubt are the enemy. As soon as you learn that fear and self-doubt are predictable, they become manageable. Control the How you control your own emotions, reactions, and responses to circumstances is what you must master first. You are the only one who has control over your mind. Stop letting others determine the way you feel about yourself. Commit, improve, and Learn to build better habits. Making small improvements every day is the secret to a completely transformed life. Become the world’s greatest expert on It’s the only way to become the very best version of yourself. Practice self-love and These are the keys to eliminating and replacing self-defeating attitudes and behaviors. This is a one-of-a-kind book that will give you the indispensable lessons and tools necessary to create real change in your life.PLEASE When you purchase this title, the accompanying PDF will be available in your Audible Library along with the audio.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Audiobook",
    "Personal Development",
    "Psychology",
    "Leadership",
    "Sports"
  ],
  "author": "Greg Harden",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/75405998-stay-sane-in-an-insane-world"
}