{
  "title": "The Book of Daniel",
  "description": "The central figure of this novel is a young man whose parents were executed for conspiring to steal atomic secrets for Russia.His name is Daniel Isaacson, and as the story opens, his parents have been dead for many years. He has had a long time to adjust to their deaths. He has not adjusted.Out of the shambles of his childhood, he has constructed a new life—marriage to an adoring girl who gives him a son of his own, and a career in scholarship. It is a life that enrages him.In the silence of the library at Columbia University, where he is supposedly writing a Ph.D. dissertation, Daniel composes something quite different.It is a confession of his most intimate relationships—with his wife, his foster parents, and his kid sister Susan, whose own radicalism so reproaches him.It is a book of riding a bus with his parents to the ill-fated Paul Robeson concert in Peekskill; watching the FBI take his father away; appearing with Susan at rallies protesting their parents’ innocence; visiting his mother and father in the Death House.It is a book of transcribing Daniel’s interviews with people who knew his parents, or who knew about them; and logging his strange researches and discoveries in the library stacks.It is a book of judgments of everyone involved in the case—lawyers, police, informers, friends, and the Isaacson family itself.It is a book rich in characters, from elderly grand- mothers of immigrant culture, to covert radicals of the McCarthy era, to hippie marchers on the Pen-tagon. It is a book that spans the quarter-century of American life since World War II. It is a book about the nature of Left politics in this country—its sacrificial rites, its peculiar cruelties, its humility, its bitterness. It is a book about some of the beautiful and terrible feelings of childhood. It is about the nature of guilt and innocence, and about the relations of people to nations.It is The Book of Daniel .",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Novels",
    "Classics",
    "Literature",
    "American",
    "Literary Fiction"
  ],
  "author": "E.L. Doctorow",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/7541685-the-book-of-daniel"
}