{
  "title": "One Little Secret",
  "description": "Ashton WestbrookPlaying house with a secret-keeping heiress was not how I envisioned helping when my brothers called me. My expertise is the dirty work, not glorified babysitting. Now Nova Blaine is here in this tiny town. Invading my home, my thoughts, and turning my carefully controlled existence upside down.I’m tasked with finding her assailant, an assignment that requires me to stay close. Something I’ve gotten good at avoiding at all costs. I keep even my family at arm’s length. It’s safer that way. But there’s something about her that makes me feel protective, that makes me want to get closer.I’m her protector, but sharing my home means sharing my life with her. And this princess is starting to see what’s beyond my beastly façade. I know there’s nothing left worth finding beneath my scars and secrets, but she’s determined to open all those old wounds.There are reasons I’ve retreated from everything I once loved. But I’ll face those demons again if it means protecting her. In the end, will I remain captive or will she be the one to finally set me free?Nova BlaineI’m not a princess to be locked away in a tower. Until I am. And when Ashton Westbrook turns that gravelly, deep voice my way, calling me Princess? I know I’ll scale his walls and enjoy the climb.He’s my protector, but I see the anguish beneath his beastly façade.He may keep me safe, but I will set him free.Secrets whispered in the dead of night lead to truths they can’t deny. Can either of them escape their past to live in the present and have a hope for the future? Or are some secrets meant to burn out with their keeper?Find out now in this small-town billionaire protector romance, One Little Secret.He’s a billionaire protector hiding secrets of the past. She’s an heiress protecting secrets that will destroy her future. Forced together in small-town chaos, their truth sparks flames. Trusting in love could set them free or burn them to the ground.",
  "genres": [
    "Romance",
    "Forced Proximity",
    "Contemporary Romance",
    "Small Town Romance",
    "Suspense",
    "Contemporary",
    "M F Romance"
  ],
  "author": "Avery Maxwell",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/75406191-one-little-secret"
}