{
  "title": "October 1964",
  "description": "THE NEW YORK TIMES BESTSELLER * THE BEST SPORTS BOOK OF THE YEAROctober 1964 should be a hit with old-time baseball fans, who'll relish the opportunity to relive that year's to-die-for World Series, when the dynastic but aging New York Yankees squared off against the upstart St. Louis Cardinals. It should be a hit with younger students of the game, who'll eat up the vivid portrayals of legends like Mickey Mantle and Roger Maris of the Yankees and Bob Gibson and Lou Brock of the Cardinals. Most of all, however, David Halberstam's new book should be a hit with anyone interested in understanding the important interplay between sports and society.--The Boston GlobeCompelling...1964 is a chronicle of the end of a great dynasty and of a game, like the country, on the cusp of enormous change.--NewsweekHalberstam's latest gives us the feeling of actually being there--in another time, in the locker rooms and in the minds of baseball legends. His time and effort researching the book result in a fluency with his topic and a fluidity of writing that make the reading almost effortless....Absorbing.--San Francisco ChronicleWonderful...Memorable...Halberstam describes the final game of the 1964 series accurately and so dramatically, I almost thought I had forgotten the ending.--The Washington Post Book WorldSuperb reporting...Incisive analysis...You know from the start that Halberstam is going to focus on a large human canvas...One of the many joys of this book is the humanity with which Halberstam explores the characters as well as the talents of the players, coaches and managers. These are not demigods of summer but flawed, believable human beings who on occasion can rise to peaks of heroism.--Chicago Sun-Times",
  "genres": [
    "Baseball",
    "Sports",
    "Nonfiction",
    "History",
    "American History",
    "New York",
    "Audiobook"
  ],
  "author": "David Halberstam",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/75418.October_1964"
}