{
  "title": "The Lost Mother of Ireland",
  "description": "A completely gripping and unforgettable story of long-lost family secrets and forbidden romance that will whisk you away to the beautiful village of Sandy Cove on the west coast of Ireland.When Laura inherits a small cottage from a friend who was like a mother to her, she wonders whether this could be the new beginning she’s been searching for. Although she’s never been to the village of Sandy Cove on the west coast of Ireland, her friend described it as on the edge of the sparkling blue sea, with sandy white beaches. Could this be the fresh start she needs to ease her heartache?During her first walk on the beach, Laura meets Gino, a handsome local who instantly charms her with his sparkling eyes and gorgeous smile. Laura finds herself attracted to him as he tells her about his life and his love for Sandy Cove. And, as they spend more time together, the pair begin to grow closer.But just as Laura begins to settle into village life, her friend’s son disputes his mother’s will. But what he doesn’t know is that Laura hasn’t just inherited the cottage from her, she’s also been given a very valuable heirloom – one that tells the story of a forbidden love, a long-forgotten family secret and a bond between a mother and daughter that could not be broken…Just as Laura begins to solve the mystery behind the painting, everything she thought she knew about Gino changes in a heartbeat when she discovers that he might have already given his heart away to someone else. Is their love story over before it ever truly began?And when Laura uncovers the truth behind her inheritance, she is left wondering whether the family secret should have remained forgotten. When the dust settles from her discovery, will she be able to rebuild her life in Sandy Cove with the one man she truly loves?Fans of Sheila O’Flanagan, Mary Alice Monroe and Debbie Macomber will fall in love with this gripping, heart-warming and utterly charming Irish romance.",
  "genres": [
    "Romance",
    "Fiction",
    "Mystery",
    "Irish Literature"
  ],
  "author": "Susanne O'Leary",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/75471608-the-lost-mother-of-ireland"
}