{
  "title": "Big Girls Don't Cry: The Election That Changed Everything for American Women",
  "description": "REBECCA TRAISTER, whose coverage of the 2008 presidential election for Salon confirmed her to be a gifted cultural observer, offers a startling appraisal of what the campaign meant for all of us. Though the election didn’t give us our first woman president or vice president, the exhilarating campaign was nonetheless transformative for American women and for the nation. In Big Girls Don’t Cry, her electrifying, incisive and highly entertaining first book, Traister tells a terrific story and makes sense of a moment in American history that changed the country’s narrative in ways that no one anticipated.It was all as unpredictable as it was riveting: Hillary Clinton’s improbable rise, her fall and her insistence (to the consternation of her party and the media) on pushing forward straight through to her remarkable phoenix flight from the race; Sarah Palin’s attempt not only to fill the void left by Clinton, but to alter the very definition of feminism and claim some version of it for conservatives; liberal rapture over Barack Obama and the historic election of our first African-American president; the media microscope trained on Michelle Obama, harsher even than the one Hillary had endured fifteen years earlier. Meanwhile, media women like Katie Couric and Rachel Maddow altered the course of the election, and comedians like Tina Fey and Amy Poehler helped make feminism funny. What did all this mean to the millions of people who were glued to their TV sets, and for the country, its history and its future? As Traister sees it, the 2008 election was good for women. The campaign for the presidency reopened some of the most fraught American conversations—about gender, race and generational difference, about sexism on the left and feminism on the right—difficult discussions that had been left unfinished but that are crucial to further perfecting our union. The election was also catalytic, shaping the perspectives of American women and men from different generations and backgrounds, altering the way that all of us will approach questions of women and power far into the future. When Clinton cried, when Palin reached for her newborn at the end of a vice presidential debate, when Couric asked a series of campaign-ending questions, the whole country was watching women’s history—American history—being made. Throughout, Traister weaves in her own experience as a thirtysomething feminist sorting through all the events and media coverage—vacillating between Clinton and Obama and forced to face tough questions about her own feminism, the women’s movement, race and the different generational perspectives of women working toward political parity some ninety years after their sex was first enfranchised. It was a time of enormous change, and there is no better guide through that explosive, infuriating, heartbreaking and sometimes hilarious year than Rebecca Traister. Big Girls Don’t Cry offers an enduring portrait of dramatic cultural and political shifts brought about by this most historic of American contests.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Politics",
    "History",
    "Audiobook",
    "Womens",
    "Book Club"
  ],
  "author": "Rebecca Traister",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/7545147-big-girls-don-t-cry"
}