{
  "title": "Eldvittnet",
  "description": "I hela världen tar polisen hjälp av andliga medier vid svåra utredningar. De gör det regelbundet trots att det inte finns något enda dokumenterat fall där ett medium bidragit till en lösning.Flora Hansen kallar sig för spiritistiskt medium och har i många år försörjt sig på att låtsas att hon kan tala med de döda. En kväll i augusti läser hon på löpsedlarna om ett fruktansvärt mord som skett på en sluten anstalt för unga kvinnor med destruktivt beteende. Flora Hansen bestämmer sig för att ringa polisen och hävda att hon har kommit i kontakt med den dödas ande.Den tekniska undersökningen pekar entydigt på att mördaren är en av de intagna, en snäll och tystlåten flicka som rymde från anstalten samma natt som mordet skedde. När Joona Linna börjar undersöka hennes förflutna visar det sig att hon inte alltid varit så snäll.Joona har redan stannat längre på denna brottsplats än vad någon annan kommissarie skulle göra. Ändå är han inte färdig, han tänker att han måste se ytterligare någonting för att bli utsläppt från detta fruktansvärda rum, han måste hitta en detalj som kan leda vidare, som kan föra tråden som en nål.Han ser på flickan i sängen. En svag värme utstrålar fortfarande från den nakna huden. Hennes händer ligger över ansiktet, som om hon lekte kurragömma. Han lutar sig försiktigt över henne och upptäcker att någonting har fastnat under hennes vänstra pekfingernagel. Det ser ut som ett djuprött sandkorn, en flisa av en rubin.Han blinkar och försöker skärpa blicken. Det är svårt att koncentrera sig på detta lilla röda korn i ett rum nerstänkt av blod, men han ger sig inte, han lutar sig bara närmare, känner den söta doften från henne och förstår plötsligt vad det är han ser under nageln.Jakten på förövaren tar gång på gång våldsamma och oväntade vändingar. Varje svar tycks bara leda till nya gåtor, och det som nyss var enkelt är plötsligt labyrintiskt.Men trots att utredningen hamnar i en återvändsgränd ignorerar polisen Flora Hansens telefonsamtal. Först begär hon pengar för sina upplysningar, men sedan ber hon dem bara att lyssna, allt mer desperat.",
  "genres": [
    "Thriller",
    "Crime",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Scandinavian Literature"
  ],
  "author": "Lars Kepler",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/13057652-eldvittnet"
}