{
  "title": "Robin",
  "description": "The close descendant of Irish and Welsh Australians and the fourth of a family of five, Mary Grant Bruce, born in Gippsland, Victoria as Minnie Grant Bruce, was the daughter of Eyre Lewis Bruce and Mary (Minnie) Atkinson Whittakers. After being educated at Miss Estelle Beausire's Ladies High School, Bruce worked as a secretary before establishing a career as a journalist, poet and writer for Australian magazines. In 1903 she helped form the Writer's Club, which later was submerged into the Lyceum Club. A Little Bush Maid, her first major success, was originally published as a serial in the children's page of the Leader. Its success enabled her to work as a full-time writer and journalist, and spawned the Billabong series. In 1913 Bruce visited London, where she met and became engaged to her distant cousin and fellow writer Major George Evans Bruce. She returned to Australia, where they were married and had two sons, Jonathan and Patrick, and a daughter, Mary, who died shortly after birth. On the outbreak of World War I she stayed in County Cork, Ireland for the duration of the war, while her husband served. Her 1916 novel Jim and Wally contains one of the first accounts of Australian soldiers facing gas attacks on the Western Front. Once peace was declared, they returned to Australia, where she briefly acted as the editor of Women's World. From 1927 to 1939, and following the death of her younger son in a shooting accident, Bruce, her husband and their surviving child, Jonathan, travelled in Europe, before returning yet again to Australia. During World War II, Bruce worked for the Australian Imperial Force Women's Association. Following her husband's death in 1949, Bruce returned for the last time to England, to spend the rest of her life there. She died in Bexhill and was cremated at Hastings. Maurice Saxby, \"the doyen of critical commentators on Australian Children's Literature\" said that \"what Ethel Turner did for the city family, Mary Grant Bruce did for the bush family.\" An English designer of warplanes, concerned that Australian pilots would be too tall to fit in the cockpits, asked his daughter for the heights of Bruce's characters Jim Linton and Wally Meadows.",
  "genres": [
    "Australia"
  ],
  "author": "Mary Grant Bruce",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/13057627-robin"
}