{
  "title": "When Everything Changed: The Amazing Journey of American Women from 1960 to the Present",
  "description": "Gail Collins, New York Times columnist and bestselling author, recounts the astounding revolution in women's lives over the past 50 years, with her usual \"sly wit and unfussy style\" ( People ).When Everything Changed begins in 1960, when most American women had to get their husbands' permission to apply for a credit card. It ends in 2008 with Hillary Clinton's historic presidential campaign. This was a time of cataclysmic change, when, after four hundred years, expectations about the lives of American women were smashed in just a generation.A comprehensive mix of oral history and Gail Collins's keen research -- covering politics, fashion, popular culture, economics, sex, families, and work -- When Everything Changed is the definitive book on five crucial decades of progress. The enormous strides made since 1960 include the advent of the birth control pill, the end of \"Help Wanted -- Male\" and \"Help Wanted -- Female\" ads, and the lifting of quotas for women in admission to medical and law schools. Gail Collins describes what has happened in every realm of women's lives, partly through the testimonies of both those who made history and those who simply made their way.Picking up where her highly lauded book America's Women left off, When Everything Changed is a dynamic story, told with the down-to-earth, amusing, and agenda-free tone for which this beloved New York Times columnist is known.Older readers, men and women alike, will be startled as they are reminded of what their lives once were -- Father Knows Best and My Little Margie on TV; daily weigh-ins for stewardesses; few female professors; no women in the Boston marathon, in combat zones, or in the police department. Younger readers will see their history in a rich new way. It has been an era packed with drama and dreams -- some dashed and others realized beyond anyone's imagining.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Womens",
    "Book Club",
    "Politics",
    "Gender"
  ],
  "author": "Gail Collins",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/7549467-when-everything-changed"
}