{
  "title": "Eve: How the Female Body Drove 200 Million Years of Human Evolution",
  "description": "THE REAL ORIGIN OF OUR SPECIES: a myth-busting, eye-opening landmark account of how humans evolved, offering a paradigm shift in our thinking about what the female body is, how it came to be, and how this evolution still shapes all our lives today. How did the female body drive 200 million years of human evolution? • Why do women live longer than men? • Why are women more likely to get Alzheimer’s? • Why do girls score better at every academic subject than boys until puberty, when suddenly their scores plummet? • Is sexism useful for evolution? • And why, seriously why, do women have to sweat through our sheets every night when we hit menopause?  These questions are producing some truly exciting science—and in Eve, with boundless curiosity and sharp wit, Cat Bohannon covers the past 200 million years to explain the specific science behind the development of the female sex: \"We need a kind of user's manual for the female mammal. A no-nonsense, hard-hitting, seriously researched (but readable) account of what we are. How female bodies evolved, how they work, what it really means to biologically be a woman. Something that would rewrite the story of womanhood. This book is that story. We have to put the female body in the picture. If we don't, it's not just feminism that's compromised. Modern medicine, neurobiology, paleoanthropology, even evolutionary biology all take a hit when we ignore the fact that half of us have breasts. So it's time we talk about breasts. Breasts, and blood, and fat, and vaginas, and wombs—all of it. How they came to be and how we live with them now, no matter how weird or hilarious the truth is.\"  Eve is not only a sweeping revision of human history, it's an urgent and necessary corrective for a world that has focused primarily on the male body for far too long. Picking up where Sapiens left off, Eve will completely change what you think you know about evolution and why Homo sapiens has become such a successful and dominant species.",
  "genres": [
    "Nonfiction",
    "Science",
    "Feminism",
    "History",
    "Audiobook",
    "Womens",
    "Biology"
  ],
  "author": "Cat Bohannon",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/75494215-eve"
}