{
  "title": "Fear Is Just a Word: A Missing Daughter, a Violent Cartel, and a Mother's Quest for Vengeance",
  "description": "A riveting true story of a mother who fought back against the drug cartels in Mexico, pursuing her own brand of justice to avenge the kidnapping and murder of her daughter— from a global investigative correspondent for The New York Times“Azam Ahmed has written a page-turning mystery but also a stunning, color-saturated portrait of the collapse of formal justice in one Mexican town.”—Steve Coll, Pulitzer Prize–winning author of Directorate SFear Is Just a Word begins on an international bridge between Mexico and the United States, as fifty-six-year-old Miriam Rodríguez stalks one of the men she believes was involved in the murder of her daughter Karen. He is her target number eleven, a member of the drug cartel that has terrorized and controlled what was once Miriam’s quiet hometown of San Fernando, Mexico, almost one hundred miles from the U.S. border. Having dyed her hair red as a disguise, Miriam watches, waits, and then orchestrates the arrest of this man, exacting her own version of justice.Woven into this deeply researched, moving account is the story of how cartels built their power in Mexico, escalated the use of violence, and kidnapped and murdered tens of thousands. Karen was just one of the many people who disappeared, and Miriam, a brilliant, strategic, and fearless woman, begged for help from the authorities and paid ransom money she could not afford in hopes of saving her daughter. When that failed, she decided that “fear is just a word,” and began a crusade to track down Karen’s killers and to help other victimized families in their search for justice.What do people do when their country and the peaceful town where they have grown up become unrecognizable, suddenly places of violence and fear? Azam Ahmed takes us into the grieving of a country and a family to tell the mesmerizing story of a brave and brilliant woman determined to find out what happened to her daughter, and to see that the criminals who murdered her were punished. Fear Is Just a Word is an unforgettable and moving portrait of a woman, a town, and a country, and of what can happen when violent forces leave people to seek justice on their own.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Crime",
    "History",
    "Memoir",
    "Politics",
    "Audiobook"
  ],
  "author": "Azam Ahmed",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/75495003-fear-is-just-a-word"
}