{
  "title": "Into the Bright Open: A Secret Garden Remix",
  "description": "From award-winning and acclaimed author of The Marrow Thieves, Cherie Dimaline, comes an enchanting story of family, healing, and girls reclaiming control of their own lives, part of the Remixed Classics series.Mary Lennox didn’t think about death until the day it knocked politely on her bedroom door and invited itself in. When a terrible accident leaves her orphaned at fifteen, she is sent to the wilderness of the Georgian Bay to live with an uncle she's never met.At first the impassive, calculating girl believes this new manor will be just like the one she left in Toronto: cold, isolating, and anything but cheerful, where staff is treated as staff and never like family. But as she slowly allows her heart to open like the first blooms of spring, Mary comes to find that this strange place and its strange people—most of whom are Indigenous self-named \"halfbreeds\"—may be what she can finally call home.Then one night Mary discovers Olive, her cousin who has been hidden away in an attic room for years due to a \"nervous condition.\" The girls become fast friends, and Mary wonders why this big-hearted girl is being kept out of sight and fed medicine that only makes her feel sicker. When Olive's domineering stepmother returns to the manor, it soon becomes clear that something sinister is going on.With the help of a charming, intoxicatingly vivacious Metis girl named Sophie, Mary begins digging further into family secrets both wonderful and horrifying to figure out how to free Olive. And some of the answers may lie within the walls of a hidden, overgrown and long-forgotten garden the girls stumble upon while wandering the wilds...The Remixed Classics SeriesA Clash of Steel: A Treasure Island Remix by C.B. LeeSo Many Beginnings: A Little Women Remix by Bethany C. MorrowTravelers Along the Way: A Robin Hood Remix by Aminah Mae SafiWhat Souls Are Made Of: A Wuthering Heights Remix by Tasha SuriSelf-Made Boys: A Great Gatsby Remix by Anna-Marie McLemoreMy Dear Henry: A Jekyll & Hyde Remix by Kalynn BayronTeach the Torches to Burn: A Romeo & Juliet Remix by Caleb RoehrigInto the Bright Open: A Secret Garden Remix by Cherie DimalineMost Ardently: A Pride & Prejudice Remix by Gabe Cole Novoa",
  "genres": [
    "Young Adult",
    "Historical Fiction",
    "Retellings",
    "LGBT",
    "Fiction",
    "Historical",
    "Queer"
  ],
  "author": "Cherie Dimaline",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/75488091-into-the-bright-open"
}