{
  "title": "Happiness Falls",
  "description": "When a father goes missing, his family's desperate search leads them to question everything they know about him and one another--both a riveting page-turner and a deeply moving portrait of a family in crisis from the award-winning author of Miracle Creek.\"We didn't call the police right away.\" Those are the first words of this extraordinary novel about a biracial Korean-American family in Virginia whose lives are upended when their beloved father and husband goes missing.Mia, the irreverent, hyperanalytical twenty-year-old daughter, has an explanation for everything--which is why she isn't initially concerned when her father and younger brother Eugene don't return from a walk in a nearby park. They must have lost their phone. Or stopped for an errand somewhere. But by the time Mia's brother runs through the front door bloody and alone, it becomes clear that the father in this tight-knit family is missing and the only witness is Eugene, who has the rare genetic condition Angelman syndrome and cannot speak.What follows is both a ticking-clock investigation into the whereabouts of a father and an emotionally rich portrait of a family whose most personal secrets just may be at the heart of his disappearance. Full of shocking twists and fascinating questions of love, language, race, and human connection, Happiness Falls is a mystery, a family drama, and a novel of profound philosophical inquiry. With all the powerful storytelling she brought to her award-winning debut Miracle Creek, Angie Kim turns the missing person story into something wholly original, creating an indelible tale of a family who must go to remarkable lengths to truly understand one another.",
  "genres": [
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Thriller",
    "Audiobook",
    "Book Club",
    "Contemporary"
  ],
  "author": "Angie  Kim",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/75495002-happiness-falls"
}