{
  "title": "Save A Life, Tell A Lie",
  "description": "Stalker or vampire?The choice is yours, but if you make the wrong one…You die.He’s spent months watching my every move. Stalking me from the shadows, waiting for the right moment.When he strikes, I’m not ready.I’m surrounded by strangers, and far from anyone who might have cared, or at the very least, noticed if I suddenly disappeared.He’s closing the distance, leaving me with a terrifying choice: take my chances with my stalker, or seek help from a monster more powerful than him. Making the wrong choice could cost me my life.Risking it all, I throw myself at an extraordinarily handsome stranger. A stranger who just happens to be a vampire. He also happens to be the crown prince of vampires, and he’s disgusted by humans.I haven’t even been bitten yet, and my life already sucks.It’s too late to rethink my plan, and I’m out of options. I beg the stranger to claim he knows me.Instead, the vampire claims me.But my stalker isn’t ready to admit defeat, and the vampire I sought refuge with isn’t willing to let me go.A stalker. A vampire. A choice that might end my life.SLTL is a new series focused on Journee and her vampire mate (yes, this series has only one guy! Don’t worry, he’s drool-worthy). This story has it all: a stalker, coming into power, vampire royalty, a protective mate, humor, heat, and eventually a HEA. For my naughty readers, this book is a medium burn that’s worth the wait… and you better be ready, because once they get started, things really get spicy! Journee's vampire mate falls in love with her the moment he meets her and will do anything to protect what is his.Note: Please be sure to read the full sensitivity note before diving into this story. With a violent, obsessed stalker and a protective vampire prince with a beast-like form, some scenes are a bit wild and include darker elements (such as physical violence during an attack scene).",
  "genres": [
    "Vampires",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Urban Fantasy",
    "Supernatural"
  ],
  "author": "Sedona Ashe",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/75531148-save-a-life-tell-a-lie"
}