{
  "title": "All Acts of Love and Pleasure Are Her Rituals",
  "description": "The tantalizing tale of a high priestess in a secret society. Forbidden love. A destiny preordained.Lost in a world without guidance, Lady Caroline Hathaway embarks on her own journey of self discovery as a healer during a dangerous time of change.\"Grandmother had always taught her that destiny will befall itself no matter how mortals try to stop it. The fates always get their way.\" After losing his wife during childbirth, Caroline's father tries to raise his only daughter as a normal child. Sheltering her from the many predictions that foreshadowed her birth, he keeps her out of sight of her destiny. But Grandmother feels differently. This mysterious old woman takes Caroline under her wing and teaches her the ways of wisdom and magic. Unbeknownst to Caroline, she is being prepared for her destiny as High Priestess of the Society of the Crescent. Without direction from her father, Caroline follows many dark paths to discover the true power that lies within her. It is not until her greatest love enters the picture that she is able to fully realize her power, but not without costs.Caroline's life is filled with trials and initiations. She journeys through innocent, forbidden love and finds herself in a romance greater than anything she could have ever expected. Does she stay on the path that is safe or does she risk everything to follow her heart? Caroline's tale is erotic, sensual, romantic and tragic. She falls under the power of submission as she follows the path of mysticism and vows herself to the moon.This is a story about the magic of the land, the passion of a woman and the possession of love. It is a heartfelt experience of unrestricted desire in a time before such things were chastised-a time where the land was the call of worship and the spirit of the people.In All Acts of Love and Pleasure, author Rachel Adair paints a highly sensual picture of the secret love between women, between men, forbidden relationships, and the secrets of the ancient arts.",
  "genres": [],
  "author": "Rachel Adair",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/7554171-all-acts-of-love-and-pleasure-are-her-rituals"
}