{
  "title": "Hidden Jewel",
  "description": "Hidden Jewel is the fourth thrilling novel in the V.C. Andrews Landry series. Following All That Glitters, the spellbinding story of Ruby Landry's daring struggle to find a happy life with Beau Andreas and to protect their precious daughter. Sheltered from sorrow, innocent young Pearl thrives in the sunshine of a loving home...except for the haunting nightmares of her earliest years, and the dark family secrets she worries will one day shadow her destiny....  Raised in a New Orleans mansion filled with kindness and laughter, Pearl dreams of becoming a doctor. With all the finest families wishing her well, her high school graduation party is almost as festive as Mardi Gras itself. But still, she fears that she will never know the essence of romantic passion, or her family's buried secrets. Yet her summer job in an elegant old hospital is fascinating...and an experienced intern is eager to share his friendship with her.  But the sultry Louisiana heat cannot dispel her family's sinful legacy, the snakelike treachery of a man who threatens Pearl's innocence, or an awful portent of disaster. After a cruel accident befalls one of Pearl's twin brothers, the bayou that seized him beckons to Ruby who flees, tormented, back to her Cajun roots. Pearl's faith in her mother abides, but she cannot hold back her tears when her other brother falls deathly ill, and her father retreats into his own bourbon-soaked world.  Pearl's dreams of success swirl away with the hurricane winds, and she journeys to the swamps in search of her mother and the shocking truths of her heritage. In the warm embrace of a gentle Cajun man, she discovers a blessed refuge. But, until the storm clouds clear, Pearl cannot savor the springtime sweetness that always, always seems beyond tomorrow....",
  "genres": [
    "Fiction",
    "Horror",
    "Young Adult",
    "Romance",
    "Gothic",
    "Drama",
    "Mystery"
  ],
  "author": "V.C. Andrews",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/755300.Hidden_Jewel"
}