{
  "title": "Saint Gredible and Her Fat Dad's Mass",
  "description": "Gretty has more clutching at her just her mother's ashes. Her legacy includes a mess of stories: some from grandfathers who survived the Holocaust and some from parents who didn't. These stories are woven by living cultures and killing trauma so much deeper and older. They continue to grow and tangle.* Born deaf and on the spectrum, it's a challenge not to be eccentric.* Knowing her parents didn't want her, it's a struggle not to surrender to sadness.* Alive and full of fight, it's impossible not to be ferocious.Gretty's parents came together at The Dakota in the aftermath of the Lennon assassination. Her mother's passion was preventing future Holocausts, but creating a child means vulnerability. Thus, their commitment to remain childless. Yet life has ways of overwhelming such commitmentsThe novel opens in the aftermath of a grandfather's death. There are flashbacks of \"Obby\" reading and writing strange children's stories with help from his granddaughter and Fat Abe, his son. As Abe (Avram) cleans out Obby's house, they are visited by Gretty's maternal grandfather, a man who survived and thrives (materially) at any cost. Much earlier, Gretty's mom had died a death of despair: confronting how this father had \"collaborated\" with the Nazis.Fat Dad is Abe, an eccentric depressive. To survive, he generates enthusiasms unseemly for one charged with raising a motherless child. His preoccupation is his own fabricated religion: Chelonialism which exalts creativity in avatars like Coltrane and the Beatles. Beneath his antics, Abe might be more obsessed with Nazis than was his dead wife. It's 2017, a new president has been \"elected\" who many fear is sending dogwhistles to fascists. Though Abe is reluctant to be too \"active\" (partly because of his obesity), he feels compelled to join a large protest on the Boston Common where, in a tragicomic turn of events, he is accosted by ANTIFAs who accuse him of being a Nazi. On a hot August day, this proves too much for poor Abe.Gretty is left an orphan in the care of family friends. But her parents never leave her. Possessed by animated memories and compulsions she explores her own creativity while striving to make meaning of her legacies and prospects.This novel is a clash of dark humor, absorbing ideas, and gripping sentiments. Some might label it experimental, but eccentricities (internal monologue, poetry, and playwriting formats) are required to convey the characters' preoccupations with creativity and proteanism. But these characters are also possessed with a fascinated suspicion of labels (names), definitions, language, and stories. Their real fear is being scapegoated by the fickle and dangerous society of fellow humans.",
  "genres": [],
  "author": "Joe Panzica",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/75550299-saint-gredible-and-her-fat-dad-s-mass"
}