{
  "title": "Oxford American Handbook of Rheumatology (Oxford American Handbooks in Medicine) 2nd Edition by Seo, Philip (2013) Paperback",
  "description": "Written by leading American practitioners, the Oxford American Handbooks of Medicine each offer a pocket-sized overview of an entire specialty, featuring instant access to guidance on the conditions that are most likely to be encountered. Precise and prescriptive, the handbooks offer up-to-date advice on examination, investigations, common procedures, and in-patient care. These books will be invaluable resources for residents and students, as well as a useful reference for practitioners. The Oxford American Handbook of Rheumatology offers practical, point of care guidance on the diagnosis and management of acute and chronic rheumatologic problems. This is a remarkably comprehensive resource, holding a large amount of information in a compact pocket book. It covers the full range of the discipline, from new biologic therapies used in the treatment of inflammatory arthritis, to new information on drugs, chronic widespread pain, shoulder/neck pain, and complementary medicine. Its easy-to-use format and organization allows easy access to precise, prescriptive information. Why choose the Oxford American Handbook of Rheumatology? The design....The Handbook uses a unique flexicover design that's durable and practical. Compact, light, and fits in your pocket! Also has quick reference tabs, four-color presentation, and bookmark ribbons to help provide fast answers. The interior layout....The Handbook is a quick reference in a small, innovative package. With one to two topics per page, it provides easy access and the emergency sections are in red to stand out. Icons throughout aid quick reference. The information....The Handbook succinctly covers all the essential topics in a one or two-page spread format with colored headings that break up the text and provide a logical structure for readers of all levels. Common clinical questions are answered clearly and extensively. The history....Oxford University Press is known around the world for excellence, tradition, and innovation. These handbooks are among the best selling in the world. The price....You get an extremely useful tool at a great value!",
  "genres": [],
  "author": "Philip Seo",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/130579237-oxford-american-handbook-of-rheumatology-oxford-american-handbooks-in-m"
}