{
  "title": "Message in a Bottle",
  "description": "Message in a Bottle has the earmarks of sentimental tongue-wagging at its finest and should please romantics and cynics alike--it's sure to bring romantics to their knees, while cynics will be slapping theirs in laughter. --Rebekah Warren' to 'Thrown to the waves, and to fate, the bottle could have ended up anywhere. Instead, it is found just three weeks after it begins its journey. Theresa Osborne, divorced and the mother of a twelve-year-old son, discovers it during a seaside vacation from her job as a Boston newspaper columnist. Inside is a letter that opens with, \"My Dearest Catherine, I miss you my darling, as I always do, but today is particularly hard because the ocean has been singing to me, and the song is that of our life together....\" For Garrett, the message is the only way he knows to express his undying love for a woman he has lost. For Theresa, wary of romance since her husband shattered her trust, the message raises questions that intrigue her. Challenged by the mystery, and driven to find Garrett by emotions she does not fully understand, Theresa begins a search that takes her to a sunlit coastal town and an unexpected confrontation. Brought together either by chance or something more powerful, Theresa and Garrett's lives come together in a tale that resonates with our deepest hopes for finding everlasting love. Shimmering with suspense and emotional intensity, Message in a Bottle takes readers on a hunt for the truth about a man and his memories, and about both the heartbreaking fragility and enormous strength of love. For those who cherished The Notebook and readers waiting to discover the magic of Nicholas Sparks's storytelling, here is an achingly lovely novel of happenstance, desire, and the choices that matter most.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Adult",
    "Adult Fiction",
    "Contemporary Romance"
  ],
  "author": "Nicholas Sparks",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/7559612-message-in-a-bottle"
}