{
  "title": "The Unsealing: Love, Lust, and Murder in the Gilded Age",
  "description": "Love, Lust, and Murder in the Gilded Age …Buffalo, New York, 1901 … a muscular, young city, Queen of the Lakes … The Electric City … where the money spent to build Newport mansions and Park Avenue townhouses is made, plays host to the world’s greatest fair, the Pan-American Exposition and its 8,000,000 guests. Yet the city is only weeks away from disaster, when a crazed anarchist will assassinate President McKinley.And less than a mile from the spectacle of the Pan-American, a web of love, lust, and intrigue is forming within the elite enclave of Ashwood. Alicia and Edward Miller may be one of Ashwood’s most envied couples, but inside the walls of their luxurious home, a toxic malice is brewing. When simmering and sultry Alicia falls for dashing Ivy League attorney Arthur Pendle, on whose mysterious income he and his longsuffering wife Cassandra – facing demons of their own – live fast and high, infatuation soon curdles into something sinister and obsessive.Meanwhile, the beautiful Sarah Payne – who from girlhood has dreamed of becoming a detective – struggles to find fulfillment in a man’s world. Trapped in a loveless marriage to a dissolute dentist -- who has become dangerously dependent on ether and alcohol -- Sarah befriends the unhappy Ed Miller and is drawn into the deadly drama inside the Millers’ disintegrating marriage.When Edward comes into possession of a trove of explicit letters from Arthur to Alicia – love letters, to be sure, but also a confession of much darker doings – he and Sarah, along with the Pendles, are plunged headlong into a deadly whirlpool of official corruption, graft -- and murder.Inspired by Buffalo’s true crime ‘murder of the century’, in The Unsealing Robert Brighton recreates a world at once utterly strange and strangely familiar. Pitting detective against detective, husbands against wives, and set against the backdrop of Gilded Age splendor and excess, The Unsealing is a gripping, psychological tale of forbidden pleasures and fathomless pain.Contains three original interior scratchboard illustrations.Join Robert Brighton on a journey into the real Gilded Age in an electrifying tale of scandal, love and murder - and the birth of the Avenging Angel Detective Agency. Get your copy today!",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Novels"
  ],
  "author": "Robert Brighton",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/75588523-the-unsealing"
}