{
  "title": "The King's Queen",
  "description": "When the elven king of death released me even though my existence is a threat to his kingdom, I took the opportunity to run. There is just one problem… I also fell in love with him.Nothing like a little doomed love to add a dash of intrigue to life, right? Unfortunately, that’s not even the worst of it.I’m a worrier on my best days, but with a psycho tracking my every move because he’s obsessed with killing me, I’ve graduated to the level of paranoid lunatic.Even if I could forget about the tracker—not happening since he’s figured out the fastest way to get to me is to attack my adopted family—my regular life is also anxiety-inducing as the city of Magiford is brewing with trouble.Someone is setting off increasingly powerful magical spells downtown, upsetting all the humans. The supernatural community is desperate to find the perpetrator, and the top leaders are convinced the psychotic tracker chasing me is in on it. Their solution? Use me to capture the tracker for questioning.What none of us counted on was Noctus—the elven king of death—interfering. Turns out I might not be the only one to regret our parting. But is there any way he could help me, and still keep his kingdom a safe secret?At least one thing is for sure: I’m in way over my head with this, and my gut is warning me that I’m about to test if cats really do have nine lives.King’s Queen is the last book in the Gate of Myth and Power urban fantasy trilogy, and is part of the Magiford Supernatural City world. It is an adventure-filled and hilarious take on the Hades and Persephone myth, with a twist of mystery. It’s packed with humor, battles, and a sweet, slow burn romance between an outcast magic user and the deadly king of the elves.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Romance",
    "Magic",
    "Paranormal",
    "Fae",
    "Vampires"
  ],
  "author": "K.M. Shea",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/75573876-the-king-s-queen"
}