{
  "title": "Mark of the Vasirian",
  "description": "What if there was truth to the vampire myth? And what if your fate was bound to that truth?Desperate to escape her abusive stepbrother, Blaire accepts a scholarship to the exclusive private university Blackthorn Academy. Surrounded by Vasirian—the root of vampire myth—Blaire fears she has traded one cage for another. She is marked as a Korrena, the fated mate of a Vasirian. While she is attracted to the mysterious Lukas, whose gruff exterior hides a lonely heart, the expected ritual for the bond repels her. No one can guarantee her safety; a match between a Vasirian and a human is unprecedented. If she leaves Blackthorn, she could be killed, yet if she stays, Lukas could unintentionally drain her of life.Facing danger by stepping into a den of monsters may be the only way for her to truly be free.••••••••••••••••••••••••••••••••••Mark of the Vasirian is the debut full-length (nearly 120k words) new adult paranormal romance by author Stephanie Denne that is the first of a long series filled with mystery, magic, and love that stands against everything the supernatural world can throw at it. No cliffhanger, but you'll be left wondering what happens next! And of course, this dark fantasy romance series has a HEA, with spin-off series to come.The dark and mysterious world of the Blackthorn Saga is a new take on vampire romance in an academy setting complete with a king and his court, fated mates, magic, and more! This series is for you if you enjoy a paranormal romance with a human female lead that overcomes her past to find where she truly belongs in a fantasy world filled with supernatural creatures.••••••••••••••••••••••••••••••••••Author's Note: 18+ This series contains content that may be unsuitable for certain readers. To learn more about content warnings in the author's work, please visit her website.",
  "genres": [
    "Fantasy",
    "Vampires",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Dark Academia",
    "Romantasy"
  ],
  "author": "Stephanie Denne",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/75674291-mark-of-the-vasirian"
}