{
  "title": "Walt & Skeezix. 1921 & 1922.",
  "description": "Walt & Skeezix is the first-ever collection of the classic twentieth-century newspaper strip Gasoline Alley, and Book One is the beginning of a handsome multivolume series edited and designed by comics virtuoso Chris WareChris Ware has often cited Gasoline Alley as one of his favorite comic strips ever, and he has lovingly edited and designed Walt & Skeezix: Book One, the first-ever collection of the classic newspaper strip created by one of the pioneering giants of American comic strips, Frank King. Not only does this volume reprint the first two years of the strip in which King’s friendly and nostalgic imagination took shape but each book in the series features an eighty-page color introduction by Jeet Heer of Canada’s National Post. Each introduction will also feature never-before-seen archival photos and ephemera from the personal collection of King’s granddaughter. Walt & Skeezix is not just a collection of a classic comic strip—it is the story of a great American cartoonist. Few cartoon strips have this kind of longevity and quality; Gasoline Alley has been with us since 1919 and is a gentle mirror held up to ordinary American life in the early twentieth century. It started as a mild satire on the post-WWI “craze” for cars, but it wasn’t long before it developed into a quirky family story attracting an audience of more than thirty million readers in four hundred–plus newspapers. Gasoline Alley, an affectionate portrait of modern living, is remembered for being the first strip to set itself in contemporary American history. The characters of Gasoline Alley grow up, go to war, and have grandchildren. The strip always reflects the kind, sweet pace of life.",
  "genres": [
    "Comics",
    "Comic Strips",
    "Fiction",
    "Graphic Novels",
    "Humor",
    "American",
    "Comic Book"
  ],
  "author": "Frank  King",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/7567.Walt_Skeezix_1921_1922_"
}