{
  "title": "Orlando Innamorato: Orlando in Love",
  "description": "Like Ariosto's Orlando Furioso and Tasso's Jerusalem Delivered, Boiardo's chivalric stories of lords and ladies first entertained the culturally innovative court of Ferrara in the Italian Renaissance. Inventive, humorous, inexhaustible, the story recounts Orlando's love-stricken pursuit of \"the fairest of her Sex, Angelica\" (in Milton's terms) through a fairyland that combines the military valors of Charlemagne's knights and their famous horses with the enchantments of King Arthur's court. Today it seems more than ever appropriate to offer a new, unabridged edition of Boiardo's Orlando Innamorato, the first Renaissance epic about the common customs of, and the conflicts between, Christian Europe and Islam. Having extensively revised his earlier translation for general readers, Charles Ross has added headings and helpful summaries to Boiardo's cantos. Tenses have been regularized, and terms of gender and religion have been updated, but not so much as to block the reader's encounter with how Boiardo once viewed the world. Charles Stanley Ross has degrees from Harvard College and the University of Chicago and teaches English and comparative literature at Purdue University. \"Neglect of Italian romances robs us of a whole species of pleasure and narrows our very conception of literature. It is as if a man left out Homer, or Elizabethan drama, or the novel. For like these, the romantic epic of Italy is one of the great trophies of the European genius: a genuine kind, not to be replaced by any other, and illustrated by an extremely copious and brilliant production. It is one of the successes, the undisputed achievements.\" -C. S. Lewis",
  "genres": [
    "Poetry",
    "Classics",
    "Italian Literature",
    "Fiction",
    "Fantasy",
    "15th Century",
    "Literature"
  ],
  "author": "Matteo Maria Boiardo",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/756484.Orlando_Innamorato"
}