{
  "title": "Pot Culture: The A-Z Guide to Stoner Language & Life",
  "description": "Do you know the difference between burning one and Burning Man? Does using the name Marley as an adjective make total sense to you? Do you chuckle to yourself when the clock strikes 4:20? Are you convinced that the movie Dazed and Confused deserved an Oscar? If you answered \"Dude!\" to any of these questions, then Pot Culture is the book you've been waiting for.For those in the know, it's the stoner bible. For novices, it's Pot 101. Either way, Pot Culture encapsulates the history, lifestyle, and language of a subculture that, with every generation, is constantly redefining itself. From exhaustive lists of stoner-friendly movies, music, and television shows to detailed explanations of various stoner tools to celebrity-authored how-tos and an A-Z compendium of slang words and terms, it's the ultimate encyclopedia of pot.Written by former High Times editors Shirley Halperin (now a senior writer at Entertainment Weekly and a TV talking head) and Steve Bloom (publisher of CelebStoner.com), and featuring contributions by a host of celebrity stoners, including Melissa Etheridge, Maroon 5's Adam Levine, Redman, Steve-O, and America's Next Top Model' s Adrianne Curry, Pot Culture provides the answers the everything you ever wanted to know about pot but were too stoned to ask.\"Pass the Dutchie! Marijuana and rock 'n' roll have been joined at the hip, since, well, ever and that link will be explored in the book Pot Culture by journalist Shirley Halperin and longtime High Times editor Steve Bloom. . . . Essentially an encyclopedia of pot, filled with such top 10 lists as \"best stoner movies\" and \"stoner capitals of the world,\" plus a \"pot-parazzi\" section with celebrities sneaking a toke . . .\" -- Billboard",
  "genres": [
    "Nonfiction",
    "Pop Culture",
    "Health"
  ],
  "author": "Shirley Halperin",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/756413.Pot_Culture"
}