{
  "title": "Cupcakes for My Orc Enemy",
  "description": "One very large orc. One very small human. Does size matter?When Elara flees corporate life to open a coffee shop in the small southern town of Fairhaven Falls, the last thing she is looking for is a relationship. But when she meets Grondar, the gruff orc owner of the bakery next door, sparks fly. Literally.Grondar has been burned by human females before. He has no intention of letting the feisty little female next door get under his skin - no matter how attractive he finds her. And it certainly doesn’t mean he’s going to let her get away with sabotaging his business.Despite their disastrous first meeting, Elara still finds herself having inappropriately heated thoughts about the massive orc next door. The attraction seems to be completely one-sided - until he reluctantly comes to her rescue and she discovers a very different side to the grumpy male.Can they overcome their initial animosity, their ongoing rivalry, and their very obvious differences to find a future together?* * ~ * *\"Cupcakes for My Orc Enemy\" is the third sweet and steamy monster romance that make up the Sweet Monster Treats multi-author, shared world collection. Each book is a standalone, containing its own 'Happily Ever After', and can be read/listened to in any order -- (but the series is likely enjoyed most when read/listened to in order, as characters may appear throughout the stories!)Be sure to explore all the titles brought to us by three bestselling authors:• Book 01: \"Cookies For My Orc Neighbor\" by Michele Mills (2023)• Book 02: \"Candy For My Orc Boss\" by Ava Ross (2023)• Book 03: \"Cupcakes For My Orc Enemy\" by Honey Phillips (2023)• Book 04: \"The Single Mom and the Orc\" by Honey Phillips (2023)• Book 05: \"Single Dad Orc\" Ava Ross (2023)• Book 06: \"Twins For The Wild Orc\" by Michele Mills (2023)• Book 07: \"Undercover Orc\" by Ava Ross [2024]• Book 08: \"Protected by the Orc\" by Honey Phillips [2024]• Book 09: \"Arrested by the Orc\" by Michele Mills [2024]* * ~ * *\"Cupcakes for My Orc Enemy\" is also the first story in Honey Phillips' Fairhaven Falls series:• Book 01: \"Cupcakes for My Orc Enemy\"• Book 02: \"Trouble for My Troll\"• Book 03: \"Fireworks for My Dragon Boss\"• Book 04: \"The Single Mom and the Orc\"• Book 05: \"Mistletoe for My Minotaur\"• Book 06: \"Valentine for My Vampire\"• Book 07: \"Protected by the Orc\"",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Enemies To Lovers",
    "Paranormal Romance",
    "Novella",
    "Monsters"
  ],
  "author": "Honey Phillips",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/75609756-cupcakes-for-my-orc-enemy"
}