{
  "title": "If Only You",
  "description": "Brace yourself for longing, laughter, and a swoony slow-burn in this brother’s best friend sports romance about scoring the love of your life when you least expect to.ZiggyI’m the youngest player on the National Soccer team, the baby of my family, and thoroughly sick of being underestimated, so I’ve decided to take matters into my own hands. Which is where my brother’s best friend and teammate, the infamous Sebastian Marchand, comes in.  Seb needs to rehab his reputation. I want to give mine an edge. So I propose a fake friendship with real benefits: spending time in the public eye, my good-girl image and his bad-boy notoriety rubbing off on each other. He’s my devious, dark-haired fantasy come to life, but his destructive ways make it easy to keep him in the (fake) friend zone. Or so I thought, until I start to see the heart of gold he’s been hiding beneath that sinister surface…SebastianLike any self-respecting reprobate, I’ve been spiraling downward, and finally I’ve hit rock bottom. My hockey career and sponsorships are in jeopardy, and while I’m not ready to actually reform my ways, I’m happy to pretend that I have, to secure the life I’m on the brink of losing.  So when my best friend’s sister, Ziggy Bergman, proposes a public “friendship” to revamp our reputations, it’s an offer I can’t refuse. Up till now, I’ve stayed away from Ren’s sweet, shy little sister to avoid any risk of ruining my one good friendship. But I reassure myself there’s no risk in our scheme. I’ll fake a friendship with Ziggy, fix my reputation, and get back to hockey, the one and only thing I love. At least, it was, until what began as a transactional arrangement became the most loving relationship I’ve ever known.​If Only You is a brother’s best friend, (fake) friends with benefits to friends to lovers romance about a bighearted, quietly fierce soccer star on the autism spectrum, and a thoroughly unprincipled, almost irredeemable hockey player who has celiac disease. Complete with an absurd level of mutual pining, meddling family and friends, and a spicy slow burn, this standalone is the sixth in a series of novels about a Swedish-American family of five brothers, two sisters, and their wild adventures as they each find happily ever after.",
  "genres": [
    "Romance",
    "Sports Romance",
    "Sports",
    "Friends To Lovers",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Chloe Liese",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/75677471-if-only-you"
}