{
  "title": "Candy for My Orc Boss",
  "description": "A new life, a new job, a new Orc husband . . . Wait, isn’t he supposed to be my boss?After my ex announces his wedding to someone other than me, I’m eager to leave town. A new life and a new job are just what I need to restore my mojo. On the way to my destination, I overnight at a hotel where edible unmentionables and a tattooed orc construction worker, rock my world. I sneak out the next morning, figuring I’ll never see him again.Until I walk into my new job . . . And that hot Orc construction worker? He’s my boss!He’s eager to continue where we left off. And those symbols on his wrists? According to Orc tradition, they mean we’re married!* * *\"Candy for my Orc Boss\" is a sweet and steamy monster romance that is the second book in the Sweet Monster Treats multi-author, shared world collection.Each book is standalone, contains its own Happily Ever After, and can be read/listened to in any order. Be sure to explore the other titles in the collection:• Book 01: \"Cookies For My Orc Neighbor\" by Michele Mills (2023)• Book 02: \"Candy For My Orc Boss\" by Ava Ross (2023)• Book 03: \"Cupcakes For My Orc Enemy\" by Honey Phillips (2023)• Book 04: \"The Single Mom and the Orc\" by Honey Phillips (2023)• Book 05: \"Single Dad Orc\" Ava Ross (2023)• Book 06: \"Twins For The Wild Orc\" by Michele Mills (2023)• Book 07: \"Undercover Orc\" by Ava Ross [6 May 2024]• Book 08: \"Protected by the Orc\" by Honey Phillips [13 May 2024]• Book 09: \"Arrested by the Orc\" by Michele Mills [20 May 2024]* * *This book is ALSO the first story in Ava's Monsterville, USA world! Each book is standalone, containing its own Happily Ever After, and they can be read in any order. Expect size difference, a cinnamon roll hero, fated mates, and a marriage of convenience.Check out the stories:• Book 01: \"Candy for my Orc Boss\"• Book 02: \"Orc Me Baby One More Time\"• Book 03: \"Gargoyles Just Want to Have Fun\"• Book 04: \"Don’t Go Knotting My Heart\"• Book 05: \"Whose Bed Have Your Claws Been Under?\"• Book 06: \"Uptown Ogre\"• Book 07: \"Oops, I Elf’d it Again\"• Book 08: \"My Orc-y Breaky Heart\"• Book 09: \"Hold Me Closer, Fiery Phoenix\"• Book 10: \"Who Let the Demon Out?\"",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Monsters",
    "Paranormal Romance",
    "Novella",
    "Urban Fantasy"
  ],
  "author": "Ava Ross",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/75609755-candy-for-my-orc-boss"
}