{
  "title": "A Curve of Claw",
  "description": "Book 1 in the Wiccan-Were-Bear SeriesNatural born wiccan Elizabeth Xavier likes her life just the way it is. She has a beautiful lake house. Power to rival just about anyone. And seven men that cater to her every desire.What she didn't expect was to be asked to perform a binding ceremony in the local were-bear den and tie herself forever to a were-bear as a permanent guard. She didn't like anyone telling her what to do, and giving a man a supernatural tie to her life meant he'd probably want to boss her around, too. Or tell her she couldn't enjoy her casual relationships with the other men in her life. Guilt is a strong motivator, as is the reminder that she was abducted several months earlier, so she goes into the den with the intention of securing a guard and keeping him at arms' length. Too bad no one told her that were-bears don't like to be kept at arms' length.When Elizabeth realizes that more than just her personal protection is up for grabs from the bear she binds herself to, can she go through with it, even if it means losing everything she enjoyed about her life? Will she go back on her word and destroy the alliance between the two groups, or does happiness lay in the underground den in the arms of a were-bear? When more than just the alliance and her own personal protection is on the line, Elizabeth has to make a decision fast. The decision to take a guard has never been so important.* * * * *A Curve of Claw contains a feisty play-girl witch with a sarcastic attitude, some red-hot were-bear loving of the menage variety, jealous lovers, claws and fangs galore, and some roadside nookie hot enough to melt the tires from the truck. Note: This a book for mature audiences only, and contains sexually explicit content including M/F/M interaction. Words: 32,720* * * * *Wiccan-Were-Bear series:Book 01: \tA Curve of ClawBook 02: \tA Flash of FangBook 03: \tA Price for a PrincessBook 04: \tA Bond of BrothersBook 05: \tA Bead of BloodBook 06: \tA Twitch of TailBook 07: \tA Promise on White Wings\tBook 08: \tA Slash of SavageryBook 09: \tAwaken a WolfBook 10: \tDaeton's JourneyBook 11: \tA Dragon for DecemberBook 12: \tA Muse for MishkaBook 13: \tA Wish for Their Woman",
  "genres": [
    "Paranormal",
    "Menage",
    "Paranormal Romance",
    "Romance",
    "Shapeshifters",
    "Erotica",
    "Witches"
  ],
  "author": "R.E. Butler",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/13058727-a-curve-of-claw"
}