{
  "title": "Moon Mountain",
  "description": "(Moon Mountain Trilogy, Book 1)The year is 1997. It's a Friday night with a full moon in the sky. And it's Halloween.Morgan Thomas and her best friend and roommate, Sheridan, plan to make it a night to remember. Having recently started her senior year at Clarkes College in the inimitably charming country town of Moon Mountain, North Carolina, Morgan feels this year could be her best yet.But Morgan's world begins to unravel on this chilly autumn night when she encounters a mysterious stranger at a friend's costume party and is unnerved by their chilling silence and peculiar behavior. Then, as if the encounter wasn't enough to put her on edge, she wakes up in the middle of the night to find herself lying on the ground in the vast forest that borders Moon Mountain, with no recollection of how she got there. But before she can make sense of the perplexing situation, a massive creature hidden among the treetops makes its presence known, sending Morgan running for her life.She safely finds her way home but soon becomes plagued by recurring dreams of the forest and a haunting, mysterious cabin. And when the friend who threw the party is found bludgeoned to death days later, pieces of an unknown puzzle begin to rise to the surface, causing Morgan to fear her own involvement. But with no memory of it, she is forced to question her sanity and whether all these troubling events are somehow connected.As Morgan discovers more pieces, including unscrupulous revelations involving Sheridan's wealthy and influential family, the Gallaghers, she is cast into another world she could never have imagined, let alone that she would become the unwitting pawn in a dark and disturbing plan.What secrets does Moon Mountain hold beneath its dark and seemingly calm surface? Who are the Gallaghers, and what truly lies behind their success and power? Morgan and the young and eager detective on her heels (and her mind) are about to discover that 1997 will be the most extraordinary and terrifying year of their lives.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Mystery Thriller",
    "Mystery"
  ],
  "author": "Jess Porto",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/75619710-moon-mountain"
}