{
  "title": "A Most Intriguing Lady",
  "description": "From Sarah Ferguson, the Duchess of York, a sweeping, romantic compulsively readable historical saga about a Duke's daughter--the perfect Victorian lady--who secretly moonlights as an amateur sleuth for high society's inner circle. Victorian London was notorious for its pickpockets. But in the country houses of the elite, gentleman burglars, art thieves and con men preyed on the rich and titled. Wealthy victims--with their pride and reputation at stake--would never go to the police. What they needed was a society insider, one of their own, a person of discretion and finely tuned powers of observation.That person was Lady Mary Montagu Douglas Scott, the youngest child of Queen Victoria's close friends the Duke and Duchess of Buccleuch. Bookish, fiercely intelligent, and a keen observer, Mary has deliberately cultivated a mousey persona that allows her to remain overlooked and significantly underestimated by all. It's the perfect cover for a sleuth, a role she stumbles into when trying to assist a close friend during a house party hosted by her parents at their stately Scottish home, Drumlanrig Castle.It is at this party where Lady Mary also meets Colonel Walter Trefusis, a distinguished and extremely handsome war veteran. Tortured by memories of combat, Walter, like Mary, lives a double life, with a desk job in Whitehall providing a front for his role in the British Intelligence Service. The two form an unlikely alliance to solve a series of audacious crimes--and indulge in a highly charged on-off romance.Pacy, romantic, and fun, A Most Discerning Lady documents one remarkable woman's ability to be both the perfect lady, and a perfectly talented detective...and, of course, to find love too.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Mystery",
    "Fiction",
    "Historical",
    "Historical Romance",
    "Audiobook"
  ],
  "author": "Sarah Ferguson",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/75678687-a-most-intriguing-lady"
}