{
  "title": "From Manchester to the Arctic",
  "description": "In the challenging but rapidly changing 1970s, Connie Sanders, a broken-hearted nurse, flees to the Canadian Arctic.Over the previous year, Ruth, an older nurse, seduced the naïve, twenty-one-year-old Connie, with romantic poetry, music and films. But Ruth abruptly abandoned her romantic intentions and rushed off to get married when rumours swirled around the hospital about their ‘friendship’.In a desperate attempt to escape her pain and humiliation, Connie accepts a job as a nurse in a remote Canadian Arctic settlement, a place where she can block out all the failures of her life, a place here she can start again. She has romantic notions about this new life in the snow, imagining herself to be an intrepid traveller like the merchant-seaman grandfather she never met. Her new life will be a place where Ruth, firmly locked into a box, cannot follow.However, Connie's romantic notions are brutally shattered when she finally arrives in Harbour Inlet, her home for the foreseeable future. She is snubbed by Paul Archer, the government administrator, who seems bent on making life as difficult as possible, and she makes an enemy of Mrs Brooks, the deeply religious vicar’s wife, when she tries to befriend Mrs Brooks’s twelve-year-old daughter, Esther.All thoughts of Ruth come flooding back when Connie meets Canadian anthropologist, Daisy. She is frightened and confused by the feelings Daisy arouses in her and tries to deal with them by finding negative comparisons between Ruth and Daisy.Another Canadian, Elizabeth takes Connie under her wing, helping her though her first bout of debilitating homesickness, and teaching her how to bake with limited ingredients. Elizabeth's photographer husband, Peter, introduces Connie to photography which, over time, becomes something that she can lose herself in when life become difficult. Ilannaq, Connie’s Inuit interpreter, also becomes a good friend and her influence is indispensable in helping Connie gain trust in the Inuit communities, some of whom who are hostile towards Western influence. Connie understands why, when she learns that many have been taken to the mainland, never to return, and that some Inuit children have been taken to Canadian boarding schools where any reference to Inuit culture or language is forbidden. Connie is outraged at this discovery and blames Daisy for being part of the Canadian government, under whose regime these terrible things are happening.One of Connie's challenges is to accept that things are not black and white in this alien environment, and that if she is to succeed as a nurse, she has to understand and accept a culture that is very different to her own. She also has to come to terms with her feelings about Daisy.Can Connie survive in this cold, unfamiliar world? Does she have the courage to embark on the journey towards understanding and acceptance of others, and, more importantly, herself?",
  "genres": [
    "Novels",
    "Book Club",
    "Young Adult",
    "Action",
    "Adventure",
    "Fiction",
    "Teen"
  ],
  "author": "Sheena  Billett",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/75609342-from-manchester-to-the-arctic"
}