{
  "title": "Margaret Atwood's 'The Handmaid's Tale' and 'Oryx and Crake' - A Comparison",
  "description": "Seminar paper from the year 2007 in the subject English Language and Literature Studies - Literature, grade: 1,3, University of Constance (Literaturwissenschaften), course: Margaret Atwood's Later Fiction, language: English, abstract: Margaret Atwood's novels The Handmaid's Tale (T.H.T., 1985) and Oryx and Crake (O. & C., 2003) are works of speculative fiction that are set in the near future. Both of the depicted scenarios take place in the U.S.A. and could be classified as \"survivor's stories\" as they are told from the perspective of a person that survived the new system or the catastrophe the books deal with. T.H.T. takes the reader into an oppressive system that has become reality in the year 2005. In this system women are divided into different kinds of \"functional groups\" according to their abilities. The story is told by the handmaid Offred who - as all handmaids - is still believed to be fertile. Thus she is solely good for childbearing and has not got any choice. This system however is confined to the United States so that there is still hope for an escape to a better life for the people living under the system. The scenario in O. & C. on the other hand occurs around the year 2025 and depicts a world wide catastrophe where Snowman - the narrator of the story - is one of the few surviving human beings. This paper will compare the two novels according to some points of analysis. I had to confine myself to a few themes as it is impossible to include all topics that could be of importance. To start with, I will take a look at the social and political background of the time the novels were written in, followed by a generic analysis of the works. Secondly I will answer the question about the inspiration for these novels and I will deal with the epilogues Atwood added to her books. This will be followed by a chapter about the main topics of the novels which are reproduction, religion and sexuality. Last but not least I will compare the main characters an",
  "genres": [],
  "author": "Martina Schönherr",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/7574152-margaret-atwood-s-the-handmaid-s-tale-and-oryx-and-crake---a-compari"
}