{
  "title": "Lies, Damned Lies, and Science",
  "description": "This is the eBook version of the printed book. If the print book includes a CD-ROM, this content is not included within the eBook version.Don't Get Hoodwinked! Make Sense of Health and Science News...and Make Smarter Decisions! Every day, there's a new scientific or health controversy. And every day, it seems as if there's a new study that contradicts what you heard yesterday. What's really going on? Who's telling the truth? Who's faking it? What do scientists actually know--and what don't they know? This book will help you cut through the confusion and make sense of it all--even if you've never taken a science class! Leading science educator and journalist Dr. Sherry Seethaler reveals how science and health research really work...how to put scientific claims in context and understand the real tradeoffs involved...tell quality research from junk science...discover when someone's deliberately trying to fool you...and find more information you can trust! Nobody knows what new controversy will erupt tomorrow. But one thing's for certain: With this book, you'll know how to figure out the real deal--and make smarter decisions for yourself and your family! Watch the news, and you'll be overwhelmed by snippets of badly presented science: information that's incomplete, confusing, contradictory, out-of-context, wrong, or flat-out dishonest. Defend yourself! Dr. Sherry Seethaler gives you a powerful arsenal of tools for making sense of science. You'll learn how to think more sensibly about everything from mad cow disease to global warming-and how to make better science-related decisions in both your personal life and as a citizen. You'll begin by understanding how science really works and progresses, and why scientists sometimes disagree. Seethaler helps you assess the possible biases of those who make scientific claims in the media, and place scientific issues in appropriate context, so you can intelligently assess tradeoffs. You'll learn how to determine whether a new study is really meaningful; uncover the difference between cause and coincidence; figure out which statistics mean something, and which don't. Seethaler reveals the tricks self-interested players use to mislead and confuse you, and points you to sources of information you can actually rely upon. Her many examples range from genetic engineering of crops to drug treatments for depression...but the techniques she teaches you will be invaluable in understanding any scientific controversy, in any area of science or health. Potions, plots, and personalities: How science progresses, and why scientists sometimes disagree Is it cause or merely coincidence? How to tell compelling evidence from a good story There are always tradeoffs: How to put science and health claims in context, and understand their real implications All the tricks experts use to fool you, exposed! How to recognize lies, truthiness, or pseudo-expertise",
  "genres": [
    "Science",
    "Nonfiction",
    "Reference",
    "Skepticism",
    "Read For School",
    "Health",
    "Politics"
  ],
  "author": "Sherry Seethaler",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/7572083-lies-damned-lies-and-science"
}