{
  "title": "Gonville: A Memoir",
  "description": "In powerful and spirited prose, Peter Birkenhead recounts a childhood spent trying to make sense of his father, a terrifying, charismatic presence who brutalized his family physically and emotionally at the same time that he enchanted them with his passion and whimsy. An avid gun collector yet an anti-war activist, a popular economics professor and a wife-swapping nudist, a leftist and a lifelong fan of the British Empire who would occasionally don an authentic pith helmet and imitate Michael Caine`s performance as the heroic Lieutenant Gonville Bromhead in the bloody war filmZulu, he was a man who could knock his young son down the stairs one day and the next cry about putting the family`s aged dog to sleep.Such is the contradictory figure at the center of this astonishingly candid and shocking memoir. As a young adult, Birkenhead reacted to his volatile childhood by forgetting its worst moments. He adopted all the trappings of normalcy, threw himself into a career as an actor, landing parts in Broadway plays likeBrighton Beach MemoirsandBroadway Bound,both by Neil Simon, and found himself often playing characters who were angry at their fathers. Yet he discovered that he was sleepwalking through life, on occasion falling into rages that reminded him of his father.Then at thirty-one, eleven years after his parents` divorce, Birkenhead told his mother about his recurring dream of flying down the stairs of their house as a young boy. She revealed that it wasn`t a dream, but a memory from his early childhood of being carried rapidly down the stairs by his mom after his father had pointed a gun at them. The revelation about the dream sparked the painful yet necessary process of examining his childhood and of ultimately moving beyond it, forcing Birkenhead to finally confront his father in a way that released him and his family from this complicated legacy. Combining the terror and wit ofRunning with Scissors, the poignancy and sense of place ofThe Tender Bar,with the",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Family"
  ],
  "author": "Peter Birkenhead",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/7570930-gonville"
}