{
  "title": "The Fragments of Parmenides: A Critical Text With Introduction and Translation, the Ancient Testimonia and a Commentary",
  "description": "Edited with New Translation by Richard McKirahanWith a New Preface by Malcolm SchofieldThis book is a revised and expanded version of A.H. Coxon's full critical edition of the extant remains of Parmenides of Elea—the fifth-century B.C. philosopher by many considered \"one of the greatest and most astonishing thinkers of all times.\" (Karl Popper) Coxon's presentation of the complete ancient evidence for Parmenides and his comprehensive examination of the fragments, unsurpassed to this day, have proven invaluable to our understanding of the Eleatic since the book's first publication in 1986. This edition, edited by Richard McKirahan and with a new preface by Malcolm Schofield, is released on the 100th anniversary of Coxon's birth.  This new edition for the first time includes English translations of the testimonia and of any Ancient Greek throughout the book, as well as an English/Greek glossary by Richard McKirahan, and revisions by the late author himself. The text consists of Coxon's collations of the relevant folios of manuscripts of Sextus Empiricus, Proclus and Simplicius and includes all extant fragments, a commentary, the testimonia, a complete list of sources, linguistic parallels from both earlier and later authors, and the fullest critical apparatus that has appeared since Diels’  Poetarum Philosophorum Fragmenta  (1901). The collection of testimonia includes the philosophical discussions of Parmenides by Plato, Aristotle and the Neoplatonists, most of which had been omitted by Diels. The introduction discusses the history of the text, the language and form of the poem, Parmenides’ use and understanding of the verb ‘to be’, his place in the history of earlier and later philosophy and the biographical tradition. In the commentary Coxon deals in detail with both the language and the subject matter of the poem and pays full attention to Parmenides’ account of the physical world. The appendix relates later Eleatic arguments to those of Parmenides.",
  "genres": [
    "Philosophy"
  ],
  "author": "Allan H. Coxon",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/7573235-the-fragments-of-parmenides"
}