{
  "title": "Caviar",
  "description": "In the tradition of Cod and a fascinating journey into the hidden history, culture, and commerce of caviar. Once merely a substitute for meat during religious fasts, today caviar is an icon of luxury and wealth. In Caviar, Inga Saffron tells, for the first time, the story of how the virgin eggs of the prehistoric-looking, bottom-feeding sturgeon were transformed from a humble peasant food into a czar’s delicacy–and ultimately a coveted status symbol for a rising middle class. She explores how the glistening black eggs became the epitome of culinary extravagance, while taking us on a revealing excursion into the murky world of caviar on the banks of the Volga River and Caspian Sea in Russia, the Elbe in Europe, and the Hudson and Delaware Rivers in the United States. At the same time, Saffron describes the complex industry caviar has spawned, illustrating the unfortunate consequences of mass marketing such a rare commodity.The story of caviar has long been one of conflict, crisis, extravagant claims, and colorful characters, such as the Greek sea captain who first discovered the secret method of transporting the perishable delicacy to Europe, the canny German businessmen who encountered a wealth of untapped sturgeon in American waters, the Russian Communists who created a sophisticated cartel to market caviar to an affluent Western clientele, the dirt-poor poachers who eked out a living from sturgeon in the aftermath of the Soviet collapse and the “caviar Mafia” that has risen in their wake, and the committed scientists who sacrificed their careers to keep caviar on our tables. Filled with lore and intrigue, Caviar is a captivating work of culinary, natural, and cultural history.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "History",
    "Food",
    "Food Writing",
    "Russia",
    "Food History",
    "Microhistory"
  ],
  "author": "Inga Saffron",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/7571937-caviar"
}