{
  "title": "The Age of Federalism",
  "description": "When Thomas Jefferson took the oath of office for the presidency in 1801, America had just passed through twelve critical years, years dominated by some of the towering figures of our history and by the challenge of having to do everything for the first time. Washington, Hamilton, Madison, Adams, and Jefferson himself each had a share in shaping that remarkable era--an era that is brilliantly captured in The Age of Federalism .Written by esteemed historians Stanley Elkins and Eric McKitrick, The Age of Federalism gives us a reflective, deeply informed analytical survey of this extraordinary period. Ranging over the widest variety of concerns--political, cultural, economic, diplomatic, and military--the authors provide a sweeping historical account, keeping always in view not only the problems the new nation faced but also the particular individuals who tried to solve them. As they move through the Federalist era, they draw subtly perceptive character sketches not only of the great figures--Washington and Jefferson, Talleyrand and Napoleon Bonaparte--but also of lesser ones, such as George Hammond, Britain's frustrated minister to the United States, James McHenry, Adams's hapless Secretary of War, the pre-Chief Justice version of John Marshall, and others. They weave these lively profiles into an analysis of the central controversies of the day, turning such intricate issues as the public debt intofascinating depictions of opposing political strategies and contending economic philosophies. Each dispute bears in some way on the broader story of the emerging nation. The authors show, for instance, the consequences the fight over Hamilton's financial system had for the locating of the nation's permanent capital, and how it widened an ideological gulf between Hamilton and the Virginians, Madison and Jefferson, that became unbridgeable. The statesmen of the founding generation, the authors believe, did \"a surprising number of things right.\" But Elkins and McKitrick also describe some things that went resoundingly wrong: the hopelessly underfinanced effort to construct a capital city on the Potomac (New York, they argue, would have been a far more logical choice than Washington), and prosecutions under the Alien and Sedition Acts which turned into a comic nightmare. No detail is left out, or left uninteresting, as their account continues through the Adams presidency, the XYZaffair, the naval Quasi-War with France, and the desperate Federalist maneuvers in 1800, first to prevent the reelection of Adams and then to nullify the election of Jefferson.The Age of Federalism is the fruit of many years of discussion and thought, in which deep scholarship is matched only by the lucid distinction of its prose. With it, Stanley Elkins and Eric McKitrick have produced the definitive study, long awaited by historians, of the early national era.",
  "genres": [
    "History",
    "American History",
    "Politics",
    "Nonfiction",
    "American Revolution",
    "Amazon"
  ],
  "author": "Stanley Elkins",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/758739.The_Age_of_Federalism"
}