{
  "title": "Cleopatra's Daughter",
  "description": "From the internationally bestselling author of Nefertiti comes the tumultuous story of Antony and Celopatra's daughter, Selene.The marriage of Marc Antony and Cleopatra is one of the greatest love stories of all time, a tale of unbridled passion with earth-shaking political consequences. When the lovers choose to die by their own hands, their three orphaned children are taken in chains to Rome; only two—the ten-year-old twins Selene and Alexander—survive the journey. Delivered to the household of Octavian’s sister, the siblings cling to each other and to the hope that they will return one day to their rightful place on the throne of Egypt.Recounted in Selene’s youthful and engaging voice, Moran introduces a compelling cast of historical Octavia, the emperor Octavian’s kind and compassionate sister, abandoned by Marc Antony for Cleopatra; Livia, Octavian's bitter and jealous wife; Marcellus, Octavian’s handsome, flirtatious nephew and heir apparent; Tiberius, Livia’s sardonic son and Marcellus’s great rival for power; and Juba, Octavian’s watchful aide, whose honored position at court has far-reaching effects on the lives of the young Egyptian royals.Selene’s narrative is animated by the concerns of a young girl in any time and place—the possibility of finding love, the pull of friendship and family, and the pursuit of her unique interests and talents. And as Selene and Alexander come of age, they are buffeted by the personal ambitions of Octavian’s family and court, by the ever-present threat of slave rebellion, and by the longings and desires deep within their own hearts.Based on meticulous research, Cleopatra’s Daughter is a fascinating portrait of imperial Rome and of the people and events of this glorious and most volatile period in human history. Emerging from the shadows of the past, Selene, a young woman of irresistible charm and preternatural intelligence, will capture your heart.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Egypt",
    "Romance",
    "Young Adult",
    "Book Club"
  ],
  "author": "Michelle    Moran",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/7576995-cleopatra-s-daughter"
}