{
  "title": "The Sentimentalists",
  "description": "Winner of 2010 Giller Prize, Johanna Skibsrud's debut novel connects the flooding of an Ontario town, the Vietnam War, a trailer in North Dakota and an unfinished boat in Maine. Parsing family history, worn childhood memories, and the palimpsest of old misunderstandings, Skibsrud's narrator maps her father's past.Napoleon Haskell lives with Henry in the town of Casablanca, Ontario, on the shores of a man-made lake beneath which lie the remains of the former town. Henry is the father of Napoleon's friend Owen, who died fighting in Vietnam. When her life comes apart, Napoleon's daughter retreats to Casablanca and is soon immersed in the complicated family stories that lurk below the surface of everyday life. With its quiet mullings and lines from Bogart, The Sentimentalists captures a daughter's wrestling with a heady family mythology.\"The real beginning of this story,\" says Skibsrud, \"was a summer that I spent working on Flagstaff lake, a lake that covers four now submerged townships in northern Maine, and served as the inspiration for the lake and the buried town in my book. That fall, with the beginnings of a story in my head, my father began to speak for the first time about his experiences in the Vietnam War. I am still not sure exactly why he told me his story when he did, but I think it had to doit was 2003 thenwith the wars in Iraq and Afghanistan, which had been for some time stirring in him a deep anger toward a government willing to repeat the mistakes of the past at the expense of innocent people; soldiers as well as civilians.My mother thinks that my father told me his stories because he knew that I would do something with themwhat I did write, though, was not my father's story, but my own. And it is not a true story. At its root, though, there are two true things. One is my father's testimony following Operation Liberty II in 1967, in which he spoke out against the murder of a civilian woman by the Captain of his squad. The other is the feeling I got floating over the buried towns of Flagstaff Lake: a feeling of the way that everything exists in layers, that nothing disappears; it just gets hidden sometimes.\"",
  "genres": [
    "Fiction",
    "Canada",
    "Book Club",
    "War",
    "Literary Fiction",
    "Historical Fiction",
    "Canadian Literature"
  ],
  "author": "Johanna Skibsrud",
  "average_rating": "2.74",
  "url": "https://www.goodreads.com/book/show/7579973-the-sentimentalists"
}