{
  "title": "Abraham Lincoln's Gettysburg Address",
  "description": "“Fourscore and seven years ago our fathers brought forth on this continent a new nation, conceived in liberty and dedicated to the proposition that all men are created equal.” Long before his conservative manifesto Liberty and Tyranny became a #1 New York Times bestseller, Mark R. Levin's love for his country was instilled in him by his father, Jack E. Levin. At family dinners, Jack would share his bountiful knowledge of American history and, especially, the inspiration of Abraham Lincoln. The son of immigrants, Jack Levin is an American patriot who responded with deep personal emotion to Lincoln's call for liberty and equality. His admiration for the great Civil War president inspired him to personally design and produce a beautiful volume, enhanced with period illustrations and striking battlefield images by Matthew Brady and other renowned photographers of the era, that brings to life the words of Lincoln's awe-inspiring response to one of the Civil War's costliest conflicts. Now Jack Levin's loving homage to the spirit of American freedom is available in an essential edition that features his original foreword as well as a touching new preface by his son, Mark Levin. In this way, Abraham Lincoln's Gettysburg Address Illustrated celebrates the passing of patriotic pride and historical insight from generation to generation, from father to son. The day following the dedication of the National Soldier's Cemetery at Gettysburg, Edward Everett, who spoke before Lincoln, sent him a note “Permit me to express my great admiration for the thoughts expressed by you, with such eloquent simplicity and appropriateness, at the consecration of the cemetery. I should be glad, if I could flatter myself that I came as near to the central idea of the occasion, in two hours, as you did in two minutes.” Lincoln wrote back to “In our respective parts yesterday, you could not have been excused to make a short address, nor I a long one. I am pleased to know that in your judgement the little I did say was not entirely a failure.”",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Classics",
    "American History",
    "Civil War",
    "Historical"
  ],
  "author": "Abraham Lincoln",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/7579061-abraham-lincoln-s-gettysburg-address"
}