{
  "title": "Becoming a True Champion: Achieving Athletic Excellence from the Inside Out",
  "description": ".csC583D0C8{ 0pt 12pt 0pt} .cs5EFED22F{ New Roman; } .csA62DFD6A{ New Roman; } Today, aspiring athletes have to work harder and be more dedicated than athletes of previous generations who did not have to contend with the messages of a popular culture that promotes winning at all costs and implicitly condones \"shortcuts\" to winning. Many of today's athletic superstars glorify and demonstrate cheating and illicit, destructive conduct. Whether off the field antics or on the field cheating through the use of illegal performance-enhancing drugs typify an athlete's lack of personal values, the bad behavior displayed by many in a broad range of sports is hard to escape. The result is that too many such negative role models and influences are out there, diverting today's developing competitors down a seductive path to failure rather than upward to excellence and lasting, honest achievement. Becoming a True Achieving Athletic Excellence from the Inside Out fills a critical need by speaking in a frank and direct voice directly to today's aspiring athletes about these crucial, controversial issues and the personal choices they face. At the same time the book presents them with the antidote to these negative influences-the fundamental values, attitudes and concepts, both mental and practical, that support and lead to athletic excellence. A \"true champion\" is an athlete with the specific qualities of character, mental discipline, and physical skills necessary to generate and keep increasing athletic excellence and success throughout his or her career. These qualities can be learned and developed; they need not be inborn. Becoming a True Champion goes deeply into each quality to show developing athletes how adopting it directly affects and enhances athletic performance, longevity, and dignity. Through relevant examples, inspiring stories, and a personalized approach, the book shows athletes how to avoid the many pitfalls, and overcome the inevitable obstacles, so common in today's sports culture.",
  "genres": [],
  "author": "Kirk Mango",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/13059264-becoming-a-true-champion"
}