{
  "title": "The Transitional Form Dilemma",
  "description": "The idea of evolution, which materialists ever since Ancient Greece have employed to account for the origin of life, entered the world of science in the 19th century with Charles Darwin’s book On the Origin of Species. Those who supported the materialist philosophy, which underwent an enormous rise during the 19th century, adopted the theory of evolution as an answer to the question of how life came into being, but did not question the theory’s scientific foundations. The proponents of materialist ideologies imposed the theory of evolution on entire systems of education and popular culture for 150 years, despite possessing no evidence for it, and employing only methods of propaganda.From the second half of the 20th century onward, however, the privileged position that the theory of evolution had enjoyed among the scientific community became increasingly problematic. Observations and experiments in a wide range of scientific disciplines, from paleontology to biology and from anatomy to genetics, began to produce findings that argued against the theory. In the face of these new scientific findings, evolutionists suddenly found themselves and their theory on the defensive.One of the main objections to Darwin’s theory of evolution indeed, concerns the fossil record. The transitional forms that evolutionists expected to find in the fossil record— and which might be regarded as proof that species evolved from one another—have not been found. Fossils emerge suddenly and with all their particular features fully present, and the fossil record demonstrates that no species experienced any process of gradual change leading to its eventual disappearance.The absence of transitional forms from the fossil record is by itself sufficient to undermine the whole theory of evolution. Charles Darwin, the founder of the theory, actually admitted the truth of this! After inquiring into the absence of such forms, he wrote that “this, perhaps is the most obvious and gravest objection which can be urged against my theory.”And today, even among evolutionists, there is a serious dispute over how to interpret the fossil record. Fossils, one important source of scientific evidence regarding natural history, clearly refute the theory of evolution and show that life on Earth appeared suddenly, with no evolutionary process behind it—in other words that life forms were created.",
  "genres": [
    "Evolution"
  ],
  "author": "Harun Yahya",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/7598742-the-transitional-form-dilemma"
}