{
  "title": "RoboChildren: The Tussin Generation",
  "description": "Every decade has its version of the subculture. The 50s had the beatniks with their restless Benzedrine wanderings, the 60s had the hippies with their LSD-inspired politics, the 70s and 80s led into the cocaine riddled noses of punks and hair metal, and the 90s destroyed lives with heroin and prescription drug addiction - but always there was the idea of capturing moments of great depravity in writing. The counterculture of the 2000s grabs a bottle of cough syrup off the shelf and says, \"Eh, fuck it...\" Based on the author's real experience, RoboChildren documents that mentality like nothing before it.What brand of mayhem sits in your medicine cabinet?On the surface, RoboChildren is a story of a group of teenagers abusing drugs - particularly DXM, the active ingredient in everyday cough syrups - to satisfy adolescent angst and the need to rebel. But underneath, it is an ode to the existential struggles of today's youth, who are turning to more dangerous behaviors in an attempt to define themselves in a cruel universe.The narrator, James, is an awkward and angry individual, who sees the entire world through morbid and paranoid eyes, even perceiving his friends as enemies. The road of heavy drug abuse drives James and his off-beat group of misfit buddies to throw caution out the window as they speed from one act of reckless abandon to the next, losing touch with reality along the way. James' mind is being split in two - one side, a promising young adult aspiring to reach great heights, the other, a drug addled outcast bent on destruction.Along the way we meet James' friends, Zach, a hopeless thrill junky; Phil, a sociopathic addict of the most perverse variety; Gary, a volatile madman with nihilistic tendencies; and Daniel, the self-proclaimed spiritual mentor to the gang. Together, they form the RoboChildren, believing they have truly found the answer to life, and taking every risk to obtain it.",
  "genres": [],
  "author": "James   Hunt",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/7594731-robochildren"
}