{
  "title": "ضریح چشم‌های تو",
  "description": "مجموعه داستان «ضریح چشم‌های تو» شامل هفت داستان کوتاه – تالیف دهه شصت – از سید مهدی شجاعی است.داستان‌های تالیف شده در این مجموعه را از چند منظر می‌توان آثاری شاخص و درخور اعتنا در پرونده کاری شجاعی به حساب آورد؛ که بی‌شک مهم‌ترینش ابداع نثری شاعرانه و حس‌انگیز و پیوندخورده با باورهای دینی نویسنده است. این ویژگی در موارد بسیاری باعث شده شجاعی در شخصیت‌پردازی داستانی خود به ایجاد یک پیوند میان انسان‌های حاضر و شهدای کربلا بیاندیشد و با ترکیب ابعادی از حادثه عاشورا با مختصات امروزی روایتش، دست به خلق داستان‌هایی تأثیرگذار بزند.از سوی دیگر داستان‌های مجموعه «ضریح چشم‌های تو» را می‌توان نمونه‌ای در خور اعتنا از داستان‌پردازی غیر شعاری به تناسب زمان و جغرافیای خلق این آثار دانست. شجاعی در این داستان‌ها نشان می‌دهد که چگونه در سال‌های دهه شصت، با تأسی از فضای جامعه خویش و به دور از شعارزدگی و تنها بر مبنای باورها و آرمان‌هایش – که جزئی از حقیقت زیستی آن زمان نویسنده نیز به شمار می‌رفت – دست به خلق داستان‌هایی زده است که مهم‌ترین کارکردش بارور نمودن و قابل درک کردن مفاهیم آرمانی نویسنده، برای مخاطبان اوست.داستان «کسی که آمدنی است» و «ضریح چشم‌های تو» و نیز «مرا به نام تو میخوانند» در این مجموعه بهترین مدعی برای اثبات این گذاره به شمار می‌روند. داستان‌هایی که شجاعی در شخصیت‌پردازی بازیگران اصلی آنها، حتی از اسامی شهدای کربلا به منظور تصویرسازی بهتر در ذهن مخاطبش بهره برده است و از سوی دیگر همگی درصدد باز آفرینی و تذکار برخی از باورهای دینی است که در باورهای جامعه با وجود حیات داشتن در آن مقطع تاریخی، باید دوباره و در قلمی داستانی یادآوری می‌شدند؛ باورهایی همچون شفاعت در هنگام مرگ، توکل، توسل و ایمانی که انسان را بریده از دنیا راهی جهاد می‌کند.یکی دیگر از نکات قابل توجه داستان‌نویسی شجاعی در دهه شصت، که می‌شود در این مجموعه به خوبی نشانی از آن گرفت، علاقه و توانایی جالب توجه او در استفاده از توصیف برای صحنه‌سازی داستانی است. داستان «تویی که نمی‌شناختمت» از این منظر اثری ویژه است که در آن می‌شود توجه و چیره‌دستی قابل توجه شجاعی در توصیف و شخصیت‌سازی بر مبنای آن را مشاهده کرد.داستان «راه خانه کجاست» از این مجموعه اما، با روایت دوم شخص، که موضوعی برخلاف موضوع تمامی داستان‌های این مجموعه دارد، روایتی است تلخ از مهاجرت ایرانیان به خارج از کشور و سوء‌استفاده نیروهای سیاسی ضد انقلاب خارج از ایران، برای برآورده شدن مطامع سیاسی‌شان.این داستان و روایت تلخ آن از پایان و فرجام یک فوتبالیست در کشوری غیر از ایران شروع می‌شود که مورد سوء‌استفاده قرار گرفته و پس از تهیه یک عکس یادگاری از او خواسته می‌شود به مصاحبه علیه نظام سیاسی کشورش بپردازد.این داستان می‌تواند آغاز خوبی برای زایش نگاه انتقادی در نویسنده‌ای باشد که در سال‌های دهه هفتاد با داستان‌های اجتماعی – انتقادی‌اش بیش از هر چیز دیگری برای مخاطبانش شناخته می‌شود. شجاعی در «راه خانه کجاست» این حقیقت را تبیین می‌کند که عشق به وطنش را تنها در مرثیه‌سرایی و بیان لحظات پر از شهامت و جسارت مردمانش در جبهه‌های نبرد جستجو نمی‌کند. او عشق به وطنش را در دل داستان‌هایش و با انتقادی عفیف و در عین حال تلخ از باورها و جریان‌های اجتماعی و فکری اشتباه و منحط وارد شده به جامعه‌اش به تصویر می‌کشد؛ تصویری که بیش از هر چیز نشانه تعصب یک نویسنده به کشورش و باورهایی است که آن را بنا کرده است و طبیعی است که او در مقام یک روشنفکر از هر نوع جریان انحرافی وارد شده به ساختار آن – در قالب داستان – انتقاد کند.",
  "genres": [],
  "author": "سیدمهدی شجاعی",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/7592229"
}