{
  "title": "The Life, Adventures, and Pyracies of the Famous Captain Singleton",
  "description": "The Life Adventures And Pyracies Of The Famous Captain Singleton is a novel written by Daniel Defoe, the author of the popular work Robinson Crusoe. The book follows the story of a young man named Bob Singleton, who becomes a pirate after being left penniless and alone in London. Singleton sets sail on a series of adventures, encountering various characters and facing numerous challenges along the way.The novel is divided into two parts, with the first part focusing on Singleton's early life and his journey to becoming a pirate. The second part follows his adventures at sea, as he and his crew travel to various locations, including Africa, Madagascar, and the West Indies. Along the way, Singleton faces battles, captures ships, and engages in various acts of piracy.Throughout the book, Defoe explores themes of morality, justice, and the human condition. He also provides a detailed account of life at sea during the 18th century, including the customs, practices, and dangers that sailors faced. The book is written in Defoe's signature style, with a focus on realism and detail.Overall, The Life Adventures And Pyracies Of The Famous Captain Singleton is a thrilling adventure story that provides a unique glimpse into the world of pirates and sailors during the 18th century.Containing an Account of his being set on Shore in the Island of Madagascar, his Settlement there, with a Description of the Place and Inhabitants.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Fiction",
    "Classics",
    "Adventure",
    "Pirates",
    "18th Century",
    "British Literature",
    "Literature"
  ],
  "author": "Daniel Defoe",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/7599366-the-life-adventures-and-pyracies-of-the-famous-captain-singleton"
}