{
  "title": "Siddhartha",
  "description": "This classic novel of self-discovery has inspired generations of seekers. With parallels to the enlightenment of the Buddha, Hesse's Siddhartha is the story of a young Brahmn's quest for the ultimate reality. His quest takes him from the extremes of indulgent sensuality to the rigors of ascetism and self-denial. At last he learns that wisdom cannot be taught - it must come from one's own experience and inner struggle. Steeped in the tenets of both psychoanalysis and Eastern mysticism, Siddhartha presents a strikingly original view of man and culture, and the arduous process of self-discovery that leads to reconciliation, harmony and peace. In the shade of a banyan tree, a grizzled ferryman sits listening to the river. Some say he's a sage. He was once a wandering shramana and, briefly, like thousands of others, he followed Gotama the Buddha, enraptured by his sermons. But this man, Siddhartha, was not a follower of any but his own soul. Born the son of a Brahmin, Siddhartha was blessed in appearance, intelligence, and charisma. In order to find meaning in life, he discarded his promising future for the life of a wandering ascetic. Still, true happiness evaded him. Then a life of pleasure and titillation merely eroded away his spiritual gains until he was just like all the other \"child people,\" dragged around by his desires. Like Hermann Hesse's other creations of struggling young men, Siddhartha has a good dose of European angst and stubborn individualism. His final epiphany challenges both the Buddhist and the Hindu ideals of enlightenment. Neither a practitioner nor a devotee, neither meditating nor reciting, Siddhartha comes to blend in with the world, resonating with the rhythms of nature, bending the reader's ear down to hear answers from the river. In this translation Sherab Chodzin Kohn captures the slow, spare lyricism of Siddhartha's search, putting her version on par with Hilda Rosner's standard edition. --Brian Bruya",
  "genres": [
    "Fiction",
    "Philosophy",
    "Spirituality",
    "Literature",
    "Classics",
    "Buddhism",
    "German Literature"
  ],
  "author": "Hermann Hesse",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/759967.Siddhartha"
}