{
  "title": "Inseparable: Desire Between Women in Literature",
  "description": "From a writer of astonishing versatility and erudition, the much-admired literary critic, novelist, short-story writer, and scholar (“Dazzling”—The Washington Post; “One of those rare writers who seems to be able to work on any register, any time, any atmosphere, and make it her own” —The Observer), a book that explores the little-known literary tradition of love between women in Western literature, from Chaucer and Shakespeare to Charlotte Brontë, Dickens, Agatha Christie, and many more. Emma Donoghue brings to bear all her knowledge and grasp to examine how desire between women in English literature has been portrayed, from schoolgirls and vampires to runaway wives, from cross-dressing knights to contemporary murder stories. Donoghue looks at the work of those writers who have addressed the “unspeakable subject,” examining whether such desire between women is freakish or omnipresent, holy or evil, heartwarming or ridiculous as she excavates a long-obscured tradition of (inseparable) friendship between women, one that is surprisingly central to our cultural history.Donoghue writes about the half-dozen contrasting girl-girl plots that have been told and retold over the centuries, metamorphosing from generation to generation. What interests the author are the twists and turns of the plots themselves and how these stories have changed—or haven’t—over the centuries, rather than how they reflect their time and society. Donoghue explores the writing of Sade, Diderot, Balzac, Thomas Hardy, H. Rider Haggard, Elizabeth Bowen, and others and the ways in which the woman who desires women has been cast as not quite human, as ghost or vampire.She writes about the ever-present triangle, found in novels and plays from the last three centuries, in which a woman and man compete for the heroine’s love . . . about how—and why—same-sex attraction is surprisingly ubiquitous in crime fiction, from the work of Wilkie Collins and Dorothy L. Sayers to P. D. James.Finally, Donoghue looks at the plotline that has dominated writings about desire between women since the late nineteenth century: how a woman’s life is turned upside down by the realization that she desires another woman, whether she comes to terms with this discovery privately, “comes out of the closet,” or is publicly “outed.”She shows how this narrative pattern has remained popular and how it has taken many forms, in the works of George Moore, Radclyffe Hall, Patricia Highsmith, and Rita Mae Brown, from case-history-style stories and dramas, in and out of the courtroom, to schoolgirl love stories and rebellious picaresques. A revelation of a centuries-old literary tradition—brilliant, amusing, and until now, deliberately overlooked.",
  "genres": [
    "Nonfiction",
    "LGBT",
    "History",
    "Queer",
    "Lesbian",
    "Feminism",
    "Literary Criticism"
  ],
  "author": "Emma Donoghue",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/7598836-inseparable"
}