{
  "title": "The Ten Commandments: How Our Most Ancient Moral Text Can Renew Modern Life",
  "description": "ACROSS THE WESTERN WORLD, the Ten Commandments have become a source of inspiration and controversy, whether in court rulings, in film and literature, or as a religious icon gracing houses of worship of every denomination. But what do they really mean? According to polls, less than half of all Americans can even name more than four of them. For most of us, agnostics and faithful alike, they have been relegated to the level of a symbol, their teachings all but forgotten. In Western life today, the Ten Commandments are everywhere--except where we need them most. In  The Ten Commandments,  David Hazony offers a powerful new look at our most venerable moral text. Combining a fresh reading of the Bible's most riveting stories with a fearless exploration of what ails society today, Hazony shows that the Ten Commandments are not just a set of obscure laws but encapsulate a valuable, relevant approach to life.  The Ten Commandments  begins with a daring Although they have become a universally recognizable symbol of biblically based religion, they are not, strictly speaking, a religious text. Rather than addressing faith or mystical realms, they contain a coherent prescription for how to make a better world. At their core stands what Hazony calls the \"spirit of redemption,\" which he describes as one of the two basic spiritual components of Western civilization. While the Greeks gave us the \"spirit of reason,\" teaching that we should be free to explore and express our views, the spirit of redemption teaches that every individual can, and should, act to improve the world. This spirit reached us from ancient Israel and has stood at the heart of the greatest social movements in our history. Going through the commandments one by one, Hazony shows how each represents a poignant declaration about honesty, the self, life, love, freedom, community, and inner peace. Each commandment adds another piece to the puzzle of how the redemptive spirit may help us become more caring, world-changing individuals.Part memoir, part scholarship, part manifesto for a vital approach to life,  The Ten Commandments  tackles some of the most painful human questions that stand at the heart of who we are as modern, thinking people--and offers answers that are sure to start a new discussion about the meaning of one of our most enduring, yet least understood, traditions.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Philosophy"
  ],
  "author": "David Hazony",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/7600286-the-ten-commandments"
}