{
  "title": "The Memoirs of Elizabeth Frankenstein",
  "description": "In The Memoirs of Elizabeth Frankenstein, Theodore Roszak offers us a subversive, erotically charged counterpart to Mary Shelley's classic, Frankenstein. It is presented in the form of a secret autobiography, a soul-baring document intended for the eyes of a single reader: Elizabeth's brother, lover, and spiritual other half—Victor Frankenstein. The writings are discovered by Sir Robert Walton, the Arctic explorer who, in Mary Shelley's original novel, recorded Victor's deathbed confession. Walton becomes obsessed with learning the full story behind the mad doctor's last words. From the tattered pages of Elizabeth's journal and the scattered clues Walton finds as he re-creates her life, a compelling tale of moral horror unfolds.In her memoirs, Elizabeth emerges as a spirited woman far ahead of her times. Rescued as a child from the Gipsies by the brilliant Lady Caroline Frankenstein, she is raised as young Victor's adopted sister. Under Lady Caroline's guidance, Elizabeth is initiated into a circle of \"cunning women\"—outsiders would call them witches—who are the guardians of long-forgotten pagan ceremonies and healing arts. She and Victor are schooled in ancient teachings that have been transmitted through female adepts who understand the mysteries of nature. The goal is two united the two in the \"chemical marriage,\" a step toward the union of all opposites that will restore the Earth to balance. The two youths pursue their education through the shadowy realms of alchemical lore and tantric sexual rites until a moment of weakness disrupts the quest. Tormented by shame and anger, Victor turns to the \"unhallowed arts\" that result in his misbegotten Creature, the vengeful fiend who will haunt Elizabeth's fatal wedding night.Of this bold, feminist retelling of Frankenstein, Theodore Roszak writes, \"In speaking through Elizabeth Frankenstein, the character Mary Shelley modeled after herself, I hope at last to give Mary the voice she was not free to adopt in her own day.\" It is the voice of a rebellious Romanticism, striking for its passionate candor, particularly in counterpoint to the words of Sir Robert Walton, the coldly analytical scientist-editor of Elizabeth's journal. This novel's rich historical texture captures the revolutionary turbulence of the Age of Reason, an era that parallels our own time with its reckless desire for unlimited progress and the total domination of nature. In its exploration of the sexual politics of modern science, The Memoirs of Elizabeth Frankenstein raises unsettling questions about man-woman relations. Both as a Gothic tale and as a tragic love story, it reminds us that the fate of the Earth is rooted in the passions of the human heart.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Historical Fiction",
    "Victor Frankenstein",
    "Science Fiction",
    "Horror",
    "Science Fiction Fantasy"
  ],
  "author": "Theodore Roszak",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/760579.The_Memoirs_of_Elizabeth_Frankenstein"
}