{
  "title": "The Illustrated Man",
  "description": "He was a riot of rockets and fountains and people, in such intricate detail and color that you could bear the voiced murmuring, small and muted, from the crowds that inhabited his body.The Illustrated ManRay Bradbury brings wonders alive. A peerless American storyteller, his oeuvre has been celebrated for decades--from The Martian Chronicles and Fahrenheit 451 to Dandelion Wine and Something Wicked This Way Comes. The Illustrated Man is classic Bradbury --a collection of tales that breathe and move, animated by sharp, intaken breath and flexing muscle. Here are eighteen startling visions of humankind's destiny, unfolding across a canvas of decorated skin--visions as keen as the tattooist's needle and as colorful as the inks that indelibly stain the body.The images, ideas, sounds and scents that abound in this phantasmagoric sideshow are provocative and powerful: the mournful cries of celestial travelers cast out cruelly into a vast, empty space of stars and blackness ... the sight of gray dust settling over a forgotten outpost on a road that leads nowhere ... the pungent odor of Jupiter on a returning father's clothing. Here living cities take their vengeance, technology awakens the most primal natural instincts, Martian invasions are foiled by the good life and the glad hand, and dreams are carried aloft in junkyard rockets.Ray Bradbury's The Illustrated Man is a kaleidoscopic blending of magic, imagination, and truth, widely believed to be one of the Grandmaster's premier accomplishments: as exhilarating as interplanetary travel, as maddening as a walk in a million-year rain, and as comforting as simple, familiar rituals on the last night of the world.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Classics",
    "Fantasy",
    "Horror",
    "Science Fiction Fantasy"
  ],
  "author": "Ray Bradbury",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/760920.The_Illustrated_Man"
}