{
  "title": "Freddy and Fredericka",
  "description": "Freddy and Fredericka will ascend the English throne only if they reacquire the American colonies and become noble spirits in an ignoble age.Helprin's latest work, an extraordinarily funny allegory of a most peculiar British royal family, is immensely mocking of contemporary monarchy and yet deeply sympathetic to the individuals caught in its lonely absurdities.Freddy is the Prince of Wales, Fredericka his troublesome wife. An overeducated, bumbling anachronism, Freddy commits one glorious gaffe after another, for which he is massacred daily in the British press. Golden-haired Fredericka, frivolous and empty headed, is particularly fond of wearing spectacular clothing with revealing necklines. Because of the epic public relations disasters caused by these wayward heirs to the throne, they are sent, in a little-known ancient tradition, on a quest to colonize a strange and barbarous America.In a tour (de force) of the United States, they are parachuted into the gleaming hell of industrial New Jersey and make their way across the country--riding freight trains, washing dishes, stealing art, gliding down the Mississippi, impersonating dentists, fighting forest fires, and becoming ineluctably enmeshed in the madness of a presidential campaign. Amid the collisions of their royal assumptions with their life on the road, they rise to their full potential, gain the dignity and humility required of great monarchs and good people, and learn to love each other.There is nothing quite like it. Helprin is a lyrical writer whose graceful prose is studded with profound truths and insights. Devoted readers know him for his deeply sad stories that are yet uplifting in their conviction of the goodness and resilience of the human spirit. In what seems like a radical departure of form (as if de Tocqueville had been rewritten by Mark Twain with a deep bow to Harpo Marx), this brilliantly refashioned fairy tale is a magnificently funny farce. But behind the laughter Helprin speaks of leaps of faith and second chances, courage and the primacy of love. He leaves us with the final impression that someone has shouted successfully past the cynicism of our postmodern age in behalf of honor, beauty, nobility, and dreams that come true.",
  "genres": [
    "Fiction",
    "Humor",
    "Contemporary",
    "Book Club",
    "Audiobook",
    "Fantasy",
    "Novels"
  ],
  "author": "Mark Helprin",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/7606452-freddy-and-fredericka"
}