{
  "title": "The Population Bomb [Paperback]",
  "description": "The Population Bomb is a best-selling book written by Stanford University Professor Paul R. Ehrlich and his wife, Anne Ehrlich (who was uncredited), in 1968. It warned of the mass starvation of humans in the 1970s and 1980s due to overpopulation, as well as other major societal upheavals, and advocated immediate action to limit population growth. Fears of a \"population explosion\" were widespread in the 1950s and 60s, but the book and its author brought the idea to an even wider audience. The book has been criticized since its publishing for its alarmist tone, and in recent decades for its inaccurate predictions. The Ehrlichs stand by the basic ideas in the book, stating in 2009 that \"perhaps the most serious flaw in The Bomb was that it was much too optimistic about the future\" and believe that it achieved their goals because \"it alerted people to the importance of environmental issues and brought human numbers into the debate on the human future.\"The Population Bomb was written at the suggestion of David Brower the executive director of the environmentalist Sierra Club, and Ian Ballantine of Ballantine Books following various public appearances Ehrlich had made regarding population issues and their relation to the environment. Although the Ehrlichs collaborated on the book, the publisher insisted that a single author be credited, and also asked to change their preferred Population, Resources, and Environment. Much of the book is spent describing the state of the environment and the food security situation, which is described as increasingly dire. Ehrlich argues that as the existing population was not being fed adequately, and as it was growing rapidly it was unreasonable to expect sufficient improvements in food production to feed everyone. He further argued that the growing population placed escalating strains on all aspects of the natural world.",
  "genres": [
    "Nonfiction",
    "Science",
    "Environment",
    "Sociology",
    "Politics",
    "History",
    "Economics"
  ],
  "author": "Paul R. Ehrlich",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/760872.The_Population_Bomb_Paperback_"
}