{
  "title": "Groucho Marx, Secret Agent",
  "description": "It could be said that in this episode Groucho Marx operates as a Hollywood-style Scarlet Pimpernel, with a repertoire of outrageous puns covering the steely, daring life of a counterspy. But, as Groucho might retort, his cover is at the dry-cleaner, and, besides, Groucho is not one to hide his light under any bushel (even one of stuffed clams). So he and Frank Denby, his sidekick, scriptwriter and close friend, set out to uphold their reputation as amateur sleuths by looking into the death of British director Eric Olmstead. First Olmstead fainted at a star-studded Halloween party after a man dressed as the Grim Reaper had whispered to him and then disappeared. But it is not until the next day that he is found dead -- presumably by his own hand.It is 1939; everyone expects the U.S. to join the war raging in Europe. And everyone is looking under the bed for spies. Soon the questions surrounding the death of Eric Olmstead takes on an odor of espionage.The police call Olmstead's death a suicide. After all, he did leave a (typed) note. His widow refuses to believe that her husband shot himself, and persuades Groucho and Frank to look further. Soon the pair is enmeshed in FBI agents and Los Angeles police, while the grieving widow clamors for revenge. Here is where Groucho proves his genius as a detective--he seizes on the clue that reveals the death to be murder.This, however, is only the beginning. There is another murder. Groucho and Frank are attacked; Frank is shot at (but not hit); Groucho is hit (but not shot at; just knocked to the floor by the fleeing assailant). They not only survive, but they pinpoint the Nazi spy and the Hollywood figures working with them.In a romp made delightful in spite of spies, murders, and occasional dire peril, Goulart uncannily resurrects the most garrulous Marx brother and his unique brand of patter. The Groucho Marx of these stories is the next best thing to the capering of the late comedian himself, and a happy gift to everyone who remembers him fondly as well as those meeting him for the first time.",
  "genres": [
    "Mystery",
    "Humor",
    "Fiction"
  ],
  "author": "Ron Goulart",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/76070.Groucho_Marx_Secret_Agent"
}