{
  "title": "Teasing Secrets from the Dead: My Investigations at America's Most Infamous Crime Scenes",
  "description": "Teasing Secrets from the Dead is a front-lines story of crime scene investigation at some of the most infamous sites in recent history. In this absorbing, surprising, and undeniably compelling book, forensics expert Emily Craig tells her own story of a life spent teasing secrets from the dead.Emily Craig has been a witness to history, helping to seek justice for thousands of murder victims, both famous and unknown. It's a personal story that you won't soon forget.Emily first became intrigued by forensics work when, as a respected medical illustrator, she was called in by the local police to create a model of a murder victim's face. Her fascination with that case led to a dramatic midlife career change: She would go back to school to become a forensic anthropologist——and one of the most respected and best-known \"bone hunters\" in the nation.As a student working with the FBI in Waco, Emily helped uncover definitive proof that many of the Branch Davidians had been shot to death before the fire, including their leader, David Koresh, whose bullet-pierced skull she reconstructed with her own hands. Upon graduation, Emily landed a prestigious full-time job as forensic anthropologist for the Commonwealth of Kentucky, a state with an alarmingly high murder rate and thousands of square miles of rural backcountry, where bodies are dumped and discovered on a regular basis. But even with her work there, Emily has been regularly called to investigations across the country, including the site of terrorist attack on the the Murrah Building in Oklahoma City, where a mysterious body part——a dismembered leg——was found at the scene and did not match any of the known victims. Through careful scientific analysis, Emily was able to help identify the leg's owner, a pivotal piece of evidence that helped convict Timothy McVeigh.In September 2001, Emily recieved a phone call summoning her to New York City, where she directed the night-shift triage at the World Trade Centre's body identification site, collaborating with forensics experts from all over the country to collect and identify the remains of September 11 victims.From the biggest new stories of our time to stranger-than-true local mysteries, these are unforgettable stories from the case files of Emily Craig's remarkable career.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Science",
    "Crime",
    "Memoir",
    "Death",
    "Anthropology"
  ],
  "author": "Emily Craig",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/761100.Teasing_Secrets_from_the_Dead"
}