{
  "title": "Groucho Marx and the Broadway Murders",
  "description": "In Ron Goulart's well received series featuring comedian-cum-amateur sleuth Groucho Marx, Groucho and his writer Frank Denby have made a name for themselves as detectives. In fact, in their last case, they were able to outsmart Sherlock Holmes, or at least the actor playing him. However, both men play down their sleuthing abilities and to escape their new reputation, Groucho agrees to perform in a Broadway play and Frank accompanies his wife on a business trip. When Groucho learns that Frank and Jane are going to New York via train he decides to join them, figuring it will be a nice relaxing journey.However, murder and mayhem somehow follow them across the country. First, before even leaving for New York they are approached by a local mobster who firmly believes that the recent murder of his associate was not a mob hit. He asks them to look into the matter and Groucho suggests that he try \"Philip Marlowe, Dan Turner or some other Hollywood shamus\" even though \"they don't have our track record...or a strawberry birthmark right here.\" From there, things only get more interesting. On the train they meet Dian Bowers, the newest star of Daniel Manheim, a domineering Hollywood producer. A series of bizarre events unfolds on the train, including an attempt on Manheim's life. When they arrive in New York, Groucho agrees to escort Dian to the premiere of her estranged husband's play, but the play never makes it into the second act because a body is discovered on stage. When Dian's husband becomes the prime suspect, Groucho and Frank once again find themselves playing detective. Searching for clues in the Big Apple and trying to see if the second murder is at all connected to the death of the mobster, Groucho and Frank have their hands full. However, the pressure doesn't get to Groucho and as he hunts for clues he still has time for all of his silly gags and terrible puns. Whether or not you are a Groucho fan, \"this enjoyable little tale will charm the baggy pants off you.\"",
  "genres": [
    "Mystery",
    "Humor",
    "Fiction",
    "Detective",
    "Cozy Mystery"
  ],
  "author": "Ron Goulart",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/76046.Groucho_Marx_and_the_Broadway_Murders"
}