{
  "title": "The Revisionist Theory of the “Liberation” of Science From Ideology",
  "description": "In the pamphlet “The Revisionist Theory of the ‘Liberation’ of Science From Ideology”, M.D. Kammari exposes the common bourgeois claim that social science is independent of class. He affirms the materialist truth on knowledge, which points about that in society divided into classes, specifically when the old is going out of being and the new has yet to come into being, the ruling class necessarily distorts reality to retain its grip on the society, while the oppressed classes, which are bound to constitute themselves the nation, holds the scientific worldview in its hands because it sees in its future human progress, its outlook is not centred on retaining privileges but effecting change. Bourgeois sociology promotes itself to be a “science without class” in the name of higher values, and ideally this would be true, but it is a matter of recognizing and studying the facts of life, and in this moribund class society of exploitation and oppression nothing is independent of class. This fact is extended to many fields of life which are also political. The bourgeoisie knows this, and therefore it promotes eclecticism to mystify and confuse the revolutionary proletariat and dull its scientific worldview — today it even unleashes a post-modernist offensive on all objective knowledge in claiming that everything is relative and subjective — that different races, ethnicities, genders, sexualities, etc. have their own “knowledge”, which is said to be just as true as the “knowledge” of the other categories. This is used to obfuscate the class character of social science by pitting sections of the proletariat in theoretical opposition to one another.The renegades from Marxism have always held the precise point of view of the bourgeoisie, and here Kammari exposes the Yugoslav and Polish revisionist theoreticians who capitulated to western “sociology”, lamenting Marxist social science for its “rigidity” and “opening up” their countries. These revisionists served as agents for the penetration of alien ideologies in their countries. Our study of science is necessarily bound up with the class struggle leading up to the dictatorship of the proletariat and the complete construction of classless communist society.NEPH hopes this material is considered timely by its readers as the Marxist-Leninist Communists worldwide attempt to grapple with the issue of bourgeois mystification in the sciences. How to actively smash this blindfold is a question put up for solution today.",
  "genres": [],
  "author": "M.D. Kammari",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/76176037-the-revisionist-theory-of-the-liberation-of-science-from-ideology"
}