{
  "title": "Piece by Piece",
  "description": "I choose to fight my battles through my music . . . I was born a feminist. And then at age five, when my strict Christian grandmother punished me, I realized, I’m not penetrating here. I’m just pissing people off. So I had to find another way to penetrate. I had to redefine what that word means. That word now is really about an opening, an entering into a separate space. And after the first phase of my life, I realized that it was okay to enter that space without having to be invaded . . . I like the idea of just being able to be inside. Not using penetration as a violent word. The idea of being able to find keys . . . music, using keys to get into a space that we couldn’t before . . .Now, backstage at an undisclosed arena where the sweat of athletes is still perfuming my makeshift dressing room, my many conversations with Ann Powers have begun . . . “You come from the journalist side. I come from the artist side. It can become offensive. I’m sure from your side as well as from mine.” “Well, it’s true everyone expects us to be enemies. And in some ways we are. My job is interpretation. Yours is art, which often benefits from mystery . . .”\"Ann and I decided to strip our roles back to basics. We are both women born feminists in the 1960s. We are both married. We are both mothers. We are both in the music industry. Traditionally we are enemies. But for this project to be effective, I had to allow Ann to expose Tori Amos. And Tori Amos’s inner circle. And me.” –from the IntroductionAn intimate, eye-opening look inside the life of one of the most unique and adored performers of contemporary rock musicFrom her critically acclaimed 1992 debut, Little Earthquakes, to the recent hit, Scarlet’s Walk, Tori Amos has been a formidable force in contemporary music, with one of the most dedicated fan bases in the industry. In Tori Amos: Piece by Piece, the singer herself takes readers beyond the mere facts, explaining the specifics of her creative process—how her songs go from ideas and melodies to recordings and passionately performed concert pieces. Written with acclaimed music journalist Ann Powers, Tori Amos: Piece by Piece is a firsthand account of the most intricate and intimate details of Amos’s life as both a private individual and a very public performing musician. In passionate and informative prose, Amos explains how her songs come to her and how she records and then performs them for audiences everywhere, all the while connecting with listeners across the world and maintaining her own family life (which includes raising a young daughter). But it is also much more, a verbal collage made by two strong female voices—and the voices of those closest to Amos—that calls upon genealogy, myth, and folklore to express Amos’s unique and fascinating personal history. In short, we see the pieces that make up, as Amos herself puts it, “the woman we call Tori.”With photos taken especially for this book by the photographer Loren Haynes, Tori Amos: Piece by Piece is a rare treat for both Tori listeners and newcomers alike, a look into the heart and mind of an extraordinary musician.",
  "genres": [
    "Nonfiction",
    "Music",
    "Biography",
    "Memoir",
    "Feminism",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Tori Amos",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/76150.Piece_by_Piece"
}