{
  "title": "'Tis Herself",
  "description": "You are about to read the tale of the toughest Irish lass who ever took on Hollywood and became a major leading lady....In a career that has lasted more than sixty years, I have acted, punched, swashbuckled, and shot my way through an absurdly masculine profession....As a woman, I'm proud to say that I stood toe-to-toe with the best of them and made my mark on my own terms. I'm Maureen O'Hara and this is my life story.-- From Chapter One of 'Tis HerselfIn language that is blunt, straightforward, and totally lacking in artifice, Maureen O'Hara, one of the greatest and most enduring stars of Hollywood's \"Golden Era,\" for the first time tells the story of how she succeeded in the world's most competitive business.Known for her remarkable beauty and her fiery screen persona, Maureen O'Hara came to Hollywood when she was still a teenager, taken there by her mentor, the great actor Charles Laughton. Almost immediately she clashed with the men who ran the movie business -- the moguls who treated actors like chattel, the directors who viewed every actress as a potential bedmate.Determined to hold her own and to remain true to herself, she fought for roles that she wanted and resisted the advances of some of Hollywood's most powerful and attractive men. It was in the great director John Ford that she first found someone willing to give her a chance to prove herself as an important actress. Beginning with the Academy Award-winning How Green Was My Valley, she went on to make five films with Ford and through him first met the great John Wayne, with whom she also made five films.In O'Hara, Ford had found his ideal Irish heroine, a role that achieved its greatest realization in The Quiet Man. And in O'Hara, John Wayne found his ideal leading lady, for she was perhaps the only actress who could hold her own when on screen with \"The Duke.\" Ford, however, was not without his quirks, and his relationship with his favorite actress became more and more complex and ultimately deeply troubled. The on-screen relationship between Wayne and O'Hara, on the other hand, was transformed into a close friendship built on mutual respect, creating a bond that endured until his death.Writing with complete frankness, O'Hara talks for the first time about these remarkable men, about their great strengths and their very human failings. She writes as well about many of the other actors and actresses -- Lucille Ball, Tyrone Power, Errol Flynn, John Candy, Natalie Wood, to name a few -- with whom she worked, but ultimately it is about herself that she is most revealing. With great candor and a mixture of pride and regret, she reflects on just how this young girl from Ireland made it to America and onto movie screens all around the world. There were missteps, of course -- a troubled and deeply destructive marriage, a willingness to trust too readily in others -- but there were triumphs and great happiness as well, including her marriage to the aviation pioneer Brigadier General Charles F. Blair, who tragically died in a mysterious plane crash ten years after their marriage.Throughout, 'Tis Herself is informed by the warmth and charm and intelligence that defined Maureen O'Hara's performances in some sixty films, from The Hunchback of Notre Dame to Miracle on 34th Street to The Parent Trap to McLintock! to Only the Lonely. 'Tis Herself is Maureen O'Hara's story as only she can tell it, the tale of an Irish lass who believed in herself with the strength and determination to make her own dreams come true.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Memoir",
    "Film",
    "Biography Memoir",
    "Media Tie In"
  ],
  "author": "Maureen O'Hara",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/761647._Tis_Herself"
}