{
  "title": "The Cloister and the Hearth",
  "description": "This historic book may have numerous typos and missing text. Purchasers can usually download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1861 edition. ...dignitary, spread Peter's fame in every street; and that artist, who had long merited a reputation in vain, made one rapidly by luck. Things looked bright. The old man's pride was cheered at last, and his purse began to fill. He spent much of his gain, however, in sovereign herbs and choice drugs, and would have so invested them all, but Margaret white-mailed a part. The victory came too late. The happy excitement was fatal. One evening, in bidding her good-night, his voice seemed rather inarticulate. The next morning he was found speechless, and only just sensible. Margaret, who had been for years her father's attentive pupil, saw at once that he had had a paralytic stroke. But not trusting to herself, she ran for a doctor. One of those, who, obstructed oy Peter, had not killed the civic dignitary, came, nd cheerfully confirmed her views. He was for bleeding the patient. She declined. 'He was always against bleeding,' said she, 'especially the old.' Peter lived, but was never the same man again. His memory became much affected, and of course he was not to be trusted to and several patients had come, and one or two, that were bent on being cured by the new doctor and no other, awaited his convalescence. Misery stared her in the faee. She resolved to go for advice and comfort io her cousin \"William Johnstone, from whom she had hitherto kept aloof out of pride and poverty. She found him and his servant sitting in the same room, and neither of them the better for liquor. Mastering all signs of surprise, sho gave her greetings, and presently told him she had come to talk on a family maiter and with this glanced quietly at the servant by way of hint. The woman took it, but not aa expected. 'Oh, you can speak before me,...",
  "genres": [
    "Historical Fiction",
    "Classics",
    "Fiction",
    "Romance",
    "Victorian",
    "Literature",
    "Adventure"
  ],
  "author": "Charles Reade",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/13060785-the-cloister-and-the-hearth"
}