{
  "title": "The Big Bang Symphony: A Novel of Antarctica",
  "description": "Antarctica is a vortex that draws you back, season after season. The place is so raw and pure, all seal hide and crystalline iceberg. The fishbowl communities at McMurdo Station, South Pole Station, and in the remote field camps intensify relationships, jack all emotion up to a 10. The trick is to get what you need and then get out fast.    At least that’s how thirty-year-old Rosie Moore views it as she flies in for her third season on the Ice. She plans to avoid all entanglements, romantic and otherwise, and do her work as a galley cook. But when her flight crash-lands, so do all her plans.    Mikala Wilbo, a brilliant young composer whose heart—and music—have been frozen since the death of her partner, is also on that flight. She has come to the Ice as an artist-in-residence, to write music, but also to secretly check out the astrophysicist father she has never met.    Arriving a few weeks later, Alice Neilson, a graduate student in geology who thinks in charts and equations, is thrilled to leave her dependent mother and begin her career at last. But from the start she is aware that her post-doc advisor, with whom she will work in Antarctica, expects much more from their relationship.    As the three women become increasingly involved in each other’s lives, they find themselves deeply transformed by their time on the Ice. Each falls in love. Each faces challenges she never thought she would meet. And ultimately, each finds redemption in a depth and quality of friendship that only the harsh beauty of Antarctica can engender.  Finalist, Lambda Literary Awards Finalist, Ferro-Grumley Award for LGBT Fiction, awarded by the Publishing Triangle Finalist, Northern California Independent Booksellers Association Honorable Mention, Foreword Magazine ’s Gay/Lesbian Fiction Book of the Year Best Books for General Audiences, selected by the Public Library Association",
  "genres": [
    "Fiction",
    "LGBT",
    "Lesbian",
    "Queer",
    "Travel",
    "Historical Fiction",
    "Literary Fiction"
  ],
  "author": "Lucy Jane Bledsoe",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/7616904-the-big-bang-symphony"
}