{
  "title": "Pornland: How Porn Has Hijacked Our Sexuality",
  "description": "Professor Gail Dines has written about and researched the porn industry for over two decades. She attends industry conferences, interviews producers and performers, and speaks to hundreds of men and women each year about their experience with porn. Students and educators describe her work as \"life changing.\"In Pornland —the culmination of her life's work—Dines takes an unflinching look at porn and its affect on our lives. Astonishingly, the average age of first viewing porn is now 11.5 years for boys, and with the advent of the Internet, it's no surprise that young people are consuming more porn than ever. But, as Dines shows, today's porn is strikingly different from yesterday's Playboy . As porn culture has become absorbed into pop culture, a new wave of entrepreneurs are creating porn that is even more hard-core, violent, sexist, and racist. To differentiate their products in a glutted market, producers have created profitable niche products—like teen sex, torture porn, and gonzo—in order to entice a generation of desensitized users.Going from the backstreets to Wall Street, Dines traces the extensive money trail behind this multibillion-dollar industry—one that reaps more profits than the film and music industries combined. Like Big Tobacco—with its powerful lobbying groups and sophisticated business practices—porn companies don't simply sell products. Rather they influence legislators, partner with mainstream media, and develop new technologies like streaming video for cell phones. Proving that this assembly line of content is actually limiting our sexual freedom, Dines argues that porn's omnipresence has become a public health concern we can no longer ignore.Going from the backstreets to Wall Street, Dines reveals how porn is affecting our lives and why its omnipresence is detrimental to our sexual freedom.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Sexuality",
    "Psychology",
    "Sociology",
    "Gender",
    "Politics"
  ],
  "author": "Gail Dines",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/7621071-pornland"
}