{
  "title": "How to Live: A Life of Montaigne in One Question and Twenty Attempts at an Answer",
  "description": "How to get on well with people, how to deal with violence, how to adjust to losing someone you love--such questions arise in most people's lives. They are all versions of a bigger question: how do you live? How do you do the good or honourable thing, while flourishing and feeling happy? This question obsessed Renaissance writers, none more than Michel Eyquem de Montaigne (1533-92), perhaps the first truly modern individual. A nobleman, public official, and wine-grower, he wrote free-roaming explorations of his thought and experience, unlike anything written before. He called them 'essays', meaning 'attempts' or 'tries'. Into them he put whatever was in his head: his tastes in wine and food, his childhood memories, the way his dog's ears twitched when dreaming, as well as the appalling events of the religious civil wars raging around him. The Essays was an instant bestseller, and more than four hundred years later, Montaigne's honesty and charm still draw people to him. Readers come to him in search of companionship, wisdom and entertainment--and in search of themselves. This book, a spirited and singular biography (and the first full life of Montaigne in English for nearly fifty years), relates the story of his life by way of the questions he posed and the answers he explored. It traces his bizarre upbringing (made to speak only Latin), youthful career and sexual adventures, travels, and friendships with the scholar and poet Etienne de La Boétie and with his adopted 'daughter', Marie de Gournay. And as we read, we also meet his readers--who for centuries have found in Montaigne an inexhaustible source of answers to the haunting question, 'how to live?'",
  "genres": [
    "Philosophy",
    "Biography",
    "Nonfiction",
    "History",
    "Essays",
    "Biography Memoir",
    "France"
  ],
  "author": "Sarah Bakewell",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/7624457-how-to-live"
}