{
  "title": "Our Friends Beneath the Sands: The Foreign Legion in France's Colonial Conquests 1870-1935",
  "description": "A superb follow up to The Last Valley, Windrow paints a wonderfully vivid portrait of the Foreign Legion's exploits during the turbulent years of French imperial expansion.' Saul DavidMartin Windrow is at once a connoisseur of the Legion, a master of the battle narrative, and a painstaking scholar, a hat trick of talents that combine to make Our Friends Beneath the Sands a riveting and enlightening read.' Douglas Porch, author of The French Foreign A Complete History`Windrow's great strength lies in explaining not just what happened in a battle, but why and how it happened...excellent photographs.' James Delingpole`Astounding...meticulous historical research combined with wonderful story-telling.'Brigadier Tony Hunter-Choat, Hon. Sec. Foreign Legion Association, GBEver since the 1920s the popular legend of the French Foreign Legion has been formed by P.C. Wren's novel Beau Geste - a world of remote forts, warrior tribes, and desperate men of all nationalities enlisting under pseudonyms to fight and die under the desert sun.As with all cliches, the reality is far richer and more surprising than this. In this book Martin Windrow describes desert battles and famous last stands in gripping detail---but he also shows exactly what the Foreign Legion were doing in North Africa in the first place. He explains how French colonial methods there actually, had their roots in the jungles of Vietnam, and how the political pressures that kept the empire expanding can be traced to battles on the streets of Paris itself. His description of the Berber tribesmen of Morocco also reveals some disturbing modern the formidable guerrillas of the 1920s were inspired by an Islamic fundamentalist who was adept at using the world's media to further his cause.This unique book is the first to examine the `golden age' of the Foreign Legion in such detail Martin Windrow has been studying the Legion for forty years, and is the first English writer to travel throughout Morocco locating and examining some of their desert and mountain battlefields. His meticulous, research and vivid writing will make this the last word on what remains one of the most famous military organizations in the World.",
  "genres": [
    "History",
    "Military History",
    "France",
    "Northern Africa",
    "Nonfiction",
    "War"
  ],
  "author": "Martin Windrow",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/7623011-our-friends-beneath-the-sands"
}