{
  "title": "The Lake Shore Limited",
  "description": "Four unforgettable characters beckon you into this spellbinding new novel from Sue Miller, the author of 2008’s heralded best seller The Senator’s Wife. First among them is Wilhelmina—Billy—Gertz, as small as a child, fiercely independent, powerfully committed to her work as a playwright. The story itself centers on The Lake Shore Limited—a play Billy has written about an imagined terrorist bombing of that train as it pulls into Union Station in Chicago, and about a man waiting to hear the fate of his estranged wife, who is traveling on it. Billy had waited in just such a way on 9/11 to hear whether her lover, Gus, was on one of the planes used in the attack.The novel moves from the snow-filled woods of Vermont to the rainy brick sidewalks of Boston as the lives of the other characters intersect and interweave with Billy’s: Leslie, Gus’s sister, still driven by grief years after her brother’s death; Rafe, the actor who rises to greatness in a performance inspired by a night of incandescent lovemaking; and Sam, a man irresistibly drawn to Billy after he sees the play that so clearly displays the terrible conflicts and ambivalence of her situation.How Billy has come to create the play out of these emotions, how it is then created anew on the stage, how the performance itself touches and changes the other characters’ lives—these form the thread that binds them all together and drives the novel compulsively forward.A powerful love story; a mesmerizing tale of entanglements, connections, and inconsolable losses; a marvelous reflection on the meaning of grace and the uses of sorrow, in life and in art: The Lake Shore Limited is Sue Miller at her dazzling best.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Audiobook",
    "Book Club",
    "Relationships",
    "Novels"
  ],
  "author": "Sue Miller",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/7624512-the-lake-shore-limited"
}