{
  "title": "Drachenwächter - Die Prophezeiung",
  "description": "Sie sind mitten unter uns........Um Drachen ranken sich unzählige Geschichten, Mythen und Legenden.Falko Löffler, Autor des Buches „Drachenwächter“, jedoch lässt sie existieren.Erstaunlich - es ist fast so als hätte man diesen schuppigen, feuerspeienden und fliegenden Wesen Atem eingehaucht.Mit lebendiger Sprache erzählt der Autor eine spannende und aufregende Geschichte über Wahrheit und Intrige- Mensch und Drache und schnell nehmen die fantastischen Wesen Gestalt an.Selten gelingt ein Meisterwerk mit Höhen und Tiefen in diesem Stile. Da bleibt nur noch auf eine Fortsetzung zu hoffen.Auszug aus dem ersten Der Mann folgte der Frau, die dem Tod geweiht war.Als die Sonne über die Berggipfel stieg und ihr Licht über die Ebene vor der Gebirgskette kroch, ging die Frau den Felshang hinauf zu den Drachen. Sie trug ein weißes, reich besticktes Kleid und Schuhe aus feinem Leder, ihr Haar war zu einem Zopf geflochten. Von hoch oben drang das Schnaufen der Drachen und das Kratzen ihrer Krallen auf dem blanken Felsen zu ihr herab. Gegen das Licht der Morgensonne zeichneten sich die Silhouetten der geflügelten Drachen auf den Gebirgskämmen ab.Der Mann folgte ihr in gebührendem Abstand, und wenn sie innehielt, um zu Atem zu kommen, blieb auch er stehen. Nicht ein einziges Mal schaute die Frau zurück. Vielleicht wusste sie, dass sie verfolgt wurde, doch wenn, schien es sie nicht zu bekümmern.Ein kalter Wind jagte den Berghang hinab und ließ ihr Kleid wie die Fahne auf einer Turmzinne nach hinten wehen. Der Mann legte beim Aufstieg seine Arme eng an den Körper, damit sie ihm ein wenig Wärme spendeten.Er ging weiter, bergan, Schritt für Schritt. Schließlich bemerkte der Mann, dass er in einen Schatten getreten war, und hob den Kopf.Über ihm ragten Drachen auf.Auf einem Plateau knapp unterhalb des Gipfels befand sich der Mann. Eine Wand golden glänzender Schuppen ragte vor ihm in die Höhe – unzählige Drachen hatten einen Kreis um ihn und die Frau geschlossen und blickten auf ihn herab.",
  "genres": [
    "Fantasy"
  ],
  "author": "Falko Löffler",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/7620286-drachenw-chter---die-prophezeiung"
}