{
  "title": "Furious Love: Elizabeth Taylor, Richard Burton, and the Marriage of the Century",
  "description": "The definitive story of Hollywood's most famous couple.He was a tough-guy Welshman softened by the affections of a breathtakingly beautiful woman; she was a modern-day Cleopatra madly in love with her own Mark Antony. For nearly a quarter of a century, Elizabeth Taylor and Richard Burton were Hollywood royalty, and their fiery romanceoften called \"the marriage of the century\"was the most notorious, publicized, and celebrated love affair of its day.For the first time, Vanity Fair contributing editor Sam Kashner and acclaimed biographer Nancy Schoenberger tell the complete story of this larger-than-life couple, showing how their romance and two marriages commanded the attention of the world. Also for the first time, in exclusive access given to the authors, Elizabeth Taylor herself gives never-revealed details and firsthand accounts of her life with Burton.Drawing upon brand-new information and interviewsand on Burton's private, passionate, and heartbreaking letters to TaylorFurious Love sheds new light on the movies, the sex, the scandal, the fame, the brawls, the booze, the bitter separations, and, of course, the fabled jewels. It offers an intimate glimpse into Elizabeth and Richard's privileged world and their elite circle of friends, among them Princess Grace, Montgomery Clift, the Duke and Duchess of Windsor, Peter O'Toole, Michael Caine, Marlon Brando, Rex Harrison, Mike Nichols, Laurence Olivier, Robert Kennedy, Tennessee Williams, Noël Coward, John Huston, Ava Gardner, the Rothschilds, Maria Callas, and Aristotle Onassis. It provides an entertaining, eye-opening look at their films, their wildly lucrative reign in Europe and in Hollywoodand the price they paid for their extravagant lives.Shocking and unsparing in its honesty, Furious Love explores the very public marriage of \"Liz and Dick\" as well as the private struggles of Elizabeth and Richard, including Le Scandale, their affair on the set of the notorious epic Cleopatra that earned them condemnation from the Vatican; Burton's hardscrabble youth in Wales; the crippling alcoholism that nearly destroyed his career and contributed to his early death; the medical issues that plagued both him and Elizabeth; and the failed aspirations and shame that haunted him throughout their relationship. As Kashner and Schoenberger illuminate the events and choices that shaped this illustrious couple's story, they demonstrate how the legendary pair presaged America's changing attitudes toward sex, marriage, morality, and celebrity. Yet ultimately, as the authors show, Elizabeth and Richard shared something priceless beyond the drama: enduring love.Addictive and entertaining, Furious Love is more than a celebrity biography; it's an honest yet sympathetic portrait of a man, a woman, and a passion that shocked and mesmerized the world.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Romance",
    "Biography Memoir",
    "Memoir",
    "Film"
  ],
  "author": "Sam Kashner",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/7625089-furious-love"
}