{
  "title": "Between a Heart and a Rock Place: A Memoir",
  "description": "For more than thirty years, Pat Benatar has been one of the most iconic women in rock music, with songs like \"Heartbreaker,\" \"Hit Me with Your Best Shot,\" and \"Love Is a Battlefield\" becoming anthems for multiple generations of fans. Now, in this intimate and uncompromising memoir, one of the bestselling female rock artists of all time shares the story of her extraordinary career, telling the truth about her life, her struggles, and how she won things—her way.   From her early days in the New York club scene of the 1970s to headlining sold-out arena tours, Benatar offers a fascinating account of a life spent behind the microphone. As the first female artist ever to be played on MTV, she speaks candidly about the realities of breaking into the boys' club of rock and roll at a time when people everywhere still believed a woman's only place in popular music was as a girlfriend, a groupie, or a sex symbol. And though her fiery edge and aggressive swagger produced instant success, they also led to fights over her image that would linger for years to come.   Going backstage and into the studio, Benatar sets the record straight about how her music evolved, illustrating the visionary role that her guitarist, producer, and eventual husband, Neil \"Spyder\" Giraldo, played in combining her classically trained voice with razor-sharp guitar to create her unique hard-rock sound. Together they formed a musical and spiritual bond that would last a lifetime, helping her stay true to herself while avoiding the pitfalls and excesses of rock stardom.   Written with the attitude and defiance that embodies Pat Benatar's music, Between a Heart and a Rock Place is a rock-and-roll story unlike any other, a remarkable tale of playing by your own rules, even if that means breaking a few of theirs.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "Musicians"
  ],
  "author": "Pat Benatar",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/7626684-between-a-heart-and-a-rock-place"
}