{
  "title": "The Hypnotist",
  "description": "In 1906, San Francisco has reached the peak of its golden age. Fortunes have created a society that attracts European opera singers and cordon bleu chefs. It is a world defined by elegant balls, oysters, and champagne. But there are darker sides to the city as well. One of these darker places is The Mission district south of Market Street houses tenements where shanties huddle together and rats plague the streets. And nearby sits Chinatown, an endless warren of dark alleys that offers gambling, prostitution, and opium, all controlled by vicious gangs, called tongs. Into these disparate worlds steps Marta Baldwin, a young woman who has shunned her own social background to help the poor. She is confronted by a hypnotist, a man who hypnotizes young women from the tenements and delivers them to the tongs in Chinatown to work in their brothels. Marta escapes his hypnotic trance, but when her assistant, Missy, disappears, Marta realizes she has been taken by the evil man who confronted her. She seeks the help of Byron Wagner, one of San Francisco's most prominent citizens. Marta finds herself drawn to Byron but knows his high social standing prevents any possibility of a relationship between them. This is confirmed when Marta discovers Byron having an intimate conversation with Lillie Collins, the daughter of one of the city's most elite families. Marta is flushed with jealousy. However, Lillie defies social customs, and her rebellious nature fits naturally with Marta's. Despite her envy, the two women become close friends. Marta is caught up in a whirlwind of opulent balls, opium dens and brothels, and police raids in Chinatown. She cannot deny her feelings for Byron, but she must save Missy and protect her new friends from harm. For lurking in the background is the hypnotist. He has become obsessed with Marta and will use all his guile to ensnare her. When he threatens those she loves, Marta is determined to stop him, even at her own peril. Will her boldness entrap her? If so, how can she hope to escape the man's hypnotic embrace? Then the earth moves, and nothing will ever be the same again.",
  "genres": [
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Gordon Snider",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/7627126-the-hypnotist"
}