{
  "title": "Graham",
  "description": "This edition cancelled by the publisher.Their love defied king and clan…  Battle scarred, war hardened, and ruthless when it comes to the welfare of his people, Graham MacCleod is determined to gain back for his clan the stability and wealth stolen from them. Marriage to the MacKintosh Miracle is the first step in his plan. That the Laird MacKintosh doesn’t regard Graham as a worthy suitor for his spoiled daughter is a minor hurdle. The MacCleods didn’t earn their fierce reputation as the Black Raiders by cowering at a challenge. MacCleods fight for what they want. Not that Mary MacKintosh’s kidnapping was much of a fight. The rebellion the laird let flourish in his daughter dropped her right into Graham’s lap. Kidnapping her was as easy as snatching her out of the pond. Keeping her will be equally as simple. Or so he thinks.  Stunning. Intelligent. A prize beyond price. Mary MacKintosh has heard it all as sole heiress to the MacKintosh Clan’s fortune and political power. From birth, she’s known her responsibility. In these unstable times, she must secure her clan’s position within both the Scottish and English courts by marrying well. The only problem is that none of the bachelors her father has gathered at the castle are men who have what it will take to fulfill her duty. She needs a man with a strong arm and a strong sense of purpose. One whose dedication surpasses his greed. One who understands the concept of loyalty the way a MacKintosh does. She needs a man she is very afraid does not exist.  But when, on the eve of her engagement announcement, Mary is kidnapped by the infamous Black Raider, her perspective changes as fast as her circumstances. Graham MacCleod isn’t anything like she’d expected. Fair and balanced in his approach, Graham is a Scottish warrior to the bone. From captor to husband, he takes her along a journey that both liberates her spirit and convinces her that she might just have found the man both she and her people need. If her father and the crown can be convinced…",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Erotica",
    "Erotic Romance"
  ],
  "author": "Sarah McCarty",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/7626808-graham"
}