{
  "title": "Oprah",
  "description": "For the past twenty-five years, no one has been better at revealing secrets than Oprah Winfrey. On what is arguably the most influential show in television history, she has gotten her guests—often the biggest celebrities in the world—to bare their love lives, explore their painful pasts, admit their transgressions, reveal their pleasures, and explore their demons. In turn, Oprah has repeatedly allowed her audience to share in her own life story, opening up about the sexual abuse in her past and discussing her romantic relationships, her weight problems, her spiritual beliefs, her charitable donations, and her strongly held views on the state of the world.After a quarter of a century of the Oprah-ization of America, can there be any more secrets left to reveal? Yes. Because Oprah has met her match.Kitty Kelley has, over the same period of time, fearlessly and relentlessly investigated and written about the world’s most revered Jacqueline Kennedy Onassis, Frank Sinatra, Nancy Reagan, England’s Royal Family, and the Bush dynasty. In her #1 bestselling biographies, she has exposed truths and exploded myths to uncover the real human beings that exist behind their manufactured facades.Turning her reportorial sights on Oprah, Kelley has now given us an unvarnished look at the stories Oprah’s told and the life she’s led. Kelley has talked to Oprah’s closest family members and business associates. She has obtained court records, birth certificates, financial and tax records, and even copies of Oprah’s legendary (and punishing) confidentiality agreements. She has probed every aspect of Oprah Winfrey’s life, and it is as if she’s written the most extraordinary segment of The Oprah Winfrey Show ever filmed—one in which Oprah herself is finally and fully revealed.There is a case to be made, and it is certainly made in this book, that Oprah Winfrey is an important, and even great, figure of the twentieth and twenty-first centuries. But there is also a case to be made that even greatness needs to be examined and put under a microscope. Fact must be separated from myth, truth from hype. Kitty Kelley has made that separation, showing both sides of Oprah as they have never been shown before. In doing so she has written a psychologically perceptive and meticulously researched book that will surprise and thrill everyone who reads it.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "Audiobook",
    "Autobiography",
    "Tv",
    "Memoir"
  ],
  "author": "Kitty Kelley",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/7625632-oprah"
}