{
  "title": "The Addams Family: An Evilution",
  "description": "The ‘evilution’ of Charles Addams's singularly eccentric family began long before the television and film interpretations made them icons of American popular culture. Addams first created Morticia, Lurch, and The Thing in a cartoon published in a 1938 issue of the New Yorker —though he hadn't named them at the time, or even conceived of a family unit. (When he did name the deadly matriarch, he was inspired by the Yellow Pages listing for ‘Morticians.’) Other characters were born and developed in a multitude of Addams's cartoons over the next twenty-six years, before the cheerfully creepy clan debuted on ABC television in 1964 and later on the big screen, twice, in 1991 and 1993. The Addams An Evilution is the first book to trace The Addams Family history, presenting more than 200 cartoons created by Charles Addams (American, 1912-1988) throughout his prolific career; many have never been published before. Text by H. Kevin Miserocchi, director of the Tee and Charles Addams Foundation, offers a revealing chronology of each character's evolution (for instance, did you know that Addams originally named Pugsley ‘Pubert’?), while Addams's own incisive character descriptions, originally penned for the benefit of the television show producers, introduce each chapter. As the presence of the Family continues to permeate generation after generation, and in celebration of the Broadway musical debuting in 2010, this book reminds us where these oddly lovable characters came from and, in doing so, offers a lasting tribute to one of America's greatest humorists. A phenomenon of rare proportion, The Addams Family is the manifestation of one artist's dark but irresistible wit, expressed with an uncommonly deft hand. 224 pages with more than 200 cartoons (approximately 50 are published here for the first time), many in color. Ten chapters explore each Addams Family character, as well as their mansion (a “House To Die For”). 8 x 10 inches. Smyth-sewn casebound book with jacket.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Nonfiction",
    "Humor",
    "Horror",
    "Art",
    "History"
  ],
  "author": "Charles Addams",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/7626588-the-addams-family"
}