{
  "title": "Classic Indian Cooking",
  "description": "This extraordinary cookbook, Classic Indian Cooking , amounts to a complete course in Indian cuisine. Elucidated by over 100 line drawings, it systematically introduces the properties of all the basic spices and special ingredients of Indian food, then explains the techniques employed in using them, always with the help of comparisons to familiar Western methods. It is immediately obvious that Indian food is rich and varied, yet not difficult to prepare. The cooking principles are basic and wellknown. The utensils needed are few and simple. As Julie Sahni says, \"If you know how to fry, there are few tricks to Indian food.\" Every recipe has been especially designed for the American kitchen -- practically all the ingredients can be found in any American supermarket and there are scores of time-saving shortcuts with the food processor and handy directions for ahead-of-time preparation. Following a lively and absorbing introduction to the history of India's classic Moghul cuisine, Julie guides the cook through the individual components that make up an Indian meal. She begins with delicious appetizers like Crab Malabar and Hyderabad lime soup; continues through main courses, both nonvegetarian and vegetarian (this book is a treasure trove for the non-meat eater); goes on to all the side dishes and traditional accompaniments, from spinach raita and lentils with garlic butter to saffron pilaf and whole wheat flaky bread; and ends with the glorious desserts, like Ras Malai , sweetmeats, and beverages. Clear, illustrated, step-by-step instructions accompany the cook through every stage, even for making the many wondrous Indian breads, both by hand and with the food processor. And at the end of each recipe are balanced serving suggestions for every kind of meal, Among the many special features are ideas for appropriate wines, a useful spice chart, a complete glossary (which might also come in handy when ordering in Indian restaurants), and a mailorder shopping guide that will make Indian spices accessible anywhere. Most important, Julie Sahni imparts the secrets to mastering the art of Indian cooking. Even the beginner will quickly learn to move within the classic tradition and improvise with sureness and ease. Julie Sahni has written a masterpiece of culinary instruction, as readable as it is usable, a joy to cook from, a fascination to read.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "India",
    "Reference",
    "Culinary"
  ],
  "author": "Julie Sahni",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/1033177.Classic_Indian_Cooking"
}