{
  "title": "Island of Vice: Theodore Roosevelt's Doomed Quest to Clean up Sin-loving New York",
  "description": "A ROLLICKING NARRATIVE HISTORY OF THEODORE ROOSEVELT'S EMBATTLED TENURE AS POLICE COMMISSIONER OF CORRUPT, PLEASURE-LOVING NEW YORK CITY IN THE 1880s, AND HIS DOOMED MISSION TO WIPE OUT VICEIn the 1890s, New York City was America’s financial, manufacturing, and entertainment capital, and also its preferred destination for sin, teeming with 40,000 prostitutes, glittering casinos, and all-night dives packed onto the island’s two dozen square miles. Police captains took hefty bribes to see nothing while reformers writhed in frustration.     In Island of Vice, bestselling author Richard Zacks paints a vivid picture of the lewd underbelly of 1890s New York, and of Theodore Roosevelt, the cocksure crusading police commissioner who resolved to clean up the bustling metropolis, where the silk top hats of Wall Street bobbed past teenage prostitutes trawling Broadway.     Writing with great wit and zest, Zacks explores how Roosevelt went head-to-head with corrupt Tammany Hall, took midnight rambles with muckraker Jacob Riis, banned barroom drinking on Sundays, and tried to convince 2 million New Yorkers to enjoy wholesome family fun. In doing so, Teddy made a ruthless enemy of police captain “Big Bill” Devery, who grew up in the Irish slums and never tired of fighting “tin soldier” reformers. Roosevelt saw his mission as a battle of good versus evil; Devery saw prudery standing in the way of fun and profit.     When righteous Roosevelt’s vice crackdown started to succeed all too well, many of his own supporters began to turn on him. Cynical newspapermen mocked his quixotic quest, his own political party abandoned him, and Roosevelt discovered that New York loves its sin more than its salvation.     Zacks’s meticulous research and wonderful sense of narrative verve bring this disparate cast of both pious and bawdy New Yorkers to life. With cameos by Stephen Crane, J. P. Morgan, and Joseph Pulitzer, plus a horde of very angry cops, Island of Vice is an unforgettable portrait of turn-of-the-century New York in all its seedy glory, and a brilliant portrayal of the energetic, confident, and zealous Roosevelt, one of America’s most colorful public figures.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Biography",
    "New York",
    "Politics",
    "Presidents"
  ],
  "author": "Richard Zacks",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/13062394-island-of-vice"
}