{
  "title": "Wonderful Tonight",
  "description": "An iconic figure of the 1960s and ’70s, Pattie Boyd breaks a forty-year silence in Wonderful Tonight , and tells the story of how she found herself bound to two of the most addictive, promiscuous musical geniuses of the twentieth century and became the most famous muse in the history of rock and roll.She met the Beatles in 1964 when she was cast as a schoolgirl in A Hard Day’s Night . Ten days later a smitten George Harrison proposed. For twenty-year-old Pattie Boyd, it was the beginning of an unimaginably rich and complex life as she was welcomed into the Beatles inner circle—a circle that included Mick Jagger, Ron Wood, Jeff Beck, and a veritable who’s who of rock musicians. She describes the dynamics of the group, the friendships, the tensions, the musicmaking, and the weird and wonderful memories she has of Paul and Linda, Cynthia and John, Ringo and Maureen, and especially the years with her husband, George.It was a sweet, turbulent life, but one that would take an unexpected turn, starting with a simple note that began “dearest l.”I read it quickly and assumed that it was from some weirdo; I did get fan mail from time to time.... I thought no more about it until that evening when the phone rang. It was Eric [Clapton]. “Did you get my letter?”... And then the penny dropped. “Was that from you?” I said....It was the most passionate letter anyone had ever written me.For the first time Pattie Boyd, former wife of both George Harrison and Eric Clapton, a high-profile model whose face epitomized the swinging London scene of the 1960s, a woman who inspired Harrison’s song “Something” and Clapton’s anthem “Layla,” has decided to write a book that is rich and raw, funny and heartbreaking—and totally honest and open and breathtaking. Here is the truth, here is what happened, here is the story you’ve been waiting for.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "Rock N Roll"
  ],
  "author": "Pattie Boyd",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/764063.Wonderful_Tonight"
}