{
  "title": "Kingdom of the Nanosaurs",
  "description": "In the tradition of 'His Dark Materials', 'Mortal Engines' and 'Lord Of The Rings', this YA trilogy blends magic with leading edge science and the paranormal with artificial intelligence.Morgan Lane (15), gifted with a superhuman memory, finds his life and the future of humanity thrown into chaos when chosen by the Guardians to memorise and protect with his very existence ‘The Cosmic Algorithm’, the source code of creation itself.The Guardians, aware that seismic cosmic events are unfolding and space parasites known as The Shadix are approaching the planet, send a Sun Angel to protect Morgan who, together with companions Lin Rainbow and Winston their pet orangutan, becomes his guide on a journey to where time and space are one. Morgan’s scientist father has used nanotechnology to create a microbe that will destroy pollution and reverse climate change. Unknown to Morgan, his father’s research is being funded and secretly stolen by a millionaire oligarch, Marius Natzler, controlled by the Shadix.The comet Cygnus Hyperbole appears causing apocalyptic tsunamis, earthquakes and volcanic eruptions as the Guardians cause every animal on the planet save one to vanish. They transform Winston into a genius with the power of speech – a true missing link.Morgan’s fate is to keep the ‘Cosmic Algorithm’ safe in order to reprogram the Continuum. Meanwhile, Marius Natzler has used nanotechnology to create ‘nanosaurs’, fantastical replacement animals: winged dogs, perfumed cats, air sharks, monstrous nano spiders and Taurus, a seventeen feet tall minotaur. Natzler craves the ‘Cosmic Algorithm’ to give him ultimate power.Morgan and companions are captured by Natzler but escape to flee across a dystopian word battling with Natzler’s hybrid human and nanosaur army to their final stand at Beachy Head before a mighty airship-sized jellyfish transports them to the Himalayas to find the Guardians within their breath propelled starship inside Mount Everest.This first book in YA fantasy trilogy ‘The Kingdoms Of Time And Space’ will appeal to lovers of ‘His Dark Materials’ and ‘Mortal Engines’.",
  "genres": [],
  "author": "David Callinan",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/13062608-kingdom-of-the-nanosaurs"
}