{
  "title": "Parable of the Talents",
  "description": "A powerfully wrought novel describing an America permeated with violence, religious persecution, and the will to overcome such adversity, Octavia E. Butler's Parable of the Talents explores the large and small social ramifications of a group of survivors banding together in faith to prevail against anarchy. Butler gives us a well-proportioned fusion of near-future struggle and subtle science fiction, all layered upon an engaging groundwork of human courage, spiritual doctrine, enslavement, and savagery in an anarchistic America.In 2032, five years after losing her family and setting out on a quest to find peace in a chaotic land, Lauren Oya Olamina has gathered more than 60 people in the self-sufficient community called Acorn. Olamina, an African-American hyper-empath (a person who can feel others' pain so intensely it is often incapacitating), is the creator and prophet for the new religion called Earthseed. \"God is Change\" is Earthseed's basic belief; the religion teaches personal harmony and the hope of one day reaching the stars. To that end, the verses in Olamina's \"Books of the Living\" give understanding to a perpetually shifting world of mistrust, slavery, disorder, and government sanctioned witch-hunts. After years of separation, Olamina discovers that her teenage brother, Marcus, has also survived; she immediately welcomes him to Acorn. As an unseasoned Christian preacher, Marcus is suspicious of the cultlike aspects of Earthseed and grows more and more distant from its ideals. Now that Olamina is newly pregnant, Bankole, Olamina's much older physician husband, wishes to find a more established township in which to practice medicine and protect his family.However, soon a fundamentalist Christian named Jarret is elected president of the United States, and his insistence on burning non-Christian churches and murdering those of other faiths becomes very popular. Acorn is attacked, the women raped, the men killed, and all survivors are enslaved. But Olamina eventually escapes and sets out to recover her friends and family and rebuild Earthseed.Parable of the Talents is written in a composite of narratives from Olamina's journals, Bankole's memoirs, and Marcus's own accounts. Just as importantly, there are sections from Olamina's unborn daughter who writes commentary at a much later date; this allows for a more complete vision of Earthseed as religious, political, and humanistic methodology. Olamina is willing to put the destiny of Earthseed above her own life and the lives of her family, which at times makes her nearly the single-minded zealot that Jarret is. Rather than presenting Olamina as a perfect spiritual leader, Butler allows us multiple outside points of view -- as well as Olamina's own self-doubts and insecurities -- to present a much fuller and well-rounded character and story. Here, once again, is Octavia E. Butler's enticing stew of varied human needs, capacities, weaknesses, and enigmatic doctrines born from a constantly changing world. The author knows how to compound elements into an intricate mixture of personal and civil uncertainties, as well as ethical and emotional dilemmas. Sociological situations underpinning science fiction have always been Butler's forte, and this novel admirably continues that tradition. The author is wonderfully skilled at capturing several underlying, intertwined subtexts at once: We are witness to a culture that is well acquainted with high-technology but has great difficulty in replacing or producing anything new. We visit a land that is familiar yet alien, and in continuous flux. There is real unease for the reader while waiting for the inevitable assault upon a new faith as the ugly, bigoted era becomes even more intolerant. In Parable of the Talents, the reader will discover an America that relies heavily on a past it can barely recall, and behold the arrival of a horrifying but intriguing new dawn. Octavia E. Butler evokes a frightening future that eventually sprouts the compassion, mercy, and beauty of Earthseed.\n--Tom Piccirilli",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "Fantasy",
    "Audiobook",
    "Speculative Fiction",
    "Post Apocalyptic"
  ],
  "author": "Octavia E. Butler",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/764646.Parable_of_the_Talents"
}