{
  "title": "American History Revised: 200 Startling Facts That Never Made It into the Textbooks",
  "description": "“American History Revised is as informative as it is entertaining and humorous. Filled with irony, surprises, and long-hidden secrets, the book does more than revise American history, it reinvents it.”—James Bamford, bestselling author of The Puzzle Palace , Body of Secrets , and The Shadow Factory This spirited reexamination of American history delves into our past to expose hundreds of startling facts that never made it into the textbooks, and highlights how little-known peopleand events played surprisingly influential roles in the great American story.  We tend to think of history as settled, set in stone, but American History Revised reveals a past that is filled with ironies, surprises, and misconceptions. Living abroad for twelve years gave author Seymour Morris Jr. the opportunity to view his country as an outsider and compelled him to examine American history from a fresh perspective. As Morris colorfully illustrates through the 200 historical vignettes that make up this book, much of our nation’s past is quite different—and far more remarkable—than we thought.We discover  • In the 1950s Ford was approached by two Japanese companies begging for a joint venture. Ford declined their offers, calling them makers of “tin cars.” The two companies were Toyota and Nissan.• Eleanor Roosevelt and most women’s groups opposed the Equal Rights Amendment forbidding gender discrimination.• The two generals who ended the Civil War weren’t Grant and Lee.• The #1 bestselling American book of all time was written in one day.• The Dutch made a bad investment buying Manhattan for $24.• Two young girls aimed someday to become First Lady—and succeeded.• Three times, a private financier saved the United States from bankruptcy. Organized into ten thematic chapters, American History Revised plumbs American history’s numerous inconsistencies, twists, and turns to make it come alive again.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Historical",
    "Politics",
    "American",
    "Audiobook"
  ],
  "author": "Seymour Morris Jr.",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/7647788-american-history-revised"
}