{
  "title": "The Last Leaf: Voices of History's Last-Known Survivors",
  "description": "On December 3, 2009, Frank Woodruff Buckles, the last living American survivor of World War I, testified before the United States Senate in support of creating a National WWI Memorial in Washington DC. The 108-year-old veteran’s visit to Capitol Hill was covered in-depth by the Associated Press and CNN, among others, calling attention to his status as a last living survivor—the \"last leaf\" of an event that forever changed American history. But Frank Buckles is not alone. While his personal story is unique, Frank, now 109, belongs to an elite group of last living survivors who have experienced some of the most impactful, tragic, heroic, glamorous, and awe-inspiring events in modern American history. Their stories are eloquently chronicled in their own passionate—and often chilling—words, in this book. This unique oral history book records the stories told to him personally by people who witnessed many of history’s most famous events. Among many others, the author interviewed: the final three Civil War widows (one Union and two Confederate), the final pitcher to surrender a home run to Babe Ruth, the last suffragette, the last living person to fly with Amelia Earhart, the final American World War I soldier, and the last surviving employees of Thomas Edison, F. Scott Fitzgerald, and Harry Houdini. The wide-ranging stories involve humor (the 1920 Olympic medalist who stole the original Olympic flag), tragedy (the last survivor of the 1915 Lusitania sinking), heroism (the final Medal of Honor recipient for actions on Pearl Harbor Day), and eyewitnesses to great events (one of the last scientists at the first nuclear chain reaction, and the final Iwo Jima flag raiser). In more than three-dozen chapters, the author blends background information in a lively narrative with the words of the interviewees, so that readers not familiar with the historical episodes described can understand what occurred and the long-term significance of the events. A book that truly makes the past come alive, The Last Leaf will fascinate not only history buffs, but anyone who likes a good story.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Historical"
  ],
  "author": "Stuart Lutz",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/7651704-the-last-leaf"
}