{
  "title": "Who Censored Roger Rabbit?",
  "description": "\"Who'd want to kill a dumb cartoon bunny?\" That's what Eddie Valiant wants to know. He's the toughest private eye in Los Angeles, and he'll handle anything—if you're human. If you're a Toon, that's another story. Eddie doesn't like Toons—those cartoon characters who live side-by-side with humans. Not the way they look, and especially not the way they talk: word-filled balloons come out of their mouths and then disintegrate, leaving dust all over his rug. Eddie will work for a Toon if his cash supply is low enough. So he reluctantly agrees when Roger Rabbit, a Toon who plays straight man (or should that be straight rabbit) in the Baby Herman cartoon series, asks him to find out who's been trying—unsuccessfully—to buy his contract from the DeGreasy Brothers syndicate. Then Rocco DeGreasy is murdered—and Roger is the prime suspect! The rabbit is also, as Eddie soon discovers, very, very dead. Who censored Roger Rabbit? And who shot Rocco DeGreasy? Was it Roger, or was it Rocco's hot-cha-cha girlfriend, Jessica Rabbit? Why had Jessica—a pretty steamy number for a Toon—ever married a dopey bunny in the first place? And why does everybody want Roger's battered old teakettle? As Eddie combs L.A. from the executive suites of the DeGreasy Brothers to Sid Sleaze's porno comic studio, he uncovers art thefts, blackmail plots... and the cagiest killer he's ever faced. In Who Censored Roger Rabbit?, author Gary K. Wolf has created a wonderfully skewed—and totally believable—world compounded of equal parts Raymond Chandler, Lewis Carroll, and Warner Brothers. This riotously surreal spoof of the hard-boiled detective novel is packed with action and laughs. From first page to last, Who Censored Roger Rabbit? is shear delight. Celebrated author Gary K. Wolf's cult classic and highly praised novel Who Censored Roger Rabbit? is the basis for the blockbuster Walt Disney/Steven Spielberg Academy Award–winning film Who Framed Roger Rabbit.",
  "genres": [
    "Mystery",
    "Fiction",
    "Fantasy",
    "Humor",
    "Crime",
    "Audiobook",
    "Noir"
  ],
  "author": "Gary K. Wolf",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/765430.Who_Censored_Roger_Rabbit_"
}