{
  "title": "Cheaper by the Dozen",
  "description": "\"Dad had enough gall to be divided into three parts.\" Dad was Frank B. Gilbreth, to the world a distinguished innovator in scientific factory management, and to his family of six boys and six girls a lively, unpredictable and wholly beloved autocrat.Their house in Montclair, New Jersey, was a sort of laboratory for the elimination of waste motions - \"motion study\" as the elder Gilbreth called it. The children made excellent, if occasionally unwilling, guinea pigs.Only a motion-study expert could have coped with their temperamental Pierce Arrow (nicknamed \"Foolish Carriage\"). But Dad found no difficulty in blowing all three horns (one electric, two of the bulb variety) as he stepped on the gas, steered madly through traffic, puffed on his cigar, cuffed a noisy youngster in the back seat, and bellowed, \"Road hog, road hog,\" at the unwary.The annual trip to their summer home in Nantucket, Massachusetts, was always fraught with drama. They inevitably caused a sensation when they passed through a small town, and were once taken for an entire orphanage on an outing. Stops were, of course, frequent and once when one of the twelve got left behind, the loss was not discovered for several hours.Democracy was religiously practiced in the Gilbreth family through the medium of the family council. There was the matter of the dog, for instance. Dad firmly believed that \"any pet which didn't lay eggs was an extravagance that a man with twelve children could ill afford.\" But the vote was twelve to one, with Mother abstaining, and the dog was added to the general bedlam.The Gilbreths astounded the Nantucket natives (who considered the Gilbreth homestead - a pair of lighthouses with a cottage squeezed between - a must stopping place for visiting tourists), paralyzed the Montclair schools, and routed the visiting psychiatrists. Their high jinks are faithfully reported by two of the famous dozen in this uproarious book.",
  "genres": [
    "Classics",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Humor",
    "Childrens",
    "Biography Memoir"
  ],
  "author": "Frank B. Gilbreth Jr.",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/764903.Cheaper_by_the_Dozen"
}