{
  "title": "Raquel: Beyond the Cleavage",
  "description": "Part autobiography, part personal philosophy, and full of practical advice for women of all ages, Beyond the Cleavage is a book that skimps neither on entertainment nor on good plain advice.She didn’t hatch out of an eagle’s nest, circa One Million Years B.C. , clad in a skimpy fur bikini. She didn’t aspire to fame as a sex symbol. Yet, for many years after making her Hollywood entrance as every man’s fantasy, Raquel Welch was best known for her beauty and sex appeal. A private person, she allowed people to draw their own conclusions from her public image. Now, Raquel Welch is ready to speak her mind. And, with the luxury of hindsight and the benefit of experience, she has plenty to share about the art of being a woman--even men will find it enlightening to read about what makes her tick.In Beyond the Cleavage , Raquel Welch talks, woman to woman, about her views on all that comes with being a member of the female sex--love, sex, style, health, body image, career, family, forgiveness, aging, and coming of age. Looking back on her life, she lets women in on her childhood, dominated by a volatile father; her first love, marriage, and divorce; her early struggles as a single working mother in Hollywood; her battles for roles and respect as an actress; and her daring decision never to lie about her age. Looking forward, she offers women a compass to guide them at every crossroad of life, from menopause through the empty nest years, to dating younger men and beyond. Along with bringing baby boomers into her confidence--she offers essential tips for staying motivated and positive past fifty, as well as divulging her secrets for fabulous hair and makeup--she even talks to today’s younger generation of women about the importance of carrying themselves with dignity and self-respect.With warmth, humor, conviction, and honesty, Raquel reveals her approach to preventative aging, her life-changing commitment to yoga, her recipe for eating right, her skincare regimen, her flair for fashion, and much more. Deeply personal (Welch wrote every word herself--no ghostwriter), Beyond the Cleavage is Raquel Welch’s gift to every woman who longs to look and feel her best, and be at peace with herself.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Self Help"
  ],
  "author": "Raquel Welch",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/7649305-raquel"
}