{
  "title": "War in a Time of Peace: Bush, Clinton and the Generals",
  "description": "A Pulitzer Prize-winning journalist and the author of 17 books, David Halberstam has a gift for bringing current events alive and putting them into historical perspective in an engaging way. In many respects, War in a Time of Peace serves as a sequel to his classic The Best and the Brightest in its examination of how the lessons of Vietnam have influenced American foreign policy in the post-Cold War era. Beginning with the Persian Gulf War, Halberstam discusses the political shift in emphasis from foreign to domestic issues that ushered in the first Clinton administration. Despite the fact that Clinton, along with much of the country, preferred to focus on the home front, the U.S. nonetheless found itself drawn into conflicts in Haiti, Somalia, and the Balkans--events that reflected American discomfort with the use of its military forces abroad while at the same time acknowledging that much of the world is dependent upon the U.S. for both guidance and support. The book also highlights the many nonpolitical factors that have influenced these political changes, including a generational shift in national leadership, the modern media's emphasis on entertainment over foreign news, a leap in military technology, and American economic prosperity that has rendered foreign policy largely irrelevant to many citizens. Halberstam is a master at presenting well-rounded portraits and telling anecdotes of the personalities that have created U.S. policy, casting new light on well-known figures such as Clinton, Colin Powell, and George H.W. Bush, as well as supporting players such as Anthony Lake, Richard Holbrooke, James Baker, Madeleine Albright, General Wesley Clark, Al Gore, and many other influential American leaders of the past decade. Having covered many aspects of American history and foreign policy since the early 1960s, Halberstam is uniquely qualified to report on an era in which the U.S., and the world, has changed so dramatically. --Shawn Carkonen",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "War",
    "American History",
    "Military Fiction",
    "Political Science"
  ],
  "author": "David Halberstam",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/765396.War_in_a_Time_of_Peace"
}