{
  "title": "Yesh!",
  "description": "\"\"I love this cartoon Mutts!\"\"-Brooke Shields to Jay Leno on The Tonight Show\"\"People who view pets as family members will rejoice in this collection.\"\"-The Baton Rouge Sunday Advocate about Cats and Dogs: Mutts IIConventional pet wisdom says that there are cat lovers and there are dog lovers-and never the two shall meet. But if there's one thing the two sides do agree on, it's that they love Patrick McDonnell's charming strip, Mutts.Mutts has won the devotion of animal lovers and comics readers across the land. Fans love the charming humor the talented McDonnell provides, as well as his one-of-a-kind artistic style that stands apart on the funny pages. Yesh! features Earl the dog, his pal Mooch the cat, and the plethora of other lovable animal regulars who pop in and out of their lives.Few people could conceive what animals are truly thinking until McDonnell gave us the antics and adventures of Earl and Mooch. In one series of strips, Earl reveals what pets think when their owners are late arriving home: \"\"I must ration my dinner...who knows how long it will need to last?...The day?...The week?...The next two minutes?\"\" His buddy Mooch declares after becoming stranded on top of a tree: \"\"I need to reassess my goals.\"\"The delightful personalities of McDonnell's animal stars have won the hearts and acclaim of readers the world over. Veteran cartoonist Charles Schulz called Mutts one of the best strips ever. The strip earned the National Cartoonists Society's Comic Strip of the Year Award in 1996. In 1998, McDonnell captured the Swedish Academy of Comic Art's Award for Best International Comic Strip Artist. Yesh! celebrates the subtle humor and unparalleled style of a strip that hearkens back to the classic strips of yesteryear.",
  "genres": [
    "Comics",
    "Humor",
    "Cats",
    "Animals",
    "Comic Strips",
    "Graphic Novels",
    "Fiction"
  ],
  "author": "Patrick McDonnell",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/765451.Yesh_"
}