{
  "title": "God Is Not One: The Eight Rival Religions That Run the World--and Why Their Differences Matter",
  "description": "At the dawn of the twenty-first century, dizzying scientific and technological advancements, interconnected globalized economies, and even the so-called New Atheists have done nothing to change one thing: our world remains furiously religious. For good and for evil, religion is the single greatest influence in the world. We accept as self-evident that competing economic systems (capitalist or communist) or clashing political parties (Republican or Democratic) propose very different solutions to our planet's problems. So why do we pretend that the world's religious traditions are different paths to the same God? We blur the sharp distinctions between religions at our own peril, argues religion scholar Stephen Prothero, and it is time to replace naÏve hopes of interreligious unity with deeper knowledge of religious differences.  In Religious Literacy, Prothero demonstrated how little Americans know about their own religious traditions and why the world's religions should be taught in public schools. Now, in God Is Not One, Prothero provides readers with this much-needed content about each of the eight great religions. To claim that all religions are the same is to misunderstand that each attempts to solve a different human problem. For example:  –Islam: the problem is pride / the solution is submission –Christianity: the problem is sin / the solution is salvation –Confucianism: the problem is chaos / the solution is social order –Buddhism: the problem is suffering / the solution is awakening –Judaism: the problem is exile / the solution is to return to God Prothero reveals each of these traditions on its own terms to create an indispensable guide for anyone who wants to better understand the big questions human beings have asked for millennia—and the disparate paths we are taking to answer them today. A bold polemical response to a generation of misguided scholarship, God Is Not One creates a new context for understanding religion in the twenty-first century and disproves the assumptions most of us make about the way the world's religions work.",
  "genres": [
    "Religion",
    "Nonfiction",
    "History",
    "Philosophy",
    "Theology",
    "Spirituality",
    "Christianity"
  ],
  "author": "Stephen Prothero",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/7655375-god-is-not-one"
}