{
  "title": "Writing and Difference",
  "description": "First published in 1967, Writing and Difference, a collection of Jacques Derrida's essays written between 1959 and 1966, has become a landmark of contemporary French thought. In it we find Derrida at work on his systematic deconstruction of Western metaphysics. The book's first half, which includes the celebrated essay on Descartes and Foucault, shows the development of Derrida's method of deconstruction. In these essays, Derrida demonstrates the traditional nature of some purportedly nontraditional currents of modern thought—one of his main targets being the way in which \"structuralism\" unwittingly repeats metaphysical concepts in its use of linguistic models.The second half of the book contains some of Derrida's most compelling analyses of why and how metaphysical thinking must exclude writing from its conception of language, finally showing metaphysics to be constituted by this exclusion. These essays on Artaud, Freud, Bataille, Hegel, and Lévi-Strauss have served as introductions to Derrida's notions of writing and différence—the untranslatable formulation of a nonmetaphysical \"concept\" that does not exclude writing—for almost a generation of students of literature, philosophy, and psychoanalysis.Writing and Difference reveals the unacknowledged program that makes thought itself possible. In analyzing the contradictions inherent in this program, Derrida goes on to develop new ways of thinking, reading, and writing,—new ways based on the most complete and rigorous understanding of the old ways. Scholars and students from all disciplines will find Writing and Difference an excellent introduction to perhaps the most challenging of contemporary French thinkers—challenging because Derrida questions thought as we know it.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Theory",
    "France",
    "Literary Criticism",
    "Writing",
    "Language"
  ],
  "author": "Jacques Derrida",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/765346.Writing_and_Difference"
}