{
  "title": "Quicksand: America's Pursuit of Power in the Middle East",
  "description": "Geoffrey Wawro approaches America's role in the Middle East in a fundamentally new way-by encompassing the last century of the entire region, rather than focusing narrowly on a particular country or era. The result is a definitive and revelatory history whose drama, tragedy, and rich irony he relates with unprecedented verve. Wawro combed archives in the United States and Europe and traveled the Middle East to unearth new insights into the hidden motivations, backroom dealing, and outright espionage that shaped some of the most tumultuous events of the last one hundred years. Wawro offers piercing analysis of iconic events from the birth of Israel to the death of Sadat, from the Suez crisis to the energy crisis, from the Six-Day War to Desert One, from Iran-contra to the wars in Iraq and Afghanistan and the rise of al- Qaeda. Throughout, he draws telling parallels between America's past mistakes and its current quandaries, proving that we're in today's muddle not just because of our old errors, but because we keep repeating those errors.America has juggled multiple commitments and conflicting priorities in the Middle East for nearly a century. Strands of idealism and ruthless practicality have alternated- and sometimes run together-in our policy. Quicksand untangles these strands as no history has done before by showing how our strategies unfolded over the entire century and across the entire region. We've persistently misread the intentions and motivations of every major player in the region because we've insisted on viewing them through the lens of our own culture, hopes, and fears. Most administrations since Eisenhower's have adopted their own \"doctrine\" for the Middle East, and almost every doctrine has failed precisely because it's a doctrine-a template into which events on the ground refuse to fit. Geoffrey Wawro's peerless and remarkably lively history is key to understanding our errors and the Middle East-at last- on its own terms.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "International Relations"
  ],
  "author": "Geoffrey Wawro",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/7662064-quicksand"
}