{
  "title": "القيامة الكبرى",
  "description": "هذا الكتاب هو السادس من سلسلة \"العقيدة في ضوء الكتاب والسنة\" وفيه يتم التحدث عن اليوم الآخر، وتحديداً القيامة الكبرى، وهو يشتمل على أربعة عشر فصلاً، يسبقها تمهيد: أما التمهيد فجاء للتعريف بالقيامة، ففي الفصل الأول ذكر لأسماء يوم القيامة وتعريف لأشهر هذه الأسماء، وبيان السر في كثيرة أسماء ذلك اليوم. والفصل الثاني خصص للتعريف بالدمار الذي يحل بالجنس البشري عندما ينفح في الصور فيفني الله الأحياء. والفصل الثالث في صفة البعث والنشور وحال العباد فيه، والفصل الرابع فخصص لبيان صفة الأرض التي يكون الحشر عليها. والفصل الخامس ساق الأدلة الدالة على البعث، ورد على المكذبين به. أما الفصل السادس فتحدث عن القيامة عند الأنبياء، وبين أنهم جميعاً ذكروها، وتحدثوا عنها، وفي هذا الفصل مبحث عن القيامة في كتب أهل الكتاب اليوم. والفصل السابع فخصص للحديث عن أهوال يوم القيامة وفيه أيضاً استعراض للنصوص المتحدثة عن ذلك الأرض، ونسف الجبال وتفجير البحار وتسخيرها، وحوران السماء وانفطارها، وتكوير الشمس، وانخساف القمر، وتناثر النجوم. والفصل الثامن معقود لبيان أحوال الناس في ذلك اليوم، وفي الفصل التاسع حديث عن الشفاعة العظمى والمقام المحمود الذي ينفرد به الرسول صلى الله عليه وسلم من بين البشر، حيث يشفع عند ربه ليخلص العباد مما هم فيه من أهوال البشر. والفصل العاشر في الحساب والجزاء، وهو فصل طويل، تحدث عن معنى الحساب، ومشهدة، والذين يسألون في ذلك اليوم، والقواعد التي يكون الحساب على أساسها، والأمور التي يكون عنها السؤال، وأول ما يحاسب عليه العبد من أعماله. وبين هذا الفصل أنواع الحساب الثلاثة: المناقشة، والعرض، والمعاتبة. والفصل الحادي عشر عرض ما يكون من اقتصاص المظالم بين الخلق، وكيف يتحقق هذا الاقتصاص. وعقد الفصل الثاني عشر للتعريف بالميزان، وبيان عقيدة أهل السنة فيه، وذكر الأمور التي توزن فيه، والأعمال التي تثقل في الوزن، وأورد الفصل الثالث عشر الأحاديث التي تتحدث عن سعة المصطفى صلى الله عليه وسلم وحلاوة مائة وصفائه، والفصل الرابع عشر تحدث عن مشهد الحشر في الجنة والنار، وفيه مبحث عن الصراط وآخر لعقيدة أهل السنة والجماعة فيه.",
  "genres": [
    "Islam",
    "Religion"
  ],
  "author": "عمر سليمان الأشقر",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/7662501"
}