{
  "title": "Day of Honey: A Memoir of Food, Love, and War",
  "description": "A portrait of life in the Middle East, Day of Honey weaves history, cuisine, and firsthand reporting into a fearless, intimate exploration of everyday survival. In the fall of 2003, Annia Ciezadlo spent her honeymoon in Baghdad. Over the next six years, while living in Baghdad and Beirut, she broke bread with Shiites and Sunnis, warlords and refugees, matriarchs and mullahs. Day of Honey is her memoir of the hunger for food and friendship—a communion that feeds the soul as much as the body in times of war. Reporting from occupied Baghdad, Ciezadlo longs for normal married life. She finds it in Beirut, her husband’s hometown, a city slowly recovering from years of civil war. But just as the young couple settles into a new home, the bloodshed they escaped in Iraq spreads to Lebanon and reawakens the terrible specter of sectarian violence. In lucid, fiercely intelligent prose, Ciezadlo uses food and the rituals of eating to illuminate a vibrant Middle East that most Americans never see. We get to know people like Roaa, a determined young Kurdish woman who dreams of exploring the world, only to see her life under occupation become confined to the kitchen; Abu Rifaat, a Baghdad book lover who spends his days eavesdropping in the ancient city’s legendary cafés; Salama al-Khafaji, a soft-spoken dentist who eludes assassins to become Iraq’s most popular female politician; and Umm Hassane, Ciezadlo’s sardonic Lebanese mother-in-law, who teaches her to cook rare family recipes—which are included in a mouthwatering appendix of Middle Eastern comfort food. As bombs destroy her new family’s ancestral home and militias invade her Beirut neighborhood, Ciezadlo illuminates the human cost of war with an extraordinary ability to anchor the rhythms of daily life in a larger political and historical context. From forbidden Baghdad book clubs to the oldest recipes in the world, Ciezadlo takes us inside the Middle East at a historic moment when hope and fear collide.",
  "genres": [
    "Memoir",
    "Food",
    "Nonfiction",
    "Travel",
    "War",
    "Biography",
    "Book Club"
  ],
  "author": "Annia Ciezadlo",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/7665543-day-of-honey"
}