{
  "title": "White Rose of Night",
  "description": "Desert storm, ‘djinn’ and the riders from Hell ... Saracen, Templar and dark sorcerer ... unholy adventure in an age of holy war!It is a time of conquest in which the Saxon is almost a slave in his own country, and the Holy Land is sundered by unholy war out of which there can be no winners, no real victors. And for young men like Paul Delgado and Edward of Aethelstan, no place is safe. Their own home is as filled with danger as the battlefields of Palestine, for they are men who love men, in an age when such love is forbidden.On the very threshold of manhood, Paul is a landless, penniless orphan with no future — unless it is to follow the young Earl of Aethelstan to war. But Edward has no desire to sell his sword and his soul to a blood- soaked Crusade where mercy is rare, cruelty is commonplace, and the dark sorcery of an unknown land might easily swallow a man whole.To repair the patchwork fortunes of the House of Aethelstan, Edward commits himself to the Crusade ... for love of the young Saxon knight, Paul sails with the eastbound ships, in the company of Normans, Templars, soldiers and squires. Before he returns, he will be a man grown, with an epic story to tell of bloodshed and sorcery, sublime sensuality, and a timeless love. Dust-veiled battlefields and the candlelit bedchambers of Saracen captains are his memories: silk and steel, delight and despair, and the magic and mayhem of a half-forgotten age.Sensual in character, vast in scope, White Rose of Night is a haunting romance set within a thrilling adventure, with a twist of high fantasy. Back in print, from the acclaimed author of FORTUNES OF WAR and the award-winning historical, THE DECEIVERS.",
  "genres": [
    "Historical",
    "M M Romance",
    "Gay",
    "Historical Fiction",
    "Fantasy",
    "LGBT",
    "M M Historical Romance"
  ],
  "author": "Mel Keegan",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/7666874-white-rose-of-night"
}