{
  "title": "Gears of the City",
  "description": "In this stunning follow-up to his acclaimed debut, Thunderer, Felix Gilman’s brave hero returns from one thrilling and dangerous quest only to confront another. In a magical landscape where time is meaningless, reality precarious, and countless selves work toward countless possible futures, one man must seek a city’s truth—and rediscover his own. Imprisoned with a prophetic half human, half beast, the lost man learns his Arjun. Slowly the terrible memories emerge, and at last he remembers where—and when—he has been. . . . In the last days of the once great city of Ararat, Arjun is just another ghost lost in the shadows of the Mountain. To some, the Mountain is a myth, to others, a weapon. Above all, it is a dark palace leaving its seekers to wander the city below. For no matter how far one walks, the Mountain never draws closer, and time itself becomes another trap. Rescued by two sisters from the mindless Know-Nothings who erode what’s left of the city, Arjun volunteers to retrieve their long-lost third sister from a ghost like Brace-Bel, another man out of time. It will require a perilous trek through ruins to a decadent mansion—one surrounded by traps and devices that could not possibly exist yet. And what awaits Arjun inside is something he could not possibly have imagined.As he struggles to recover the lost girl and piece the fragments of his life back together, Arjun knows he must finally return to the beast to hear the rest of its prophecy. But each step is more treacherous than the last . . . and the beast who knows his fate may pose the most deadly trial yet.A spellbinding novel of imagination and intrigue, Gears of the City will propel you into an adventure like no other, in a world like no other.From the Hardcover edition.",
  "genres": [
    "Fantasy",
    "Steampunk",
    "Fiction",
    "New Weird",
    "Science Fiction Fantasy",
    "Science Fiction"
  ],
  "author": "Felix Gilman",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/7665117-gears-of-the-city"
}