{
  "title": "Second First Kiss",
  "description": "From New York Times and #1 Amazon bestselling author Marina Adair, comes a hysterical and heartfelt opposites attract, hot-neighbor romantic comedy that fans of Nadia Lee, Lucy Score, and Jill Shalvis will adore.Town ball-buster and reformed bad-girl, Kat Rhodes, has always had a love for trouble, not to mention trouble when it comes to love. Just last month she shared the most awkward, awful, terrible kiss in the history of kisses with the town’s most infuriating man—the straight-laced, stick-up-his-backside, golden boy. It was an experience she vowed never to repeat, until she does and, woah baby, it’s a fireworks, flutter-inducing, and all kinds of fanfare event. Which is ridiculous. He enforces laws, she breaks them. He’s walks the straight and narrow—she doesn’t even know how to color in the lines. Things in common: zero. Chances of a third kiss: negative zero.Federal Law Enforcement agent, Nolan Carmichael moved back to his ski town of Sierra Vista, hoping to find some much needed solitude in the wide open spaces and fresh mountain air. But for a job that is supposed to bring him closer to nature, Nolan finds himself too busy handling drunken campers and heading up security at his family’s lodge to find any kind of peace. Or maybe his problem has something to do with the troublemaker next door. The woman is sexy, stubborn, and a distraction he can’t afford. Especially since she is opinionated, annoying as hell, and has a record of causing trouble almost as long as those legs of hers.But when things start to go missing at the family lodge, and Kat’s sister gets mixed up with the wrong crowd, he decides he’ll do whatever it takes to get to the truth behind the burglaries—even if it means using his relationship with Kat. Which leaves Nolan two choices: follow the letter of the law or follow his heart.Second First Kiss is a tender, laugh-out-loud romcom featuring a law man who comes equipped with his own cuffs, a reformed bad-girl, and a series of white lies that leads to an enemies-to-lovers romance that will make you fall in love. It's book 2 in a series, but can be read as a standalone, and is guaranteed to make you laugh, cry and bring all the feels in-between.Second First Kiss is a frenemies-to-lovers, hot neighbor, what’s-one-little-lie romcom with no cheating, no triggers and a satisfying happily ever after.",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Adult",
    "Audiobook",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Marina Adair",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/76654254-second-first-kiss"
}