{
  "title": "The Bitch-Proof Suit",
  "description": "The Bitch-Proof Suit is a fresh and exciting story with plenty of humor and romance - with all the charm of Dublin and glamor of New York.When Blue (Bluebell) Byrne is up against the odds in the world of New York fashion marketing, she needs the ultimate in accessories - a bitch-proof suit. Her marketing experience has helped her create the perfect suit. She had it made by bespoke tailors, cut with twice the precision at half the price. No labels, no trends, just sheer cutting edge class.The story starts in Manhattan. Blue is about to put her suit to the ultimate test when she vies against a boardroom full of conniving business rivals to win the top job assignment - to work in the company’s office in Dublin, Ireland, and settle a few scores at the same time.The suit, her negotiating skills and gutsy determination helps Blue win the job. Within hours she sets off for Dublin. It’s the one place she swore she’d never go back to. Six years ago she’d left that city behind, along with Morgan Daire, the man who broke her heart, sure she’d never return. It had almost destroyed her once, but hell...she loves a challenge!She’ll be working with the unspeakably glamorous and influential Verde Valmont, and Verde’s Irish assistant Emer. Blue will also be facing up to the formidable Dubliner, Morgan Daire, the man whose past is inexorably linked with hers. Then there’s her friend, Dublin designer, Murphy, an incorrigible rogue whose flirting causes jealousy and all sorts of trouble. She also encounters the sexy and handsome Sears Pearson, a New York coolhunter, who takes an interest in her. With Morgan and Sears vying for her attention, and Murphy causing misunderstandings, her love life is anything but smooth.This is a sparkling new novel for 2010, brimming with romance, humor, friendship, rivalry, Irish cocktails and scandalous behavior.Author’s note:The Bitch-Proof Suit did actually exist. I designed and wore it several years ago when I lived and worked in Dublin, Scotland and London, and it served its purpose brilliantly.About the Author:De-ann Black is a bestselling author, scriptwriter and former newspaper journalist. She has around 40 books published. She splits her time between Scotland, Dublin and London.For news about her latest books visit Amazon’s De-ann Black page.http://www.amazon.com/De-Ann-Black/e/...De-ann's latest novels include THE CURE FOR LOVE (Romantic Comedy Novella), and the thriller The Strife of Riley.",
  "genres": [
    "Chick Lit",
    "Romance",
    "Fiction",
    "Novels",
    "Romantic Comedy",
    "Contemporary"
  ],
  "author": "De-ann Black",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/7667951-the-bitch-proof-suit"
}