{
  "title": "The Strong Eye of Shamanism: A Journey into the Caves of Consciousness",
  "description": "An exploration of shamanism and the archetypal symbolism that sits at the foundation of all human life.Not just an academic work. Helps the reader experience the actual mindset of the shaman.Presents a cohesive view of the recurrent patterns of symbolism and visionary experience that underlie all religion.The human psyche contains archetypal patterns largely lost to contemporary society but which shamans have employed for over 30,000 years to gain access to the spiritual world. Shamanic symbols both affect and reflect these durative patterns that exist, with uncanny similarity, in civilizations separated by expanses of time and distance. The Strong Eye of Shamanism draws together the many facets of the art of shamanism, presenting a cohesive view of the recurrent patterns of symbolism and visionary experience that underlie its practice. The \"strong eye\" of the title refers to the archetypal symbolism that sits at the foundation of all human life--whether in Paleolithic caves or today's temples. The author asserts that society has become separated from the power of those symbols that lead us into deeper understanding of our spirituality. In today's world of splintered psyches, a world in which people are in search of their souls, shamanism survives as an age-old technology of soul recovery, a living Rosetta stone that reminds us of the shared foundation that exists beneath even the most radically different perspectives. Through its study of shamanism, archetypal psychology, and symbolism, The Strong Eye of Shamanism encourages individuals--and society--to look inward and remember that the deepest forms of awareness begin with the knowledge that the answers reside within us.",
  "genres": [
    "Anthropology",
    "History",
    "Nonfiction"
  ],
  "author": "Robert E. Ryan",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/766469.The_Strong_Eye_of_Shamanism"
}