{
  "title": "Black Jack, Vol. 12",
  "description": "Black Jack is a mysterious and charismatic genius surgeon who travels the world performing amazing and impossible medical feats. Through highly trained, he freelances without a license because he distains the medical establishment. This leads to run-ins with the authorities and unscrupulous, sometimes criminal, individuals. Because Black Jack keeps his true motives secret, his ethics are perceived as questionable and he is considered a selfish, uncaring devil.The Black Jack series is told in short stories. Volume 12 will contain 14 stories, each running approximately 20 pages in length. This eleventh volume includes the following Wildcat Black Jack is called out to the jungles of Indonesia to help an old friend with some unique research.  Renowned Paris based Professor Dr. Triufeaux has stumbled upon a rare case of a modern day wolf-boy. However, in this case the boy believes he is a wildcat. Whilte Whille preparing to have a nice homecooked meal, Black Jack and his assistant Pinoko are interrupted by a wrapping on their front door.  Awaiting to enter and speak with the doctor are two men, an odd couple of sorts, with a request for the doc's services.  The director of the local zoo and a representative from Angola are desperate to have a recently transplanted animal treated immediately. \"Black Jack is a dramatic, nearly Byronic figure...With genre-spanning stories--horror, sci-fi, romance--and Tezuka's signature blend of drama, pathos, and extremely broad comedy jammed together on every page, Black Jack is a wild but extravagently entertaining ride that's far more accessible than the author's novel-length epics.\" --Publishers Weekly\"2008-2009 Manga of the Year!\" --The Manga Critic\"With his shock of white hair and rock-star demeanour, Black Jack transfers well to the manga version of the operating room. The book is peppered with enough knowledge to hint at Tezuka's fascination with the frailty of the human body. [I]t means he can avoid the clichés of most manga storylines.\" --The Guardian (U.K.)",
  "genres": [
    "Manga",
    "Comics",
    "Graphic Novels",
    "Japan",
    "Mystery",
    "Short Stories",
    "Adventure"
  ],
  "author": "Osamu Tezuka",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/7667883-black-jack-vol-12"
}