{
  "title": "Megan's Way (Family Drama, Women's Fiction)",
  "description": "WINNER, READERS FAVORITE Fiction/Drama WINNER, BEACH BOOK Spiritual FINALIST, Next Generation Indie Book New Age FINALIST, READERS FAVORITE Women's Fiction HONORABLE MENTION, NEW ENGLAND FILM Spirituality . One woman's plight with illness, her daughter's will to survive, and a circle of friends shrouded in secrets. . \"Megan's Way...beautiful and tender portrayals...very enjoyable read on the order of a Jodi Picoult novel. \" --The Bookish Dame *** What would you give up for the people you love? When Megan Taylor, a single mother and artist living on Cape Cod, receives the shocking news that her cancer has returned, she's faced with the most difficult decision she's ever had to make. The love she has for her daughter, Olivia, and her closest friends will be stretched and frayed. Megan's illness reawakens her best friend, Holly Townsend's, torment of a long-held secret and years of betrayal. How does one choose between a daughter and a life-long best friend? Can the secret she has been keeping be revealed after years of lying without destroying everyone in its wake? Meanwhile, fourteen-year-old Olivia's world is falling apart right before her eyes, and there's nothing she can do about it. She finds herself acting in ways she cannot even begin to understand. When her internal struggles turn to dangerous behavior, even the paranormal connection she shares with her mother might not be enough to save her - her life will hang in the balance. Megan's Way is a journey of self discovery and heartfelt emotions, exploring the depth of the mother-daughter bond, and the intricacies of friendship. *** Olivia's story will be continued in LOVING LIVI, Harborside Nights new adult romance series. Sign up for Melissa's newsletter and follow her on her author page here on Amazon to be notified of this release! *** Author Melissa Foster is a New York Times & USA Today bestselling and award-winning author. She writes contemporary romance, contemporary women's fiction, romantic suspense, thrillers, and historical fiction with emotionally compelling characters that stay with you long after you turn the last page. Melissa also co-writes the Love on Rockwell Island series with Bella Andre. Her books have been recommended by USA Today's book blog, Hagerstown Magazine, The Patriot, and several other print venues. She is the founder of the World Literary Café. When she's not writing, Melissa helps authors navigate the publishing industry through her author training programs on Fostering Success. Melissa has been published in Calgary's Child Magazine, the Huffington Post, and Women Business Owners magazine. Melissa is available to chat with book clubs and welcomes comments and emails from her readers. Visit Melissa on social media or her personal website.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Drama",
    "Relationships",
    "Mystery",
    "Romance"
  ],
  "author": "Melissa Foster",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/7672298-megan-s-way-family-drama-women-s-fiction"
}