{
  "title": "Midnight Fires",
  "description": "Winner of The Nora and Ted Sterling Prize in Support of Controversy, Simon Fraser UniversityOriginally approved as a master of laws thesis by a respected Canadian university, this book tackles one of the most compelling issues of our time--the crime of genocide--and whether in fact it can be said to have occurred in relation to the many Original Nations on Great Turtle Island now claimed by a state called Canada. It has been hailed as groundbreaking by many Indigenous and other scholars engaged with this issue, impacting not just Canada but states worldwide where entrapped Indigenous nations face absorption by a dominating colonial state.Starblanket unpacks Canada's role in the removal of cultural genocide from the Genocide Convention, though the disappearance of an Original Nation by forced assimilation was regarded by many states as equally genocidal as destruction by slaughter. Did Canada seek to tailor the definition of genocide to escape its own crimes which were then even ongoing? The crime of genocide, to be held as such under current international law, must address the complicated issue of mens rea (not just the commission of a crime, but the specific intent to do so). This book permits readers to make a judgment on whether or not this was the case.Starblanket examines how genocide was operationalized in Canada, focused primarily on breaking the intergenerational transmission of culture from parents to children. Seeking to absorb the new generations into a different cultural identity--English-speaking, Christian, Anglo-Saxon, termed Canadian--Canada seized children from their parents, and oversaw and enforced the stripping of their cultural beliefs, languages and traditions, replacing them by those still in process of being established by the emerging Canadian state. She outlines the array and extent of the destruction which inevitably took place as part of the effort to bring about such a wrenching change--forcible indoctrination by means of massive and widespread death by disease and dilapidated living conditions, torture, forced starvation, labor, and sexual predation--collateral damage to Canada's effort to absorb diverse original nations into one larger, alien and dominating body politic. The cumulative effects of genocide continue to be exhibited by the survivors and their descendants who suffer from the trauma and dysfunction, primarily in healthy proper parenting, which results in ongoing forcible removals via the child welfare systems to this day.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Ireland",
    "Fiction",
    "Historical Mystery",
    "Historical"
  ],
  "author": "Nancy Means Wright",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/7671307-midnight-fires"
}