{
  "title": "Jane and His Lordship's Legacy",
  "description": "It's with a heavy heart that Jane Austen takes up a new residence at Chawton Cottage in Hampshire. Secretly mourning the lost love of her life, she's stunned to learn that the late Lord Harold Trowbridge has made her heir to an extraordinary bequest: a Bengal chest filled with his diaries, letters, and most intimate correspondence. From these, Jane is expected to write a memoir of the Gentleman Rogue for posterity. But before she can put pen to paper on this labor of love, she discovers a corpse in the cellar of her new home.The dead man was a common laborer, and a subsequent coroner's examination shows he was murdered elsewhere and transported to Chawton Cottage. Suddenly Jane and her family are thrust into the center of a brewing scandal in this provincial village that doesn't take kindly to outsiders in general—and to Austens in particular.And just as Jane glimpses a connection between the murder and the shattering truth concealed somewhere in Lord Harold's papers, violent death strikes yet another unsuspecting vicitim. Suddenly there are suspects and motives everywhere Jane looks—local burglaries, thwarted passions, would-be knights, and members of the royal family itself who want Lord Harold hushed . . . even in death. As the tale of one man's illustrious life unfolds—a life that runs a parallel course to the history of two continents—Jane races against time to catch a cunning killer before more innocent lives are taken. But her determination to protect Lord Harold's legacy could exact the costliest price of all: her own life.Jane and His Lordship's Legacy is historical suspense writing at its very finest, graced with insight, perception, and uncommon intelligence of its singular heroine in a mystery that will test the mettle of her mind and heart.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Historical Mystery",
    "Regency",
    "British Literature"
  ],
  "author": "Stephanie Barron",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/76707.Jane_and_His_Lordship_s_Legacy"
}