{
  "title": "Jane and the Ghosts of Netley",
  "description": "In her seventh captivating adventure, Jane Austen finds her crime-solving mettle put to the test in a confounding case of intrigue, murder, and high treason. Among the haunted ruins of an ancient abbey, Jane is drawn into a shadow world of dangerous secrets and traitorous hearts where not only her life is at stake—but the fate of England.As Jane Austen stands before the abandoned ruins of Netley Abbey, she imagines that ghosts really do haunt the centuries-old monastery. But the green-cloaked figure who startles her is all too human and he bears an unexpected missive from Lord Harold Trowbridge, one of the British government’s most trusted advisers—and a man who holds a high place in Jane’s life.Trowbridge tells Jane about a suspected traitor in their midst—and the disastrous consequences if she succeeds. But is Sophia Challoner, a beautiful widow with rumored ties to Emperor Bonaparte, really an agent of the enemy?Dispatched to Netley Lodge, Jane sets about gaining the confidence of the mysterious and intriguing lady even as Trowbridge’s grim prediction bears a British frigate is set afire and its shipwright found with his throat cut.It’s clear that someone is waging a clandestine war of terror and murder. But before Jane can follow the trail of conspiracy to its source and unmask a calculating killer, the cold hand of murder will fall mercilessly yet again—and suddenly Jane may find herself dying for her country.Elegantly intriguing, Jane and the Ghosts of Netley is a beautifully crafted novel of wit, character, and suspense that transports Jane and her many fans into a mystery of truly historical proportions—and a case that will test the amateur sleuth’s true colors under fire.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Regency",
    "British Literature"
  ],
  "author": "Stephanie Barron",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/76709.Jane_and_the_Ghosts_of_Netley"
}