{
  "title": "Disintegration: The Splintering of Black America",
  "description": "Instead of one black America, today there are four.“There was a time when there were agreed-upon 'black leaders,' when there was a clear 'black agenda,' when we could talk confidently about 'the state of black America'—but not anymore.” —from DisintegrationThe African American population in the United States has always been seen as a single entity: a “Black America” with unified interests and needs. In his groundbreaking book, Disintegration, Pulitzer-Prize winning columnist Eugene Robinson argues that over decades of desegregation, affirmative action, and immigration, the concept of Black America has shattered. Instead of one black America, now there are four:• a Mainstream middle-class majority with a full ownership stake in American society;• a large, Abandoned minority with less hope of escaping poverty and dysfunction than at any time since Reconstruction’s crushing end; • a small Transcendent elite with such enormous wealth, power, and influence that even white folks have to genuflect; • and two newly Emergent groups—individuals of mixed-race heritage and communities of recent black immigrants—that make us wonder what “black” is even supposed to mean.Robinson shows that the four black Americas are increasingly distinct, separated by demography, geography, and psychology. They have different profiles, different mindsets, different hopes, fears, and dreams. What’s more, these groups have become so distinct that they view each other with mistrust and apprehension. And yet all are reluctant to acknowledge division. Disintegration offers a new paradigm for understanding race in America, with implications both hopeful and dispiriting. It shines necessary light on debates about affirmative action, racial identity, and the ultimate question of whether the black community will endure.",
  "genres": [
    "Nonfiction",
    "Race",
    "History",
    "Sociology",
    "African American",
    "Politics",
    "Social Justice"
  ],
  "author": "Eugene Robinson",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/7673369-disintegration"
}