{
  "title": "How to Remodel a Man: Tips and Techniques on Accomplishing Something You Know Is Impossible but Want to Try Anyway",
  "description": "Current research suggests there is a large group of people who have been trying to change men. For want of a better term, let's call these people \"women.\"Their urge is understandable. We've all had to take measures to accommodate men, because they are involved in nearly every aspect of modern life except maybe housework and they like to run things like corporate meetings and the planet. The only other alternative has been to try to avoid men altogether, which is pretty hard to do if you are interested in stuff like reproduction or having your oil changed.That's why How to Remodel a Man is so indispensable-it is a clear, step-by-step guide for anyone who wants to alter the character and behavior of a man, written by an actual man. Author W. Bruce Cameron provides startling insight into male pattern thinking, explaining why men can open a refrigerator and not see the mayonnaise, or how it is that they can throw dirty clothes at the hamper or in front of the hamper or even on top of the hamper and yet not seem capable of getting any of it in the hamper.Normally, changing a man has certain obstacles, including, but not limited to, the fact that it is impossible. But Cameron is able to overcome this hindrance because he, himself, has been remodeled. In a move so bold it may be shocking to people unaccustomed to such personal courage, Cameron turned himself over to the women in his life and asked them to change him. It started with a list of his flaws (Cameron came up with four; the women came up with one hundred seventy eight) and ended with him writing How to Remodel a Man , so that others could learn from his experience.If you're a woman, you'll be amazed to learn that men can be trained to perform all sorts of tricks, like using the instruments on the sides of their heads (the ears) to listen to you, and the space between those instruments to think about you.If you're a man, you've been given this book so that you'll see that it's possible to watch television without holding the remote or to ask for directions from strangers without suffering a catastrophic loss of testosterone. Cameron changed, and you can too.How to Remodel a Man is the essential guide for anyone in the awkward position of having to interact with a person of the male gender.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Comedy"
  ],
  "author": "W. Bruce Cameron",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/767808.How_to_Remodel_a_Man"
}