{
  "title": "Gunn's Golden Rules: Life's Little Lessons for Making It Work",
  "description": "On the runway of life, Tim Gunn is the perfect life coach.You've watched him mentor talented designers on the hit television show Project Runway. Now the inimitable Tim Gunn shares his personal secrets for \"making it work\"—in your career, relationships, and life. Filled with delightfully dishy stories of fashion's greatest divas, behind-the-scenes glimpses of Runway's biggest drama queens, and never-before-revealed insights into Tim's private life, Gunn's Golden Rules is like no other how-to book you've ever read.In the world according to Tim, there are no shortcuts to success. Hard work, creativity, and skill are just the beginning. By following eighteen tried-and-true principles, you can apply Tim's rules to anything you set your mind to. You'll learn why Tim frowns on displays of bad behavior, like the vitriolic outburst by Martha Stewart's daughter about her mother's name-brand merchandise. You'll discover the downfalls of divadom as he describes Vogue's André Leon Talley being hand-fed grapes and Anna Wintour being carried downstairs by her bodyguards. And you'll get Tim's view on the backstabbing by one designer on Project Runway and how it brilliantly backfired.Then there are his down-to-earth guidelines for making life better—for yourself and others—in small and large ways, especially in an age that favors comfort over politeness, ease over style. Texting at the dinner table? Wearing shorts to the theater? Not in Tim's book. Living a well-mannered life of integrity and character is hard work, he admits, but the rewards are many: being a good friend, being glamorous and attractive, and being a success— much like Tim himself!He is never one to mince words. But Tim Gunn is always warm, witty, wise, and wonderfully supportive— just the mentor you need to design a happy, creative, and fulfilling life that will never go out of style.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Fashion",
    "Self Help",
    "Adult",
    "Autobiography"
  ],
  "author": "Tim Gunn",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/7684650-gunn-s-golden-rules"
}