{
  "title": "Godric",
  "description": "Frederick Buechner's Godric \"retells the life of Godric of Finchale, a twelfth-century English holy man whose projects late in life included that of purifying his moral ambition of pride...Sin, spiritual yearning, rebirth, fierce asceticism--these hagiographic staples aren't easy to revitalize but Frederick Buechner goes at the task with intelligent intensity and a fine readiness to invent what history doesn't supply. He contrives a style of speech for his narrator--Godric himself--that's brisk and tough-sinewed...He avoids metaphysical fiddle, embedding his narrative in domestic reality--familiar affection, responsibilities, disasters...All on his own, Mr. Buechner has managed to reinvent projects of self-purification and of faith as piquant matter for contemporary fiction [in a book] notable for literary finish...Frederick Buechner is a very good writer indeed.\" — Benjamin DeMott, The New York Times Book Review\"From the book's opening sentence...and sensible reader will be caught in Godric's grip...Godric glimmers brightly.\" — Peter S. Prescott, Newsweek\"Godric is a memorable book...a marvelous gem of a book...destined to become a classic of its kind.\" — Michael Heskett, Houston Chronicle\"In the extraordinary figure of Godric, both stubborn outsider and true child of God, both worldly and unworldly, Frederick Buechner has found an ideal means of exploring the nature of spirituality. Godric is a living battleground where God fights it out with the world, the Flesh, and the Devil.\" — London Times Literary Supplement\"With a poet's sensibly and a high reverent fancy, Frederick Buechner paints a memorable portrait.\" — Edmund Fuller, The Wall Street Journal",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Christian",
    "Novels",
    "Classics",
    "Religion",
    "Christian Fiction"
  ],
  "author": "Frederick Buechner",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/76802.Godric"
}