{
  "title": "The Emperor of Ocean Park",
  "description": "A complex, smart mystery filled with intrigue, drama, and more than a little danger awaits in Stephen L. Carter's engaging debut novel, The Emperor of Ocean Park. After the funeral of his powerful father (a federal judge whose nomination to the U.S. Supreme Court became a public scandal), Talcott Garland, an African American law professor at an Ivy League university, is left to unravel the meaning of a cryptic note and carry out \"the arrangements\" his father left behind. Armed with fortitude and familial devotion--though paranoid of his wife's fidelity--Talcott soon finds himself in an investigation that entangles him with a number of questionable Washington, D.C., denizens, including attorneys and government officials, law professors, the FBI, shady underworld figures, chess masters, and friends and family. All the while Talcott tries not to hurt his attorney wife's chance for a judicial nomination--and their fragile marriage--but the closer he comes to unraveling his father's dark secrets, the more dangerous things become.  Clocking in at over 650 pages, the novel could easily have been streamlined; many of Talcott's thoughts are unnecessarily repeated. But Carter's storytelling skills are adept: tension builds, surprises are genuine, clues are not handed out freely. The prose, while somewhat meandering, can be crisp and insightful, as demonstrated in Carter's description of the misguided paths of young attorneys who sacrifice all on the altar of career... at last arriving... at their cherished career goals, partnerships, professorships, judgeships, whatever kind of ships they dream of sailing, and then looking around at the angry, empty waters and realizing that they have arrived with nothing, absolutely nothing, and wondering what to do with the rest of their wretched lives. --Michael Ferch",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "African American",
    "Contemporary",
    "Book Club"
  ],
  "author": "Stephen L. Carter",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/76837.The_Emperor_of_Ocean_Park"
}