{
  "title": "The Way We're Working Isn't Working: The Four Forgotten Needs That Energize Great Performance",
  "description": "The Way We’re Working Isn’t Working is one of those rare books with the power to profoundly transform the way we work and live. Demand is exceeding our capacity. The ethic of \"more, bigger, faster\" exacts a series of silent but pernicious costs at work, undermining our energy, focus, creativity, and passion. Nearly 75 percent of employees around the world feel disengaged at work every day. The Way We’re Working Isn’t Working offers a groundbreaking approach to reenergizing our lives so we’re both more satisfied and more productive—on the job and off. By integrating multidisciplinary findings from the science of high performance, Tony Schwartz, coauthor of the #1 bestselling The Power of Full Engagement, makes a persuasive case that we’re neglecting the four core needs that energize great sustainability (physical); security (emotional); self-expression (mental); and significance (spiritual). Rather than running like computers at high speeds for long periods, we’re at our best when we pulse rhythmically between expending and regularly renewing energy across each of our four needs. Organizations undermine sustainable high performance by forever seeking to get more out of their people. Instead they should seek systematically to meet their four core needs so they’re freed, fueled, and inspired to bring the best of themselves to work every day. Drawing on extensive work with an extra-ordinary range of organizations, among them Google, Ford, Sony, Ernst & Young, Shell, IBM, the Los Angeles Police Department, and the Cleveland Clinic, Schwartz creates a road map for a new way of working. At the individual level, he explains how we can build specific rituals into our daily schedules to balance intense effort with regular renewal; offset emotionally draining experiences with practices that fuel resilience; move between a narrow focus on urgent demands and more strategic, creative thinking; and balance a short-term focus on immediate results with a values-driven commitment to serving the greater good. At the organizational level, he outlines new policies, practices, and cultural messages that Schwartz’s client companies have adopted. The Way We’re Working Isn’t Working offers individuals, leaders, and organizations a highly practical, proven set of strategies to better manage the relentlessly rising demands we all face in an increasingly complex world.",
  "genres": [
    "Business",
    "Nonfiction",
    "Productivity",
    "Leadership",
    "Psychology",
    "Self Help",
    "Personal Development"
  ],
  "author": "Tony Schwartz",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/7679810-the-way-we-re-working-isn-t-working"
}