{
  "title": "Virgin and the Crab: Sketches, Fables and Mysteries from the early life of John Dee and Elizabeth Tudor",
  "description": "12 Years, 2 Kings, 3 Queens - the Ultimate Tudor NovelThe brilliant young mathematician and astronomer John Dee has one overwhelming obsession: liberty. Abandoned and in danger, Elizabeth Tudor has one simple aim: survival. This is their story.Against the background of the English Reformation, and threatened by a vengeful and unforgiving Queen, the mysterious brotherhood of the Rose Lodge attempts to guide the nation towards enlightenment and stability. Here, the special alchemy of the Virgin and the Crab works its magic: growing from childhood friendship, through adolescent flirtation, to mutual respect and admiration as together they prepare to sacrifice everything for the world they wish to inherit.VIDEO TRAILER‘Robert Parry has blended historical facts with fiction to produce an incredibly believable story. Is it “unputdownable”? – A resounding “yes!”‘ Claire Ridgway, The Anne Boleyn Files‘…a myriad of familiar characters fade in and out of the scenery…their characterizations are nothing short of masterful. A Reader’s Respite won’t hesitate to recommend this gem of a novel to you.’ Michele Jacobsen, A Reader’s Respite‘This remarkable novel by Robert Parry is one of the best Tudor novels I have ever read … Parry masterfully weaves fact and fiction, resulting in a completely original and authentic portrayal of the friendship and bond between Elizabeth Tudor and her illustrious mentor … a book to buy, read and cherish – a real Tudor treasure!’ Natalie Grueninger, onthetudortrail‘From the very first page to the last sentence I was held spellbound!’ Charla Wilson, Book Talk with Charla‘I highly recommend ‘Virgin and the Crab’ to all historical fiction lovers and especially to all who adore Elizabeth Tudor. It’s an exciting twist on Elizabeth’s path to the throne. Historically compelling and deliciously suspenseful!’ Michelle Miller Historical Fiction Connection and The True Book Addict‘… captures and holds the imagination long after the book is finished … the reader is transported through time as if witnessing a theatrical masterpiece (which it is!)’ Claudia Robinson, Luxury Reading'... you get engrossed in the setting, people and events from the opening page. Immediately, you are transported back to the Sixteenth Century and the reader feels as if they are an observer standing off in the corner just happy to be present but hoping to stay out of the frey!' Kimberly Eve, musings of a Writer ‘The descriptions of Tudor England’s social life and customs are rich and well written. The story is excellent and a page turner. A book well worth reading.’ Debra Spidal, Historical Novels Review Online‘I absolutely adored this book.’ Amanda, A Library of My Own",
  "genres": [
    "Historical Fiction",
    "Tudor Period",
    "British Literature",
    "16th Century",
    "Magic",
    "Psychology"
  ],
  "author": "Robert Stephen Parry",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/7683136-virgin-and-the-crab"
}