{
  "title": "Dmitry's Closet",
  "description": "\"A man like Dmitry was never irate. His coldness was only reflected in the manner in which he destroyed.\"Read the book that started the Russian Mafia Romance genre nearly a decade ago. From USA TODAY bestselling interracial author Latrivia S. Nelson (now Latrivia Welch), comes a story about a deadly faction of the Russian mafia and an innocent woman who threatens to dismantle their empire with the promise of forbidden love. The virginal recent college graduate, Royal Stone, is looking for employment in one of the country's toughest recessions. While desperately wondering downtown Memphis résumé in-hand, she stumbles upon the seven-foot, blonde billionaire Dmitry Medlov, who offers her a job as the manager of his new boutique, Dmitry's Closet.Royal Stone is in for a big surprise.After the clueless beauty accepts Dmitry's generous job offer, Royal soon accepts his extravagant gifts, his bed and his upscale lifestyle. What she does not know is that her knight in shining armor is also the head of the Medlov Organized Crime Family, a faction of the elite Russian mafia organization, Vory v Zakone.Dmitry Medlov faces a fork in the road.For the first time in his life, the brutal mob boss is introduced to happiness, but not everyone around him wants the lonely Czar to have a happy ending. Under investigation by a joint task force, working to uncover a conspiracy on his council and battling with the old guards to bring their organization into the 21st century, the last thing Dmitry Medlov needs is to lose focus. However, falling in love with Royal makes Dmitry want to break his coveted code, leave his self-made kingdom and start a life far away from the perils of the Thieves-in-Law. She is his purpose in life made flesh. But when his sociopathic brother, Ivan, comes to the Memphis bent on a murderous revenge, old sins resurface, and Royal becomes the unsuspecting target of Ivan's wrath. What neither of the men know, is that Royal is carrying a secret of her own. Who will win? Who will lose? Who will die? Watch all the skeletons as they tumble out of the interracial romantic suspense sensation, Dmitry's Closet. This book contains graphic language, sex, and various forms of violence. However, it will also melt your heart. How to Read the Dmitry's Closet (2010)Dmitry's Royal Rise of the Queen (2010)Anatoly Complete Reign (2011)",
  "genres": [
    "Romance",
    "Interracial Romance",
    "Contemporary Romance",
    "Contemporary",
    "Crime",
    "Erotica",
    "Mafia Romance"
  ],
  "author": "Latrivia S. Nelson",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/7679583-dmitry-s-closet"
}