{
  "title": "بائع الكتب في كابول",
  "description": "كيف هي الحياة اليومية في أفغانستان بعد سقوط حكومة طالبان، وخاصة في العاصمة كابول التي شهدت تحولات نوعية، وتعاقبت عليها مجموعة من المتغيرات المتناقضة، والأحداث السياسية المتتالية؟ يقدّم هذا الكتاب الاستثنائي، صور دقيقة وشاملة عن الأوضاع في بلد تقلّب على نار ملتهبة، تجيب على تساؤلات وفضول القارئ الذي تصله أخبار بعيدة ومتباعدة عن مستجدّاته، دون أن يتمّكن من تحديد معالم الحياة فيه ومعرفة تفاصيلها وانعكاسها على أرض الواقع، ومن فحوى وشكل يوميات الناس فيه. فالكاتبة الصحافية التي عوّدت القارئ على اقتحام الصعاب، ومواجهة التحديات في بلدان مشتعلة تمزّقها الحروب، من أجل إيصال تفاصيل ما يدور فعلاً وحقيقة على ساحة الأحداث وفي زوايا الميدان. \"لقد كتبتُ في هذه القصة كل ما رأيتُ وسمعتُ، كما حاولتُ أن أجمع انطباعاتي عن ذاك الربيع في كابول، كما عن انطباعات أولئك الذين حاولوا أن ينفضوا الشتاء عنهم وأن ينشدوا النماء والازدهار، وانطباعات أولئك الذين شعروا بأنه من المقدور عليهم أن يستمروا في \"أكل التراب\"..\". \"في ذلك الربيع كانت الآمال الضعيفة برحيل طالبان قد ومضت وأورقت. ولقد قوبل سقوط طالبان بالترحاب، ولم يعد ثمة أحد يخشى من أن يلجأ البوليس الديني إلى مضايقته في الشارع\". كان \"سلطان خان\" الأفغاني \"المحب لبلده حتى الشغف\"، وصاحب \"دكانً الكتب\"، أول الأشخاص الذين التقتهم الكاتبة عند وصولها إلى كابول. \"إنه يشعر أن بلاده تقوم بإذلاله بين كل وقت وأوان\"، فـ\"في بادئ الأمر، أقدم الشيوعيون على إحراق كتبي، ثم جاء المجاهدون بعد ذلك لتخريب المكتبة ونهبها، وأخيراً أكملت جماعة طالبان إحراق ما تبقى مرة جديدة\". من خلال حياة بائع الكتب وحياة عائلته الموسعة حيث انتقلت الكاتبة للعيش مع أفرادها، إذ كان لا بد لها \"من التجوال في صحبتهم، ومن العيش على طريقتهم\"، تطل الصحافية على واقع أفغانستان وتراثها وتقاليدها، وعلى اهتماماتها اليومية. تقول \"لقد أيقنت أن هذا البائع نفسه قطعة حيّة من تاريخ أفغانستان الثقافي\"، وأن تفاصيل حياة أفراد عائلته، بأفراحها وأحزانها وأحلام وطموحات شبابها، تعكس الوضع العام الأفغاني، وأن في فحوى تعاملها \"هي أفغانستان\".للتحميلhttp://www.4shared.com/get/sdeALdqN/_...",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "History",
    "Book Club",
    "Travel",
    "Books About Books"
  ],
  "author": "Åsne Seierstad",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/7682424"
}