{
  "title": "Christmas Mail-Order Brides: A Trusting Heart/The Prodigal Groom/Hidden Hearts/Mrs Mayberry Meets Her Match",
  "description": "Ride the transcontinental railroad as marriage arrives by mail-order—and just in time for Christmas. Annika arrives in Wyoming to discover her intended is missing. Jolie’s journey to Nevada is derailed by disaster. Elizabeth carries a load of secrets to Nebraska. And Amelia travels to California to wrap up her final attempts at matchmaking. Will the holiday season be the ticket to spark love in unexpected ways?A TRUSTING HEART by Carrie TuranskySwedish immigrant Annika Bergstrom travels to Wyoming as a mail order bride, but when her prospective groom, Chase Simms, disappears, she finds herself falling in love with his brother Daniel. Will she take hold of her chance for love, or wait for the man she has promised to marry?THE PRODIGAL GROOM by Vickie McDonoughJolie Addams is 18 and must leave the orphanage she grew up in. The headmaster has arranged for her to work for a lecherous benefactor. She decides to become a mail-order bride to escape what she fears would be a dreadful existence. But on the way to Nevada, her stage is robbed. She and a wounded passenger are stranded. They are rescued the next day, but Jolie’s intended refuses to marry her after she spent the night alone with Clay Jackson. She and Clay are forced to marry. Can a relationship and love grow from such an awful beginning?HIDDEN HEARTS by Therese StenzelAfter facing a series of tragic events, Elizabeth Lariby agrees to become a mail-order bride. Hoping to build a new life in Nebraska, she is determined to hide her grief-stricken heart from her new husband. Driven to be a success, Zane Michaels quietly obtains a wife through a mail-order bride society, but feels he must hide his past and his recent wealth from his new wife. When their secrets are revealed, will their fledgling marriage survive?MRS. MAYBERRY MEETS HER MATCH by Susan Page Davis Amelia Mayberry’s rewarding career as a matchmaker is winding down. She’d like to close shop and spend her sunset years in peace. There’s only one unfinished piece of business—an unsatisfied customer for whom she needs to set things right. The question is: will Lennox Bailey allow her to make amends?",
  "genres": [
    "Christmas",
    "Romance",
    "Christian Fiction",
    "Historical",
    "Historical Fiction",
    "Christian",
    "Holiday"
  ],
  "author": "Carrie Turansky",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/7685417-christmas-mail-order-brides"
}