{
  "title": "Gerard Reve. Kroniek van een schuldig leven 1. De vroege jaren 1923-1962",
  "description": "Gerard Reve (1923-2006) was een van de grootste Nederlandse schrijvers van de twintigste eeuw. Met zijn debuut De avonden (1947) schreef hij een roman die een klassieker zou worden, ook al zag het daar aanvankelijk niet echt naar uit. Verhalen als De ondergang van de familie Boslowits en Werther Nieland, de brievenboeken Op weg naar het einde en Nader tot u, romans als Oud en eenzaam, Moeder en zoon en Bezorgde ouders: het zijn allemaal geschriften die horen bij de canon van de literatuur. Zijn leven lang was Gerard Reve een omstreden auteur, die geregeld in de publiciteit kwam wegens zijn non-conformistisch optreden en zijn provocerende uitspraken. Hij was een van de bepalende figuren in het culturele leven van de tweede helft van de twintigste eeuw.In het eerste deel van de biografie wordt een schat aan nieuwe informatie over Gerard Reve's veelbewogen leven voor het eerst openbaar: over zijn jeugdjaren; de oorlogsperiode; zijn huwelijk met de dichteres Hanny Michaelis; de worsteling met zijn homoseksualiteit, zijn communistische verleden en de godsdienst; de achtergronden en de vaak moeizame totstandkoming van zijn werk. De door Reve in omloop gebrachte mythes worden ontrafeld; de verwevenheid van leven en werk wordt, voorzover mogelijk, vastgelegd.Mede dankzij de ruimhartige medewerking van Reve's laatste levenspartner Joop Schafthuizen, die Maas inzage gaf in het privé-archief van de schrijver en tevens toestemming verleende om ruimschoots te citeren uit de vele, tot dusver onbekende, originele Reve-teksten waar Maas de hand op wist te leggen, moet Gerard Reve - Kroniek van een schuldig leven bij voorbaat worden beschouwd als hét standaardwerk over Reve's leven en werken.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Dutch Literature"
  ],
  "author": "Nop Maas",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/7688009-gerard-reve-kroniek-van-een-schuldig-leven-1-de-vroege-jaren-1923-1962"
}