{
  "title": "Axiom-man",
  "description": "One night Gabriel Garrison was visited by a nameless messenger whobestowed upon him great power, a power intended for good. Once discoveringwhat this power was and what it enabled him to do, Gabriel became Axiom-man, a symbol of hope in a city that had none.One night after a routine patrol, a mysterious black cloud appears over the city. Flying over to investigate it, Axiom-man is stopped short when the cloud's presence shakes him to the core. An electrifying fear emanates from the cloud and he can barely get near it. Quickly, the cloud takes flight and leads him on a wild goose chase throughout the city, only to flee from him in the end. Almost immediately after the cloud's appearance, a new hero arises, Redsaw, clad in a black cape and cowl. The people, now enamored with this new super-powered marvel, seem to have forgotten about Axiom-man and all he's done for them. Except something's wrong. That same fear that emanated from the cloud drips off Redsaw like a foul smell and Axiom-man can barely get close to him without feeling ill. What is Redsaw's agenda and who is he? And why is it every time Axiom-man gets close to him it feels as if his powers are being sucked away? As if that wasn't enough, Gabriel's day job hasn't gotten any easier. His co-worker and the woman he adores, Valerie Vaughan, has little interest in him, and his boss has made it clear that one more day late to work will be the day he cleans out his desk. Then there's the new trainee, Gene Nemek. What is his fascination with Redsaw and why is he never around when Redsaw appears? From flying over city streets and soaring at dizzying heights, to balancing a secret identity with destiny, Axiom-man must discover what Redsaw's presence means and how it ties into the messenger's life-altering visit before the city-and the world-are enamored with an evil that has haunted the cosmos since the dawn of Time.",
  "genres": [
    "Superheroes"
  ],
  "author": "A.P. Fuchs",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/768935.Axiom_man"
}