{
  "title": "The Crown Conspiracy",
  "description": "THEY KILLED THE KING. THEY PINNED IT ON TWO MEN. THEY CHOSE POORLYThere is no ancient evil to defeat, no orphan destined for greatness, just two guys in the wrong place at the wrong time. Royce Melborn, a skilled thief, and his mercenary partner, Hadrian Blackwater make a profitable living carrying out dangerous assignments for conspiring nobles until they become the unwitting scapegoats in a plot to murder the king. Sentenced to death, they have only one way out...and so begins this tale of treachery and adventure, sword fighting and magic, myth and legend.ABOUT THE SERIESThe Crown Conspiracy is the first book in the captivating Riyria Revelations. Instead of a string of sequels this six-book fantasy series was conceived as a single epic tale divided into individual episodes. All were written before the first was released so that plot elements are intertwined, yet each book has its only story and conclusion.Originally indie published, the series was purchased by Orbit (fantasy imprint of Hachette Book Group) and will be released as a trilogy in three consecutive months starting in November 2011. The original books are now out of print, but you can get The Crown Conspiracy by purchasing Theft of Swords .OMNIBUS EDITIONS (Orbit Publishing)Theft of Swords (November 2011) contains The Crown Conspiracy & AvemparthaRise of Empire (December 2011) contains Nyphron Rising & The Emerald StormHeir of Novron (January 2012) contains Wintertide & PercepliquisBOOKS OF THE RIYRIA REVELATIONS (First Edition Versions - Out of Print)The Crown Conspiracy (October 2008)Avempartha (April 2009)Nyphron Rising (October 2009)The Emerald Storm (April 2010)Wintertide (October 2010)Percepliquis* (January 2012)*Will be released as a standalone limited edition coinciding with Heir of Novron release to allow for completion of series in its original format.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Adventure",
    "Audiobook",
    "Magic"
  ],
  "author": "Michael J. Sullivan",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/7688753-the-crown-conspiracy"
}