{
  "title": "Oriental Odyssey V - From Baghdad to Stambul",
  "description": "Those of you dear readers who have enjoyed this ongoing narrative that took us through the Sahara, Egypt, Iraq, Kurdistan, Iran and back to Iraq can now enjoy the two shorter adventures that take place in Damascus, Baalbek and Stambul. Although these narratives are short, they are packed with excitement. This brief novel is the culmination of so many actions begun in earlier episodes of this epic story. Here we rediscover the protagonist Abrahim Mamur, the vengeance seeking Omar Ben Sadek, the Greek Kolettis, Nasir Agassi of the Jesidi tale, Isla Ben Maflei and his bride Senitza. We even stumble upon the Barber from Jüterbogk and finally get to hear the saga of Galingré whose corpse was first discovered in the sands of the world’s greatest desert. It almost seems that this novel is about to lead us to the culmination of an epic journey. Kara Ben Nemsi is preparing to return home to his Fatherland so that he may write about the adventures he experienced. Yet as past events are resolved, a new thread is spun and our quest for justice continues. This novel is thus the gateway to a mystery that will not be resolved until the end of the greater tale that is called the ‘Oriental Odyssey’. It must be remembered that at the time these narratives were written, Karl May was writing many other manuscripts and no longer wrote exclusively for the ‘Deutscher Hausschatz’. Upon the completion of this volume, a long time passed before the remainder of this gigantic novel was published. One must note that the next volume contains a note that excuses the long gap in publication by mentioning that the author had gone to Egypt shortly after his return to Germany. I hope that you, the reader, will not have to wait long for the next part of this gripping adventure, involving the characters Kara Ben Nemsi and Hajji Halef Omar. Yet I too have many manuscripts piled upon my desk that require my urgent attention. Indeed we will continue to publish the translated work of Karl May and true to his style I invite you, dear readers, to follow me further on our epic journey through the Turkish Empire and beyond. I thank you for your past patronage and ask you to patiently await the completion of the sixth book of this series; ‘Oriental Odyssey VI’ – ‘In the Balkan Gorges’.",
  "genres": [
    "Adventure",
    "Fiction",
    "German Literature",
    "Westerns",
    "Classics",
    "Indonesian Literature",
    "Novels"
  ],
  "author": "Karl May",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/768653.Oriental_Odyssey_V_From_Baghdad_to_Stambul"
}