{
  "title": "Our Bodies, Ourselves and the Work of Writing",
  "description": "Our Bodies, Ourselves , first published by a mainstream press in 1973, is now in its eighth major edition. It has been translated into twenty-nine languages, has generated a number of related projects, and, with over four million copies sold, is as popular as ever. This study tells the story of the first two decades of the pioneering best-seller―a collectively produced guide to women's health―from its earliest, most experimental and revolutionary years, when it sought to construct a new, female public sphere, to its 1984 revision, when some of the problems it first posed were resolved and the book took the form it has held to this day. Wells undertakes a rhetorical and sociological analysis of the best-seller and of the work of the Boston Women's Health Book Collective that produced it. In the 1960s and 1970s, as social movements were on the rise and many women entered higher education, new writing practices came into existence. In the pages of Our Bodies, Ourselves , matters that had been private became public. Readers, encouraged to trust their own experiences, began to participate in a conversation about health and medicine. The writers of Our Bodies, Ourselves researched medical texts and presented them in colloquial language. Drafting and revising in groups, they invented new ways of organizing the task of writing. Above all, they presented medical information by telling stories. We learn here how these stories were organized, and how the writers drew readers into investigating both their own bodies and the global organization of medical care. Extensive archival research and interviews with the members of the authorial collective shed light on a grassroots undertaking that revolutionized the writing of health books and forever changed the relationship between health experts and ordinary women.",
  "genres": [],
  "author": "Susan Wells",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/7694119-our-bodies-ourselves-and-the-work-of-writing"
}