{
  "title": "Four Cheeks to the Wind: The Story of a Two Year Transcontinental Bicycle Ride",
  "description": "Unfit and overweight at the age of 58 in 2002, Mary set off with her partner Warren to cycle round the world. They cycled for 2 years through 15 countries and 3 continents without backup or support, through areas not usually visited by tourists. Travelling through Europe, Asia and Australia with heavily-laden bicycles (including camping gear), they cycled 9000 miles before their trip was tragically cut short. From France to Turkey, India to Sri Lanka, Japan and Burma to Vietnam, Laos and Cambodia, from Thailand to Australia - all are described in detail and with humour. Their journey proved that anyone with a dream can make it a reality.Illustrated with colour photos.Several simple recipes are also included, which were collected on their travels, so that readers can enjoy them too.“The book is so well written, and details of places, people, animals, plants and scenery are brilliantly described. I felt I was there without the hassle of having to do the journey for myself.”\"I had trouble putting the book down. I found it so much of an escapism from everyday life reading about your travels and adventures. You described everything with so much clarity and detail. I felt I was with you every step/cycle pedal revolution of the way.\"“Once I started reading it, I couldn’t put it down. It was so descriptive that I felt I was travelling alongside the author, and there are lots of amusing anecdotes. Would definitely recommend this book.”“This book was very interesting with exactly the right amount of information on each place visited. A very good read.”“I think Mary Bryant is up there with Josie Dew, Anne Mustoe. So far I love it.”“Very descriptive book giving you the highs and lows of travelling. I felt as if I was with them sometimes.”\"This was bought as a birthday present and was well received. Had a sneaky look myself and found it very interesting.\"\"My congratulations and thanks for sharing your tale with us in ‘Four Cheeks to the Wind’. A thoroughly enjoyable read that you took us along as if we were with you. One of the best travel tales, if not the best, that I have read.\"\"Well done on your wonderful, enjoyable book.\"\"I have loved reading your book. What a wonderful adventure you both had.\"\"I have very much enjoyed reading about your travels at the rate of a few pages of the book a day. It has an appealing freshness of vision and I am struck by your thoroughness in recording your memories.\"\"I didn't start it until last weekend, but then I couldn't put it down.\"\"Mary's account of her transcontinental bike ride is packed with fascinating facts, anecdotes and photographs of the exotic places and people encountered en route. Worth its place on the armchair traveller's bookshelf.\"",
  "genres": [
    "Nonfiction",
    "Cycling",
    "Travel"
  ],
  "author": "Mary Bryant",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/7696928-four-cheeks-to-the-wind"
}