{
  "title": "Einstein: A Life in Science",
  "description": "To the modern world, Albert Einstein is the archetypal scientist. His name is synonymous with genius, his image is instantly recognized, and his life's work is universally acknowledged as the bedrock of contemporary physics. In this absorbing book by the authors of \nStephen Hawking: A Life in Science\n, Einstein's life and work are recounted in an unprecedentedly accessible way. Although his most important work dates from 1905, the figure of Einstein still towers over the twentieth century. The one equation everyone knows is E=mc², but most of us could not explain what it means. The man to explain it is John Gribbin, a masterful science writer, who elucidates the special and general theories of relativity, as well as electromagnetism, space-time, and other mysteries. Along with lucid descriptions of Einstein's milestone contributions, Gribbin recounts his debates with fellow scientists and the failures that shadowed his later scientific life. Einstein was also a political activist, violin player, and family man. The twists and turnings of his life, so closely linked to the turbulent history of the era, are nimbly charted by Michael White. The questions White tackles are personal ones: What became of Einstein's illegitimate child? Did his first wife, Mileva, contribute to the early, groundbreaking work? We learn of Einstein's possible schizophrenia early in life, his two marriages, his friendships with such figures as Franz Kafka and Bertrand Russell, and the search for security and sanctuary that led him from one country to another in Europe, and then from Nazi Germany to his tenure as a \"scientific saint\" in America. White portrays Einstein as a man brimming with paradoxes—a pacifist who advocated the creation of an atomic weapons program, a man who hated regimentation but who was beguiled by the strict beauty of mathematics, an atheist and a dedicated Zionist, a figure revered by the world yet kept under surveillance by the FBI.",
  "genres": [
    "Biography",
    "Science",
    "Nonfiction",
    "Physics",
    "History",
    "History Of Science",
    "Collections"
  ],
  "author": "Michael  White",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/7695181-einstein"
}