{
  "title": "All God's Angels, Beware!",
  "description": "Sewn hardcover, limited to 350 copies, 336 pp with endpapersThe house of literary Romanticism has fallen into sad disrepair. Through its dusty passages are to be heard only the muffled, shivering voices of its ghosts, like the last lingering echoes of some forgotten passion in a lunatic asylum. It has been said that, in the grounds of this ruin, was a hothouse where Romanticism showed its last, grotesque bloom in the form of H. P. Lovecraft, since when the grey desolation of realism has swept over all in a fungoid blight. And yet, there remains a kind of life here, perhaps stranger still than previous blooms, in a weedy and overgrown flowerbed, under the name of Quentin S. Crisp. All God’s Angels, Beware!, the fourth collection of fiction from the contemporary British master of dementia, gathers together for the first time ten examples of Crisp’s own unique species of decayed Romanticism.“Karakasa” is an Orientalist masquerade of decayed futurity. “The Were-Sheep of Abercrave” offers a shaggy-dog tale of such shagginess that its coat has been shaped into a bizarre topiary maze. “Asking For It” sketches a picture of sad singledom amongst the rootless of Tokyo. “The Fox Wedding” brings Far Eastern folklore to a modern setting, with some unpleasant surprises. “Italiannetto” is a sunny, nostalgic love story with Neapolitan style. In “Troubled Joe”, a ghost tethered to this world by chains of resentment searches for someone to hear his story. “Mise en Abyme” presents an escheresque trompe-l’aeil in prose, while in the stunning novella “Ynys-y-Plag” you will discover a weird tale in the tradition of Blackwood and Machen.In these and other stories, Crisp draws equally from East and West to create a vision of the macabre like nothing else in literature. Discover here fleurs du mal of hybrid decadence, whimsy, exoticism, gothickry, horror and beauty.ContentsTroubled JoeThe Were-Sheep of AbercraveYnys-y-PlagKarakasaA Cup of TeaAsking For ItThe Fox WeddingMise en AbymeItaliannettoSuicide Watch",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Weird Fiction"
  ],
  "author": "Quentin S. Crisp",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/7694877-all-god-s-angels-beware"
}