{
  "title": "Selling the Invisible: A Field Guide to Modern Marketing",
  "description": "You can't touch, hear, or see your company's most important products... So how do you sell, develop, make them grow? That's the problem with services. This \"phenomenal\" book, as one reviewer called it, answers that question with insights on how markets work and how prospects think. A treasury of hundreds of quick, practical, and easy-to-read strategies-few are more than a page long-Selling the Invisible will open your eyes to new ideas in this crucial branch of marketing, including: * Why focus groups, value-price positioning, discount pricing, and being the best usually fail * The critical emotion that most influences your prospects-and how to deal with it * The vital role of vividness, focus, \"anchors,\" and stereotypes * The importance of Halo, Cocktail Party, and Lake Wobegon Effects * Marketing lessons from black holes, grocery lists, the Hearsay Rule, and the fame of the Matterhorn * Dozens of proven yet consistently over-looked ideas for research, presentations, publicity, advertising, and client retention ...and much more. Based on the author's twenty-five years of experience with thousands of business professionals, this book delivers its wisdom with unforgettable and often surprising examples-from Federal Express, Citicorp, and a growing Greek travel agency...to an ingenious baby-sitter, Fran Lebowitz, and the colors of oranges and lemons. The first guide of its kind and a book already causing a sensation in the business community, Selling the Invisible will help anyone marketing a service, a product, or a career. Read it, and you almost certainly will understand why two advance reviewers call it the best book on business ever written.",
  "genres": [
    "Business",
    "Nonfiction",
    "Buisness",
    "Psychology",
    "Entrepreneurship",
    "Management",
    "Communication"
  ],
  "author": "Harry Beckwith",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/769443.Selling_the_Invisible"
}