{
  "title": "Honor Thyself",
  "description": "A world-renowned actress falls victim to a terrifying explosion in Paris--and begins a courageous journey of survival, memory, and self-discovery in Danielle Steel's mesmerizing new novel.Carole Barber has come to Paris, with its rain-slick slate roofs and winding streets, to work on her novel--and to find herself after a lifetime in the spotlight. A legend of film and stage, Carole has set a standard of beauty and grace, devoting herself to her family and causes around the world. But on this cool November evening, as her taxi speeds into a tunnel just past the Louvre, a fiery instant of terror shatters hundreds of lives--and leaves Carole alone, unconscious and unidentified in a Paris emergency room.At the Ritz, they wonder where their famous, incognito guest has gone. From California to London, Carole's friends and family begin to make inquiries. Then comes a moment of shock as they all realize that Carole is far from home and fighting for her life.In the days that follow, the paparazzi swarm. A mysterious stranger, a man famous in his own realm, quietly visits the hospital to see the woman he once loved and never forgot. Carole's two grown children rush to her bedside, waiting and praying--until the miraculous begins to happen.But as a woman who the whole world knows slowly awakens, she knows nothing of herself. Every detail must be pieced back together--from a childhood in rural Mississippi to the early days of her career, from the unintentional hurt inflicted on her daughter to a fifteen-year-old secret love affair that went tragically wrong. But for Carole an extraordinary opportunity has arisen in a life-threatening crisis: a second chance to count her blessings, heal wounded hearts, recapture lost love--and to live a life that will truly honor others: beginning with herself.A tale of survival and dignity, of small miracles and big surprises, Honor Thyself creates an unforgettable portrait of a public figure whose hopes, fears, and heartbreaks are as real as our own. Her courageous journey inspires us all.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Audiobook",
    "Mystery",
    "Drama"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/1306744.Honor_Thyself"
}