{
  "title": "The True Memoirs of Little K",
  "description": "Exiled in Paris, tiny, one-hundred-year-old Mathilde Kschessinska sits down to write her memoirs before all that she believes to be true is forgotten. A lifetime ago, she was the vain, ambitious, impossibly charming prima ballerina assoluta of the tsar’s Russian Imperial Ballet in St. Petersburg. Now, as she looks back on her tumultuous life, she can still recall every slight she ever suffered, every conquest she ever made.Kschessinka’s riveting storytelling soon thrusts us into a world lost to time: that great intersection of the Russian court and the Russian theater. Before the revolution, Kschessinska dominated that world as the greatest dancer of her age. At seventeen, her crisp, scything technique made her a star. So did her romance with the tsarevich Nicholas Romanov, soon to be Nicholas II. It was customary for grand dukes and sons of tsars to draw their mistresses from the ranks of the ballet, but it was not customary for them to fall in love.The affair could not endure: when Nicholas ascended to the throne as tsar, he was forced to give up his mistress, and Kschessinska turned for consolation to his cousins, two grand dukes with whom she formed an infamous ménage à trois. But when Nicholas’s marriage to Alexandra wavered after she produced girl after girl, he came once again to visit his Little K. As the tsar’s empire—one that once made up a third of the world—began its fatal crumble, Kschessinka’s devotion to the imperial family would be tested in ways she could never have foreseen.In Adrienne Sharp’s magnificently imagined novel, the last days of the three-hundred-year-old Romanov empire are relived. Through Kschessinska’s memories of her own triumphs and defeats, we witness the stories that changed history: the seething beginnings of revolution, the blindness of the doomed court, the end of a grand, decadent way of life that belonged to the nineteenth century. Based on fact, The True Memoirs of Little K is historical fiction as it’s meant to be written: passionately eventful, crammed with authentic detail, and alive with emotions that resonate still.",
  "genres": [
    "Historical Fiction",
    "Russia",
    "Fiction",
    "Historical",
    "Romanovs",
    "Russian Revolution",
    "Romance"
  ],
  "author": "Adrienne Sharp",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/7697730-the-true-memoirs-of-little-k"
}