{
  "title": "The Liar's Lullaby",
  "description": "Edgar Award winner Meg Gardiner returns with a third propulsive, groundbreaking thriller about forensic psychiatrist Jo Beckett and the lies that are even more dangerous than fame.Tasia McFarland is a washed-up country-pop singer desperate for the break that will get her topping the charts again. The tabloids have raked over every part of Tasia's rocky life, following every high and low, her addictions, her breakdowns, her increasingly erratic behavior-and every broken relationship. The highlight of this lowlight her failed marriage to an ambitious Army officer whose political talents earned him a spot in the nation's highest office. Tasia McFarland is the ex-wife of the President of the United States.So when Tasia writes a song with politically-charged lyrics, people take note and her star begins to rise anew. In the spectacle-driven opener of her comeback tour, she is lowered into a stadium on a zip line and as helicopters fly overhead she fires her prop Colt 45 at the fireworks-filled stage. Tasia is riding high.Until she's killed by a bullet to the neck, before the shocked crowd of 40,000.When video can't prove that the shot came from Tasia's own Colt .45 and the ballistics report comes up empty, the authorities call on forensic psychiatrist Jo Beckett to do a psychological autopsy and clean up the potential political disaster. But as Jo sifts through the facts, she only finds more questions. Was Tasia's gun loaded? Did she kill herself in one last cry for attention? Were her politically-charged lyrics the rantings of a paranoid woman losing her grip? Or warnings from a woman afraid and in danger? For Jo, pouring over Tasia's past quickly becomes a race to extinguish the conspiracy rumor mill before it incites a level of violence that reaches America's highest corridors of power-and tears apart the very fabric of our nation.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Crime",
    "Adult Fiction"
  ],
  "author": "Meg Gardiner",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/7697894-the-liar-s-lullaby"
}