{
  "title": "The Control of Nature",
  "description": "While John McPhee was working on his previous book, Rising from the Plains, he happened to walk by the engineering building at the University of Wyoming, where words etched in limestone said: \"Strive on--the control of Nature is won, not given.\" In the morning sunlight, that central phrase--\"the control of nature\"--seemed to sparkle with unintended ambiguity. Bilateral, symmetrical, it could with equal speed travel in opposite directions. For some years, he had been planning a book about places in the world where people have been engaged in all-out battles with nature, about (in the words of the book itself) \"any struggle against natural forces--heroic or venal, rash or well advised--when human beings conscript themselves to fight against the earth, to take what is not given, to rout the destroying enemy, to surround the base of Mt. Olympus demanding and expecting the surrender of the gods.\" His interest had first been sparked when he went into the Atchafalaya--the largest river swamp in North America--and had learned that virtually all of its waters were metered and rationed by a U.S. Army Corps of Engineers' project called Old River Control.In the natural cycles of the Mississippi's deltaic plain, the time had come for the Mississippi to change course, to shift its mouth more than a hundred miles and go down the Atchafalaya, one of its distributary branches. The United States could not afford that--for New Orleans, Baton Rouge, and all the industries that lie between would be cut off from river commerce with the rest of the nation. At a place called Old River, the Corps therefore had built a great fortress--part dam, part valve--to restrain the flow of the Atchafalaya and compel the Mississippi to stay where it is.In Iceland, in 1973, an island split open without warning and huge volumes of lava began moving in the direction of a harbor scarcely half a mile away. It was not only Iceland's premier fishing port (accounting for a large percentage of Iceland's export economy) but it was also the only harbor along the nation's southern coast. As the lava threatened to fill the harbor and wipe it out, a physicist named Thorbjorn Sigurgeirsson suggested a way to fight against the flowing red rock--initiating an all-out endeavor unique in human history. On the big island of Hawaii, one of the world's two must eruptive hot spots, people are not unmindful of the Icelandic example. McPhee went to Hawaii to talk with them and to walk beside the edges of a molten lake and incandescent rivers.Some of the more expensive real estate in Los Angeles is up against mountains that are rising and disintegrating as rapidly as any in the world. After a complex coincidence of natural events, boulders will flow out of these mountains like fish eggs, mixed with mud, sand, and smaller rocks in a cascading mass known as debris flow. Plucking up trees and cars, bursting through doors and windows, filling up houses to their eaves, debris flows threaten the lives of people living in and near Los Angeles' famous canyons. At extraordinary expense the city has built a hundred and fifty stadium-like basins in a daring effort to catch the debris.Taking us deep into these contested territories, McPhee details the strategies and tactics through which people attempt to control nature. Most striking in his vivid depiction of the main contestants: nature in complex and awesome guises, and those who would attempt to wrest control from her--stubborn, often ingenious, and always arresting characters.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "History",
    "Environment",
    "Essays",
    "Geology"
  ],
  "author": "John McPhee",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/77.The_Control_of_Nature"
}