{
  "title": "Peace Like a River",
  "description": "Leif Enger’s debut is an extraordinary novel—an epic of generosity and heart that reminds us of the restorative power of great literature. The story of a father raising his three children in 1960s Minnesota, Peace Like a River is at once a heroic quest, a tragedy, a love story, and a haunting meditation on the possibility of magic in the everyday world.Raised on tales of cowboys and pirates, eleven-year-old Reuben Land has little doubt that miracles happen all around us, and that it’s up to us to “make of it what we will.” Reuben was born with no air in his lungs, and it was only when his father, Jeremiah, picked him up and commanded him to breathe that his lungs filled. Reuben struggles with debilitating asthma from then on, making him a boy who knows firsthand that life is a gift, and also one who suspects that his father is touched by God and can overturn the laws of nature.The quiet midwestern life of the Lands is upended when Davy, the oldest son, kills two marauders who have come to harm the family; unlike his father, he is not content to leave all matters of justice in God’s hands. The morning of his sentencing, Davy—a hero to some, a cold-blooded murderer to others—escapes from his cell, and the Lands set out in search of him. Their journey is touched by serendipity and the kindness of strangers—among them a free spirit named Roxanna, who offers them a place to stay during a blizzard and winds up providing them with something far more permanent. Meanwhile, a federal agent is trailing the Lands, convinced they know of Davy’s whereabouts.With Jeremiah at the helm, the family covers territory far more extraordinary than even the Badlands where they search for Davy from their Airstream trailer. Sprinkled with playful nods to biblical tales, beloved classics such as Huckleberry Finn, the adventure stories of Robert Louis Stevenson, and the westerns of Zane Grey, Peace Like a River unfolds like a revelation.",
  "genres": [
    "Fiction",
    "Book Club",
    "Historical Fiction",
    "Literary Fiction",
    "Novels",
    "Coming Of Age",
    "Adult Fiction"
  ],
  "author": "Leif Enger",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/77006.Peace_Like_a_River"
}