{
  "title": "Cat Flight From Birdland",
  "description": "I am a cat. For nineteen years I watched my partner Joe Rhymes flit about the hyper-kinetic birdland that is Hollywood, making us rich on a string of second-rate B-movies. Last year Joe took advantage of my earthbound lethargy to cuckold me with my wife Xyla and cut me out of our latest project with a criminal Bulgarian vulture.What cat wouldn't have been irritated? Unfortunately, in a misguided fit of pique I pilfered the Bulgarian's $9,999,900 in seed money. The cash, it turned out, belonged to the Bulgarian's masters in the international criminal Consortium he worked for. The theft landed Joe and the Bulgarian in a mortuary and sent me fleeing nine time zones away to my mother's garden in Bruxelles.Everything I know about international flight and skullduggery I learned from a B-movie. It's a miracle that I have lived to tell the tale. Especially when it turned out that the Consortium's real ambition had nothing to do with the money. They wanted me--or more precisely, they wanted my mother, who took her own life eighteen years ago in a Prague hotel room.No, mom never learned to bake cookies, but I still had no idea what she did to irritate the Consortium. As it turned out, my impulsive theft re-opened an old wound or two and convinced those secretive gentlemen that mom had told me things no child should ever hear. Things about the seedy way they had come by their stacks of loot.I tried to reason with them, but in their bureaucratic world the simplest solution was to put me out of their misery. Obviously, my Belgian cat-fancier Nellie and I demurred.I'm looking for book sales here, people, not pity. Just how long do you expect me to live on $9,999,900 anyway? But if you can't spare a dime for nothing, don't worry about it. All I ask is that you buy a copy. Just one.",
  "genres": [],
  "author": "James Lockhart Perry",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/13067531-cat-flight-from-birdland"
}