{
  "title": "Lendas e Narrativas",
  "description": "Biblioteca Ulisseia de Autores Portugueses #27Publicadas em dois volumes, em 1851, estas “Lendas e Narrativas” de Alexandre Herculano são uma coletâneo de histórias publicadas entre 1839 e 1844 nas revistas O Panorama e A Ilustração. Os contos das “Lendas e Narrativas” são:A Destruição de Áuria – Conto do Século VIII, sobre a destruição da cidade visigótica de Áuria (atual Ourense) pela invasão dos mouros na Península Ibérica.O Alcaide de Santarém – Conto do Século X, tendo como pano de fundo a corte do califa mouro al-munimim, no ano de 950 em que este é engano por um dos seus alcaides a matar o próprio filho.A Dama Pé de Cabra – Lenda do Século XI, em que um nobre encontra, durante uma das suas caçadas, uma mulher-demónio na floresta, pela qual se apaixona.O Bispo Negro – Lenda do ano 1130, ano em que D. Afonso Henriques foi excomungado pelo Papa (bula posteriormente retirada) por ter prendido a própria mãe e levantado armas contra o seu avô, e o que ele fez em resposta ao Bispo de Coimbra.A Morte do Lidador – Lenda do ano 1170 sobre o nobre Gonçalo Mendes da Maia que decidiu celebrar o aniversário dos seus 95 anos com um ataque aos mouros, mesmo sabendo de antemão que o seu exército era inferior em número.O Emprazado – Lenda castelhana de 1312 sobre a maldição que recaiu ao rei D. Fernando de Castela por ter condenado, injustamente, dois cavaleiros por um crime que não cometeram.O Mestre Assassinado – Crónica sobre o fim da ordem dos templário no ano de 1320.Arras por Foro de Espanha – Narrativa sobre as motivações que levaram, no ano 1372 à guerra luso-castelhana durante o reinado de D. Fernando.O Castelo de Faria – Lenda do ano 1373, sobre o sacrifício do governador de Faria para impedir que os castelhanos tomassem terras de Portugal durante a guerra luso-castelhana de 1300.A Abóbada – Lenda sobre a construção do Mosteiro da Batalha, pelo arquitecto Mestre Afonso Domingues, que o delineou, mas que ficou cego durante processo, passando o cargo para o arquitecto irlandês Mestre Ouguet que foi incapaz de projetar a abóbada principal e que Domingues, apesar de cego, terminou.Mestre Gil – Conto do século XV (1481-84) que relata os episódios do início do reinado de D. João II, sobretudo as conspirações lideradas pelo duque de Bragança e pelo duque de Viseu, este último assassinado pelo próprio rei.Três Meses em Calecut – Conto do século XV que relata os primeiros tempos da presença portuguesa na Índia, após a descoberta do caminho marítimo por Vasco da Gama.O Cronista – Conto no ano de 1535, ano das negociações entre Portugal e Roma para o estabelecimento da Inquisição durante o reinado de D. João III, em que um cronista real descobre um manuscrito que serve de aviso ao mal que tais negociações poderiam trazer ao país.\".......Publicadas em dois volumes, em 1851, estas “Lendas e Narrativas” de Alexandre Herculano são uma coletâneo de histórias publicadas entre 1839 e 1844 nas revistas O Panorama e A Ilustração. Nelas Herculano aborda vários períodos da história da Península Ibérica. É evidente a preferência do autor pela Idade Média, época em que, segundo ele, se encontravam as raízes da nacionalidade portuguesa. No prefácio original, Herculano considera as pequenas narrativas “monumentos dos esforços do autor para introduzir na literatura nacional um género amplamente cultivado, nestes nossos tempos, em todos os países da Europa”, esperando que venham a constituir “a sementinha de onde proveio a floresta”, “um marco humilde e rude” na história literária portuguesa.Alexandre Herculano foi o principal responsável pela introdução e pelo desenvolvimento da narrativa histórica em Portugal tal como Walter Scott foi em Inglaterra e Vítor Hugo na França.",
  "genres": [
    "Portugal",
    "Short Stories",
    "Portuguese Literature",
    "Romance",
    "Historical",
    "Classics",
    "History"
  ],
  "author": "Alexandre Herculano",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/7697032-lendas-e-narrativas"
}