{
  "title": "Vou Contar-te um Segredo",
  "description": "Em Vou contar-te um segredo, Margarida Rebelo Pinto regressa mais uma vez ao tom intimista das mini-ficções publicadas no Jornal de Notícias. Com agilidade narrativa, a autora surpreende-nos com comédias românticas nada convencionais que misturam o tom confessional e o humor, crónica de costumes e vidas secretas, o riso e o choro. São pequenas grandes histórias de amor repletas de sentimentos e segredos vividos por personagens surpreendentemente parecidos com todos nós; mulheres maduras que são eternas adolescentes, homens indecisos ou prepotentes, rapazes apaixonados e sonhadores, amigos próximos e amantes distantes, donas de casa desesperadas e pilotos que nunca voaram.Para ler uma de cada vez, e saborear a colheres de chá.Excerto\"A vida é tua, tens de ser tu a vivê-la, não podes deixar que ela passe por ti, tu é que passas por ela. E quando todas as laranjas caírem, apanha-as com cuidado, guarda-as num cesto e muda de profissão. O circo é para quem não tem casa nem país, não é vida para ninguém. Guarda as laranjas num cesto, leva-as para casa e faz um bolo de saudades para esquecer a mágoa. E nunca deixes de sonhar que, um dia, tal como eu, vais encontrar alguém mais próximo e mais generoso, que te ensine a ser feliz, mesmo com todas as pedras que encontrarem no caminho. Larga as laranjas e muda de vida. A vida vai mudar contigo.\"Críticas de imprensa\"Um dos casos mais fascinantes é o de Margarida Rebelo Pinto, que mostra como se podem contar histórias, se podem emocionar os leitores…\"Diário Económico\"Margarida Rebelo Pinto escreve essencialmente sobre o amor, a vida e as relações e disso nunca nos conseguimos cansar o suficiente. Fá-lo de uma forma completamente original. E com grande naturalidade.\"Starstyle - Holanda\"Entre todos os escritores que melhor reflectiram este estado de espírito, criando uma nova literatura - o actual realismo urbano total -, Margarida Rebelo Pinto é um dos mais excelentes.\"Jornal de Letras\"Margarida ajudou a familiarizar centenas de milhares de pessoas com o objecto-livro, pôs as editoras à procura de jovens autores portugueses e libertou os escritores tradicionais de uma série de complexos.\"Grande Reportagem\"É fácil entender por que Margarida Rebelo Pinto faz sucesso em Portugal: seu texto é leve, bem-humorado e cheio de reflexões sobre relacionamentos.\"Marie Claire - Brasil",
  "genres": [],
  "author": "Margarida Rebelo Pinto",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/7703420-vou-contar-te-um-segredo"
}