{
  "title": "Between the Devil and the Deep Blue Sea: Merchant Seamen, Pirates and the Anglo-American Maritime World, 1700-1750",
  "description": "The common seaman and the pirate in the age of sail are romantic historical figures who occupy a special place in the popular culture of the modern age. And yet in many ways, these daring men remain little known to us. Like most other poor working people of the past, they left few first-hand accounts of their lives. But their lives are not beyond recovery. In this book, Marcus Rediker uses a huge array of historical sources (court records, diaries, travel accounts, and many others) to reconstruct the social cultural world of the Anglo-American seamen and pirates who sailed the seas in the first half of the eighteenth century. Rediker tours the sailor's North Atlantic, following seamen and their ships along the pulsing routes of trade and into rowdy port towns. He recreates life along the waterfront, where seafaring men from around the world crowded into the sailortown and its brothels, alehouses, street brawls, and city jail. His study explores the natural terror that inevitably shaped the existence of those who plied the forbidding oceans of the globe in small, brittle wooden vessels. It also treats the man-made terror--the harsh discipline, brutal floggings, and grisly hangings--that was a central fact of life at sea. Rediker surveys the commonplaces of the maritime the monotonous rounds of daily labor, the negotiations of wage contracts, and the bawdy singing, dancing, and tale telling that were a part of every voyage. He also analyzes the dramatic moments of the sailor's existence, as Jack Tar battled wind and water during a slashing storm, as he stood by his \"brother tars\" in a mutiny or a stike, and as he risked his neck by joining a band of outlaws beneath the Jolly Roger, the notorious pirate flag. Between the Devil and the Deep Blue Sea focuses upon the seaman's experience in order to illuminate larger historical issues such as the rise of capitalism, the genesis the free wage labor, and the growth of an international working class. These epic themes were intimately bound up with everyday hopes and fears of the common seamen.",
  "genres": [
    "History",
    "Nonfiction",
    "Pirates",
    "Maritime",
    "American History",
    "Research",
    "Academic"
  ],
  "author": "Marcus Rediker",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/770538.Between_the_Devil_and_the_Deep_Blue_Sea"
}