{
  "title": "The Malleus Maleficarum",
  "description": "For nearly three centuries Malleus Maleficarum (The Witches' Hammer) was the professional manual for witch hunters. This work by two of the most famous Inquisitors of the age is still a document of the forces of that era's beliefs. Under a Bull of Pope Innocent VIII, Kramer and Sprenger exposed the heresy of those who did not believe in witches and set forth the proper order of the world with devils, witches, and the will of God. Even if you do not believe in witchcraft, the world of 1484 did.Contemporary cases illustrate methods by which witches attempt to control and subvert the How and why women roast their first-born male child; the confession of how to raise a tempest by a washwoman suspended \"hardly clear of the ground\" by her thumbs; methods of making a formal pact with the Devil; how witches deprive men of their vital member; and many others. Methods of destroying and curing witchcraft, such as remedies against incubus and succubus devils, are exemplified and weighed by the authors.Formal rules for initiating a process of justice are set how it should be conducted and the method of pronouncing sentence; when to use the trial by the red-hot-iron; how the prosecutor should protect himself; how the body is to be shaved and searched for tokens and amulets, including those sewn under the skin. As Summers says, it was the casebook on every magistrate's desk.Montague Summers has given a very sympathetic translation. His two introductions are filled with examples of witchcraft and the historical importance of Malleus Maleficarum. This famous document should interest the historian, the student of witchcraft and the occult, and the psychologist who is interested in the medieval mind as it was confronted with various forces which could be explained only by witchcraft.",
  "genres": [
    "History",
    "Nonfiction",
    "Occult",
    "Witchcraft",
    "Classics",
    "Witches",
    "Horror"
  ],
  "author": "Heinrich Kramer",
  "average_rating": "3.16",
  "url": "https://www.goodreads.com/book/show/771091.The_Malleus_Maleficarum"
}