{
  "title": "Curried Favors: Family Recipes from South India",
  "description": "This engaging cookbook, the first to feature the tropical dishes of South India, demystifies the cuisine and offers more than one hundred recipes with light, tropical flavors and simple preparations, along with sumptuous photographs of the food and the region.Challenging the stereotypes that Indian curries are rich and heavy, difficult to prepare, and made with hard-to-find ingredients, this book introduces the light, tropical tastes of south India with accessible ingredients and simple methods. Adapting these south Indian recipes for the average kitchen, the author familiarizes the home cook with this lesser-known cuisine. An abundance of coconut and seafood, along with a host of exotic fruits and vegetables, including fresh hot chilies, distinguishes the curries of south India from those of north India. The focus is the traditional southern fare-dishes such as Rava Masala Dosa (wheat crepes stuffed with potato curry), Sambar (spicy stew of legumes and vegetables), and fish Aviyal (chunks of fish in an aromatic sauce of coconut and tamarind)-which is harder to find in restaurants outside of India. North Indian classics, also family favorites, like Lamb Korma, Tandoori Chicken, and Spinach Paneer are included. With everything from appetizers to desserts, this is an excellent introduction to Indian cooking. The author has an extraordinary talent for explaining unfamiliar cooking techniques, and specially commissioned full-color photographs provide helpful visual cues for preparing a wide variety of dishes. The inspired recipes, purposeful photographs, extensive notes on ingredients, practical menu ideas, and useful source list make it a primer on Indian cooking as well as a significant exploration of regional specialties.",
  "genres": [
    "Cookbooks",
    "Food",
    "Nonfiction",
    "Cooking"
  ],
  "author": "Maya Kaimal Macmillan",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/771196.Curried_Favors"
}