{
  "title": "Christianity: The Origins of a Pagan Religion",
  "description": "Reveals how Christian mythology of the Middle Ages had more to do with paganism than the Bible• Identifies pagan deities that were incorporated into each of the saints• Shows how all the major holidays on the Christian calendar are modeled on long-standing pagan traditionsThis extensive study of the Christian mythology that animated medieval Europe shows that this mythology is primarily of pagan inspiration and that very little of it comes from the Bible. The fact that Christianity grafted itself onto earlier pagan worship was no mystery to the Church Fathers, Philippe Walter explains. Pagan elements were incorporated into the Christian faith on the advice of Pope Gregory the Great, who told Saint Augustine of Canterbury that rather than tear down the pagan temples in Britain, he should instead add the pagan rituals into the mix of Christian practices, thus providing an easy transition to the new religion. It was simply a matter of convincing the populace to slightly redirect their focus to include Jesus.In this highly documented work Walter shows which major calendar days of the Christian year are founded on pagan rituals and myths, including the high holidays of Easter and Christmas, a time when many pagans prepared for the coming of spirits who would leave gifts for those who honored their coming. Indeed, the identities of saints and pagan figures were so intermingled that some saints were even transformed into pagan incarnations. Mary Magdalene, for instance, became one of the ladies of the lake of Celtic legend. He also explores how the hagiographic accounts of the saints in the scriptures reveal the origin of these symbolic figures to be the deities worshiped in pagan Europe for centuries.",
  "genres": [
    "Nonfiction",
    "History",
    "Religion",
    "Paganism"
  ],
  "author": "Philippe Walter",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/771067.Christianity"
}