{
  "title": "التاريخ الجديد",
  "description": "ليس هذا العمل المقدم إلى القارئ باللغة العربية كتاباً ألفه مؤلف واحد، وإنما هو عمل جماعي يشتمل على عشر مقالات ومقدمتين (مقدمة الطبعة الأولى الصادرة سنة 1978، ومقدمة الطبعة الثانية الصادرة سنة 1988، والتي تم اعتمادها في هذه الترجمة). تشير مقدمة الطبعة الأولى المترجمة ضمن هذا العمل إلى جملة من المقالات القصيرة التي وقع حذفها في الطبعة الثانية. وهو ما جعل المشرف على هذا العمل يستعمل عبارة \"القاموس\" عندما يتكلم على الكتاب، في طبعته الأولى، لأنها تشتمل على عدة تعريفات للعديد من المصطلحات التي شارك في كتابتها ما لا يقل عن 34 باحثاً بالإضافة إلى المؤلفين العشرة الذين ترجمت مقالاتهم في هذا العمل. أما مقدمة الطبعة الثانية، فهي بمثابة الرد على أصداء الطبعة الأولى، توجد في هذه المقدمة محاولة لتقويم ما بلغه التاريخ الجديد من الانتشار والتأثير في الكتابة التاريخية في أوروبا، ولو أن فرنسا تظل هي المرآة العاكسة لهذا الصدى وهذا الانتشار. وعلاوة على انتشار أفكار الكتاب ممثلة في إتباع المناهج المسطرة فيه والمواضيع المتناولة أو المقترحة من خلال المقالات الرئيسية التي تمثله، فقد لقي رواجاً تجارياً مهماً تعكسه إعادة نشره في طبعة ثانية سنة 1988، ثم في طبعات لاحقة لعل آخرها طبعة دار كومبلكس للعام 2006. تتميز المقالات التي يحتويها الكتاب بالغزارة في الأفكار ومحاولة أسلوبية أنيقة وجذابة، ترمي إلى الإيجاز البليغ، وتعتمد الترميز والاستعارة والجمل الاعتراضية. وتبدو النصوص على اختلاف مؤلفيها كما لو أنها صيغت بقلم واحد، وهو ما أعطى لهذا العمل ترابطاً في المحتوى وتناسقاً في الشكل. وقد حاول المترجم قدر المستطاع الاحتفاظ بالصور المجازية التي استعملها لوغوف وغيره من محرري فصول الكتاب لأنها هي في حد ذاتها تعبر عن أسلوب الكتابة وعن الذهنية التي يكتب بها المؤلفون والتي تصلح لأن تكون في حد ذاتها محوراً من محاور دراسة فن الكتابة التاريخية لدى \"المؤرخين الجدد\". لعل جاك لوغوف، وهو الذي يعتد بمستوى تكوين رواد المدرسة التاريخية التي عنها يدافع ومن أجلها يناضل، ولنشرها يخوض المعارك، يريد إثبات ذلك المستوى بحبر قلمه وأقلام زملائه المشاركين في تأليف الكتاب. أما بالنسبة إلى المحتوى، فلم ينظر أنصار التاريخ الجديد، وعلى رأسهم لوغوف، إلى خصومهم العلميين على أساس الحقد الشخصي، ولو أنه وقه في بعض الأحيان استعمال ألفاظ \"عنيفة\" دون أن تكون جارحة مثلما يبدو من خلال تقديم لوغوف التاريخ الجديد في طبعته الثانية. ولكن هناك اعتراف لكل واحد بدوره وفضله في عصره، إن كان له فضل من قريب أو من بعيد في تقدم التاريخ الجديد. إذ إنه يمكن القول بأن التاريخ الجديد ليس فقط منهجاً بحثياًن وإنما هو أيضاً منهج تربوي يسعى إلى الفصل بين أنواع العلاقات بين الناس، فالاختلاف اختلاف، والالتقاء التقاء، حتى ولو كان هناك في بعض الأحيان التقاء جزئي مع الخصوم العلميين. كما وأدى التاريخ الجديد إلى اعتماد أنواع جديدة من المصادر (مثل دفاتر العدول والتاريخ الشفوي والتراث المادي) وسلط عليها الضوء من زوايا جديدة بنوعية التساؤلات المطروحة ونوعية القضايا المتناولة، فلم يعد تاريخ الأمة الذي يمثله تاريخ الجنرالات والشخصيات الذائعة الصيت هو الذي يهم المؤرخين، بل أقحم التاريخ الجديد كل المغيبين والهامشيين من خلال دراسة \"المتروك\" من المصادر والمغيب من الفئات الاجتماعية: تاريخ المجانين، وتاريخ الرعاة، وتاريخ اللصوص والمومسات. وهي مواضيع كانت توصف في الماضي بأنها \"مواضيع خسيسة\" مقابلة بالمواضيع النفيسة، فمع التاريخ الجديد أصبح هناك اهتمام بالشرائح الاجتماعية الغائبة في أكثر الحالات من النصوص المصدرية، كالحوليات والسير والملاحم السيادية، حتى إنها أصبحت من أولوياته. لم تعد العناية بالمدينة من خلال أسوارها، ومن خلال قصورها وزخارفها فقط، بل دخل البحث بيوت الفقراء وعدد أثاثهم وتصور نمط عيشهم. كما أحدث التاريخ الجديد ثورة في مستوى الكتابة التاريخية على مستوى الأزمنة التاريخية. لقد حارب التاريخ الجديد الزمن القصير لينظر إلى التاريخ من خلال الأمد الطويل، فهو لم يعد مهتماً بالسلالات وبعصر الشخصيات، وإنما بتناول الظواهر الاجتماعية والذهنية منذ فرات انبلاجها، مروراً بفترات الأوج إلى أن تذوي، مع الملاحظة أن هذه الظواهر التي تزدهر وتبدو أنها انتهت، هي في الحقيقة ظواهر تتواصل بأشكال مختلفة وفي حلى متنوعة في مجملها أو على الأقل في البعض من خصائصها. لا يعني أن الظواهر التاريخية تنتهي بمجرد ذبولها. وهو ما أدى برواد التاريخ الجديد إلى أخذ مظاهر الثبوت والتحول بعين الاعتبار عند دراسة التاريخ. كما أن التاريخ الجديد بطرحه مثل هذه القضايا وصل إلى زعزعة بعض الثوابت الذهنية أو التاريخية، مثل مسألة التدين في فرنسا، فهي مسألة كانت محسومة من وجهة نظر التاريخ التقليدي: فرنسا بلد مسيحي، وربما هو مسيحي بعمق. أدت بحوث المؤرخين الجدد إلى تعديل هذه النظرة والقول بأنه قبل الثورة الفرنسية كان هناك من ناحية تراجع للمسيحية، حتى وإن لم تتراجع في بعض الجهات، فهي ليست مسيحية كما يراها رجال الدين أو يتصورها رواد التاريخ التقليدي، بل هي في كثير من الأحيان مسيحية سطحية وملونة برواسب العهود الوثنية أو السابقة للمسيحية. كما أن التاريخ الجديد لم يبن على فضل التاريخ عن بقية العلوم بشتى أنواعها، على قاعدة ما هو \"صحيح\" من العلوم وما هو \"تقريبي منها، وإنما على النظرة الشمولية التي تتناول الظاهرة من مختلف الجوانب، وتعتمد كل ما أمكن من الأساليب العلمية: رياضية وطبية وبيولوجية وجغرافية وغيرها. والظاهرة التاريخية من وجهة نظر التاريخ الجديد ليست منحصرة في حقل، ولا يمكن فهمها بما يكفي من الدقة لو اقتصر الباحث في ذلك على علم واحد. وهو ما أدى إلى النظرة الشمولية والكلية للتاريخ. ليس هناك تاريخ بالتاريخ فقط، بل هناك تاريخ بشتى أصناف العلوم الأخرى. لقد بني التاريخ الجديد على شاكلة المجتمع ذاته، مجتمع الباحث ومجتمع البحث: مادة وروحتً. وهو ما أدى بـ التاريخ الجديد إلى إقحام آليات جديدة، مثل التكميم المستمد من الاقتصاد الديمغرافي ليتجاوز المظاهر المادية حتى بلوغ روح المجتمعات التاريخية، كما أدى إلى طرح مسائل تبدو في نظر المؤرخ التقليدي الأوروبي، وربما في نظر البعض من المؤرخين العرب، بعيدة عن الحقل التاريخي الذي اعتاد عليه المؤرخ التقليدي وعود الناس عليه من خلال حصر التاريخ في الأحداث والوقائع والأبطال والانتصارات والهزائم، مثل تاريخ الموت وموقف الناس منه، جماعات وأفراداً. كما أن التاريخ الجديد أعطى قيمة علمية لحقول كانت مجهولة أو متروكة، وجعل منها جزءاً من التاريخ إن لم تكن محركاً له، وهي مسألة الوعي واللاوعي، فالناس يصنعون التاريخ، ولكنهم لا يشعرون بذلك، مثلما عبر عن ذلك كارل ماركس. وهي كل ما شمل المتخيل الاجتماعي.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Jacques Le Goff",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/7709126"
}