{
  "title": "Surfaces and Essences: Analogy as the Fuel and Fire of Thinking",
  "description": "Analogy is the core of all thinking.\nThis is the simple but unorthodox premise that Pulitzer Prize–winning author Douglas Hofstadter and French psychologist Emmanuel Sander defend in their new work. Hofstadter has been grappling with the mysteries of human thought for over thirty years. Now, with his trademark wit and special talent for making complex ideas vivid, he has partnered with Sander to put forth a highly novel perspective on cognition.We are constantly faced with a swirling and intermingling multitude of ill-defined situations. Our brain’s job is to try to make sense of this unpredictable, swarming chaos of stimuli. How does it do so? The ceaseless hail of input triggers analogies galore, helping us to pinpoint the essence of what is going on. Often this means the spontaneous evocation of words, sometimes idioms, sometimes the triggering of nameless, long-buried memories.Why did two-year-old Camille proudly exclaim, “I undressed the banana!”? Why do people who hear a story often blurt out, “Exactly the same thing happened to me!” when it was a completely different event? How do we recognize an aggressive driver from a split-second glance in our rearview mirror? What in a friend’s remark triggers the offhand reply, “That’s just sour grapes”? What did Albert Einstein see that made him suspect that light consists of particles when a century of research had driven the final nail in the coffin of that long-dead idea?The answer to all these questions, of course, is analogy-making—the meat and potatoes, the heart and soul, the fuel and fire, the gist and the crux, the lifeblood and the wellsprings of thought. Analogy-making, far from happening at rare intervals, occurs at all moments, defining thinking from top to toe, from the tiniest and most fleeting thoughts to the most creative scientific insights.Like Gödel, Escher, Bach before it, Surfaces and Essences will profoundly enrich our understanding of our own minds. By plunging the reader into an extraordinary variety of colorful situations involving language, thought, and memory, by revealing bit by bit the constantly churning cognitive mechanisms normally completely hidden from view, and by discovering in them one central, invariant core—the incessant, unconscious quest for strong analogical links to past experiences—this book puts forth a radical and deeply surprising new vision of the act of thinking.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Psychology",
    "Science",
    "Audiobook",
    "Language",
    "Neuroscience"
  ],
  "author": "Douglas R. Hofstadter",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/7711871-surfaces-and-essences"
}