{
  "title": "Minds on Trial: Great Cases in Law and Psychology",
  "description": "In recent years, the public has become increasingly fascinated with the criminal mind. Television series centered on courtroom trials, criminal investigations, and forensic psychology are more popular than ever. More and more people are interested in the American system of justice and the individuals who experience it firsthand.Minds on Great Cases in Law and Psychology gives you an inside view of 20 of the highest profile legal cases of the last 50 years. Drs. Ewing and McCann take you \"behind the scenes\" of each of these cases, some involving celebrities like Woody Allen, Mike Tyson, and Patty Hearst, and explain the impact they had on the fields of psychology and the law. Many of the cases in this book, whether involving a celebrity client or an ordinary person in an extraordinary circumstance, were determined in part by the expert testimony of a psychologist or other mental health professional. Psychology has always played a vital role in so many aspects of the American legal system, and these fascinating trials offer insight into many intriguing psychological issues. In addition to expert testimony, some of the issues discussed in this entertaining and educational book include the insanity defense, brainwashing, criminal profiling, capital punishment, child custody, juvenile delinquency, andfalse confessions.In Minds on Trial , the authors skillfully convey the psychological and legal drama of each case, while providing important and fresh professional insights.Mental health and legal professionals, as well as others with an interest in psychology and the law will have a hard time putting this scholarly, yet readable book down.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "True Crime",
    "Law",
    "School",
    "Mental Health",
    "History"
  ],
  "author": "Charles Patrick Ewing",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/771453.Minds_on_Trial"
}