{
  "title": "Pinocchio",
  "description": "A timeless classic to be read over and over.This is the story of Pinocchio, filled with harrowing yet inspiring adventures. Carved by a poor man named Geppetto, Pinocchio is a wooden puppet that comes to life. He soon leaves his maker and commences a journey of misadventures.Pinocchio has a good heart, but he is disobedient and lazy and often has poor judgment. And when he lies, Pinocchio's nose grows longer! Follow this mischievous puppet as he goes to the \"Field of Miracles\", where he plants gold coins to try to make his wealth grow. Thrill as he is pursued by assassins. And marvel as he becomes the unwitting star of a circus show and lives a life of ease in the \"Land of Boobies,\" where boys can play all day and never have to go to school. Of course, Pinocchio gets into trouble along the way.From the villainous Cat and Fox, who try to steal his gold coins, to the gigantic Dogfish, a terrifying sea monster that swallows him, Pinocchio encounters menacing characters who often lead him to trouble. But Pinocchio also befriends a good Fairy who loves him and wants to help him escape his misfortunes. She even promises the puppet that if he learns to be good, to study, and to work hard, he will become a real boy. Can Pinocchio turn his life around? And will he ever see his \"papa,\" Geppetto again?\nCarlo Collodi\n (1826–1890) was born Carlo Lorenzini on November 24, 1826, in Florence, Italy. In 1848 he enlisted to fight in the Italian War of Independence and founded the daily satirical newspaper 'Il Lampione'. Collodi continued to write political and humorous novels until 1876, when he began to write children's books. In 1881 'Pinocchio' was originally introduced as a newspaper serial in the children's section. Since its first full-length publication in 1883, \n'Pinocchio'\n has been translated in over 260 languages and is one of the most popular children's stories ever told.",
  "genres": [
    "Classics",
    "Fiction",
    "Fantasy",
    "Childrens",
    "Italian Literature",
    "Italy",
    "Adventure"
  ],
  "author": "Carlo Collodi",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/771684.Pinocchio"
}