{
  "title": "Such a Pretty Face",
  "description": "In this warm, funny, thoroughly candid novel, acclaimed author Cathy Lamb introduces an unforgettable heroine who's half the woman she used to be, and about to find herself for the first time…Two years and 170 pounds ago, Stevie Barrett was wheeled into an operating room for surgery that most likely saved her life. Since that day, a new Stevie has emerged, one who walks without wheezing, plants a garden for self-therapy, and builds and paints fantastical wooden chairs. At thirty-five, Stevie is the one thing she never thought she'd be: thin.But for everything that's changed, some things remain the same. Stevie's shyness refuses to melt away. She still can't look her neighbors' gorgeous great-nephew in the eye. The Portland law office where she works remains utterly dysfunctional, as does her family—the aunt, uncle, and cousins who took her in when she was a child. To top it off, her once supportive best friend clearly resents her weight loss.By far the biggest challenge in Stevie's new life lies in figuring out how to define her new self. Collaborating with her cousins to plan her aunt and uncle's problematic fortieth anniversary party, Stevie starts to find some surprising answers—about who she is, who she wants to be, and how the old Stevie evolved in the first place. And with each revelation, she realizes the most important part of her transformation may not be what she's lost, but the courage and confidence she's gathering, day by day.As achingly honest as it is witty, Such A Pretty Face is a richly insightful novel of one woman's search for love, family, and acceptance, of the pain we all carry—and the wonders that can happen when we let it go at last.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Book Club",
    "Romance",
    "Womens Fiction",
    "Family"
  ],
  "author": "Cathy  Lamb",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/7714109-such-a-pretty-face"
}