{
  "title": "مصر في مفترق الطرق",
  "description": "تدخل مصر التسعينيات و هي تواجه ثلاثة طرق مسدودة: الطريق الذي تسير فيه بالفعل، و هو ما يمكن تسميته باليمين، و الطريق الذي يمثله التيار الغالب بين التيارات الدينية الجارية، و الطريق الذي يمثله اليسار التقليدي الذي يجد من الصعب مواجهة المتغيرات الدولية بفكر يساري جديد.في مفترق الطرق هذا الذي وصلت إليه مصر مع اقتراب القرن العشرين من نهايته، كان من الطبيعي أن تختلط الأمور اختلاطاً عظيماً، و يحتد التوتر الاجتماعي و الثقافي و السياسي ، و تزيد الأزمة الاقتصادية احتداماً، و تصيب الشباب المثقف المصري حيرة عظيمة.أما الأزمة لاقتصادية فترجع في الأساس ، في رأيي ، إلي فشل السياسات \" اليمينية\" فشلاً ذريعاً في تحقيق تنمية اقتصادية متوازنة وعادلة، و أما التوتر الاجتماعي و الثقافي و السياسي فمن أسبابه الأساسية الشعور العام بالعجز عن الخروج من المأزق الاقتصادي وعن تحقيق نهضة سياسية و اجتماعية، و أما حيرة الشباب المصري المثقف فسببها أنه يجد نفسه مواجها بثلاثة طرق كلها مسدود، و لا تبدو له بارقة انفراج أو شعاع فكر جديد يبشر بتبديد الظلام الفكري السائد.و عندما راجعت ما كتبته في الدوريات المصرية خلال السنتين الماضيتين، وجدت أن موضوعاته لا تخرج في الواقع عن ثلاثة أمور: إفلاس الاتجاه اليميني في مصر، و أزمة التيار الغالب بين التيارات الدينية، و ما يمكن أن تسميه بمحنة اليسار القديم أو التقليدي، فرأيت أنه قد يكون من المفيد جمعه و نشره في مجلد واحد تحت هذه العناوين الثلاثة، و أن أضيف إلي ذلك فصلاً كنت قد كتبته منذ نحو سبع سنوات (1983) ، وجدته يصلح أن يكون هو نهاية الحديث، و أن يحمل عنوان \" نحو يسار جديد ؟ \" . ذلك أني أعتقد اعتقادا جازماً انه ليس من مخرج لمصر من محنتها الاجتماعية والثقافية إلا يسار من نوع جديد. نعم: قد تستطيع مصر أن تضاعف الدخل و ترفع من مستوي المعيشة بغير يسار جديد أو قديم، و لكني و كثيرين غيري يتوقون شوقاً لنهضة تتخطي هذا الأمل الاقتصادي المتواضع و تتجاوزه، و تليق بحيوية الشعب المصري الدائمة و حكمته وذكائه. هذه النهضة لن يصلح لتحقيقها يمين يتسم بأنانية مفرطة، أو يسار عتيق يقرأ أكثر مما يلاحظ، أو تيار ديني يحرم الحلال، و يقسم الأمة نصفين، و يشيع في الناس كراهية الحياة و كراهية الآخرين. فهل لشباب مصر الجديد، المتألق ذكاءً و المملوء حيوية و ثقة بالنفس، أن يتدبر الأمر و يخرج لنا بهذا الجديد الذي نتحرق شوقاً إليه؟",
  "genres": [
    "Politics"
  ],
  "author": "جلال أمين",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/7716792"
}