{
  "title": "Marketing in the Age of Google: Your Online Strategy IS Your Business Strategy",
  "description": "Search has changed everything. Search has become woven into our everyday lives, and permeates offline as well as online activities. Every business should have a search strategy. How a business appears online can impact consumer influence as much as if not more than offline advertising like TV commercials. A business's search strategy can have a dramatic impact on how consumers interact with that business. But even more importantly, search engine activity provides amazingly useful data about customer behavior, needs, and motivations. Accessing search data is like conducting focus groups with millions of people for free. Search isn't just for marketers and techies. It can provide valuable insight on business strategy and product strategy. Companies of all sizes – from startups to global enterprise level corporations, and even businesses without web sites – can benefit from understanding how consumers are searching for them and talking about them online, both as a powerful acquisition channel and a vast repository of market research. In this non-technical book forexecutives, business owners, marketers, and product managers, search engine strategy guru Vanessa Fox-who created Google's portal for site owners, Googgle Webmaster Central -explains what every marketer or business owner needs to understand about how search rankings work, how to use search to better understand your customers and attract new ones, how to develop a comprehensive search strategy for your business, and how to build execution of this strategy into the businesses processes. This isn't another book about paid search for advertisers. This book focuses on organic listings – the unpaid results that receive 86% of searcher clicks. With this book in hand, every businessperson will have the knowledge and the tools to maximize the potential of search engine marketing to build a brand, draw new prospects, and generate sales.",
  "genres": [
    "Business",
    "Nonfiction",
    "Google",
    "Web",
    "Research",
    "Internet"
  ],
  "author": "Vanessa Fox",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/7714891-marketing-in-the-age-of-google"
}