{
  "title": "Convincing Maggie: Her Submissive Education",
  "description": "Maggie is a twenty-nine year old high school teacher who wants nothing more than to spanked and sexually dominated by the man who loves her. But because of her short, well-rounded figure, she-s always felt undesirable and self conscious about her sexuality and her questionable needs. Her boyfriend Jason does nothing but belittle her for her appearance. But Jason-s long time friend Bryce is immediately attracted to her lush body and shy demeanor. He convinces Jason to bet a night with Maggie in a poker game. When Bryce wins, he gives Maggie and unforgettable night of hot spanking and savage sex. But in the morning, Bryce has left without a word and Jason has dumped her and left town. Maggie drowns her depression by masturbating to daydreams of a special man who will love and dominate her. Later she spills out her sad tale to her anonymous -phone-friend- Brian, who has just the cure for her woes. He convinces Maggie to spend a few weeks at an exclusive club run by his good friend. Its sole purpose is to turn women into sexual submissives, who take pleasure in submitting to their dominant men. Diving headlong into this highly-charged erotic world, Maggie is soon punished and fucked by her gym instructor, then she-s sexually taken by the club owner in the dining room. Exhibition, public oral sex, anal, threesomes and plenty of painful spanking await her as she learns unquestioned obedience, and how to please men the way they wanted to pleased. But while Maggie enjoys her lessons at the club-she continues to dream of that one special man who will not just use her, but love her too! Will it be Bryce? Brian? Jason? Maggie knows which man she wants. But once she leaves the club, she-ll have to show off her new body and her new sexual attitude in one outrageous exhibition, proving she can be the submissive sexual woman her dominant man desires.",
  "genres": [
    "BDSM",
    "M F M",
    "Erotica"
  ],
  "author": "B.J. Wane",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/7721398-convincing-maggie"
}