{
  "title": "The Barbary Plague: The Black Death in Victorian San Francisco",
  "description": "“San Francisco in 1900 was a Gold Rush boomtown settling into a gaudy middle age. . . . It had a pompous new skyline with skyscrapers nearly twenty stories tall, grand hotels, and Victorian mansions on Nob Hill. . . . The wharf bristled with masts and smokestacks from as many as a thousand sailing ships and steamers arriving each year. . . . But the harbor would not be safe for long. Across the Pacific came an unexpected import, bubonic plague. Sailing from China and Hawaii into the unbridged arms of the Golden Gate, it arrived aboard vessels bearing rich cargoes, hopeful immigrants, and infected vermin. The rats slipped out of their shadowy holds, scuttled down the rigging, and alighted on the wharf. Uphill they scurried, insinuating themselves into the heart of the city.”The plague first sailed into San Francisco on the steamer Australia, on the day after New Year’s in 1900. Though the ship passed inspection, some of her stowaways—infected rats—escaped detection and made their way into the city’s sewer system. Two months later, the first human case of bubonic plague surfaced in Chinatown. Initially in charge of the government’s response was Quarantine Officer Dr. Joseph Kinyoun. An intellectually astute but autocratic scientist, Kinyoun lacked the diplomatic skill to manage the public health crisis successfully. He correctly diagnosed the plague, but because of his quarantine efforts, he was branded an alarmist and a racist, and was forced from his post. When a second epidemic erupted five years later, the more self-possessed and charming Dr. Rupert Blue was placed in command. He won the trust of San Franciscans by shifting the government’s attack on the plague from the cool remove of the laboratory onto the streets, among the people it affected. Blue preached sanitation to contain the disease, but it was only when he focused his attack on the newly discovered source of the plague, infected rats and their fleas, that he finally eradicated it—truly one of the great, if little known, triumphs in American public health history.With stunning narrative immediacy fortified by rich research, Marilyn Chase transports us to the city during the late Victorian age—a roiling melting pot of races and cultures that, nearly destroyed by an earthquake, was reborn, thanks in no small part to Rupert Blue and his motley band of pied pipers.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medicine",
    "Medical",
    "American History",
    "Health"
  ],
  "author": "Marilyn  Chase",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/771881.The_Barbary_Plague"
}