{
  "title": "الحصار",
  "description": "يقدم الروائي الألباني الأصل \"إسماعيل كاداريه\"، الفائز بجائزة بوكر الدولية لعام 2005، رواية \"الحصار\"، يسلط الأضواء فيها على الأحداث التي تعرضت لها بلاده إبان الحكم العثماني، فعالج الماضي البعيد برؤية معاصرة، فلم يستخدم السرد التاريخي لوقائع وأحداث، وإنما نظر إلى هذه الأحداث بمنظار الفحص والتحليل والتدقيق وترك للقارئ حرية استخلاص النتائج بحسب انتماءاته الأيديولوجية والاجتماعية والسياسية.تدور أحداث الرواية عن حصار الجيش العثماني لإحدى القلاع الألبانية المتخيلة وإخفاقه في الاستيلاء عليها، ففي القرن الخامس عشر تحاصر جيوش الإمبراطورية العثمانية حصناً منيعاً في ألبانيا بغية احتلاله، في خطوة لإخضاع كامل البلاد إلى سيطرتها. ولكن المحاصرين يرفضون الاستسلام ويستعدون للدفاع عن حصنهم رغم الجيش الجرار الذي أدخل سلاح المدفعية الثقيلة إلى ساحة المعركة وإصرار الباشا التركي على احتلاله.تنقلنا الرواية بين ضباط وجنود الجيشين لتبرز الحالة النفسية للفريقين. فريق يدافع عن تراب وطنه ومستعد للموت فداءً له، وآخر يعاقر الخمرة ليستبسل في هجومه ضد \"البرابرة\" – كما وصفهم القائد لجنوده، مختلقاً مخاطر وهمية إذا لم تتم إبادتهم، في حين يسلّط شرطته السرية في أعقاب ضباطه المتخاذلين. ومع اندلاع القتال الدموي وتدفق الموجات المهاجمة واحدة إثر أخرى باستخدام شتى الخطط العسكرية والأساليب والخدع، يلمس القارئ في هذه الرواية مسألة هامة، ألا وهي الصراع الأبدي بين الديانات والدول الكبرى في سعيها للفوز والسيطرة.فهل صحيح أن معيار القوة في هكذا حالة هو الذي يحسم نتيجة المعركة وأن هناك حتمية لاندحار القوى الأضعف أمام الأقوى، وأن القضية هي قضية زمن لا أكثر ولا أقل حتى تجد الأمم نفسها وقد اجتاحتها أمم أخرى أقوى منها. إن مثال ألبانيا في هذه الرواية يؤكد أن صاحب الحق حتى ولو كان أقل قوة سوف يحقق النصر في النهاية يؤكد هذا \"كاداريه\" في حديث يقول فيه: \"لقد كنت سعيداً بنشر الرواية لأنها ليست ذات صلة بالشعارات الشيوعية التي كانت سائدة يومذاك، أو النظريات الأيديولوجية التي تشكل جزءاً لا يتجزأ من ثقافة المجتمعات الستالينية، وأن القدرة على الكتابة بحرية في ظروف تفتقر على الحرية أمر مدهش تماماً\".هذا الكتاب هو أكثر من رواية، إنه ملحمة تجسّد الصراع بين المستعمِر والشعوب المدافعة عن حريتها، نستشف منها الحالة النفسية، والروح المعنوية لكلا الطرفين في حالتي السلم والحرب، ونعيش فيها تعملُق صاحب الحق ولو كان أقل قوة، أمام جحافل المعتدي مهما بلغت عتياً وقوة.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "War",
    "Albanian Literature",
    "Literature",
    "Novels",
    "Historical"
  ],
  "author": "Ismail Kadare",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/7723423"
}