{
  "title": "Authentic Mexican: Regional Cooking from the Heart of Mexico",
  "description": "Americans have at last discovered Mexico's passion for exciting food. We've fallen in love with the great Mexican combination of rich, earthy flavors and casual, festive dining. But we don't begin to imagine how sumptuous and varied the cooking of Mexico really is. After ten years of loving exploration, Rick Bayless, together with his wife, Deann, gave us Authentic Mexican , this now classic, easy-to-use compendium of our southern neighbor's cooking. This all-embracing cookbook offers the full range of dishes, from poultry, meat, fish, rice, beans, and vegetables to eggs, snacks made of corn masa , tacos, turnovers, enchiladas and their relatives, tamales , and moles , ending with desserts, sweets, and beverages. There are irresistible finger foods such as Yucatecan marinated shrimp tacos and crispy cheese-filled masa turnovers; spicy corn chowder and chorizo sausage with melted cheese will start off a special dinner; you will find mole poblano , charcoal-grilled pork in red-chile adobo, and marinated fish steamed in banana leaves for those times when you want to celebrate; and exotic ice creams, caramel custards, and pies to top off any meal. There's even a section devoted to refreshing coolers, rich chocolate drinks, and a variety of tequila-laced cocktails. The master recipes feature all the pointers you'll need for re-creating genuine Mexican textures and flavors in a North American kitchen. Menu suggestions and timing and advance-preparation tips make these dishes perfectly convenient for today's working families. And traditional and contemporary variations accompany each recipe, allowing the cook to substitute and be creative. Rick and Deann Bayless traveled more than thirty-five thousand miles investigating the six distinct regions of Mexico and learning to prepare what they found. From town to town, recipe by recipe, they personally introduce you to Mexico's cooks, their kitchens, their markets, and their feasts. If, like the rest of us, you have a growing love for Mexican food, the reliable recipes in this book and the caring, personal presentation by Rick and Deann Bayless will provide meal after meal of pure pleasure for your family and friends.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Food and Drink",
    "Culinary"
  ],
  "author": "Rick Bayless",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/772683.Authentic_Mexican"
}