{
  "title": "Dr. Julie Visits Cowboy Mike and Winston",
  "description": "A new illustrated book series about the life of a miniature pony and his owner Cowboy Mike on their ranch in the American countryside. Do you know a child who loves horses and ponies, not to mention miniature ponies? Watch their eyes light up as they read this book and learn more and more about farm life and taking care of a miniature pony.This children's book is educational as well as entertaining. It is a perfect bedtime story for a baby or a preschooler in your life. Join Winston and Cowboy Mike on their Blue Mountain Ranch as they enjoy exciting adventures together.100% of the book sales proceeds are donated to a charity Pony 4 Precious a 501 c 3 charity. Cowboy Mike rescued Winston, a miniature pony, in 2016 and started this charity offering free online education and training programs for little ones all over the globe.Do you know a child who loves miniature ponies and horses? Watch their eyes light up as they read the pages of the new children's book. Dr. Julie Visits Cowboy Mike and Winston. Cowboy Mike's books have opened the door for all the fantasies and a wonderful joyride to the cowboy world. This children's book is about cowboy Mike and Winston, a miniature pony. The book is about Dr. Julie's day at Blue Mountain Ranch conducting Winson's yearly well checkup and making sure that Cowboy Mike is taking care of Winston. Children always have their fascination and love for horses and this wonder that they have is now further lightened up with the wonderful Children's book. Cowboy Mike and Winston have a series of books starting off with. The first book is A Day in the Life of Cowboy Mike and Winston by Michael Eastwood. The second book is by Michael Eastwood A Day at Blue Mountain Ranch with Cowboy Mike and Winston , the narrative of these books will make the children get into the world of the horses and the cowboy, Mike, and Winston. Winston happens to be a miniature pony and Cowboy Mike is his owner. Along with books that are fun, they also are educational. But it has its rightful place among the fun children's books. Examples of these books delineate the adventures about the journey of Cowboy Mike and Winston along with Winston's brothers, Blue, Bones, and Buckle. 100% of the book sales proceeds are donated to a charity Pony 4 Precious a 501 c 3 charity . Cowboy Mike is Michael Eastwood, CEO and Chairman of the board for Pony 4 Precious & Bello Sol Inc. Cowboy Mike rescued Winston a miniature pony in 2016 and has since developed this amazing charity Pony 4 Precious. This charity was developed for one To educate children on miniature ponies and horses through free online education and online training programs. To learn more about Michael D Eastwood visit www.michaeldeastwood.com or to learn about Pony 4 precious visit www.pony4precious.org",
  "genres": [],
  "author": "Michael Eastwood",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/77261401-dr-julie-visits-cowboy-mike-and-winston"
}