{
  "title": "John Marshall: Writings",
  "description": "\"It is emphatically the province and duty of the judicial department,\" John Marshall wrote in Marbury v. Madison, \"to say what the law is.\" As its Chief Justice from 1801 to 1835, Marshall made the Supreme Court a full and equal branch of the federal government. In so doing, he joined Washington, his mentor, and Jefferson, his ideological rival, in the first rank of American founders. His legacy extends far beyond Marbury, which held for the first time that the Supreme Court has the power to declare acts of Congress unconstitutional. Under his leadership, the Court upheld the constitutionality of a national bank, established the supremacy of the federal judiciary over state courts and legislatures in matters of constitutional interpretation, and profoundly influenced the economic development of the nation through vigorous interpretation of the contract and interstate commerce clauses. His major judicial opinions are eloquent public papers, written with the conviction that \"clearness and precision are most essential qualities,\" and designed to inform and persuade the citizens of the new republic about the meaning and purpose of their Constitution. This volume collects 200 documents written between 1779 and 1835, including Marshall's most important judicial opinions, his influential rulings during the Aaron Burr treason trial, speeches, newspaper essays, and revealing letters to friends, fellow judges, and his beloved wife, Polly. It follows Marshall's varied career before becoming Chief Justice: as an officer in the Revolution, a supporter of the ratification of the Constitution, an envoy to France during the notorious \"XYZ Affair,\" a congressman, and secretary of state in the Adams administration. The personal correspondence gathered here reveals the conviviality, good humor, and unpretentiousness that helped him unite the Court behind many of his landmark decisions, while selections from his biography of George Washington offer vivid descriptions of battles he fought in as a young man. Charles F. Hobson, editor, is the author of The Great Chief Justice: John Marshall and the Rule of Law. He is the editor of The Law Papers of St. George Tucker at the Omohundro Institute of Early American History and Culture and was the editor of The Papers of John Marshall. \"A marvelous and much-needed single-volume collection of the writings of America's greatest Chief Justice, selected by the scholar who knows him best.\" -Gordon Wood, author of Empire of Liberty",
  "genres": [
    "Law",
    "History",
    "Essays",
    "American Revolution",
    "Politics",
    "Nonfiction"
  ],
  "author": "John Marshall",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/7732090-john-marshall"
}