{
  "title": "Doing Time on the Outside: Incarceration and Family Life in Urban America",
  "description": "\"Stigma, shame and hardship---this is the lot shared by families whose young men have been swept into prison. Braman reveals the devastating toll mass incarceration takes on the parents, partners, and children left behind.\"-Katherine S. Newman\" Doing Time on the Outside brings to life in a compelling way the human drama, and tragedy, of our incarceration policies. Donald Braman documents the profound economic and social consequences of the American policy of massive imprisonment of young African American males. He shows us the link between the broad-scale policy changes of recent decades and the isolation and stigma that these bring to family members who have a loved one in prison. If we want to understand fully the impact of current criminal justice policies, this book should be required reading.\"-Mark Mauer, Assistant Director, The Sentencing Project\"Through compelling stories and thoughtful analysis, this book describes how our nation's punishment policies have caused incalculable damage to the fabric of family and community life. Anyone concerned about the future of urban America should read this book.\"-Jeremy Travis, The Urban InstituteIn the tradition of Elijah Anderson's Code of the Street and Katherine Newman's No Shame in My Game , this startling new ethnography by Donald Braman uncovers the other side of the incarceration the little-told story of the effects of imprisonment on the prisoners' families.Since 1970 the incarceration rate in the United States has more than tripled, and in many cities-urban centers such as Washington, D.C.-it has increased over five-fold. Today, one out of every ten adult black men in the District is in prison and three out of every four can expect to spend some time behind bars. But the numbers don't reveal what it's like for the children, wives, and parents of prisoners, or the subtle and not-so-subtle effects mass incarceration is having on life in the inner city.Author Donald Braman shows that those doing time on the inside are having a ripple effect on the outside-reaching deep into the family and community life of urban America. Braman gives us the personal stories of what happens to the families and communities that prisoners are taken from and return to. Carefully documenting the effects of incarceration on the material and emotional lives of families, this groundbreaking ethnography reveals how criminal justice policies are furthering rather than abating the problem of social disorder. Braman also delivers a number of genuinely new arguments.Among these is the compelling assertion that incarceration is holding offenders unaccountable to victims, communities, and families. The author gives the first detailed account of incarceration's corrosive effect on social capital in the inner city and describes in poignant detail how the stigma of prison pits family and community members against one another. Drawing on a series of powerful family portraits supported by extensive empirical data, Braman shines a light on the darker side of a system that is failing the very families and communities it seeks to protect.",
  "genres": [
    "Sociology",
    "Nonfiction",
    "Race",
    "Politics",
    "Social Justice",
    "Ethnography",
    "Academic"
  ],
  "author": "Donald Braman",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/773485.Doing_Time_on_the_Outside"
}