{
  "title": "Tales of Jonathan",
  "description": "Following the advice of his English teacher, Paul Garner uses his part in a school play to embark upon a journey of discovery. By attempting to rewrite and redirect the story, he finds that his quest assumes reality. Not only do the characters escape direction by his pen but he loses distinction between himself, as author, and the character he plays. He becomes lost within the narrative, which moves in ways not of his choosing. However, the bond between him and the one he seeks is never broken. Whether from dream and memory, part of reality or the image of a goddess, she is always the inspiration for the play. Yet where did the play originate? Jonathan is an orphan; whether he be the dead foster brother of Bethany, the imaginary friend of Daniel or the fostered child of the reclusive Aunt Sheelagh, his tales transform loss into a search for love in all worlds and beyond. Tales of Jonathan is a self exploration of one person's mind, culminating in his discovery of truth in the deepest chamber. By transcending the restrictions of rationality, he finds a new reality. Dreams which have no end are no longer dreams. His previous loss and grief have become the fiction; the tales of Jonathan are now his reality. It is a story about the power of faith and love. I believe that with reflective thought, the reader will find it a challenging and rewarding book. Nicol addresses the slippery substance of reality from every angle, repeating the main story and many of its key phrases in slightly different contexts each time. While the intellectual exercise is fascinating, it is easy to lose the thread of the story in all of the rearranging, which makes for some challenging reading. -CLARION As Nicol invites readers into dreams and memories cobbled into a Möbius strip, there's little sense of what's real and what's not. The first of seven segments suggests that the novel will concern schoolboy Paul Garner and the enchanting Bethany",
  "genres": [],
  "author": "Keith Nicol",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/7732286-tales-of-jonathan"
}