{
  "title": "A Call to Arms",
  "description": "Matthew Hervey is recalled to take up arms against Burmese rebels massing on the frontier with India in the fourth installment of his adventures with the Light Dragoons.The last two years have not been good ones for Matthew Hervey. His beloved wife Henrietta is dead and, believing that he can no longer remain in a regiment where men like Lord Towcester can rise to command, he has turned his back on the 6th Light Dragoons. He is left kicking his heels in a corrupt and unruly England far removed from its once glorious past.1819 sees Hervey in Rome with his sister Elizabeth, where a chance meeting with one of England’s most controversial men of letters leads him to rethink his future. Joined by his old friend Captain Peto, Hervey realizes just how much he has missed the excitement of military action and the camaraderie of the Sixth. Soon he is en route for Hounslow via Whitehall, where he hurriedly purchases a new commission and is refitted for the uniform of his former regiment. There he finds things much changed for the better. Though depleted in numbers, they are now under the assured leadership of Sir Ivo Lankester, brother of Edward Lankester, hero of Waterloo. Hervey’s first task is to raise a new troop and then to organize transport, for his men and horses are to set sail for India with immediate effect.What Hervey and his greenhorn soldiers cannot know is that in India they will face a trial for which they are sorely ill-prepared. For a large number of Burmese warboats are being assembled near the headwaters of the river leading to Chittagong, and the only way to thwart their advance involves an arduous and hazardous march through the jungle. Hervey and his troop find themselves in the midst of hot and bloody action once more.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Military Fiction",
    "War",
    "India",
    "Audiobook"
  ],
  "author": "Allan Mallinson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/772892.A_Call_to_Arms"
}