{
  "title": "Antony and Cleopatra",
  "description": "This is an electronic edition of the complete book complemented by author biography. This book features the table of contents linked to every act and scene. The book was designed for optimal navigation on the Kindle, PDA, Smartphone, and other electronic readers. It is formatted to display on all electronic devices including the Kindle, Smartphones and other Mobile Devices with a small display. ***************** Antony and Cleopatra is a play by William Shakespeare, often considered a tragedy although this is debated and originally printed in the First Folio of 1623. The plot is based or thought to be on Thomas North's translation of Plutarch's Life of Markus Antonius and follows the relationship between Cleopatra and Mark Antony from the time of the Parthian War to Cleopatra's suicide. The major antagonist is Octavius Caesar, one of Antony's fellow triumvirs and the future first emperor of Rome. The tragedy is a Roman play characterized by swift, panoramic shifts in geographical locations and in registers, alternating between sensual, imaginative Alexandria and the more pragmatic, austere Rome. Many consider the role of Cleopatra in this play one of the most complex female roles in Shakespeare's work. She is frequently vain and histrionic, provoking an audience almost to scorn; at the same time, Shakespeare's efforts invest both her and Antony with tragic grandeur. These contradictory features have led to famously divided critical responses. — Excerpted from Wikipedia, the free encyclopedia. More e-Books from MobileReference - Best Books. Best Price. Best Search and Navigation (TM) All fiction books are only $0.99. All collections are only $5.99Designed for optimal navigation on Kindle and other electronic devices Search for any enter mobi (shortened MobileReference) and a keyword; for mobi ShakespeareTo view all books, click on the MobileReference link next to a book title Literary Over 10,000 complete works by Shakespeare, Jane Austen, Mark Twain, Conan Doyle, Jules Verne, Dickens, Tolstoy, and other authors. All books feature hyperlinked table of contents, footnotes, and author biography. Books are also available as collections, organized by an author. Collections simplify book access through categorical, alphabetical, and chronological indexes. They offer lower price, convenience of one-time download, and reduce clutter of titles in your digital library. The Illustrated King James Bible, American Standard Bible, World English Bible (Modern Translation), Mormon Church's Sacred Texts Rousseau, Spinoza, Plato, Aristotle, Marx, Engels Travel Guides and Phrasebooks for All Major New York, Paris, London, Rome, Venice, Prague, Beijing, Greece Medical Study Anatomy and Physiology, Pharmacology, Abbreviations and Terminology, Human Nervous System, Biochemistry College Study FREE Weight and Measures, Physics, Math, Chemistry, Organic Chemistry, Statistics, Languages, Philosophy, Psychology, Mythology Art History, American Presidents, U.S. History, Encyclopedias of Roman Empire, Ancient Egypt Acupressure Guide, First Aid Guide, Art of Love, Cookbook, Cocktails, Astrology The World's Biggest Mobile Encyclopedia; CIA World Factbook, Illustrated Encyclopedias of Birds, Mammals",
  "genres": [
    "Classics",
    "Plays",
    "Drama",
    "Fiction",
    "Historical Fiction",
    "Romance",
    "Literature"
  ],
  "author": "William Shakespeare",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/13070348-antony-and-cleopatra"
}