{
  "title": "The Circle of Fire: The Metaphysics of Yoga",
  "description": "The Circle of Fire examines the eternal metaphysical questions “What is God?” and “What is the purpose of life?” The book discusses the answers to these questions given by Western science and different schools of Indian thought, specifically detailing the answers to be found in India's two most developed atheistic traditions, Hinduism and Buddhism.Representative of a generation of Indians who have grown up with the best in scientific education and spiritual values, author P.J. Mazumdar takes a hard look at religion, science, and how two seemingly divergent bodies of knowledge can be brought together. Like Deepak Chopra a generation earlier, Mazumdar is both a medical doctor and a member of a family steeped in Hindu tradition, and is therefore well-placed to elucidate ancient Indian philosophy to the modern analytical mind. Acknowledging the metaphysical insights to be found in both Western science and Eastern spirituality, Mazumdar pays special attention to the highest school of philosophy of Hinduism, Advaita, and its application to practical spirituality through the teachings and practice of Yoga.The book takes its structure from the Vedas, and is similarly divided into Jnanakanda (Knowledge) and Karmakanda (Actions); the first part examines the body of knowledge from European and Indian sources addressing the question of God and the second part looks at practical ways of applying this knowledge through different schools of Hindu and Buddhist philosophy. The book explores the purest form of nondual Hindu philosophy, Advaita, and points out how the theories underpinning Buddhism and Advaita, although they appear to contradict each other, are the only theories that remain consistent with the findings of modern science. The author makes the brave assertion that ultimately one or the other will be the theory realized by science as the ultimate metaphysical truth.Like other books on the meeting of science and spirituality (Fritzjof Capra's 80s classic The Tao of Physics ) and the necessity of a scientifically compatible notion of God (Richard Dawkin's The God Delusion ), The Circle of Fire is ambitious in scope and a challenging, rewarding read.",
  "genres": [],
  "author": "P.J. Mazumdar",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/7737864-the-circle-of-fire"
}