{
  "title": "A Charlie Brown Christmas: The Making of a Tradition",
  "description": "Since its top-rated debut on CBS in December 1965, A Charlie Brown Christmas has been one of America's most beloved television shows. Year after year, fans of all ages tune in to the Emmy-winning Christmas special that has earned a permanent place in the nation's popular culture.This collector's treasury contains the entire script of A Charlie Brown Christmas, illustrated with full-color stills from the animated film. Producer Lee Mendelson and animator Bill Melendez pay tribute to the program with personal memories and reflections about the show, including charming anecdotes about their long friendship and working career with Peanuts creator Charles M. Schulz. Offering rare, behind-the-scenes insights, they also share memories of the late, great jazz pianist/composer Vince Guaraldi and provide never-before-published background sketches, storyboards, production sheets, and other materials that bring the making of the show to life.A Charlie Brown Christmas: The Making of a Tradition also brings the sound of the show home with the piano/vocal musical scores for Guaraldi's \"Christmas Time Is Here\" and \"Linus and Lucy,\" two songs that have become standards of American popular music.As the very first Peanuts special, A Charlie Brown Christmas brought Charlie Brown, Linus, Lucy, Snoopy, and the rest of the gang to television. In addition to breaking the mold by using jazz music (which exposed millions of people to jazz for the first time and inspired a generation of jazz pianists), A Charlie Brown Christmas broke new ground by using real children for the voices instead of adult actors. Schulz, Mendelson, and Melendez created these and other innovations that made A Charlie Brown Christmas a unique and timeless work of animation art.A Charlie Brown Christmas: The Making of a Tradition celebrates this award-winning and history-making show with warmhearted memories, fascinating trivia, and colorful animation art that will delight fans of all ages.",
  "genres": [
    "Christmas",
    "Nonfiction",
    "Holiday",
    "Art",
    "Comics",
    "History",
    "Childrens"
  ],
  "author": "Lee Mendelson",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/77375.A_Charlie_Brown_Christmas"
}