{
  "title": "Cannabis Policy: Moving Beyond Stalemate",
  "description": "Cannabis, marijuana, pot, ganja - it goes by many names - is by far the most widely used illegal substance, and accounts for more arrests than any other drug. Barely a week goes by without this drug appearing in the newspapers, and politicians have famously tied themselves in knots, trying to decide just how to deal with this recreational drug. While there have been many drug policy books on other substances - both legal and illegal, few have focused on this drug.Cannabis Moving Beyond Stalemate is unique in providing the materials needed for deciding on policy about cannabis in its various forms. It reviews the state of knowledge on the health and psychological effects of cannabis, and its dangerousness relative to other drugs. It considers patterns and trends in use, the size and character of illicit markets, and the administration of current policies, including arrests and diversion to treatment, under the global prohibition regime. It looks at the experience of a number of countries which have tried reforming their regimes and softening prohibition, exploring the kinds of changes or penalties for use for including depenalization, decriminalization, medical control, and different types of legalization. It evaluates such changes and draws on them to assess the effects on levels and patterns of use, on the market, and on adverse consequences of prohibition. For policymakers willing to look outside the box of the globalprohibition regime, the book examines the options and possibilities for a country or group of countries to bring about change in, or opt out of, the global control system.Throughout, the book examines cannabis within a global frame, and provides in accessible form information which anyone considering reform will need in order to make decisions on cannabis policy (much of which is new or has not been readily available). This book will be essential for those involved in policymaking and be of interest to a wide range of readers interested in drugs and drug policy, as well as being an excellent supplementary text for university courses in criminology, policy science, social science, or public health.",
  "genres": [],
  "author": "Robin Room",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/7741050-cannabis-policy"
}