{
  "title": "Give Me Tomorrow: The Korean War's Greatest Untold Story",
  "description": "An epic story of valor and sacrifice by a legendary Marine company in the Korean War brought to gripping, cinematic light by an acclaimed historian (\"Gives the brave Marines of George Company long overdue recognition\"--New York Post) \"What would you want if you could have any wish?\" asked the photojournalist of the haggard, bloodied Marine before him. The Marine gaped at his interviewer. The photographer snapped his picture, which became the iconic Korean War image featured on this book's jacket. \"Give me tomorrow,\" he said at last.After nearly four months of continuous and agonizing combat on the battlefields of Korea, such a simple request seemed impossible. For many men of George Company, or \"Bloody George\" as they were known-one of the Forgotten War's most decorated yet unrecognized companies-it was a wish that would not come true.This is the untold story of \"Bloody George,\" a Marine company formed quickly to answer its nation's call to duty in 1950. This small band of men-a colorful cast of characters, including a Native American fighting to earn his honor as a warrior, a Southern boy from Tennessee at odds with a Northern blue-blood reporter-turned-Marine, and a pair of twins who exemplified to the group the true meaning of brotherhood-were mostly green troops who had been rushed through training to fill America's urgent need on the Korean front. They would find themselves at the tip of the spear in some of the Korean War's bloodiest battles.After storming ashore at Inchon and fighting house-to-house in Seoul, George Company, one of America's last units in reserve, found itself on the frozen tundra of the Chosin Reservoir facing elements of an entire division of Chinese troops. They didn't realize it then, but they were soon to become crucial to the battle-modern-day Spartans called upon to hold off ten times their number. Give Me Tomorrow is their unforgettable story of bravery and courage. Thoroughly researched and vividly told, Give Me Tomorrow is fitting testament to the heroic deeds of George Company. They will never again be forgotten.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "Military History",
    "War",
    "Audiobook",
    "Biography"
  ],
  "author": "Patrick K. O'Donnell",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/10333483-give-me-tomorrow"
}