{
  "title": "The Slithering Shadow",
  "description": "The desert shimmered in the heat waves. Conan the Cimmerian stared out over the achingdesolation and involuntarily drew the back of his powerful hand over his blackened lips. Hestood like a bronze image in the sand, apparently impervious to the murderous sun, thoughhis only garment was a silk loincloth, girdled by a wide gold-buckled belt from which hunga saber and a broad-bladed poniard. On his clean-cut limbs were evidences of scarcelyhealed wounds.At his feet rested a girl, one white arm clasping his knee, against which her blond headdrooped. Her white skin contrasted with his hard bronzed limbs; her short silken tunic, low-necked and sleeveless, girdled at the waist, emphasized rather than concealed herlithe figure.Conan shook his head, blinking. The sun's glare half blinded him. He lifted a small canteenfrom his belt and shook it, scowling at the faint splashing within.The girl moved wearily, whimpering.\"Oh, Conan, we shall die here! I am so thirsty!\"The Cimmerian growled wordlessly, glaring truculently at the surrounding waste, withoutthrust jaw, and blue eyes smoldering savagely from under his black tousled mane, as ifthe desert were a tangible enemy.He stooped and put the canteen to the girl's lips.\"Drink till I tell you to stop, Natala,\" he commanded.She drank with little panting gasps, and he did not check her. Only when the canteen wasempty did she realize that he had deliberately allowed her to drink all their water supply, little enough that it was.Tears sprang to her eyes. \"Oh, Conan,\" she wailed, wringing her hands, \"why did you let medrink it all? I did not know-now there is none for you!\"\"Hush,\" he growled. \"Don't waste your strength in weeping.\"Straightening, he threw the canteen from him.\"Why did you do that?\" she whispere",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Adventure",
    "Horror",
    "Pulp",
    "Sword and Sorcery"
  ],
  "author": "Robert E. Howard",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/7742820-the-slithering-shadow"
}