{
  "title": "Grown Up All Wrong: 75 Great Rock and Pop Artists from Vaudeville to Techno",
  "description": "Two generations of American music lovers have grown up listening with Robert Christgau, attuned to his inimitable blend of judgment, acuity, passion, erudition, wit, and caveat emptor . His writings, collected here, constitute a virtual encyclopedia of popular music over the past fifty years. Whether honoring the originators of rock and roll, celebrating established artists, or spreading the word about newer ones, the book is pure enjoyment, a pleasure that takes its cues from the sounds it chronicles.A critical compendium of points of interest in American popular music and its far-flung diaspora, this book ranges from the 1950s singer-songwriter tradition through hip-hop, alternative, and beyond. With unfailing style and grace, Christgau negotiates the straits of great music and thorny politics, as in the cases of Public Enemy, blackface artist Emmett Miller, KRS-One, the Beastie Boys, and Lynyrd Skynyrd. He illuminates legends from pop music and the beginnings of rock and roll―George Gershwin, Nat King Cole, B. B. King, Chuck Berry, and Elvis Presley―and looks at the subtle transition to just plain “rock” in the music of Janis Joplin, the Rolling Stones, Eric Clapton, Aretha Franklin, James Brown, and others. He praises the endless vitality of Al Green, George Clinton, and Neil Young. And from the Rolling Stones to Sonic Youth to Nirvana, from Bette Midler to Michael Jackson to DJ Shadow, he shows how money calls the tune in careers that aren’t necessarily compromised by their intercourse with commerce.Rock and punk and hip-hop, pop and world this is the music of the second half of the twentieth century, skillfully framed in the work of a writer whose reach, insight, and perfect pitch make him one of the major cultural critics of our time.",
  "genres": [
    "Music",
    "Essays",
    "Nonfiction",
    "History"
  ],
  "author": "Robert Christgau",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/774195.Grown_Up_All_Wrong"
}