{
  "title": "The Skull Ring",
  "description": "Julia Stone's past comes creeping back when she discovers a strange silver ring, and three men want to help her--but choosing the wrong one could cost not only her heart but her soul.THE SKULL RINGDr. Pamela Forrest is determined to bring Julia's memories to the surface, hoping to heal Julia's panic disorder. The therapist keeps returning Julia to a night twenty-three years ago when Julia was four. A night of hooded figures, strange chants, pain, and blood. The night her father disappeared from the face of the earth.But the line between the past and the present begins to blur when Julia finds a silver skull ring that bears the name \"Judas Stone.\" Someone is leaving strange messages inside her house, even though the door is locked. The handyman, who has a key, spends a lot of time in the woods behind her house. Her boyfriend Mitchell becomes distant and violent. And the cop who investigated her father's disappearance has followed her to the small Appalachian town of Elkwood.Now she has a head full of memories, but she doesn't know which are real and which are the creations of Dr. Forrest. The shadows of Julia's panic are growing larger and darker. But succumbing to madness seems safer than heeding the whispers that claim ownership of her body and soul.-----Revised November 2010. DRM-free. A romantic psychological thriller from the bestselling Kindle author of LIQUID FEAR, DISINTEGRATION, CRIME BEAT, THE RED CHURCH, SPEED DATING WITH THE DEAD, and DRUMMER BOY. Visit Scott Nicholson's blog at Author Central on Amazon.Excerpt bonus material BENEATH by from Jeremy Robinson33 A.D. by David McAfeeTORMENT by Jeremy Bishop.----------------------------------------------\"A wonderful storyteller.\"-Sharyn McCrumb, author of The Ballad novels\"Always surprises and always entertains.\"--Jonathan Maberry, The Dragon Factory\"The Skull Ring creates unforgettable settings and characters. Nicholson weaves together fear and hope, cloaking his readers in palpable suspense.\"--Eric Wilson, NY Times best-selling Christian suspense novelist\"Scott Nicholson is a terrific writer. Like Stephen King, he has an eye and ear for the rhythms of rural America, and like King he knows how to summon serious scares. My advice? Buy everything he writes. This guy's the real deal..\"--Bentley Little, His Father's Son\"Keep both hands on your pants, because Nicholson is about to scare them off.\"--J.A. Konrath, author of Shaken\"A chilling, suspense-filled psychological thriller.\" --Vicki Tyley, Thin Blood",
  "genres": [
    "Horror",
    "Mystery",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Crime",
    "Thriller"
  ],
  "author": "Scott Nicholson",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/7743143-the-skull-ring"
}