{
  "title": "Krazy Kat & the Art of George Herriman: A Celebration",
  "description": "Krazy Kat & the Art of George Herriman is a tribute to one of the most influential and innovative comic strips and creators of all time. This unique collection of rare art, essays, memorabilia, and biography highlights the career of the first genius of comics, George Herriman, and his iconic creations, Krazy Kat and Ignatz Mouse. During its 31-year run, Krazy Kat was enormously popular with the public, as well as influential writers, artists, and intellectuals of the time. This book includes original essays by Jay Cantor, Douglas Wolk, Harry Katz, Richard Thompson, Dee Cox (Herriman's granddaughter), Craig McCracken, Bill Watterson, and authorized reprints of two seminal essays on Herriman by Gilbert Seldes and E. E. Cummings, alongside newly discovered vintage essays by TAD, Summerfield Baldwin, and Toots Herriman. With Krazy Kat & the Art of George Herriman, Craig Yoe reveals this influential artist and writer for a whole new generation.Praise for Krazy Kat & the Art of George Herriman : “The gorgeous volume includes essays by comics historians and creators (including Calvin & Hobbes’ reclusive Bill Watterson and poet e.e. cummings) as well as generous servings of sketches, strips, original art and more.” –– Miami Herald“Craig Yoe has dug up never-published artwork, artifacts, and letters that will bring Herriman to life for the uninitiated while giving fans something new to feast on.” –– Los Angeles Magazine“It’s the ephemera that make this collection invaluable.” —The A.V. Club“Craig Yoe has crafted a book that shows as well as it tells; it’s a wonderful combination of elegant design and informed and insightful scholarship that does a fine job of conveying why the comic strip is still so fondly remembered nearly a hundred years after its creation.” —ICv2",
  "genres": [
    "Comics",
    "Art",
    "Comic Strips",
    "History",
    "Humor",
    "Nonfiction",
    "Classics"
  ],
  "author": "Craig Yoe",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/7744090-krazy-kat-the-art-of-george-herriman"
}