{
  "title": "The Alchemist's Daughter",
  "description": "There are long-held secrets at the manor house in Buckinghamshire, England, where Emilie Selden has been raised in near isolation by her father. A student of Isaac Newton, John Selden believes he can turn his daughter into a brilliant natural philosopher and alchemist. Secluded in their ancient house, with only two servants for company, he fills Emilie with knowledge and records her progress obsessively.In the spring of 1725, father and daughter begin their most daring alchemical experiment to date—they will attempt to breathe life into dead matter. But their work is interrupted by the arrival of two strangers: one a researcher, the other a dazzling young merchant. During the course of a sultry August, while her father is away, Emilie experiences the passion of first love. Listening to her heart rather than her head, she makes a choice.Banished to London and plunged headlong into a society that is both glamorous and ruthless, Emilie discovers that for all her extraordinary education she has no insight into the workings of the human heart. When she tries to return to the world of books and study, she instead unravels a shocking secret that sets her on her true journey to enlightenment.The Alchemist’s Daughter is a gripping, evocative tale. Set against the backdrop of eighteenth-century London society, it is an unforgettable story of one woman’s journey through a world of mystery, passion, and obsession.Selden Manor was the crucible in which my father, the Gills, and I lived together. I peer into it now with the respectful caution with which I was taught to approach any volatile experiment. I am searching for a day to illustrate our life before 1725, the year when everything changed. And unlike the blacksmith’s daughter, I am an expert in observation. I know what I am looking for—bubbles of gas, a rise in temperature, an alteration in texture—small indications of chemical change that mean something significant is happening. —from The Alchemist’s Daughter From the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Romance",
    "Audiobook",
    "18th Century",
    "Adult"
  ],
  "author": "Katharine McMahon",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/774601.The_Alchemist_s_Daughter"
}