{
  "title": "Marc Ellis - Crossing the Line",
  "description": "Marc Ellis has been entertaining New Zealanders on the sports field and our television screens for more than a decade.A larrikin, a hard case, and at times, a bit of a stirrer, he's never short of an opinion or a mischief-making idea.In Crossing the Line, Ellis lets us into his private life for the first time. In his own inimitable way, he delves into his past with candour and humour.He talks about his charmed childhood, growing up the only child of devoted parents, developing an early knack for getting into trouble, and his precocious sporting ability. He speaks candidly about his university days in Dunedin, including the high jinks he and his ragtag bunch of varsity mates got up to.Ellis chronicles his rugby career and his feelings about the men Gordon Hunter, Jock Hobbs, Laurie Mains, Earle Kirton who steered it. He writes of the five years he spent playing for his beloved Otago team, of the court sessions and after-match shenanigans.And of his tours as an All Black, with some of the real characters of New Zealand rugby.Post-rugby, Ellis outlines his wins and losses in the business world, taking 'Charlie's' from a small fresh juice business to a multi-million dollar operation, and his ongoing work asone of the country's best-loved television presenters.He is disarmingly honest about the bad times too, and for the first time gives his no-holds barred side of the story about his relegation from first division league and the loss of confidence that followed; the 'Sweating like a rapist' debacle; and various brushes with the law, including his most recent and serious a drug conviction after being caught buying Ecstasy.Along the way Ellis also lets us know (in no uncertain terms) how he feels about politics, the PC movement, and becoming public property.With each and every entertaining anecdote, there's an insight into the motivation and philosophy that drives Ellis, making Crossing the Line, a compelling and amusing read for any New Zealander.",
  "genres": [],
  "author": "Marc Ellis and Kirsten Matthew",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/7744876-marc-ellis---crossing-the-line"
}