{
  "title": "The Carter Family: Don't Forget This Song",
  "description": "Winner of the 2013 Eisner Award for Best Reality-Based Work!The Carter Family: Don’t Forget This Song is a rich and compelling original graphic novel that tells the story of the Carter Family—the first superstar group of country music—who made hundreds of recordings and sold millions of records. Many of their hit songs, such as “Wildwood Flower” and “Will the Circle Be Unbroken,” have influenced countless musicians and remain timeless country standards.The Carter Family: Don’t Forget This Song is not only a unique illustrated biography, but a moving account that reveals the family’s rise to success, their struggles along the way, and their impact on contemporary music. Illustrated with exacting detail and written in the Southern dialect of the time, its dynamic narrative is pure Americana. It is also a story of success and failure, of poverty and wealth, of racism and tolerance, of creativity and business, and of the power of music and love. Includes bonus CD with original Carter Family music. Praise for The Carter Family: \"What a fine marriage of form and content! Humble and moving—straightforward with occasional breathtaking bravura passages—this book echoes the Carter Family's rough-hewn sounds. It tells of the lives, sorrows, and values of a lost America in short episodes like a giant stack of old 78s. Using the vocabulary of comic strips like Little Orphan Annie and Gasoline Alley, it's as obsessive in its dedication to vernacular craft and hard work as A.P. Carter himself. Frank Young and David Lasky have spun a work of visual music that will replay in your head and heart well after you've finished reading it.\"—Art Spiegelman, Pulitzer Prize-winning writer/artist of Maus “Charming, faithful, and resonant . . . will charm the pants off you.” —The Comics Journal “Lasky’s gorgeous artwork animates the story and evokes a mood that mirrors the era and the music.” —NPR.org “Pure pleasure for anyone interested in music history.” —The Seattle Times “Cracking open The Carter Family feels like putting on a vintage 78: moody hearty Americana emanates hauntingly. Enlivening this graphic biography of the legendary country music family are both Frank M. Young’s dialogue, which replicates the vernacular to a T but oh so naturally, and David Lasky’s understated and elegant illustrations which resonate like the music they depict.” —HeebMagazine.com",
  "genres": [
    "Music",
    "Graphic Novels",
    "Comics",
    "Nonfiction",
    "Biography",
    "History",
    "American History"
  ],
  "author": "Frank M. Young",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/7744091-the-carter-family"
}