{
  "title": "The Adventures of Lucky Pierre",
  "description": "Lucky Pierre is the most famous man in Cinecity, where pornography is the basis of social norms and the mayoral motto is “Pro Bono Pubis.” He walks to work (the studio where his films are made) in the winter cold, icicles tipping his constantly exposed and engorged penis, and every small interaction provides another opportunity for exercising his prurient art.This vision of a sexualized universe is unique in that social power (and the power to direct, rather than merely appear in, these sex-films) belongs entirely to women. Each chapter (or “reel”) of the book is headed with the name of one of nine women (so, in reality, they are muses, but they are also the artists), and each bears her aesthetic stamp—whether the dominatrix mayor, the experimental avant-garde filmmaker, the ribald cartoonist who “reanimates” him with her pen when he has been left by the mayor in a snowbank to freeze, the wife who makes tender home sex movies, etc. Lucky Pierre himself seems to have no free will, indeed, no existence outside his films. He is commanded by these women, and by the overwhelming impulses of his prodigiously endowed organ.The book is a collection of fantasies—a man entering his office instantly begins acrobatically copulating with the receptionist on her desk; a piano teacher administers discipline to his nubile young female students; a castaway discovered by the Nine Muses, who have never seen a man before and quickly begin to test his unfamiliar parts; an engagement party turns into a frenzied bacchanal; a wedding into a sadomasochistic ritual and then a chase scene. But satisfaction is complicated. Pierre is often made ridiculous, a clown as much as a leading man, and always, everything that happens to him is seen; there is no part of his life that is not, potentially, a film. Several times, he attempts to escape, but he is always recaptured and punished—or his “escape” is proven never to be real in the first place. For example, he joins up with the Extars, a guerrilla group of squatters who adopt him as “Crazy Leg,” their leader; with them, in particular Lottie, their young leading lady, he rediscovers the vivid joys of life as a sexual outlaw—including copulating with her on the trapeze of a circus. But he can never escape the tentacles of the mayor and the “legit” industry of Cinecity. Later he is offered the chance to rejoin the Extars, his internalization of his new status won’t allow it—if it was ever a real choice.Are these Pierre’s fantasies? But in a world in which he does not own his own life or his body, where the past can be rewritten as easily as the dialogue can be faked in a redub of one of his scenes, his thoughts are not even his own. Even so, L.P. continues his perhaps futile attempts to define his own destiny. In the end, grown old and decrepit, he learns his next film is titled “The Final Fuck”—i.e., it’s the end of his career. Morose and attempting to avoid the inevitable, he flees to a showing of his own work, which ends up leading him, now resigned to his fate, back to the soundstage—where, in the end, he rediscovers ecstasy, and the closure of his destiny.",
  "genres": [
    "Novels",
    "Fiction",
    "American"
  ],
  "author": "Robert Coover",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/774785.The_Adventures_of_Lucky_Pierre"
}