{
  "title": "Here Comes Everybody: The Power of Organizing Without Organizations",
  "description": "A revelatory examination of how the wildfirelike spread of new forms of social interaction enabled by technology is changing the way humans form groups and exist within them, with profound long-term economic and social effects-for good and for ill A handful of kite hobbyists scattered around the world find each other online and collaborate on the most radical improvement in kite design in decades. A midwestern professor of Middle Eastern history starts a blog after 9/11 that becomes essential reading for journalists covering the Iraq war. Activists use the Internet and e-mail to bring offensive comments made by Trent Lott and Don Imus to a wide public and hound them from their positions. A few people find that a world-class online encyclopedia created entirely by volunteers and open for editing by anyone, a wiki, is not an impractical idea. Jihadi groups trade inspiration and instruction and showcase terrorist atrocities to the world, entirely online. A wide group of unrelated people swarms to a Web site about the theft of a cell phone and ultimately goads the New York City police to take action, leading to the culprit's arrest. With accelerating velocity, our age's new technologies of social networking are evolving, and evolving us, into new groups doing new things in new ways, and old and new groups alike doing the old things better and more easily. You don't have to have a MySpace page to know that the times they are a changin'. Hierarchical structures that exist to manage the work of groups are seeing their raisons dՐtre swiftly eroded by the rising technological tide. Business models are being destroyed, transformed, born at dizzying speeds, and the larger social impact is profound. One of the culture's wisest observers of the transformational power of the new forms of tech-enabled social interaction is Clay Shirky, and Here Comes Everybody is his marvelous reckoning with the ramifications of all this on what we do and who we are. Like Lawrence Lessig on the effect of new technology on regimes of cultural creation, Shirky's assessment of the impact of new technology on the nature and use of groups is marvelously broad minded, lucid, and penetrating; it integrates the views of a number of other thinkers across a broad range of disciplines with his own pioneering work to provide a holistic framework for understanding the opportunities and the threats to the existing order that these new, spontaneous networks of social interaction represent. Wikinomics, yes, but also wikigovernment, wikiculture, wikievery imaginable interest group, including the far from savory. A revolution in social organization has commenced, and Clay Shirky is its brilliant chronicler.",
  "genres": [
    "Nonfiction",
    "Business",
    "Technology",
    "Sociology",
    "Social Media",
    "Psychology",
    "Internet"
  ],
  "author": "Clay Shirky",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/7755317-here-comes-everybody"
}