{
  "title": "The Plume Hunter",
  "description": "Bird-watchers will love this journey back to the 1880s West Coast when vast populations of wild birds still filled the skies in annual migrations. But the birds were imperiled by plume hunters intent on personal fortune. This story of violence, love, and loss portrays the advent of the Audubon Society.A moving story of conflict, friendship, and love, The Plume Hunter follows the life of Fin McFaddin, a late-nineteenth century Oregon outdoorsman who takes to plume hunting – killing birds to collect feathers for women’s hats – to support his widowed mother. In 1885, more than five million birds were killed in the United States for the millinery industry, prompting the formation of the Audubon Society. The novel brings to life an era of our country’s natural history seldom explored in fiction, and follows Fin’s relationships with his lifelong friends as they struggle to adapt to society’s changing mores.Renée Thompson writes about wildlife, her love of birds, and the people who inhabit the American West. Her first novel, The Bridge at Valentine, received high praise from Pulitzer Prize-winner Larry McMurtry, author of Lonesome Dove. Renée lives in Northern California with her husband, Steve, and is at work on a short-story collection. The Plume Hunter won the 2012 da Vinci Eye Award, presented by the Eric Hoffer Award for Books, for its superior cover art.“I really enjoyed this book. It offers a fascinating glimpse into the life of a bird hunter and the complex social, economic and personal issues swirling around the birth of the conservation movement.” —-David Sibley, author of THE SIBLEY GUIDE TO BIRDS“Renée Thompson’s gripping novel transports the reader to a time when our nation was trying its best to grow up, yet seemed mired in its own awkward “teen” years...I read this book in one sitting, finding it no easier to put down than Fin did his hunting guns.” —-Bill Thompson III, Editor, Bird Watcher’s Digest“Renée Thompson brings us to a place of semi-darkness, with its confused emotions, and allows us to witness the “Hunter” changing from within. This is a story of process and a quest to redeem. I love it.” —-Fr. Tom Pincelli, Former Chairman, American Birding Association“A compelling chronicle of avarice, betrayal, and redemption.” —-Tim Gallagher, author of The Grail Bird\"[THE PLUME HUNTER is] an economically written literary drama sparked by expert dialogue and visualized through an acute sense of place.” —-Allen Pierleoni, book critic for The Sacramento Bee",
  "genres": [],
  "author": "Renee Thompson",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/13073897-the-plume-hunter"
}