{
  "title": "National Geographic Atlas of the World",
  "description": "Combining state-of-the-art cartographic technology and information with dynamic and diverse physiographic and cultural content, the Eight Edition is National Geographic's most accurate and interesting record of the world yet. The opening section, Ninety Years of Mapping at National Geographic, traces the founding of Geographic cartography to the present advances in technology and the practice of compiling and organizing geographic information. The atlas truly begins with three stunning new, full-spread world maps, that drape Earth's surface seamlessly with satellite imagery, then physical and natural features, and finally today's political world of countries and growing cities.World thematic topics are organized into two groups: the Physical and Natural World and Human Activities. The Physical and Natural World section includes captivating core topics such as the evolution of earth, geology and tectonics, climate and weather, oceans, world water, the bioshere, and biodiversity. Human Activities covers 11 world themes: population, migration and refugees, conflict and terrorism, cultures, economy, energy and minerals, communications, food, health and education, the environment, and ending with wildlands. All of these intriguing spreads reflect the most authoritative and recent data available and are reviewed by preeminent scholars and experts. Lined up after the world thematic focus is the continental division. All seven continents open with views from space and are then represented with separate physical and political maps. Larger scale regions of each continent are presented for higher definition and detail. Because of our primary readership, additional coverage is given to the UnitedStates and Canada. An entirely new component to the Eighth Edition is the city section. Maps and text discussing urban explosion will open this compilation of sixty new maps. Pictures, fact boxes, and text will accompany each city map to create colorful and informative portraits of our built environment. Selected cites such as, New York, Mexico City-the most densely populated city in the world, and Paris will receive more detailed scaling. Less familiar and remote areas of the world and beyond-the poles, the ocean floors, and space-are mapped with new data and findings and dramatic effects. The addition of a new spread and map devoted to Mars will provide a timely reference to the expected news coverage of NASA's Mars Exploration Rover Mission-Spirit and Opportunity. Flags and facts of every country in the world have been newly designed and consolidated into one section, listed in alphabetical order. Locater maps and cross referencing to corresponding large-scale map plates are provided for every entity. Text for each independent country summarizes physical and cultural aspects, while facts reveal the status of population, religion, area, capital, language, literacy, life expectancy, GDP, and economy. A user-friendly, 136 page, comprehensive place-name index cross-references over 130,000 geographical sites and areas. An appendix presents valuable, convenient reference to time zones, metric conversions, foreign terms, abbreviations, airline distances, and temperature and rainfall statistics from all corners of the globe. Navigating throughout the atlas is made easy with enhanced cross-referencing, pointers, labels and an end sheet that includes a visual key with corresponding platenumbers to all the maps. Every map spread in the atlas will include interactive features and access to up-to-the-minute updates and information via the electronic National Geographic Map Machine. Streams of information are available to us on myriad topics and on many fronts. At the same time, there is a need-greater than ever-to better understand our global culture. The Eighth Edition helps bridges the gap with a collection of maps and information that is as engaging as it is informative.",
  "genres": [
    "Reference",
    "Geography",
    "Nonfiction",
    "Travel",
    "Atlases",
    "Maps",
    "Science"
  ],
  "author": "National Geographic Society",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/775930.National_Geographic_Atlas_of_the_World"
}