{
  "title": "Legends II",
  "description": "Realm of the Elderlings: Homecoming / Robin HobbA Song of Ice and Fire: The Sworn Sword / George R.R. MartinThe Tales of Alvin Maker: The Yazoo Queen / Orson Scott CardOutlander: Lord John and the Succubus / Diana GabaldonMajipoor: The Book of Changes / Robert SilverbergOtherland: The Happiest Dead Boy in the World / Tad WilliamsPern: Beyond Between / Anne McCaffreyThe Riftwar: The Messenger / Raymond E. FeistThe Symphony of Ages: Threshold / Elizabeth HaydonAmerican gods: The Monarch of the Glen / Neil GaimanShannara: Indomitable / Terry Brooks1 ROBIN HOBB returns to the Realm of the Elderlings with “Homecoming,” a powerful tale in which exiles sent to colonize the Cursed Shores find themselves sinking into an intoxicating but deadly dream . . . or is it a memory?2 GEORGE R. R. MARTIN continues with Dunk, a young hedge knight, and his unusual squire, Egg, in “The Sworn Sword,”.3 ORSON SCOTT CARD puts Alvin Maker on the mighty Mississippi with ne’er-do-wells Jim Bowie and Abe Lincoln, in “The Yazoo Queen.”4 DIANE GABALDON puts Outlander misfit in “Lord John and the Succubus,” a supernatural thriller set in the early days of the Seven Years War.5 ROBERT SILVERBERG has a dilettantish poet in “The Book of Changes.”6 TAD WILLIAMS explores the strange afterlife of Orlando Gardiner from Otherland in “The Happiest Dead Boy in the World.”7 ANNE McCAFFREY shines a light into Pern in “Beyond Between.”8 RAYMOND E. FEIST sends one soldier on the ride of his life, an ordinary time for “The Messenger.”9 ELIZABETH HAYDON relates the destruction of Serendair and the fate of its last defenders in “Threshold,”10 NEIL GAIMAN tells of the man Shadow, after American Gods in “The Monarch of the Glen.”11 TERRY BROOKS adds an exciting epilogue to The Wishsong of Shannara in “Indomitable,” how Jair Ohmsford’ destroys the evil Ildatch, armed only with illusion.",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Science Fiction",
    "Science Fiction Fantasy",
    "Dragons"
  ],
  "author": "Robert Silverberg",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/77563.Legends_II"
}