{
  "title": "The Ambassadors",
  "description": "The Ambassadors is a novel by Henry James, originally published as a serial in the North American Review (NAR).Story:Concerned that her son Chad may have become involved with a woman of dubious reputation, the formidable Mrs. Newsome sends her 'ambassador' Strether from Massachusetts to Paris to extricate him. Strether's mission, however, is gradually undermined as he falls under the spell of the city and finds Chad refined rather than corrupted by its influence and that of his charming companion, the comtesse de Vionnet. As the summer wears on, Mrs. Newsome comes to the conclusion that she must send another envoy to Paris to confront the errant Chad, and a Strether whose view of the world has changed profoundly.The third-person narrative is told exclusively from Strether's point of view.Extract:After the opera, Strether tells Chad why he has come to Paris. However, as he speaks, Strether finds himself less certain of his stance. Chad, once callow and juvenile, now seems confident and restrained. His new personality impresses Strether, who wonders what—or who—has caused Chad’s transformation. Chad asks Strether to stay and meet his close friends, a mother and a daughter, who are arriving in a few days time. Strether, wondering if one of these women has been the impetus for Chad’s improvement, and assuming the daughter to be Chad’s lover, agrees to stay. Meanwhile, Bilham convinces Strether that Chad has a “virtuous attachment”—and that Chad’s relationship with the mysterious woman is innocent. Strether eventually meets the women, Madame de Vionnet and her daughter, Jeanne, at a high society party, but he does not see them long enough to cement an impression. After the brief introduction to Madame de Vionnet, Strether finds himself alone with little Bilham. Strether takes the opportunity to offer Bilham some sage advice: live all you can before it is too late. This advice exposes Strether’s own change since coming to Europe. In Paris, he feels renewed, young again, doubly alive. Over...",
  "genres": [
    "Classics",
    "Fiction",
    "Literature",
    "American",
    "Novels",
    "France",
    "Literary Fiction"
  ],
  "author": "Henry James",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/775366.The_Ambassadors"
}