{
  "title": "Star Trek Memories",
  "description": "Recall the glory days of the original Star Trek, with the book that goes where no memoir has gone before…Beginning in 1966 as something a little out of the ordinary for prime-time TV, and suffering from shaky ratings throughout its entire run, Star Trek went on to spend the better part of the next three decades exploding into a worldwide, billion-dollar industry. How did this happen? What made the show so unique that it spawned a devoted global following?While many books have attempted to tell the real, behind-the-scenes Trek story, the tale can best be told through the voice and privileged perspective of a man who actually lived through it all. That man is William Shatner (aka Captain James Tiberius Kirk). Gathering his personal recollections along with those of Leonard Nimoy, DeForest Kelley, George Takei, Walter Koenig, Nichelle Nichols, Majel Barrett-Roddenberry and Star Trek producers, designers, production crew and special effects wizards, William Shatner’s Star Trek Memories is crammed with the back stage drama of the series’ creation. Here, in the stars’ and creators’ own words, are such memories as:• Shatner and Nimoy’s close friendship of almost thirty years.• The outrageous practical jokes of Star Trek’s cast, crew and especially Gene Roddenberry.• The truth about Kirk and Uhura’s first prime-time interracial kiss.• Nichelle Nichols’s surprising fan—who convinced her not to quit the show.• What really happened to Yeoman Rand and Captain Pike?• The fight with Harlan Ellison over “City on the Edge of Forever”—and how he ultimately helped to save Star Trek from cancellation.• The full history of the overwhelming “Save Star Trek” campaign—which was only good enough to work for one final season.Filled with heartfelt warmth and genuine fondness that can only exist among colleagues who have spent years together through thick ad thin, Star Trek Memories is the definitive reminiscence of the show that has become a true cultural phenomenon.(from dust jacket flaps)",
  "genres": [
    "Star Trek",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "History"
  ],
  "author": "William Shatner",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/77549.Star_Trek_Memories"
}