{
  "title": "Second Chances",
  "description": "Harold Wainwright is dying. At seventy-nine, stricken with malignant cancer, the multi-billionaire insurance mogul realizes he has much to regret. In his youth he rejected his only true love and instead chose to advance his career and build his financial empire. Single-mindedly he focused upon achieving his own goals, looking out for number one, and acquiring a monetary fortune. Now he is alone, and all he has is his money…and his life is over.Doctor Timothy Drayton has devoted his entire career to developing the technology to prolong human life. His entire focus has been upon creating a computer chip which can be implanted into the human brain, allowing human consciousness to be transferred from one human subject into the mind of another. Given optimum circumstances, he is confident that he can now preserve the consciousness of a dying patient into the mind of a donor subject with a surgically electronic implant.Jesse Warren is eighteen years old, about to graduate from high school. He’s a track star, model student, and the typical all-American kid. One day while on his way to track practice, tragedy strikes, and Jesse is in a terrible accident, rendered comatose. When his family learns the horrifying news, they believe they’ve lost their son forever. Jesse Warren is pronounced “brain dead”.When neurosurgeon and world-renowned brain specialist Dr. Timothy Drayton arrives, telling the Warren family that he has an advanced form of experimental treatment which can possibly save young Jesse and restore his consciousness, the Warrens are convinced that God has sent them a miracle. They are overjoyed the next morning when their son undergoes surgery and awakens as a new man. His memory loss, they are convinced, is amnesia due to his accident.Jesse lives, and is given a second chance. Will his new life prove to be the impetus for significant change, or will the old Harold Wainwright emerge to make the same mistakes a second time around? Most of us are given but one chance to make the right choices, but imagine if… there were such things as Second Chances.",
  "genres": [
    "M M Romance",
    "LGBT",
    "Romance",
    "Contemporary",
    "Science Fiction"
  ],
  "author": "Jeff Erno",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/13073781-second-chances"
}