{
  "title": "Elogio y refutación del ingenio",
  "description": "¿Qué es el ingenio? ¿Por qué disfrutamos tanto con sus juegos y alardes? ¿Cómo funciona la inteligencia humana cuando crea obras ingeniosas? Desde hacía mucho tiempo se echaba en falta una respuesta a estas preguntas, que la psicología, la estética y la filosofía iban demorando por su complejidad. En 1894, Paul Valéry escribía a André Gide: «Entre los libros realmente indispensables y que nadie escribirá, hojeo con frecuencia en mi espíritu la Historia y filosofía de la ingeniosidad». Valéry se equivocó en su predicción, porque este libro contiene lo que él consideraba necesario e improbable: una investigación sobre tan sorprendentes creaciones de la inteligencia. Para el autor, el ingenio es esencialmente un proyecto de la inteligencia para vivir jugando, libre y desvinculada, a salvo de la lógica, la moral y la realidad. Quiere zafarse de la seriedad, para lo cual convierte en juguete cuanto la rodea. Por ejemplo, el lenguaje. Los juegos de palabras son un divertido ejemplo de esta «juguetización» generalizada.La cultura de este siglo ha buscado la ingeniosidad con denuedo y con un punto de desesperanza. El arte moderno es una monumental broma, un chiste continuado, una admirable obra de ingenio, una parábola de la libertad. La filosofía se ha vuelto también ocurrente y fragmentaria, seducida por una racionalidad de fogonazo, deslumbrante, instantánea, limitada y efímera. Incluso la economía se sintió atraída por la irreal agilidad del ingenio.Hemos vivido lo que el autor denomina \"la época ingeniosa\". Esos variados fenómenos eran sólo el despliegue de una noción de libertad que ha entrado en crisis ahora, cuando la orgía se ha acabado, hemos oído ya todos los chistes, gran parte de la cultura de este siglo aparece prematuramente envejecida, y el hombre europeo no sabe qué hacer. Un nuevo concepto de libertad, que se ventea en el aire, generará, sin duda, un nuevo modo de crear.La brillantez del ingenio nos muestra una inteligencia inagotable, consciente de su habilidad, enemiga de toda veneración, devaluadora implacable, que coquetea con la transgresión y aspira a vivir una libertad radicalmente desligada. Por todo esto merece, al tiempo, un elogio y una refutación.",
  "genres": [
    "Philosophy"
  ],
  "author": "José Antonio Marina",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/775270.Elogio_y_refutaci_n_del_ingenio"
}