{
  "title": "The Private Life of Chairman Mao",
  "description": "“The most revealing book ever published on Mao, perhaps on any dictator in history.”—Professor Andrew J. Nathan, Columbia UniversityFrom 1954 until Mao Zedong's death twenty-two years later, Dr. Li Zhisui was the Chinese ruler's personal physician, which put him in daily—and increasingly intimate—contact with Mao and his inner circle. in The Private Life of Chairman Mao , Dr. Li vividly reconstructs his extraordinary experience at the center of Mao's decadent imperial court.Dr. Li clarifies numerous long-standing puzzles, such as the true nature of Mao's feelings toward the United States and the Soviet Union. He describes Mao's deliberate rudeness toward Khrushchev and reveals the actual catalyst of Nixon's historic visit. Here are also surprising details of Mao's personal depravity (we see him dependent on barbiturates and refusing to wash, dress, or brush his teeth) and the sexual politics of his court. To millions of Chinese, Mao was more god than man, but for Dr. Li, he was all too human. Dr. Li's intimate account of this lecherous, paranoid tyrant, callously indifferent to the suffering of his people, will forever alter our view of Chairman Mao and of China under his rule.Praise for The Private Life of Chairman Mao“From now one no one will be able to pretend to understand Chairman Mao's place in history without reference to this revealing account.” —Professor Lucian Pye, Massachusetts Institute of Technology“Dr. Li does for Mao what the physician Lord Moran's memoir did for Winston Churchill—turns him into a human being. Here is Mao eccentric, demanding, suspicious, unregretful, lascivious, and unfailingly fascinating. Our view of Mao will never be the same again.” —Ross Terrill, author of China in Our Time“An extraordinarily intimate portrait of Mao. [Dr. Li] portrays [Mao's imperial court] as a place of boundless decadence, licentiousness, selfishness, relentless toadying and cutthroat political intrigue.” —Richard Bernstein, The New York Times“One of the most provocative books on Mao to appear since the publication of Edgar Snow's Red Star Over China. ” —Paul G. Pickowicz, The Wall Street Journal",
  "genres": [
    "China",
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "Asia",
    "Memoir"
  ],
  "author": "Li Zhisui",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/775647.The_Private_Life_of_Chairman_Mao"
}