{
  "title": "Tales of the Red Moon Clan",
  "description": "Neol Pallaton walks alone through the bowels of society as a bounty hunter, until he shifts into a cougar to save Assistant D.A. Sara Hughes from certain death. A relentless killer keeps them moving by day through the Oregon forestand by night under the full moon, passion rules their hearts.  The rugged forest is no place for a beautiful and feisty city woman, but Neols determined to help Sara piece together why she's being hunted. Sara thought bounty hunters were brutal loners who stretched the law shes sworn to uphold. But Neol proves that no one can hunt, track and protect her like a Navajo medicine man from the Red Moon Clan.  Neol is willing to anger the spirits to protect his one true mate. Sara will have to bend the law to keep Neol and her aliveand together forever.  Excerpt:  She moaned with the sensation as he brought his fingers under her bra to touch the sensitive skin underneath.  She rubbed against his hard body like a cat in heat, desperately wanting to feel what she'd seen in the moonlight. Neol backed her toward the bed as his hands loosened the bra. With a quick tug, Sara became naked from the waist up.  He laid her gently onto the soft flannel and quickly took his shirt off over his head. His gaze feasted on her in the glow of the fire. His hands went for the zipper on his jeans.  Her eyes couldn't get enough of him as the fabric slid down and he revealed himself to her. Neol stood fully aroused then moved toward her like a predator. She quivered with pleasure. His muscles rippled as he leaned over her body and licked at the exposed flesh on her stomach and inhaled deeply.  \"I can smell your scent, your heat.\" Neol's rough voice mixed with a guttural purr of desire as he leaned up, piercing her soul with golden eyes. \"You would have me? Knowing what I am?\"  Hearing Neol's plea for acceptance as a man melted Sara's heart. How long had he been without a woman, because of the necessity for secrecy? Her hands moved to his smooth, ripped chest and she raked her nails gently downward. Neol exhaled a fast breath and shuddered with her touch.  \"What you are is part of why I want you, Neol.\" Sara spoke quietly and simply as her body pulsed with desire for this strange Navajo shape-shifter.  A sudden snap of a pine splitting from lightning and a roar of thunder close behind rattled the metal roof. She trembled from the soundNeol's name meant storm.  \"I've waited so long to hear those words, Sara.\" His mouth slowly descended to hers, and his fingertips followed the curve of her breast. He changed direction, tracing lazy circles to the zipper of her jeans. Her body flushed with heat from the pleasure, as his gentle, insistent hands pulled down her jeans and lacey thong. Lightning snapped brightly across the wall and the thunder rolled loudly far away. She shivered.  \"Be still for me, Sara; you're safe with me.\"  Neol's voice sounded like velvet to her ears. He took his time to taste and feel her body with his lips, tongue and fingers. She writhed at his touch, while he explored each collarbone, hip and the soft curve of her neck. Trapped by the pace and demand for her to be still, Sara's desire burned with each rapturous kiss. Neol licked at the tender flesh on the inside of her thigh and she moaned deeply.  \"Neol.\" The whisper left her lips with edgy need.  The foreplay had been agonizingly sweet; she wanted to melt into him, feel him inside of her. The excitement from his roaming lips seemed almost too much to bear.  Neol came down to lie next to her and brought his mouth to her breast with nips of teeth. She moaned as a lightning strike hit close by the cabin and rocked the bed in its quake.  He leaned up to gaze into her eyes. \"The storm has begun.\"",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Erotic Romance",
    "Romance",
    "Shapeshifters"
  ],
  "author": "Chérie De Sues",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/7757810-tales-of-the-red-moon-clan"
}