{
  "title": "The Improper Life of Bezellia Grove",
  "description": "Nobody in Nashville has a bigger name to live up to than Bezellia Grove.  As a Grove, she belongs to one of city’s most prominent families and is expected to embrace her position in high society.  That means speaking fluent French, dancing at cotillions with boys from other important families, and mastering the art of the perfect smile.   Also looming large is her given name Bezellia, which has been passed down for generations to the first daughter born to the eldest Grove. The others in the long line of Bezellias shortened the ancestral name to Bee, Zee or Zell. But Bezellia refuses all nicknames and dreams that one day she, too, will be remembered for her original namesake’s courage and passion.  Though she leads a life of privilege, being a Grove is far from easy. Her mother hides her drinking but her alcoholism is hardly a secret. Her father, who spends long hours at work, is distant and inaccessible. For as long as she can remember, she’s been raised by Maizelle, the nanny, and Nathaniel, the handyman. To Bezellia, Maizelle and Nathaniel are cherished family members. To her parents, they will never be more than servants.    Relationships are complicated in 1960s Nashville, where society remains neatly ordered by class, status and skin color. Black servants aren’t supposed to eat at the same table as their white employers. Black boys aren’t supposed to make conversation with white girls. And they certainly aren’t supposed to fall in love. When Bezellia has a clandestine affair with Nathaniel’s son, Samuel, their romance is met with anger and fear from both families. In a time and place where rebelling against the rules carries a steep price, Bezellia Grove must decide which of her names will be the one that defines her.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Southern",
    "Coming Of Age",
    "Chick Lit",
    "Book Club",
    "Contemporary"
  ],
  "author": "Susan Gregg Gilmore",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/7756401-the-improper-life-of-bezellia-grove"
}