{
  "title": "Three Kisses",
  "description": "Fictional action first written 10 years ago is even more relevant today. Actions move quickly through the Middle East: Syria, Lebanon, and Iraq; up and down the Appalachian region of the US; through the Midwest, Texas, and Mexico; a secret location that can never be mentioned publicly, and concluding in multiple locations in Minnesota, Washington DC, and Baltimore. In a story based on fictional versions of real characters, the author has known in actual locations where he has lived or visited frequently, the book entertains as well as informs and fosters acceptance, tolerance, and respect. Characters represent a broad cross-section of society, including military, immigrants, the LGBT+ community, U.S. government intelligence and law enforcement personnel, and legal experts.Jihadists attempt to infiltrate the US. Attacks in Canada are thwarted. American Muslims struggle to adapt and some excel. Al Qaeda exploits Russian medical technology to create a double to infiltrate the U.S. and obtain military secrets. His detection by surreptitious means provides the thread that ties together a plot and subplots, intriguing readers with the trials and tribulations of American Muslims and their susceptibility to exploitation. Undercover FBI resources uncover valuable clues to thwart terrorist activities in Canada and elsewhere. A Lebanese-American Army officer innocently plays an important role throughout, totally unaware of his role in the plots. A caring Syrian medical doctor wants only to begin a new life in North America but ends up back in the Middle East with a life he would never have anticipated. A Philippine military widow struggles to keep her family together while dealing with issues of her past that come back to haunt her. A twenty-something Arab language specialist and American gay Christian uncovers major clues that lead to uncovering of essential elements of the plot. Be prepared for fictional events first written ten years ago to come to life- albeit often regretfully- in recent years.",
  "genres": [
    "Thriller",
    "Fiction"
  ],
  "author": "Heath Daniels",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/7761443-three-kisses"
}