{
  "title": "Leviathan: The History of Whaling in America",
  "description": "Leviathan selected as one of the best nonfiction books of 2007 by The Los Angeles Times, The Boston Globe, and The Providence Journal. Leviathan was also chosen by Amazon.com's editors as one of the 10 best history books of 2007.\"To produce a mighty book, you must choose a mighty theme,\" proclaimed Herman Melville, and the vivid story of whaling is one of the mightiest themes in American history. Indeed, much of America's culture, economy, and even its spirit were literally and figuratively rendered from the bodies of whales. In Leviathan, the first one-volume history of American whaling in many decades, historian Eric Jay Dolin chronicles the epic battle between man and the sea — and, in this case, between man and beast — an often-violent struggle that animates the imagination and stirs our emotions. Beginning his engrossing narrative with Captain John Smith's botched whaling expedition to the New World in 1614, Dolin traces the rise of this burgeoning industry-from its rapid expansion in the colonial era and its brutal struggles during and after the Revolutionary War, to its Golden Age in the mid-1800s, when more than 60 ports got into the whaling business and the sails of America's whaleships whitened the seven seas. American whale oil lit the world and greased the gears of the industrial revolution. Baleen cut from the mouths of whales shaped the course of feminine fashion. Spermaceti, from sperm whales, produced amazingly brilliant and clean-burning candles, while ambergris gave perfumes great staying power and was worth its weight in gold. And the profits from whaling created great fortunes and helped fuel the nation's growth. Leviathan teems with fascinating vignettes, from the Pilgrims' frustrating encounters with whales, to the Candle Wars that pitted eighteenth-century New England Industrialists against each other, to the heroic cruise of Captain David Porter and the USS Essex, in which Porter and his men valiantly protected American whaleships during the War of 1812 until they themselves were captured by the British. Then there is the violent tale of Cyrus Plumer, a notorious troublemaker whose mutiny on the whaleship Junior is thrillingly retold. Among the most amazing accounts is that of the Shenandoah, a Confederate raider, which burned 22 of the 26 Union whaleships it captured, most after the Civil War had already ended. In the waning years of the nineteenth century, we witness the agonizingly slow death of an American industry, as the discovery of oil, tragic disasters in the Arctic, and changes in female fashion combine to transform the American whalemen into an historical relic. The final scene comes in 1924, as the whaleship Wanderer, wrecked on the shore of Cuttyhunk Island, provides the last glimpse of a bygone era. Through it all, those \"iron men in wooden boats\" created a legacy of dramatic, poignant, and at times horrific stories. This sprawling, maritime saga is filled with these tales, as well as rich, lyrical descriptions of whales and the sea. Original, stirring, and authoritative, Leviathan delivers the 300-year history of American whaling in vibrant detail, integrating literary, social, and economic history into an epic account of this once-vital industry.(W. W. Norton, 480 pp., 90 illustrations. Also available in Audiobook format from Tantor Audiobooks.)",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Animals",
    "Science",
    "Maritime",
    "Nature"
  ],
  "author": "Eric Jay Dolin",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/776215.Leviathan"
}