{
  "title": "Hereos A2Z #1: Alien Ice Cream",
  "description": "HEROES A2Z #1 ALIEN ICE CREAM I scream, you scream. It's alien ice cream! In this first adventure, the heroes try to keep their cool on the hottest day of the year. Soon, though, they discover that not all ice cream is created equal. Some is created by aliens that have plans to take over the world. The 14-book Heroes A2Z chapter book series follows the funny adventures of three superhero kids from Traverse City, Michigan. Each illustrated book includes over one hundred drawings. Meet Abigail, the oldest. When it comes to sports, she can't be beat--not at arm wrestling, not at archery, and certainly not at aces on the tennis court. Andrew comes next. He's Abigail's twin, youngest by a measly eight minutes. If it has wheels, Andrew can ride it. He's amazing, astounding, and accomplished on wheels. Last but definitely least is Baby Zoë. She's the strongest of the heroes, like Superman in a diaper. She can't walk that well, but she can fly and shoot lasers out of her eyes. Zoë puts the \"aww\" in awesome. Throughout their adventures, the superhero kids battle kung fu kitties, dinosaurs, aliens, monkey-driven monster trucks, and a rockstar from outer space. They travel to the South Pole, the Rock-n-Roll Hall of Fame in Ohio, and to scenic Mackinac Island. Wherever danger lurks, wherever villains strike, expect Heroes A2Z to save the day! ALSO AVAILABLE Heroes A2Z #1: Alien Ice Cream Heroes A2Z #2: Bowling Over Halloween Heroes A2Z #3: Cherry Bomb Squad Heroes A2Z #4: Digging For Dinos Heroes A2Z #5: Easter Egg Haunt Heroes A2Z #6: Fowl Mouthwash Heroes A2Z #7: Guitar Rocket Star Heroes A2Z #8: Holiday Holdup Heroes A2Z #9: Ivy League All-Stars Heroes A2Z #10: Joey Down Under Heroes A2Z #11: Kung Fu Kitties Heroes A2Z #12: Lost Puppy Love Heroes A2Z #13: Monkey Monster Truck Heroes A2Z #14: Nursery Rhyme Crime",
  "genres": [
    "Childrens",
    "Fiction",
    "Fantasy"
  ],
  "author": "David Anthony",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/776377.Hereos_A2Z_1"
}