{
  "title": "Minus One: A Twelve-Step Journey",
  "description": "\"Getting lost in my own head is like talking to an asshole in a bad neighborhood.\" —overheard at an AA meeting Terry has always been the tough one. The butch. The brawler. A legend behind a pool cue at the local dyke bar. A star in her soccer and rugby leagues, and deceptively strong for her puny size. Now she's up against something bigger, stronger, seemingly the lure of alcohol. It's already enabled her to wreck her life. She's lost more than one job and more than one friend. After throwing punches at the cop who arrested her—DWI, of course—a driver's license is just a dim memory. Worst of all, in her alcoholic rage she's become a woman who beats her lover. From the I emerged from a blackout, face bruised, lip bloody, and found I had dragged the more portable of my possessions to my porch. I knew someone must be coming for me, but who? I do remember a full quart of gin, and then another half-pint of whisky. I remember throwing up and crying. I don't remember calling Angela, but when she drove up I wasn't surprised. The events that led to my departure remain too clear, more real than the alcoholic haze that broken promises, cocaine and gin, wounds inflicted. Twenty-six isn't old, but I feel used up. A unique combination of compelling narrative, educational fiction, and lesbian erotica, Minus A Twelve-Step Journey is the captivating story of Terry Manescu-a young lesbian-and her first year in Alcoholics Anonymous. Driven to AA by her abusive behavior, Terry initially resents the program and its members. At meetings she is argumentative and foul-mouthed and often shows up wearing gay pride T-shirts. After a relapse and another episode of violence, she finally gets serious about recovery. With the help of a lesbian AA group, Terry begins to work the Twelve Steps and to address her sexual addiction. Will she be able to heal her relationships with family, lovers, and friends, and recover her self-esteem? Through this remarkable novel, you'll gain a valuable understanding of the twelve-step process, the meaning and difficulty of \"working\" each step, and the rewards to be gained by completing them. It's no easy road, but getting your life back is no small prize.",
  "genres": [
    "Nonfiction",
    "Lesbian"
  ],
  "author": "Bridget Bufford",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/776363.Minus_One"
}