{
  "title": "Personal Demon",
  "description": "In her acclaimed Women of the Otherworld series, Kelley Armstrong has created a scintillating realm where the supernatural and the human coexist on the edge of darkness, romance, and eternity. Now Armstrong tells the captivating tale of a young woman with an insatiable lust for danger. She can’t help it. It’s in her blood.    Tabloid reporter Hope Adams appears to live the life of an ordinary working girl. But in addition to possessing the beauty of a Bollywood princess, Hope has other unique traits. For she is a half demon—a human fathered by a demon. And she’s inherited not only a gift for seeing the past but a hunger for chaos—along with a talent for finding it wherever she can. Naturally, when she’s chosen by a very dangerous group for a very dangerous mission, she jumps at the chance….The head of the powerful Cortez Cabal—a family that makes the mob look like amateurs—has a little problem in a gang of wealthy, bored offspring of supernaturals is getting out of hand, and Hope is needed to infiltrate. As spells, astral projections, and pheromones soar across South Beach, Hope weaves her way through its elite hot spots, posing as upscale eye candy and reading the auras of the clientele—and potential marks. As it turns out, Hope is a little too good at this job. And soon she’s in a little too deep, needing to be bailed out by her jewel-thief werewolf ex-boyfriend and by the Cortez heir himself. And when a killer goes to work, Hope is among many targets at the pinnacle of Cabal rule. For a woman who didn’t know what she was getting into, there’s only one way it’s time for Hope to unleash her most potent primal instincts—and open herself, mind and body, to everything she most fears . . . and desires.Sexy and suspenseful, Personal Demon is a thrill ride through a world on the wild side of our own.From the Hardcover edition.",
  "genres": [
    "Urban Fantasy",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Paranormal Romance",
    "Supernatural",
    "Fiction"
  ],
  "author": "Kelley Armstrong",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/7769199-personal-demon"
}