{
  "title": "Dreyfus: Politics, Emotion, and the Scandal of the Century",
  "description": "The definitive history of the infamous scandal that shook a nation and stunned the world In 1894, Alfred Dreyfus, a Jewish officer in the French army, was wrongfully convicted of being a spy for Germany and imprisoned on Devil's Island. Over the following years, attempts to correct this injustice tore France apart, inflicting wounds on the society which have never fully healed. But how did a fairly obscure miscarriage of justice come to break up families in bitterness, set off anti-Semitic riots across the French empire, and nearly trigger a coup d'état? How did a violently reactionary, obscurantist attitude become so powerful in a country that saw itself as the home of enlightenment? Why did the battle over a junior army officer occupy the foremost writers and philosophers of the age, from Émile Zola to Marcel Proust, Émile Durkheim, and many others? What drove the anti-Dreyfusards to persist in their efforts even after it became clear that much of the prosecution's evidence was faked? Drawing upon thousands of previously unread and unconsidered sources, prizewinning historian Ruth Harris goes beyond the conventional narrative of truth loving democrats uniting against proto-fascists. Instead, she offers the first in-depth history of both sides in the Affair, showing how complex interlocking influences—tensions within the military, the clashing demands of justice and nationalism, and a tangled web of friendships and family connections—shaped both the coalition working to free Dreyfus and the formidable alliances seeking to protect the reputation of the army that had convicted him. Sweeping and engaging, Dreyfus offers a new understanding of one of the most contested and significant moments in modern history.",
  "genres": [
    "History",
    "France",
    "Nonfiction",
    "European History",
    "Biography",
    "19th Century",
    "Politics"
  ],
  "author": "Ruth Harris",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/7767743-dreyfus"
}