{
  "title": "Human Development as Described in the Qur'an and Sunnah: Correlation with Modern Embryology",
  "description": "The understanding that the human embryo develops in stages is a fairly recent discovery in modern science. Since the end of the 19th century, researchers have attempted to devise reasonably accurate terminology for classifying these stages. Until recently, it was not known to many Western scientists that the Qur'an and Sunnah, which are the sources of Islamic belief, provide detailed descriptions of significant events in human embryological development, and this terminology is characterized by descriptiveness, accuracy, ease of comprehension, and integration between description and appearance and main internal processes.This publication is a compilation of conference proceedings presented by renowned scientists and scholars in embryology, anatomy, and Islamic studies who investigated and compared the direct linguistic meanings of the Islamic terminology with the latest scientific findings. They concluded that the appearance of these terms 1400 years ago is astonishing, since it was impossible for this knowledge to have been attained through any human means, given the limitations of human scientific advancement and technology at the time. Furthermore, these terms, as explained in this book, can serve as valuable additions to the field of embryology.The relationship between science and religion in the West has often been characterized by antagonism, opposition, and hostility. In contrast, this relationship in Islamic society has been one of cooperation, harmony, and mutual benefit. The information presented in this book illustrates the clear support and encouragement provided through Islamic teachings for objective scientific research and is solid evidence for this type of harmonious relationship.",
  "genres": [],
  "author": "Abdul-Majeed Zindani",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/7763364-human-development-as-described-in-the-qur-an-and-sunnah"
}