{
  "title": "If Only",
  "description": "In May 1998 a twenty-five-year-old woman walked out of her job, and it made world news. Geri Halliwell had left the biggest pop phenomenon of the nineties, the Spice Girls.Geri had come a long way from her modest childhood in Watford. Like many other starstruck young girls, she would dress up, stand on the table with a hairbrush in her hand, and sing along to Madonna. She wanted to be a pop star. She wanted to marry George Michael. She wanted to be famous. Geri had boundless energy, plenty of cheek, and she always stood apart from the crowd. However, the road to fame is all too often a rocky one. After leaving school she also left home, and attempted to scrape a living through a series of dead-end jobs. Following stints as a glamour model, various auditions for stage and screen roles, and a taste of celebrity -- as a game-show hostess in Turkey -- Geri responded to a curious advertisement placed in The Stage, looking for candidates to form an all-girl band. The rest is history.As Ginger Spice, Geri's stage presence was formidable, her outfits legendary. The band enjoyed a succession of number-one hits, two phenomenally successful albums, and a box office hit movie. But Geri wanted her feet back on the ground. It was time to go, to find out who she was when she wasn't Ginger Spice.Geri is now focusing on building a successful solo career. Over the last year she has also been working on behalf of the U.N., Breast Cancer Awareness, and Comic Relief.Geri's autobiography is funny, frank, poignant, incisive, and, in the best sense of the word, inspirational. At its heart, If Only is about fame and the roller-coaster journey one girl took from believing it would provide the answer to life's problems to her discovery that the real solutions lie elsewhere.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Music",
    "Biography Memoir",
    "Adult"
  ],
  "author": "Geri Halliwell",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/776833.If_Only"
}