{
  "title": "The Doonesbury Chronicles",
  "description": "In 1975, for the first time in the history of journalism awards, the Pulitzer Prize for Editorial Cartooning went to a comic strip: Garry Trudeau's nationally syndicated Doonesbury.\"It is not only the best comic strip, but the best satire that's come along in a long time.\"—Art BuchwaldCarried today by over 350 North American newspapers, Doonesbury's unique blend of social-political satire, cartoon humor, and comic-strip continuity has won a following both improbably diverse and fanatically devoted. In Washington, where Doonesbury is required reading, requests for original strips have come from White House aides, senators, congressmen, and—remarkably—most of the major Watergate conspirators whose maladventures gave the strip grist for some of its most celebrated moments.\"There are only three major vehicles to keep us informed as to what is going on in Washington: the electronic media, the print media, and Doonesbury, not necessarily in that order.\"—President Gerald FordSo loyal has been this following that on occasions when Doonesbury was suddenly notable for its absence from a paper following a satirical thrust that had somehow offended editors' notions of comic-strip propriety, readers have always managed to protest it back onto the page.The Doonesbury Chronicles marks the first hardcover appearance of Michael J. Doonesbury and cohorts, and is their first collection to include Sunday color pages. In all, 572 strips are presented, as selected by Garry Trudeau and encompassing the full Doonesbury canon, from its cozy campus origins at the frazzled end of the sixties through the stumbling first half of the seventies. Conducting us along the way is a motley though always redeemable cast that includes a student radical turned disc jockey, an immaculately dense but nonetheless charismatic quarterback, a nature freak who has nightmares about Mark Spitz, and a runaway housewife who ends up as a Berkeley law student by way of the Walden Commune Day-Care Center. For those hooked on Trudeau, as well as those still somehow deprived, for giving or hoarding, The Doonesbury Chronicles is a rich and Recession-proof treasure of a book.",
  "genres": [
    "Humor",
    "Comics",
    "Cartoon",
    "Fiction",
    "Comic Strips",
    "Politics",
    "Graphic Novels"
  ],
  "author": "G.B. Trudeau",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/77690.The_Doonesbury_Chronicles"
}