{
  "title": "My Other Life",
  "description": "Life, to the hero of My Other Life, has no apparent plot, so it can seem messier than fiction—sometimes it appears that he is leading many separate lives. The only connecting strand is that they all involve the same person.The fictional narrator of these memoirs, a man of different guises, be it Pavel Medved, Paulie, or Paul Theroux, has reconstructed his past, giving it wit and life, tragedy and pathos, and imposed an order on it through careful editing. Inordinately fond of train travel, he takes us on a journey over a career spanning thirty years and distills it into poignant episodes. From his early education by his eccentric Uncle Hal, an unlikely author and lover of dog biscuits, we are taken through Theroux’s years as a fledgling novelist in literary London, under the wing of the rapacious Lady Max, to his grief at finding himself alone again, at age fifty, in the town of his youth.With enormous insight and self-knowledge Theroux divulges his belief in secrets: the fake occupations he has given himself—particle physicist, cartographer, teacher; the false names with which he has misled people; the absurd events of his life, including a run-in with a deluded fan who has recommended to him the writings of the more famous Paul Theroux; and his uncanny meeting with an elderly German writer whose life has almost exactly mirrored his own.Complex, candid, and confessional, the distinctive qualities of My Other Life will be instantly recognizable to admirers of Theroux’s My Secret History. In this extraordinarily stylish and clever novel, the real Paul Theroux has created a protagonist of depth and great subtlety whose fall from grace sets him adrift—until he recognizes again the redeeming power of his art.",
  "genres": [
    "Fiction",
    "Travel",
    "Africa",
    "Contemporary",
    "American",
    "Literary Fiction",
    "Novels"
  ],
  "author": "Paul Theroux",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/776451.My_Other_Life"
}