{
  "title": "Self Comes to Mind: Constructing the Conscious Brain",
  "description": "From one of the most significant neuroscientists at work today, a pathbreaking investigation of a question that has confounded philosophers, psychologists, and neuroscientists for centuries: how is consciousness created?  Antonio Damasio has spent the past thirty years studying and writing about how the brain operates, and his work has garnered acclaim for its singular melding of the scientific and the humanistic. In Self Comes to Mind, he goes against the long-standing idea that consciousness is somehow separate from the body, presenting compelling new scientific evidence that consciousness—what we think of as a mind with a self—is to begin with a biological process created by a living organism. Besides the three traditional perspectives used to study the mind (the introspective, the behavioral, and the neurological), Damasio introduces an evolutionary perspective that entails a radical change in the way the history of conscious minds is viewed and told. He also advances a radical hypothesis regarding the origins and varieties of feelings, which is central to his framework for the biological construction of consciousness: feelings are grounded in a near fusion of body and brain networks, and first emerge from the historically old and humble brain stem rather than from the modern cerebral cortex.  Damasio suggests that the brain’s development of a human self becomes a challenge to nature’s indifference and opens the way for the appearance of culture, a radical break in the course of evolution and the source of a new level of life regulation—sociocultural homeostasis. He leaves no doubt that the blueprint for the work-in-progress he calls sociocultural homeostasis is the genetically well-established basic homeostasis, the curator of value that has been present in simple life-forms for billions of years. Self Comes to Mind is a groundbreaking journey into the neurobiological foundations of mind and self.",
  "genres": [
    "Psychology",
    "Science",
    "Neuroscience",
    "Nonfiction",
    "Philosophy",
    "Brain",
    "Biology"
  ],
  "author": "António Damásio",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/7766914-self-comes-to-mind"
}