{
  "title": "Finishing the Hat: Collected Lyrics, 1954-1981, With Attendant Comments, Principles, Heresies, Grudges, Whines, and Anecdotes",
  "description": "ONE OF THE NEW YORK TIMES 10 BEST BOOKS OF THE YEAR • Titled after perhaps Stephen Sondheim's most autobiographical song, from Sunday in the Park with George — Finishing the Hat not only collects his lyrics for the first time, it offers readers a rare personal look into his life as well as his remarkable productions. Stephen Sondheim’s career spanned more than half a century; his lyrics are synonymous with musical theater and popular culture. Sondheim—the winner of seven Tonys, an Academy Award, seven Grammys, a Pulitzer Prize and more—treats us to never-before-published songs from each show, songs that were cut or discarded before seeing the light of day, along with the lyrics for all of his musicals from 1954 to 1981, including West Side Story, Company, Follies, A Little Night Music and Sweeney Todd .He discusses his relationship with his mentor, Oscar Hammerstein II, and his collaborations with extraordinary talents such as Leonard Bernstein, Arthur Laurents, Ethel Merman, Richard Rodgers, Angela Lansbury, Harold Prince and a panoply of others. The anecdotes—filled with history, pointed observations and intimate details—transport us back to a time when theater was a major pillar of American culture. Best of all, Sondheim appraises his work and dissects his lyrics, as well as those of others, offering unparalleled insights into songwriting that will be studied by fans and aspiring songwriters for years to come.Accompanying Sondheim’s sparkling writing are behind-the-scenes photographs from each production, along with handwritten music and lyrics from the songwriter’s personal collection.Penetrating and surprising, poignant, funny and sometimes provocative, Finishing the Hat is not only an informative look at the art and craft of lyric writing, it is a history of the theater that belongs on the same literary shelf as Moss Hart’s Act One and Arthur Miller’s Timebends . It is also a book that will leave you humming the final bars of Merrily We Roll Along, while eagerly anticipating the next volume.",
  "genres": [
    "Nonfiction",
    "Theatre",
    "Music",
    "Memoir",
    "Biography",
    "Poetry",
    "Plays"
  ],
  "author": "Stephen Sondheim",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/7769406-finishing-the-hat"
}