{
  "title": "Dark Voyage",
  "description": "Set in May 1941 Dark Voyage is taut with suspense and pounding with battle scenes; it is authentic, powerful, and brilliant.\"In the first nineteen months of European war, from September 1939 to March of 1941, the island nation of Britain and her allies lost, to U-boat, air, and sea attack, to mines and maritime disaster, one thousand five hundred and ninety-six merchant vessels. It was the job of the Intelligence Division of the Royal Navy to stop it, and so, on the last day of April 1941 . . .\" May 1941. At four in the morning, a rust-streaked tramp freighter steams up the Tagus River to dock at the port of Lisbon. She is the Santa Rosa, she flies the flag of neutral Spain and is in Lisbon to load cork oak, tinned sardines, and drums of cooking oil bound for the Baltic port of Malmö.But she is not the Santa Rosa. She is the Noordendam, a Dutch freighter. Under the command of Captain Eric DeHaan, she sails for the Intelligence Division of the British Royal Navy, and she will load detection equipment for a clandestine operation on the Swedish coast–a secret mission, a dark voyage. A desperate voyage. One more battle in the spy wars that rage through the back alleys of the ports, from elegant hotels to abandoned piers, in lonely desert outposts, and in the souks and cafés of North Africa. A battle for survival, as the merchant ships die at sea and Britain–the last opposition to Nazi German–slowly begins to starve.A voyage of flight, a voyage of fugitives–for every soul aboard the Noordendam. The Polish engineer, the Greek stowaway, the Jewish medical officer, the British spy, the Spaniards who fought Franco, the Germans who fought Hitler, the Dutch crew itself. There is no place for them in occupied France; they cannot go home.From Alan Furst–whom The New York Times calls America's preeminent spy novelist–here is an epic tale of war and espionage, of spies and fugitives, of love in secret hotel rooms, of courage in the face of impossible odds. Dark Voyage is taut with suspense and pounding with battle scenes; it is authentic, powerful, and brilliant.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Espionage",
    "World War II",
    "Thriller",
    "War",
    "Mystery"
  ],
  "author": "Alan Furst",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/776710.Dark_Voyage"
}