{
  "title": "The House in France: A Memoir",
  "description": "Set in Provence, London, and New York, this is a daughter’s brilliant and witty memoir of her mother and stepfather—Dee Wells, the glamorous and rebellious American journalist, and A. J. Ayer, the celebrated and worldly Oxford philosopher—and the life they lived at the center of absolutely everything.Gully Wells takes us into the heart of London’s lively, liberated intellectual inner circle of the 1960s. Here are Alan Bennett, Isaiah Berlin, Iris Murdoch, Bertrand Russell, Jonathan Miller, Martin Amis, Christopher Hitchens, Robert Kennedy, and Claus von Bülow, and later in New York a completely different Mayor John Lindsay, Mike Tyson, and lingerie king Fernando Sánchez. We meet Wells’s adventurous mother, a television commentator earning a reputation for her outspoken style and progressive views, and her stepfather, an icon in the world of twentieth-century philosophy, proving himself as prodigious a womanizer as he is a thinker. Woven throughout is La Migoua, the old farmhouse in France, where evenings were spent cooking bouillabaisse with fish bought that morning in the market in Bandol, and afternoons included visits to M. F. K. Fisher’s favorite café on the Cours Mirabeau in Aix, with a late-night stop at the bullfighters’ bar in Arles. The house perched on a hill between Toulon and Marseille was where her parents and their friends came together every year, and where Gully herself learned some of the enduring lessons of a life well lived.The House in France is a spellbinding story with a luminous sense of place and a dazzling portrait of a woman who “caught the spirit of the sixties” and one of the most important intellectual figures of the twentieth century, drawn from the vivid memory of the child who adored them both.",
  "genres": [
    "France",
    "Memoir",
    "Nonfiction",
    "Travel",
    "Biography",
    "Biography Memoir",
    "British Literature"
  ],
  "author": "Gully Wells",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/10333973-the-house-in-france"
}