{
  "title": "The Longest War: A History of the War on Terror and the Battles with Al Qaeda Since 9/11",
  "description": "TEN YEARS HAVE PASSED since the shocking attacks on the World Trade Center, and after seven years of conflict, the last U.S. combat troops left Iraq—only to move into Afghanistan, where the ten-year-old fight the war on terror rages with no clear end in sight. In The Longest War Peter Bergen offers a comprehensive history of this war and its evolution, from the strategies devised in the wake of the 9/11 attacks to the fighting in Afghanistan, Pakistan, and beyond. Unlike any other book on this subject, here Bergen tells the story of this shifting war’s failures and successes from the perspectives of both the United States and al-Qaeda and its allies. He goes into the homes of al-Qaeda members, rooting into the source of their devotion to terrorist causes, and spends time in the offices of the major players shaping the U.S. strategic efforts in the region. At a time when many are frustrated or fatigued with what has become an enduring multigenerational conflict, this book will provide an illuminating narrative that not only traces the arc of the fight but projects its likely future.Weaving together internal documents from al-Qaeda and the U.S. offices of counterterrorism, first-person interviews with top-level jihadists and senior Washington officials, along with his own experiences on the ground in the Middle East, Bergen balances the accounts of each side, revealing how al-Qaeda has evolved since 9/11 and the specific ways the U.S. government has responded in the ongoing fight.Bergen also uncovers the strategic errors committed on both sides—the way that al-Qaeda’s bold attack on the United States on 9/11 actually undermined its objective and caused the collapse of the Taliban and the destruction of the organization’s safe haven in Afghanistan, and how al-Qaeda is actually losing the war of ideas in the Muslim world. The book also shows how the United States undermined its moral position in this war with its actions at Guantánamo and coercive interrogations—including the extraordinary rendition of Abu Omar, who was kidnapped by the CIA in Milan in 2003 and was tortured for four years in Egyptian prisons; his case represents the first and only time that CIA officials have been charged and convicted of the crime of kidnapping.In examining other strategic blunders the United States has committed, Bergen offers a scathing critique of the Clinton and Bush administrations’ inability to accurately assess and counter the al-Qaeda threat, Bush’s deeply misguided reasons for invading Iraq—including the story of how the invasion was launched based, in part, on the views of an obscure academic who put forth theories about Iraq’s involvement with al-Qaeda—and the Obama administration’s efforts in Afghanistan.At a critical moment in world history The Longest War provides the definitive account of the ongoing battle against terror.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Military Fiction",
    "Politics",
    "Terrorism",
    "American History"
  ],
  "author": "Peter L. Bergen",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/7775615-the-longest-war"
}