{
  "title": "Stealing the Elf-King's Roses: The Author's Cut",
  "description": "It's CSI, Jim, but not as you know it...!Psychoforensics specialist and freelance prosecutor Lee Enfield works with the Los Angeles District Attorney’s office as a lanthanomancer -- a magic-worker trained in Seeing and revealing the truth. When she and her fayhound partner Gelert are brought in to do “discovery” for the investigation into the murder of an Elf named Omren dil’Sorden, at first it seems an ordinary homicide—just one more hate crime in a city and culture where violence against the immensely wealthy, uncannily beautiful Alfen is becoming more and more commonplace. But Lee and Gelert discover that there's more to this Elf's murder than meets the eye. When mysterious political pressure from above the DA's office pushes the two partners out of the investigation, Lee's unwillingness to drop the case brings her and Gelert to the attention of the Elves, and gets the partners drafted into a mission to the heart of the forbidden realm of Alfheim. But Lee and Gelert shortly find that they've now become targets of a shadowy conspiracy involving powerful multinationals and even governments of the Seven Worlds, all intent on taking the secret of the Elves' power for themselves. The two lanthanomancers' investigative instincts and forensic Sight soon reveal the devastating response the Alfen are planning against the upstart, mortal \"young races\". But as Lee and Gelert attempt to escape across continua in a desperate race to prevent the outbreak of a war like none ever seen before, Lee is drawn into an ambivalent and potentially deadly alliance with the shadowy and much-feared Elf-King -- absolute master of Alfheim, and guardian of its most terrible secret. With the fates of entire worlds on the line, does she dare trust her Sight to reveal his true motives -- and can the Elf-King be trusted to be on anyone's side but his own?...This stand-alone fantasy police/legal-procedural novel, originally published in 2002, is being exclusively reissued by the author in a new edition -- revised and updated, with an afterword about the project's genesis and an appendix featuring never-before-published background material on the Eleven Worlds.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Mystery",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Fae"
  ],
  "author": "Diane Duane",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13075020-stealing-the-elf-king-s-roses"
}