{
  "title": "An Uncommon Friendship: From Opposite Sides of the Holocaust",
  "description": "Two men, who meet and become good friends after enjoying successful adult lives in California, have experienced childhoods so tragically opposed that the two men must decide whether to talk about them or not. In 1944, 13-year-old Fritz was almost old enough to join the Hitler Youth in his German village of Kleinheubach. That same year in Tab, Hungary, 12-year-old Bernie was loaded onto a train with the rest of the village's Jewish inhabitants and taken to Auschwitz, where his whole family was murdered. How to bridge the deadly gulf that separated them in their youth, how not to allow the power of the past to separate them even now, as it separates many others, become the focus of their friendship, and together they begin the project of remembering.The separate stories of their youth are told in one voice, at Bernat Rosner's request. He is able to retrace his journey into hell, slowly, over many sessions, describing for his friend the \"other life\" he has resolutely put away until now. Frederic Tubach, who must confront his own years in Nazi Germany as the story unfolds, becomes the narrator of their double memoir. Their decision to open their friendship to the past brings a poignancy to stories that are horrifyingly familiar. Adding a further and fascinating dimension is the counterpoint of their similar village childhoods before the Holocaust and their very different paths to personal rebirth and creative adulthood in America after the war.Seldom has a memoir been so much about the present, as we see the authors proving what goodwill and intelligence can accomplish in the cause of reconciliation. This intimate story of two boys trapped in evil and destructive times, who become men with the freedom to construct their own future, has much to tell us about building bridges in our public as well as our personal lives.",
  "genres": [
    "Holocaust",
    "World War II",
    "Nonfiction",
    "History",
    "Biography",
    "Memoir",
    "Book Club"
  ],
  "author": "Bernat Rosner",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/7772236-an-uncommon-friendship"
}