{
  "title": "I Heard a Fly Buzz When I Died",
  "description": "When a literary icon stays with the Dickinson family, Emily and her housemaid Willa find themselves embroiled in a shocking murder in this new mystery from USA Today bestselling and Agatha Award-winning author Amanda Flower.August 1856. The Dickinson family is comfortably settled in their homestead on Main Street. Emily's brother, Austin Dickinson, and his new wife are delighted when famous thinker and writer Ralph Waldo Emerson comes to Amherst to speak at a local literary society and decides he and his young secretary, Luther Howard, will stay with the newlyweds. Emily has been a longtime admirer of Emerson's writing and is thrilled at the chance to meet her idol. She is determined to impress him with her quick wit, and if she can gather the courage, a poem. Willa Noble, the second maid in the Dickinson home and Emily's friend, encourages her to speak to the famous but stern man. But his secretary, Luther, intrigues Willa more because of his clear fondness for the Dickinson sisters.Willa does not know if Luther truly cares for one of the Dickinson girls or if he just sees marrying one of them as a way to raise himself up in society. After a few days in his company, Willa starts to believe it's the latter. Miss Lavinia, Emily's sister, appears to be enchanted by Luther; a fact that bothers Emily greatly. However, Emily's fears are squashed when Luther turns up dead in the Dickinson's garden. It seems that he was poisoned. Emerson, aghast at the death of his secretary, demands answers. Emily and Willa set out to find them in order to save the Dickinson family reputation and stop a cold-blooded fiend from killing again.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Cozy Mystery",
    "Historical",
    "Historical Mystery",
    "Cozy"
  ],
  "author": "Amanda Flower",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/77717342-i-heard-a-fly-buzz-when-i-died"
}