{
  "title": "Free Trade Doesn't Work",
  "description": "\"Uniformly insightful, often brilliant, and remarkably readable. Obama's team should read it - and soon. -George C. Lodge, professor emeritus, Harvard Business School \" If people will listen, Fletcher's informed voice will help turn the country toward a more promising future. -William Greider, author of Come Home, The Rise and Fall (and Redeeming Promise) of Our Country. \" This book is an excellent introduction to these realities and what can be done about them. -Dan DiMicco, Chairman and CEO, Nucor Steel Corporation; author of Steeling America's a CEO's Call to Arms. \" This book will be an essential guide to the emerging debate over the wisdom of 'free trade' as a sound policy. -Patrick A. Mulloy, Commissioner, U.S.-China Economic and Security Review Commission; former Assistant Secretary of Commerce. \"Ian Fletcher has laid out a powerful critique of so-called 'free trade' theory. -John J. Sweeney, former President, AFL-CIO; author, America Needs a Raise. \"A very powerful, passionate, and convincing critique of free trade in an accessible and engaging manner. -Ha-Joon Chang, Cambridge University, author, Kicking away the Ladder. \"Up-to-date, comprehensive and very readable. -Jeff Faux, Distinguished Fellow, Economic Policy Institute; author, The Global Class War. \"A devastating and powerful indictment of free trade economics. -Gavin Fridell, author, Fair Trade Coffee. This book is aimed at ordinary concerned citizens. It examines why free trade is slowly bleeding America's economy to death and what can be done. It explains why the economics free traders use is false, and what kind of economics justifies protectionism instead. It is critical of the current establishment, but from a bipartisan point of view, so it should satisfy progressives, conservatives, and everyone in between. See www.freetradedoesntwork.com for more information.",
  "genres": [
    "Economics",
    "Politics",
    "Nonfiction",
    "Business",
    "History",
    "American"
  ],
  "author": "Ian  Fletcher",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/7774148-free-trade-doesn-t-work"
}