{
  "title": "Hard-Luck Diggings: The Early Jack Vance",
  "description": "The first of three volumes. A legend has to start somewhere... As so many writers have said, it's in the shorter and mid-length work that the storytelling craft is best learned. Hard-Luck Diggings brings together fourteen such pieces from the first twelve years of Grand Master Jack Vance's genre-defining career, from back when he first worked to pay the mortgage, buy the groceries, travel the world, eventually building his own private 'dream castle' and starting a family.Like any writer serious about staying in the game, we see him targeting the markets of the day, doing what was needed to meet the tastes of editors and their readerships while at the same time perfecting his own special way of doing things so that his name, his distinctive voice, stood a chance (in modern marketing parlance) of becoming a viable 'brand.'Hard-Luck Diggings brings that fascinating process to life in fine style. As well as serving up vintage entertainment from one of the field's genuine masters, it provides an illuminating armchair tour of how the Jack Vance enterprise came to be, full of zest and life, the thrill of the upward climb and of so much more to be done. This is a book to be savoured with a twinkle in the eye, a knowing smile, but most of all, with a love of adventure and high romance firmly in place.Contents:Introduction-essay by Jonathan Strahan and Terry Dowling;-afterword-essay following each story, by Jack Vance; Hard-Luck Diggings [Magnus Ridolph] (1948); -- The Temple of Han (1951); -- The Masquerade on Dicantropus (1951); -- Abercrombie Station (1952); -- Three-Legged Joe (1953); -- DP! (1953); -- Shape-Up (1953); -- Sjambak (1953); -- The Absent-Minded Professor (1954); -- When the Five Moons Rise (1954); -- The Devil on Salvation Bluff (1955); -- Where Hesperus Falls (1956); -- The Phantom Milkman (1956); -- Dodkin’s Job (1959).Cover illustration by Tom Kidd.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Short Story Collection"
  ],
  "author": "Jack Vance",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/7770593-hard-luck-diggings"
}