{
  "title": "Lipstick in Afghanistan",
  "description": "Roberta Gately’s lyrical and authentic debut novel—inspired by her own experiences as a nurse in third world war zones—is one woman’s moving story of offering help and finding hope in the last place she expected.Gripped by haunting magazine images of starving refugees, Elsa has dreamed of becoming a nurse since she was a teenager. Of leaving her humble working-class Boston neighborhood to help people whose lives are far more difficult than her own. No one in her family has ever escaped poverty, but Elsa has a secret a tube of lipstick she found in her older sister’s bureau. Wearing it never fails to raise her spirits and cement her determination. With lipstick on, she can do anything—even travel alone to war-torn Afghanistan in the wake of 9/11.But violent nights as an ER nurse in South Boston could not prepare Elsa for the devastation she witnesses at the small medical clinic she runs in Bamiyan. As she struggles to prove herself to the Afghan doctors and local villagers, she begins a forbidden romance with her only confidant, a charming Special Forces soldier. Then, a tube of lipstick she finds in the aftermath of a tragic bus bombing leads her to another life-changing friendship. In her neighbor Parween, Elsa finds a kindred spirit, fiery and generous. Together, the two women risk their lives to save friends and family from the worst excesses of the Taliban. But when the war waging around them threatens their own survival, Elsa discovers her only hope is to unveil the warrior within. Roberta Gately’s raw, intimate novel is an unforgettable tribute to the power of friendship and a poignant reminder of the tragic cost of war.",
  "genres": [
    "Fiction",
    "Book Club",
    "Chick Lit",
    "Historical Fiction",
    "Cultural",
    "Adult Fiction",
    "Contemporary"
  ],
  "author": "Roberta Gately",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/7775815-lipstick-in-afghanistan"
}