{
  "title": "Atomic Iran: Countdown to Armageddon...How the West Can Be Saved",
  "description": "During Dr. Mike Evans research for this book in Israel in late 2009, he was told by a high-level Israeli government official that should Iran achieve its nuclear ambitions, it would then have a nuclear umbrella which would allow it to accelerate terrorism throughout the Sunni Gulf oil states in an attempt to fulfill its vision of a world caliphate. An ensuing multi-trillion dollar nuclear arms race between the Sunni and Shia states in the region would drive the price of oil to never-before-seen levels for decades to come. The estimate given him was that oil prices could go as high as $200 per barrel. This would further decimate the world economy. With the ascension of Mahmoud Ahmadinejad to the position of power in Iran, much has been said about the Mahdi. Al-Mahdi was the Twelfth Imam in the line of Ali, who disappeared down a well at the age of five. Refusing to believe that he was dead, his followers imbued him with timelessness. They declared him to be merely hidden, or in a state of occultation, and declared that on some future date he would suddenly reappear to reestablish an Islamic caliphate worldwide. The Twelver's eschatology, however, proved problematic; it espoused an apocalyptic upheaval in order for the Mahdi, or Hidden Imam, to ascend to his rightful place of leadership. These Twelvers championed the tenet that every individual, regardless of his religious belief, would one day bow to Islam or die. In Ahmadinejad's mind, an atomic bomb in Tel Aviv would usher in the Mahdi, and all the world's demise (Jews and Christians) would instantly be converted to Islam. Compared to Ahmadinejad and his Twlever band, al-Qaeda resembles Boy Scouts ushering little old ladies across busy streets. What does the world really think of Mahmoud Ahmadinejad and his Twelver beliefs? Are most people aware of his devotion to the Mahdi? Do most understand that he is an ardent Twelver, a dedicated disciple of the Twelfth Imam, who will do anything to insure that the world is made ready for the second coming of a false messiah even if it requires manufacturing his own apocalyptic event to insure a rush to Armageddon? When Dr. Evans met Mahmoud Ahmadinejad's spiritual advisor in New York City for a UN meeting in 2007, he declared that his leader would usher in the Mahdi the twelfth descendant of Mohammad through such an apocalyptic event within three years. President Obama seems incapable of fully accepting his culpability should he pursue talks with Iran's bloody regime. He was given a legitimate chance to support change for the good of the Iranian populace following the June, 2009 Iranian election. He had an opportunity to respond vigorously, yet he failed to do so in a timely manner. America's forty-fourth president has all but acquiesced to Iran's nuclear course. Even during the election process Mr. Obama signified that he was agreeable to a meeting with the I would [talk to Iran's leaders without preconditions]. And the reason is this, that the notion that somehow not talking to countries is punishment to them -- which has been the guiding diplomatic principle of this [Bush] administration -- is ridiculous. The Iranians saw this as weakness on the part of the American presidential candidate. Since taking office, Mr. Obama has done nothing to counter that opinion. Ahmadinejad has declared the issue closed, not worthy of talks with the leader of The Great Satan. He has rebuffed the advances of a man who apparently wants to dance with Iran. Ahmadinejad feels he is in the driver's seat, and unless a backbone transplant is in the offing, Mr. Obama will likely acquiesce to whatever terms Ahmadinejad demands prior to any face-to-face talks with the American president. The countdown to Armageddon has begun.",
  "genres": [],
  "author": "Mike    Evans",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/7777442-atomic-iran"
}