{
  "title": "A Place of Yes: 10 Rules for Getting Everything You Want Out of Life",
  "description": "The New York Times bestselling author of Naturally Thin and The Skinnygirl Dish, Bethenny Frankel takes us on an empowering journey to A PLACE OF YES BETHENNY FRANKEL’S no-nonsense, tell-it-like-it-is personality won over countless fans, and made her a nationally bestselling author and the star of her own hit Bravo show Bethenny Getting Married? Now Bethenny opens up and shares the obstacles she overcame and the great success she has enjoyed while discovering how to approach life from “A Place of Yes.” Bethenny’s path was not always clear as she overcame a difficult childhood, failed relationships, entrepreneurial efforts that never quite got off the ground, and lifelong money struggles. To deal with these challenges, Bethenny developed ten rules for pursuing her goals with authenticity and drive, including:  FIND YOUR TRUTH: Dig deep inside and figure out what is authentic for you, not anybody else. ACT ON IT: You don’t have to have a master plan. But unless you do something, you’ve done nothing. EVERYTHING’S YOUR BUSINESS: Treat every job, person, and experience as if it could lead to your next big opportunity. OWN IT: If you do it, say it, think it—then own it. Stand up for yourself and fully acknowledge who you really are. Each rule is illustrated with compelling, sometimes funny, sometimes outrageous examples that are pure Bethenny. It’s easy to say no, to say “I can’t,” to expect the worst, and to doubt yourself. But your life can be better than “not bad” or “good enough.” It can be amazing. And by putting Bethenny’s rules together, you can use them to be more successful, more fulfilled, healthier, and happier than ever before.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Personal Development",
    "Autobiography"
  ],
  "author": "Bethenny Frankel",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/7775640-a-place-of-yes"
}