{
  "title": "The Chimney Sweep Charm",
  "description": "“There was the muffled sound of audience members standing up, and Baylee and Candice turned to look behind them. “Holy smokes!” Baylee breathed. “It’s like a Navy SEAL convention or something,” Candice added. And it was! Baylee couldn’t believe that over twenty-five of the people in the orientation audience were tall, dark, handsome, buff guys dressed all in black. Each man stood with his feet apart and hands held at his back—similar if not exactly like a military “at ease” stance. “They’re all packing heat too,” Baylee whispered to Candice as she noted all the holstered sidearms. “I guess Mr. O’Sullivan wants to be prepared,” Candice said. “I suppose you girls are all wowed now, right?” Tate said from the front row. Excerpt“Let’s see,” Candice began, looking to Tate and feigning an expression of thoughtfulness. “Let’s say I’m being assaulted by some weirdo in street…and who am I going to look to for protection? One of these guys?” she said, nodding toward the security staff. “Or you, Tate? You…who freaked out in June when we were in New York and you thought some guy was looking at you funny. You freaked out and slammed Megan’s finger in the door and cut it off! Who do you think I’m going to trust?” “It was an accident, and you know it,” Tate grumbled. Baylee did know it. Still, she found her eyes glancing down the row of chairs in front of her to Megan—to the missing first joint and fingertip on her right hand. “Yeah, it was,” Candice admitted. “But you still cared more about yourself than Megan. The guy was stalking Megan…not you. Real heroic, Tate. Way to go to instilling a sense of confidence in me that you would have my back.” “Whatever,” Tate grumbled, turning around in his seat to pout.”",
  "genres": [
    "Romance",
    "Clean Romance",
    "Christmas",
    "Contemporary",
    "Fiction",
    "Holiday",
    "Contemporary Romance"
  ],
  "author": "Marcia Lynn McClure",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13076369-the-chimney-sweep-charm"
}