{
  "title": "Biting Me Softly",
  "description": "\"I love, love, love Mary Hughes' writing style...each time Ms Hughes  delivers a new hero to her voracious fans they become hotter and sexier.\" Hayley, Fallen Angel Reviews.  Recommended Read.He's a candy box of sex appeal wrapped with a golden bow. She's on a diet.Biting Love Book 4Winner of the 2012 Write Touch Readers' Award for Paranormal/Fantasy/Futuristic/Time Travel!Blood, sex, violence. Blood, okay, but computer geek Liese Schmetterling had enough S&V when her cheating ex fired her. Now security expert--and lip-smacking gorgeous--Logan Steel saunters into her Blood Center, setting fire to her libido. And threatening her job.Visions of pink slips dancing in her head, Liese tries to push Logan away without touching his jutting pecs...or ridged abs. Or petting the Vesuvius in his jeans. He's hiding something, but it doesn't seem to matter when his smiles stun her, his kisses crank her to broiling and his bites rocket her to heaven. Fangy bites which, if she weren't grounded in science, would make her think ampire-Vay.Centuries old and tragedy-scarred, Logan's mission is to fortify the Blood Center's electronic defenses against his nemesis, the leader of a rogue vampire gang. He's ready for battle but not for Liese, who slips under his skin, laughs at his awful puns, charges beside him into dark, scary places--and tastes like his true love.No matter how often Logan declares his love, Liese can't bring herself to trust him. But when his archenemy comes after her, not trusting him may cost her life... contains explicit vampire sex involving absurdly large male equipment (hey, they're monsters), unbelievable stamina (just how long can he stay underwater in a hot tub?), hide-your-eyes violence and horrendously bad puns. And, just when you think it can't get any worse, a computer geekette trying to play Mata Hari.",
  "genres": [
    "Vampires",
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Contemporary",
    "Humor",
    "Fantasy"
  ],
  "author": "Mary Hughes",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/7784426-biting-me-softly"
}