{
  "title": "Psycho Professor",
  "description": "From the journal of Prof. Vincent Valentine… 4:30 - Last class. 4:45 - Home 6:15 - TV time. 8:45 - Laundry night. 9:20 - Bath. 10:00 - Lights out…Tonight I got closer than ever.Mapping her own routine to adjust mine so I can always watch her has paid off big time.What a prize!Her fucking panties, no less… And a pair that she somehow missed putting in the machine to get washed.I’m drunk on her scent already, and hard as a ships bell. But I have to be careful. I need to keep them fresh.Need to make this last. Savor her… Worship her.Protect her like never before now I have her scent. Her very essence on my own lips.My face buried in a heavenly cloud of her sweet cunt. Priming me for the real thing which I know has to happen soon.See, Violet doesn’t know it yet. I guess it’s kind of a surprise.But we’re gonna be together.Forever.I always hate it when I have to go home without her. Loathe the times she attends other classes than mine.Despise the very existence of any man who looks at her.Always on edge every second she's not in my sights. So apart from putting my own mind at ease, it just makes sense to have her with me, always.She’s a student, sure. And there’ll be hell to pay once it comes out. But I still have some sway within the college administration.Kinda sick of the whole getting up to go to work routine when I really don't have to anyway. I’ve got more than enough money for the two of us and then some.But worse than anything, it’s the nagging and alien thought that hammers my brain, day and night.The voice of someone else, lecturing me, Professor Vincent Valentine on the virtues of conscience, accountability and reason.‘She’s a student… A girl half your age… maybe she’s not interested in you in that way…’Nonsense. All of it.Anyone with eyes could see she belongs to me.She’s mine dammit! And the only word I need to hear from her lips is ‘yes’.Yes she feels the same. Yes she wants my babies. Yes she’ll never look at any other man as long as she lives once I claim her as my own.And if the answer’s no?That’s what’s keeping me up at night.Knowing what’s inside me. Knowing what’s mine waiting to be claimed.Knowing if I don’t do what I have to-Well. There’d be consequences.That’s all I can say here .G’night, sweet angel… It won’t be long before we’re together for ever.And at the perfect time of year too, with Valentine's day just around the corner.Mrs. Violet Valentine… Kinda has a ring to it. But the only rings I’m thinking about is the one I wanna put on her finger and the shape I’m gonna leave her stretched to down there once I’ve done my work.Once I've claimed what’s mine, good and proper.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Lena Little",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/77879619-psycho-professor"
}