{
  "title": "For the King's Favor",
  "description": "THE NEW YORK TIMES AND USA TODAY BESTSELLING AUTHOR! \"The best writer of medieval fiction currently around.\"― Historical Novels Review A bittersweet tale of obsession, love, and tragic choices. In England's Middle Ages, the Plantagenet courts are a dangerous place to fall in love. Roger Bigod arrives at King Henry II's court to settle a bitter inheritance dispute, but he quickly becomes enchanted with Ida de Tosney, young mistress to the powerful king. A victim of Henry's seduction and the mother of his son, Ida sees in Roger a chance to begin a new life. But Ida pays an agonizing price when she leaves the king, and as Roger's standing grows in the court, their marriage comes under increasing strain. Among some of the most notorious names of the Plantagenet Era, including Eleanor of Aquitaine and William Marshal, Roger and Ida must make choices that grow more heartbreaking by the day. Based on the true story of a royal mistress and the young lord she chose to marry, For the King's Favor is the perfect historical fiction for readers of The Book of Eleanor by Pamela Kaufman and The Taming of the Queen by Philippa Gregory. More Novels of Elizabeth Chadwick's William The Greatest Knight The Scarlet Lion For the King's Favor Templar Silks To Defy a King Praise for Elizabeth \"An author who makes historical fiction come gloriously alive.\"― Times of London \"Everyone who has raved about Elizabeth Chadwick as an author of historical novels is right.\"― Devourer of Books Blog \"I rank Elizabeth Chadwick with such historical novelist stars as Dorothy Dunnett and Anya Seton.\"―Sharon Kay Penman, New York Times bestselling author of Devil's Brood",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Medieval",
    "Romance",
    "British Literature",
    "Historical Romance"
  ],
  "author": "Elizabeth Chadwick",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/7788213-for-the-king-s-favor"
}