{
  "title": "Treasure of Egypt: Treasure of the Ancients",
  "description": "***NEWLY RE-EDITED AND REVISED***Treasure of EgyptHold on to your seat!This is a fast paced, action-packed romantic adventure.Journey to the land of the Pharaohs in this lighthearted humorous tale, where the search for lost treasure digs up more than a little danger.In the year 1863, a time when the whole world was seeking Egypt’s secrets, an ancient map, leading to the greatest treasure known to man, resurfaces. As luck would have it, Lord Alecsian Brighton wins the mottled old scrap of parchment in one of London’s most notorious gaming hells, along with its ominous curse.Despite the allure of treasure, Alec has no real interest in gallivanting across the Egyptian countryside in order to find it. He isn’t even persuaded by his friend and cohort, Samuel’s enthusiastic zeal. It’s only his mother’s escalating interest in his marital status that gives an extended vacation sudden appeal.The mysteries unfold as tantalizing clues sweep us across two continents, from wild runaway carriage rides, to action packed chase scenes through the streets of Alexandria. When our lost lords are captured by Bedouin tribesmen, Samuel barters for their freedom. It seems like the perfect solution… marrying Alec off to the Plague of Egypt… and that is only the beginning!This book explores the wonders of Egypt, where the mysteries hidden within the pyramids and temples which have tantalized us for two thousand years are finally revealed. Discover the answer to one of the greatest mysteries of the ancient world, the origins of the Sphinx, as well as several hieroglyphic symbols which have remained either misidentified or unknown altogether… This book will not only amaze the world, but Egyptology will never be the same.But that’s not all… there is more!Look for more exciting adventures from Barbara Ivie Green that explore the wonders of the ancient world.Coming Soon!Treasure of the Emerald Isle Includes sneak peek!",
  "genres": [
    "Adventure",
    "Historical Fiction",
    "Mystery",
    "Romance",
    "Historical",
    "Egypt",
    "Humor"
  ],
  "author": "Barbara Ivie Green",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/13077240-treasure-of-egypt"
}