{
  "title": "THE STRIFE OF RILEY: Crime Thriller",
  "description": "The Strife of Riley is a thriller by De-ann Black.Riley is tasked by the Glasgow police force to investigate the killing of a man whose computer insists never existed. Unfortunately, Riley discovers his own name is on the killer’s hit list, once again providing him with his usual measure of strife.As a historian and cyber sleuth he’s also asked to help investigate the strange murder of a high ranking British politician. When the cases seem to be linked, this results in his past coming back to haunt him.Riley has a double-edged existence and a dark, adventure-filled past. He’s a former member of the SBS – the Special Boat Service, one of the most secretive units of the British Special Forces. Comparable to the SAS, the predominantly Royal Navy unit are experts on both land and sea.Through his special investigations, Riley is drawn into dramatic and dangerous situations that go beyond the confines of his cyber sleuth expertise. Riley’s world is inhabited by criminals, politicians, the police and British military – and those with a mind for mystery and deceit.Use the Look inside feature to read a sample of the book.Thriller books by De-ann Agency Agenda, The Strife of Riley, Electric Shadows, Love Him Forever, Shadows of Murder and Someone Worse.About the De-ann Black is a bestselling author, scriptwriter & former newspaper journalist. She has over 80 books published. Romance, thrillers, espionage novels, action adventure. And children’s books (non-fiction rocket science books & children's fiction).She previously worked as a full-time newspaper journalist for several years. She had her own weekly columns in the press. This included being a motoring correspondent where she got to test drive cars every week for the press for three years.Before being asked to work for the press, De-ann worked in magazine editorial writing everything from fashion features to social news. She was the marketing editor of a glossy magazine. She is also a professional artist & illustrator. Embroidery patterns, fabric design, dressmaking, sewing, knitting & fashion are part of her work.Additionally, De-ann has always been interested in fitness, and was a fitness & bodybuilding champion, 100 metre runner & mountaineer. As a former N.A.B.B.A. Miss Scotland, she had a weekly fitness show on the radio that ran for over three years.De-ann trained in Shukokai karate, boxing, kickboxing, Dayan Qigong & Jiu Jitsu. She is currently based in Scotland.",
  "genres": [
    "Mystery"
  ],
  "author": "De-ann Black",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/7785994-the-strife-of-riley"
}