{
  "title": "Secretly Bound",
  "description": "\" My inner dragon is constantly forcing me forward faster and faster. SHE pushes the boundaries of my passions. I become so strong in HER presence, yet SHE presses. I am forced to walk the line… Dangling my feet over the edge, fearlessly challenging the abyss to swallow me, I enjoy it.\" (p241). For centuries, artists have explored the duality of the soul. We are married to both good and evil, a co-existence held in balance by the power of choice. Echoed from the pens of poets and prose come the things that go bump in the heart, the monsters that frighten us most, the ones that live within. Wrapped in sensually seductive disguises between black covers erupts Jade and her Dragon. They are Secretly Bound. Leading a successful life with the right career, house and home, wife and child, Jade has it all. Or so it seems. Beneath the peaceful waters lies the emptiness of a relationship barely sparking. The passion is gone. Life is going through the motions, especially in the bedroom. Fantasy remains in the ashes of a once out of control fire, and Jade finds that reality is such a poor substitute. When we thirst, we seek to quench that thirst. We are built to survive, no matter the cost. Jade’s soul yearns to quench the desert that has become her sexuality. Her quest for an oasis leads her to Mylifeseeker.com, an internet-based social network, and like so many who have sought out friendship through the internet, Jade ends up with so much more. A storm cloud appears and her name is Emma, bringing with her correspondence sprinkles of rain that soon bursts into a mysterious monsoon flooding Jade’s desert and awakens the dragon within. With each email, readers ride on the dragon’s breath, holding tightly to the scales glistening in erotic adventures that will assuredly awaken the dragon in every reader. The darkest sexual desires kept from the home are openly explored with a virtual stranger, the lover born of dreams on a screen glowing with the increasing heat of wildfire. Emma soon succeeds in flooding Jade’s existence to the point that she must meet the source of her dragon’s fire. But as in every cautionary tale, let the reader beware. One always pays for forbidden pleasure, and Jade’s price is more than the reader could possibly imagine. Truth turns into lies. Lies become truth. Reality is fantasy. Fantasy is reality. The beginning is an end. The end is a beginning. And just when you think you’ve got the answer, there’s another riddle to solve. If you are ready, take this dragon by the tail and just try to hang on. You just might find that it is the dragon that has you, and that from this day forward, like Jade, you will forever be Secretly Bound. J AGuilera Professional Reviewer",
  "genres": [
    "Thriller"
  ],
  "author": "Jade",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/7787988-secretly-bound"
}