{
  "title": "Dub in Babylon: The Emergence and Influence of Dub Reggae in Jamaica and Britain From King Tubby to Post Punk",
  "description": "Dub reggae and the techniques associated with it have, since the late-1980s, been used widely by producers of dance and ambient music. However, the term was originally applied to a remixing technique pioneered in Jamaica as far back as 1967. Recording engineers produced reggae tracks on which the efforts of the producer were often more evident than those of the musicians these heavily engineered tracks were termed versions. The techniques used to produce versions quickly evolved into what is now known as dub. The term, in this sense, arrived in 1972 and was largely the result of experiments by the recording engineer Osbourne Ruddock/King Tubby. Over the decades, not only has dub evolved, but it has done so especially in the UK. Indeed, much contemporary music, from hip hop to trance and from ambient soundscapes to experimental electronica and drum 'n bass is indebted to the remix culture principally informed by dub techniques. However, while obviously an important genre, its significance is rarely understood or acknowledged. Part One of the book examines the Jamaican background, necessary for understanding the cultural significance of dub, and Part Two analyses its musical, cultural and political importance for both African-Caribbean and, particularly, white communities in the United Kingdom during the late-1970s and early 1980s. Particular attention is given to the subcultures surrounding the genre, especially its relationship with Rastafarian culture the history and central beliefs of which are related to reggae and examined. There is also analysis of its cultural and musicological influence on punk and post-punk, the principal political music in late-1970s Britain. Finally, moving into the period of the decline of post-punk and, indeed, British dub in the early 1980s, there will be an examination of what can be understood as the postmodern turn in dub. In summary, the book is a confluence of several lines of thought. Firstly, it provides a cultural and musical history of dub from its early days in Jamaica to the decline of post-punk in early-1980s Britain. Secondly, it examines the religio-political ideas it carried and traces these through to the ideologies informing the subcultures of the late-1970s and, finally, to their transformation and, arguably, neutralisation in the postmodern pastiche of post-punk dub. Thirdly, with reference to these lines of thought, it looks at dubs and roots reggaes contribution to race relations in 1970s Britain. Finally, it analyses the aesthetic and arguably spiritual significance of dub, looking at, for example, its foregrounding of bass and reverb.",
  "genres": [
    "Music"
  ],
  "author": "Christopher Partridge",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/7797230-dub-in-babylon"
}