{
  "title": "A Tale of Two Colonies: What Really Happened in Virginia and Bermuda?",
  "description": "In 1609, two years after its English founding, colonists struggled to stay alive in a tiny fort at Jamestown.John Smith fought to keep order, battling both English and Indians. When he left, desperate colonists ate lizards, rats, and human flesh. Surviving accounts of the “Starving Time” differ, as do modern scholars’ theories.Meanwhile, the Virginia-bound Sea Venture was shipwrecked on Bermuda, the dreaded, uninhabited “Isle of Devils.” The castaways’ journals describe the hurricane at sea as well as murders and mutinies on land. Their adventures are said to have inspired Shakespeare’s The Tempest.A year later, in 1610, the Bermuda castaways sailed to Virginia in two small ships they had built. They arrived in Jamestown to find many people in the last stages of starvation; abandoning the colony seemed their only option. Then, in what many people thought was divine providence, three English ships sailed into Chesapeake Bay. Virginia was saved, but the colony’s troubles were far from over.Despite glowing reports from Virginia Company officials, disease, inadequate food, and fear of Indians plagued the colony. The company poured thousands of pounds sterling and hundreds of new settlers into its venture but failed to make a profit, and many of the newcomers died. Bermuda—with plenty of food, no native population, and a balmy climate—looked much more promising, and in fact, it became England’s second New World colony in 1612.In this fascinating tale of England’s first two New World colonies, Bernhard links Virginia and Bermuda in a series of unintended consequences resulting from natural disaster, ignorance of native cultures, diplomatic intrigue, and the fateful arrival of the first Africans in both colonies. Written for general as well as academic audiences, A Tale of Two Colonies examines the existing sources on the colonies, sets them in a transatlantic context, and weighs them against circumstantial evidence.From diplomatic correspondence and maps in the Spanish archives to recent archaeological discoveries at Jamestown, Bernhard creates an intriguing history. To weave together the stories of the two colonies, which are fraught with missing pieces, she leaves nothing letters written in code, adventurers’ narratives, lists of Africans in Bermuda, and the minutes of committees in London. Biographical details of mariners, diplomats, spies, Indians, Africans, and English colonists also enrich the narrative. While there are common stories about both colonies, Bernhard shakes myth free from truth and illuminates what is known—as well as what we may never know—about the first English colonies in the New World.",
  "genres": [
    "History"
  ],
  "author": "Virginia Bernhard",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13078061-a-tale-of-two-colonies"
}