{
  "title": "Denial: A Memoir of Terror",
  "description": "\"I have listened and I have been quiet all my life. But now I will speak.\" One of the world's foremost experts on terrorism and post-traumatic stress disorder investigates her own unsolved adolescent sexual assault at the hands of a serial rapist, and in so doing, examines the horrors of trauma and denial. Alone in an unlocked house in a safe neighborhood in the suburban town of Concord, Massachusetts, two good, obedient girls, Jessica Stern, fifteen, and her sister, fourteen, were raped on the night of October 1, 1973. The girls had just come back from ballet lessons and were doing their homework when a strange man armed with a gun entered their home. Afterward, when they reported the crime, the police were skeptical.The rapist was never caught. For over thirty years, Stern denied the pain and the trauma of the assault. Following the example of her family, Stern—who lost her mother at the age of three, and whose father was a Holocaust survivor—focused on her work instead of her terror. She became a world-class expert on terrorism, a lauded academic and writer who interviewed terrorists around the globe. But while her career took off, her success hinged on her symptoms. After her ordeal she could not feel fear in normally frightening situations. Stern believed she'd disassociated from the trauma altogether, until a devoted police lieutenant reopened the sisters' rape case and brought her back to that harrowing night more than three decades past. With the help of the lieutenant, Stern began her own investigation—bringing to bear all her skills as a researcher—to uncover the truth about the town of Concord, her family, and her own mind. The result is Denial, a candid, courageous, and ultimately hopeful look at a trauma and its aftermath.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "True Crime",
    "Psychology",
    "Biography",
    "Crime",
    "Mental Health"
  ],
  "author": "Jessica Stern",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/7797817-denial"
}