{
  "title": "Guantanamo's Child: The Untold Story of Omar Khadr",
  "description": "A prize-winning journalist tells the troubling story of Canadian Omar Khadr, who has spent a quarter of his life growing up in Guantanamo Bay.Khadr was captured in Afghanistan in July 2002 at the age of 15. Accused by the Pentagon of throwing a grenade that killed U.S. soldier Sgt. First Class Christopher Speer, Khadr faces charges of conspiracy and murder. His case is set to be the first war crimes trial since World War II.In \"Guantanamo's Child,\" veteran reporter Michelle Shephard traces Khadr's roots in Canada, Pakistan and Afghanistan, growing up surrounded by al Qaeda's elite. She examines how his despised family, dubbed \"Canada's First Family of Terrorism,\" has overshadowed his trial and left him alone behind bars for more than five years. Khadr's story goes to the heart of what's wrong with the U.S. administration's post-9/11 policies and why Canada is guilty by association. His story explains how the lack of due process can create victims and lead to retribution, and instead of justice, fuel terrorism.Michelle Shephard is a national security reporter for the \"Toronto Star\" and the recipient of Canada's top two journalism awards.\"You will be shocked, saddened and in the end angry at the story this page turner of a book exposes. I read it straight through and Omar Khadr's plight is one you cannot forget.\"--Michael Ratner, New York, President of the Center for Constitutional Rights\"Michelle Shephard's richly reported, well written account of Omar Khadr's trajectory from the battlefields of Afghanistan to the cells of Guantanamo is a microcosm of the larger \"war on terror\" in which the teenaged Khadr either played the role of a jihadist murderer or tragic pawn or, perhaps, both roles.\"--Peter Bergen, author of \"Holy war, Inc.\" and \"The Osama bin Laden I know\"",
  "genres": [
    "Politics",
    "Nonfiction",
    "Canada",
    "Biography"
  ],
  "author": "Michelle Shephard",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/7797542-guantanamo-s-child"
}