{
  "title": "Ecological Economics: Principles And Applications",
  "description": "Conventional economics is often criticized for failing to reflect adequately the value of clean air and water, species diversity, and social and generational equity. By excluding biophysical and social systems from their analyses, many conventional economists overlook problems of the increasing scale of human impacts and the inequitable distribution of resources. Ecological Economics is an introductory-level textbook for an emerging paradigm that addresses this flaw in much economic thought. The book defines a revolutionary \"transdiscipline\" that incorporates insights from the biological, physical, and social sciences, and it offers a pedagogically complete examination of this exciting new field. The book provides students with a foundation in traditional neoclassical economic thought, but places that foundation within a new interdisciplinary framework that embraces the linkages among economic growth, environmental degradation, and social inequity. Introducing the three core issues that are the focus of the new transdiscipline -- scale, distribution, and efficiency -- the book is guided by the fundamental question, often assumed but rarely spoken in traditional What is really important to us? After explaining the key roles played by the earth's biotic and abiotic resources in sustaining life, the text is then organized around the main fields in traditional microeconomics, macroeconomics, and international economics. The book also takes an additional step of considering the policy implications of this line of thinking. Ecological Economics includes numerous features that make it accessible to a wide range of more than thirty text boxes that highlight issues of special importance to students lists of key terms that help students organize the main points in each chapter concise definitions of new terms that are highlighted in the text for easy reference study questions that encourage student exploration beyond the text glossary and list of further readingsAn accompanying workbook presents an innovative, applied problem-based learning approach to teaching economics.While many books have been written on ecological economics, and several textbooks describe basic concepts of the field, this is the only stand-alone textbook that offers a complete explanation of both theory and practice. It will serve an important role in educating a new generation of economists and is an invaluable new text for undergraduate and graduate courses in ecological economics, environmental economics, development economics, human ecology, environmental studies, sustainability science, and community development.",
  "genres": [
    "Economics",
    "Environment",
    "Ecology",
    "Nonfiction",
    "Sustainability",
    "Politics",
    "Philosophy"
  ],
  "author": "Herman E. Daly",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/77985.Ecological_Economics"
}