{
  "title": "قصة عن الحب والظلام",
  "description": "اليوم نشرت «منشورات الجمل» رواية لعاموس عوز في ترجمة عربية، وهي «قصة عن الحب والظلام« في ما يزيد عن سبعمئة وستين صفحة، وأنجز الترجمة عن العبرية الكاتب الفلسطيني جميل غنايم. رواية لا تُعدّ الأضخم فحسب، بل الأهم والأكثر فنية. رواية تقترب من السيرة الذاتية (الأوتوبيوغرافيا)، إلاّ أنها أكثر تعقيداً من عملية استرجاع للذكريات الذاتية والعائلية. إنها عمل تخييلي يعيد بعثرة عناصر الواقع، ورصد التفاصيل الصغيرة المنمنمة. يتابع الروائي سياقاتها وانعطافاتها والتواءاتها. يفكك كل عبارة، ويتأمّل كل حركة، ويستطرد ويتخيل ويهلوس. ويلاحق التداعيات المتطاولة والمستفيضة، كما يلاحق الأشكال المضيئة والأطياف الغامضة والزوايا المنسية. يُدخل القارئ إلى فضائه، إلى ورشته الروائية، يعرّفه على أدواتها وطرائق تركيبها، وكيفية عقد عُرى أحداثها، وكيفية تجميعها وتوزيعها وتركيبها والتلاعب بألفاظها. مادته الأوّلية ألبومات قديمة لصور العائلة، ومقاطع من حوار مع عمته سونيا، ومقاطع من كتب، وروايات، وأبيات من الشعر، وحكايات أسطورية، وقصص أطفال، وأحاديث متفرقة ما زالت عالقة في الذاكرة. وهو إذ يعيد هندسة روايته، فإنما يستعيد مقاطع وأزمنة على شكل لازمة موسيقية. في كل مرة يستعيدها بطريقة جديدة وفي ضوء جديد. وهو إذ يكرّر صورة العلاقة المثلثة بين الأب والإبن والأم، إنما ينظر إليها بمنظار أبوّته اليوم. وعاموس في تحليله لكتابة القصة، وكل قصة لا تخلو من بعض آثار صاحبها، يجد أن العمل القصصي ليس اعترافاً، وليس استراق النظر إلى أسرار الكاتب. القصة الحقّة هي هذا العمل الاختباري، إعادة التركيب والتفكيك والتنقية. وهذا التمازج هو بين الواقعي والفعلي، والمحتمل والمفترض، لا سيما إن كان المؤلف لا يعوّل في روايته إلاّ على أمشاج من ذاكرة ملتبسة وغامضة، ومن أقاويل وإشاعات وتخمينات. وإذا كانت هذه الرواية تكتنفها في كثير من المواضع فجوات وثغرات، فإنّ عاموس عوز يعيد ترميمها بوضع احتمالات وتقريبات وافتراضات تسدّ فراغها. وعليه، يدعو عاموس القارئ إلى أن يتعامل ليس مع المساحة التي بين المكتوب والمؤلف، بل مع المساحة التي بين المكتوب والقارئ نفسه. فعل القراءة هنا لا يكشف أسرار الكاتب وخفاياه، وإنما يفضح أسرار القارئ المخزية التي يخاف أن يفشيها، والمسوخ الداخلية التي يخشى أن يُظهرها إلى النور.",
  "genres": [
    "Israel",
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "Jewish",
    "Literature"
  ],
  "author": "Amos Oz",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/7800323"
}