{
  "title": "Cherokee Rose",
  "description": "The Brutal Road WestIt’s late summer 1838. President Martin Van Buren issues an order that the fifteen thousand Cherokee Indians living in the Smoky Mountains of North Carolina are to be evicted from their homeland. Forced to migrate to Indian Territory, the Cherokees begin their tragic, one-thousand-mile journey westward. Most of the seven thousand soldiers escorting them along the way are brutally cruel. But Cherokee Rose, an eighteen-year-old Indian girl, finds one soldier, Lieutenant Britt Claiborne, willing to stand up for them. Both Christians, Cherokee Rose discovers that Britt is also a quarter Cherokee himself. It’s upon the Trail of Tears that they fall in love, dreaming of one day marrying and finding a place to call home together.They found each other in the midst of tragedy…But is their love enough to keep them together?Cherokee Rose has endured more than any eighteen-year-old girl should. Though accepted by her tribe, being both mixed blood and a Christian set her apart. Then fifteen thousand Cherokee Indians are evicted from their homes in the Smoky Mountains of North Carolina. Broken and angry, Cherokee Rose joins her people on the thousand-mile trek westward to Indian Territory. The journey holds many trials—not the least of which is the cruelty of the soldiers escorting them. But Cherokee Rose is these men will not break her.Lieutenant Britt Claiborne is devoted to serving his country, but he detests the way his fellow soldiers treat the Indians. He not only refuses to join in, but does all he can to stop the abuse. To the soldiers, he is a traitor. To those he helps, a champion. But Britt knows he’s only doing what he must, not just because he’s a Christian, but for a reason he’s reluctant to reveal.Thrown together in the face of brutality, these two find themselves falling in love. They dream of marrying and finding a place to call home. But can their love survive the Trail of Tears?“ Cherokee Rose is a good story and a great way to learn about a historical event we would rather sweep under the rug.” --Lauraine Snelling, bestselling author of AmethystStory Behind the BookLong captivated with the study of American history, Al and JoAnna Lacy eagerly researched the time in the 1800s when the five “civilized tribes” were forced by the U.S. government to make a one-thousand-mile journey to Indian Territory (now the state of Oklahoma). The tribes were the Cherokee, the Chickasaw, the Choctaw, the Creek, and the Seminole. Repeatedly forced to surrender their lands, the people of the Cherokee Nation, as well as those of the other four tribes, were hoping to find in Indian Territory a place to call home .",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Fiction"
  ],
  "author": "Al Lacy",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/779952.Cherokee_Rose"
}