{
  "title": "Wings of Riches",
  "description": "Introducing a new trilogy called Dreams of Gold, master narrators Al and JoAnna Lacy tell the stories of three major gold strikes that took place in North America in the nineteenth century. Craig Turley, the son of a wealthy Manhattan business owner, longs to make his way in the world. Kathy Ross is the twenty-year-old family governess who cares deeply for Craig and secretly prays for his salvation. As word spreads across the country of the gold strike in California, Craig leaps at the opportunity to forge his own success. But when Craig finds that his shack has been broken into and all of his fortune has been stolen, could it be that God is trying to send him a message? Has God allowed this in his life in order to bring him to surrender? Will this prodigal son find his way home to recover all that God has truly intended for him?(series header for all three books) book one Dreams of Gold TrilogyWhen gold was discovered out West during the nineteenth century, men rushed from all parts of the globe to stake their claims. Fortunes were made and lost, families uprooted, and a continent shaped by men driven by dreams of gold.(end series header) Go West, Young Man!1849. Craig Turley was born with a silver spoon in his mouth, the son of a wealthy New York businessman. Craig has always felt he had something to prove, so when gold is found near Sacramento , he packs his bags for California , ready to try his wings. His younger sister and her governess, Kathy, hate to see him go—especially because they’ve recently trusted their lives to Jesus Christ and Craig has not. Kathy is praying for his salvation, his safe return...and that he’ll come to love her as much as she does him. In the rough-and-tumble world of the gold rush, will this city boy find the wealth he seeks? Or does he have his eyes on the wrong kind of riches?Story Behind the Book“This was a fascinating project for both of us because of our love of American history. So often in the Bible, gold and the lesser precious metals are linked with money and other possessions that make men rich—the pursuit of which is frequently tied to greed and covetousness, which destroys lives. As our story will reveal, many great fortunes were won...and many were lost. Riches are spoken of in the Bible as often deceptive, unsatisfying, hurtful, and uncertain. Let each of us take note of what the Spirit of God told Paul to write to his son in the faith, ‘Charge them that are rich in this world, that they be not high-minded, nor trust in uncertain riches, but in the living God, who giveth us richly all things to enjoy’ (1 Timothy 6:17).”",
  "genres": [
    "Christian Fiction",
    "Historical Fiction"
  ],
  "author": "Al Lacy",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/779950.Wings_of_Riches"
}