{
  "title": "The Countess",
  "description": "Was the “Blood Countess” history’s first and perhaps worst female serial killer? Or did her accusers create a violent fiction in order to remove this beautiful, intelligent, ambitious foe from the male-dominated world of Hungarian politics? In 1611, Countess Erzsébet Báthory, a powerful Hungarian noblewoman, stood helpless as masons walled her inside her castle tower, dooming her to spend her final years in solitary confinement. Her crime—the gruesome murders of dozens of female servants, mostly young girls tortured to death for displeasing their ruthless mistress. Her opponents painted her as a bloodthirsty škrata —a witch—a portrayal that would expand to grotesque proportions through the centuries.In this riveting dramatization of Erzsébet Báthory’s life, the countess tells her story in her own words, writing to her only son—a final reckoning from his mother in an attempt to reveal the truth behind her downfall. Countess Báthory describes her upbringing in one of the most powerful noble houses in Hungary, recounting in loving detail her devotion to her parents and siblings as well as the heartbreak of losing her father at a young age. She soon discovers the price of being a woman in sixteenth-century Hungary as her mother arranges her marriage to Ferenc Nádasdy, a union made with the cold calculation of a financial transaction. Young Erzsébet knows she has no choice but to accept this marriage even as she laments its loveless nature and ultimately turns to the illicit affections of another man.Seemingly resigned to a marriage of convenience and a life of surreptitious pleasure, the countess surprises even herself as she ignites a marital spark with Ferenc through the most unromantic of the violent punishment of an insolent female servant. The event shows Ferenc that his wife is no trophy but a strong, determined woman more than capable of managing their vast estates during Ferenc’s extensive military campaigns against the Turks. Her naked assertion of power accomplishes what her famed beauty could capturing the love of her husband.The countess embraces this new role of loving wife and mother, doing everything she can to expand her husband’s power and secure her family’s future. But a darker side surfaces as Countess Báthory’s demand for virtue, obedience, and, above all, respect from her servants takes a sinister turn. What emerges is not only a disturbing, unflinching portrait of the deeds that gave Báthory the moniker “Blood Countess,” but an intimate look at the woman who became a monster.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Horror",
    "Vampires",
    "Hungary",
    "Gothic"
  ],
  "author": "Rebecca Johns",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/7799308-the-countess"
}