{
  "title": "The Complete Short Stories of Guy de Maupassant, Part One",
  "description": "Part One contains Volumes I-IV of X. French author of the naturalistic school, Maupassant is generally considered to be the greatest French short story writer of his day. The Complete Short Stories contains the 300 short stories Maupassant wrote during the 1880s, including his horror fiction, which consists of some 39 stories, only a tenth of his total. See other titles by this author available from Kessinger Publishing. Other volumes in this set are ISBN(s): 1417936150.Volume I---------------------------Ball-of-Fat (Boule de Suif)The Diamond NecklaceA Piece of StringThe Story of a Farm-GirlIn the MoonlightMme. Tellier's ExcursionLoveMme. FifiMonsieur ParentUseless BeautyAn Affair of StateBabetteA Cock CrowedLilie LalaA VagabondThe MountebanksUglyThe DebtA Normandy JokeThe FatherThe ArtistFalse AlarmThat Pig of a MorinVolume II---------------------------Miss HarrietThe HoleThe InnA FamilyBellflowerIn the WoodThe Marquis de FumerolSavedThe SignalThe DevilThe Venus of BranizaThe RabbitLa MorillonneEpiphanySimon's PapaWaiter, a Bock!The Sequel to a DivorceThe ClownThe Mad WomanMademoiselleVolume III---------------------------A Bad ErrorThe PortChaliJeroboamVirtue in the BalletThe Double PinsHow He Got the Legion of HonorA CrisisGraveyard SirensGrowing OldA French Enoch ArdenJulie RomainAn Unreasonable WomanRosalie PrudentHippolyte's ClaimBenoistFecundityA Way to WealthAm I Insane?Forbidden FruitThe Charm DispelledMadame ParisseMaking a ConvertVolume IV---------------------------A Little WalkA Wife's ConfessionA Dead Woman's SecretLove's AwakeningBed No. 29MarrocaA PhilosopherA MistakeFlorentineConsiderationWoman's WilesMoonlightDoubtful HappinessHumiliationThe Wedding NightThe Noncommissioned OfficerIn the Court RoomA Peculiar CaseA Practical JokeA Strange FancyAfter DeathOn CatsRoom No. ElevenOne Phase of LoveGood ReasonsA Fair ExchangeThe Tobacco ShopA Poor GirlThe SubstituteA Passion",
  "genres": [
    "Short Stories",
    "Classics",
    "Fiction",
    "France",
    "Literature",
    "French Literature",
    "Adult"
  ],
  "author": "Guy de Maupassant",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/77996.The_Complete_Short_Stories_of_Guy_de_Maupassant_Part_One"
}