{
  "title": "Dirty Secret: A Daughter Comes Clean About Her Mother's Compulsive Hoarding",
  "description": "To be the child of a compulsive hoarder is to live in a permanent state of unease. Because if my mother is one of those crazy junk-house people, then what does that make me?When her divorced mother was diagnosed with cancer, New York City writer Jessie Sholl returned to her hometown of Minneapolis to help her prepare for her upcoming surgery and get her affairs in order. While a daunting task for any adult dealing with an aging parent, it's compounded for Sholl by one lifelong, complex, and confounding truth: her mother is a compulsive hoarder. Dirty Secret is a daughter's powerful memoir of confronting her mother's disorder, of searching for the normalcy that was never hers as a child, and, finally, cleaning out the clutter of her mother's home in the hopes of salvaging the true heart of their relationship before it's too late.Growing up, young Jessie knew her mother wasn't like other mothers: chronically disorganized, she might forgo picking Jessie up from kindergarten to spend the afternoon thrift store shopping. Now, tracing the downward spiral in her mother's hoarding behavior to the death of a long-time boyfriend, she bravely wades into a pathological sea of stuff: broken appliances, moldy cowboy boots, twenty identical pairs of graying bargain-bin sneakers, abandoned arts and crafts, newspapers, magazines, a dresser drawer crammed with discarded eyeglasses, shovelfuls of junk mail . . . the things that become a hoarder's treasures. With candor, wit, and not a drop of sentimentality, Jessie Sholl explores the many personal and psychological ramifications of hoarding while telling an unforgettable mother-daughter tale.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Mental Illness",
    "Psychology",
    "Mental Health",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Jessie Sholl",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/7804346-dirty-secret"
}