{
  "title": "Grayson",
  "description": "The true story of long-distance swimmer Lynne Cox's ocean encounter with an 18-foot baby whale and her efforts to reunite \"Grayson\" with his mother - part mystery, part magical tale.Grayson is Lynne Cox's first book since Swimming to Antarctica. In it she tells the story of a miraculous ocean encounter that happened to her when she was seventeen and in training for a big swim (she had already swum the English Channel, twice, and the Catalina Channel).It was the dark of early morning; Lynne was in 55-degree water as smooth as black ice, two hundred yards offshore, outside the wave break. She was swimming her last half-mile back to the pier before heading home for breakfast when she became aware that something was swimming with her. The ocean was charged with energy as if a squall was moving in; thousands of baby anchovy darted through the water like lit sparklers, trying to evade something larger. Whatever it was, it felt large enough to be a white shark coursing beneath her body.It wasn't a shark. It became clear that it was a baby gray whale—following alongside Lynne for a mile or so. Lynne had been swimming for more than an hour; she needed to get out of the water to rest, but she realized that if she did, the young calf would follow her onto shore and die from collapsed lungs.The baby whale—eighteen feet long!—was migrating on a three-month trek to its feeding grounds in the Bering Sea, an eight-thousand-mile journey. It would have to be carried on its mother's back for much of that distance, and was dependent on its mother's milk for food—baby whales drink up to fifty gallons of milk a day. If Lynne didn't find the mother whale, the baby would suffer from dehydration and starve to death.Something so enormous—the mother whale was fifty feet long—suddenly seemed very small in the vast Pacific Ocean. How could Lynne possibly find her?This is the story—part mystery, part magical tale—of what happened . . .",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Animals",
    "Nature",
    "Book Club",
    "Biography",
    "Adventure"
  ],
  "author": "Lynne Cox",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/780678.Grayson"
}