{
  "title": "Vladimir Nabokov: Novels 1955–1962",
  "description": "This Library of America volume is the second of three volumes that contain the most authoritative versions of the English works of the brilliant Russian émigré, Vladimir Nabokov.Lolita (1955), Nabokov’s single most famous work, is one of the most controversial and widely read books of its time. Funny, satiric, poignant, filled with allusions to earlier American writers, it is the “confession” of a middle-aged, sophisticated European émigré’s passionate obsession with a 12-year-old American “nymphet,” and the story of their wanderings across a late 1940s America of highways and motels. Of its deeper meanings, Nabokov characteristically wrote: “I am neither a reader nor a writer of didactic fiction, and… Lolita has no moral in tow. For me a work of fiction exists only insofar as it affords me what I shall call aesthetic bliss, that is a sense of being somehow, somewhere, connected with other states of being where art (curiosity, tenderness, kindness, ecstasy) is the norm.” (Nabokov’s film adaptation of Lolita, as originally written for director Stanley Kubrick, is also included.)Pnin (1957) is a comic masterpiece about a gentle, bald Russian émigré professor in an American college town who is never quite able to master its language, its politics, or its train schedule. Nabokov’s years as a teacher provided rich background for this satirical picture of academic life, with an unforgettable figure at its center: “It was the world that was absent-minded and it was Pnin whose business it was to set it straight. His life was a constant war with insensate objects that fell apart, or attacked him, or refused to function, or viciously got themselves lost as soon as they entered the sphere of his existence.”Pale Fire (1962) is a tour de force in the form of an ostensibly autobiographical poem by a recently deceased American poet and a critical commentary by an academic who is something other than what he seems. Its unique structure, pitting artist against seemingly worshipful critic, sets the stage for some of Nabokov’s most intricate games of deception and concealment. “Pretending to be a curio,” wrote Mary McCarthy, “it cannot disguise the fact that it is one of the great works of art of this century.”The texts of this volume incorporate Nabokov’s penciled corrections in his own copies of his works which correct long-standing errors, and have been prepared with the assistance of Dmitri Nabokov, the novelist’s son.",
  "genres": [
    "Fiction",
    "Literature",
    "Classics",
    "Novels",
    "American",
    "Literary Fiction",
    "Russia"
  ],
  "author": "Vladimir Nabokov",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/7807.Vladimir_Nabokov"
}