{
  "title": "The Pulsifer Saga",
  "description": "The Pulsifer Saga Deluxe 3rd Illustrated Edition is comprised of two complete fantasy novels, illustrated by the author and unlike anything else out there today! In the first novel, Pulsifer: A Fable, we meet fantasy fiction's new and outrageous hero...or anti-hero. He s not politically correct, overly heroic, or even overly endearing--but he is uproariously entertaining!Meet Calim Pulsifer--thief, rogue, womanizer, and confidence man--and, in spite of having earned the enmity of wizards, warriors, and women, always his own worst enemy. Extricating himself from one outrageous misadventure after another in his quest for vengeance and survival, the outcast Pulsifer leaves a chaotic wake of mayhem and mirth across and beneath a frozen, monster-haunted world. Political correctness goes out the window as the ultimate trickster and adventurer takes the stage. Fantasy-fiction readers and role-playing fans alike will find these novels provide a thrilling, belly-laughing reading experience. This first novel in the series will leave the reader gasping with laughter and asking for more...and more there is!In the second novel, Land of Ice, A Velvet Knife, Calim Pulsifer, still the ultimate rogue and adventurer of his place and time, is back with a vengeance--primarily fleeing vengeance, seeking vengeance, and repeatedly bungling, bamboozling, and bluffing his way from one outrageous situation to another. As in the first novel, Pulsifer: A Fable, in spite of having earned the enmity of wizards, warriors, and women, Pulsifer is once again his own worst enemy. Fighting, scrabbling, and conniving in his quest for vengeance and survival, the outcast Calim Pulsifer leads his adversaries on a hilarious chase, delving into the bizarre depths of a subterranean realm like no other. Adversaries and lovers, unhuman and sorcerous creations of an ancient wizardry, and innocent bystanders alike--all are touched by the wake he leaves. Only the force known as Equilibrium knows how things will finally balance out--for even multiple hells hath no fury like several women scorned! Once more, political correctness goes out the window, as Pulsifer takes the stage. Fantasy-fiction readers and role-playing fans alike will find these novels provide a thrilling, belly-laughing reading experience. Readers of Wm. Michael Mott's pulp fiction and Fortean/paranormal research works will find many familiar themes here, interwoven with a humor which is at times sophisticated and at other times ribald and slapstick. Fans of Jack Vance, Fritz Leiber, and George Macdonald Fraser--maybe even of John Kennedy Toole!--will enjoy these headlong, humorous adventure novels.The latest and best edition is published by Grave Distractions Publications and can be found here: http://www.amazon.com/The-Pulsifer-Sa...",
  "genres": [],
  "author": "Wm. Michael Mott",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/7804486-the-pulsifer-saga"
}