{
  "title": "Beyond the Hanging Wall",
  "description": "Like his physician father, Garth Baxtor is gifted with The Touch. By laying his hands upon a person, Garth can sense what dwells within: pain, illness, joy, or sorrow. It is through the application of The Touch that the gifted minister helps the sick of Escator by diagnosing ills and promoting healing.By decree of the royal treasury, for a period of three weeks each year, physicians of Escator - in lieu of taxes - are required to attend to the needs of the criminals who labor endlessly in the Veins, the labyrinth of mines carved deep into the earth and from which they harvest the gloam-a priceless commodity upon which the fortunes of Escator depend.It is during one such period of mandatory service that Joseph Baxtor decides his son is old enough to accompany him to the Veins as his apprentice. Garth is delighted. It's a chance to escape the dull and dreary surroundings of his quiet village for the delights of the capital city of Ruen. Joseph has been ordered to attend King Cavor himself. Garth will actually meet the king in person!As he discovers all too soon, however, the task at hand is a grim one. Descending into the mines for the first time, Garth could hardly be less prepared for what he encounters: thousands of men laboring like animals in dreadful conditions deep below the earth's surface.Applying his hands to the wound of one prisoner known only as Lot No. 859, Garth is stunned by what he discovers. This man is no common criminal. But then, who is he? Could it be? After all these years?Prince Maximillian?The answer to the riddle will involve Garth in a harrowing journey out of the Veins and into the Land of Dreams as he tries to resolve the question of the identity of Lot No 859. In the process, Garth will solve a centuries-old mystery-a mystery that will pit one king against another and shake the Kingdom of Escator to its foundations.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Young Adult",
    "Adult",
    "Magic"
  ],
  "author": "Sara Douglass",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/780868.Beyond_the_Hanging_Wall"
}