{
  "title": "The Civil War of 1812: American Citizens, British Subjects, Irish Rebels, & Indian Allies",
  "description": "In this deeply researched and clearly written book, the Pulitzer Prize–winning historian Alan Taylor tells the riveting story of a war that redefined North America. During the early nineteenth century, Britons and Americans renewed their struggle over the legacy of the American Revolution. Soldiers, immigrants, settlers, and Indians fought in a northern borderland to determine the fate of a continent. Would revolutionary republicanism sweep the British from Canada? Or would the British empire contain, divide, and ruin the shaky American republic?In a world of double identities, slippery allegiances, and porous boundaries, the leaders of the republic and of the empire struggled to control their own diverse peoples. The border divided Americans—former Loyalists and Patriots—who fought on both sides in the new war, as did native peoples defending their homelands. Serving in both armies, Irish immigrants battled one another, reaping charges of rebellion and treason. And dissident Americans flirted with secession while aiding the British as smugglers and spies.During the war, both sides struggled to sustain armies in a northern land of immense forests, vast lakes, and stark seasonal swings in the weather. In that environment, many soldiers panicked as they fought their own vivid imaginations, which cast Indians as bloodthirsty savages. After fighting each other to a standstill, the Americans and the British concluded that they could safely share the continent along a border that favored the United States at the expense of Canadians and Indians. Both sides then celebrated victory by forgetting their losses and by betraying the native peoples.A vivid narrative of an often brutal (and sometimes comic) war that reveals much about the tangled origins of the United States and Canada.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Military History",
    "War",
    "Canada",
    "American"
  ],
  "author": "Alan Taylor",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/7809077-the-civil-war-of-1812"
}