{
  "title": "Political Writings: The Revolutions of 1848/Surveys from Exile/The First International & After, Vols 1-3",
  "description": "A shrinkwrapped three-volume set of Marx’s political The key essays and texts on politics and history—including The Communist Manifesto , The Eighteenth Brumaire of Louis Napoleon , The Class Struggles of France , The Civil War In France and Critique of the Gotha Programme . Karl Marx was not only the great theorist of capitalism, he was also a superb journalist, politician and historian. In these brand-new editions of Marx’s Political Writings we are able to see the depth and range of his mature work from 1848 through to the end of his life, from The Communist Manifesto to The Class Struggles in France and The Critique of the Gotha Programme . Each book has a new introduction from a major contemporary thinker, to shed new light on these vital texts.Volume 1: The Revolutions of 1848 : Marx and Engels had sketched out the principles of scientific communism by 1846. Yet it was from his intense involvement in the abortive German Revolution of 1848 that Marx developed a depth of practical understanding he would draw on in Capital and throughout his later career. This volume includes his great call to arms— The Communist Manifesto —but also shows how tactical alliances with the bourgeoisie failed, after which Marx became firmly committed to independent workers’ organizations and the ideal of “permanent revolution.” The articles offer trenchant analyses of events in France, Poland, Prague, Berlin and Vienna, while speeches set out changing communist tactics. In a new introduction the major socialist feminist writer Sheila Rowbotham examines this period of Marx’s life and how it shaped his political perspective.Volume 2: Surveys from Exile : In the 1850s and early 1860s Marx played an active part in politics, and his prolific journalism from London offered a constant commentary on all the main developments of the day. During this time Marx began to interpret the British political scene and express his considered views on Germany, Poland and Russia, the Crimean War and American Civil War, imperialism in India and China, and a host of other key issues. The Class Struggles in France develops the theories outlined in The Communist Manifesto into a rich and revealing analysis of contemporary events, while The Eighteenth Brumaire of Louis Bonaparte contains equally stimulating reflections on Napoleon III’s coup d’etat of 1851. In a new introduction activist and writer Tariq Ali examines the texts that have become essential works in Marx’s canon.Volume 3: The First International and After : The crucial texts of Marx’s later years—notably The Civil War in France and Critique of the Gotha Programme —count among his most important work. These articles include a searching analysis of the tragic but inspiring failure of the Paris Commune, as well as essays on German unification, the Irish question, the Polish national movement and the possibility of revolution in Russia. The founding documents of the First international and polemical pieces attacking the disciples of Proudhon and Bakunin and the advocates of reformism, by contrast, reveal a tactical mastery that has influenced revolutionary movements ever since. In a new introduction the renowned Marxist David Harvey sheds light on the evolution of Marx’s notions of democracy and politics.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Philosophy",
    "Theory"
  ],
  "author": "Karl Marx",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/7810995-political-writings"
}