{
  "title": "Me Too!: Preschool Poetry",
  "description": "Preschool is that period of childhood when everything is either black, or white, a time of Santa Claus and the Easter Bunny, and the grey area hasn't yet begun. It's that last true age of innocence when mom and dad are the good guys, pretending is a profession, and bugs are only tiny friends. Wouldn't it be fun to have a grownup friend who understands, someone to say it's okay if the world doesn't always make sense? CJ Heck is that grownup friend. She's been entertaining children and grownups with her poetry since 1999 through her website, and then with the release of her first book \"Barking Spiders (and Other Such Stuff)\" in 2000. Sit back, get comfy, and read \"Me Too!\" with a child-- get back in touch with your own inner child again and remember, remember, remember ... \"CJ's understanding of, and ability to enter into, the mind of a child is apparent in every page of her children's poetry. Her devotion to and expertise in writing poetry is in my opinion, second to none.\"~Russell Daily (Co-founder and co-owner of FX Signalmaster LLC) \"CJ Heck is a marvelous writer with the ability to capture the imagination of children of all ages. Her work is a delightful blend of realism and whimsey that is always a pleasure to read and share with others.\"~Felix Perry (Author) \"CJ provides great entertainment to our clients and their families through her books. We share them with our real estate clients who have young children.\"~Chip & Sue Parrish (Owners, Keller Williams Classic Properties, Columbus OH) \"When I was a child I thought as a child and I spoke as a child. CJ Heck has never forgotten what it is like to be a child. She writes for children so they can understand, learn and enjoy the imagination given to them and grow.\"~John A. Roof (Artist, Author) \"CJ, I love your childrens poetry. It's like you revert to the child you're writing about and to. Sometimes I wish I could go back and make it all different. Your poems help me see what I missed. Great stuff!\"~K. Mulroney",
  "genres": [
    "Poetry"
  ],
  "author": "C.J. Heck",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/13078942-me-too"
}