{
  "title": "Great Tales of Terror from Europe and America: Gothic Stories of Horror and Romance 1765-1840",
  "description": "Excellent...chills the blood of the toughest reader. The parade of great names from Goethe to Poe testifies to the quality of the writing - Sunday TimesIntroduction (Gothic Tales of Terror: Volume Two; Classic Horror Stories from Europe and the United States) • (1972) • essay by Peter HainingThe New Melusina • (1816) • novelette by Johann Wolfgang von Goethe (trans. of Die neue Melusine) [as by Johann von Goethe]The Ghost-Seer, or The Apparitionist • non-genre • [Der Geisterseher • 1] • (1972) • novel by Friedrich von Schiller (trans. of Der Geisterseher 1789) [as by J. F. von Schiller]The Harp • (1811) • short story by Karl Theodor Körner (trans. of Die Harfe)The Wild Huntsman! Or The Demon's Skeleton Chase • [Baron Munchausen / Münchhausen] • (1972) • short fiction by Gottfried August Bürger (trans. of Der wilde Jäger? 1786) [as by Gottfried August Burger]The Bride of the Grave • (1972) • novelette by Ernst Raupach (trans. of Laßt die Todten ruhen? 1822) [as by Johann Ludwig Tieck (in error)]The Field of Terror • (1972) • short story by Baron Friedrich de La Motte Fouqué? (trans. of Das Schauerfeld 1814) [as by Baron de La Motte Fouqué]The Bottle-Imp • (1972) • novelette by Baron Friedrich de La Motte Fouqué? (trans. of Das Galgenmännlein? 1814) [as by Johann Karl August Musäus (in error)?]The Spectre Barber • (1972) • novella by Johann Karl August Musäus (trans. of Stumme Liebe 1782) [as by Anonymous]The Cremona Violin • (1946) • novelette by E. T. A. Hoffmann (trans. of Rath Krespel 1818)The Fatal Marksman • (1972) • short story by A. Apel (trans. of Der Freischütz? 1810) [as by Johann August Apel]The Devil's Ladder • (1972) • short story by Alois Wilhelm Schreiber (trans. of Die Teufelsleiter 1829)The Hall of Blood • (1972) • short story by Julia Pardoe (variant of The Hall of Blood: A Hungarian Tradition 1844) [as by Professor von Kramer (in error)]The Witch of Eye • (1972) • short story by Henry Neele [as by Francois Baculard d'Arnaud (in error)]The Unholy Compact Abjured • (1825) • short story by uncredited (variant of The Heroism of Love 1826) [as by Charles Pigault-Lebrun]The Wandering Jew's Sentence • (1972) • short story by Eugène Sue?The Parracide Punished • (unknown) • short story by AnonymousLouise, or Living Spectre • (unknown) • short story by AnonymousJan Schalken's Three Wishes • (1972) • short story by H. S. Van Dyk [as by Anonymous]Maredata and Giulio, or The Ocean Spirit • (1972) • short story by N. G. (variant of Maredata 1824) [as by Anonymous]Valdrwulf, or The Fiend of the Moor • (unknown) • short story by J. Fitzgerald Pennie [as by Anonymous]Rip Van Winkle • (unknown) • short story by LegendMemoirs of Carwin, the Biloquist • (1803) • novella by Charles Brockden BrownThe Adventure of the German Student • [Strange Stories by a Nervous Gentleman] • (1824) • short story by Washington IrvingThe Christmas Banquet • (1843) • short story by Nathaniel HawthorneThe Strange Guests • (1837) • short story by Henry Rowe Schoolcraft (variant of The Two Ghosts, or Hospitality Rewarded 1825) [as by Anonymous]Hugues, the Wer-Wolf • (1838) • short story by Sutherland MenziesThe Possessed One • (1972) • short story by uncredited [as by Anonymous]Ben Blower's Story • (1842) • short story by Charles HoffmanThe Cask of Amontillado • [Fortunato] • (1846) • short story by Edgar Allan PoeShadow—A Parable • [Tales of the Folio Club] • (1850) • short story by Edgar Allan Poe (variant of Shadow: A Fable 1835)",
  "genres": [
    "Horror",
    "Gothic",
    "Fiction",
    "Short Stories",
    "Anthologies",
    "Fantasy",
    "Classics"
  ],
  "author": "Peter Haining",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/7811822-great-tales-of-terror-from-europe-and-america"
}