{
  "title": "Islam and Terrorism: What the Quran Really Teaches About Christianity, Violence and the Goals of the Islamic Jihad",
  "description": "The Western media declares that \"at its core, Islam is moderate and tolerant of others\" (New York Times Magazine). Author Mark A. Gabriel, former professor of Islamic history at Al-Azhar University in Cairo, Egypt, disagrees. He says that terrorists are practicing Islam just as Muhammad intended. As a child, Gabriel grew up in a Muslim family in Egypt and was heavily indoctrinated. By the age of twelve he had memorized the entire Qur'an. He went on to become a top student at the most prestigious Islamic university in the world, Al-Azhar in Cairo, Egypt. As a student and professor of Islamic history, he rubbed shoulders with those who are at the forefront of propagating the tenets of Islamic terrorism. He actually took classes with Sheik Umar Abd al-Rahman, who was convicted of masterminding the 1993 World Trade Center bomb attack and is now in prison. In his book Gabriel explains: •How Islam was influenced by the warlike Arabian culture of the 7th century •Atrocities committed by Muhammad in the name of Allah •The story of the Egyptian student who came to study education in America and went on to write the first handbook of terrorism in the twentieth century •The prominence of jihad (war against infidels) in Islamic theology •How Egyptian fundamentalists murdered and robbed Christians to raise funds for terrorism •The difference between a moderate Muslim and a fundamentalist MuslimFor the readers of this book, the motive behind Islamic world activity will no longer be a mystery. Each action is obviously rooted in the philosophy of Islam. Now both the Christian and the political world must decide how to react to Muhammad's revelation.",
  "genres": [
    "Islam",
    "Religion",
    "Nonfiction",
    "Terrorism",
    "History",
    "Politics",
    "Evangelism"
  ],
  "author": "Mark A. Gabriel",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/78217.Islam_and_Terrorism"
}