{
  "title": "Invisible Ink: A Practical Guide to Building Stories That Resonate",
  "description": "Acclaimed by successful screenwriters and authors, Invisible Ink is a helpful, accessible guide to the essential elements of the best storytelling. Brian McDonald, an award winning screenwriter who has taught his craft at several major studios, supplies writers with tools to make their work more effective and provides readers and audiences a deeper understanding of the storyteller's art. When people think of a screenplay, they usually think about dialogue-the \"visible ink\" that is readily accessible to the listener, reader, or viewer. But a successful screenplay needs Invisible Ink as well, the craft below the surface of words. Invisible Ink lays out the essential elements of screenplay structure, using vivid examples from famous moments in popular movies as well as from one of his own popular scripts. You will learn techniques for building a compelling story around a theme, making your writing engage audiences, creating appealing characters, and much more. Praise for Invisible \"...If I manage to reach the summit of my next story it will be in no small part due to having read Invisible Ink.\" -Andrew Stanton (cowriter Toy Story, Toy Story 2, A Bug's Life, Monsters, Inc., and cowriter/director Finding Nemo and WALL-E) \"...Brian McDonald uses his deep understanding of story and character to pass on essential truths about dramatic writing. Ignore him at your peril.\" -Jim Taylor (Academy Award-winning screenwriter of Sideways and Election) \"... I recommend this fine handbook on craft to any writer, apprentice or professional, working in any genre or form.\" -Dr. Charles Johnson (National Book Award-winning author of Middle Passage) \"If you want to write scripts, listen to Brian. The guy knows what he's talking about.\" -Paul Feig (creator of NBC's Freaks and Geeks, co-executive producer The Office) \"With Invisible Ink Brian McDonald has written us a book to keep and heed forever because through the simple, graceful, graspable, original wisdom of it, we might just save our screenwriting lives.\" -Stewart Stern (Screenwriter of Rebel Without a Cause)",
  "genres": [
    "Writing",
    "Nonfiction",
    "Art",
    "Communication",
    "Audiobook",
    "Self Help",
    "Film"
  ],
  "author": "Brian  McDonald",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/7818660-invisible-ink"
}