{
  "title": "The Art of the Story: An International Anthology of Contemporary Short Stories",
  "description": "Following the immense success of The Art of the Tale, Daniel Halpern has assembled the next generation of short-story writers—those born after 1937—to create a companion volume, The Art of the Story. Attesting to the depth, range, and continued popularity of short fiction, this collection includes seventy-eight contributors from thirty-five countries. The Art of the Story combines the best of the established masters as well as the fresh, new voices of writers whose work has seldom been translated into English.Includes:Gift from somewhere by Ama Ata AidooKeeper of the virgins by Hanan Al-ShaykhAmor divino by Julia AlvarezImmortals by Martin AmisGlass tower by Reinaldo ArenasWilderness tips by Margaret AtwoodGorilla, my love by Toni Cade BambaraMy mother's memoirs, my father's lie, and other true stories by Russell BanksG-string by Nicola BarkerEvermore by Julian BarnesAren't you happy for me? by Richard BauschIn Amalfi by Ann BeattieRara avis by T. Coraghessan BoyleMr. Green by Robert Olen ButlerFat man in history by Peter CareyCourtship of Mr. Lyon by Angela CarterAre these actual miles? by Raymond CarverOld man slave and the mastiff by Patrick ChamoiseauDharma by Vikram ChandraNever marry a Mexican by Sandra CisnerosProspect from the silver hills by Jim CraceNight women by Edwidge DanticatHouse behind by Lydia DavisAll because of the mistake by Daniele del GiudiceYsrael by Junot DíazBetrayal by Patricia DunckerReflections of spring by Duong Thu HuongGirl who left her sock on the floor by Deborah EisenbergTwenty-seventh man by Nathan EnglanderParakeet by Victor ErofeyevRoberto narrates by Péter EsterházyMy father, the Englishman, and I by Nuruddin FarahOptimists by Richard FordStory of the lizard who had the habit of dining on his wives by Eduardo GaleanoHammam by Hervé GuibertEscort by Abdulrazak GurnahMidnight and I'm not famous yet by Barry HannahPortrait of the avant-garde by Peter HøegMoving house by Pawel HuelleFamily supper by Kazuo IshiguroEncounter by Roy JacobsenFirst day by Edward P. JonesRemember young Cecil by James KelmanIntimacy by Hanif KureishiStump-grubber by Torgny LindgrenWish by Bobbie Ann MasonEverything in this country must by Colum McCannPornography by Ian McEwanBehind the blue curtain by Steven MillhauserWilling by Lorrie MooreLifeguard by Mary MorrisCanebrake by Mohammed MrabetManagement of grief by Bharati MukherjeeMuradhan and Selvihan, or, The tale of the crystal kiosk by Murathan MunganElephant vanishes by Haruki MurakamiMark of Satan by Joyce Carol OatesIn the shadow of war by Ben OkriWhere the jackals howl by Amos OzLife and adventures of shed number XII by Victor PelevinTalking dog by Francine ProseFree radio by Salman RushdieAfrica kills her sun by Ken Saro-WiwaRing by Ingo SchulzeLearning to swim by Graham SwiftRiddle by Antonio TabucchiMinutes of glory by Ngugi Wa Thiong'oOn the golden porch by Tatyana TolstayaJohn-Jin by Rose Tremain by Who, me a bum? by Luisa ValenzuelaCinnamon skin by Edmund WhiteYou can't get lost in Cape Tower by Zoë WicombDoc's story by John Edgar WidemanFarm by Joy WilliamsDirt angel by Jeanne WilmotGreen man by Jeanette WintersonNight in question by Tobias WolffChild who raised poisonous snakes by Can XueHelix by Banana Yoshimoto",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Contemporary",
    "Writing",
    "Literature",
    "Collections"
  ],
  "author": "Daniel Halpern",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/78219.The_Art_of_the_Story"
}