{
  "title": "An American Dilemma: The Negro Problem and Modern Democracy Vol. 1",
  "description": "In this landmark effort to understand African American people in the New World, Gunnar Myrdal provides deep insight into the contradictions of American democracy as well as a study of a people within a people. The title of the book, 'An American Dilemma', refers to the moral contradiction of a nation torn between allegiance to its highest ideals and awareness of the base realities of racial discrimination. The touchstone of this classic is the jarring discrepancy between the American creed of respect for the inalienable rights to freedom, justice, and opportunity for all and the pervasive violations of the dignity of blacks. The appendices are a gold mine of information, theory, and methodology. Indeed, two of the appendices were issued as a separate work given their importance for systematic theory in social research. The new introduction by Sissela Bok offers a remarkably intimate yet rigorously objective appraisal of Myrdal―a social scientist who wanted to see himself as an analytic intellectual, yet had an unbending desire to bring about change. 'An American Dilemma' is testimonial to the man as well as the ideas he espoused. When it first appeared 'An American Dilemma' was called \"the most penetrating and important book on contemporary American civilization\" by Robert S. Lynd; \"One of the best political commentaries on American life that has ever been written\" in The American Political Science Review; and a book with \"a novelty and a courage seldom found in American discussions either of our total society or of the part which the Negro plays in it\" in 'The American Sociological Review'. It is a foundation work for all those concerned with the history and current status of race relations in the United States.",
  "genres": [
    "History",
    "Nonfiction",
    "Sociology",
    "Race",
    "Politics",
    "Social Justice",
    "American History"
  ],
  "author": "Gunnar Myrdal",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/781857.An_American_Dilemma"
}