{
  "title": "Daughter of the Shining Isles",
  "description": "With keen psychological insight and disarming humor, Elizabeth Cunningham re-imagines the beginnings of Christianity from a Celtic point-of-view. Her Celtic Magdalen invites us to wonder how a woman trained in the mysteries of Druidism and ancient Celtic spirituality might have fallen under the spell of the young Jesus of Nazareth and cast her own magic over him. The evolving tale of love, challenge, and triumph will captivate readers seeking fresh perspectives into the Celtic and Christian elements of our Western spiritual heritage.-Tom Cowan, author of \"Fire in the Head, Shamanism and the Celtic Spirit\"\"Cunningham wears her reverence at a such a rakish angle that it's easy to overlook the deeply religious sensibility that informs her work. In treating the pious and priggish denial of Christ's physicality as the set-up for her outlandish comic effects, she is fall-out-of-your-chair funny. She could crack up the Mater Dolorosa. But she is also mounting a serious challenge to that denial. Nor does she spare the more recent pieties of New Age spirituality, which tend to bury the personality of Magdalen under a mawkish heap of female archetypes. Her mouthy Magdalen won't sit still for being anyone's icon or emblem. She is here to tell you that Jesus, her friend, sweetheart and \"cosmic sibling rival\" was adorably, poignantly--and sometimes annoyingly--human. In less grace-full hands, this sassy treatment might amount to no more than a smart-aleck deconstruction of Christ's divinity. But Cunningham is up to no such thing. She insists on humanity as one who sees in its every awkward aspect the image and likeness of God. Beneath her sense of the ridiculous and the ribald, is a subtext thatsings \"Alleluia!\" -Catherine MacCoun, author of \"The Age of Miracles\"\"Cunningham has outdone herself. Always an imaginative writer, as such books as The Return of the Goddess and The Wild Mother show, Cunningham here mixes Celtic mythology with the emergent feminist tradition of the Magdalen to create a powerful and spiritually charged visionary novel. Red-haired Maeve was born on the legendary Isle of Women, where her weather-witching mothers (yes, the plural is intentional) raise her to be utterly self-assured as",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Fantasy",
    "Coming Of Age"
  ],
  "author": "Elizabeth Cunningham",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/781760.Daughter_of_the_Shining_Isles"
}