{
  "title": "Art of the Short Story, The",
  "description": "This affordably-priced collection presents masterpieces of short fiction from 52 of the greatest story writers of all time. From Sherwood Anderson to Virginia Woolf, this anthology encompasses a rich global and historical mix of the very best works of short fiction and presents them in a way students will find accessible, engaging, and relevant. The book's unique integration of biographical and critical background gives students a more intimate understanding of the works and their authors.Part I. Introduction. The art of the short story.-- Part II. Stories [A-J]. Chinua Dead men's path ; Author's perspective, modern Africa as the crossroads of culture -- Sherwood Hands ; Author's perspective, Words not plot give form to a short story -- Margaret Happy endings ; Author's perspective, On the Canadian identity -- James Sonny's blues ; Author's perspective, Race and the African-American writer -- Jorge Luis The garden of forking paths ; Author's perspective, Literature as experience -- Albert The guest ; Author's perspective, Revolution and repression in Algeria -- Raymond Cathedral ; A small, good thing ; Author's perspective, Commonplace but precise language -- Willa Paul's case ; Author's perspective, Art as the process of simplification -- John The swimmer ; Author's perspective, Why I write short stories -- Anton The lady with the pet dog ; Misery ; Author's perspective, Natural description and \"The center of gravity\" -- Kate The storm ; The story of an hour ; Author's perspective, My writing method -- Sandra Barbie-Q ; Author's perspective, Bilingual style -- Joseph The secret sharer ; Author's perspective, The condition of art -- Stephen The open boat ; Author's perspective, The sinking of the Commodore -- Ralph A party down at the square ; Author's perspective, Race and fiction -- William Barn burning ; A rose for Emily ; Author's perspective, The human heart in conflict with itself -- F. Scott Babylon revisited ; Author's perspective, On his own literary aims -- Gustave A simple heart ; Author's perspective, The labor of style -- Gabriel García A very old man with enormous wings ; Author's perspective, García My beginnings as a writer -- Charlotte Perkins The yellow wallpaper ; Author's perspective, Why I wrote \"The yellow wallpaper\" -- Nikolai The overcoat ; Author's perspective, On realism -- Nadine A company of laughing faces ; Author's perspective, How the short story differs from the novel -- Nathaniel Young Goodman Brown ; The birthmark ; Author's perspective, On the public failure of his early stories -- Ernest A clean, well-lighted place ; Author's perspective, One true sentence -- Zora Neale Sweat ; Author's perspective, Eatonville when you look at it -- Shirley The lottery ; Author's perspective, The public reception of \"The lottery\" -- Henry The real thing ; Author's perspective, The mirror of a consciousness -- Ha Saboteur ; Author's perspective, Deciding to write in English -- James Joyce : Araby ; The dead ; Author's perspective, Epiphanies. Part II[ Cont.]. Stories [K-W]. Franz Before the law ; The metamorphosis ; Author's perspective, Discussing The metamorphosis -- D.H. Odour of Chrysanthemums ; The rocking-horse winner ; Author's perspective, The novel is the bright book of life -- Ursula K. Le the ones who walk away from Omelas ; Author's perspective, Le On \"The ones who walk away from Omelas\" -- Doris A woman on a roof ; Author's perspective, My beginnings as a writer -- Jack To build a fire ; Author's perspective, Defending the factuality of \"To build a fire\" -- Katherine Miss Brill ; The garden-party ; Author's perspective, On \"The garden-party\" -- Bobbie Ann Shiloh ; Author's perspective, Minimalist fiction -- Guy de The necklace ; Author's perspective, The realist method -- Herman Bartleby, the scrivener : a story of Wall-Street ; Author's perspective, American literature -- Yukio Patriotism ; Author's perspective, Physical courage and death -- Alice How I met my husband ; Author's perspective, How I write short stories -- Joyce Carol where are you going, where have you been? ; Author's perspective, Productivity and the critics -- Flannery O' A good man is hard to find ; Revelation ; Author's perspective, O' The element of suspense in \"A good man is hard to find\" -- Edgar Allan The fall of the House of Usher ; The Tell-tale heart ; Author's perspective, The tale and its effect -- Katherine Anne Flowering Judas ; Author's perspective, Writing \"Flowering Judas\" -- Leslie Marmon The man to send rain clouds ; Author's perspective, the basis of \"The man to send rain clouds\" -- Isaac Bashevis Gimpel the Fool ; Author's perspective, The character of Gimpel -- Leo The death of Ivan Ilych ; Author's perspective, The moral responsibility of art -- John Separating ; Author's perspective, Why write? -- Alice Everyday use ; Author's perspective, The Black woman writer in America -- Eudora Why I live at the P.O. ; Author's perspective, The plot of the short story -- Edith Roman fever ; Author's perspective, The subject of short stories -- Virginia A haunted house ; Author's perspective, Women and fiction. Part III. Writing. The elements of short fiction -- Writing about fiction -- Critical approaches to literature. Formalist Light and darkness in \"Sonny's Blues\" / Michael Clark -- Biographical Chekhov's attitude to romantic love / Virginia Llewellyn Smith -- Historical The Argentine context of Borges's fantastic fiction / John King -- Psychological The father-figure in \"The tell-tale heart\" / Daniel Hoffman -- Mythological Myth in Faulkner's \"Barn Burning\" / Edmond Volpe -- \"Sociological Money and labor in \"The rocking-horse winner\" / Daniel P. Watkins -- Gender Gender and pathology in \"The yellow wallpaper\" / Juliann Fleenor -- Reader-response An Eskimo \"A Rose for Emily\" / Stanley Fish -- Deconstructionist The death of the author / Roland Barthes -- Cultural What is cultural studies? / Makr Bauerlein. Part IV. Glossary of literary terms.",
  "genres": [
    "Writing",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Classics",
    "Literature",
    "School"
  ],
  "author": "Dana Gioia",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/78223.Art_of_the_Short_Story_The"
}