{
  "title": "Red Army",
  "description": "In the heart of a European forest, a young private dreams of home and rock 'n roll. At command headquarters, a four-star general pursues a family tradition of military honor that reaches back centuries. They could be any two soldiers in the world. It could be any army - but it's not. The place is the East German border. The time is tomorrow - and the Soviet Army is about to attack. . .While western leaders debate the use of nuclear weapons, the Soviet Army and its Warsaw Pact Allies crash across West Germany, exploiting the NATO armies' deadly lack of preperation. In a matter of days, refugees clog the roads and the cities are in shambles. The Soviet Army wages a brutal battle for Europe - even as the hidden rivalries and divided loyalties within its ranks begon to emerge.In this extraordinary. controversial novel, author Ralph Peters a U.S. Army intelligence officer specializing in the Soviet military - takes us inside an army of dozens of languages and ethnic backgrounds, into the belly of an armored personnel carrier, the cockpit of a MIG, and onto the bloody battlefield where sophisticated tanks duel like ancient, flame-spewing dragons.From Chief of Staff Chibisov, fighting his ethnic heritage, to the daring tank commander Bezarin, locked in an unforgettable duel of wits with a British division, from bitter veterans of Afghanistan to raw recruits, a host of vivid characters are swept up in the chaos and drama. Some will be heroes. Some will die, and others will have their souls scarred forever.As the HATO armies make their last, desparate stands - divided by Soviet maneuvers and their own political squabbling - Red Army thunders to a truly frightening climax.Told entirely from a Russian point of view, Red Army is a riveting tour de force. More than a portrait of high-tech modern warfare, it is a fascingating novel of human strengths and weaknesses - a chilling look at the one army in the world that may have the power to defeat us.",
  "genres": [
    "Fiction",
    "Military Fiction",
    "War",
    "Thriller",
    "Historical Fiction",
    "Alternate History",
    "Soviet Union"
  ],
  "author": "Ralph Peters",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/782434.Red_Army"
}