{
  "title": "Tales from Shakspeare - Volume 2",
  "description": "This historic book may have numerous typos, missing text, images, or index. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. 1885. Not illustrated. Excerpt: ... THE TAMING OF THE SHREW. Katherine, the Shrew, was the eldest daughter of Baptista, a rich gentleman of Padua. She was a lady of such an ungovernable spirit and fiery temper, such a loud-tongued scold, that she was known in Padua by no other name than Katherine the Shrew. It seemed very unlikely, indeed impossible, that any gentleman would ever be found who would venture to marry this lady, and therefore Baptista was much blamed for deferring his consent to many excellent offers that were made to her gentle sister Bianca, putting off all Bianca's suitors with this excuse, that when the eldest sister was fairly off his hands, they should have free leave to address young Bianca. It happened however that a gentleman, named Petrachio, came to Padua, purposely to look out for a wife, who, nothing discouraged by these reports of Katherine's temper, and hearing she was rich and handsome, resolved upon marrying this famous termagant, and taming her into a meek and manageable wife. And truly none was so fit to set about this herculean labor as Petruchio, whose spirit was as high as Katherine's, and he was a witty and most happy-tempered humorist, and withal so wise, and of such a true judgment, that he well knew how to feign a passionate and furious deportment, when his spirits were so calm that himself could have laughed merrily at his own angry feigning, for his natural temper was careless and easy; the boisterous airs he assumed when he became the husband of Katherine being but in sport, or, more properly speaking, affected by his excellent discernment, as the only means to overcome in her own way the passionate ways of the furious Katherine. A courting then Petruchio went to Katherine the Shrew; and first of all he applied to Baptista, her father, for leave ...",
  "genres": [],
  "author": "Charles Lamb",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/7824476-tales-from-shakspeare---volume-2"
}