{
  "title": "Nightshade City",
  "description": "Deep beneath Trillium City, a modern metropolis, lies the Catacombs, a kingdom of rats of extraordinary intelligence and ability. The once peaceful and democratic colony has become a harsh dictatorship ruled by the High Minister Kildeer and his henchman, Billycan, who runs the Kill Army and collects weekly Stipend from the terrified subjects. The two of them rule with iron fists. With most of the adult rats wiped out in Killdeer's Bloody Coup and the subsequent great flood, orphaned young male rats are forced into the army and the females into servitude or worse. But change is coming. . . .Two orphan brothers, Vincent and Victor Nightshade, sons of a hero killed in the Bloody Coup, manage to escape from the Kill Army and meet up with Juniper Belancourt, leader of a rebel group seeking to overthrow their oppressors and restore peace and democracy in a new city. The brothers are quickly caught up in Juniper's cause: \"We survive by cover of night. We live in the shadows, waiting for our redemption! Our name must symbolize our burning spirit. . . . Tonight and forever, we are Nightshade City!\"Juniper's plans are complicated by many factors. His lovely young niece Clover has been picked by Killdeer to be his next Chosen One, so the rebels and their allies the Earthworms must work fast to save her. Can the rebels locate their enemies' War Room? Can Juniper's former love, now holding a position in Killdeer's Ministry, be trusted? Will the rebels be able to execute their plans without the aid of a young Topsider (human)? And how will Vincent and Victor fare in battle will they honor their father's legacy of courage?NIGHTSHADE CITY is rich with memorable characters: Vincent, who comes of age in this time of change; his worshipful younger brother, Victor; beautiful, intelligent Clover; Mother Gallo, a canny survivor who discovers her lost love only to risk losing him again; the charismatic Juniper, a kind and courageous leader whose vision carries the rebels into great danger; Killdeer, a decadent narcissist with surprising depth; and Billycan, a truly demented former lab rat, brilliant, vicious, and Juniper's sworn enemy.This enthralling animal fantasy, in the classic tradition of Redwall and Watership Down, encompasses timeless themes of honor and loyalty, family ties and lost love, alliances and betrayals. Readers will respond enthusiastically to this surefire page-turner, set in a brilliantly imagined world filled with easy-to-root-for heroes and villains they'll love to hate.",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Animals",
    "Young Adult",
    "Fiction",
    "Adventure",
    "Childrens"
  ],
  "author": "Hilary Wagner",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/7826546-nightshade-city"
}