{
  "title": "The Dustbin of History",
  "description": "\"How much history can be communicated by pressure on a guitar string?\" Robert Palmer wondered in Deep Blues . Greil Marcus answers more than we will ever know. It is the history in the riff, in the movie or novel or photograph, in the actor's pose or critic's posturing--in short, the history in cultural happenstance--that Marcus reveals here, exposing along the way the distortions and denials that keep us oblivious if not immune to its lessons. Whether writing about the Beat Generation or Umberto Eco, Picasso's Guernica or the massacre in Tiananmen Square, The Manchurian Candidate or John Wayne's acting, Eric Ambler's antifascist thrillers or Camille Paglia, Marcus uncovers the histories embedded in our cultural moments and acts, and shows how, through our reading of the truths our culture tells and those it twists and conceals, we situate ourselves in that history and in the world. Rarely has a history lesson been so exhilarating. With the startling insights and electric style that have made him our foremost writer on American music, Marcus brings back to life the cultural events that have defined us and our time, the social milieu in which they took place, and the individuals engaged in them. As he does so, we see that these cultural instances--as lofty as The Book of J , as humble as a TV movie about Jan and Dean, as fleeting as a few words spoken at the height of the Berkeley Free Speech Movement, as enduring as a Paleolithic painting--often have more to tell us than the master-narratives so often passed off as faultless representations of the past. Again and again Marcus skewers the widespread assumption that history exists only in the past, that it is behind us, relegated to the dustbin. Here we see instead that history is very much with us, being made and unmade every day, and unless we recognize it our future will be as cramped and impoverished as our present sense of the past.",
  "genres": [
    "Music",
    "History",
    "Essays",
    "Nonfiction",
    "Cultural Studies",
    "Politics",
    "The United States Of America"
  ],
  "author": "Greil Marcus",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/78285.The_Dustbin_of_History"
}