{
  "title": "Southern Daughter: The Life of Margaret Mitchell",
  "description": "Gone With the Wind is an American phenomenon. Arguably the most popular American novel of all time, it sold over a million copies in its first six months (in the heart of the Depression), won a Pulitzer Prize for its author, and more remarkable still, returned to the New York Times BestSeller list fifty years after its first appearance. Crowning its glory, David O. Selznick transformed the novel into one of the great films of all time, lifting its characters--especially the unforgettable Scarlett O'Hara and her lover-antagonist Rhett Butler--to the pinnacle of American popularculture.Now, in Southern Daughter , Darden Pyron provides an absorbing biography of Margaret Mitchell, the author of this American classic. In a solidly researched, sprightly narrative informed by a deep knowledge of Southern culture, Pyron reveals a woman of unconventional beauty, born into one ofAtlanta's most prominent families, and imbued from childhood with tales of the Civil War. Mitchell was a rebellious child, an independent woman who wanted a career and not a family (children made her wince), and a Catholic who defiantly left the Church, divorced her first husband, Red Upshaw (ane'er-do-well and sometime bootlegger), and married John Marsh (who had been Upshaw's best man). Fans of Gone With the Wind will find several chapters in Southern Daughter that trace how these elements in Mitchell's biography made their way into her fiction, including the most surprising identityfor the fictional Rhett Butler. As a further surprise to most Americans who know only the film version of Gone With the Wind , Pyron reveals how Mitchell intended her book as a repudiation of the then popular \"moonlight on the magnolias\" genre of Civil War romance. Equally interesting is hisportrait of Mitchell after the novel's the incredible flood of letters (in the 13 years before her death, Mitchell wrote at least ten thousand letters, an astonishing number of which ran pages and pages); the filming of Gone With the Wind , whose script ultimately required seventeen writers,including F. Scott Fitzgerald and Ben Hecht; and the lavish film premier in Atlanta.Whether describing Mitchell's earliest writing (such as The Cow Puncher and Phil Kelley, Detective , in which she played Zara the female crook), or discussing her final years, which were marred by constant pain and illness, wrangles with agents and publisher, and her increasing affection forlitigation, this perceptive, sympathetic, and engagingly written biography illuminates the life of a major writer and the book she created, a work peopled with characters who still loom large in the American imagination.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Southern",
    "War",
    "Romance",
    "Historical"
  ],
  "author": "Darden Asbury Pyron",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/782963.Southern_Daughter"
}