{
  "title": "Late, Late at Night",
  "description": "In a searingly candid memoir which he authored himself, Grammy Award-winning pop icon Rick Springfield pulls back the curtain on his image as a bright, shiny, happy performer to share the startling story of his rise and fall and rise in music, film, and television and his lifelong battle with depression.In the 1980s, singer-songwriter and actor Rick Springfield seemed to have it a megahit single in “Jessie’s Girl,” sold-out concert tours, follow-up hits that sold more than 17 million albums and became the pop soundtrack for an entire generation, and 12 million daily viewers who avidly tuned in to General Hospital to swoon over his portrayal of the handsome Dr. Noah Drake. Yet lurking behind his success as a pop star and soap opera heartthrob and his unstoppable drive was a moody, somber, and dark soul, one filled with depression and insecurity.In Late, Late at Night , the memoir his millions of fans have been waiting for, Rick takes readers inside the highs and lows of his extraordinary life. By turns winningly funny and heartbreakingly sad, every page resonates with Rick’s witty, wry, self-deprecating, brutally honest voice. On one level, he reveals the inside story of his ride to the top of the entertainment world. On a second, deeper level, he recounts with unsparing candor the forces that have driven his life, including his longtime battle with depression and thoughts of suicide, the shattering death of his father, and his decision to drop out at the absolute peak of fame. Having finally found a more stable equilibrium, Rick’s story is ultimately a positive one, deeply informed by his passion for creative expression through his music, a deep love of his wife of twenty-six years and their two sons, and his life-long quest for spiritual peace.",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Rick Springfield",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/7839023-late-late-at-night"
}