{
  "title": "Germs, Genes, & Civilization: How Epidemics Shaped Who We Are Today",
  "description": "\"Clear, thoughtful, and thought-provoking, Germs, Genes & Civilization makes the case that infectious diseases have played a major role in shaping society. Clark argues that religion, morals, and even democracy have all been influenced by the smallest and most dangerous organisms on our planet. While you may not accept every argument, you will be stimulated, entertained, and enlightened.\"---Samuel L. Stanley, Jr., M.D., President, Stony Brook University, and former Director of the Midwest Regional Center for Excellence in Biodefense and Emerging Infectious Diseases Research\"Clark presents an insightful explanation of the invisible history all around us. He conveys the essential facts in a riveting and engaging manner that everyone, including the nonscientist, will find exceptionally interesting and revealing.\"---Michael C. Thomsett, author of The Inquisition\"Germs, Genes & Civilization is a fascinating and well-balanced account of how a wide variety of different kinds of microbes have influenced human evolution, culture, society, and even religious thought. Written for a lay audience, the relationships between genes and disease resistance and susceptibility are clearly discussed, and the book concludes with a sober assessment of what may be in store for us in the future.\"---Irwin W. Sherman, Professor Emeritus, University of California, Riverside, and author of Twelve Diseases That Changed Our World and The Power of Plaguesho's in charge here? Humans? No way. Microbes don't just outnumber us by nearly 1021 to 1: They run the Earth. In Germs, Genes & Civilization, Dr. David Clark reveals the hidden web of microbial activity that shapes our planet and molds our human destinies.You'll discover how your genes have been shaped by battling against infectious diseases through the millennia. You'll learn how epidemics have transformed human history, over and over again---from ancient Egypt to Mexico, the Romans to Attila the Hun. You'll learn how the Black Death epidemic ended the Middle Ages, making possible the Renaissance, Western democracy, and the scientific revolution.Perhaps most fascinating of all, Clark reveals the latest scientific and philosophical insights into the interplay between microbes, humans, and society---and previews what just might come next.AD 452: Attila the Hun stands ready to sack Rome. No one can stop him---but he walks awaj A miracle? No...dysentery. Microbes saved the Roman Empire. Nearly a millennium later, the microbes of the Black Death ended the Middle Ages, making possible the Renaissance, western democracy, and the scientific revolution. Soon after, microbes ravaged the Americas, paving the way for their European conquest.Again and again, microbes have shaped our health, our genetics, our history, our culture, our politics, even our religion and ethics. This book reveals much that scientists and cultural historian; have learned about the pervasive interconnections between infectious microbes and humans. It also considers what our ongoing fundamental relationship with infectious microbes might mean for the future of the human species.The \"good side\" of history's worst epidemics the surprising debt we owe to killer diseasesWhere diseases came from...and where diseases came from...and where they may be goingChildren of pestilence: disease and civilization From Egypt to Mexico, from Rome to ChinaSTDs, sexual behavior, and culture How microbes can shape cultural cycles of puritanism and promiscuity",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Biology",
    "Medicine",
    "Medical",
    "Health"
  ],
  "author": "David P. Clark",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/7831505-germs-genes-civilization"
}