{
  "title": "Blood Curse",
  "description": "The Blood Revelation Vampires, witches, and shifters will band together to stop the darkness from winning, until one warrior is born to save the world from Satan's wrath.When Aria Michaels sets out to find the vampire who took her mother’s life, she’s stunned when she instead finds Rialto Renaldi, the vampire who has been haunting her dreams. She hadn’t believed he was real, and she knows she should run from Rialto as fast as she can. But who better to help her find her mother’s killer?Rialto is reluctant to help the mortal woman who has invaded his dreams, even though he’s curious about who she is and why she has this strange connection to him. He isn’t, however, about to satisfy his curiosity. The last time he became involved with a mortal, he ended up destroying her. But he knows that if Aria searches for the killer on her own, she’ll join her mother in death.Finally, Rialto agrees to help Aria, but the pair soon learns that fate brought them together for a much larger purpose, and fate has every intention of destroying them if they don't fulfill their roles in the Blood Revelation Prophecy . . .Crystal-Rain Love resides in the South with her three children and enough pets to host a petting zoo. When she's not writing, she can usually be found creating unique 3D cakes, hiking, reading, or spending way too much time on Facebook. You can find her at crystalrainlove.com or facebook.com/crystalrainloveauthor“Crystal-Rain Love has created a fantastic world filled with mystery, magic, blood, passion, and love. I cannot wait to dive into the next volume in this series.”—Cassie, Bitten by Books“Crystal-Rain Love has built a dark and brooding world, one where evil is determined to win out.”— Long and Short Reviews",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Vampires"
  ],
  "author": "Crystal-Rain Love",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/7831367-blood-curse"
}