{
  "title": "Call Lady Purbeck",
  "description": "George Villiers, Duke of Buckingham, was the most powerful and most hated man in the realm throughout nearly two reigns. Handsome, cruel, ambitious Buckingham was the favorite of James I and of Charles, James's proud son. To fill his pockets and swell his pride, Buckingham could bend both monarchs to his will. He cared not if his country suffered. Of all those who loathed and feared Buckingham, Frances Coke, later Frances Villiers, Viscountess Purbeck, loathed and feared him most.Her strange, pale beauty, high spirits and passionate nature marked her as one to trouble the hearts of men, and one to whom a marriage without love would be forever odious. But Buckingham and the whip's lash forced her into a form of marriage with John Villiers, Viscount Purbeck, Buckingham's gangling, half-crazed brother. Their union was never consummated, and it was not long before Frances, like every other woman at the Stuart Court, took a lover, gentle, gifted Robin Howard, her kinsman.Buckingham himself was the lover of the Queen of France, and at the easygoing, pleasure-loving Stuart Court everything was permitted--save that which angered the King's favorite. A cuckolded John Villiers was a personal affront to great Buckingham. Even his death did not still the bitterness against my lady Purbeck, who had caused the scandal of a generation. Frances paid dearly for her illicit love. Frances Villiers, a much wronged woman, lived in an age of chivalry and brutality, color and corruption. Her father was Sir Edward Coke, a harsh, embittered man who paid for rating the Law above the Crown.Francis Bacon was her adviser. King Louis XIII of France and the infinitely cunning Cardinal Richelieu were among her many admirers. Her Odyssey is a stirring and poignant tale by an acknowledged master of the historical novel.",
  "genres": [],
  "author": "Hilda Lewis",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/7839345-call-lady-purbeck"
}