{
  "title": "The Demon King",
  "description": "The first book in an epic fantasy series from debut author Cinda Williams Chima. Adventure, magic, war and ambition conspire to throw together an unlikely group of companions in a struggle to save their world. When 16-year-old Han Alister and his Clan friend Dancer encounter three underage wizards setting fire to the sacred mountain of Hanalea, he has no idea that this event will precipitate a cascade of disasters that will threaten everything he cares about. Han takes an amulet from one of the wizards, Micah Bayar, to prevent him from using it against them. Only later does he learn that it has an evil history-it once belonged to the Demon King, the wizard who nearly destroyed the world a millennium ago. And the Bayars will stop at nothing to get it back. Meanwhile, Princess Raisa ana'Marianna, the heir to the Gray Wolf throne of the Fells, has just spent three years of relative freedom with her father's family at Demonai Camp-riding, hunting, and working the famous Clan markets. Now court life in Fellsmarch pinches like a pair of too-small shoes. Wars are raging to the south, and threaten to spread into the high country. After a long period of quiet, the power of the Wizard Council is once again growing. The people of the Fells are starving and close to rebellion. Now more than ever, there's a need for a strong queen. But Raisa's mother Queen Marianna is weak and distracted by the handsome Gavan Bayar, High Wizard of the Fells. Raisa wants to be more than an ornament in a glittering cage. She aspires to be like Hanalea-the legendary warrior queen who killed the Demon King and saved the world. With the help of her friend, the cadet Amon Byrne, she navigates the treacherous Gray Wolf Court, hoping she can unravel the conspiracy coalescing around her before it's too late.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Magic",
    "Romance",
    "Young Adult Fantasy",
    "High Fantasy",
    "Fiction"
  ],
  "author": "Cinda Williams Chima",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/7842166-the-demon-king"
}