{
  "title": "The Camel Bookmobile",
  "description": "The Camel Bookmobile follows an American librarian who travels to the arid bush of northeastern Kenya to give meaning to her life, but ultimately loses a piece of her heart. A compelling novel that shows how one life can change many, in spite of dangerous and seemingly immutable obstacles.When Fiona Sweeney tells her family she wants to do something that matters, they do not expect her to go to Africa to help start a traveling library. But that is where Fiona chooses to make her mark: in the arid bush of northeastern Kenya, among tiny, far-flung communities, nearly unknown and lacking roads and schools, where people live daily with drought, hunger, and disease. In The Camel Bookmobile, Fi travels to settlements where people have never held a book in their hands. Her goal is to help bring Dr. Seuss, Homer, Tom Sawyer, and Hemingway to a largely illiterate and semi-nomadic populace. However, because the donated books are limited in number and the settlements are many, the library initiates a tough fine: if anyone fails to return a book, the bookmobile will stop coming. Though her motives are good, Fi doesn't understand the people she seeks to help. Encumbered by her Western values, she finds herself in the midst of several struggles within the community of Mididima. There the bookmobile's presence sparks a feud between those who favor modernization and those who fear the loss of the traditional way of life in the African bush. The feud heightens when one young man—\"Scar Boy\"—doesn't return his books. As promised, the library stops all visits, but Fi goes to the settlement alone, determined to recover what has been lost. Evocative, seamless, and haunting, The Camel Bookmobile is a powerful saga that challenges our fears of the unknown. It is a story that captures the riddles and calamities that often occur when two cultures collide. It follows an American librarian who travels to Africa to give meaning to her life, and ultimately loses a piece of her heart. In the end, this compelling novel shows how one life can change many, in spite of dangerous and seemingly immutable obstacles.",
  "genres": [
    "Fiction",
    "Africa",
    "Books About Books",
    "Book Club",
    "Kenya",
    "Adult Fiction",
    "Contemporary"
  ],
  "author": "Masha Hamilton",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/78425.The_Camel_Bookmobile"
}