{
  "title": "Machiavelli: A Biography",
  "description": "He is the most infamous and influential political writer of all time. His name has become synonymous with cynical scheming and the selfish pursuit of power.Niccolò Machiavelli, Florentine diplomat and civil servant, is the father of political science. His most notorious work, The Prince, is a primer on how to acquire and retain power without regard to scruple or conscience. His other masterpiece, The Discourses, offers a profound analysis of the workings of the civil state and a hardheaded assessment of human nature.Machiavelli’s philosophy was shaped by the tumultuous age in which he lived, an age of towering geniuses and brutal tyrants. He was on intimate terms with Leonardo and Michelangelo. His first political mission was to spy on the fire-and-brimstone preacher Savonarola. As a diplomat, he matched wits with the corrupt and carnal Pope Alexander VI and his son, the notorious Cesare Borgia, whose violent career served as a model for The Prince. His insights were gleaned by closely studying men like Julius II, the “Warrior Pope,” and his successor, the vacillating Clement VII, as well as two kings of France and the Holy Roman Emperor. Analyzing their successes and failures, Machiavelli developed his revolutionary approach to power politics.Machiavelli was, above all, a student of human nature. In The Prince he wrote a practical guide to the aspiring politician that is based on the world as it is, not as it should be. He has been called cold and calculating, cynical and immoral. In reality, argues biographer Miles Unger, he was a deeply humane writer whose controversial theories were a response to the violence and corruption he saw around him. He was a psychologist with acute insight into human nature centuries before Freud. A brilliant and witty writer, he was not only a political theorist but also a poet and the author of La Mandragola, the finest comedy of the Italian Renaissance. He has been called the first modern man, unafraid to contemplate a world without God. Rising from modest beginnings on the strength of his own talents, he was able to see through the pious hypocrisy of the age in which he lived.Miles Unger has relied on original Italian sources as well as his own deep knowledge of Florence in writing this fascinating and authoritative account of a genius whose work remains as relevant today as when he wrote it.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Politics",
    "Italy",
    "Philosophy",
    "16th Century"
  ],
  "author": "Miles J. Unger",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/7841355-machiavelli"
}