{
  "title": "Dead Zero",
  "description": "From New York Times bestselling author and Pulitzer Prize winner Stephen Hunter comes a thriller that plunges deep into the world of high-tech national security, the hearts and minds of those who kill for duty, and the latest mission for veteran sniper Bob Lee Swagger— who may have finally met the only man who can outshoot him. Who killed Whiskey 2-2? And why won’t it stay dead? A marine sniper team on a mission in tribal territories on the Afghan-Pakistan border, Whiskey 2-2 is ambushed by professionals using the latest high-tech shooting gear. Badly wounded, the team’s sole survivor, Gunnery Sergeant Ray Cruz, aka “the Cruise Missile,” is determined to finish his job. He almost succeeds when a mystery blast terminates his enterprise, leaving a thirty-foot crater where a building used to be—and where Sergeant Cruz was meant to be hiding. Months pass. Ray’s target, an Afghan warlord named Ibrahim Zarzi, sometimes called “The Beheader,” becomes an American asset in the region and beyond, beloved by State, the Administration, and the Agency. He arrives in Washington for consecration as Our Man in Kabul. But so does a mysterious radio transmission, in last year’s code. It’s from Whiskey 2-2. MISSION WILL BE COMPLETED.CONFIDENCE IS HIGH. Is Ray Cruz back? Has he gone rogue, is he insane, or just insanely angry? Will he succeed, though his antagonists now include the CIA, the FBI, and the same crew of bad boys that nearly killed him in Zabol province? Not to mention Bob Lee Swagger and a beautiful CIA agent named Susan Okada who gives Swagger more than just a patriotic reason to take the case. Swagger, the legendary hero of seven of Hunter’s novels from Point of Impact to last year’s bestselling I, Sniper, is recruited by the FBI to stop the Cruise Missile from reaching his target. The problem is that the more Swagger learns about what happened in Zabol, the more he questions the U.S. government’s support of Zarzi and the more he identifies with Cruz as hunter instead of prey. With its hallmark accuracy on modern killing technologies, Dead Zero features an older, more contemplative Swagger, but never lets up on the razor-sharp dialogue, vivid characterizations, extraordinary action scenes, and dazzling prose that define Hunter’s landmark series. And with this installment, the stunning revelations— both political and private—will leave readers begging for more long after the last bullet finds its way home.",
  "genres": [
    "Thriller",
    "Fiction",
    "Action",
    "Mystery",
    "Suspense",
    "Adventure",
    "Military Fiction"
  ],
  "author": "Stephen Hunter",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/7841445-dead-zero"
}