{
  "title": "The Agent Gambit",
  "description": "Back in Print at Two Consecutive Novels in the Top-Selling Liaden Universe® Space Adventure Agent of Change and Carpe Diem .Two space adventure novels in the popular Liaden Universe® series in one popularly-priced Omni-trade Agent of Change : Once a brilliant First-in-Scout, Val Con yos’Phelium was “recruited” by the shadowy Liaden Department of Interior and brainwashed into an Agent of Change—a ruthless covert operative who kills without remorse. Val Con has been playing a deep game, far from the orderly life of clan and kin. Fleeing his latest mission, he saves the life of ex-mercenary Miri Robertson, a Terran on the run from interplanetary assassins. Thrown together by circumstances, Val Con and Miri struggle to elude their enemies and stay alive without killing each other-or surrendering to the unexpected passion that flares between them. Which name – or face – will the agent choose when the game gets tough and an escape for only one of them seems possible?Carpe Diem : On the run from interplanetary assassins and a ruthless interstellar crime cartel, covert operative Val Con yos'Phelium and former mercenary sergeant Miri Robertson formed an alliance of necessity and wound up stranded on a planet with no rescue in sight. Their on-world problems were looking manageable after they assumed new identities as musicians, that is until a local war forced them to reveal their alien combat skills – and doubt their own growing partnership of trust and love. By then the relentless hound of an agent on Val Con's trail was closing in with the very weapon Val Con and Miri most feared, and the game got very rough indeed.“I rarely rave on and on about stories, but I am devoted to Lee and Miller novels and stories.” — Anne McCaffrey",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Romance",
    "Fantasy",
    "Fiction",
    "Space"
  ],
  "author": "Sharon Lee",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/7841405-the-agent-gambit"
}