{
  "title": "Aunt Résia and the Spirits and Other Stories",
  "description": "The Haiti of Yanick Lahens's path-breaking short fiction is a country demanding our compassion as it reveals to us its horrors. For decades among the forefront of Haitian writers, Lahens has embarked on a renewal of the genre of short stories that she inherited from Caribbean--and especially Haitian--traditions. Through her elliptical and sharp style she succeeds in conveying the authenticity of her people's tragic fight for survival within the scope of our shared human experience. Here is day-to-day life, packed with its myriad emotions, desires, and contradictions, against a backdrop of extraordinary circumstances.The men and women glimpsed in Lahens's stories are confronted with the overwhelming task of simply staying alive. \"The Survivors\" unfolds under the Duvalier dictatorship. The story, centered on a group of men who dream of somehow striking out against the regime, shows how fear is passed down from generation to generation. Life is no simpler in the post-Duvalier world of the title story, in which a young man is caught between a mother who lives a devout life filled with self-imposed restrictions and an aunt who religiously serves the spirits of Vodou but makes no apologies for working in the black market. The twelve-year-old girl who narrates \"Madness Had Come with the Rain\" finds herself swept up in a violent riot following the death of a modern Robin Hood. Lahens's women, although they may act as the poto mitan (or \"central pole\") in family life and society, experience a particularly grim fate. In the eviction tale \"And All This Unease\" a beautiful girl reminisces about her happy childhood in the country in order to forget her current life as a prostitute.Yanick Lahens presents testimonies, opens intimacies, sometimes offers hope, but always returns to the despair afflicting Haiti, because lying within it is the key to her country. The first collection of Lahens's unforgettable short stories available in English, this volume will bring one of the most important voices in contemporary literature to the wider audience it deserves.",
  "genres": [
    "Short Stories",
    "20th Century"
  ],
  "author": "Yanick Lahens",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/7842715-aunt-r-sia-and-the-spirits-and-other-stories"
}