{
  "title": "American Grace: How Religion Divides and Unites Us",
  "description": "American Grace is a major achievement, a groundbreaking examination of religion in America. Unique among nations, America is deeply religious, religiously diverse, and remarkably tolerant. But in recent decades the nation's religious landscape has been reshaped. America has experienced three seismic shocks, say Robert Putnam and David Campbell. In the 1960s, religious observance plummeted. Then in the 1970s and 1980s, a conservative reaction produced the rise of evangelicalism and the Religious Right. Since the 1990s, however, young people, turned off by that linkage between faith and conservative politics, have abandoned organized religion. The result has been a growing polarization—the ranks of religious conservatives and secular liberals have swelled, leaving a dwindling group of religious moderates in between. At the same time, personal interfaith ties are strengthening. Interfaith marriage has increased while religious identities have become more fluid. Putnam and Campbell show how this denser web of personal ties brings surprising interfaith tolerance, notwithstanding the so-called culture wars. American Grace is based on two of the most comprehensive surveys ever conducted on religion and public life in America. It includes a dozen in-depth profiles of diverse congregations across the country, which illuminate how the trends described by Putnam and Campbell affect the lives of real Americans. Nearly every chapter of American Grace contains a surprise about American religious life. Among them:● Between one-third and one-half of all American marriages are interfaith; ● Roughly one-third of Americans have switched religions at some point in their lives; ● Young people are more opposed to abortion than their parents but more accepting of gay marriage; ● Even fervently religious Americans believe that people of other faiths can go to heaven; ● Religious Americans are better neighbors than secular Americans—more generous with their time and treasure even for secular causes—but the explanation has less to do with faith than with their communities of faith; ● Jews are the most broadly popular religious group in America today. American Grace promises to be the most important book in decades about American religious life and an essential book for understanding the United States today.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Politics",
    "Sociology",
    "History",
    "Christianity",
    "Theology"
  ],
  "author": "Robert D. Putnam",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/7841392-american-grace"
}