{
  "title": "The Astounding, the Amazing, and the Unknown",
  "description": "Based on an incredible true episode of World War II history, Paul Malmont’s new novel is a rollicking blend of fact and fiction about the men and women who were recruited to defeat the Nazis and ended up creating the future. In 1943, when the United States learns that Germany is on the verge of a deadly innovation that could tip the balance of the war, the government turns to an unlikely source for help: the nation’s top science fiction writers. Installed at a covert military lab within the Philadelphia Naval Yard are the most brilliant of these young visionaries. The unruly band is led by Robert Heinlein, the dashing and complicated master of the genre. His “Kamikaze Group,” which includes the ambitious genius Isaac Asimov, is tasked with transforming the wonders of science fiction into science fact and unlocking the secrets to invisibility, death rays, force fields, weather control, and other astounding phenomena—and finding it harder than they ever imagined. When a German spy washes ashore near the abandoned Long Island ruins of a mysterious energy facility, the military begins to fear that the Nazis are a step ahead of Heinlein’s group. Now the oddball team, joined by old friends from the Pulp Era including L. Ron Hubbard (court-martialed for attacking Mexico), must race to catch up. The answers they seek may be locked in the legendary War of Currents, which was fought decades earlier between Nikola Tesla and Thomas Edison. As the threat of an imminent Nazi invasion of America grows more and more possible, events are set in motion that just may revolutionize the future—or destroy it—while forcing the writers to challenge the limits of talent, imagination, love, destiny, and even reality itself. Blazing at breathtaking speed from forgotten tunnels deep beneath Manhattan to top-secret battles in the North Pacific, and careening from truth to pulp and back again, The Astounding, the Amazing, and the Unknown is a sweeping, romantic epic—a page-turning rocket ship ride through the history of the future.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Historical Fiction",
    "Alternate History",
    "Fantasy",
    "Mystery",
    "Thriller"
  ],
  "author": "Paul Malmont",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/7841347-the-astounding-the-amazing-and-the-unknown"
}