{
  "title": "Aftershock: The Next Economy and America's Future",
  "description": "A brilliant new reading of the economic crisis—and a plan for dealing with the challenge of its aftermath—by one of our most trenchant and informed experts.When the nation’s economy foundered in 2008, blame was directed almost universally at Wall Street. But Robert B. Reich suggests a different reason for the meltdown, and for a perilous road ahead. He argues that the real problem is it lies in the increasing concentration of income and wealth at the top, and in a middle class that has had to go deeply into debt to maintain a decent standard of living.Persuasively and straightforwardly, Reich reveals how precarious our situation still is. The last time in American history when wealth was so highly concentrated at the top—indeed, when the top 1 percent of the population was paid 23 percent of the nation’s income—was in 1928, just before the Great Depression. Such a disparity leads to ever greater booms followed by ever deeper busts.Reich’s thoughtful and detailed account of where we are headed over the next decades reveals the essential truth about our economy that is driving our politics and shaping our future. With keen insight, he shows us how the middle class lacks enough purchasing power to buy what the economy can produce and has adopted coping mechanisms that have a negative impact on their quality of life; how the rich use their increasing wealth to speculate; and how an angrier politics emerges as more Americans conclude that the game is rigged for the benefit of a few. Unless this trend is reversed, the Great Recession will only be repeated.Reich’s assessment of what must be done to reverse course and ensure that prosperity is widely shared represents the path to a necessary and long-overdue transformation. Aftershock is a practical, humane, and much-needed blueprint for both restoring America’s economy and rebuilding our society.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "Business",
    "History",
    "Finance",
    "Sociology"
  ],
  "author": "Robert B. Reich",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/7845023-aftershock"
}