{
  "title": "The Princess in His Bed",
  "description": "“Hot enough to warm the coldest winter night.” Publishers Weekly.Inspired by three classic fairy tales—“The Emperor’s New Clothes,” “The Ugly Duckling,” and “The Princess and the Pea”—all in one romantic and steamy historical romance collection featuring three novellas from the acclaimed Fiery Tales series.The Marquis’s New Clothes: To save her cousin, Aimee de Miran must retrieve a jeweled ring from the most sinfully seductive man at court, the unsuspecting Marquis de Nattes. But to search his considerable wardrobe she'll have to get very close to the notorious rake...and remain immune to his intoxicating charm. Adam de Vey, Marquis de Nattes, has secretly burned for his best friend's wife for years. Now that Aimee is a widow, now that he's discovered her in his bedchambers, he intends to get very close to her indeed—with his clothes—and hers—utterly forgotten...The Lovely Duckling: Reputed for his carnal skills, notorious rake, Joseph d'Alumbert, prefers amorous encounters without any sort of emotional entanglement--until a most unique lady stirs tender feelings…and hot desire. Emilie de Sarron suffered burns to her body as an infant, and keeps her scars—and her heart—well hidden. But Joseph is determined to peel away her inhibitions, one slow, sensuous kiss at a time, to reveal the beautiful swan inside...The Princess and the Diamonds: Princess Gabrielle can't sleep at night. There is something hard in her bed. No, not just the stolen diamonds tucked under her mattress, but the handsome Marquis on it… whose talent in the art of pleasure no woman can resist. But he threatens her secret mission, and worse, she stands to lose far more than the diamonds—her heart is at stake…*The Princess in His Bed can be enjoyed as a stand-alone collection.*",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Erotica",
    "Anthologies",
    "Erotic Historical Romance",
    "Fairy Tales"
  ],
  "author": "Lila DiPasqua",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/7843731-the-princess-in-his-bed"
}