{
  "title": "To Change the World: The Irony, Tragedy, and Possibility of Christianity in the Late Modern World",
  "description": "The call to make the world a better place is inherent in the Christian belief and practice. But why have efforts to change the world by Christians so often failed or gone tragically awry? And how might Christians in the 21st century live in ways that have integrity with their traditions and are more truly transformative? In To Change the World, James Davison Hunter offers persuasive—and provocative—answers to these questions.Hunter begins with a penetrating appraisal of the most popular models of world-changing among Christians today, highlighting the ways they are inherently flawed and therefore incapable of generating the change to which they aspire. Because change implies power, all Christian eventually embrace strategies of political engagement. Hunter offers a trenchant critique of the political theologies of the Christian Right and Left and the Neo-Anabaptists, taking on many respected leaders, from Charles Colson to Jim Wallis and Stanley Hauerwas. Hunter argues that all too often these political theologies worsen the very problems they are designed to solve. What is really needed is a different paradigm of Christian engagement with the world, one that Hunter calls \"faithful presence\"—an ideal of Christian practice that is not only individual but institutional; a model that plays out not only in all relationships but in our work and all spheres of social life. He offers real-life examples, large and small, of what can be accomplished through the practice of \"faithful presence.\" Such practices will be more fruitful, Hunter argues, more exemplary, and more deeply transfiguring than any more overtly ambitious attempts can ever be.Written with keen insight, deep faith, and profound historical grasp, To Change the World will forever change the way Christians view and talk about their role in the modern world.",
  "genres": [
    "Theology",
    "Politics",
    "Nonfiction",
    "Christian",
    "Religion",
    "Christianity",
    "Cultural"
  ],
  "author": "James Davison Hunter",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/7846894-to-change-the-world"
}