{
  "title": "Younger Next Decade: After Fifty, the Transitional Decade, and What You Need to Know",
  "description": "Looking for straight talk when it comes to your health after fifty? Want sound advice for the decade Doctor Ebel calls the transitional decade and beyond? Want to know the why, what, and how to maximize your well-being before it’s too late?In fourteen chapters, Doctor Barbara writes with affability and in lay person’s language about bodily changes over fifty, smoking and its toll, diet and weight, alcohol, stress and caffeine, and exercise, to name a few. She touches on medical issues such as Diabetes and hypertension, and even the benefits and harm about sunshine. Dr. Ebel gives us suggested rules and guidelines to improve our health using many of her own examples. And to top off this insightful read? She brings on board new refreshing ideas and topics such as spirit, dogs, and productivity! a primary care physician practicing in a small town, I am always looking for resources that help patients understand how their diet and exercise habits impact their overall health. Recently, I had a chance to review Younger Next Decade by Dr. Barbara Ebel.In her book, Dr. Ebel focuses on lifestyle changes that can make a big difference in thwarting the effects of aging. Much of her material focuses on how age alters our bodies, with an emphasis on life after fifty. She does a good job of communicating medical information in layman’s terms, and she makes good points about why people should abandon unhealthy habits before they cause irreversible harm.Her chapters focus not only on aspects of physical health, like diet, exercise, and the dangers of smoking, but also on the importance of mental and spiritual health. At the end of each chapter, she makes practical suggestions on how one can make simple adjustments to start down the path of healthier living. Her tone is cheerful and encouraging – sort of like a motivational speaker – and mostly avoids finger wagging.I believe the book is a good resource for a person who is nearing that fiftieth birthday and wondering how to start a healthier living plan. As Dr. Ebel points out, taking care of both the physical and spiritual components of our health are necessary to make life after fifty more enjoyable.Steve Cooper, M.D.Smithville TN",
  "genres": [],
  "author": "Barbara Ebel",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/13083062-younger-next-decade"
}