{
  "title": "Firsting and Lasting: Writing Indians out of Existence in New England",
  "description": "Across nineteenth-century New England, antiquarians and community leaders wrote hundreds of local histories about the founding and growth of their cities and towns. Ranging from pamphlets to multivolume treatments, these narratives shared a preoccupation with establishing the region as the cradle of an Anglo-Saxon nation and the center of a modern American culture. They also insisted, often in mournful tones, that New England’s original inhabitants, the Indians, had become extinct, even though many Indians still lived in the very towns being chronicled. In Firsting and Lasting , Jean M. O’Brien argues that local histories became a primary means by which European Americans asserted their own modernity while denying it to Indian peoples. Erasing and then memorializing Indian peoples also served a more pragmatic colonial refuting Indian claims to land and rights. Drawing on more than six hundred local histories from Massachusetts, Connecticut, and Rhode Island written between 1820 and 1880, as well as censuses, monuments, and accounts of historical pageants and commemorations, O’Brien explores how these narratives inculcated the myth of Indian extinction, a myth that has stubbornly remained in the American consciousness. In order to convince themselves that the Indians had vanished despite their continued presence, O’Brien finds that local historians and their readers embraced notions of racial purity rooted in the century’s scientific racism and saw living Indians as “mixed” and therefore no longer truly Indian. Adaptation to modern life on the part of Indian peoples was used as further evidence of their demise. Indians did not—and have not—accepted this effacement, and O’Brien details how Indians have resisted their erasure through narratives of their own. These debates and the rich and surprising history uncovered in O’Brien’s work continue to have a profound influence on discourses about race and indigenous rights.",
  "genres": [
    "History",
    "Nonfiction",
    "Native American",
    "Native American History",
    "Indigenous",
    "American History",
    "Research"
  ],
  "author": "Jean M. O'Brien",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/7848227-firsting-and-lasting"
}