{
  "title": "Aristocrats: Power, Grace, and Decadence: Britain's Great Ruling Classes from 1066 to the Present",
  "description": "Aristocracy means “rule by the best.” For nine hundred years, the British aristocracy considered itself ideally qualified to rule others, make laws, and guide the nation. Its virtues lay in its collective wisdom, its attachment to chivalric codes, and its sense of public duty. It evolved from a medieval warrior caste into a self-assured and sophisticated elite, which made itself the champion of popular It forced King John to sign the Magna Carta and later used its power and wealth to depose a succession of tyrannical kings from Richard II to James II. Britain’s liberties and constitution were the result of aristocratic bloody-mindedness and courage. Aristocrats traces the history of this remarkable supremacy. It is a story of civil wars, conquests, intrigue, chicanery, and extremes of selflessness and greed. The aristocracy survived and, in the age of the great house and the Grand Tour, governed the first industrial nation while a knot of noblemen ruled its growing empire. Under pressure from below, this political power was slowly relinquished and then shared. Yet democratic Britain retained its Churchill, himself the grandson of a duke, presided over a wartime cabinet that contained six hereditary peers. Lawrence James illuminates the culture of this singular caste, shows how its infatuation with classical art has forged England’s heritage, how its love of sport has shaped the nation’s pastimes and values, and how its scandals have entertained its public. Impeccably researched, balanced, and brilliantly told, Aristocrats is an enthralling story of survival, a stunning history of wealth, power, and influence.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "British Literature",
    "Politics",
    "Research",
    "Historical"
  ],
  "author": "Lawrence James",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/7848737-aristocrats"
}