{
  "title": "SEEING THE LIBERTY, The Journey of Eve's Daughter",
  "description": "Sharon has seen angels her whole life. Why? This soul-penetrating true story of uncommon things occurring as adversity giving way to transforming redemption-leaves you feeling emotionally wrung out, stunned, inspired, and wanting more. Seeing The Liberty is a gripping tale told honestly. Spanning six decades, with all the walls down, Sharon reveals the bare gut-wrenching truth of her passage through terror into glorious meeting and speaking with God. An extraordinary explanation of the life and journey of a true Christian mystic who has been given by God the destiny of understanding the Mystical Marriage to Christ in direct awareness of God, and who has been chosen and commissioned by the Grace of God to tell the pathway of struggle that leads her to His Heart. She has been empowered to report all that she has seen and heard for the sake of His Kingdom. We have here a generational anomaly that is to be cherished and seen for the miracle that it is. Pick it up. Prepare to be shocked. You will be blessed. This is the book you will want everyone you know to read. The riveting true story draws you in as every sight, sound, taste, texture are wonderfully created. \"We have in our midst a true Christian Sharon Ellis. It is very rare but it is documented in the Church. I recommend everyone read Sharon's writings and share them.\" Dr. M.V. Myre, Old Testament Scholar, Christian Pastor, Ph.D. Hebrew Bible ______________________________________________________________________ And then the Angel said to me, \"I am Raphael. I am an angel of David's Lord. I come in the name of the Healer. Put on this habit, woman. Put on this holy habit.\" Sharon Roni Ellis is also the Author of Communions With Christ by Sharon Ellis",
  "genres": [],
  "author": "Sharon Roni Ellis",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/7852387-seeing-the-liberty-the-journey-of-eve-s-daughter"
}