{
  "title": "El diablo en la botella",
  "description": "Keawe es un hawaiano que siente la necesidad de conocer otras tierras, por lo que se dirige a San Francisco, Estados Unidos. Allí descubre una casa preciosa cuyo dueño parece algo triste y demacrado. Al entablar conversación con él y preguntarle el motivo de su tristeza, el viejo le enseña una botella de vidrio blanco en cuyo interior están todos los colores del arco iris. Asombrado por su belleza, el viejo le cuenta que en esa botella habita un demonio capaz de conceder cualquier deseo, excepto uno: alargar la vida a una persona. Para eso, el dueño de la botella debe cumplir una serie de requisitos: debe vender la botella a otra persona antes de morir o irá al infierno, el precio de venta deberá ser menor al que se obtuvo y el nuevo dueño debe ser consciente de este requisito. Keawe compra la botella y desea ser el dueño de una gran mansión en Hawái. El deseo se cumple: su tío y su primo fallecen en un accidente y él hereda una gran fortuna, con la cual puede construirse su nueva casa. Tras haber visto cumplir su sueño, Keawe vende la botella a un amigo y vive feliz en la que él llama la casa luminosa. Se casa con una bellísima mujer llamada Kokua y resulta que Keawe se enferma de lepra y por eso debería renunciar, no sólo a su mujer, si no a la casa para ir a vivir a una colonia de leprosos. Para evitar tal pesadilla, el hawaiano busca la botella de nuevo y descubre que ahora solo cuesta dos centavos: si la compra es posible que se convierta en el último dueño y, por tanto, vaya al infierno. Asumiendo esto, decide comprarla, puesto que con una mujer así vale la pena ir al infierno. La mujer, al darse cuenta de la situación de su marido, propone una solución: viajar a Tahití, donde cuatro céntimos son poco menos que un centavo, y vender allí la botella pero, a su llegada, descubren que los supersticiosos habitantes del lugar rehúsan comprar tal cosa.",
  "genres": [
    "Classics",
    "Short Stories",
    "Fiction",
    "Horror",
    "Fantasy",
    "Audiobook",
    "British Literature"
  ],
  "author": "Robert Louis Stevenson",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/7852273-el-diablo-en-la-botella"
}