{
  "title": "Altai",
  "description": "«Che segno è quando un arcobaleno appare, non c'è stata pioggia e l'aria è secca e tersa?È quando la terra sta per tremare, e il mondo intero vacilla».Quindici anni dopo l'epilogo di Q.Venezia, Anno Domini 1569. Un boato scuote la notte, il cielo è rosso e grava sulla laguna: è l'Arsenale che va a fuoco, si apre la caccia al colpevole. Un agente della Serenissima fugge verso oriente, smarrito, «l'anima rigirata come un paio di brache». Costantinopoli sarà l'approdo. Sulla vetta della potenza ottomana conoscerà Giuseppe Nasi, nemico e spauracchio d'Europa, potente giudeo che dal Bosforo lancia una sfida al mondo e a due millenni di oppressione.Intanto, ai confini dell'impero, un altro uomo si mette in viaggio, per l'ultimo appuntamento con la Storia. Porta al collo una moneta, ricordo del Regno dei Folli.Echi di rivolte, intrighi, scontri di civiltà. Nuove macchine scatenano forze inattese, incalzano il tempo e lo fanno sbandare. Nicosia, Famagosta, Lepanto: uomini e navi corrono verso lo scontro finale.Wu Ming, il collettivo di scrittori che al suo esordio si firmò «Luther Blissett», torna nel mondo del suo primo romanzo.«Molti credono che il Signore disperse le lingue degli uomini per punirli, ma è l'esatto contrario. Egli vide che l'uniformità li rendeva superbi, dediti a imprese tanto eccessive quanto inutili. Allora si rese conto che l'umanità aveva bisogno di un correttivo e ci fece dono delle differenze.Cosí i muratori, di costumi e fedi diversi, devono trovare un modus vivendi che consenta di portare a termine l'edificio».«- Tu hai mai avuto un sogno, Manuel?La risposta uscí come un singulto.- Sí, non essere giudeo. Fu mio padre ad avverarlo.- Ti capisco piú di quanto non immagini. Perché rimanere deboli quando si può diventare forti?Ma io non mi accontento di trasformare me stesso. Voglio trasformare un popolo. Da debole a forte. Da diviso a unito. Da ospite mal sopportato a padrone del proprio destino. Da fuggiasco a protettore di chi fugge. Sono millecinquecento anni che scappiamo. È giunto il momento di fermarci».",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Italian Literature",
    "Historical Romance",
    "Italy",
    "Novels",
    "Historical"
  ],
  "author": "Wu  Ming",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/7852660-altai"
}