{
  "title": "Love, Greg & Lauren",
  "description": "Early on the morning of September 11, 2001, Lauren Manning-a wife, the mother of a ten-month-old son, and a senior vice president and partner at Cantor Fitzgerald-came to work, as always, at One World Trade Center. As she stepped into the lobby, a fireball exploded from the elevator shaft, and in that split second her life was changed forever.Lauren was burned over 82.5 percent of her body. As he watched his wife lie in a drug-induced coma in the ICU of the Burn Center at New York-Presbyterian Hospital, Greg Manning began writing a daily journal. In the form of e-mails to family, friends, and colleagues, he recorded Lauren’s harrowing struggle-and his own tormented efforts to make sense of an act that defies all understanding. This book is that e-mail detailed, intimate, inspiring messages that end, always, as if a prayer for a happy LOVE, GREG & LAURENWe share this story day by astonishing day. Greg writes of the intricate surgeries, the painful therapies, and the constant risk of infection Lauren endured. Through his eyes we come to know the doctors, nurses, aides, and therapists who cared for her around the clock with untiring devotion and sensitivity. We also come to know the families with whom he shared wrenching hospital vigils for their own loved ones who were waging a battle that some would not win.It was, most of all, Greg’s belief that Lauren would win her brave fight for life that kept him writing. Through his eyes we see what she could not-their toddler’s first steps, the video of his first birthday party, the compassionate messages of hope from around the world. And we are there as Lauren gradually emerges into awareness, signaling first with her eyes, then with smiles, her understanding of the words Greg speaks to her, the poems he recites, the songs he plays.Most miraculously, we are there when Lauren walks out of the Burn Center.The world knows all too well both the nightmare and the heroism that have marked this terrible time in history. But no account of September 11 matches the astonishing personal story Greg Manning records in these spontaneous and heartfelt pages. It is a story that invites us to share, e-mail after e-mail, the perilous course of a mortally wounded woman who by sheer will and courage emerges from near death because she is determined to live for her husband and her son. And it is equally the story of a man who, as he stays by her side through these long weeks and months, discovers anew the depth of his love and admiration for the woman who becomes his hero.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Biography Memoir",
    "Autobiography",
    "Inspirational",
    "Medical"
  ],
  "author": "Greg Manning",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/785253.Love_Greg_Lauren"
}