{
  "title": "The Paris Vendetta",
  "description": "NEW YORK TIMES BESTSELLER •  “All the Steve Berry hallmarks are scale, scope, sweep, history—plus breathless second-by-second suspense. I love this guy.”—Lee ChildFormer Justice Department operative Cotton Malone wakes to find an intruder in his Copenhagen an American Secret Service agent with assassins on his heels. Narrowly surviving a ferocious firefight, the two journey to the secluded estate of Malone’s friend Henrik Thorvaldsen. The wily Danish tycoon has uncovered the insidious plans of the Paris Club, a cabal of multimillionaires bent on manipulating the global economy. But Thorvaldsen also harbors a hidden agenda—a vendetta—that will force Malone to choose between friend and country, past and present. Starting in Denmark, moving to England, and ending up in the storied streets and cathedrals of Paris, Malone is forced to match wits with a terrorist for hire and to plunge into a desperate hunt for Napoleon’s legendary treasure, lost for two hundred years. It’s a breathless game of duplicity and death, all to claim a prize of untold value. But at what cost? This edition contains an excerpt from Steve Berry’s  The Columbus Affair  and a Cotton Malone dossier.Praise for The Paris Vendetta“Outstanding . . . Berry has become the modern master of the thriller form.” — Providence Journal-Bulletin“Thrilling . . . exciting and fast-paced . . . a worthy addition to a fine series.” —Wichita Falls Times Record News“Steve Berry gets better and better with each new book. . . . [In The Paris Vendetta ] there are assassination plots, searches for hidden treasure, battles between enemies and even friends, and a taste of romance. . . . Bring on the next one!” — The Huffington Post“This well-crafted thriller also offers plenty of surprises.” — Publishers Weekly “Berry has written another amazing blend of suspense and history. Fans will love it, and for newcomers it’s the perfect place to start. . . . [Readers] cannot go wrong with Cotton Malone.” — Library Journal",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Adventure",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Steve Berry",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/7860011-the-paris-vendetta"
}