{
  "title": "Born Into Crisis: A Memoir",
  "description": "\"This powerful and touching memoir, Nixon's debut, recounts a young man's journey with his mother and her struggle with mental illness—and the deeply troubled systems meant to offer support..\" —Booklife Review  Chanticleer International Book Award FinalistIndies Today Best Nonfiction (2022) The American mental health system is in crisis, and those affected by its shortcomings are drowning without the tools and resources they deserve and need to thrive. In Born Into Crisis, author Kenneth Nixon shares his story of growing up with a mother with severe mental illness and a family stuck in an enduring cycle of trauma. He knows firsthand the impact trauma can have on a person's life. Kenneth not only takes you on a powerful journey through his stories, he provides cogent and practical strategies for creating lasting change in our mental health system. Born Into Crisis is more than just a story of resiliency. It's also a call to action.Editorial Reviews:\"This powerful and touching memoir...Nixon tells the story of his upbringing in emotionally charged prose….he offers a survivor’s clear-eyed assessment of the system itself, helpful breakdowns of new approaches like the Crisis Now model…The book’s power comes from Nixon’s examination of the toll that living with untreated mental illness can wreak upon a family and the helpful, often inspiring advice and examples Nixon offers.\" - Booklife Review “The strategies in Born Into Crisis will serve as a boon to any who are suffering the vicious pains of mental illness.” – Indies Today\"Thought-provoking and inspiring, Nixon's book delicately explores pain, loss, depression, grief, and how his steadfast belief in God has always helped him keep his head above water. This memoir-cum-self-help story will stir your soul. If you’re looking for something honest and evocative, Born into Crisis is ideal.\" - Readers Favorite Review\"The title of Nixon’s memoir is perfectly apt—the moment of his birth was a genuine crisis. . . .the author’s courage and candor are impressive. . .\"- Kirkus Reviews",
  "genres": [
    "Memoir",
    "Biography Memoir",
    "Mental Health",
    "Nonfiction"
  ],
  "author": "Kenneth Nixon Jr.",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/78599906-born-into-crisis"
}