{
  "title": "Cobra Guardian",
  "description": "Exciting Military Science Fiction by the New York Times Best-Selling Author. The Second Novel in a New Trilogy Continuing the Exploits of the Cobras: a New Kind of Soldier, Created for a New Kind of War.When the colony worlds Adirondack and Silvern fell to the Troft forces almost without a struggle. Outnumbered and on the defensive, Earth made a desperate decision. It would attack the aliens not from space, but on the ground—with forces the Trofts did not even suspect. Thus were created the Cobras, a guerilla force whose weapons were surgically implanted, invisible to the unsuspecting eye, yet undeniably deadly. And the Moreau family were the most famous of the Cobra warriors. Long after victory over the Troft was achieved, the Cobras made common cause against their former adversaries against a new enemy. Their reward was three planets that would be a home for the Cobras, who deadly powers made them too dangerous to feel at home on Earth. Now, years had passed and not everyone on the Cobra worlds thought that the Cobras were worth the cost of maintaining their existing built-in weaponry, let alone supporting research to improve the Cobra weapons, and possibly even put an end to the negative effects of that built-in weaponry, which caused Cobras to die much too young. Many who had never known interplanetary war were convinced that the Cobras were not needed at all.  That was a grave miscalculation, because a Troft faction has decided to invade the Cobra planets in force, using a new strategy that even the formidable Cobra warriors may not be able to defeat . . .  Praise for Timothy Zahn:“Zahn keeps the story moving at a breakneck pace, maintaining excitement [in Dragon and Thief].” —Publishers Weekly“[Conqueror’s Heritage] is another finely wrought space adventure . . . [with] social, political and emotional complications, all of which Zahn treats with his usual skill.” —Booklist“Zahn paints every detail [in Angelmass] with gleamy realism . . . scientific dialogue that streams with starship hardware and military trooper talk . . . immensely appealing.” —Kirkus Review",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Space Opera",
    "Military Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Audiobook"
  ],
  "author": "Timothy Zahn",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/7857043-cobra-guardian"
}