{
  "title": "The Realm of the Unreal and Other Stories",
  "description": "(from publisher's website)'Early one June morning in 1872 I murdered my father – an act which made a deep impression on me at the time' AN IMPERFECT CONFLAGRATIONAmbrose Bierce, author of the mordantly witty satire The Devil’s Dictionary – a long established Folio favourite – was also one of the most talented short-story writers of his day, renowned for his blackly comic fantasies. This collection, introduced by novelist Will Self, is the ideal way to enjoy his gripping tales. Bierce’s fascination with the surreal made him a brilliant writer of ghost and horror stories, as shown in the title story of this collection which features an unnerving encounter with the mysterious hypnotist Dr Dorrimore. In the eerie ‘The Man and the Snake’, a man is hypnotised and killed by an enormous serpent – which turns out to be only a stuffed toy.‘He will remain one of our greatest wits, one of our most uncompromising satirists’CLIFTON FADIMANBierce fought in the Civil War and his experiences left him with an indelible sense of the horror of conflict, evident in his most famous story, ‘An Occurrence at Owl Creek Bridge’, about a Confederate sympathiser captured by Union soldiers, which has an inimitable twist in its tail. The Civil War also forms the backdrop of ‘Killed at Resaca’, in which a young woman’s exhortation to courage has tragic consequences. This wonderful collection of more than 90 stories spans Bierce’s long and enterprising career, from his time as a journalist in San Francisco to his final foray into revolutionary Mexico in 1913 – a last adventure from which he never returned.‘Bierce, the chastiser of obtuseness, sentiment, greed, and malice … is a valued companion’ M. A. SCHAFFNER=============Bound in buckram.568 pages; frontispiece and 10 black & white etchings by Nathan Sissons.Size: 9½\" × 6¼\".",
  "genres": [
    "Short Stories",
    "Horror",
    "Fiction"
  ],
  "author": "Ambrose Bierce",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/7864166-the-realm-of-the-unreal-and-other-stories"
}