{
  "title": "Animals Without Backbones: An Introduction to the Invertebrates",
  "description": "Animals Without Backbones has been considered a classic among biology textbooks since it was first published to great acclaim in 1938. It was the first biology textbook ever reviewed by Time and was also featured with illustrations in Life . Harvard, Stanford, the University of Chicago, and more than eighty other colleges and universities adopted it for use in courses. Since then, its clear explanations and ample illustrations have continued to introduce hundreds of thousands of students and general readers around the world to jellyfishes, corals, flatworms, squids, starfishes, spiders, grasshoppers, and the other invertebrates that make up ninety-seven percent of the animal kingdom.This new edition has been completely rewritten and redesigned, but it retains the same clarity and careful scholarship that have earned this book its continuing readership for half a century. It is even more lavishly illustrated than earlier editions, incorporating many new drawings and photographs. Informative, concise legends that form an integral part of the text accompany the illustrations. The text has been updated to include findings from recent research. Eschewing pure morphology, the authors use each group of animals to introduce one or more biological principles.In recent decades, courses and texts on invertebrate zoology at many universities have been available only for advanced biology majors specializing in this area. The Third Edition of Animals Without Backbones remains an ideal introduction to invertebrates for lower-level biology majors, nonmajors, students in paleontology and other related fields, junior college and advanced high school students, and the general reader who pursues the rewarding study of the natural world.",
  "genres": [
    "Biology",
    "Science",
    "Nonfiction",
    "Animals"
  ],
  "author": "Ralph Buchsbaum",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/786315.Animals_Without_Backbones"
}