{
  "title": "The Hungry Ghosts",
  "description": "'A stunning debut' Woman & Home Winner of Amazon's 'Rising Stars' competition Shortlisted for The Commonwealth Writer's Prize 2010 Shortlisted for The Waterstones Book Circle Award Shortlisted for The Desmond Elliott Prize Japanese occupied Hong Kong, 1942. Raped then murdered, Lin Shui's 'Hungry Ghost' clings tenaciously to life. Holing up in a hospital morgue, destined to become a school, just in time she finds a host off whom to feed. It is 12-year-old Alice Safford, the deeply-troubled daughter of a leading figure in government. The parasitic ghost follows her to her home on the Peak. There, the lethal mix of the two, embroiled in the family's web of dark secrets and desperate lies, unleashes chaos. All this unfolds against a background of colonial unrest, riots, extremes of weather and the countdown to the return of the colony to China. As successive tragedies engulf Alice, her ghostly entourage swells alarmingly. She flees to England, then France, in a bid to escape the past, only to find her portable 'Hungry Ghosts' have accompanied her. It seems the peace she longs for is to prove far more elusive that she could ever have imagined. The Hungy Ghosts is a remarkable tour-de-force of the imagination, full of instantly memorable characters whose lives intermesh and boil over in a cauldron of domestic mayhem, unleashing unworldly spirits into the troubled air. ---------------'As heart-rending as it is innovative, The Hungry Ghosts heralds Berry as an original new voice in fiction' Time Out 'This is a novel as breezy as the best summer reads, yet secrets and deadly jealousy seethe at its core...engrossing' Daily Mail 'A stunning debut...Epic in scope and voice...so skilfully crafted, and the writing so elegant, it's hard to believe it is a first novel' Globe and Mail '[A] brilliant, brittle portrayal of colonial Hong Kong' Psychologies 'The vivid, sensory depictions of Hong Kong circa 1970 ignite this almost unrelentingly sad story, and Berry's easy way of switching between different narrative voices from chapter to chapter is impressive' List",
  "genres": [
    "Fiction",
    "Horror",
    "Historical Fiction",
    "Fantasy",
    "Historical",
    "Mystery",
    "Modern"
  ],
  "author": "Anne Berry",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/7865229-the-hungry-ghosts"
}