{
  "title": "La Cazadora de Profecías",
  "description": "Hubo un tiempo lejano en el que el Continente Norte y el Continente Sur convivían en armonía, separados por el Largo Mar. Pero la paz no dura siempre… En una época en que la magia ya no es sólo potestad de los pueblos feéricos, en un mundo en que el Continente Norte está amenazado por Esigion de Maelvania, el terrible nigromante que lidera el Continente Sur, los pueblos libres tienen que olvidar sus antiguas rencillas y permanecer unidos para sobrevivir. Elfos, Humanos y Enanos tratarán de deshacerse del enemigo común, pero una nueva amenaza se cierne sobre la Triple Alianza del Norte haciéndola peligrar. Oscuros secretos, una peligrosa Profecía, un Vampiro de ocultos designios, trasgos, chupasangres, guls y recuerdos del pasado… los sucesos que se avecinan ocultarán el hecho de que el verdadero enemigo, el que puede decidir el final de la guerra, se encuentra entre las propias filas de la Alianza. Y es un enemigo letal.La Cazadora de profecías relata la historia de un futuro que ya está preescrito. La Elfa de la noche Eyrien de Siarta se enfrenta a la más ardua de sus tareas como Cazadora: neutralizar a los futuros dirigentes de los Reinos Humanos Libres, el príncipe y el Alto humano a quienes las estrellas apuntan como futuros traidores a la Alianza. Mientras esto sucede, la guerra contra Maelvania continúa desarrollándose de forma encubierta. Los guls han atracado en elcontinente norte y amenazan con provocar una carnicería en Sentrist, la Alianza debe acudir en su ayuda. De camino al sur, Eyrien continúa sin decidir si debe asesinar a los jóvenes acusados sin que hayan llegado a cometer su crimen, los mismos chicos a los que ella había jurado proteger, los mismos que le han salvado de un vampiro que está determinado a perseguirla y matarla para hacerse con su poder. La Última Profecía ha hilado el destino de muchos en una red oscura y el final de la guerra milenaria se precipita, para bien o para mal de la Alianza. Porque tal como decían los Sabios tiempo atrás, es peligroso leer en las estrellas…",
  "genres": [],
  "author": "Carolina Lozano",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/7864316-la-cazadora-de-profec-as"
}