{
  "title": "The Most Powerful Idea in the World: A Story of Steam, Industry, and Invention",
  "description": "If all measures of human advancement in the last hundred centuries were plotted on a graph, they would show an almost perfectly flat line—until the eighteenth century, when the Industrial Revolution would cause the line to shoot straight up, beginning an almost uninterrupted march of progress.   In The Most Powerful Idea in the World , William Rosen tells the story of the men responsible for the Industrial Revolution and the machine that drove it—the steam engine. In the process he tackles the question that has obsessed historians ever What made eighteenth-century Britain such fertile soil for inventors? Rosen’s answer focuses on a simple notion that had become enshrined in British law the century that people had the right to own and profit from their ideas.   The result was a period of frantic innovation revolving particularly around the promise of steam power. Rosen traces the steam engine’s history from its early days as a clumsy but sturdy machine, to its coming-of-age driving the wheels of mills and factories, to its maturity as a transporter for people and freight by rail and by sea. Along the way we enter the minds of such inventors as Thomas Newcomen and James Watt, scientists including Robert Boyle and Joseph Black, and philosophers John Locke and Adam Smith—all of whose insights, tenacity, and ideas transformed first a nation and then the world. William Rosen is a masterly storyteller with a keen eye for the “aha!” moments of invention and a gift for clear and entertaining explanations of science. The Most Powerful Idea in the World will appeal to readers fascinated with history, science, and the hows and whys of innovation itself.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Technology",
    "Business",
    "Economics",
    "Engineering"
  ],
  "author": "William Rosen",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/7863046-the-most-powerful-idea-in-the-world"
}