{
  "title": "The Obsession",
  "description": "A lonely man suffering from addiction meets his savior. But can the charming male psychology student truly love and save him?Tristan Tolken feels invisible most of the time, which is fine by him. After suffering years of abuse by a mother who won’t accept his attraction to men, he’s fallen into sexual addiction. His only relief is to lose himself in his artwork and yearn for Collin from afar. There’s no way Collin could ever notice him, right?Collin Stanley has the self-confidence and smarts to be starting his master’s degree in psychology early, but he has a problem. After only a few months, he’s been kicked out of his apartment and can only find a room in the dorm. When he strolls into his new room, he’s shocked to find Tristan there. He’s had his eye on Tristan. Tristan’s unusual habits are fascinating, but Tristan’s completely shut down. Will Tristan let him in?Collin figures out Tristan’s obsession right away and knows that he’s the one who can fix him. But fixing Tristan leaves Collin with emotions he didn’t count on and his own fear of falling in love surfaces. As Tristan heals with Collin’s help, Collin hides a deep secret. This secret threatens their relationship and could throw Tristan back into a lonely life of addiction. As the secret is revealed, how can Collin redeem himself and not destroy Tristan in the process?The Obsession is a standalone M/M romance novel. It is a dark, hurt/comfort, roommate romance with an HFN and no cliffhangers. It features an insecure young artist struggling to live his life, longing for love, and a confident young man with his own issues who wants to help. This book is a re-release of a book with the same name and has been extensively edited.Trigger Warning: This book deals with a parental abuse, both emotional and physical from an alcoholic mother. There are also themes of sexuality prejudice.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Gay",
    "Mental Illness"
  ],
  "author": "Christie Gordon",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/7861524-the-obsession"
}