{
  "title": "The Bourgeois Virtues: Ethics for an Age of Commerce",
  "description": "For a century and a half, the artists and intellectuals of Europe have scorned the bourgeoisie. And for a millennium and a half, the philosophers and theologians of Europe have scorned the marketplace. The bourgeois life, capitalism, Mencken’s “booboisie” and David Brooks’s “bobos”—all have been, and still are, framed as being responsible for everything from financial to moral poverty, world wars, and spiritual desuetude. Countering these centuries of assumptions and unexamined thinking is Deirdre McCloskey’s The Bourgeois Virtues , a magnum opus that offers a radical capitalism is good for us.McCloskey’s sweeping, charming, and even humorous survey of ethical thought and economic realities—from Plato to Barbara Ehrenreich—overturns every assumption we have about being bourgeois. Can you be virtuous and bourgeois? Do markets improve ethics? Has capitalism made us better as well as richer? Yes, yes, and yes, argues McCloskey, who takes on centuries of capitalism’s critics with her erudition and sheer scope of knowledge. Applying a new tradition of “virtue ethics” to our lives in modern economies, she affirms American capitalism without ignoring its faults and celebrates the bourgeois lives we actually live, without supposing that they must be lives without ethical foundations.High Noon , Kant, Bill Murray, the modern novel, van Gogh, and of course economics and the economy all come into play in a book that can only be described as a monumental project and a life’s work. The Bourgeois Virtues is nothing less than a dazzling reinterpretation of Western intellectual history, a dead-serious reply to the critics of capitalism—and a surprising page-turner.",
  "genres": [
    "Economics",
    "History",
    "Philosophy",
    "Politics",
    "Nonfiction",
    "Business",
    "Sociology"
  ],
  "author": "Deirdre Nansen McCloskey",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/786362.The_Bourgeois_Virtues"
}