{
  "title": "The Honey Prescription: The Amazing Power of Honey as Medicine",
  "description": "Explores the latest scientific research on the healing powers of honey• Explains the physiological reasons why honey is so effective and includes recipes for honey-based remedies for many different ailments• Discusses the sacred role of bees from ancient Egypt to modern times and the problem of Colony Collapse Disorder (with methods for protecting hives)• Reveals the healing power of honey for many common problems--from burns, ulcers, and conjunctivitis to tooth decay, diabetes, and cystic fibrosis--and honey’s ability to kill superbugs like E. coliThe use of honey as a healing agent is nothing new. It was an ingredient in medicinal compounds and cures made by Egyptian physicians 5,000 years ago, and its medical use has been found in other ancient practices from traditional Chinese medicine and Indian Ayurveda to Mayan shamanism. In the past ten years there has been an explosion in scientific research on honey as medicine at universities, research centers, and medical clinics around the world.Presenting the very latest scientific and medical evidence of the healing properties of honey--including that from the Honey Research Unit at the University of Waikato in New Zealand--Nathaniel Altman explores the broad spectrum of medicinal uses of honey and how these remedies can be used safely at home as well as by licensed health practitioners. He includes an extensive selection of honey-based recipes that can be used to treat common health problems--from burns, conjuctivitis, and ulcers to tooth decay, diabetes, and cystic fibrosis. He explains the physiological reasons why honey is so effective in treating antibiotic-resistant diseases with no side effects and honey’s ability to kill “superbugs” like E. coli and MRSA (Methicillin-resistant Staphylococcus aureus ). Drawing on centuries of material from historical and folk medicine sources, he also examines the sacred role of bees from ancient Egypt onward and the modern problem of Colony Collapse Disorder, including methods for protecting our precious hives.",
  "genres": [
    "Health",
    "Medicine"
  ],
  "author": "Nathaniel Altman",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/7875489-the-honey-prescription"
}