{
  "title": "The Blackfeet Boys - Part I: Warriors By Day - Lovers By Night",
  "description": "History often proclaimed the Blackfeet Indians as the most feared of all the North American tribes, who thought nothing of committing the cold-blooded massacre of the warriors protecting another village, but also the slaughtering of old and young alike, including women, children, and their dogs. They fought with overwhelming brutality, and felt no remorse for those they destroyed. Blackfeet warriors spilled the blood of their enemies everywhere, including onto their own bodies as a symbol of their triumph. Their battle-axes, clubs, tomahawks, and spears were permanently stained with blood. They fought to steal, to overwhelm, and to survive. Men that celebrate their shared love is against tribal laws, and the custom is to either cast out or kill the offending boys. Windtalker and Kiyo grew up using their excellent hunting skills to keep the village supplied with fresh game. During the winter season, when the tribe moves into the deep gorges to escape the frigid winds and deep snows, the fighters teach the young men to attack like warriors by killing without mercy. The young men are exceptional with bows and arrows, accurate with spears, and deadly with battle-axes. By spring, they devise a plan to leave the village by riding across the treacherous ridges and rivers in the Glacier Mountains. Collecting their cache of supplies and weapons, they make their escape, seeking a secret valley far from home. They make many discoveries along the way, including befriending a settler family, and aiding the cavalry against the fierce, bloodthirsty renegades. They endeavor to carve out a life together in a valley so remote, they hope no one will ever find their new home. Their skills as hunters and warriors are often put to the test, but nothing can separate or challenge the love of The Blackfeet Boys.",
  "genres": [
    "M M Romance",
    "Native American"
  ],
  "author": "T.J. Johnson",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/7868666-the-blackfeet-boys---part-i"
}