{
  "title": "The Mythic Image",
  "description": "A paperback edition of Campbell's major study of the mythology of the world's high civilizations over five millennia. It includes nearly 450 illustrations. The text is the same as that of the 1974 edition.Mythologist Joseph Campbell was a masterful storyteller, able to weave tales from every corner of the world into compelling, even spellbinding, narratives. His interest in comparative mythology began in childhood, when the young Joe Campbell was taken to see Buffalo Bill's Wild West Show at Madison Square Garden. He started writing articles on Native American mythology in high school, and the parallels between age-old myths and the mythic themes in literature and dreams became a lifelong preoccupation. Campbell's best-known work is The Hero with a Thousand Faces (1949), which became a New York Times paperback best-seller for Princeton in 1988 after Campbell's star turn on the Bill Moyers television program The Power of Myth.During his early years as a professor of comparative religion at Sarah Lawrence College, Campbell made the acquaintance of Indologist Heinrich Zimmer, a kindred spirit who introduced him to Paul and Mary Mellon, the founders of Bollingen Series. They chose Campbell's The Mythic Image as the culmination of the series, giving it the closing position--number one hundred. A lavishly illustrated and beautifully produced study of the mythology of the world's high civilizations, The Mythic Image received a front-cover review in the New York Times Book Review upon publication. Through the medium of visual art, the book explores the relation of dreams to myth and demonstrates the important differences between oriental and occidental interpretations of dreams and life.",
  "genres": [
    "Mythology",
    "Nonfiction",
    "History",
    "Philosophy",
    "Art",
    "Religion",
    "Psychology"
  ],
  "author": "Joseph Campbell",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/787565.The_Mythic_Image"
}