{
  "title": "Pink Noises: Women on Electronic Music and Sound",
  "description": "Pink Noises brings together twenty-four interviews with women in electronic music and sound cultures, including club and radio DJs, remixers, composers, improvisers, instrument builders, and installation and performance artists. The collection is an extension of Pinknoises.com, the critically-acclaimed website founded by musician and scholar Tara Rodgers in 2000 to promote women in electronic music and make information about music production more accessible to women and girls. That site featured interviews that Rodgers conducted with women artists, exploring their personal histories, their creative methods, and the roles of gender in their work. This book offers new and lengthier interviews, a critical introduction, and resources for further research and technological engagement. Contemporary electronic music practices are illuminated through the stories of women artists of different generations and cultural backgrounds. They include the creators of ambient soundscapes, “performance novels,” sound sculptures, and custom software, as well as the developer of the Deep Listening philosophy and the founders of the Liquid Sound Lounge radio show and the monthly Basement Bhangra parties in New York. These and many other artists open up about topics such as their conflicted relationships to formal music training and mainstream media representations of women in electronic music. They discuss using sound to work creatively with structures of time and space, and voice and language; challenge distinctions of nature and culture; question norms of technological practice; and balance their needs for productive solitude with collaboration and community. Whether designing and building modular synthesizers with analog circuits or performing with a wearable apparatus that translates muscle movements into electronic sound, these artists expand notions of who and what counts in matters of invention, production, and noisemaking. Pink Noises is a powerful testimony to the presence and vitality of women in electronic music cultures, and to the relevance of sound to feminist concerns. Maria Chavez, Beth Coleman (M. Singe), Antye Greie (AGF), Jeannie Hopper, Bevin Kelley (Blevin Blectum), Christina Kubisch, Le Tigre, Annea Lockwood, Giulia Loli (DJ Mutamassik), Rekha Malhotra (DJ Rekha), Riz Maslen (Neotropic), Kaffe Matthews, Susan Morabito, Ikue Mori, Pauline Oliveros, Pamela Z, Chantal Passamonte (Mira Calix), Maggi Payne, Eliane Radigue, Jessica Rylan, Carla Scaletti, Laetitia Sonami, Bev Stanton (Arthur Loves Plastic), Keiko Uenishi (o.blaat)",
  "genres": [
    "Music",
    "Nonfiction",
    "Feminism",
    "Gender",
    "Gender Studies",
    "Academic"
  ],
  "author": "Tara Rodgers",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/7882129-pink-noises"
}