{
  "title": "Spiritual Enlightenment, the Damnedest Thing: Book One of The Enlightenment Trilogy",
  "description": "From a spiritual master unlike any,a spiritual masterpiece like no other. AUTHOR, TEACHER AND SPIRITUAL MASTER Jed McKenna tells it like it's never been told before. A true American original, Jed succeeds where countless others have failed by reducing this highest of attainments — Spiritual Enlightenment — to the simplest of terms. Effectively demystifying the mystical, Jed astonishes the reader not by adding to the world's collected spiritual wisdom, but by taking the spirituality out of spiritual enlightenment. Never before has this elusive topic been treated in so engaging and accessible a manner. A masterpiece of illuminative writing, Spiritual Enlightenment is mandatory reading for anyone following a spiritual path. Part exposé and part how-to manual, this is the first book to explain why failure seems to be the rule in the search for enlightenment — and how the rule can be broken. _________________________________ Comments about Jed McKenna's Enlightenment Trilogy. “Jed McKenna is an American original.” -Lama Surya Das “Absolutely marvelous, splendid, perfect books!” -Shri Acharya “These books have profoundly changed my life.” -C. Jensen “These three books are precious gifts to humanity.” -E. De Vries “Thank you for the books. I’ve been waiting all my life for them.” -C. Vankeith “I can think of no other author I’d recommend more highly.” -M.R. Fleming \"I say an eternal thank you for the Trilogy. The books continue to challenge my mind and life. I ordered my 4th complete set. Nothing compares to this writing.\" -J.H. \"If you are ready, step into Jed's world. It is intelligent and powerful.\" -J. Katz Visit Wisefool Press to learn more about Jed McKenna's Enlightenment Trilogy and Dreamstate Trilogy. _________________________________",
  "genres": [
    "Spirituality",
    "Philosophy",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Religion",
    "Personal Development"
  ],
  "author": "Jed McKenna",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/7889709-spiritual-enlightenment-the-damnedest-thing"
}