{
  "title": "History of the Siege of Boston, and of the Battles of Lexington, Concord, and Bunker Hill; Also an Account of the Bunker Hill Monument. with Illustrative Documents",
  "description": "This historic book may have numerous typos and missing text. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1896 Excerpt: ...war of unmeasured extent and uncertain issue. All America and all England were likely to be deeply concerned in the consequences. The individuals themselves, who knew full well what agency they had had in bringing affairs to this crisis, had need of all their courage;--not that disregard of personal safety, in which the vulgar suppose true courage to consist, but that high and fixed moral sentiment, that steady and decided purpose, which enables men to pursue a distant end, with a full view of the difficulties and dangers before them, and with a conviction, that, before they arrive at the proposed end, should they ever reach it, they must pass through evil report as well as good report, and be liable to obloquy as well as to defeat. \"Spirits that fear nothing else, fear disgrace; and this danger is necessarily encountered by those who engage in civil war. Unsuccessful resistance is not only ruin to its authors, but is esteemed, and necessarily so, by the laws of all countries, treasonable. This is the case at least till resistance becomes so general and formidable as to assume the form of regular war. But who can tell, when resistance commences, whether it will attain even to that degree of success? Some of those persons who signed the Declaration of Independence in 1776 described themselves as signing it 'as with halters about their necks.1 If there were grounds for this remark in 1776, when the cause had become so much more general, how much greater was the hazard when the battle of Bunker Hill was fought!\" \"These considerations constituted, to enlarged and liberal minds, the moral sublimity of the occasion; while to the outward, senses, the movement of armies, the roar of artillery, the brilliancy of the reflection of a summer's sun from t...",
  "genres": [],
  "author": "Richard Frothingham",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/7892287-history-of-the-siege-of-boston-and-of-the-battles-of-lexington-concord"
}