{
  "title": "The Thousand",
  "description": "Kevin Guilfoile’s riveting follow-up to Cast of Shadows (“spellbinding”— Chicago Tribune; “a masterpiece of intelligent plotting”— Salon ) centers on an extraordinary young woman’s race to find her father’s killer and to free herself from the cross fire of a centuries-old civil war in which she has unknowingly become ensnared.In 530 B.C., a mysterious ship appeared off the rainy shores of Croton, in what is now Italy. After three days the skies finally cleared and a man disembarked to address the curious and frightened crowd that had gathered along the wet sands. He called himself Pythagoras. Exactly what he said that day is unknown, but a thousand men and women abandoned their lives and families to follow him. They became a community. A school. A cult dedicated to the search for a mathematical theory of everything. Although Pythagoras would die years later, following a bloody purge, his disciples would influence Western philosophy, science, and mathematics for all time.Chicago, the present day. Canada Gold, a girl both gifted and burdened by uncanny mental abilities, is putting her skills to questionable use in the casinos and courthouses of Las Vegas when she finds herself drawn back to the city in which her father, the renowned composer Solomon Gold, was killed while composing his magnum opus. Beautiful, brilliant, troubled, Canada has never heard of the Thousand, a clandestine group of powerful individuals safeguarding and exploiting the secret teachings of Pythagoras. But as she struggles to understand her father’s unsolved murder, she finds herself caught in the violence erupting between members of the fractured ancient cult while she is relentlessly pursued by those who want to use her, those who want to kill her, and the one person who wants to save her.In an irresistibly ambitious novel that fuses historical fact with contemporary suspense, Kevin Guilfoile delivers an erudite, propulsively entertaining thriller that seamlessly traverses the realms of math, science, music, and philosophy. The Thousand is ringing confirmation of Guilfoile’s enormous talent.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Crime",
    "Mystery Thriller",
    "Suspense",
    "Conspiracy Theories"
  ],
  "author": "Kevin Guilfoile",
  "average_rating": "2.96",
  "url": "https://www.goodreads.com/book/show/7891628-the-thousand"
}