{
  "title": "Tomb of the Golden Bird",
  "description": "Convinced that the tomb of the little-known king Tutankhamon lies somewhere in the Valley of the Kings, eminent Egyptologist Radcliffe Emerson and his intrepid wife, Amelia Peabody, seem to have hit a wall. Having been banned forever from the East Valley, Emerson, against Amelia's advice, has tried desperately to persuade Lord Carnarvon and Howard Carter to relinquish their digging rights. But Emerson's trickery has backfired, and his insistent interest in the site has made his rivals all the more determined to keep the Emerson clan away.Powerless to intervene but determined to stay close to the unattainable tomb, the family returns to Luxor and prepares to continue their dig in the less promising West Valley—and to watch from the sidelines as Carter and Carnarvon \"discover\" the greatest Egyptian treasure of all time: King Tut's tomb. But before their own excavation can get underway, Emerson and his son, Ramses, find themselves lured into a trap by a strange group of villains ominously demanding \"Where is he?\" Driven by distress—and, of course, Amelia's insatiable curiosity—the Emersons embark on a quest to uncover who \"he\" is and why \"he\" must be found, only to discover that the answer is uncomfortably close to home. Now Amelia must find a way to protect her family—and perhaps even her would-be nemesis—from the sinister forces that will stop at nothing to succeed in the nefarious plot that threatens the peace of the entire region.Filled with heart-stopping suspense, political intrigue, and Amelia Peabody's trademark wit and wisdom, Tomb of the Golden Bird is the latest thrilling installment from the renowned and beloved \"grande dame of historical mystery\" (Washington Post).",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Egypt",
    "Audiobook",
    "Historical Mystery"
  ],
  "author": "Elizabeth Peters",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/130876.Tomb_of_the_Golden_Bird"
}