{
  "title": "Raid on the Articulate: Comic Eschatology in Jesus and Borges",
  "description": "John Dominic Crossan's In Parables demonstrated how Jesus's parables demolished an idolatry of time. In this book, he shows how the parables likewise preclude an idolatry of language. In a new, creative synthesis, Raid on the Articulate juxtaposes the sayings and parables of Jesus with the works of modern Argentine writer Jorge Luis Borges to reveal fresh interpretations. Crossan locates both men as literary iconoclasts, parablers who can evoke for us the other side of silence. The gift they bring is \"cosmic eschatology,\" the ability to \"stand on the brink of nonsense and absurdity and not be dizzy.\" The discussion begins with Comedy and Transcendence, \"a comedy too deep for laughter.\" Language is seen most openly and acknowledged most freely as structured play, opening the narrow gate to transcendence. This precludes language being mistaken for the gate itself. This in turn raises the question of Form and Parody. As Crossan writes, \"Why mock the craftsman skilled in silver and gold and not mock the artisan skilled in form and genre? What if the aniconic God became trapped in icons made of language?\" In Jesus we find the most magisterial warning against graven words and encapsulation of God in case law, proverb, or beatitude. When Jesus says, \"Whoever seeks to gain his life will lose it\" he presents a paradox insoluble by faith in language. Borges performs a similar function in literature when he inserts footnotes referring to nonexistent books. Both are arguing against the idolatry of imprisoning reality in the words that point to it. Parable and Paradox makes the case for parable as paradox formed into story. It is in this context that Jesus and Borges must be understood. Analyzing many of Jesus's parables, especially \"The Good Samaritan,\" and comparing them structurally to Borges's work, Crossan sees them as single or double reversals of their audiences\" most profound expectations. It is these that lend them both their power and their paradox. Raid on the Articulate concludes with considerations of the plasticity of time in Jesus and Borges and what, finally, we can say about them as men from their \"fragile and aphoristic art.\" Emphasizing both biblical and literary materials, John Dominic Crossan achieves a deepened understanding of New Testament texts and forms, an understanding possible only when the unique literary aspect of Jesus's sayings is acknowledged.",
  "genres": [],
  "author": "John Dominic Crossan",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/7893991-raid-on-the-articulate"
}