{
  "title": "De Liefde",
  "description": "Tak mudah menjalani pembuangan di sebuah negeri asing, meskipun negeri itu adalah negeri Belanda! Tempat ia pernah menyemai cita-cita menggali ilmu pengetahuan setinggi-tingginya. Sekar Prembayun tertatih-tatih menyusuri kehidupan yang jauh dari dugaannya. Termasuk harus berurusan dengan Roesmini van de Brand, seorang perempuan indo yang dijual oleh ‘ayahnya’ di rumah pelacuran dan menjalani affair dengan seorang anggota parlemen. Tak mudah untuk tetap mempertahankan semangat juang, di saat badai menerpa dari segala penjuru. Membuat idealisme seperti barang tertawaan. Seperti yang dialami Everdine Kareen Spinoza, pengacara yang memperjuangkan nasib kliennya, Rinnah van de Brand yang ingin mendapatkan hak pengasuhan anaknya, meski ia hanya seorang Nyai Belanda. Sekar dan Everdine, di tengah perjuangannya melawan sistem hukum yang tak berpihak pada kaum inlander, harus pula memperjuangkan arti sebuah kesetiaan. Karena, cinta sejati memang begitu sulit diejawantahkan. Apakah Sekar, Everdine dan yang lain berhasil meramu sebuah de liefde, cinta yang menginspirasi perjuangan mereka? Dan, siapakah sebenarnya keluarga Van De Brand itu? Mengapa di satu sisi Richard van de Brand menjadi salah seorang yang sangat berkuasa di Hindia Belanda dan memiliki peluang menjadi gubernur jenderal, bahkan perdana menteri, namun di sisi lain ada Daalen van de Brand, kakaknya yang tergolek sebagai pecandu narkotika di salah satu kamar sempit di Rumah Bordil De Lente? Mengapa kakak-beradik yang sejak muda bermusuhan itu menempuh jalan hidup yang begitu berbeda? Dan apa hubungan mereka dengan Rinnah van de Brand yang gila dengan Roesmini van de Brand yang menjadi pelacur? Novel kedua dari tetralogi De Winst ini begitu penuh liukan konflik. Akan tetapi, konfliknya bergaris-garis romantis. Epik menggariskan idealisme yang tegas, namun balutan asmara membuat epik ini menjadi kisah yang memikat. Jika De Winst berhasil mencatat kesuksesan, maka sequelnya ini pun tak kalah menawan. Selamat membaca!",
  "genres": [
    "Historical Fiction",
    "Indonesian Literature",
    "Romance"
  ],
  "author": "Afifah Afra",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/7886626-de-liefde"
}