{
  "title": "Promise Me: How a Sister's Love Launched the Global Movement to End Breast Cancer",
  "description": "Suzy and Nancy Goodman were more than sisters. They were best friends, confidantes, and partners in the grand adventure of life. For three decades, nothing could separate them. Not college, not marriage, not miles. Then Suzy got sick. She was diagnosed with breast cancer in 1977; three agonizing years later, at thirty-six, she died.It wasn’t supposed to be this way. The Goodman girls were raised in postwar Peoria, Illinois, by parents who believed that small acts of charity could change the world. Suzy was the big sister—the homecoming queen with an infectious enthusiasm and a generous heart. Nancy was the little sister—the tomboy with an outsized sense of justice who wanted to right all wrongs. The sisters shared makeup tips, dating secrets, plans for glamorous fantasy careers. They spent one memorable summer in Europe discovering a big world far from Peoria. They imagined a long life together—one in which they’d grow old together surrounded by children and grandchildren. Suzy’s diagnosis shattered that dream.In 1977, breast cancer was still shrouded in stigma and shame. Nobody talked about early detection and mammograms. Nobody could even say the words “breast” and “cancer” together in polite company, let alone on television news broadcasts. With Nancy at her side, Suzy endured the many indignities of cancer treatment, from the grim, soul-killing waiting rooms to the mistakes of well-meaning but misinformed doctors. That’s when Suzy began to ask Nancy to promise. To promise to end the silence. To promise to raise money for scientific research. To promise to one day cure breast cancer for good. Big, shoot-for-the-moon promises that Nancy never dreamed she could fulfill. But she promised because this was her beloved sister. I promise, Suzy. . . . Even if it takes the rest of my life.Suzy’s death—both shocking and senseless—created a deep pain in Nancy that never fully went away. But she soon found a useful outlet for her grief and outrage. Armed only with a shoebox filled with the names of potential donors, Nancy put her formidable fund-raising talents to work and quickly discovered a groundswell of grassroots support. She was aided in her mission by the loving tutelage of her husband, restaurant magnate Norman Brinker, whose dynamic approach to entrepreneurship became Nancy’s model for running her foundation. Her account of how she and Norman met, fell in love, and managed to achieve the elusive “true marriage of equals” is one of the great grown-up love stories among recent memoirs. Nancy’s mission to change the way the world talked about and treated breast cancer took on added urgency when she was herself diagnosed with the disease in 1984, a terrifying chapter in her life that she had long feared. Unlike her sister, Nancy survived and went on to make Susan G. Komen for the Cure into the most influential health charity in the country and arguably the world. A pioneering force in cause-related marketing, SGK turned the pink ribbon into a symbol of hope everywhere. Each year, millions of people worldwide take part in SGK Race for the Cure events. And thanks to the more than $1.5 billion spent by SGK for cutting-edge research and community programs, a breast cancer diagnosis today is no longer a death sentence. In fact, in the time since Suzy’s death, the five-year survival rate for breast cancer has risen from 74 percent to 98 percent.Promise Me is a deeply moving story of family and sisterhood, the dramatic “30,000-foot view” of the democratization of a disease, and a soaring affirmative to the question: Can one person truly make a difference?From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "Biography",
    "Audiobook",
    "Medical",
    "Book Club"
  ],
  "author": "Nancy G. Brinker",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/7898208-promise-me"
}