{
  "title": "خطوة واحدة صغيرة قد تغير مجرى حياتك : طريقة الكايزن",
  "description": "Introducing the practical and inspirational guide to incorporating Kaizen and its powerful principles into one's daily life. Rooted in the two thousand-year-old wisdom of the Tao Te Ching--\"The journey of a thousand miles begins with a single step\"--Kaizen is the art of making great and lasting change through small, steady increments. Kaizen is the tortoise versus the hare. Kaizen is the eleven Fortune 500 companies that significantly outperformed the market through moderate, step-by-step actions. Kaizen is losing weight not by a crash diet (which more often than not crashes) but by eating one bite less at each meal--then, a month later, eating two bites less. Kaizen is starting a life-changing exercise program by standing--just standing--on a treadmill for one minute a day.Written by an expert on Kaizen--Dr. Robert Maurer, a psychologist on the staff at the UCLA medical school who speaks and consults nationally--One Small Step is the gentle but potent way to effect change. Beginning by outlining the all-important role that fear plays in all types of change--and Kaizen's ability to circumvent it--Dr. Maurer then explains the 7 Small how to Think Small Thoughts, Take Small Actions, Solve Small Problems, and more. He shows how to perform mind sculpture--visualizing virtual change so that real change comes more naturally. Why small rewards motivate better than big rewards. How great discoveries are made by paying attention to the little details most of us overlook. Hundreds of examples of Kaizen at work grace the book, as well as quotes from W. Edwards Deming (who brought Kaizen to Japanese industry), Peter Drucker, coach John Wooden, and others.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Business",
    "Psychology",
    "Personal Development",
    "Productivity",
    "Philosophy"
  ],
  "author": "Robert Maurer",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/7896327"
}