{
  "title": "The Cherry Blossom Festival: Sakura Celebration",
  "description": "Lavishly illustrated and fact-filled, The Cherry Blossom Festival: Sakura Celebration is a fascinating and informative look into one of the world's greatest festivals. From Tokyo to Washington, D.C. these exuberant festivals celebrate the ethereal and glorious springtime blooming of the ancient cherry blossom tree and its role today as an instrument of diplomacy, landscape enhancement and eternal sign of spring and romance. Highlights include the story of the trees' cultivation and significance in Japan for more than 1000 years, how they came to the U.S. and their importance as representatives of Japanese and American friendship, plus listings of important cherry blossom tree collections and other significant viewing sites throughout the U.S. and Japan. Cherry blossoms are explored as symbols in Japanese art and artifacts, and in images of Japonism found in Western art. Extensive illustrations complement the intriguing stories of how Japanese cherry blossom trees came to be planted around the Tidal Basin in Washington, D.C., and of the development of the National Cherry Blossom Festival which honors the trees and their extraordinary beauty. The pivotal roles played by intrepid traveler and writer, Eliza Scidmore, and First Ladies Helen Taft and Lady Bird Johnson are included. The most significant of the more than 175 varieties of Japanese ornamental trees are featured, along with cultivation tips for home gardeners. The Cherry Blossom Festival: Sakura Celebration is sure to enlighten and entertain everyone touched by the cherry blossoms' transcendent beauty and delighted by the festivals that honor them. Over a million people visit Washington, D.C., each year to admire the blossoming cherry trees, originally a gift of friendship from Japan in 1912, and attend National Cherry Blossom Festival events that herald the arrival of spring in the capital city. Offering something for everyone, Festival events include an Opening Ceremony, parade, entertainment stages, fireworks, Family Day, and the Sakura Matsuri - Japanese Street Festival. The National Cherry Blossom Festival, Inc. is a 501(c)(3) not-for-profit organization dedicated to promoting the beauty of nature and international friendship through year-round programs, events, and educational initiatives that enhance our environment, showcase arts and culture, and build community spirit. As the nation's greatest springtime celebration, the National Cherry Blossom Festival includes spectacular weekends and daily events featuring diverse and creative programming designed to appeal to city residents and visitors alike. Each year, the Festival commemorates the anniversary of the gift of the cherry blossom trees and the enduring friendship between the United States and Japan.",
  "genres": [],
  "author": "Ann McClellan",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/789573.The_Cherry_Blossom_Festival"
}