{
  "title": "Elizabeth's Women: Friends, Rivals, and Foes Who Shaped the Virgin Queen",
  "description": "A source of endless fascination and speculation, the subject of countless biographies, novels, and films, Elizabeth I is now considered from a thrilling new angle by the brilliant young historian Tracy Borman. So often viewed in her relationships with men, the Virgin Queen is portrayed here as the product of women: the mother she lost so tragically, the female subjects who worshiped her, and the peers and intimates who loved, raised, challenged, and sometimes opposed her.In vivid detail, Borman presents Elizabeth’s bewitching mother, Anne Boleyn, eager to nurture her new child, only to see her taken away and her own life destroyed by damning allegations--which taught Elizabeth never to mix politics and love. Kat Astley, the governess who attended and taught Elizabeth for almost thirty years, invited disaster by encouraging her charge into a dangerous liaison after Henry VIII’s death. Mary Tudor (“Bloody Mary”) envied her younger sister’s popularity and threatened to destroy her altogether. And animosity drove Elizabeth and her cousin Mary Queen of Scots into an intense thirty-year rivalry that could end only in death.Elizabeth’s Women contains more than an indelible cast of characters. It is an unprecedented account of how the public posture of femininity figured into the English court, the meaning of costume and display, the power of fecundity and flirtation, and how Elizabeth herself, long viewed as the embodiment of feminism, shared popular views of female inferiority and scorned and schemed against her underlings’ marriages and pregnancies.Brilliantly researched and elegantly written, Elizabeth’s Women is a unique take on history’s most captivating queen and the dazzling court that surrounded her.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "Historical",
    "British Literature",
    "European History"
  ],
  "author": "Tracy Borman",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/7897065-elizabeth-s-women"
}