{
  "title": "In Her Name: The Last War",
  "description": "This is a collection of the In Her The Last War trilogy, and includes the complete text of First Contact, Legend Of The Sword, and Dead Soul in a single volume. FIRST CONTACT The Terran survey ship Aurora makes a startling discovery in an uncharted star two planets inhabited by an advanced, and decidedly unfriendly, non-human civilization. Disabled by gigantic alien warships before it can escape, the Aurora is boarded by nightmarish blue-skinned warriors with claws and fangs who slaughter the crew in ritual combat using primitive weapons. The sole survivor, Midshipman Ichiro Sato, is returned to Earth as a messenger bearing a device that warns of an impending attack. For that is the way of the Kreelan Empire, which has waged war against countless civilizations across the stars in its quest for a savior, one not of their own blood, foretold in an ages-old prophecy. With only a few generations left before their ancient species faces extinction, the Kreelans will wage their last war against humanity, hoping against hope for redemption of sins long past. LEGEND OF THE SWORD As Earth and the other worlds of the Confederation bind their wounds after the disastrous first battle with the alien Kreelan Empire, Ichiro Sato finds himself in command of the heavy cruiser Yura. His ship is one of many in the task force sailing for the renegade planet of Saint Petersburg, which Confederation intelligence sources believe has not only secretly built a fleet of warships to attack the Confederation, but has armed its ships with nuclear weapons, which have been outlawed in the human sphere for centuries. Drawn into a deadly trap, the Confederation fleet and its Marines are fighting for their lives when Kreelan warships, led by the enigmatic warrior priestess Tesh-Dar, materialize out of hyperspace. As Tesh-Dar and her warriors wreak havoc on the humans, Ichiro, former Legionnaire Roland Mills, and a Confederation spy known as Scarlet, are faced with desperate choices from which they learn the true meaning of sacrifice. DEAD SOUL Three years after the brutal first contact encounter with the alien Kreelan Empire, the Confederation is desperate for a victory. With over a dozen worlds under siege by legions of Kreelan warriors, President McKenna orders her military leaders to deliver a victory, no matter the cost, to give humanity hope. Ichiro Sato, his wife Steph, Roland Mills, Scarlet, and the irrepressible General James Sparks are once again at the sharp end of the spear in a mission to take back the colony of Alger’s World from the alien invaders before the Kreelans have exterminated the human population. But overwhelming firepower may not be enough. For leading the Kreelans is Ku’ar-Marekh, a warrior priestess who is feared even among her own kind. With her spirit trapped between life and death, drawn to war from a lonely sojourn among distant stars, she is known as the Dead Soul…",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Military Fiction",
    "Fantasy",
    "Adventure",
    "Military Science Fiction"
  ],
  "author": "Michael R. Hicks",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/13088128-in-her-name"
}