{
  "title": "The Godfather Returns",
  "description": "THE MISSING YEARS FROM THE GREATEST CRIME SAGA OF ALL TIMEThirty-five years ago, Mario Puzo's great American tale, The Godfather, was published, and popular culture was indelibly changed. Now, in The Godfather Returns, acclaimed novelist Mark Winegardner continues the story-the years not covered in Puzo's bestselling book or in Francis Ford Coppola's classic films.It is 1955. Michael Corleone has won a bloody victory in the war among New York's crime families. Now he wants to consolidate his power, save his marriage, and take his family into legitimate businesses. To do so, he must confront his most dangerous adversary yet, Nick Geraci, a former boxer who worked his way through law school as a Corleone street enforcer, and who is every bit as deadly and cunning as Michael. Their personal cold war will run from 1955 to 1962, exerting immense influence on the lives of America's most powerful criminals and their loved ones, includingTom Hagen, the Corleone Family's lawyer and consigliere, who embarks on a political career in Nevada while trying to protect his brother;Francesca Corleone, daughter of Michael's late brother Sonny, who is suddenly learning her family's true history and faces a difficult choice;Don Louie Russo, head of the Chicago mob, who plays dumb but has wily ambitions for muscling in on the Corleones' territory;Peter Clemenza,  the stalwart Corleone underboss, who knows more Family secrets than almost anyone;Ambassador M. Corbett Shea, a former Prohibition-era bootlegger and business ally of the Corleones', who wants to get his son elected to the presidency-and needs some help from his old friends;Johnny Fontane, the world's greatest saloon singer, who ascends to new heights as a recording artist, cozying up to Washington's power elite and maintaining a precarious relationship with notorious underworld figures;Kay Adams Corleone, who finally discovers the truth about her husband, Michael-and must decide what it means for their marriage and their children andFredo Corleone, whose death has never been fully explained until now, and whose betrayal of the Family was part of a larger and more sinister chain of events.Sweeping from New York and Washington to Las Vegas and Cuba, The Godfather Returns is the spellbinding story of America's criminal underworld at mid-century and its intersection with the political, legal, and entertainment empires. Mark Winegardner brings an original voice and vision to Mario Puzo's mythic characters while creating several equally unforgettable characters of his own. The Godfather Returns stands on its own as a triumph-in a tale about what we love, yearn for, and sometimes have reason to fear . . . family.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Crime",
    "Mystery",
    "Thriller",
    "Classics",
    "Historical Fiction",
    "Drama"
  ],
  "author": "Mark Winegardner",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/79030.The_Godfather_Returns"
}