{
  "title": "The Egyptian Book of the Dead",
  "description": "The Egyptian Books of the Dead is unquestionably one of the most influential books in all of history. Embodying a ritual to be performed for the dead, with detailed instructions for the behavior of the disembodied spirit in the Land of the Gods, it served as the most important repository of religious authority for some three thousand years. Chapters were carved on the pyramids of the ancient 5th Dynasty, texts were written in papyrus, and selections were painted on mummy cases well into the Christian Era. In a certain sense it stood behind all Egyptian civilization.In the year 1888 Dr. E. Wallis Budge, then purchasing agent for the British Museum, followed rumors he heard of a spectacular archaeological find in Upper Egypt, and found in an 18th Dynasty tomb near Luxor \"the largest roll of papyrus I had ever seen, tied with a thick band of papyrus, and in a perfect state of preservation.\" It was a copy of the Egyptian Book of the Dead, written around 1500 B.C. for Ani, Royal Scribe of Thebes, Overseer of the Granaries of the Lords of Abydos, and Scribe of the Offerings of the Lords of Thebes.The Papyrus of Ani, a full version of the Theban recension, is presented here by Dr. Budge, who later became perhaps the world's most renowned Egyptologist. Reproduced in full are a clear copy of the Egyptian hieroglyphs, and interlinear transliteration of their sounds (as reconstructed), a word-for-word translation, and separately a complete smooth translation. All this is preceded by an introduction of more than 150 pages. As a result of this multiple apparatus the reader has a unique opportunity to savor all aspects of the Book of the Dead, or as it is otherwise known, the Book of the Great Awakening.",
  "genres": [
    "History",
    "Mythology",
    "Nonfiction",
    "Egypt",
    "Classics",
    "Philosophy",
    "Spirituality"
  ],
  "author": "Anonymous",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/790550.The_Egyptian_Book_of_the_Dead"
}