{
  "title": "Below The Line",
  "description": "Squeak Bartholomew is a small-town handyman who needs some quick cash to save his niece from jail. Martin Oals is an out of work Hollywood actor branching into some very dangerous areas. Joel Opatkin is a movie studio vice-president who is about to be fired and face financial ruin. Henry Voght is a corrupt LAPD officer, freelancing by shaking down drug dealers. And they are all interested in a million-dollar crop of marijuana.Brian Tobin’s previous novel, The Ransom, was called, “stunning in its portrayal of career outlaws,” by Booklist. The New York Times Book Review wrote of The Missing Person, ‘He keeps us in suspense until the last page, where the final surprise, and perhaps the most unexpected, is how deeply he has tapped our emotions.”With Below the Line, he continues to rivet readers.Praise for Brian THE RANSOM“The Ransom is a first novel that races through the boroughs of New York like an A train.” – The Chicago Tribune“Tobin’s outstanding first novel is a rereadable, memorable mystery–a knockout, a spellbinder.” – The Drood Review of Mystery“{A} tidy, zippy novel.” – Kirkus ReviewTHE MISSING PERSON“In an unusual mystery without a conventional hero or villain, Tobin movingly depicts the lives of ordinary people who suddenly find themselves in extraordinary circumstances... Tobin makes the most of plot, character and the warmly evoked Hudson Valley setting in this satisfying, atypical mystery.” – Publishers Weekly“Tobin’s grasp of the characters is so sure that the suspense doesn’t let up...” – Kirkus Review“There is a mystery here..but the novel is really about love, separation, longing, and the pain of never knowing the fate of a loved one. Tobin, whose debut novel, The Ransom, was stunning in its portrayal of career outlaws, is equally at home with good people coping with awful circumstances... A complex, thoughtful novel.” – Booklist“It delivers the suspense most mysteries only promise.” – Wilson Library Bulletin“With expert narration that moves easily back and forth in time, Mr. Tobin lures us into the grip of a well-built, fast-paced story with both a tantalizing mystery and a love story at its core. The tight and complicated plot never seems forced because it grow out of the motivations and actions of strong, believable characters... He keeps us in suspense until the last page, where the final surprise, and perhaps the most unexpected, is how deeply he has tapped our emotions.” – The New York Times Book Review",
  "genres": [],
  "author": "Brian Tobin",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/13088116-below-the-line"
}