{
  "title": "The Tears of Ishtar",
  "description": "An ancient evil... an immortal warrior. From the sands and cities of the ancient middle-east comes an epic story of bloodshed, love and betrayal. Award-winning fantasy author Michael Ehart spins a tale that echoes with the blood and thunder of the golden age. Bound by an ancient curse, serving her master in bitter unwillingness, the Servant of the Manthycore must lure the greedy, the unsuspecting and the unwary into the desert to feed the insatiable beast to whom she is bound. Centuries of combat and murder have made her a swordswoman whispered of in the marketplaces, feared in the back-alleys and sung about by the campfires of the caravans. The passing centuries of betrayal and death have stolen her humanity and even her name, leaving only a glimmer of who she once was. Her only hope is to someday meet a greater warrior than she, and so be freed. Striding across the background of civilization in its youth, in the time of the first great heroes and the cities they built, she becomes more than a woman, and as her legend grows so does her determination to someday be free of the great beast who she serves. Goddesses, bandits, soldiers and kings fall beneath her sword as she fights her way to discover a path to freedom. Fantasy legend Michael Moorcock \"Michael Ehart is an impressive talent!\" And reviewers from all over the world agree that the Servant of the Manthycore is one of the great characters of modern heroic fantasy. The Tears of Ishtar brings together her entire saga in one blood-soaked, thrilling novel that will have your pulse pounding from the very first page. Beautifully illustrated by renowned Sword and Sorcery artist Miko, and encased within a stunning, original cover by Johnney Perkins, this will be one novel you won't want to put down!",
  "genres": [
    "Sword and Sorcery",
    "Fantasy"
  ],
  "author": "Michael Ehart",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/7907331-the-tears-of-ishtar"
}