{
  "title": "Justice at Dachau: The Trials of an American Prosecutor",
  "description": "The world remembers Nuremberg, where a handful of Nazi policymakers were brought to justice, but nearly forgotten are the proceedings at Dachau, where hundreds of Nazi guards, officers, and doctors stood trial for personally taking part in the torture and execution of prisoners inside the Dachau, Mauthausen, Flossenburg, and Buchenwald concentration camps. In Justice at Dachau , Joshua M. Greene, maker of the award winning documentary film Voices from the Holocaust , recreates the Dachau trials and reveals the dramatic story of William Denson, a soft-spoken young lawyer from Alabama whisked from teaching law at West Point to leading the prosecution in the largest series of Nazi trials in history.In a makeshift courtroom set up inside Hitler’s first concentration camp, Denson was charged with building a team from lawyers who had no background in war crimes and determining charges for crimes that courts had never before confronted. Among the accused were Dr. Klaus Schilling, responsible for hundreds of deaths in his “research” for a cure for malaria; Edwin Katzen-Ellenbogen, a Harvard psychologist turned Gestapo informant; and one of history’s most notorious female war criminals, Ilse Koch, “Bitch of Buchenwald,” whose penchant for tattooed skins and human bone lamps made headlines worldwide.Denson, just thirty-two years old, with one criminal trial to his name, led a brilliant and successful prosecution, but nearly two years of exposure to such horrors took its toll. His wife divorced him, his weight dropped to 116 pounds, and he collapsed from exhaustion. Worst of all was the pressure from his army superiors to bring the trials to a rapid end when their agenda shifted away from punishing Nazis to winning the Germans’ support in the emerging Cold War. Denson persevered, determined to create a careful record of responsibility for the crimes of the Holocaust. When, in a final shocking twist, the United States used clandestine reversals and commutation of sentences to set free those found guilty at Dachau, Denson risked his army career to try to prevent justice from being undone.",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "World War II",
    "War",
    "True Crime",
    "Germany"
  ],
  "author": "Joshua M. Greene",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/791010.Justice_at_Dachau"
}