{
  "title": "The Fires: How a Computer Formula, Big Ideas, and the Best of Intentions Burned Down New York City-and Determined the Future of Cities",
  "description": "New York City, 1968. The RAND Corporation had presented an alluring proposal to a city on the brink of economic Using RAND's computer models, which had been successfully implemented in high-level military operations, the city could save millions of dollars by establishing more efficient public services. The RAND boys were the best and brightest, and bore all the sheen of modern American success. New York City, on the other hand, seemed old-fashioned, insular, and corrupt-and the new mayor was eager for outside help, especially something as innovative and infallible as \"computer modeling.\" A deal was RAND would begin its first major civilian effort with the FDNY.Over the next decade-a time New York City firefighters would refer to as \"The War Years\"-a series of fires swept through the South Bronx, the Lower East Side, Harlem, and Brooklyn, gutting whole neighborhoods, killing more than two thousand people and displacing hundreds of thousands. Conventional wisdom would blame arson, but these fires were the result of something altogether the intentional withdrawal of fire protection from the city's poorest neighborhoods-all based on RAND's computer modeling systems.Despite the disastrous consequences, New York City in the 1970s set the template for how a modern city functions-both literally, as RAND sold its computer models to cities across the country, and systematically, as a new wave of technocratic decision-making took hold, which persists to this day. In The Fires , Joe Flood provides an X-ray of these inner workings, using the dramatic story of a pair of mayors, an ambitious fire commissioner, and an even more ambitious think tank to illuminate the patterns and formulas that are now inextricably woven into the very fabric of contemporary urban life. The Fires is a must read for anyone curious about how a modern city works.",
  "genres": [
    "History",
    "Nonfiction",
    "New York",
    "Technology",
    "Urbanism",
    "Urban",
    "Politics"
  ],
  "author": "Joe   Flood",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/7906964-the-fires"
}