{
  "title": "The Key to the Kingdom",
  "description": "Grayson Hawkes learns how imaginative and elaborate Walt Disney World is when he accepts an invitation one sunny day from a trusted friend landing him in a world he never knew existed. Innocently driven by curiosity he finds himself immersed in a heroic adventure. Barely escaping a late night encounter, he finds himself desperately trying to solve a mysterious disappearance while trying to stay ahead of those who are chasing him. Hawkes quickly realizes that unraveling the clues is essential if he is to discover the truth. He navigates through the kingdom where knowledge of seemingly unimportant Disney facts and some divine help are the only way he can discover the lock that can be opened by an ancient key. His world becomes even more complicated when he is captivated by a mysterious woman, causing him to make a series of choices that takes his faith to the brink. Each step is fueled with heart pounding intensity carrying him deeper into a thrill ride of secrecy. Within the walls of Walt Disney World is more mystery than one imagination can contain. Here Disney Trivia is not a game; and the ancient key is the only way out! Jeff Dixon was raised in Florida and has always been fascinated with the man Walt Disney and the theme park he created. Dixon feels that any guest who would take the time to look would discover a story that will never be completed. It is against this canvas that Dixon paints this mystery, adventure, and thriller. The epic drama carries the reader across the state of Florida to discover details that most people have missed. Each discovery and revelation will have the reader wondering if they are reading fact or fiction. In a quickening pace, the characters find themselves on a collision course with an unthinkable outcome! Fans of Walt Disney will love the history and tourists will find a travel guide that takes them on a trip most guests never get to take.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Mystery",
    "Adventure",
    "Contemporary"
  ],
  "author": "Jeff Dixon",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/7914258-the-key-to-the-kingdom"
}