{
  "title": "Hunted By The Others",
  "description": "In a town full of vampires, mages, and werewolves, detective work can be “Dark and sexy . . . a paranormal treat” (Lara Adrian, New York Times –bestselling author). Shiarra Waynest’s job was dangerous enough when her client base was strictly mortal. But ailing finances have forced her to accept a lucrative case that could save her firm—if it doesn’t kill her first. Shiarra has signed on to work for a high-level mage to recover an ancient artifact owned by one of New York’s most powerful vampires. As soon as the detective meets the sexy, mesmerizing vampire Alec Royce, she knows her assignment is even more complicated than she thought. With a clandestine anti-Other group trying to recruit her and magi being eliminated, Shiarra needs backup. She enlists her ex-boyfriend—a werewolf whose non-furry form is disarmingly appealing—and a nerdy mage with surprising talents. But it may not be enough. In a city where the undead roam, magic rules, and even the Others aren’t always what they seem, Shiarra has just become the secret weapon in a battle between good and evil—whether she likes it or not. This fast-moving urban fantasy is “a fun, high octane ride with a take charge heroine who will leave you wanting more” (Alexandra Ivy, New York Times– bestselling author). “Take a sarcastic, likable heroine out of her depth with a mysterious, seductive vampire, add lots of scheming bad guys, and you’ve got a delightful romp of a book.” —Angela Knight, New York Times– bestselling author “Full of litigious vampires, sexy shapeshifters and a mage sidekick akin to Bond’s Q, what more could you want?” —Mark Henry, author of Battle of the Network Zombies “Fresh, hilarious, and action-packed. I loved every minute of it.” —Lilith Saintcrow, New York Times –bestselling author of the Dante Valentine series",
  "genres": [
    "Urban Fantasy",
    "Vampires",
    "Paranormal",
    "Fantasy",
    "Magic",
    "Paranormal Romance",
    "Werewolves"
  ],
  "author": "Jess Haines",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/7918758-hunted-by-the-others"
}