{
  "title": "The Mccassey Brothers Trilogy Megabook",
  "description": "THREE COMPLETE NOVELS, ONE MEGABOOK SERIES! The first three novels of the epic McCassey Brothers saga from Preditors and Editors Reader's Poll Romance Author of the Year, Lauren N. Sharman, including: No Worries: Witnessing her mother's murder put a label on Gypsy Lance that few people overlooked. Raised in foster homes, she spent her childhood yearning for love and acceptance. Nearly penniless, she arrives in Hagerstown, Maryland looking to put down roots and outrun a past she fears is about to catch up to her...Blue-collar, bad boy Rebel McCassey knows what it's like to try and escape your past. No longer the hellion he once was, he's never been able to shake his family's bad reputation. When he finds Gypsy lost in the woods, her unconditional trust and refusal to judge him by his infamous last name touch Rebel in a place he didn't know existed...his heart. When the demons chasing Gypsy are caught lurking in the shadows, Rebel vows to keep her safe, even if it means slipping back into his old ways... Preditors and Editors 2006 Reader's Poll, Best Romance Novel of The Year, Ecataromance Reviewers' Choice Award Winner, Whiskey Creek Press Number One Bestseller The Devil's Candy: Behind Angel Shelby's dancing eyes and mischievous smile, lie the razor sharp tongue and fearless attitude that have helped her conceal painful secrets. However, they aren't enough to save her this time—as she's issued a shocking ultimatum. Nicknamed, The Devil, Blackie McCassey's violent past keeps most people exactly where he likes them...at a distance. Sacrificing his freedom to repay an old debt, he agrees to marry Angel in name only, watch over her, and play peacemaker in the uncivilized bar she runs. Along with unexpected happiness, marriage brings surprises. Once wild and reckless, Blackie suddenly finds himself in the unfamiliar position of keeping someone else out of trouble...his wife. When a murder occurs, Blackie's forced to face his past one last time, risking his life to put an end to the chaos disrupting their lives. Unfortunately, victory comes at a price...2007 Ecataromance Reviewer's Choice Award Winner, Top Ten Award Preditors and Editors Reader's Poll, Top Ten Best Author Award Preditor's And Editor's Reader's Poll Dusty Rose: Dusty Zamora and her close-knit sisters were young—but far from innocent—when they abruptly left Hagerstown, Maryland ten years ago. Now, Dusty has returned. Alone. Judd McCassey spent most of his thirty-six years side-by-side with his brothers and cousins...on the wrong side of the law. His one regret...being powerless to help the only woman he ever loved when she needed it most. Judd knows they're headed for trouble when Dusty rides back into his life on a stolen outlaw biker's motorcycle, and is shocked when she refuses his help. Finally realizing that hiding her deadly secrets are harming—not helping—the man she loves, Dusty opens up to Judd, dropping a bombshell that sends him reeling, and her fleeing. Not until Dusty vanishes does Judd discover her deception was well-intended. Now, he must find her before it's too late for all of them... Top Five Finisher, 2008 Preditors and Editors Reader's Poll, Whiskey Creek Press Number One Bestseller GET THE COMPLETE FIRST THREE BOOKS OF THE SERIES IN THIS MEGABOOK RELEASE! Genre: Romance Suspense",
  "genres": [
    "Romance"
  ],
  "author": "Lauren N. Sharman",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/7915573-the-mccassey-brothers-trilogy-megabook"
}