{
  "title": "Today I Wrote Nothing: The Selected Writings",
  "description": "Daniil Kharms has long been heralded as one of the most iconoclastic writers of the Soviet era, but the full breadth of his achievement is only in recent years, following the opening of Kharms' archives, being recognized internationally. In this brilliant translation by Matvei Yankelevich, English-language readers now have a comprehensive collection of the prose and poetry that secured Kharms s literary reputation a reputation that grew in Russia even as the Soviet establishment worked to suppress it.A master of formally inventive poetry and what today would be called micro-fiction, Kharms built off the legacy of Russian Futurist writers to create a uniquely deadpan style written out of and in spite of the absurdities of life in Stalinist Russia. Featuring the acclaimed novella The Old Woman and darkly humorous short prose sequence Events (Sluchai), Today I Wrote Nothing also includes dozens of short prose pieces, plays, and poems long admired in Russia, but never before available in English. A major contribution for American readers and students of Russian literature and an exciting discovery for fans of contemporary writers as eclectic as George Saunders, John Ashbery, and Martin McDonagh, Today I Wrote Nothing is an invaluable collection for readers of innovative writing everywhere.About the EditorMATVEI YANKELEVICH is also a co-translator of Oberiu: An Anthology of Russian Absurdism (2006). His translation of the Vladimir Mayakovsky's poem \"Cloud in Pants\" appears in Night Wraps the Sky: Writings by and About Mayakovsky. He is the author of a long poem, The Present Work, and his writing has appeared in Fence, Open City, and many other literary journals. He teaches Russian Literature at Hunter College in New York City and edits the Eastern European Poets Series at Ugly Duckling Press in Brooklyn.",
  "genres": [
    "Poetry",
    "Fiction",
    "Short Stories",
    "Russia",
    "Russian Literature",
    "Literature",
    "Classics"
  ],
  "author": "Daniil Kharms",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/792712.Today_I_Wrote_Nothing"
}