{
  "title": "The Nightfarers",
  "description": "Sewn hardcover, limited to 300 copies, 191pp with end papers and an original frontispiece.To find the “light of lights”, you must first know the darkness of night, said the 17th century German mystic Angelus Silesius. It is a truth found by all the characters in Mark Valentine’s new full collection of stories since Masques & Citadels. Carden, the quester after lost languages, finds there are some things that cannot be named. The narrator in \"The Seer of Trieste\" finds the old city harbours an image that has pervaded the most advanced literature of our time, while the strange and tragic secrets of another liminal city are explored in \"The Seven Treasures of Bucharest\". The voyages of \"The White Sea Company\" seem to sail beyond any mortal shore, while the smouldering sunrise in \"The Dawn at Tzern\" brings different illuminations to a priest, a postmaster, a prophet and a soldier. In \"Their Dark & Starry Mirrors\", a blind Moorish poet receives messages from the Master of Night. In \"Undergrowth\" a searcher after rare works finds it is possible to get truly lost in books, and in \"White Pages\" we learn that even blank books have their secrets. And which author should have won \"The 1909 Proserpine Prize\" for dark literature – Blackwood, Shiel, Hodgson, Stoker, Marjorie Bowen – or another ? As well as these tales, two more curious pieces appear: \"The English Leopard\" eavesdrops on a conversation about a great lost heraldic beast, while \"The Left Temple\" provides six startling experiments in evoking the rites of dusk. The author of The Connoisseur stories and editor of Wormwood offers a book of wonder, where neither light nor shadow are ever all they seem. Two years in the making, The Nightfarers is not only the most eclectic and exquisite Mark Valentine collection to date but also his finest. We here at Ex Occidente Press trust this is one of the very few contemporary masterpieces of the weird and the fantastic.ContentsThe 1909 Proserpine PrizeCarden in CapaeaWhite PagesThe Inner SentinelThe Dawn at TzernThe White Sea CompanyUndergrowthThe Seer of TriesteTheir Dark and Starry MirrorsThe Bookshop in Nový SvetThe English Leopard: An Heraldic DialogueThe Box of IdolsThe Axholme TollThe Seven Treasures of BucharestAbout the StoriesThe Nightfarers is a sewn hardcover book - 21 x 27 cm! - of 191 pages with deluxe endpapers and a full-page original frontispiece. Edition strictly limited to 300 copies.",
  "genres": [
    "Short Stories",
    "Horror",
    "Weird Fiction",
    "Fiction",
    "English Literature"
  ],
  "author": "Mark Valentine",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/7927493-the-nightfarers"
}