{
  "title": "Pearl Buck in China: Journey to The Good Earth",
  "description": "One of the twentieth century’s most extraordinary Americans, Pearl Buck was the first person to make China accessible to the West.She recreated the lives of ordinary Chinese people in The Good Earth , an overnight worldwide bestseller in 1932, later a blockbuster movie. Buck went on to become the first American woman to win the Nobel Prize for Literature. Long before anyone else, she foresaw China’s future as a superpower, and she recognized the crucial importance for both countries of China’s building a relationship with the United States. As a teenager she had witnessed the first stirrings of Chinese revolution, and as a young woman she narrowly escaped being killed in the deadly struggle between Chinese Nationalists and the newly formed Communist Party.Pearl grew up in an imperial China unchanged for thousands of years. She was the child of American missionaries, but she spoke Chinese before she learned English, and her friends were the children of Chinese farmers. She took it for granted that she was Chinese herself until she was eight years old, when the terrorist uprising known as the Boxer Rebellion forced her family to flee for their lives. It was the first of many desperate flights. Flood, famine, drought, bandits, and war formed the background of Pearl’s life in China. \"Asia was the real, the actual world,\" she said, \"and my own country became the dreamworld.\"Pearl wrote about the realities of the only world she knew in The Good Earth. It was one of the last things she did before being finally forced out of China to settle for the first time in the United States. She was unknown and penniless with a failed marriage behind her, a disabled child to support, no prospects, and no way of telling that The Good Earth would sell tens of millions of copies. It transfixed a whole generation of readers just as Jung Chang’s Wild Swans would do more than half a century later. No Westerner had ever written anything like this before, and no Chinese had either.Buck was the forerunner of a wave of Chinese Americans from Maxine Hong Kingston to Amy Tan. Until their books began coming out in the last few decades, her novels were unique in that they spoke for ordinary Asian people— \"translating my parents to me,\" said Hong Kingston, \"and giving me our ancestry and our habitation.\" As a phenomenally successful writer and civil-rights campaigner, Buck did more than anyone else in her lifetime to change Western perceptions of China. In a world with its eyes trained on China today, she has much to tell us about what lies behind its astonishing reawakening.",
  "genres": [
    "Biography",
    "China",
    "Nonfiction",
    "History",
    "Asia",
    "Biography Memoir",
    "Memoir"
  ],
  "author": "Hilary Spurling",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/7927372-pearl-buck-in-china"
}