{
  "title": "I, Shithead: A Life in Punk",
  "description": "Joey Keithley, aka Joey Shithead, founded legendary punk pioneers D.O.A. in 1978. Punk kings who spread counterculture around the world, they’ve been cited as influences by the Red Hot Chili Peppers, Green Day, Rancid and The Offspring; have toured with The Clash, The Ramones, The Dead Kennedys, Black Flag, Nirvana, PiL, Minor Threat and others; and are the subject of two tribute albums. They are the band that introduced the term “hardcore” into punk lexicon and may have turned Nirvana’s lead singer Kurt Cobain onto a career in music. But punk is more than a style of it’s a political act, and D.O.A. have always had a social conscience, having performed in support of Greenpeace, women’s rape/crisis centres, prisoner’s rights, and antinuke and antiglobalization organizations. Twenty-five years later D.O.A. can claim sales of hundreds of thousands of copies of their 11 albums and tours in 30 different countries, and they are still going strong. I, Shithead is Joey’s personal, no-bullshit recollections of a life in punk, starting with the burgeoning punk movement and traversing a generation disillusioned with the status quo, who believed they could change the stories of riots, drinking, travelling, playing and conquering all manner of obstacles through sheer determination. Praise for “They rock out. They blow the roof off. Some of the best shows I’ve seen in my life were D.O.A. gigs. I’ve never seen D.O.A. not be amazing.”—Henry Rollins (Black Flag, Rollins Band) “The proper medicine growing young minds needed.”—Jello Biafra (Dead Kennedys) “Joey Shithead casts a long shadow.”—John Doe (X) “They’ve changed a lot of people’s lives.”—Dave Grohl (Nirvana, Foo Fighters) Joey “Shithead” Keithley has long been an activist, including as a candidate for the Green Party, and is the founder of Sudden Death Records (www.suddendeath.com). He lives in Vancouver with his wife and their three children.",
  "genres": [
    "Music",
    "Punk",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Canada"
  ],
  "author": "Joe Keithley",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/792762.I_Shithead"
}