{
  "title": "Mastering The Marchioness",
  "description": "The last person Vale Montressor Aubrey, the Marquess of Dunnesford, expects to see walking into Madam Botreaux's Cavern of Pleasures is his wife. Fortunately, she does not recognize him behind his mask, for he has had no intention of revealing his secret life as a dom to his new bride.Harrietta, the new Marchioness of Dunnesford, knows that she, modest in means and countenance, should consider herself lucky to be married to such a desirable man as the Marquess, even if he is rumored to have had more mistresses than one can count. But if he can have his fun, why can’t she? And the dashingly handsome Lord Elroy seems just the man to make her forget about her lackluster marriage.Vale knows that Elroy, also a secret Dom at Madame Botreaux's, is only out to serve his own interests. To protect Harrietta, Vale must claim her as his own, but he soon discovers this feisty wife of his isn't so easy to tame. Especially when things start heating up in the Cavern of Pleasures…LOOKING FOR MORE… in BDSM? Check out these painfully good titles from Ravenous Romance!LOVE ME TENDER by Marsha PhilitasAn anthology for those who prefer a gift of chains from their sweetheart to a dozen roses, and who and say, \"I love you,\" with a full-throttle spanking. LOVE ME TENDER is the anthology for the romantic in every BDSM master or mistress!SPANKALICIOUS by D.L. KingWant a little more sting to your swing? Check out SPANKALICIOUS, a spanking anthology so good it hurts!POWER AN ANTHOLOGY by Jamaica LayneThere's nothing sexier than power, and nothing more powerful than politics. Explore all the ways to swing your vote in these 12 stories of sex and politics!STORY OF L by Debra HydeFor Liv, submission wasn't something she ever wanted. But now that she's met Cassandra, it's something she needs. How far will Cassandra make Liv go to satisfy cravings that go deeper than ever before?BLIND SEDUCTION by Debra HydeLeslie expected to slip in to something sweet and silky on her 10th anniversary weekend; instead, her husband decides he likes her better in a blindfold, chastity belt, and handcuffs. Will this couple's experimental weekend renew their vows and their sex life? Or will a full dose of bondage and discipline go more than just skin-deep?",
  "genres": [
    "BDSM",
    "Historical Romance",
    "Romance",
    "Historical",
    "Erotica",
    "Erotic Romance",
    "Historical Fiction"
  ],
  "author": "Em Brown",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/7933072-mastering-the-marchioness"
}