{
  "title": "Canvas Under the Sky",
  "description": "“... enjoyable, convincing story wrapped in dramatic, well-researched history”— John Gordon Davis, bestselling author of Hold My Hand I’m Dying. It is 1834. The Eastern Cape frontier is burning. Rauch Beukes, a young Boer of 17, returns to the family homestead to find it razed, the livestock gone and his mother and sisters slaughtered by the marauding Xhosa from across the Great Fish River. So begins a tale of violence and warfare and love and lust across racial divides, painted against the grand backdrop of the Boer migration north into the hinterland that became known as the Great Trek, the result of British duplicity and injustice. The dramatis personae are Boer and Brit, Xhosa, Zulu, Matabele and Cape Malay from the Xhosa chief Hinsta, Colonel Harry Smith, the Zulu tyrant Dingaan, to the Boer trekkers Potgieter, Retief, Maritz, Trichardt and Cilliers. And in young Rauch’s life are three astonishing Ameila, the daughter of an English settler; Marietjie, the beautiful meisie from Graaff-Reinet; and Katrina September, the sensual ex-slave.Robin Binckes was born in East Griqualand, South Africa in April 1941. After matriculating in Umtata, Transkei, he did his national service at the South African Navy Gymnasium, Saldanah Bay. In 1970 he opened his own PR company to promote major sporting events ranging from international cricket to Formula One Grand Prix during the period of sports isolation. In 1990 he started The Gansbaai Fishing Company and spent ten years in the food industry. During the violence that swept this country in 1993 he volunteered as a peace monitor in the townships. Sparked by the passion of the late historical orator David Rattray, he qualified in 2002 as a historical tour guide, which he does in the Johannesburg–Pretoria region through his company ‘Spear of the Nation’.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Robin Binckes",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/13090138-canvas-under-the-sky"
}