{
  "title": "The Great Typo Hunt: Two Friends Changing the World, One Correction at a Time",
  "description": "The signs of the times are missing apostrophes. The world needed a hero, but how would an editor with no off-switch answer the call? For Jeff Deck, the writing was literally on the wall: “NO TRESSPASSING.” In that moment, his greater purpose became clear.  Dark hordes of typos had descended upon civilization… and only he could wield the marker to defeat them. Recruiting his friend Benjamin and other valiant companions, he created the Typo Eradication Advancement League (TEAL). Armed with markers, chalk, and correction fluid, they circumnavigated America, righting the glaring errors displayed in grocery stores, museums, malls, restaurants, mini-golf courses, beaches, and even a national park. Jeff and Benjamin championed the cause of clear communication, blogging about their adventures transforming horor into horror, it’s into its, and coconunut into coconut. But at the Grand Canyon, they took one correction too far: fixing the bad grammar in a fake Native American watchtower.  The government charged them with defacing federal property  and summoned them to court—with a typo-ridden complaint that claimed that they had violated “criminal statues.” Now the press turned these paragons of punctuation into “grammar vigilantes,” airing errors about their errant errand.. The radiant dream of TEAL would not fade, though.   Beneath all those misspelled words and mislaid apostrophes, Jeff and Benjamin unearthed deeper dilemmas about education, race, history, and how we communicate. Ultimately their typo-hunting journey tells a larger story not just of proper punctuation but of the power of language and literacy—and the importance of always taking a second look.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Memoir",
    "Language",
    "Humor",
    "Writing",
    "Biography"
  ],
  "author": "Jeff Deck",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/7933560-the-great-typo-hunt"
}