{
  "title": "Amy, My Daughter",
  "description": "Candid, compelling, and heartbreaking--a father's story of a talent taken too soon and a legacy that will live on for generationsOn July 23, 2011, Amy Winehouse's family, friends, and fans around the world mourned the tragedy that this remarkable, talented, and extraordinarily generous young woman was now gone. A legion of dedicated fans had lost their idol; a devastated family had lost their Amy. With this difficult news came an outpouring of love and grief from her fans, along with troubling questions about Amy's very public struggles with drugs and alcohol, as people tried to understand how such a soulful singer had been silenced so young.Now, in this intimate and tender account, her father and confidant, Mitch, offers an inside view of Amy's life as she lived it, putting to rest once and for all the controversies that have long surrounded her. Sifting fact from fiction, he pre-sents a portrait of Amy unlike any other, detailing the events and the people that shaped her youth--from her mischievous childhood to her grandmother's Jazz Age stories, to her father singing Frank Sinatra around the house. Shedding light on Amy's musical coming-of-age, Mitch explores how she honed her distinctive sound, created her unforgettable look, and channeled her own life into hits such as \"You Know I'm No Good,\" \"Rehab,\" and \"Back to Black\"--some of the most memorable and personal pop music in years.While her beehive hair, larger-than-life voice, and outrageous personality made her famous, her life offstage made her infamous. Here Mitch holds nothing back about Amy's addiction to drugs and alcohol, mixing the painful with the poignant as he describes the realities of her dependencies and the toll they took on the family and friends who refused to give up on her. Revealing the truth about Amy's substance abuse and dispelling many of the tabloid-fueled rumors about her tumultuous marriage to Blake Fielder-Civil, Mitch exposes the years of behind-the-scenes drama that consumed his life and explains how, for those who knew Amy in her last months, the greatest tragedy of all was that she finally appeared to be conquering her demons.Filled with insights into Amy Winehouse's music, photographs from her life, and stories of the real woman behind the headlines, \"Amy, My Daughter\" is an emotional journey into music, addiction, and the unbreakable bond between a daughter and her father.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Music",
    "Memoir",
    "Biography Memoir",
    "Audiobook",
    "Adult"
  ],
  "author": "Mitch Winehouse",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13090096-amy-my-daughter"
}