{
  "title": "Gerçeği Arayış",
  "description": "Historically, an alkahest is a universal solvent that has the power to dissolve any substance known to man, even gold. It also was speculated that the alkahest was in actuality the philosopher's stone, or the element that could turn anything into gold and would make a man immune to even death. A philosopher at his core, Balzac utilizes this mythological device to explore obsession and its effects.As the main character of the book, Balthazar Claes, is introduced to the mysteries and wonder of alchemy, his quest for the alkahest or the philosopher's stone begins. His determination quickly becomes a single-minded obsession. As he sinks deeper into his sole fixation he begins to ruin his life and that of his family. This downfall makes the message of the book very clear - The struggles of Balthazar's wife Josephine pull at the heart strings of the reader, and watching her suffer as a result of her husband's self-centered obsession and negligence drives Balzac's main point when we think only of ourselves those around us suffer deeply.This short book, ending in tragedy, is a great read for the individual interested in Balzac's philosophy. Often considered as a masterpiece, this book is one of Balzac's finest. It stands out as an interesting story for a wide range of readers from the casual to the academic.About the PublisherForgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.comThis book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works.",
  "genres": [
    "Classics",
    "French Literature",
    "France",
    "Fiction",
    "19th Century",
    "Literature",
    "Novels"
  ],
  "author": "Honoré de Balzac",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/7936879-ger-e-i-aray"
}