{
  "title": "Nemesis",
  "description": "The much awaited latest installment in this New York Times bestselling series brings Marcus Didius Falco back to the city of Rome and its deadly, convoluted intrigues\n \n\nIn the high summer of A.D. 77, Roman informer Marcus Didius Falco is beset by personal problems. Newly bereaved and facing unexpected upheavals in his life, it is a relief for him to consider someone else’s misfortunes. A middle-aged couple who supplied statues to his father, Geminus, have disappeared under mysterious circumstances. They had an old feud with a bunch of notorious freedmen, the Claudii, who live rough in the pestilential Pontine Marshes, terrorizing the neighborhood. When a mutilated corpse turns up near Rome, Falco and his vigiles friend Petronius investigate, even though it means traveling in the dread marshes. But just as they are making progress, the Chief Spy, Anacrites, snatches their case away from them. As his rivalry with Falco escalates, he makes false overtures of friendship, but fails to cover up the fact that the violent Claudii have acquired corrupt protection at the highest level. Making further enquiries after they have been warned off can only be dangerous—but when did that stop Falco and Petronius? Egged on by the slippery bureaucrats who hate Anacrites, the dogged friends dig deeper while a psychotic killer keeps taking more victims, and the shocking truth creeps closer and closer to home. After Alexandria, the first book in this long-running series to hit the New York Times Bestseller list, Lindsey Davis brings her beloved characters and series back to Rome in a book that brings together a number of long-running plot threads to surprising and compelling conclusions.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Crime",
    "Historical Mystery",
    "Audiobook"
  ],
  "author": "Lindsey Davis",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/7944002-nemesis"
}