{
  "title": "Aftermath: Prepare For and Survive Apocalypse 2012",
  "description": "In his celebrated previous book, Apocalypse 2012: An Investigation Into Civilization’s End , Lawrence E. Joseph appraised the likelihood of planet-wide catastrophe in 2012 by presenting convincing scientific evidence of looming chaos and even mass extinction.  Now, in    A Guide to Preparing For And Surviving Apocalypse 2012 he answers the most pressing question to arise from the What can we do to mitigate the coming cataclysm? Here Joseph presents the latest findings about the threats to our life on earth – including an all-out collapse of power grids and satellite systems resulting from solar flares expected to climax with unprecedented ferocity in 2012. Incipient plagues, famines, droughts and runaway global warming are also assessed for their catastrophic potential.  When it comes to formulating a response to an impending apocalypse, the field of options is narrow, but Joseph argues that there is plenty of constructive action that can be taken at the personal, local, national, and global level, individually and collectively, to prepare for, endure and emerge from disaster.  And Joseph takes readers beyond the end-of-the-world mania of the “Apoca-freaks,”  by offering visions of the post-apocalyptic future, ranging from the Enlightened Age the Maya foresaw to a re-drawn geopolitical map that could result from global upheaval.         Authoritative and written with Joseph’s trademark lighthearted skepticism and wit, AFTERMATH brings together investigative reportage from sources ranging from NASA and National Academy of Sciences to a shaman conclave in Siberia, to the Cave of the Apocalypse in Patmos, Greece, where the book of Revelation was written, plus historical research and scenario planning to offer pragmatic advice about how to control the damage should the world as we know it end in 2012.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Lawrence E. Joseph",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/7942228-aftermath"
}