{
  "title": "Escape From Davao: The Forgotten Story of the Most Daring Prison Break of the Pacific War",
  "description": "On April 4, 1943, ten American prisoners of war and two Filipino convicts executed a daring escape from one of Japan's most notorious prison camps. The prisoners were survivors of the infamous Bataan Death March and the Fall of Corregidor, and the prison from which they escaped was surrounded by an impenetrable swamp and reputedly escape-proof. Theirs was the only successful group escape from a Japanese POW camp during the Pacific war. Escape from Davao is the story of one of the most remarkable incidents in the Second World War and of what happened when the Americans returned home to tell the world what they had witnessed.Davao Penal Colony, on the southern Philippine island of Mindanao, was a prison plantation where thousands of American POWs toiled alongside Filipino criminals and suffered from tropical diseases and malnutrition, as well as the cruelty of their captors. The American servicemen were rotting in a hellhole from which escape was considered impossible, but ten of them, realizing that inaction meant certain death, planned to escape. Their bold plan succeeded with the help of Filipino allies, both patriots and the guerrillas who fought the Japanese sent to recapture them. Their trek to freedom repeatedly put the Americans in jeopardy, yet they eventually succeeded in returning home to the United States to fulfill their self-appointed to tell Americans about Japanese atrocities and to rally the country to the plight of their comrades still in captivity. But the government and the military had a different timetable for the liberation of the Philippines and ordered the men to remain silent. Their testimony, when it finally emerged, galvanized the nation behind the Pacific war effort and made the men celebrities. Over the decades this remarkable story, called the \"greatest story of the war in the Pacific\" by the War Department in 1944, has faded away. Because of wartime censorship, the full story has never been told until now. John D. Lukacs spent years researching this heroic event, interviewing survivors, reading their letters, searching archival documents, and traveling to the decaying prison camp and its surroundings. His dramatic, gripping account of the escape brings this remarkable tale back to life, where a new generation can admire the resourcefulness and patriotism of the men who fought the Pacific war.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Military History",
    "Military Fiction",
    "Biography"
  ],
  "author": "John D. Lukacs",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/7939297-escape-from-davao"
}