{
  "title": "The Alchemaster’s Apprentice: A Culinary Tale from Zamonia by Optimus Yarnspinner",
  "description": "A cat-like creature foils the plans of an evil alchemist in this comic fantasy by the author of The City of Dreaming Books.Malaisea, the unhealthiest town in the whole of Zamonia, is home to Echo the Crat, a multitalented creature resembling a cat in appearance but capable of speaking any language under the sun, human or animal.When his mistress dies, Echo finds himself out on the street. Dying of starvation, he is compelled to sign a contract with Ghoolion the Alchemaster, Malaisea’s evil alchemist-in-chief. This fateful document gives Ghoolion the right to kill Echo at the next full moon and render him down for his fat, with which he hopes to brew an alchemical concoction that will make him immortal. In return, he promises to regale the little Crat with the most exquisite gastronomic delicacies until his time is up. But Ghoolion has reckoned without Echo’s talent for survival and his ability to make new friends.Walter Moers’s magnificent translation of Optimus Yarnspinner’s novel introduces us to yet another of Zamonia’s hotbeds of adventure: Malaisea, a place where sick is healthy, up is down, right is wrong, and Ghoolion the Alchemaster reigns supreme—until Echo crosses his path.Praise for The Alchemaster’s Apprentice“Cheerfully insane. . . . Remains lively and inventive right through the final heroic battle between good and evil.” —New York Times Book Review“Moers’s creative mind is like J. K. Rowling’s on ecstasy; his book reads like a collision between The Hitchhiker's Guide to the Galaxy and the Brothers Grimm. . . . What a delightful book.” —Detroit News and Free Press“Relentlessly whimsical.” —Library Journal“Cross The Lord of the Rings with Yellow Submarine, throw in dashes of Monty Python, Douglas Adams, Shrek, and The Princess Bride . . . That’s the sort of alchemy in which this sprawling novel trades.” —Kirkus Reviews",
  "genres": [
    "Fiction",
    "Humor",
    "German Literature",
    "Fantasy",
    "Audiobook",
    "Young Adult",
    "High Fantasy"
  ],
  "author": "Walter Moers",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/7941528-the-alchemaster-s-apprentice"
}