{
  "title": "The End and the Beginning: Pope John Paul II -- The Victory of Freedom, the Last Years, the Legacy",
  "description": "“As March gave way to April in the spring of 2005 and the world kept vigil outside the apostolic palace in Rome, the pontificate of Pope John Paul II, then drawing to a poignant end, was already being described as one of the most consequential in two millennia of Christian history.” With these words, world-renowned author and NBC Vatican analyst George Weigel begins his long-awaited sequel to the international bestseller  Witness to The Biography of Pope John Paul II. More than ten years in the making, The End and the Pope John Paul II—The Victory of Freedom, the Last Years, the Legacy  tells the dramatic story of the Pope’s battle with communism in light of new and recently disclosed information and brings to a close Weigel’s landmark portrait of a man who not only left an indelible mark on the Catholic Church, but also changed the course of world history. When he was elected pope in the fall of 1978, few people had ever heard of the charismatic Karol Wojty³a. But in a very short time he would ignite a revolution of conscience in his native Poland that would ultimately lead to the collapse of European communism and death of the Soviet Union. What even fewer people knew was that the KGB, the Polish Secret Police, and the East German Stasi had been waging a dangerous, decades-long war against Wojty³a and the Vatican itself. Weigel, with unprecedented access to many Soviet-era documents, chronicles John Paul’s struggle against the dark forces of communism. Moreover, Weigel recounts the tumultuous last years of John Paul’s life as he dealt with a crippling illness as well as the “new world disorder” and revelations about corruption within the Catholic Church. Weigel’s thought-provoking biography of John Paul II concludes with a probing and passionate assessment of a man who lived his life as a witness to hope in service to the Christian ideals he embraced.",
  "genres": [
    "Biography",
    "Religion",
    "Catholic",
    "Nonfiction",
    "History",
    "Spirituality",
    "Christian"
  ],
  "author": "George Weigel",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/7939034-the-end-and-the-beginning"
}