{
  "title": "Living for the Revolution: Black Feminist Organizations, 1968-1980",
  "description": "The first in-depth analysis of the black feminist movement, Living for the Revolution fills in a crucial but overlooked chapter in African American, women’s, and social movement history. Through original oral history interviews with key activists and analysis of previously unexamined organizational records, Kimberly Springer traces the emergence, life, and decline of several black feminist organizations: the Third World Women’s Alliance, Black Women Organized for Action, the National Black Feminist Organization, the National Alliance of Black Feminists, and the Combahee River Collective. The first of these to form was founded in 1968; all five were defunct by 1980. Springer demonstrates that these organizations led the way in articulating an activist vision formed by the intersections of race, gender, class, and sexuality.The organizations that Springer examines were the first to explicitly use feminist theory to further the work of previous black women’s organizations. As she describes, they emerged in response to marginalization in the civil rights and women’s movements, stereotyping in popular culture, and misrepresentation in public policy. Springer compares the organizations’ ideologies, goals, activities, memberships, leadership styles, finances, and communication strategies. Reflecting on the conflicts, lack of resources, and burnout that led to the demise of these groups, she considers the future of black feminist organizing, particularly at the national level. Living for the Revolution is an essential reference: it provides the history of a movement that influenced black feminist theory and civil rights activism for decades to come.",
  "genres": [
    "Feminism",
    "History",
    "Nonfiction",
    "Politics",
    "Race",
    "Social Justice",
    "African American"
  ],
  "author": "Kimberly Springer",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/794664.Living_for_the_Revolution"
}