{
  "title": "Hollywood Stories: Short, Entertaining Anecdotes about the Stars and Legends of the Movies!",
  "description": "At high noon on a cold November day in 1974, sixty-seven-year-old John Wayne faced off with the staff of the Harvard Lampoon on the famous campus in Cambridge, Massachusetts. The students had issued their challenge by calling the beloved American icon a fraud. Wayne, who had his new movie McQ to promote, responded by saying he would be happy to show his film in the pseudo-intellectual swamps of Harvard Square. After the screening, without writers, the former USC footballer delivered a classic performance. When one smart young man asked where he got his phony toupee, Wayne insisted the hair was real. It wasn t his, but it was real. The appreciative underclassmen loved him and after the Q and A session, they all sat down to dinner. Later Wayne, who was suffering greatly from both gout and the after effects of lung cancer (sadly the Duke only had five years to live), said that day at Harvard was the best time he ever had.Just when you thought you've heard everything about Hollywood comes a totally original new book. Hollywood Short, Entertaining Anecdotes About the Stars and Legends of the Movies! by Stephen Schochet contains a timeless treasure trove of colorful vignettes featuring an amazing all-star cast of icons including John Wayne, Charlie Chaplin, Walt Disney, Jack Nicholson, Johnny Depp, Shirley Temple, Marilyn Monroe, Marlon Brando, Errol Flynn and many others both past and contemporary.A special blend of biography, history and lore Hollywood Stories is full of humorous tales often with unexpected endings. What makes the book unique is that the reader can go to any page and find a completely engaging and illuminating yarn. Sometimes people won't realize that they are reading about The Three Stooges or Popeye the Sailor until they come to the end of the story.A professional tour guide in Hollywood, Stephen Schochet has researched and told thousands of entertaining anecdotes for over twenty years. He is also the author and narrator of two audiobooks Tales of Hollywood and Fascinating Walt Disney. Tim Sika, host of the radio show Celluloid Dreams on KSJS in San Jose has called Stephen, \"The best storyteller about Hollywood we have ever heard.\"",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Short Stories",
    "Humor",
    "Anthologies"
  ],
  "author": "Stephen Schochet",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/7946159-hollywood-stories"
}