{
  "title": "New Dawn: The Battles for Fallujah",
  "description": "GOLD MEDAL FOR NON-FICTION, HISTORY, 2010, MILITARY WRITERS SOCIETY OF AMERICAFallujah. Few names conjure up as many images of blood, sacrifice, and valor as does this ancient city in Al Anbar province forty miles west of Baghdad. This sprawling concrete jungle was the scene of two major U.S. combat operations in 2004. The first was Operation Vigilant Resolve, an aborted effort that April by U.S. Marines intent on punishing the city’s insurgents. The second, Operation Phantom Fury, was launched seven months later. Richard Lowry’s 'New The Battles for Fallujah' is the first comprehensive history of this fighting.Also known as the Second Battle for Fallujah, Operation Phantom Fury was a protracted house-to-house and street-to-street combat that began on November 7 and continued unabated for seven bloody and exhausting weeks. It was the largest fight of Operation Iraqi Freedom and the heaviest urban combat since the Battle of Hue City, Vietnam in 1968. Death and redemption were found everywhere, from narrow streets to courtyards, kitchens, bedrooms, and rooftops. By the time the fighting ended, more than 1,400 insurgents were dead, compared to ninety-five Americans (and another 1,000 wounded).Lowry (Marines in the Garden of Eden) spent years researching and writing his new campaign history. In addition to archival research, New Dawn is based upon the personal recollections of nearly 200 soldiers and Marines who participated in the battles for Fallujah, from the commanding generals who planned the operations to the privates who kicked in the doors. The result is a gripping, page-turning narrative of individual sacrifice and valor that also documents the battles for future military historians.The struggle against a determined enemy at the crossroads of civilization is the story of American kids who grew up down the block from you only to fly halfway around the world to fight in the largest battle of the war. 'New Dawn' is about their courage, their sacrifice, and their commitment to freedom. And it is a story you will never forget. “In New Dawn, Richard Lowry presents not just a brilliant account of the battle for Fallujah, but also a useful overview of the history, economics, and culture of the region. Lowry shows what’s great about the US skilled and powerful but also humanitarian and ultimately peace-seeking. Lowry’s book is a must-read for anyone interested in how we won in Iraq.” Newt Gingrich, bestselling author and former Speaker of the House of RepresentativesAbout the Richard S. Lowry is an internationally recognized military historian, public speaker, and author. He is a Vietnam-era veteran of the United States Submarine Service, husband, father of three sons, and longtime resident of Orlando, Florida. He has published The Gulf War Chronicles (iUniverse, 2003 and iUniverse Star, 2008), Marines in the Garden of Eden (Berkley Caliber, 2006 and 2007), and US Marine in Operation Iraqi Freedom, 2003 (Osprey, 2006). Additionally, he contributed to Small Unit Actions (United States Marine Corps History Division, 2008) and was commissioned by the History Division to write a battle study of Task Force Tarawa’s involvement in the 2003 invasion. He has been published in The Weekly Standard, Armchair General, Military Magazine, and The Marine Corps Gazette. In 2008, Richard was the military consultant for David C. Taylor’s award-winning documentary film, “Perfect Valor.” The majority of the stories in “Perfect Valor” are pulled from the pages of New Dawn.In 2006, Marines in the Garden of Eden won the Silver Medal for history from the Military Writers Society of America. The Gulf War Chronicles also received recognition from MWSA in 2006 and has achieved Editor’s Choice, Reader’s Choice, and STAR distinction from iUniverse. “Perfect Valor” earned the Best Feature Documentary Award at the 2009 GI Film Festival. A compelling writer and captivating public speaker, Richard has established himself as a contemporary expert on the war in Iraq with a substantial radio, television, and internet following.",
  "genres": [
    "History",
    "Military Fiction",
    "War",
    "Military History",
    "Nonfiction"
  ],
  "author": "Richard S. Lowry",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/7945294-new-dawn"
}