{
  "title": "Trio of Sorcery (Diana Tregarde, #0.5)",
  "description": "New York Times and USA Today bestselling author Mercedes Lackey presents three exciting short urban fantasy novels featuring three resourceful heroines and three different takes on the modern world and on magics both modern and ancient.Arcanum 101:  Diana Tregarde, practicing witch, romance novelist, Guardian of the Earth. Studying at Harvard, Diana is approached by Joe O'Brian, a young cop who has already seen more than one unusual thing during his budding career. The distraught mother of a kidnap victim is taking advice from a \"psychic\" and interfering in the police investigation. Will Diana prove that the psychic is a fake? Unfortunately, the psychic is not a fake, but a very wicked witch—and the child's kidnapper.Drums: Jennifer Talldeer, shaman, private investigator, member of the Osage tribe. Most of Jennie's work is regular PI stuff, but Nathan Begay brings her a problem she's never seen before. His girlfriend, Caroline, is Chickasaw to his Navaho, but that's not the problem. Somehow, Caroline has attracted the attention of an angry Osage ghost. Thwarted in love while alive, the ghost has chosen Caroline to be his bride in death.Ghost in the Machine: Ellen McBride: computer programmer extraordinaire, techno-shaman. The programmers and players of a new MMORPG find that the game's \"boss,\" a wendigo, is \"killing\" everyone—even the programmers' characters with their god-like powers. A brilliant debugger, Ellen discovers that the massive computing power of the game's servers have created a breach between the supernatural world and our own. This wendigo isn't a bit of code, it's the real thing . . . and it's on the brink of breaking out of the computers and into the real world.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Short Stories",
    "Paranormal",
    "Magic",
    "Anthologies",
    "Witches"
  ],
  "author": "Mercedes Lackey",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/7944201-trio-of-sorcery-diana-tregarde-0-5"
}