{
  "title": "Texas Roads",
  "description": "From this bestselling page-turner series of stand-alone novels comes a dramatic romance of one woman's search for home and the Texas rancher who teaches her what home really means. A disillusioned heiress wants nothing more than a place to call home. With lovable-but-quirky town folks, quaint country charm, and loads of business potential, Miller's Creek seems like the perfect place to start over. But Dani's dreams of finding home are crushed when malicious rumors and a devastating secret propel her down a road she never expected to travel.Though a Texas politician questions the arrival of this city gal in the hometown he's sworn to protect and defend, Steve can't help but admit he's falling for her. But when a mysterious billionaire funds a renovation to downtown Miller's Creek, Dani's suspicious behavior brings his built-in lie detector to alarm-clanging alert.Can Steve and Dani call a truce for a higher calling? Will romance blossom in Miller's Creek? And will Dani ever find true home? Written with the feel of Mayberry and the Mitford series, readers have fallen in love with Miller's Creek. Will you? If you enjoy Christian contemporary romance and inspirational women's fiction, don't miss this feel-good novel. Get your copy today. WHAT READERS ARE SAYING... \"Page Turner! I absolutely loved this book!\" \" I loved the bantering between Steve and Dani and the romance they shared. They made the perfect couple. Both stubborn and bullheaded and the humor between them was really magical.\" \"I too fell in love with Miller's Creek...\" \"What an excellent inspirational romance book with some mystery and a topic of finding home.\" \"This book was non-stop 'just a little further' until suddenly I was at the end!\" \"The author did a remarkable job of developing her characters in the book's story line....I am anxious to read the next Miller's Creek book and highly recommend Texas Roads for Christian fiction readers.\" \"This is a heartfelt and sometimes heart-rending story; well-written, gripping,thoroughly enjoyable, and spellbinding.\" OTHER Western RomanceChristian Dramatic RomanceInspirational Women's FictionInspirational Politician RomanceChristian Renovation FictionChristian FictionWomen's Religious Fiction",
  "genres": [
    "Christian Fiction",
    "Romance",
    "Christian",
    "Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Christian Romance"
  ],
  "author": "Cathy Bryant",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/7947636-texas-roads"
}