{
  "title": "The Radical Right",
  "description": "Two vivid sets of images epitomize the dramatic course of the American right in the last quarter of the twentieth century. The main image is of a triumphant President Ronald Reagan, reasonably viewed as the most effec-tive president of recent decades. A second set of images comes from the bombing of a government building in Oklahoma City by Timothy McVeigh, a man linked to shadowy parts of the contemporary ultraright. The roots of Reaganism are conservative, intellectual, and political movements of the 1950s and 1960s, including currents that in those years were considered marginal and ex-tremist. The roots of the ultraright of the 1990s have intersecting though by no means identical sources. Serious evaluation of the American right should begin with The Radical Right. It describes the main positions and composition of distinctive forces on the right in the first half of the 1950s and the next decade. It recognizes the right's vehement opposition to domestic and international Communism, its sharp rejec-tion of the New Deal, and its difficulty in distinguishing between the two. Bell's controversial point of departure is to regard the basic position of what he terms the radical right as excessive in its estimation of the Communist threat and unrealistic in its rejection of New Deal reforms. From this starting point, Bell and his authors evaluate the ways the right went beyond programs and the self-descriptions of its leaders and organizers. The Radical Right explains McCarthyism and its successors in terms of conflicts over social status and the shape of American culture. Daniel Bell focuses on the social dislo-cation of significant groups in the post-New Deal decades. Many members of these groups perceived themselves as dispossessed and victimized by recent changes, even if it was not possible to regard them as having undergone any great suffering. David Plotke's major new introduction discusses the book's argument, McCarthyism and American politics, the changing shape of the American right from 1965-2000, mili-tias, and new issues in American politics. This edition also includes an afterword by Daniel Bell responding to Plotke's interpretation and revisiting his own perspectives.",
  "genres": [
    "Politics",
    "Philosophy",
    "Nonfiction",
    "American History",
    "History"
  ],
  "author": "Daniel Bell",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/795156.The_Radical_Right"
}