{
  "title": "The Chicago Manual of Style",
  "description": "The 15th edition of \nThe Chicago Manual of Style\n has been superseded by the 17th edition.\nIn the 1890s, a proofreader at the University of Chicago Press prepared a single sheet of typographic fundamentals intended as a guide for the University community. That sheet grew into a pamphlet, and the pamphlet grew into a book—the first edition of the Manual of Style, published in 1906. Now in its fifteenth edition, The Chicago Manual of Style—the essential reference for authors, editors, proofreaders, indexers, copywriters, designers, and publishers in any field—is more comprehensive and easier to use than ever before.Those who work with words know how dramatically publishing has changed in the past decade, with technology now informing and influencing every stage of the writing and publishing process. In creating the fifteenth edition of the Manual, Chicago's renowned editorial staff drew on direct experience of these changes, as well as on the recommendations of the Manual's first advisory board, composed of a distinguished group of scholars, authors, and professionals from a wide range of publishing and business environments.Every aspect of coverage has been examined and brought up to date—from publishing formats to editorial style and method, from documentation of electronic sources to book design and production, and everything in between. In addition to books, the Manual now also treats journals and electronic publications. All chapters are written for the electronic age, with advice on how to prepare and edit manuscripts online, handle copyright and permissions issues raised by technology, use new methods of preparing mathematical copy, and cite electronic and online sources.A new chapter covers American English grammar and usage, outlining the grammatical structure of English, showing how to put words and phrases together to achieve clarity, and identifying common errors. The two chapters on documentation have been reorganized and updated: the first now describes the two main systems preferred by Chicago, and the second discusses specific elements and subject matter, with examples of both systems. Coverage of design and manufacturing has been streamlined to reflect what writers and editors need to know about current procedures. And, to make it easier to search for information, each numbered paragraph throughout the Manual is now introduced by a descriptive heading.Clear, concise, and replete with commonsense advice, The Chicago Manual of Style, fifteenth edition, offers the wisdom of a hundred years of editorial practice while including a wealth of new topics and updated perspectives. For anyone who works with words, whether on a page or computer screen, this continues to be the one reference book you simply must have.What's new in the Fifteenth Edition:* Updated material throughout to reflect current style, technology, and professional practice* Scope expanded to include journals and electronic publications* Comprehensive new chapter on American English grammar and usage by Bryan A. Garner (author of A Dictionary of Modern American Usage)* Updated and rewritten chapter on preparing mathematical copy* Reorganized and updated chapters on documentation, including guidance on citing electronic sources* Streamlined coverage of current design and production processes, with a glossary of key terms* Descriptive headings on all numbered paragraphs for ease of reference* New diagrams of the editing and production processes for both books and journals, keyed to chapter discussions* New, expanded Web site with special tools and features for Manual users at www.chicagomanualofstyle.org.",
  "genres": [
    "Reference",
    "Writing",
    "Nonfiction",
    "Language",
    "Research",
    "Academic",
    "Education"
  ],
  "author": "University of Chicago Press",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/103362.The_Chicago_Manual_of_Style"
}