{
  "title": "Stuff: Compulsive Hoarding and the Meaning of Things",
  "description": "A New York Times BestsellerAcclaimed psychologists Randy Frost and Gail Sketetee's groundbreaking study on the compulsion of hoarding, \" Stuff invites readers to reevaluate their desire for things” ( Boston Globe ).What possesses someone to save every scrap of paper that’s ever come into his home? What compulsions drive a woman like Irene, whose hoarding cost her her marriage? Or Ralph, whose imagined uses for castoff items like leaky old buckets almost lost him his house? Or Jerry and Alvin, wealthy twin bachelors who filled up matching luxury apartments with countless pieces of fine art, not even leaving themselves room to sleep?When Frost and Steketee became the first scientists to study hoarding, they expected to find a few sufferers. Instead, they uncovered an epidemic, treating hundreds of patients and fielding thousands of calls from the families of others, exploring the compulsion through a series of compelling case studies in the vein of Oliver Sacks.With vivid portraits that show us the traits by which you can identify a hoarder—piles on sofas and beds that make the furniture useless, houses that can be navigated only by following small paths called goat trails, vast piles of paper that the hoarders “churn” but never discard, even collections of animals and garbage—Frost and Steketee explain the causes and outline the often ineffective treatments for the disorder.They also illuminate the pull that possessions exert on all of us.Whether we’re savers, collectors, or compulsive cleaners, none of us is free of the impulses that drive hoarders to the extremes in which they live. For the six million sufferers, their relatives and friends, and all the rest of us with complicated relationships to our things, Stuff answers the question of what happens when our stuff starts to own us.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Mental Health",
    "Science",
    "Self Help",
    "Mental Illness",
    "Sociology"
  ],
  "author": "Randy O. Frost",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/7951336-stuff"
}