{
  "title": "Rock & Roll Rip-Off",
  "description": "Jason Duffy thought he had accepted a routine burglary case when a career studio musician hired him to recover a memorabilia collection featuring unusual treasures from some of the top performers in the music industry. But Jason quickly finds himself at the top of a hit list that has nothing to do with The Top 40 and everything to do with a table for one at the San Diego Coroners Office. While the facts of the case point to an emo band that the victim was helping at the time of the theft, the lethal force that Jason encounters in his investigation feels more like death metal. He finds himself imperiled by a hitman known as The Heartbreaker, due to his signature of shooting his victims through the heart at close range. With danger also threatening his staff and girlfriend, Jason must continue to mend fences with his retired police detective father, in spite of a recent riff that caused a setback to their relationship. Everyone thought The Tactile Tattoo was a cant miss band. The pre-release buzz for their first CD was tremendous. But a bad review from a key industry critic, who didnt care for their lyrics, left the album stillborn at record stores across the country. The group soon learned that second chances in the current state of the music business are practically nonexistent. One band member discovered that money talks in an industry strapped for cash, and a bribe was entirely possible. However, funding that bribe meant getting involved with all of the wrong people. The reader is treated to an insiders view of the music industry that captures the new obstacles that todays bands must overcome in order to succeed. Rock & Roll Rip-Off is the second novel in RJ McDonnells Rock & Roll Mystery Series. Like the critically acclaimed Rock & Roll Homicide, McDonnell once again mixes humor, music, and a cast of unique characters to unfold a memorable mystery that shows Jason and a loved one knock, knock, knockin on heavens door.",
  "genres": [
    "Mystery",
    "Fiction"
  ],
  "author": "R.J. McDonnell",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/7951250-rock-roll-rip-off"
}