{
  "title": "Falcon Seven",
  "description": "New York Times bestselling author James W. Huston returns with his most powerful thriller to date. Exploding with international intrigue, sizzling courtroom drama, and heart-stopping action, Falcon Seven delivers an all-too-realistic tale of America under fire.A U.S. Navy F/A-18 flying over Afghanistan is suddenly diverted and ordered to bomb a building in Pakistan, where a meeting between al Qaeda and the Taliban is taking place. After destroying their target, the fighter jet is immediately hit by Stinger missiles and the pilots eject over Pakistan. They are captured, assaulted, and dragged through the streets of Peshawar. The world is on edge.The fliers are quickly forced onto a secret Falcon jet headed for the Netherlands, where they’ll stand trial for war crimes at the International Criminal Court. The building they hit was actually a medical post constructed by Europeans for Afghan refugees---and sixty-five innocent people were killed.It’s up to Washington criminal defense lawyer and former Navy SEAL Jack Caskey to defend the two navy officers and get to the bottom on what is beginning to seem like an orchestrated event. The National Security Council pushes President Obama to employ the act passed under George W. Bush that authorizes the use of force to extract Americans held by the International Criminal Court. While the president initially approves a special operations team to grab the Americans, he later withdraws to cooperate with the ICC. Already fighting a losing battle for his clients, an outraged Caskey works with his contacts in the shadowy world of special operations and CIA operatives to free his clients himself . . . or help them battle through an international show trial and face imprisonment---for life.",
  "genres": [
    "Thriller",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Military Fiction"
  ],
  "author": "James W. Huston",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/7953969-falcon-seven"
}