{
  "title": "شرفة العار",
  "description": "صدر للشاعر والروائي \"إبراهيم نصر الله\" رواية جديدة عنونها بـ \"شرفة العار\" وهي الرواية الثالثة من ضمن مشروعه الروائي \"الشرفات\" والذي يضم عدداً من الروايات لكل منها استقلالها التام عن الروايات الأخرى. وكعادته يبقى إبراهيم نصر الله خير من يُعبّر عن تناقضات الحياة الاجتماعية وخير ناقدٍ وأفضل من ينقل صوره بجرأة بالغة ونادرة عبر كسر الشكل الروائي التقليدي، وهو يتصدى الآن لمعالجة قضية راهنة شديدة الحساسية ومثيرة للقلق في آن معاً \"جرائم الشرف\" ضحاياها نساء ظُلموا من الأهل والمجتمع معاً، قليلو الحيلة، أمام قسوة المجتمع وعاداته وتقاليده وأطره الثقافية المعلبة التي تريد صنع فتاة كدمية متحركة في بيت العائلة وبيت الزوجية في آنٍ معاً. هي شرفات أراد الروائي أن يطل منها على واقع الحال الذي تعيشه المرأة العربية وخصوصاً في الطبقة المتوسطة والفقيرة من خلال وضعه كل خبراته الجمالية والمعرفية والإبداعية في شخصية \"منال\" الذي أصر والدها على تعليمها وقدم لها الدعم اللازم حتى تخرجها واستلامها وظيفة كمشرفة اجتماعية، وجدت حينها أن العالم بالنسبة لها، كما لو أنه اتسع فجأة. ولكن؟ فجأة تتغير حياتها ويحدث ما لا تحمد عقباه! \"فجأة فتح يونس باب السيارة من الخارج، وفي أقل من ثانية أحسَّتْ منال ببرودة نصْل ذلك الخنجر على رقبتها. \"سأذبحك إذا تنفَّستِ\"! (...) أمام باب تلك الغرفة الصغيرة، وقف لحظة، ثم دفع الباب بقدمه اليمنى فانفتح، دخلا. أغلق الباب بقدمه، وفي حركة سريعة رفع الخنجر عن رقبتها، ألصقَ ظهرها بالباب، وأعاد الخنجر لمكانه، وبيده الطليقة أدار المفتاح. في تلك اللحظة كان على ثقة من أن فريسته فقدتْ كلَّ قوتها، كما فقدت صوتها؛ ارتمت يداها إلى جانبيها كقطعتي قماش باليتين على حبل غسيل، جرّها نحو ذلك السرير، أشعل تلك اللمبة الحمراء الصغيرة، التي يبدو أنه أعدَّها خصيصاً لتلك اللحظة، وتحت ضوئها الثقيل كان بإمكانها رؤية وجه الإنسان وهو يتحوّل إلى وجه وحش\". فماذا حدث بعد ذلك؟ هذا ما سوف نكتشفه معاً عند قراءتنا لهذه الرواية الهادفة والتي أراد لها مؤلفها أن تكون صرخة مدوية في وجه كل من يحرم المرأة إنسانيتها وحقها في الحياة وفي الاختيار وفي الدفاع عن نفسها.",
  "genres": [
    "Novels",
    "Fiction",
    "Feminism"
  ],
  "author": "Ibrahim Nasrallah",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/7953734"
}