{
  "title": "Tablet & Pen: Literary Landscapes from the Modern Middle East",
  "description": "A Words Without Borders Anthology“Remarkable . . . a triumph . . . connects us at the level of our humanity, no matter where we may be from.”― Los Angeles Times The countries that stretch along the broad horizons of the Middle East―from Morocco to Iran, from Turkey to Pakistan―boast different cultures, different languages, and different religions. Yet the literary landscape of this dynamic part of the world has been bound together not by borders and nationalities, but by a common experience of Western imperialism. Keenly aware of the collected scars left by a legacy of colonial rule, the acclaimed writer Reza Aslan, with a team of four regional editors and seventy-seven translators, cogently demonstrates with Tablet and Pen how literature can, in fact, be used to form identity and serve as an extraordinary chronicle of the disrupted histories of the region.Acting with Words Without Borders, which fosters international exchange through translation and publication of the world’s finest literature, Aslan has purposefully situated this volume in the twentieth century, beyond the familiar confines of the Ottoman past, believing that the writers who have emerged in the last hundred years have not received their full due. This monumental collection, therefore, of nearly two hundred pieces, including short stories, novels, memoirs, essays and works of drama―many of them presented in English for the first time―features translated works from Arabic, Persian, Urdu, and Turkish. Organized chronologically, the volume spans a century of literature―from the famed Arab poet Khalil Gibran to the Nobel laureates Naguib Mahfouz and Orhan Pamuk, from the great Syrian-Lebanese poet Adonis to the grand dame of Urdu fiction, Ismat Chughtai―connected by the extraordinarily rich tradition of resplendent cultures that have been all too often ignored by the Western canon.By shifting America’s perception of the Middle Eastern world away from religion and politics, Tablet and Pen evokes the splendors of a region through the voices of its writers and poets, whose literature tells an urgent and liberating story. With a wealth of contextual information that places the writing within the historical, political, and cultural breadth of the region, Tablet & Pen is transcendent, a book to be devoured as a single sustained narrative, from the first page to the last. Creating a vital bridge between two estranged cultures, \"this is that rare anthology: cohesive, affecting, and informing\" ( Publishers Weekly ).",
  "genres": [
    "Poetry",
    "Fiction",
    "Short Stories",
    "Literature",
    "Anthologies",
    "Religion",
    "Islam"
  ],
  "author": "Reza Aslan",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/7958806-tablet-pen"
}