{
  "title": "Magic Street",
  "description": "“A modern suburban fantasy . . . There are quests and complications, conflicts and charms. . . . Card’s back in top form, doing as well as or better than any of his fantasy work so far.”— The San Diego Union-TribuneIn a prosperous African American neighborhood in Los Angeles, infant Mack Street is found abandoned in an overgrown park and taken in by a blunt-speaking single woman. Growing up, Mack senses that he is different from most, and knows that he has strange powers. Yet he cannot possibly understand how unusual he is until the day he discovers, beyond a mysterious narrow house no one else can see, an entryway into a magical world. Passing through, Mack is plunged into a realm where time and reality are skewed, a place where his actions seem to have disturbing effects in the “real world.” Whether he likes it or not, Mack has become a player in an epic drama. His reward, if he can survive the trip, is discovering not only who he really is . . . but why he exists.Praise for Magic Street“A great read . . . Card’s take on his characters [is] as sure as ever, his narrative rock solid, his dialogue crackling and authentic.” — Los Angeles Times Book Review“[Card] is a master at creating a sense of urgency that keeps you turning pages.” — The Charlotte Observer “Mind-bending . . . Card’s clever tale comes with sharp writing and crisp dialogue.” — The Tampa Tribune “Compelling . . . By the time the ultimate conflict comes into focus, the novel is propelling the reader forward like a bullet.” — Deseret Morning News “A suspenseful fantasy thriller that, during the race to the last page, has one mulling over myth, morals, salvation, and will.” — Booklist",
  "genres": [
    "Fantasy",
    "Fiction",
    "Urban Fantasy",
    "Science Fiction",
    "Magic",
    "Audiobook",
    "Science Fiction Fantasy"
  ],
  "author": "Orson Scott Card",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/7964.Magic_Street"
}