{
  "title": "What to Remember When Waking: The Disciplines of an Everyday Life",
  "description": "Essential Skills for a Full and Courageous LifeWhen you think about personal transformation, do you have a picture of who you want to become? Many of us unconsciously create an idealized image of our “awakened” selves―and in doing so, reveals David Whyte, we undermine both the work and reward of genuine transformation.On What to Remember When Waking , this celebrated poet and teacher offers wisdom for building the essential disciplines that will see us through the difficulties of our human journey―skills of trust, vulnerability, momentum, and courage in the face of the unknown.Engage in the Great Conversation That Defines Your LifeOur lives are defined by what David Whyte calls the “great conversation”―a give- and-take relationship between our vision of ourselves and the unfolding mystery of reality. Yet there are many conscious and unconscious ways that we often avoid living at this ever-moving frontier. Do you diminish life by attempting to assign names to everything instead of living more robustly with the unknown? Are you turning a blind eye to the invisible help that is all around you? With penetrating insight and gentle guidance, Whyte illuminates the core competencies that you must build in order to fully engage in the richness that life offers―and to express your true work in the world.What You Can Plan Is Too Small for You to Live“We do not always move forward because of the plans we make or the effort we expend,” teaches David Whyte. “The conversation itself more often does the true work of transformation.” Make sure the conversation is alive and everything takes its place. Combining a teacher’s ability to provide practical guidance with a poet’s insight into the depths of the human soul, he presents a powerful resource for anyone seeking growth and fulfillment on life’s journey with What to Remember When Waking .Start where you are―ways of recognizing the first necessary steps to find your path• The gift of vulnerability―why lowering our defenses can enhance our perception, dedication, and joyfulness• Disciplines for cultivating the “fierce interior focus” that helps you maintain momentum in your life’s work• How embracing the feeling that you are out of place in the world can deepen your empathy and compassion for others• The art of knowing when to let your dreams mature in their own time• Beyond the \"pursuit of happiness\"―opening yourself to the deeper fulfillment available in the high and low points of life• Becoming an \"apprentice to life\"―how to approach new challenges with a sense of humility and wonder• Learning to delight in the unknown instead of trying to control it through labels and beliefs• Building a mature and welcoming relationship with death by embracing the richness that fragility brings to life• Over 5 1/2 hours of David Whyte's insights, poetry, and essential lessons for fully expressing your gifts in the world",
  "genres": [
    "Poetry",
    "Audiobook",
    "Spirituality",
    "Philosophy",
    "Self Help",
    "Nonfiction",
    "Psychology"
  ],
  "author": "David Whyte",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/7965157-what-to-remember-when-waking"
}