{
  "title": "The History of Early Rome",
  "description": "No ISBNPUBLISHER'S PREFACEIF two thousand years of popularity among serious readers can make a book a classic, Livy's History of Rome from Its Foundation is a classic. The Roman historian was a contemporary of the Emperor Augustus, the most famous of the many Romans who greatly admired Livy's work. If the History did not always attain the degree of scholarly accuracy demanded of modern historians, it had the praiseworthy virtues of style and readability.Livy has been universally commended for his imaginative sympathy, which lends vivacity and an impression of reality to his writing. This is true whether he is describing a warlike scene such as the sack of Rome by the Gauls, a domestic incident such as the violation and suicide of Lucretia, or a dramatic event such as that of Mucius Scaevola thrusting his right hand into the flame to prove his fortitude.It was the purpose of Titus Livius (to give him his Latin name) to preserve the memory of the noble deeds of the Roman people and to point out conspicuous examples of good and evil acts. His success was due in part to the deep enthusiasm he brought to the task, which he undertook around 26 B.C., in his thirty-third year, and continued almost until his death in A.D. 17.The History opens with the end of the Trojan War, the wanderings of Aeneas exiled from Troy and settling in Italy, the birth of Romulus and Remus, and the legendary founding of Rome by Romulus in 753 B.C. It proceeds with the first Roman kings, their overthrow, and the beginnings of the Republic. Livy actually carried his narrative all the way into his own times, ending with the events of A.D. 9. The vast completed text came to 142 \"books,\" though only 35 are extant. In this volume, The History of Early Rome, consisting of Books I-V, the chronicle stops shortly after 390 B.C., when Rome was sacked by the Gauls.Some of Livy's prefatory remarks ring a bell today. After praising his country and his countrymen he expresses a regret that \"of late years wealth has made us greedy, and self-indulgence has brought us, through every form of sensual excess,\" to what contemporary observers have called an alienation from life.The excellent translation used in this volume was made by Aubrey de Selincourt, an Oxford-trained classics scholar, whose introduction to the book reveals him to have been a man of wit and perspicacity.\"Much nonsense has been talked about the art of translation,\" he declares. \"Translators have claimed to reproduce the 'spirit' of the original: i.e., the subtlest inmost essence of Livy's style. It cannot be done: that subtlest essence lies within the words themselves; change the words and it, too, is inevitably changed. . . . To try to imitate the style of a foreign author who has been dead two thousand years is plain silly. The truth is that every writer, whether he is translating or not, can write in one style only: his own.\" The combination of the two writing styles of Titus Livius and Aubrey de Selincourt makes for an admirably readable text.",
  "genres": [
    "History",
    "Classics",
    "Nonfiction",
    "Ancient History",
    "Roman",
    "Ancient",
    "School"
  ],
  "author": "Livy",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/13092354-the-history-of-early-rome"
}