{
  "title": "The Phantom Coach: Collected Ghost Stories",
  "description": "Amelia B. Edwards is acknowledged as one of the best Victorian ghost story writers. She was one of the select band of authors invited by Charles Dickens to contribute ghost stories to the Christmas numbers of his magazine All the Year Round, and some of her tales—such as 'The Four-fifteen Express', 'Number Three', 'My Brother's Ghost Story', and the highly influential 'The Phantom Coach'—have become staples of ghost story anthologies.There was much more to Amelia Edwards than ghost stories, however, as Richard Dalby makes clear in his introduction. She was an indefatigable traveller, and she incorporated much of what she observed into her ghost stories, many of which are set in northern and central Europe. She was also an archaeologist of world renown, who was instrumental in ensuring that the treasures and antiquities of ancient Egypt were properly excavated and preserved.The Phantom Coach is the first book to collect together all of Amelia B. Edwards's supernatural fiction. In addition to all her known ghost stories, the volume also contains three additional items, including a delightful piece by Edwards herself about 'My Home Life': a fascinating look at one of the Victorian era's most fascinating women.Contents: Introduction by Richard Dalby; 'My Brother's Ghost Story'; 'The Eleventh of March'; 'Number Three'; 'The Discovery of the Treasure Isles'; 'The Phantom Coach'; 'The Recollections of Professor Henneberg'; 'An Engineer's Story'; 'The Four-fifteen Express'; 'The Story of Salome'; 'A Service of Danger'; 'The New Pass'; 'In the Confessional'; 'Sister Johanna's Story'; 'A Night on the Borders of the Black Forest'; 'Monsieur Maurice'; 'Was it an Illusion?'; Appendixes: 'Four Ghosts'; 'A Legend of Boisguilbert'; 'My Home Life'.",
  "genres": [
    "Horror",
    "Short Stories",
    "Classics",
    "Fiction",
    "Gothic",
    "Victorian",
    "Paranormal"
  ],
  "author": "Amelia B. Edwards",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/796173.The_Phantom_Coach"
}