{
  "title": "Teaching as a Subversive Activity",
  "description": "A no-holds-barred assault on outdated teaching methods—with dramatic and practical proposals on how education can be made relevant to today's world.Praise for Teaching As a Subversive Activity“A healthy dose of Postman and Weingartner is a good if they make even a dent in the pious . . . American classroom, the book will be worthwhile.” — New York Times Book Review “Teaching and knowledge are subversive in that they necessarily substitute awareness for guesswork, and knowledge for experience. Experience is no use in the world of Apollo 8. It is simply necessary to know. However, it is also necessary to know the effect of Apollo 8 in creating a new Global Theatre in which student and teacher alike are looking for roles. Postman and Weingartner make excellent theatrical producers in the new Global Theatre.” —Marshall McLuhan “It will take courage to read this book . . . but those who are asking honest questions—what’s wrong with the worlds in which we live, how do we build communication bridges cross the Generation Gap, what do they want from us?—these people will squirm in the discovery that the answers are really within themselves.” — Saturday Review “Neil Postman and Charles Weingartner go beyond the now-familiar indictments of American education to propose basic ways of liberating both teachers and students from becoming personnel rather than people . . . the authors have created what may become a primer of ‘the new education’ Their book is intended for anyone, teacher or not, who is concerned with sanity and survival in a world of precipitously rapid change, and it’s worth your reading.” — Playboy “This challenging, liberating book can unlock not only teachers but anyone for whom language and learning are not dead.” —Nat Hentoff",
  "genres": [
    "Education",
    "Nonfiction",
    "Teaching",
    "Philosophy",
    "Politics",
    "Sociology",
    "Psychology"
  ],
  "author": "Neil Postman",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/79681.Teaching_as_a_Subversive_Activity"
}