{
  "title": "Operation Dark Heart: Spycraft And Special Ops On The Frontlines Of Afghanistan- And The Path To Victory",
  "description": "Important Message for CustomersOn Friday, August 13, 2010, just as St. Martin’s Press was readying its initial shipment of Operation Dark Heart, the Department of Defense expressed concern that its publication could cause damage to U.S. national security. The publication of the initial edition was canceled. However, after consulting with the author, Lt. Col. Anthony Shaffer, St. Martin's Press agreed to incorporate some of the government’s changes, which includes redacting classified text, into a revised edition, which is releasing on September 24.Lieutenant Colonel Anthony Shaffer had run intelligence operations for years before he arrived in Afghanistan. He was part of the “dark side of the force”---the shadowy elements of the U.S. government that function outside the bounds of the normal system. His group called themselves the Jedi Knights and pledged to use the dark arts of espionage to protect the country from its enemies. Shaffer’s mission to Afghanistan, however, was unlike any he had ever experienced before. There, he led a black-ops team on the forefront of the military efforts to block the Taliban’s resurgence. They not only planned complex intelligence operations to beat back the insurgents, but also played a key role in executing those operations---outside the wire. They succeeded in striking at the core of the Taliban and their safe havens across the border in Pakistan. For a moment Shaffer saw us winning the war. Then the military brass got involved. The policies that top officials relied on were hopelessly flawed. Shaffer and his team were forced to sit and watch as the insurgency grew---just across the border in Pakistan. This wasn’t the first time he had seen bureaucracy stand in the way of national security. He had participated in Able Danger, the aborted intelligence operation that identified many of the future 9/11 terrorists but failed to pursue them. His attempt to reveal the truth to the 9/11 Commission would not go over well with his higher-ups. Operation Dark Heart tells the story of what really went on--and what went wrong--in Afghanistan. Shaffer witnessed firsthand the tipping point, when what seemed like certain victory turned into failure. Now, in this book, he maps out a way that could put us on the path to winning the war.“Anthony Shaffer has written a gripping account, filled with amazing detail, of an otherwise secret world. Shaffer has the instincts of a thriller writer and the knowledge and perspective of the professional insider. Operation Dark Heart is a fascinating page-turner.” -- Doug Stanton, author of Horse Soldiers “A fascinating look into the highly complex world of modern combat, clandestine intelligence and bureaucrats run amok. Tony Shaffer walks and runs us through a critical time in the history in the war in Afghanistan. From the opening to the closing, you are on the edge of your seat. Tony is, in all aspects, the real Jack Bauer - but with an intellect.”--Dr. Christopher M. Lehman, former Special Assistant to President Reagan, National Security Counsel",
  "genres": [
    "Military Fiction",
    "Nonfiction",
    "War",
    "History",
    "Banned Books",
    "Espionage",
    "Military History"
  ],
  "author": "Anthony  Shaffer",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/7971693-operation-dark-heart"
}