{
  "title": "American Indians, American Justice",
  "description": "Baffled by the stereotypes presented by Hollywood and much historical fiction, many other Americans find the contemporary American Indian an enigma. Compounding their confusion is the highly publicized struggle of the contemporary Indian for self-determination, lost land, cultural preservation, and fundamental human rights—a struggle dramatized both by public acts of protest and by precedent-setting legal actions. More and more, the battles of American Indians are fought—and won—in the political arena and the courts. American Indians, American Justice explores the complexities of the present Indian situation, particularly with regard to legal and political rights. It is the first book to present an overview of federal Indian law in language readably accessible to the layperson. Remarkably comprehensive, it is destined to become a standard sourcebook for all concerned with the plight of the contemporary Indian. Beginning with an examination of the historical relationship of Indians and the courts, the authors describe how tribal courts developed and operate today, and how they relate to federal and state governments. They define such key legal concepts as tribal sovereignty and Indian Country. By comparing and contrasting the workings of Indian and non-Indian legal institutions, the authors illustrate how Indian tribes have adapted their customs, values, and institutions to the demands of the modern world. Describing the activities of attorneys and Indian advocates in asserting and defending Indian rights, they identify the difficulties typically faced by Indians in the criminal and civil legal arenas and explore the public policy and legal rights of Indians as regards citizenship, voting rights, religious freedom, and basic governmental services.",
  "genres": [
    "Nonfiction",
    "Law",
    "Indigenous",
    "History",
    "Indigenous History",
    "Native American History",
    "Native Americans"
  ],
  "author": "Vine Deloria Jr.",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/797108.American_Indians_American_Justice"
}