{
  "title": "Road of Bones: The Siege of Kohima 1944 - The Epic Story of the Last Great Stand of Empire",
  "description": "Kohima. In this remote Indian village near the border with Burma, a tiny force of British and Indian troops faced the might of the Imperial Japanese Army. Outnumbered ten to one, the defenders fought the Japanese hand to hand in a battle that was amongst the most savage in modern warfare.A garrison of no more than 1,500 fighting men, desperately short of water and with the wounded compelled to lie in the open, faced a force of 15,000 Japanese. They held the pass and prevented a Japanese victory that would have proved disastrous for the British. Another six weeks of bitter fighting followed as British and Indian reinforcements strove to drive the enemy out of India. When the battle was over, a Japanese army that had invaded India on a mission of imperial conquest had suffered the worst defeat in its history. Thousands of men lay dead on a devastated landscape, while tens of thousands more Japanese starved in a catastrophic retreat eastwards. They called the journey back to Burma the ‘Road of Bones’, as friends and comrades committed suicide or dropped dead from hunger along the jungle paths.Fergal Keane has reported for the BBC from conflicts on every continent over the past 25 years, and he brings to this work of history not only rigorous scholarship but a raw understanding of the pitiless nature of war. It is a story filled with vivid characters: the millionaire's son who refused a commission and was awarded a VC for his sacrifice in battle, the Roedean debutante who led a guerrilla band in the jungle, and the General who defied the orders of a hated superior in order to save the lives of his men. Based on original research in Japan, Britain and India, ‘Road of Bones’ is a story about extraordinary courage and the folly of imperial dreams.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "War",
    "India",
    "Military History",
    "Military Fiction"
  ],
  "author": "Fergal Keane",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/7970720-road-of-bones"
}