{
  "title": "Halo: Cryptum",
  "description": "Halo: Cryptum, the first novel in the Forerunner Saga trilogy by science fiction legend Greg Bear, is set in the Halo universe and based on the New York Times bestselling video game series! It is a tale of life, death, intergalactic horror, exile, and maturity...a story of overwhelming change, and of human origins; For the Mantle may not lie upon the shoulders of Forerunners forever. 100,000 years ago, the galaxy was populated by a great variety of beings. But one species--eons beyond all others in both technology and knowledge--achieved dominance. They ruled in peace but met opposition with quick and brutal effectiveness. They were the Forerunners, the keepers of the Mantle, the next stage of life in the Universe's Living Time. And then they vanished. This is their story. Bornstellar Makes Eternal Lasting is a young rebellious Forerunner. He is a Manipular, untried, yet to become part of the adult Forerunner society, where vast knowledge and duty waits. He comes from a family of Builders, the Forerunners' highest and most politically powerful rate. It is the Builders who create the grand technology that facilitates Forerunner dominance over the known universe. It is the Builders who believe they must shoulder the greatest burden of the Mantle, as shepherds and guardians of all life. Bornstellar is marked to become a great Builder just like his father. But this Manipular has other plans. He is obsessed with lost treasures of the past. His reckless passion to seek out the marvelous artifacts left behind by the Precursors, long-vanished superbeings of unknowable power and intent, forces his father's hand. Bornstellar is sent to live among the Miners, where he must come to terms with where his duty truly lies. But powerful forces are at play. Forerunner society is at a major crux. Past threats are once again proving relentless. Dire solutions, machines and strategies never before contemplated, are being called up, and fissures in Forerunner power are leading to chaos. On a Lifeworker's experimental planet, Bornstellar's rebellious course crosses the paths of two humans, and the long lifeline of a great military leader, thus forever changing Bornstellar's destiny ...and the fate of the entire galaxy.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Video Games",
    "Audiobook",
    "Space Opera",
    "Novels",
    "Science Fiction Fantasy"
  ],
  "author": "Greg Bear",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/7975411-halo"
}