{
  "title": "Buddhism, Knowledge, and Liberation: A Philosophical Study",
  "description": "This text assesses the common Buddhist idea that knowledge of the three characteristics of existence (impermanence, not-self and suffering) is the key to liberation. It argues that this claim must be seen in the context of the Buddhist path and training as a whole.Buddhism is essentially a teaching about liberation - from suffering, ignorance, selfishness and continued rebirth. Knowledge of 'the way things really are' is thought by many Buddhists to be vital in bringing about this emancipation. This book is a philosophical study of the notion of liberating knowledge as it occurs in a range of Buddhist sources. Buddhism, Knowledge and Liberation assesses the common Buddhist idea that knowledge of the three characteristics of existence (impermanence, not-self and suffering) is the key to liberation. It argues that this claim must be seen in the context of the Buddhist path and training as a whole. Detailed attention is also given to anti-realist, sceptical and mystical strands within the Buddhist tradition, all of which make distinctive claims about liberating knowledge and the nature of reality. David Burton seeks to uncover various problematic assumptions which underpin the Buddhist worldview. Sensitive to the wide diversity of philosophical perspectives and interpretations that Buddhism has engendered, this book makes a serious contribution to critical and philosophically aware engagement with Buddhist thought. Written in an accessible style, it will be of value to those interested in Buddhist Studies and broader issues in comparative philosophy and religion. Contents: Preface; First thoughts on knowledge and liberation; Impermanence, not-self and suffering; Thorough knowledge versus deficient understanding; Moral knowledge and the Buddhist path; Buddhist anti-realism; Buddhist scepticism; Mysticism and ineffability; Compassion, faith and human fallibility; Bibliography; Index.Reviews: 'This erudite volume is a welcome addition to the philosophical literature on Buddhism... Burton writes as a philosopher, reconstructing arguments with care, and subjecting them to judicious, critical scrutiny. This exemplary engagement with the Buddhist tradition is grounded in sound textual scholarship. The prose is clear, and the volume will be accessible to scholars of Buddhism, to philosophers with little exposure to Buddhism, and to students of philosophy or Buddhism.' Journal of Contemporary Religion",
  "genres": [
    "Buddhism"
  ],
  "author": "David     Burton",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/7983696-buddhism-knowledge-and-liberation"
}