{
  "title": "Finding George Orwell in Burma",
  "description": "A fascinating political travelogue that traces the life and work of George Orwell, author of 1984 and ANIMAL FARM, in Southeast AsiaOver the years the American writer Emma Larkin has spent traveling in Burma, also known as Myanmar, she's come to know all too well the many ways this brutal police state can be described as \"Orwellian.\" The life of the mind exists in a state of siege in Burma, and it long has. But Burma's connection to George Orwell is not merely metaphorical; it is much deeper and more real. Orwell's mother was born in Burma, at the height of the British raj, and Orwell was fundamentally shaped by his experiences in Burma as a young man working for the British Imperial Police. When Orwell died, the novel-in-progress on his desk was set in Burma. It is the place George Orwell's work holds in Burma today, however, that most struck Emma Larkin. She was frequently told by Burmese acquaintances that Orwell did not write one book about their country - his first novel, Burmese Days - but in fact he wrote three, the \"trilogy\" that included Animal Farm and Nineteen Eighty-Four . When Larkin quietly asked one Burmese intellectual if he knew the work of George Orwell, he stared blankly for a moment and then said, \"Ah, you mean the prophet!\"In one of the most intrepid political travelogues in recent memory, Emma Larkin tells of the year she spent traveling through Burma using the life and work of George Orwell as her compass. Going from Mandalay and Rangoon to poor delta backwaters and up to the old hill-station towns in the mountains of Burma's far north, Larkin visits the places where Orwell worked and lived, and the places his books live still. She brings to vivid life a country and a people cut off from the rest of the world, and from one another, by the ruling military junta and its vast network of spies and informers. Using Orwell enables her to show, effortlessly, the weight of the colonial experience on Burma today, the ghosts of which are invisible and everywhere. More important, she finds that the path she charts leads her to the people who have found ways to somehow resist the soul-crushing effects of life in this most cruel police state. And George Orwell's moral clarity, hatred of injustice, and keen powers of observation serve as the author's compass in another sense they are qualities she shares and they suffuse her book - the keenest and finest reckoning with life in this police state that has yet been written.",
  "genres": [
    "Nonfiction",
    "Travel",
    "History",
    "Asia",
    "Biography",
    "Politics",
    "Memoir"
  ],
  "author": "Emma Larkin",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/79793.Finding_George_Orwell_in_Burma"
}