{
  "title": "Demonology and Devil-Lore Volume 2",
  "description": "This historic book may have numerous typos and missing text. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1879 Excerpt: ...the picture painted by Dowager Lady 1 The more fatal aspect of the dove has tended to invest the pigeon, especially wild pigeons, which in Oldenburg, and many other regions, are supposed to bode calamity and death if they fly round a house. THE WITNESS OF CHASTITY. 231 Lyttleton in 1780, in commemoration of the warning of death given to Lord Lyttleton by the mother of two girls he had seduced, the vision being attended by a fluttering dove. The original account of his vision or dream, attributed to Lord Lyttleton, mentions only 'a bird.' When next told, it is that he 'heard a noise resembling the fluttering of a dove, ' and on looking to the window saw 'an unhappy female whom he had seduced.' But the exigencies of orthodoxy are too strong for original narratives. As the 'bird' attested an announcement that on the third day (that too was gradually added) he would die, it must have been a dove; and as the dove attends only the innocent, it must have been the poor girl's mother that appeared. It was easy to have the woman die at the precise hour of appearance.1 When in Chicago in 1875, I read in one of the morning papers a very particular account of how a white dove flew into the chamber window of a young unmarried woman in a neighbouring village, she having brought forth a child, and solemnly declaring that she had never lost her virginity. In this history of the symbolism of the Dove the theological development of the Holy Ghost has been outlined. We have seen in the previous chapter that the Holy Spirit is in opposition to the Natural Air, --repository of evils. The Dove symbolised this aspect of it in hovering over the world emerging from its diluvial baptism, and also over the typical new Adam (JesusJ coming from his baptism. But in this it corresponds with...",
  "genres": [
    "Nonfiction",
    "Occult"
  ],
  "author": "Moncure Daniel Conway",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/7988665-demonology-and-devil-lore-volume-2"
}