{
  "title": "Frantz Fanon: A Portrait",
  "description": "\"Fanon was consummately incapable of telling the story of himself. He lived in the immediacy of the moment, with an intensity that embodied everything he evoked. Fanon's discourse pertained to a present tense that was unburdened by its narrative past. The little we knew about his personal life had been gleaned from passing allusions, brief glimpses that vanished as quickly as they appeared.... Fanon had a profound talent for life; he was a man who wanted to be the subject and actor of his own life, and it was for this reason that he was so engaging and disarming―so alive.\"―from the Introduction Frantz Fanon (1925–1961) was born in Martinique, and in 1943 left to fight in Europe with Free French forces. After 1945 he studied medicine and psychiatry in Lyons and began to write. His first analysis of the effects of racism and postcolonialism, Black Skin, White Masks, appeared in 1952 and would become a foundational text for the liberation movements of the 1960s and later for postcolonial studies. In 1952 he moved to Algeria and practiced at the Blida-Joinville psychiatric hospital in French Algeria until 1957. From that year he worked full time for the Algerian independence movement, including a brief appointment as the movement's ambassador in Ghana. One of Fanon's few surviving contemporaries, Alice Cherki worked closely with Fanon at the psychiatric hospital in Blida and then later for the Algerian cause in Tunisia. This book is a record of \"an epoch, a life, and a body of work often viewed as inadmissible.\" Cherki offers a unique assessment of Fanon's complex personality, illuminating both his psychiatric practice―of which she says, \"Fanon possessed a tremendous intuition about the unconscious and a great erudition in psychoanalytic theory\"―and the sources of his political activism, of his intellectual career as a pivot of the quickly changing world. Given the continuing relevance of Fanon's insights into the enduring legacy of colonialism on the psyches of the colonized, this compelling and personal account of his life and work will be required reading for anyone interested in the consequences of empire.",
  "genres": [
    "Biography"
  ],
  "author": "Alice Cherki",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/7985048-frantz-fanon"
}