{
  "title": "Aveline Kushi's Complete Guide to Macrobiotic Cooking: For Health, Harmony, and Peace",
  "description": "\"Food is the chief of all things, the universal medicine. . . . Food transmutes directly into body, mind, and spirit . . . creates our day-to-day health and happiness.\" -from The Macrobiotic Path to Total Health Even in medical schools, alternative medicine is blossoming. Two thirds of them now offer courses in complementary healing practices, including nutrition. At the heart of this revolution is macrobiotics, a simple, elegant, and delicious way of eating whose health benefits are being confirmed at an impressive rate by researchers around the world. Now in this marvelous guide, they give us the basics of macrobiotic eating and living, and explain how to use this powerful source of healing to become healthier and happier, to prevent or relieve more than two hundred ailments, conditions, or disorders-both physical and psychological. This encyclopedic compendium of macrobiotic fundamentals, remedies, menus, and recipes takes into account the newest thinking and evolving practices within the macrobiotic community. The authors integrate all the information into a remarkable A to Z guide to macrobiotic healing-from AIDS, allergies, and arthritis, to cancer, diabetes, and heart disease. They also clearly explain what we need to know to start eating a true macrobiotic diet that will provide us with a complete balance of energy and nutrients. Living as we all do in environmental and climactic circumstances that are largely outside our personal control, it is vital that we follow a healthy lifestyle, including a flexible diet that we can adjust to meet our own individual needs. The Macrobiotic Path to Total Health gives us precisely the tools and the understanding we need to achieve this goal. Use it to build a strong, active body and a cheerful, resourceful mind.",
  "genres": [
    "Cookbooks",
    "Food",
    "Health",
    "Nonfiction",
    "Cooking"
  ],
  "author": "Aveline Kushi",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/798480.Aveline_Kushi_s_Complete_Guide_to_Macrobiotic_Cooking"
}