{
  "title": "Writing to Heal: A Guided Journal for Recovering from Trauma and Emotional Upheaval",
  "description": "Heal Your Pain Now with Expressive Writing What do diarists and journal writers know that can help anyone dealing with a traumatic or emotionally challenging situation recover from pain and regain their peace of mind? They know that the act of putting thoughts and feelings on paper is, itself, a powerful exercise that makes them feel heard and acknowledged—a way of regaining perspective and control over the events that move through their lives. In this book, the preeminent psychologist and researcher in the growing field of expressive emotions therapy, or EET, takes readers through a series of guided writing exercises that help them explore their feelings about difficult experiences. Each chapter begins with an introduction that explains how to proceed with the journal exercise and what it is structured to help accomplish. Readers are encouraged to do the exercise in the journal itself—each chapter provides plenty of ruled space—so that they can frequently refer to their own work and gain insight and clarity from their own words. The text offers encouragement and gentle advice for breaking through those inevitable moments when mental block make writing impossible; stream-of-consciousness and automatic writing clears away the obstacle and inspires the journal writer to even deeper levels of self-expression. The text stresses throughout the power for understanding and coping with difficult times that lies in storytelling, whether through fiction, dance, or art. In all, the exercises will leave readers with a strong sense of their value in the world and the ability to accept that which is sometimes hard to accept—that life can be good even when it is sometimes bad.",
  "genres": [
    "Writing",
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Journaling",
    "Mental Health",
    "Personal Development"
  ],
  "author": "James W. Pennebaker",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/798927.Writing_to_Heal"
}