{
  "title": "Wearing Chinese Glasses: How (not) to Go Broke in Chinese Asia",
  "description": "Want to Succeed in Business with Chinese? Here’s How to Make it Happen! Chinese see with Chinese eyes. Your success depends on seeing things as Chinese do. You need Chinese glasses. Don’t wear them and you do business blind. The problems are not what you think.This book will open your eyes to the reality of doing successful business with Chinese.GREG BISSKY knows Chinese like few others. Business owner as well as consultant, project leader and teacher, since 1985 he has negotiated contracts, led Chinese teams, hired, fired and managed Chinese, and worked for numerous Chinese clients and bosses.Should you be polite to Chinese? Of course, if you are Western polite the Chinese will think you are impolite. You need to know how Chinese see polite. You need more than good intentions.Are relationships important to Chinese? Yes, except if you use Western ideas about relationships you will fail. You need to know how Chinese see relationships.Don’t worry about making mistakes.Chinese don’t care if you pass business cards with two hands or use chopsticks well. They expect you to make cultural mistakes. All non-Chinese are barbarians.Chinese meet Good, Bad and Ugly Westerners.You have to be a sensitive, flexible barbarian. Be polite, try things the Chinese after all, you are in China making Chinese money. A little respect goes a long way.You have to understand why before how.Tips are only useful if you understand why Chinese think and act as they do. Chinese ways make sense…to Chinese. The key to success is knowing why they make sense. You already know what to do.If you have a best friend back home, if you are married, you already know how to succeed in China. Everything in Chinese Asia is built on making good relationships.",
  "genres": [
    "China"
  ],
  "author": "Greg Bissky",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13094196-wearing-chinese-glasses"
}