{
  "title": "Killer Colt: Murder, Disgrace, and the Making of an American Legend",
  "description": "With such acclaimed works as The Devil’s Gentleman, Harold Schechter has earned renown as the dean of true-crime historians. Now, in this gripping account of driving ambition, doomed love, and brutal murder in an iconic American family, Schechter again casts his gaze into the sinister shadows of gaslit nineteenth-century New York City.In September 1841, a grisly discovery is made aboard a merchant ship docked in lower Manhattan: Deep in the cargo hold, bound with rope and covered with savage head wounds, lies a man’s naked corpse. While a murderer has taken pains to conceal his victim’s identity, it takes little time to determine that the dead man is Samuel Adams, proprietor of a local printing firm. And in less time still, witnesses and a bloody trail of clues lead investigators to the doorstep of the enigmatic John Colt.The scion of a prosperous Connecticut family, Colt has defied his parents’ efforts to mold him into a gentleman—preferring to flout authority and pursue excitement. Ironically, it is the ordered science of accountancy that for a time lends him respectability. But now John Colt’s ghastly crime and the subsequent sensational murder trial bring infamy to his surname—even after it becomes synonymous with his visionary younger brother’s groundbreaking invention. The embodiment of American success, Sam Colt has risen from poor huckster to industrious inventor. His greatest achievement, the revolver, will bring him untold millions even as it transforms the American West. In John’s hour of need, Sam rushes to his brother’s side—perhaps because of the secret they share. In Gilded Age New York, a city awash with treacherous schemers, lurid dime-museum curiosities, and the tawdry excesses of penny-press journalism, the Colt-Adams affair inspires tabloid headlines of startling and gruesome hyperbole, which in turn drive legions of thrill-seekers to John Colt’s trial. The dramatic legal proceedings will fire the imagination of pioneering crime writer Edgar Allan Poe and fuel the righteous outrage of journalist Walt Whitman.Killer Colt interweaves the intriguing stories of brooding, brilliant John and imaginative, enterprising Sam—sharp-witted and fascinating brothers on vastly divergent journeys, bound by an abiding mutual devotion and a mystery they will conceal to the end. Harold Schechter has mined the darkly macabre vein of a bygone era and brought forth a mother lode of storytelling gold.",
  "genres": [
    "True Crime",
    "History",
    "Nonfiction",
    "Crime",
    "Biography",
    "Historical",
    "American History"
  ],
  "author": "Harold Schechter",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/7992932-killer-colt"
}