{
  "title": "A Year in the Village of Eternity: The Lifestyle of Longevity in Campodimele, Italy",
  "description": "Welcome to the Village of Eternity. Campodimele, Italy, has for some time attracted the interest of the medical the people here lead extraordinarily long lives, enjoy low blood pressure and low cholesterol, and stay active and healthy to their last years.What is it about this place that makes it so easy to live well and long? In A Year in the Village of Eternity , Tracey Lawson goes beyond the medical figures, immersing herself in the lifestyle and timeless eating habits of this vibrant place. Daybreak in Campodimele finds villagers in their seventies and eighties rising to tend their olive trees, chasing their chickens uphill, or weaving through mountain roads on a Vespa.In Campodimele, the seasons and the bounty of the land dictate the food on the table, and each month brings its own traditions of harvesting and foraging, cooking and preserving. The villagers are warm and welcoming, sharing the recipes handed down from generation to generation, and Lawson offers over one hundred of those same recipes here, from simply dressed salads to homemade sausages and fresh egg pasta. She introduces us to the cicerchie, a legume particular to this elevated spot, high in protein and free of cholesterol, and key to zuppa della nonna, \"grandmother's soup.\" There's lamb cooked over charcoal; a zucchini soup that uses stalks, leaves, and flowers; preserved sweet red peppers; fig jam; and celebratory sweets like almond cake and a ricotta tart with cinnamon.With beautiful photographs of the dishes, the people, and the countryside of Campodimele, A Year in the Village of Eternity brims with warmth, generosity, tradition, and flavor. Here we can learn secrets not only of living longer, but of living every moment to the fullest.",
  "genres": [
    "Nonfiction",
    "Italy",
    "Travel",
    "Health",
    "Food",
    "Memoir",
    "Cookbooks"
  ],
  "author": "Tracey Lawson",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/7996690-a-year-in-the-village-of-eternity"
}