{
  "title": "Ode to Kirihito, Part 1",
  "description": "Kirihito Osanai is a young doctor who's just been introduced to the Monmow disease, which transforms humans into dog-like beasts and kills them within a month of the metamorphosis. While studying the pathology of the disease Kirihito himself becomes an unknowing guinea pig for his hospital's research into it. Under the auspices of research, Kirihito is sent to a remote village in the mountains, where he contracts the Monmow disease himself, and through a series of misfortunes, becomes estranged from his beautiful fiancee, Izumi Yoshinaga (the daughter of his hospital's Director and Chief Physician), and his close friend and rival, Urabe. As the disease begins to transform Kirihito's body physically, the sudden metamorphisis impacts his character.  Kirihito soon begins to doubt the medical world and after much resistence breaks down to accept his new role as a monster and spiritual figure in the quaint rural village he now lives in.  Whether he is able to come to terms with his new life, however, it is certain that society will see him very differently.  Quickly it becomes certain that Kirihito's life will be continuous strife dictated by the hospital that once employed him and is now looking to attain international acclaim by revealing the secrets (albiet incorrect) of Monmow's Disease.It quickly becomes the secret mission of Urabe and Yoshinaga to find Kirihito and uncover the conspiracy and mystery behind this medical phenomenon, though Urabe seems to have motives of his own as pertains to the beautiful fiancee. Urabe, however, that is able to link the Monmow disease directly to water that runs from the mountain village where Kirihito is trapped, and the two doctors will independently discover the truth about Monmow.\"Ode to Kirihito is moving, tender and engrossing. Also very, very odd.\" --Neil Gaiman, author of The Sandman and Anansi Boys“Tezuka turns his comic book mastery to evil in this terrifying examination of moral decay. Fans of Japanese horror both new and old should not miss this shocking single volume that will completely change Tezuka’s American reputation as the Japanese Walt Disney. Brutal, depraved and savage, Kirihito will leave you panting like a beaten dog-man!” —Andrew D. Arnold, Time comics critic",
  "genres": [
    "Manga",
    "Graphic Novels",
    "Horror",
    "Fiction",
    "Japanese Literature",
    "Comics",
    "Seinen"
  ],
  "author": "Osamu Tezuka",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/7995079-ode-to-kirihito-part-1"
}