{
  "title": "In Search of a City: Los Angeles in 1,000 Words",
  "description": "Ryan Wilson – “American Trash” Stuart Gibbel – “Break on Through” Craig Clevenger – “Obsolescence” Nik Korpon - \"South of Thirteen\" Dennis Cruz – “Smile Now, Cry Later” Pela Via – “Bathhouse” Stephen Conley – \"Don't Feed the Animals\" Grigori Black – “This Was Heaven” Doc O’Donnell – “Your Personal Apocalypse” Nikki Guerlain – “Sick Ticket” Patrick Verhagen – “Swim” Craig Wallwork – “El Bordello Alexandra” Nicholas Merlin Karpuk – “Ahm’s Bay” Nik Houser – “Subtitles for a Silent Film” H.R. Tardiff – “Walls in the Sand” Richard Thomas – “The Jenny Store” Bob Pastorella – “Alexandra” Simon West-Bulford – “Project Asmodeus” Jay Slayton-Joslin – “The Fantasy of California vs. The Reality of London” Amanda Gowin – “Gilded Bones” Chris Deal – “Padre Nuestro” Boden Steiner – “Here” Gordon Highland – \"Fry Girl\" edward j rathke – “All the Dreams You Dreamt Retold” Michael Paul Gonzalez – “Tidal” Victor Bengtsson – “Venice, Forever” ABOUT THE Los Angeles is whatever you want it to be, and nothing like you think. I gave these photos to a group of authors and asked them for precisely 1,000 words about what they saw. They didn't disappoint. Dreams, drugs, drama. Fame, famine, and fading glory. Few of the authors in this book have stepped foot in L.A., yet the soul of this city is so invasive and pervasive that the collection embodies everything that makes up this sprawling metropolitan mess. There’s everyday life in Los Angeles, from the shiny dreams of the Hills to the hard realities of life in the Valley and out to the Inland Empire, and even more stories that are purely the stuff of dreams and fantasies, the kinds of worlds that exist only behind giant creaking doors on backlots scattered throughout the Southland. Whether you live here or just want to visit for a few moments, you’re in for one hell of a ride.",
  "genres": [],
  "author": "Michael Paul Gonzalez",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/13095655-in-search-of-a-city"
}