{
  "title": "On Becoming a Better Therapist",
  "description": "Most of us became therapists because we wanted to be helpful to other human beings, and most of us carry an inextinguishable passion to become better at it. But how do we get better? The truth is that although we are painfully aware that some clients clearly don't benefit while others inexplicably end therapy, we don't know how effective we really are or what we can do to improve our outcomes. Despite our hard work and good intentions, unfruitful encounters with clients combined with the confusing cacophony of \"latest\" developments can weigh on us, steer us into ruts, and make us forget why we became therapists to begin with. How can we remember our original aspirations, continue to develop as therapists, and achieve better results, more often, with a wider variety of clients? In how can you become a better therapist?On Becoming a Better Therapist answers these questions and more. Barry Duncan pragmatically applies the common factors of change as well as the powerful benefits of client feedback described in the The Heart and Soul of Change to demonstrate how to be even better at what you do best and, at the same time, expand your effectiveness with clients who may not respond to your usual efforts.In the first book to detail the clinical nuances of using feedback to improve outcomes, Duncan presents a simple, five-step method of integrating outcome management with therapists' long-term professional development. With lively case examples unfailing good humor, and a deep affection for therapy and therapists, Duncan's book is essential reading for anyone who seeks to rediscover purpose in their work and become a better therapist.Feedback pioneer Michael Lambert says, \"The possibility and novelty of Duncan's ideas makes this an important and provocative contribution to the field.\"",
  "genres": [
    "Psychology",
    "Counselling"
  ],
  "author": "Barry L. Duncan",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/8005934-on-becoming-a-better-therapist"
}