{
  "title": "Divine Fury: A History of Genius",
  "description": "Genius. With hints of madness and mystery, moral license and visionary force, the word suggests an almost otherworldly power: the power to create, to divine the secrets of the universe, even to destroy. Yet the notion of genius has been diluted in recent times. Today, rock stars, football coaches, and entrepreneurs are labeled ‘geniuses,’ and the word is applied so widely that it has obscured the sense of special election and superhuman authority that long accompanied it.As acclaimed historian Darrin M. McMahon explains, the concept of genius has roots in antiquity, when men of prodigious insight were thought to possess—or to be possessed by—demons and gods. Adapted in the centuries that followed and applied to a variety of religious figures, including prophets, apostles, sorcerers, and saints, abiding notions of transcendent human power were invoked at the time of the Renaissance to explain the miraculous creativity of men like Leonardo and Michelangelo.Yet it was only in the eighteenth century that the genius was truly born, idolized as a new model of the highest human type. Assuming prominence in figures as varied as Newton and Napoleon, the modern genius emerged in tension with a growing belief in human equality. Contesting the notion that all are created equal, geniuses served to dramatize the exception of extraordinary individuals not governed by ordinary laws. The phenomenon of genius drew scientific scrutiny and extensive public commentary into the 20th century, but it also drew religious and political longings that could be abused. In the genius cult of the Nazis and the outpouring of reverence for the redemptive figure of Einstein, genius achieved both its apotheosis and its Armageddon.The first comprehensive history of this elusive concept, Divine Fury follows the fortunes of genius and geniuses through the ages down to the present day, showing how—despite its many permutations and recent democratization—genius remains a potent force in our lives, reflecting modern needs, hopes, and fears.",
  "genres": [
    "History",
    "Nonfiction",
    "Psychology",
    "Sociology",
    "Art",
    "World History",
    "Science"
  ],
  "author": "Darrin M. McMahon",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/8003853-divine-fury"
}