{
  "title": "Saltypie: A Choctaw Journey from Darkness into Light",
  "description": "Bee stings on the backside! That was just the beginning. Tim was about to enter a world of the past, with bullying boys, stones and Indian spirits of long ago. But they were real spirits, real stones, very real memories…In this powerful family saga, author Tim Tingle tells the story of his family’s move from Oklahoma Choctaw country to Pasadena, TX. Spanning 50 years, Saltypie describes the problems encountered by his Choctaw grandmother—from her orphan days at an Indian boarding school to hardships encountered in her new home on the Gulf Coast.Tingle says, “Stories of modern Indian families rarely grace the printed page. Long before I began writing, I knew this story must be told.” Seen through the innocent eyes of a young boy, Saltypie — a 2011 Skipping Stones honor book, WordCraft Circle 2012 Children's Literature Award-winner, and winner of the 2011 Paterson Prize for Books for Young People in the category of Grades 4-6 — is the story of one family’s efforts to honor the past while struggling to gain a foothold in modern America.Tim Tingle, a member of the Choctaw Nation of Oklahoma, is a sought-after storyteller for folklore festivals, library conferences, and schools across America. At the request of Choctaw Chief Pyle, Tim tells a story to the tribe every year before Pyle’s State of the Nation Address at the Choctaw Labor Day Gathering. Tim’s previous and often reprinted books from Cinco Puntos Press—Walking the Choctaw Road and Crossing Bok Chitto—received numerous awards, but what makes Tim the proudest is the recognition he receives from the American Indian communities.Karen Clarkson, a Choctaw tribal member, is a self-taught artist who specializes in portraits of Native Americans. She did not start painting until after her children had left home; she has since been widely acclaimed as a Native American painter. She lives in San Leandro, California.",
  "genres": [
    "Picture Books",
    "Native American",
    "Childrens",
    "Family",
    "Indigenous",
    "History",
    "Cultural"
  ],
  "author": "Tim Tingle",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/7999750-saltypie"
}