{
  "title": "Raiju: A Kaiju Hunter Novel",
  "description": "Being a teen wizard sucks... So there I was, Mr. Nobody. I had to stop a monster, the military, and the President of the United States from turning the country into a nuclear wasteland. And I had to do it by slaying a god, and, quite possibly, by killing the girl I loved. And you think you have problems... His home destroyed by a rampaging kaiju, or giant monster, Kevin Takahashi and his father relocate to New York City where Kevin believes the nightmare is over and the only battleground left to face from now on is high school. But soon after his arrival in the Big Apple, a new kaiju emerges. Qilin is so powerful that even the U.S. Military may be unable to contain or destroy the monster. And if that isn't bad enough, Kevin is falling in love with Aimi Mura, the resident \"bad girl,\" and the girlfriend of the toughest bully in school. But will Aimi still want him when she discovers his darkest secret? Because Kevin is more than a ragged refugee from the now defunct city of San Francisco. He's also a Keeper -- a teen wizard who can summon ancient, demonic god-beasts to do battle for him, and his creature to call is Raiju, the oldest of the ancient Kami. Kevin has only a short time to win Aimi over and save the city of New York. Because Raiju and Qilin are about to clash, and after the dust settles, there may be no home left for either one of them! Excerpt The explosion that heralded the end of my life and the beginning of my nightmare rocked the entire street from side to side. All of us went down, clutching the pavement, as dozens of car alarms went off, adding to the rising cacophony in the night. Something told me we were in trouble--the type of trouble that would cost us our lives if we didn't keep our heads together. I sat up, gritting my teeth with determination, and scrambled backward. I didn't stop until I hit the fence. Something had happened, something that was going to change the world. Again. The street was full of smoke and the raw smell of sewage. Ironically, the first thing I thought was not that some creature was responsible for that, but that a gas main had exploded on the avenue or a bomb had gone off. This was New York. Crime happened in New York. Terrorists set fire to buildings... Then the street rattled grittily and cracks spider-crawled across the pocked asphalt. It reminded me of the earthquake I had felt several days ago, taken to the tenth power. The street rolled and several cabs flipped over like toys. I was afraid, finally, down in my bones, where the basest survival instincts lurk. I crawled unsteadily to my feet, covered in grit and blood and freezing sweat, and turned to look at Aimi and Snowman clinging to the fence for support. My mind was clear and alert and painfully sober. The first thing I did was grab Snowman by the front of his fancy glitter jacket and push him stumbling toward Aimi. \"Get her out of here,\" I said. \"Get them all out of here now!\" He blinked at me, clearly shaken, our conflict forgotten for the moment. Then he nodded, turning to assist first Aimi, then the other members of the band, over the fence. I didn't stay to watch. Behind me, beyond veils of smoke, came the worst sound imaginable, a screaming the likes of which you would expect to hear from the bowels of hell. I stepped out into the street, looking at the people lying in the gutters like broken dolls. The explosion had brought traffic to a screeching halt and cars were jam-packed every which way on the avenue like a kid's toy collection. The street trembled again, and again I heard that like someone running a metal glove over a blackboard. I walked out into the street, feeling like the token Asian in a spaghetti western about to go out and face the gunfighter villain. I thought of sirens, fires, ineffectual police squads firing on the monster that crawled out of San Francisco bay two years ago. I walked, but I walked afraid. I knew I had to buy Aimi and her friends time to get away, but my throat was dry and clicked when I tried to swallow. All around me people were struggling to escape their cars, banging doors against the vehicles packed against them, breaking windshields, crawling through jagged glass with no hesitation for fear or pain as their own basest instincts for survival kicked in. Ragged people in ragged clothes and blood... The earthquake, I thought. Something huge was moving under the street. And now that something is here... An injured businessman staggered into the street. Maybe he was trying to help, or was only in a state of shock, but he reached a car with a family trapped inside it and tried yanking open the passenger-side door, which only banged against the side of the idling cab that had slammed into it at the intersection. I didn't think. I pushed him aside. The family in the car was screaming. I slid the jacket off my shoulders, wrapped by forearm in the thick material, and bashed in the passenger-side window with my fist. \"Get out!\" I shouted. \"Get out of here now!\" As they began scrambling out I moved to the center of the street. Surrounded by the massive pile-up, I stared at the belching smoke coming from a half dozen open manholes. Something was out there, in the smoke, something I couldn't see...yet. Smoke closed in around me, obscuring my vision and making greasy halos of the lights on the avenue. The man I had been trying to help began to scream, to scream the way a man should never scream. It's like that night, I thought. The night the thing crawled out of the sea and began trampling the people as they tried desperately to get away. The nightmare is starting all over again...",
  "genres": [
    "Monsters",
    "Young Adult",
    "Fantasy"
  ],
  "author": "K.H. Koehler",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/8003062-raiju"
}