{
  "title": "Alanya to Alanya",
  "description": "Seattle, February 2076. The Marq’ssan bring business as usual to a screeching halt all over the world, and Professor Kay Zeldin joins Robert Sedgewick, US Chief of Security Services, in his war against the invaders. Soon Kay is making rather than writing history. But as she goes head-to-head against the Marq’ssan, the long-buried secrets of her past resurface, and her conflicts with Sedgewick and Security Services multiply. She faces terrifying choices. Her worldview—her very grip on reality—is turned inside out. Whose side is she really on? And how far will she go in serving that side? “The coupling of real thoughtfulness and rip-roaring excitement is as rare in science fiction as in any other genre. But here, in Alanya to Alanya , they’re locked together in the most exciting—and certainly the most intelligent!—tale of alien invasion I’ve read in decades. Because it is believable, it’s fascinating. And, in the years that have seen Margaret Thatcher go and Hillary Clinton and Condoleezza Rice arrive, Kay Zeldin is an extraordinarily effective portrait of a political hero.”—Samuel R. Delany, author of Dhalgren Reviews “The intersection of science fiction and politics has always served an important critical function, from George Orwell’s dystopian 1984 and Ursula Le Guin’s The Dispossessed and The Left Hand of Darkness to Robert Heinlein’s ultra-nationalist Starship Troopers , but until now they have always served as a means of analyzing political structures. With L. Timmel Duchamp’s million-word Marq’ssan novel (broken into five books), anarchy is extrapolated. This is not anarchy in its popular sense, but in its truest sense. It is also feminism at its most fundamental level, and neither can be un-twined from the other.”—Sean Melican, Ideomancer , March 2007 “ Alanya to Alanya does just what a political sf novel should it leavens its political message with first-rate futuristic extrapolation, chilling dystopianism and a breathless adventure story that keeps you turning the pages. It was a refreshing read and a rare example of deft political storytelling.”—Cory Doctorow, Boing Boing , July 2006 “Not an easy or comfortable book, but one that rewards a thoughtful reader who is willing to give up simple action plots for a close consideration of political and social ideas. In fact, the closest comparison one might give is to some of Le Guin’s later work—no small recommendation.”—Peter Heck, Asimov’s , June 2006 “ Alanya to Alanya is an intriguing mixture of SF genres and It has utopian and dystopian elements, a strong splash of the political thriller, a good mystery subplot in Kay’s amnesia, a hint of the sense of discovery that imbues first-contact novels and plenty to say about the current state of the real world.”— Science Fiction Weekly , June 27, 2005 “[Duchamp’s] political world building has a level of detail and believability that rivals Bruce Sterling at his best, and her pacing is much better than most other books driven so heavily by political concepts, such as Ayn Rand’s Atlas Shrugged or Sheri S. Tepper’s The Gate to Women’s Country .”— Strange Horizons , November 30, 2005 “ Alanya to Alanya is SF on a broader scale, with The War of the Worlds as one inspiration, but its metaphors apply to a very human tangle of loyalty and betrayal, politics and idealism—Wells and Orwell updated for the end of the 20th century.”— Locus , June 2005",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Feminism",
    "Aliens",
    "Fantasy",
    "Novels",
    "Science Fiction Fantasy"
  ],
  "author": "L. Timmel Duchamp",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/799832.Alanya_to_Alanya"
}