{
  "title": "The Queen of Education: Rules for Making School Work",
  "description": "A Queen of EducationCandidate must be able to take decisive action, cut through red tape, deflate the bureaucratic bloat, wrestle with the diagnostic nightmare of ADHD, and refuse to sell out her students to the corporate fat cats. Though we have \"education presidents\" who give lip service to fixing schools—what we really need is a Queen of Education who will get the job done. Anyone searching for such a candidate would put LouAnne Johnson's resume on the top of the stack of likely applicants. LouAnne Johnson is the gutsy ex-marine turned teacher who has wrestled with tough kids and even tougher adults. Her life inspired the movie Dangerous Minds — which was based on her book My Posse Don't Do Homework . Johnson's knack for finding original solutions to intractable problems has not only made her an exemplary teacher but a popular speaker on the lecture circuit. In this engaging book, \"Queen\" LouAnne offers her down-to-earth advice about fixing schools. Johnson makes no secret about the fact that she is fed up with an educational system that is too quick to label and write off children who don't fit the mold. Among her royal rules for fixing the no class shall have more than 20 students, all elected representatives must teach in a public school classroom for two weeks, and the testing frenzy must stop this very second! LouAnne is a passionate advocate for schools that are smaller, healthier, more humane, and more attuned to different learning styles. With humor and good sense, she shows how a compassionate teacher or parent can cut through the red tape and make a crucial difference in the life of a child. \"LouAnne Johnson's book is a blend of common sense, humor, and practical, down-to-earth ideas of how each one of us, as a parent or a concerned citizen, can make a contribution toward improving America's public schools. I highly recommend it.\"— Michele Borba , Ed.D., author, Don't Give Me That Attitude! , No More Misbehavin' , and Building Moral Intelligence \"As a former student of LouAnne's first 'at risk' class, I experienced firsthand her approach to education. The result was nothing less than a miracle. This book has the power to do for the United States education system what it did for our class; turn a flawed reality into an exemplary system of education.\"— Dan Mueller , associate producer and designer, BottleRocket Entertainment Inc. \"LouAnne Johnson writes with passion, humor, and good old common sense about the joys and frustrations of teaching, and the ways in which caring individuals can make a critical difference. Her book is a must read for all who have a stake in the success of our schools.\"— Robert R. Spillane , United States Department of State, Office of Overseas Schools, former New York State Deputy Commissioner of Education and former superintendent of the Boston and Fairfax County Virginia Public Schools Praise for Dangerous Minds \"Johnson shows the importance of basic respect, constant encouragement, and unorthodox teaching strategies for a generation (another generation) of disenfranchised students.\"— Kirkus Review \"Remarkable - Johnson proves that unorthodox methods can turn a problem kid into an \"A\" student.\"— Vogue",
  "genres": [
    "Education"
  ],
  "author": "LouAnne Johnson",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/801904.The_Queen_of_Education"
}