{
  "title": "Krautrocksampler: One Head's Guide to the Great Kosmische Musik - 1968 Onwards",
  "description": "What could be more appropriate than a German-language version of Julian Cope's landmark tome, KRAUTROCKSAMPLER? Well, here it is. Already out of print, as is the English version, but now in German, with the same content as the English version (but in German), and even a bit of added colour to the inner covers that was not present on the English version. With a striking colour cover adapted from Amon Duul II's Yeti album, Cope passionately, even breathlessly, explains why he believes krautrock happened, and, maybe most importantly, provides an appendix listing and describing the cream of the crop of artists and albums involved in this Germanic music revolution that began in the late 1960s and peaked during the 1970s, influenced as much by Albert Hoffman's \"Problem Child\" as the heads of San Francisco, but adding electronics, distortion, free form experimentation, and maybe even a little bit of crazed paranoia so that the West Coasters sometimes sounded a little tame by comparison! Some may argue that krautrock is too musically broad to really be a genre, but Cope presents strong evidence to the contrary, without ever stooping to parse the minutiae that bogs down so much commentary about this movement. With all versions and translations of this important volume out of print, and Cope adamantly pronouncing that it will not be reprinted or otherwise updated, this is a perfect time to begin your collection of krautrock literature. You might be surprised to find out just how much of it is out there, but Cope's groundbreaking book remains an important and influential starting place, much in the same way that Steven Stapleton's Nurse With Wound List inspired music hunters around the world. Next stop, the Freeman Brothers' encyclopedic Crack in the Cosmic Egg. Tune In, Turn On, and Blast Off. excerpted with kind permission from \"Scrambled Eggs and Fried Minds\" by Val-dor \"Kanny\" Kelmitschen (Ruthless Press, 2009).",
  "genres": [
    "Music",
    "Nonfiction",
    "Reference",
    "Germany",
    "German Literature",
    "History",
    "Essays"
  ],
  "author": "Julian Cope",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/801879.Krautrocksampler"
}