{
  "title": "A City So Grand: The Rise of an American Metropolis: Boston 1850-1900",
  "description": "Once upon a time, \"Boston Town\" was an insulated New England township. But the community was destined for greatness. Between 1850 and 1900, Boston underwent a stunning metamorphosis to emerge as one of the world's great metropolises-one that achieved national and international prominence in politics, medicine, education, science, social activism, literature, commerce, and transportation.Long before the frustrations of our modern era, in which the notion of accomplishing great things often appears overwhelming or even impossible, Boston distinguished itself in the last half of the nineteenth century by proving it could tackle and overcome the most arduous of challenges and obstacles with repeated-and often resounding-success, becoming a city of vision and daring.In A City So Grand , Stephen Puleo chronicles this remarkable period in Boston's history, in his trademark page-turning style. Our journey begins with the ferocity of the abolitionist movement of the 1850s and ends with the glorious opening of America's first subway station, in 1897. In between we witness the thirty-five-year engineering and city-planning feat of the Back Bay project, Boston's explosion in size through immigration and annexation, the devastating Great Fire of 1872 and subsequent rebuilding of downtown, and Alexander Graham Bell's first telephone utterance in 1876 from his lab at Exeter Place.These lively stories and many more paint an extraordinary portrait of a half century of progress, leadership, and influence that turned a New England town into a world-class city, giving us the Boston we know today.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "19th Century",
    "Urban",
    "Technology",
    "The United States Of America"
  ],
  "author": "Stephen Puleo",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/8017291-a-city-so-grand"
}