{
  "title": "Floating Gold: A Natural (and Unnatural) History of Ambergris",
  "description": "“Preternaturally hardened whale dung” is not the first image that comes to mind when we think of perfume, otherwise a symbol of glamour and allure. But the key ingredient that makes the sophisticated scent linger on the skin is precisely this bizarre digestive by-product—ambergris. Despite being one of the world’s most expensive substances (its value is nearly that of gold and has at times in history been triple it), ambergris is also one of the world’s least known. But with this unusual and highly alluring book, Christopher Kemp promises to change that by uncovering the unique history of ambergris.            A rare secretion produced only by sperm whales, which have a fondness for squid but an inability to digest their beaks, ambergris is expelled at sea and floats on ocean currents for years, slowly transforming, before it sometimes washes ashore looking like a nondescript waxy pebble. It can appear almost anywhere but is found so rarely it might as well appear nowhere. Kemp’s journey begins with an encounter on a New Zealand beach with a giant lump of faux ambergris—determined after much excitement to simply be lard—that inspires a comprehensive quest to seek out ambergris and its story. He takes us from the wild, rocky New Zealand coastline to Stewart Island, a remote, windswept island in the southern seas, to Boston and Cape Cod, and back again. Along the way, he tracks down the secretive collectors and traders who populate the clandestine modern-day ambergris trade.            Floating Gold is an entertaining and lively history that covers not only these precious gray lumps and those who covet them, but presents a highly informative account of the natural history of whales, squid, ocean ecology, and even a history of the perfume industry. Kemp’s obsessive curiosity is infectious, and eager readers will feel as though they have stumbled upon a precious bounty of this intriguing substance.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Microhistory",
    "Nature",
    "Animals",
    "Biology"
  ],
  "author": "Christopher Kemp",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/13096110-floating-gold"
}