{
  "title": "Shadow War",
  "description": "Shadow War is the first of a three book serial that will take the reader into the inter working of a special anti terrorist team run by the CIA. It's central character James Mason Kelley a former US Navy Seal team commander, has placed himself in danger. As he runs an unauthorized investigation into corruption at the highest levels of government. Forcing him to run and hide as he carry's out his investigation.At the same time a newly elected President is about to take office, as a new terrorist threat is discovered. A threat that goes all the way back to the fall of Communism. Slowly it is discovered that there is a connection between this threat and a highly placed figure within the CIA. A man who has no problem removing obstacles from his way.As the plot and sub plots develop it becomes apparent that the target of the next terrorist attack is likely the inauguration of the new President. While how and where the attack will take place are still unknown.This is a passage from Shadow Three hours later, he pulled into the park. At the far end of the lot, there was a solitary black Duango parked. As he approached it, he could tell it was running because of the warm exhaust rising from the tail pipe. The man inside looked like he was sleeping. Jim parked his T Bird and walked up to the driver's door. It was Wayne Russell all right, but he was in no position to talk. The driver's side window was shattered, and it was apparent that some one had placed a small caliber round through his temple. Probably a two twenty three, and at long range judging by the entrance wound. Jim turned looking behind him; there was a tree line on the other side of the road nearly two hundred yards away. Then looking at the parking lot he noticed where someone had pulled up here and walked around a vehicle to this same spot.Was he being watched right now he wondered. Reaching in he took an envelope that was pinned to Russell's coat, soaked in his blood. Looking back at the tree line he opened the envelope, the note simply said, YOU'RE NEXT, STAND DOWN.Walking briskly back to his car he looked around, it didn't appear anyone could have seen him, except maybe the shooter if he was still around. Jim got into the Thunderbird, spun it around in the snow, and hurried out of there.As he drove, he watched his rear view mirror, making sure he was not being followed. How did Kline know he was investigating he thought? This had to be Kline, that SOB, he thought. No wonder no one wants to talk.So he knew, that meant now more than ever it was important that he hurry, before Kline could clear the trail behind him.As the story continues readers are introduced to the team Jim heads. As they without his help continue to pursue the terrorist plot. While Jim Kelley goes after Kline. The reader is swept up in the chase as each new chapter unfolds. While Kline slowly is revealed as the most inconsiderate, and self satisfying man imaginable. He will let no one, or nothing stand in his way as he claws his way to the top.The reader is taken on a journey into the darkest places in the hearts of men.The tactical side of the story is riveting, as well as heartbreaking. Lets face it everyone won't always come home.While at the same time the clock ticks away on a sleeping Washington DC.This is nonstop action beginning to end, and the end is not certain. TR Wallace has found a way to mix the beauty of northern Michigan with the chaotic events of the day.Shadow War captures the mood of this changing world.",
  "genres": [],
  "author": "T.R. Wallace",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/8025665-shadow-war"
}