{
  "title": "Jesus for the Non-Religious",
  "description": "Writing from his prison cell in Nazi Germany in 1945 Dietrich Bonhoeffer, a young German theologian, sketched a vision of what he called \"religionless Christianity.\" In this book, John Shelby Spong puts flesh onto the bare bones of Bonhoeffer's radical thought. The result is a strikingly new and different portrait of Jesus of Nazareth—a Jesus for the non-religious.Spong challenges much of the traditional understanding that has for so long surrounded the Jesus of history, from the tale of his miraculous birth to a virgin, to the account of his cosmic ascension into the sky at the end of his life. Spong questions the historicity of the ideas that Jesus was born in Bethlehem, that he had twelve disciples, and that the miracle stories were meant to be descriptions of supernatural events. He also speaks directly to those contemporary critics of Christianity who call God a \"delusion\" and who write letters to a \"Christian nation\" and describe how Christianity has become evil and destructive.Spong invites his readers to look at Jesus through the lens of both the Jewish scriptures and the liturgical life of the first-century synagogue. Dismissing the dispute about Jesus' nature that consumed the church's leadership for the first 500 years of Christian history as irrelevant, Spong proposes a new way of understanding the divinity of Christ: as the ultimate dimension of a fulfilled humanity. Traditional Christians who still cling to dated concepts of the past will not be comfortable with this book; however, skeptics of the twenty-first century will not be quite so certain that dismissing Jesus is the correct pathway to walk. Jesus for the Non-Religious may be the book that finally brings the pious and the secular into a meaningful dialogue, opening the door to a living Christianity in the post-Christian world.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Christianity",
    "Theology",
    "History",
    "Audiobook"
  ],
  "author": "John Shelby Spong",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/80202.Jesus_for_the_Non_Religious"
}