{
  "title": "The Sins of Scripture: Exposing the Bible's Texts of Hate to Reveal the God of Love",
  "description": "In The Sins of Scripture, Bishop John Shelby Spong takes on a thematic exploration of the Bible, carefully analyzing those passages that inform some of our key debates, like the role of women in the church and in society, and homosexuality, to name just two. Beyond that he also looks at scriptures that have helped shape culture and history -- bringing to light the undercurrent of anti-Semitism he finds in the Gospels, for example. The journey is particularly compelling because Bishop Spong believes in and values the good the Bible has brought to many through the ages. His goal is not to define the Bible itself as something to be set aside, but instead to honor and value what he loves about it while still labeling what he dramatically calls \"texts of terror\" for what they are. The true joy of the book is found in Spong's vigorous intellect, which he shines bright in an attempt to catch a reflection of the age, culture and circumstances in which the texts he examines were written. Like an archaeologist working with ideas instead of tools, he removes the rocks, brushes away the sediment and reports on what he finds. What were the roots and cultural realities behind the Scriptures that define the role of women in the church? What were the hopes and fears driving the writers who condemned homosexuality in such stark terms? What is the justification behind scriptures recommending \"the rod of correction\" (or as Bishop Spong simply labels it: \"[t]he physical abuse of children…\".) Whether or not you agree with some of his musings along the way, many of his conclusions are hard to argue with. Putting aside the issue of divine origin of the Bible, no one can deny passages have been used in service of very human ends. Finally, The Sins of Scriptures can be seen as a careful observer of what those ends have been. And when taken on those terms, it makes an interesting read, regardless of one's religious background.--Ed Dobeas",
  "genres": [
    "Religion",
    "Nonfiction",
    "Christianity",
    "Theology",
    "Spirituality",
    "Christian",
    "Philosophy"
  ],
  "author": "John Shelby Spong",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/80211.The_Sins_of_Scripture"
}