{
  "title": "Hot Lights, Cold Steel: Life, Death and Sleepless Nights in a Surgeon's First Years",
  "description": "When Michael Collins decides to become a surgeon, he is totally unprepared for the chaotic life of a resident at a major hospital. A natural overachiever, Collins' success, in college and medical school led to a surgical residency at one of the most respected medical centers in the world, the famed Mayo Clinic. But compared to his fellow residents Collins feels inadequate and unprepared. All too soon, the euphoria of beginning his career as an orthopedic resident gives way to the feeling he is a counterfeit, an imposter who has infiltrated a society of brilliant surgeons.This story of Collins' four-year surgical residency traces his rise from an eager but clueless first-year resident to accomplished Chief Resident in his final year. With unparalleled humor, he recounts the disparity between people's perceptions of a doctor's glamorous life and the real a succession of run down cars that are towed to the junk yard, long weekends moonlighting at rural hospitals, a family that grows larger every year, and a laughable income.Collins' good nature helps him over some of the rough spots but cannot spare him the harsh reality of a doctor's life. Every day he is confronted with decisions that will change people's lives-or end them-forever. A young boy's leg is mangled by a risk the boy's life to save his leg, or amputate immediately? A woman diagnosed with bone cancer injures her go through a painful hip operation even though she has only months to live? Like a jolt to the system, he is faced with the reality of suffering and death as he struggles to reconcile his idealism and aspiration to heal with the recognition of his own limitations and imperfections.Unflinching and deeply engaging, Hot Lights, Cold Steel is a humane and passionate reminder that doctors are people too. This is a gripping memoir, at times devastating, others triumphant, but always compulsively readable.",
  "genres": [
    "Medicine",
    "Medical",
    "Nonfiction",
    "Memoir",
    "Science",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Michael J.          Collins",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/80310.Hot_Lights_Cold_Steel"
}