{
  "title": "Monsoon: The Indian Ocean and the Future of American Power",
  "description": "On the world maps common in America, the Indian Ocean all but disappears. The Western Hemisphere lies front and center, while the Indian Ocean region is relegated to the edges, split up along the maps’ outer reaches. This convention reveals the geopolitical focus of the now-departed twentieth century, for it was in the Atlantic and Pacific theaters that the great wars of that era were lost and won. Thus, many Americans are barely aware of the Indian Ocean at all.But in the twenty-first century this will fundamentally change. In Monsoon, a pivotal examination of the Indian Ocean region and the countries known as “Monsoon Asia,” bestselling author Robert D. Kaplan deftly shows how crucial this dynamic area has become to American power in the twenty-first century. Like the monsoon itself, a cyclical weather system that is both destructive and essential for growth and prosperity, the rise of these countries (including India, Pakistan, China, Indonesia, Burma, Oman, Sri Lanka, Bangladesh, and Tanzania) represents a shift in the global balance that cannot be ignored. The Indian Ocean area will be the true nexus of world power and conflict in the coming years. It is here that the fight for democracy, energy independence, and religious freedom will be lost or won, and it is here that American foreign policy must concentrate if America is to remain dominant in an ever-changing world. From the Horn of Africa to the Indonesian archipelago and beyond, Monsoon explores the multilayered world behind the headlines. Kaplan offers riveting insights into the economic and naval strategies of China and India and how they will affect U.S. interests. He provides an on-the-ground perspective on the more volatile countries in the region, plagued by weak infrastructures and young populations tempted by extremism. This, in one of the most nuclearized areas of the world, is a dangerous mix.The map of this fascinating region contains Here lies the entire arc of Islam, from the Sahara Desert to the Indonesian archipelago, and it is here that the political future of Islam will most likely be determined. Here is where the five-hundred-year reign of Western power is slowly being replaced by the influence of indigenous nations, especially India and China, and where a tense dialogue is taking place between Islam and the United States. With Kaplan’s incisive mix of policy analysis, travel reportage, sharp historical perspective, and fluid writing, Monsoon offers a thought-provoking exploration of the Indian Ocean as a strategic and demographic hub and an in-depth look at the issues that are most pressing for American interests both at home and abroad. Exposing the effects of explosive population growth, climate change, and extremist politics on this unstable region—and how they will affect our own interests—Monsoon is a brilliant, important work about an area of the world Americans can no longer afford to ignore.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Asia",
    "India",
    "International Relations",
    "Travel"
  ],
  "author": "Robert D. Kaplan",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/8038000-monsoon"
}