{
  "title": "Driving on the Rim",
  "description": "From one of America’s most acclaimed literary figures (“an important as well as brilliant novelist”— The New York Times Book Review ) a major new novel that hilariously takes the pulse of our times.The unforgettable voyager of this dark comic journey is I. B. “Berl” Pickett, M.D., the die of whose uncharmed life was probably cast as soon as his mother got the bright idea to name him after Irving Berlin. The boyhood insults to any chance of normalcy piled on apace the traumatizing, spasmodic spectacle of Pentecostalist Sunday worship; the socially inhibitory accompaniment of his parents on their itinerant rug-shampooing business; the undue technical advancement and emotional retardation that ensued from his erotic initiation at the hands of his aunt. What would have become of this soul had he not gone to medical school, thanks to the surrogate parenting of a local physician and solitary bird hunter?But there is meaning to life beyond professional accreditation, even in the noblest of callings. Berl’s been on a mission to find it these past few years, though with scant equipment or basis for hope. Hard to say (for the moment anyway) whether his mission has been aided or set back by his having fallen under suspicion of negligent homicide in the death of his former lover. All the same, being ostracized by virtually all his colleagues at the clinic gives him something to chew the reality of small-town living as total surveillance more than any semblance of fellowship, even among folks you’ve known your whole life.Fortunately, for Berl, it doesn’t take a village. And he will find his deliverance in continuing to practice medicine one way or another, as well as in the few human connections he has made, wittingly or not, over the years. The landscape, too, will furnish a hint in what might yet prove, if not a certifiable epiphany, a semi-spiritual awakening in I. B. Pickett, M.D., the inglorious but sole hero of Thomas McGuane’s uproarious and profound exploration of the threads by which we all are hanging.",
  "genres": [
    "Fiction",
    "Novels",
    "Audiobook",
    "Literary Fiction",
    "Mystery",
    "Psychology",
    "Literature"
  ],
  "author": "Thomas McGuane",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/8037963-driving-on-the-rim"
}