{
  "title": "Power/Knowledge: Selected Interviews and Other Writings, 1972-1977",
  "description": "Librarian note: an alternate cover for this edition can be found here.Michel Foucault has become famous for a series of books that have permanently altered our understanding of many institutions of Western society. He analyzed mental institutions in the remarkable Madness and Civilization; hospitals in The Birth of the Clinic; prisons in Discipline and Punish; and schools and families in The History of Sexuality. But the general reader as well as the specialist is apt to miss the consistent purposes that lay behind these difficult individual studies, thus losing sight of the broad social vision and political aims that unified them.Now, in this superb set of essays and interviews, Foucault has provided a much-needed guide to Foucault. These pieces, ranging over the entire spectrum of his concerns, enabled Foucault, in his most intimate and accessible voice, to interpret the conclusions of his research in each area and to demonstrate the contribution of each to the magnificent - and terrifying - portrait of society that he was patiently compiling.For, as Foucault shows, what he was always describing was the nature of power in society; not the conventional treatment of power that concentrates on powerful individuals and repressive institutions, but the much more pervasive and insidious mechanisms by which power \"reaches into the very grain of individuals, touches their bodies and inserts itself into their actions and attitudes, their discourses, learning processes and everyday lives.\"Foucault's investigations of prisons, schools, barracks, hospitals, factories, cities, lodgings, families, and other organized forms of social life are each a segment of one of the most astonishing intellectual enterprises of all time - and, as this book proves, one which possesses profound implications for understanding the social control of our bodies and our minds.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Theory",
    "Sociology",
    "Politics",
    "History",
    "Essays"
  ],
  "author": "Michel Foucault",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/80373.Power_Knowledge"
}