{
  "title": "Zora and Me",
  "description": "Winner of the 2011 John Steptoe New Talent (Author) Award! Racial duplicity threatens an idyllic African American community in the turn-of-the-century South in a dazzling debut inspired by the early life of Zora Neale Hurston.Whether she’s telling the truth or stretching it, Zora Neale Hurston is a riveting storyteller. Her latest creation is a shape-shifting gator man who lurks in the marshes, waiting to steal human souls. But when boastful Sonny Wrapped loses a wrestling match with an elusive alligator named Ghost — and a man is found murdered by the railroad tracks soon after — young Zora’s tales of a mythical evil creature take on an ominous and far more complicated complexion, jeopardizing the peace and security of an entire town and forcing three children to come to terms with the dual-edged power of pretending. Zora’s best friend, Carrie, narrates this coming-of-age story set in the Eden-like town of Eatonville, Florida, where justice isn’t merely an exercise in retribution, but a testimony to the power of community, love, and pride. A fictionalization of the early years of a literary giant, this astonishing novel is the first project ever to be endorsed by the Zora Neale Hurston Trust that was not authored by Hurston herself.Also *an annotated bibliography of the works of Zora Neale Hurston*a short biography of Zora Neale Hurston*a timeline of Zora Neale Hurston’s life\"It is with sheer genius that Bond and Simon have created something for readers young and old--there are familiar references, like the ‘Brazzles,’ for true Zora-philes, as well as revelatory and wondrous information for those readers as yet uninitiated in the masterful storytelling of Zora Neale Hurston. This is a grand and accessible work that educates, informs, and entertains, and one that I am personally grateful was written for all of us.\" — Lucy Anne Hurston, niece of Zora Neale Hurston",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Middle Grade",
    "African American",
    "Fiction",
    "Young Adult",
    "Childrens"
  ],
  "author": "Victoria Bond",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/8032161-zora-and-me"
}