{
  "title": "Brittle Innings",
  "description": "For seventeen-year-old Danny Boles, a 5'5\" shortstop out of Tenkiller, Oklahoma, the summer of 1943 would be a season to remember. The country's at war, and professional baseball needs able-bodied men. Danny's headed for Highbridge, Georgia - home of the Goober Pride peanut butter factory and the Highbridge Hellbenders, a Class C farm club in the Chattahoochee Valley League. He's a scrappy player with one minor quirk: a violent encounter on the train to Georgia has rendered him mute, his vocal cords tied up in knots. Danny's idiosyncrasy, however, is nothing compared to that of his new Hellbender roommate, an erudite seven-foot giant by the name of Jumbo Hank Clerval. With his yellow eyes, strangely scarred face, and sausage-sized fingers, Hank seems to have been put together in a meat-packing plant. But he plays a mean first base and can hit the ball a mile. With the Hellbenders in a pennant race as hot as the relentless Georgia sun, the eloquent Clerval forms a special kinship with the speechless kid from Oklahoma. Danny soon realizes that Hank is not an ordinary man but something more complex...more mysterious than he'd imagined. These two very different ballplayers forge a bond as the season moves inexorably toward its dramatic, and ultimately violent, conclusion. Both want a shot at the major leagues and both want to know what it's like to be a man. But they are about to discover how ambition and desire can turn even the gentlest soul into the worst kind of monster. At turns funny, tragic, and ultimately uplifting, Brittle Innings is a brilliant evocation of a uniquely American drama: a season-long contest in which fantasies are engaged, heroes are created and destroyed, and innocence is lost forever.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Baseball",
    "Sports",
    "Historical Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Michael  Bishop",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/803599.Brittle_Innings"
}