{
  "title": "The Wolf of Tebron",
  "description": "In classic fairy tale style, we embark on an enchanted journey with a young blacksmith—Joran—whose only desire is to live a peaceful, uncomplicated life in his forest village, a desire shattered by the sudden and bizarre disappearance of his wife, Charris. Later, Joran is plagued by nightmares of an unimaginable sea, where Charris remains trapped in a sand castle at the whim of the Moon. The goose woman insists he will find no rest from his nightmares until he solves the riddle of three keys. She tells him to travel the treacherous journey to the house of the Moon to find the answers he seeks. Unable to ignore the urgings of his nightmares, Joran sets out north seeking the Moon. Leaving a town and family where he never felt truly at home, Joran’s journey becomes more than just a search for his wife. His path also leads inward, for he must face emotions that have tormented him his entire life—feelings of alienation and anger, of despair and hurt. Along the way he rescues a wolf—a huge, imposing creature that becomes a companion, and eventually a trusted friend. Joran has the uncanny ability to speak with animals, and learns from the wolf, Ruyah, that he can manipulate his dreams to affect the real world. With Ruyah’s humor and guidance, Joran finds the courage and fortitude to press on, despite setbacks and disappointments. With the wolf by his side he endures the darkness at the end of the world and the ravings of the lunatic Moon, who sends him off—more confused than before—to the Palace of the Sun with a seemingly useless gift. After trekking through a vast, unmerciful desert, Joran arrives at the Palace of the Sun, where he meets the Sun’s mother, Sola. She helps Joran understand part of his riddle and then sends him, with the gift of a sunstone, to the cave of the South Wind, whom, she says, will finally reveal the truth to him about his wife—if he dares hear it. He and Ruyah travel south through jungle, and finally arrive at the cave. There Joran is swept along a vision where he sees his past, and in horror, learns truths that send him into deep despair. The South Wind dismisses him with one last gift—but like the other two gifts, he has no idea what they are for or how they will help him rescue his wife. She tells him to find the sea of his dreams—far west, beyond his imagining.",
  "genres": [
    "Fantasy",
    "Christian Fiction",
    "Young Adult",
    "Christian",
    "Christian Fantasy",
    "Fiction",
    "Fairy Tale Retellings"
  ],
  "author": "C.S. Lakin",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/8037634-the-wolf-of-tebron"
}