{
  "title": "The Land Without Shadows",
  "description": "One of the first literary works to portray Djiboutians from their own point of view, \"The Land without Shadows\" is a collection of seventeen short stories. The author, Abdourahman A. Waberi, one of a handful of francophone writers of fiction to have emerged in the twentieth century from the \"confetti-sized state\" of Djibouti, has already won international recognition and prizes in African literature for his stories and novel. Because his writing is linked to immigration and exile, his native Djibouti occupies center stage in his work. Drawing on the Somali/Djiboutian oral tradition to weave pieces of legend, proverbs, music, poetry, and history together with references to writers as diverse as Soyinka, Shakespeare, Djebar, Baudelaire, Cesaire, Waugh, Senghor, and Beckett, Waberi succeeds in bringing his country into a context that reaches well beyond the Horn of Africa.Originally published in France in 1994 as \"Le Pays sans ombre, \" this newly translated collection presents stories about the precolonial and colonial past of Djibouti alongside those set in the postcolonial era. With irony and humor, these short stories portray madmen, poets, artists, French colonists, pseudointellectuals, young women, aspiring politicians, famished refugees, khat chewers, nomads struggling to survive in Djibouti's ruthless natural environment, or tramps living (and dying) in Balbala, the shantytown that stretches to the south of the capital. Waberi's complex web of allusions locates his tales at an intersection between history and ethnography, politics and literature. While written in a narrative prose, these stories nevertheless call on an indigenous literary tradition that elevates poetry to the highest standing.By juxtaposing the present with the past, the individual with the collective, the colonized with the colonizer, the local with the global, \"The Land without Shadows\" composes an image of Djibouti that is at times both kaleidoscopic and cinematographic. Here the art of the short story offers partial but brilliantly illuminated scenes of the Djiboutian urban and rural landscape, its people, and its history.For sale in the U.S. and its territories only",
  "genres": [
    "Africa",
    "Short Stories",
    "Fiction",
    "Djibouti",
    "African Literature",
    "Adult"
  ],
  "author": "Abdourahman A. Waberi",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/803925.The_Land_Without_Shadows"
}