{
  "title": "Tales from Shakespeare, by C. & M. Lamb, Selected by R.S. Bate",
  "description": "This historic book may have numerous typos, missing text or index. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. 1907. Not illustrated. Excerpt: ... TALES FROM SHAKESPEARE ROMEO AND JULIET. Conceits are quaint thoughts or fancies; prodigious, unnatural; nice here means sharp, keen; star-crossed, unfortunate (because according to old beliefs a man's fortune depended on the position of the stars at his birth); their drift is their plan; corse, corpse; expecting when, waiting till. The two chief families in Verona were the rich Capulets and the Montagues. There had been an old quarrel between these families, which was grown to such a height, and so deadly was the enmity between them, that it extended to the remotest kindred, to the followers and retainers of both sides, insomuch that a servant of the house of Montague could not meet a servant of the house of Capulet, nor a Capulet encounter with a Montague by chance, but fierce words and sometimes bloodshed ensued; and frequent were the brawls from such accidental meetings, which disturbed the happy quiet of Verona's streets. Old lord Capulet made a great supper, to which many fair ladies and many noble guests were invited. All the admired beauties of Verona were present, and all comers were made welcome if they were not of the house of Montague. At this feast of Capulets, Rosaline, beloved of Romeo, son to the old lord Montague, was present; and though it was dangerous for a Montague to be seen in this assembly, yet Benvolio, a friend of Romeo, persuaded the young lord to go to this assembly in the disguise of a mask, that he might see his Rosaline, and seeing her, compare her with some choice beauties of Verona, who (he said) would make him think his swan a crow. Romeo had small faith in Benvolio's words; nevertheless, for the T.s. A - love of Rosaline, he was persuaded to go. For Romeo was a sincere and passionate lover, and one that lost his sleep for l...",
  "genres": [
    "Classics",
    "Fiction",
    "Literature",
    "Short Stories",
    "Plays",
    "Childrens",
    "Young Adult"
  ],
  "author": "Charles Lamb",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/8040092-tales-from-shakespeare-by-c-m-lamb-selected-by-r-s-bate"
}