{
  "title": "Katie Up and Down the Hall: The True Story of How One Dog Turned Five Neighbors into a Family",
  "description": "For families and animal lovers everywhere, Katie Up and Down the Hall is the transcendent tale of how three generations of strangers and an astutely intelligent dog create their own little family in a waterside community along the Hudson River.It all begins with a random meeting between a younger man and his octogenarian neighbor, Pearl, their attachment cemented by a blond-haired puppy. It isn't long before writer Glenn Plaskin, Pearl, and her husband, Arthur, form a profound bond that blesses all in its sphere. This includes a three-year-old boy named Ryan and his single dad, John, who also happen to be living down the same hallway in a downtown Manhattan high-rise, just opposite the World Trade Center.The group gravitates around Katie, the magnetic cocker spaniel whose domain is a 120-foot red-carpeted hallway the site of dog races, obedience training sessions, Halloween parades, and a passageway to parties and late-night exchanges of confidences. With an uncanny instinct for responding to the needs of her pack, Katie merrily trots up and down her territory, navigating from apartment to apartment, pushing open the doors purposefully left ajar and bringing the entire group together. Her canine antics include fashion modeling, using the TV remote, typing, sitting posture-perfect at the dining table (her paws delicately around her food bowl), expertly eating corn on the cob, charming celebrities (Katharine Hepburn, Peter Jennings, Bette Midler, and Ivana Trump among them), and racing neighborhood kids down the hallway.Pearl, nicknamed Granny Down the Hall, is the family s feisty matriarch (and referee), her dining table home base. Ryan, who has no mom, finds a grandmother in Pearl; his dad, with no living parents, inherits a mom; while Glenn discovers a confidante.Over the next sixteen years, we witness adventures that encompass Hollywood high times, bad health, accidents, even the terrors of 9/11, brought to life here as never before. Through it all, this family clings together, sharing a deep bond that gives each comfort, support, and security.But nothing lasts forever nothing except the abiding love of family, which can never be broken apart, even by the inevitability of separation, illness, and death. Based on a widely read article in Family Circle, here is a riveting tale about the true meaning of love and the magic of opening your door to a neighbor, turning friendship to family.",
  "genres": [
    "Animals",
    "Nonfiction",
    "Dogs",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Family"
  ],
  "author": "Glenn Plaskin",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/8044564-katie-up-and-down-the-hall"
}