{
  "title": "Off Track",
  "description": "Off Track is a fantasy quest series about the ultimate fish-out-of-water - a negotiator more used to sly tactics in a magical world where the truth can be determined with a spell and prophecy is real. A LAWYER IN A STRANGE LAND Madeline's always had a purpose. Lately, it's been to make partner at her high-powered law firm, something that she's chased relentlessly for years, even to the exclusion of a social life and any solid relationships. Fate, and some pretty powerful magic, change all of that in minutes. She and her assistant Simon are pulled into another world, where magic and prophecy are real. The people of the Summer Lands are under threat from a blood feud between their ruler, Lord Alric, and the demented warmonger Sayer Goddard. It can only end when one family is destroyed - and Alric has been assassinated, leaving the realm without a leader and open to ransacking by Goddard. It seems that all hope is already lost with the death of Alric's line. It has been foretold, however, that Madeline will play a part in what will save them - even if she's not exactly willing to get involved at all. Alric's wife and the current ruler, Lady Arabela, is pregnant with his son. She needs Madeline's help to finally kill Goddard and end the blood feud, but no one - not even Madeline herself - knows exactly what she's supposed to do. Time is already running short. Their quest to stop Goddard has to be done by the next full moon, or the land will be overrun and destroyed. Arabela is not used to taking no for an answer, especially not with her subjects' lives as stake. But Madeline's not used to being so completely off-track, and she doesn't take orders from anyone - not even someone with magic and an army at their disposal. Today, however, is anything but usual. Today, the life or death of a nation rests with her.",
  "genres": [
    "Romance",
    "Fiction"
  ],
  "author": "P.A.  Wilson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/8038510-off-track"
}