{
  "title": "The Book of Fantasy",
  "description": "The Book of Fantasy began one night when three friends fell to talking about fantasies and ghost stories. The place was Buenos Aires, 1937, and the people were Jorge Luis Borges, Adolfo Bioy Casares and his wife Silvina debated which stories were best, wrote Bioy Casares later, 'and someone suggested that if we brought together the tales and the fragments that we had listed in our notebooks we would have a good book. 'The result is an astonishing collection of stories drawn from all the literatures of the world from Ancient China to Modern America mingling the obscure and the neglected with the already famous and showing a splendid disdain for conventional literary opinion. Among the authors included are Leonid Andreyev, Léon Bloy, Lewis Carroll, Jean Cocteau, O.K. Chesterton, James Joyce, Giovanni Papini, Carlos Peralta and Villiers de L'lsle Adam, some of whom have never been translated before. 'It is some- times said, wrote Bruce Chatwin. 'that all the elements of civilization end up eventually in Argentina, and most of it ends up in Borges' head. His values are those of high Western civilization They say lives in a world of imagination and dreams, but he's central to life. 'Now considerably expanded and published for the first time in English, The Book of Fantasy has a specially-written introduction by Ursula K. Le Guin. twice winner of both the Hugo and Nebula awards. She writes: 'It is an idiosyncratic selection. and completely eclectic. of the stories will be familiar to anyone who reads, others are exotic discoveries. A very well-known piece ... seems less predictable set among works and fragments from the Orient and South America and distant centuries, by Kafka Swedeolorg Cortäzar, Akutagawa. Niu Chiao; its own essential strangeness is restored to This is, quite simply, the finest anthology of its kind.--front flap",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Literature",
    "Anthologies",
    "Magical Realism",
    "Classics"
  ],
  "author": "Jorge Luis Borges",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/80477.The_Book_of_Fantasy"
}