{
  "title": "Thank You For Your Cooperation",
  "description": "Greetings, citizen. Thank you for volunteering to take this mandatory survey. Rest assured that your answers will in no way affect your Employment, Lifestyle, Anatomy, or Other. By participating, you are helping to ensure that the Bunker remains the perfect environment for happy, satisfied workers hoping to achieve their greatest potential. Before you begin, please be aware of the following. This information is provided for your safety, so please pay attention. Although there are no correct answers, failure to [[ ---- DATA TRANSMISSION ERROR ---- ]] punishment by fine or corrective surgery. In addition, unless you specifically [[ ---- NULLPOINTEREXCEPTION ---- ]] at the proper time. You have been warned. First Select one and only one answer from those provided. If Control were not in charge of every aspect of day-to-day life in the Bunker, who or what would be the best substitute? A. Myself B. The Head of Homeland Security C. It is utterly ridiculous to suppose that Control would go offline, let alone that it could be replaced. Second Select one and only one answer from those provided. Earth is the planet in the solar system where all humans originated. A. True B. False C. For obvious health reasons, I have never heard of Earth. Third Select one and only one answer from those provided. If I discovered that one of my colleagues was storing spent nuclear fuel behind stacks of unused marketing material and was receiving black market currency in return, I would do the A. Demand to get in on the action B. Turn to blackmail C. Pretend I didn't notice D. None of the Above If you answered \"D. None of the Above\" to the previous question, please explain exactly what you think is wrong with this survey and why you are refusing to fill it out. Print legibly and use only the space provided. [ _____________ ] You have reached the end of the survey. Right now, highly trained behavioral analysts over at Central Management are processing your responses to determine the likelihood that you will suffer a sudden outbreak of disloyalty in the near future. In the event that any follow-up is required, a personal service agent will contact you. Thank You For Your Cooperation.",
  "genres": [
    "Science Fiction",
    "Dystopia",
    "Fiction"
  ],
  "author": "Adam   Wasserman",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13097644-thank-you-for-your-cooperation"
}