{
  "title": "Marx in Soho: A Play on History",
  "description": "Don't you ever wonder: why is it necessary to declare me dead again and again? The premise of this witty and insightful \"play on history\" is that Karl Marx has agitated with the authorities of the afterlife for a chance to clear his name. Through a bureaucratic error, though, Marx is sent to Soho in New York, rather than his old stomping ground in London, to make his case.Zinn introduces us to Marx's wife, Jenny, his children, the anarchist Mikhail Bakunin, and a host of other characters.Marx in Soho is a brilliant introduction to Marx's life, his analysis of society, and his passion for radical change. Zinn also shows how relevant Marx's ideas are for today's world.Historian and activist Howard Zinn is the author of the bestselling A People's History of the United States and numerous other writings. He recently received the Eugene V. Debs and Lannan Foundation awards for his writing and political activism. He is also the author of Emma, a play about Emma Goldman, in the anthology Playbook (South End Press).Praise for Marx in Soho:\"An imaginative critique of our society's hypocrisies and injustices, and an entertaining, vivid portrait of Karl Marx as a voice of humanitarian justice - which is perhaps the best way to remember him.\"-Kirkus Reviews\"A cleverly imagined call to reconsider socialist theory... Zinn's point is well made; his passion for history melds with his political vigor to make this a memorable effort and a lucid primer for readers desiring a succinct, dramatized review of Marxism.\"-Publishers Weekly\"Even in heaven it seems, Karl Marx is a troublemaker. But in the deft and loving hands of activist/author/historian Howard Zinn, the historical figure... is also a father, a husband and a futurist possessing a grand sense of humor.\"-ForeWord\"A witty delight that will engage both new and old acquaintances of the Marxian corpus.... Even conservatives will find Zinn's [book]... an intelligent and diverting read. Recommended for academic and public libraries alike.\"-Library Journal",
  "genres": [
    "Plays",
    "History",
    "Politics",
    "Drama",
    "Philosophy",
    "Theatre",
    "Nonfiction"
  ],
  "author": "Howard Zinn",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/80474.Marx_in_Soho"
}