{
  "title": "The Golden Horse & Other Fairy Tales – Modern Fairy Tales for the Magical Child",
  "description": "Created by Master Story Teller Silvia Hartmann For Magical Children Aged 9–99, The Golden Horse is an anthology of absolutely original, highly creative stories told in traditional fairy tale format to enlighten, inspire and foster curiosity and delight in exploration.Modern yet ageless, hypnotic and enchanting, perfect for being read out and spoken aloud, these stories will speak to the magical child within us all.Story is the oldest and most profound device of human learning, and of change.Fairy tales especially, with their timeless settings, their powerful imagery and rhythms, their patterns and their unfoldments, shape our lives and thinking more than most will ever know.For those who want to escape from the \"lessons\" learned in childhood about evil witches who eat little children, of monkey's paws and the dangers of wishing for anything at all and re-claim their magic in a very different way, The Golden Horse is the perfect antidote – here are NEW, powerful stories of true magic, of power, indeed, of our personal, god-given power to change the world and live lives filled with enchantment.Like the Golden Horse, these stories are here to help us today throw off the shackles of the valley of the shadows, and live and dance in the light of beauty, and of truth.Perfect for sharing with real children, perfect for the child within, perfect and unusual tools for self help and therapy, these stories can be used to change minds, and hearts, and most of all, re-connect us to the magic we once knew for real when we were still a child.16 Wonder-Filled Stories For The Magical Child:Elory's JoyThis wonderful meta-story opens the story ring that is The Golden Horse and takes us to a place of brilliant brightness and the learnings of all times – the world of the story tellers, where each story is a star, each story is a song, resplendent in the universal map that corresponds to the living universe itself. Elory's Joy is a gateway to the magic of creativity – and of truth.The Golden HorseThe Golden Horse is a story of re-unification – and a cautionary tale of the terrible loss and heartache that occurs when the spirit world is lost because it is deemed to be unimportant for daily survival. Here, good does not just win out over the evil – it is triumphant in love and the splendours of the future.Sereya's SongLittle Sereya has given up her power of speech because she thinks that no-one understands, and no-one listens. But then she finds another language and another way so she can tell her story.The Roach MasterFreedom and redemption are the themes of The Roach Master, a man who had to survive in terrible circumstances. But situations change and time moves on. It is easy to take a man out of prison. But what does it take to take the prison out of the man?Darain Of The DragonsDo you believe in miracles? Do you remember what it was like to be a child and falsehood was a game you hadn't learned to play, a time when your heart was pure and all was truth? Darain of The Dragons comes to remind us of the beauty of innocence – and its power to truly change the world.The Magic PictureThe Magic Picture is a tale of warning and a good story to think on further, to discover its meanings and relevancy for how we think and act each day.The Crystal MagicianWhat is good, and what is evil? How do we turn the evil into the good? The Crystal Magician learns the truth about the matter and he finds out, just as those who will read this wonderful story about bringing beauty and light through courage, and love.The Hero Of A 1000 WarsOnce in a while, a story comes along that you've never read before and yet it feels familiar – here is something that we know and we have dreamed about ...Deep Sea JewelsWhy are mermaids being killed and their tails sold off for fish? Find out what happened and how it was put right in the tale of Deep Sea Jewels.In SanctuaryIn Sanctuary is a story about the truth and purity of nature, but at the same time, it is also a very personal story about a little girl who could not stop complaining ...The Fairy GiftSometimes, a woman's magic can be found within. And at other times, especially when the moon is bright and round, one might need to get dressed against the chill of the night and find another kind of magic ...The 12th SpiritThe 12th Spirit is a truly beautiful story about life, and death. Deeply moving and entirely visionary, this is a story you will never forget.The Book Of LawNot all fairy tales are like the three little pigs. There are others, complex, frightening and wild – and the Book Of Law is amongst the latter. This is an amazing story about sin, and time, and finally, about redemption.Star ChildMeet the lonely woman who wanted nothing more than a child – and whose prayers were answered. A Star Child was given to her to take care of for a time. But what will happen when this time is over, and the Star Child has to be returned ...?The Heart Of The DesertA great magician and his two young apprentices set out on a journey from which no-one has ever returned – to find the Heart Of The Desert.The WeddingMysterious, beautiful and exciting, The Wedding closes the story ring that began with Elory's Joy. Meet the magician Shakastra, the princess Harmony, the slayers and the dragon lady in the nightlands, long ago ... 16 exquisite stories, vibrant with life and emotion, a nourishment for the soul.To share with your child, your child within, and those you love.Absolutely original stories that make you smile and weep, that make you think.Note: The eBook edition of the Golden Horse contains full colour illustrations whilst the Paperback edition contains black and white illustrations.",
  "genres": [
    "Fantasy"
  ],
  "author": "StarFields",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/8060408-the-golden-horse-other-fairy-tales-modern-fairy-tales-for-the-magica"
}