{
  "title": "The Globalization of Addiction: A Study in Poverty of the Spirit",
  "description": "'The Globalization of Addiction' presents a radical rethink about the nature of addiction.Scientific medicine has failed when it comes to addiction. There are no reliable methods to cure it, prevent it, or take the pain out of it. There is no durable consensus on what addiction is, what causes it, or what should be done about it. Meanwhile, it continues to increase around the world. This book argues that the cause of this failure to control addiction is that the conventional wisdom of the 19th and 20th centuries focused too single-mindedly on the afflicted individual addict. Although addiction obviously manifests itself in individual cases, its prevalence differs dramatically between societies. For example, it can be quite rare in a society for centuries, and then become common when a tribal culture is destroyed or a highly developed civilization collapses. When addiction becomes commonplace in a society, people become addicted not only to alcohol and drugs, but to a thousand other destructive money, power, dysfunctional relationships, or video games. A socialperspective on addiction does not deny individual differences in vulnerability to addiction, but it removes them from the foreground of attention, because social determinants are more powerful.This book shows that the social circumstances that spread addiction in a conquered tribe or a falling civilisation are also built into today's globalizing free-market society. A free-market society is magnificently productive, but it subjects people to irresistible pressures towards individualism and competition, tearing rich and poor alike from the close social and spiritual ties that normally constitute human life. People adapt to their dislocation by finding the best substitutes for a sustaining social and spiritual life that they can, and addiction serves this function all too well.The book argues that the most effective response to a growing addiction problem is a social and political one, rather than an individual one. Such a solution would not put the doctors, psychologists, social workers, policemen, and priests out of work, but it would incorporate their practices in a larger social project. The project is to reshape society with enough force and imagination to enable people to find social integration and meaning in everyday life. Then great numbers of them would not need to fill their inner void with addictions.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Sociology",
    "Medicine",
    "Health",
    "Politics",
    "Social Science"
  ],
  "author": "Bruce K. Alexander",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/8062873-the-globalization-of-addiction"
}