{
  "title": "My Theodocia: As Told By: Stormy",
  "description": "My Theodocia - by Stormy describes the first twenty-three years of life with vivid detail and uncompromising honesty. Theodocia is twice adopted and known as Theo, as her full name is not revealed to her until she is sixteen. Stormy draws you in with her exceptional descriptive skill. You feel like you are one of her friends playing with her in the playhouse, riding bikes and taking turns on the swing. The warm memories bring fond thoughts of your own childhood. Then the scene changes and hits hard, leaving the reader sad, disturbed and even angry. Where are the parents, teachers, the church, and other adults? None come to Theo's aid. There are many traumas-some by others and some by cruel fate. All leave a lasting scar. This is more than a retelling of abuse and neglect. This is an inspirational story of unimaginable perseverance. Theodocia, she shows a colossal level of courage and determination to survive and to flourish. She marries the love of her life and soon has a son. Marriage and motherhood bring a measure of stability and love to her life that she had not known. She begins to worry about the loss of sizeable chunks of time in her day. In the last few pages, the family is packed and moving again and we are left to wonder if the time lapses and interrupted concentration are the first symptoms of future problems caused by the many traumas. In closing, Stormy tells about a diagnosis of Bi-Polar Disorder and a later diagnosis of DID (Dissociative Identity Disorder previously known as Multiple Personality Disorder). The tone is set for the upcoming Stormy Journey; a sequel featuring the network of personalities that live inside her. The strength needed to write her story, reliving each painful moment, is extraordinary. Hard to put down and impossible to forget, I highly recommend that you read My Theodocia. Reviewed by WR Potter For Reader's Choice Literary Reviews",
  "genres": [],
  "author": "Theodocia McLean",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/8062081-my-theodocia"
}