{
  "title": "Lying-In: A History of Childbirth in America",
  "description": "This lively history of childbirth begins with colonial days, when childbirth was a social event, and moves on to the gradual medicalization of childbirth in America as doctors forced midwives out of business and to the home-birth movement of the 1980’s. Widely praised when it was first published in 1977, the book has now been expanded to bring the story up to date. In a new chapter and epilogue, Richard and Dorothy Wertz discuss the recent focus on delivering perfect babies, with its emphasis on technology, prenatal testing, and Caesarean sections. They argue that there are many viable alternatives―including out-of-hospital births―in the search for the best birthing system.Review of the first “Highly readable, extensively documented, and well illustrated…A welcome addition to American social history and women’s studies. It can also be read with profit by health planners, hospital administrators, ‘consumers’ of health care, and all those who are concerned with improving the circumstances associated with childbirth.”―Claire Elizabeth Fox, bulletin of the History of Medicine“A fascinating, brilliantly documented history not merely of childbirth, but of men’s attitudes towards women, the effect of a burgeoning medical profession on our very conception of maternity and motherhood, and the influence of religion on medical technology and science.”―Thomas J. Cottle, Boston Globe“This superb book…is both an impeccably documented recitation of the chronological history of medical intervention in American childbirth and a sociological analysis of the various meanings given to childbirth by individuals, interested groups, and American society as a whole.”―Barbara Howe, American Journal of SociologyRichard W. Wertz, a builder in Westport, Massachusetts, is formerly an associate professor of American history at the Massachusetts Institute of Technology.Dorothy C. Wertz, is a research professor at the School of Public Health, Boston University",
  "genres": [
    "History",
    "Nonfiction",
    "Womens",
    "Feminism",
    "Health",
    "Medicine",
    "Gender"
  ],
  "author": "Richard W. Wertz",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/805681.Lying_In"
}