{
  "title": "For the Beauty of the Earth: A Novel",
  "description": "In his late twenties Bruce Warrick holds a Harvard MBA and a new position for a global, financial conglomerate in New York as the portfolio manager of a Top 50 Hedge Fund even as he suffers from a severe sleep disorder. His powerful CEO compels him to join a private, hedge fund association -- the Keynes Society at the Harvard Club of New York. Bruce learns that the Keynes Society privately controls $1 trillion in a \"dark pool\" of hidden assets -- more than the combined Gross Domestic Product (GDP) of all but eight nations worldwide. The trouble begins when Bruce learns that the members of the Keynes Society are trading stocks under the influence of an enigmatic Board of Governors. When Bruce is advised by his firm to engage in the illegal trading practices of the Keynes Society, he wants to become a whistle-blower. But why risk paradise on earth against such intimidating power? What's the net asset value of one's soul?\"Lentz's approach to writing is soul driven.\" --The Weston Forum \"His writing is different because he does not manufacture cookie-cutter best-sellers but writes on a higher plane for a higher purpose.\" --The Wilton Bulletin\"There is a balance in his writing. Lentz has a talent for blending a compelling story line with pathos and humor, a measure of literary and historical allusion, and vivid imagery. The result is the literary equivalent of high definition -- the reader is bombarded with rich text that infuses the senses.\" -- The Greenwich Post\"As in most of his stories, there is more than one tale to tell in this new novel. The protagonist is a kind of Adam before the Fall with a great Achilles heel.\" --The Darien Times\"This is about what happens when you lose everything and you're stripped down to the bare human essentials.\" --The Ridgefield Press\"The retention of dignity is a recurring theme in Lentz's novels. There is always one major conflict -- the position of the individual against a great antagonistic force.\" --The Lewisboro Ledger\"Lentz especially likes to explore how creative people survive and contribute in a large and often impersonal environment. What is the role of a talented individual, an artist for example, in a complex, vast society?\" -- The New Canaan Advertiser",
  "genres": [],
  "author": "David B. Lentz",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/8062659-for-the-beauty-of-the-earth"
}