{
  "title": "The Doctor's Wife",
  "description": "The role of the Japanese woman in modern society still retains many of the characteristics that it had in the late eighteenth century, when this novel takes place. In those days, the life of a woman, whether married or single, was one of unending drudgery and toil. Reward or recognition cameonly indirectly, through the success of the male members of the family.Thus, this novel is really two on the one hand, the successful medical career of Hanaoka Seishu, the first doctor in the world to perform surgery for breast cancer under a general anesthetic; on the other hand, the lives of his wife and his mother, who supported him with stoic resignation,even to the extent of finally volunteering to be used as guinea pigs in his experiments.Kae, the wife, joins the household of the local doctor as the bride of his son, Hanaoka Seishu, who is still away pursuing his medical studies in Kyoto. Her mother-in-law, Otsugi, is both beautiful and extremely proud of the tradition of the doctor's family. Though their relationship is one ofaffection at first, it declines into tension and eventually into bitter competitiveness and hatred, fostered by the claustrophobic social customs of the time. The two women-the wife who struggles to adapt to a new household and gain the affection of her unfamiliar husband, and the over possessivemother-in-law dedicated to the fulfillment of her son's ambitions-vie with one another to serve one man. Kae suffers the most, for the new anesthetic that the doctor tries on her has devastating results.Readers of The Doctor's Wife will find a tender and compassionate tale about a woman of great strength and courage, as well as an impelling account of Japanese society and the role of women in it.",
  "genres": [
    "Japan",
    "Fiction",
    "Historical Fiction",
    "Japanese Literature",
    "Asia",
    "Classics",
    "Novels"
  ],
  "author": "Sawako Ariyoshi",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/80605.The_Doctor_s_Wife"
}