{
  "title": "The Tsathoggua Cycle: Terror Tales of the Toad God",
  "description": "Can a god be a pet? Even a devil-god who relishes human sacrifice? It is hard to deny that for his creator and godfather, Clark Ashton Smith and H. P. Lovecraft, Tsathoggua was exactly that. They found the Saturnian-Hyperborean-N'klaian toad-bat-sloth-deity as cute and adorable as horrific, and this strange ambivalence echoes throughout their various tales over which Great Tsathoggua casts his batrachian shadow Some are droll fables of human foibles; others are terrifying adventures of human delvers who perish in the fire of a religious fanaticism fully as awful as its super-sub-human object of worship. Tsathoggua has inspired many types of stories in many moods. And not just by Smith and Lovecraft In this arcane volume you will read Tsathogguan tales old and new by various writers, chronicling the horrors of the amorphous amphibian's descent into new decades and deeper waters. The mere fact that such a thing is possible attests mightily the power of the modern myth of Tsathoggua, and the men who created him This book is part of an expanding collection of Cthulhu Mythos horror fiction and related topics. Call of Cthulhu fiction focuses on single entities, concepts, or authors significant to readers and fans of H.P. Lovecraft.Contents and authors in order --From the Parchment of Pnom (Clark Ashton Smith)The Seven Geases (Clark Ashton Smith)The Testament of Athammaus (Clark Ashton Smith)The Tale of Satampra Zeiros (Clark Ashton Smith)The Theft of the Thirty-Nine Girdles (Clark Ashton Smith)Shadow of the Sleeping God (James Ambuehl)The Curse of the Toad (Loay Hall and Terry Dale)Dark Swamp (James Anderson)The Old One (John Glasby)The Oracle of Sadoqua (Ron Hilger)The Horror Show (Gary Myers)The Tale of Toad Loop (Stanley C. Sargent)The Crawling Kingdom (Rod Heather)The Resurrection of Kzadool-Ra (Henry J. Vester III)",
  "genres": [
    "Horror",
    "Cthulhu Mythos",
    "Lovecraftian",
    "Anthologies",
    "Weird Fiction",
    "Fantasy",
    "Supernatural"
  ],
  "author": "Robert M. Price",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/806796.The_Tsathoggua_Cycle"
}