{
  "title": "Ophelia Speaks",
  "description": "The Barnes & Noble ReviewWhen Sara Shandler was 16, she read psychologist Mary Pipher's \nReviving Ophelia\n. \"Horror stories of eating disorders, self-mutilation, abusive relationships floated across the page,\" Shandler writes of Pipher's book on adolescent girls. \"Pipher equated our contemporary adolescent experiences to Shakespeare's ill-fated Ophelia.\" Shandler identified with the emotional experiences described in the book. \"However,\" she explains, \"I did not feel simply spoken to, I felt spoken for.\"With courage and unselfconscious audacity, Shandler decided to speak for herself. She had her friends write reflections on subjects such as eating disorders, sex, drugs, and child abuse, and scored a book deal. With the help of her publisher, HarperPerennial, Shandler sent queries for firsthand adolescent accounts to high school principals across the country, asking them to enlist the help of English teachers, parents associations, school psychologists, etc. (This letter appears as Appendix A in the book.) Not too shabby for a kid who only recently started getting serious about studying, and drinking lots of coffee.Ophelia Speaks: Adolescent Girls Write About Their Search for Self is the result of Sara Shandler's crusade. Her goal was to bring real voice to Reviving Ophelia. She succeeds. The voices are raw and young and jarring -- sometimes adult-like, sometimes childlike, and more often both, like Shandler's voice.Shandler introduces each chapter -- \"Intoxication,\" \"Rape and Sexual Abuse,\" \"Questions of Faith,\" \"Diverse Sexualities,\" \"Mothers, Feminist Pride,\" etc.-- with personal anecdotes of her own. Through these introductions, it becomes clear that Shandler is like any modern American teenager: She has experimented lightly with drugs, had sex at an early age (one month shy of 15), is mildly infatuated with her weight, and was at one point pretty depressed (as in, the thought of suicide once crossed her mind). Pretty run-of-the-mill teen stuff. Somehow it is surprising that nothing \"worse\" ever happened to Shandler. It seems too simple that her only motivation to complete this project was to help other teens feel less alone. Then again, maybe it is too simple to think that all books of this kind must be written by damaged teens or once-damaged teens.By definition, Shandler's carefully selected contributions are young words for young ears. But they are also an intense reminder for older ears: When all you have lived is 16 years, thinking once of suicide feels like the biggest thing ever. This is not to belittle Shandler's impressive compilation or her honesty. She is very, very honest. In a chapter entitled \"Broken-Hearted Independence,\" she explains how she got through the tragedy of breaking up with her first love. \"[W]ith our separation I forced myself to face the dependence that left me alone and broken with our breakup. That confrontation was frightening. I was not brave in the usual sense. I cried often and hard. But instead of lonely isolation, I read and wrote and thought and thought. I buried myself in Virginia Woolf and Alice Walker, Margaret Atwood and Maya Angelou, Sylvia Plath and Toni Morrison, and I wondered why women I had never met knew me so well. With these women I was not so alone anymore.\"Each entry in this book is this bare, this open. Which is why Ophelia Speaks works as a book for teens by teens, but also as a tool for parents who want to know -- or remind themselves -- of what lies just around the corner. (Alexandra Zissu)",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Feminism",
    "Essays",
    "Memoir",
    "Mental Health",
    "Parenting"
  ],
  "author": "Sara Shandler",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/80688.Ophelia_Speaks"
}