{
  "title": "سيرة خاتم النبيين",
  "description": "“Kaum muslimin sekarang sangat membutuhkan orang yang dapat mengembalikan kepercayaan diri mereka, kebanggaan mereka atas masa silam dan harapan kepada masa depan. Dan lebih membutuhkan lagi terhadap orang yang dapat mengembalikan keimanan mereka kepada agama ini; agama yang mereka pikul namanya tetapi tidak mengenal akan hakikatnya; agama yang mereka anut lebih karena keturunan daripada pengertian (pemahaman).” [Sayyid Quthb]“yang membuat saya merasa senang memberikan pengantar pada buku ini adalah karena kualitasnya. Sebab, tidak semua buku sejarah memiliki keindahan penulisan, mempersembahkan yang orisinil dan baru. Tidak sedikit buku-buku sejarah yang hanya merupakan pengulangan dari sebagian buku lainnya.Buku ini ditulis oleh seorang tokoh yang memang mendalami sirah. Dan sirah-pun telah terpatri dalam disiplin keilmuannya. Dalam sirah, beliau menemukan sumber ilham bagi pemikirannya dan sumber keteladanan bagi perilakunya. Beliau menemukan dalam kepribadian Muhammad Saw. petunjuk kenabian yang disucikan serta kecerdasan yang mulia dan luar biasa. Beliau berbicara tentang sirah dengan kecerdasan seorang pakar dan peneliti, serta dengan hati seorang pecinta yang sedang dimabukkan kerinduan. Ini adalah sebuah buku yang merangkai berbagai kitab sejarah dalam hal penulisan sirah. Penulisnya mengetahui tulisan tentang sejarah dalam buku-buku karya para ahli, baik masa lalu maupun masa kini, baik yang ditulis dengan bahasa Arab, bahasa Urdu, bahasa Persia maupun bahasa Inggris.Dari ramuan berbagai referensi tersebut diatas, Syekh Abdul Hasan an-Nadwi berhasil menciptakan buku ilmiah yang istimewa ini, yang dikemas dengan bahasa sastra yang runtut dan indah, yang memuaskan dahaga intelektual, menggetarkan hati dan membangkitkan keinginan. Beliau berhasil mengetengahkan sebuah tulisan dengan gaya bahasa yang merupakan gabungan antara kedalaman ilmu, kecemerlangan sastra dan semangat dakwah, serta gabungan antara kilau keindahan dan semerbak zaman.” [Syaikh Yusuf al-Qaradhawi]",
  "genres": [
    "Islam",
    "Religion",
    "Nonfiction",
    "History",
    "Biography"
  ],
  "author": "Abul Hasan Ali Nadwi",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/8067845"
}