{
  "title": "The Man Who Loved Books Too Much: Kisah Nyata tentang Seorang Pencuri, Detektif, dan Obsesi pada Dunia Kesusastraan",
  "description": "copy-editor: Indradya Susanto PutraApa yang sanggup kaulakukan demi cintamu pada buku? Bagi John Charles Gilkey, jawabannya: masuk penjara.Gilkey, si pencuri buku yang tak pernah bertobat, telah mencuri buku-buku langka dari seluruh penjuru negeri. Namun, tak seperti kebanyakan pencuri yang mencuri demi keuntungan, Gilkey mencuri demi cinta: cinta pada buku. Barangkali, sama obsesifnya dengan Gilkey adalah Ken Sanders, seseorang yang menyebut dirinya “bibliodick” (penjual buku yang merangkap sebagai detektif) dan sangat ingin menangkap si pencuri. Sanders—seumur hidup menjadi kolektor dan penjual buku langka berubah menjadi detektif amatir—tak akan berhenti memburu si pencuri yang mengacaukan perdagangannya.Mengikuti kedua karakter eksentrik ini, jurnalis Allison Hoover Bartlett terjun ke dalam gairah dunia buku yang fanatis, hingga akhirnya mendapati dirinya terjebak di antara orang-orang yang tertarik menemukan harta kekayaan yang dicuri Gilkey dan seorang lelaki yang ingin tetap menyembunyikan harta kekayaan itu: sang pencuri itu sendiri. Dengan perpaduan ketegangan, wawasan, dan humor, Bartlett merangkai permainan kejar-kejaran ala kucing dan tikus menjadi narasi yang sangat memukau dan memacu adrenalin: tidak saja menunjukkan bagaimana Gilkey melakukan kejahatannya dan bagaimana Sanders akhirnya menangkapnya, tapi juga mengeksplorasi romansa buku, keinginan untuk mengoleksinya, dan godaan untuk mencurinya. Semua kolektor punya cerita tentang bagaimana mereka bisa jatuh cinta pada buku, begitu juga dengan Gilkey dan Sanders. Dan, Bartlett meletakkan cerita mereka ke dalam konteks yang lebih besar dari gairah terhadap buku, pengoleksian, dan pencurian selama berabad-abad. Mengantarkan pembaca ke dalam dunia obsesi kesusastraan yang luas dan kaya, The Man Who Loved Books Too Much menunjukkan peran besar buku dalam kehidupan kita, penghormatan yang menjadikan buku-buku itu tetap dipertahankan, dan keinginan yang membuat sebagian orang mempertaruhkan apa saja demi memiliki buku yang mereka sukai.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "True Crime",
    "Biography",
    "Crime",
    "History",
    "Mystery"
  ],
  "author": "Allison Hoover Bartlett",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/8064452-the-man-who-loved-books-too-much"
}