{
  "title": "How to Write Your Memoirs: A Workbook and Guide",
  "description": "HOW TO WRITE YOUR MEMOIRSA WORKBOOK AND GUIDEbyJOHNNY RAYAward Winning NovelistAnd Professional Memoir Ghostwriter  Do you have a legacy that needs to be preserved?Would you like to see your life told in the form of a novel?Or made into a movie?Making you both rich and FamousWhat words of wisdom do you want to leave for your family?Would you like to have your life's work validated?Or the record set straight?In RealityWhen will you write your memoirs?Tomorrow, or the next or . . . Written by master storyteller JOHNNY RAY this guide and workbook will lead you through the process of telling the story that must be told and can only be told by you.   A BRIEF OVERVIEW OF WHAT YOU WILL RECEIVE   1) An introduction to what is a memoir2) How to get started3) How to recall the memories that make up the pages of your life4) Determining the main turning points in your life5) How to stay focused on the main story6) Deciding which characters to include or exclude7) Doing research and fact checking8) Determining the author's voice and point of view9) Determining if the book should be factual or fiction10) Determining the driving purpose behind writing the memoir11) Determining who the intended reader is12) Determining how open the author wishes to be13) Showing versus telling14) How to polish the memoir15) How to find an agent or publisher16) Other methods of getting published17) How to hire a ghostwriter18) A list of questions a ghostwriter will usually ask   This guide and workbook will lead you through the steps to create your own memoir. A ghostwriter can cost you as much as $500 for even a short story type memoir to over $100,000 for a full length memoir. The consulting fee alone can run to as much as $500 per hour. This guide will save you money as it shows you how to develop and write your own memoir. if you decide you do need to hire a ghostwriter later the instructions enclosed in the guide and workbook should decrease the cost of hiring a ghostwriter by lowering the amount of time the ghostwriter has to spend in developing the story, saving you thousands of dollars.",
  "genres": [],
  "author": "Johnny Ray",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/13098715-how-to-write-your-memoirs"
}