{
  "title": "Tales of the Cthulhu Mythos",
  "description": "\"The oldest and strongest emotion of mankind is fear, and the oldest and strongest kind of fear is fear of the unknown.\"—H.P. Lovecraft, \n Supernatural Horror in Literature\nHoward Phillips Lovecraft forever changed the face of horror, fantasy, and science fiction with a remarkable series of stories as influential as the works of Poe, Tolkien, and Edgar Rice Burroughs. His chilling mythology established a gateway between the known universe and an ancient dimension of otherworldly terror, whose unspeakable denizens and monstrous landscapes—dread Cthulhu, Yog-Sothoth, the Plateau of Leng, the Mountains of Madness—have earned him a permanent place in the history of the macabre.In Tales of the Cthulhu Mythos, a pantheon of horror and fantasy's finest authors pay tribute to the master of the macabre with a collection of original stories set in the fearsome Lovecraft tradition:\"The Call of Cthulhu\" by H.P. Lovecraft: The slumbering monster-gods return to the world of mortals.\"Notebook Found in a Deserted House\" by Robert Bloch: A lone farmboy chronicles his last stand against a hungering backwoods evil.\"Cold Print\" by Ramsey Campbell: An avid reader of forbidden books finds a treasure trove of deadly volumes—available for a bloodcurdling price.\"The Freshman\" by Philip José Farmer: A student of the black arts receives an education in horror at notorious Miskatonic University.Plus eighteen more spine-tingling tales!Iä! Iä! Cthulhu Fhtagn! • essay by Jim TurnerTales of the Cthulhu Mythos • interior artwork by J.K. PotterThe Call of Cthulhu • [Cthulhu Mythos] • (1928) • novelette by H. P. LovecraftThe Return of the Sorcerer • (1931) • short story by Clark Ashton SmithUbbo-Sathla • (1933) • short story by Clark Ashton SmithThe Black Stone • (1931) • short story by Robert E. HowardThe Hounds of Tindalos • (1929) • short story by Frank Belknap LongThe Space-Eaters • (1928) • novelette by Frank Belknap LongThe Dweller in Darkness • (1944) • novelette by August DerlethBeyond the Threshold • (1941) • novelette by August DerlethThe Shambler from the Stars • (1935) • short story by Robert BlochNotebook Found in a Deserted House • (1951) • novelette by Robert BlochThe Salem Horror • [Michael Leigh] • (1937) • short story by Henry KuttnerThe Terror from the Depths • (1976) • novelette by Fritz LeiberRising with Surtsey • (1971) • novelette by Brian LumleyCold Print • (1969) • short story by Ramsey CampbellThe Return of the Lloigor • (1969) • novella by Colin WilsonMy Boat • (1976) • short story by Joanna RussSticks • (1974) • novelette by Karl Edward WagnerThe Freshman • (1979) • short story by Philip José FarmerJerusalem's Lot • (1978) • novelette by Stephen KingDiscovery of the Ghooric Zone • (1977) • short story by Richard A. Lupoff",
  "genres": [
    "Horror",
    "Fiction",
    "Short Stories",
    "Fantasy",
    "Anthologies",
    "Science Fiction",
    "Lovecraftian"
  ],
  "author": "Jim Turner",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/806933.Tales_of_the_Cthulhu_Mythos"
}