{
  "title": "Split Sense",
  "description": "When a senator and pharmaceutical giant partner to experiment with a new drug on pregnant women, they tap into a world they never knew existed – the supernatural touching the natural – and it will cost the innocent more than they know.Split Sense interweaves the lives of two families, twins separated at birth, and two different but powerful gifts that each child discovers which impacts their lives and others in unbelievable ways.Zander Howard has been able to hear the thoughts of those around him for as long as he can remember. Sometimes he is overwhelmed with feelings of anger, joy, or fear that is not his own. He tastes words, feels sounds, is surrounded with voices in the dark of night. He is Howard Pharmaceutical’s prize guinea pig. He wishes to be free of the company and their mind games, but his father is caught up in their web of deceit and can’t bring the Company down without destroying his family in the process.Emma Tatum has been sheltered in a small town with loving parents who have no idea she’s not their own flesh and blood. She also has a gift. The ability to heal with music. She sees colors of mercy and grace fly from her fingers with each note she plays.When the twins are reunited, nothing will stop them from seeking the truth about their origins, but someone is willing to commit murder to keep the project secret, while others want to possess the power of the twins. For a boy who has been used his entire life, learning to trust isn’t easy. But through Emma, Zander has a glimpse of a loving God whose plan of providence has brought them together at just the right time.(This is a thriller with Christian elements, people struggling with faith to reconcile events in the storyline. Just as the real world has believers and unbelievers, my fictional world is populated with the same.)Split Sense won The Grace Awards for speculative fiction published in 2011. Barbara Ellen Brink is also the author of the Fredrickson Winery mystery novels, \"Entangled\" and \"Crushed.\"",
  "genres": [
    "Fiction",
    "Christian Fiction",
    "Fantasy",
    "Contemporary",
    "Science Fiction",
    "Mystery Thriller",
    "Christian"
  ],
  "author": "Barbara Ellen Brink",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/13098946-split-sense"
}