{
  "title": "The Rabelais Alliance",
  "description": "In a place where space and time collide, the future of mankind will be decided.On the edge of a region of space so terrible it has long been known as 'Hellgate,' the super-carriers of Earth's DeepSky Fleet play an endless cat-and- mouse game with the starship wreckers, the privateers who, alone, can navigate the wilds of the Rabelais Drift.The super-carriers are the most magnificent ships in space, but under the iron control of a corrupt officer corps, unanswerable to any authority, parsecs from the nearest center of civilian or military justice, these leviathans have become hellships where conscripts are used up and discarded. And in an era where enforced conscription is a way of life, anyone — everyone — will serve the DeepSky Fleet. Many will be assigned to carriers.It is thirty years since the Confederacy instituted its 'strong Fleet policy,' first taxing the far-flung colonies to build the ships, then conscripting their young people to crew them. Decades ago, Earth's military scientists first became aware of a shadowy nemesis, a faceless enemy so powerful, humankind's closest companion in this region of space was obliterated.The same fate awaits Mankind, with only the DeepSky Fleet holding defiance against the dimly perceived foe known simply as the Zunshu. But as the day grows ever-nearer for the DeepSky Fleet to fight this ultimate battle, its infrastructure is rotting at the core.The super-carriers can barely keep pace with the wreckers — mere human foes — and their abused crews have no concept of the mission they were recruited and trained to fight.Into this arena of misery step two unlikely players. Travers and Marin are from worlds so vastly different, they have only their conscripted military service in common — that, and the desire to survive, to see justice done, and to uncover the truths still hidden by Earth's distant government. Travers is still in the service, but his connections to the privateer fleet would be more than enough to execute him. His current assignment is the super-carrier Intrepid, his field of conflict, the Rabelais Drift ... Hellgate.In an age of rampant injustice, often justice must be pursued on a personal level. This mission brings Curtis Marin aboard the carrier as the executor of a sanction purchased by a citizen whose son was murdered by a travesty of justice. Marin has come aboard as an assassin ... if he can stay alive long enough to complete his mission ... and if the carrier herself can survive the corruption of her officer corps, the endless battle with the privateers, and the insuperable forces of nature that churn across the ripped face of the void known as Hellgate.",
  "genres": [
    "Science Fiction",
    "M M Romance",
    "LGBT",
    "Adventure",
    "Gay"
  ],
  "author": "Mel Keegan",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/8069050-the-rabelais-alliance"
}