{
  "title": "The Machiavelli Covenant",
  "description": "In Washington, D.C., Former LAPD rogue detective Nicholas Marten has come out of hiding to hunt down the killers of his childhood sweetheart.  The wife of a controversial United States congressman, she and her husband and son were mysteriously murdered soon after the congressman discovered a massive clandestine bioweapons program.In Europe to meet with distinguished heads of state prior to a crucial NATO summit in Warsaw, US President John Henry Harris may well face the same deadly fate.  A secret cabal within his own administration orders Harris to have the president of France and the chancellor of Germany assassinated. Refusal, he knows, will mean his death.Afraid to trust anyone, even his Secret Service protectors, the President flees for his life. Pursued by the Secret Service, the CIA, and Spanish Intelligence who believe he is the victim of foul play, Harris joins forces with Nicholas Marten and the beautiful but enigmatic French photo-journalist, Demi Picard. Together the three uncover one of the most secretive and brutally powerful groups the world has ever known, a brotherhood of blood that will stop at nothing to realize their own depraved ambitions. The assassination of world leaders, a genocidal attack on a major civilian populace with of weapons of mass destruction -- nothing is beyond them.  The origin of their evil reaches back to the Renaissance when the dying political thinker Niccolo Machiavelli fashioned a sinister addendum to his most infamous work, The Prince. Titled simply The Covenant, it is a terrifying blueprint for the gaining and keeping of true political power. For five hundred years this despotic order of thesupremely rich and powerful has kept Machiavelli's original manuscript hidden away under heavy guard, the document itself worshiped like some divine artifact. Bonded by complicity in ritual murder and dedicated to a singular vision of global domination, over the centuries they have prospered far beyond any dreams of power and avarice. Outmanned, outnumbered, outgunned, three people now stand alone against it: Nicholas Marten, Demi Picard and John Henry Harris, President of the United States.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Suspense",
    "Espionage",
    "Politics"
  ],
  "author": "Allan Folsom",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/80745.The_Machiavelli_Covenant"
}