{
  "title": "Rhinehoth",
  "description": "Rhinehoth - Centuries ago a great castle was built in the mountains of Germany's Black Forest. Its ancient guardians still thrive in its walls forever protecting its dark secrets, holding captive an enemy that threatens their very existence. Foretold is a story of an ancient warrior that is to return to the castle to free the captive Vampire Prince. Simon Roberts was a petty thief who fled England to escape Scotland Yard after a series of unsuccessful jewelry store heists. He was recruited to do a job in Germany where he was to simply drive the get away car while providing a look out. He thought this was going to be an easy job and a way to break into the German crime scene. But things go terribly wrong and he ended up being the only survivor of the botched heist. Simon is quickly sentenced to a prison called Rhinehoth. This is where Germany sent the worst of the worst, surely not a place for a petty thief such as himself. Rhinehoth is a great German castle that was converted in the late 1930's to a Stalag for war criminals of World War II. The converted prison's modern day inhabitants are relentlessly tortured, starved and sleep deprived. This contributes to the prisoners' delusional visions that help hide the truth and keeps Rhinehoth's secrets. Their captors are the army of Werewolves who have survived the centuries off the very flesh and blood of Germany's worst forgotten criminals. Simon, imprisoned becomes plagued with visions from his subconscious ancient past with confusion of his modern day consciousness. He discovers through his visions that he is the ancient warrior, Guthrie who has come to free the Vampire Prince and all the captives while saving the world from a dark plan of biblical proportions that has been orchestrated over the centuries!",
  "genres": [
    "Horror",
    "Paranormal",
    "Fantasy",
    "Vampires"
  ],
  "author": "Brian E. Niskala",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/8071174-rhinehoth"
}