{
  "title": "Julia's Chocolates",
  "description": "\"I left my wedding dress hanging in a tree somewhere in North Dakota. I don't know why that particular tree appealed to me. Perhaps it was because it looked as if it had given up and died years ago and was still standing because it didn't know what else to do...\" In her deliciously funny, heartfelt, and moving debut, Cathy Lamb introduces some of the most wonderfully eccentric women since The Divine Secrets of the Ya-Ya Sisterhood and The Secret Life of Bees, as she explores the many ways we find the road home.  From the moment Julia Bennett leaves her abusive Boston fiancé at the altar and her ugly wedding dress hanging from a tree in North Dakota, she knows she's driving away from the old Julia, but what she's driving toward is as messy and undefined as her own wounded soul. The old Julia dug her way out of a tortured, trailer park childhood with a monster of a mother. The new Julia will be found at her Aunt Lydia's rambling, hundred-year-old farmhouse outside Golden, Oregon.  There, among uppity chickens and toilet bowl planters, Julia is welcomed by an eccentric, warm, and often wise clan of women, including a psychic, a minister's unhappy wife, an abused mother of four, and Aunt Lydia herself--a woman who is as fierce and independent as they come. Meeting once a week for drinks and the baring of souls, it becomes clear that every woman holds secrets that keep her from happiness. But what will it take for them to brave becoming their true selves? For Julia, it's chocolate. All her life, baking has been her therapy and her refuge, a way to heal wounds and make friends. Nobody anywhere makes chocolates as good as Julia's, and now, chocolate just might change her life--and bring her love when she least expects it. But it can't keep her safe. As Julia gradually opens her heart to new life, new friendships, and a new man, the past is catching up to her. And this time, she will not be able to run but will have to face it head on.  Filled with warmth, love, and truth, Julia's Chocolates is an unforgettable novel of hope and healing that explores the hurts we keep deep in our hearts, the love that liberates us, the courage that defines us, and the chocolate that just might take us there.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Book Club",
    "Contemporary",
    "Food",
    "Adult"
  ],
  "author": "Cathy  Lamb",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/807108.Julia_s_Chocolates"
}