{
  "title": "Making the Cut: The 30-Day Diet and Fitness Plan for the Strongest, Sexiest You",
  "description": "Are you in good shape but struggling with those last ten to twenty pounds that stand between looking perfectly okay and looking knock-their-eyes-out great? Do you have an event on the calendar where you’d love to make jaws drop? Or do you just want to see for yourself what it would be like to have the best body you’ve ever had in your life? Then you need this book.Making the Cut is a unique, intense thirty-day program from TV’s toughest fitness guru, Jillian Michaels. It has one to maximize your diet and fitness potential so you’ll get dramatic results at an accelerated pace. The program trains you in three essential ways—mentally, nutritionally, and physically. Making the Cut enables you identify your unique body type and metabolic makeup (are you a fast, slow, or balanced oxidizer?) and customize a diet plan that is perfect for you learn mental techniques that greatly enhance your self-confidence and sharpen your focus on success develop your strength, flexibility, coordination, and endurance to levels that exceed anything you ever previously attained—or would have thought possibleMaking the Cut takes you further faster than any other fitness program. Ever wonder what secret techniques models and celebrities learn from their high-priced personal trainers when they need to look their absolute best for a shoot or a scene? Jillian shares invaluable info about “peaking”—temporary short cuts you can employ when you have just a few days to get ready for your close-up. And she gets you hip to safe but effective supplements (break out the white willow bark and green tea extract) and tells you how to shed the last drops of excess water weight to put the ultimate finishing touch on the new you.Other plans get you in shape; this one delivers ripped-up perfection. You supply the commitment and determination . . . Jillian Michaels supplies the astonishing results. Visit www.JillianMichaels.com for more.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Fitness",
    "Health",
    "Self Help",
    "Cookbooks",
    "Nutrition",
    "Cooking"
  ],
  "author": "Jillian Michaels",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/8072716-making-the-cut"
}