{
  "title": "Twists of Fate",
  "description": "Witch of Air and Fire: [Menage Amour: Erotic Fantasy Menage a Trois Romance, M/M/F] The Fates have a way of playing silly games with Immortals. Cian is the Chosen, the only being capable of initiating the unfolding of the events foretold in the Prophecy. However, he must claim a female mate first. After waiting centuries for his partner to be born, she would have to be his equal, as powerful as he, physically capable of handling the daemon possessing him, capable of freeing him from the immortal Droughan. However, the Fates gave him Candace, a young, inexperienced witch who looks more like an ethereal fairy than the first-level witch entrusted with an ancient power. She is a virgin, and Cian and his best friend Regan have to initiate her through the Trinity Ceremony. Will the two alpha males be able to share Candace, thereby sexually enhancing her to make her physically capable of handling the daemon that possesses Cian? ** The Lion, The Leopard, and the Wolf: [Menage Amour: Erotic Paranormal Menage a Trois Romance, M/M/F, Shape-Shifters] Mackenzie's menage fantasy comes to life when she's snowbound with Fantasy Lodge partners, Aaron and Trent. One golden, one surly, the alpha males vie for her attention. For Mac, the strange sensations, the sexual need, and the awkwardness all make sense when she discovers she's a shape-shifter. Aaron and Trent supported each other through their first metamorphosis, and agree to guide Mac safely through hers. But when they turn, Were males don't share. Mac must choose between them, or they'll fight to the death. Accepting Mac is meant for both of them, they have one other option. Aaron can submit sexually to Trent, become his submissive. Mac can help them through the sexual boundaries, but what will it do to the men's friendship? Or their menage relationship? ** A Siren Erotic Romance",
  "genres": [],
  "author": "Eliza March",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/8071317-twists-of-fate"
}