{
  "title": "On an Odd Note",
  "description": "The discovery of piles of bones seeming to belong to a previously unknown species of monster will help to unfold a macabre and grisly tale. – A lady is found dead in her bed, the apparent victim of a murder the coroner proves could not possibly have occurred. – A merman found by fishermen off the coast of Brighton in 1745 will reveal the truth behind one of the most terrible events of the 20th century. – A desperate man makes an ill-advised bargain with a man in black – An extraordinarily horrible dummy exercises a frightful control over his terrified ventriloquist – A condemned murderer lives again through the eyes of an innocent child . . . These are the plots of just a few of the brilliant tales you will find in this volume as you enter the bizarre world of master storyteller Gerald Kersh. With a focus on Kersh's science fiction, fantasy, and horror stories, On an Odd Note (1958) contains thirteen of his best. This first-ever reprint features a new introduction by Nick Mamatas. Contains the following Seed of Destruction, Frozen Beauty, Reflections in a Tablespoon, The Crewel Needle, The Sympathetic Souse, The Queen of Pig Island, Prophet Without Honor, The Beggars’ Stone, The Extraordinarily Horrible Dummy, The Brighton Monster, Fantasy of a Hunted Man, The Gentleman All in Black, and The Eye.CONTEMPORARY REVIEWS“Gerald Kersh had a wild imagination matched by a vivid, near-hallucinatory style. Many of his concepts are so original that they blur the distinction between fantasy, science fiction, mystery, and horror, but the cumulative impact of his short stories is horrific in the extreme.” – Penguin Encyclopedia of Horror and the Supernatural“Kersh tells a story, as such, rather better than anybody else.” – Pamela Hansford Johnson, Daily Telegraph",
  "genres": [
    "Short Stories",
    "Horror",
    "Science Fiction",
    "Fantasy"
  ],
  "author": "Gerald Kersh",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/8077363-on-an-odd-note"
}