{
  "title": "Mimesis: The Representation of Reality in Western Literature",
  "description": "A half-century after its translation into English, Erich Auerbach's \"Mimesis\" still stands as a monumental achievement in literary criticism. A brilliant display of erudition, wit, and wisdom, his exploration of how great European writers from Homer to Virginia Woolf depicted reality has taught generations how to read Western literature. This new expanded edition includes a substantial essay in introduction by Edward Said as well as an essay, never before translated into English, in which Auerbach responds to his critics.A German Jew, Auerbach was forced out of his professorship at the University of Marburg in 1935. He left for Turkey, where he taught at the state university in Istanbul. There he wrote \"Mimesis,\" publishing it in German after the end of the war. Displaced as he was, Auerbach produced a work of great erudition that contains no footnotes, basing his arguments instead on searching, illuminating readings of key passages from his primary texts. His aim was to show how from antiquity to the twentieth century literature progressed toward ever more naturalistic and democratic forms of representation. This essentially optimistic view of European history now appears as a defensive--and impassioned--response to the inhumanity he saw in the Third Reich. Ranging over works in Greek, Latin, Spanish, French, Italian, German, and English, Auerbach used his remarkable skills in philology and comparative literature to refute any narrow form of nationalism or chauvinism, in his own day and ours. For many readers, both inside and outside the academy, \"Mimesis\" is among the finest works of literary criticism ever written.",
  "genres": [
    "Literary Criticism",
    "Nonfiction",
    "Philosophy",
    "Criticism",
    "Literature",
    "History",
    "Theory"
  ],
  "author": "Erich Auerbach",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/80795.Mimesis"
}