{
  "title": "Tip It!: The World According to Maggie",
  "description": "Dear Readers,There are at least five good reasons to Tip It! right now.1. My daughter Kathy put out her memoir last year, which was real nice except for the controversial parts. And it got to be a #1 New York Times bestseller. Congratulations, Kathleen! But now it's my turn. I've written my own book. I have things to say, too, without having to be all controversial like you were. Tip it!2. People recognize me on the street a lot now and come over, nicely, and say \"Maggie, you remind me of my own mother.\" And they say \"Maggie, I love your show\"--referring to Kathy My Life on the D-List as my show. Sometimes I correct them, I say, \"Oh, it's not my show.\" But sometimes . . . I don't correct them. It's kind of fun being a star, isn't it Tip it!3. If you want to know a few things about my daughter Kathleen that only a mother could know (How the heck did she get this way? Did she always swear so much, for Chrissake?), you have come to the right book. Tip it!4. You know how a box of wine is never empty just because the spigot seems to have run dry (There's always a little more if you just tip it!) This book is like that. There's so much in it--never-before-published Griffin family photos!, a love story (me and my dear departed husband Johnny), a whole guide to good living (including how to survive on what's in your purse), and a lot of funny business in this book from Kathleen (she made comments in this book; readers, I was not able to stop her!). So take this book and Tip It!5. And be sure to get the last drop out of living. Isn't it nice that \"Tip It\" acts as a toast I'm 90 years old, and I think \"Tip It!\" even works pretty well as a motto for living to the fullest. So, Tip It! today.Yours,Maggie GriffinA funny thing happened on the way to Kathy Griffin's sky-rocketing stardom. The more she told stories about her mother, Maggie, in her stand-up act and on her Emmy-winning television show, Kathy My Life on the D-List , the more popular her mother became. (At the mere mention of Maggie, a stadium full of fans will cheer, \"Tip It! Tip It!\")Shocked by Kathy, exasperated by Kathy, grudgingly amused by Kathy, and at the end of the day, always a loving mother to Kathy, Maggie Griffin has become the darling Gracie to Kathy's George Burns, the wry Cher to Kathy's Sonny Bono, the spry, sweet Roadrunner to Kathy's Wile E. Coyote.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Memoir",
    "Autobiography",
    "Comedy",
    "Biography",
    "Womens"
  ],
  "author": "Maggie Griffin",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/8081435-tip-it"
}