{
  "title": "All New Letters from a Nut: Includes Lunatic Email Exchanges",
  "description": "** NOTE - THE KINDLE VERSION HAS BEEN FIXED.  THIS BOOK IS EASILY READABLE NOW ON KINDLE.  TRY A FREE SAMPLE ON YOUR MOBILE DEVICE.  SEE ABOVE. **He's the curse of customer service departments everywhere--Ted L. Nancy, letter writer extraordinaire whose imbecilic queries have a way of eliciting equally idiotic answers from some of the world's biggest companies and dignitaries. From the bestselling author of Letters from a Nut comes the latest collection of seemingly serious but crazed correspondence. All New Letters from a Nut includes more than 200 letters, from bizarre to outright loony requests and compliments written by Mr. Nancy to Icelandic malls, German theme parks, shoe museums, foreign presidents, commode companies, waffle cone businesses, and the Hotel Del Fino in Greece along with their equally sincere but hilarious responses. With his previous books, Ted L. Nancy distinguished himself as America's favorite postal humorist. This latest compilation highlights his comic status through letters to an upscale Amsterdam hotel requesting a room for his 300 hamsters and him to put on his play HAMSTERDAM; to Vons Supermarkets complaining that their Diet Black Cherry soda is sending him paranormal messages; to Armour Meats seeking a 59-foot piece of bologna and a note to the City of Glendale, California, asking for help in starting his new comedy club, THE JOKESTRAP; and many more.... Throughout Ted L. Nancy demonstrates his genius for convincing people his absurd queries are dead serious, demonstrated by the responses he receives.All New Letters From a Nut is unabashedly silly, unapologetically sophomoric, and 100% funny.   With a Foreword by Jerry Seinfeld.Ted L. Nancy's  Letters from a Nut  series of books   have more than 1 million copies in print.  They are sold all over the world and have been printed in Japanese and Portuguese.",
  "genres": [
    "Humor",
    "Nonfiction"
  ],
  "author": "Ted L. Nancy",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/8078315-all-new-letters-from-a-nut"
}