{
  "title": "Spring Essence: The Poetry of Hô Xuân Huong",
  "description": "Hồ Xuân Hương — whose name translates as \"Spring Essence\" — is one of the most important and popular poets in Vietnam. A concubine, she became renowned for her poetic skills, writing subtly risqué poems which used double entendre and sexual innuendo as a vehicle for social, religious, and political commentary.\"The Unwed Mother\"Because I was too easy, this happened.Can you guess the hollow in my heart?Fate did not push out a budeven though the willow grew.He will carry this a hundred yearsbut I must bear the burden now.Never mind the gossip of the world.Don’t have it, yet have it! So simple.The publication of Spring Essence is a major historical and cultural event. It features a \"tri-graphic\" presentation of English translations alongside both the modern Vietnamese alphabet and the nearly extinct calligraphic Nôm writing system, the hand-drawn calligraphy in which Hồ Xuân Hương originally wrote her poems. It represents the first time that this calligraphy—the carrier of Vietnamese culture for over a thousand years—will be printed using moveable type. From the technology demonstrated in this book scholars worldwide can begin to recover an important part of Vietnam’s literary history. Meanwhile, readers of all interests will be fascinated by the poetry of Ho Xuan Huong, and the scholarship of John Balaban.The translator, John Balaban, was twice a National Book Award finalist for his own poetry and is one of the preeminent American authorities on Vietnamese literature. During the war Balaban served as a conscientious objector, working to bring war-injured children better medical care. He later returned to Vietnam to record folk poetry. Like Alan Lomax’s pioneering work in American music, Balaban was to first to record Vietnam’s oral tradition. This important work led him to the poetry of Hồ Xuân Hương.Ngo Than Nhan, a computational linguist from NYU’s Courant Institute of Mathematics, has digitized the ancient Nôm calligraphy.",
  "genres": [
    "Poetry",
    "Classics",
    "Asian Literature",
    "19th Century",
    "Asia",
    "Fiction",
    "Literature"
  ],
  "author": "Hồ Xuân Hương",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/807765.Spring_Essence"
}