{
  "title": "Rush Limbaugh: An Army of One",
  "description": "Do you remember your first time?People tend to remember the moment they first heard The Rush Limbaugh Show on the radio. For Zev Chafets, it was in a car in Detroit, driving down Woodward Avenue. Limbaugh's braggadocio, the outrageous satire, the slaughtering of liberal sacred cows performed with the verve of a rock-n-roll DJ-it seemed fresh, funny and completely subversive. \"They're never going to let this guy stay on the air,\" he thought.Almost two decades later Chafets met Rush for the first time, at Limbaugh's rarely visited \"Southern Command.\" They spent hours together talking on the record about politics, sports, music, show business, religion and modern American history. Rush opened his home and his world, introducing Chafets to his family, closest friends, even his psychologist. The result was an acclaimed cover-story profile of Limbaugh in The New York Times Magazine .But there was much more to say, especially after Limbaugh became Public Enemy Number One of the Obama Administration. At first Limbaugh resisted the idea of a full-length portrait, but he eventually invited Chafets back to Florida and exchanged more than a hundred emails full of his personal history, thoughts, fears and ambitions. What has emerged is an uniquely personal look at the man who is not only the most popular voice on the radio, but the leader of the conservative movement and one of the most influential figures in the Republican Party.While Limbaugh's public persona is instantly recognizable, his background and private life are often misunderstood. Even devoted Dittoheads will find there's a lot they don't know about the self-described \"harmless little fuzzball\" who has, over the years, taken on the giants of the mainstream media and the Democratic Party-from Bill and Hillary Clinton to Barack Obama-with \"half his brain tied behind his back, just to make it fair.\" Chafets paints a compelling portrait of Limbaugh as a master entertainer, a public intellectual, a political force, and a fascinating man.",
  "genres": [
    "Biography",
    "Politics",
    "Nonfiction",
    "Biography Memoir",
    "History"
  ],
  "author": "Ze'ev Chafets",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/8081476-rush-limbaugh"
}