{
  "title": "Animal",
  "description": "Animal is a new expanded edition of DK's best-selling encyclopedia, published 10 years ago. It brings together the expertise of natural history specialists and outstanding wildlife photographers to illustrate, describe, and explain the incredible range of creatures in the animal kingdom.The natural world is a dynamic place and our understanding of it is forever growing and changing. Since Animal was first published in 2001, the African elephant has been reclassified into two species, a cat-sized rat has been discovered in Papua New Guinea, the only plant-eating spider has been found in Central America, a bird-eating fanged frog has been located in Vietnam, and more than 1,250 new species of amphibians have been identified. The distribution and conservation status of many animals has changed and scientists have developed new ways to classify animal groups. The study of genes has revealed new species. For example, the Bornean clouded leopard, thought to be a subspecies of a leopard found throughout SE Asia, is quite distinct, and a species in its own right-the first new carnivore to be discovered in the 21st century (so far). This new edition of Animal also takes advantage of the major technical advances in natural history photography with the addition of some truly stunning new images.There is a general introduction to the animal kingdom and its evolution, then each of the world's habitats is examined in detail. The largest part of the book looks at the animals: the five vertebrate groups are reviewed, followed by the major invertebrate divisions. A comprehensive glossary and index conclude the book.Table of ContentsPRELIMS (11PP)INTRODUCTION (24PP)What are animals? Evolution Classification and animal groups Gene-related research Anatomy Behavior Life cyclesAnimals in danger ConservationHABITATS (52PP)World habitats Grasslands Deserts Tropical forests Temperate forests Coniferous forests MountainsPolar regions Freshwater Oceans Coasts and coral reefs Urban areasTHE ANIMAL KINGDOM (2PP)Detailed and comprehensive coverage of mammals, birds, reptiles, amphibians, fish and invertebrates, presented in taxonomic order:MAMMALS (186PP)Egg-laying mammals Marsupials Insectivores BatsFlying lemurs Elephant-shrews Tree shrews Primates (prosimians, monkeys, and apes) Anteaters and relativesPangolins Rabbits, hares, and pikas Rodents (squirrel-like rodents, mouselike rodents, and cavylike rodents) Cetaceans (baleen whales, toothed whales)Carnivores (dogs and relatives, bears, raccoons and relatives, mustelids, civets and relatives, hyenas and aardwolf, cats) CarnivoresSeals and sealions Elephants Aardvark HyraxesDugong and manatees Hoofed animals: (horses and relatives, rhinoceroses, tapirs, pigs, hippopotamuses, camels and relatives, deer, giraffe and okapi, cattle and relatives) Mammals in dangerBIRDS (112PP)OstrichesRheas Cassowaries and emus Kiwis Tinamous Penguins Loons Grebes Albatrosses and petrels Pelicans and relatives Herons and relatives Flamingos Waterfowl Birds of prey Game birds Cranes and relatives Waders, gulls, and auks PigeonsSandgrouse Parrots Cuckoos and turacos Owls Nightjars and frogmouths Hummingbirds and swifts Mousebirds Trogons Kingfishers and relatives Woodpeckers and toucans Passerines Birds in dangerREPTILES (72PP)Tortoises and turtles Tuataras Snakes (boas, pythons, and relatives, colubrids, elapids, vipers, blind and thread snakes) Lizards (iguanas and relatives, geckos and snake- lizards, skinks and relatives, and anguimorph lizards) Amphisbaenians Crocodiles and alligators Reptiles in dangerAMPHIBIANS (32PP )Newts and salamanders Caecilians Frogs and toads Amphibians in dangerFISH (68PP)Jawless fish Cartilaginous fish (sharks, skates, and rays) Bony fish (fleshy-finned fish, primitive ray-finned fish, bony-tongued fish, tarpons and eels, herrings and relatives, catfish and relatives, salmon and relatives, dragonfish and relatives, lanternfish and relatives, cod and anglerfish, and spiny-rayed fish) Fish in dangerINVERTEBRATES (82PP)Sponges Cnidarians Flatworms Segmented worms Round worms Minor phyla Molluscs Arthropods (insects, centipedes and millipedes, crustaceans, sea-spiders, horseshoe crabs, arachnids)Echinoderms Invertebrate chordates Invertebrates in dangerGLOSSARY (4PP) INDEX (22PP) ACKNOWLEDGMENTS (1P)TOTAL EXTENT: 632PP",
  "genres": [
    "Nonfiction",
    "Science",
    "Reference",
    "Animals",
    "Nature",
    "Biology",
    "Photography"
  ],
  "author": "David Burnie",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/8091982-animal"
}