{
  "title": "Scars",
  "description": "Revelation comes to life in this adrenaline-fueled Christian thriller weaved with End Times prophecy. A heart-wrenching story of a young girl set during the Tribulation, SCARS chronicles the beginning of the End of the World, as earth-shattering events lead up to the Apocalypse as foretold in the Bible. SCARS reveals many possible answers to questions such as, \"Who is the Antichrist? The False Prophet? The name that equates to 666 in both Greek and Hebrew?\" and \"What are the Mark of the Beast and the image of the beast?\" Other prophecies include how the antichrist will be revealed, the Lie, who will be deceived by the antichrist, the ten-horned kingdoms of the beast, the 144,000, the Two Witnesses, and the Peace Treaty. SCARS is shocking and eye-opening but essential reading in a world of confusing theories. There is no other end-times fiction book like this. What the Reviewers are saying, \"Scars will challenge your own faith and cause you to think,\" LaTawnia Kintz, \"Wow. Incredible, potentially life changing,\" bluebird, \"The best end-times book I have ever read, it is very plausible,\" ericathy222, \"Powerful,\" SRMeyers, \"Spiritually enhancing,\" Dennis, \"Better then the Left Behind Series,\" The Novelist, \"Over-the edge-writing, \" Tammy's Book Parlor, \"Thought provoking, a must read for every Christian,\" 1 Prince 3 Princesses. Check out the book trailer in author's profile! AVAILABLE in both Kindle and paperback!Coming soon in AUDIOBOOK! Christian Fiction, best seller, best sellers, Kindle book, kindle books, Kindle store, kindle ebooks, Christian fiction best sellers, Christian fiction books, religious fiction, Christian books, Christian book, Christian fiction best sellers 2011 Christian, mystery and thrillers, thriller, Amazon.com, end times, end times in Kindle store, end times bible prophecy, end times fiction, end times prophecy, end times survival, end time prophecy, end times books, end time, end of the world, end of days, prophecy books, apocalypse, apocalypse in kindle store, apocalypse books, apocalyptic fiction, apocalypse fiction, tribulation, end of the world, eschatology, Compare to Left Behind by Tim LaHaye and Jerry Jenkins, Revelation, Petrus Romanus, antichrist, false prophet, Patience Prence, SCARS, Christian novel, Christian suspense, top rated, five stars, Jesus,",
  "genres": [
    "Christian Fiction",
    "Thriller",
    "Teen",
    "Christian"
  ],
  "author": "Patience Prence",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/8088179-scars"
}