{
  "title": "The Selected Stories of Patricia Highsmith",
  "description": "Best known for her novels (The Talented Mr. Ripley, Strangers on a Train, A Suspension of Mercy, and others) Highsmith is an all-too-frequently forgotten master of the short story. These stories in this volume examine the dark soul of humanity in a deceptively simple voice that draws you in and won't let go. The sheer beauty of the streamlined prose disguises a complexity of character and situation that is the mark of a true master.Highsmith's ability to create believable characters with very little exposition, but rather through their behavior and dialog, is incredible. None of the stories in this volume is particularly long, but you're drawn in and seduced by the power of the prose. Whether it's a cat driven to commit murder to protect his mistress (\"Ming's Biggest Prey\"), a rat exacting a horrible revenge on a family that maimed him (\"The Bravest Rat in Venice\"), or a house party interrupted by something grisly (\"Something the Cat Dragged In\"), these stories are impossible to put down.A great example of Highsmith's artistry is \"Mermaids on the Golf Course,\" about a presidential adviser who took an assassin's bullet to protect the president. This seemingly heroic man is slowly exposed throughout the story as something completely different, mainly through his dialogue and the reactions of his family to him. Highsmith deftly exposes the many layers in his character, shows that the surface we see often disguises the truth below, and asks the question, \"How well do we know anyone?\"Likewise, \"The Female Novelist\" is so consumed with herself and her craft that she destroys herself. \"The Hand\" is a chilling twist on the age-old custom of asking for someone's hand in marriage. Highsmith's stories linger on after they are read, and show that for true horror, you don't need the supernatural; you merely need to write about people.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Mystery",
    "Crime",
    "Mystery Thriller",
    "Suspense",
    "Thriller"
  ],
  "author": "Patricia Highsmith",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/80886.The_Selected_Stories_of_Patricia_Highsmith"
}