{
  "title": "Unhinged: The Trouble with Psychiatry—A Doctor's Revelations About a Profession in Crisis",
  "description": "IN THIS STIRRING AND BEAUTIFULLY WRITTEN WAKE-UP CALL, psychiatrist Daniel Carlat exposes deeply disturbing problems plaguing his profession, revealing the ways it has abandoned its essential to understand the mind, so that psychiatrists can heal mental illness and not just treat symptoms. As he did in his hard-hitting and widely read New York Times Magazine article \"Dr. Drug Rep,\" and as he continues to do in his popular watchdog newsletter, The Carlat Psychiatry Report , he writes with bracing honesty about how psychiatry has so largely forsaken the practice of talk therapy for the seductive—and more lucrative—practice of simply prescribing drugs, with a host of deeply troubling consequences. Psychiatrists have settled for treating symptoms rather than causes, embracing the apparent medical rigor of DSM diagnoses and prescription in place of learning the more challenging craft of therapeutic counseling, gaining only limited understanding of their patients’ lives. Talk therapy takes time, whereas the fifteen-minute \"med check\" allows for more patients and more insurance company reimbursement. Yet DSM diagnoses, he shows, are premised on a good deal less science than we would think. Writing from an insider’s perspective, with refreshing forthrightness about his own daily struggles as a practitioner, Dr. Carlat shares a wealth of stories from his own practice and those of others that demonstrate the glaring shortcomings of the standard fifteen-minute patient visit. He also reveals the dangers of rampant diagnoses of bipolar disorder, ADHD, and other \"popular\" psychiatric disorders, and exposes the risks of the cocktails of medications so many patients are put on. Especially disturbing are the terrible consequences of overprescription of drugs to children of ever younger ages. Taking us on a tour of the world of pharmaceutical marketing, he also reveals the inner workings of collusion between psychiatrists and drug companies. Concluding with a road map for exactly how the profession should be reformed, Unhinged is vital reading for all those in treatment or considering it, as well as a stirring call to action for the large community of psychiatrists themselves. As physicians and drug companies continue to work together in disquieting and harmful ways, and as diagnoses—and misdiagnoses—of mental disorders skyrocket, it’s essential that Dr. Carlat’s bold call for reform is heeded.",
  "genres": [
    "Psychology",
    "Psychiatry",
    "Nonfiction",
    "Mental Health",
    "Medicine",
    "Science",
    "Health"
  ],
  "author": "Daniel J. Carlat",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/8090685-unhinged"
}