{
  "title": "Grant Wood: A Life",
  "description": "He claimed to be “the plainest kind of fellow you can find. There isn’t a single thing I’ve done, or experienced,” said Grant Wood, “that’s been even the least bit exciting.”Wood was one of America’s most famous regionalist painters; to love his work was the equivalent of loving America itself. In his time, he was an “almost mythical figure,” recognized most supremely for his hard-boiled farm scene, American Gothic , a painting that has come to reflect the essence of America’s traditional values—a simple, decent, homespun tribute to our lost agrarian age.In this major new biography of America’s most acclaimed, and misunderstood, regionalist painter, Grant Wood is revealed to have been anything but plain, or simple . . .R. Tripp Evans reveals the true complexity of the man and the image Wood so carefully constructed of himself. Grant Wood called himself a farmer-painter but farming held little interest for him. He appeared to be a self-taught painter with his scenes of farmlands, farm workers, and folklore but he was classically trained, a sophisticated artist who had studied the Old Masters and Flemish art as well as impressionism. He lived a bohemian life and painted in Paris and Munich in the 1920s, fleeing what H. L. Mencken referred to as “the booboisie” of small-town America.We see Wood as an artist haunted and inspired by the images of childhood; by the complex relationship with his father (stern, pious, the “manliest of men”); with his sister and his beloved mother (Wood shared his studio and sleeping quarters with his mother until her death at seventy-seven; he was forty-four).We see Wood’s homosexuality and how his studied masculinity was a ruse that shaped his work.Here is Wood’s life and work explored more deeply and insightfully than ever before. Drawing on letters, the artist’s unfinished autobiography, his sister’s writings, and many never-before-seen documents, Evans’s book is a dimensional portrait of a deeply complicated artist who became a “National Symbol.” It is as well a portrait of the American art scene at a time when America’s Calvinistic spirit and provincialism saw Europe as decadent and artists were divided between red-blooded patriotic men and “hothouse aesthetes.”Thomas Hart Benton said of Grant “When this new America looks back for landmarks to help gauge its forward footsteps, it will find a monument standing up in the midst of the wreckage . . . This monument will be made out of Grant Wood’s works.”",
  "genres": [
    "Biography",
    "Art",
    "Nonfiction",
    "Art History",
    "History",
    "American History",
    "Biography Memoir"
  ],
  "author": "R. Tripp Evans",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/8087261-grant-wood"
}