{
  "title": "Murder in the Boughs",
  "description": "Five Stars: \"A wonderful blend of urban fantasy, humour, action, mystery, and heart.\" -Goodreads ReviewFour Stars: \"Written in the best tradition of the old detective novels, with lots of magic thrown in. If you like both detective and fantasy stories, you will enjoy this.\" -Goodreads ReviewFour Stars: \"Mr Sedgwick weaves a great noir fairy tale, in a perfect balance between Philip Marlow and The Brothers Grimm.\" -Amazon ReviewDetective noir fiction and Grimm's Fairy Tales collide in the \"Hank Mossberg, Private Ogre\" detective series. The series takes place in the gritty streets of San Francisco and in the undercity, the massive underground cavern where thousands of fae creatures secretly make their homes. Here, nymphs walk darkened streets, imps are slave traders, and gnomes are elite hackers.In “Murder in the Boughs,” Hank Mossberg is a hard-boiled San Francisco detective who must race against time to rescue a kidnapped girl, expose a ring of \"pixie dust\" dealers, and find the killer of a high-elven San Francisco kingpin. Hank is also the last living ogre in the world.Hank's troubles begin when he stumbles onto a briefcase full of the illicit drug known as pixie dust. He finally has the evidence he needs to bring down the notorious Kaisers, an elven crime family, but then the gang's leader is murdered and the pixie dust disappears. Hank is hot on the trail of the killer when he gets an urgent call from a desperate woman whose daughter has been abducted… only the kidnapper is no ordinary criminal, and even Hank's unique skills might not be enough to bring the girl home. Hank juggles both cases while navigating the complexities of fae-world politics and real life relationships, none of which ever seem to come easy.",
  "genres": [
    "Mystery",
    "Fantasy",
    "Urban Fantasy",
    "Mystery Thriller",
    "Paranormal",
    "Noir"
  ],
  "author": "Jamie Sedgwick",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/13100243-murder-in-the-boughs"
}