{
  "title": "Gluten-Free Girl: How I Found the Food That Loves Me Back & How You Can Too",
  "description": "\"A delightful memoir of learning to eat superbly while remaining gluten free.\"  — Newsweek  magazine \"Give yourself a treat!  Gluten-Free Girl  offers delectable tips on dining and living with zest–gluten-free. This is a story for anyone who is interested in changing his or her life from the inside out!\"  —Alice Bast, executive director National Foundation for Celiac Awareness \"Shauna's food, the ignition of healthy with delicious, explodes with flavor—proof positive that people who choose to eat gluten-free can do it with passion, perfection, and power.\"  —John La Puma, MD,  New York Times  bestselling co-author of  The RealAge Diet  and  Cooking the RealAge Way \"A breakthrough first book by a gifted writer not at all what I expected from a story about living with celiac disease. Foodies everywhere will love this book. Celiacs will make it their bible.\"  —Linda Carucci, author of  Cooking School Secrets for Real World Cooks  and IACP Cooking Teacher of the Year, 2002 An entire generation was raised to believe that cooking meant opening a box, ripping off the plastic wrap, adding water, or popping it in the microwave.  Gluten-Free Girl , with its gluten-free healthful approach, seeks to bring a love of eating back to our diets. Living gluten-free means having to give up traditional bread, beer, pasta, as well as the foods where gluten likes to hide—such as store-bought ice cream, chocolate bars, even nuts that might have been dusted with flour. However,  Gluten-Free Girl  shows readers how to say yes to the foods they  can  eat. Written by award-winning blogger Shauna James, who became interested in food once she was diagnosed with celiac disease and went gluten-free,  Gluten-Free Girl  is filled with funny accounts of the author’s own life including wholesome, delicious recipes, this book will guide readers to the simple pleasures of real, healthful food. Includes dozens of recipes like salmon with blackberry sauce, sorghum bread, and lemon olive oil cookies as well as resources for those living gluten-free.",
  "genres": [
    "Nonfiction",
    "Food",
    "Health",
    "Cookbooks",
    "Memoir",
    "Cooking",
    "Biography"
  ],
  "author": "Shauna James Ahern",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/808654.Gluten_Free_Girl"
}