{
  "title": "BBQ Makes Everything Better",
  "description": "Since cavemen discovered that fire makes good food great, grilling has been one of the most popular methods of cooking. From slow-cooked, aromatic meats to charred, juicy burgers and tender vegetables, everything tastes better hot off the grill. And it's not just gourmet chefs who can create scrumptious meals out of the perfect marriage of meat and fire; home cooks everywhere have enjoyed the simple pleasures of outdoor cooking for decades. Aaron Chronister and Jason Day are two such home cooks whose mastery of the grill has catapulted them from their backyards to international fame. Originally just two guys who loved to barbecue, Aaron and Jason founded Burnt Finger BBQ--a competitive barbecue team that has garnered regional and national acclaim since its founding in 2008. But it was with the invention of the 'Bacon Explosion' that one of Aaron and Jason's culinary creations became a household name. A bacon-stuffed, bacon wrapped smoked Italian sausage, the Bacon Explosion became an internet sensation just months after Aaron and Jason launched their website, BBQAddicts.com. It instantly attracted attention from Fox News, Jay Leno and Good Morning America (just to name a few), and the New York Times article about the Bacon Explosion was the second most emailed story for the entirety of 2009. Aaron and Jason now have a cult following, but their skills at the grill are not limited to bacon alone. In BBQ MAKES EVERYTHING BETTER, Aaron and Jason round out their repertoire, presenting mouth-watering, easy-to-follow barbecue recipes for any occasion. Including a thorough discussion of equipment, methods and techniques for cooking well beyond the \"Holy Trinity of BBQ\" (ribs, pork and brisket), BBQ MAKES EVERYTHING BETTER shows that you can also make a perfect meal out of the \"Ugly Stepchild of Barbecue\"--chicken. Light-hearted in tone and full of easy-to-follow instructions, BBQ MAKES EVERYHING BETTER is the complete barbecue cookbook. Find recipes and tips -Burgers, Bacon, Fatties -Party food and tailgates -Barbecue and booze -International barbecue -Leftovers and lighter fare -Desserts",
  "genres": [
    "Cookbooks"
  ],
  "author": "Jason Day",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/8096495-bbq-makes-everything-better"
}