{
  "title": "So Wild the Heart",
  "description": "Thomas Adam, junior Fellow of St. Columb’s College at Oxford University, is one of countless English travellers crossing the channel to explore the reopened Continent after the Napoleonic wars.   With Boney imprisoned, there is no time like the present to experience French wine and the Italian countryside — at least, for anyone other than Adam, whose motives are severely academic…  Bound for Italy on the strictest academic pursuit, he has no intention of partaking in the glories of the countries he moves through, much less become involved in any way with the people he encounters.  Indeed, anything not directly related to completing his translation of the obscure late poet Antonian, Adam views as entirely irrelevant.  Romance, certainly, is entirely excluded.  Life, however, has a much different summer in store for Adam than the one he has planned.  Once settled in the beautiful lakeside town of Lucero, a location he hopes houses the mysterious Isola d’Amore referred to in Antonian’s works, Adam discovers any number of temptations.  His encounters with ‘enlightened’ American women and a foolish prophet of Reason seem always to draw him away from his work…but unbeknownst to Adam, the answers he seeks are right under his nose the whole summer.  Yet by the end of the Long Vacation, it is not his translation that occupies his thoughts, but rather problems of love.  Problems for which all his classical scholarship has not prepared him…  So Wild the Heart is an engaging literary tale that gets to the heart of human emotion.   Praise for Geoffrey Trease  “Geoffrey Trease has certainly got the knack. He can write for young people, in this case mainly for teenagers, without being obvious. The excitement is there where fact permits. So is the lucidity, with events all round the world fitting smoothly into their proper place and time” - The Daily Telegraph   “I found it a fascinating book. I wish that all history books were so inviting and intelligent.” - Naomi Lewes, BBC   “History at its most agreeable and readable.” - Time and Tide   Geoffrey Trease(1909-1998) was the author of more than one hundred books, including children’s books. He revolutionised children’s literature and was one of the first authors to deliberately appeal to both boys and girls through strong leading characters of both genders. In 1966 Trease won the New York Herald Tribune Book Award for This is Your Century.Geoffrey Trease was educated at Oxford University and travelled widely in Europe and beyond. He lived in Herefordshire on the slopes of the Malvern Hills.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Geoffrey Trease",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/8098171-so-wild-the-heart"
}