{
  "title": "Sugar Busters! Cut Sugar to Trim Fat",
  "description": "When SUGAR BUSTERS! hit the shelves almost five years ago, it quickly became a diet and lifestyle phenomenon, soaring to the number one spot on the New York Times bestseller list and embraced by millions of people across the country. Those satisfied individuals on the SUGAR BUSTERS! plan discovered that by simply choosing the correct carbohydrates and lowering their sugar intake, they could shed the pounds they failed to lose with other diets. Now the weight-loss program that swept the nation has been completely revised and updated–incorporating all the newest nutritional findings, health statistics, and scientific studies, including the latest on glycemic levels. Based on sound dietary principles, SUGAR BUSTERS! remains a highly effective program that shows you how to reduce the sugar in your life (without feeling deprived) through easy-to-follow recipes and meal plans. In this new edition, you will discover• A discussion on prevention, still the best medicine• Amazing testimonials from men and women who are still losing weight and feeling fit the SUGAR BUSTERS! way• Frequently asked questions–direct from the SUGAR BUSTERS! Web site– along with helpful answers• A special section on childhood obesity–how to measure it and what to do about it• Hard facts on soft drinks• The latest on diabetes–and how SUGAR BUSTERS! can help prevent it• A Body Mass Index (BMI) chart and Calculation Formula to determine if you are obese or merely overweight• An expanded discussion of our ancestor’s diet, which was whole-grain, high-fiber, and low-glycemic–just like SUGAR BUSTERS!• Essential facts on women, weight loss, and nutrition• New tips, updated charts, new recipes, and practical exercise suggestions• Handy information on how SUGAR BUSTERS! compares with other diet plans, from Atkins to Ornish So arm yourself with the facts and get the figure you’ve always wanted. When it comes to optimal wellness on the SUGAR BUSTERS! program, it’s survival of the fittest–a way of life in which everybody wins!",
  "genres": [
    "Health",
    "Nonfiction",
    "Self Help",
    "Diets",
    "Nutrition",
    "Cookbooks",
    "Food"
  ],
  "author": "H. Leighton Steward",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/809376.Sugar_Busters_Cut_Sugar_to_Trim_Fat"
}