{
  "title": "Randall Jarrell's Book of Stories",
  "description": "Storytelling as a fundamental human impulse, one that announces itself at the moment, hidden in infancy, that dreams begin—this is what the poet and critic Randall Jarrell set out to illuminate in this extraordinary book. Here Jarrell presents ballads, parables, anecdotes, and legends along with some of the finest work of Chekhov, Babel, Elizabeth Bowen, Isak Dinesen, Kafka, Peter Taylor, and Katherine Anne Porter. This wonderful anthology, with its celebrated introductory essay, enlarges and deepens our perception of the storyteller's art and its central place in the world of our feelings.1 • A Country Doctor • (1948) • short story by Franz Kafka (trans. of Ein Landarzt 1918)36 • The Witch of Coös • (1923) • poem by Robert Frost47 • The Nose • (1957) • novelette by Николай Гоголь? (trans. of Нос? 1836) [as by Nicolai Gogol]85 • Fair Eckbert • (1913) • novelette by Ludwig Tieck (trans. of Der blonde Eckbert 1797)105 • The Three Hermits • (1907) • short story by Лев Толстой? (trans. of Три старца? 1886) [as by Lev Tolstoy]131 • The Fir Tree • juvenile • (1912) • short story by Hans Christian Andersen (trans. of Grantræet 1844)151 • The Red King and the Witch: A Gypsy Folk-Tale • (1889) • short story by Anonymous167 • Cat and Mouse in Partnership • [KHM (Kinder- und Hausmärchen)? • 2] • (1897) • short story by Jacob Grimm and Wilhelm Grimm (trans. of Katze und Maus in Gesellschaft 1812) [as by The Brothers Grimm]170 • The Story of the Siren • (1920) • short story by E. M. Forster179 • The Book of Jonah • (1611) • short story by uncredited (trans. of ספר יונה? unknown)183 • The Bucket-Rider • [Der Kübelreiter] • (1933) • short story by Franz Kafka (trans. of Der Kübelreiter 1921)213 • On Letting Alone • (1889) • short story by 莊子? (trans. of 在宥? unknown) [as by Chuang T'zu]216 • A Tale of the Cavalry • (1952) • short story by Hugo von Hofmannsthal (trans. of Reitergeschichte 1899)226 • The Mental Traveller • (1863) • poem by William Blake247 • The Porcelain Doll • (1920) • short story by Лев Толстой? (trans. of Фарфоровая Кукла? 1863) [as by Lev Tolstoy]252 • Byezhin Prairie • (1897) • short story by Иван Тургенев? (trans. of Бежин луг? 1851) [as by Ivan Turgenev]",
  "genres": [
    "Short Stories",
    "Fiction",
    "Short Story Collection",
    "Poetry",
    "Literary Fiction"
  ],
  "author": "Randall Jarrell",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/80990.Randall_Jarrell_s_Book_of_Stories"
}