{
  "title": "How to Do a Stew: A Man-Guide On: How to Date a Stewardess",
  "description": "Pandora's Box has finally been opened, and years and years of hidden secrets are now flying out for the entire world to hear! How to Do a Stew is a step-by-step personal playbook that gives men a \"heads up\" and a sneak peek at the inside world of a sexy profession filled with a commodity of untamed, fancy-free women who fly, otherwise known as \"The Stewardess\", and the topsy-turvy world they live in. Filled with priceless tips and tactics, to dos, and taboos that will give any curious man the confidence to land his own Susie Stew-not just ring her bell! This hot-topic tabloid is a humorous \"cookbook\" geared towards men, filled with juicy, insider information and savory secrets on how to get a date, be a great mate, and with a little luck...permanently land a salacious Stewardess of your very own. It's an easy-to-follow template for those who are tired of striking out in the game of love; filled with defensive moves and clever strategies that'll enable even the slightest of men a grand slam home run! It's fresh and hot and \"fun-damental.\" Available in print for the first time are the basic tools to make your \"Fantasy Dream Stew\" come true! A farm girl at heart, Dr. Lee was raised in the Great Northwest with fresh air, wide open spaces and blue skies as far as her eyes could see. Encapsulated as a Stewardess for the past 27 years, she has earned her honorary \"Love Jet Fly-chiatrist\" degree from the School of Hard Knocks and Landings. After decades of research; listening and comparing her Sister Stews' endless tired tales and non-stop stories; difficult issues of life on the road, love or lack of, and the struggle to find balance both on and off the airplane, she began to write. Her quick wit, combined with hope and a desire to help, led her to compile a \"comic book of relief \" for men and women of all ages to enjoy. Included are inside secrets and tips on how to have a healthy, balanced relationship from take off to landing, as well as a rare peek for all to see, into the intriguing world of the elusive \"Fantasy Stews!\"",
  "genres": [],
  "author": "DR Lee",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/13101604-how-to-do-a-stew"
}