{
  "title": "Fragt mal Alice",
  "description": "Die 15-jährige Alice ist ein Teenager wie viele andere. Ihre Sorgen, Ängste und Geheimnisse vertraut sie ihrem Tagebuch an; ihre Stimmungen schwanken wie ihre Noten und ihr Gewicht, und vor allem der erste Liebeskummer macht ihr zu schaffen. Als man ihr in einer Clique ohne ihr Wissen LSD einflößt, ist sie geschockt und fasziniert zugleich. Einerseits sieht sie in Drogensüchtigen nur Dreck und Abschaum; andererseits erlebt sie durch LSD die Welt viel intensiver, sie sieht, hört und fühlt auf ihrem Trip Dinge, die sie noch nie wahrgenommen hat. Schließlich siegt die Neugier und Sehnsucht nach diesem Rausch: Sie probiert immer härtere Drogen aus und rutscht immer tiefer in den Strudel der Sucht hinein.Der Kreislauf von Aufputsch- und Beruhigungsmitteln, Selbstekel und Euphorie wird für sie zur tödlichen Spirale. Zweimal ist sie wild entschlossen, die Sucht endlich weit hinter sich zu lassen - sie geht von zu Hause weg, um dem Dunstkreis ihrer alten Drogenclique zu entkommen, die sie immer stärker unter Druck setzt. Doch ohne ihre Familie, die ihr Halt gibt und Normalität garantiert, stürzt sie noch gnadenloser ab als zuvor, darum kehrt sie nach Hause zurück, wo sie sich aus ganzer Kraft bemüht, zurück in ein Leben ohne Drogen zu finden. Aber die alten Freunde sind hartnäckig, Aussteiger wollen sie nicht dulden. Sie schicken Alice auf einen Horrortrip, der sie fast um den Verstand bringt. Als sie danach schwer krank in die Jugendpsychiatrie eingewiesen wird, wo sie in der Gruppentherapie vieles über sich lernt, sieht es so aus, als könnte sie doch noch den Weg zurück in ein normales Leben finden - doch hier bricht das Tagebuch ab: Seine Verfasserin ist drei Wochen nach dem letzten Eintrag an einer Überdosis gestorben.›Fragt mal Alice‹ stützt sich auf das authentische Tagebuch einer Fünfzehnjährigen, die drogenabhängig war und an ihrer Sucht starb. Die Verfasserin bleibt deshalb anonym, Namen, Ort, Zeit und bestimmte Ereignisse wurden auf Wunsch der Angehörigen geändert.",
  "genres": [
    "Young Adult",
    "Fiction",
    "Classics",
    "Contemporary",
    "Mental Health",
    "Banned Books",
    "Realistic Fiction"
  ],
  "author": "Beatrice Sparks",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/810463.Fragt_mal_Alice"
}