{
  "title": "Black Heart, Ivory Bones",
  "description": "Hair bright as gold...Lips red as blood...Heart black as sin...Truth sharp as bone...  As in their previous critically acclaimed volumes of reconsidered fairy tales, award-winning editors Ellen Datlow and Terri Windling have gathered together remarkable stories that illuminate the more sinister, sensual, and sophisticated aspects of the tales we cherished in childhood; the fables of witches and princes and lost children that we once imagined we knew. \"Black Heart, Ivory Bones\" showcases twenty beguiling tales for the child-that-was and the adult-that-is, penned by twenty of the most creative artists in contemporary American literature. Here dissected are the darker anatomies of the timeless, seemingly simple stories we have long loved. Here wonder and truth have serious bite. A lovelorn prince seeking his father's blessing concocts a fantastic tale of a witch, a tower, and lustrous long hair... A pair of accursed red boots punishes a beautiful dancer for her pride... A troll-killing, princess-rescuing warrior is compelled to consider events from his adversaries' point of view...In a blistering tell-all memoir, Goldilocks reveals the sordid truth about her brutal foster parent, Papa Bear... Rich, surprising, funny, erotic, and unsettling, these twenty new yarns and poems offer exceptional anew treasures--as they brilliantly reveal lusts and jealousies, foibles, hatreds and dangerous obsessions, the things that slyly lurk in the midnight interior of oft-told tales.\nThe \"Snow White, Blood Red\" Collection\n#1. \nSnow White, Blood Red\n#2. \nBlack Thorn, White Rose\n#3. \nRuby Slippers, Golden Tears\n#4. \nBlack Swan, White Raven\n#5. \nSilver Birch, Blood Moon\n#6. \nBlack Heart, Ivory Bones",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fairy Tales",
    "Fiction",
    "Anthologies",
    "Retellings",
    "Horror"
  ],
  "author": "Ellen Datlow",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/81038.Black_Heart_Ivory_Bones"
}