{
  "title": "A White Christmas in Berrycombe",
  "description": "All books in the series are standalone stories and can be read in any order.If you like Franceine Rivers, Valerie M. Bodden, Kimberly Rae Jordan, Rachael Bloome, and Liz Isaacson you will love this holiday romance packed with feel-good moments, a Christmas message, and a sweet romance.\nOnly one thing can bring love into Carter’s life – a Christmas miracle!\nCarter decided years ago he didn’t need anyone in his life. As a successful author with no need to venture into the world, he embedded himself in his comfortable Greenwich Village apartment and became a recluse.After an unsuccessful year of writing, he decides to leave New York City for the holidays and go in search of inspiration. A remote country guesthouse in England seems like the ideal place for him to write his next story. He plans to hide away from yet another Christmastide and the painful memories it evokes. But some things are beyond his control. The fiercest storm in years is hurtling towards Cumbria. It will blanket the area with snow and bring everything to a halt, even bringing down the power lines and cutting off the electricity.The landlord’s daughter entices him out of his shell when she asks him to help keep the villagers warm. Carter is about to have his world turned upside down as the real reason for Christmas makes itself known.Can Laura and the villagers melt his frozen heart?\nA White Christmas in Berrycombe is a small-town, Christian romance with a whirlwind of festive magic and mistletoe!\n\n‘This is the best Christmas story I have read. The characters are real, the timeline is current, and it exemplifies what Christmas and community should be like all year long.’ Amazon Reviewer\n\n‘This is a sweet romantic story, but so much more. Carter, Bill and Laura learn beautiful truths about the power of love, community and friendship.’ Amazon Reviewer",
  "genres": [],
  "author": "T.N. Traynor",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/81073161-a-white-christmas-in-berrycombe"
}