{
  "title": "Season of Suffering: Coming of Age in Occupied France, 1940-1945",
  "description": "Born in 1927, Nicole Braux's earliest recollections occur in the French city of Nancy, where her father owned and operated a hotel and restaurant. Her charming reflections paint a picture of a romantic culture still wounded by the First World War. Nicole was twelve when her father was recalled into the reserves in 1939. Within months, she watched German troops invade. \"We peeked above the window sill and saw them...Our imaginations hadn't exaggerated; they looked as evil, if not more so, than we'd expected!\" Little by little, the Braux family adjusted to life under occupation. They experienced recurrent air raid alerts, Nazi propaganda, rationing, the black market, and bombings. As they struggled simply to acquire food and keep warm, thinking of the future became irrelevant. Teachers, friends, employers, priests, nuns, and doctors disappeared in the night. Relationships became veiled in worry, suspicion, and secrecy. French citizens quietly resisted. They concocted strategies to elude curfew. They purposely dressed to offend Germans, donning short skirts and makeup, and choosing the bright colors of the French flag. They sold tainted food to the despised oppressors. As the fighting drew ever closer, desperation and terror increased, but miraculous events brought hope. Finally the inconceivable joy of liberation came. However, food remained scarce, and the fate of her father was still unknown. Now eighteen, Nicole found herself deeply in love with Lieutenant Ancel G. Taflinger, pilot for General George S. Patton. Written decades ago but never published, the author's guileless voice enhances her adolescent memories of the German occupation--an existence of fear, loss, suffering, and fierce hatred--and illustrates the immense emotional toll of war.",
  "genres": [
    "Nonfiction",
    "World War II",
    "History"
  ],
  "author": "Nicole H. Taflinger",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/8109910-season-of-suffering"
}