{
  "title": "The Works of John Newton - Volume 1 of 6",
  "description": "When John Newton, ex-sea captain and, as yet, unsuccessful candidate for the Church of England ministry, finished his first book (an autobiography) in 1762 there was no ready publisher. Any thought that he was destined to become one of the best-known authors of his age would have been as fantastic as the past 37 years of his life. But in both cases the improbable came about. Becoming Curate of Olney, Bucks, in 1764, Newton there laid his reputation as an evangelical writer, pre-eminently by his published Letters and by the Olney Hymns (including, 'How sweet the name of Jesus sounds', 'Glorious things of thee are spoken', and 'Amazing Grace'). Before the end of his subsequent pastorate at St. Mary, Woolnoth, London (1780-1807), his writings were prized around the world from America to Australia. The 19th century saw a number of rival editions of his Complete Works, but it is the edition from which the present is reprinted (which includes his Letters to a Wife) which has the best claim to that title.Newton has a firm place in the classics of Christian literature. While his style is strong and clear, it is the spiritual attractiveness and importance of of his main themes which secure the permanent value of his writings. Most of his books came, unpremeditated, out of a need to help his congregation or individual hearers, and it is in practical helpfulness towards Christian living that he excels. If he is loved rather than admired, it is for this reason. Conformity to Christ is the one subject upon which all his themes finally focus ('It will not be a burden to me at the hour of death that I have thought too highly of Jesus, expected too much from Him myself, or laboured too much in commending and setting Him forth to others'). Not surprisingly, Alexander Whyte could write: 'For myself, I keep John Newton on my selectest shelf of spiritual books: by far the best kind of books in the whole world of books'.",
  "genres": [
    "Christian",
    "Theology",
    "Biography"
  ],
  "author": "John   Newton",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/810678.The_Works_of_John_Newton_Volume_1_of_6"
}