{
  "title": "Washington's General: Nathanael Greene and the Triumph of the American Revolution",
  "description": "The overlooked Quaker from Rhode Island who won the American Revolution's crucial southern campaign and helped to set up the final victory of American independence at YorktownNathanael Greene is a revolutionary hero who has been lost to history. Although places named in his honor dot city and country, few people know his quintessentially American story as a self-made, self-educated military genius who renounced his Quaker upbringing-horrifying his large family-to take up arms against the British. Untrained in military matters when he joined the Rhode Island militia in 1774, he quickly rose to become Washington's right-hand man and heir apparent. After many daring exploits during the war's first four years (and brilliant service as the army's quartermaster), he was chosen in 1780 by Washington to replace the routed Horatio Gates in South Carolina.Greene's southern campaign, which combined the forces of regular troops with bands of irregulars, broke all the rules of eighteenth-century warfare and foreshadowed the guerrilla wars of the nineteenth and twentieth centuries. His opponent in the south, Lord Cornwallis, wrote, \"Greene is as dangerous as Washington. I never feel secure when I am encamped in his neighborhood. He is vigilant, enterprising, and full of resources.\" Greene's ingenious tactics sapped the British of their strength and resolve even as they \"won\" nearly every battle. Terry Golway argues that Greene's appointment as commander of the American Southern Army was the war's decisive moment, and this bold new book returns Greene to his proper place in the Revolutionary era's pantheon.\"Washington said if he went down in battle, Greene was his choice to succeed him. Read this book and you will understand why.\" -- Joseph J. Ellis, author of His Excellency: George Washington",
  "genres": [
    "History",
    "Biography",
    "American Revolution",
    "American History",
    "Nonfiction",
    "American Revolutionary War",
    "Military History"
  ],
  "author": "Terry Golway",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/811178.Washington_s_General"
}