{
  "title": "White House Diary",
  "description": "Here is the edited, annotated diary of President Jimmy Carter - filled with insights into his presidency, his relationships with friends and foes, and his lasting impact on issues that still preoccupy America and the world.Each day during his presidency, Jimmy Carter made several entries in a private diary, recording his thoughts, impressions, delights, and frustrations. He offered unvarnished assessments of cabinet members, congressmen, and foreign leaders; he narrated the progress of secret negotiations, such as those that led to the Camp David Accords. When his four-year term came to an end in early 1981, the diary amounted to more than 5,000 pages. But this extraordinary document has never been made public - until now. By carefully selecting the most illuminating and relevant entries, Carter has provided us with an astonishingly intimate view of his presidency. Day by day, we see his forceful advocacy for nuclear containment, sustainable energy, human rights, and peace in the Middle East. We witness his interactions with such complex personalities as Ted Kennedy, Henry Kissinger, Joe Biden, Anwar Sadat, and Menachem Begin. We get the inside story of his so-called \"malaise speech\", his bruising battle for the 1980 Democratic nomination, and the Iranian hostage crisis. Remarkably, we also get Carter's retrospective comments on these topics and more: 30 years after the fact, he has annotated the diary with his candid reflections on the people and events that shaped his presidency, and on the many lessons learned. Carter is now widely seen as one of the truly wise men of our time. Offering an unprecedented look at both the man and his tenure, this fascinating book will stand as a unique contribution to the history of the American presidency.",
  "genres": [
    "Politics",
    "History",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Presidents",
    "American History"
  ],
  "author": "Jimmy Carter",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/8113025-white-house-diary"
}