{
  "title": "بؤس",
  "description": "\"إحدى وخمسون ساعة. عرف ذلك بسبب القلم، القلم الأنيق ذي الخط الجميل الذي كان يحمله في جيبه عندما وقع الحادث. وقد تمكن من الوصول إليه والاحتفاظ به بعد رحيلها. وهكذا، بواسطة هذا القلم كان يكتب علامة على ذراعه كلما كانت الساعة تدق معلنة انقضاء ساعة من الزمن. أربع علامات شاقولية ثم خط قطري لإكمال الخماسية. وعندما عدت إلى البيت، كان هناك عشرة مجموعات عن هذه الخماسيات وواحدة إضافية. كانت المجموعات الصغيرة مرتبة في البداية، لكنها بعد ذلك بدأت تتعرج على نحو متزايد عندما بدأت يداه ترتجفان. وهو كان متأكداً من أنه لم يخطئ في أي ساعة، لأنه لم ينم أبداً؛ بل كان يغفو إغفاءات بسيطة فقط، إذ كانت دقات الساعة توقظه في كل مرة كانت عيناه تغمضان. بعد مضي فترة من الوقت، بدأ الجوع والعطش يغزوان جسده، بالرغم من وجود الألم. وكان الأمر بين الأحاسيس الثلاثة يبدو مثل سباق للخيول. في البداية كان \"ملك الألم\" مبتعداً في المقدمة وكان \"ملك الجوع\" متخلفاً بمسافة طويلة. أما \"العطش الجميل\" فقد كان غائباً بين الغبار. ولكن، بعد يوم من مغادرتها، عند شروق الشمس، بدأ \"ملك الجوع\" ينافس \"ملك الألم\" بشكل قوي. كان قد أمضى معظم الليل متناوباً بين الإغفاء والاستيقاظ مبللاً بالعرق البارد: من المؤكد أنه كان يحتضر، وبعد فترة تمنى لو أنه كان يحتضر. أي شيء يخلصه من معاناته. وفوق ذلك، لم تكن لديه أدنى فكرة عما سيؤول إليه الألم. كل ما كان يعرفه هو أن الوتدين كانا يكبران\".من الوتد تنطلق خيالات بول الكاتب المقعد الذي تعرض لحادث جعله طريح الفراش لفترة طويلة. تتنامى خيالات بول من خلال آني التي رعته خلال مرضه، والتي أوحت إليه شخصيتا بخلق شخصية لامرأة قاسية جعلته سجيناً في غرفة لم تحل حيطانها وبابها المقفل دون اطلاقه وراء خيالات أتاحت له نسج روايته تلك، ويستطيع القارئ تلمس خط بياني بين آلام ومعاناة بول وبين الأحداث المتسارعة والخيالات الغريبة، فكلما استبدت الآلام والحمّى بجسد بول كلما مضى بعيداً في أفكار وأحداث غريبة تولد ضمن الرواية عنصر التشويق والترقب. يحاول الروائي ستيفن مزج الواقع مع الخيال، تاركاً الفرصة للقارئ ليعيش أجواء الكتابات الروائية ومدى معاناة الروائي عند إنجازه لعمله الروائي بصورة عامة، وتجدر الإشارة إنه قد تمّ ترجمة روايات ستيفن كينغ إلى 26 لغة، وبيع منها أكثر من 300 مليون نسخة.",
  "genres": [
    "Horror",
    "Fiction",
    "Thriller",
    "Mystery",
    "Suspense",
    "Mystery Thriller",
    "Horror Thriller"
  ],
  "author": "Stephen        King",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/8113304"
}