{
  "title": "Sushi for One?",
  "description": "'Sushi for One? is an entertaining romp into the world of multi-culturalism. I loved learning the idiosyncrasies of Lex's crazy family---which were completely universal. Enjoy!' ---Kristen Billerbeck, author of What a Girl Wants 'In Lex Sakai, Camy Tang gives us a funny, plucky, volleyball-playing heroine with way too many balls in the air. I defy anyone to start reading and not root for Lex all the way to the story's romantic, super-satisfying end.' ---Trish Perry, author of The Guy I'm Not Dating Sports-crazy Lex Sakai isn't too worried about \"winning\" the unofficial family title \"Oldest Single Female Cousin\" when her cousin Mariko marries in a few months. Her control-freak grandma is easy to ignore, until Grandma issues an ultimatum--if Lex can't find a date for Mariko's wedding, her ruthless Grandma will cut off funding to the girls' volleyball team that Lex coaches.Lex isn't about to look desperate by dating every player in the dugout. She comes up with a stringent list of requirements from her Ephesians Bible study in her search for The Perfect Man. She always wins in volleyball--if she ups her game, she's sure to succeed.Then her brother introduces her to non-Christian, non-athletic, no-immediate-physical-appeal Aiden.Aiden's on the rebound from a girl named Trish, who dumped him because he wasn't Christian. Then he discovers that Lex is 1) not attracted to him at all, 2) Christian, and 3) Trish's cousin. No way is he hooking up with anyone from that crazy family, much less another hypocritical Christian chick. He's certainly not masochistic.Time is running out for Lex, and no matter what she does, she can't find the right guy. Especially when she keeps running into Aiden everywhere. If only the list would stop getting longer and longer...",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Christian",
    "Chick Lit",
    "Fiction",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Camy Tang",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/8116992-sushi-for-one"
}