{
  "title": "The Star Trek Compendium",
  "description": "\"Space . . . the final frontier. These are the voyages of the Starship Enterprise. Its five-year mission: to explore strange new worlds, to seek out new life and new civilizations - to boldly go where no man has gone before. . .\"On September 8, 1966, those now-familiar words first introduced an entire generation of television viewers to STAR TREK. Over the course of its three-year network run, the show developed a fan following unprecedented in entertainment history - a following that is still growing with the release of each new STAR TREK motion picture.Much of the show's appeal came from its blueprint for the future - a future where man had put aside his differences to reach the stars. STAR TREK gave us a Russian and an American working side-by-side, television's first interracial kiss, the name for America's first space shuttle - Enterprise - and a host of unforgettable characters: the unflappable Captain Kirk, his half-human science officer Spock, the irascible Dr. Leonard \"Bones\" McCoy, and ever-resourceful engineer Montgomery Scott, to name but a few.THE STAR TREK COMPENDIUM is your official guidebook to the STAR TREK universe. Relive the voyages of the Starship Enterprise with a complete show-by-show guide to the series (as well as the Emmy Award-winning animated shows and the STAR TREK movies), including plot summaries, fascinating behind-the-scenes production information, and credits for each. Follow the creation of Gene Roddenberry's series step-by-step - and STAR TREK's road to the big screen. Illustrated with over 125 specially selected photographs - including at least one from each episode - and fully indexed, this is the indispensable reference work to one of the most memorable television shows of all time - STAR TREK.",
  "genres": [
    "Star Trek",
    "Science Fiction",
    "Reference",
    "Tv",
    "Fiction",
    "Pop Culture",
    "Science Fiction Fantasy"
  ],
  "author": "Allan Asherman",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/811739.The_Star_Trek_Compendium"
}