{
  "title": "The Hellhound of Wall Street: How Ferdinand Pecora's Investigation of the Great Crash Forever Changed American Finance",
  "description": "A gripping account of the underdog Senate lawyer who unmasked the financial wrongdoing that led to the Crash of 1929 and forever changed the relationship between Washington and Wall Street.  In The Hellhound of Wall Street, Michael Perino recounts in riveting detail the 1933 hearings that put Wall Street on trial for the Great Crash. Never before in American history had so many financial titans been called to account before the public, and they had come within a few weeks of emerging unscathed. By the time Ferdinand Pecora, a Sicilian immigrant and former New York prosecutor, took over as chief counsel, the investigation had dragged on ineffectively for nearly a year and was universally written off as dead. The Hellhound of Wall Street provides a minute-by-minute account of the ten dramatic days when Pecora turned the hearings around, cross- examining the officers of National City Bank (today's Citigroup), particularly its chairman, Charles Mitchell, one of the best known bankers of his day. Mitchell strode into the hearing room in obvious disdain for the proceedings, but he left utterly disgraced. Pecora's rigorous questioning revealed that City Bank was guilty of shocking financial abuses, from selling worthless bonds to manipulating its stock price. Most offensive of all was the excessive compensation and bonuses awarded to its executives for peddling shoddy securities to the American public.  Pecora became an unlikely hero to a beleaguered nation. The man whom the press called \"the hellhound of Wall Street\" was the son of a struggling factory worker. Precocious and determined, he became one of New York's few Italian American lawyers at a time when Italians were frequently stereotyped as anarchic criminals. The image of an immigrant lawyer challenging a blue-blooded Wall Street tycoon was just one more sign that a fundamental shift was taking place in America.  By creating the sensational headlines needed to galvanize public opinion for reform, the Pecora hearings spurred Congress to take unprecedented steps to rein in the freewheeling banking industry and led directly to the New Deal's landmark economic reforms. A gripping courtroom drama with remarkable contemporary relevance, The Hellhound of Wall Street brings to life a crucial turning point in American financial history.",
  "genres": [
    "History",
    "Economics",
    "Finance",
    "Biography",
    "Nonfiction",
    "Business",
    "Politics"
  ],
  "author": "Michael Perino",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/8112868-the-hellhound-of-wall-street"
}