{
  "title": "A Brief History of Infinity: The Quest to Think the Unthinkable",
  "description": "'Space is big. Really big. You just won't believe how vastly, hugely, mind-bogglingly big it is. I mean, you may think it's a long way down the street to the chemist, but that's just peanuts to space.' Douglas Adams, Hitch-hiker's Guide to the GalaxyWe human beings have trouble with infinity - yet infinity is a surprisingly human subject. Philosophers and mathematicians have gone mad contemplating its nature and complexity - yet it is a concept routinely used by schoolchildren. Exploring the infinite is a journey into paradox. Here is a quantity that turns arithmetic on its head, making it feasible that 1 = 0. Here is a concept that enables us to cram as many extra guests as we like into an already full hotel. Most bizarrely of all, it is quite easy to show that there must be something bigger than infinity - when it surely should be the biggest thing that could possibly be. Brian Clegg takes us on a fascinating tour of that borderland between the extremely large and the ultimate that takes us from Archimedes, counting the grains of sand that would fill the universe, to the latest theories on the physical reality of the infinite. Full of unexpected delights, whether St Augustine contemplating the nature of creation, Newton and Leibniz battling over ownership of calculus, or Cantor struggling to publicise his vision of the transfinite, infinity's fascination is in the way it brings together the everyday and the extraordinary, prosaic daily life and the esoteric.Whether your interest in infinity is mathematical, philosophical, spiritual or just plain curious, this accessible book offers a stimulating and entertaining read.",
  "genres": [
    "Science",
    "Nonfiction",
    "Mathematics",
    "History",
    "Philosophy",
    "Physics",
    "Popular Science"
  ],
  "author": "Brian Clegg",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/812261.A_Brief_History_of_Infinity"
}