{
  "title": "October Breezes",
  "description": "Skye Williams knows everything there is to know about Dad skipped out when she was five, leaving Mom with an angry daughter and an upside-down mortgage. Then there were the boyfriends—at least a dozen—hot on his heels and hot for her mom, none of whom stuck around long enough to figure out Skye hated them—hated the underage toys they brought as bribes and the way they looked at her, speeding past with the same distaste they would have for a yellow traffic light. And now this Warren Jacobs has shown up to sweep Mom off her feet—and all he’s brought with him is a crummy, dog-eared book. She doesn’t even read! How can Mom even like this guy, much less trust him? He’s just another loser with a capital L. But Warren’s not the only concern rocking Skye’s world. Devin Abbott, a guy she’s known since kindergarten, has changed. Almost at once, he’s become this tall, broad-shouldered guy with dark hair and easy eyes she might date—if he hadn’t always been her best friend. Skye swears there’s nothing between them, but everyone else thinks differently. Devin doesn’t act the way he used to, especially when Kellin Morgan, senior quarterback, asks Skye out. Flattered, she accepts, and, Devin sulls up—and he isn’t the only one. Kellin’s best friend, Tyler Rutherford, gets bent out of shape, too, as he’s always wanted Skye for himself. When Kellin and Skye attend one of Tyler’s famous parties, neither senses the impending disaster. Afterwards Skye is left with consequences that will change not only her life but also that of everyone who loves her. Editorial Review October Breezes is a great YA book that has some pretty serious topics. I kinda knew where the story was going but that didn't make it any less interesting. I'll start with the characters. Though I felt Skye could be way immature at times, she is slightly complex, and is definitely dealing with major issues throughout the book. I felt for her, and what she was going through. Devin was Skye's \"Ducky\". If you've seen Pretty in Pink then you know exactly what I'm talking about. He played the best friend that secretly, but obviously in love with Skye. Now for the story...wow! Like I mentioned earlier it was similar to Pretty in Pink, just more tragic. The whole them versus us was in play throughout the whole book. Kellin and Tyler are in a totally different circle that Skye and Devin are in, so when Kellin asks Skye out people start talking, and wondering what's the catch. --Coffee Books and Laundry Blogspot",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary",
    "Abuse",
    "Young Adult Romance",
    "High School",
    "Realistic Fiction"
  ],
  "author": "Maria Rachel Hooley",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/8125703-october-breezes"
}