{
  "title": "Let Me Take You Down: Inside the Mind of Mark David Chapman,the Man Who Killed John Lennon",
  "description": "A top crime journalist reveals precisely how the world-shattering murder of John Lennon happened—and whyIn Let Me Take You Down, Jack Jones penetrates the borderline world of dangerous fantasy in which Mark David Chapman stalked and killed Mark David Chapman rose early on the morning of December 8 to make final preparations. . . . Chapman had neatly arranged and left behind a curious assortment of personal items on top of the hotel dresser. In an orderly semicircle, he had laid out his passport, an eight-track tape of the music of Todd Rundgren, his little Bible, open to The Gospel According to John (Lennon). He left a letter from a former YMCA supervisor at Fort Chaffee, Arkansas, where five years earlier, he had worked with refugees from the Vietnam War. Beside the letter were two photographs of himself surrounded by laughing Vietnamese children. At the center of the arrangement of personal effects, he had placed the small Wizard of Oz poster of Dorothy and the Cowardly Lion.“I woke up knowing, somehow, that when I left that room, that was the last time I would see the room again,” Chapman recalled. “I truly felt it in my bones. I don’t know how. I had never seen John Lennon up to that point. I only knew that he was in the Dakota. But I somehow knew that it was it, this was the day. So I laid out on the dresser at the hotel room . . . just a tableau of everything that was important in my life. So it would say, ‘Look, this is me. Probably, this is the real me. This is my past and I’m going, gone to another place.’“I practiced what it was going to look like when police officers came into the room. It was like I was going through a door and I knew I was going to go through a door, the poet’s door, William Blake’s door, Jim Morrison’s door. . . . I was leaving what I was, going into a future of uncertainty.”Praise for Let Me Take You Down“Jack Jones has written a beautiful book, rare in its attention to the social context giving rise to stalkers and assassins of celebrities . . . celebrity worship is ambivalent—admiration shares the altar with envy. When the worshipped disappoints, a ‘nobody’ can become a ‘somebody’ by killing the pop culture idol. Let Me Take You Down is both fascinating and brilliant.” —Ladd Wheeler, Professor of Psychology, University of Rochester, Former President of the Society for Personality and Social Psychology",
  "genres": [
    "True Crime",
    "Biography",
    "Nonfiction",
    "Music",
    "Crime",
    "History",
    "Psychology"
  ],
  "author": "Jack  Jones",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/811936.Let_Me_Take_You_Down"
}