{
  "title": "Sahih Muslim",
  "description": "Sahih Muslim is the most authentic book of Hadith after Sahih Al-Bukhari and contains 7,563 Ahadith. The Muslim Scholars have agreed that all of the Ahadith in Sahih Muslim are authentic. Thus, Darussalam realized the great benefit of publishing the full version of Sahih Muslim in the English language in the best presentation. Much care has been taken in rendering these Ahadith into a clear and simple style of modern English.This fine-quality edition of Sahih Muslim has been verified by Dar-us-Salam Publications extensively. Its translation has been checked several times as not only to avoid mistranslating but also to avoid misinterpreting the ahadith as done by many translators of the current times in order to rush the product to market or to their lack of understanding of the Arabic language. Unlike other publishers which leave you wondering about the meaning of the ahadith, the unclear wording has been explained in the brackets. There are also footnotes on bottom of some of the pages, when the term cannot be explained in the brackets. This edition of Dar-us-Salam is nice in that it starts off by drawing a life sketch of Imam Muslim. Then, it goes on to the introduction of Sahih Muslim by Imam Muslim himself where he explains the difference between different narrators and level of trustworthiness.This edition is also different from other publishers in that the text is side by side with Arabic so you have access to both English and Arabic at the same time. Furthermore, the book regarding reporting from the trustworthy narrators have been placed first while other books follow it. Moreover, the Arabic text contains full chain of narrators while the English only mentions the companion. Lastly, in keeping with the tradition of high quality printing, this edition of Sahih Muslim by Dar-us-Salam Publications is second to none other & made to last a long time, Insha Allah.About Sahih MuslimThe authentic hadith collections of Bukhari and Muslim are excellent in respect to both chain of transmissions and the texts as well as their general utility in that they gave guidance in almost all walks of life. The collections won the praise and acclaim of of Hadith scholars so much that they themselves produced works containing the same Ahadith as found in the collection of both Bukhari and Muslim but with their own independent chains consisting of a lesser # of sub-narrators and called their works Mustakhraj.Imam Muslim is one of the foremost preservers of ahadith of the Prophet. His book comes second only to Sahih al Bukhari in terms of authenticity according to majority of scholars. It is considered to be better than Sahih Bukhari in terms of organization and repetition according to some scholars of Islam. It is the second in the collection of 6 books called \"Sihah Sittah\" or \"6 most authentic books\". Imam Muslim took painstaking efforts in preserving the words/actions/sayings & approvals of the Prophet. He has mostly used 4-5 narrators in the chain of transmission although there are a couple of hadith containing 3 narrators. Imam Muslim was a very good student of Imam Bukhari and some of his Shuyukhs, although he did not narrate from Imam Bukhari too much, thus reducing the # of narrators.Book Compiled by: Imam Abul Hussain Muslim Ibn Al-HajjajAhadith edited & referenced by: Hafiz Abu Tahir Zubair Ali ZaiTranslated by: Nasiruddin al-Khattab (Canada)Final Review by: Abu Khaliyl (USA)",
  "genres": [
    "Islam",
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Theology",
    "Reference"
  ],
  "author": "Imam Abul-Husain Muslim",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/8118290-sahih-muslim"
}