{
  "title": "Steampunk II: Steampunk Reloaded",
  "description": "Blending the romantic elegance of the Victorian era with modern scientific advances, the popular Steampunk genre spotlighted in this collection is innovative and stimulates the imagination. This artfully assembled anthology of original fiction, nonfiction, and art can serve as an introduction to the Steampunk culture or provide dedicated fans with more fuel. Stories of outlandishly imaginative technologies, clockwork contraptions, eccentric heroines, and mad scientists are complemented by canon-defining nonfiction and an array of original illustrations. This collection showcases the most sensational Steampunk talents of the last decade, including Daniel Abraham, John Coulthart, William Gibson, and Margo Lanagan, and demonstrates exactly why the future of the past is so excitingly new.ContentsIntroduction: “What Is Steampunk?” by Jeff and Ann VanderMeer“The Cast Iron Kid” by Andrew Knighton“The Steam Dancer (1896)” by Caitlín R. Kiernan“The Anachronist’s Cookbook” by Catherynne M. Valente“Tanglefoot” by Cherie Priest“O One” by Chris Roberson“Balfour and Meriwether in the Adventure of the Emperor’s Vengeance” by Daniel Abraham“The Bold Explorer in the Place Beyond” by David Erik Nelson“The Strange Case of Mr. Salad Monday” by Geoffery D. Falksen“At the Intersection of Technology and Romance” by Jake von Slatt“The Future of Steampunk: A Roundtable Interview” by Jeff and Ann VanderMeer“Dr. Lash Remembers” by Jeffrey Ford“Lost Pages From The Encyclopdia of Victoriana” by Jess Nevins“As Recorded on Brass Cylinders: Adagio for Two Dancers” by Lisa Mantchev“A Serpent in the Gears” by Margaret Ronald“Machine Maid” by Margo Lanagan“Which Is Mightier, the Pen or the Parasol?” by Gail Carriger“The Unbecoming of Virgil Smythe” by Ramsey Shehadeh“Wild Copper” by Samantha Henderson“The Mechanical Aviary of Emperor Jalal-ud-din Muhammad Akbar” by Shweta Narayan“The Unblinking Eye” by Stephen Baxter“Lovelace & Babbage” by Sydney Padua“The Persecution Machine” by Tanith Lee“Flying Fish (Prometheus)” by Vilhelm Bergsøe“The Gernsback Continuum” by William Gibson",
  "genres": [
    "Steampunk",
    "Anthologies",
    "Science Fiction",
    "Short Stories",
    "Fantasy",
    "Fiction",
    "Alternate History"
  ],
  "author": "Ann VanderMeer",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/8129662-steampunk-ii"
}