{
  "title": "Moon Shell Beach",
  "description": "New York Times bestselling author Nancy Thayer delighted readers with her sparkling Hot Flash Club series. Now she has written a vibrant new novel set within a tight-knit island community, where two women struggle to rekindle a childhood friendship damaged by harsh words, betrayal, and the passing years.Lexi Laney and Clare Hart grew up together swimming in the surf, riding remote bike trails, and having wondrous adventures across picturesque Nantucket. And when it was time to share intimate secrets and let their girlish imaginations run free, they escaped to their magical private Moon Shell Beach. But nothing stays the same. With the complicated pressures of adulthood, their intense bond is frayed, hurtful words are exchanged, and Lexi flees Nantucket to a life of luxury while Clare stays behind. Ten years later, a newly divorced Lexi returns to make amends with those she left in her wake. Living at home with her father and dating a gorgeous carpenter, Clare still simmers with resentment toward her glamorous friend. And when Lexi opens an upscale clothing boutique next door to Clare’s chocolate shop, their paths are fated to cross.Their emotional reunion is beset with major Lexi’s return sets off a series of startling events that fracture the status quo and set the town gossips’ tongues wagging. And as Clare’s life takes an abrupt detour, Lexi wonders if the happiness and peace they once knew on Moon Shell Beach will, in the end, prove to be as fleeting as time and the tide. In the turbulent adult world, awash in failed loves and romantic disappointment, can childhood dreams still come true?Irresistible reading, Moon Shell Beach explores the evolution of a tumultuous lifelong friendship, the power of forgiveness, and the rewards of believing in miracles.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Audiobook",
    "Contemporary",
    "Womens Fiction",
    "Friendship"
  ],
  "author": "Nancy Thayer",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/8130396-moon-shell-beach"
}