{
  "title": "Stories of Your Life and Others",
  "description": "This new edition of Ted Chiang's masterful first collection, Stories of Your Life and Others, includes his first eight published stories plus the author's story notes and a cover that the author commissioned himself. Combining the precision and scientific curiosity of Kim Stanley Robinson with Lorrie Moore's cool, clear love of language and narrative intricacy, this award-winning collection offers readers the dual delights of the very, very strange and the heartbreakingly familiar.Stories of Your Life and Others presents characters who must confront sudden change—the inevitable rise of automatons or the appearance of aliens—while striving to maintain some sense of normalcy. In the amazing and much-lauded title story, a grieving mother copes with divorce and the death of her daughter by drawing on her knowledge of alien languages and non-linear memory recollection. A clever pastiche of news reports and interviews chronicles a college's initiative to \"turn off\" the human ability to recognize beauty in \"Liking What You See: A Documentary.\" With sharp intelligence and humor, Ted Chiang examines what it means to be alive in a world marked by uncertainty and constant change, and also by beauty and wonder.Ted Chiang is one of the most celebrated science fiction authors writing today and is the author of numerous short stories, including most recently \"Exhalation,\" which won the Hugo, British Science Fiction, and Locus Awards. He lives near Seattle.Contents 1 • Tower of Babylon • (1990) • novelette by Ted Chiang 29 • Understand • (1991) • novelette by Ted Chiang 71 • Division by Zero • (1991) • short story by Ted Chiang 91 • Story of Your Life • (1998) • novella by Ted Chiang 147 • Seventy-Two Letters • (2000) • novella by Ted Chiang 201 • The Evolution of Human Science • (2000) • short story by Ted Chiang (variant of Catching Crumbs from the Table) 205 • Hell Is the Absence of God • (2001) • novelette by Ted Chiang 237 • Liking What You See: A Documentary • (2002) • novelette by Ted Chiang 275 • Story Notes (Stories of Your Life and Others) • (2000) • essay by Ted Chiang",
  "genres": [
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Speculative Fiction",
    "Book Club",
    "Science Fiction Fantasy"
  ],
  "author": "Ted Chiang",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/8130318-stories-of-your-life-and-others"
}