{
  "title": "Last Gasp",
  "description": "Tributary by ErastesIt's 1936 and a generation of disaffected youth waits in the space between a war that destroyed many of their friends and family, and a war they know is bound to come. Guy Mason wanders through Italy, bored and restless for reasons he can't even name, and stops at the Hotel Vista, high in the mountains of Lombardy. There, he meets scientist James Calloway and his secretary, Louis Chambers, and it's there that the meandering stream of Guy's life changes course forever.The White Empire by Chris SmithEdgar Vaughan sincerely believes that six-thousand miles is enough to give him a fresh start. Escaping in 1838 from the drawing rooms of Belgravia and the constraints of his landed family, he takes up missionary work in the trading post of Hong Kong. On arrival, he finds the region on the cusp of war; the Chinese Emperor has outlawed the importation of opium—the key link in the trade of the East India Company. Between Edgar's sense of isolation, the sight of the puling opium addicts, and one memorable encounter with a man in a peacock waistcoat, Edgar finds himself embroiled in the very marrow of the British Empire's machinations. He finds himself torn between espousing the expeditious whilst protecting his new acquaintance, and doing what is right and risking the wrath of the British Empire.Sand by Charlie Cochrane“Safe upon solid rock the ugly houses stand: Come and see my shining palace built upon the sand.”People come to Syria for many reasons: tourism, archaeology, or because they need to leave Edwardian England to escape potential disgrace. Andrew Parks is one of those, burying past heartache and scandal among the tombs.Charles Cusiter has travelled here as well, as chaperone to a friend whose fondness for the opposite sex gets him into too much trouble at home. Out in the desert there aren’t any women to turn Bernard’s head—just the ubiquitous sand.The desert works its magic on Charles, softening his heart and drawing him towards Andrew. Not even a potentially fatal scorpion sting can overcome the power this strange land exerts.The Ninth Language by Jordan TaylorThousands of outsiders descend on Canada's Yukon Territory during the 1898 gold rush, wreaking havoc on the landscape and the indigenous people who live there. Amid the backdrop of this once pristine land, a man struggling against the destruction of his home and culture finds himself indebted to one of the men at fault. These two strangers discover solace and wholeness where they least expect it: with each other.",
  "genres": [
    "M M Romance",
    "Anthologies",
    "Historical",
    "Romance",
    "Historical Fiction",
    "LGBT",
    "Fiction"
  ],
  "author": "Erastes",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/8130039-last-gasp"
}