{
  "title": "Brain Fiction: Self-Deception and the Riddle of Confabulation",
  "description": "Some neurological patients exhibit a striking tendency to confabulate—to construct false answers to a question while genuinely believing that they are telling the truth. A stroke victim, for example, will describe in detail a conference he attended over the weekend when in fact he has not left the hospital. Normal people, too, sometimes have a tendency to confabulate; rather than admitting \"I don't know,\" some people will make up an answer or an explanation and express it with complete conviction. In Brain Fiction , William Hirstein examines confabulation and argues that its causes are not merely technical issues in neurology or cognitive science but deeply revealing about the structure of the human intellect. Hirstein describes confabulation as the failure of a normal checking or censoring process in the brain—the failure to recognize that a false answer is fantasy, not reality. Thus, he argues, the creative ability to construct a plausible-sounding response and some ability to check that response are separate in the human brain. Hirstein sees the dialectic between the creative and checking processes—\"the inner dialogue\"—as an important part of our mental life. In constructing a theory of confabulation, Hirstein integrates perspectives from different fields, including philosophy, neuroscience, and psychology to achieve a natural mix of conceptual issues usually treated by philosophers with purely empirical issues; information about the distribution of certain blood vessels in the prefrontal lobes of the brain, for example, or the behavior of split-brain patients can shed light on the classic questions of philosophy of mind, including questions about the function of consciousness. This first book-length study of confabulation breaks ground in both philosophy and cognitive science.",
  "genres": [
    "Psychology",
    "Neuroscience",
    "Science",
    "Nonfiction",
    "Brain"
  ],
  "author": "William Hirstein",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/813763.Brain_Fiction"
}