{
  "title": "Breakaway",
  "description": "A secret friends-with-benefits arrangement with the hockey coach’s daughter shouldn’t have a shot in the dark of leading to more…CooperAs a pro-bound college athlete with a good-time reputation, I usually have my pick of puck bunnies. But lately, I’ve been in a dry spell that feels more like a curse, and the stress is affecting my game—the one thing that can’t happen if I’m going to make team captain, and eventually the NHL.Enter Penny Ryder.She’s my coach’s daughter, but the moment she pulls me into that ice rink closet, she’s the one thing on my mind besides hockey. She has a sex bucket list, and each item on it confirms we’re kindred spirits in the bedroom. If I say yes, I’ll be relaxed on the ice again—but if her dad finds out, I’ll be forced to say goodbye to being captain and finally earning my own father’s approval.PennyThanks to the ex from hell, I’m a long way from being ready for a relationship—but it’s time to reclaim my agency, one long-sought-after experience in bed at a time.Enter Cooper Callahan.He’s my dad’s star defenseman; an arrangement with him will mean keeping yet another major secret from my father. But the agreement we strike is secret friends-with-benefits until he makes captain…and I cross off everything on my list, so I can finally move on from the incident that ruined both my life and my figure skating career.Yet the longer our connection goes on, the more we trust each other, and the less I want to say goodbye. I know love leads to heartbreak, but what if it can also clear the ice for a breakaway?Filled with swoons, spice coaching, sports, and book nerds in love, Breakaway is a don’t-miss adult college sports romance.",
  "genres": [
    "Sports Romance",
    "Hockey",
    "Sports",
    "College",
    "Contemporary",
    "Friends To Lovers",
    "Contemporary Romance"
  ],
  "author": "Grace Reilly",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/81341438-breakaway"
}