{
  "title": "I Lost My Love in Baghdad: A Modern War Story",
  "description": "The “wrenching” (Rachel Maddow, The Rachel Maddow Show) first book by acclaimed journalist Michael Hastings (1980-2013), whose unflinching Rolling Stone article “Runaway General” ended the military career of General Stanley A. McChrystal.At age twenty-five, Michael Hastings arrived in Baghdad to cover the war in Iraq for Newsweek. He had at his disposal a little Hemingway romanticism and all the apparatus of a twenty-first-century reporter -- cell phones, high-speed Internet access, digital video cameras, fixers, drivers, guards, translators. In startling detail, he describes the chaos, the violence, the never-ending threats of bomb and mortar attacks, the front lines that can be a half mile from the Green Zone, that can be anywhere. This is a new kind of private security companies follow their own rules or lack thereof; soldiers in combat get instant messages from their girlfriends and families; members of the Louisiana National Guard watch Katrina's decimation of their city on a TV in the barracks.   Back in New York, Hastings had fallen in love with Andi Parhamovich, a young idealist who worked for Air America. A year into their courtship, Andi followed Michael to Iraq, taking a job with the National Democratic Institute. Their war-zone romance is another window into life in Baghdad. They call each other pet names; they make plans for the future; they fight, usually because each is fearful for the other's safety; and they try to figure out how to get together, when it means putting bodyguards and drivers in jeopardy.Then Andi goes on a dangerous mission for her new employer -- a meeting at the Iraqi Islamic Party headquarters that ends in catastrophe.   Searing, unflinching, and revelatory, I Lost My Love in Baghdad is both a raw, brave, brilliantly observed account of the war and a heartbreaking story of one life lost to it.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "War",
    "Biography",
    "Politics",
    "History",
    "Journalism"
  ],
  "author": "Michael Hastings",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/8132386-i-lost-my-love-in-baghdad"
}