{
  "title": "Technomad: Global Raving Countercultures",
  "description": "A cultural history of global electronic dance music countercultures, Technomad explores the pleasurable and activist trajectories of post-rave. The book documents an emerging network of techno-tribes, exploring their pleasure principles and cultural politics. Attending to sound system culture, electro-humanitarianism, secret sonic societies, teknivals and other gatherings, intentional parties, revitalisation movements and counter-colonial interventions, Technomad investigates how the dance party has been harnessed for transgressive and progressive ends, for manifold freedoms. Seeking freedom from moral prohibitions and standards, pleasure in rebellion, refuge from sexual and gender prejudice, exile from oppression, rupturing aesthetic boundaries, re-enchanting the world, reclaiming space, fighting for \"the right to party,\" and responding to a host of critical concerns, electronic dance music cultures are multivalent sites of resistance. Drawing on extensive ethnographic, netogaphic and documentary research, Technomad details the post-rave trajectory through various local sites and global scenes, with each chapter attending to unique developments in the techno counterculture: e.g. Spiral Tribe, teknivals, psytrance, Burning Man, Reclaim the Streets, Earthdream. The book offers an original nuanced theory of resistance to assist understanding of these developments. This cultural history of hitherto uncharted territory will be of interest to students of cultural, performance, music, media, and new social movement studies, along with enthusiasts of dance culture and popular politics.REVIEWS\"Technomad: Global Raving Countercultures is the most wide-ranging and detailed of all the books on rave. More than the study of a musical movement or genre, Technomad offers an alternate history of cultural politics since the 1960s, from hippies and Acid Tests through the sound systems and 'vibe-tribes' of the 1990s and beyond.... Like Greil Marcus' Lipstick Traces, Technomad makes unexpected but entirely convincing connections between people, movements and events. Like Tom Wolfe's The Electric Koolaid Acid Test, St John's book introduces us to unknown heroes, committed geniuses and genuine revolutionaries. Beautifully written, with a genuinely international perspective on electronic dance music culture, Technomad is one of the best books on music I've read in some time.\"Professor Will Straw, Department of Art History and Communication Studies, McGill University\"A critical utopianism is articulated and celebrated with a textual energy too rare in today's cultural studies. Graham St John is wide-eyed in order to look more closely. I recommend his shining and grubby doofscape to all interested in the radical possibilities and limitations of contemporary culture.\"Professor George McKay, University of Salford\"Technomad offers important insights into the meeting points between countercultural discourses and post-rave techno cultures. Optimistic regarding the progressive potential of outdoor techno-trance gatherings, this well-documented study traces the complex genealogy of a global nomadic 'technoccult', with emphasis on Europe, North-America and Australia. Not to be missed by anyone interested in the study of rave cultures, countercultures and festivals.\"Dr Hillegonda Rietveld, Reader in Cultural Studies, London South Bank University",
  "genres": [
    "Music"
  ],
  "author": "Graham St. John",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/8139022-technomad"
}