{
  "title": "The Bedwetter: Stories of Courage, Redemption, and Pee",
  "description": "Dear  My name is Sarah Silverman. I was once primarily known for saying the word \"poop\" and getting paid above market rates for it. But those days are over, because I am now going to be known for having written a book. Why did I write a book, you might wonder? Because it just seemed like the right time to be getting into the publishing industry.  I'm kidding. Publishing is rotting like an abandoned possum carcass on the shoulder of I-95. I know that for a fact, because shortly after my book deal was announced, I kept hearing people lament the imminent demise of literature. These days there is only one reason to write a to be taken seriously. And that is exactly what is about to happen to me. I'm an author now! Like Ernest Hemingway and Fyodor Dostoevsky!  When I was asked to provide text for an author page, I decided to approach it in a scholarly manner, because that's what authors do. I looked to other author pages for inspiration, and I learned so much. For example, while Hemingway and Dostoevsky do not have their own author pages on Amazon.com, Paris Hilton does. And so does former teenage porn star and multi-tasking fellatrix, Traci Lords. Hemingway and Dostoevsky might be wondering, quite literally, \"Whom do I have to blow to get my own author page?\" If someone had a cruel sense of humor, they might respond to Hemingway, \"How about your head off? Oh wait – you already DID that!\" But such a remark would be in bad taste, and as a serious author, I'm above all that.  I also learned that Paris' dog, Tinkerbell Hilton, has her own book too. I read a few pages and found the prose to be overwrought, but you can imagine that, being a dog, she'd be coming from a place of needing to prove something. By the way, here's a quote from a review of Paris' book that I found on her Amazon.com author  \n\"Heiress, socialite, model, actress, singer and media darling Hilton loves her life, knows how to get what she wants and matter-of-factly explains how anyone can be a glamorous, fun-loving, tiara-wearing heiress just like her… [Paris’] advice to 'channel your own inner heiress, create your own image, and project an extreme sense of confidence' is an empowering message for young women.\" \n\n This was profoundly inspiring to me. It made me if young women can read Hilton's book and become heiresses, they can likewise read my book and become anxiety-ridden bedwetters. And amidst this generation of disposability that favors the digital over the physical, shopping online rather than in stores (oops, this is awkward!), and reading from LCD screens rather than from print on paper, it's nice to know that I will have left a permanent stain by which future generations shall know of my existence. So read The Bedwetter, if not for me, then for the children.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Comedy",
    "Audiobook",
    "Autobiography"
  ],
  "author": "Sarah Silverman",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/8141157-the-bedwetter"
}