{
  "title": "Ransom X",
  "description": "Martin Legace is a former special ops standout, once recognized as the top field interrogator in the American military complex. His study of the human mind was carried out in make-shift tents on the edge of the battlefield; he didn’t write or read the book on how to break a prisoner, he simply followed his instincts, dissecting human behavior in a way that verges on autism. He had a reputation for getting anything out of anyone – “had” being the operative word. Five years ago, a random crime shattered Legace’s world. Withdrawing inside himself, he built his life around the only family he had left, his teenage daughter. He withdrew from operations, and took the most isolated post he could, in the basement of the Alexandria FBI, working the archives. Legace brought consequence to the job. His tactics of getting inside the minds of criminals led to a controversial new form of investigation that came to be known as– shadow projection. It was a term coined by his insufferable regional director, Bailey, and Legace couldn’t begin to count the ways he hated the simplification of his process. Legace threw the deductive model out the window. He didn’t follow the trail of the criminal; he took on criminals who were smart enough to leave no trail. They were fixed objects like sundials casting a unique shadow for every incremental step in their journey. His methods involved knowing the inner workings of the criminal, and projecting forward to the next activity that such a person would engage in. His life was verging on stable when a young female agent from Washington walked into his office with an opportunity, an obligation and a threat. Now, normally Legace would have ignored all three, but there was something about the case and the victim that struck a very personal chord in him. All of his powers were going to be needed for a case that landed on his desk along the agent who now called herself his new partner. There was an abduction ring that was preying upon young women of marginal fame, using them in adult films and ransoming them for the price of pornography. The profit engine became a fad among perverts (the largest single unified economic bloc) and the income was staggering. This great influx of capital precipitated a bold move by the abductors. Their newest acquisition was the daughter of an old friend, the Director of the FBI. All hell was breaking loose over the Web and the world, and with a two-week window to find his quarry, Legace knew that his performance on this case would either cement his reputation as borderline charlatan with blood on his hands, or announce his reinstatement as borderline hero with all of the official responsibilities that entails, and he couldn’t actually say which outcome he feared more.",
  "genres": [
    "Fiction",
    "Mystery Thriller",
    "Mystery",
    "Thriller",
    "Suspense",
    "Crime",
    "Action"
  ],
  "author": "I.B. Holder",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/8141221-ransom-x"
}