{
  "title": "Quiches, Kugels, and Couscous: My Search for Jewish Cooking in France: A Cookbook",
  "description": "What is Jewish cooking in France?That is the question that has haunted Joan Nathan over the years and driven her to unearth the secrets of this hidden cuisine. Now she gives us the fruits of her quest in this extraordinary book, a treasure trove of delectable kosher recipes and the often moving stories behind them, interlaced with the tumultuous two-thousand-year history of the Jewish presence in France.In her search, Nathan takes us into kitchens in Paris, Alsace, and the Loire Valley; she visits the bustling Belleville market in Little Tunis in Paris; she breaks bread around the observation of the Sabbath and the celebration of special holidays. All across France she finds that Jewish cooking is more alive than ever. Traditional dishes are honored, yet many have acquired a French finesse and reflect regional differences. The influx of Jewish immigrants from North Africa following Algerian independence has brought exciting new flavors and techniques that have infiltrated contemporary French cooking, and the Sephardic influence is more pronounced throughout France today.Now, with Joan Nathan guiding us, carefully translating her discoveries to our own home kitchens, we can enjoy:• appetizers such as the rich subtle delight of a Terrine de Poireaux from Alsace or a brik , that flaky little pastry from North Africa, folded over a filling of tuna and cilantro;• soups such as cold sorrel or Moroccan Provençal Fish Soup with garlicky Rouille ;• salads include a Mediterranean Artichoke and Orange Salad with Saffron Mint and a Tunisian Winter Squash Salad with Coriander and Harissa ;• a variety of breads, quiches, and kugels—try a Brioche for Rosh Hashanah, a baconless quiche Lorraine, or a Sabbath kugel based on a centuries-old recipe;• main courses of Choucroute de Poisson ; a tagine with chicken and quince; Brisket with Ginger, Orange Peel, and Tomato; Southwestern Cassoulet with Duck and Lamb; Tongue with Capers and Cornichons; and Almondeguilles (Algerian meatballs);• an inviting array of grains, pulses, couscous, rice, and unusual vegetable dishes, from an eggplant gratin to a mélange of Chestnuts, Onions, and Prunes;• for a grand finale, there are Parisian flans and tarts, a Frozen Soufflé Rothschild, and a Hanukkah Apple Cake, as well as many other irresistible pastries and cookies.These are but some of the treasures that Joan Nathan gives us in this unique collection of recipes and their stories. In weaving them together, she has created a book that is a testament to the Jewish people, who, despite waves of persecution, are an integral part of France today, contributing to the glory of its cuisine.",
  "genres": [
    "Cookbooks",
    "Food",
    "Cooking",
    "Jewish",
    "France"
  ],
  "author": "Joan Nathan",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/8140106-quiches-kugels-and-couscous"
}