{
  "title": "حياة مستقرة",
  "description": "حياة مستقرة \" ( عام 2004) هي الرواية الثالثة لعادل عصمت بعد \" الرجل العاري \" ، و \" هاجس موت \" . وقد تخير الكاتب عنوان \" حياة مستقرة \" ليكشف لنا عن أن ما هو مستقر من السطح موار بالتغيرات العميقة في باطنه ، كما أن سطح التفاصيل الكثيرة الصغيرة التي لا تشتمل على أحداث عنيفة تخفي هي الأخرى حياة \" غير مستقرة \" . لا شيء مستقر في هذه الرواية سوى البيت الذي تربي فيه الراوي مع أخيه حسام وأخته نورا ، لكن حتى ذلك البيت يباع في نهاية العمل بين دموع نورا التي تواريها في صمت. الرواية التي يقدمها الكاتب على لسان الراوي تقع في ثلاثة فصول\" صورة أخي \" و\" بدروم دار الكتب \" ثم \" البيت \" . الأحداث في الرواية – التي يفترض أن تقوم بدور المفجر للشخصيات والأفكار والصراع - قليلة ، بل معدودة وهي أشبه بصدى مكتوم بعيد لصوت لم نسمعه . وربما كانت الأحداث الأهم هي عودة الأخ حسام من حرب 1991 على العراق ، وبيع البيت بكل ما يرمز إليه البيت في المجتمع المصري . شخصيات العمل أيضا قليلة ، ويضم شخصيتين رئيسيتين : الراوي وحياته ، وأخاه حسام ، ما عدا ذلك هناك شخصيات ثانوية كالأم ، والأخت ، وماجدة ، والأستاذ توحيد ، وشخصيات من ذاكرة الرواي مثل حبيبته من أيام الجامعة \" علياء \". ومنذ البداية تحط علينا الظلال الثقيلة القاتمة لشخصية حسام الجندي العائد من حرب شكلت مصيره إلي حد كبير بعد أن لمس هناك أن\" الجنود المصريين كانوا أرخص جنود\" ثم كيف أجبره قائد الكتيبة على جمع أشلاء زميله وصديقه الذي راح ضحية لغم، ويتذكر حسام ذلك المشهد قائلا : \" كنت بالم أشلاء صاحبي ، كل ما ألمها تقع مني ، وتطلع مرة تانية. ارفع إيده من على الأرض ، تكون معايا على دراعي ، أبص ألقاها مغروسة في الرمل ونصفها مفرود قدامي \" ، ويحتفظ حسام من الحرب ب \" بيادة \" أي حذاء ميري يظل شاهدا حيا على استغراقه في ذكرياتها ، وتبدله حتى أنه يرفض الزواج ، والبحث عن عمل ، وفي النهاية يسرق ما ادخرته أمه لكفنها ، ثم يسجن لتعاطيه الحشيش ، وحينما تسد أمامه كل الأبواب يفكر في بيع البيت الذي جمعه بأخوته ووالديه . هكذا نجد أنفسنا أمام شخصية حطمتها الحرب ، وأفقدتها كل مقاومة شخصية للواقع المحيط بها . أما الراوي ، الأخ الأكبر ، فإنه نموذج لإحباط من نوع آخر ، إذ لم يتمكن من تحقيق أحلامه في أن يصبح معيدا ، وحين قرر السفر للخارج إلي \" العالم الواسع \" يموت والده ، فيبقى راضخا يقول لنفسه : \" وبدا لي من ذلك الوقت أنني خسرت كل شيء . في أعماقي كانت حريتي مقرونة بأن أنفذ حلمي ، ولكوني لم أستطع تنفيذه ، فما كان على سوى الرضوخ \" ( الرواية ص 16 ) . هكذا يبقى الراوي ويعمل موظفا في دار كتب المدينة صباحا، وفي صيدلية مساء ، يجتر غير فشله قصة حب من شبابه مع علياء التي افتض بكارتها ثم لم تكفه شجاعته للزواج منها ، واكتفي بالقاء اللوم عليها . وإذا كانت الحرب قد جردت \" حسام \" من قدراته على مجابهة الحياة ، فإن الواقع لسبب ما جرد \" الراوي \" من تلك القدرة لكن من دون حرب ، حتى أصبح الراوي كما يصف نفسه : \" غير قادر على تأمل مشاكل أخي ولا التعاطف معه ، ولا حتى التعاطف مع أمي \" ، الأكثر من ذلك أن الراوي حين يتزوج وينجب يقول عن طفله الأول : \" تذكرت اللحظة التي حملت فيها طفلي بين يدي ، تلك القطعة من اللحم التي لم أشعر تجاهها بغير الغربة \" . إننا إزاء شخص قتل الواقع في قلبه كل حماسة أو تعاطف أو حب لمن حوله ، فلا أمه ، ولا أخوه ، ولا إبنه ، بقادر على إحياء مشاعره ، وحتى حبه القديم لعلياء الذي يتجدد في صورة ماجدة ، يظل مجرد طيف باهت .ما بين الراوي ، وأخيه حسام ، تطل علينا شخصيات ثانوية مثل ماجدة التي كانت تعمل معيدة ثم تركت الجامعة لتلتحق موظفة بمكتبة لفشل في علاقة حب مع أحد زملائها . ويطارد الفشل والعجز حتى الشخصيات الثانوية مثل ماجدة التي يعاقبها الوسط الاجتماعي أدبيا حين تخلع الحجاب ، وينتهي بها الأمر للقبول بزوج عاجز عضويا ، فيصبح همها الوحيد التفكير في إنجاب طفل من أي شخص .هكذا نجد أنفسنا في مواجهة ثلاث شخصيات محبطة ، بفعل الحرب ، وبفعل الواقع، وبفعل عوامل ذاتية أيضا . ويحاول الكاتب في الخلفية تقديم ظلال لأسباب الاحباط العام حين يستدعي ذكرى حرب 67 ، و73 في شخص الأستاذ توحيد مدير المكتبة، ثم حرب 1991 ، وتنامي التيار الديني الرجعي ، والنظرة المتخلفة للمرأة ، لكن الصلة الفنية بين تلك الأسباب أو غيرها وبين \" إحباط \" الشخصيات تكاد تكون معدومة باستثناء حالة \" حسام \" ، أما الراوي على سبيل المثال فلم يكن ثمة ما يمنعه من إبداء أي قدر من المقاومة للواقع المحيط به ، مثله في ذلك مثل ماجدة ، أو علياء أو سميح الطالب الذي فشل في كلية الهندسة . إن فشل تلك الشخصيات في تحقيق أحلامها بحياة \" مستقرة \" لا يعود بالحتم إلي أسباب اجتماعية ، وهو ليس فشلا مقدرا على تلك الشخصيات التي كان بوسع بعضها أن يتخذ لنفسه وجهة أخرى . في \" حياة مستقرة \" نجد أنفسنا أمام معزوفة تعددت فيها الآلات لكنها تعزف اللحن ذاته : الاحباط والفشل ، دون لحن آخر معارض ، يتفاعل مع اللحن الأساسي بنغمة أخرى . إلي أي مدى كان الكاتب موفقا فنيا في خلق تلك الشخصيات خلقا حيا مقنعا للقارئ ؟ سؤال نتركه للقارئ وهو يستمتع بقراءة رواية \" حياة مستقرة \"",
  "genres": [],
  "author": "عادل عصمت",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/8138798"
}