{
  "title": "Lancelot's Lady",
  "description": "A Bahamas holiday from dying billionaire JT Lance, a man with a dark secret, leads palliative nurse Rhianna McLeod to Jonathan, a man with his own troubled past, and Rhianna finds herself drawn to the handsome recluse, while unbeknownst to her, someone with a horrific plan is hunting her down.* * * When palliative care nurse Rhianna McLeod is given a gift of a dream holiday to the Bahamas from her dying patient, billionaire JT Lance, she has no idea that her 'holiday' will include being stranded on a private island with Jonathan, an irritating but irresistibly handsome recluse. Or that she'll fall head over heels for the man.Jonathan isn't happy to discover a drop-dead gorgeous redhead has invaded his island. But his anger soon turns to attraction. After one failed marriage, he has guarded his heart, but Rhianna's sudden appearance makes him yearn to throw caution to the wind.To live fully in the present, Rhianna must resolve her own murky past, unravel the secret that haunts JT, foil the plans of a sleazy, blackmailing private investigator and help Jonathan find his muse. Only then can Rhianna find the love she's been searching for, and finally become...Lancelot's Lady.By bestselling author Cheryl Kaye Tardif, writing as Cherish D'Angelo*Winner of the 2010 Textnovel Editor's Choice Award. 2009 Semi-finalist in the Dorchester Publishing \"Next Best Celler\" contest, hosted by Textnovel. Voted #1 Most Popular for first 3 months of contest; #3 Most Popular for last 2 months.“From the cold rocky shores of Maine to the extravagant mansions of Miami to a lush tropical island in the Bahamas, Cherish D'Angelo takes her heroine through a series of breathtaking romantic adventures that mirror the settings, often in surprisingly ironic ways. A page turner in the best possible sense.” ―Gail Bowen, author of the award-winning Joanne Kilbourn series“Romance, mystery, danger, black-mail, and twists and surprises, this tale contains them all… Despicable intentions threaten every character in this finely crafted tale of sweet tension…Lancelot’s Lady is a non-stop adventure combined with the agonizing struggle to not give in to the magnetism between them. Enticing. Fun.” ―Midwest Book Review“Cherish D'Angelo has got that mythical “voice” down to a fine art.” ―Jennifer L. Hart, author of River Rats“Lancelot's Lady is riveting. It holds on and won't let you go! Cherish D’Angelo’s descriptive powers are amazing. She summons up scenes like genies from bottles!” ―Susan J. McLeod, author of Soul and Shadow\"Tardif, already a big hit in Canada...a name to reckon with south of the border.\" ―BOOKLIST",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Suspense",
    "Romantic Suspense",
    "Fiction"
  ],
  "author": "Cherish D'Angelo",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/8138867-lancelot-s-lady"
}