{
  "title": "Bad Girl",
  "description": "Before the events of Blake Crouch’s horror novels DESERT PLACES and LOCKED DOORS...Before the events of Jack Kilborn's and Blake Crouch's #1 Amazon Kindle bestseller SERIAL...The year is 1995, and a young girl with psychopathic tendencies named Lucy (the sweetheart from SERIAL) has run away from home to a mystery convention to see her favorite author in the Andrew Z. Thomas.But Lucy has problems, and not just the psychopathic kind…to start with, the hotel won’t rent a room to a 15-year-old girl. So she does a bad, bad thing, which only gets worse when a couple of horrifying killers, Orson Thomas, and his protégé, Luther Kite, catch her trying to cover up a nasty mess.BAD GIRL is a thriller novella that brings all of Crouch’s most terrifying villains to the same hotel.A prequel to SERIAL, which has been downloaded more than 200,000 times, BAD GIRL is not for the faint of heart. Let the reader beware.BAD GIRL also contains a bonus interview with Blake, plus excerpts from all four of his novels.* BAD GIRL is fully contained in SERIAL UNCUT. BAD GIRL + TRUCK STOP + SERIAL = SERIAL UNCUT.About the BLAKE CROUCH was born near the piedmont town of Statesville, North Carolina in 1978. He attended the University of North Carolina at Chapel Hill and graduated in 2000 with degrees in English and Creative Writing. Blake is the author of four novels and numerous short stories. He lives with his family in southwest Colorado, where he is at work on a new book.Praise for Blake Crouch’s ABANDON would make an excellent movie, switching back and forth between the plain-but-sturdy homes, saloon and church in 1893 and the same structures rotting to dust in 2009...a clever dual story.CHARLOTTE OBSERVERABANDON [is] two separate works of past and present seamlessly melded together into a single novel that demands to be read in one sitting, so you can better appreciate the beauty of Crouch’s storytelling…[O]ne of those books that almost instantly puts you in the mind of a classic.BOOKREPORTERHaunting, fast-paced, and thoroughly engrossing... ABANDON is one of the most original tales of ghosts, greed and gold I've come across. Crouch aligns both eras so perfectly, it's as if the characters are occupying the same breath within the space/time continuum. ABANDON will be one of the most talked-about books of the summer.THE MADISON COUNTY HERALDAmbitious…the palpable suspense just keeps building, and many thriller fans—especially those who like a touch of horror—will lose sleep to find out how it all ends.BOOKLISTABANDON is terrific…a great storyteller hitting his stride.LEE CHILD",
  "genres": [
    "Horror",
    "Thriller",
    "Fiction",
    "Short Stories",
    "Mystery Thriller",
    "Novella",
    "Crime"
  ],
  "author": "Blake Crouch",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/8141084-bad-girl"
}