{
  "title": "It's Not About Me",
  "description": "Annie has it all. She’s attractive, graduated with honors, was accepted at the college of her choice, has supportive parents, good friends, and a steady boyfriend who loves her. The focus of her life is to please everyone and not make any waves. Her reputation means everything to her.But one night Annie’s safe world is shattered. As she fights to put the pieces of her broken life back together, against her will she is caught in a war between two brothers, both of whom claim to have her best interests at heart.Who will Annie choose? And will she finally come to know the One whose love will never fail, even in her darkest hour? Will she learn the truth about life— that it’s not about “me\"?Endorsements“I couldn’t turn the pages fast enough! Gritty and about as real life (unfortunately!) as Christian fiction can get.” —Barb Huff, author of the ON TOUR series and co-author of the upcoming Girlfriend Codes Series.“Reading Michelle Sutton’s work is almost like an out-of-body experience. From the very first page, I was swept into the world of her heroine, destined for an emotional tidal wave over the plight of a character who was so natural, so real that I felt as if she were flesh and blood. Characterization this finely crafted truly transports a reader out of their world into another, where a heart-wrenching plot laced with spiritual truths grabs you by the throat and refuses to let go.” —Julie Lessman, author of A Passion Most Pure“Instead of dealing with timely issues like alcoholism, premarital sex and pornography in a preachy, oh-so-tired fashion, Michelle Sutton’s It’s Not About Me gets to the heart of the matter with a shocking dose of realism and poignant storytelling. From the first paragraph, Sutton weaves together a thoroughly entertaining story that’ll keep readers intrigued for the long haul as they get to know Annie, Dan, Tony, and Susie—young adults who probably don’t look and sound all that different from themselves. Now that’s a seriously refreshing turn for Christian fiction!” —Christa Ann Banister, author of Around the World in 80 Dates\"Michelle Sutton’s It’s Not About Me tackles many temptation, deception, forgiveness, and trust, to name a few. The story is most strong when its players are weak. Readers will identify with Annie, Dan, Tony, and maybe even Susie, because these characters struggle—as we all do—with very human failings. You can’t read Annie’s story without renewing your appreciation for our powerful and loving God.\" —Trish Perry, author of Beach Dreams\"It’s Not About Me is a must read for every young adult in today’s world, boy or girl. Not only does it explore in depth the intense sexual pressures placed upon today’s youth, but also the serious effects of alcoholism and rape. More importantly, it addresses issues of true faith and Christianity which cut at the core of our beliefs, issues such as what does it really mean to follow Jesus? Does going to church or even being a pastor’s son make you a Christian? As you follow the lives and the ardurous love triangle of three young adults, Annie, Tony, and Dan, you’ll not only fall in love with them, you’ll cry with them, yearn along side them and weep for their heartaches and struggles. Kudos to Michelle Sutton for addressing such timely topics with such finesse.\" —MaryLu Tyndall, Christy Award Finalist\"It’s Not About Me is a wonderfully entertaining and deliciously suspenseful read that will keep you turning the pages. Sutton doesn’t back away from the drama and with all of the twists and turns.",
  "genres": [
    "Young Adult",
    "Christian Fiction",
    "Christian",
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Michelle Sutton",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/8140248-it-s-not-about-me"
}