{
  "title": "الأعمال الشعرية",
  "description": "تأتي أهمية نشر الأعمال الشعرية لوديع سعادة (دار النهضة العربية) لسببين: الأول شكلي كون الشاعر نشر خمس مجموعات شعرية من أصل عشر مجموعات له بإصدار خاص، وبالتالي فإن هذه المجموعات غير متوافرة للقارئ ولا سيما مجموعته الأولى الريادية والمؤسِّسة 'ليس للمساء أخوة'. السبب الآخر هو موقع وديع سعادة في الشعر اللبناني، وهو موقع- في رأيي- لم يتمَّ التعاطي معه بالشكل الذي يليق به ويدلُّ عليه.أحسب أن وديع سعادة من أفضل الشعراء اللبنانيين ليس في جيله فحسب وإنما في الأجيال التي سبقته وتلته. من جهة هو وارث الشعر اللبناني الذي تقدّمه من نتاج شعراء المهجر إلى نتاج الحداثيين، شعراء قصيدة النثر. وراثة ذهب بها الشاعر إلى محل آخر وحساسية أخرى ولغة أخرى وموضوعات مغايرة تقريباً. قاموس سعادة هو قاموس المهجريين من ثلج وجبال وهضاب ومطر وغيم وأرض وسماء وشجر، أي كل ما بدا للمهجريين من عناصر الريف اللبناني مادة جمالية في القصيدة بعدما أضافوا إليها العاطفة. وهذه الأخيرة مفردة تجمع الحنين والتذكر والغناء في هذا المقصد. أخذ سعادة هذا المعجم بشكل مغاير ومتفاوت ما بين مجموعة وأخرى سآتي عليها لاحقاً. إلى قاموس المهجريين، عرف سعادة كيف يرث قصيدة النثر، ذلك الشكل الطازج آنذاك (أولى قصائده في مجموعة 'ليس للمساء أخوة' كتبها عام 1968)، ويأخذها أعمق إلى النثر من غير أن يتخلى عن غنائية هادئة ومنضبطة ليس في إيقاع الجملة بل في معنى عبارته الشعرية. من جهة أخرى، يبدو وديع سعادة شاعراً لم ينجُ منه أحد. هذه عبارة مخصوصة بلاحقيه من شعراء الثمانينات. لقد أثر وديع سعادة بجيل شعري كامل. معظم جيل الثمانينات أخذ جملة وديع، على الأقل في المجموعة الأولى لشعراء هذا الجيل: 'غيوم طويلة إنني أتذكر' لفادي أبو خليل، 'قصائد المنزل' لجوزيف عيساوي، 'المرقط' ليوسف بزي، 'المزغرد' لعلي مطر، 'أعتقد أنني سكران' لشبيب الأمين. بالطبع ليست هذه المجموعات تقليداً لوديع سعادة، لكن أثراً ما، قاموساً ما، تقنية المخيلة، طريقة الصدور إلى القصيدة، التقطيع، ملامح نجدها لدى سعادة كرائد في القصيدة اليومية ولا سيما في كتابين كُتبا في الحرب، بلغة الحرب، وتركا أثراً في جيل الثمانينات، جيل الحرب كما يُعرف هنا: 'رجل في هواء مستعمل يقعد ويفكر في الحيوانات' و'مقعد راكب غادر الباص'. في كل حال، لدي اعتقاد أن وديع سعادة كان له أثر في مجايليه أيضاً، في بعض شعراء السبعينات المكرّسين الذين انتقلوا من الإنشاد إلى القصيدة اليومية. وعليه، يبدو من نافل القول إن أثر وديع الذي أظنه وأتحسسه، لا يلغي خصوصية هؤلاء الشعراء الذين أسس كلٌّ منهم نصه الخاص، تحديداً في الكتب اللاحقة لإصداراتهم الأولى.ريادتان بين جيلين 'ليس للمساء أخوة' المجموعة الأولى لوديع سعادة. هذه المجموعة نشرها الشاعر بخط اليد ووزّعها باليد أوائل 1973. عام 1981 أعاد نشرها عن 'المؤسسة الجامعية للدراسات والنشر والتوزيع'. شكلت هذه المجموعة نقلة في الشعر اللبناني. لنقل إنها شكلت بداية الحداثة الثانية، إذ أسست لجيل السبعينات في قصيدة النثر، الجيل الذي ورث قصيدة النثر عن الروّاد وافترق بها. يمكننا هنا أن نسمّي ثلاثة نماذج من لبنان كمثال غير حصري لهذه القصيدة وهم إلى وديع، بول شاوول وعباس بيضون الذي تأخر عنهما في النشر حتى سنة 1985، في حين نشر شاوول مجموعته الأولى 'أيها الطاعن في الموت في الموت' سنة 1974. في 'ليس للمساء أخوة' نلمس أولى النصوص التي تتقاطع مع تجربة شعراء الستينات في لبنان، لكنها تقطع معهم: ليس في هذه النصوص أسطورية أدونيس ومثاقفته للقصيدة، ليس فيها هذيان أنسي الحاج ولعبه اللغوي، ليس فيها تراجيدية محمد الماغوط وبطولته المسحوقة، ليس فيها رواقية فؤاد رفقة. إنها نصوص واضحة، صريحة، نظيفة، ومع ذلك مباغتة بتلك المخيلة المروّسة. 'ليس للمساء أخوة' مجموعة ريف بلغة مدينية. لكنَّ هذه الجملة الشفيفة، البسيطة والمتقنة والمفاجئة، لا تلبث أن تتبدّل بشكل مغاير تماماً في المجموعة الثانية 'المياه المياه' (إصدار خاص 1983). نشيد طويل جرّب فيه سعادة التجريد (تم اختصار هذا الكتاب كثيراً في هذه الأعمال الشعرية). على الأرجح أن تأثيرات سان جون بيرس بيّنة في هذه المجموعة: الإنشاد، الغموض، التجريب اللغوي. ثلاثة عناصر غريبة على مشروع سعادة كما سيبدو من مجمل نتاجه، الأحرى من مكامن القوة في هذا النتاج.'رجل في هواء مستعمل يقعد ويفكر في الحيوانات' (إصدار خاص 1985). كتاب تأسيسي آخر لوديع سعادة. في هذا الكتاب ذهب سعادة بعيداً في القصيدة اليومية، تخلى عن الريف مؤقتاً، دخل أكثر في المدينة موضوعاً ولغة. هنا نضجت جملته النزقة، جملته المتوترة، جملته العصبية. الأرجح أن الحرب أخذت الشاعر إلى لغتها، إلى مخيلتها العنيفة. وعليه، كان هذا الكتاب مقدمة لجيل كتبَ وسيكتب معه وبعده، سُمّي لاحقاً 'جيل الحرب'. ولم يتوقف مشروع الشاعر عند هذا الكتاب، إذ ألحقه بكتاب لافت شكل علامة في نتاجه: 'مقعد راكب غادر الباص' (إصدار خاص 1987). هذا الكتاب استكمال لمجموعة 'رجل في هواء مستعمل...' طرحاً ولغة. لاحقاً سيذكر الشعراء وديع سعادة بثلاثة كتب أساسية في المشهد الشعري اللبناني: 'ليس للمساء أخوة'، 'رجل في هواء مستعمل...' و 'مقعد راكب غادر الباص'. هنا أستعير القصيدة الأولى بعنوان 'حياة' من المجموعة الأخيرة للتدليل على لغة سعادة التي باتت أكثر يومية، أكثر راهنية، أكثر تقشفاً، وأكثر قرباً من الشعر الأميركي بعدما تأثر غالبية الشعراء اللبنانيين الذين سبقوه بالشعر الأوروبي، ولا سيما الفرنسي (سعيد عقل، الياس أبو شبكة، أنسي الحاج، أدونيس باعتباره ابن المختبر اللبناني مع الماغوط وفؤاد رفقة ويوسف الخال وهؤلاء جميعاً سوريون في الأصل، وللدقة فإن رفقة تأثر بالشعر الألماني في حين انفرد الماغوط بقصيدة نثر عربية منحت قصيدة النثر العربية مشروعية بسبب عدم تغربها في زمن كان التغريب في الثقافة تهمة ونقيصة على خلفية المد القومي الصاعد آنذاك): 'تمتد إليَّ يدها/ باحثة في أحشائي/ عن مدينة/ وأنا ولد أرعن/ راكبٌ دراجة/ يهرّب زنزاناته في الليل/ يمشي مخموراً/ حاملاً رجلاً مجنوناً منذ الصباح على ذراعه/ ذاهباً نحو مصحّ/ محتفظاً من كل ماضيه بـ: أحشاء/ ومفتاح/ لا يجد له بيتاً،/ الرحلة وضعته هنا/ لينظر إلى الشجر/ ولتسقط منها ورقتان/ على كتفه'.بعد خمس سنوات نشر سعادة مجموعته 'بسبب غيمة على الأرجح' (دار الجديد 1992). في هذا الكتاب عاد الشاعر إلى مناخات 'ليس للمساء أخوة'. ذهب النص المديني النزق، لكن التبرّم والاستياء والغضب ظلت ملازمة لنصه. العودة كانت في استلهام مناطق الطفولة الريفية، في نبش دفاتر العائلة. إذا كان كتابا 'رجل في هواء مستعمل...' و'مقعد راكب غادر الباص' كتابي حاضر، فإن 'بسبب غيمة على الأرجح' كان كتاب تذكر. إنه كتاب يتكئ بكل ثقله على ماض بعيد. انعطافة وديع سعادة هذه راكمت تجربته الأولى من جهة، لكنها أضافت إليها من جهة أخرى. في هذه المجموعة اختبر سعادة بشكل أعمق قصيدة النثر. بالطبع لا تعني لفظة أعمق هنــا أكثر من الدلالة إلى شكل النثر الذي وسم المجموعة. لقد أسال سعادة جـــــــملته، أذابها بالحكي، بالكلام العـــــادي المتدفق. نحن أمام سيرة شــعرية تستثمر النثر إلى حدود قصوى. بمعنى إضافي، جعل سعادة النثر مكان النزق، والحكي مكان التوتر. استراحة كتابين في 'محاولة وصل ضفتين بصوت' (دار النهار للنشر 1997) كتب سعادة نصاً مزيجاً من السيولة والتقشف. بدا الموت فكرة الكتاب الأساسية. الذكرى والغياب والنسيان والصمت والعزلة ملحقات تدور في حقل الموت. هذا الكتاب الذي هو مزيج من سيرة شخص وعائلة وبلاد ومزيج من التأمل، يشكل حلقة وصل بين مشروع سعادة الذي اكتمل وبين كتابين سيصدران لاحقاً بنبرة مغايرة ولغة مغايرة وموضوع مغاير. هذان الكتابان هما 'نص الغياب' (دار المسار للنشر والأبحاث والتوثيق 1999) و'غبار' (الدار نفسها 2001). كتابان أخذ فيهما التأمل مأخذاً بالغ الجدية. هذا التأمل (أو التفكر) بصيغته المباشرة بدا غريباً على مشروع وديع سعادة. تأملات الشاعر السابقة حدثت بشكل عرضي، بشكل موارب. ما كان تحت السطح طفا فجأة ليحتل القصيدة. لقد احتل التأمل قصيدة سعادة في 'نص الغياب' و'غبار'. أحسب أن هذين الكتابين كانا استراحة لم يلبث أن خرج الشاعر منها لكن إلى أرضه الأليفة السابقة.عاد وديع سعادة في 'رتق الهواء' (دار النهار للنشر 2006) إلى أجوائه الأولى. في هذا الكتاب وديع سعادة يستعيد نفسه: مخيلة مسننة، دهاء في التركيب، بنية تعرف كيف تمهّد للمعنى وكيف تقطفه. الأمر نفسه فعله الشاعر في 'تركيب آخر لحياة وديع سعادة' (نشر على الأنترنت 2006) الذي سبق أن كتبت عنه هنا وقت صدوره. كتاب يذكر بالمجموعة الأولى: 'ليس للمساء أخوة'.صحيح أن ثمة اعتزالاً يخيم على هذه المجمـــــوعة، لكنه اعتزال ليس فيه زهد بقدر ما فيه ذلــك التبرّم والضيق اللذان لطالما ربّاهما الشاعر على مدار أربعين سنة من الكتابة.'الأعمال الشعرية' لوديع ســـــعادة تتــيح للقارئ الذي لم يستطع الحصول على كتب الشاعر أن يرى إلى هذه المسيرة بخطها البياني. مسيرة فيها فجوات وانقطاعات، لكن ما يميّزها تلك العودات (من عودة) إلى مشروع بدا واحداً في مجمله وإن تفرّع هنا وهناك على تلك الدرب الطويلة. يحق لوديع سعادة أن يكون له كتاب يجمع 'إصداراته الخاصة'، مثلما يحق للقارئ أن يستمـــــتع بهذا الأرشيف المفقود والمستعاد الآن لشاعر لم يكتب طوال حياته بيـــــاناً واحداً وإن كان نصه الشعري يفوق البيـــــانات ويتفوق عليها.--- القدس العربي",
  "genres": [
    "Poetry"
  ],
  "author": "وديع سعادة",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/8138906"
}