{
  "title": "A Christmas Odyssey",
  "description": "In her beloved Christmas novels, Anne Perry brings readers both the authentic Victorian charm and the nail-biting suspense that have made her Thomas Pitt and William Monk tales bestsellers for a generation. Though rife with intrigue, these special seasonal stories beam with the blessed light of the holiday.  Ten days before Christmas, as an icy wind cuts through London, wealthy James Wentworth feels not joy but grief. His reckless son, Lucien, has been lured into a deadly world of drugs and wild passion. Wentworth's only hope, he believes, is his old friend Henry Rathbone, who volunteers to search for the prodigal son. Rathbone knows nothing of the sensation-obsessed underworld where Lucien now dwells, but he acquires two unexpected new companions who do: Squeaky Robinson, a reformed brothel-keeper who now works in Hester Monk's medical clinic, and Crow, a mysterious slum doctor who turns no one away, however undeserving.  Slowly this odd trio gathers clues--about Lucien's mad infatuation with a beautiful woman named Sadie, and about Shadwell, the ruthless man who owns her and, like the Devil, never lets go of one of his own. Rathbone, Squeaky, and Crow even welcome into their little band a most valuable recruit: young Bessie, a teenager whose courage holds fast even in the depths of the slum. And so they set forth on their odyssey into London's dark streets, on a mission whose outcome they cannot begin to guess. Anne Perry's novels are supreme masterpieces of suspense, and \"A Christmas Odyssey\" ranks with the very best. The days leading up to Christmas may prove to be fraught with challenges, but 'tis the season for comfort and joy and miracles.",
  "genres": [
    "Christmas",
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical Mystery",
    "Holiday",
    "Audiobook"
  ],
  "author": "Anne Perry",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/8145257-a-christmas-odyssey"
}