{
  "title": "James Madison The Nationalist 1780-1787",
  "description": "This volume carries forward the monumental work of Irving Brant's definitive biography of James Madison. Seven years have passed since the publication of the first volume⁠—years devoted to exhaustive research⁠—and the result is a burst of new light on the Father of the Constitution and on the formation of the nation.Materials unknown to previous biographers give readers of this book the zest of rich discovery. Events dimly recorded in history, and commonly misunderstood, here take meaning. The American Revolution is seen through the mind and heart of one of ts most ardent patriots.Madison emerges as the master strategist of the Continental Congress during four years of vital service, stiffening the Revolution in a period of transition, foiling the enemies of the alliance with France, guiding American diplomacy, fighting the terrible reality of monetary inflation, battling day and night against those who put state above nation, private profit above public welfare, or who let their public policies be ruled by envy or ambition.He emerges also as a great Virginian who did not hesitate to defy his own state government when he was in Congress, and who re-entered the legislature to wage continuous battle with Patrick Henry and his state-minded, tax-resisting followers. All through the book runs the Madison theme—preserve and strengthen the federal government, maintain national dignity before the world, hold fast to the republican form of government, be faithful to every pledge and honest in every public and private art.This volume carries Madison's career to the very moment of the writing of the Constitution of 1787. Every chapter throws light on the American charter of government with which he was so intimately connected. Here is revealed a Madison so nationalistic in his attitude, so hostile to state sovereignty, yet so much in accord with the dominant thought of other great leaders of the time, that there must be a reappraisal of a great part of what has been previously written, From this surprising Madison, during the period 1780-1787, came— A sweeping doctrine of implied powers even under the Articles of Confederation A constant call to curb the states Fiscal policies later adopted by Hamilton The Washington-Jefferson doctrine of no entangling alliances The congressional system of logrolling.Only twenty-nine when he entered Congress, Madison looked and acted younger than his years—\"just from the college,\" one colleague said of him. His personality has never shone forth from the pages of history so clearly as Hamilton's or Jefferson's. Mr, Brant lays this partly to his self-effacing modesty, which led him to deal with his own activities as if they were the work of other men. But partly it is because :blue-penciling editors have done quite well in robbing him of everything but a disembodied brain.\" The restoration of a word, a phrase, or a paragraph, omitted from published letters, puts conflict and passion into them. Never seeking anything for himself, and engaging in no personal quarrels, Madison was a constant storm center in Congress, defending Diplomat Benjamin Franklin and Financier Robert Morris against bitter enemies, thwarting the powerful Lee brothers of Virginia. Out of all this a fairer, more human and more accurate picture of the man arises.Madison was generally aloof in the company of women, but during his service in the Continental Congress he fell in love with and became engaged to a fifteen-year-old girl. Penetrating, for the first time, a numerical cypher scratched out by Madison in his old age, this volume reveals the correspondence between him and Jefferson on this romance and its later blasting.Out of all this a somewhat paradoxical character appears—a shy man, diffident in speech yet masterly in argument, capable of a fight and usually in one, shrewd in controversy, racy in discourse, a student of natural science, the foremost scholar in his day in governmental theory, able in diplomatic and financial affairs, generous and honest. If he had one obsession, it was freedom of religion and the absolute divorce of church from state.Mr. Brant brings us new information and a fresh approach to American history, which no one interested in our nation's beginnings can afford to miss. The epoch at which the volume ends stands out more than ever as a high point in the nation's destiny and Madison's career.",
  "genres": [],
  "author": "Irving Brant",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/8142515-james-madison-the-nationalist-1780-1787"
}