{
  "title": "Coombe's Wood",
  "description": "Izzy Santana and her 13-year-old son Connor move into a Reading Council-provided flat in the sleepy village of Cedham. Locals darkly warn her to stay away from nearby Coombe's Wood, hinting first at elves, then at multiple murders... which may or may not have taken place in the woods hundreds of years ago. It's all ludicrously superstitious, and Izzy is so delighted to have found a haven for her son - after being threatened by her sadistic ex-partner George - that she takes little notice. She meets a neighbour who seems kindly, if a trifle fey, and who takes a great interest in her son. Connor seems instantly comfortable with him. She begins to feel as if she is also falling under his spell. But Connor is bullied at school, and one night she finds herself tracking those bullies in the wood, where she believes they are waiting for him. She doesn't find them, but something closes in on her - something that sounds like a savage animal. As she runs she realises she may have been set up - or Connor was - to be caught by whatever the animal was. She strengthens the barricades in her flat, no longer puts all the local tales about 'danger in them woods' down to superstition, and even begins to wonder about the way she was selected by the Reading Council officer to live in the village in the first place. Then a slit rabbit turns up on her doorstep, along with a distinctive cigarette butt, and she knows George has found her. Desperately compassionate, her neighbour calls the police, who turn up next day, harumph the ceiling, and take the attitude: You've not been attacked, then, Miss? You haven't actually seen him? Why, if your ex-lover has tracked you down, do you suppose he would he dump a rabbit at your door...? Her own question, more urgent, is: if George can get in the front door of the building, can he get into her flat? What Izzy needs to do is protect Connor. She has already started to uncover the ancient secrets of the village, and now she works out the perfect way to get rid of George... for good.",
  "genres": [
    "Horror",
    "Suspense",
    "Fantasy",
    "Fiction",
    "Dark Fantasy"
  ],
  "author": "Lisa C. Hinsley",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/8145053-coombe-s-wood"
}