{
  "title": "Let's Spend the Night Together: Backstage Secrets of Rock Muses and Supergroupies",
  "description": "This intimate account of 24 legendary groupies reveals what went on behind the closed doors of rock stars from Elvis to Marilyn Manson. Consisting of Pamela Des Barres's revealing interviews with and profiles of other supergroupies, this book offers firsthand glimpses into the backstage world of rock stars and the women who loved them. The groupies--such as Tura Satana, Miss Japan Beautiful, who taught Elvis how to dance; Cassandra Peterson (Mistress of the Dark), who tangled with Tom Jones in Sin City; Cynthia Plaster Caster, who redefined the art of Jimi Hendrix; and Miss B., who revealed Kurt Cobain's penchant for lip gloss and panty hose--tell tales that go well beyond an account of a one-night stand to become a part of music history. Since rock's beginnings, there have been groupies. These chosen few women who bed, but not often wed, the musicians of their dreams are almost as much a part of music history as the musicians themselves. Pamela Des Barres, the world's foremost supergroupie, here offers an all-access backstage pass to the world of rock stars and the women who love them.Having had her own affairs with legends such as Keith Moon and Jimmy Page--as documented in her bestselling memoir I'm with the Band --Pamela now turns the spotlight onto other women who have found their way into the hearts and bedrooms of some of the world's greatest musicians. In Let's Spend the Night Together, she tells, in their own words, the stories of these amazing women who went way beyond the one-night stand. Here you'll get to know 24 outrageous groupies, including * Tura Satana, Miss Japan Beautiful, who taught Elvis how to dance and gave him lessons in lovemaking * Cassandra Peterson, aka Elvira, Mistress of the Dark, who tangled with Tom Jones in Sin City * Soulful Miss Mercy, who discovered that not only does the rest of the world listen to Al Green while making love--so does Al Green * Cynthia Plaster Caster, who redefined art and made history when Jimi Hendrix plunged his member into her plaster mold * The mysterious Miss B, who reveals Kurt Cobain's penchant for lip gloss and pantyhose * and over a dozen more",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Rock N Roll",
    "History",
    "Biography Memoir"
  ],
  "author": "Pamela Des Barres",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/8146704-let-s-spend-the-night-together"
}