{
  "title": "REVELATION",
  "description": "A basic Bible Study. This book is here for those adults who have recently embraced Jesus and his teachings. I have added a few notes to explain a few things. A blessing is pronounced on all who read, hear and keep the words given to John in the Book of Revelation. It is here for you to read. The next thing he says is that “the time is at hand.” This may seem odd since it has been over 2000 years. The only thing that makes sense is that the many who have died through the centuries have had to deal with Jesus Christ at the point of death. But there will come a day when the world as we know it will end. It may be soon. The Book of the Revelation of Jesus Christ is given here in full from the KJV I've added a few basic notes for those reading the Book of Revelation for the first time. This study is not designed for the skilled scholar, but the newcomer to Bible study. This last book of the New Testament is also called the Apocalypse of John. Apocalypse, from the Greek, is a synonym for \"Revelation\", but also from it comes the name for the type of literature; an \"apocalypse\" is a work of apocalyptic literature. John's is the only book in the Canon that is wholly composed of apocalyptic literature. Revelation is a cryptic document which has been interpreted in many ways. Most of the interpretations fall into one or more of the following the Historicist, which sees in Revelation a broad view of history; the Preterist, in which Revelation mostly refers to the events of the apostolic era (first century); the Futurist, which believes that Revelation describes future events; and the Idealist, or Symbolic, which holds that Revelation is purely symbolic, an allegory of the spiritual path and the ongoing struggle between good and evil. These approaches are by no means mutually exclusive, and can be (and usually are) used in combination with each other.(from Wikipedia) I trust the added notes will help you have a better picture of the future..The Bible teaches that we all have eternal life. We'll either live with Jesus in heaven or separated into outer darkness without him. There is no second chance after death. For those who tried and failed to believe, you can stop trying. Jesus purchased eternal life for us on the cross. We just need to believe. If you can't believe, ask the Holy Spirit to help you. It is not God's will that any should perish, but that we all repent. He will also give us strength to live for Him. The Christian life is a supernatural life. Jesus proved himself to be the Son of God by coming out of the grave three days after being put in it..No human can do that. When Jesus went back to heaven, the angels told the disciples that he would return for his followers. The Book of Revelation explains that further. The world needs purification.",
  "genres": [],
  "author": "Verna Hargrove",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/8156796-revelation"
}