{
  "title": "Falling Leaves: The True Story of an Unwanted Chinese Daughter",
  "description": "Barnes & Noble Discover Great New WritersThere is a Chinese proverb that says, \"Falling leaves return to their roots.\" For Adeline Yen Mah, this return to her roots brought her back through five decades of China's history to produce a truly moving modern-day Cinderella story, in her extraordinary and internationally bestselling memoir,Falling Leaves.Unfolding against a turbulent backdrop of social, political, and cultural upheaval, Falling Leaves is the moving and unforgettable story of a courageous woman's triumph over despair in a lifelong search for acceptance, love, and understanding.Born in 1937 in Tianjin, a port city 1,000 miles north of Shanghai, Adeline Yen Mah was the fifth and youngest child of an affluent family. Her great-aunt  in an unprecedented achievement  had founded the Shanghai Women's Bank in 1924, and her father was a revered businessman whose reputation for turning iron into gold began when he started his own firm at the age of 19. Yet wealth and position could not shield young Adeline from a childhood of appalling emotional abuse at the hands of her own family.Adeline's mother died giving birth to her. As a result she was deemed bad luck and considered inferior and insignificant by her older siblings, who bullied her relentlessly. When her father took a beautiful Eurasian, Niang, as his new wife  at a time when everything Western was covetedassuperior to Chinese  Adeline found herself in the thick of an almost-fairy-tale, before the happy ending, that is, living at the mercy of a cold and cruelly manipulative stepmother. While Niang treated all of her stepchildren as second-class citizens, the full power of her wrath was unleashed on Adeline. Her only refuge was in the arms of her beloved Aunt Baba, who lavished affection and encouragement on the child. Despite her unhappiness, Adeline excelled at school and became a top student.As the Red Army approached in 1949, the family moved to Hong Kong, and Adeline was shuttled off to boarding school in virtual isolation, forbidden visitors, mail, and all contact with her family. Burying herself in books, she dreamed of freedom and a new life. Armed only with the memory of the love of her Aunt Baba, and a driving determination to achieve unlimited success  to prove herself worthy of her family's love  Adeline Yen Mah survived her life of loneliness and rejection to build a successful medical career in the United States.Told in her own words, the story of Adeline's valiant, painful, and ultimately triumphant struggle toward adulthood and independence unfolds with stunning emotional power. Falling Leaves is a haunting and unforgettable tale of people caught in the swirl of events beyond their control, buoyed by the indomitability of the human spirit.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "China",
    "Biography",
    "History",
    "Autobiography",
    "Asia"
  ],
  "author": "Adeline Yen Mah",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/815834.Falling_Leaves"
}