{
  "title": "Swing Era New York: The Jazz Photographs of Charles Peterson",
  "description": "Charles Peterson entered the jazz world of New York as a guitarist but made his true contribution documenting an era and its most notable performers. A photographer whose images captured the passion and intensity of his subjects, Peterson took up the camera in the mid-1930s and transformed himself from a performer on stage to a visual recorder and observer of the stage. Creating a photographic style that combines artistic sensibility and technical skill, he became a preeminent New York jazz photographer of the pre-bebop, small combos and Big Band era.A deep love of jazz led Peterson to the legendary clubs of Harlem, 52nd Street, and Greenwich Village; concert halls and ballrooms; jam sessions; recording studios; backstage get-togethers; and private parties. As a jazz scene insider, Peterson had access to all of these formal and informal venues and was often recommended to shoot special events by musicians, record producers, and club owners because, as Eddie Condon once noted, \"he knows how to handle musicians. He won't bother them when he shouldn't bother them and he'll get what you want.\" And he did. Among the countless subjects he enshrined on film are Louis Armstrong, Billie Holiday, Duke Ellington, Benny Goodman, Zutty Singleton, Fats Waller, Mildred Bailey, Cab Calloway, Pee Wee Russell, Lester Young, and Jack Teagarden.Peterson's photographs expose a startling contrast between integrated bandstands and audiences and the segregated world, and reveal the determination of those who refused to be confined by such oppressive conventions of the time. They depict musicianship and camaraderie, dancing, and technical innovation, as well as the harsh contrast of an all-too-pervasive alcoholism that interrupted the lives of many in that New York scene.Jazz historian and critic W. Royal Stokes provides commentary, historical and biographical information, and lively anecdotes that connect the musicians featured in Peterson's photographs to each other and to the music within the social world of jazz. Don Peterson, the son of Charles Peterson, restored the 229 photographs included here from his father's original negatives. More than half have never been published, while many others have not been seen in print since the 1940s. This striking collection represents a historical document of a city and an era that brought the great jazz and swing musicians of the time to the height of success and solidified their reputations.",
  "genres": [
    "Music",
    "Photography"
  ],
  "author": "W. Royal Stokes",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/8160937-swing-era-new-york"
}