{
  "title": "Acorna's Search",
  "description": "\"Acorna's people, the Linyaari, are once more without a home. And though they survived the brutal attack from the cold-blooded Khleevi, the battle left their beloved planet, narhii-Vhiliinyar, horribly scarred. Yet all is not lost. While the damage is terrible, hope still lives deep within this gentle, spiritual people. Banding together, they will rebuild both narhii-Vhiliinyar and the original Linyaari homeworld, Vhiliinyar, restoring them to the natural beauty and vitality they enjoyed before the time of the Khleevi.\" \"Acorna, too, is eager to help reconstruct the homeworld of which she's long dreamed. Though she was abandoned in space as a baby, then rescued and raised by gruff human asteroid miners, the beautiful young woman with the \"funny\" feet and hands and gleaming horn has made peace with her heritage and is now eager to turn her extraordinary healing powers to re-create the Linyaari's world with her lifemate, Aari, her human \"uncles,\" and her friends.\" \"But just as work begins to get under way something goes terribly wrong. Linyaari begin mysteriously disappearing - including Aari and his sister, Maati. Is it the Khleevi or some other unknown enemy?\" Searching for her beloved, Acorna makes an even more astonishing discovery: the remains of a subterranean world that belonged to the legendary Friends - a technologically advanced society that populated Vhiliinyar before the time of the Ancestors. What happened to the Friends? Where did they go and why has so little remained of their society? Acorna knows that to save Aari and the rest of the missing Linyaari she must begin to seek the answers - a quest that will once again take her deep into the realms of limitless space to find the origins of her people.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Unicorns",
    "Adult",
    "Space"
  ],
  "author": "Anne McCaffrey",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13107764-acorna-s-search"
}