{
  "title": "Life Laid Bare: The Survivors in Rwanda Speak",
  "description": "To make the effort to understand what happened in Rwanda is a painful task that we have no right to shirk-it is part of being a moral adult.\"-Susan SontagIn the late 1990s, French author and journalist Jean Hatzfeld made several journeys into the hilly, marshy region of the Bugesera, one of the areas most devastated by the Rwandan genocide of April 1994, where an average of five out of six Tutsis were hacked to death with machete and spear by their Hutu neighbors and militiamen. In the villages of Nyamata and N'tarama, Hatzfeld interviewed fourteen survivors of the genocide, from orphan teenage farmers to the local social worker. For years the survivors had lived in a muteness as enigmatic as the silence of those who survived the Nazi concentration camps. In Life Laid Bare, they speak for those who are no longer alive to speak for themselves; they tell of the deaths of family and friends in the churches and marshes to which they fled, and they attempt to account for the reasons behind the Tutsi extermination. For many of the survivors \"life has broken down,\" while for others, it has \"stopped,\" and still others say that it \"absolutely must go on.\"These horrific accounts of life at the very edge contrast with Hatzfeld's own sensitive and vivid descriptions of Rwanda's villages and countryside in peacetime. These voices of courage and resilience exemplify the indomitable human spirit, and they remind us of our own moral responsibility to bear witness to these atrocities and to never forget what can come to pass again. Winner of the Prix France Culture and the Prix Pierre Mille, Life Laid Bare allows us, in the author's own words, \"to draw as close as we can get to the Rwandan genocide.",
  "genres": [
    "Nonfiction",
    "Africa",
    "History",
    "Rwanda",
    "War",
    "Historical",
    "Biography"
  ],
  "author": "Jean Hatzfeld",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/816095.Life_Laid_Bare"
}