{
  "title": "Greek Fire, Poison Arrows and Scorpion Bombs: Biological and Chemical Warfare in the Ancient World",
  "description": "Flamethrowers, poison gasses, incendiary bombs, the largescale spreading of disease: are these terrifying implements of warfare modern inventions? Not by a long shot. Weapons of biological and chemical warfare have been in use for thousands of years. Greek Fire, Poison Arrows and Scorpion Bombs, Adrienne Mayor's riveting exploration of the origins of biological and unethical warfare draws extraordinary connections between the mythical worlds of Hercules and the Trojan War, the accounts of Herodotus and Thucydides, and modern methods of war, and terrorism. Greek Fire, Poison Arrows and Scorpion Bombs will catapult readers into the dark and fascinating realm of ancient war and mythic treachery - and their devastating consequences.Illuminating... Adrienne Mayor marshals not just myth, but also the writing of ancient authors and evidence from archaeological digs to show that biological and chemical weapons saw action in battles long before the modern era. - The New York TimesA sound and very imaginative account... Mayor's historical research has made a significant contribution toward filling in the gaps of knowledge concerning weaponry in the classical age. - NewsdayMayor recounts in lively, sometimes darkly comic detail, the diabolical stratagems devised by devious warriors for tactical ends - DiscoverAdrienne Mayor, a research scholar in Classics and History of Science at Stanford University, specializes in ancient natural science, classical legends, and ancient military history . The author of Poison King, Mayor is a frequent contributor to Archaeology, MHQ, and Folklore, and is often interviewed by NPR, BBC, The New York Times, USA Today and The History Channel. She lives in Princeton, New Jersey.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "War",
    "Ancient History",
    "Military History",
    "Historical"
  ],
  "author": "Adrienne Mayor",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/8162137-greek-fire-poison-arrows-and-scorpion-bombs"
}