{
  "title": "I Am America",
  "description": "From Stephen Colbert, the host of television's highest-rated punditry show The Colbert Report, comes the book to fill the other 23.5 hours of your day. I Am America (And So Can You!) contains all of the opinions that Stephen doesn't have time to shoehorn into his nightly broadcast.Dictated directly into a microcassette recorder over a three-day weekend, this book contains Stephen's most deeply held knee-jerk beliefs on The American Family, Race, Religion, Sex, Sports, and many more topics, conveniently arranged in chapter form.Always controversial and outspoken, Stephen addresses why Hollywood is destroying America by inches, why evolution is a fraud, and why the elderly should be harnessed to millstones.You may not agree with everything Stephen says, but at the very least, you'll understand that your differing opinion is wrong.I Am America (And So Can You!) showcases Stephen Colbert at his most eloquent and impassioned. He is an unrelenting fighter for the soul of America, and in this book he fights the good fight for the traditional values that have served this country so well for so long.From Publishers Weekly:Starred Review. Realizing that it takes more than thirty minutes a night to fix everything that's destroying America, Colbert bravely takes on the forces aligned to destroy our country—whether they be terrorists, environmentalists, or Kashi brand breakfast cereals. His various targets include nature (I've never trusted the sea. What's it hiding under there?), the Hollywood Blacklist (I would have named enough names to fill the Moscow phone book), and atheists (Imagine going through life completely duped into thinking that there's no invisible, omniscient higher power guiding every action on Earth. It's just so arbitrary!). Colbert also provides helpful illustrations and charts (Things That Are Trying to Turn Me Gay) [and] a complete transcript of his infamous speech at the 2006 White House Correspondents' Dinner [...] all of which add up to a book that is sure to be a bestseller and match the success of Colbert's former Daily Show boss Jon Stewart's America (The Book). (Oct.)Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Comedy",
    "Politics",
    "Audiobook",
    "Biography",
    "Essays"
  ],
  "author": "Stephen Colbert",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/8163192-i-am-america"
}