{
  "title": "Two Men In A Pickup",
  "description": "Two men, in 1960s rural Nebraska, set off in search of a runaway teenager.Beginning excerpt:OK, Saturday night and Mike is showering up and shaving off two weeks of beard-as I am about to find out. He wants to go out to a bar he knows over by Doniphan, across the river. Reminds him of a place in Dallas, when he was just out of the service. Even the name's the same-the Wood Shed. The barbecue is Texas-style, he swears, and they've got Lone Star by the bottle, a real treat from the sound of it that will also grow hair on my chest (since nothing else does).I'm on the couch with my feet up. The TV is on with the sound off. And I've got to about page 85 of Farewell to Arms. Trying this summer to read through all of Hemingway and some Henry Miller. I'm as dressed for the night as I'm going to be-white snap-front shirt and a new pair of button-fly levi's, still unwashed, cardboard-stiff, indigo blue, and roomy inside.Mike says I should jump into the stock tank, and let them shrink to fit. This is his idea of a joke. He is a Wrangler man and thinks buttons just slow a man down. Mike also has opinions about underwear. He believes in boxers and thinks my jockeys mark me as the college boy that I am. Not to be taken seriously.I hear Mike come into the room and walk up behind me. He bends over grinning at me, upside down.\"What happened to your beard?\" I say.\"Got tired of it,\" he says. It's all gone but a thick, dark moustache, which looks even thicker now over his big smile.He lifts my glasses from my face and rubs his naked cheek against mine. There's a wave of his Mennen Skin Bracer. Then he bends farther, opening the top of my shirt. His hairy chest presses onto my face, skin still moist from the bathroom, and I can feel his wet tongue working its way down to my navel, the snaps on my shirt popping open as he goes. Hemingway hits the floor.He pauses, and I can feel his hands on my fly, working his fingers around the stiff buttons. He's letting his full weight down onto me and muttering something about goddam levi's. Finally, I feel him yanking, and the buttons come undone with a surging ripple effect down the front of my briefs.\"And what have we here?\" Mike is laughing. And I'm already feeling his callused hands reaching into my shorts. He pulls forward farther, and now the damp towel he's got wrapped around him is edging across the bridge of my nose.Mike wastes no time. He's got me in his mouth before I'm half hard. I reach around with my one free arm and start pulling at the towel. He finally lifts upward, and the towel starts to fall away. As I'm looking under it, his dick drops out and slaps onto my face. I touch the end of it with my tongue, and I'm getting syrupy drops of his salty precum.We never make it to the Wood Shed for barbecue and Lone Stars that night. And we don't make any other progress either...",
  "genres": [
    "M M Romance"
  ],
  "author": "Rock Lane Cooper",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/8164762-two-men-in-a-pickup"
}