{
  "title": "Simon Wiesenthal: The Life and Legends",
  "description": "This first fully documented biography of Simon Wiesenthal, the legendary Nazi hunter, is also a brilliant character study of a man whose life was part invention but wholly dedicated to ensuring both that the Nazis be held responsible for their crimes and that the destruction of European Jewry never be forgotten.Like most Jews in Eastern Europe on the eve of Hitler’s invasion of Poland, twenty-four-year-old Simon Wiesenthal did not grasp the nature of the Nazi threat. But six years later, when a skeletal Wiesenthal was liberated from the concentration camp at Mauthausen, he fully fathomed the crimes of the Nazis. Within days he had assembled a list of nearly 150 Nazi war criminals, the first of dozens of such lists he would make over a lifetime as a Nazi hunter. A hero in the eyes of many, Wiesenthal was also attacked for his unrelenting pursuit of the past, when others preferred to forget.For this new biography, rich in newsworthy revelations, historian and journalist Tom Segev has obtained access to Wiesenthal’s private papers and to sixteen archives, including records of the U.S., Israeli, Polish, and East German secret services. Segev is able to reveal the intriguing secrets of Wiesenthal’s life, including his stunning role in the capture of Adolf Eichmann, his relationship with Israel’s Mossad, his controversial investigative techniques, his unlikely friendships with Kurt Waldheim and Albert Speer, and the nature of his rivalry with Elie Wiesel.Segev’s challenge in writing this biography was Wiesenthal’s own complicated relationship to truth. Wiesenthal told many versions of his life, his suffering in the camps, and his involvement with the arrest of individual Nazis. Segev shows that in order to gain the information he sought and twist the arms of reluctant government figures, Wiesenthal needed to seem more influential than he really was.For two generations of Americans, Simon Wiesenthal was a Jewish superhero—depicted on film by Ben Kingsley and Laurence Olivier—and the muse for a Frederick Forsyth thriller. Now Segev demonstrates that the truth of Wiesenthal’s existence is as compelling as the fiction. Simon Wiesenthal is an unforgettable life of one of the great men of the twentieth century.",
  "genres": [
    "Biography",
    "History",
    "Holocaust",
    "Nonfiction",
    "World War II",
    "Israel"
  ],
  "author": "Tom Segev",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/8165375-simon-wiesenthal"
}