{
  "title": "The 'Backwards' Research Guide for Writers: Using your Life for Reflection, Connection, and Inspiration",
  "description": "\"Backwards offers a very helpful perspective on the writing and research process. Summing Up: Recommended. Lower-division undergraduates, two-year technical program students, and general readers.\" -- J. Stevens, George Mason University, CHOICE Nautilus Award 2012 Silver Winner - Creative Process The Backwards Research Guide for Writers: Using Your Life for Reflection, Connection and Inspiration demystifies the writing process by inviting writers of all levels to focus on their passions, questions, and obsessions as the key to generating seeds for further exploration of the world around them. Writers then develop these questions into focused projects that explore the teller's central role in the open-ended quest of unfolding a research topic. The boom in narrative journalism, memoir, and creative nonfiction has generated wonderful writing, but no resource for writers exists to bridge the gap between passionate research and the page. This book addresses that gap by turning the task of research on its head and by speaking to students who resist the idea of research as an objective and dry assignment. Students are invited to experiment creatively with collecting observations and information and then to step beyond their subjective realities to interact with the world around them and ultimately become vulnerable authors willing to change their perspectives as they research and write. Developed with input from college student writers, The Backwards Research Guide for Writers is relevant as a text for undergraduate and postgraduate courses in composition, creative nonfiction, literary journalism, and feature writing as well as for working journalists and other writers seeking a new way of approaching a writing project. It includes interviews with notable authors that focus not on the completed and intimidating project of a successful author, but on the project as it took shape and mystified a researcher. Another unique feature is a section in every chapter on ethics, as ethical questions are central to the writing process as well as a method for sparking interest in writing and learning. The guide includes extensive examples of research challenges and dilemmas, strategies for planning a research project, exercises for generating ideas, a guide for writing the research-based work, an appendix of on-line databases, a section in each chapter focused on ethics in research and writing called gray matter, a selection of recommended readings, and a bibliography of conventional research guides.",
  "genres": [
    "Writing"
  ],
  "author": "Sonya Huber",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/8163062-the-backwards-research-guide-for-writers"
}