{
  "title": "Alice: Princess Andrew of Greece",
  "description": "Hugo Vickers's Alice is the remarkable story of Princess Andrew of Greece, whose life seemed intertwined with every event of historical importance in twentieth century Europe.\"In 1953, at the coronation of Queen Elizabeth II, Princess Alice was dressed from head to foot in a long gray dress and a gray cloak, and a nun's veil. Amidst all the jewels, and velvet and coronets, and the fine uniforms, she exuded an unworldly simplicity. Seated with the royal family, she was a part of them, yet somehow distanced from them. Inasmuch as she is remembered at all today, it is as this shadowy figure in gray nun's clothes...\"Princess Alice, mother of Prince Phillip, was something of a mystery figure even within her own family. She was born deaf, at Windsor Castle, in the presence of her grandmother, Queen Victoria, and brought up in England, Darmstadt, and Malta.In 1903 she married Prince Andrew of Greece and Denmark, and from then on her life was overshadowed by wars, revolutions, and enforced periods of exile. By the time she was thirty-five, virtually every point of stability was overthrown. Though the British royal family remained in the ascendant, her German family ceased to be ruling princes, her two aunts who had married Russian royalty had come to savage ends, and soon afterwards Alice's own husband was nearly executed as a political scapegoat.The middle years of her life, which should have followed a conventional and fulfilling path, did the opposite. She suffered from a serious religious crisis and at the age of forty-five was removed from her family and placed in a sanitarium in Switzerland, where she was pronounced a paranoid schizophrenic. As her stay in the clinic became prolonged, there was a time where it seemed she might never walk free again. How she achieved her recovery is just one of the remarkable aspects of her story.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Greece",
    "Biography Memoir",
    "Historical",
    "Germany"
  ],
  "author": "Hugo Vickers",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/816295.Alice"
}