{
  "title": "Opposites Attract",
  "description": "When Mars meets Venus… When day clashes with night… When love sparks the hottest battle of the sexes since Adam said yes to Eve…Man and woman. Right off the bat it spells trouble. But sometimes love at first sight needs a second glance—and a second chance to bring two distant hearts, minds, and bodies together. So indulge yourself. Believe in the impossible, and in the unfathomable dreams of unbridled passions—where you least expect it. Now in these four delightful stories of love and war, four acclaimed authors invite you to discover common ground between men and women—and the thrill of sharing it when the light go down…stories:The Icing on the Cake by Lynn Kurland (de Piaget / MacLeod #6.5)He’s a writer working on his new novel, and baking wedding cakes on the side. She’s an Alaskan wilderness buff more experienced at fending off grizzlies than men. But she’s about to discover the joy of coming in from the cold…The Short, Hot Summer by Elizabeth BevarlyHe was as out of place in Alabama as she would be in Manhattan. But the temperature spikes whenever an executive stuck in town for a big-time deal and his small-town landlady are together—creating enough heat to rival the sultry summer nights…Pride and Prejudice by Emily CarmichaelA double-booked hotel room during a prestigious dog show pits a cartoonist and her pet papillon with an award-winning Border collie. What ensues is a sexy contest of wills. And it’s winner take all…The Princess and the Adventurer by Elda MingerShe stuck out like a debutant at a monster truck rally. What was a lady doing in a cantina on the border of the Mexican jungle? Little did Matthew Kinkaid realize, he was just the man she was looking for…",
  "genres": [
    "Romance",
    "Time Travel",
    "Historical Romance",
    "Contemporary Romance",
    "Fiction",
    "Contemporary",
    "Anthologies"
  ],
  "author": "Lynn Kurland",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/816583.Opposites_Attract"
}