{
  "title": "The Queen's Husband",
  "description": "From the cradle Victoria and Albert were destined for each other. Albert, as the younger son of a minor German duke, was acutely aware of what marriage to the Queen of England would mean in terms of his personal ambitions. Victoria wrestled with her desire for independence—until she saw Albert at Windsor in 1839. Then Queen Victoria fell in love.Together they forged the Victorian Age—the impetuous Queen and her indomitable consort. Through the stormy first years, Victoria was in almost perpetual revolt against any encroachment on her powers of state and against the continual pregnancies she had to endure. Albert, who battled for supremacy in the relationship, was forced to take stock of his wife's nature, the clinging femininity that disguised a will of iron and a searing streak of vengefulness.Gradually consessions were made, and as the Prince became instrumental to the management of the monarcy, the Queen blissfully settled into family life.These were significant years, when British history was shaped by statesmen such as Sir Robert Peel and Lord Palmerston, and by such events as the Crimean War and the Indian revolt. On more than one occasion the Queen narrowly escaped assassination.Yet her life increasingly was dominated by her husband and family. There was naughty Bertie, brilliant Vicky, placid Alice, frail Leopold, along with five other children of the royal marriage. For Victoria, no diplomatic crisis or domestic scandal could overshadow her love for a single man—Albert, the Queen's Husband.Jean Plaidy's novel zestfully portrays the private lives and public deeds of Victoria and Albert in a royal tale of romance destined to captivate its readers.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Victorian",
    "19th Century",
    "British Literature",
    "Romance"
  ],
  "author": "Jean Plaidy",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/817192.The_Queen_s_Husband"
}