{
  "title": "The Star of Lancaster",
  "description": "Richard the Second was losing his hold on the crown and ambitious eyes were turning toward it. Henry of Bolingbroke, son of John of Gaunt, had married the heiress Mary de Bohun and by her had six children, the eldest of whom was Harry of Monmouth.Bolingbroke was exiled by the King but returned to England when Richard confiscated John of Gaunt's estates. Bolingbroke came to claim them—and at the same time the crown.Richard was deposed and died mysteriously, murdered it was said on the order of Bolingbroke, now King Henry the Fourth. But Henry found the crown harder to hold than to win. He was beset by enemies—the Welsh, the Scots and the mighty Hotspur; the country was rumbling with revolt against the King whom many called the Impostor. In addition to these worries Henry suffered anxiety about the loathsome disease which was threatening to destroy him, and he was also worried over the rebellious behavior of his son.Dominating the court was Harry of Monmouth, his fingers itching to take the crown, his reckless conduct causing scandal since he frequented disreputable company in the low-class taverns of East Cheap with his crony Sir John Oldcastle.There came a time when the disease which had caused the King to hide himself away claimed him and Harry became King Henry the Fifth. The change was miraculous both for him and Oldcastle. The licentious youth became a great King, and the rake Oldcastle turned into a religious reformer. Oldcastle ultimately was a martyr to his cause and Harry became the conquering hero of Agincourt.The star of Lancaster was in the ascendant. Harry had brought France to her knees and married her Princess. It seemed that the long war was at an end. But a greater enemy than the French awaited Harry, and the rising star of Lancaster was finally to depend on a nine-month-old child.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "British Literature",
    "Fiction",
    "Plantagenet",
    "15th Century",
    "14th Century"
  ],
  "author": "Jean Plaidy",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/817138.The_Star_of_Lancaster"
}