{
  "title": "Awakening Spirit: Wise Seminary, First Year Certification for Wiccan Clergy",
  "description": "Awakening Spirit - WISE Seminary First Year Certification Course for Wiccan Clergy illuminates the shadowy corners of the Wiccan Circle, and awakens the reader to the natural spiritual connectedness that resides within us all. Finally this long awaited, transformational journey of awakening is available to individual seekers and formal students alike, combining a deeply empowering personal experience with a formal curriculum that is balanced, comprehensive and challenging.Belladonna combines her knowledge of metaphysics, astrology, and the healing therapies with her natural talent as a teacher to present the information in a way that speaks to your soul. It is evident that her goal is to empower the reader to progress upon their spiritual path, which makes this exciting book a very valuable tool, Activates the power centers in your body, giving you the awareness of how to truly generate power, connect with Deity, and work in concert with divine will. Teaches powerful energetic exercises that train your energy field to react with automatic and immediate magical responses. Reveals the keys to understanding, and using the ancient incantations of circle casting and shares the mystery of magical tools, how they work, how to use them, and what working with them can teach the magical practitioner. Brings awareness of God & Goddess, magic, and sacredness into your everyday reality. The real magic of Awakening Spirit is in the way that Spirit transforms the reader's reality, in concert with the information given. The color, symbols, meditations, exercises and information presented, all work together to appeal to your individual learning style bringing awareness of the spiritual realm into your active consciousness. Anyone who reads this book will feel the energy of Spirit pulsating through it. This is a truly inspired work that enables each seeker to awaken to the presence of Deity in his or her life. Also WISE Seminary Certification Course Requirements. Additional graphics, meditations, and visualizations provided on www.wiseseminary.com The WISE Seminary offers a 4 year course to earn a Bachelors of Science in Wiccan Studies. Awakening Spirit is the prelude to the WISE Seminary sophomore course, Empowering the Sacred Self, an intense journey through the eight layers of reality through which Spirit manifests within you. It is a process that clears your consciousness of the obstacles that keep you from merging with the divine, and brings you into harmony with the powers of the Universe. It opens your awareness to your true potential, and gives you the tools to excavate your eternal contract, enabling you to become a vehicle for spirit to work through, as a bridge between the worlds.To find out about upcoming classes, seminars, WISE Seminary orientations, rituals and other author appearances, please check us out online at www.wiseseminary.com",
  "genres": [
    "Wicca"
  ],
  "author": "Belladonna Laveau",
  "average_rating": "4.94",
  "url": "https://www.goodreads.com/book/show/816796.Awakening_Spirit"
}