{
  "title": "Evergreen Gallant",
  "description": "From the time he was fifteen, women found Henry of Navarre irresistible. But he was never faithful for long. Marked for death by a Catholic count who saw in him the rallying point of Huguenot fortunes, Henry took his pleasures where he found them.A father at fifteen, he was sent to become a soldier under the great Coligny but still found time for love affairs. Yet when his mother died mysteriously, he began to change, and the man who rode to Paris to play the part of bridgegroom in the \"Blood-Red Wedding\" was alert for treachery. Facing death nonchalantly, accepting the Mass in exchange for his life, amusing himself with the mistress who he knew had been sent to spy on him, he deluded even Catherine de' Medici.Life with the tempestuous Margot was like a succession of farcical incidents from the Decameron. Reputed to have had more mistresses than any King of France, he passed lightly from one to another. There were the spies of Catherine de' Medici, promiscuous Charlotte de Sauves, and gentle Dayelle; Fosseuse, who came into conflict with Margot; Corisande, whom he loved as a wife; Gabrielle, who had been sold to a King and others by her rapacious mother; these and others occupied him until the day of his death when he was pursuing the youthful Charlotte de Montmorency.In addition to his mistresses, there were two wives to plague him: flamboyant Margot, whose adventures rivaled his own, and Marie de' Medici, who came to torment his later years.This was the man who, affectionately known as the Evergreen Gallant because all through his life he was in love with some woman, brought posperity back to a war-scarred country, declared Paris to be worth a Mass, and was recognized as the greatest King the French had ever known.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "France"
  ],
  "author": "Jean Plaidy",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/817208.Evergreen_Gallant"
}