{
  "title": "Works of Hans Christian Andersen: The Ice-Maiden, O.T.: A Danish Romance, Best-Known Fairy Tales: The Emperor's New Clothes; The Snow Queen, The Little Mermaid and More",
  "description": "Table of ContentsList of Works by Genre and TitleList of Works in Alphabetical OrderHans Christian Andersen BiographyNovels :: Fairy Tales and Stories :: Non-FictionNovelsThe Ice-Maiden Translated by Fanny FullerO. T. A Danish RomanceFairy Tales and StoriesThe Angel Translated by H. P. PaullThe Bell Translated by H. P. PaullThe Bell Deep Translated by H. P. PaullThe Bottle Neck Translated by H. P. PaullThe Butterfly Translated by Fanny FullerThe Dream of Little Tuk Translated by H. P. PaullThe ElderbushThe Emperor's New Clothes Translated by H. P. Paull, Illustrated by Edmund DulacThe False CollarThe Fir Tree Translated by H. P. PaullThe Garden of Paradise Illustrated by Edmund DulacThe Happy Family Translated by H. P. PaullHolger Danske Translated by H. P. PaullIb and Little Christine Translated by H. P. PaullThe Leap-FrogLittle Ida's FlowersThe Little Match Girl Translated by H. P. PaullThe Loving PairThe Mermaid Translated by H. P. Paull, Illustrated by Edmund DulacThe Metal Pig Translated by H. P. PaullThe Naughty BoyThe Nightingale Translated by H. P. Paull, Illustrated by Edmund DulacThe Old House Translated by H. P. PaullThe Old Street Lamp Translated by H. P. PaullThe Psyche Translated by Fanny FullerThe Shepherdess and the ChimneysweepThe Snail and the Rose-Tree Translated by Fanny FullerThe Snow Man Translated by H. P. PaullSomething Translated by H. P. PaullThe Steadfast Tin Soldier Translated by H. P. PaullThe Swineherd Translated by H. P. PaullThe Real Princess Translated by H. P. Paull, Illustrated by Edmund DulacThe Red Shoes Translated by H. P. PaullThe Shadow Translated by H. P. PaullThe Shepherd's Story of the Bond of Friendship Translated by H. P. PaullShe was Good for Nothing Translated by H. P. PaullThe Shoes of FortuneThe Snail and the Rose-Tree Translated by Fanny FullerThe Snow Queen Translated by H. P. Paull, Illustrated by Edmund DulacThe Story of a Mother Translated by H. P. PaullThumbelina Translated by H. P. PaullThe Tinder Box Translated by H. P. PaullThe Ugly Duckling Translated by H. P. PaullWhat the Old Man does is Always Right Translated by H. P. PaullThe Wild Swans Translated by H. P. PaullThe Wind's Tale Illustrated by Edmund DulacNon-fictionPictures of SwedenThe True Story of My Life Translated by Mary Howitt",
  "genres": [
    "Fairy Tales"
  ],
  "author": "Hans Christian Andersen",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/8174275-works-of-hans-christian-andersen"
}