{
  "title": "Getting to Happy",
  "description": "In WAITING TO EXHALE, Terry McMillan chronicled the lives and love affairs of women in their mid-thirties, opening up an entirely new literary field and audience for African-American writers. GETTING TO HAPPY, her exuberant and engaging \"sequel,\" revisits the same four spirited women - Savannah, Gloria, Bernadine, and Robin - now catapulted into midlife.Fifteen years later, her heroines are as sassy, vivid, and smart-mouthed as ever. As a broadcast investigative journalist, Savannah takes pride in her work exposing secrets and scandals - but she never expected to uncover one in her own home that would bring her already diminishing marriage to an explosive end. Bernie has had man problems that put her past challenges in the shade - these days, she finds herself popping pills and forgetting details that she might do well to recall. Robin's high-rolling life as a serial shopper runs into trouble when she loses her job to a merger, and she's hardly faring any better in the world of online dating. Gloria still runs the bustling Oasis salon, but back-to-back family tragedies hit her hard. All four face tough questions about love and loss, but they keep faith in themselves and each other as their lives fall apart and reconfigure. A particular reward of this novel is the cast of younger characters - Bernadine's now-college-age Onika; Robin's daughter Sparrow; and Gloria's son Tariq, married and with young children (and problems) of his own.McMillan's pitch-perfect prose draws us into the deeply affecting stories of these women, highlighting the humor and joy that carry them through their struggles. Although girlfriend time may have eroded somewhat under life's pressures, four-way calls and movie night get-togethers continue to reaffirm the importance of friendship not only to getting by but to chasing that perennial goal - getting to happy.",
  "genres": [
    "Fiction",
    "African American",
    "Chick Lit",
    "Contemporary",
    "Audiobook",
    "Romance",
    "Adult"
  ],
  "author": "Terry McMillan",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/8176075-getting-to-happy"
}