{
  "title": "Baumgartner Generations: Janie",
  "description": "Janie has moved to New York to try to make it as a writer, all the while serving as part-time lover in a polyamorous relationship with Veronica and TJ and full-time nanny to their daughter, Beth. Janie’s life is already incredibly full when she runs into an agent one morning who sees great potential in her—and not just as an author. As Janie’s relationship with Josh blooms and her career takes off, Ronnie’s happy surprise turns into a problem that even a vacation in a mountain cabin with the Baumgartners can’t fix, throwing everyone’s life off-kilter. Janie, especially, is spread thin, trying to please everyone while keeping Josh from finding out the true nature of her relationship with her benefactors. She knows she has to tell him eventually, but fear holds her back. Will she lose him? Will she be forced to make an impossible choice? Or will she, perhaps, find that the capacity for the human heart to love is, indeed, endless?--------- This title contains erotic situations, graphic language, a ménage a trois (MFF threesome), lesbian sex and a hookup turned romance that will curl your toes!--------------IF YOU LIKED BAUMGARTNER JANIE,you may want to have more fun with this family!The Baumgartners Plus One by Selena KittBabysitting the Baumgartners by Selena KittA Baumgartner Reunion by Selena KittMeet the Baumgartners by Selena KittBaumgartner Henry by Selena Kitt-----------------\"Would it be wrong to tell you how much I want to kiss you?\" His eyes were silver in the moonlight, his breath full of sake.\"No,\" I whispered, putting my arms around his neck. \"It would be really wrong not to do it, though.\"\"You think?\" His lips met mine before I could think of a response, before I could think at all. He tasted like sake, too, but so did I. I wasn't sure it was the sake, though, that was sending the fire flowing through my veins as we kissed. I slipped a hand through his hair, all those dark curls, as his mouth slanted across mine and our tongues began to explore. I forgot where we were, I forgot everything but the feel of his body against mine, my breasts pressed against his chest as he pulled me in closer.\"Janie, I want you,\" he whispered, kissing my neck, enveloping me in his arms. I could feel that—his cock hard through his trousers, pressed against my belly. \"Would it be wrong to take you home with me tonight?\"I shivered as he lavished kisses over my neck and shoulders, his breath hot, coming almost as fast as mine. I wanted to answer him, to tell him yes, but I was too afraid. What would happen then, I wondered? What would it be like, waking up with Josh but having to face Catherine in the morning? How was this going to work?\"Josh,\" I murmured as his hands moved down my back, cupping my ass, squeezing gently as his tongue made little circles over my collarbone. God, if he kept that up, I was going to be inviting him back to my place, and I didn't even want to think about the consequences of that, what Ronnie and TJ would say.\"You feel so good,\" he groaned, and before I knew it, we were kissing on a park bench, Josh pulling me into his lap.My dress was too tight to allow me to straddle him properly, so he pushed it up and grabbed my hips, crushing the red silk of my panties directly against the heat of his erection. I could feel it through his trousers, riding up and down as we rocked together.\"Oh god,\" I moaned softly when he broke off to stroke my breasts through my dress, kissing the swell of my cleavage. I could see the hunger in his eyes when he looked up at me in the glow of a street light. \"Please, Josh...\"He slipped a hand behind my neck, pulling my mouth down to his, kissing me breathless. When I slid my hand between us to feel the length of his cock through the thin material, he groaned against my mouth, arching up. I couldn’t stand it. If we kept on like this, we’d end up fucking right there on the park bench.“Josh, wait.”",
  "genres": [
    "Erotica",
    "Menage",
    "Contemporary",
    "Romance",
    "Contemporary Romance",
    "Fiction",
    "M F F"
  ],
  "author": "Selena Kitt",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/8180438-baumgartner-generations"
}