{
  "title": "The Pterosaurs: From Deep Time",
  "description": "Here is the first complete portrait of the legendary flying dragons of deep time–the pterosaurs–designed for non-specialists, yet founded on the real science of these bizarre creatures. Presented lucidly and accessibly by one of the world’s leading experts, David Unwin’s book is built on a mountain of new fossil discoveries and the latest research. About 220 millions years ago, a group of reptiles took to the Earth’s vast and open skies. No longer tethered to the ground, the earliest pterosaurs evolved into a multitude of diverse forms, spread around the globe, and ruled the skies until they went extinct along with the dinosaurs about 65 millions years ago, rarely leaving fossils as a record of their existence. What they did leave was a mystery for paleontologists to solve; an enigma so difficult to crack that it took centuries of false starts and missteps before the path to a true understanding of pterosaurs was uncovered. Now, an understanding of the fundamental nature of these strange creatures is finally possible. In the last 15 years, stunning new fossil finds and significant advances in technology have led to a breakthrough in our knowledge of pterosaurs. New fossils of the earliest species were discovered in Italy, a remarkably well-preserved and complete wing was found in Central Asia, and, most extraordinarily, a pterosaur embryo inside an egg was unearthed in China. CAT scanning has let researchers glimpse inside pterosaur skulls and construct three-dimensional images of their bodies from crushed bones, and modern techniques for analyzing relationships between species have revealed surprising insights into the evolution of the group. Drawing on these and other advances, David Unwin, caretaker of Archaeopteryx and curator at the Museum of Natural History in Berlin, paints pterosaurs and their world more vividly than has previously been possible. He eloquently reconstructs their biology and behavior. Pterosaurs weren’t scaly like dinosaurs, but hairy; most were brightly colored and adorned with remarkable head crests; they were excellent fliers with physiologically sophisticated wings; they walked on all fours; and varied in size from eight inches to forty feet in wingspan. He shows how they lived their lives, raised their young, and interacted with the different environments of Mesozoic Earth. Then, building on his thorough examination of their anatomy and lifestyle, and using the powerful technique of cladistic analysis, Unwin unravels the evolutionary history of pterosaurs and establishes their place in the one great tree of life. Packed with 95 color and 30 black and white illustrations–including 10 full-page original color paintings that are scientific recreations of different pterosaur species– The Pterosaurs From Deep Time takes readers on an wondrous expedition back through the lost world of the Earth’s deep past.",
  "genres": [
    "Science",
    "Palaeontology",
    "Dinosaurs",
    "Nonfiction",
    "Nature",
    "Prehistory",
    "Natural History"
  ],
  "author": "David M. Unwin",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/817997.The_Pterosaurs"
}