{
  "title": "God Speaks",
  "description": "God Speaks is Meher Baba's most complete statement of the process of Creation and its purpose. This recent reprinting maintains the contents of the 1973 revised edition while presenting the material in a new style. A contemporary format makes the work attractive and easier to read for today's audiences. God Speaks incorporates all of life into a spiritual saga. The only protagonist is God, and his story encompasses all individual biographies. It is God himself who becomes the three basic processes for the growth and transformation of evolution, reincarnation and involution (the spiritual path of return to Himself). The first phase of God's journey is evolution. It is initiated from a totally unconscious God as if an infinite Ocean were in a state likened to deep sleep. This unconscious God speaks the First Word \"Who am I?\". This question disrupts the limitless, undivided, absolute vacuum, and its reverberations create individualized souls, compared to drops or bubbles within the Ocean. By speaking the First Word, God establishes the process of Creation, in which he assumes evolving forms to gain increasing consciousness. Individuality is the vehicle of this quest. Evolution marks a series of temporary answers to \"Who am I?\" The soul traverses a multitude of forms, beginning with simples gases and proceeding slowly through inanimate stone and mineral forms. These early evolutionary stages obviously have only the most rudimentary consciousness and cannot provide a satisfactory answer to God's original question. The original query thus provides a continuing momentum for the drop soul to develop new forms each with greater consciousness, including the many plant and animal beings. Every evolutionary kingdom reveals new dimensions of consciousness and experience. Each also offers opportunities to gain different kinds of awareness. For example, when the soul identifies itself with varied species of fish, it experiences the world as a creature living in waterconversely, as a bird, it enriches its consciousness by flying through air. When the drop soul finally evolves to human form, consciousness is fully developed, but an individual is still not aware of the potential of his or her consciousness. So the original \"Who am I?\" imperative persists and inaugurates the second reincarnation. Since consciousness is fully developed, there is no longer a need for evolving new forms. The individual's experience, gathered in early stages of evolution, is now humanized and expressed in countless lifetimes. The impulses gained in sub-human forms can play themselves out in the broader context of intelligence, emotions, choices, diverse setting and interactions with people. But obviously no single lifetime can bear the burden of \"humanizing\" the entire evolutionary inheritance randomly or simultaneously. There must be a method for re-experiencing the pre-human legacy in manageable segments. The soul thus experiences alternately a series of opposites, organized according to themes. Accordingly, in different lives, the soul becomes male and female, rich and poor, vigorous and weak, beautiful and ugly. Through exploring the potential of these many opposites, one eventually exhausts all possible human identities and, therefore, has fully learned the entire range of human experience. Here begins the third involution, the process by which the soul returns to the full awareness of the Divine Force, which created him. As Meher Baba puts it, \"When the consciousness of the soul is ripe for disentanglement from the gross world (the everyday world of matter and forms(, it enters the spiritual path and turns inward.\" Like evolution, involution has certain states and stages, consisting of \"planes\" and \"realms.\" But individuality continues along this spiritual path. In fact, the book quotes the Sufi saying \"There are as many ways to God as there are souls....\" Each new plane denotes a state of being that differs from the states that proceeded it. The first three planes are within the subtle world or domain of energy, \"pran.\" There follows the fourth plane, the threshold of the mental world, where misuse of great power for personal desire can lead to disintegration of consciousness. The fifth and sixth planes represent true sainthood, which is understood to be increasing intimacy with God as the Beloved. On the sixth plane, the mind itself becomes the inner eye that sees God everywhere and in everything. \"The loving of God and the longing for His union,\" says Meher Baba \"is fully demonstrated in the sixth plane of consciousness.\" The seventh plane marks true and lasting freedom. Impressions go. Duality goes. The drops burst and again become the Ocean. God answers his question of \"Who am I?\" with \"I am God.\" The Infinite has returned to the original starting point. He now knows, however, with full consciousness and full awareness that he was, is and always will be infinite. And he realizes that the entire journey has been an illusory dream, the purpose of which is the full awakening of his soul. Yet the saga is not necessarily over. Meher Baba indicates that even among God-realized souls responsibilities within Creation may differ. Most play no further active part in Creation. But a rare few make the journey back to human consciousness. Of these, five become Perfect Masters, blending divine consciousness with awareness of all beings in evolution, reincarnation and involution. These five administer the affairs of the universe. And they use their \"infinite knowledge, power and bliss for the progressive emancipation of all in the field of illusion.\" Meher Baba differentiates these Perfect Masters, who are always on earth, from the Avatar, who is the \"that highest status of God, where God directly becomes man and lives on earth as God-man.\" He further comments that the \"Avatar is always One and the same, the eternal, indivisible, infinite One who manifests Himself in the form of man as the Avatar, as the Messiah, as the Prophet, as the Buddha, as the Ancient Onethe Highest of the High.\" A little over a year before the first publication of God Speaks, Meher Baba officially declared himself to be that Avatara claim that amplifies the meaning of the title. To the one who accepts Meher Baba's position, God's plan is revealed vividly through these pages.",
  "genres": [
    "Spirituality",
    "Philosophy",
    "Religion",
    "Mysticism",
    "Nonfiction",
    "India"
  ],
  "author": "Meher Baba",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/81826.God_Speaks"
}