{
  "title": "Poems of the Masters: China's Classic Anthology of T'ang and Sung Dynasty Verse",
  "description": "Bilingual: Chinese/EnglishPoetry is China’s greatest art, and for the past eight centuries Poems of the Masters has been that country’s most studied and memorized collection of verse. For the first time ever in English, here is the complete text, with an introduction and extensive notes by renowned translator, Red Pine. Over one hundred poets are represented in this bilingual edition, including many of China’s celebrated poets: Li Pai, Wang Wei, Tu Fu, Wang Po, and Ou-yang Hsiu.Poems of the Masters was compiled during the Sung dynasty (960–1278), a time when poetry became the defining measure of human relationships and understanding.As Red Pine writes in his introduction: \"Nothing was significant without a poem, no social or ritual occasion, no political or personal event was considered complete without a few well-chosen words that summarized the complexities of the Chinese vision of reality and linked that vision with the beat of their hearts . . . [Poetry’s] greatest flowering was in the T’ang and Sung, when suddenly it was everywhere: in the palace, in the street, in every household, every inn, every monastery, in every village square.\"\"Chiupu River Song\" by Li PaiMy white hair extends three milesthe sorrow of parting made it this longwho would guess to look in a mirrorwhere autumn frost comes fromRed Pine (the pen name of writer and independent scholar Bill Porter) is one of the world’s most respected translators of Chinese literature, bringing into English several of China’s central religious and literary texts: Taoteching, The Diamond Sutra, Zen Teachings of Bodhidharma, and Collected Songs of Cold Mountain. He lives near Seattle, Washington.",
  "genres": [
    "Poetry",
    "China",
    "Classics",
    "Asia",
    "Chinese Literature",
    "Anthologies",
    "History"
  ],
  "author": "Red Pine",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/818979.Poems_of_the_Masters"
}