{
  "title": "Visions of Distant Shores: An Andre Norton Collection",
  "description": "This edition has a linked \"Table of Contents\" and has been beautifully formatted (searchable and interlinked) to work on your Amazon e-book reader, Amazon Desktop Reader, and your ipod e-book reader.'Visions of Distant Shores' is a collection of stories written by award-winning science-fiction author, Andre Norton. In most of Norton's works, alienated outsiders undertake a journey through which they realize their full potential. Many planets in the books are Earth-like places, where humans can live without special protection, and have extensive flora and fauna which are described in considerable detail and often have substantial bearing on the plot.On February 20, 2005, the Science Fiction and Fantasy Writers of America, which had earlier honored her with its Grand Master Award in 1983, announced the creation of the Andre Norton Award, to be given each year for an outstanding work of fantasy or science fiction for the young adult literature market, beginning in 2006. Nobody today is telling better stories of straight-forward interstellar adventure.Included in this volume:Book 1: Storm Over Warlock - Stranded on the alien world of Warlock, Shann Lantree's expedition camp has been wiped out by the Throgs, beings so alien that humans have yet to communicate with them. Lantree must quickly learn how to survive under harsh conditions while being chased by the Throgs -- and how to distinguish the real from the dreamed when he meets the mysterious Wyverns. A satisfying and mature novel which readers will seize upon if they want to enjoy a good adventure story...Book 2: Star Born - When the oppressive global dictatorship of Pax took over Earth they put a stop to space exploration. Still, a few rebels escaped in the sleeper ships to found free new colonies -- or perish in the attempt. Those few colonists that reached inhabitable worlds were cut off for centuries, and in that isolation and freedom they developed the mysterious mental powers that \"civilization\" had all but destroyed...Book 3: Star Hunter - Somewhere on the jungle world of Jumala, there was a man in hiding--a man whose mind had been reconditioned with another's brain pattern and for whom there was a fabulous reward. Star Hunter is a thrill-packed account of that other-worldly game of hide-and-seek between a man who did not know all his own powers and an interstellar safari that sought something no man had a right to find...Book 4: Plague Ship - A fast-moving suspense tale, full of unusual detail and unexpected turns. Several highlights make the book really the sunset gorp hunt on the reefs of an oily sea; a raid on an asteroid's emergency station; and a landing in the Big Burn, resulting in an encounter with the mutant life-forms that reside there...Book 5: Voodoo Planet - Dane Thorson of the space-trader 'Solar Queen' found himself embroiled in a desperate battle of minds between the rational science of the spaceways and the hypnotic witchcraft of the mental wizard that ruled the Voodoo Planet...Book 6: The Gifts of Asti - Varta, the last priestess of Asti, lives alone with Lur, a telepath of the lizardfolk, in Asti's isolated mountain retreat. Decadent Memphir has long since drifted away from the austere paths of Asti, and now the barbarians of Klem are sacking the city, and the smoke of its burning drifts up to the temple...Book 7: The People of the Crater - \"Send the Black Throne to dust; conquer the Black Ones, and bring the Daughter from the Caves of Darkness.\" These were the tasks Garin must perform to fulfill the prophecy of the Ancient Ones--and establish his own destiny in this hidden land!These are the original and unabridged versions of these tales.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Andre Norton",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/8182786-visions-of-distant-shores"
}