{
  "title": "Horror Stories",
  "description": "TWENTY-SIX TALES OF TERROR...This collection features a menagerie of horror stories. Some are scary. Some are disturbing. Some are funny. Meet werewolves, vampires, zombies, psychopaths, aliens, cannibals, ghosts, and various things that go bump in the night.Previously published in dozens of anthologies and magazines, some of these tales are mild, but some are extreme. Let the reader beware...The stories Finicky Eater - It's after a nuclear war, and a mother and her son are in a fallout shelter, the food long long...The Screaming - Van Helsing and vampires, in 1960s England.Mr. Pull Ups - A body modification tale taken to the extreme.The Shed - Two burglars find the door to hell.Them’s Good Eats - Rednecks vs. aliens, on a spaceship ride of horrors.First Time - A coming of age tale where all may not be what it seems.Forgiveness - A dying serial killer asks for a priest to hear his last confession.Redux - Ghost story noir, about a private eye and a deadly haunting.The Bag - What's in the bag? You really don't want to know...Careful, He Bites - Lycanthrope flash fiction.Symbios - A sci-fi novella about man's first encounter with alien life, and how things can quickly turn bad.A Matter of Taste - Zombie flash fiction.Embrace - A bit of gothic horror.Trailer Sucks - Some trailer park jerks kidnap a vampire.Marky - Flash fiction, from a twisted point of view.Punishment Room - A horrific suspense tale about a not-so-distant future.The Confession - Terrible crimes, told entirely in dialog.Basketcase - Hardboiled noir with a horrific twist.The Agreement - A gambler pays the ultimate price to get out of a debt.Well Balanced Meal - The worst restaurant you've ever been in.S.A. - A werewolf novella about a Shapshifters Anonymous group that must battle Santa Claus.Dear Diary - A very twisted pom pon girl reveals the secret of her inner strength.Mr. Spaceman - We've come to mate with earth women.Appalachian Lullaby - What do you do with a radioactive monkey?Treatment - A troubled boy talks to a psychologist, but are either what they seem?A Sound of Blunder - A parody of Bradbury, co-written with F. Paul Wilson.If you are a more sensitive (or adventurous) reader, the Konrath scale rates specific categories from 1 (lowest) to 10 (highest) to give you some idea if this is your kind of bookHORROR STORIES by JA KonrathScary - 10Violent - 9Funny - 2Sexy - 2",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Splatterpunk",
    "Anthologies",
    "Supernatural",
    "Audiobook"
  ],
  "author": "Jack Kilborn",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/8185953-horror-stories"
}