{
  "title": "On the Outskirts of Normal: Forging a Family Against the Grain",
  "description": "\"Having driven across the country to see her brand new adopted granddaughter, Debra Monroe's mother says the first thing that comes into her `I knew she's be black, but not this black.' Monroe simply says `Mon, there's a blank in the baby book called Grandma's First Words.' The sly, dry humor of this, the offering of the second chance, the reminder that everything, even the mistakes, will be written down---tells you most of what you need to know about Monroes approach to life, and to memoir. Her generosity of spirit never fails her.\" Marion Winik, author of First Comes Love\"Sometimes the barren years bloom, flourishing atop old scar tissue. This is the premise of Debra Monroe's extraordinarily poignant, powerfully written memoir of her journey into strength and unlikely motherhood with its unexpected joys, gathering along the way the brave yet painful knowledge of what love costs. Monroe is an unflinching commentator on self as well as society, a myth-buster as well as a trailblazer, and I suspect the significance of the book will grow in value, become a cultural benchmark, in the decades ahead of us.\" Bob ShacochisNational Book Award-winning author of Easy in the Islands and A Gastronomic Interpretation of Love\"On the Outskirts of Normal is a modern story for modern times with a generous dose of old-fashioned values at its core. The adoption of a beautiful black baby girl by a white single woman shouldn't still be news in today's America, but it is, perhaps especially so in a small Texas town. Told in a voice that is feisty, wise, unsentimental, humorous, candid, and consoling, Debra Monroe's memoir will entrance its readers, as she struggles to create a whole new conversation about the true meaning of family. This book is both a literary triumph and a triumph of the heart.\" Madeleine BlaisPulitzer Prize winner and author of In These Girls, Hope Is a Muscle\"Compelling, full of pain and honesty, On the Outskirts of Normal wrestles with the messiness of the search for insight in the wake of incessant trouble. Debra Monroe approaches the subject of race, always fraught with landmines, with humor and humility. Full of stylish shifts and comic, edgy, observations, Monroe's story reveals much about parents who are present and parents who are absent, about good and bad caregiving, and about the stability of the places we call home.\"---David Haynes, author of The Full Matilda\"The high-velocity verve and gripping insight of Debra Monroe's story is matched by the level of her compassion---anyone who cares this much about getting a little girl's hair just right is a truly endearing person. Flaws and question marks, local places, very particular people, wit and weariness and astonishment at the myriad ways a life unfolds---all invite readers not only to the comfortable `outskirts of normal' but to the genuine heart of it all.\"---Naomi Shihab Nye, author of You and Yours\"Debra Monroe's immensely appealing memoir forges not only her charming `family against the grain,' but a remarkable canniness about motherhood and its twin perils, grief and love.\" Karen Brennan, author of Being with Rachel\"Any narrator who repels an intruding raccoon by pelting it with poems has my attention. Debra Monroe has written a wise, unsparing testament to the fierceness and fragility of love.\"---Michael Perry, author of A Year of Poultry, Pigs and Parenting",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Adoption",
    "Unfinished",
    "Book Club"
  ],
  "author": "Debra Monroe",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/8191643-on-the-outskirts-of-normal"
}