{
  "title": "Black and Blue",
  "description": "With this stunning novel about a woman and a marriage that begins in passion and becomes violent, the Pulitzer Prize--winning journalist and bestselling author of One True Thing and Object Lessons moves to a new dimension as a writer of superb fiction. \"If literature were judged solely by its ability to elicit strong emotions,\" Kirkus Reviews said about One True Thing , \"columnist-cum-novelist Quindlen would win another Pulitzer.\"  And the same will be said about Black and Blue , a brilliant novel of suspense, substance, and importance.In Black and Blue , Fran Benedetto tells a spellbinding how at nineteen she fell in love with Bobby Benedetto, how their passionate marriage became a nightmare, why she stayed, and what happened on the night she finally decided to run away with her ten-year-old son and start a new life under a new name. Living in fear in Florida--yet with increasing confidence, freedom, and hope--Fran unravels the complex threads of family, identity, and desire that shape a woman's life, even as she begins to create a new one. As Fran starts to heal from the pain of the past, she almost believes she has escaped it--that Bobby Benedetto will not find her and again provoke the complex combustion between them of attraction and destruction, lust and love.Black and Blue is a beautifully written, heart-stopping story in which Anna Quindlen writes with power, wisdom, and humor about the real lives of men and women, the varieties of people and love, the bonds between mother and child, the solace of family and friendship, the inexplicable feelings between people who are passionately connected in ways they don't understand. It is a remarkable work of fiction by the writer whom Alice Hoffman has called \"a national treasure.\"",
  "genres": [
    "Fiction",
    "Contemporary",
    "Adult Fiction",
    "Chick Lit",
    "Book Club",
    "Abuse",
    "Novels"
  ],
  "author": "Anna Quindlen",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/819629.Black_and_Blue"
}