{
  "title": "Bounce: The Art of Turning Tough Times into Triumph",
  "description": "Why do many people and companies crumble in the face of difficulty, while others use adversity to bounce back even stronger? Here from New York Times bestselling author Keith McFarland is a leadership fable for those wary of fables, a story that rejects pat, heard-it-before advice and shows–in a startlingly fresh way–how to use challenges to make both yourself and your organization stronger.Mike Maloney, division manager for Boston-area tech firm CRX, returns from a business trip late one night feeling demoralized. His unit is about to lose its biggest customer and its most valuable employee. Mike wonders how much longer he and his staff can keep up their relentless work schedule and meet upper management’s new request for cost cuts. Something has to give. Hoping to blow off steam, he heads to a gym, where he runs into Joe, a former army Ranger.After listening to Mike vent about the cards he’s been dealt, the ex-soldier says, \"Sounds like your company is ready to bounce.\" Mike looks confused, so Joe begins tutoring him in lessons from the battlefield. It is precisely when all seems lost, says Joe, that the opportunity exists to rethink a situation and make real progress. Over the next two weeks, Joe turns Mike’s view of himself and his company upside down. Despite his Ivy League MBA and extensive experience running companies, Mike has a lot to learn from this young grunt just back from Afghanistan. For example, he learns that under pressure, people experience two kinds of anxiety–one that hurts performance and one that helps it. Mike uses the insight to get his troops running toward the sound of gunfire, and in the process, learns that \"bounce\" can happen outside the workplace, too. With Joe’s help, he finds his own personal bounce.Drawing inspiration from such sources as the work of M.I.T. social scientist Ed Schein, the film Saving Private Ryan, and his own experiences as a CEO leading companies, McFarland cleverly weaves a story whose practical insights can be put to use immediately. With an invaluable wrap-up section at the book’s end that analyzes each of the key ideas and shows how they can be applied in work and personal life, Bounce may be the most indispensable guide to facing challenges ever written.From the Hardcover edition.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Keith McFarland",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/8191974-bounce"
}