{
  "title": "Noble House",
  "description": "De gehele roman speelt zich in nauwelijks meer dan een week in Hong Kong af.Het is een verschrikkelijk tumultueuze week: kidnapping, moord, fraude, natuurrampen, feesten, romantiek, hartstocht.Noble House is in 1963 de grootste en meest welvarende handelsonderneming van Hong Kong. Talrijk zijn de geruchten die over dit huis de ronde doen. Noble House wordt bestuurd door Ian Dunross, hij is de Taip-an, de westerse leider. De onbetwiste meester van de onderhandelingstafel, die op de meest gevaarlijke momenten een ijzige kalmte tentoonspreidt. In Hong Kong zwaaien de Engelsen de scepter en vinden Chinezen regelmatig mogelijkheden om de beslissingen van hun heersers in hun eigen voordeel te vertalen. Dan wordt dit Britse imperium opgeschrikt door de komst van een Amerikaanse man en vrouw, die hun zinnen hebben gezet op de verovering van de Aziatische handelsmarkt. Ze zijn experts in financiële zaken, doch weten niets van de wetten en regels die het leven in Hong Kong beheersen. Hong Kong is in de ban van het geld. De strijd om welzijn en aanzien te verwerven speelt zich af op alle niveaus: van het goklustige dienstmeisje tot de meedogenloze rivaliteit tussen de presidenten van de machtigste handelsondernemingen. Twee van hen Ian Dunross van Noble House en Quillan Gornt van Rothwel-Gornt raken verwikkeld in een strijd op leven en dood. Noble House verkeert in ernstige financiële moeilijkheden en de toekomst van Hong Kong hangt af van het lot dat deze handelsonderneming is beschoren. Voor Gornt is dit een unieke kans om een poging te wagen zijn concurrent voor eeuwig te vernietigen. De Amerikanen doen hun uiterste best de twee rivalen tegen elkaar uit te spelen. Hong Kong trilt op zijn grondvesten...",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "China",
    "Asia",
    "Thriller",
    "Adventure"
  ],
  "author": "James Clavell",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/8191751-noble-house"
}