{
  "title": "Triumph: Life After the Cult--A Survivor's Lessons",
  "description": "A moving and inspirational true story of one woman’s life after fleeing the ultra-fundamentalist American religious sect featured in Keep Pray and Obey—from the New York Times bestselling author of Escape “Triumph is thoughtful, intelligent, and engaging.”—Meg Wolitzer, bestselling author of The Interestings In 2003, Carolyn Jessop, a lifelong member of the extremist Mormon sect the Fundamentalist Church of Jesus Christ of Latter-Day Saints (FLDS), gathered up her eight children, including her profoundly disabled four-year-old son, and escaped in the middle of the night to freedom. After detailing the shocking conditions of FLDS and her harrowing flight in her memoir, Escape, Carolyn reveled in her newfound identity as a bestselling author, a devoted mom, and a loving companion to the wonderful man in her life. She thought she had put her past firmly behind her. Then, on April 3, 2008, it came roaring back when the state of Texas, acting on a tip from a young girl who’d called a hotline alleging abuse, staged a surprise raid on the Yearning for Zion Ranch, a sprawling, 1700-acre compound near Eldorado, Texas, where the jailed FLDS  “prophet” Warren Jeffs had relocated his sect’s most “worthy” members three years earlier. The ranch was being run by Merril Jessop, Carolyn’s ex-husband and one of the cult’s most powerful leaders. As a mesmerized nation watched the crisis unfold, Carolyn was called upon as an expert to help authorities understand the customs and beliefs of the extremist religious sect. In Triumph, Carolyn tells the real, harrowing story behind the raid and sets the record straight on much of the damaging misinformation that flooded the media in its aftermath. She recounts the setbacks and the successes, all while weaving in details of her own life in the years since her escape—including her budding role as a social critic and her struggle to make peace with her eldest daughter’s heartbreaking decision to return to the cult. An extraordinary woman who has overcome countless challenges and tragedies in her life, Carolyn shows us in this book how she has triumphed in spite of everything—and how you can, too, no matter what adversity you face.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Religion",
    "Biography",
    "Cults",
    "Polygamy",
    "Biography Memoir"
  ],
  "author": "Carolyn Jessop",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/8193750-triumph"
}