{
  "title": "Franklin and Eleanor: An Extraordinary Marriage",
  "description": "Franklin Delano and Eleanor Roosevelt’s marriage is one of the most celebrated and scrutinized partnerships in presidential history. It raised eyebrows in their lifetimes and has only become more controversial since their deaths. From FDR’s lifelong romance with Lucy Mercer to Eleanor’s purported lesbianism—and many scandals in between—the American public has never tired of speculating about the ties that bound these two headstrong individuals. Some claim that Eleanor sacrificed her personal happiness to accommodate FDR’s needs; others claim that the marriage was nothing more than a gracious façade for political convenience. No one has told the full story until now.In this groundbreaking new account of the marriage, Hazel Rowley describes the remarkable courage and lack of convention—private and public—that kept FDR and Eleanor together. She reveals a partnership that was both supportive and daring. Franklin, especially, knew what he owed to Eleanor, who was not so much behind the scenes as heavily engaged in them. Their relationship was the product of FDR and Eleanor’s conscious efforts—a partnership that they created according to their own ambitions and needs.In this dramatic and vivid narrative, set against the great upheavals of the Depression and World War II, Rowley paints a portrait of a tender lifelong companionship, born of mutual admiration and compassion. Most of all, she depicts an extraordinary evolution—from conventional Victorian marriage to the bold and radical partnership that has made Franklin and Eleanor Roosevelt go down in history as one of the most inspiring and fascinating couples of all time.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Book Club",
    "Biography Memoir",
    "American History",
    "Politics"
  ],
  "author": "Hazel Rowley",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/8190375-franklin-and-eleanor"
}