{
  "title": "Destroyer",
  "description": "It has been two years since the starship Phoenix left Alpha Station on a rescue mission to a faraway sector of space where over four thousand human spacers were under attack by a hostile alien race. Now, the Phoenix is almost home, having successfully rescued the stranded colonists through the combined negotiating talents of Bren Cameron - brilliant human paitihi to the atevi court, currently representing Tabini-aiji, the atevi ruler - and of Tabini's grandmother llisidi, the aiji-dowager, a fearsome, wily, and ambitious atevi leader in her own right.Fortunately, both Bren and llisidi have considerable experience with the alien interface, since for two hundred years the human paitihi have walked a fine and dangerous line, trading technological information with the volatile atevi to ensure the continued peace and safety of the small human colony living in isolation on the island of Mosphiera.It had taken all of Bren's and llisidi's diplomatic abilities to make peacef ul first contact with the kyo. And though their mission had been successful, they returned home with a possible threat to their world. For the kyo considered everyone they met to be bonded and allied with them forever, a permanent part of their community-although they themselves had alien enemies they could bring into atevi territory.Exhausted from a two-year journey, with resources strained by four thousand extra mouths to feed, the crew of the Phoenix yearns for the luxuries of home. But when the ship makes the final jump into atevi space, things do not seem right. And when they make contact with Jules Ogun, Captain of Alpha Station, they learn the worst: that supplies to the Station have been cut off; that civil war has broken out on the atevi mainland; that the powerful Western Association has been overthrown; and that Tabini-aiji, Bren's primary supporter and llisidi's grandson and ally, is missing and may be dead.With no one left to lead the Western Association, llisidi and Bren know that the survival of their allies lies in their hands. And though two of the three new-built Shuttles have been disabled on-planet, the third is docked at Alpha. They must make planetfall as soon as possible to insure the greatest level of safety, for they know that their enemies, realizing that the Phoenix has returned, will be awaiting them in hopes of destroying the Shuttle during reentry. With the atevi world at war, the only safe landing strip lies on the human colony at Mosphiera. Although there are many dangers inherent in bringing a powerful atevi leader such as llisidi onto human lands, Bren realizes they have no choice but to do so.But even if they safely survive their landing, will Bren and llisidi together prove strong enough to muster the remaining shards of the Western Association and regain control of their planet?",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Science Fiction Fantasy",
    "Aliens",
    "Audiobook",
    "Adventure"
  ],
  "author": "C.J. Cherryh",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/8200243-destroyer"
}