{
  "title": "Adrenal Fatigue: The 21st Century Stress Syndrome",
  "description": "Find out how stress affects your body and what you can do to recover and protect your health in this comprehensive self-help book.Are you:* Tired for no reason?* Having trouble getting up in the morning?* Depending on coffee or colas to keep you going?* Feeling run down and stressed?* Dragging through each day?* Craving salty or sweet snacks?* Struggling to keep up with life's daily demands?* Unable to bounce back from stress or illness?* Not having fun anymore?* Experiencing decreased sex drive?* Simply too tired to enjoy life?If you answered yes to two or more of these questions, you will probably benefit from reading this book!Adrenal Fatigue: the 21st Century Stress Syndrome is a treasure trove of information and help for everyone who regularly experiences any of the above, or the many other signs of stress described in the book. Dr. Wilson explains that healthy functioning of your adrenal glands is essential to virtually all aspects of your health as well as to your ability to handle stress. For this reason, stress and adrenal function often also play a role in many health conditions, such as frequent infections, chemical sensitivities, allergies, autoimmune diseases like fibromyalgia and rheumatoid arthritis, menopause and PMS, thyroid function imbalances, chronic fatigue syndrome, low libido, chronic anxiety, and mild depression. All of these problems and more may be aggravated by the effects stress can have on your adrenal glands.Under certain circumstances, stress can fatigue your adrenals. It is estimated that most North Americans experience some form of stress-related adrenal fatigue at some time. Although many people realize that stress is a problem in their lives, few understand the actual physical ways stress acts on the body and mind through the adrenal glands – or more importantly, what to do about it. Unfortunately, even most doctors still do not recognize the common health picture produced by adrenal fatigue. This leaves a lot of people suffering without anywhere to turn for help. That's where Adrenal Fatigue: The 21st Century Stress Syndrome comes in.In Adrenal Fatigue: The 21st Century Stress Syndrome, Dr. Wilson explains not only how stress affects your health but what you can do to un-fatigue your adrenals, protect your health and become more stress hardy. He has written this book in an entertaining, easy-to-follow style that is designed to guide you through everything you need to know about stress, adrenal fatigue and your health. It contains the questionnaire Dr. Wilson developed and used in his practice plus simple self-tests to help you determine if you are experiencing adrenal fatigue and how much it may be affecting you. Dozens of cartoons, illustrations, charts and fascinating case histories from Dr. Wilson's files make this book hard to put down. From beginning to end it will take you step-by-step to reclaim your life from the negative effects of stress.",
  "genres": [
    "Health",
    "Nonfiction",
    "Self Help",
    "Medical",
    "Nutrition",
    "Medicine",
    "Science"
  ],
  "author": "James L.  Wilson",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/82015.Adrenal_Fatigue"
}