{
  "title": "Touch Blue",
  "description": "Touch Blue and your wish will come true.\"Why take chances?\" says eleven-year-old Tess Brooks. \"Especially when it's so easy to let the universe know what you want by touching blue or turning around three times or crossing your fingers.\"But Tess is coming to know that it's not always that simple.The state of Maine plans to shut down her island's schoolhouse, which would force Tess's family to move to the mainland--and Tess to leave the only home she has ever known. Fortunately, the islanders have a plan increase the numbers of students by having several families take in foster children. So now Tess and her family are taking a chance on Aaron, a thirteen-year-old trumpet player who has been bounced from home to home. And Tess needs a plan of her own--and all the luck she can muster. Will Tess's wish come true or will her luck run out?Newbery Honor author Cynthia Lord offers a warm-hearted, humorous, and thoughtful look at what it means to belong--and how lucky we feel when we do. Touch Blue, sure as certain, will touch your heart.Honors for Touch 2011 Lupine Award, Maine Library Association.2011 Maine Literary Award, Maine Writers and Publishers Alliance.2010 Best Books For Children, Christian Science Monitor.Best Children's Books of 2010, Book Page.Best Children's Books of the Year (2011), Bank Street College (starred for outstanding merit)Editor's Pick, Adoptive Families magazine.Nominated Pennsylvania Young Readers Choice AwardDorothy Canfield Fisher Award (Vermont)Rhode Island Children's Book Award Rhode Island Teen Book AwardIndian Paintbrush Award (Wyoming)North Carolina Children's Book AwardThe Charlotte Award (New York)Louisiana Young Readers Choice AwardHorn Toad Tales, Cypress-Fairbanks ISD, Texas",
  "genres": [
    "Realistic Fiction",
    "Middle Grade",
    "Fiction",
    "Childrens",
    "Young Adult",
    "Family",
    "Juvenile"
  ],
  "author": "Cynthia Lord",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/8203202-touch-blue"
}