{
  "title": "The Masque of Africa: Glimpses of African Belief",
  "description": "Like all of V. S. Naipaul’s “travel” books, The Masque of Africa encompasses a much larger narrative and to judge the effects of belief (in indigenous animisms, the foreign religions of Christianity and Islam, the cults of leaders and mythical history) upon the progress of civilization.From V. S. “For my travel books I travel on a theme. And the theme of The Masque of Africa is African belief. I begin in Uganda, at the center of the continent, do Ghana and Nigeria, the Ivory Coast and Gabon, and end at the bottom of the continent, in South Africa. My theme is belief, not political or economical life; and yet at the bottom of the continent the political realities are so overwhelming that they have to be taken into account.“Perhaps an unspoken aspect of my inquiry was the possibility of the subversion of old Africa by the ways of the outside world. The theme held until I got to the South, when the clash of the two ways of thinking and believing became far too one-sided. The skyscrapers of Johannesburg didn’t rest on sand. The older world of magic felt fragile, but at the same time had an enduring quality. You felt that it would survive any calamity.“I had expected that over the great size of Africa the practices of magic would significantly vary. But they didn’t. The diviners everywhere wanted to ‘throw the bones’ to read the future, and the idea of ‘energy’ remained a constant, to be tapped into by the ritual sacrifice of body parts. In South Africa body parts, mainly of animals, but also of men and women, made a mixture of ‘battle medicine.’ To witness this, to be given some idea of its power, was to be taken far back to the beginning of things.“To reach that beginning was the purpose of my book.”The Masque of Africa is a masterly achievement by one of the world’s keenest observers and one of its greatest writers.",
  "genres": [
    "Africa",
    "Travel",
    "Nonfiction",
    "History",
    "Religion",
    "Essays",
    "Literature"
  ],
  "author": "V.S. Naipaul",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/8201466-the-masque-of-africa"
}