{
  "title": "Fork It Over: The Intrepid Adventures of a Professional Eater",
  "description": "A hilarious series of culinary adventures from GQ's award-winning food critic, ranging from flunking out of the Paul Bocuse school in Lyon to dining and whining with Sharon Stone.Alan Richman has dined in more unlikely locations and devoured more tasting menus than any other restaurant critic alive. He has reviewed restaurants in almost every Communist country (China, Vietnam, Cuba, East Germany) and has recklessly indulged his enduring passion for eight-course dinners (plus cheese). All of this attests to his herculean constitution, and to his dedication to food writing.In Fork It Over, the eight-time winner of the James Beard Award retraces decades of culinary adventuring. In one episode, he reviews a Chicago restaurant owned and operated by Louis Farrakhan (not known to be a fan of Jewish restaurant critics) and completes the assignment by sneaking into services at the Nation of Islam mosque, where no whites are allowed. In Cuba, he defies government regulations by interviewing starving political dissidents, and then he rewards himself with a lobster lunch at the most expensive restaurant in Havana. He chiffonades his way to a failing grade at the Paul Bocuse school in Lyon, politely endures Sharon Stone's notions of fine dining, and explains why you can't get a good meal in Boston, spurred on by the reckless passion for food that made him \"the only soldier he knows who gained weight while in Vietnam\" and carried him from his neighborhood burger joint to Le Bernardin.Alan Richman, once described as the \"Indiana Jones of food writers,\" has won more major awards than any other food writer alive, including a National Magazine Award, eight James Beard Awards for restaurant reviewing, and two James Beard M.F.K. Fisher distinguished writing awards.The all new cover will emphasize Richman's globetrotting persona and attract a wide audience",
  "genres": [
    "Food",
    "Nonfiction",
    "Food Writing",
    "Memoir",
    "Essays",
    "Cooking",
    "Foodie"
  ],
  "author": "Alan Richman",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/82032.Fork_It_Over"
}