{
  "title": "Divine Nourishment: A Woman's Sacred Journey with Food",
  "description": "Divine NourishmentA Woman's Sacred Journey with FoodDid you realize that living and eating seasonally is actually a map for transformation that brings health and balance on the physical, emotional AND spiritual levels? Divine Nourishment offers superb support in reclaiming lost and rejected aspects of ourselves. Learn how to recognize your authentic self through the eyes of nature as you deepen your relationship with the natural rhythm and flow of life. Ground and nourish yourself according to the Earth's wisdom while healing the collective wounding of the feminine that perpetuates the imbalance in our culture. Apply practical daily use of healthy organic seasonal foods, recipes, potions, tonics, practices, and cleanses that are nourishing and appropriate for alignment with the seasonal journey.\"Mary Lane infuses her cooking, her thinking, her dance on this earth with exquisite feminine grace and wisdom.\"~ Gabrielle Roth, author of Sweat Your Prayers & creator of 5RHythms®\"Mary is a wonderful chef, plant spirit medicine practitioner, lover of nature, and world traveler. Her book is a mystical-made-physical journey into the depths of self, body, and spiritual connection. This long-awaited treasure holds such a simple key to satisfying a deep spiritual nourishing ourselves, body, mind, and spirit, as well as connect with Mother Earth through the sacred act of nourishment. I love, love, love the book, though I have to admit reading of the 'wounding' absolutely tore me apart... truly from the heart.\"~ Dianne Seale\"Mary's book offers us a brilliantly conceived and richly layered compilation of the wisdom of the ages. Mary's offering draws from her many years of study as well as from her own experience and direct communication with the Divine. Ranging from a profound explanation of the very forces of Creation to practical suggestions for embodying these forces in daily life, Mary's book is a true guide for healing and restoring the Divine Feminine within us and in our world.\"~ Katia Wolf\"Finally.....I am sitting in my room in Rome and using the extraordinary early awakenings to read Mary's book in total...not just fragments allowed to me over the last few months. I am touched by the passion of her conviction and knowledge and opened to tears of recognition of dynamics long left without words. She has had some amazing journeys that I am thrilled to read about again in book form. It gives outline to a journey that often can be daunting as there is no map for this ride! However, she tells it with the grace of hindsight with all of the trials and glory, highs and lows that come with this human form with a desire and commitment to live a spiritual life. Kudos to Mary and the healing for those who come to read her story.\"~ Stevie Gayle",
  "genres": [
    "Food"
  ],
  "author": "Mary Lane",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/8198011-divine-nourishment"
}