{
  "title": "South Bronx Rising: The Rise, Fall, and Resurrection of an American City",
  "description": "Jill Jonnes's recounting of the rise, fall, and resurrection of the Bronx has become a classic of urban history. In this new edition, she describes in a new final chapter the extraordinary and monumental rebuilding of the borough by the grass-roots groups that was just getting underway in1984. The original book was hailed as a vivid history of the Bronx from its origins as colonial farmlands to the borough's 1980s status as one of the nation's foremost urban disasters. The book tells the colorful story of the Bronx, starting with its development as a New York suburb and boomtownwhen hundreds of thousands of German, Irish, Italians, and above all, Jewish immigrants flowed into the borough to raise their families. Franklin Delano Roosevelt, assisted by his powerful lieutenant, Boss Ed Flynn, built vast Democratic majorities in the polyglot Bronx into political domination ofNew York and the nation. After World War II, the Bronx underwent its second boom, beginning with emigrants from Puerto Rico and blacks displaced from Manhattan. On their heels came the camp followers of modern urban drug dealers, real estate pirates, arsonists. By the mid-1970s the Bronxwas burning. Block after block, once given over to working- and middle-class family life, was now utterly destroyed, abandoned, given up on. The teeming, populous Bronx had turned into an American urban desert. This borough, which in its heyday had produced such notable Americans as Clifford Odets,Paddy Cheyefsky, Lauren Bacall, Herman Wouk, Jules Feiffer, Jake LaMotta, Stanley Kubrick, E.L. Doctorow, Neil Simon, and Tony Curtis, now lay in ashes, visible to us mainly as a dreadful object lesson. Yet change was in sight. Even while the worst destruction was taking place, new forces wererising to set aside or remake the tired machinery of government, allying such institutions as the Catholic Church, insurance companies, and dedicated non-profits to rally the Bronx and turn the tide of urban thinking. In her new final chapter, Dr. Jonnes describes the triumph of the grass-rootsgroups as they fulfilled their great dream of rebuilding these devastated neighborhoods.",
  "genres": [
    "History",
    "New York",
    "Nonfiction"
  ],
  "author": "Jill Jonnes",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/820744.South_Bronx_Rising"
}