{
  "title": "Personal Power II Unabridged Cassette version",
  "description": "\"Volume 1: * Unleash Your Power! (2 No. 1, 2). Volume 2: * How To Shape Your Destiny Now (2 No. 3, 4). Volume 3: * How To Get What You Really Want (2 No. 5, 6). Volume 4: * The Ultimate Secret To Lifelong Success (2 No. 7, 8). Volume 5: How To Create A Compelling Future (2 No. 9, 10). Volume 6: * Moving Beyond Procrastination To Unlimited Power! (2 No. 11, 12). Volume 7: * How To Unleash The Financial Genius Within You (2 No. 13, 14). Volume 8: * Turn Fear And Self-Sabotage Into Confidence And Success (2 No. 15, 16). Volume 9: * How To Increase Your Energy * The Power Of Successful Relationships (2 No. 17, 18). Volume 10: * The Final Breakthrough! (2 No. 19, 20). Volume 11: * Program Yourself For Total Success! (2 No. 21, 22). Volume 12: * The Driving The Six Human Needs * Meetings With Masters (3 No. 23, 24, 25).\" \"For nearly two decades, Anthony Robbins has dedicated his life to discovering the most advanced principles for producing accelerated change. He is the nation's expert in the psychology of peak performance and personal, professional, and organizational \"turnaround\" and has led the way in providing cutting-edge tools for individuals wamtomg tp ,ale radical improvements in their careers, emotional wellbeing, relationships, finances, time management, health and vitality, and professional growth. Anthony Robbins has served as a peak performance consultant to the 1992 America's Cup winner, America; 1993 Stanley Cup finalists, the Los Angeles Kings; 1994 U.S. Open Champion, Andre Agassi; and the 1995 San Antonio Spurs. Robbins has also been a consultant to executives from such Fortune 500 companies as American Express and Xerox. IBM, AT&T, Hallmark, Southwestern Bell, and the U.S. Army have all utilized and benefited from Robbins' technologies. Robbins has advised the President of the United States and members of two royal families. ...",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Psychology",
    "Business",
    "Audiobook"
  ],
  "author": "Anthony Robbins",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/82059.Personal_Power_II_Unabridged_Cassette_version"
}