{
  "title": "Der Zauberberg",
  "description": "Wenn irgendwann einmal ein Preis für den besten Buchtitel vergeben werden sollte, würde für mich Thomas Manns Zauberberg ganz oben auf die Liste gehören. Noch bevor ich das Buch gelesen hatte, weckte schon das Wort Neugier auf eine magische Welt. Nun, wer den Zauberberg kennt, weiß, daß dies kein Buch von fremden Feenwelten ist, und doch waltet hier eindeutig Magie. Die erste magische Leistung besteht darin, eine Handlung, die in einem Satz zusammengefaßt werden kann, auf 1.000 Seiten zu packen: Der junge Hamburger Hans Castorp, Sproß einer Patrizierfamilie lebt bis zum Ausbruch des ersten Weltkriegs sieben Jahre in einem Schweizer Luxussanatorium für Lungenkranke, ohne selbst krank zu sein. Die zweite magische Leistung ist Thomas Manns Sprache, die auch in tausend Jahren nichts von ihrer Kraft verloren haben wird. Die dritte magische Leistung ist die Behandlung der Figuren, die alle mehr mehr sind als bloße Protagonisten. Sie sind Exponate ihrer Zeit, jede für sich repräsentiert einen Teil geistigen Lebens in einer Ära, deren Ende sich vollzog während Thomas Mann am Zauberberg saß und schrieb. Die vierte magische Leistung schließlich, die zauberbergigste vielleicht, ist das Spiel mit dem Leser. Oder besser: das Spiel mit der Geschwindigkeit des Lesers. Thomas Mann erreicht, daß dem Leser zehn Minuten Lesen wie eine halbe Stunde Lesen vorkommen, und zwar genau dann, wenn Hans Castorp denkt, er habe eine halbe Stunde geträumt. Wie sich herausstellt, waren es zehn Minuten. Elf Jahre hat Thomas Mann an dem Buch geschrieben, das doch eigentlich nur eine Weiterführung des Themas aus Tod in Venedig sein sollte. Es wurde einer der meist gelesenen deutschen Romane. Zu recht. --Bettina Albert",
  "genres": [
    "Fiction",
    "German Literature",
    "Literature",
    "Philosophy",
    "Novels",
    "Classics",
    "Germany"
  ],
  "author": "Thomas Mann",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/820630.Der_Zauberberg"
}