{
  "title": "Storms of My Grandchildren: The Truth about the Coming Climate Catastrophe and Our Last Chance to Save Humanity",
  "description": "An urgent and provocative call to action from the world's leading climate scientist-speaking out here for the first time with the full story of what we need to know about humanity's last chance to get off the path to a catastrophic global meltdown, and why we don't know the half of it.In Storms of My Grandchildren, Dr. James Hansen-the nation's leading scientist on climate issues-speaks out for the first time with the full truth about global The planet is hurtling even more rapidly than previously acknowledged to a climatic point of no return.Although the threat of human-caused climate change is now widely recognized, politicians have failed to connect policy with the science, responding instead with ineffectual remedies dictated by special interests. Hansen shows why President Obama's solution, cap-and-trade, which Al Gore has signed on to, won't work; why we must phase out all coal, and why 350 ppm of carbon dioxide is a goal we must achieve if our children and grandchildren are to avoid global meltdown and the storms of the book's title. This urgent manifesto bucks conventional wisdom(including the Kyoto Protocol) and is sure to stir controversy, but Hansen-whose climate predictions have come to pass again and again, beginning in the 1980s when he first warned Congress about global warming-is the single most credible voice on the subject worldwide. Hansen paints a devastating but all-too-realistic picture of what will happen in the near future, mere years and decades from now, if we follow the course we're on. But he is also an optimist, showing that there is still time to do what we need to save the planet. Urgent, strong action is needed, and this book will be key in setting the agenda going forward to create a groundswell, a tipping point, to save humanity-and our grandchildren-from a dire fate more imminent than we had supposed.",
  "genres": [
    "Science",
    "Nonfiction",
    "Climate Change",
    "Environment",
    "Politics",
    "Nature",
    "Sustainability"
  ],
  "author": "James  Hansen",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/8210064-storms-of-my-grandchildren"
}