{
  "title": "Shadowbrook",
  "description": "The \"Los Angeles Times\" called Beverly Swerling's \"City of Dreams\" \"a near-perfect historical novel.\" Now, in \"Shadowbrook,\" set against the backdrop of the famously bloody French and Indian War, Swerling once again tells a gripping, multilayered story of colonial America that will captivate both new readers and admirers of her critically acclaimed earlier novel.1754. In a low-lying glen in the Ohio Country, where both the French and the English claim dominion, the first musket ball fired signals the start of the savage seven-year conflict destined to dismantle France's overreaching empire and pave the way for the American Revolution. It is here that Swerling introduces a cast of unforgettable characters: Quentin Hale, the fearless gentleman-turned-scout the Indians call Red Bear; Cormac Shea, the part-Irish, part-Indian woodsman with a foot in both worlds, sworn to drive every white man from Canada; and the beautiful Nicole Crane, who, struggling to reconcile her love for Hale and her calling to the convent, becomes a pawn in the British quest for territory.Quentin and Cormac were raised as brothers on Shadowbrook, a prosperous plantation in the northern wilderness whose fertile land, worked by slaves, sits between Hudson's River and the Adirondack Mountains. Though fiercely devoted to each other, they often find themselves on opposite sides of a fight, but not in this war, or in the struggle to wrest control of Shadowbrook from Quentin's depraved older brother.From Iroquois longhouses to the elegant rooms of Shadowbrook, from the virgin forests of the frontier to the cobbled streets of Quebec, Swerling weaves a tale of passion and intrigue, faith and devotion, courage andbetrayal.Peopled by historical figures including a young George Washington, the fabled Ottawa chief Pontiac, and the legendary generals Wolfe and Montcalm, this richly textured novel vividly captures the conflict that ignited the eighteenth century and presaged our nation's quest for independence. But it is through Swerling's powerfully drawn characters -- the ordinary men and women living in a world on the brink of astonishing change -- that this novel comes searingly alive. A classic in the making, \"Shadowbrook\" is a page-turning tale of ambition, war, and the transforming power of both love and duty.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "18th Century",
    "Historical",
    "American History",
    "Romance",
    "American Revolution"
  ],
  "author": "Beverly Swerling",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/820947.Shadowbrook"
}