{
  "title": "Spending",
  "description": "The Barnes & Noble Review March 1998 With such acclaimed works as The Shadow Man and The Other Side, Mary Gordon has established herself as one of America's most important female writers. Her novels are known for their vivid explorations of the depths of human feeling and what it means to live a moral, religious, and artistic life. In Spending, Gordon examines the complex details of everyday life while encapsulating larger themes in her story of a woman who seemingly has her wishes granted.  In Spending the reader is introduced to Monica Szabo, a woman in her 50s. She is divorced, has raised her children, and is finally able to focus on her painting without guilt or sacrifice. She is already a moderately successful painter when she encounters B., a wealthy man who is willing to become her patron  and eventually her lover and muse.  Once Monica is freed from the pressures of finance and reawakened by an erotic and compassionate love, she begins to create her best work. She embarks on a series of paintings based on the idea that the deposed Christs of Renaissance art were not dead but post-orgasmic.  These highly controversial paintings immediately make her a hero of the art world  and an enemy of the Christian right. But as Monica's fame and wealth increase enormously, B. is faced with an abrupt turn in his fortunes and loses almost everything. Suddenly, Monica and B. find their roles reversed and must contend with the implications involved in a society where the man is generally considered the provider.  Although Gordon has presented many complex issues that cannot easily be resolved, she paints them around an erotic and pleasure-charged story. As Gordon dissects gender relationships, religion, and artistic integrity, she never removes joy from her story. The joys found in sex, work, food, nature, and friendship are found in overwhelming abundance. As the novel progresses, the different meanings of Spending become clear. Yet the provocative story and fully drawn characters create an enjoyable path for the many discoveries that Gordon provides.",
  "genres": [
    "Fiction",
    "Art",
    "Book Club",
    "Novels",
    "Literary Fiction",
    "Romance",
    "Literature"
  ],
  "author": "Mary Gordon",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/820711.Spending"
}