{
  "title": "Mulberry Child: A Memoir of China",
  "description": "Mulberry Child is the true story of a childhood before, during, and after the Cultural Revolution in China. Jian Ping's father, a high-ranking government official, was falsely accused of treason during the Cultural Revolution-he was detained, beaten, and publicly shamed. Her mother Gu Wenxiu, a top administrator of a middle school, was paraded in public and detained by the Revolution Committee and the Red Guards-both driving forces of the Cultural Revolution. Facing abuse and deprivation, Jian Ping's family stands steadfastly together, from her aging grandmother, a frail woman with bound feet, to her parents and siblings. The traumatic impacts of their experiences shape the course of their lives forever. Based on her own memories, as well as interviews and exhaustive research, Mulberry Child is a family saga and a tale of resilience, a coming of age story told through the eyes of an innocent child. Mulberry Child allows us an insider's look into a closed-off world and is written with compassion in honest and intimate language. Testimonials \"Jian Ping's book Mulberry Child is a moving account of her family's struggle to survive China's Cultural Revolution. She has in her poignant memoir helped Westerners to understand this little-known period in China's history, and put tragic and heroic faces to the individuals who suffered through that time. Mulberry Child is important reading for anyone who wants to understand where modern China has come from.\" --Rob Gifford, former Beijing Correspondent of NPR, and author of China Road: A Journey into the Future of a Rising Power \"Jian Ping pays tribute to her parents who struggled against tremendous odds.... that she herself survived to write this memoir, and to tell it with such maturity and wisdom and forgiveness, is a tribute to her family, her generation and her nation.\" --Larry Engelmann, author of Feather in a Storm and Daughter of China \"In Mulberry Child, Jian Ping has written a moving, important account of an extraordinary time. And she has done so with grace, acuity and a generosity of spirit. Mulberry Child is one compelling read.\" --Alex Kotlowitz, author of There Were No Children Here",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "China"
  ],
  "author": "Jian Ping",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/8215682-mulberry-child"
}