{
  "title": "The Book of Beasts: Being a Translation from a Latin Bestiary of the 12th Century",
  "description": "If a serpent swallows the spittle of a fasting man, it dies. Trees felled in the wrong season breed termites. If eels are drowned in wine, those who drink it get a loathing for liquor.These and similar flights of fancy were articles of faith in the twelfth century — the era of the fascinating Latin prose bestiary translated in this volume. The translator is T. H. White, author of The Once and Future King and outstanding medievalist. Of The Book of Beasts, White writes: \"No Latin prose bestiary has ever before been printed, even in Latin. This is the first and only English translation in print.\"The bestiary was a bestseller in the Middle Ages, a kind of natural history cum-zoological survey that presumed to describe the animals of the world and to point out the human traits they exemplified. Combining the surprisingly accurate with the endearingly phantasmagorical, the bestiarists came up with a bewildering array of real and exotic creatures. The behavior or attributes of the animals often functioned as a metaphor for teaching religious, moral, and political precepts.In addition to a multitude of real mammals, birds, reptiles, and fish, described here with varying degrees of zoological accuracy, the bestiarist introduces a swarm of fanciful denizens thought to haunt the Dark Ages: manticore, a creature with a man's face, a lion's body, and a ravenous appetite for human flesh; dragon or draco, the biggest serpent and the embodiment of the Devil; amphivia, a fish that could walk on land and swim in the sea; jaculus, a flying serpent; the familiar phoenix; the griffin; and other exotic fauna.Much of the charm of this edition lies in the copious footnotes compiled by T. H. White. With immense erudition, wit, grace, and a singular lack of condescension, the author illuminates literary, scientific, historical, linguistic, and other aspects of the bestiarist's catalog. He further enhances the volume with informative discussions of the history of the bestiary from its origins in remote oral traditions; through Herodotus, Pliny and Aristotle; during the medieval period and the Renaissance; and up to Sir Thomas Browne's Vulgar Errors (1646). Both amusing and amazing, The Book of Beasts is not only a rich survey of the proto-zoology on which much of our later science is based, but also a revealing, illustrated examination of how pre-scientific man perceived the earth's creatures.",
  "genres": [
    "History",
    "Mythology",
    "Nonfiction",
    "Medieval",
    "Classics",
    "Reference",
    "Folklore"
  ],
  "author": "T.H. White",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/821861.The_Book_of_Beasts"
}