{
  "title": "Crow Lake",
  "description": "Mary Lawson's debut novel is a shimmering tale of love, death and redemption set in a rural northern community where time has stood still. Tragic, funny and unforgettable, this deceptively simple masterpiece about the perils of hero worship leapt to the top of the bestseller lists only days after being released in Canada and earned glowing reviews in The New York Times and The Globe and Mail , to name a few. It will be published in more than a dozen countries worldwide, including the U.S., the U.K., Germany, Italy and Bulgaria.Luke, Matt, Kate and Bo Morrison are born in an Ontario farming community of only a few families, so isolated that “the road led only south.” There is little work, marriage choices are few, and the winter cold seeps into the bones of all who dare to live there. In the Morrisons’ hard-working, Presbyterian house, the Eleventh Commandment is “Thou Shalt Not Emote.” But as descendants of a great-grandmother who “fixed a book rest to her spinning wheel so that she could read while she was spinning,” the Morrison children have some hope of getting off the land through the blessings of education. Luke, the eldest, is accepted at teachers college -- despite having struggle mightily through school -- but before he can enroll, the Morrison parents are killed in a collision with a logging truck. He gives up his place to stay home and raise his younger sisters -- seven-year-old Kate, and Bo, still a baby.In this family bound together by loss, the closest relationship is that between Kate and her older brother Matt, who love to wander off to the ponds together and lie on the bank, noses to the water. Matt teaches his little sister to watch “damselflies performing their delicate iridescent dances,” to understand how water beetles “carry down an air bubble with them when they submerge.” The life in the pond is one that seems to go on forever, in contrast to the abbreviated lives of the Morrison parents. Matt becomes Kate’s hero and her guide, as his passionate interest in the natural world sparks an equal passion in Kate.Matt, a true scholar, is expected to fulfill the family dream by becoming the first Morrison to earn a university degree. But a dramatic event changes his course, and he ends up a farmer; so it is Kate who eventually earns the doctorate and university teaching position. She is never able to reconcile her success with what she considers the tragedy of Matt’s failure, and she feels a terrible guilt over the sacrifices made for her. Now a successful biologist in her twenties, she nervously returns home with her partner, a microbiologist from an academic family, to celebrate Matt’s son’s birthday. Amid the clash of cultures, Kate takes us in and out of her troubled childhood memories. Accustomed to dissecting organisms under a microscope, she must now analyze her own emotional life. She is still in turmoil over the events of one fateful year when the tragedy of another local family spilled over into her own. There are things she cannot understand or forgive.In this universal drama of family love and misunderstandings, Lawson ratchets up the tension, her narrative flowing with consummate control in ever-increasing circles, overturning one’s expectations to the end. Compared by Publishers Weekly to Richard Ford for her lyrical, evocative writing, Lawson combines deeply drawn characters, beautiful writing and a powerful description of the land.",
  "genres": [
    "Fiction",
    "Book Club",
    "Canada",
    "Contemporary",
    "Literary Fiction",
    "Family",
    "Coming Of Age"
  ],
  "author": "Mary Lawson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/821625.Crow_Lake"
}