{
  "title": "Salem Witch Judge: The Life and Repentance of Samuel Sewall",
  "description": "In 1692 Puritan Samuel Sewall sent twenty people to their deaths on trumped-up witchcraft charges. The nefarious witch trials in Salem, Massachusetts represent a low point of American history, made famous in works by Longfellow, Nathaniel Hawthorne (himself a descendant of one of the judges), and Arthur Miller. The trials might have doomed Sewall to infamy except for a courageous act of contrition now commemorated in a mural that hangs beneath the golden dome of the Massachusetts State House picturing Sewall's public repentance. He was the only Salem witch judge to make amends.But, remarkably, the judge's story didn't end there. Once he realized his error, Sewall turned his attention to other pressing social issues. Struck by the injustice of the New England slave trade, a commerce in which his own relatives and neighbors were engaged, he authored \"The Selling of Joseph,\" America's first antislavery tract. While his peers viewed Native Americans as savages, Sewall advocated for their essential rights and encouraged their education, even paying for several Indian youths to attend Harvard College. Finally, at a time when women were universally considered inferior to men, Sewall published an essay affirming the fundamental equality of the sexes. The text of that essay, composed at the deathbed of his daughter Hannah, is republished here for the first time.In Salem Witch Judge, acclaimed biographer Eve LaPlante, Sewall's great-great-great-great-great-great-granddaughter, draws on family lore, her ancestor's personal diaries, and archival documents to open a window onto life in colonial America, painting a portrait of a man traditionally vilified, but who was in fact an innovator and forefather who came to represent the best of the American spirit.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "Witches",
    "Religion",
    "17th Century"
  ],
  "author": "Eve LaPlante",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/8217650-salem-witch-judge"
}