{
  "title": "Daniel Boone",
  "description": "Daniel Boone is regarded as the first real American folk hero. Without his cunning bravery, settlement west of the Appalachians may not have been made possible for years. Boone’s Wilderness Road, which is still used today, helped bridge the Cumberland Gap, granting access to the state of Kentucky from Pennsylvania.Thanks to the writing of John S. C. Abbot, the life and genius of Boone can truly be appreciated through Daniel Boone: The Pioneer of Kentucky. Find out just how Boone crafted his Wilderness Trail, what he did to make it happen, and how he overcame the struggles of life in late eighteenth century America.All of Boone’s greatest achievements can be found in Abbott’s words, including:• The birth of Wilderness Road• Boone’s time served in the Revolutionary War• How he managed to live among the Shawnee Native American warriors• His time in the Virginia General AssemblyDaniel Boone lived a modest life in his later years, settling down in St. Louis, where he managed land for the rest of his life. If it were not for Abbott’s book, the real story of Daniel Boone may never have been told.Excerpt :The name of Daniel Boone is a conspicuous one in the annals of our country. And yet there are but few who are familiar with the events of his wonderful career, or who have formed a correct estimate of the character of the man. Many suppose that he was a rough, coarse backwoodsman, almost as savage as the bears he pursued in the chase, or the Indians whose terrors he so perseveringly braved. Instead of this he was one of the most mild and unboastful of men; feminine as a woman in his tastes and his deportment, never uttering a coarse word, never allowing himself in a rude action. He was truly one of nature's gentle men. With all this instinctive refinement and delicacy, there was a boldness of character which seemed absolutely incapable of experiencing the emotion of fear. And surely all the records of chivalry may be searched in vain for a career more full of peril and of wild adventure. This narrative reveals a state of society and habitudes of life now rapidly passing into oblivion.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "American History",
    "American",
    "Classics",
    "Historical"
  ],
  "author": "John S.C. Abbott",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/8217389-daniel-boone"
}