{
  "title": "Recovering the Sacred: The Power of Naming and Claiming",
  "description": "When she invites us to “recover the sacred,” well-known Native American organizer Winona LaDuke is requesting far more than the rescue of ancient bones and beaded headbands from museums. For LaDuke, only the power to define what is sacred—and access it—will enable Native American communities to remember who they are and fashion their future. Using a wealth of Native American research and hundreds of interviews with indigenous scholars and activists, LaDuke examines the connections between sacred objects and the sacred bodies of her people—past, present and future—focusing more closely on the conditions under which traditional beliefs can best be practiced. Describing the plentiful gaps between mainstream and indigenous thinking, she probes the paradoxes that abound for the native people of the Americas. How, for instance, can the indigenous imperative to honor the Great Salt Mother be carried out when mining threatens not only access to Nevada’s Great Salt Lake but the health of the lake water itself? While Congress has belatedly moved to protect most Native American religious expression, it has failed to protect the places and natural resources integral to the ceremonies. Federal laws have achieved neither repatriation of Native remains nor protection of sacred sites, and may have even less power to confront the more insidious aspects of cultural theft, such as the parading of costumed mascots. But what of political marginalization? How can the government fund gene mapping while governmental neglect causes extreme poverty, thus blocking access to basic healthcare for most tribal members? Calling as ever on her lyrical sensibility and caustic wit, moving from the popular to the politic, from the sacred to the profane, LaDuke uses these essays not just to indict the current situation, but to point out a way forward for Native Americans and their allies.",
  "genres": [
    "Nonfiction",
    "Indigenous",
    "History",
    "Native American",
    "Spirituality",
    "Environment",
    "Social Justice"
  ],
  "author": "Winona LaDuke",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/822339.Recovering_the_Sacred"
}