{
  "title": "Inheritance: The Story of Knole and the Sackvilles",
  "description": "Since its purchase in 1604 by Thomas Sackville, first Earl of Dorset, the house at Knole, Kent, has been inhabited by thirteen generations of a single aristocratic family, the Sackvilles. Here, drawing on a wealth of unpublished letters, archives, and images, the current incumbent of the seat, Robert Sackville-West, paints a vivid and intimate portrait of the vast, labyrinthine house and the close relationships his colorful ancestors formed within it. Inheritance is the story of a house and its inhabitants, a family described by Vita Sackville-West as \"a race too prodigal, too amorous, too weak, too indolent, and too melancholy; a rotten lot, and nearly all starkstaring mad.\" Where some reveled in the hedonism of aristocratic life, others rebelled against a house that, in time, would disinherit them, shutting its doors to them forever. It's a drama in which the house itself is a principal character, its fortunes often mirroring those of the family. Every detail holds a the portraits, and all the items the subjects of those portraits left behind, point to pivotal moments in history; all the rooms, and the objects that fill them, are freighted with an emotional significance that has been handed down from generation to generation. Now owned by the National Trust, Knole is today one of the largest houses in England, visited by thousands annually and housing one of the country's finest collections of secondhand Royal furniture. It's a pleasure to follow Robert Sackville-West as he unravels the private life of a public place on a fascinating, masterful, four-hundred-year tour through the memories and memorabilia, political, financial, and domestic, of his extraordinary family.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "British Literature",
    "Memoir",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Robert Sackville-West",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/8229210-inheritance"
}