{
  "title": "Earl Hamner: From Walton's Mountain to Tomorrow",
  "description": "“Since  Spencer’s Mountain  I have followed Earl Hamner’s career with much interest and much satisfaction, having picked a winner.”  —Harper Lee, author of  To Kill a Mockingbird Earl Hamner, one of America’s best-loved storytellers, has never been the subject of a full-length study.  Earl Hamner: From Walton’s Mountain to Tomorrow  fills that gap. A native Virginian, Hamner once said, “Even though families are said to be shattered these days, and God is said to be dead, if people can revisit the scenes and places where these values did exist, possibly they can come to believe in them again, or . . . to adapt some kind of belief in God, or faith in the family unit, or just getting home again.” This vision of what makes for a whole life permeates all of Hamner’s work. It is present in the novel  Spencer’s Mountain,  upon which  The Waltons  was loosely based, and in his screenplays, such as the work he is perhaps most proud of,  Charlotte’s Web.  It is even present in such unlikely places as the eight scripts he contributed to the classic television series  The Twilight Zone  and the tales of cold-blooded betrayal and boundless ambition depicted on  Falcon Crest. In  Earl Hamner: From Walton’s Mountain to Tomorrow,  readers will discover the integrated nature of his career, finding that there is no real conflict between the warm folksiness of  The Waltons,  the offbeat fantasies of his  Twilight Zone  scripts, the unscrupulous ethics displayed on  Falcon Crest,  and the myriad other novels and scripts he has written and TV programs he has produced. Instead, readers will find that there is a pervasive theme running throughout Hamner’s work, that of a man forever taking a backward glance at his roots for direction in finding what makes life worthwhile. Upon learning that this book was being written, Hamner told one of his friends, “I can’t imagine anyone wanting to read a book about me, much less write one about me.” Readers of this book will find Hamner’s doubts indeed misplaced. They will also discover a delightful individual who has enjoyed a long, accomplished career as a storyteller laboring for a worthy goal: that posterity may know of an age and a people whose legacy has not, through silence, been permitted to pass away as if a dream.",
  "genres": [
    "Biography",
    "Tv",
    "Nonfiction"
  ],
  "author": "James E. Person Jr.",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/822937.Earl_Hamner"
}