{
  "title": "Only the Super-Rich Can Save Us!",
  "description": "\"In the cozy den of the large but modest house in Omaha where he has lived since he started on his first billion, Warren Buffett watched the horrors of Hurricane Katrina unfold on television in early September 2005. . . . On the fourth day, he beheld in disbelief the paralysis of local, state, and federal authorities unable to commence basic operations of rescue and sustenance, not just in New Orleans, but in towns and villages all along the Gulf Coast. . . He knew exactly what he had to do. . .\"So begins the vivid fictional account by political activist and bestselling author Ralph Nader that answers the question, \"What if?\" What if a cadre of superrich individuals tried to become a driving force in America to organize and institutionalize the interests of the citizens of this troubled nation? What if some of America's most powerful individuals decided it was time to fix our government and return the power to the people? What if they focused their power on unionizing Wal-Mart? What if a national political party were formed with the sole purpose of advancing clean elections? What if these seventeen superrich individuals decided to galvanize a movement for alternative forms of energy that will effectively clean up the environment? What if together they took on corporate goliaths and Congress to provide the necessities of life and advance the solutions so long left on the shelf by an avaricious oligarchy? What could happen?This extraordinary story, written by the author who knows the most about citizen action, returns us to the literature of American social movements—to Edward Bellamy, to Upton Sinclair, to John Steinbeck, to Stephen Crane—reminding us in the process that changing the body politic of America starts with imagination.",
  "genres": [
    "Fiction",
    "Politics"
  ],
  "author": "Ralph Nader",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/8233974-only-the-super-rich-can-save-us"
}