{
  "title": "I Laugh So I Won't Cry: Kenya's Women Tell The Story Of Their Lives",
  "description": "In I Laugh So I Won’t Cry, Kenya’s women tell their stories of love, struggle, happiness, and tragedy in their own words. I Laugh strikes a balance between intimate acquaintance and a comprehensive view. In-depth portraits allow readers to know a diverse selection of women intimately. Topical chapters feature the voices of a large range of women talking about the subjects closest to their hearts. Chapters marriage, childrearing, work and getting by when there is no work, women’s self-help groups, genital cutting, ethnic tensions, and the new government that has promised huge reforms. I Laugh shows the full panorama of women’s struggles in sub-Saharan Africa without sacrificing the vivid details of individual lives. Subsistence farmers, herders, beggars, sex workers, office workers, hawkers, business executives and a few friends who stopped an ethnic war all speak in I Laugh So I Won’t Cry. I Laugh will interest readers who seek to understand the multiple realities of contemporary Africa. Excerpts from I Laugh So I Won’t On Husbands “You know, men don't like laughing with their wives. Other men will say, ‘Don't laugh with her. You are showing her that you love her too much. She will shame you. She will make you serve tea.’ So they just sit stony-faced.” “A man wouldn't like the woman to know how much money he has. If a wife asks her husband to buy something that is needed, like soap or tea, he will ask himself, ‘Now, how did she know that I have money in my pocket?’” On Education “Women who have been educated are respected. A husband knows that she is also an independent person and can do things on her own. The man is scared. He thinks maybe that if he hits her she is free to leave, but an uneducated lady is just forced to stay even if she gets problems in her marriage.” On Female Genital Cutting “Our mothers live with us. They will say it must be done. I can't disagree with my mother regarding my daughter. But for my daughter's daughter, it will change.” “There's the social pressure, even when they are very young. Because it is being done to all her friends in school, she would feel that you are denying her right. “",
  "genres": [
    "Kenya",
    "History"
  ],
  "author": "Helena Halperin",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/823181.I_Laugh_So_I_Won_t_Cry"
}