{
  "title": "Hands on the Freedom Plow: Personal Accounts by Women in SNCC",
  "description": "In Hands on the Freedom Plow, fifty-two women--northern and southern, young and old, urban and rural, black, white, and Latina--share their courageous personal stories of working for the Student Nonviolent Coordinating Committee (SNCC) on the front lines of the Civil Rights Movement. The testimonies gathered here present a sweeping personal history of SNCC: early sit-ins, voter registration campaigns, and freedom rides; the 1963 March on Washington, the Mississippi Freedom Summer, and the movements in Alabama and Maryland; and Black Power and antiwar activism. Since the women spent time in the Deep South, many also describe risking their lives through beatings and arrests and witnessing unspeakable violence. These intense stories depict women, many very young, dealing with extreme fear and finding the remarkable strength to survive. The women in SNCC acquired new skills, experienced personal growth, sustained one another, and even had fun in the midst of serious struggle. Readers are privy to their analyses of the Movement, its tactics, strategies, and underlying philosophies. The contributors revisit central debates of the struggle including the role of nonviolence and self-defense, the role of white people in a black-led movement, and the role of women within the Movement and the society at large.   Each story reveals how the struggle for social change was formed, supported, and maintained by the women who kept their \"hands on the freedom plow.\" As the editors write in the introduction, \"Though the voices are different, they all tell the same story--of women bursting out of constraints, leaving school, leaving their hometowns, meeting new people, talking into the night, laughing, going to jail, being afraid, teaching in Freedom Schools, working in the field, dancing at the Elks Hall, working the WATS line to relay horror story after horror story, telling the press, telling the story, telling the word. And making a difference in this world.\"",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "African American",
    "Activism",
    "Womens"
  ],
  "author": "Faith S. Holsaert",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/8233145-hands-on-the-freedom-plow"
}