{
  "title": "La Société très secrète des Sorcières extraordinaires",
  "description": "Franchissez les portes de la Maison de Nulle Part et laissez-vous envoûter...Mika Moon a toujours – enfin, presque toujours – respecté trois grandes règles. Cacher sa magie (dans les vidéos qu'elle poste en ligne, elle fait juste semblant d'être une sorcière). Faire profil bas (après tout, qu'est-ce que 14 000 abonnés ?). Et rester à l'écart des autres sorcières (sauf à l'occasion de leur sacro-sainte réunion trimestrielle). La jeune femme a donc pris l'habitude d'être seule et a même passé le plus clair de sa vie d'adulte à déménager en prenant garde de ne jamais s'attacher à qui que ce soit.Un jour, pourtant, elle reçoit une intrigante offre d'emploi : devenir la professeure particulière de trois jeunes sorcières dans une mystérieuse propriété du Norfolk baptisée la Maison de Nulle Part. Et voilà qu'en un coup de baguette magique (et contre toutes les règles élémentaires de sorcellerie), elle se retrouve bientôt mêlée aux secrets de ses quatre hôtes, aussi excentriques qu'attentionnés. Parmi eux, Jamie, bibliothécaire irlandais grincheux mais contre toute attente attirant, est prêt à tout pour défendre ses trois petites protégées. Or, à ses yeux, la nouvelle venue est une menace – une menace incroyablement irritante...Alors que Mika commence enfin à s'ouvrir aux autres, l'idée d'avoir trouvé une famille – une vraie –, et peut-être même plus, fait peu à peu son chemin dans son esprit. Mais la magie est imprévisible... et si toute cette histoire n'était qu'une bombe prête à exploser ? Enfourchez vous aussi votre balai magique et laissez-vous ensorceler par cette romance feel good signée Sangu Mandanna qui vous fera rire aux éclats et fondre de bonheur.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fiction",
    "Audiobook",
    "Witches",
    "Cozy",
    "Contemporary"
  ],
  "author": "Sangu Mandanna",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/131122570-la-soci-t-tr-s-secr-te-des-sorci-res-extraordinaires"
}