{
  "title": "Richard II",
  "description": "Shakespeare’s Richard II presents a momentous struggle between Richard II and his cousin Henry Bolingbroke. Richard is the legitimate king; he succeeded his grandfather, King Edward III, after the earlier death of his father Edward, the Black Prince. Yet Richard is also seen by many as a tyrant. He toys with his subjects, exiling Bolingbroke for six years.When he seizes the title and property that should be Bolingbroke’s, Richard threatens the very structure of the kingdom. Bolingbroke returns with an army that is supported by nobles and commoners alike, both believing themselves oppressed by Richard. This sets the stage for a confrontation between his army and the tradition of sacred kingship supporting the isolated but now more sympathetic Richard.The authoritative edition of Richard II from The Folger Shakespeare Library, the trusted and widely used Shakespeare series for students and general readers, includes:-Freshly edited text based on the best early printed version of the play-Full explanatory notes conveniently placed on pages facing the text of the play-Scene-by-scene plot summaries-A key to the play’s famous lines and phrases-An introduction to reading Shakespeare’s language-An essay by a leading Shakespeare scholar providing a modern perspective on the play-Fresh images from the Folger Shakespeare Library’s vast holdings of rare books-An annotated guide to further readingEssay by Harry Berger, Jr.The Folger Shakespeare Library in Washington, DC, is home to the world’s largest collection of Shakespeare’s printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs. For more information, visit Folger.edu.",
  "genres": [
    "Plays",
    "Classics",
    "Fiction",
    "Historical Fiction",
    "Theatre",
    "Poetry",
    "Literature"
  ],
  "author": "William Shakespeare",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/82398.Richard_II"
}