{
  "title": "L'infinito tra me e te",
  "description": "Autrice bestseller di USA Today e New York TimesL’assistente di un noto giocatore di football decide di licenziarsi, facendogli aprire gli occhi su quello che desidera veramente Vanessa Mazur sa che sta facendo la cosa giusta. Non ha alcuna intenzione di sentirsi in colpa per aver mollato. Il lavoro di assistente tuttofare di Aidan Graves è sempre stato un impiego temporaneo. Lei ha altri piani per il futuro, ha delle ambizioni, e di certo non comprendono il ruolo di fatina personale di una star del football. E allora perché quando Aidan si presenta alla sua porta, pregandola di ripensarci, Vanessa esita? Per due anni, l’uomo che le televisioni chiamano “il muro di Winnipeg” è stato il suo incubo: neanche un buongiorno al mattino, o un sorriso il giorno del suo compleanno. Era talmente concentrato sullo sport che sembrava non accorgersi nemmeno di chi o cosa lo circondasse. Cos’è cambiato, allora? Quello che Aidan chiede, per Vanessa è semplicemente incomprensibile. Dopo il modo in cui è stata trattata, lei desidera solo dedicarsi alla sua vera passione, il design, e lasciarsi alle spalle l’indifferenza. La perseveranza di Aidan sarà in grado di farle cambiare idea? In questo genere di partite, segnare un punto richiede pazienza, gioco di squadra e una buona dose di determinazione.Mariana Zapataha cominciato a scrivere storie d’amore praticamente il giorno stesso in cui ha imparato a scrivere. Quando era bambina rubava i libri dalla mensola di sua zia, sicuramente ancora prima di capirne il senso. È nata in Texas ma vive in Colorado con suo marito e due alani giganteschi, Dorian e Kaiser. Arriva per la prima volta in Italia con L’infinito tra me e te, edito dalla Newton Compton.",
  "genres": [
    "Romance",
    "Sports Romance",
    "Sports",
    "Contemporary",
    "Slow Burn",
    "Contemporary Romance",
    "Enemies To Lovers"
  ],
  "author": "Mariana Zapata",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/82368880-l-infinito-tra-me-e-te"
}