{
  "title": "The Cure for Death by Lightning",
  "description": "\"The cure for death by lightning was handwritten in thick, messy blue ink in my mother’s scrapbook, under the recipe for my father’s favourite oatcakes: Dunk the dead by lightning in a cold water bath for two hours and if still dead, add vinegar and soak for an hour more.\"So begins Gail Anderson-Dargatz’s extraordinary first novel, a seductive and thrilling book that captures the heart and imagination, as filled with the magic and mystery of life as it is with its lurking evils and gut-wrenching hardships. The Cure for Death by Lightning sold a staggering 100,000 copies in Canada alone and became a bestseller in Great Britain, later to be published in the United States and Europe. It was nominated for the Giller Prize, the richest fiction prize in Canada, and received a Betty Trask Award in the U.K.The Cure for Death by Lightning takes place in the poor, isolated farming community of Turtle Valley, British Columbia, in the shadow of the Second World War. The fifteenth summer of Beth Weeks’s life is full of strange happenings: a classmate is mauled to death; children go missing on the nearby reserve; an unseen predator pursues Beth. She is surrounded by unusual characters, including Nora, the sensual half-Native girl whose friendship provides refuge; Filthy Billy, the hired hand with Tourette’s Syndrome; and Nora’s mother, who has a man’s voice and an extra little finger. Then there’s the darkness within her own family: her domineering, shell-shocked father has fits of madness, and her mother frequently talks to the dead. Beth, meanwhile, must wrestle with her newfound sexuality in a harsh world where nylons, perfume and affection have no place. Then, in a violent storm, she is struck by lightning in her arm, and nothing is quite the same again. She decides to explore the dangers of the bush.Beth is a strong, honest, and compassionate heroine, bringing hope and joy into an environment that is often cruel. The character of Beth’s haunted mother infuses the book with life by means of her scrapbook of recipes scattered throughout, with luscious descriptions of food, gardening, and remedies, both practical and bizarre. Seen through Beth’s eyes, the West Coast landscape is full of beauty and mysteries, with its forests and rivers, and its rich native culture.The Globe and Mail commented that The Cure for Death by Lightning was \"Canadian to the core,\" with hints of Susannah Moodie and Margaret Atwood and Alice Munro. Anderson-Dargatz’s vision of rural life has drawn comparisons with William Faulkner and John Steinbeck. A magic realism reminiscent of Latin American literature is also present, as flowers rain from the sky, and men turn into animals. Yet the style of The Cure for Death by Lightning, which the Boston Globe called \"Pacific Northwest Gothic,\" is wholly original. Launched in a year with more than the usual number of excellent first novels (1996 was also the year of Fall On Your Knees by Ann-Marie MacDonald and Fugitive Pieces by Anne Michaels), this book with its assured voice heralds a worthy successor to Margaret Atwood, Carol Shields, Margaret Laurence and Alice Munro.",
  "genres": [
    "Fiction",
    "Canada",
    "Historical Fiction",
    "Magical Realism",
    "Book Club",
    "Literary Fiction",
    "Historical"
  ],
  "author": "Gail Anderson-Dargatz",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/824173.The_Cure_for_Death_by_Lightning"
}