{
  "title": "The Alphabet Sisters",
  "description": "As girls growing up in Clare Valley, Australia, Anna, Bett, and Carrie Quinlan were childhood singing stars known as The Alphabet Sisters. The unbridled enthusiasm of their flamboyant grandmother Lola was the glue that held them together. As adults, though, the women haven't spoken in years - ever since Bett's fiance deserted her to marry the younger Carrie. Now Lola is turning eighty and she is determined to reunite the girls for a blowout bash. And no one ever says no to Lola.Bett, who fled to London after the scandal of losing her fiance, is hesitant to face her sisters and her hometown - especially since she has yet to find another man. Sophisticated Anna, the eldest sister, isn't too keen on the prospect either, though she's secretly grateful for any excuse to leave her crumbling marriage behind in Sydney. And Carrie, who remained in Clare Valley, is perhaps the most apprehensive. Her marriage - the nominal cause of the sisters' estrangement - is also on the rocks. Was she wrong to have followed her heart and run off with Bett's fiance?When Lola shares her special request, that the girls stage a musical she has written, their short visit becomes a much longer commitment. As they are forced to spend more time together, the sisters must confront the pain that lingers between them. Preconceptions and misunderstandings are slowly put aside and the three find themselves gradually, irresistibly enveloping one another once again - until an unexpected turn of events changes everything in ways none of them could have ever imagined. . . .Layering the lighthearted antics of small-town life with a heartbreaking story of loyalty lost and found, The Alphabet Sisters is an unforgettable story of two generations of women who learn that being true to themselves means being true to one another.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Australia",
    "Family",
    "Romance",
    "Book Club"
  ],
  "author": "Monica McInerney",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/82440.The_Alphabet_Sisters"
}