{
  "title": "When Bull Elephants Fight: an American Surgeon's Chronicle of Congo",
  "description": "“When bull elephants fight, the grass gets trampled.” —African proverb Why would a young American doctor abruptly give up a comfortable life in Kansas in order to work in Congo…not once but twice? In 1961 Roger Youmans took his wife and two young daughters with him to work in a country whose people had suffered terribly as a result of tribal warfare and general political upheaval. Congo at that time had no trained physicians and most of the foreign doctors had fled the country. The medical system had collapsed, and the Congolese people were battling malaria, smallpox, and starvation. Roger Youmans was drawn to the country precisely because of its overwhelming needs. Yet he spoke only the most rudimentary French and considered himself totally unprepared for the problems he would soon face on the wards of the mission hospital to which he had been assigned. But slowly and often with amusing results, he and his family began to adjust to life in Congo. When Bull Elephants Fight is both a vivid account of Youmans’ medical experiences and an honest and deeply personal description of an American family’s struggle to embrace a vastly different culture. Eventually Youmans would venture deeper into the heart of Congo where there were no medical facilities. This experience would bring him in direct contact with Mobutu, the charismatic president who fostered the idea of “authenticity” for the country (which he renamed Zaire) but whose motives and tactics were often questionable. In the course of working on Mobutu’s riverboat hospital, Youmans gives us a fascinating glimpse of this powerful dictator. A master storyteller, Youmans writes with warmth and compassion about the Congolese people, who have for so long been trampled like the grass whenever the “bull elephants”—the tribal warlords and ruthless politicians—begin to fight. His story will make you want to figure out how you can reach out to those in need and begin to make a difference in this world.",
  "genres": [],
  "author": "Roger L. Youmans",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/824628.When_Bull_Elephants_Fight"
}