{
  "title": "Interior Desecrations: Hideous Homes from the Horrible '70s",
  "description": "“Sweet smoking Jesus, what was the matter with these people?”Who knows? But we do need to accept the fact that otherwise sensible American housewives who would never grind a quaalude into their morning coffee or sleep with their tennis instructor nevertheless went daft during the 1970s and performed heinous acts of design on unsuspecting homes.What James Lileks did for dinner with the critically acclaimed classic The Gallery of Regrettable Food , he now does to the wonderful world of 1970s home interiors. Blazing plaid wallpaper. Vertigo-inducing matching patterns on walls, rugs, chairs, pillows, and blinds. Bathrooms straight out of 2001: A Space Odyssey . The whole ’70s shebang. If you think the ’80s were dumber than the ’70s, either you weren’t there or you weren’t paying attention.James Lileks came of age in the 1970s, and for him there was no crueler thing you could inflict upon a person. The either sluggish metal, cracker-boogie, or wimpy ballads. camp without the pleasure of knowing it’s camp. the sweaty perfidy of Nixon, the damp uselessness of Ford, the sanctimonious impotence of Carter. The nasty. unspeakable. metal-shingled mansard roofs on franchise chicken shops. No oil. No fun. Syphilis and Fonzie.Interior Desecrations is the author’s revenge on the decade. Using an ungodly collection of the worst of 1970s interior design magazines, books, and pamphlets, he proves without a shadow of a doubt that the ’70s were a breathtakingly ugly period. And nowhere was that ugliness and lack of style felt more than in our very homes, virtual breeding grounds for bad taste, manifested in brown, orange, and plaid wallpaper patterns. This is what happens when Dad drinks, Mom floats in a Valium haze, the kids slump down in the den with the bong, and the decorator is left to run amok. It seemed so normal at the time. But this book should cure whatever lingering nostalgia we have.Exploring all the rooms in the house, Lileks marries the worst of design with the funniest of commentary. His sharp-witted humor, keen eye for detail, and ability to pull the most obscure 1970s references out of his hat make Interior Desecrations the perfect gift for those of us who languished away the decade watching Sonny and Cher, Donny and Marie, and Chico and the Man down in our rec rooms, sprawled out on the shag carpeting, waiting for it all to mercifully end. For those people born later and who may think it was all made up—it wasn’t. Would that it was! The photos in this book are not the product of some cruel designer gone crazy with Photoshop. They’re all too real. So adjust your sense of style, color, and taste. . . and beware! You’ve been warned.",
  "genres": [
    "Humor",
    "Nonfiction",
    "History",
    "Art",
    "Pop Culture",
    "Architecture",
    "Design"
  ],
  "author": "James Lileks",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/824538.Interior_Desecrations"
}