{
  "title": "The Little Book That Still Beats the Market",
  "description": "In 2005, Joel Greenblatt published a book that is already considered one of the classics of finance literature. In The Little Book that Beats the Market—a New York Times bestseller with 300,000 copies in print—Greenblatt explained how investors can outperform the popular market averages by simply and systematically applying a formula that seeks out good businesses when they are available at bargain prices. Now, with a new Introduction and Afterword for 2010, The Little Book that Still Beats the Market updates and expands upon the research findings from the original book. Included are data and analysis covering the recent financial crisis and model performance through the end of 2009. In a straightforward and accessible style, the book explores the basic principles of successful stock market investing and then reveals the author’s time-tested formula that makes buying above average companies at below average prices automatic. Though the formula has been extensively tested and is a breakthrough in the academic and professional world, Greenblatt explains it using 6th grade math, plain language and humor. He shows how to use his method to beat both the market and professional managers by a wide margin. You’ll also learn why success eludes almost all individual and professional investors, and why the formula will continue to work even after everyone “knows” it.  While the formula may be simple, understanding why the formula works is the true key to success for investors. The book will take readers on a step-by-step journey so that they can learn the principles of value investing in a way that will provide them with a long term strategy that they can understand and stick with through both good and bad periods for the stock market.  As the Wall Street Journal stated about the original edition, “Mr. Greenblatt…says his goal was to provide advice that, while sophisticated, could be understood and followed by his five children, ages 6 to 15. They are in luck. His ‘Little Book’ is one of the best, clearest guides to value investing out there.”",
  "genres": [
    "Finance",
    "Business",
    "Nonfiction",
    "Economics",
    "Money",
    "Personal Finance",
    "Audiobook"
  ],
  "author": "Joel Greenblatt",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/8247775-the-little-book-that-still-beats-the-market"
}