{
  "title": "To Say Nothing of the Dog: or, How We Found the Bishop's Bird Stump at Last",
  "description": "In her first full-length novel since her critically acclaimed Doomsday Book Connie Willis, winner of multiple Hugo and Nebula Awards, once again visits the unpredictable world of time travel.  But this time the result is a joyous journey into a past and future of comic mishaps and historical cross-purposes, in which the power of human love can still make all the difference.On the surface, England in the summer of 1888 is possibly the most restful time in history--lazy afternoons boating on the Thames, tea parties, croquet on the lawn--and time traveler Ned Henry is badly in need of a rest.  He's been shuttling back and forth between the 21st century and the 1940s looking for a Victorian atrocity called the bishop's birdstump.  It's only the latest in a long string of assignments from Lady Schrapnell, the rich dowager who has invaded Oxford University.  She's promised to endow the university's time-travel research project in return for their help in rebuilding the famed Coventry Cathedral, destroyed in a Nazi air raid over a hundred years before.But the bargain has turned into a nightmare.  Lady Schrapnell's motto is \"God is in the details,\" and as the l25th anniversary of the cathedral's destruction--and the deadline for its proposed completion--approaches, time-travel research has fallen by the wayside.  Now Ned and his colleagues are frantically engaged in installing organ pipes, researching misericords, and generally risking life and limb.  So when Ned gets the chance to escape to the Victorian era, he jumps at it.  Unfortunately, he isn't really being sent there to recover from his time-lag symptoms, but to correct an incongruity a fellow historian, Verity Kindle, has inadvertently created by bringing something forward from the past.In theory, such an act is impossible.  But now it has happened, and it's up to Ned and Verity to correct the incongruity before it alters history or, worse, destroys the space-time continuum.  And they have to do it while coping with eccentric Oxford dons, table-rapping spiritualists, a very spoiled young lady, and an even more spoiled cat.  As Ned and Verity try frantically to hold things together and find out why the incongruity happened, the breach widens, time travel goes amok, and everything starts to fall apart--until the fate of the entire space-time continuum hangs on a sÚance, a butler, a bulldog, the battle of Waterloo, and, above all, on the bishop's birdstump.At once a mystery novel, a time-travel adventure, and a Shakespearean comedy, To Say Nothing of the Dog is a witty and imaginative tale of misconceptions, misunderstandings, and a chaotic world in which the shortest distance between two points is never a straight line, and the secret to the universe truly lies \"in the details.\"",
  "genres": [
    "Science Fiction",
    "Time Travel",
    "Fiction",
    "Historical Fiction",
    "Fantasy",
    "Humor",
    "Historical"
  ],
  "author": "Connie Willis",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/824657.To_Say_Nothing_of_the_Dog"
}