{
  "title": "Dalam Dekapan Ukhuwah",
  "description": "Di buku ini, Dalam Dekapan Ukhuwah, kita ingin meninggalkan bayang-bayang Narcissus. Kita ingin kecintaan pada diri berhijrah menjadi cinta sesama yang melahirkan peradaban cinta. Dari Narcissus yang dongeng, kita menuju Muhammad yang menyejarah. Pribadi semacam Sang Nabi ini yang akan menjadi telisik pembelajaran kita. Inilah pribadi pencipta ukhuwah, pribadi perajut persaudaraan, pembawa kedamaian, dan beserta itu semua; pribadi penyampai kebenaran.Tak ayal, kita harus memulainya dari satu kata. Iman. Karena ada tertulis, yang mukmin lah yang bisa bersaudara dengan ukhuwah sejati. Iman itu pembenaran dalam hati, ikrar dengan lisan, dan amal dengan perbuatan. Kita faham bahwa yang di hati tersembunyi, lisan bisa berdusta, dan amal bisa dipura-pura. Maka Allah dan RasulNya telah meletakkan banyak ukuran iman dalam kualitas hubungan kita dengan sesama. Setidaknya, terjaganya mereka dari gangguan lisan dan tangan kita. Dan itulah batas terrendah dalam dekapan ukhuwah.Dalam dekapan ukhuwah kita menghayati pesan Sang Nabi. “Jangan kalian saling membenci”, begitu beliau bersabda seperti dicatat Al Bukhari dalam Shahihnya, “Jangan kalian saling mendengki, dan jangan saling membelakangi karena permusuhan dalam hati.. Tetapi jadilah hamba-hamba Allah yang bersaudara..”Dalam dekapan ukhuwah kita mendaki menuju puncak segala hubungan, yakni taqwa. Sebab, firmanNya tentang penciptaan insan yang berbangsa dan bersuku-suku untuk saling mengenal ditutup dengan penegasan bahwa kemuliaan terletak pada ketaqwaan. Dan ada tertulis, para kekasih di akhirat kelak akan menjadi seteru satu sama lain, kecuali mereka yang bertaqwa.Dalam dekapan ukhuwah, kita mengambil cinta dari langit. Lalu menebarkannya di bumi. Sungguh di surga, menara-menara cahaya menjulang untuk hati yang saling mencinta. Mari membangunnya dari sini, dalam dekapan ukhuwah. Jadilah ia persaudaraan kita; sebening prasangka, sepeka nurani, sehangat semangat, senikmat berbagi, dan sekokoh janji.Dalam dekapan ukhuwah, kita akan mengeja makna-makna itu, menjadikannya bekal untuk menjadi pribadi pencipta ukhuwah, pribadi perajut persaudaraan, pembawa kedamaian, dan beserta itu semua; pribadi penyampai kebenaran. Dalam dekapan ukhuwah, kita tinggalkan Narcissus yang dongeng menuju Muhammad yang mulia dan nyata. Namanya terpuji di langit dan bumi.",
  "genres": [
    "Islam",
    "Nonfiction",
    "Religion",
    "Indonesian Literature",
    "Self Help"
  ],
  "author": "Salim Akhukum Fillah",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/8245199-dalam-dekapan-ukhuwah"
}