{
  "title": "The Neighbors Are Watching",
  "description": "Set against the backdrop of the deadly 2007 wildfires that forced the evacuation of half a million San Diego residents, Debra Ginsberg’s new novel, The Neighbors Are Watching, examines the dark side of suburbia—a place where everyone has something to hide. Aside from their annual block party, the neighbors on Fuller Court tend to keep to themselves—which doesn’t mean that they aren’t all watching and judging each other on the sly. So when pregnant teenager Diana Jones shows up, literally, on her biological father's doorstep, the neighbors can't stop talking. Joe Montana is a handsome restaurant manager who failed to tell his wife Allison that he fathered a baby with an ex-girlfriend seventeen years ago. Allison, already harboring her own inner resentments, takes the news very badly. She isn’t the only one. Diana's bombshell arrival in their quiet cul-de-sac sets off a chain reaction of secrets and lies that threaten to engulf the neighborhood along with the approaching flames from two huge wildfires fanned by the Santa Ana winds.A former reality TV contestant who receives a steady stream of gentlemen callers at all hours, two women forced to hide their relationship in order to keep custody of their children, a sanctimonious housewife with a very checkered past, and a family who nobody ever sees—these are just a few of the warring neighbors struggling to keep up appearances and protect their own interests. But when lovely, troubled Diana disappears in the aftermath of the wildfire evacuation, leaving her newborn baby and many unanswered questions behind, the residents of Fuller Court must band together to find her before all of their carefully constructed deceptions come unraveled. A potent blend of domestic drama and suspense, The Neighbors Are Watching reveals the secrets that bloom alongside manicured flowerbeds—and the truths that lurk behind closed doors.",
  "genres": [
    "Fiction",
    "Mystery",
    "Novels",
    "Book Club",
    "Adult Fiction",
    "Thriller",
    "Suspense"
  ],
  "author": "Debra Ginsberg",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/8253803-the-neighbors-are-watching"
}