{
  "title": "Diving Mimes, Weeping Czars and Other Unusual Suspects",
  "description": "Return to Ken Scholes' Imagination Forest in this second collection of quirky, off-beat stories. These 17 tales range from his first published story in 2000 to his most recent in 2009, including two stories set in his Psalms of Isaak series.You'll encounter cynical Santas and explore the dating woes of superheroes. You'll join God and Satan in the bar for a glass of merlot and watch the hyjinx unfold as Reverend Sparkle Jones leads his rag-tag gang of misfits across a post-apocalyptic America in search of the holy grail to stem the tide of an alien invasion. You'll meet the Lady of the Lake in the Oklahoma Dust Bowl and bump into Abe and his backup singers as they do their part to save the world.So settle in for the ride and keep your hands inside the vehicle at all times. Here in the Imagination Forest, you never know who — or what — you'll come across.Contents:- Introduction by John A. Pitts- A Weeping Czar Beholds the Fallen Moon (2009, [The Psalms of Isaak])- The Night the Stars Sang Out My Name (2008)- The God-Voices of Settler's Rest (2008)- The Music of the Spheres (2008)- Four Clowns of the Apocalypse and the Mecca of Mirth (2010)- The Boy Who Could Bend and Fall (2009)- The Second Gift Given (2009)- Invisible Empire of Ascending Light (2008)- There Once Was a Girl from Nantucket (A Fortean Love Story) (2006) by John A. Pitts and Ken Scholes- The Taking Night (2000)- On the Settling of Ancient Scores (2006)- In Time of Despair and Great Darkness (2009)- Of Missing Kings and Backward Dreams and the Honoring of Lies (2010)- Grief-Stepping to the Widower's Waltz (2010)- Love in the Time of Car Alarms (2009)- What Child Is This I Ask the Midnight Clear (2007)- Grail-Diving in Shangrilla with the World's Last Mime (2009)- Afterword: A Return to the Imagination Forest by Ken ScholesCover illustration by Paul Swenson",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Short Stories"
  ],
  "author": "Ken Scholes",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/8249200-diving-mimes-weeping-czars-and-other-unusual-suspects"
}