{
  "title": "Tyranny of the Moment: Fast and Slow Time in the Information Age",
  "description": "'While reading Tyranny of the Moment, I found myself both charmed and challenged. The subject is an important one, and Thomas Hylland Eriksen handles it with style, a light touch, and many amiable provocations.' Todd Gitlin The turn of the millennium is characterized by exponential growth in everything related to communication - from the internet and email to air traffic. Tyranny of the Moment deals with some of the most perplexing paradoxes of this new information age. Who would have expected that apparently time-saving technology results in time being scarcer than ever? And has this seemingly limitless access to information led to confusion rather than enlightenment? Eriksen argues that slow time - private periods where we are able to think and correspond without interruption - is now one of the most precious resources we have. Since we are theoretically 'online' 24 hours a day, we must fight for the right to be unavailable - the right to live and think more slowly. It is not only that working hours have become longer - Eriksen also shows how the logic of this new information technology has permeated every area of our lives. Exploring phenomena such as the internet, wap telephones, multi- channel television and email, Eriksen examines this non-linear and fragmented way of communicating to reveal how it affects working conditions in the economy, changes in family life and, ultimately, personal identity. Eriksen argues that a culture lacking a sense of its past, and therefore of its future, is effectively static. Although solutions are suggested, he demonstrates that there is no easy way out.",
  "genres": [
    "Anthropology",
    "Nonfiction",
    "Philosophy",
    "Technology",
    "Sociology",
    "Academic",
    "Society"
  ],
  "author": "Thomas Hylland Eriksen",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/824947.Tyranny_of_the_Moment"
}