{
  "title": "The Unidentified Redhead",
  "description": "The author’s writing style is deliciously addictive. This is the kind of book that will take you out of a slump, any kind of slump – reading slump, the weather sucks slump, I ran out of chocolate slump, you name it.–The Book VixenI love reading books with humor laced through them, but even though the books are funny, I rarely catch myself laughing out loud. I may giggle. I may chuckle. But I rarely find myself suddenly laughing big belly laughs where my family members will look over to me to see if I was okay. That happened many times while I was reading this book. --YummyMenandKickAssChicksIf you don't normally read Contemporaries, The Unidentified Redhead might change your mind. I'll leave you with This is the first book that's ever made me jealous of a fictional character's rack. *sigh* I covet Grace's boobies. --Caught in a Fab The Unidentified Redhead is a funny, madcap, very smexy romantic contemporary that had me reading all night. Filled with plenty of humor, sarcasm, and well developed characters-I didn’t stop laughing till the end. --SmexyBooksThis book was (hand to god) laugh out loud funny...right from the start the chemistry and dialogue between Grace and Jack really made me believe he would be attracted to someone like her, who was outgoing, carefree, and didn’t take him too seriously. --SmokinHotBooksI laughed, I yearned, I got a bit teary eyed, and most importantly, I couldn’t turn the pages fast enough to keep reading this book. The writing style of Clayton is fluid, as if you were truly living the scenes. --A Tale Of Many ReviewsThe sensuality level in these books is through the roof. Grace and Jack are like vines on a tree with one another. –KTGrant (erotic author, ktgbabbles blog)Together, Jack and Grace are one of my new all-time favourite couples. Clayton writes such heated, smouldering and deliciously lengthy sex scenes...I’m talking blush-while-you-read, can’t get enough of the good stuff kind of smutty. Seriously. –Alpha ReaderI LOVED these books! Not only was Grace and Jack’s chemistry off the roof, but their romance was an utterly captivating and engaging one that I couldn’t help but gobble it up as fast as I could. Jack and Grace are HOT and mean really, really HOT together! That’s all I’ve got to say about that . --Larissa’s Bookish LifeWhen Grace Sheridan returns to Los Angeles to become a working actor, it's a second shot at a life-long dream. With some help from her best friend and agent, that dream could become a reality, but at thirty-three, has Grace missed her chance at the big time? Will an unexpected sizzling romance with the entertainment industry's newest 'it' boy shine an uncomfortable spotlight on her life?Alice Clayton spins a playful and erotic May to December romance in this, her debut novel. Clayton's funny, borderline neurotic heroine is perfect in her imperfections, and the off the charts sexual chemistry between her and her charming, yet blissfully unaware leading man are the true heart of The Unidentified Redhead. With laugh out loud dialogue and a super steamy romance that will get your heart racing, sneaking around in L.A. and dodging the Paparazzi has never been so fun.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Humor",
    "Adult",
    "Erotica"
  ],
  "author": "Alice Clayton",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/8250127-the-unidentified-redhead"
}