{
  "title": "Sand Dance: By Camel Across Arabia's Great Southern Desert",
  "description": "For forty days and forty nights during the winter of 1999, three Canadians, Bruce Kirkby, Jamie Clarke, and Leigh Clarke, along with three Omani Bedu, travelled by camel across Arabia’s great southern desert – the legendary Empty Quarter. Journeying from Salala in Oman on the Arabian Sea, they headed north and east for 1,200 kilometres across remote and largely unexplored desert wilderness, where ranges of sand dunes tower to over three hundred metres in height. When they finally reached Abu Dhabi on the Persian Gulf, they were received as heroes. Theirs was the first camel crossing of the Empty Quarter in over fifty years.The expedition had historic roots, since the team sought to retrace for the first time the original 1947 crossing by world-famous explorer and adventurer Sir Wilfred Thesiger. In the years since Sir Wilfred’s journey, Arabia and the Bedu have faced enormous upheaval. The discovery of oil precipitated rapid and irreversible changes to a nomadic society that had existed in relative isolation since the time of Mohammed. Travelling with their three Bedu companions, the team was afforded a rare glimpse of how these changes have affected the last of the Arabian nomads.During the desert crossing the team was determined to travel and live as authentically as possible, on camels, taking Arabic names and wearing traditional clothing, drinking their water from rank goatskins and eating mainly unleavened bread and dried camel meat. The cultural insights they were afforded are constantly fascinating – but so are the cultural clashes, since the party was often followed by Land Cruisers full of well-meaning supporters who threatened to destroy the spirit of the journey.The expedition was also full of adventure and incident – such as a hundred-foot descent down a narrow, snake-infested well, a three-day sandstorm, the sting of a desert scorpion, and the challenge of living with inescapable heat and nagging dehydration.The Empty Quarter Traverse received considerable media coverage, both nationally and internationally. In nineteen countries around the world, 22,000 school children enrolled in the team’s Internet education program, and 4.8 million people visited the expedition Web site. The trek was reported widely and was the subject of a feature story on the CBC National and a front-page colour photo story in the National Post .Now Bruce Kirkby has written a thoughtful and deeply felt account of this challenging expedition – and has illustrated it with twenty-four pages of his stunning colour photographs. Anyone interested in remote areas of the world or stirred by the romance of old-fashioned adventure and daring will find Sand Dance constantly engaging.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Adventure"
  ],
  "author": "Bruce Kirkby",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/825011.Sand_Dance"
}