{
  "title": "Knot Gneiss",
  "description": "Wenda Woodwife expected to live Happily Ever After once a magical spell turned her carved wooden body into lovely human form and won her the heart of the dashing Prince Charming. But now Wenda finds herself cross and confused, beset by emotional upheavals that are driving her beloved away.When she seeks a solution from the Good Magician Humfrey, he refuses, asking her instead to volunteer for an arduous assignment that has little chance of success. For in the depths of the Gap Chasm, a gigantic Knot of reverse wood has become petrified, transforming it into a beacon of terror that no one dares approach. If Wenda’s own magical mastery of wood cannot neutralize the Knot’s powers, nothing can.As she travels toward the source of the danger, she gathers about her a company of remarkable allies, each with their own special talents, and their own personal crises. Meryl Mermaid is a winged creature who despairs of ever finding a proper mate. Wenda’s old friend Jumper, a giant spider who can assume human form, is struggling to find happiness with the Demoness Eris. The brave Prince Hilarion is searching for his vanished soul mate. Angela Angel was exiled from Heaven for tasting forbidden love. And the kindly Princess Ida has begun to wonder if she has grown too old to ever find true romance.The path to the object of their quest is filled with myriad mysterious obstacles, including a Reverse World where everything changes into its opposite, a perplexing invisible maze that confound one’s deepest wishes, and even an armada of bug-eyed space aliens. Wenda and her Companions find themselves transformed, in body, mind, and spirit, and begin to realize that the solution to the problem, and their hearts’ desires, may be far closer than they have suspected.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Humor",
    "Science Fiction Fantasy",
    "Science Fiction",
    "Speculative Fiction",
    "Young Adult"
  ],
  "author": "Piers Anthony",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/8253182-knot-gneiss"
}