{
  "title": "Ancient Egypt 39,000 BCE: The History, Technology, and Philosophy of Civilization X",
  "description": "A view into the sophisticated and highly advanced civilization that preceded the world of the pharaohs• Presents historical evidence of the civilization ruled by the “gods” that the Egyptians claimed preceded their own• Explains who these prehistoric people were, what happened to them, and why they built a series of pyramids along the west bank of the Nile RiverTraditional Egyptologists have long resisted the notion that the architectural achievements of the Ancient Egyptians required the existence of a much more sophisticated technology than would have existed at that time. Yet, no records exist explaining how, why, or who built Egypt’s megalithic monuments and statues. The ancient Egyptians did, however, record that their civilization resided in the shadow of a kingdom of “gods” whose reign ended many thousands of years before their first dynasty. What was this Civilization X that antiquity’s most accomplished people revered as gods?The recent discovery of a large stone at one of Egypt’s oldest ruins presents physical evidence that clearly and distinctly shows the markings of a machining process far beyond the capabilities of the Ancient Egyptians. Likewise, experimental modeling of the Great Pyramid’s subterranean chambers and passageways gives scientific evidence to further support the theory that the civilization responsible for such magnificent monuments is much older than presently believed. Ancient Egypt 39,000 BCE examines this evidence from historical and technical points of view, explaining who these prehistoric people were, what happened to them, why they built their civilization out of granite, and why they built a series of pyramids along the west bank of the Nile River.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Edward F. Malkowski",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/8254336-ancient-egypt-39-000-bce"
}