{
  "title": "Where The Streets Had A Name",
  "description": "Thirteen year old Hayaat is on a mission. She believes a handful of soil from her grandmother's ancestral home in Jerusalem will save her beloved Sitti Zeynab's life. The only problem is that Hayaat and her family live behind the impenetrable wall that divides the West Bank, and they're on the wrong side of check points, curfews, and the travel permit system. Plus, Hayaat's best friend Samy always manages to attract trouble. But luck is on the pair's side as they undertake the journey to Jerusalem from the Palestinian Territories when Hayaat and Samy have a curfew-free day to travel. But while their journey may only be a few kilometers long, it could take a lifetime to complete. . . .  Humorous and heartfelt, WHERE THE STREETS HAD A NAME deals with the Israel-Palestinian conflict with sensitivity and grace and will open a window on this timely subject.  Praise for DOES MY HEAD LOOK BIG IN THIS?:  \"Determined to prove she's strong enough to 'wear a badge of my faith,' Amal faces ostracism and ridicule as she dons her hijab with both good humor and trepidation. . . . Abdel-Fattah's fine first novel offers a world of insight to post-9/11 readers.\" --KIRKUS REVIEWS (starred)  \"More than the usual story of the immigrant teen's conflict with her traditional parents, the funny, touching contemporary narrative will grab teens everywhere.\" --BOOKLIST (starred)  \"Using a winning mix of humor and sensitivity, Abdel-Fattah ably demonstrates that her heroine is, at heart, a teen like any other. This debut should speak to anyone who has felt like an outsider for any reason.\" --PUBLISHERS WEEKLY  \"[A] witty, sensitive debut . . .\" -PEOPLE  Praise for TEN THINGS I HATE ABOUT ME: \"Written with insight, humor and sensitivity, Abdel-Fattah introduces a winning Muslim-Australian heroine who discovers that 'honesty is liberating.' \" -- KIRKUS REVIEWS  \"[T]he author brings a welcome sense of humor to Jamilah's insights about her culture, and she is equally adept at more delicate scenes. . . .\" --PUBLISHERS WEEKLY",
  "genres": [
    "Young Adult",
    "Fiction",
    "Contemporary",
    "Realistic Fiction",
    "Middle Grade",
    "Islam",
    "Audiobook"
  ],
  "author": "Randa Abdel-Fattah",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/8253490-where-the-streets-had-a-name"
}