{
  "title": "Normal Life: Administrative Violence, Critical Trans Politics and the Limits of Law",
  "description": "Wait—what’s wrong with rights?Much of the legal advocacy for trans and gender nonconforming people in the US has reflected the civil rights and \"equality\" strategies of mainstream gay and lesbian organizations—agitating for legal reforms that would ostensibly guarantee equal access, nondiscrimination, and equal protection under the law. This approach assumes that the state and its legal, policing, and social services apparatus—even its policies and documents of belonging and non-belonging—are neutral and benevolent. While we all have to comply with the gender binaries set forth by regulatory bodies of law and administration, many trans people, especially the most marginalized, are even more at risk for poverty, violence, and premature death by virtue of those same \"neutral\" legal structures.Normal Life: Administrative Violence, Critical Trans Politics, and the Limits of Law raises revelatory critiques of the current strategies pivoting solely on a \"legal rights framework,\" but also points to examples of an organized grassroots trans movement that is demanding the most essential of legal reforms in addition to making more comprehensive interventions into dangerous systems of repression—and the administrative violence that ultimately determines our life chances. Setting forth a politic that goes beyond the quest for mere legal inclusion, Normal Life is an urgent call for justice and trans liberation, and the radical transformations it will require.An attorney, educator, and trans activist, Dean Spade has taught classes on sexual orientation, gender identity, poverty and law at the City University of New York (CUNY), Seattle University, Columbia University, and Harvard. In 2002 he founded the Sylvia Rivera Law Project, a collective that provides free legal services and works to build trans resistance rooted in racial and economic justice.",
  "genres": [
    "Nonfiction",
    "Queer",
    "Politics",
    "LGBT",
    "Gender",
    "Law",
    "Transgender"
  ],
  "author": "Dean Spade",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/8251053-normal-life"
}