{
  "title": "Striking Back: The 1972 Munich Olympics Massacre and Israel's Deadly Response",
  "description": "The first full account, based on access to key players who have never before spoken, of the Munich Massacre and the Israeli response–a lethal, top secret, thirty-year-long antiterrorism campaign to track down the killers.1972. The Munich Olympics. Palestinian members of the Black September group murder eleven Israeli athletes. Nine hundred million people watch the crisis unfold on television, witnessing a tragedy that inaugurates the modern age of terror and remains a scar on the collective conscience of the world.Back in Israel, Prime Minister Golda Meir vows to track down those responsible and, in Menachem Begin’s words, “run these criminals and murderers off the face of the earth.” A secret Mossad unit, code named Caesarea, is mobilized, a list of targets drawn up. Thus begins the Israeli response–a mission that unfolds not over months but over decades. The Mossad has never spoken about this operation. No one has known the real story. Until now.Award-winning journalist Aaron Klein’s incisive and riveting account tells for the first time the full story of Munich and the Israeli counterterrorism operation it spawned. With unprecedented access to Mossad agents and an unparalleled knowledge of Israeli intelligence, Klein peels back the layers of myth and misinformation that have permeated previous books, films, and magazine articles about the “shadow war” against Black September and other terrorist groups.Spycraft, secret diplomacy, and fierce detective work abound in a story with more drama than any fictional thriller. Burning questions are at last answered, including who was killed and who was not, how it was done, which targets were hit and which were missed. Truths are revealed: the degree to which the Mossad targeted nonaffiliated Black September terrorists for assassination, the length and full scope of the operation (far greater than previously suspected), retributive acts against Israel, and much more. Finally, Klein shows that the Israeli response to Munich was not simply about revenge, as is popularly believed. By illuminating the tactical and strategic purposes of the Israeli operation, Striking Back allows us to draw profoundly relevant lessons from one of the most important counterterrorism campaigns in history.",
  "genres": [
    "History",
    "Nonfiction",
    "Israel",
    "Terrorism",
    "Politics",
    "Military Fiction",
    "Audiobook"
  ],
  "author": "Aaron J. Klein",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/825494.Striking_Back"
}