{
  "title": "A Death on the Wolf",
  "description": "\"The summer I turned sixteen I shot a man.\" With that simple declaration, Nelson Gody begins his story of the summer of 1969 and the events that would change his life forever.Nelson lives with his widower father and his five-year-old sister on their small farm outside Bells Ferry, Mississippi. It's an idyllic world grounded in family and friendship, a world full of farm chores and lazy afternoons swimming in the Wolf River with Frankie, his best friend.Things begin to change when Nelson finds himself falling in love with Mary Alice, the blind orphan spending the summer with his aunt. While dealing with the emotional rollercoaster of first love, Nelson learns the secret his best friend has been harboring (he's gay and his alcoholic father beats him for it) and nearly trashes his life-long friendship with Frankie. Just when it seems the two boys have worked it all out, saving their friendship, a mysterious stranger comes to town on an exotic motorcycle and interjects himself into their world, giving Frankie the chance to explore his burgeoning sexuality--with horrific consequences. Capped by the devastation of Hurricane Camille, no one escapes unscathed from those six weeks in the summer of '69.Told with narrative drive that pulls you completely into the story, A Death on the Wolf is an uncompromising coming of age tale full of hard-hitting issues which are tackled head-on with courage; not only by the author, but by the characters he's created. \"Real, gritty, heartwarming, with characters and a setting you can see, feel, and taste\" (The Kindle Book Review), Nelson's unvarnished fictional memoir will introduce you to a time and place that is no more--and yet shows how courage, love, and friendship are timeless concepts in the face of life's trials and tribulations.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Coming Of Age",
    "Young Adult",
    "Southern",
    "Book Club",
    "Literature"
  ],
  "author": "G.M. Frazier",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/13114464-a-death-on-the-wolf"
}