{
  "title": "The Best American Short Stories of the Century",
  "description": "Since the series' inception in 1915, the annual volumes of The Best American Short Stories have launched literary careers, showcased the most compelling stories of each year, and confirmed for all time the significance of the short story in our national literature. Now THE BEST AMERICAN SHORT STORIES OF THE CENTURY brings together the best of the best - fifty-five extraordinary stories that represent a century's worth of unsurpassed accomplishments in this quintessentially American literary genre. Here are the stories that have endured the test of time: masterworks by such writers as Ernest Hemingway, William Faulkner, Willa Cather, F. Scott Fitzgerald, William Saroyan, Flannery O'Connor, John Cheever, Eudora Welty, Philip Roth, Joyce Carol Oates, Raymond Carver, Cynthia Ozick, and scores of others. These are the writers who have shaped and defined the landscape of the American short story, who have unflinchingly explored all aspects of the human condition, and whose works will continue to speak to us as we enter the next century. Their artistry is represented splendidly in these pages. THE BEST AMERICAN SHORT STORIES series has also always been known for making literary discoveries, and discovery proved to be an essential part of selecting the stories for this volume too. Collections from years past yielded a rich harvest of surprises, stories that may have been forgotten but still retain their relevance and luster. The result is a volume that not only gathers some of the most significant stories of our century between two covers but resurrects a handful of lost literary gems as well. Of all the great writers whose work has appeared in the series, only John Updike's contributions have spanned five consecutive decades, from his first appearance, in 1959. Updike worked with coeditor Katrina Kenison to choose stories from each decade that meet his own high standards of literary quality.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Literature",
    "Classics",
    "American",
    "Collections"
  ],
  "author": "John Updike",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/131146.The_Best_American_Short_Stories_of_the_Century"
}