{
  "title": "Something in the Water",
  "description": "Although real murder is never a laughing matter, Charlotte MacLeod makes the fictional kind more fun than anyone else. Her latest outing with Professor Peter Shandy, New England's famous horticulturist and homegrown hercule Poirot, takes us to the Maine coast, a world of stormy seas and verdant gardens where dark and bright are strangely mixed... and where secrets abound. Peter Shandy has journeyed northward alone to escape his wife Helen's all-female house party and to go in search of some mysterious lupines - glorious great spikes of bloom that are reportedly growing where conditions should make their existence impossible. He takes a room at a quaint old inn in Pickwance, Maine, and is awaiting a serving of Indian pudding in the dining room when the town's most disliked citizen, Jasper Flodge, keels over, face first, into his chicken pot pie. Foul play is soon suspected - especially since everyone in Pickwance feels that while Jasper never finished his main course, he got his just desserts. Shandy, however, is more intrigued by another enigma. He has located the lupines at an ancient farm owned by Frances Hodgson Rondel, a woman of great age and fixed opinions. Her plants are inexplicably lush, her hens are in glowing health, and she herself is as spry as a woman of forty. Could it be something in the soil - or in the bubbling spring that Miss Rondel guards from prying eyes? And whose voice did Shandy hear shouting threats as he came up the nearly impassable drive? Just as an unidentified element is making Miss Rondel's lupines bloom with incredible splendor, an unknown someone is turning love and hate, greed and lies, into fertile ground - for murder.",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Cozy",
    "Audiobook",
    "Humor",
    "Mystery Thriller"
  ],
  "author": "Charlotte MacLeod",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/825994.Something_in_the_Water"
}