{
  "title": "Sylvia's Family Soul Food Cookbook: From Hemingway, South Carolina, To Harlem",
  "description": "Sylvia's Family Soul Food Cookbook begins as Sylvia recalls her childhood, when she lived with both her mother and her grandmother -- the town's only midwives. The entire community of Hemingway, South Carolina, shared responsibilities, helped raise all of the children, and worked side by side together every day in the bean fields. Perhaps most important, the community shared its food and recipes. When Sylvia set out to write this cookbook, she decided to hold a cook-off back home in Hemingway at Jeremiah Church. Family and friends of all ages shared their favorite dishes as well as their spirit and love for one another. The recipes offered at the cook-off were then compiled to create this incredible collection, along with many of Sylvia's and the Woods family's own recipes.Here are the kinds of recipes you'd find if you visited the Woods family's home. Sylvia's daughter Bedelia is well known for her Barbecued Beef Short Ribs, which are as sassy and spicy as Bedelia herself. Kenneth, Sylvia's youngest son, has loved to fish ever since he was a child, spending his summers by the fishing hole in Hemingway. Now Kenneth's son, DeSean, enjoys fishing, too. Kenneth's Honey Lemon Tilefish, DeSean's favorite, is just one of Kenneth's special recipes presented here.And there are many, many other wonderful dishes, too. In this remarkable cookbook, Sylvia has gathered more than 125 soul food classics, including mouthwatering recipes for okra, collard greens, Southern-style pound cakes, hearty meat and seafood stews and casseroles, salads, mashed potatoes, macaroni and cheese, and more. These recipes are straight from the heart of the Woods community of family and friends. Now Sylvia gives them to you to share with your loved ones. Bring them into your home and experience a little bit of Hemingway's soul.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food"
  ],
  "author": "Sylvia    Woods",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/825677.Sylvia_s_Family_Soul_Food_Cookbook"
}