{
  "title": "The Oxford Book of American Short Stories",
  "description": "\"How ironic,\" Joyce Carol Oates writes in her introduction to this marvelous collection, \"that in our age of rapid mass-production and the easy proliferation of consumer products, the richness and diversity of the American literary imagination should be so misrepresented in most anthologies.\" Why, she asks, when writers such as Samuel Clemens, F. Scott Fitzgerald, Eudora Welty, Flannery O'Connor, Saul Bellow, and John Updike have among them written hundreds of short stories, do anthologists settle on the same two or three titles by each author again and again? \"Isn't the implicit promise of an anthology that it will, or aspires to, present something different, unexpected?\"In The Oxford Book of American Short Stories , Joyce Carol Oates offers a sweeping survey of American short fiction, in a collection of fifty-six tales that combines classic works with many \"different, unexpected\" gems, and that invites readers to explore a wealth of important pieces by women and minority writers. Some selections simply can't be improved on, Oates admits, and she happily includes such time-honored works as Irving's \"Rip Van Winkle,\" Poe's \"The Tell-Tale Heart,\" and Hemingway's \"A Clean, Well-Lighted Place.\" But alongside these classics, Oates introduces such little-known stories as Mark Twain's \"Cannibalism in the Cars,\" a story that reveals a darker side to his humor (\"That morning we had Morgan of Alabama for breakfast. He was one of the finest men I ever sat down to...a perfect gentleman, and singularly juicy\"). From Melville come the juxtaposed tales \"The Paradise of Bachelors and the Tartarus of Maids,\" of which Oates says, \"Only Melville could have fashioned out of 'real' events...such harrowing and dreamlike allegorical fiction.\" From Flannery O'Connor we find \"A Late Encounter With the Enemy,\" and from John Cheever, \"The Death of Justina,\" one of Cheever's own favorites, though rarely anthologized. The reader will also delight in the range of authors found here, from Charles W. Chesnutt, Jean Toomer, and Sarah Orne Jewett, to William Carlos Williams, Kate Chopin, and Zora Neale Hurston. Contemporary artists abound, including Bharati Mukherjee and Amy Tan, Alice Adams and David Leavitt, Bobbie Ann Mason and Tim O'Brien, Louise Erdrich and John Edgar Wideman. Oates provides fascinating introductions to each writer, blending biographical information with her own trenchant observations about their work, plus a long introductory essay, in which she offers the fruit of years of reflection on a genre in which she herself is a master.This then is a book of surprises, a fascinating portrait of American short fiction, as filtered through the sensibility of a major modern writer.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Classics",
    "Literature",
    "American",
    "Read For School"
  ],
  "author": "Joyce Carol Oates",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/131147.The_Oxford_Book_of_American_Short_Stories"
}