{
  "title": "The Record: Contemporary Art and Vinyl",
  "description": "The Record is the full-color catalog accompanying the groundbreaking exhibition The Contemporary Art and Vinyl , curated by Trevor Schoonmaker at the Nasher Museum of Art at Duke University from September 2, 2010 through February 6, 2011. The first exhibition to explore the culture of vinyl records in the history of contemporary art, The Record features rarely exhibited work and recent and newly commissioned pieces by thirty-three artists from around the world. These artists have taken vinyl records as their subject or medium, producing sound work, sculpture, installation, drawing, painting, photography, video, and performance. Works by well-known artists such as Laurie Anderson, Jasper Johns, Ed Ruscha, and Carrie Mae Weems appear alongside those of other North American artists, and of artists from Africa, Asia, Europe, and Latin America, some of whom have never before exhibited in a U.S. museum. Among the works shown are David Byrne's original Polaroid photomontage used for the cover of the 1978 Talking Heads album More Songs about Buildings and Food , the fictive soul \"album covers\" created by the outsider artist Mingering Mike in the late 1960s and early 1970s, and Wheel of Steel (2006), an arresting narrative of record-playing told through digital photos by the South African-born and Berlin-based artist Robin Rhode. In addition to the 225 images, 200 of which appear in color, the catalog includes personal reflections and critical analyses. All of the artists in the exhibition contribute personal statements about their work in relation to the vinyl record, and critics and scholars explore the historical impact of the record on art and music and the ways the medium has helped shape individual and collective identities.ContributorsJeff ChangVivien GoldmanJennifer KabatMark KatzJosh KunBarbara LondonMac McCaughanCarlo McCormickCharlie McGovernMark Anthony NealPiotr OrlovLuc SanteTrevor SchoonmakerDave Tompkins",
  "genres": [
    "Music",
    "Art"
  ],
  "author": "Trevor Schoonmaker",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/8265602-the-record"
}