{
  "title": "El Rey: A Novel of Renaissance Iberia",
  "description": "Winner of the Rosetta Literary Contest 2012 from a field of worldwide submissions, the soul-stirring short story, \"The Converso: A Tale From Renaissance Iberia,\" was adapted from a chapter in this stunning work of historical fiction by Ginger Myrick. Set against the backdrop of 16th century Portugal and Spain at the dawn of the dynamic Age of Exploration, EL REY boasts an inspiring cast of courageous characters that will touch your heart and capture your imagination. At its core is the turbulent love story between Inez García and El Rey.  Inez is the outspoken, independent daughter of a wealthy merchant who fled the Spanish Inquisition and a domineering mother of English noble stock with secrets of her own. At a dinner party in his honor, she falls in love with El Rey, a dashing, charismatic sea captain with a golden voice who has spent his life expanding the Portuguese empire. He is nephew of the King of Portugal with blood ties to the illustrious royal houses of Castile’s Queen Isabella and England’s King Henry VIII.   Inez and El Rey strike up an immediate friendship and discover that they have much in common. Inez has spent her childhood in the shadow of her beautiful elder sister, Serafina, so when El Rey befriends her based on her own merits, she vows that she will never love another. Captivated by her spirited charm and mesmerized by her bewitching silver and gold eyes, El Rey promises to one day return and ask for Inez’s hand in marriage. Though misfortune, class prejudice, and El Rey’s foolish pride conspire to keep them apart, life’s disappointments only make Inez more determined to seek out the elusive happiness in which she has never stopped believing.   But it is much, much more than just a love story.   EL REY is a sweeping family saga spanning three continents and two centuries in the history of the warring kingdoms of medieval Portugal and Castile. It chronicles the heroic struggles of three families to overcome racial discrimination, murder, plague, war, and the Spanish Inquisition. Filled with food and travel, and tempered with humor, tenderness, and tragedy, this intriguing story tells the timeless tale of the triumph of true love and the resilience of the human spirit.   EL REY has something in it for everyone. You will laugh, and you will cry. No one who reads this book will remain unaffected.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Historical",
    "Portugal"
  ],
  "author": "Ginger Myrick",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/13115126-el-rey"
}