{
  "title": "A Carpet Ride to Khiva: Seven Years on the Silk Road",
  "description": "The Silk Road conjures images of the exotic and the unknown. Most travellers simply pass along it. Brit Chris Alexander chose to live there. Ostensibly writing a guidebook, Alexander found life at the heart of the glittering madrassahs, mosques and minarets of the walled city of Khiva - a remote desert oasis in Uzbekistan - immensely alluring, and stayed. Immersing himself in the language and rich cultural traditions Alexander discovers a world torn between Marx and Mohammed - a place where veils and vodka, pork and polygamy freely mingle - against a backdrop of forgotten carpet designs, crumbling but magnificent Islamic architecture and scenes drawn straight from \"The Arabian Nights\". Accompanied by a large green parrot, a ginger cat and his adoptive Uzbek family, Alexander recounts his efforts to rediscover the lost art of traditional weaving and dyeing, and the process establishing a self-sufficient carpet workshop, employing local women and disabled people to train as apprentices. \"A Carpet Ride to Khiva\" sees Alexander being stripped naked at a former Soviet youth camp, crawling through silkworm droppings in an attempt to record their life-cycle, holed up in the British Museum discovering carpet designs dormant for half a millennia, tackling a carpet-thieving mayor, distinguishing natural dyes from sacks of opium in Northern Afghanistan, bluffing his way through an impromptu version of \"My Heart Will Go On\" for national Uzbek TV and seeking sanctuary as an anti-Western riot consumed the Kabul carpet bazaar. It is an unforgettable true travel story of a journey to the heart of the unknown and the unexpected friendship one man found there.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Biography",
    "History",
    "Memoir",
    "Travelogue",
    "Book Club"
  ],
  "author": "Chris  Aslan",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/8261033-a-carpet-ride-to-khiva"
}