{
  "title": "The Fractured Hues of White Light",
  "description": "The Fractured Hues of White Light is an emotional journey that explores who we love and why we love them. Mother, father, daughter, siblings, lovers, spouses, and friends; it’s all love in some form. It is a story about Samantha Ryder, a young autistic woman who is an artist; it is because of her handicap that she often fails to articulate her emotions with an appropriate demonstration. Ironically, the ‘normal people’ who surround her are just as incapable of communicating their feelings, creating a sense of isolation full of things left unsaid. Samantha’s uncanny artistic ability is limited to being a novelty after her father encouraged her to create miniatures of the greatest hits of art history for a wealthy clientele. For years, she has filled sketchbooks with drawings that she feels mean nothing, yet they mean everything. Within the abstract scribbles are the portraits of the people who she loves; the quirk of her disability is how she is very aware of the emotions of her loved ones. They love her with unconditional bonds that vary in degrees; her mother Lenore’s maternal nurturing is sorely missed after her death when Sammy was six. Her father, Whitley, is a possessive narcissist, but his heart is always in the right place. Memories of the protective love of her father’s stepson, Guthrie, filtered into her adolescent fantasies. Her half-sister, Helena, exhibits a lackadaisical tolerance and irritable impatience, yet offers a clinging-vine possessiveness in spite of herself. The lingering romantic feelings of her friend and former lover, Sylvester, manifest in his boundless patience; their continued friendship stands firm on a foundation of trust. When Samantha agreed to marry Preston Ackerman, she initially believed that she could learn to love him, but the empty bond between them causes her to emotionally lose ground. As their marriage falls apart, Preston becomes dangerous, forcing her to go on a journey of self-preservation away from the familiar security of home. Her escape threatens to be her undoing.",
  "genres": [],
  "author": "Laura J.W. Ryan",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/8271883-the-fractured-hues-of-white-light"
}