{
  "title": "The Warlord's Legacy",
  "description": "Corvis Rebaine, the Terror of the East, a man as quick with a quip as he is with a blade, returns in this highly anticipated sequel to Ari Marmell’s acclaimed The Conqueror’s Shadow, a debut hailed for its refreshing take on dark fantasy and surprising flashes of sharp, sarcastic wit. Now Marmell raises the stakes in a story that has all the humor and excitement of its predecessor, plus a terrifying new villain so evil that he may well be a match for Rebaine himself.For let’s not forget how Corvis Rebaine came by the charming nickname “Terror of the East.” Certainly no one else has forgotten. Corvis Rebaine is no hero. In his trademark suit of black armor and skull-like helm, armed with a demon-forged axe, in command of a demonic slave, and with allies that include a bloodthirsty ogre, Rebaine has twice brought death and destruction to Imphallion in pursuit of a better, more equitable and just society. If he had to kill countless innocents in order to achieve that dream, so be it.  At least that was the old Rebaine. Before he slew the mad warlord Audriss. Before he banished the demon Khanda. Before he lost his wife and children, who could not forgive or forget his violent crimes. Now, years later, Rebaine lives in a distant city, under a false name, a member of one of the Guilds he despises, trying to achieve change nonviolently, from within the power structure.   Not even when the neighboring nation of Cephira invades Imphallion and the bickering Guilds prove unable to respond does Rebaine return to his old habits of slaughter. But someone else does. Someone wearing Rebaine’s black armor and bearing what appears to be his axe. Someone who is, if anything, even less careful of human life than Rebaine was.Now Baron Jassion, Rebaine’s old nemesis, is hunting him once more, aided by a mysterious sorcerer named Kaleb, whose powers and secrets make him a more dangerous enemy than Rebaine has ever known. Even worse, accompanying them is a young woman who hates Corvis Rebaine perhaps more than anyone else: his own daughter, Mellorin. Suddenly Rebaine seems to have no choice. To clear his name, to protect his country, and to reconcile with his family, must he once again become the Terror of the East?",
  "genres": [
    "Fantasy",
    "Dark Fantasy",
    "Adult",
    "Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Ari Marmell",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/8272723-the-warlord-s-legacy"
}