{
  "title": "Irresistible Forces",
  "description": "Danielle Steel's forty-seventh bestselling novel is very much about the tides of our times, changes and responsibilities in the workplace pull two people in different directions, sweeping them into new lives and changed worlds...Irresistible ForcesFor fourteen years, Steve and Meredith Whitman have sustained a marriage of passion and friendship--despite the demands of two all-consuming careers.  Meredith, an investment banker, has achieved partnership in one of Wall Street's top firms.  Steve, a gifted physician, chose an urban trauma ward over the big money he could have earned elsewhere.  The only thing missing in their lives is children.  Steve longs for them.  But Meredith keeps putting off motherhood, saying she isn't ready and doesn't have time.  Not yet.  Especially now that she has been offered an extraordinary opportunity, a chance to reach for the brass ring--in San Francisco, three thousand miles away.  Meredith is thrilled and surprised when Steve urges her to accept a top position at an exciting young high-tech company.  Traditionally, men's careers forces families to move to new cities, compelling their wives to abandon friends, home, and lives to follow.  But Steve is more than willing to uproot himself. Saying he'll join her as he can find a new job himself, they can begin their family at last.Neither Steve nor Meredith had reckoned on the frustrations of a bi-coastal marriage, as Steve's job keeps him in New York for months longer than planned.  Weekends together, their lifeline, fall prey to their hectic schedules.  Alone in San Francisco, Meredith is spending long hours at the office with her boss, charismatic entrepreneur Callan Dow.  Steve working late shifts at the hospital, grabbing an occasional dinner with a new colleague, a doctor raising a daughter on her own.  Almost unnoticed, Steve and Meredith have begun living separate lives in increasingly separate worlds.  And despite the best of intentions, irresistible forces begin to tear their lives and hearts apart.With unerring insight, Danielle Steel explores what happens when lives that fit together like delicately balanced puzzles are shifted, changed, and drift apart.  Only time can tell who and what they will become as life sweeps them onward and deposits them on new, sometimes frightening, and often exciting shores.  Who survives, is at the core of Irresistible Forces.>From the Hardcover edition.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Novels",
    "Chick Lit",
    "Adult",
    "Contemporary Romance"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/82812.Irresistible_Forces"
}