{
  "title": "Jennifer Government",
  "description": "In the horrifying, satirical near future of Max Barry's Jennifer Government, American corporations literally rule the world. Everyone takes his employer's name as his last name; once-autonomous nations as far-flung as Australia belong to the USA; and the National Rifle Association is not just a worldwide corporation, it's a hot, publicly traded stock. Hack Nike, a hapless employee seeking advancement, signs a multipage contract and then reads it. He discovers he's agreed to assassinate kids purchasing Nike's new line of athletic shoes, a stealth marketing maneuver designed to increase sales. And the dreaded government agent Jennifer Government is after him. Like Steve Aylett, Alexander Besher, Douglas Coupland, Paul Di Filippo, Jim Munroe, Jeff Noon, and Chuck Palahniuk, Max Barry is an author of smartass, punky satire for the late capitalist era. It's a hip and happening field; before publication, Jennifer Government (Barry's second novel) was optioned by Stephen Soderbergh and George Clooney's Section 8 Films for a major motion picture. However, the level of literary accomplishment varies wildly among practitioners, from brilliant (Di Filippo and Palahniuk) to amateurish (Besher). This field is so hot, its writers needn't be nearly as accomplished as they'd have to become to break into any other form of fiction. That said, like many of his fellow turn-of-the-millennium satirists, Barry is uneven. He has a lively imagination and a sharp eye for the absurdities and offenses of hypercorporate capitalism. But, with its sketchy characters and slow dialogue, Jennifer Government will disappoint anyone who believes the cover copy's grandiose claim that this is \"a Catch-22 for the New World Order.\" --Cynthia Ward",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Dystopia",
    "Humor",
    "Cyberpunk",
    "Thriller",
    "Politics"
  ],
  "author": "Max Barry",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/828160.Jennifer_Government"
}