{
  "title": "Laura Ingalls Wilder's Little Town: Where History & Literature Meet",
  "description": "\"I understand that in my own life, I represented a whole period of American history.\"As Laura Ingalls Wilder realized they would, her widely loved stories of her prairie childhood have become much more than a nostalgic blend of myth, memories, and autobiography. Historically, John Miller reveals, they have much to tell us about the realities of day-to-day living and attitudes in the nineteenth century.History and literature are closely intertwined, Miller contends, and in this book he illustrates how Wilder's novels enhance our understanding of history and how, simultaneously, a historical perspective framed Wilder's fiction. Wilder, he shows, interwove content and form to produce a sentimental and compelling, yet nuanced and believable, picture of family life on the agricultural frontier.Focusing on Wilder's novels set in and around De Smet, South Dakota, which include By the Shores of Silver Lake and Little Town on the Prairie , Miller compares her fictional world to history recorded in census figures, newspaper accounts, county records, maps, and photographs. He illustrates that, although Wilder sacrificed some historical details for simplicity and drama, she preserved a general accuracy of people, places, events, and customs and depicted many facets of late nineteenth-century life, from food and entertainment to work ethics and education.Miller also addresses the controversy over the authorship of the eight novels attributed to Wilder—was she the true author or were they ghostwritten by her daughter, Rose Wilder Lane? He contends that while Lane's editorial contribution was of great value, the voice in the book belongs to Wilder. The books are filled with her interpretations of the truth as influenced by the time period in which she grew up and the culture—the institutions, gossip, informal community pressure, media, stories, songs, roles, and stereotypes—that surrounded her.Providing a glimpse of prairie life through the eyes of a young girl, Wilder's novels are as historically valid as their nonfiction cousins, Miller argues. Hers is a lived history—a sometimes romantic, sometimes observational account of the joys and frustrations of life on the prairie and a reflection of the westward movement in its prime.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "John E. Miller",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/8289.Laura_Ingalls_Wilder_s_Little_Town"
}