{
  "title": "Jewel of Marrakesh",
  "description": "Ebook Short DescriptionThe Moroccan princess, a leader of the \"Me\" generation, where money is no object, loves her shopping sprees, her cell phone, and being spolied. When she is kidnapped by terrorists, it interuptes her bored life. With a welcome rescue by three boys, and an escape to the desert, her life goes from bad to worse, then worse again. She doesn't believe in magic, but it and a jewel is the only way home.Extended DescriptionThree limos made their way along the black ribbon that split the desert into two parts, and drivers pushed down harder on the gas pedals, trying to get that extra increase in speed, suddenly needed. Any little bit to help them escape the jeeps that followed like hornets about to punish an intruder, would be a blessing. They shadowed the royal limo and the two security cars, firing repeatedly at their target. Through one window, then the other, the princess, with eyes as large as saucers, stared out at her tormentors. Princess Layan, the fifteen-year old daughter, of the King of Morocco, was her father’s pride and joy. A spoiled child, headstrong, and a leader of the “Me” generation, where money was no object, got everything she asked for, without as much as a thank you. She was a young woman of beauty, who could easily win the Miss Arabia Pageant, if allowed to enter.“This is my father’s fault,” she thought. “I should have never listened to him. I thought a weekend away from the palace would be fun. Shopping in the mall and going dancing at a nightclub in the evening, that was what I expected. Instead, I was a prisoner at the castle and now I have to go home. He did not need me to bring the jewel from Marrakesh; he could have had it flown in.”The repeated ping, ping, ping on the limo, intensified the fear within. On this highway through the desert, Princess Layan, was afraid and angry. She tried her cell phone, but there were no bars, so she threw it against the side window of the limo, causing the case to break open, and the circuits to fall to the floor. “I needed a new one anyway,” she thought. “That’s last month’s model.”",
  "genres": [],
  "author": "Jack Sakalauskas",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/13116349-jewel-of-marrakesh"
}