{
  "title": "The Personal MBA: A World-Class Business Education in a Single Volume",
  "description": "This revised and expanded edition of the bestselling book, The Personal MBA by Josh Kaufman, gives you everything you need to transform your business, your career or your working life forever.An MBA at a top school is an enormous investment in time, effort and cold, hard cash. And if you don't want to work for a consulting firm or an investment bank, the chances are it simply isn't worth it.Josh Kaufman is the rogue professor of modern business education. Feted by everyone from the business media to Seth Godin and David Allen, he's torn up the rulebook and given thousands of people worldwide the tools to teach themselves everything they need to know.The Personal MBA teaches simple mental models for every subject that's key to commercial success. From the basics of products, sales & marketing and finance to the nuances of human psychology, teamwork and creating systems, this book distils everything you need to know to take on the MBA graduates and win.'File this book NO EXCUSES' Seth Godin, author of Purple Cow and Linchpin'Finally, here's a 10.99 MBA. Well on its way to becoming a business classic. You're pretty much guaranteed to get your money's worth - if not much, much more' Jason Hesse, Real Business'Josh Kaufman has synthesized the most important topics in business into a book that truly lives up to its title. It's rare to find complicated concepts explained with such clarity. Highly recommended' Ben Casnocha, author of My Start-Up LifeJosh Kaufman is an acclaimed blogger and consultant who helps people improve their business skills. He previously worked at Proctor & Gamble. Since 2005 Josh has been helping people learn about business without remortgaging their lives through his website.",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Finance",
    "Entrepreneurship",
    "Management",
    "Personal Development"
  ],
  "author": "Josh Kaufman",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13117020-the-personal-mba"
}