{
  "title": "The Savannah Project",
  "description": "\"An intense, heart-pounding St. Patrick's Day thriller!\"The truth can be a dangerous thing.Terrorism, duty, and personal safety collide when Jake Pendleton, an investigator for the NTSB, is called to investigate an aircraft accident in Savannah, Georgia during the St. Patrick’s Day celebration. The accident, which at first appears to be quite run-of-the-mill, turns out to be anything but. Since Jake is not willing to pretend there are no suspicious circumstances and more than the usual share of rather unlikely “coincidences,” he sets off a veritable avalanche of secrets, violence and treachery. Aided by an unlikely partner, Gregg Kaplan, the air traffic controller who was the last person in contact with the airplane that crashed, Jake sets out to untangle the webs of deceit and to find a vicious killer.Nothing is as it seems, nobody is who you thought them to be.Nothing is sacred.Nobody is safe.ABOUT THE AUTHOR Chuck Barrett, a Florida native, grew up in Panama City. A graduate of Auburn University, Barrett is a retired air traffic controller of over 26 years experience and veteran commercial pilot and flight instructor spanning over three decades of flight experience. In his flying career, he flew mostly air ambulance with the occasional charter and business flights thrown in the mix.Barrett’s first writing experience was drafting labor agreements. He started writing fiction in 1998 in his spare time. His first novel, The Savannah Project, was released in March 2010. This thriller interweaves his aviation expertise, a long-held passion for writing and a keen sense of suspense. In 2011, The Savannah Project became an award-winning novel, winning awards in ForeWord Reviews Book of the Year Award, International Book Awards, and Reader View’s Reviewer’s Choice Awards.He resides in Northeast Florida with his wife, Debi. www.chuckbarrettbooks.com",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Adventure",
    "Suspense",
    "Audiobook"
  ],
  "author": "Chuck Barrett",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/8294012-the-savannah-project"
}