{
  "title": "Gentleman Revolutionary: Gouverneur Morris, the Rake Who Wrote the Constitution",
  "description": "Since 1996, Richard Brookhiser has devoted himself to recovering the Founding for modern Americans. The creators of our democracy had both the temptations and the shortcomings of all men, combined with the talents and idealism of the truly great. Among them, no Founding Father demonstrates the combination of temptations and talents quite so vividly as the least known of the greats, Gouverneur Morris.  His story is one that should be known by every American -- after all, he drafted the Constitution, and his hand lies behind many of its most important phrases. Yet he has been lost in the shadows of the Founders who became presidents and faces on our currency. As Brookhiser shows in this sparkling narrative, Morris's story is not only crucial to the Founding, it is also one of the most entertaining and instructive of all. Gouverneur Morris, more than Washington, Jefferson, or even Franklin, is the Founding Father whose story can most readily touch our hearts, and whose character is most sorely needed today.  He was a witty, peg-legged ladies' man. He was an eyewitness to two revolutions (American and French) who joked with George Washington, shared a mistress with Talleyrand, and lost friends to the guillotine. In his spare time he gave New York City its street grid and New York State the Erie Canal. His keen mind and his light, sure touch helped make our Constitution the most enduring fundamental set of laws in the world. In his private life, he suited himself; pleased the ladies until, at age fifty-seven, he settled down with one lady (and pleased her); and lived the life of a gentleman, for whom grace and humanity were as important as birth. He kept his good humor through war, mobs, arson, death, and two accidents that burned the flesh from one of his arms and cut off one of his legs below the knee.  Above all, he had the gift of a sunny disposition that allowed him to keep his head in any troubles. We have much to learn from him, and much pleasure to take in his company.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "American Revolution",
    "Biography Memoir",
    "Politics"
  ],
  "author": "Richard Brookhiser",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/829164.Gentleman_Revolutionary"
}