{
  "title": "In the Kitchen with A Good Appetite: 150 Recipes and Stories About the Food You Love",
  "description": "“Melissa Clark’s recipes are as lively and diverse as ever, drawing on influences from Marrakech to Madrid to the Mississippi Delta. She has her finger on the pulse of how and what America likes to eat.”—Tom Colicchio, author of Craft of Cooking“A Good Appetite,” Melissa Clark’s weekly feature in the New York Times Dining Section, is about dishes that are easy to cook and that speak to everyone, either stirring a memory or creating one. Now, Clark takes the same freewheeling yet well-informed approach that has won her countless fans and applies it to one hundred and fifty delicious, simply sophisticated recipes.Clark prefaces each recipe with the story of its creation—the missteps as well as the strokes of genius—to inspire improvisation in her readers. So when discussing her recipe for Crisp Chicken Schnitzel, she offers plenty of tried-and-true tips learned from an Austrian chef; and in My Mother’s Lemon Pot Roast, she gives the same high-quality advice, but culled from her own family’s kitchen.Memorable chapters reflect the way so many of us like to Things with Cheese (think Baked Camembert with Walnut Crumble and Ginger Marmalade), The Farmers’ Market and Me (Roasted Spiced Cauliflower and Almonds), It Tastes Like Chicken (Garlic and Thyme–Roasted Chicken with Crispy Drippings Croutons), and many more delectable but not overly complicated dishes.In addition, Clark writes with Laurie Colwin–esque warmth and humor about the relationship that we have with our favorite foods, about the satisfaction of cooking a meal where everyone wants seconds, and about the pleasures of eating. From stories of trips to France with her parents, growing up (where she and her sister were required to sit on unwieldy tuna Nicoise sandwiches to make them more manageable), to bribing a fellow customer for the last piece of dessert at the farmers’ market, Melissa’s stories will delight any reader who starts thinking about what’s for dinner as soon as breakfast is cleared away. This is a cookbook to read, to savor, and most important, to cook delicious, rewarding meals from.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Food Writing",
    "Memoir",
    "Reference"
  ],
  "author": "Melissa Clark",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/8296231-in-the-kitchen-with-a-good-appetite"
}