{
  "title": "The Living Dead 2",
  "description": "The Living Dead 2 has more of what zombie fans hunger for: more scares, more action, more... brains! Experience the indispensable series that defines the very best in zombie literature with a shambling, ravenous herd of original stories. The Living Dead 2 also features a slavering horde of reprint zombie stories. All this adds up to a landmark volume that helps define what zombie godfather John Skipp calls \"The New Zombie Literature.\"Additional contributing authors: Joe McKinneyCarrie RyanKim PaffenrothR.J. SevinJulia SevinCatherine MacLeodMark McLaughlinKyra SchonSteven GouldCatherynne M. ValenteJonathon MaberryGenevieve ValentineJohn SkippCody GoodfellowSarah Langan“Last Stand” by Kelley Armstrong. © 2010 Kelley Armstrong.“Danger Word” by Steven Barnes and Tananarive Due. © 2004 Steven Barnes and Tananarive Due. Originally published in Dark Dreams. Reprinted by permission of the authors.“Pirates vs. Zombies” by Amelia Beamer. © 2010 Amelia Beamer.“We Now Pause for Station Identification” by Gary A. Braunbeck. © 2005 Gary Braunbeck. Originally published as a limited edition chapbook by Endeavor Press. Reprinted by permission of the author.“Steve and Fred” by Max Brooks. © 2010 Max Brooks.“Living with the Dead” by Molly Brown. © 2007 Molly Brown. Originally published in Celebration: 50 Years of the British Science Fiction Association. Reprinted by permission of the author.“Zombie Gigolo” by S. G. Browne. © 2010 S. G. Browne.“The Anteroom” by Adam-Troy Castro. © 2010 Adam-Troy Castro.“The Human Race” by Scott Edelman. © 2009 Scott Edelman. Originally published in Space and Time. Reprinted by permission of the author.“The Summer Place” by Bob Fingerman. © 2010 Bob Fingerman.“The Rapeworm” by Charles Coleman Finlay. © 2008 Charles Coleman Finlay. Originally published in Noctem Aeternus. Reprinted by permission of the author.“Tameshigiri” by Steven Gould. © 2010 Steven Gould.“Everglades” by Mira Grant. © 2010 Seanan McGuire.“The Mexican Bus” by Walter Greatshell. © 2010 Walter Greatshell.“He Said, Laughing” by Simon R. Green. © 2010 Simon R. Green.“Rural Dead” by Bret Hammond. © 2008 Bret Hammond. Originally published in Tales of the Zombie War. Reprinted by permission of the author.“Therapeutic Intervention” by Rory Harper. © 2008 Rory Harper. Originally published on eatourbrains.com. Reprinted by permission of the author.“Lost Canyon of the Dead” by Brian Keene. © 2010 Brian Keene.“Alone, Together” by Robert Kirkman. © 2010 Robert Kirkman.“The Skull-Faced City” by David Barr Kirtley. © 2010 David Barr Kirtley.“The Other Side” by Jamie Lackey. © 2010 Jamie Lackey.“Are You Trying to Tell Me This Is Heaven?” by Sarah Langan. © 2010 Sarah Langan.“Twenty-Three Snapshots of San Francisco” by Seth Lindberg. © 2001 Seth Lindberg. Originally published in Twilight Showcase. Reprinted by permission of the author.“The Wrong Grave” by Kelly Link. © 2007 Kelly Link. Originally published in The Restless Dead. Reprinted by permission of the author.“Mouja” by Matt London. © 2010 Matt London.“Zero Tolerance” by Jonathan Maberry. © 2010 Jonathan Maberry.“Zombie Season” by Catherine MacLeod. © 2008 Catherine MacLeod. Originally published in Bits of the Dead. Reprinted by permission of the author.“The Thought War” by Paul McAuley. © 2008 Paul McAuley. Originally published in Postscripts. Reprinted by permission of the author.“Dating in Dead World” by Joe McKinney. © 2010 Joe McKinney.“Arlene Schabowski of the Undead” by Mark McLaughlin and Kyra M. Schon. © 2007 Mark McLaughlin and Kyra M. Schon. Originally published in Midnight Premiere. Reprinted by permission of the authors.“Who We Used to Be” by David Moody. © 2010 David Moody.“Thin Them Out” by Kim Paffenroth, R. J. Sevin, and Julia Sevin. © 2008 Kim Paffenroth, R. J. Sevin, and Julia Sevin. Originally published as a limited edition chapbook by Creeping Hemlock Press. Reprinted by permission of the authors.“Category Five” by Marc Paoletti. © 2008 Marc Paoletti. Originally published in Sin. Reprinted by permission of the author.“The Crocodiles” by Steven Popkes. © 2010 Steven Popkes. Originally published in The Magazine of Fantasy & Science Fiction. Reprinted by permission of the author.“Reluctance” by Cherie Priest. © 2010 Cherie Priest.“Flotsam & Jetsam” by Carrie Ryan. © 2010 Carrie Ryan.“Where the Heart Was” by David J. Schow. © 1993 David J. Schow. Originally published in Hottest Blood. Reprinted by permission of the author.“The Price of a Slice” by John Skipp and Cody Goodfellow. © 2010 John Skipp and Cody Goodfellow.“Zombieville” by Paula R. Stiles © 2009 Paula R. Stiles. Originally published in Something Wicked. Reprinted by permission of the author.“When the Zombies Win” by Karina Sumner-Smith. © 2010 Karina Sumner-Smith.“The Days of Flaming Motorcycles” by Catherynne M. Valente. © 2010 Catherynne M. Valente. Originally published in Dark Faith. Reprinted by permission of the author.“And the Next, and the Next ” by Genevieve Valentine. © 2010 Genevieve Valentine.“Good People” by David Wellington. © 2010 David Wellington.“Obedience” by Brenna Yovanoff © 2009 Brenna Yovanoff. Originally published in Strange Horizons. Reprinted by permission of the author.",
  "genres": [
    "Horror",
    "Zombies",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Fantasy",
    "Post Apocalyptic"
  ],
  "author": "John Joseph Adams",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/8305839-the-living-dead-2"
}