{
  "title": "Carrion Comfort",
  "description": "“CARRION COMFORT is one of the three greatest horror novels of the 20th century. Simple as that.” --Stephen King\"Epic in scale and scope but intimately disturbing, CARRION COMFORT spans the ages to rewrite history and tug at the very fabric of reality. A nightmarish chronicle of predator and prey that will shatter your world view forever.  A true classic.\" --Guillermo del Toro\"CARRION COMFORT is one of the scariest books ever written.  Whenever I get the question asked Who's your favorite author? my answer is always Dan Simmons.\" --James Rollins\"One of the few major reinventions of the vampire concept, on a par with Jack Finney’s Invasion of the Body Snatchers, Richard Matheson’s I Am Legend, and Stephen King’s Salem’s Lot. --David MorrellTHE PAST...  Caught behind the lines of Hitler’s Final Solution, Saul Laski is one of the multitudes destined to die in the notorious Chelmno extermination camp.  Until he rises to meet his fate and finds himself face to face with an evil far older, and far greater, than the Nazi’s themselves…THE PRESENT...  Compelled by the encounter to survive at all costs, so begins a journey that for Saul will span decades and cross continents, plunging into the darkest corners of 20th century history to reveal a secret society of beings who may often exist behind the world's most horrible and violent events.  Killing from a distance, and by darkly manipulative proxy, they are people with the psychic ability to 'use' read their minds, subjugate them to their wills, experience through their senses, feed off their emotions, force them to acts of unspeakable aggression.  Each year, three of the most powerful of this hidden order meet to discuss their ongoing campaign of induced bloodshed and deliberate destruction.  But this reunion, something will go terribly wrong. Saul’s quest is about to reach its elusive object, drawing hunter and hunted alike into a struggle that will plumb the depths of mankind’s attraction to violence, and determine the future of the world itself…",
  "genres": [
    "Horror",
    "Fiction",
    "Fantasy",
    "Vampires",
    "Thriller",
    "Science Fiction",
    "Paranormal"
  ],
  "author": "Dan Simmons",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/8305270-carrion-comfort"
}