{
  "title": "The Personages of Pride & Prejudice Collection",
  "description": "Contains the novels Charlotte Collins and Caroline Bingley and the short story \"Maria Lucas.\" Also includes bonus deleted scenes from Caroline Bingley. Get the entire Personages of Pride & Prejudice Collection in one ebook for one low price! Charlotte Collins When Charlotte Lucas married Mr. Collins in Jane Austen's Pride and Prejudice, she sacrificed love for financial security. After his death, Charlotte and her sister Maria are thrust into a world of country dances and eligible gentlemen. But when an unprincipled suitor compromises Charlotte's reputation, she struggles to extricate herself from her slander, thus revealing the nature of true love. \"Maria Lucas\" In this continuation of Jane Austen’s Pride and Prejudice, Maria Lucas marries Mr. Jonas Card in an attempt to extricate herself and her sister Charlotte from a dire financial situation. Mr. Card loves Maria and has vowed to woo her. Alas, she views him only in friendly terms. But through a series of unexpected events, Mr. Card succeeds in wooing his wife without saying a word. (5000 word short story) Caroline Bingley Banished from her brother's household, Caroline Bingley is forced to return, humiliated and distressed, to her mother's home in the north of England, but she does not intend to remain there long, for nothing will prevent her from taking her rightful place in London society. When all that Caroline has ever dreamed of attaining--an ancient family name, a title, and a home of her own--is finally within her reach, will she grasp for it even if it means disregarding the workings of her own heart? Or will she cast off the trappings of society and give herself to true love? Deleted Scenes from Caroline Bingley! Other Works in the Personages of Pride & Prejudice Collection Mary Bennet (A Novella)",
  "genres": [
    "Fiction"
  ],
  "author": "Jennifer Becton",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/13118188-the-personages-of-pride-prejudice-collection"
}