{
  "title": "Wives and Daughters",
  "description": "Wives and Daughters, by Elizabeth Gaskell, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. Tremendously popular in her lifetime, Elizabeth Gaskell has often been overshadowed by her contemporaries the Brontës and George Eliot. Yet the reputation of her long-neglected masterpiece Wives and Daughters continues to grow, fulfilling Henry James’s prophecy that the novel would “continue for years to come to be read and relished . . .so delicately, so elaborately, so artistically, so truthfully, and heartily is the story wrought out.”An enchanting tale of romance, scandal, and intrigue in the gossipy English town of Hollingford around the 1830s, Wives and Daughters tells the story of Molly Gibson, the seventeen-year-old daughter of a widowed country doctor. When her father remarries, she forms a close friendship with her new stepsister—the beautiful and worldly Cynthia—until they become love rivals for the affections of Squire Hamley’s sons, Osbourne and Roger. When sudden illness and death reveal some secrets while shrouding others in even deeper mystery, Molly feels that the world is out of joint and it is up to her—trusted by all but listened to by none—to set it right.Amy M. King is Assistant Professor of English at St. John’s University in New York City and the author of Bloom: The Botanical Vernacular in the English Novel (Oxford University Press, 2003).",
  "genres": [
    "Fiction",
    "Classics",
    "Romance",
    "Historical Fiction",
    "Victorian",
    "19th Century",
    "Literature"
  ],
  "author": "Elizabeth Gaskell",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/830330.Wives_and_Daughters"
}