{
  "title": "Touba and the Meaning of Night",
  "description": "An Iranian woman forges her own path through life in this “stylishly original contribution to modern feminist literature” ( Publishers Weekly ). After her father’s death, fourteen-year-old Touba takes her family’s financial security into her own hands by proposing to a fifty-two-year-old relative. But, intimidated by her outspoken nature, Touba’s husband soon divorces her. When she marries again, it is to a prince with whom she experiences tenderness and physical passion and bears four children—but their relationship sours when he proves unfaithful. Touba is granted a divorce, and as her unconventional life continues, she becomes the matriarch of an ever-changing household of family members and refugees . . . Hailed as “one of the unsurpassed masterpieces of modern Persian literature” (Iranian.com), Touba and the Meaning of Night explores the ongoing tensions between rationalism and mysticism, tradition and modernity, male dominance and female will—all from a distinctly Iranian viewpoint. Defying both Western stereotypes of Iranian women and expectations of literary form, this beautiful novel reflects the unique voice of its author as well as an important tradition in Persian women’s writing. Born in Iran in 1946, Shahrnush Parsipur began her career as a fiction writer and producer at Iranian National Television and Radio. She was imprisoned for nearly five years by the Islamist government without being formally charged. Shortly after her release, she published Women Without Men and was arrested and jailed again, this time for her frank and defiant portrayal of women's sexuality. While still banned in Iran, the novel became an underground bestseller there, and has been translated into many languages around the world. She now lives in exile in Northern California.",
  "genres": [
    "Iran",
    "Fiction",
    "Novels",
    "Historical Fiction",
    "Feminism",
    "Literature",
    "20th Century"
  ],
  "author": "Shahrnush Parsipur",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/83202.Touba_and_the_Meaning_of_Night"
}