{
  "title": "The United States of Appalachia: How Southern Mountaineers Brought Independence, Culture, and Enlightenment to America",
  "description": "“Jeff Biggers’s inspiring book should be a best seller immediately. It is a ‘how-to’ book—how to assert your fundamental rights and how to speak out in the manner of the American Revolution footsloggers, whose descendants they are. Read it and your faltering hopes will rise.” --Studs Terkel\"A masterpiece of popular history...revelations abound.”—Citizens-Times, North Carolina\"Biggers has done something more effectively than any other since Appalachian activist Harry M. Caudill penned his 1963 call to action, Night Comes to the Cumberlands. Biggers has brought the Appalachian historical experience to a wide audience.\"--The Journal of Southern History“Jeff Biggers opens a new window on the complex history of the region called Appalachia. He takes a hard but affectionate look at both the myths and the facts, and what he finds is by turns sobering and thrilling. Drawing on the contradictions, layers, and range of what is known as mountain culture, he shows that nothing is quite what it seems, and that to understand American history it is essential to know Appalachian history. Biggers tells his story with verve and vivid detail, a story that will at once provoke and inspire.”—Robert Morgan, author of Boone, Gap CreekFew places in the United States confound and fascinate Americans like Appalachia, yet no other area has been so markedly mischaracterized by the mass media. Stereotypes of hillbillies and rednecks repeatedly appear in representations of the region, but few, if any, of its many heroes, visionaries, or innovators are ever referenced.Make no mistake, they are legion: from Anne Royall, America's first female muckraker, to Sequoyah, a Cherokee mountaineer who invented the first syllabary in modern times, and international divas Nina Simone and Bessie Smith, as well as writers Cormac McCarthy, Edward Abbey, and Nobel Laureate Pearl S. Buck, Appalachia has contributed mightily to American culture — and politics. Not only did eastern Tennessee boast the country's first antislavery newspaper, Appalachians also established the first District of Washington as a bold counterpoint to British rule. With humor, intelligence, and clarity, Jeff Biggers reminds us how Appalachians have defined and shaped the United States we know today.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Southern",
    "Sociology",
    "Historical"
  ],
  "author": "Jeff Biggers",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/831503.The_United_States_of_Appalachia"
}