{
  "title": "Pagan Christmas: The Plants, Spirits, and Rituals at the Origins of Yuletide",
  "description": "An examination of the sacred botany and the pagan origins and rituals of Christmas • Analyzes the symbolism of the many plants associated with Christmas • Reveals the shamanic rituals that are at the heart of the Christmas celebration The day on which many commemorate the birth of Christ has its origins in pagan rituals that center on tree worship, agriculture, magic, and social exchange. But Christmas is no ordinary folk observance. It is an evolving feast that over the centuries has absorbed elements from cultures all over the world--practices that give plants and plant spirits pride of place. In fact, the symbolic use of plants at Christmas effectively transforms the modern-day living room into a place of shamanic ritual. Christian Rätsch and Claudia Müller-Ebeling show how the ancient meaning of the botanical elements of Christmas provides a unique view of the religion that existed in Europe before the introduction of Christianity. The fir tree was originally revered as the sacred World Tree in northern Europe. When the church was unable to drive the tree cult out of people’s consciousness, it incorporated the fir tree by dedicating it to the Christ child. Father Christmas in his red-and-white suit, who flies through the sky in a sleigh drawn by reindeer, has his mythological roots in the shamanic reindeer-herding tribes of arctic Europe and Siberia. These northern shamans used the hallucinogenic fly agaric mushroom, which is red and white, to make their soul flights to the other world. Apples, which figure heavily in Christmas baking, are symbols of the sun god Apollo, so they find a natural place at winter solstice celebrations of the return of the sun. In fact, the authors contend that the emphasis of Christmas on green plants and the promise of the return of life in the dead of winter is just an adaptation of the pagan winter solstice celebration.",
  "genres": [
    "Christmas",
    "History",
    "Nonfiction",
    "Religion",
    "Mythology",
    "Holiday",
    "Paganism"
  ],
  "author": "Christian Rätsch",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/1311958.Pagan_Christmas"
}