{
  "title": "Saving Biological Diversity: Balancing Protection of Endangered Species and Ecosystems",
  "description": "The Goodwin-Niering Center for Conservation Biology and Environmental Studies at Connecticut College is a comprehensive, interdisciplinary program that builds on one of the nation’s leading undergraduate environmental studies programs. The C- ter fosters research, education, and curriculum development aimed at understanding contemporary ecological challenges. One of the major goals of the Goodwin-Niering Center is to enhance the understanding of both the College community and the general public with respect to ecological, political, social, and economic factors that affect natural resource use and preservation of natural ecosystems. To this end, the C- ter has offered six conferences at which academicians, representatives of federal and state government, people who depend on natural resources for their living, and in- viduals from non-government environmental organizations were brought together for an in-depth, interdisciplinary evaluation of important environmental issues. On April 6 and 7, 2007, the Center presented the Elizabeth Babbott Conant interdisciplinary conference on Saving Biological Weighing the Protection of Endangered Species vs. Entire Ecosystems. The Beaver Brook Foundation; Audubon Connecticut, the state of?ce of the National Audubon Society; the Connecticut Chapter of The Nature Conservancy; Connecticut Forest and Park Association and the Connecticut Sea Grant College Program joined the Center as conference sponsors. During this two-day conference we learned about conservation and endangered species fromawiderange ofperspectives. Likeallof theconferences sponsored bythe Goodwin-Niering Center, this conference was broadly interdisciplinary, with pres- tations by economists, political scientists, and conservation biologists.",
  "genres": [],
  "author": "Robert A. Askins",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/10340491-saving-biological-diversity"
}