{
  "title": "La Concubina del Diablo",
  "description": "Poco antes de la hora de su ejecución, una mujer narra, en una fascinante confesión a su sacerdote, la historia de su apasionado amor por un ángel caído. Una historia que nos sumerge en un mundo de terror desde su comienzo en 1212, en la Francia de las Cruzadas, hasta su fin, en la época actual. A través de personajes y escenarios llenos de misterio y sensualidad la protagonista nos da a conocer los asombrosos hechos que forjaron su sobrenatural existencia. Amada por un ángel caído y atormentada por otros, Juliette se verá forzada a sobrevivir a horribles y también sublimes experiencias que sólo a un mortal llegará a confesar. Es éste un inolvidable relato que nos sitúa en presencia de seres seductores, poderosos y pasionales que se mueven con naturalidad entre la inocencia y la crueldad. Pero es también un poético viaje al corazón de un ángel caído cuya lectura resulta imposible interrumpir. La novela arranca en la Francia de 1212, en medio de las luchas de los cátaros. La familia de la joven protagonista ha sido asesinada y ella y un amigo huyen hacia Marsella, donde tomarán un barco rumbo a Tierra Santa para participar en la histórica Cruzada de los Niños. Engañada y vendida como esclava, pronto será liberada por el ángel caído protagonista de la historia, un ser fascinante, bello, misterioso, que desea ansiosamente el reencuentro con el Dios que lo ha expulsado pero que es a veces también profundamente cruel. Esto es sólo el comienzo de una historia que se desarrolla a través de diversos escenarios geográficos y temporales ágilmente descritos, fundamentalmente la Francia de las Cruzadas, Egipto, el París medieval, la Florencia renacentista y la América precolombina.",
  "genres": [
    "Historical Fiction",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Fiction",
    "Angels",
    "Historical"
  ],
  "author": "Ángeles Goyanes",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/8324989-la-concubina-del-diablo"
}