{
  "title": "Dark Dreams: Sexual Violence, Homicide And The Criminal Mind",
  "description": "The Evil That Men Do introduced readers to the lifework and the techniques of FBI profiler Roy Hazelwood.Now, in Dark Dreams , Hazelwood-- writing with bestselling author Stephen G. Michaud-- will take then deep into the minds of his prey, the world's most dangerous sexual criminals, and reveal the extent to which these individuals permeate our society.Profiler Roy Hazelwood is one of the world's leading experts on the strangest and most dangerous of all aberrant offenders-- the sexual criminal. In Dark Dreams he reveals the twisted motive and thinking that go into the most reprehensible crimes. He also catalogs the innovative and remarkably effective techniques-- investigative approaches that he helped pioneer at the FBI's Behavioral Science Unit-- that allow law enforcement agents to construct psychological profiles of the offenders who commit these crimes.Hazelwood has helped track down some of the most violent and well-known criminals in modern history; in Dark Dreams he takes readers into his world-- a sinister world inhabited by scores of dangerous offenders for every Roy Hazelwood who would put them behind * A young woman disappears from the convenience store where she works. Her skeletonized remains are found in a field, near a torture device. Who committed this heinous crime? And why?* A teenager's body is found hanging in a storm sewer. His clothes are neatly folded by the entrance and a stopwatch is found in his mouth. Is he the victim of a bizarre, ritualistic murder...or an elaborate masturbatory fantasy gone awry?* A married couple, driving with their toddler in the backseat, pick up a female hitchhiker. They kidnap her and for seven years keep her as a sexual slave. The wife agreed to this inhuman arrangement in exchange for having a second child. Who was to blame?As gruesome as the crimes are and as unsettling as the odds seem, Hazelwood proves that the right amount of determination and logic can bring even the most cunning and devious criminals to justice.  Dark Dreams is a 2002 Edgar Award Nominee for Best Fact Crime.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Psychology",
    "Crime",
    "Science",
    "Audiobook",
    "History"
  ],
  "author": "Roy Hazelwood",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/832319.Dark_Dreams"
}