{
  "title": "Of Truth and Beasts",
  "description": "“Another must-read... the Hendees, if given a chance to complete their entire saga, may yet produce a combined fantasy masterwork that will surely stand on the highest pinnacles of literary fantasy lore.... As always, the Hendees keep 'em coming.\"    —Bookspot CentralIn each of its novels, the Noble Dead saga has swept readers into \"action sequences that fantasy lore is made of\"* and \"Tolkienesque fantasy [and] vampire-infused horror.\"** Now young journeyor sage Wynn Hygeorht finds herself cast into the wilds on a dangerous quest for knowledge that may instead lead to her own doom....Wynn has returned safely to the Guild of Sagecraft with her companions, the vampire Chane Andraso and Shade, an elven wolf. Though Wynn managed to regain her seized journals, she received only a glimpse of the ancient texts penned by forgotten vampires, and once again, the volumes have slipped from her grasp. The price for her brief success may prove costly.For the animosity of her guild superiors has grown even fiercer. This time, instead of cloistering her, they purposely give her a mission so tedious, it will keep her out of the way for as long as possible. But Wynn has her own plans.She sets out in search of another dwarven stronghold: a place few have ever heard of called Bäalâle Seatt. It may well be the last resting place of an orb — one of five such mysterious devices used by the Ancient Enemy in the mythical war of the Forgotten History. Whatever caused Bäalâle to fall to the enemy, she knows that one mythical figure was somehow involved: the infamous Lord of Slaughter. And that dwarven mass murderer's direct descendant, an errant stonewalker, will never let Wynn out of his sight.If only that were all she had to worry about.** Publishers Weekly",
  "genres": [
    "Fantasy",
    "Vampires",
    "Fiction",
    "Horror",
    "Paranormal",
    "High Fantasy",
    "Dark Fantasy"
  ],
  "author": "Barb Hendee",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/8326789-of-truth-and-beasts"
}