{
  "title": "Creation and Time: A Biblical and Scientific Perspective on the Creation-Date Controversy",
  "description": "\"IN THE BEGINNING GOD CREATED THE HEAVENS AND THE EARTH. \"-Genesis 1:1 One of the most commonly held beliefs among Christians and non Christians alike is that science and Scripture absolutely and irreconcilably contradict each other about the age of the earth. While most scientists affirm an \"old universe\" theory, many Christians favor a \"young universe\" interpretation and somewhere in between, million of devout Christian who respect scientific finding are deeply and painfully torn.\"How can we love the Lord our God with all our heart, soul, mind, and strength if we must separate our minds from our faith? \" asks Dr. Hugh Ross, an astrophysicist and a Bible-believing Christian. \"Such a separation violates the very meaning of faith.\"In Creation and Time, Dr. Ross provides a solution to the creation-date controversy that requires no compromise by either the scientist trusting in the facts of nature or the Christian holding to the inerrancy of Scripture.\"Dr. Ross graciously examines the scientific merits of a young-earth creation and its biblical foundation. He not only demonstrates the more likely age of the universe, but also celebrates the greatness and majesty of its Creator. Creation and Time is a valuable gift to the Christian community.\"-Chuck Smith, Jr. , senior pastor, Capo Beach Calvary Church, Capo Beach, CA\"This is a most important book that should be taught in every church and in the every school to stop the unwarranted war between science and religion.\"-Allan Sandage, Ph.D. , astronomer, Observatories of the Carnegie Institution of Washington, recipient of the Crafoord Prize\"Creation and Time is the best book on this topic in print. It is a must for anyone interested in the conflict between science and Scripture. Dr. Ross' pleas to overzealous 'young earthers' not to make the age of the earth a test of orthodoxy is long overdue. \"-Norman L. Geisler, dean of Southern Evangelical Seminary\"This is a book whose time has come. Never has there been a more urgent moment to staighten out this deep misundertanding in the evangelical community.\" -Ralph D. Winter, general director of the U.S. Center for World Missions",
  "genres": [
    "Science",
    "Nonfiction",
    "Theology",
    "Christian",
    "Religion",
    "Faith"
  ],
  "author": "Hugh Ross",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/832109.Creation_and_Time"
}