{
  "title": "The Motorcycle Diaries: A Journey Around South America",
  "description": "In January 1952, two young men from Buenos Aires set out to explore South America on an ancient Norton motorbike. The journey lasted six months and took them thousands of miles, all the way from Argentina to Venezuela. En route, there was disasters and discoveries, high drama, low comedy, fights, parties and a lot of serious drinking. They met an extraordinary range of people: native indians and copper miners, lepers, police, wanderers and tourists. They became stowaways, firemen and football coaches, and joined in a strike. They sometimes fell in love, and frequently fell off the motorbike. Both of them kept diaries. One of them was a tall and good-looking medical student called Ernest Guevara de la Serna. Using the standard Argentinean nickname, others would sometimes refer to the two companions as Big Che and Little Che. In Ernesto‘s case, the nickname stuck. Within a decade the whole world would know Che Guevara. This is the story of that remarkable journey, eight years before the Cuban Revolution, in Che‘s own words, and illustrated with contemporary photographs. For Che, it was a formative experience, and amidst the humour and pathos of the tale, there are examples of his idealism and his solidarity with the poor and the oppressed. But it is far from being the diary of a militant, and sometimes very far from being “political correct,” which may be the reason that the manuscript has only been made available now, a quarter century after Che‘s death in the Bolivian jungle. Instead, it is a record kept by an exuberant, intelligent and observant 23-year-old, describing what might have been the adventure of a lifetime—had his lifetime not turned into a much greater adventure.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Biography",
    "History",
    "Memoir",
    "Politics",
    "Autobiography"
  ],
  "author": "Ernesto Che Guevara",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/832858.The_Motorcycle_Diaries"
}