{
  "title": "Gotrek & Felix: The Second Omnibus",
  "description": "A Gotrek & Felix OmnibusThe Slayer and his poet companion – plus a host of friends new and old – hunt an ancient dragon, defend the city of Praag from an almighty siege and embark on a quest to save one of their number from the clutches of a vampire in a trio of action-packed novels.READ IT BECAUSEDragons, a massive Chaos siege and the undead – this omnibus contains some classic villains in some of Gotrek & Felix's best loved adventures – along with one of the most shocking twists in the entire series.DESCRIPTIONGotrek and Felix: unsung heroes of the Empire, or nothing more than common thieves and murderers? The truth perhaps lies somewhere in between, and depends entirely upon whom you ask...The Slayer and his poet companion continue their adventures, aided by the Kislevite warrior-princess Ulrika, the wizard Max Schreiber and Gotrek's old comrade Snorri Nosebiter. Returning from their expedition in the distant north, Gotrek and Felix find themselves under attack by and army of monstrous greenskins - and a terrifying dragon. When an immense Chaos horde besieges Praag, the adventurers hasten to defend the beleaguered city - but the masters of the Chaos host have plans for Gotrek. When Ulrika is captured by a dread vampire, the race is on to rescue her before she succumbs to the curse of undeath.This second omnibus of Gotrek & Felix adventures includes three novels by William King – Dragonslayer, Beastslayer and Vampireslayer – and five short stories by various authors that explore some of the many legends of the Slayer and his Rememberer.CONTENTSDragonslayer by William KingBeastslayer by William KingVampireslayer by William KingThe Tilean’s Talisman by David GuymerLord of Undeath by William KingThe Two Crowns of Ras Karim by Nathan LongProphecy by Ben McCallumA Cask of Wynters by Josh Reynolds",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "Zombies",
    "High Fantasy",
    "Adventure",
    "Science Fiction Fantasy"
  ],
  "author": "William King",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/833204.Gotrek_Felix"
}