{
  "title": "Roadtown",
  "description": "Book may have numerous typos, missing text, images, or index. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. 1910. Excerpt: ... CHAPTER XII WHO WILL BUILD THE ROADTOWNS MY many friends have advised me to sell the Roadtown patents or form a company and sell stock. But these people have failed to realize the comprehensiveness of the Roadtown project. Indeed, should I have promoted the Roadtown as a monopoly for private gain I would have unquestionably been the meanest man on earth, for in me and my backers would have been combined all the despotism of the landlord, the railroad magnate, the factory slave driver, the wasteful middleman, the extortionate retailer and half of the commodity trusts. The private owners of the Roadtown would be absolute master of the inhabitants in every phase of life. I know no better way to explain to my wellmeaning friends who wear dollars instead of lenses in their spectacle frames why I do not care to make a private monopoly of Roadtown, than to say that I was raised in a country town and know the sad limitations of human aspirations due to the loneliness and narrowed horizon of isolated existence, and that I have also lived in the congested districts of New York and of other large cities and know the pain and misery of the life of the city, and that for me to think of promoting Roadtown as a private graft would be exactly comparable to the idea of the discoverer of diphtheria antitoxin keeping the secret for selfish gains. The Roadtowns will be built by the people who believe in its principles and who have money to invest at 5 per cent, or the market price of a security better than municipal bonds. The Roadtown corporations will each be chartered with a nominal capital stock which will bear no dividends. I will at first hold this stock in trust. This stock will be the voting stock of the corporation; hence, I or trustees I might name will have control of the policy of the comp...",
  "genres": [],
  "author": "Edgar Chambless",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/8331863-roadtown"
}