{
  "title": "American Jezebel: The Uncommon Life of Anne Hutchinson, the Woman Who Defied the Puritans",
  "description": "Anne Hutchinson, a forty-six- year-old midwife who was pregnant with her sixteenth child, stood before forty male judges of the Massachusetts General Court, charged with heresy and sedition. In a time when women could not vote, hold public office, or teach outside the home, the charismatic Hutchinson wielded remarkable political power. Her unconventional ideas had attracted a following of prominent citizens eager for social reform. Hutchinson defended herself brilliantly, but the judges, faced with a perceived threat to public order, banished her for behaving in a manner \"not comely for [her] sex.\"Until now, Hutchinson has been a polarizing figure in American history and letters, attracting either disdain or exaltation. Nathaniel Hawthorne, who was haunted by the \"sainted\" Hutchinson, used her as a model for Hester Prynne in The Scarlet Letter. Much of the praise for her, however, is muted by a wish to domesticate the heroine: the bronze statue of Hutchinson at the Massachusetts State House depicts a prayerful mother -- eyes raised to heaven, a child at her side -- rather than a woman of power standing alone before humanity and God. Her detractors, starting with her neighbor John Winthrop, first governor of Massachusetts, referred to her as \"the instrument of Satan,\" the new Eve, the \"disturber of Israel,\" a witch, \"more bold than a man,\" and Jezebel -- the ancient Israeli queen who, on account of her tremendous political power, was \"the most evil woman\" in the Bible.Written by one of Hutchinson's direct descendants, American Jezebel brings both balance and perspective to Hutchinson's story. It captures this American heroine's life in all its complexity, presenting her not as a religious fanatic, a cardboard feminist, or a raging crank-as some have portrayed her-but as a flesh-and-blood wife, mother, theologian, and political leader.Opening in a colonial courtroom, American Jezebel moves back in time to Hutchinson's childhood in Elizabethan England, exploring intimate details of her marriage and family life. The book narrates her dramatic expulsion from Massachusetts, after which her judges, still threatened by her challenges, promptly built Harvard College to enforce religious and social orthodoxies -- making her midwife to the nation's first college. In exile, she settled Rhode Island (which later merged with Roger Williams's Providence Plantation), becoming the only woman ever to co-found an American colony.The seeds of the American struggle for women's and human rights can be found in the story of this one woman's courageous life. American Jezebel illuminates the origins of our modern concepts of religious freedom, equal rights, and free speech, and showcases an extraordinary woman whose achievements are astonishing by the standards of any era.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "Womens",
    "Biography Memoir",
    "Religion"
  ],
  "author": "Eve LaPlante",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/833829.American_Jezebel"
}