{
  "title": "Star Wars: The Essential Reader's Companion",
  "description": "THE DEFINITIVE WORD ON STAR WARS FICTION   The legendary motion picture Star Wars has spawned two big-screen sequels and three prequels—and decades of bestselling fiction. From the original movie tie-in novel through the monumental Fate of the Jedi series, legions of devoted readers have helped expand science fiction’s most celebrated film saga into a page-turning print sensation. Now, for the first time, a comprehensive overview of these sweeping Star Wars adventures is presented in one beautifully illustrated volume. Star Wars: The Essential Reader’s Companion spans the entire galaxy of published Star Wars fiction—movie novelizations, original stand alone and series novels, short stories, eBook novellas, young adult titles, and comics—and features:   • a concise synopsis of each story, including key characters and planets • exclusive behind-the-scenes facts and anecdotes about authors, plot and character development, continuity notes, and significance in the Star Wars Expanded Universe • details on which novels are linked to Star Wars comic books from Dark Horse and Marvel • a chronological listing of titles, spanning the 25,000-year history of the Star Wars universe and placing each story in its proper context • more than one hundred full-color original paintings throughout by some of fans’ favorite  artists   Whether skimming through fateful eras from the Old Republic to the New Jedi Order; delving deep into the ancient history of the Lost Tribe of the Sith or the tumultuous Clone Wars; crossing paths—and lightsabers—with Dark Lords such as Plagueis or Bane, Sidious or Vader; helming the Millennium Falcon with Han Solo; or mastering the Force with Luke Skywalker, this one-of-a-kind, one-stop reference is a must for fans looking to maximize their knowledge of the sprawling Star Wars Expanded Universe.",
  "genres": [
    "Star Wars",
    "Reference",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Pablo Hidalgo",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/13121565-star-wars"
}