{
  "title": "The Death Gate Cycle Novels: The Death Gate Cycle, Into the Labyrinth, the Hand of Chaos, Dragon Wing, Serpent Mage, the Seventh Gate, Fire Sea",
  "description": "This is a nonfiction commentary. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Chapters: The Death Gate Cycle, Into the Labyrinth, the Hand of Chaos, Dragon Wing, Serpent Mage, the Seventh Gate, Fire Sea, Elven Star. Source: Wikipedia. Free updates online. Not illustrated. Excerpt: The Death Gate Cycle is a seven-part series of fantasy novels written by Margaret Weis and Tracy Hickman. The main conflict is between two powerful races, the Sartan and the Patryns, which branched off from humans following a nuclear holocaust. Centuries prior to the events of the series, the Sartan attempted to end the conflict by sundering the earth into four elemental realms, and imprisoning the Patryn in a fifth prison world, the Labyrinth. The Sartan took up stewardship of the elemental realms, but soon mysteriously lost contact with each other and disappeared. Centuries later, a Patryn known as Xar escaped the Labyrinth, and started returning to the Labyrinth to rescue others. He learned how to access the other worlds and dreamed of freeing all his people from the Labyrinth and conquering the other worlds. The books follow the fiercely independent Haplo, a Patryn agent sent to scout the elemental worlds and throw them into chaos in preparation for his Lord's conquest of them. Weis and Hickman created five distinct fantasy worlds during the course of the series, along with developing the cultures of five major races, their unique Patryn and Sartan, and the common fantasy races of dwarves, elves, and humans. \"Margaret and I have always tried to take fantasy literature in new directions. Krynn is a world wholly distinct from Earth, unlike Tolkien's Middle-earth. Time travel itself was a science-fiction notion we applied to fantasy. We have even written fantasies taking place in the far future (The Death Gate Cycle) \" Tracy Hickman, The Annotated Dragonlan...More: http: //booksllc.net/?id=121546",
  "genres": [
    "Fantasy",
    "Science Fiction"
  ],
  "author": "Books LLC",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/8335568-the-death-gate-cycle-novels"
}