{
  "title": "Novels by Sarah Waters: Tipping the Velvet, the Little Stranger, the Night Watch, Fingersmith",
  "description": "This is nonfiction commentary. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Chapters: Tipping the Velvet, the Little Stranger, the Night Watch, Fingersmith, Affinity. Source: Wikipedia. Free updates online. Not illustrated. Excerpt: Tipping the Velvet is a historical novel written by Sarah Waters published in 1998. Set in Victorian England during the 1890s, it tells a coming of age story about a young woman named Nan who falls in love with a male impersonator, follows her to London, and finds various ways to support herself as she journeys through the city. The picaresque plot elements have prompted scholars and reviewers to compare it to similar British urban adventure stories written by Charles Dickens and Daniel Defoe. The novel has pervasive lesbian themes, concentrating on eroticism and self-discovery. Waters was working on a PhD dissertation in English literature when she decided to write a story she would like to read. Employing her love for the variety of people and districts in London, she consciously chose an urban setting. As opposed to previous lesbian-themed fiction she had read where the characters escape an oppressive society to live apart from it, Waters chose characters who interact with their surroundings. She has acknowledged that the book imagines a lesbian presence and history in Victorian London where none was recorded. The main character's experiences in the theatrical profession and her perpetual motion through the city allow her to make observations on social conditions while exploring the issues of gender, sexism, and class difference. As Waters' debut novel, Tipping the Velvet was highly acclaimed and was chosen by The New York Times and The Library Journal as one of the best books of 1998. Waters followed it with two other novels set in the Victorian era, both of which were also well-received. Reviewers ha...More: http: //booksllc.net/?id=93638",
  "genres": [],
  "author": "Books LLC",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/8339402-novels-by-sarah-waters"
}