{
  "title": "Makers of Modern Strategy from Machiavelli to the Nuclear Age",
  "description": "The classic reference volume on the theory and practice of warThe essays in this volume analyze war, its strategic characterisitics, and its political and social functions over the past five centuries. The diversity of its themes and the broad perspectives applied to them make the book a work of general history as much as a history of the theory and practice of war from the Renaissance to the present. Makers of Modern Strategy from Machiavelli to the Nuclear Age takes the first part of its title from an earlier collection of essays, published by Princeton University Press in 1943, which became a classic of historical scholarship. Three essays are repinted from the earlier book while four others have been extensively revised. The rest―twenty-two essays―are new.The subjects addressed range from major theorists and political and military leaders to impersonal forces. Machiavelli, Clausewitz, and Marx and Engels are discussed, as are Napoleon, Churchill, and Mao. Other essays trace the interaction of theory and experience over generations―the evolution of American strategy, for instance, or the emergence of revolutionary war in the modern world. Still others analyze the strategy of particular conflicts―the First and Second World Wars―or the relationship between technology, policy, and war in the nuclear age. Whatever its theme, each essay places the specifics of military thought and action in their political, social, and economic environment. Together, the contributors have produced a book that reinterprets and illuminates war, one of the most powerful forces in history and one that cannot be controlled in the future without an understanding of its past.",
  "genres": [
    "History",
    "Military Fiction",
    "Nonfiction",
    "War",
    "Military History",
    "Politics",
    "Philosophy"
  ],
  "author": "Peter Paret",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/833962.Makers_of_Modern_Strategy_from_Machiavelli_to_the_Nuclear_Age"
}