{
  "title": "Keep Me in Your Heart: Letting Go of Lisa / Saving Jessica / Telling Christina Goodbye",
  "description": "Three of Lurlene McDaniel's bestselling novels in one volume. Readers will relate to the compassion and strength of the characters as they piece their lives back together after tragedy strikes.Letting Go of LisaNathan Malone has been home schooled his whole life. He hasn't spent much time with kids his own age, let alone dated. Now that his mother is busy with his new twin sisters, he must enroll at the local high school for his senior year. On the first day of school a girl catches his eye. Lisa is a loner and doesn't care what anybody thinks of her. Nathan is intrigued. When he and Lisa finally start spending time together, he is the happiest he's ever been. But Lisa has a tragic secret and when she decides to deal with it herself, Nathan has to make a choice. Can he ever let go of Lisa?Saving JessicaJessica McMillan and Jeremy Travino are a perfect couple. When they met in high school, Jessica's upbeat spirit helped Jeremy to see that there must be a reason he was spared in the car accident that killed his brother. But now Jessica has been diagnosed with kidney failure. Her only hope is a kidney transplant but no one in her family is a match. Jeremy can't watch another person he loves die. He believes that his life was spared so he could save Jessica by donating a kidney. But his parents are terrified of losing their only child. Will Jeremy go against his parents' wishes to do what he must to save Jessica?Telling Christina GoodbyeTrisha Thompson and her best friend, Christina, are having a great senior year. Trisha and her boyfriend are making plans to attend Indiana University, and Christina received a scholarship to the University of Vermont. Everything would be perfect if only Trisha got along with Christina's controlling boyfriend, Tucker, who is trying to convince Christina not to go away for college. Their lives are forever changed when one night Tucker drives them all home from a basketball game. He hits black ice and the car overturns. Tucker walks away with barely a scratch, but Trisha is injured, Cody is in a coma, and Christina is dead. Those that are left must learn to heal, in order for their lives to move on.",
  "genres": [
    "Young Adult",
    "Romance",
    "Realistic Fiction"
  ],
  "author": "Lurlene McDaniel",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/8341557-keep-me-in-your-heart"
}