{
  "title": "Rational Mysticism: Spirituality Meets Science in the Search for Enlightenment",
  "description": "John Horgan, author of the best-selling The End of Science, chronicles the most advanced research into the mechanics — and meaning — of mystical experiences. How do trances, visions, prayer, satori, and other mystical experiences “work”? What induces and defines them? Is there a scientific explanation for religious mysteries and transcendent meditation?John Horgan investigates a wide range of fields — chemistry, neuroscience, psychology, anthropology, theology, and more — to narrow the gap between reason and mystical phenomena. As both a seeker and an award-winning journalist, Horgan consulted a wide range of experts, including theologian Huston Smith, spiritual heir to Joseph Campbell; Andrew Newberg, the scientist whose quest for the “God module” was the focus of a Newsweek cover story; Ken Wilber, prominent transpersonal psychologist; Alexander Shulgin, legendary psychedelic drug chemist; and Susan Blackmore, Oxford-educated psychologist, parapsychology debunker, and Zen practitioner.Horgan explores the striking similarities between “mystical technologies” like sensory deprivation, prayer, fasting, trance, dancing, meditation, and drug trips. He participates in experiments that seek the neurological underpinnings of mystical experiences. And, finally, he recounts his own search for enlightenment — adventurous, poignant, and sometimes surprisingly comic. Horgan’s conclusions resonate with the controversial climax of The End of Science, because, as he argues, the most enlightened mystics and the most enlightened scientists end up in the same place — confronting the imponderable depth of the universe.",
  "genres": [
    "Science",
    "Spirituality",
    "Philosophy",
    "Religion",
    "Nonfiction",
    "Psychology",
    "Mysticism"
  ],
  "author": "John Horgan",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/83462.Rational_Mysticism"
}