{
  "title": "The Sea King's Daughter: A Russian Legend",
  "description": "Sadko the musician loved his city of Novgorod, the richest and most free in all Russia. With its great feasts, its white stone churches, its merchant visitors from many lands, Sadko felt there was no better place to be. Yet he was lonely too, for the rich young ladies who danced to his music would never favor anyone so poor.One night he takes his twelve-string gusli and goes alone to play by the River Volkhov. Suddenly from the water rises the Sea King, who invites the astonished musician to play at his underwater palace. But how will Sadko get there? And how will he get back? And will he want to return at all, when he meets the Sea King's lovely daughter?One of the most popular legends of Russia, Sadko's story is found in medieval epic ballads, as well as in a popular opera by Rimsky-Korsakov. It is retold here in elegant prose, complemented by the entrancing illustrations of a modern Russian master.TEACHERS AND LIBRARIANS -- A READER'S THEATER SCRIPT OF THIS BOOK IS AVAILABLE IN AARON'S BOOK \"FOLKTALES ON STAGE\" OR ON AARON'S WEB SITE./////////////////////////////////////////////////Aaron Shepard is the award-winning author of \"The Baker's Dozen,\" \"The Sea King's Daughter,\" \"The Monkey King,\" and many more children's books. His stories have appeared often in Cricket magazine, while his Web site is known internationally as a prime resource for folktales, storytelling, and reader's theater. Once a professional storyteller, Aaron specializes in lively retellings of folktales and other traditional literature, which have won him honors from the American Library Association, the New York Public Library, the Bank Street College of Education, the National Council for the Social Studies, and the American Folklore Society.Gennady Spirin, with a style he describes as \"fairy-tale realism,\" is one of the world's most esteemed children's illustrators. His honors include five gold medals from the Society of Illustrators, the Golden Apple from the Bratislava International Biennial, First Prize at the Bologna and Barcelona international book fairs, and four appearances on the New York Times list of Ten Best Illustrated Books of the Year. Born and trained in Russia before moving to the United States, Gennady already knew well the legend of Sadko and welcomed the chance to contribute his sumptuous art to this retelling.",
  "genres": [
    "Picture Books",
    "Fantasy",
    "Russia",
    "Fairy Tales",
    "Childrens",
    "Folklore",
    "Art"
  ],
  "author": "Aaron Shepard",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/834430.The_Sea_King_s_Daughter"
}