{
  "title": "Imagine Love",
  "description": "Imagine moonlight and roses. And London and Paris. And the intoxicating magic of a Louisiana bayou. Then journey with master storyteller Katherine Stone on this breathtaking voyage of danger, courage, and love.They met beside the brilliant blue bayou. She was an innocent girl, and he was a reckless and angry boy. Claire Chamberlain believed in dreams, and Cole Taylor believed in nothing at all. Cole had no reason to believe--until her. They pledged their love beneath the silver winter moon. But the hopes of Cole and Claire were destined to be drowned in blood.Now, twelve years later, Cole has returned to Harlanville. He has found fame as a singer of love songs. And Claire? Her life has changed, irrevocably, yet she has found a private peace--such a fragile one that Cole's very presence shatters her precarious serenity. And now Cole is asking her to do the impossible, to come away with him, to London. Claire knows he will break her heart again. But she will be with him, she has to be, for as long as she can bear the pain.Claire's is not the only endangered heart in London. A murderer has sent Lady Sarah Pembroke an engraved Valentine invitation--to her own death. And is Claire's girlhood friend afraid of the knife-wielding monster? Hardly. The Global News's star correspondent, the woman who feels oddly sane amid the madness of war, has her own private demons, memories far more fearsome than a murderer who chooses the most romantic day of the year to inflict his lethal terror.But neither Sarah's past nor the killer stalking her are as terrifying as Jack Dalton, the FBI consultant determined to save Sarah's life. Jack needs Sarah's help in his exhaustive, careful search for clues. But remarkably, and infuriatingly, Sarah resists. Sarah will not tell Jack the intimate information he needs to know. She cannot. And yet it is as if he already knows her anguished secrets, cares for her more than he should, and wants more from Lady Sarah Pembroke than she can ever give.Imagine Love is an enthralling read, a beautifully crafted tapestry of suspense and love, of surprises you won't imagine, and of men and women you will never forget.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Love",
    "Contemporary Romance"
  ],
  "author": "Katherine Stone",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/131217.Imagine_Love"
}