{
  "title": "Fauna",
  "description": "NOMINEE 2011 – Toronto Book AwardsWhen Edal Jones wakes to the sound of a mouse on the hardwood floor by her bed, she doesn’t quite know why she says softly, “Hello.” But then, a lot of things have stopped making sense for Edal. As a federal wildlife officer at Pearson International Airport she’s seen everything from goliath bird-eating tarantulas crammed in a briefcase to a California condor “folded up like a sports coat.” So why has the sight of juvenile star tortoises crushed and broken in a grandmother’s luggage suddenly made it impossible for her to go on? That same morning, riding her bike in the empty downtown core, Edal spots a young homeless girl rescuing birds that have knocked themselves out against the glassy office towers. Edal tracks Lily through the city to Howell Auto Wreckers in Toronto’s east end and discovers a new world where the links between people and animals can heal rather than hurt. Handsome wrecking-yard owner Guy Howell employs Stephen, a young soldier on medical release whose duties include veterinary as well as mechanical tasks. Guy is rehabilitating a weakened red-tailed hawk, while Stephen raises a litter of orphaned raccoons, and Lily comes and goes with her birds and her constant companion, a massive black dog named Billy. All the characters in Fauna are animal lovers in search of something that human cruelty has denied them. As the narrative develops, we learn more about each of them, until they begin to feel like our intimate friends. The circle expands to include a young veterinary technician mourning her lover’s death, then expands again with dramatic consequences for all concerned when a disturbed young man starts taking out his anger and sorrow on the coyotes that live in the Don Valley. Gently, meditatively, this unique novel delivers a profoundly immersive experience. A new kind of urban writing, Fauna encourages us to look again at the margins and undercurrents of the cities we inhabit, and consider how we treat the other beings who call those spaces home. What’s more, the persuasive beauty of York’s writing, the tenderness of her approach to her characters, and the connections she draws between them invite us to look inward and re-evaluate both the human and the animal within.",
  "genres": [
    "Fiction",
    "Canada",
    "Animals",
    "Contemporary",
    "Book Club",
    "Adult Fiction",
    "Unfinished"
  ],
  "author": "Alissa York",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/8349472-fauna"
}