{
  "title": "Getting Back",
  "description": "Getting Back is a futuristic thriller, an eco-fable with a touch of Survivor, Mad Max, and Avatar. The world's population has doubled. Wilderness exists only in old movies. Every region on Earth has been explored, organized, and tamed. But in this brave new age one secret organization promises the most forbidden pleasure of all: a true outdoor adventure. The price is a year's salary. The destination is a continent that disease has put off-limits. And the catch is that on this expedition, you may never return...In the belly of a shimmering 21st Century pyramid, Daniel Dyson occupies Cubicle 17 and fantasizes about love and escape. By day he pursues petty ways to subvert his overly programmed life. By night he flirts with a shadowy group that dares him to rebel and reclaim his autonomy. Then he stumbles onto Outback Adventure.Outback doesn't advertise and keeps its Internet site heavily encyrpted. Yet Daniel, partly to seek deeper meaning in his life, partly to find a woman who doesn't want to be found, soon finds himself taking a perilous trek across the forbidden continent of Australia. There, Outback has promised he will find out what it means to be truly alive, to test his limits, and to understand real survival. What he and his two dozen fellow adventurers don't know is that all their high-tech gear and all their plans haven't prepared them for what lies ahead. Because this journey will not only plunge them into a stark desert and through a gauntlet of natural dangers, it will force them to face the most dangerous creatures on earth: their fellow humans.Getting Back is a novel of survival and a search for meaning where both have gone extinct - a thriller that asks us whether getting back is the object of the game, or the punishment for losing...Road Warrior,\" a journey into a wasteland depopulated of civilization but not of ideas...speculative fiction at its best, a brainy amalgam of action, romance, and a probing of post-twentieth-century urban civilization that cuts disturbingly close to the bone.\" Steven Pressfield, author, .\"If you've never understood why some people care so much about wildness, then this gripping novel will provide a few of the answers.\" Bill McKibben, author, The End of Nature.\"Dietrich has married the traditions of \"1984\" and \"Deliverance\" to produce a futuristic wilderness thriller that is not only utterly gripping but thought-provoking.\" Robert Clark, author, In The Deep Midwinter.\"An engaging read with considerable depth.\" Christian Science Monitor.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Thriller",
    "Adventure",
    "Dystopia",
    "Suspense",
    "Mystery"
  ],
  "author": "William  Dietrich",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/834520.Getting_Back"
}