{
  "title": "Galileo's Daughter: A Historical Memoir of Science, Faith and Love",
  "description": "Deemed by Albert Einstein to be \"the father of modern physics...of modern science altogether,\" the man who dropped cannonballs from the Tower or Pisa, improved the telescope to discover the moons of Jupiter, and defended Nicolaus Copernicus's theory of the Earth's orbit was, in his day, considered a heretic. Dava Sobel, the author of Longitude, the story of John Harrison's invention of the chronometer, returns with Galileo's Daughter, a fascinating biography that gives an intimate look at the life of Galileo through the 124 letters written by his eldest daughter, Virginia, published in translation for the first time from the Italian. Virginia was one of Galileo's three children born out of wedlock. Together with her depressive younger sister, she was placed in the Convent of San Matteo near Galileo's Florence home at the age of 13, where she took the name Suor Maria Celeste, in tribute to her father's work. Galileo recognized in Virginia an \"exquisite mind,\" and she, in turn recognized the depth of her father's faith in Catholicism and proved to be an unwavering source of loyalty, support, comfort, and strength for him when he was brought to trial before the Holy Office of the Inquisition in 1633. Born in Pisa on February 15, 1564, to a mathematician and the daughter of cloth merchants, Galileo betrayed his father's wishes to become a doctor and instead studied mathematics and philosophy, for he believed that \"philosophy is written in this grand book the universe...but the book cannot be understood unless one first learns to comprehend the language and to read the alphabet in which it is composed...mathematics.\" He began his career teaching at the University of Pisa and the University of Padua until he eventually procured the patronage of the Medici Grand Dukes. Galileo's first commercial invention was the geometric and military compass in 1597, which functioned as an early pocket calculator. But the invention that would announce him to the world came ten years later, when he improved the Dutch spyglass, augmenting the power of the lens manifold times to focus the instrument on the moon and the stars. This reinvented telescope eventually enabled Galileo to discover four of Jupiter's moons, which he documented in his book, The Starry Messenger. His next book, Discourse on Bodies that Stay Atop Water or Move Within It, both challenged Aristotelian physics and announced the presence of sunspots, angering his colleagues and beginning his troubled future. Of course, the real problems for Galileo began when he sought to publish Dialogue Concerning the Two Chief World Systems, in which he began to establish proof of Copernicus's theory that the Earth revolves around the sun. While the bubonic plague was claiming lives throughout Europe and the Thirty Years' War was raging, Pope Urban VIII found Galileo's work most threatening. The pope believed that the motions of the heavenly bodies were the domain of the Holy Fathers of the Church and not of science or philosophy, and he found Galileo to be the greatest enemy of the Catholic Church since Martin Luther. The pope betrayed his former friend further when he forced a sickly Galileo to endure the grueling trials before the Inquisition, threatening him with torture and forcing him to live under house arrest for the remainder of his life. Throughout his life, and especially during the trials, Suor Maria Celeste served her infamous father, whom she addressed as Lord Father, as she would a patron saint. She cared for her him from the convent, whose grounds she never left, through her constant letters, which were sent along with baskets carrying shirts she cleaned and mended for him, confectioneries and health tonics she prepared, and legible, ornate transcriptions of his notes as she prepared his final manuscripts. As these letters reveal, though she was profoundly dedicated to her calling, her devotion to her father, and his love and appreciation for her, was steadfast. She never once doubted his faith or his controversial scientific discoveries. They worried for one another during their frequent illnesses, offered heartfelt condolences when colleagues or relatives passed away. His daughter remained Galileo's constant reader and companion until her death of dysentery at age 27. Though she kept all of his correspondence, his letters have disappeared, likely to have been destroyed by the Mother Abbess of the convent. By turns a moving portrait of the loving relationship between a father and daughter, a riveting chronicle of one of the most intensive battles between scientific truth and religious belief, and a fresh, revelatory biography of one of the most magnificent minds the world has ever known, Galileo's Daughter is a masterful weaving of the lives of the mind, the body, and the soul.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Biography",
    "Italy",
    "Book Club",
    "Biography Memoir"
  ],
  "author": "Dava Sobel",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/8347052-galileo-s-daughter"
}