{
  "title": "I Can See Clearly Now the Rain Is Gone",
  "description": "A gripping sympathetic \"faction\" novel based on the real life incident at Dunblane will answer the question posed by an Edinburgh Evening News \"What Does a Person Who Takes Pictures of Bones Know About Trauma?\" Factual events from a radiographer's point of view are seamlessly blended and revolve around the fictional Bonnyholly Hospital, which serves a picturesque small town in Scotland. When a major incident occurs as in Lockerbie, Dunblane, in Scotland, 9/11 in the US, the atrocities in London or the bombings in Mumbai, Spain or any country worldwide, radiographers will be involved in the medical chain. These individuals are therefore not immune to the emotional and psychological scars their patients undergo.The story tells how the medical team experience pain, anger, guilt and frustration as they deal with a situation none of them had ever dreamed they would see. Courage, sacrifice, sympathy and sheer professionalism help to get everyone through the darkness of that day and the following weeks and months. Those few minutes before the arrival of the ambulances, with lights flashing and sirens shrieking, are like an eternity to the medical staff. Waiting in eerie silence for its young patients are the hospital's radiographers, cleaners, porters, doctors and nurses. They know little of the tragedy they are about to deal with. In this group is Mark, the jovial Superintendent Radiographer known for joking with patients and cheering them up, who has been through a similarly traumatic event in the past and knows this is no time for any light-hearted banter. He has in his charge ten radiographers.The tragedy centres around young children, caught up in a situation so terrible that it couldn't be contemplated, and everyone involved is stretched to the limit of their skills and their emotions. For them all the event will be so traumatic it will follow them like a dark shadow the rest of their lives. From the pits of despair the story reveals how a group of professionals, whose work is largely unknown outside of hospitals, and yet are responsible for 90 percent of diagnostic procedures, deal with a once in a lifetime major incident of unbelievable horror, they will experience the gamut of all human emotions.",
  "genres": [],
  "author": "George Korankye",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/8347892-i-can-see-clearly-now-the-rain-is-gone"
}