{
  "title": "White Bread: A Social History of the Store-Bought Loaf",
  "description": "How did white bread, once an icon of American progress, become “white trash”? In this lively history of bakers, dietary crusaders, and social reformers, Aaron Bobrow-Strain shows us that what we think about the humble, puffy loaf says a lot about who we are and what we want our society to look like. White Bread teaches us that when Americans debate what one should eat, they are also wrestling with larger questions of race, class, immigration, and gender. As Bobrow-Strain traces the story of bread, from the first factory loaf to the latest gourmet pain au levain, he shows how efforts to champion “good food” reflect dreams of a better society—even as they reinforce stark social hierarchies. In the early twentieth century, the factory-baked loaf heralded a bright new future, a world away from the hot, dusty, “dirty” bakeries run by immigrants. Fortified with vitamins, this bread was considered the original “superfood” and even marketed as patriotic—while food reformers painted white bread as a symbol of all that was wrong with America. The history of America’s one-hundred-year-long love-hate relationship with white bread reveals a lot about contemporary efforts to change the way we eat. Today, the alternative food movement favors foods deemed ethical and environmentally correct to eat, and fluffy industrial loaves are about as far from slow, local, and organic as you can get. Still, the beliefs of early twentieth-century food experts and diet gurus, that getting people to eat a certain food could restore the nation’s decaying physical, moral, and social fabric, will sound surprisingly familiar. Given that open disdain for “unhealthy” eaters and discrimination on the basis of eating habits grow increasingly acceptable, White Bread is a timely and important examination of what we talk about when we talk about food.",
  "genres": [
    "Food",
    "History",
    "Nonfiction",
    "Food History",
    "Microhistory",
    "Sociology",
    "Food and Drink"
  ],
  "author": "Aaron Bobrow-Strain",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13122087-white-bread"
}