{
  "title": "The Long Run: A New York City Firefighter's Triumphant Comeback from Crash Victim to Elite Athlete",
  "description": "New York City firefighter's emotional and inspiring memoir of learning to run again after a debilitating accident, based on the wildly popular March 2009 piece in Runner's World. On the morning of December 22, 2005, Matt Long was cycling to work in the early morning when he was struck by and sucked under a 20-ton bus making an illegal turn. The injuries he sustained pushed him within inches of his life. Miraculously, more than 40 operations and months later, Matt was able to start his recovery. In spite of the severity of his injuries, Matt found the psychological consequences of the accident nearly as hard to process. He would no longer be able to compete at the highest level.In the 18 months before the accident, he had competed in more than 20 events including several triathlons and marathons and had qualified for running's most prestigious race, the Boston Marathon. After the accident, his doctor told him he'd be lucky if he could even walk without a cane. The Long Run is an emotional and incredibly honest story about Matt's determination to fight through fear, despair, loneliness, and intense physical and psychological pain to regain the life he once had. The book chronicles Matt's road to recovery as he teaches himself to walk again and, a mere three years later, to run in the 2008 New York City Marathon―a gimpy seven-and-a-half hour journey through the five boroughs. \"Running saved my life,\" Matt says, and his embrace of the running community and insistence on competing in the marathon has inspired many, turning him into a symbol of hope and recovery for untold numbers of others.",
  "genres": [
    "Nonfiction",
    "Sports",
    "Biography",
    "Memoir",
    "Fitness",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Matt Long",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/8343757-the-long-run"
}