{
  "title": "White Coat, Black Hat: Adventures on the Dark Side of Medicine",
  "description": "Over the last twenty-five years, medicine and consumerism have been on an unchecked collision course, but, until now, the fallout from their impact has yet to be fully uncovered. A writer for The New Yorker and The Atlantic Monthly , Carl Elliott ventures into the uncharted dark side of medicine, shining a light on the series of social and legislative changes that have sacrificed old-style doctoring to the values of consumer capitalism. Along the way, he introduces us to the often shifty characters who work the production line in Big from the professional guinea pigs who test-pilot new drugs and the ghostwriters who pen “scientific” articles for drug manufacturers to the PR specialists who manufacture “news” bulletins. We meet the drug reps who will do practically anything to make quota in an ever-expanding arms race of pharmaceutical gift-giving; the “thought leaders” who travel the world to enlighten the medical community about the wonders of the latest release; even, finally, the ethicists who oversee all that commercialized medicine has to offer from their pharma-funded perches. Taking the pulse of the medical community today, Elliott discovers the culture of deception that has become so institutionalized many people do not even see it as a problem. Head-turning stories and a rogue’s gallery of colorful characters become his springboard for exploring larger ethical issues surrounding money. Are there certain things that should not be bought and sold? In what ways do the ethics of business clash with the ethics of medical care? And what is wrong with medical consumerism anyway? Elliott asks all these questions and more as he examines the underbelly of medicine.",
  "genres": [
    "Nonfiction",
    "Science",
    "Medicine",
    "Medical",
    "Health",
    "History",
    "Health Care"
  ],
  "author": "Carl Elliott",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/8355649-white-coat-black-hat"
}