{
  "title": "Trotsky: Downfall Of A Revolutionary",
  "description": "In  Downfall of a Revolutionary, Stanford University lecturer Bertrand M. Patenaude tells the dramatic story of Leon Trotsky's final years in exile in Mexico. Shedding new light on Trotsky s tumultuous friendship with painter Diego Rivera, his affair with Rivera s wife Frida Kahlo, and his torment as his family and comrades become victims of the Great Terror, Downfall of a Revolutionary brilliantly illuminates the fateful and dramatic life of one of history s most famous yet elusive figures.Few political figures of the twentieth century have aroused as much passion, controversy, and curiosity as Leon Trotsky. Trotsky was that rare combination of the man of ideas and the man of action. His role in history his epic rise and fall, his fiery persona, his violent end in Mexico in August 1940 holds a fascination that transcends the history of the Russian Revolution. Based on extensive firsthand research, this groundbreaking biography examines Trotsky's remarkable life from the perspective of his last exile in Mexico.Bertrand M. Patenaude masterfully interweaves the story of Trotsky's final years in Mexico with flashbacks to pivotal episodes in his career as a young Marxist, revolutionary hero, Red Army chief, Bolshevik leader, outcast from Stalin's USSR, and ultimately heretic of the Kremlin, targeted for assassination by its secret police. He vividly recounts the contentious Dewey Commission hearings and the passionate debates among liberals and Communists in the United States and Europe over the Moscow Trials and the charges made against Trotsky.Drawing on Trotsky's private correspondence and diaries, as well as the testimonies of his American bodyguards and secretaries, Patenaude sheds new light on Trotsky's tumultuous friendship with painter Diego Rivera; his affair with Rivera's wife, Frida Kahlo; and his torment as his family and comrades became victims of the Great Terror. Patenaude also turns to KGB files to document Stalin's efforts to eliminate the man he considered his nemesis including a failed commando raid on Trotsky's home three months before his death.Gripping and tragic, Trotsky brilliantly illuminates the fateful and dramatic life of one of history's most captivating and important figures.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Russia",
    "Politics",
    "Soviet Union",
    "Russian Revolution"
  ],
  "author": "Bertrand M. Patenaude",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/8351649-trotsky"
}