{
  "title": "Sara Moulton's Everyday Family Dinners",
  "description": "Sara Moulton may be a professional chef and television personality, but she’s also a working mother who has to get dinner on the table for her husband and kids every night. In Sara Moulton’s Everyday Family Dinners, she shares more than two hundred new family-tested, family-pleasing recipes—whether you’re new to the kitchen or just looking for a way to spice up your recipe repertoire, Sara’s carefully tested recipes are a great place to start.Chicken Saltimbocca with Artichoke Sauce is a welcome change of pace, while Oven-Fried Fish Sticks are a lighter update of a kid-friendly classic. If you’re looking to experiment with new ingredients and cuisines without venturing beyond your local grocery, the Korean-inspired Clay Pot Vegetable Stew and Sara’s take on Vietnamese Bahn Mi make it easy to try global flavors. For a quick, pulled-from-the-pantry meal, try Polenta Lasagna or BLT and Egg Pie. Shake things up and serve appetizers like Pork Sliders, Asian Style, and Manchego-Stuffed Figs Wrapped in Bacon for dinner, or declare Sandwich Night and serve Picadillo Sloppy Joes. If you have a vegetarian in the family or you’re just trying to economize, flip to the chapter on vegetarian mains for recipes for delicious and nutritious fare like Tortilla Pizza or Rustic Potato and Greens Pie. For dessert there’s Butterscotch Pudding Cake, Warm Chocolate Cheesecake, and much more. And finally, on Sunday, when you have a little more time to cook, there is a chapter for comfort food that will cure the end-of-the-weekend blues and get the week started right. Perhaps most important to the overscheduled home cook, Sara’s recipes help you cook smarter, faster, and cleaner. Each recipe lists cooking and preparation times, and easy-to-follow instructions streamline the process by integrating prep and cleanup into each step. Sidebars on shopping, storing, preparing, and serving share the tips Sara has collected over many years of answering questions from home cooks across the country. Creative, crowd-pleasing, and fuss free, the recipes in Sara Moulton’s Everyday Family Dinners make family dinner a pleasure for everyone.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Reference",
    "Nonfiction"
  ],
  "author": "Sara Moulton",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/8352894-sara-moulton-s-everyday-family-dinners"
}