{
  "title": "Ghost Ship: The Mysterious True Story of the Mary Celeste and Her Missing Crew",
  "description": "On December 4th, 1872, a 100-foot brigantine was discovered drifting through the North Atlantic without a soul on board. Not a sign of struggle, not a shred of damage, no ransacked cargo—and not a trace of the captain, his wife and daughter, or the crew. What happened on board the ghost ship Mary Celeste has baffled and tantalized the world for 130 years. In his stunning new book, award-winning journalist Brian Hicks plumbs the depths of this fabled nautical mystery and finally uncovers the truth. The Mary Celeste was cursed as soon as she was launched on the Bay of Fundy in the spring of 1861. Her first captain died before completing the maiden voyage. In London she accidentally rammed and sank an English brig. Later she was abandoned after a storm drove her ashore at Cape Breton. But somehow the ship was recovered and refitted, and in the autumn of 1872 she fell to the reluctant command of a seasoned mariner named Benjamin Spooner Briggs. It was Briggs who was at the helm when the Mary Celeste sailed into history. In Brian Hicks’s skilled hands, the story of the Mary Celeste becomes the quintessential tale of men lost at sea. Hicks vividly recreates the events leading up to the crew’s disappearance and then unfolds the complicated and bizarre aftermath—the dark suspicions that fell on the officers of the ship that intercepted her; the farcical Admiralty Court salvage hearing in Gibraltar; the wild myths that circulated after Sir Arthur Conan Doyle published a thinly disguised short story sensationalizing the mystery. Everything from a voodoo curse to an alien abduction has been hauled out to explain the fate of the Mary Celeste. But, as Brian Hicks reveals, the truth is actually grounded in the combined tragedies of human error and bad luck. The story of the Mary Celeste acquired yet another twist in 2001, when a team of divers funded by novelist Clive Cussler located the wreck in a coral reef off Haiti.Written with the suspense of a thriller and the vivid accuracy of the best popular history, Ghost Ship tells the unforgettable true story of the most famous and most fascinating maritime mystery of all time.",
  "genres": [
    "Nonfiction",
    "History",
    "Mystery",
    "Historical",
    "Adventure",
    "19th Century",
    "True Crime"
  ],
  "author": "Brian Hicks",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/8350489-ghost-ship"
}