{
  "title": "The Rest Is Illusion",
  "description": "Verona College, a small, traditional liberal arts school somewhere in the midwest, is an old and respected institution. The river valley which it overlooks, however, is much, much older; and in those old forest glens and clearings, in the ruins of ancient walls and other constructions of men long past—dwells magic. The focal point of this ancient magic is a tree—a tree preparing to die; And in the magic of this tree, a boy preparing to die finds comfort.As the ordeal of accepting death and finding life’s meaning roils on in the private life of the beautiful and charismatic Dashel Yarnsbrook, his three friends—and one determined enemy—struggle with their own impediments to attaining adulthood. Sarah must decide whether to face down her domineering father. Ashley must learn to cope with the physical differences which cause others to shun him. Tony must choose whether to accept his burgeoning sexual attractions to Dash, or continue to live in denial for the sake of his family and his athletic career. And then there’s Wilder Rawls—taught at a young age that love is weakness, and the only through the manipulation and destruction of others can one truly succeed in the world. And possibly make his distant father proud of him?As the four friends meet their respective challenges, and support one another, they become increasingly aware of the magic that has awakened all around them. While it does not give them answers, it does help to give each of them strength. Only their nemesis, Wilder, is alarmed and unsettled by the seemingly inexplicable events of the early spring thaw.As events come to a head, and tragedy unfolds, each of the five are forced to decide what road they will go down, what obstacles to confront, what truths to face and accept. But the entity is there for them, for all of them, reaching out to offer them a drop of divine guidance, a means to bear the daunting pain that each now suffers—all save one.With elements reminiscent of Knowles’s “A Separate Peace”, Laclos’s “Les Liaisons Dangereuses”, and even Mick Jackson’s movie “L.A. Story”, brilliant young author Eric Arvin, spins a coming of age tale that is different from the rest, which asks us to touch his characters’ souls, and admonishes us to begin, once more, to take note of the magic that lives on all around us—take note…and bestow reverence.",
  "genres": [
    "M M Romance",
    "Gay",
    "Young Adult",
    "Contemporary",
    "Romance",
    "Fiction",
    "Paranormal"
  ],
  "author": "Eric Arvin",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/8364014-the-rest-is-illusion"
}