{
  "title": "The Disciples of Goedric: A Trilogy",
  "description": "The Disciples of Goedric, A Trilogy I. Gay Gene RisingII. Guardians of the BloodIII. SoulFire and TearsAll three books is one larger format volume.Gay Gene Rising: Etan Reyes Llamas, AKA, Patient G—a frail young man who is plagued by horrific visions is released from the hospital after his rare blood condition leads to the discovery of the gay gene. Within weeks, IFC Pharmaceuticals announces AEG/IS, the gay cure. While the world is busy debating the drug’s merits, a suspicious fever kills hundreds of thousands of gay men in the matter of hours, presenting millions upon millions of people with an impossible choice... take the gay cure or die. Guardians of the Blood: Etan flees his Chicago apartment, narrowly escaping corporate henchman who will stop at nothing to get him back under their control. His only hope lies with a rag-tag group of friends, led by the redoubtable Sues, two tough, old-guard lesbians who never thought they’d live long enough to witness the horrors of a second gay plague. Sue DeGault and Sue Keller pray for strength as they prepare to battle fate, and the IFC, a corporate goliath controlled by a powerful family with roots dating back to the days of King Yoshiyahu of Judah—an ancient family that has been raging a religious war against homosexuals for 2,700 years. SoulFire and Tears: In the remote mountains of Mexico, a great grey-wolf raises its muzzle and curls back his lips to taste the air. The scent of blood stings his palette, and he howls into ancient winds as they paint the mists with death. The winds were born on the battlefield, in a time long past. They saw the Great Purge of King Yoshiyahu. They witnessed the atrocities that were committed in the name of Yahweh, and they moaned in anguish as the blood of the Disciples of Goedric muddied the ground. The Sons and Daughters of Goedric had fallen, and their once noble creed was trapped in time, drifting like a ripple across an endless sea, waiting for the second dawn of Man’s hope—with no sign of shore.Prepare to remember what you should never have forgotten—for these pages were written for you...",
  "genres": [
    "Fantasy",
    "M M Romance",
    "LGBT",
    "Fiction"
  ],
  "author": "Jeffrey Jude",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/13123029-the-disciples-of-goedric"
}