{
  "title": "The Joy of Reading: A Passionate Guide to 189 of the World's Best Authors and Their Works",
  "description": "\"Charles Van Doren has laid a feast before all of us that is irresistible.\"—Mortimer J. AdlerThis engaging love letter to reading follows the great authors and classics that transformed the from Aristotle and Herodotus in ancient Greece to Salinger and Heinlein in 20th century America. Like a professor whose enthusiasm enwraps his students, Van Doren explains what's wonderful in the books you've missed and awakens your desire to reopen the books you already know.Divided chronologically by the periods in which these classics were written, each book is put in its historical context and brought to life by Van Doren's brilliant analysis. The Joy of Reading delves into a wide range of genres—fiction, poetry, drama, children's books, philosophy, history and science. This is the one book that brings together everything you need to know about the classics you missed and ignites your passion to read and reread the greatest books the world has ever known.This book is the fruit of a lifelong love affair. Reading, I believe, is my favorite thing to do; books and I have been inseparable almost as long as I can remember … To this day, I become distressed if I am anywhere without a book, a magazine, a newspaper, any scrap of paper to read …. I like the smell of books, certainly the feel of them. Life without books would be, for me, a vacant horror.\"—Charles Van Doren\"Nothing recommends the joy of reading better than the communication of it by a person who has spent a lifetime enriched by the delights of reading. Charles Van Doren is that kind of reader. He has laid a feast before us that is irresistible.\"—Mortimer J. Adler, author of How to Read a Book\"Mr. Van Doren is that rarity, a truly well read man who reads not for professional purposes but for pleasure. His book spurs us on to explore more deeply and joyfully the infinitely varied terrain of good books.\"—Clifton Fadiman, author of The New Lifetime Reading The Classical Guide to World Literature",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Reference",
    "Essays",
    "Education",
    "Self Help",
    "Classics"
  ],
  "author": "Charles van Doren",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/8360677-the-joy-of-reading"
}