{
  "title": "Indelible Ink",
  "description": "Alternate edition for ISBN 9781921215964Every now and again a novel just takes your breath away with its audacity and its perceptive take on life and the world. Indelible Ink is such a book.Marie King has spent most of her life as the wife of a highly successful advertising man; in their own ways, her grown-up children are fragile, vulnerable and needy. Her separation from her husband leaves her directionless and financially stretched. The house she has raised her family in abuts the edge of Sydney harbour in the affluent suburb of Mosman. Even in the approaching economic downturn, its value is substantial and she feels she has no choice but to sell. The prospect of the sale elicits different reactions in her children, unsettling them and bringing back memories of the past. McGregor draws these characters beautifully.After lunch with a friend, and perhaps too much wine, Marie ends up in a bar in Kings Cross and, on a whim, she walks into a tattoo parlour and asks for a tattoo. She finds the slightly illicit experience liberating and soon goes back for another – and soon discovers Rhys, a lesbian artist who is also a gifted tattooist. Marie has seen an example of Rhys’s work, a beautiful rendition of flames, and wants the same; Rhys suggests it will look best on her belly. Rhys introduces Marie to an experience totally different to Mosman.McGregor harks back to her earlier book, Chemical Palace, about the gay subculture in Sydney although Rhys’s world is a gentler more affirming one. The things that Marie had taken for granted seem less definite, especially her relationship with her three adult children, who are also trying to define themselves in the world; McGregor superbly weaves these lives, their conflicts and viscitudes deftly into the wider narrative.Indelible Ink is a powerful, assured and incredibly mature novel; it is a subtle and sympathetic portrait contemporary of family life. Few readers will fail to see reflections of their own lives within its pages. Like Christos Tsiolkas’s The Slap, it will become one of the most talked-about novels of the year.",
  "genres": [
    "Fiction",
    "Book Club",
    "Australia",
    "Literature",
    "Contemporary",
    "Friendship",
    "Death"
  ],
  "author": "Fiona     McGregor",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/8358210-indelible-ink"
}