{
  "title": "The Dragonriders of Pern: Books 1-3",
  "description": "Together in one volume—the first three books in the world’s most beloved science-fiction series!DRAGONFLIGHTOn a beautiful world called Pern, an ancient way of life is about to come under attack. Lessa is an outcast survivor—her parents murdered, her birthright stolen—a strong young woman who has never stopped dreaming of revenge. But when an ancient threat reemerges, Lessa will rise—upon the back of a great dragon with whom she shares a telepathic bond more intimate than any human connection. Together, dragon and rider will fly, and Pern will be changed forever.DRAGONQUESTSince Lessa and Ramoth, her golden queen dragon, traveled into the past to bring forward a small army of dragons and riders to save their world from deadly alien spores, fear and desperation have spread across the land. But while the dragonriders struggle with threats both human and otherworldly, a young rider named F’nor and his brown dragon, Canth, hatch a bold plan to destroy the alien scourge at its source—the baleful Red Star that fills the heavens and promises doom to all. THE WHITE DRAGONNever in the history of Pern has there been a dragon like Ruth. Mocked by other dragons for his small size and pure white color, Ruth is smart, brave, and loyal—qualities that he shares with his rider, the young Lord Jaxom. Unfortunately, Jaxom is also looked down upon by his fellow lords, and by other riders as well. His dreams of joining the dragonriders in defending Pern are dismissed. What else can Jaxom and Ruth do but strike out on their own, pursuing in secret all they are denied? But in doing so, the two friends will find themselves facing a desperate choice—one that will push their bond to the breaking point . . . and threaten the future of Pern itself.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Dragons",
    "Science Fiction Fantasy",
    "Young Adult",
    "Adventure"
  ],
  "author": "Anne McCaffrey",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/8356426-the-dragonriders-of-pern"
}