{
  "title": "Your Soul's Plan: Discovering the Real Meaning of the Life You Planned Before You Were Born",
  "description": "Would you like to understand the deeper spiritual meaning of physical illness, parenting handicapped children, drug addiction, alcoholism, the death of a loved one, accidents, deafness, and blindness? Your Soul’s Plan (which was originally published under the title Courageous Souls: Do We Plan Our Life Challenges Before Birth?) explores the premise that we are all eternal souls who plan our lives, including our greatest challenges, before we are born for the purpose of spiritual growth. Through compelling profiles of people who knowingly planned the experiences mentioned above, Your Soul’s Plan shows that suffering is not purposeless, but rather imbued with deep meaning. Working with four gifted mediums, author Robert Schwartz reveals the significance of each person’s life plan and allows us a fascinating look into the “other side.”Each personal story focuses on a specific life challenge, organized by type for easy reference. Accessible both to those familiar with the metaphysical aspects of spirituality and to the general reader, the moving narratives that comprise Your Soul’s Plan help readers awaken to the reality that they are transcendent, eternal souls. With this stirring book as a guide, feelings of anger, resentment, guilt, and victimization are healed and transformed into acceptance, forgiveness, gratitude, and peace. Robert Schwartz is also the author of Your Soul’s Gift: The Healing Power of the Life You Planned Before You Were Born, which explores the pre-birth planning of spiritual awakening, miscarriage, abortion, caregiving, abusive relationships, sexuality, incest, adoption, poverty, suicide, rape, and mental illness. There’s also a chapter about the pre-birth planning we do with our future pets. Robert Schwartz is a hypnotherapist who offers general Spiritual Guidance Sessions, Past Life Soul Regressions, and Between Lives Soul Regressions. Visit Robert online at www.yoursoulsplan.com.",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Self Help",
    "Philosophy",
    "Personal Development",
    "New Age",
    "Metaphysics"
  ],
  "author": "Robert Schwartz",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/8369940-your-soul-s-plan"
}