{
  "title": "Cuando estuvimos muertos",
  "description": "\"La primera vez que escuché aquella voz fue un atardecer de invierno. Había subido la cuesta del cementerio del pueblo, que estaba cubierta por una fina capa de nieve. Faltaban pocos días para que terminaran las vacaciones de Navidad y me sentia hastiado de las reuniones familiares. En el camino no me había encontrado ni un alma, sólo las huellas de las aves que ahora graznaban en el cielo crepuscular.\"Christian tiene 16 años y, desde la muerte de su hermano gemelo, se ha alejado de sus compañeros de clase y de su familia. Pasa el tiempo libre solo, leyendo poesía y escuchando en su i-Pod canciones tristes en el cementerio de Teià. Un atardecer ve acercarse al camposanto, situado en una colina sobre el mar, a dos chicas y un chico vestidos de negro. Llevan una flor violeta en la solapa y el rostro maquillado de blanco. Los recién llegados le amenazan y tratan de ahuyentarle, pero Christian se enfrenta a ellos. Impresionados por su reacción, los jóvenes forasteros se presentan como Alexia, Lorena y Robert. En una conversación a la luz de las velas, le revelan que han formado una orden secreta, RETRUM, que se reúne en los cementerios con un oscuro fin... Quien aspire a unirse a ellos deberá someterse a un desafío: pasar toda una noche solo en el cementerio. Inspirado por las lecturas y canciones siniestras que acompañan su vida, Christian se ofrece a pasar la prueba a la noche siguiente. Tras superar las horas más pavorosas de su vida, Christian se entregará progresivamente a los extraños juegos de «la orden pálida», como también se hace llamar el cuarteto, mientras Alexia empieza a convertirse en algo más que una amiga. Pero como reza un viejo proverbio árabe: «Quien llama repetidamente a la puerta, acaba entrando»…",
  "genres": [
    "Young Adult",
    "Drama",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Thriller",
    "Gothic"
  ],
  "author": "Francesc Miralles",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/8364861-cuando-estuvimos-muertos"
}