{
  "title": "The Artilect War: Cosmists Vs. Terrans: A Bitter Controversy Concerning Whether Humanity Should Build Godlike Massively Intelligent Machines",
  "description": "This book’s main idea is that this century’s global politics will be dominated by the \"species dominance\" issue. 21st century technologies will enable the building of artilects (artificial intellects, artificial intelligences, massively intelligent machines) with 1040 components, using reversible, heatless, 3D, molecular scale, self assembling, one bit per atom, nano-teched, quantum computers, which may dwarf human intelligence levels by a factor of trillions of trillions and more. The question that will dominate global politics this century will be whether humanity should or should not build these artilects. Those in favor of building them are called \"Cosmists\" in this book, due to their \"cosmic\" perspective. Those opposed to building them are called \"Terrans,\" as in \"terra,\" the Earth, which is their perspective. The Cosmists will want to build artilects, amongst other reasons, because to them it will be a religion, a scientist's religion that is compatible with modern scientific knowledge. The Cosmists will feel that humanity has a duty to serve as the stepping-stone towards building the next dominant rung of the evolutionary ladder. Not to do so would be a tragedy on a cosmic scale to them. The Cosmists will claim that stopping such an advance will be counter to human nature, since human beings have always striven to extend their boundaries. Another Cosmist argument is that once the artificial brain based computer market dominates the world economy, economic and political forces in favor of building advanced artilects will be almost unstoppable. The Cosmists will include some of the most powerful, the richest, and the most brilliant of the Earth's citizens, who will devote their enormous abilities to seeing that the artilects get built. A similar argument applies to the military and its use of intelligent weaponry. Neither the commercial nor the military sectors will be willing to give up artilect research unless they are subjected to extreme Terran pressure. To the Terrans, building artilects will mean taking the risk that the latter may one day decide to exterminate human beings, either deliberately or through indifference. The only certain way to avoid such a risk is not to build them in the first place. The Terrans will argue that human beings will fear the rise of increasingly intelligent machines and their alien differences. To build artilects will require an \"evolutionary engineering\" approach. The resulting complexities of the evolved structures that underlie the artilects will be too great for human beings to be able to predict the behaviors and attitudes of the artilects towards human beings. The Terrans will be prepared to destroy the Cosmists, even on a distant Cosmist colony, if the Cosmists go ahead with an advanced artilect building program. In the short to middle term, say the next 50 years or so, the artificial brain based industries will flourish, providing products that are very useful and very popular with the public, such as teacher robots, conversation robots, household cleaner robots, etc. In time, the world economy will be based on such products. Any attempt to stop the development of increasingly intelligent artilects will be very difficult, because the economic and political motivation to continue building them will be very strong in certain circles. If the brain-based computer industries were to stop their research and development into artilects, then many powerful individuals, including the artilect company presidents and certain politicians will lose big money and political influence. They will not give up their status without a fight. However, as the intelligence levels of the early artilects increases, it will become obvious to everyone that the intelligence gap between these artificial-brain-based products and human beings is narrowing. This will create a growing public anxiety. Eventually, some nasty incident or series of incidents will galvanize most of society against further increase of artificial intelligence in the artilects, leading to the establishment of a global ban on artilect research. The Cosmists however, will oppose a ban on the development of more intelligent artilects, and will probably go underground. If the incidents continue and are negative enough, the anger and hatred of the Terrans towards the Cosmists will increase to the point where the Cosmists may decide that their fate is to leave the Earth, an option that is quite realistic with 21st century technology. Since the Cosmists will include some of the most brilliant and economically powerful people on the planet, they will probably create an elite conspiratorial organization whose aim is to build artilects secretly. The book presents a scenario in which the Cosmists create an asteroid-based colony, masked by some innocuous activity. In reality, this secret society devises a weapon system superior to the best on the Earth. With their wealth and the best human brains, this may be achievable. They will also start making advanced artilects. If the Terrans on the Earth discover the true intentions of the Cosmists, they will probably want to destroy them, but not dare to because of the counter threat of the Cosmists with their more advanced weapons. The stage is thus set for a major 21st century war in which billions of people die – \"gigadeath.\" This horrific number is derived from an extrapolation up the graph of the number of deaths in major wars from the beginning of the 19th century to the end of the 21st century. Approximately 200 million people died in the 20th century, for political reasons -- wars, purges, genocides, etc. The profound schizophrenia that the author feels on the Cosmist/Terran species dominance issue will be felt by millions of people within a few years he expects. There is probably Cosmist and Terran in nearly all of us, which may explain why this issue is so divisive. The author is simply one of the first to feel this schizophrenia. Within a decade it may be all over the planet. The last chapter of the book closes with a repetition of a pithy slogan that summarizes the two main viewpoints in the artilect debate in a nutshell; a debate that the author believes will be raging in the coming decades. \"Do we build gods, or do we build our potential exterminators?\"",
  "genres": [
    "Science",
    "Nonfiction",
    "Philosophy",
    "Artificial Intelligence"
  ],
  "author": "Hugo de Garis",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/83659.The_Artilect_War"
}