{
  "title": "The Hollow Curse",
  "description": "Ben and Alysia are the current incarnations of soul mates cursed, in a previous life, to be separated by a gulf of years and social norms until they fully accept their love, share a lifetime, and raise a child together. The book follows them through some of their incarnations and shows how the spirit that now inhabits Dorry, Alysia's collage girlfriend, who was the originator of the curse in a previous incarnation, has hounded them through life after life. The story plays out in the current day and with the characters experiencing their past lives as Albert, Bernidine and Darius in the fifteen hundreds. Duke Darius forces Bernidine, a woman half his age who is already pledged to wed her true love, Sir Albert, to marry him. When Albert infiltrates Darius' court, and has an affair with his beloved Bernidine, Darius forces a reluctant witch to cast the curse that he feels will keep the young lovers apart forever. Unable to directly oppose Darius, because of what he will do to her coven mates if she does, the witch works a clause into the spell that if Albert and Bernidine live a life and raise a child together, the curse will be broken. Albert kills Darius in single combat but is mortally wounded leaving the curse to stand for another life. Next, Ben and Alysia recall a life where they are Abigail and Bernia, well to do, Sapphic lovers, who are persecuted by Donald, Abigail's dead-husband's brother, in the England of 1775. Abigail sits as steward over her dead husband's estates for her son, Samuel, whom Donald wishes dead so the succession will fall to himself. Samuel accepts his mother's choice in bedmates and offers to impregnate Bernia when she and Abigail wish to have a child together. When Abigail learns that Donald murdered her husband she confronts him and the tragic cycle repeats itself. The story continues through the lives of Ada, an emancipated slave, and Bailey, a maverick physician, in the American west of 1876, who are hounded by the local tough, Diego. In addition to Diego's obsession with Ada, whose family were slaves on Diego's grandfather's plantation, Bailey and Ada must face the bigotry of their time and Bailey's concern about their age difference. In the end Ada and Bailey are set to end the curse when Diego murders Ada on her wedding day. Throughout the book, the story of Ben and Andrea, Alysia's last incarnation, where she was the older woman and Ben the younger man, is spun out as the catalyst that forces the lovers to recall their lives together. Will Alysia and Ben accept the love they feel? Will Dorry relinquish her centuries old quest for vengeance? Will love prevail, or will the cycle of tragedy death and despair repeat itself? Read on.",
  "genres": [],
  "author": "Stephen B. Pearl",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/8364887-the-hollow-curse"
}