{
  "title": "Brutal Bible Tales",
  "description": "Please Steven Rage's literary assaults contain graphic violence, illicit drug use, non-consensual extreme sex, and potentially offensive material given the religious references. Be forewarned! These Brutal Bible Tales are not for the faint of heart. NC-17.PART 3 “The Dope Fiend’s Holy War” Immanuel the Christ has some nerve. Jonah has already lost everyone he loves to Pilate the vampire and his Harbor drug violence. Jonah now trudges through his days staying as high on Plata as possible. He just wants to be left alone while he waits for his turn to die. The Christ has other plans for him. She sends Her messenger, Pedro, to assign Jonah the very dangerous task of ordering the Herod to dismantle the Harbor's Plata trade. Jonah has a fight or flight. He decides to run. But you can't run from God forever. As Jonah learns the hard way when the 'Edmund Fitzgerald' founders and goes down in rough seas, with the reluctant prophet on board.PART 2 “Harbor Herods” Job is Satan’s Chosen One and he doesn’t take kindly to orders from some upstart prophet. Rather than acquiescing, Job thinks caving Jonah’s head in with a tire iron is the best bet. Jonah finds himself out of the frying pan, but firmly fixed in the fire. Then the Lord Herself starts dispatching Job’s children. One at a time, until he obeys…PART 1 “Fall of a Blood Drinking Drug Dealer” Re-written from \"PILATE\" in first person, present tense, here is where the Brutal Bible Tales Pontius Pilate is cursed to be a Life after life after life. PILATE is a drug lord vampire in this re-telling of Christ's final days. When given yet another chance to save the Earth's latest Christ, will the re-incarnated Pilate choose to protect Her? Or, will he wash his hands once again? Be The Harbor is wicked. The violence is graphic. The sex is brutal and the terror is palpable. PILATE is not your parents' bible story.",
  "genres": [],
  "author": "Steven Rage",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/8376429-brutal-bible-tales"
}