{
  "title": "تاريخ أوروبا في العصور الوسطى",
  "description": "النيل والفرات:يعتبر تاريخ أوروبا أوروبا في القرون الوسطى من أشد عصور التاريخ تعقيداً وتنوعاً وأهمية. فدراسة هذه الحقبة من التاريخ الأوروبي التي امتدت ألف تتناول تشكيلة تعبر عن جانب هام من جوانب تطور التاريخ البشري، هذا وإن المدخل الطبيعي لدراسة تاريخ أوروبا في العصور الوسطى يبدأ باستعراض أحوال الإمبراطورية الرومانية في أقصى مراحل قوتها وعظمتها، وليس معنى هذا أن تاريخ أوروبا في العصور الوسطى يبدأ بداية دقيقة من هذه المرحلة، وإنما تساعد هذه المرحلة على فهم الأسس والعوامل التي كيفت التاريخ الأوروبي في العصور الوسطى. هذا إلا أن حضارة أوروبا في العصور الوسطى ليست في حقيقة أمرها إلى مزيجاً من حضارة الرومان من جهة وحضارة العناصر الديرية التي اجتازت حدود الإمبراطورية الرومانية واستقرت داخل أراضيها واختلطت بأهاليها من جهة أخرى. والواقع أن الإمبراطورية الرومانية كانت أعظم وحدة حضارية وسياسية عرفها التاريخ، إذ لم يقدر لإمبراطورية أخرى في تاريخ البشر القديم أو الحديث أن تبلغ ما بلغته الإمبراطورية الرومانية من قوة واتساع. ذلك أن هذه الإمبراطورية ضمّت بين حدودها جميع مراكز الحضارات القديمة، باستثناء فارس والهند، وذلك عندما بلغت أقصى اتساعها على عهد الإمبراطور تراجان (98-117). وقد امتدت الإمبراطورية الرومانية عندئذ من المحيط الأطلسي غرباً حتى الفرات شرقاً، فشملت في الغرب البلاد المعروفة بأسماء بريطانيا وغاليا وآيبريا وإيطاليا واليزيا، فضلاً عن شمال أفريقيا من المحيط الأطلسي حتى طرابلس، في حين شمل الجزء الشرقي من الإمبراطورية البلقان وآسيا الصغرى، وأعالي بلاد النهرين فضلاً عن الشام ومصر وبرقة. هذا مع ملاحظة أن نفوذ روما امتد بعيداً إلى ما وراء حدودها السياسية، حتى بلغ فارس والهند، وتطرق إلى النوبة والسودان، ونفذ إلى جوف الصحراء الكبرى عبر جبال أطلس، كما بلغ الشعوب الجرمانية الضاربة في مجاهل أوروبا شرقي الراين وشمال الدانوب. هكذا يمضي الباحث في دراسته لتاريخ أوروبا في العصور الوسطى، كاشفاً عن الجوانب السياسية والثقافية والدينية والاجتماعية التي كان لها تأثيرها على كل فئة حكمت أوروبا في فتراتها التاريخية المتعاقبة. فكان له أن سلط الضوء على: الإمبراطورية الرومانية، الإمبراطورية المسيحية، البرابرة، الإسلام، إيطاليا، الديرية، شارلمان وإمبراطورية الفرنجة، الفيكنج، أسرة كابيه في فرنسا، ألمانية والإمبراطورية الرومانية المقدسة، إيطالية والبابوية، الإمبراطورية والبابوية.",
  "genres": [
    "History"
  ],
  "author": "سعيد عبد الفتاح عاشور",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/8380099"
}