{
  "title": "There and Back Again: An Actor's Tale",
  "description": "The fascinating memoir of a Hollywood life and an inside look at a life-changing role and the groundbreaking Lord of the Rings films that captured the imagination of movie fans everywhere.The Lord of the Rings is one of the most successful film franchises in cinematic history. Winner of a record eleven Academy Awards--a clean sweep--and breaking box office records worldwide, the trilogy is a breathtaking cinematic achievement and beloved by fans everywhere.For Sean Astin, a Hollywood child (his mother is Patty Duke and stepfather is John Astin) who made his feature film debut at 13 in the 1980s classic The Goonies and played the title role in Rudy, the call from his agent about the role of Samwise Gamgee couldn't have come at a better time. His career was at a low point and choice roles were hard to come by. But his 18-month experience in New Zealand with director Peter Jackson and the cast and crew od The Lord of the Rings films would be more than simply a dream-come-true--it would prove to be the challenge of a lifetime.There and Back An Actor's Tale is the complete memoir of Sean Astin, from his early days in Hollywood to the role that changed his life. Though much has been written about the making of the films, including the techniques and artistry employed to bring Tolkien's vision of life and the various relationships between castmembers, the real story of what took place on the set, the harrowing ordeals of the actors and the unspoken controversy and backstage dealings have never been told.Sean's experience and candid account of his time filming in New Zealand is unparalleled. More than a companion guide to the Ring films, There and Back Again filled with stories from the set and of the actors involved that have never been revealed before and is an eye-opening look from a Hollywood veteran at the blood, sweat and tears that went into the making of one of the most ambitious films of all time.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "Film",
    "Audiobook"
  ],
  "author": "Sean Astin",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/837899.There_and_Back_Again"
}