{
  "title": "My Year of Meat",
  "description": "At first glance, a novel that promises to expose the unethical practices of the American meat industry may not be at the top of your reading list, but Ruth Ozeki's debut, My Year of Meatsis well worth a second look. Like the author, the novel's protagonist, Jane Takagi-Little, is a Japanese-American documentary filmmaker; like Ozeki, who was once commissioned by a beef lobbying group to make television shows for the Japanese market, Jane is invited to work on a Japanese television show meant to encourage beef consumption via the not-so-subliminal suggestion that prime rib equals a perfect family:  TO: AMERICAN RESEARCH STAFF FROM: Tokyo Office DATE: January 5, 1991 RE: My American Wife!... Here is list of IMPORTANT THINGS for My American Wife!. DESIRABLE THINGS: 1. Attractiveness, wholesomeness, warm personality 2. Delicious meat recipe (NOTE: Pork and other meats is second class meats, so please remember this easy motto: \"Pork is Possible, but Beef is Best!\") 3. Attractive, docile husband 4. Attractive, obedient children 5. Attractive, wholesome lifestyle 6. Attractive, clean house... UNDESIRABLE THINGS: 1. Physical imperfections 2. Obesity 3. Squalor 4. Second class peoples  The series, My American Wife!, initially seems like a dream come true for Jane as she criss-crosses the United States filming a different American family each week for her Japanese audience. Naturally, the emphasis is on meat, and Ozeki has fun with bizarre recipes such as rump roast in coke and beef fudge; but as Jane becomes more familiar with her subject, she becomes increasingly aware of the beef industry's widespread practice of using synthetic oestrogens on their cattle and determines to sabotage the programme.  Cut to Tokyo where Akiko Ueno struggles through the dull misery of life with her brutish husband, who happens to be in charge of the show's advertising. After seeing one of Jane's subversive episodes about a vegetarian lesbian couple, Akiko gets in touch and the two women plot to expose the meat industry's hazardous practices. Romance, humour, intrigue, and even a message--My Year of Meats has it all. This is a book that even a vegetarian would love.",
  "genres": [
    "Fiction",
    "Japan",
    "Food",
    "Contemporary",
    "Book Club",
    "Novels",
    "Literary Fiction"
  ],
  "author": "Ruth Ozeki",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/837761.My_Year_of_Meat"
}