{
  "title": "Hunters of the Dark Omnibus 1",
  "description": "Fans of \"City of Bones\" will love \"Hunters of the Dark!\" On sale for a limited time!This omnibus edition of the \"Hunters of the Dark\" paranormal fantasy series collects the first three full-length books in the series (\"Her Dark Destiny,\" \"Night Cries,\" and \"Face the Dark\") as well as the prequel novel \"The Tomb.\" Also included in this edition is a never-before-seen bonus chapter and an author interview.Synopsis of the first book (Her Dark Destiny): Teenager Shanna Hunt has been hunting demons since her parents were murdered by them. She’s used to doing things alone, her own way, but one fateful night throws her into the company of a team of hunters, each specializing in a particular kind of vampires, werewolves, witches, shape-shifters… This newly-formed team should be an unstoppable force for whatever is out there picking off individual hunters across the globe, but their first battle together against the monsters of the night could be their last.Synopsis of the second book (Night Cries): An unexpected attack on Shanna Hunt and her new friends prompts the team of monster hunters to venture to Greece, where they encounter an abandoned city, ancient ruins, and a haunting mystery. Something has caused a mass evacuation of the city, something sinister that will stop at nothing to get what it wants. And if the powerful force lurking in the wings isn't enough to tear the team apart, perhaps the secrets they are keeping from each other are.Synopsis of the third book (Face the Dark): One will betray her.Still reeling from the events of Greece, the hunters find themselves targeted by demons and werewolves. As they try to figure out who has marked them for assassination and why, Shanna learns more about who the mysterious figure Diana was, and about the people she is hunting alongside. After the dust settles, they will never be the same again.Synopsis for The 18-year-old Rachel Thyme has been handed the opportunity of a lifetime when she joins an archaeological dig off the coast of Australia. Eager to have some experience under her belt, she doesn’t question the rumors the locals tell of the previous archaeology crews and the haunting disappearances. She ignores the first signs that something is wrong when her crewmates begin to do strange things, that propel them deeper into the bowels of Black Forest Island. But she can hardly write off discovery after discovery that lead her to confront a long-hidden tomb that makes her question what she thinks she knows about the supernatural.Rachel wants nothing more than to prove herself on this excursion, especially as it was her daddy’s money that helped her land this job, and as she makes friends, and even sees a little romance, she discovers horrors she can hardly imagine, from evil slowly awakening around her, to the hidden demons locked in her past.",
  "genres": [],
  "author": "Dave Ferraro",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/13124610-hunters-of-the-dark-omnibus-1"
}