{
  "title": "Icarus",
  "description": "Don t get me wrong; immortality does have its perks. Take dieting for example kind of hard to do when you ve only got two choices: fresh blood and slightly less fresh blood. The media makes it all out to be glamorous. Romantic, even. But the books, movies and witty television shows have it wrong. Especially the ones that make a big to-do about not being wrong (you know, the ones that spell vampire Vampyr, like it s original). And don't think for a second that I was turned in some amazing, soul-binding, body-meshing way either. I don't think my libido is damaged enough to forget that kind of rendezvous. Though, to be honest, I don't recall anything about it. As soon as you are turned, as soon as anyone is turned, the powers that be rush in like witness protection agents and whisk you off, never to see your family or friends again. Your life changes in ways you never imagined that it could.Like the fact that I was kidnapped last night. Totally didn't see that coming. Not being the Covenant-level assassin that I am (did I mention that already? I didn't get much of a choice in that either, the profession I mean). Oh, and get this the creeps who grabbed me claim that my mentor/should-have-kept-it-professional boyfriend, Trinity is the vampire equivalent to the anti-Christ.Nice. And to think it's only Tuesday.But wait, it gets better. See, there is one fact about vampirism that everyone gets correct our bodies can't biologically process natural light. Past that, all I know is that if I don't partake of my usual dose of Icarus every seven days (provided via injection by the powers that be), I'll lose my existence as I know it. It allows me to bask in the sunlight, keeps us from exploding into flames and I've heard rumors that it's what makes us immortal. You know, little things.Now, since Head Creep removed the dosing disc from my arm, whether I had anything to do with it or not, I'm guilty of betraying High Coven. This fact not only sucks (pun intended), it means I've been condemned to death. An assassin condemned to death. Seems like kind of a shitty deal if you ask me.I don't care that Head Creep is hot enough that he gives Christian Bale a run for his money. He claims that Icarus is part of some massive conspiracy, that vampires are a perverse mutation of beings from another universe, and that Trinity (along with some dark army he's supposedly in charge of) plans to exterminate the human race. Of course, he says this will occur in less than a week. And damn, wouldn't you know he'd kidnap me on day six of my dose",
  "genres": [
    "Paranormal",
    "Vampires",
    "Urban Fantasy",
    "Romance",
    "Fantasy",
    "Paranormal Romance",
    "Young Adult"
  ],
  "author": "J.S. Chancellor",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13124547-icarus"
}