{
  "title": "Voices of the Rocks: A Scientist Looks at Catastrophes and Ancient Civilizations",
  "description": "Could the Egyptian Sphinx have been built many centuries earlier than conventional history would have us believe? Could the great natural disasters that propelled the evolution of life on Earth have played a dominant role as well in the rise and fall of civilizations? Could Earth have been home to civilizations far greater in number -- and far older -- than orthodox researchers have suspected? In Voices of the Rocks, Dr. Robert M. Schoch examines these and other crucial questions about our past and shows how the answers can guide us in the future.In 1990, Robert Schoch, a scientist and tenured university professor, traveled to Egypt and conducted geological testing to evaluate the accepted date for the construction of the Great Sphinx of Giza. His research revealed that the Sphinx is actually thousands of years older than previously supposed, a discovery that upended the standard history of ancient Egypt.      Following the intellectual trail uncovered by his redating of the Sphinx, Schoch became convinced that we are in the midst of a profound scientific paradigm shift. The predominant notion that our species inhabits a slow-changing, steady-state planet is falling by the wayside. Instead, we are coming to see that the history of Earth, all living beings, and human civilizations comprises a series of stops and starts, in which equilibrium abruptly ends during a sudden severe catastrophe, like the extraterrestrial impact that initiated the extinction of the dinosaurs. Meteors, asteroids, and comets are potential sources of such disasters, as are shifts in Earth's axis, movements of the continents, volcanic eruptions, and earthquakes.      According to Dr. Schoch, Earth's long, catastrophic history has obscured and obliterated evidence of lost civilizations. But the traces remain for those who know where to look and what to look for. At its core, Voices of the Rocks is the story of Schoch's own search, his fascinating discoveries, and the warnings we must heed if we wish to survive whatever catastrophes the future has in store for us.",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "Ancient History"
  ],
  "author": "Robert M. Schoch",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/838378.Voices_of_the_Rocks"
}