{
  "title": "Neverest",
  "description": "One year ago, Sean Miller—journalist and mountain climbing enthusiast—reached the summit of Mount Everest and was never seen again. Unable to move on without knowing the truth of what happened, his widow Carrie insists on an expedition to search for Sean’s body so it can be properly laid to rest. Tom, Sean's best friend and former climbing partner, agrees to serve as expedition guide and promises to keep Carrie safe on the mountain, despite their complicated relationship history.Guided by a travel journal left behind by her husband, Carrie ventures into the frozen, open-air graveyard of the world's tallest peak. But as Sean’s diary and Carrie’s experiences reveal, climbing the mountain is more than a test of endurance; it’s a battle of wills with an ancient and hostile force protecting the mountain—and the dead do not rest easy at the summit.NEVEREST is a survival thriller with a hint of the supernatural that will appeal to fans of Ally Wilkes’ All the White Spaces and Amy McCulloch’s Breathless.Praise for \"An intense psychological study of obsession, jealousy, and hubris, set on the body-strewn slopes of Everest - with a deft hand on the mountain's unearthly and supernatural elements - T.L. Bodine's novel gripped me throughout. Perfect for fans of Amy McCulloch's Breathless, or Sarah Lotz's The White Road.\"-- Ally Wilkes, author of \nAll the White Spaces\n\"NEVEREST weaves a deft, intoxicating spell of grief, intrigue, adventure, and the ghosts of our pasts. Beautifully paced and haunting in all the best ways, by the end of the journey I felt almost as breathless as a doomed climber. Bodine spins a talented and imminently enjoyable tale—settle in for winter horror at its best.\"-- Laurel Hightower, author of Crossroads and Below\"With an uncanny ability to bring the most brutal emotions out of her characters, Bodine’s writing will suck you in as you claw to the top of the mountain with them, the low thrum of dread pulsing with every step.\"-- Donna Taylor, author of the San Nico Slayers series\"An emotional slow-burn facing the power of the elements. From the start, Neverest is harsh, thoughtful, and real to its core. I felt the cold of this book snapping at my bones.\"-- Hailey Piper, Bram Stoker Award-winning author of Queen of Teeth“T.L. Bodine’s Neverest is a beautifully written exploration of the ascent to Everest and what it means to retrace the steps of a lost life. The novel climbs to a truly expansive and stunning peak.” —Christi Nogle, Bram Stoker Award® nominated author of Beulah",
  "genres": [
    "Horror",
    "Fiction",
    "Thriller",
    "Survival",
    "Mystery",
    "Adventure"
  ],
  "author": "T.L. Bodine",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/83825280-neverest"
}