{
  "title": "The Book of Disquiet",
  "description": "Această carte aproape mitică, probabil opera cea mai seducătoare a lui Fernando Pessoa, e un monolog de o tristețe indicibilă, care surprinde cu o minuție halucinantă interiorul cu mii de fațete al unuia dintre numeroși săi heteronimi, Bernardo Soares.„Cine este Fernando Pessoa?\" se întreba Octavio Paz, adeverind încă o dată că opera unuia dintre cei mai importanţi, prolifici şi proteiformi autori ai secolului XX, „investigatorul solemn al lucrurilor futile\", declină personalităţile virtuale coexistând în sine şi revelate graţie scriiturii ce atribuie fiecăreia o realitate fictivă. Scrisă între 1913 şi 1935 sub formă de panseuri, maxime, aforisme, Cartea neliniştirii, pseudojurnalul pessoan, este o cronică a deziluziei şi a deriziunii izvorâte din convingerea că viaţa e lipsită de noimă, iar arta nu-i conferă nici un sens. Ferit de privirile contemporanilor, cultivându-şi sistematic forţa imaginaţiei, Pessoa îşi construieşte un dublu - Bernando Soares - pe care-l aşază într-un univers personal ireal şi cu toate astea mai adevărat, pentru el, decât lumea reală. Soares, un umil funcţionar în costume cenuşii, alege să-şi petreacă viaţa într-o izolare aproape monahală, mai degrabă visând-o decât trăind-o, privind-o fără pretenţia de a o descifra şi proiectând asupra ei propriile emoţii pe care le încearcă închis între pereţii camerei unde îşi aşterne pe hârtie disperarea. Soares scrie cu luciditate, îndârjire şi furie, împingând introspecţia până la limita incomunicabilului. Dar dincolo de zidurile care-l împrejmuiesc se zăreşte urbea. Peisajul citadin este atât de prezent în toată cartea, încât fragmentele de însemnări încheagă un roman al oraşului cu care, de fapt, Pessoa are o legătură profundă, în genul aceleia pe care Baudelaire o are cu Parisul, Joyce, cu Dublinul şi Kafka, cu Praga. Şi poate tocmai aceste privelişti din fascinanta Lisabonă, cu străduţele ei întortocheate pulsând de viaţă, poartă cu ele speranţa unei posibile evadări.",
  "genres": [
    "Fiction",
    "Classics",
    "Poetry",
    "Philosophy",
    "Portugal",
    "Literature",
    "Portuguese Literature"
  ],
  "author": "Fernando Pessoa",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/8388793-the-book-of-disquiet"
}