{
  "title": "Capitalist Punishment: How Wall Street Is Using Your Money to Create a Country You Didn't Vote For",
  "description": "A Wall Street cartel has quietly seized control of the American economy, and they are forcing governments and businesses to bow down to their political agenda—using your money to do it. Three Wall Street firms have quietly amassed more money than Jeff Bezos, Elon Musk, Andrew Carnegie, and John Rockefeller combined. But the money isn’t even theirs. These asset managers have accumulated all their power through “passive funds,” as most investors no longer believe anyone can reliably pick stocks. Yet the Big Three have decided that they can reliably pick the right social policies instead. As entrepreneur Vivek Ramaswamy reveals, the results are all bad—and working their way into every corner of the economy. They force US companies to adopt “racial equity audits” and “emissions caps” while supporting human rights atrocities in China. They coerce Western companies to produce less oil while shifting production to dirtier places like Russia. They allow companies like FTX to take victory laps on good management while collapsing like a house of cards. They charge high fees to mom-and-pop investors for so-called sustainable funds that are effectively identical to lower-fee index funds. Worst of all, they’re celebrated as heroes—at least so far. Capitalist Punishment lifts the veil on the largest fiduciary breaches, antitrust abuses, and First Amendment violations of the twenty-first century, misdeeds that are hiding in plain sight. This isn’t just a threat to capitalism. It’s a threat to democratic self-governance itself. Capitalist Punishment is an easy-to-follow educational tour de force for every participant in financial markets—which, to the surprise of most Americans, includes nearly every single one of them.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Economics",
    "Business",
    "Audiobook",
    "Finance",
    "American History"
  ],
  "author": "Vivek Ramaswamy",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/83814922-capitalist-punishment"
}