{
  "title": "Hannah and the Spindle Whorl",
  "description": "Fiction. Young Adult Novel. Native American Studies. When twelve-year-old Hannah uncovers an ancient Salish spindle whorl hidden in a cave near her home in Cowichan Bay, she is transported back to a village called Tl'ulpalus, in a time before Europeans had settled in the area. Through the agency of a trickster raven, Hannah befriends Yisella, a young Salish girl, and is welcomed into village life. Here she discovers that the spindle whorl is the prize possession of Yisella's mother, Skeepla, a famous spinner and weaver. When Skeepla falls victim to smallpox, Hannah finally begins to open up about the death of her own mother.When twelve-year-old Hannah uncovers an ancient Salish spindle whorl hidden in a cave near her home in Cowichan Bay, she is transported back to a village called Tl'ulpalus, in a time before Europeans had settled in the area. Through the agency of a trickster raven, Hannah befriends Yisella, a young Salish girl, and is welcomed into village life. Here she discovers that the spindle whorl is the prize possession of Yisella's mother, Skeepla, a famous spinner and weaver. When Skeepla falls victim to smallpox, Hannah finally begins to open up about the death of her own mother. Hannah and Yisella are then accidentally left behind when the villagers journey to the mainland, and they witness the arrival of Governor James Douglas and numerous settlers on the Hecate. As the settlers pillage the village for souvenirs, Hannah and Yisella rescue the spindle whorl and, pursued by the ship's crew, escape into the dark forest. From the refuge in the cave, Hannah returns to her own time with a greater understanding of herself and the history of the First Nations.\"A remarkably vibrant novel that links friendship and native history across time.\"-- Ann WalshHannah and the Spindle Whorl  is engrossing good fun and would be a treat for young (and young at heart) readers this Christmas.\"--  Vancouver Sun\"Carol Anne Shaw tells a thoroughly enjoyable tale. Her characters are rich and original, and they allow us to be swept along in an engaging, fantastical tale spanning 150 years. Young readers will love Hannah, and they just might learn something along the way.\"--  Cowichan Valley Voice\"Time travel is difficult to handle well. Here Carol Anne Shaw has fully succeeded. The choice of a local setting makes her tale all the more authentic so that the reader may appreciate that the magic of the journey is centered in that real world. It leaves a sense that magic can, and often does, lie in real places.\"--  Deakin Newsletter\"Hannah is a very fun, sympathetic and lively character, and her hometown and funky houseboat are memorable and convincing.\"--  CM Magazine\"Carol Anne Shaw has provided readers with an interesting look at Coast Salish culture. By using the spindle whorl as a central plot element, readers will learn about Canadian history, archaeological digs and the preservation of historical artifacts.\"--  Resource Links\"it so perfectly captured what it was like to be twelve\"--  What If? Magazine\"Hannah herself is a very likable character -- inquisitive and sensitive, intelligent and tough, and yet not overly perfect. She's still trying to cope with the loss of her mother from a car accident 2 years earlier, she lives on a houseboat, her dad's a writer, and yet she comes across as a realistic typical 12 year old. . . . much more depth than a typical juvenile novel.\"-- The Book Mine Set\"Definitely a book I'd recommend for girls...\"-- All Booked Up",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Fantasy",
    "Canada",
    "Young Adult",
    "Childrens"
  ],
  "author": "Carol Anne Shaw",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/8396177-hannah-and-the-spindle-whorl"
}