{
  "title": "Dark Awakenings",
  "description": "From its earliest origins, the human religious impulse has been fundamentally bound up with an experience of primordial horror. The German theologian Rudolf Otto located the origin of human religiosity in an ancient experience of 'daemonic dread.' American horror writer H.P. Lovecraft asserted that weird supernatural horror fiction arose from a fundamental human psychological pattern that is 'coeval with the religious feeling and closely related to many aspects of it.' The American psychologist William James wrote in his classic study The Varieties of Religious Experience that the 'real core of the religious problem' lies in an overwhelming experience of cosmic horror born out of abject despair at life's incontrovertible hideousness. In Dark Awakenings, author and scholar Matt Cardin explores this ancient intersection between religion and horror in seven stories and three academic papers that pose a series of disturbing questions: What if the spiritual awakening coveted by so many religious seekers is in fact the ultimate doom? What if the object of religious longing might prove to be the very heart of horror? Could salvation, liberation, enlightenment then be achieved only by identifying with that apotheosis of metaphysical loathing? In Dark Awakenings , author and scholar Matt Cardin explores the ancient intersection between religion and horror in seven stories and three academic papers that pose a series of disturbing questions: What if the spiritual awakening coveted by so many religious seekers is in fact the ultimate doom? What if the object of religious longing might prove to be the very heart of horror? Could salvation, liberation, enlightenment then be achieved only by identifying with that apotheosis of metaphysical loathing? This volume collects nearly all of Cardin's uncollected fiction, including his 2004 novella 'The God of Foulness.' It contains extensive revisions and expansions of his popular stories 'Teeth' and 'The Devil and One Lump' and features one previously unpublished story and two unpublished papers, the first exploring a possible spiritual use of George Romero's Living Dead films and the second offering a horrific reading of the biblical Book of Isaiah. At over 300 pages and nearly 120,000 words, it offers a substantial exploration of the religious implications of horror and the horrific implications of religion. REVIEWS: \"In Dark Awakenings , Cardin proves himself to be an adept in the fullest sense of the word. To both the morbid and the cosmically minded, who may be one and the same, he delivers his visions and nightmares in a master's prose. In the tradition of Poe and Lovecraft, Cardin's accomplishments as a writer are paralleled by his expertise as a literary critic and theorist, as readers can witness in this volume. His analyses of supernatural horror and its practitioners are also dark awakenings in the dual manner of his stories, with one eye on the black abyss and the other on an enlightened transcendence without denomination. Again, this quality of Cardin's work can be seen in the writings of Poe and Lovecraft, two other felicitous freaks who merged the antagonistisms of their imagination into a chimera as awful as it is awe-striking.\" -- Thomas Ligotti, author of Teatro Grottesco and The Nightmare Factory \"Matt Cardin channels visions of dark, maniacal intensity. His otherworldly divinations will have you lying awake in the dark, counting stars in that most pitiless gulf that yawns above us all. A master of terror and dread, he ranks among the foremost authors of contemporary American horror.\" -- Laird Barron, author of The Imago Sequence & Other Stories",
  "genres": [
    "Horror",
    "Fiction",
    "Short Stories",
    "Lovecraftian",
    "Fantasy",
    "Gothic",
    "Weird Fiction"
  ],
  "author": "Matt Cardin",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/8400562-dark-awakenings"
}