{
  "title": "Blood Divided",
  "description": "There exists an ancient elven proverb, dating before the time of man. Life and death, like day and night, meet at a point where they blend into one. It is that brief moment when anything is possible.There was a time when four sparks of life burned brighter than the sun itself. Megan was born with power, Lucien born with station. Autumn was born full of life, while Nathan was entwined with death.Peace has come and gone... The conflicts of old have returned-rejuvenated and driven. This is the beginning of the end. The children of Karn have come of age, and now they will take part in shaping the fate of Illyia.Will they join forces, or with blood will they be divided?About The Author - Kevin James BreauxKevin is an award-winning artist and author. He grew up in PA, but moved to OR in 2009. He spent years in art school dreaming of becoming a professional comic book artist so that he could see his creations come to life in pen & ink. It was not until his final year at Temple University that he realized writing could fulfill that dream.About The Artist - Dan Dos SantosDan's work spans a variety of genres, including novels, comics and film. He has worked for clients such as Disney, Universal Studios, Boeing Aircraft, Saatchi & Saatchi, Scholastic Books, The Greenwich Workshop, Penguin Books, Random House, Tor books, UpperDeck, Wizards of the Coast, and DC Comics.Dan has been the recipient of many awards. Recently, he has received a 2010 Silver Medal from Spectrum, the 2007 Jack Gaughan Award for Best Emerging Artist, and was the Chesley Award winner for Best Paperback Cover of 2007. His illustrations have graced the #1 spot on the New York Times Best Seller list numerous times. Aside from freelance illustration, Dan also co-hosts a series of instructional demonstrations called 'Art Out Loud'.",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Magic"
  ],
  "author": "Kevin James Breaux",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/13124813-blood-divided"
}