{
  "title": "Novels by Tom Robbins: Still Life With Woodpecker, Villa Incognito, Fierce Invalids Home From Hot Climates, Jitterbug Perfume",
  "description": "This is nonfiction commentary. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Chapters: Still Life With Woodpecker, Villa Incognito, Fierce Invalids Home From Hot Climates, Jitterbug Perfume, Even Cowgirls Get the Blues, Skinny Legs and All, Another Roadside Attraction, Half Asleep in Frog Pajamas. Source: Wikipedia. Free updates online. Not illustrated. Excerpt: Still Life With Woodpecker (1980) is the third novel by Tom Robbins, concerning the love affair between an environmentalist princess and an outlaw. As with most of Robbins' books, it encompasses a broad range of topics, from aliens and redheads to consumerism, the building of bombs, romance, royalty, the moon, and a pack of Camels. The novel continuously addresses the question of how to make love stay. The story is sometimes called a post-modern fairy tale. The book begins in \"the final quarter of the twentieth century,\" at a year never specified, presumably in the early 1980s. It revolves around a family of deposed European royalty living in a small house in the suburbs outside of Seattle, under the protection of the CIA. They consist of: the father, King Max, a former gambler and poker player whose prosthetic heart valve makes a loud scraping noise when he gets excited; the mother, Queen Tilli, an opera-lover with a strong foreign accent and a fondness for saying \"Oh, oh, spaghetti-o\"; Gulietta, the non-English-speaking maid (and, as it turns out, Max's half-sister) and the daughter, Leigh-Cheri, a redheaded vegetarian liberal princess and former cheerleader, having pulled out of classes after being asked to resign from the cheer squad after having a miscarriage while cheering at a football game. Leigh-Cheri proclaims herself celibate, withdraws from public life and cloisters herself in her room, only to emerge to ask her parents for permission to go to the Care Fest, a lib...More: http: //booksllc.net/?id=217300",
  "genres": [],
  "author": "Books LLC",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/8406551-novels-by-tom-robbins"
}