{
  "title": "من العالم الثالث إلى الأول : قصة سنغافورة ١٩٦٥ - ٢٠٠٠م",
  "description": "لم يتوقع سوى قلة قليلة من المراقبين أن تمتلك سنغافورة الصغيرة فرصة كبيرة بالبقاء، حين منحت استقلالها عام 1965م. فكيف - إذن- أصبحت المحطة التجارية النائية والمستعمرة السابقة، حاضرة عالمية مزدهرة لا تمتلك أنجح شركة طيران في العالم، وأفضل مطار جوي، وأنشط ميناء بحري فقط، بل تحتل المرتبة العالمية الرابعة في متوسط دخل الفرد الحقيقي؟ يصف لي كوان يو، وهو يغوص عميقًا في التفاصيل الدقيقة لملاحظاته ومذكراته وأوراقه، إضافة إلى الوثائق الحكومية والسجلات الرسمية، المساعي الدؤوبة والجهود المضنية التي كانت الدولة/ المدينة/ الجزيرة في جنوب شرق آسيا، تحتاج إليها للبقاء على قيد الحياة آنذاك.يقدم لي كوان يو شرحًا وافيًا للأساليب والطرائق التي اتبعها هو وزملاؤه في الحكم للقضاء على التهديد الشيوعي الذي أحدق بأمن الجزيرة الهش، والانطلاق بالعملية المنهكة المرهقة لبناء الدولة: شق طرقات البنية التحتية عبر أراضٍ تغطيها المستنقعات، إنشاء جيش من السكان المقسمين عرقيًّا وأيديولوجيًّا، القضاء على آفة الفساد المتبقية من الحقبة الكولونيالية، توفير المساكن الشعبية لجماهير المواطنين، تأسيس شركة طيران وطنية، بناء مطار حديث مزود بأفضل التجهيزات.في هذه الرواية الوصفية التوضيحية - التنويرية، يكتب لي كوان يو بكل صراحة عن مقاربته الحاذقة الفاعلة لمعارضيه السياسيين، وعن آرائه الراديكالية الخارجة عن المألوف فيما يتعلق بحقوق الإنسان، والديمقراطية، والذكاء الموروث، مستهدفًا (الالتزام دائمًا بجادّة الصواب في الحياة لا في السياسة). لا يوجد في سنغافورة شيء لم يلحظه بصره الثاقب أو ترقبه عيناه المتيقظتان: بدءًا من اختيار النباتات والشتلات لتحويل سنغافورة إلى واحة خضراء غناء، مرورًا بتجديد فندق رافلز الرومانسي، وانتهاءً بحثّ الشباب - بشكل سافر وصريح وجريء - على الزواج من فتيات على نفس مستواهم الثقافي. اليوم، تحمل سنغافورة النظيفة المرتَّبة بصمة لي كوان يو الواضحة، ولا يعتذر عن تأثيره النافذ في بلاده: (إذا كانت سنغافورة دولة – مربية فأنا فخور برعايتها وتنشئتها).مع أن حلبة لي كوان يو المحلية ضيقة المساحة، إلا أن ما تمتع به من نشاط وحيوية ضمن له ميدانًا رحبًا وموقعًا مؤثرًا على ساحة الشؤون الدولية. وبأسلوبه الفذ الفريد، بعث الحياة في التاريخ من خلال تحليلاته المقنعة لبعض أهم القضايا الإستراتيجية في عصرنا الحديث، وكشف كيف استطاع طوال السنين الإبحار بمهارة وسط موجات المد المتقلب التي اكتسحت العلاقات بين أمريكا، والصين، وتايوان، ليؤدي دور المستشار الموثوق حينًا، وأداة الاختبار لصوابية الأفكار والآراء حينًا آخر، والرسول المبلغ في كثير من الأحيان. وأضاف لوحات مرسومة صريحة، وحتى صارخة لمعاصريه من الساسة والقادة والزعماء، مثل المرأة الحديدية، مارجريت تاتشر، والرئيس الصلب الذي لا يقهر، رونالد ريجان، والزعيم الصيني الذي يقرض الشعر، جيانج زيمين، والرئيسين (الدوغمائيين) جورج بوش ودينغ شياو بينغ.ولد لي كوان يو في سنغافورة في 16/9/1923م، لأسرة تنتمي إلى الجيل الثالث من المهاجرين الصينيين القادمين من مقاطعة غوانغدونغ. درس الحقوق في جامعة كامبريدج بإنجلترا، وعام 1954م، أسس حزب العمل الشعبي، الذي فاز بأول انتخابات تجري في سنغافورة عام 1959م. ثم أصبح أول رئيس لوزراء سنغافورة، وهو في الخامسة والثلاثين. في تشرين الثاني/ نوفمبر1990م استقال من منصبه ليبقى وزيرًا في الحكومة السنغافورية.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Biography",
    "Economics",
    "Asia",
    "Autobiography"
  ],
  "author": "Lee Kuan Yew",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/13125200"
}