{
  "title": "Harry Potter und der Orden des Phönix",
  "description": "This is an alternate cover edition for ISBN 9783551555557Das fünfte Schuljahr in Hogwarts: Harry ist mittlerweile ein 15-jähriger Jugendlicher, der durchaus auch mal unter Zornausbrüchen und Launen leidet und rebellisches Verhalten an den Tag legt. Den Sommer verbringt er mit den unsagbar langweiligen und nervtötenden Dursleys -- die Rückkehr nach Hogwarts sollte demgegenüber eine echte Erleichterung sein. So denkt er. Viel ist im Vorfeld des Erscheinens der englischen Ausgabe gerätselt worden: der Pubertierende lernt die Liebe kennen, eine wichtige Person muss sterben -- stimmt, aber mehr wird nicht verraten! Nur so viel: die Zentauren aus dem Verbotenen Wald kommen erneut hervor, Lord Voldemort dringt gar in Harrys Träume ein, Harrys Blitznarbe auf der Stirn schmerzt immer stärker. Die neue Lehrerin Dolores Umbridge macht ihm das Leben auch nicht leichter: Bezweifelt sie und mit ihr das Zauber-Ministerium doch weiterhin die Gefahr, die von Lord Voldemort ausgeht. Und: Was früher ganz klar schwarz oder weiß war, gut oder böse, entpuppt sich als undurchsichtig und vielschichtig, welches ist der rechte Weg? Harry wandelt sich vom staunenden Wunderkind zum nachdenklichen Jugendlichen auf der Schwelle zum Erwachsenwerden: voller Fragen, Unsicherheit, Aufbegehren. Joanne K. Rowling hat es geschafft, wieder viele Details und Figuren aus den früheren Bänden geschickt in die Story einzuflechten: So erfährt Harry Unerwartetes über die Vergangenheit seiner Eltern. Alte und neue Freunde werden stärker in den Kampf gegen Voldemort und seine brutalen Anhänger hineingezogen, als ihnen lieb ist. Sehr gelungen, hochspannend und actionlastig! --Kathrin Rüstig",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Magic",
    "Audiobook",
    "Childrens",
    "Adventure"
  ],
  "author": "J.K. Rowling",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/840582.Harry_Potter_und_der_Orden_des_Ph_nix"
}