{
  "title": "Gay Gene Rising",
  "description": "Awaken Child of Goedric, for the Second Dawn of Man’s Hope is Rising... Gay Gene Rising is Book I of The Disciples of Goedric TrilogyThe story begins in the not so distant future when Etan, a fragile young man plagued by horrific visions, is released from the hospital in Ann Arbor, Michigan and thrown into the middle of a war that has been raging against homosexuals twenty-seven centuries. An epic journey unfolds, as young Etan flees to Chicago and then to the remote jungles of Mexico in a desperate attempt to stop the genocide of every single gay man and lesbian woman on earth…Gay Gene Weeks after the discovery of the gay gene is announced by researchers at the IHI Medical Center in Ann Arbor, Michigan, IFC Pharmaceuticals announces “AEG/IS”—the gay cure. While the world is busy debating the drug’s merits, a suspicious fever kills hundreds of thousands of gay men in the matter of hours, presenting millions upon millions of people with an impossible choice—take the gay cure or die.“Spellbinding and terrifyingly possible!”—GayNovelists.comGuardians of the Young Etan, AKA Patient G , flees his Chicago apartment in the middle of the night, narrowly escaping IFC henchmen who will stop at nothing to get him back under their control. His only hope lays with a rag-tag group of friends, led by the redoubtable Sues, two tough, old-guard lesbians who never thought they’d live long enough to witness the horrors of a second gay plague.Sue DeGault and Sue Keller pray for strength as they prepare to battle fate, and the IFC, a corporate goliath controlled by a powerful family with roots dating back to the days of King Yoshiyahu of Judea—a family that has been raging a religious war against homosexuals for 2,700 years.“Sometimes history is fiction, and sometimes fiction makes history.”—GayNovelists.comSoulfire and Far away in the remote mountains of Mexico, a great grey-wolf raises its muzzle and curls back his lips to taste the air. The scent of blood stings his palette, and he howls into ancient winds as they paint the mists with death. The winds were born on the battlefield, in a time long past. They saw the Great Purge of King Yoshiyahu. They witnessed the atrocities that were committed in the name of Yahweh , and they moaned in anguish as the blood of the Disciples of Goedric muddied the ground.The Sons and Daughters of Goedric had fallen, and their once noble creed was trapped in time, drifting like a ripple across an endless sea—with no hope of shore.“Prophecy that ignites the imagination.”—GayNovelists.comThis book is also available on Amazon along with the other two books of the trilogy in a larger fomat single volume set The Disciples of Goedric, A Trilogy",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Science Fiction",
    "Gay",
    "LGBT",
    "M M Science Fiction",
    "Romance"
  ],
  "author": "Jeffrey Jude",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13125604-gay-gene-rising"
}