{
  "title": "Fighting the Truth",
  "description": "Nathan and Isaac have been best friends since elementary school. When Isaac breaks down the friendship barrier and advances their relationship after senior prom, they begin their lives together. As the years go on, they discover more about each other, and what makes their relationship work. And while Nathan yearns to walk down the street with Isaac’s hand in his, Isaac refuses to publicize their relationship to anyone more than their two best friends, Jake and Sydney. Nathan is okay with this. Having been in a relationship with Sydney prior to being with Isaac, he confides in her and cherishes her loyalty. When she confesses to having feelings for Nathan and Isaac’s good friend, Jake, he finds out how loyal she truly is. As their relationship grows, Jake and Nathan’s friendship slowly dwindles.Isaac, on the other hand, has trouble accepting Nathan and Sydney’s relationship. He doesn’t outwardly believe they are platonic, yet inwardly, he knows better. From the beginning, the reader knows that Nathan is leaving Isaac that very night. However, because of the story structure, the reason he is doing so is not revealed until much later. The first five chapters are told in flashback sequence—that is, chapter one goes back six years, chapter two goes back five years, and so on, until the reader reaches the chapter where they discover what has happened. From then on out, the story takes place in the present (though still told in the past), with occasional flashbacks here and there to keep up the theme. Once Isaac finds out where Nathan has gone—and he thinks he knows why—he drops everything to chase after him. On the way he scrutinizes he and Nathan’s relationship, and that causes him to second-guess himself and his intentions. Jake and Sydney do their best to convince him otherwise, and he once again embarks on the journey. This journey is not only physically, but also emotionally. He reevaluates his life and begins to accept himself. In the meantime, Nathan is taking a different journey and battling his own demons. His decision to leave Isaac is detrimental to his health, and he too contemplates himself and his intentions. He realizes the severity of his actions, and regrets that he can’t take them back. With forced optimism, he convinces himself that life will get better. He doesn’t think he’ll ever see Isaac again. Trying desperately to put the past behind him and move on, he realizes it won’t be that easy. He isn’t ready to let it go.",
  "genres": [
    "M M Romance",
    "Gay",
    "M M Contemporary",
    "Contemporary"
  ],
  "author": "Tara Leigh",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/8404464-fighting-the-truth"
}