{
  "title": "Midnight Pleasures",
  "description": "Handsome and sensual, surrounded by an aura of danger, mystery, and the forbidden, a lover steps from the shadows. But is he mortal? Or is he an ancient god, a sorcerer, or a mythical beast who can possess a woman's heart...and her very soul?Four of romance's most popular authors have created this spellbinding collection of stores filled with dark passion and desire. Under the cover of darkness, their heroes inhabit worlds haunted by ageless hungers and deadly forces stronger than any seen by day...and vanquished only by the power of love.Now travel into realms where dazzling wonders roam the night, where magic replaces reason, and where a kiss unleashes a raging fire in the blood. And here, if you dare, discover the seduction that begins at the bewitching hour when a man and woman partake in...Midnight Pleasures.Darkfest by Amanda AshleyThe price of saving her dying mother is Channa's promise to spend a year at the castle of tormented nobleman, Lord Darkfest...to obey him as his servant or, as his secrets are revealed, to become his salvation. And her own.Phantom Lover by Sherrilyn KenyonHaunted by recurring nightmares of terrifying beasts, Erin McDaniels is afraid to sleep-until a hero arrives in her dreams to save her...and makes erotic, incredible love to her. But can she find him again when she is awake?NOTE: This story has been re-released in the Dark Bites anthologyUnder Her Spell by Maggie ShayneA consultant for a TV series about one gorgeous witch, \"white witch\" Melissa St. Cloud plans to make the show authentic. But once on the set she is pulled into the arms of a man who opens up a doorway to the darkside and chilling peril.A Wulf's Curse by Ronda ThompsonRunning away from an arranged marriage, Elise steals aboard a wagon in a traveling circus and finds herself in the bed of the Beast Master, Sterling Wulf, who is something other than he seems...and suddenly all Elise desires.",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Anthologies",
    "Fantasy",
    "Vampires",
    "Urban Fantasy"
  ],
  "author": "Amanda Ashley",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/84158.Midnight_Pleasures"
}