{
  "title": "Get It Together: Troubling Tales from the Liberal Fringe",
  "description": "AN INSTANT #1 NEW YORK TIMES BESTSELLERCan the political be way too personal? What if most radical activists are trying to change their lives by changing the whole country?When Jesse Watters set out to interview a few dozen radical activists to find out where their wild ideas came from, he discovered two things that shocked First, he liked these people.Second, their political positions were not primarily from books, teachers, or other activists. They originated in personal drama. Most of these people didn’t need legislation. They needed a therapist.In Get It Together, the number one New York Times bestselling author and Fox News primetime host takes on Wokeism in a way no one else has. Through a series of (sometimes very) personal interviews with some of the most radical activists in the country, Watters discovers that these activists may be overlooking the most important change they need to make—within themselves.From activists working for climate change salvation, Black supremacy, and social justice to a professional cuddler and a transwoman who identifies as a wolf, Watters shows how many well-intentioned Americans have bought into causes invented and run by people who are illogical, emotional, and ill-informed.Through their stories, Watters uncovers common threads—childhood traumas, broken relationships, and a lack of introspection. What if the people obsessed with the end of the world are just hurting from how this one has treated them? What if that, rather than ideological disagreements, is the deeper root of our country’s political divide?Funny, fresh, and fascinating, Get It Together is sure to spark important conversations, and to inspire us to see one another not as political opponents, but as real and broken human beings.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Audiobook"
  ],
  "author": "Jesse Watters",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/84096858-get-it-together"
}