{
  "title": "Swallow: Foreign Bodies, Their Ingestion, Inspiration, and the Curious Doctor Who Extracted Them",
  "description": "Product DescriptionAn American half-dollar. A beaded crucifix. Tooth roots shaped like a tiny pair of pants. A padlock. Scads of peanut kernels and scores of safety pins. A metallic letter Z. A toy goat and tin steering wheel. A Perfect Attendance Pin.One of the most popular attractions in Philadelphia's world-famous Mütter Museum is the Chevalier Jackson Foreign Body Collection: a beguiling set of drawers filled with thousands of items that had been swallowed or inhaled, then extracted nonsurgically by a pioneering laryngologist using rigid instruments of his own design. How do people's mouths, lungs, and stomachs end up filled with inedible things, and what do they become once arranged in Jackson's aura-laden cabinet? What drove Dr. Chevalier Jackson's peculiar obsession not only with removing foreign bodies from people’s upper torsos but also with saving and cataloging the items that he retrieved?Animating the space between interest and terror, curiosity and dread, award-winning author Mary Cappello explores what seems beyond understanding: the physiology of the human swallow, and the poignant and baffling psychology that compels people to ingest non-nutritive things. On a quest to restore the narratives that haunt Jackson’s uncanny collection, she discovers that all things are secretly edible. Combining original research with a sympathetic and evocative sensibility, Cappello uncovers a history of racism and violence, of forced ingestion and \"hysteria,\" of class and poverty that left children to bank their family’s last quarters in their mouths. Here, the seemingly disparate but equally marvelous worlds of the circus and the medical amphitheater meet in characters ranging from sword swallowers and women who lunched on hardware to the sensitive, bullied boy who grew up to be the father of endoscopy.Advance Praise\"Swallow is a surprising and original work. It is biography on the slant, a meditation that transcends boundaries and genres, written with scholarship, humor, and panache. I urge you to take this journey.\" —Ricky Jay\"I was astonished and delighted—grabbed by the throat, indeed—by this most remarkable book, which took me down a thousand little red lanes, and laid out in excruciating and fascinating detail all those myriad of items—corks to safety pins to draughts of lye and three-foot swords—that have managed to pass down there too. It is a wonderful and bizarre book: gorge yourself on it, and gulp.” —Simon Winchester, author of Atlantic: The Biography of an Ocean\"Swallow is a wonderful, intriguing book, a fascinating glimpse into a true medical pioneer and a life's work. Mary Cappello delves into what it means to ingest things we weren’t meant to eat, and how the line between our bodies and foreign bodies can sometimes blur. Every object tells a story, and the stories here are marvelous.\" —Colin Dickey, author of Crankiolepty: Grave Robbing and the Search for GeniusAbout the AuthorMary Cappello's three previous books of literary nonfiction are Awkward, a Los Angeles Times bestseller; Called Back, a critical memoir on cancer that won a ForeWord Book of the Year Award and an Independent Publisher Book Award; and the memoir Night Bloom. A recipient of the Bechtel Prize for Educating the Imagination from Teachers and Writers Collaborative and the Dorothea Lange–Paul Taylor Prize from Duke University’s Center for Documentary Studies, she is a former Fulbright lecturer at the Gorky Literary Institute (Moscow) and currently a professor of English and creative writing at the University of Rhode Island. She lives in Providence.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Medical",
    "Medicine",
    "Biography",
    "Biology"
  ],
  "author": "Mary Cappello",
  "average_rating": "2.97",
  "url": "https://www.goodreads.com/book/show/8421204-swallow"
}