{
  "title": "Rats: Observations on the History and Habitat of the City's Most Unwanted Inhabitants",
  "description": "Thoreau went to Walden Pond to live simply in the wild and contemplate his own place in the world by observing nature. Robert Sullivan went to a disused, garbage-filled little alley in lower Manhattan to contemplate the city and its lesser-known inhabitants-by observing the rat.Rats live in the world precisely where humans do; they survive on the effluvia of human society; they eat our garbage. While dispensing gruesomely fascinating rat facts and strangely entertaining rat-stories-everyone has one, it turns out-Sullivan gets to know not just the beast but its friends and the exterminators, the sanitation workers, the agitators and activists who have played their part in the centuries-old war between human city dweller and wild city rat. With a notebook and night-vision gear, he sits nightly in the streamlike flow of garbage and searches for fabled rat-kings, sets out to trap a rat, and eventually travels to the Midwest to learn about rats in Chicago, Milwaukee, and other cities of America. With tales of rat fights in the Gangs of New York era and stories of Harlem rent strike leaders who used rats to win tenants basic rights, Sullivan looks deeper and deeper into the largely unrecorded history of the city and its masses-its herd-of-rats-like mob. Funny, wise, sometimes disgusting but always compulsively readable, Rats earns its unlikely place alongside the great classics of nature writing.Did you know?- 26% of all electric cable breaks and 18% of all phone cable disruptions are caused by rats, 25% of all fires of unknown origin are rat-caused, and rats destroy an estimated 1/3 of the world's food supply each year. The rat has been called the world's most destructive mammal-other than man.- Male and female rats may have sex twenty times a day. A female can produce up to twelve litters of twenty rats a one pair of rats has the potential for 15,000 descendants in a year.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Animals",
    "Nature",
    "New York",
    "Microhistory"
  ],
  "author": "Robert Sullivan",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/841939.Rats"
}