{
  "title": "Now That You're Rich . . . Let's Fall In Love",
  "description": "Now That You’re Rich…., is a story about four over achieving nerds who land themselves in job that pays at a higher rate that they could think about spending. But life isn’t all rosy as Abhi and Shruti grapple with ridiculously workaholic yet charming bosses in crisp suits hired right out of hell. Saurav doesn’t find the going easy either, as he struggles to make this way into the skirts of the incredible hot female colleagues. Garima on the other hand, aloof and distant, doesn’t give a shit. Things are fine as they get along but…… As they fall in love, sleep around with all the wrong people and recession threatens to take the company down, their bonds strain…till one day, the very reason that got them together tears them apart. MONEY Hideous human resource managers picking on them, horny seniors looking down their cleavages, piles of workload, crazy shopping sprees, crates of beer and endless cups of coffee………Out from college and into the real world…how does it change them? Love makes the world go round. But money buys the tickets. Money? Love? In this age old battle what wins this time? Based on real life stories and…..coffee break gossip Now That You’re Rich…., is a story about four over achieving nerds who land themselves in job that pays at a higher rate that they could think about spending. But life isn’t all rosy as Abhi and Shruti grapple with ridiculously workaholic yet charming bosses in crisp suits hired right out of hell. Saurav doesn’t find the going easy either, as he struggles to make this way into the skirts of the incredible hot female colleagues. Garima on the other hand, aloof and distant, doesn’t give a shit. Things are fine as they get along but…… As they fall in love, sleep around with all the wrong people and recession threatens to take the company down, their bonds strain…till one day, the very reason that got them together tears them apart. MONEY Hideous human resource managers picking on them, horny seniors looking down their cleavages, piles of workload, crazy shopping sprees, crates of beer and endless cups of coffee………Out from college and into the real world…how does it change them? Love makes the world go round. But money buys the tickets. Money? Love? In this age old battle what wins this time? Based on real life stories and…..coffee break gossip",
  "genres": [
    "Romance",
    "Indian Literature",
    "Fiction",
    "Romantic",
    "Love",
    "Novels",
    "Contemporary"
  ],
  "author": "Durjoy Datta",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/8417071-now-that-you-re-rich-let-s-fall-in-love"
}