{
  "title": "The Brawl King: New Beginnings - We are not alone",
  "description": "It’s the year 21 A.T. Time to face the truth. We are not alone.Enjoy a fast-paced rescue mission led by Gen. Brad McCormick, who uncovers and retrieves so much more than their abducted children from the gold mines in South Africa. EP-III hides millennia-old secrets that no one could have foreseen or predicted. DNA manipulation, rocketry, and moon landings are seemingly everyday occurrences, except no one informed Phoenix about it all. Why? Mika and Connor struggle to come to terms with their twins’ infatuation with their abductor, who has some kind of spell on them. Maybe this is a case of Stockholm Syndrome, but one thing is for sure, he’s double-dipping; Eryn wants both of them. He will go to lengths to make them happy and please them simultaneously. Sharing comes naturally to Ivan and Cian, so why not? It’s just like sharing an ice cream.CIAN“Hey, you piece of frog shit, let us out!” Being a say-it-like-it-is kind of guy made him the world's worst cellmate. He is blatantly insensitive, and let’s face it, he is a lot more fun when he is let out of his cage. He is willing to share Eryn with only one man, and that is his brother. They grew up sharing their toys, and Eryn is one delicious toy.IVANAlways the calm and reasonable twin, the total opposite of his brother, who’s impulsive, emotional, and never knows when to shut up. He loves his brother but quietly shares Eryn while deeper feelings and connections develop. Soon sharing becomes difficult and unbearable for Ivan.ERYNHe's been watching the two Romanov brothers from afar, but when his psycho frog brother abducts four young men from the Glass City, Phoenix, he must make a decision to do what he has been told all his life. Eliminate his only family to save the lives of the humans and the two most important, beautiful young men in his care.What to expect:⇶*M/M/M Science Fiction Paranormal Romance.⇶*Abduction/Rescue Mission.⇶*DNA Manipulated Frog People.⇶*Rebirth of Anunnaki and Anubis.⇶*Rebirth of Atlantis, only now it's called Phoenix.⇶*Rebirth of Life in Space.⇶*TWISTED FLAMING HOTNESS!!!WARNING: This book contains graphic scenes of imprisonment, violence, blood, and gore. Expect to hear male/male sex between consenting adults, all eighteen years of age or older. Sensitive readers triggered by this may want to skip or tread carefully. This book is not intended for people under eighteen years of age or for anyone offended by gay male sex.This novel can be read as a standalone. It has an extensive character summary but would be most enjoyed by getting to know the characters, places, and time appearing in Phoenix Code: New Beginnings. The author warns about potential spoilers hidden in the character summary.",
  "genres": [
    "M M Romance",
    "Science Fiction",
    "M M M",
    "Fantasy",
    "Romance",
    "Post Apocalyptic",
    "Aliens"
  ],
  "author": "Kashel Char",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/84283579-the-brawl-king"
}