{
  "title": "Novels by Henning Mankell: The Troubled Man, Faceless Killers, the White Lioness, Firewall, the Man From Beijing, the Man Who Smiled",
  "description": "This is nonfiction commentary. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Chapters: The Troubled Man, Faceless Killers, the White Lioness, Firewall, the Man From Beijing, the Man Who Smiled, One Step Behind, Secrets in the Fire, the Dogs of Riga, Sidetracked, the Fifth Woman, Before the Frost, the Return of the Dancing Master, Kennedy's Brain, Depths, Chronicler of the Winds. Source: Wikipedia. Free updates online. Not illustrated. Excerpt: The Troubled Man (Swedish: Den orolige mannen) is a crime fiction novel by Swedish author Henning Mankell, featuring police inspector Kurt Wallander. Mankell has announced that it is the final Wallander novel. A highly-decorated Swedish navy officer, Hakan von Enke, disappears during his daily walk. For Kurt Wallander this becomes a very personal case as Von Enke is Linda Wallander's father-in-law. The clues lead back in time to the Cold War, right-wing extremists and hired killers from Eastern Europe. Inspector Wallander suspects he has traced a big secret. This could be the worst spy scandal in Swedish history. At the same time, evidence suggests that Wallander is losing his memory. Henning Mankell had originally planned to write no more Wallander stories after the publication of the short story collection The Pyramid (Pyramiden) in 1999. In 2002, he released Before the Frost (Innan frosten), a novel that shifted the focus of the stories to Wallander's daughter Linda, who joins the police force. Mankell planned more novels focusing on Linda's police career but subsequently abandoned them after the death of Johanna Sallstrom, the actress who portrayed Linda in the Swedish Wallander TV series. Several years passed before Mankell decided there was one more Kurt Wallander story to tell. The naval aspect of The Troubled Man plot was inspired by the submarine incursions into Swedish territorial wa...More: http: //booksllc.net/?id=2261874",
  "genres": [
    "Mystery"
  ],
  "author": "Books LLC",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/8423982-novels-by-henning-mankell"
}