{
  "title": "Novels by Diana Wynne Jones: Howl's Moving Castle, Eight Days of Luke, Fire and Hemlock, Dark Lord of Derkholm, Year of the Griffin, Hexwood",
  "description": "Please note that the content of this book primarily consists of articles available from Wikipedia or other free sources online. Commentary (novels not included). Pages: 40. Chapters: Howl's Moving Castle, Eight Days of Luke, Fire and Hemlock, The Spellcoats, The Crown of Dalemark, Year of the Griffin, Dark Lord of Derkholm, Castle in the Air, House of Many Ways, Archer's Goon, Hexwood, Drowned Ammet, The Lives of Christopher Chant, The Ogre Downstairs, Charmed Life, Deep Secret, Cart and Cwidder, Power of Three, The Pinhoe Egg, A Tale of Time City, Dogsbody, Witch Week, The Homeward Bounders, Conrad's Fate, Time of the Ghost, Chrestomanci, The Merlin Conspiracy, The Magicians of Caprona, Enchanted Glass, Dalemark Quartet, The Game. Excerpt: Howl's Moving Castle is a young adult fantasy novel by British author Diana Wynne Jones, first published in 1986. It won a Boston Globe-Horn Book Award and was named an ALA Notable book for both children and young adults. In 2004 it was adapted as an Academy Award-nominated animated film by Hayao Miyazaki. A sequel, Castle in the Air, was published in 1990. A second sequel, House of Many Ways was released in June 2008. The author was given the idea for this book when a young boy asked her to make a story called \"The Moving Castle.\" A young woman named Sophie Hatter is the eldest of three daughters living in the town of Market Chipping in the magical kingdom of Ingary, where many fairy-tale tropes are accepted ways of life. She is very deft with the needle and makes the most beautiful hats and dresses. She unknowingly talks life into objects. As the eldest, she is resigned to the \"fact\" that she will have no chance of finding her fortune, accepting that she will have a dull life running the family hat shop-until she is turned into an old crone by the Witch of the Waste, a powerful witch who was not satisfied by Sophie's hats. Sophie leaves the shop and finds work as a cleaning lady for the notorious Howl, famed in her town for...",
  "genres": [],
  "author": "Books LLC",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/8432492-novels-by-diana-wynne-jones"
}