{
  "title": "Nigella Kitchen: Recipes from the Heart of the Home",
  "description": "Comprehensive, informative, and engaging, Nigella Kitchen offers feel-good food for cooks and eaters that is comforting yet always seductive, nostalgic but with a modern twist--whether super-fast exotic recipes for the weekday rush, leisurely slow-cook dishes for weekends and special occasions, or irresistible cakes and cookies in true \"domestic goddess\" style. Nigella Kitchen answers everyday cooking quandaries--what to feed a group of hungry teenagers, how to rustle up a spur-of-the-moment meal for friends, or how to treat yourself when you're home alone--and since real cooking is so often about leftovers, here one recipe can morph into another . . . from ham hocks in cider to cidery pea soup, from \"praised\" chicken to Chinatown salad. This isn't just about being thrifty; it's about being creative and seeing how recipes evolve.With 190 mouthwatering and inspiring recipes, including more than 60 express-style recipes (30 minutes or under), Nigella Kitchen offers plenty of choice--from clams with chorizo to Guinness gingerbread, from Asian braised beef shank to flourless chocolate lime cake, from pasta alla Genovese to Venetian carrot cake. In addition, Nigella presents her no-nonsense kitchen kit must-haves (and crucially what isn't needed) in the way of equipment and magical standby ingredients. But above all, she reminds the reader how much pleasure there is to be had in real food and in reclaiming the traditional rhythms of the kitchen, as she cooks to the beat of the heart of the home, creating simple, delicious recipes to make life less complicatedGorgeously illustrated, this expansive, lively narrative, with its rich feast of food, is destined to be a twenty-first-century classic.' to 'A Food Network star offers a collection of more than 200 new recipes and aims to recapture the comforting simplicity of hearth and home, in a book with 200 color photos.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Food and Drink",
    "Foodie"
  ],
  "author": "Nigella Lawson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/8433784-nigella-kitchen"
}