{
  "title": "ألف ليلة في ليلة",
  "description": "\"ألف ليلة في ليلة\" رائعة الروائية السورية \"سوسن جميل حسن\" الصادرة عن الدار العربية للعلوم ناشرون؛ نقرأ فيها قصة شهرزاد أخرى غير التي نعرفها، نسجتها أديبتنا من الواقع، لتبحث معها عن فارس الأحلام الذي يراود كل امرأة في خيالها، سمّته \"مولاي\" تبحث فيه عن حب حقيقي \"تحلم أن تكون امتداده وأن يكون امتدادها، تنوء بعبء الخيال وتحمل للعالم رسالتها: \"لن يكون خلاصكم من الشر المستفحل حدّ الوباء في هذا العصر المجنون إلا بالحب\".قضايا متعددة برزت في ثنايا هذه الرواية لتنسج الروائية قراءتها النقدية – الاجتماعية إلى أولويات حياتنا وأهدافنا، امرأة، أو رجل تقترب فيها من الواقع، وتعريه، لا تختبئ وراء الرموز والكلمات، بل تقحم الحياة بسيل من التساؤلات في نقد لاذع لواقع الحال الذي ترزح تحت وطأته مجتمعاتنا وحكوماتنا في الشرق العربي.تقول بطلة الرواية ديمة: \"... وكان زمن الشعارات كنا أيام المدرسة نُساق كالقطعان إلى الشوارع بأوامر لا أعرف من كان يصدرها، إنما تقترب من الأوامر الإلهية، بل هي أخطر (...) نردد هتافات لا أفهم منها شيئاً، لكنها تنفحني بشعور القوة، كيف لا وهم يسقطون الرجعية والإمبريالية، وأعداء الوطن (...) وذلك الزمن ولّى يا مولاي؟ اليوم صار من معه المال يملك مقومات الحياة...\".تحمل هذه الرواية بين طياتها الكثير من التأملات والأسئلة لحالات إنسانية شفافة، لامست جانباً خفياً في تكوين شخصية أبطالها امرأة أو رجل نقرأ هذا في شخصية ديمة ومروان وعبير التي تبحث عن المتعة، متحدية قيود المجتمع.لقد أجادت الروائية رسم تحركات أبطالها من خلال لعبة ما يسمى بالسيرة النصية في الأدب الذي أصبح رائجاً كأسلوب أدبي في العقدين الماضيين حتى أصبح الروائي يتكلم بلسان شخصيات رواياته ويكشف ما يتقد في ذاتها من أحلام وطموحات تقول: \"هل أنا امرأة حالمة حدّ المرض؟ أعرف جيداً أنني كنت حالمة منذ طفولتي؛ كنت أطفو فوق الواقع، وما زلت، برغم ما مررت به من تجارب قاسية، محن صعبة. لم تفارقني أحلام اليقظة منذ ذلك العهد (...)\".هذه الرواية ليست مجرد تجارب وأفكار أو صور وذكريات، أو أحلام، إنها إشراقة أمل تنبعث من جديد، هي عودة إلى الحياة، فكيفما نفهم الحياة نجدها ونتحسسها ونعبِّر عنها بالكتابة وهكذا كانت سوسن حسن، الحب عنوانها الوحيد فيه وحده تسمو الروح وتزدهر.",
  "genres": [],
  "author": "سوسن جميل حسن",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/8431934"
}