{
  "title": "Roman",
  "description": "Roman - 1st novel in the Autumn Colors series:Seven novels comprise the Autumn Colors Series and will be individually released upon completion. Under this dramatic series the spotlight is on the entertainment industry. Roman the first novel in the series chronicles the life of a poverty-stricken young male of natural born beauty and innocence, which a powerhouse player will claim and mold into mega superstar with an unfading portfolio of work.Following an extensive search for a superior looking model to headline a new fragrance for men a new arrival within the modeling circuit is about to be unveiled upon a larger than life advertisement billboard hanging in New York City’s legendary Times Square.This fresh face to the modeling industry is discovered by an agency giant, which represents a well-known class of the top photographed males in the modeling world.This rags to riches story follows an unknown individual of limited means and schooling from a shanty community set within a low-income suburban sector just outside of Paris, France to American soil where he will be crowned king of modeling’s elite. In one of the most successful reigns in the history of global high fashion the picture posing and catwalk career of this photogenic newcomer will resurrect the iconic figure of the first man of the earth and unleash a poisonous serpent within the gorgeous garden of male modeling. A sinister snake capable of crushing an empire and devouring the core fruit of the cover boy industries most sought after creation. *Some of the dialogue in this novel is in French with English translation*This novel is not for Readers under 18 Years of age.The novels in The Autumn Colors series will focus on a mix of dynamic professions within the entertainment industry. The books will not need to be read in chronological order or as an entire series. Each novel will be released separately over many years.Roman is the 1st novel in The Autumn Colors Series. Roman follows the life and high profile career of a male model.",
  "genres": [],
  "author": "Marlene K. Slade",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/13128534-roman"
}