{
  "title": "If Only I Had Known",
  "description": "If Only I Had Known is the riveting account of the school massacre that started a global trend, and the proven strategy thousands of education, law enforcement, and mental health professionals have quietly used to stop countless attacks and threats for fifteen years.On October 1, 1997, writes author William Dodson, when I was superintendent of Pearl Public Schools in Jackson, Mississippi, Luke Woodham, a sixteen-year-old sophomore, stabbed and bludgeoned his mother to death, then took a rifle to Pearl High School and shot nine students. Two died; seven were wounded. The act seemed to come out of the blue, with Luke Woodham randomly shooting anyone who moved. He did it in a safe and serene community. And he did it on my watch.After the Pearl attack, many others followed in North America and Europe, like the Columbine and Virginia Tech massacres in 1999 and 2007, and the Winnenden, Germany, attack in 2009. What happened at Pearl High School is the riveting story of a rampage by a student who was a member of a local suburban gang.This is the only book ever written by a school executive who has experienced an attack. For over ten years, he searched for the answer to one What could we have done to prevent the attack? Dr. William Dodson, the former superintendent of Pearl Public Schools, tells the unvarnished truth of what happened and the strategy he found that has stopped countless attacks.Unprecedented threats . . . 75-100 times a day , students are found with bombs, guns, and plots to commit school attacks. Unique in world history, these massacres typically only occur in the safest suburbs and small towns and not the inner-city.WHY? . . . there are answers . . After numerous attacks, the FBI and Secret Service concluded that you can t identify these students before they strike or the communities where they will commit an attack. If they were right, Dodson says, I wouldn t have written this book. The fact is there are answers to the why questions we ve all had. Over 20,000 education and law enforcement professionals have successfully stopped countless threats and attacks since 1997, using the Random Actor violence prevention strategies uncovered by investigative journalist and author Dan Korem. If Only I Had Known weaves the tale of the attack on Pearl and the application of the solution that is saving lives. This book is for all parents and professionals who care about the safety and security of students in our schools.",
  "genres": [
    "Nonfiction"
  ],
  "author": "William H. Dodson",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/8438392-if-only-i-had-known"
}