{
  "title": "The American Evasion of Philosophy: A Genealogy of Pragmatism",
  "description": "Taking Emerson as his starting point, West’s basic task in this enterprise is to chart the emergence, development, decline & recent resurgence of American pragmatism. Dewey is the central figure in this pantheon of pragmatists, but he treats as well such varied mid-century representatives of the tradition as Sidney Hook, C. Wright Mills, DuBois, Niebuhr & Trilling. West’s genealogy is a personal work, for it's imbued throughout with the author’s conviction that a thoro reexamination of American pragmatism may help inspire & instruct contemporary efforts to remake & reform American society & culture. \"West...may well be the pre-eminent African American intellectual of our generation.\"—The Nation \"The American Evasion of Philosophy is a highly intelligent & provocative book. Cornel West gives us illuminating readings of the political thought of Emerson & James; provides a penetrating critical assessment of Dewey, his central figure; & offers a brilliant interpretation—appreciative yet far from uncritical—of the contemporary philosopher & neo-pragmatist Richard Rorty...What shines thru, throughout the work, is West's firm commitment to a radical vision of a philosophic discourse as inextricably linked to cultural criticism & political engagement.\"—Paul S. Boyer, professor emeritus of history, University of Wisconsin–MadisonAcknowledgmentsIntroduction1 The Emersonian prehistory of American pragmatism. Emerson on power & tradition; Emerson on provocation & the market; Emerson on personality & race; Emerson as organic intellectual2 The historic emergence of American pragmatism. Peirce on scientific method, community & Christian love; James on individuality, reconciliation & heroic energies3 The coming-of-age of American pragmatism: John Dewey. Dewey on historical consciousness, critical intelligence & creative democracy4 The dilemma of the mid-century pragmatic intellectual. Sidney Hook: the Deweyan political intellectual; C. Wright Mills: the neo-Deweyan radical social critic; W.E.B. Du Bois: the Jamesian organic intellectual; Reinhold Niebuhr: the Jamesian cultural critic; Lionel Trilling: the pragmatist as Arnoldian literary critic; The decline & resurgence of American pragmatism: Quine & Richard Rorty5 Prophetic pragmatism: cultural criticism & political engagement. Roberto Unger & 3rd-Wave Left romanticism; The challenge of Michel Foucault; Tragedy, tradition & political praxis; Prophetic pragmatism & postmodernityNotesIndex",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "History",
    "Politics",
    "American History",
    "United States",
    "Sociology"
  ],
  "author": "Cornel West",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/84344.The_American_Evasion_of_Philosophy"
}