{
  "title": "الكامل في التاريخ",
  "description": "عن الكتابتاريخ جامع لأخبار ملوك الشرق والغرب، وما بينها، بدأه منذ أول الزمان إلى آخر سنة ثمان عشرين وستمائة، وضح منهجه بقوله : (ذكرت في كل سنة لكل حادثة كبيرة مشهورة ترجمة تخصها، فأما الحوادث الصغار التي لا يحتمل منها كل شيء ترجمة فإنني أفردت لجميعها ترجمة واحدة في آخر كل سنة فأقول : ذكر عدة حوادث، وإذا ذكرت بعض من نبغ وملك قطراً من البلاد، ولم تطل أيامه، فإني أذكر جميع حاله من أوله إلى آخره عند ابتداء أمره، لأنه إذا تفرق خبره لم يعرف للجهل به، وذكرت في آخر كل سنة من توفي فيها من مشهوري العلماء، والأعيان، والفضلاء.من أشهر كتب التاريخ الإسلامي، وأحسنها ترتيباً وتنسيقاً. طبع مرات كثيرة، أولها في ليدن سنة 1850—1874م بعناية تورنبرج، ثم في مصر 1303هـ. ألفه عز الدين ابن الأثير في الموصل، ورتبه على السنين، وانتهى به إلى عام (628). ثم أهمله في مسوداته مدة طويلة، حتى أمره الملك الرحيم بالاجتهاد في تبييضه. قال: فألقيتُ عني جلباب المهل، وأبطلت رداء الكسل..وقلت: هذا أوان الشد فاشتدي زيم...وسميته اسماً يناسب معناه، وهو: (الكامل في التاريخ). ثم أعقب ذلك بكلمات في فوائد علم التاريخ، ثم افتتح كتابه بذكر بدء الخلق، وقصص الأنبياء حتى صعود السيد المسيح، وأعقبه بفصل في ذكر من ملك من ملوك الروم بعد رفع المسيح (ع) إلى عهد محمد (ص) ثم أخبار الهجرات العربية، وأيام العرب قبل الإسلام، ثم السيرة النبوية حتى عام (11هـ). وافتتح المجلد الثاني بذكر مرض النبي (ص) ووفاته حتى حوادث سنة (65). ووصل بالمجلد الثالث إلى حوادث سنة (168) وبالرابع إلى آخر خلافة المقتدر سنة (295) والخامس حتى سنة (412) والسادس حتى سنة (527) والسابع حتى سنة (628) وهو أهم أجزاء الكتاب وفيه الكثير من مشاهداته وذكرياته. ويؤخذ عليه انحرافه عن صلاح الدين، وإن كان في الظاهر يثني عليه. وذكر في سبب تأليفه أنه رأى كتب التاريخ متباينة في تحصيل الغرض، يكاد جوهر المعرفة بها يستحيل إلى العرَض..وسود كثير منهم الأوراق بصغائر الأمور....والشرقي أخل بذكر أخبار الغرب، والغربي أهمل أحوال الشرق، فكان الطالب إذا أراد أن يطالع تاريخاً مفصلاً إلى وقته يحتاج إلى مجلدات كثيرة. وذكر أنه أفرغ فيه كل تراجم الطبري، وما فيه من الروايات التامة، مضيفاً إليها ما عثر عليه في التواريخ المشهورة. قال: (إلا ما يتعلق بما جرى بين أصحاب رسول الله (ص) فإني لم أضف إلى ما نقله أبو جعفر شيئاً) وإنما اعتمدتُ عليه من بين المؤرخين إذ هو الإمام المتقن حقاً، الجامع علماً وصحة اعتقاد وصدقاً. قال: (وذكرت في كل سنة لكل حادثة كبيرة ترجمة تخصها..وأما الحوادث الصغار فأفردت لجميعها ترجمة واحدة في آخر كل سنة، فأقول: ذكر عدة حوادث. وذكرت في آخر كل سنة من توفي فيها من مشهوري العلماء والأعيان). انظر التعريف بكتابي أخويه: (النهاية) و(المثل السائر). وانظر د. فيصل السامر (ابن الأثير ص87 و161) وفيه جداول مهمة لكتاب الكامل. وكان ابن الأثير من أصدقاء ياقوت الحموي، وهو الذي نفذ وصيته بعد موته.",
  "genres": [
    "History",
    "Islam",
    "Religion",
    "Nonfiction"
  ],
  "author": "ابن الأثير",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/8436605"
}