{
  "title": "How Man Became A Giant",
  "description": "About the evolution of man and the growth of civilization, there are many books. But most of those written for grown-ups are by specialists for specialists, and most of those for young people tend to insult the intelligence of their prospective audience. Yet manifestly, the average grown-up is entitled to an account that does not cloud his understanding by a parade of highly specialized knowledge, and the average youth, to one that will grant him a mental age of more than five. That it required a man and a woman reared in a new civilization to produce the latter is not altogether an accident, for this civilization was itself the work of the young the young in years and the young in heart. It is not strange that they should understand, better than we, how strong is the young person's urge for essentials, for the proper intermingling of concrete detail with honest explanation and proper theory, and how ontemptuous is his attitude toward all subterfuge and evasion. It is this understanding of the psychology of young people that is the chief characteristic of \"How Man Became a Giant.\" In our civilization children have been taught for generations that giants existed only in the dim dawn of history, if they existed at all. It will come as a revelation to them if indeed they have not always suspected t that this is not so; that giants are real beings, that they slowly developed into giants through myriads of years and by myriads of transformations and adventures, and that they themselves are incipient giants. From Ilin and Segal's book they will discover that man began as a pygmy and has only assumed his gigantic stature within the last few thousand years. How he has done this, what were the great and significant periods of his growth, what obstacles were placed in his path by nature and his fellow men, all these facts are truthfully and accurately recorded here, with full appreciation of what constitutes real change and development and what price had to be paid for them.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Sociology",
    "Anthropology",
    "Popular Science",
    "Evolution"
  ],
  "author": "M. Ilin",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/8439834-how-man-became-a-giant"
}