{
  "title": "World War II: The Rest Of The Story And How It Affects You Today, 1930 To September 11, 2001",
  "description": "Mr. Maybury presents an idea-based explanation of the Second World War. He focuses on events in the Second World War and how our misunderstanding of this war led to America s subsequent wars, including the Korean and Vietnam Wars, the Iraq-Kuwait War, and the \"war on terrorism\" that began September 11, 2001.To improve the student's learning experience, also purchase the student study guide for \"World War II\" titled \"A Bluestocking World War II\" also available through Amazon.Can be used for courses in World History, U.S. History, International Relations, Economics, Business, Finance, and Government.This is part two of a two-part series on the world wars. For part one, check out \"World War The Rest of the Story and How It Affects You Today\" also available through Amazon.Table of Contents for \"World War II\"Author's DisclosureCast of CharactersTimelinePart Who Were The Good Guys?1. The Main Theater of the War2. Good Guys Against Bad Guys3. Not Six Million4. World War II Was Nothing New5. Millions6. Britain Was A White Hat?7. British Conquests8. P.T. Barnum Knew9. British Area Bombing10. Two QuestionsPart First Rumblings11. When Did The War Begin?12. Appeasement and Comparative Brutality13. Carving Up Central EuropePart The U.S. Enters the War14. The French versus the French15. Significance of the Higgins Boat16. Only Genghis Khan Did It17. The Solution18. Events Leading to Pearl Harbor19. Hiding Facts about the Brawl20. The Great World War II MythFDR's Pearl Harbor Speech21. A Secret Agreement22. Why Did The Japanese Attack?23. Pearl FDR's Deceit24. The Flying Tigers and B-17 Bombers25. \"Caught With Their Pants Down\"26. Planes Parked Too Close Together27. The Prokofiev Seamount28. The Necessary Sacrifice?29. You've Seen The PhotosPart The Economics of the War30. The Myth of German Might31. Focus On The Eastern Front32. Of Photographs and Weather33. German Production of Weapons34. Germany's Unknown Second Army35. Tank Treads, Trucks and Submarines36. Germany's Wonder Weapons37. Oil and Rifles38. Americans Were Less Intelligent?39. The Bookings Revelation40. Russia Invaded by Keystone Kops41. Omaha Beach, Bravery versus HeroismPart The USG Makes It Worse42. The German Underground43. Unconditional Surrender44. Why Did Roosevelt Do It?45. Rarely Questioned46. Why Was Nagasaki Bombed?47. 105 Aircraft Carriers48. Surrender Near49. Fierce Fighters50. The Russians React51. The Soviet UprisingPart Effect On Us Today52. Arm Any Gangster53. September 11th and the Destruction of the World Trade Center54. Blowback55. MAD56. Policeman of the World57. SummaryPart Final Thoughts About War58. The Needless Deaths of 35 Million59. The Normal Conditions of Humans60. The Cause of War61. Minor League to Emperor of the WorldAppendixBibliography and Suggested ReadingSuggested ListeningSuggested ViewingGlossaryAbout Richard J. MayburyIndexIndex of MapsMap of EuropeBritish and Russian EmpireExpansion of the Russian Empirev Conquered by European RegimesWashington's Pacific Bases in 1940San Diego, Pearl Harbor, JapanJapan, Bungo StraitProkofiev SeamountRebel-held Territories during WWIIAxis versus Allies",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Economics",
    "School",
    "Politics",
    "Historical"
  ],
  "author": "Richard J. Maybury",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/843454.World_War_II"
}