{
  "title": "The Merry Men",
  "description": "Purchase one of 1st World Library's Classic Books and help support our free internet library of downloadable eBooks. Visit us online at www.1stWorldLibrary.ORG - - IT WAS a beautiful morning in the late July when I set forth on foot for the last time for Aros. A boat had put me ashore the night before at Grisapol; I had such breakfast as the little inn afforded, and, leaving all my baggage till I had an occasion to come round for it by sea, struck right across the promontory with a cheerful heart. I was far from being a native of these parts, springing, as I did, from an unmixed lowland stock. But an uncle of mine, Gordon Darnaway, after a poor, rough youth, and some years at sea, had married a young wife in the islands; Mary Maclean she was called, the last of her family; and when she died in giving birth to a daughter, Aros, the sea-girt farm, had remained in his possession. It brought him in nothing but the means of life, as I was well aware; but he was a man whom ill-fortune had pursued; he feared, cumbered as he was with the young child, to make a fresh adventure upon life; and remained in Aros, biting his nails at destiny. Years passed over his head in that isolation, and brought neither help nor contentment. Meantime our family was dying out in the lowlands; there is little luck for any of that race; and perhaps my father was the luckiest of all, for not only was he one of the last to die, but he left a son to his name and a little money to support it. I was a student of Edinburgh University, living well enough at my own charges, but without kith or kin; when some news of me found its way to Uncle Gordon on the Ross of Grisapol; and he, as he was a man who held blood thicker than water, wrote to me the day he heard of my existence, and taught me to count Aros as my home. Thus it was that I came to spend my vacations in that part of the country, so far from all society and comfort, between the codfish and the moorcocks; and thus it was that now, when I had done with my classes, I was returning thither with so light a heart that July day.",
  "genres": [
    "Classics",
    "Fiction",
    "Short Stories",
    "British Literature",
    "Literature",
    "Adventure",
    "Adult Fiction"
  ],
  "author": "Robert Louis Stevenson",
  "average_rating": "2.85",
  "url": "https://www.goodreads.com/book/show/8436710-the-merry-men"
}