{
  "title": "Dean and Me:",
  "description": "They were the unlikeliest of pairs—a handsome crooner and a skinny monkey, an Italian from Steubenville, Ohio, and a Jew from Newark, N.J.. Before they teamed up, Dean Martin seemed destined for a mediocre career as a nightclub singer, and Jerry Lewis was dressing up as Carmen Miranda and miming records on stage. But the moment they got together, something clicked—something miraculous—and audiences saw it at once. Before long, they were as big as Elvis or the Beatles would be after them, creating hysteria wherever they went and grabbing an unprecedented hold over every entertainment outlet of the radio, television, movies, stage shows, and nightclubs. Martin and Lewis were a national craze, an American institution. The millions (and the women) flowed in, seemingly without end—and then, on July 24, 1956, ten years from the day when the two men joined forces, it all ended. After that traumatic day, the two wouldn’t speak again for twenty years. And while both went on to forge triumphant individual careers—Martin as a movie and television star, recording artist, and nightclub luminary (and charter member of the Rat Pack); Lewis as the groundbreaking writer, producer, director, and star of a series of hugely successful movie comedies—their parting left a hole in the national psyche, as well as in each man’s heart.In a memoir by turns moving, tragic, and hilarious, Jerry Lewis recounts with crystal clarity every step of a fifty-year friendship, from the springtime, 1945 afternoon when the two vibrant young performers destined to conquer the world together met on Broadway and Fifty-fourth Street, to their tragic final encounter in the 1990s, when Lewis and his wife ran into Dean Martin, a broken and haunted old man.In Dean & Me, Jerry Lewis makes a convincing case for Dean Martin as one of the great—and most underrated—comic talents of our era. But what comes across most powerfully in this definitive memoir is the depth of love Lewis felt, and still feels, for his partner, and which his partner felt for truly a love to last for all time.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Humor",
    "Biography Memoir",
    "Music"
  ],
  "author": "Jerry Lewis",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/8438056-dean-and-me"
}