{
  "title": "Keeper: One House, Three Generations, and a Journey into Alzheimer's",
  "description": "Keeper is a fiercely honest \"glimpse into the dementia abyss\" - an endlessly engrossing meditation on memory and the mind, on family, and on a society that is largely indifferent to the far-reaching ravages of this baffling disease.Five years ago, Andrea Gillies - writer, wife, and mother of three - seeing that her husband's parents were struggling to cope, invited them to move in. She and her newly extended family relocated to a big Victorian house on a remote, windswept peninsula in the far north of Scotland, leaving behind their friends and all that was familiar; hoping to find a new life, and new inspiration for work. Her mother-in-law Nancy was in the middle stages of Alzheimer's Disease, and Keeper charts her journey into dementia, its impact on her personality and her family, and the author's researches into what dementia is. As the grip of her disease tightens, Nancy's grasp on everything we think of as ordinary unravels before our eyes. Diary entries and accounts of conversations with Nancy track the slow unravelling. The journey is marked by frustration, isolation, exhaustion, and unexpected black comedy. For the author, who knew little about dementia at the outset, the learning curve was steeper than she could have imagined. The most pernicious quality of Alzheimer's, Gillies suggests, is that the loss of memory is, in effect, the loss of one's self, and Alzheimer's, because it robs us of our intrinsic self-knowledge, our ability to connect with others, and our capacity for self-expression, is perhaps the most terrible and most dehumanizing illness. Moreover, as Gillies reminds us, the effects of Alzheimer's are far-reaching, impacting the lives of caregivers and their loved ones in every way imaginable. Keeper is a fiercely honest \"glimpse into the dementia abyss\" - an endlessly engrossing meditation on memory and the mind, on family, and on a society that is largely indifferent to the far-reaching ravages of this baffling disease. Keeper won the U.K.'s Orwell Prize for political writing and the Wellcome Trust Book Prize for medical writing.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Health",
    "Biography",
    "Medical",
    "Mental Health"
  ],
  "author": "Andrea Gillies",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/8442497-keeper"
}