{
  "title": "Degrees Kelvin: A Tale of Genius, Invention, and Tragedy",
  "description": "LORD KELVIN. In 1840, a precocious 16-year-old by the name of William Thomson spent his summer vacation studying an extraordinarily sophisticated mathematical controversy. His brilliant analysis inspired lavish praise and made the boy an instant intellectual celebrity. As a young scholar William dazzled a Victorian society enthralled with the seductive authority and powerful beauty of scientific discovery. At a time when no one really understood heat, light, electricity, or magnetism, Thomson found key connections between them, laying the groundwork for two of the cornerstones of 19th century science-the theories of electromagnetism and thermodynamics. Charismatic, confident, and boyishly handsome, Thomson was not a scientist who labored quietly in a lab, plying his trade in monkish isolation. When scores of able tinkerers were flummoxed by their inability to adapt overland telegraphic cables to underwater, intercontinental use, Thomson took to the high seas with new equipment that was to change the face of modern communications. And as the world's navies were transitioning from wooden to iron ships, they looked to Thomson to devise a compass that would hold true even when surrounded by steel. Gaining fame and wealth through his inventive genius, Thomson was elevated to the peerage by Queen Victoria for his many achievements. He was the first scientist ever to be so honored. Indeed, his name survives in the designation of degrees Kelvin, the temperature scale that begins with absolute zero, the point at which atomic motion ceases and there is a complete absence of heat. Sir William Thomson, Lord Kelvin, was Great Britain's unrivaled scientific hero. But as the century drew to a close and Queen Victoria's reign ended, this legendary scientific mind began to weaken. He grudgingly gave way to others with a keener, more modern vision. But the great physicist did not go quietly. With a ready pulpit at his disposal, he publicly proclaimed his doubts over the existence of atoms. He refused to believe that radioactivity involved the transmutation of elements. And believing that the origin of life was a matter beyond the expertise of science and better left to theologians, he vehemently opposed the doctrines of evolution, repeatedly railing against Charles Darwin. Sadly, this pioneer of modern science spent his waning years arguing that the Earth and the Sun could not be more than 100 million years old. And although his early mathematical prowess had transformed our understanding of the forces of nature, he would never truly accept the revolutionary changes he had helped bring about, and it was others who took his ideas to their logical conclusion. In the end Thomson came to stand for all that was old and complacent in the world of 19th century science. Once a scientific force to be reckoned with, a leader to whom others eagerly looked for answers, his peers in the end left him behind-and then meted out the ultimate punishment for not being able to keep step with them. For while they were content to bury him in Westminster Abbey alongside Isaac Newton, they used his death as an opportunity to write him out of the scientific record, effectively denying him his place in history. Kelvin's name soon faded from the headlines, his seminal ideas forgotten, his crucial contributions overshadowed. Destined to become the definitive biography of one of the most important figures in modern science, Degrees Kelvin unravels the mystery of a life composed of equal parts triumph and tragedy, hubris and humility, yielding a surprising and compelling portrait of a complex and enigmatic man.",
  "genres": [
    "Biography",
    "Science",
    "Nonfiction",
    "Chemistry",
    "Physics",
    "History",
    "History Of Science"
  ],
  "author": "David Lindley",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/844474.Degrees_Kelvin"
}