{
  "title": "Ludvigsbakke",
  "description": "Herregården ”Ludvigsbakke” og Kommunehospitalet i København er kulisser for den unge sygeplejerske Ida Brandts forelskelse i Karl Von Eicbaum. I knivskarpe replikker, toneleje og bevægelser skildres borgerskabets diskrete charme, samfundets sociale lag og enlige kvinders vilkår i 1890’erne.Ida og Karl har kendt hinanden siden de var børn. Karl von Eichbaum var søn af gården ”Ludvigbakkes” ejer, og Ida Brandt var godsforvalterens datter. Nu mødes de igen på Kommunehospitalet i København, hvor Ida arbejder som sygeplejerske, og Karl har en underordnet kontorstilling. Den beskedne og opofrende Ida, der efter moderens død har en ganske net formue, forelsker sig i den dovne Karl, der stadig bor hjemme hos sin mor og lader sig opvarte. Hans forældre måtte sælge gården pga. økonomiske problemer, men moderen forsøger at opretholde facaden.Igennem Idas skarpt sansende erindring vækkes minderne om den gode tid på Ludvigsbakke som en modsætning til det travle og barske arbejde med de syge og råbende patienter på hospitalet. Ida drømmer om at stifte et rigtigt hjem, men Karl kan ikke rigtig beslutte sig. Han begynder at ride sammen med Kate, datter af en smørgrosserer, som har overtaget Ludvigsbakke. Hans mor lægger de videre planer. Og det bliver en ydmygelsens tid for ”den lille frøken Brandt”, som Karls mor kalder hende.Det er en mangfoldig roman med meget underforstået liv, om sociale skel, der ikke lader sig overskride. Selvom det er Ida, der har pengene, bliver hun ikke accepteret, hverken på Kommunehospitalet eller i Karls og hans moders omgangskreds. Det er også en roman om kvinders vilkår, én af Herman Bangs stille eksistenser, en kvindeskæbne, der balancerer på en knivsæg mellem borgerskabets valg, mellem lyst og pligt for deres børn. Enlige kvinder havde ikke i sig selv en status. Det er også en roman om konflikterne mellem to forskellige dem, der lader sig manipulere og dem, der manipulerer, og det er gjort uhyggeligt godt. Herman Bang er replikkunstens og detaljens mester. I bogens sidste scene, under et middagsselskab hos Fru von Eichbaum, bliver Ida ofret i fuld offentlighed. Den lysende flittige og håbefulde Ida forvandles til en vissen pind i sin gule kjole. Fru von Eichbaum „Et af de sjældne mennesker der altid kender deres plads”.Ikke for ingenting er Herman Bang blevet kaldt forfatternes forfatter. Ingen steder forklarer eller beskriver han det, der sker. Herman Bang viser det gennem bevægelser, blik, toneleje og replikker. Det er ondt, og det gør ondt - langt ind i sjælen. Så læs den langsomt og med nærvær. Herefter vil man ikke ønske sig tilbage til ”de gode gamle dage”.",
  "genres": [
    "Danish",
    "Classics",
    "19th Century",
    "Fiction"
  ],
  "author": "Herman Bang",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/8447222-ludvigsbakke"
}