{
  "title": "Radiant Cool: A Novel Theory Of Consciousness",
  "description": "Professor Grue is dead (or is he?). When graduate student/sleuth Miranda Sharpe discovers him slumped over his keyboard, she does the sensible thing--she grabs her dissertation and runs. Little does she suspect that soon she will be probing the heart of two mysteries, trying to discover what happened to Max Grue, and trying to solve the profound neurophilosophical problem of consciousness. Radiant Cool may be the first novel of ideas that actually breaks new theoretical ground, as Dan Lloyd uses a neo-noir (neuro-noir?), hard-boiled framework to propose a new theory of consciousness.In the course of her sleuthing, Miranda encounters characters who share her urgency to get to the bottom of the mystery of consciousness, although not always with the most innocent motives. Who holds the key to Max Grue's ultimate vision? Is it the computer-inspired pop psychologist talk-show host? The video-gaming geek with a passion for artificial neural networks? The Russian multi-dimensional data detective, or the sophisticated neuroscientist with the big book contract? Ultimately Miranda teams up with the author's fictional alter ego, \"Dan Lloyd,\" and together they build on the phenomenological theories of philosopher Edmund Husserl (1859-1938) to construct testable hypotheses about the implementation of consciousness in the brain. Will the clues of phenomenology and neuroscience converge in time to avert a catastrophe? (The dramatic ending cannot be revealed here.) Outside the fictional world of the novel, Dan Lloyd (the author) appends a lengthy afterword, explaining the proposed theory of consciousness in more scholarly form.Radiant Cool is a real metaphysical thriller--based in current philosophy of mind--and a genuine scientific detective story--revealing a new interpretation of functional brain imaging. With its ingenious plot and its novel theory, Radiant Cool will be enjoyed in the classroom and the study for its entertaining presentation of phenomenology, neural networks, and brain imaging; but, most importantly, it will find its place as a groundbreaking theory of consciousness.",
  "genres": [
    "Fiction",
    "Philosophy",
    "Neuroscience"
  ],
  "author": "Dan Edward Lloyd",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/844308.Radiant_Cool"
}