{
  "title": "New York Diaries: 1609 to 2009",
  "description": "New York is a city like no other. Through the centuries, she’s been embraced and reviled, worshipped and feared, praised and battered—all the while standing at the crossroads of American politics, business, society, and culture. Pulitzer Prize winner and New York Times bestselling author Teresa Carpenter, a lifelong diary enthusiast, scoured the archives of libraries, historical societies, and private estates to assemble here an almost holographic view of this iconic metropolis. Starting on January 1 and traveling day by day through the year, these journal entries are selected from four centuries of writing—from the early 1600s to the present—allowing New York natives and visitors, writers and artists, thinkers and bloggers, to reach across time and share vivid and compelling snapshots of life in the Capital of the World. “Today I arrived by train in New York City, which I’d never seen before, walked through the grandeur of Grand Central Terminal, stepped outside, got my first look at the city and instantly fell in love with it. Silently, inside myself, I yelled: I should have been born here!”—Edward Robb Ellis, May 22, 1947“My experience is that a man cannot go anywhere in New York in an hour. The distances are too great—you must have another day to it. If you have got six things to do, you have got to take six days to do them in.”—Mark Twain, February 2, 1867“A Peregrine falcon just flew past my window.”—Johnny/Quipu Blogspot, February 5, 2003“I had a lot of dates but decided to stay home and dye my eyebrows.”—Andy Warhol, March 11, 1978“At ten we have Orders to march up the River for Mount-Washington. Adieu, New-York; perhaps forever!”—Philip Vickers Fithian, September 3, 1776New York Diaries reveals intimate, whimsical, profound, sobering, and indelible reflections on such historical moments as President Washington’s first State of the Union address, the death of Abraham Lincoln, the sinking of the Titanic, the end of World War II—even the first incursion of Europeans into the city’s Upper Bay on September 11, 1609, a presage to our country’s greatest catastrophe nearly four hundred years later. Featuring familiar faces and fascinating unknowns, these pages provide a rich mosaic that is uniquely New York.With excerpts from the writing of Sherwood Anderson • William H. Bell • Albert Camus • Chad the Minx • Noël Coward • Dorothy Day • John Dos Passos • Thomas Edison • Allen Ginsberg • William B. Gould • Keith Haring • Henry Hudson • Anne Morrow Lindbergh • Judith Malina • H. L. Mencken • John Cameron Mitchell • Joyce Carol Oates • Eugene O’Neill • Philippe Petit • Edgar Allan Poe • Theodore Roosevelt • Elizabeth Cady Stanton • William Steinway • Alexis de Tocqueville • Mark Twain • Gertrude Vanderbilt • Andy Warhol • George Washington • Kurt Weill • Walt Whitman • and many others.",
  "genres": [
    "Nonfiction",
    "History",
    "New York",
    "Memoir",
    "Travel",
    "Diary",
    "Historical"
  ],
  "author": "Teresa  Carpenter",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/13129522-new-york-diaries"
}