{
  "title": "Women on Top 2: The Testicles",
  "description": "A companion piece to Tolstoy's War and Peace , which argued against the theory that history was made by great men, Women on Top 2: The Testicles , demonstrates that the future will be made by great women.Available for the first time in paperback, with an introduction by Professor GC Cleftbottom, University of Kent.Published in the famed EB Garamond font.Praise for Women On A Dud’s Tale\"Dud Wimpole's words have a profoundly honest ring, for they rest on experiences too deep for deception... A gem of a dramatic narrative focused on the deepest of human problems.\" - Professor Gordon W. Allport\" Women on A Dud's Tale might well be prescribed for everyone who would understand our time.\" - Journal of Individual Psychology\"An inspiring document of an amazing man who was able to garner some good from an experience so abysmally bad... Highly recommended.\" - Library Journal“Studded with sharp assessments.” - Washington Post“As a healthy, middle aged woman, I like to indulge my natural rape fantasies by reading literature. This book was sorely lacking in regards to that end, and I do use “sorley” as a double entendre. Women on A Dud’s Tale contains very little in the way of graphic depictions of brutal love-play and next to nothing in terms of revelries in blood loss, nor creative ideas for the use of kitchen implements in the bedroom. As for Dud Wimpole, I doubt he could turn on a light switch!” - Grenada Smith“Beautifully observed.” - Slate“I wet myself laughing. I cried with laughter. Then I wet myself crying.\" - Tamara Jackson“A goldmine of surprising insights; makes you smarter with every page.” - James Clear“I bought this book for my wife, hoping it would expand her interests, and get her off the reality TV for a few minutes. From the pre order listing, I thought it was going to be about female empowerment. I figured there would be stuff to inspire a woman to take action. Instead, it turned out to be about this Dud Wimpole character, an utterly useless nerd who couldn’t do anything, and who seems to have this innate ability to annoy women. My wife read the first chapter and then she asked me to get out of the house.What’s more, while I was gone, she sold all my He-Man figures! How could this happen? - I can hear you ask. Well, leaving in a hurry as I did, I didn’t have time to go into the garage and get the figures from the box in which I keep them. I had other things to worry about, like where was I going to sleep that night! (My brother let me sleep on his couch).I’d assumed I’d only be out until the lady cooled off, anyway. She turned out to be so insulted by this book, and this Dud Wimpole character, that she NEVER cooled off. Instead, she texted me a week later saying that we were getting a divorce, and that I should collect my stuff.I would have loved to collect my stuff - if she hadn't sold my entire collection of He-Man figures!!! The whole lot was gone! I had a near complete collection - except from Rotar and Twistoid - but I could have got them from somewhere, anyway.I had three original He-Men, two in near mint collection, complete with weapons. There was a load of other weapons in there, too. Most of the figures were complete. In a separate box, there were some vehicles and a complete Castle Grayskull, too.She went into the garage and sold it in the yard - and the neighbour says she was looking for $500 for it, even though a complete collection is going for ten times that much on ebay.Only good news - I’d got a commemorative Battle Armor He-Man and Skeletor set for my nephew, and those are at my brother’s house, so those are safe.But it’s not the same. Nothing is the same. Not now. Not ever again..” - Slim Neilhart",
  "genres": [],
  "author": "Daniel Silman",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/84485218-women-on-top-2"
}