{
  "title": "The Photoshop Elements 10 Book for Digital Photographers",
  "description": "This book breaks new ground by doing something for digital photographers that’s never been done before—it cuts through the bull and shows you exactly “how to do it.” It’s not a bunch of theory; it doesn’t challenge you to come up with your own settings or figure things out on your own. Instead, it does something that virtually no other Elements book has ever done—it tells you flat-out which settings to use, when to use them, and why. If you’re looking for one of those “tell-me-everything-about-the-Unsharp-Mask-filter” books, this isn’t it. You can grab any other Elements book on the shelf, because they all do that. Instead, this book gives you the inside tips and tricks of the trade for organizing, correcting, editing, sharpening, retouching, and printing your photos like a pro. You’ll be absolutely amazed at how easy and effective these techniques are—once you know the secrets.LEARN HOW THE PROS DO ITEach year we train thousands of digital photographers and, almost without exception, they have the same questions and face the same problems—that’s exactly what we cover in this book.You’ll THE BOOK’S SECRET WEAPONAlthough Elements 10 offers some digital photography features that Photoshop CS5 doesn’t offer, there are plenty of features that Photoshop CS5 has that Elements 10 still doesn’t have (things like paths, Channel Mixer, etc.). But in this book, you’ll learn some slick workarounds, cheats, and some fairly ingenious ways to replicate many of those Photoshop features from right within Elements. Plus, since this book is designed for photographers, it doesn’t waste your time talking about how to frame a shot, set your exposure, etc., and there’s no talk about which camera or printer to buy. It’s all Elements, step by step, cover to cover, in the only book of its kind, and you’re gonna love it!",
  "genres": [
    "Photography"
  ],
  "author": "Matt Kloskowski",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/13129317-the-photoshop-elements-10-book-for-digital-photographers"
}