{
  "title": "The Gaucho Martín Fierro",
  "description": "This is a poem of protest drawn from the life of the gaucho, who was forced to yield his freedom and individuality to the social and material changes that invaded his beloved pampas--a protest which arose from years of abuse and neglect suffered from landowners, militarists, and the Argentine political establishment.This poem, composed and first published more than a century ago, could have been written today by spokesmen for other oppressed groups in other parts of the world. For this reason, perhaps, the poem has such universal appeal that it has been translated into nineteen languages, making it available to more than half of the world's people.Hernandez's poem was an attempt to alert the government, and particularly the city dwellers, to the problems faced by the gaucho minority in adjusting to the new, unfamiliar culture imposed on them by the Central Government soon after the fall of the dictator Juan Manuel de Rosas in 1852, under the slogan \"Politics of Progress.\" Moreover, the poem supplied a historical link to the gauchos' contribution to the national development of Argentina, for the gaucho had performed a major role in the country's independence from Spain. They had also fought in the civil wars of Argentina and had cleared the pampas of marauding Indian bands that plagued the pastoral development of the region. According to Hernandes they had been by turns abused, neglected, and finally dispersed, ultimately losing their identity as a social group.Those interested in the Martin Fierro as literature, as social protest, as anthropology, or as an example of the annihilation of a minority group--and its very identity--have joined in making it the most widely read, analyzed, and discussed literary work produced in Argentina. Now, after several hundred editions in Spanish and other languages, Martin Fierro is recognized as a masterpiece of world literature.The aim of this English version has been to achieve a line-by-line rendition faithful to the original in substance and tone, but without attempting to recreate Hernandez's meter or rhyme. The translators present it here as a catalyst for enjoyment, provocation, and insight.",
  "genres": [
    "Poetry",
    "Classics",
    "Spanish Literature",
    "Fiction",
    "19th Century",
    "School",
    "Literature"
  ],
  "author": "José Hernández",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/845333.The_Gaucho_Mart_n_Fierro"
}