{
  "title": "The Saga of the Renunciates",
  "description": "Return to the genre-bending world of Darkover, to a trilogy that follows the thrilling story of two Free Amazon womenIn the three novels which comprise THE SAGA OF THE RENUNCIATES, Marion Zimmer Bradley tells the masterful tale of two valiant women who face and try to break the invisible chains of custom, convention, habit and expectation with which society binds women, and women bind themselves.Magdalen Lorne is a Terran woman born and reared on Darkover. She thinks herself the perfect Terran undercover Intelligence agent, and disguises herself as a Free Amazon to enable her to fulfill a mission to free a Terran man from kidnappers. But when she herself is captured by a band of real Renunciates, she discovers they have a harsh punishment for any she must swear the Oath of the Free Amazons, relinquish her former life, and become a Renunciate in reality.Jaelle has been raised in the harsh patriarchal environment of the Dry Towns. Her mother Mellora is a Comyn woman who has been kidnapped in order to breed laran- gifted offspring for her barbarian \"husband.\" But when a desperate, pregnant Mellora dies in childbirth following a daring escape aided by a band of Renunciates, the still young Jaelle is adopted into the Guild, and becomes the Free Amazon Jaelle n'ha Mellora, a woman who has never known kindness from a man.Together Magda, now known as Margali n'ha Tsabet, and her Guild-sister Jaelle will follow a twisting course neither could have predicted. A course which will lead them to question every aspect of themselves and of their two so-different societies. And one which will eventually set them on a life-threatening journey not only to the frozen ends of the physical world, but to the perilous limits of the spiritual overworld as well.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "LGBT"
  ],
  "author": "Marion Zimmer Bradley",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/84554.The_Saga_of_the_Renunciates"
}