{
  "title": "Surrender to a Stranger",
  "description": "From Karyn Monk, author of The Witch and the Warrior and Once a Warrior , comes an enthralling love story that is as passionate as it is suspenseful....She trusted him with her life....Sentenced to death, Jacqueline never expected to be rescued from her filthy cell by an unlikely visitor--a man whose disguise hid a devastatingly handsome British agent. Now the two were on the run--and for as long as he was there to protect her, she felt strangely safe....But could she trust him with her heart?They called him the Black Prince, and to save the unjustly condemned he took hair-raising risks, slipping in and out of courtrooms and prisons, brazenly defying the threat of capture and death. The reckless spy tried to tell himself that Jacqueline was just another prisoner to be spirited away to safety. Yet there was something about her fierce dignity, her unrelenting sense of honor, her unbreakable spirit that made him never want to let her go....HE RISKED HIS LIFE TO SAVE HERS....She thought she was about to die when her family's farm came under attack.  Instead, a handsome stranger rode to her rescue and took a bullet to save her.  But when the bloodshed and terror were over,Josephine Armstrong discovered that the man she owed her life to was a British soldier.  She could not betray Lt. Col. Damien Powell -- not after what he'd done for her.  But she would pay dearly for harboring the enemy, forced to prove her patriotism by becoming the rebels' most beautiful spy....BUT WOULD SHE GIVE HIM HER HEART IN RETURN?When he saw the lovely young woman struggling with her captor, Damien didn't care which side of the bloody war she was on.  He only knew that he had never seen such an incredible mixture of extraordinary beauty and raw courage in his life.  Yet Damien couldn't know that one day this innocent farm girl was destined to betray him.  She would become Charles Town's most irresistible spy, dazzling officers with her charms even as she stripped them of strategic secrets.  But when a twist of fate brings Josephine back into his life again, Damien will gamble everything on the chance that he can make this exquisite rebel surrender...if only in his arms. -->",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "France",
    "Adult",
    "French Revolution"
  ],
  "author": "Karyn Monk",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/845786.Surrender_to_a_Stranger"
}