{
  "title": "Stupid White Men: And Other Sorry Excuses for the State of the Nation!",
  "description": "Remember when everything was looking up? When the government was running at a surplus, pollution was disappearing, peace was breaking out in the Middle East and Northern Ireland, and the Bridge to the Twenty-First Century was strung with high-speed Internet cable and paved with 401(k) gold?Well, so much for the future Michael Moore, the award-winning provocateur behind \"Roger & Me\" and the bestseller \"Downsize This!\" now returns to size up the new century - and that big, ugly special interest group that's laying waste to the world as we know it: stupid white men. Whether he's calling for United Nations action to overthrow the Bush Family Junta, calling on African-Americans to place \"Whites Only\" signs over the entrances of unfriendly businesses, or praying that Jesse HElms will get kissed by a man, \"Stupid White Men\" is Mike's Manifesto on Malfeasance and Mediocrity. Among his targets:- George W.: the Thief-in-Chief. A trespasser on Federal land, a squatter in the Oval Office. Send in the Marines!- Bill Clinton: one of the best Republican presidents we've ever had.- The Idiot Nation: a friggin' stain on a blue dress. That's what captured our attention in the nineties - along with slow-moving Broncos, six-year-old strangled beauty queen, and Hugh Grant's dating habits.- Corporate America: there is no recession, my friends: No downturn, no hard times. The rich are wallowing in loot - and now they want to make sure you don't come a-lookin' for your piece of the pie.The polls indicate that 60% of Americans are \"upset or angry\" about this land in which we now live - a land where crooked courts select the president and money rules the day. So if you're feeling the same way and you're wondering what's going to give out first - the economy, Dick Cheney's pacemaker, or your new VW Beetle - here's the book for you,",
  "genres": [
    "Nonfiction",
    "Politics",
    "Humor",
    "History",
    "The United States Of America",
    "Comedy",
    "Sociology"
  ],
  "author": "Michael Moore",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/8461274-stupid-white-men"
}