{
  "title": "Under the Sun: The Letters of Bruce Chatwin",
  "description": "The definitive collection of the letters of the enigmatic writer, providing new perspectives on his extraordinary life. Selected and edited by Elizabeth Chatwin and Nicholas Shakespeare, with an introduction by Elizabeth Chatwin.\"I am most certainly in the mood for writing letters.\"Bruce Chatwin is one of the most significant British novelists and travel writers of our time. His books have become modern-day classics which defy categorisation, assimilating elements of fiction, essay, reportage, history and gossip, inspired by and reflecting his incredible journeys. Tragically, Chatwin's compelling narrative voice was cut off just as he had found it. One month before his death he lamented, \"There are so many things I want to do.\" \"Bruce had just begun\" said his friend, Salman Rushdie, \"we saw only the first act\". While we shall never know the surprise of his unwritten works, Chatwin left behind a body of writing that is striking for its freshness; an authentic conduit which allows us to return to him and to be a wealth of letters and postcards that he wrote, from his first week at school until shortly before his death at the age of forty-eight. Whether typed on Sotheby's notepaper or hastily scribbled, Chatwin's correspondence reveals more about himself than he was prepared to expose in his books; his health and finances, his literary ambitions and tastes, his uneasiness about his sexual orientation; above all, his lifelong quest for where to live. Written with the verve and sharpness of expression that first marked him out as a writer, Chatwin's letters gives a vivid synopsis of his changing interests and concerns throughout his life.Comprising material collected over two decades from hundreds of contacts across five continents, Under the Sun is a valuable and illuminating record of one of the greatest and most enigmatic writers of the twentieth century.",
  "genres": [
    "Travel",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Queer",
    "Biography Memoir"
  ],
  "author": "Bruce Chatwin",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/8456609-under-the-sun"
}