{
  "title": "Vanish",
  "description": "Tess Gerritsen's Vanish sports precisely those qualities that her much-acclaimed Body Double had in profusion: razor-sharp plotting, tight and economical characterisation and (most of all) the inexorable capture of the reader's attention as her grim plot disturbingly unfolds.Of course, none of this will come as a surprise to long-term Gerritsen fans (an ever-growing legion)--The Surgeon rang some fascinating changes on the serial killer theme, with a threat from the grave terrifying a doctor, and )--The Apprentice, with its killer utilising medical acumen, took no prisoners. But Body Double was the ace in the hole, with resourceful cop Jane Rizzoli tracking down the murderer of her doppelganger. Jane Rizzoli, readers will be glad to hear, is back in Vanish.Medical examiner Maura Isles is looking at another body in a slab. Not a new experience for her, but she's in for another shock when the body opens its eyes and proves to be alive. And violence swiftly follows, as the mystery woman--strikingly beautiful--kills a security guard in the hospital she's taken to, before capturing a group of hostages. One of them is a pregnant woman--Detective Jane Rizzoli, no less. And if Jane can find out what this lethal abductor wants, she may be able to save her own life--and those of the other hostages. But the clock is ticking.One might argue that Gerritsen has played safe with this scenario in terms of ratcheting up the tension. After all, a hostage situation is always surefire, with its constant threat of impending violence. But the author (as ever) studiously avoid clichés, and ensures a palm-sweating experience for the reader. A good notion, too, to make Jane Rizzoli more vulnerable in this outing. --Barry Forshaw",
  "genres": [
    "Mystery",
    "Thriller",
    "Crime",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Tess Gerritsen",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/846119.Vanish"
}