{
  "title": "The Manny Diaries",
  "description": "\"I laughed, then cried then laughed again... and I discovered a new author who is definitely on my to-get-now list. If Kilt Kilpatrick's other books contain even half the fun yet sweet and totally engaging characters along with a story that is all heart and a beautiful romance, then I will be a very happy reader.\" --Dark Diva Reviews (5 \"delightful divas\")Young art student Evan Ross falls out of the closet and into the fire when an unexpected sexual encounter with a friend changes his life forever. His rocky - and surprisingly hot - search for true love and a real job (not necessarily in that order) takes him on a series of romantic adventures and misadventures, from the lofty hills to the seedy streets of San Francisco.When he lands a job as a male nanny for a precocious 8-year old, his career and romance paths start to converge - and he finds himself falling for a dead-ringer of his dream man, Clive Owen. The only problem? It's the girl's straight father.Can he land his dream job and his dream man? THE MANNY DIARIES is sexy, warm and hilarious novel with a supporting cast of quirky, lovable characters, a fun pace, and a true-to-life setting.\"Comedic without becoming slapstick, a story of self-discovery and a love story with a very nice warm, fuzzy moment at the end, The Manny Diaries is all of these things. I look forward to seeing more full-length work from Kilt Kilpatrick, to see where his fertile imagination will take us.\" --Whipped Cream Erotic Romance Reviews (4 \"cherries\")\"In my opinion, this author is an exceptional writer-intelligent, humorous, and skillful. With or without the erotic content, his work would be entertaining. (The sex scenes were more of an added bonus.) I thoroughly enjoyed this first novel and have my fingers crossed for many more in the future.\" --Michelle n Jeff ReviewsWant more HOT stories of manly men getting it on? Don't miss these titles from Ravenous Tight An Erotic Gay Football Anthology edited by Lori PerkinsIn these pages you'll find 11 delightful \"tails\" of man-on-man lust and muscle on the playing field - and in the locker room and bedroom!Even Hotter The DILF Anthology IINothing is sexier than a man who loves his kids.In this second volume of stories celebrating hot dads, you'll find young dads and older dads, gay dads and straight dads, vampire dads, a father of the bride, and even, in true Ravenous Romance style, a M/F/M threesome!Dude Ranch by Adam CarpenterEight men are about to descend upon Capstone’s Dude Ranch, and they are in for the most memorable two weeks of their lives. Rich in the atmosphere of the Smoky Mountains of Tennessee, sexual desire unleashed on virtually every page, DUDE RANCH is the story of men who give in to their desires and in the process realize what has been missing from their lives. Giddyup!You've Got Male by Gregory L. NorrisSmolderingly handsome Brandon is a man used to getting what he wants. But he may have met his match in indie bookshop owner Chance, whose Books by the Brooks has been targeted by Brandon’s higher-ups at Book-Tropolis, the big chain bookstore that has sent him to secure a space for a new venue in the charming town of Twin Brooks. Don't miss this hot retelling of the classic love story!Gay Pride and Prejudice by Ryan FieldAlthough his uncle always told him it was as easy to fall in love with a wealthy man as it was to fall in love with a poor man, Tristan was always more interested in falling for the right man. All his life, Tristan's goal was to fall in love with the man of his dreams and get married, whether anyone (or the law) liked it or not.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Gay",
    "Family",
    "Erotica",
    "Childrens"
  ],
  "author": "Kilt Kilpatrick",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/8461975-the-manny-diaries"
}