{
  "title": "The Complete Tudors",
  "description": "The nine Tudor novels by beloved novelist Jean Plaidy are now available as one complete series spanning sixteenth-century England. This exciting collection includes a brand-new character guide, along with reading group guides for seven books. Read all nine novels in order for the first time digitally and delve into the lives of this fascinating dynasty—full of intrigue, betrayal, marriages, and deaths, in a complete package, never before available.    1. To Hold the Crown In this sweeping tale of marriage and power, love and heartbreak, Henry VII and Elizabeth of York’s troubled ascension to the throne of England ultimately launches the Tudor dynasty.   2. Katharine of Aragon Katharine of Aragon held her husband Henry VIII’s affection—but only for so long.   3. Murder Most Royal One powerful king. Two tragic queens. Sophisticated Anne Boleyn and innocent Catherine Howard meet with the all-consuming—and fickle—passions of tempestuous King Henry VIII.   4. The King’s Confidante The King’s servant, but God’s first.  The English lawyer Sir Thomas More rises to become King Henry VIII’s most trusted advisor, but his refusal to recognize Henry as the supreme head of the Church of England ends his political career . . . and leads to his trial for treason.   5. The Sixth Wife Dangerous court intrigue and affairs of the heart collide during the story of Katherine Parr, the last of Henry VIII’s six queens.   6. The Thistle and the Rose The story of Princess Margaret Tudor, whose life of tragedy, bloodshed, and scandal would rival even that of her younger brother, Henry VIII.   7. Mary, Queen of France The story of Princess Mary Tudor, a celebrated beauty and born rebel who would defy the most powerful king in Europe—her older brother.   8. For a Queen’s Love Power-hungry monarch, cold-blooded murderer, obsessive monster—who could love such a man? Set against the glittering courts of sixteenth-century Europe, the Spain of the dreaded Inquisition, and the tortured England of Bloody Mary, this is the story of Philip II of Spain—and of the women who loved him as a husband and father.   9. A Favorite of the Queen Torn between her heart’s passion and duty to her kingdom, Elizabeth I must make a decision that will shape her country and place her name in history forever.",
  "genres": [
    "Historical Fiction",
    "Tudor Period"
  ],
  "author": "Jean Plaidy",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/8461626-the-complete-tudors"
}