{
  "title": "Inconceivable: A Medical Mistake, the Baby We Couldn't Keep, and Our Choice to Deliver the Ultimate Gift",
  "description": "A medical mistake during an IVF procedure. An unthinkable situation . . . you’re pregnant with the wrong baby. You can terminate, but you can’t keep him. What choice would you make? Carolyn and Sean Savage had been trying to expand their family for years. When they underwent an IVF transfer in February 2009, they knew it would be their last chance. If they became pregnant, they would celebrate the baby as an answer to their prayers. If not, they would be grateful for the family they had and leave their fertility struggles behind forever. They never imagined a third option. The pregnancy test was positive, but the clinic had transferred the wrong embryos. Carolyn was pregnant with someone else’s baby. The Savages faced a series of heartbreaking terminate the pregnancy, sue for custody, or hand over the infant to his genetic parents upon delivery. Knowing that Carolyn was carrying another couple’s hope for a baby, the Savages wanted to do what they prayed the other family would do for them if the situation was reversed. Sean and Carolyn Savage decided to give the ultimate gift, the gift of life, to a family they didn’t know, no strings attached. Inconceivable provides an inside look at how modern medicine, which creates miracles daily, could allow such a tragic mistake, and the many legal ramifications that ensued with both the genetic family and the clinic. Chronicling their tumultuous pregnancy and its aftermath, which tested the Savage’s faith, their relationship to their church, and their marriage, Inconceivable is ultimately a testament to love. Carolyn and Sean loved this baby, making it impossible for them to imagine how they could give him life and then give him away. In the end, Inconceivable is a story of what it is to be a parent, someone who nurtures a life, protects a soul, only to release that child into the world long before you’re ready to let him go.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Christian",
    "Biography Memoir",
    "Medical",
    "Book Club"
  ],
  "author": "Carolyn Savage",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/8463204-inconceivable"
}