{
  "title": "The Boys of the Dark: A Story of Betrayal and Redemption in the Deep South",
  "description": "A story that garnered national attention, this is the harrowing tale of two men who suffered abuses at a reform school in Florida in the 1950s and 60s, and who banded together fifty years later to confront their attackers.\n\nMichael O'McCarthy and Robert W. Straley were teens when they were termed incorrigible youth by authorities and ordered to attend the Florida School for Boys. They discovered in Marianna, the City of Southern Charm, an immaculately groomed campus that looked more like an idyllic university than a reform school. But hidden behind the gates of the Florida School for Boys was a hell unlike any they could have imagined. The school's guards and administrators acted as their jailers and tormentors. The boys allegedly bore witness to assault, rape, and possibly even murder.\nFor fifty years, both men---and countless others like them---carried their torment in silence. But a series of unlikely events brought O'McCarthy, now a successful rights activist, and Straley together, and they became determined to expose the Florida School for Boys for what they believed it to be: a youth prison with a century-long history of abuse. They embarked upon a campaign that would change their lives and inspire others.\nRobin Gaby Fisher, a Pulitzer Prize--winning journalist and author of the New York Times bestselling After the Fire, collaborates with Straley and O'McCarthy to offer a riveting account of their harrowing ordeal. The book goes beyond the story of the two men to expose the truth about a century-old institution and a town that adopted a Nuremberg-like code of secrecy and a government that failed to address its own wrongdoing. What emerges is a tale of strength, resolve, and vindication in the face of the kinds of terror few can imagine.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Crime",
    "Memoir",
    "American History",
    "Social Justice"
  ],
  "author": "Robin Gaby Fisher",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/8463024-the-boys-of-the-dark"
}