{
  "title": "The Last Jew of Treblinka",
  "description": "Before me sits a young woman. I cut off her hair, thick and beautiful, and she grasps my hand and begs me to remember that I too am a Jew. She knows that she is lost. ‘But remember,‘ she says, ‘you see what is being done to us. That‘s why my wish for you is that you will survive and take revenge for our innocent blood, which will never rest.‘ She has not had time to get up when a murderer who is walking between the benches lashes her on the head with his whip. Blood shows on her now shorn head. That evening, the blood of tens of thousands of victims, unable to rest, thrust itself upwards to the surface.—from The Last Jew of TreblinkaWhy do some live while so many others perish? Tiny children, old men, beautiful girls. In the gas chambers of Treblinka, all are equal. The Nazis kept the fires of Treblinka burning night and day, a central cog in the wheel of the Final Solution. There was no pretense of work here like in Auschwitz or Birkenau. Only a train platform and a road covered with sand. A road that led only to death. But not for Chil Rajchman, a young man who survived working as a “barber” and “dentist,” heartsick with witnessing atrocity after atrocity. Yet he managed to survive so that somehow he could tell the world what he had seen. How he found the dress of his little sister abandoned in the woods. How he was forced to extract gold teeth from the corpses. How every night he had to cover the body-pits with sand. How ever morning the blood of thousands still rose to the surface.Many have courageously told their stories, and in the tradition of Elie Wiesel’s Night and Primo Levi’s Survival at Auschwitz and The Drowned and the Saved, Rajchman provides the only survivors’ record of Treblinka. Originally written in Yiddish in 1945 without hope or agenda other than to bear witness, Rajchman’s tale shows that sometimes the bravest and most painful act of all is to remember.",
  "genres": [
    "Nonfiction",
    "History",
    "Holocaust",
    "Memoir",
    "World War II",
    "War",
    "Biography"
  ],
  "author": "Chil Rajchman",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/8467720-the-last-jew-of-treblinka"
}