{
  "title": "Wookieepedia - Force Ghosts: Ajunta Pall, An'ya Kuro, Anakin Skywalker, Anakin Solo, Andur Sunrider, Arca Jeth, Aryzah, Bink Otauna, Callista Ming, Darsin, Darth Andeddu, Darth Caedus, Darth Krayt, Darth Vectivus, Dathka Graush, Death, Denin, Dice Ibegon,",
  "description": "This book consists of articles from Wikia or other free sources online. Pages: 569. Chapters: Ajunta Pall, An'ya Kuro, Anakin Skywalker, Anakin Solo, Andur Sunrider, Arca Jeth, Aryzah, Bink Otauna, Callista Ming, Darsin, Darth Andeddu, Darth Caedus, Darth Krayt, Darth Vectivus, Dathka Graush, Death, Denin, Dice Ibegon, Dllr Nep, Echuu Shen-Jon, Empatojayos Brand, Erpham Warrick, Exar Kun, Force ghost, Freedon Nadd, Grotrugga, Halagad Ventor, Herian I'ngre, Hosk Trey'lis, Ikrit, Kaan, Karness Muur, Kento Marek, Kimania, Kol Skywalker, Lak Sivrak, Lanius Qel-Bertuk, LaTor, Luke Skywalker, Mara Jade Skywalker, Marka Ragnos, Morgan Katarn, Naga Sadow, Neas Nyl, Nerra Ziveri, Obi-Wan Kenobi, Palpatine, Pernicar, Qordis, Qui-Gon Jinn, Quorlac Fornayh, Qu Rahn, Risstenni, Saalo Morn, Spirit protector, Tag Greenley, Tahl, Tal, Ulic Qel-Droma, Unidentified Tarasin Force ghost, Vergere, Vila, Vodo-Siosk Baas, XoXaan, Yoda, Zeth Durron, Zik'tath. Excerpt: Ajunta Pall was the leader of the Dark Jedi that were exiled from the Republic following the Hundred-Year Darkness. Upon his arriving on Korriban, he became the first Dark Lord of the Sith. His spirit was redeemed by the Jedi Knight Revan during the Jedi Civil War. Ajunta Pall, exiled on Ziost. Anakin Skywalker (nicknamed Ani by his mother and wife) was a legendary Force-sensitive Human male who served the Galactic Republic as a Jedi Knight and later served the Galactic Empire as the Sith Lord Darth Vader. Born to Shmi Skywalker, later in life he became the secret husband of Senator Padme Amidala of Naboo and the father of the Jedi Grand Master Luke Skywalker and Jedi Knight Leia Organa Solo. He was also the grandfather of Ben Skywalker, Jaina, Jacen, and Anakin Solo, as well as the great-grandfather of Allana and an ancestor of Nat, Kol, and Cade Skywalker. Although he would later become a crucial figure in the galaxy, Skywalker came from humble origins. He spent the first years of his life on Tatooine as a slave along w...",
  "genres": [],
  "author": "Source Wikipedia",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/13130931-wookieepedia---force-ghosts"
}