{
  "title": "The Red Queen",
  "description": "The post-apocalyptic fantasy series reaches its heartbreaking, world-shaking conclusion!Award-winning Australian author Isobelle Carmody concludes the epic story of Elspeth Gordie, a heroine in the vein of Tamora Pierce's most memorable and empowering protagonists. The final chapter in the eight-book Obernewtyn Chronicles, The Red Queen is a YA fantasy novel decades in the making.After years spent struggling to balance her desires with her responsibilities, Elspeth Gordie has fully embraced her role as the Seeker. Battle-scarred and lovelorn, haunted by memories of her beloved Rushton, Elspeth is not prepared for what she finds at the end of the black road she travels: the Compound, a lost community with a startling secret. As Elspeth strives against her captors, she learns that Rushton and her friends have fallen into the hands of the deadly slavemasters that rule the Red Land. And worst of all, as Elspeth stumbles, the Destroyer creeps ever closer to his goal: awakening the cataclysmically destructive weaponmachines that Elspeth has been charged with stopping. Has all her sacrifice been in vain?Full of romance, action, and suspense, The Red Queen is a worthy finale to such a breathtakingly elaborate series.(The Red Queen is the title of the final book in the series as published in Australia; a different book in the series as published in North America has also been tentatively titled \"The Red Queen\" but corresponds to the second half of the Australian edition of The Sending, book 6, and would not contain any part of this book.)Penguin Australia would like fans of Isobelle Carmody’s Obernewtyn Chronicles to know that we have made the decision to move The Red Queen from its planned 2013 release to an unscheduled date. We’d like to take this opportunity to reassure everyone, that Isobelle remains absolutely committed to the Obernewtyn Chronicles. The series has been an enormous part Isobelle’s life for over 25 years, and we strongly believe Isobelle should take the time she needs to make this installment, the very best yet.A message from Isobelle Carmody:I understand you have been waiting, impatiently or patiently, some of you for literally years. I thank you and I am touched and honoured that so many of you did not grow out of me, but have allowed Elspeth to visit you through the years. If you are one of these readers, then we have shared a long journey, and it is coming to an end. Forgive me for not rushing it but with each step, I am saying goodbye to a world I have loved.Let me hone and polish and conclude this last book at my own pace, without furious pressure. I promise it will be a better book for it. And isn’t that what we all want, in the end? Not a book produced to fit a deadline, but a book that was worth waiting for.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Dystopia",
    "Fiction",
    "Science Fiction",
    "Audiobook",
    "Romance"
  ],
  "author": "Isobelle Carmody",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/13130788-the-red-queen"
}