{
  "title": "Is Marriage for White People?: How the African American Marriage Decline Affects Everyone",
  "description": "During the past half century, African Americans have become the most unmarried people in our nation. More than two out of every three black women are unmarried, and they are more than twice as likely as white women never to marry. The racial gap in marriage extends beyond the poor. Affluent and college educated African Americans are also less likely to marry or stay married than their white counterparts. That harms black children and adults, and imperils the growth and stability of the black middle class.One reason that marriage has declined is that as black women have advanced economically and educationally, black men have fallen behind. Nearly twice as many black women as black men graduate from college each year.Thus, not only are many college-educated black women unmarried, they are more likely than any other group of women to marry less educated and lower earning men. Half of college-educated black wives are more educated than their husbands.Yet black women rarely marry men of other races. They are less than half as likely as black men, and only a third as likely as Latinos or Asian Americans, to wed across group lines. Is Marriage for White People? traces the far-reaching consequences of the African American marriage decline. It also explains why black women marry down rather than out. Its provocative conclusion is that black women would benefit both themselves and the black race if they crossed class lines less and race lines more.As particular as this inquiry may seem, it is also universal. Americans of all races are more unmarried now than ever. And as women surpass men educationally, wives increasingly earn more than their husbands. In illuminating the lives of African Americans, Is Marriage for White People? thus probes cultural and economic trends that implicate everyone, highlighting the extent to which the experience of black women may become that of all women.This book both informs and entertains. The culmination of a decade of research by a distinguished Stanford law professor, it melds scholarly theory and data with the poignant stories shared by black women throughout the nation. This unforgettable book is essential reading for anyone who wants to understand the shifting terrain of intimacy in American society.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Race",
    "Relationships",
    "African American",
    "Politics",
    "Marriage"
  ],
  "author": "Ralph Richard Banks",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/8469684-is-marriage-for-white-people"
}