{
  "title": "Hauntings: Tales of the Supernatural",
  "description": "Collection of 17 tales of the supernatural. These are all in the best tradition of the supernatural story -- authentically eerie, but more about the human spirit than about spooks and specters. Well-known authors are presented here in what, for them, is an unusual manner: a rich vein of British and American imaginative fiction. Beautifully illustrated with the macabre art of Edward Gorey on both front & back Dust Jacket; other of his illustrations open each story inside, + one on full title page. 1. The Lonesome Place by August Derleth ©1947 by All-Fiction Field, Inc. and ©1962 by August Derleth. Reprinted by permission of Arkham House.2. In The Vault by H. P. Lovecraft ©1932 by Popular Fiction Publishing Company, ©1939, 1945 by August Derleth and Donald Wondrei; ©1963 by August Derleth. Reprinted by permission of Arkham House.3. The Man Who Collected Poe by Robert Bloch, ©1951 by Popular Publications, Inc. Reprinted by permission of the author's agent, Harry Altshuler.4. Where Angels Fear by Manly Wade Wellman, from \"Unknown\". ©1939 by Street & Smith Publications, Inc.; © renewed 1967 by The Conde Nast Publications, Inc. Reprinted by permission of The Conde Nast Publications, Inc.5. Lot No. 249 by Sir Arthur Conan Doyle from \"The Conan Doyle Stories\". Reprinted by permission of the Trustees of the Estate of Sir Arthur Conan Doyle and John Murray, Ltd.6.  The Haunted Doll's House by M. R. James from \"The Collected Ghost Stories of M. R. James\" by Montagne Rhodes James. Reprinted by permission of Edward Arnold (Publishers) Ltd.7.  The Open Door by Mrs. Oliphant8. Thus I Refute Beelzy by John Collier from \"Fancies and Goodnights\". ©1940 by John Collier. Reprinted by permission of the Harold Matson Company.9. Levitation from \"Nine Horrors and a Dream\" by Joseph Payne Brennen. ©1958 by Joseph Payne Brennen. Reprinted by permission of Arkham House.10. The Ghostly Rental by Henry James11. The Face by E. F. Benson from \"Spook Stories\". Reprinted by permission of Reverend K. S. P. McDowall.12. The Whistling Room by William Hope Hodgson. ©1947 by August Derleth. Reprinted by permission of Arkham House.13.  The Grey Ones by J. B. Priestley. Reprinted by permission of A. D. Peters & Co.14. The Stolen Body by H. G. Wells. Reprinted by permission of Collins-Knowlton-Wing, Inc.15. The Red Lodge from \"They Return at Evening\" by H. Russell Wakefield. ©1928 by D. Appleton and Company. Reprinted by permission of Appleton-Century, affiliate of Meredith Press.16. The Visiting Star from \"Powers of Darkness\" by Robert Aickman. ©1966 by Robert Aickman. Reprinted by permission of William Collins & Sons, Ltd.17. Midnight Express by Alfred Noyes. Reprinted by permission of Hugh Noyes.",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Ghosts",
    "Ghost Stories",
    "Anthologies",
    "Supernatural"
  ],
  "author": "Henry Mazzeo",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/847048.Hauntings"
}