{
  "title": "The Roots of Romanticism",
  "description": "The Roots of Romanticism at last makes available in printed form Isaiah Berlin's most celebrated lecture series, the Mellon lectures, delivered in Washington in 1965, recorded by the BBC, and broadcast several times. A published version has been keenly awaited ever since the lectures were given, and Berlin had always hoped to complete a book based on them. But despite extensive further work this hope was not fulfilled, and the present volume is an edited transcript of his spoken words.For Berlin, the Romantics set in motion a vast, unparalleled revolution in humanity's view of itself. They destroyed the traditional notions of objective truth and validity in ethics with incalculable, all-pervasive results. As he said of the Romantics \"The world has never been the same since, and our politics and morals have been deeply transformed by them. Certainly this has been the most radical, and indeed dramatic, not to say terrifying, change in men's outlook in modern times.\"In these brilliant lectures Berlin surveys the myriad attempts to define Romanticism, distills its essence, traces its developments from its first stirrings to its apotheosis, and shows how its lasting legacy permeates our own outlook. Combining the freshness and immediacy of the spoken word with Berlin's inimitable eloquence and wit, the lectures range over a cast of the greatest thinkers and artists of the eighteenth and nineteenth centuries, including Kant, Rousseau, Diderot, Schiller, Schlegel, Novalis, Goethe, Blake, Byron, and Beethoven. Berlin argues that the ideas and attitudes held by these and other figures helped to shape twentieth-century nationalism, existentialism, democracy, totalitarianism, and our ideas about heroic individuals, individual self-fulfillment, and the exalted place of art. This is the record of an intellectual bravura performance--of one of the century's most influential philosophers dissecting and assessing a movement that changed the course of history.",
  "genres": [
    "Philosophy",
    "History",
    "Nonfiction",
    "Romanticism",
    "Art",
    "Literary Criticism",
    "Politics"
  ],
  "author": "Isaiah Berlin",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/84713.The_Roots_of_Romanticism"
}