{
  "title": "So Long Been Dreaming: Postcolonial Science Fiction and Fantasy",
  "description": "So Long Been Dreaming: Postcolonial Science Fiction & Fantasy is an anthology of original new stories by leading African, Asian, South Asian and Aboriginal authors, as well as North American and British writers of color.Stories of imagined futures abound in Western writing. Writer and editor Nalo Hopkinson notes that the science fiction/fantasy genre “speaks so much about the experience of being alienated but contains so little writing by alienated people themselves.” It’s an oversight that Hopkinson and Mehan aim to correct with this anthology.The book depicts imagined futures from the perspectives of writers associated with what might loosely be termed the “third world.” It includes stories that are bold, imaginative, edgy; stories that are centered in the worlds of the “developing” nations; stories that dare to dream what we might develop into.The wealth of postcolonial literature has included many who have written insightfully about their pasts and presents. With So Long Been Dreaming they creatively address their futures.Contributors include: Opal Palmer Adisa, Tobias Buckell, Wayde Compton, Hiromi Goto, Andrea Hairston, Tamai Kobayashi, Karin Lowachee, devorah major, Carole McDonnell, Nnedi Okorafor-Mbachu, Eden Robinson, Nisi Shawl, Vandana Singh, Sheree Renee Thomas and Greg Van Eekhout.Nalo Hopkinson is the internationally-acclaimed author of Brown Girl in the Ring, Skin Folk, and Salt Roads. Her books have been nominated for the Hugo, Nebula, Tiptree, and Philip K. Dick Awards; Skin Folk won a World Fantasy Award and the Sunburst Award. Born in Jamaica, Nalo moved to Canada when she was sixteen. She lives in Toronto.Uppinder Mehan is a scholar of science fiction and postcolonial literature. A South Asian Canadian, he currently lives in Boston and teaches at Emerson College.",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Anthologies",
    "Speculative Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Nalo Hopkinson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/847409.So_Long_Been_Dreaming"
}