{
  "title": "Thieves",
  "description": "Fast-paced young adult fiction about a group of young people gifted with an extra-sensory talent. The first novel of a 'thriller' trilogy.Nicky is asked to read some of her work aloud in class. She dreads it-and, just as she starts-she finds herself elsewhere. Transported. For Nicky is one of a select few people who can will themselves away not just in mind, but in body. She has the gift of teleportation. It's a rare, genetic ability, and a sinister, anonymous group called the Project want to use her 'gift' for their own ends. Nicky finds herself whisked off to a nameless desert site. Here, she and four other teenagers, who are also 'travellers', are educated and trained for search and rescue missions. As these missions grow more frightening, more perilous, the five start to form closer friendships. Yet it is only when they realise that the Project wants them to breed more travellers like themselves, that Nicky, Paul and the others, find the impetus to form an escape plan. In a stark, direct style, Thieves pulls you right in to this strange, sinister world of gifted young adults exploited by an anonymous group. This novel is above all a thriller. It comments on much that is surreal in our own supposedly ordinary times. A remarkable and original debut and the first in a trilogy that includes Anywhere But Here (2008) and Real Life (2009) .\". . . the best teenage science fiction novel I have read this century.\" Trevor Agnew, Magpies\"My teenager read it almost in one sitting (getting up at 5am to continue).\" Tania Roxborogh, Otago Daily Times\"Not many debut novels make it onto the New Zealand Post Children's Book Awards shortlists, but Thieves, by Ella West, fully deserves its place.\" Tessa Duder, the Australian Women's Weekly\"As readers we are in the same predicament as the five teens and we are left to grapple with the sort of questions and interesting possibilities raised by novels such as Slaughterhouse 5 and more particularly The Time Travellers Wife.\" Steve Langley in English in Aotearoa",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Fantasy",
    "Paranormal",
    "Magic"
  ],
  "author": "Ella West",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/8477158-thieves"
}