{
  "title": "Murder in Vegas: New Crime Tales of Gambling and Desperation",
  "description": "Las Vegas. Lost Wages. Sin City. An artificial oasis of pleasure, spectacle, and entertainment, the gambling capital of America has reinvented itself so many times that its doubtful that anyone knows for sure what's real and what isn't in the miles of neon and scorching heat. Las Vegas is considered the ultimate players destination-no matter what your game. Almost anything is available-for a price, mind you, and sometimes losers walk away from the tables with even less than just an empty wallet or purse-sometimes they don't walk away at all.Now the International Association of Crime Writers and New York Times-bestselling author Michael Connelly have gathered twenty-two crime and mystery stories about the ultimate playground, Las Vegas, and what can happen behind the glitz and glamour. Come to the true city that never sleeps, where fortunes are made and lost every day, and where snake-eyes aren't found just on a pair of dice.The sunshine tax / James Swain --Passline / S.J. Rozan --Dust up / Wendy Hornsby --The kidnapping of Xiang Fei / Michael Collins --Killer heels kill twice as dead / T.P. Keating --Iggy's stuff / J. Madison Davis --A temporary crown / Sue Pike --The gambling master of Shanghai / Joan Richter --House rules / Libby Fischer Hellmann --Rolling the bones / Tom Savage --Oddsmaker / Edward Wellen --The dope show / K. j. a. Wishnia --Death of a whale in the church of Elvis / Linda Kerslake --Neighbors / John Wessel --The end of the world (as we know it) / Lise McClendon --Nickels and dimes / Ronnie Klaskin --Even gamblers have to eat / Ruth Cavin --The magic touch / A.B. Robbins --Catnapping / Gay Toltl Kinman --Miscast / Micki Marz --Lightning rider / Rick Mofina --Grieving Las Vegas / Jeremiah Healy",
  "genres": [
    "Mystery",
    "Short Stories",
    "Fiction",
    "Crime",
    "Anthologies",
    "Thriller",
    "True Crime"
  ],
  "author": "Michael    Connelly",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/84781.Murder_in_Vegas"
}