{
  "title": "Hotel on the Corner of Bitter and Sweet",
  "description": "In the opening pages of Jamie Ford’s stunning debut novel, Hotel on the Corner of Bitter and Sweet, Henry Lee comes upon a crowd gathered outside the Panama Hotel, once the gateway to Seattle’s Japantown. It has been boarded up for decades, but now the new owner has made an incredible discovery: the belongings of Japanese families, left when they were rounded up and sent to internment camps during World War II. As Henry looks on, the owner opens a Japanese parasol.This simple act takes old Henry Lee back to the 1940s, at the height of the war, when young Henry’s world is a jumble of confusion and excitement, and to his father, who is obsessed with the war in China and having Henry grow up American. While “scholarshipping” at the exclusive Rainier Elementary, where the white kids ignore him, Henry meets Keiko Okabe, a young Japanese American student. Amid the chaos of blackouts, curfews, and FBI raids, Henry and Keiko forge a bond of friendship–and innocent love–that transcends the long-standing prejudices of their Old World ancestors. And after Keiko and her family are swept up in the evacuations to the internment camps, she and Henry are left only with the hope that the war will end, and that their promise to each other will be kept.Forty years later, Henry Lee is certain that the parasol belonged to Keiko. In the hotel’s dark dusty basement he begins looking for signs of the Okabe family’s belongings and for a long-lost object whose value he cannot begin to measure. Now a widower, Henry is still trying to find his voice–words that might explain the actions of his nationalistic father; words that might bridge the gap between him and his modern, Chinese American son; words that might help him confront the choices he made many years ago. Set during one of the most conflicted and volatile times in American history, Hotel on the Corner of Bitter and Sweet is an extraordinary story of commitment and enduring hope. In Henry and Keiko, Jamie Ford has created an unforgettable duo whose story teaches us of the power of forgiveness and the human heart.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Romance",
    "Historical",
    "World War II",
    "Audiobook"
  ],
  "author": "Jamie Ford",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/8481580-hotel-on-the-corner-of-bitter-and-sweet"
}