{
  "title": "Moment of Truth",
  "description": "Jack Newlin comes home to find his wife dead. Convinced that he knows who killed her - and determined to hide the truth - Jack decides to make it look as though he did it. Unfortunately for Jack, hiring Mary may turn out to be his only mistake.A winner of the Edgar Award and the bestselling author of six acclaimed novels, Lisa Scottoline has unabashedly earned the distinction \"queen of the legal thriller.\" Critics have celebrated her storytelling talents, noting that she skillfully depicts \"personal quirks that give her characters dimension.\" Publishers Weekly has raved that \"Scottoline's legal background lends verisimilitude\" to her stories, and Kirkus Reviews has praised her ability to devise terrific plots, proclaiming that she \"comes up with the best hooks in the legal trade.\" Now this gifted author has summoned her array of talents to pen Moment of Truth, her most exciting and unpredictable novel yet--a riveting story of a man who frames himself for murder. Attorney Jack Newlin comes home one evening to find his wife, Honor, dead on the floor of their elegant dining room. Convinced that he knows who killed her--and determined to hide the truth--Jack decides to make it look as though he did it. Staging the crime scene so that the evidence incriminates him, he then calls the police. And to hammer the final nail in his own coffin, he hires the most inexperienced lawyer he can find, a reluctant rookie by the name of Mary DiNunzio, employed at the hot Philadelphia firm of Rosato & Associates. Unfortunately for Jack, hiring Mary may turn out to be his only mistake. Though inexperienced, Mary doubts Jack's confession and begins to investigate the crime. She finds that instead of having a guilty client who is falsely proclaiming his innocence, she has an innocent client who is falsely proclaiming his guilt. Her ethics and instincts tell her she can't defend a man who wants only one thing--to convict himself. Or can she? Smarter, gutsier, and more determined than she has any right to be, Mary decides to stick with the case. With help from the most unexpected sources, she sets out to prove what really happened--because as any lawyer knows, a case is never as simple as it seems. And nothing is ever certain until the final moment of truth.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Audiobook",
    "Legal Thriller",
    "Crime",
    "Suspense"
  ],
  "author": "Lisa Scottoline",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/84821.Moment_of_Truth"
}