{
  "title": "The Caucasus Under Soviet Rule",
  "description": "The Caucasus is a strategically and economically important region in contemporary global affairs. Western interest in the Caucasus has grown rapidly since 1991, fuelled by the admixture of oil politics, great power rivalry, ethnic separatism and terrorism that characterizes the region. However, until now there has been little understanding of how these issues came to assume the importance they have today. This book argues that understanding the Soviet legacy in the region is critical to analysing both the new states of the Transcaucasus and the autonomous territories of the North Caucasus. It examines the impact of Soviet rule on the Caucasus, focusing in particular on the period from 1917 to 1955. Important questions covered include how the Soviet Union created ‘nations’ out of the diverse peoples of the North Caucasus; the true nature of the 1917 revolution; the role and effects of forced migration in the region; how over time the constituent nationalities of the region came to re-define themselves; and how Islamic radicalism came to assume the importance it continues to hold today. A cauldron of war, revolution, and foreign interventions - from the British and Ottoman Turks to the oil-hungry armies of Hitler’s Third Reich - the Caucasus and the policies and actors it produced (not least Stalin, Sergo Ordzhonikidze and Anastas Mikoyan) both shaped the Soviet experiment in the twentieth century and appear set to continue to shape the geopolitics of the twenty-first. Making unprecedented use of memoirs, archives and published sources, this book is an invaluable aid for scholars, political analysts and journalists alike to understanding one of the most important borderlands of the modern world.",
  "genres": [
    "History",
    "Russia",
    "Russian Empire"
  ],
  "author": "Alex Marshall",
  "average_rating": "2.86",
  "url": "https://www.goodreads.com/book/show/8487472-the-caucasus-under-soviet-rule"
}