{
  "title": "مصر بتلعب!: كيف تحول الشعب المصري إلى جمهور؟",
  "description": "فى كتابه الجديد \"مصر بتلعب\" الصادر حديثا عن دار المصرى للنشر يؤكد محمد توفيق أن المصريين تحولوا لمتفرجين وجلسوا فى مقاعد الجمهور عندما قام الاحتلال البريطانى بتغيير نظام امتحانات الثانوية العامة، ليصبح لكل طالب رقم \"جلوس\" خاص به، ولا يحق للمتحنين أن يسألوا أحدا من الطلاب عن اسمه. ويقول توفيق فى مقدمة الكتاب أن تبعات ذلك كان انطلاق ثورة 1919 أما مصر سنة 2010 فترفع شعار \"الحق فوق القوة، والأمة فوق الحكومة\" والأهلى فوق الجميع، والمصريون يهتفون \"ارقص .. يا حضرى\" إضافة للشعار الأخير الذى انطلق مع كأس الأمم \"عايز تهده هات له جدو\"و\"عايز تغيظه هات له زيزو\".ويقوم توفيق فى هذا الكتاب بالإجابة عن السؤال الذى طرحه فى عنوانه الجانبى \"كيف تحول الشعب المصرى إلى جمهور\" حيث يؤكد فى مقدمة الكتاب أن مصر نامت يوم 2 نوفمبر سنة 1917 عندما منح بلفور وعده إلى الزعيم اليهودى روتشيلد بتأسيس وطن لليهود فى فلسطين، وهو اليوم أيضا الذى بدأ فيه الجنرال اللنبى الزحف نحو فلسطين، ليحتل غزة يوم الأربعاء 7 نوفمبر، ثم يغتصب القدس فى 9 ديسمبر ويقول: انتهت الحروب الصليبية وها قد عدنا يا صلاح الدين.و قسم المؤلف الكتاب إلى 6 فصول تناول فى الأول منها أبطال المصريين فى العصر الحالى، مؤكدا على أنهم لاعبو كرة القدم ومدربوهم، بدءً من حسن شحاتة، وحسام حسن ومحمد أبو تريكة مرورا بأحمد حسن، وعصام الحضرى وعمرو زكى، وصولا إلى محمد ناجى جدو.ويتساءل توفيق فى هذا الجزء من الكتاب عن أسباب ترك الناس كل شئ وحصروا آمالهم فى كرة القدم، ويجيب توفيق مؤكدا على أن الناس لا تفهم الأدب ولا تهتم بالشعر، ولا تعنيها الفلسفة، ولا تقبل على العلم، ولا تثق فى السياسيين.وفى الفصل الثانى وصف توفيق كرة القدم بالوصف المعروف لها \"أفيون الشعوب\" وقال إنها والأفيون وجهان لعملة واحدة، كلاهما يخدر الناس ويتحكم فى انفعالاتهم، ويخصص توفيق جزءً كبيرا من الكتاب للحديث عن \"الألتراس\" ويعرفهم بأنهم مجموعة من الشباب اللذين اتفقوا فيما بينهم على أربعة مبادئ أساسية وهى عدم التوقف عن التشجيع والغناء طوال المباراة، وعدم الجلوس نهائيا أثناء المباريات، وحضورها كلها الداخلية والخارجية منها، والولاء والانتماء لمكان الجلوس فى الاستاد.",
  "genres": [
    "Politics"
  ],
  "author": "محمد توفيق",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/8488395"
}