{
  "title": "Derviš i smrt",
  "description": "Ahmed Nuruddin is sheikh of a tekke, the head of a small religious order in an Ottoman Bosnian town. Forty, he's a settled, respected member of the community, until pushed onto a new path by successive shocks: the arrest of his brother & an encounter with a fugitive from justice. These lead him to question previous certainties & bring him into conflict with local authorities. He becomes part of the political system himself. Ill-suited to that, he comes to an unhappy end.  Death & the Dervish follows the 1st-person perspective of Nuruddin, with little dialog & much introspective soul-searching. It isn't difficult to read. Tho superficially sparse, it maintains continuous suspense. There's a fascinating array of other characters, seen thru Nuruddin's sometimes insightful, sometimes naive eyes: his fellow dervishes; his friend Hassan, the unsettled black sheep of his family, in love with a Dalmatian Christian; Hassan's father & sister; townspeople; & religious & secular officials. Nuruddin also looks back at his experiences as a soldier.  Nuruddin's angst is often philosophical, his thinking foreign, convincingly that of a Muslim religious recluse, in many ways narrow & parochial. But his quandries are universal. Death & the Dervish is an evocation of Ottoman Bosnia, of a world now past, but above all the story of an individual struggling to find himself & maintain his integrity & dignity in a hostile political landscape. (Parts were inspired by events in Selimovic's life & in modern Yugoslavian history.) Nuruddin isn't an antihero. He's a man profoundly troubled, a thinker rather than a doer, ill-equipped for the challenges he faces. Death & the Dervish is a masterfully compelling psychological study & a spell-binding novel which approaches poetry in the intensity of its language. It's hard to believe it took 30 years for an English translation to appear.--Danny Yee (edited)",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Literature",
    "Philosophy",
    "Novels",
    "20th Century"
  ],
  "author": "Meša Selimović",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/8487092-dervi-i-smrt"
}