{
  "title": "Civilization and Capitalism 15th-18th Century, Vol. 1: The Structures of Everyday Life",
  "description": "This is the first of three fascinating volumes in which Braudel, the renowned historian and celebrated author of The Mediterranean and the Mediterranean World, offers what is in effect an economic and social history of the world from the Middle Ages to the Industrial Revolution. Like everything he writes, it is new, stimulating and sparkles like champagne.Braudel's technique, it has been said, is that of a pointilliste. Myriads of separate details, sharp glimpses of reality experienced by real people, are seen miraculously to orchestrate themselves into broad rhythms that underlie and transcend the excitements and struggles of particular periods. Braudel sees the past as we see the present — only in a longer perspective and over a wider field.The perspective is that of the possible, of the actual material limitations to human life in any given time or place. It is the every¬day, the habitual — the obvious that is so obvious it has hitherto been neglected by historians — that Braudel claims for a new and vast and enriching province of history. Food and drink, dress and housing, demography and family structure, energy and technology, money and credit, and, above all, the growth of towns, that powerful agent of social and economic development, are described in all the richness and complexity of real life.The intensely visual quality of Braudel's understanding of history is brought into sharper focus by the remarkable series of illustrations that of themselves would make this book incomparableFERNAND BRAUDEL was born in 1902, received a degree in history in 1923, and subsequently taught in Algeria, Paris and Sao Paulo. He spent five years as a prisoner of war in Germany, during which time he wrote his grand thesis, The Mediterranean and the Mediterranean World in the Age of Philip II, which was published in 1949. In 1946 he became a member of the editorial board of Annates, the famous journal founded by Marc Bloch and Lucian Febvre, whom he succeeded at the College de France in 1949. He has been a member of the Ecole Pratique des Hautes Etudes and since 1962 has been chief administrator of the Maison des Sciences de l'Homme. Professor Braudel holds honorary doctor¬ates from universities all over the world.Jacket painting: Detail from Breughel the Elder's The Fall of Icarus, from the Musees Royaux des Beaux-Arts, Brussels. (Giraudon)\"Braudel deserves a Nobel Prize. . . . [This is] the most remarkable picture of human life in the centuries before the human condition was radically changed by the growth of industry that has yet been presented. A book of great originality, a masterpiece.\"—J. H. Plumb, The Washington Post\"Braudel's books enthrall. ... He is brilliant in demonstrating how most history is written on the backs of most people.\"—John Leonard, The New York Times\"Even a preliminary glance at The Structures of Everyday Life shows a book that has no obvious compeer either in scope of reference or level of accessibility to the general reader. ... Its broad authority remains deeply impressive.\"—Richard Holmes, Harper's\"Here is vast erudition, beautifully arranged, presented with grace of style, with humility before life's complexity and warm humanist feeling. Braudel's subject is nothing less than every¬day life all over the world before the industrial revolution.... He succeeds triumphantly in his first purpose: 'if not to see everything, at least to locate everything, and on the requisite world scale.'\"—Angus Calder, The Standard\"On neither side of the Atlantic does there live a man or woman with so much knowledge of the past as Braudel, or with a greater sense of its aptness to the intellectual occasion in hand....You can't pick up this big fat book without having your attention transfixed by something or other, if only the great gallery of pictures. They are a masterpiece in themselves.\"—Peter Laslett, The Guardian\"This new book is unarguably a brilliant survey of demog¬raphy, urbanisation, transport, technology, food, clothing, housing, money and business, social classes, state power and international trade in the fifteenth to the eighteenth centuries.\"—Theodore Zeldin, The Listener-----By examining in detail the material life of preindustrial peoples around the world, Fernand Braudel significantly changed the way historians view their subject. Volume I describes food and drink, dress and housing, demography and family structure, energy and technology, money and credit, and the growth of towns.",
  "genres": [
    "History",
    "Economics",
    "Nonfiction",
    "Sociology",
    "Politics",
    "World History",
    "Philosophy"
  ],
  "author": "Fernand Braudel",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/103431.Civilization_and_Capitalism_15th_18th_Century_Vol_1"
}