{
  "title": "A Guide to Evidence-based Integrative and Complementary Medicine",
  "description": "The must-have integrative and complementary medicine reference from experts in the field This exhaustive textbook is ideal for anyone with an interest in integrative and complementary medicine in Australia; including General Practitioners, medical students, integrative clinicians and health practitioners. A Guide to Evidence-based Integrative and Complementary Medicine presents non-pharmacologic treatments for common medical practice complaints – all supported by current scientific evidence. These include Attention Deficit Hyperactivity Disorder (ADHD), asthma, insomnia, anxiety, depression and many more. This practical health resource profiles myriad approaches in integrative and complementary medicine, such as mind-body medicine, stress management techniques, dietary guidelines, exercise and sleep advice, acupuncture, nutritional medicine, herbal medicine, and advice for managing lifestyle and behavioural factors. It also looks at complementary medicines that may impact the treatment of disease. A Guide to Evidence-based Integrative and Complementary Medicine contains only proven therapies from current research, particularly Cochrane reviews, systematic reviews, randomised control trials, published cohort studies and case studies. • easy access to evidence-based clinical data on non-pharmacological treatments – including complementary medicines – for common diseases and conditions• instant advice on disease prevention, health promotion and lifestyle issues• chapter summaries based on scientific evidence using the NHMRC guidelines grading system• printable patient summary sheets at chapter end to facilitate discussion of clinical management• conveniently organised by common medical presentations",
  "genres": [],
  "author": "Vicki Kotsirilos",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/8487547-a-guide-to-evidence-based-integrative-and-complementary-medicine"
}