{
  "title": "The Devilin Fey",
  "description": "A paranormal romance novella of two stories, featuring an incubus and succubus.Story #1 (The Devilin Fey) features a demure young woman who unleashes the \"devil in\" her, through the intimacy with an incubus-- her incubus.Story #2 (Tongue-Tied) features a voyeuristic succubus driven by jealousy and a dangerous fixation.Recommended for readers who are seeking something different in the \"paranormal romance\" genre.* This novella appears in Jess C Scott's 4:Play, Minus One (significant savings for anthology). Paranormal Romance / Urban Fantasy=====\"Devilishly delicious.\" -- Horror Author, Andy Love\"I really enjoyed this story of an incubus and the woman he transforms...the author really hits her stride in paranormal stories.\" -- Review @ Bitten by Books\"[The pages] were filled with passion, adventure, mystery and a love that pulls at the heart strings.\" -- Review @ Addicted To Romance\"[The Devilin Fey] was erotic without being pornographic, emotional without being sappy, spiritual without being preachy...just enjoyable reading. Kudos to Jess Scott.\" -- Paul G. / Amazon review, July 2010\"Jess C Scott is the 21st-century Judy Blume.\"-- Amazon Review on \" A Blog Novel\", March 2011\"You're a brilliant writer. [Your books] are not shallow reads--they entertain but also make you reflect on what is really important in one's life.\"-- e-mail from a reader, 2011 (The Philippines)He looked like he did the night before. Same shirt. Low-rider jeans with shreds across the left thigh. One hand was behind his back, and he held it out, presenting a bouquet of white and smoky purple lilies.\"These are for you.\"Purple and white -- my favorite colors.\"Th...thank you.\" The lilies were divine. They were fresh stalks, unbound. \"These smell...wonderful.\"\"They're straight from the underworld, by the way. They are everlasting. They won't die.\"ABOUT THE Jess writes edgy/contemporary fiction (and is an English/Business senior at Adams State College). Her literary work has appeared in a diverse range of publications, such as Word Riot, ITCH Magazine, and The Battered Suitcase. The Devilin Fey is a novella which features in Jess C Scott's short story collection, 4:Play. Visit her website for free samples and more!jesscscott.comjessINK.com",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Paranormal Romance",
    "Fiction",
    "Romance"
  ],
  "author": "Jess C. Scott",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/8489061-the-devilin-fey"
}