{
  "title": "Discovering Your Amazing Marriage",
  "description": "There's more to marriage than just surviving!Between the Tiger Woods scandal, the Jesse James cheating shocker, and the Gores recent announcement of their split, it feels like we live in a world where it's impossible to keep marriages strong, stay faithful, and last forever. We all want to keep that thrill alive that we experience during a first kiss or first date but where does that anticipation, overwhelming joy, pure devotion, and bright hope of romance go, once you're married?Authors Debby and Jason Coleman have experienced their fair share of challenges, including infidelity, and now share their own secrets and meditations on marriage in their new book Discovering Your Amazing Marriage.Jason says, \"Within the first six months of our marriage, we had to deal with the consequences of infidelity and the very real possibility of divorce. These things aren't supposed to happen at all; but if they do, it's usually later in life when married people drift away from each other. Or so we thought.\"Keeping passion alive once the doldrums of daily family life sets in is easier said than done. After having children, moving to a new place, advancing in a career, or experiencing a trauma or loss; marriage can become a habit or even worse, rote duty.\"We now know through our own experiences that nothing can destroy a marriage quicker than infidelity, but we also know that we have a story to tell that may encourage couples to stay the course and make their marriage work, no matter what challenges they may face. We are a living testimony of the power of forgiveness and restoration.\"\"We have experienced some terrible challenges in our marriage and have survived...we beat the odds and have chosen to stay together! We have a 'rags-to-riches' story that is truly amazing. We have experienced first-hand the power of forgiveness and restoration and we have triumphed!\"No matter how long you've been married, with the timely, honest and spiritually relevant advice in this book, a marriage filled with respect, love, passion, and devotion is within your reach.",
  "genres": [],
  "author": "Jason Coleman",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/8493895-discovering-your-amazing-marriage"
}