{
  "title": "Chasing AllieCat",
  "description": "Dumped with relatives in a small Minnesota town for the summer, Sadie Lester is relying on her mountain bike to save her from total boredom. Then she meets Allie, a spiky-haired off-road mountain biker who's training for a major race. Allie leads Sadie and Joe, a cute fellow cyclist, up and down Mount Kato, and the three become close friends. But the exhilarating rush comes to a halt when they find a priest in the woods, badly beaten and near death. After calling for help, Allie disappears from their lives. As they search for Allie and try to find out why she left so suddenly, Sadie and Joe discover more about Allie's past, including her connection to the priest. Only on the day of the big race does Sadie finally learn the complete, startling truth about Allie―and the terrible secret that forced her into hiding.A Junior Library Guild Selection \"Using an authentic adolescent voice with an observant sense of humor, Davis creates an engaging, increasingly gritty (also brutal) bike-centric mystery (and romance)...a suspenseful ride.\" ― KIRKUS REVIEWS \"Davis constructs a succinct, compelling story that combines romance, suspense, and the theme of overcoming challenges. The strong sense of place, character development, and love triangle dynamics should engage cycling enthusiasts as well as a broader audience.\"― PUBLISHERS WEEKLY \"A wonderful, tough, and totally believable story . . . Hang on tight. This is quite a ride.\"―Chris Crutcher, author of Angry Management \"Dangerous\"―TERRY DAVIS, AUTHOR OF VISION QUEST \"I love Chasing AllieCat . It's proof again of what a tremendous writer Becky Davis is, smart, touching and generous in spirit. She creates in Sadie, Allie, Joe, Siren and these other characters a magnficent group of survivors, that everyone will love getting to know!\"―TERRY TRUEMAN, AUTHOR OF THE PRINTZ HONOR NOVEL STUCK IN NEUTRAL",
  "genres": [
    "Young Adult",
    "Mystery",
    "Contemporary",
    "Abuse",
    "Sports"
  ],
  "author": "Rebecca Fjelland Davis",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/8492290-chasing-alliecat"
}