{
  "title": "Lead with a Story: A Guide to Crafting Business Narratives That Captivate, Convince, and Inspire",
  "description": "Storytelling has come of age in the business world. Today, many of the most successful companies use storytelling as a leadership tool. At Nike, all senior executives are designated \"corporate storytellers.\" 3M banned bullet points years ago and replaced them with a process of writing \"strategic narratives.\" Procter & Gamble hired Hollywood directors to teach its executives storytelling techniques. Some forward-thinking business schools have even added storytelling courses to their management curriculum. The reason for this is simple: Stories have the ability to engage an audience the way logic and bullet points alone never could. Whether you are trying to communicate a vision, sell an idea, or inspire commitment, storytelling is a powerful business tool that can mean the difference between mediocre results and phenomenal success. \"Lead with a Story\" contains both ready-to-use stories and how-to guidance for readers looking to craft their own. Designed for a wide variety of business challenges, the book shows how narrative can help: - Define culture and values - Engender creativity and innovation - Foster collaboration and build relationships - Provide coaching and feedback - Lead change - And more Whether in a speech or a memo, communicated to one person or a thousand, storytelling is an essential skill for success. Complete with examples from companies like Kellogg's, Merrill-Lynch, Procter & Gamble, National Car Rental, Wal-Mart, Pizza Hut, and more, this practical resource gives readers the guidance they need to deliver stories to stunning effect.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Communication",
    "Writing",
    "Management",
    "Self Help"
  ],
  "author": "Paul                   Smith",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/13132771-lead-with-a-story"
}