{
  "title": "The Dragon Lord's Daughters",
  "description": "Meet the daughters of King Arthur's descendant, Merin Pendragon. They have an appetite for adventure and a gift for driving men wild with desire. Marrying them off may seem an easy task, but it's only going to prove that when it comes to these girls, trouble follows in threes. Join New York Times bestselling author Bertrice Small for a delicious new tale of proud, passionate sisters who live and love according to their own rules. . .The Dragon Lord's DaughtersAverilShe may be the Lord's eldest--and illegitimate--daughter, but Averil knows her dazzling beauty can buy her what she wants marriage to a great and powerful lord. But fate has other plans in the rugged form of Rhys FitzHugh. Thinking her the sole heiress, the penniless bailiff kidnaps the beauty. Now, to salvage his honor, he must marry the openly hostile Averil and accept his greatest challenge--winning her love, her loyalty, and her trust. . .MaiaAs the legitimate heiress with a hefty dowery, Maia can have any man she chooses, namely Emrys Llyn, a descendant of Lancelot and the Lady of the Lake. But strange, dangerous rumors surround the handsome Emrys. . .his name means \"immortal,\" and two of his wives have died suddenly under mysterious circumstances. Can her unwavering love prove his innocence. . .or will Maia suffer the same fate as Emrys's previous wives?JuniaAs charming as she is irrepressible, Junia is the Lord's youngest daughter. Her father has long since given up trying to control her whims. Junia is content to roam the countryside where she can be alone with the golden-haired Richard de Bohun who she meets and loves in secret. But he is the son of her father's sworn enemy, and loving him may cost more than she could ever imagine. . .Bertrice Small is the author of over thirty-two novels of historical romance. She is a New York Times bestselling author, and the recipient of numerous awards. In keeping with her profession, Bertrice Small lives in the oldest English-speaking town in the state of New York, which was founded in 1640. And because she believes in happy endings, she's been married to the same man, her hero, George, for forty years.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Fantasy",
    "Historical Fiction",
    "Historical",
    "Arthurian",
    "Paranormal Romance"
  ],
  "author": "Bertrice Small",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/849208.The_Dragon_Lord_s_Daughters"
}