{
  "title": "Cherries",
  "description": "When a soldier leaves for war, those left behind often wonder what their loved ones are experiencing. Letters home are always cheerful and vague - no sense in worrying the family. Then upon returning home, these young soldiers do not want to talk about their experiences. Family and friends allege they are now distant, changed, and not the same person they remember from several months earlier. What causes this?  Although the backdrop for this novel is the Vietnam War, \"Cherries\" exist in every war. They are the young \"Newbie\" soldiers, who are trained for war. However, most are not ready to absorb the harsh physical, mental and emotional stress of war. Once they come under fire and witness death firsthand, a life-changing transition begins. This eye-opening account offers readers an in-depth look into the everyday struggles of these young infantry soldiers. You'll feel their fear, awe, drama, and sorrow, witness the bravery and sometimes laugh at their humor.  No two war experiences are the same, but after finishing \"Cherries - A Vietnam War Novel\", readers will have a much better understanding as to why these changes occur and why our military heroes are different upon their return home. Veterans will relate!Parental Rating:This book contains content that may not be suitable for young readers 17 and under.Author's statement:While Cherries is largely a work of fiction, many of the events and anecdotes described in the novel were based on the actual experiences of the author. The places and units mentioned were real and did exist. All characters portrayed are fictional, and any resemblance to actual persons, living or dead, organizations, events, and locales, are entirely coincidental.Award:Finalist in Sixth International Literary Awards at Washington State College, 1986 (titled The Ingenuous Soldier).",
  "genres": [
    "War",
    "Audiobook",
    "Historical Fiction",
    "Military Fiction",
    "Fiction"
  ],
  "author": "John Podlaski",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/8495981-cherries"
}