{
  "title": "The Black Lizard Big Book of Black Mask Stories",
  "description": "An unstoppable anthology of crime stories culled from Black Mask magazine the legendary publication that turned a pulp phenomenon into literary mainstream.   Black Mask was the apotheosis of noir.  It was the magazine where the first hardboiled detective story, which was written by Carroll John Daly appeared.  It was the slum in which such American literary titans like Dashiell Hammett and Raymond Chandler got their start, and it was the home of stories with titles like “Murder Is Bad Luck,” “Ten Carets of Lead,” and “Drop Dead Twice.” Collected here is best of the best, the hardest of the hardboiled, and the darkest of the dark of America’s finest crime fiction. This masterpiece collection represents a high watermark of America’s underbelly. Crime writing gets no better than this.CONTENTSErle Stanley Gardner: Come and Get ItFredric Brown: Cry SilencePeter Collison: Arson PlusFredrick Nebel: Doors in the DarkLester Dent: LuckDashiell Hammett: The Maltese FalconStewart Sterling: Ten Carats of LeadWyatt Blassingame: Murder Is Bad LuckTalmadge Powell: Her Dagger Before MeCharles G. Booth: One ShotRichard Sale: The Dancing RatsKatherine Brocklebank: BraceletsThomas Walsh: Diamonds Mean DeathRoul Whitfield: Murder in the RingWalter C. Brown: The Parrot That Wouldn’t TalkMerle Constiner: Let the Dead AloneCarrol John Daly: Knights of the Open PalmWilliam Cole: Waiting for RustyRamon Decolta: Rainbow DiamondsWilliam Rollins Jr.: The Ring on the Hand of DeathTheodore A. Tinsley: Body SnatcherD wight V. Babcock: Murder on the GaywayCleve F. Adams: The KeyWilliam Campbell Gault: The Bloody BokharaBrett Halliday: A Taste for CognacDay Keene: Sauce for the GanderW.T. Ballard: A Little DifferentCharles M. Green: The Shrieking SkeletonHank Searls: Drop Dead TwiceDale Clark: The Sound of the ShotFrederick C. Davis: Flaming AngelDon M. Mankiewicz: Odds on DeathNorvell Page: Those CatriniHugh B. Cave: Smoke in Your EyesRobert Reeves: Blood, Sweat and BiersWhitman Chambers: The Black BottleMilton K. Ozaki: The Corpse The Didn’t KickRaymond Chandler: Try the GirlNorbert Davis: Don’t You Cry for MeRay Cummings: T. McGuirk Steals A DiamondSteve Fisher: Wait For MeFrank Gruber: Ask Me AnotherHorcase McCoy: Dirty WorkJulius Long: Merely MurderJohn D. MacDonald: Murder in One SyllableH.H. Stinson: Three Apes from the EastD.L. Champion Death Stops PaymentRichard Connell: The Color of HonorBruno Fischer: Middleman for MurderRichard Deming: The Man Who Choose the DevilC.M. Kornbluth: Beer-Bottle PolkaCornell Wollrich: Borrowed Crime",
  "genres": [
    "Mystery",
    "Short Stories",
    "Noir",
    "Fiction",
    "Anthologies",
    "Crime",
    "Pulp"
  ],
  "author": "Otto Penzler",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/8498076-the-black-lizard-big-book-of-black-mask-stories"
}