{
  "title": "Relationship Purgatory, for Two",
  "description": "You will embark on a journey of your relationship. For many couples, the days of frustration in communicating and understanding, can make it feel as if you are living a life through purgatory. Reading Relationship Purgatory, for Two will pull you deeper into your core being. The places that you will visit will enlighten you in understanding your own frustrations, hurt, pain and disappointments. Grasping at your own reality takes courage, strength, honesty, and a desire to stop and take a look at your life. Don't question what could have been, what has been. Finding your own focus in your relationship is wanting to know more about you, and your own boundaries, and understanding how you love, accept love, and give love.This book takes you inside complicated relationship matters, and offers insight, in a new and refreshing light. It takes the complicated, emotional dramas, all of us face at one time or another that pushes us away from the people we love the most, and allows the reader to see their own personal issues on more comprehensible terms. Whether it be affairs, abuse, divorce, drugs,or attempting to create more love, passion and desire in your own workable relationships, it’s almost certain you will with the simple understandable advice presented inside this book.\"Donna D. Toronto, Ontario\"It brings the real out in understanding what adults are under the impression of being and allows\" us adults\" to see how we became, who we are today. It shows the reader how to understand more about their own personal relationships never before disclosed with such candidness where you can actually see, how and why your relationships are the way they are.\"Terry B. London, Ontario\"An outstanding account of human relationships, documenting, intimacy issues in finer details, where solutions and preventions are made possible. I found it extremely liberating as woman.\"Meghan P. Barrie, Ontario\"",
  "genres": [],
  "author": "Karen Sala",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/8506294-relationship-purgatory-for-two"
}