{
  "title": "Event",
  "description": "In the summer of 1947, an unidentified object crashed in Roswell, New Mexico. There were no survivors. Now it's happened again. But this time, two creatures have emerged from the wreckage alive . . . One is a small being that is kind and benevolent, brimming with intense emotion and intelligence. The other, however, is an animal of remarkable strength and power. It has been brought clandestinely to our world with one sole the total extinction of all life on Earth. It is called the Destroyer of Worlds.Only the Event Group, the most secret agency in the history of the U.S. government, is prepared to wage battle against such a creature. The Event Group is a dedicated collection of the nation's most brilliant men and women of science, philosophy and the military. Their difficult solving the mysteries of the past and uncovering the hidden truths behind the myths and legends propagated throughout world history. In doing so they protect America from past mistakes---and ensure that history's errors will never be repeated.An act of war that started in New Mexico decades ago, and was covered up by another far darker organization, has been discovered by the Group at the same time as the new and seemingly identical incident threatens to wipe out the Earth's population. In the desert wastelands of the American Southwest, a battle is about to commence as the two creatures set out to fulfill their own destinies among the human race.Led by the valiant Major Jack Collins, the Event Group wages total war in the heat-soaked sands of the desert landscape. Using the benevolent creature as an ally and resource, they combine forces with the powerful might of the U.S. military and prepare themselves for an epic battle against the most dangerous threat against human existence that history has ever seen.Event tells of an epic struggle between two worlds. Author David Lynn Golemon has written a classic supernatural thriller, each page bringing human civilization closer to extinction, that proves a blistering roller-coaster ride of thrills and adventure.",
  "genres": [
    "Thriller",
    "Science Fiction",
    "Fiction",
    "Adventure",
    "Action",
    "Mystery",
    "Aliens"
  ],
  "author": "David L. Golemon",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/8503237-event"
}