{
  "title": "Vietnamerica: A Family's Journey",
  "description": "A superb new graphic memoir in which an inspired artist/storyteller reveals the road that brought his family to where they are Vietnamerica GB Tran is a young Vietnamese American artist who grew up distant from (and largely indifferent to) his family's history. Born and raised in South Carolina as a son of immigrants, he knew that his parents had fled Vietnam during the fall of Saigon. But even as they struggled to adapt to life in America, they preferred to forget the past--and to focus on their children's future. It was only in his late twenties that GB began to learn their extraordinary story. When his last surviving grandparents die within months of each other, GB visits Vietnam for the first time and begins to learn the tragic history of his family, and of the homeland they left behind.In this family saga played out in the shadow of history, GB uncovers the root of his father's remoteness and why his mother had remained in an often fractious marriage; why his grandfather had abandoned his own family to fight for the Viet Cong; why his grandmother had had an affair with a French soldier. GB learns that his parents had taken harrowing flight from Saigon during the final hours of the war not because they thought America was better but because they were afraid of what would happen if they stayed. They entered America--a foreign land they couldn't even imagine--where family connections dissolved and shared history was lost within a span of a single generation.In telling his family's story, GB finds his own place in this saga of hardship and heroism. Vietnamerica is a visually stunning portrait of survival, escape, and reinvention--and of the gift of the American immigrants' dream, passed on to their children. Vietnamerica is an unforgettable story of family revelation and reconnection--and a new graphic-memoir classic.Library Journal (Starred Review):   \"This will be called the MAUS for the Vietnam War, and for good reason. Similar clueless American-born son of immigrants confronts the legacy of family pain predating his birth. Similar a kick-in- the-gut graphic novel... he purposely fragments the plot, shifting points of view, narrative voices, and settings while the reader--as did Tran--must assemble the pieces to learn how his parents became the people he knew. Engaging, challenging, and disturbing, Tran's family memoir belongs in all public and academic libraries...\"Publishers Weekly (Starred Review ):  \"... The comic utilizes a dizzying barrage of effects to depict the characters' confusing different lettering styles, realistic action set against full-page government posters, sound effects swirling from panel to panel, action-packed panoramas breaking apart as South Vietnam collapses. The result is disturbing but also uplifting \" School Library   \"In Tran's memoir, theme, narrative, and art work together to create a deeply compelling graphic novel. Tran meditates on war, loss, and memory, but the overriding theme is the complexity, hardship, and reward of family life, a theme that finds full life in the author's multi-layered narrative.  Intricate structuring creates suspense and mystery, but its more important function is to highlight the way in which family history is layered, repetitive, nonlinear, contradictory, collaborative, and ultimately productive of both family and self-identity. His artwork-richly detailed but never overcrowded, realistic while allowing for abstraction, and expertly composed-wrings meaning out of the smallest detail. This novel could easily find a place in the classroom...\"",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Memoir",
    "Nonfiction",
    "History",
    "Biography",
    "War"
  ],
  "author": "G.B. Tran",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/8501710-vietnamerica"
}