{
  "title": "On Elegance While Sleeping",
  "description": "The first English translation of the self-proclaimed “Viscount” Emilio Lascano Tegui—a friend of Picasso and Apollinaire, and a larger-than-life eccentric in his own right—On Elegance While Sleeping is the deliciously macabre novel, part Maldoror and part Dorian Gray, that established its author’s reputation as a renegade hero of Argentine literature. It tells the story, in the form of a surreal diary, of a lonely, syphilitic French soldier, who—after too many brothels and disappointments—returns from Africa longing for a world with more elegance. He promptly falls in love with a goat, and recalls the time, after a childhood illness, when his hair fell out and grew back orange—a phenomenon his doctor attributed to the cultivation of carrots in a neighboring town. Disturbing, provocative, and mesmerizing, On Elegance While Sleeping charts the decline of a man unraveling due to his own oversensitivity—and drifting closer and closer to committing a murder.from On Elegance While Sleeping:“I was born in Bougival. The Seine flowed through our village. Fleeing from Paris. Its dark green waters dragged in the grime from that happy city. As the river crossed our town, it jammed the millwheel with the shy bodies of drowning victims hidden beneath its surface. Their trip ended with a final shove. They didn’t drain easily through the sluice gates as the water passed under the mill and so it happened, occasionally, that one of their arms would go through without them, reaching into the air in a gesture of help. I fished out a number of these bodies as a child. Like the mailman in town who was famous for bringing news of a death, I was known for discovering the most cadavers. It gave me a certain aura of fame among my comrades, and I prided myself on the distinction. I threatened the other children my age that I was going to find them too, the day they drowned.”",
  "genres": [
    "Fiction",
    "Latin American",
    "Literature",
    "20th Century",
    "Spanish Literature",
    "Book Club",
    "Novels"
  ],
  "author": "Vizconde de Lascano Tegui",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/8501532-on-elegance-while-sleeping"
}