{
  "title": "Relatively Famous",
  "description": "Relatively Famous delivers Hollywood with heart. Meet Dani McKinley: A typical teen whose world is rocked when she finds out that her father is a famous Hollywood action star. Now meet Mark Ocean: A self-serving actor with a floundering career who sees that a daughter is just what he needs to reinvent himself as a family man and get back on track. When the two decide to spend the summer together, they must not only wrangle their own love lives, but try to figure out who they really are to themselves and to each other. Now armed with credit cards, club memberships, and a new wardrobe, Dani learns that what Mark has in wealth, he sorely lacks in parenting skills. Trying to show Mark that parenting is about more than loading her up with Prada bags and taking her to movie premieres is challenging enough, but she's also got her hands full with her new friends. Oh, and the boys... Dani meets Jason, a gorgeous young personal trainer who is easy on the eyes and wildly flirtatious. But is this smug hottie the one for her? Or will she ignore her friends eye-rolling and go for the goofy but sweet surfer? While juggling her own complicated love life, Dani tries to set her father up with someone less likely to appear on a VH1 reality show, and someone more... well, normal. And age-appropriate. And dressed in anything but a thong bikini. But whether Mark is able to heal old wounds and move forward with anything more than a meaningless fling remains to be seen. Can Dani fit in with this new, fast-moving California crowd without losing herself? With the world at her fingertips and hot boys now after her, staying grounded gets tough. And can Mark drop his egocentric approach to life and learn to appreciate how truly wonderful his daughter is? As driven as he is to get that A-list acting role, he's willing to do whatever it takes to get there, even if it means using his daughter. Or is he...? Mark and Dani's relationship hits a few highs, but the question becomes whether the lows are too much.",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Chick Lit",
    "Fiction",
    "Teen"
  ],
  "author": "Jessica Park",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/8507200-relatively-famous"
}