{
  "title": "Patterns in Prehistory: Humankind's First Three Million Years, 5th Edition",
  "description": "Who are we? How did the world become what it is today? What paths did humanity traverse along the way?Patterns in Prehistory , Fifth Edition, is a comprehensive and engaging survey of humanity's past three million years. It brings together theories and archaeological examples to pose questions about who we are and the means by which humanity evolved into what it is today.Ideal for introductory courses in world prehistory and origins of complex societies, Patterns in Prehistory , Fifth Edition, offers a unified and thematic approach to the four great transformations--or patterns--that characterize humanity's the origins and evolution of culture; the origins of modern humans and human behaviors; the origins of agriculture; and the origins of complex societies, civilizations, and pre-industrial states. Integrating theoretical approaches with archaeological data from the Middle East, Mesoamerica, North and South America, Egypt, China, the Indus Valley, and temperate Europe, Patterns in Prehistory , Fifth Edition, reveals how archaeologists decipher the past. It demonstrates how theory and method are combined to derive interpretations and also considers how interpretations evolve as a result of accumulating data, technological advances in recording and analyzing data sets, and newer theoretical perspectives.This new edition of Patterns in Prehistory * Fresh insights with the addition of coauthor Deborah Olszewski, who has carefully reviewed and revamped the material with an eye toward making the text clearly understandable to today's students* Updated discussions throughout, including expanded information on post-processual archaeology, current methodologies, and technological advances* Approximately 250 illustrations and maps, more than half of which are new to this edition* Groundbreaking research on new discoveries of hominin fossils, genetic research, prehistoric migrations, the peopling of the Americas, and theories of the origins of agriculture and the origins of complex societies* Timelines for all relevant chapters as well as an overarching timeline for the entire book to help students place events in context* Extensively updated chapter bibliographies and chapter endnotes",
  "genres": [
    "History",
    "Anthropology",
    "Archaeology",
    "Nonfiction",
    "Prehistory",
    "Science",
    "Textbooks"
  ],
  "author": "Robert J. Wenke",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/85046.Patterns_in_Prehistory"
}