{
  "title": "God's Secretaries: The Making of the King James Bible",
  "description": "Complex currents flowed across Jacobean England. This was the England of Shakespeare, Jonson & Bacon; of the Gunpowder Plot; England's worst plague outbreak; Arcadian landscapes; murderous, toxic slums; &, above all, of sometimes overwhelming religious passion. Jacobean England was both more godly & less godly than it had ever been. The entire culture was drawn taut between the polarities. This was the world that created the King James Bible. It's the greatest work of English prose ever written. It's no coincidence that the translation was made at the moment Englishness & the English language had come into its 1st passionate maturity. Boisterous, elegant, subtle, majestic, finely nuanced, sonorous & musical, the English of Jacobean England has a more encompassing idea of its own reach & scope than any before or since. It's a form of the language that drips with potency & sensitivity. The age, with all its conflicts, explains the book. The sponsor & guide of the whole Bible project was the King himself, the brilliant, ugly & profoundly peace-loving James VI of Scotland & 1st of England. Trained almost from birth to manage the rivalries of political factions at home, James saw in England the chance for a sort of irenic Eden over which the new translation of the Bible was to preside. It was to be a Bible for all, & as God's lieutenant on earth, he would use it to unify his kingdom. The dream of Jacobean peace, guaranteed by an elision of royal power & divine glory, lies behind a Bible of extraordinary grace & lasting literary power. About 50 scholars from Cambridge, Oxford & London did the work, drawing on many previous versions, & created a text which, for all its failings, is unequaled. That's the central question of this book: How did this group of near-anonymous divines, muddled, drunk, self-serving, ambitious, ruthless, obsequious, pedantic & flawed as they were, manage to bring off this translation? How did such ordinary men make such extraordinary prose? God's Secretaries gives a dramatic account of the accession & ambition of the 1st Stuart king; of the scholars who labored for seven years to create his Bible; of the influences that shaped their work & of the beliefs that colored their world, immersing us in an age whose greatest monument isn't a painting or a building, but a book.",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Christianity",
    "Church History",
    "Language",
    "Theology"
  ],
  "author": "Adam Nicolson",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/850614.God_s_Secretaries"
}