{
  "title": "Dreams from My Father: A Story of Race and Inheritance; The Audacity of Hope: Thoughts on Reclaiming the American Dream",
  "description": "Dreams From My FatherA Story of Race and Inheritance*Winner of the 2006 Grammy Award for Best Spoken Word Album*In this lyrical, unsentimental, and compelling memoir, the son of a black African father and a white American mother searches for a workable meaning to his life as a black American. It begins in New York, where Barack Obama learns that his father–a figure he knows more as a myth than as a man–has been killed in a car accident. This sudden death inspires an emotional odyssey–first to a small town in Kansas, from which he retraces the migration of his mother’s family to Hawaii, and then to Kenya, where he meets the African side of his family, confronts the bitter truth of his father’s life, and at last reconciles his divided inheritance. Bonus Feature includes his 2004 Democratic Convention Keynote Address. The Audacity of HopeThoughts on Reclaiming the American DreamIn July 2004, Barack Obama electrified the Democratic National Convention with an address that spoke to Americans across the political spectrum. Now, in The Audacity of Hope, Senator Obama calls for a different brand of politics–a politics for those weary of bitter partisanship and alienated by the “endless clash of armies” we see in Congress and on the campaign trail; a politics rooted in the faith, inclusiveness, and nobility of spirit at the heart of “our improbable experiment in democracy.” He also writes, with surprising intimacy and self-deprecating humor, about settling in as a senator, seeking to balance the demands of public service and family life, and his own deepening religious commitment.At the heart of this audiobook is Senator Obama’s vision of how we can move beyond our divisions to tackle concrete problems. Underlying his stories about family, friends, members of the Senate, and even the president is a vigorous search for connection: the foundation for a radically hopeful political consensus. A senator and a lawyer, a professor and a father, a Christian and a skeptic, and above all a student of history and human nature, Senator Obama has written a book of transforming power.",
  "genres": [
    "Biography",
    "Audiobook",
    "History",
    "Nonfiction",
    "Politics",
    "Memoir"
  ],
  "author": "Barack Obama",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/13134033-dreams-from-my-father"
}