{
  "title": "New York Stories",
  "description": "This dazzling hardcover collects an irresistible selection of classic tales of New York City by James Baldwin, Truman Capote, Shirley Jackson, Jay McInerney, Edith Wharton, and many othersWriters have always been enthralled and inspired by New York City, and their vibrant and varied stories provide a kaleidoscopic vision of the city’s high life, low life, nightlife, and everything in between. From the wisecracking Broadway guys and dolls of Damon Runyon to the glittering ballrooms of Edith Wharton, from the jazz-soaked nightspots of Jack Kerouac and James Baldwin to the starry-eyed tourists in John Cheever and Shirley Jackson, to the ambitious immigrants conjured by Edwidge Danticat and Junot Diaz—this is New York in all its grittiness and glamour. Here is the hectic, dazzling chaos of Times Square and the elegant calm of galleries in the Met; we meet Yiddish matchmakers in the Bronx, Haitian nannies in Central Park, starving artists, and hedonistic yuppies—a host of vivid characters nursing their dreams in the tiny apartments, the lonely cafés, and the bustling streets of the city that never sleeps. • “New York Night Club\" by Jack Kerouac• “Pillar of Salt” by Shirley Jackson• “O City of Broken Dreams” by John Cheever• “Master Misery\" by Truman Capote• “Paul’s Case\" by Willa Cather• “A Cup of Water” by Edith Wharton• “Sonny’s Blues” by James Baldwin• “It’s Six A.M. Do You Know Where You Are?” by Jay McInerney• “New York Day Women\" by Edwidge Danticat• “Negocios” by Junot Díazand more Everyman's Library pursues the highest production standards, printing on acid-free cream-colored paper, with full-cloth cases with two-color foil stamping, decorative endpapers, silk ribbon markers, European-style half-round spines, and a full-color illustrated jacket.",
  "genres": [
    "Short Stories",
    "Fiction",
    "New York",
    "Anthologies",
    "Classics",
    "Travel",
    "English Literature"
  ],
  "author": "Diana Secker Tesdell",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/8505380-new-york-stories"
}