{
  "title": "Japanese Destroyer Captain: Pearl Harbor, Guadalcanal, Midway - The Great Naval Battles As Seen Through Japanese Eyes",
  "description": "The Naval Institute Press is pleased to make available for the first time this cloth edition of a now-classic war memoir that was a best seller in both Japan and the United States during the 1960s. Originally published as a paperback in 1961, it has long been treasured by World War II buffs and professional historians for its insights into the Japanese side of the surface war in the Pacific. The book has been credited with correcting errors in U.S. accounts of various battles and with revealing details of high-level Imperial Japanese Navy strategy meetings. The author, Captain Tameichi Hara, was a survivor of more than one hundred sorties against the Allies and was known throughout Japan as the Unsinkable Captain. Called the workhorses of the navy, Japanese destroyers shouldered the heaviest burden of the surface war and took part in scores of intense sea battles, many of which Captain Hara describes here. In the early days of the war victories were common, but by 1943, the lack of proper maintenance of the destroyers and sufficient supplies, along with Allied development of scientific equipment and superior aircraft, took its toll. On April 7, 1945, during the Japanese navy s last sortie, Captain Hara managed to survive the sinking of his own ship only to witness the demise of the famed Japanese battleship Yamato off Okinawa. \tA hero to his countrymen, Captain Hara exemplified the best in Japanese surface commanders: highly skilled (he wrote the manual on torpedo warfare), hard driving, and aggressive. Moreover, he maintained a code of honor worthy of his samurai grandfather, and, as readers of this book have come to appreciate, he was as free with praise for American courage and resourcefulness as he was critical of himself and his senior commanders. \tThe book s popularity over the past forty-six years testifies to the author s success at writing an objective account of what happened that provides not only a fascinating eyewitness record of the war, but also an honest and dispassionate assessment of Japan s high command. Captain Hara s sage advice on leadership is as applicable today as it was when written. For readers new to this book and for those who have read and re-read their paperback editions until they have fallen apart, this new hardcover edition assures them a permanent source of reference and enjoyment.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Military History",
    "Japan",
    "War",
    "Naval History"
  ],
  "author": "Tameichi Hara",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/851017.Japanese_Destroyer_Captain"
}