{
  "title": "Speed Dating with the Dead",
  "description": "A paranormal conference at the most haunted hotel in the Blue Ridge Mountains goes haywire when ghost hunters accidentally stir up demons.SPEED DATING WITH THE DEADWhen Digger Wilson brings his paranormal team Spirit Seekers International to the White Horse Inn, he is skeptical that his dead wife will keep her half of the bargain. He doesn’t believe in ghosts, and just before she died, she promised to meet him there.But when one of the conference guests channels a mysterious presence and an Ouija board spells out a pet phrase known only to Digger and his wife, his convictions are challenged.And when guests start to disappear, Digger and his daughter Kendra must face the circle of demons that view the hotel as their personal playground. Because soon the inn will be closing for good, angels can’t be trusted, and demons don’t like to play alone . . .----------------------Scott Nicholson is the author of bestselling thriller, mystery, and supernatural novels THE RED CHURCH, DRUMMER BOY, DISINTEGRATION, THE SKULL RING, AS I DIE LYING, and BURIAL TO FOLLOW, as well as the story collections THE FIRST, ASHES, GATEWAY DRUG, and FLOWERS. You can visit him at Author Central or www.hauntedcomputer.comDRM-free and professionally formatted by Dellaster Design.--------------\"Scott Nicholson is the kind of writer who always thrills and always entertains.\" --Jonathan Maberry, Patient Zero\"Scott Nicholson understands that the best horror novels achieve primal fear through a combination of sustained atmosphere, richly drawn characters, and believable if uncanny evils that draw unholy power from everyday lives.\" --Christopher Ransom, author of the international bestseller, The Birthing House\"A master of atmospheric suspense.\" --Eric Wilson, NY Times bestselling novelist\"Scott Nicholson knows the territory. Follow him at your own risk.\"--Stewart O'Nan, Boston Noir\"Like Stephen King, he knows how to summon serious scares.\"--Bentley Little, His Father's Son\"Keep both hands on your pants, because Nicholson is about to scare them off.\"-- J.A. Konrath / Jack KilbornAbout the AuthorScott Nicholson isthe bestselling author of 14 novels, seven story collections, six screenplays, and four comics series. His first novel THE RED CHURCH was a Stoker Award finalist.",
  "genres": [
    "Horror",
    "Paranormal",
    "Ghosts",
    "Mystery",
    "Thriller",
    "Fiction",
    "Fantasy"
  ],
  "author": "Scott Nicholson",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/8510414-speed-dating-with-the-dead"
}