{
  "title": "Works by Robin Hobb",
  "description": "This is nonfiction commentary. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Chapters: Novels by Robin Hobb, Short Stories by Robin Hobb, the Dragon Keeper, Forest Mage, Shaman's Crossing, Assassin's Apprentice, Ship of Magic, Assassin's Quest, Royal Assassin, Renegade's Magic, the Mad Ship, the Golden Fool, Fool's Fate, Fool's Errand, Ship of Destiny, Homecoming. Source: Wikipedia. Free updates online. Not illustrated. Excerpt: Dragon Keeper is a novel by Robin Hobb, the first in the The Rain Wild Chronicles. It is written in third-person narrative from the viewpoint of several of the key characters. The narrative joins these separate threads together as a party of malformed dragons, their human keepers and other supporters set out on a quest for the legendary Elderling city of Kelsingra. The book opens as the sea serpents are in the final stage of their journey to cocoon and become dragons. The serpent Sisarqua recalls how many serpents died along the way, and many more would die on the beach or in their cocoons. She struggles to build her cocoon but is given aid by the dragon Tintaglia and the human attendants and she fades unconscious as the metamorphosis begins. We then follow the riverman Leftrin, Captain of the barge Tarman, as he finds a wizardwood log washed away from the beach where the dragons made their cocoons. The dragon inside is dead and he initially plans on selling the log for a fortune, before deciding to keep it and use it himself on Tarman. We also meet Thymara, an 11 year old girl from the Trehaug, in the Rain Wilds. She has been born with claws instead of fingernails as a result of the Rain Wilds. Rather than being left out to die (\"exposed\") as custom dictated, her father rescues her and decided to keep her, contradicting her mother and socially shaming the family. She lives a life where she is barely acknowl...More: http: //booksllc.net/?id=2346515",
  "genres": [],
  "author": "Books LLC",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/8510645-works-by-robin-hobb"
}