{
  "title": "The Immortal Game: A History of Chess, or How 32 Carved Pieces on a Board Illuminated Our Understanding of War, Art, Science and the Human Brain",
  "description": "Why has one game, alone among the thousands of games invented and played throughout human history, not only survived but thrived within every culture it has touched? What is it about its thirty-two figurative pieces, moving about its sixty-four black and white squares according to very simple rules, that has captivated people for nearly 1,500 years? Why has it driven some of its greatest players into paranoia and madness, and yet is hailed as a remarkably powerful intellectual tool?Nearly everyone has played chess at some point in their lives. Its rules and pieces have served as a metaphor for society, influencing military strategy, mathematics, artificial intelligence, and literature and the arts. It has been condemned as the devil’s game by popes, rabbis, and imams, and lauded as a guide to proper living by other popes, rabbis, and imams. Marcel Duchamp was so absorbed in the game that he ignored his wife on their honeymoon. Caliph Muhammad al-Amin lost his throne (and his head) trying to checkmate a courtier. Ben Franklin used the game as a cover for secret diplomacy.In his wide-ranging and ever-fascinating examination of chess, David Shenk gleefully unearths the hidden history of a game that seems so simple yet contains infinity. From its invention somewhere in India around 500 A.D., to its enthusiastic adoption by the Persians and its spread by Islamic warriors, to its remarkable use as a moral guide in the Middle Ages and its political utility in the Enlightenment, to its crucial importance in the birth of cognitive science and its key role in the aesthetic of modernism in twentieth-century art, to its twenty-first-century importance in the development of artificial intelligence and use as a teaching tool in inner-city America, chess has been a remarkably omnipresent factor in the development of civilization.",
  "genres": [
    "Chess",
    "History",
    "Nonfiction",
    "Games",
    "Audiobook",
    "Sports",
    "Science"
  ],
  "author": "David Shenk",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/85083.The_Immortal_Game"
}