{
  "title": "Every Secret Thing",
  "description": "Kate Murray is deeply troubled. In front of her lies a dead man, a stranger who only minutes before had spoken to her about a mystery, a long-forgotten murder and, most worryingly, her grandmother. His story was old, he had told her, but still deserving of justice. Soon Kate is caught up in a dangerous whirlwind of events that takes her back into her grandmother s mysterious war-time past and across the Atlantic as she tries to retrace the dead man s footsteps. Finding out the truth is not so simple, however, as only a few people are still alive who know the story and Kate soon realizes that her questions are putting their lives in danger. Stalked by an unknown and sinister enemy, she must use her tough journalistic instinct to find the answers from the past in order to have a future.REVIEWS \"An entertaining romp through continents and decades with a well-researched background and believable characters. Bookbag thinks that it would make a good holiday read.\"The Bookbag\"I LOVED this book. It was one of those I didn't want to end... I highly recommend this novel to anyone who loves mysteries, stories set in WWII or just a damn good read.\"Book Reviews from Lady Tess\"While this mystery was fast paced and suspenseful, the strength of the plot for me was the lovely back-story that unfolded of two ordinary people making an extraordinary sacrifice as part of their duty during the war... A bit of a departure for me as I don't usually read many contemporaries, but a treat if you are looking for something unique from Susanna Kearsley.\"Books, Belles, and Beaux\"I don t usually read spy novels, but I thought that this one was excellent, with just the right amount of suspense thrown in.\"A Girl Walks Into A Bookstore\"",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Suspense",
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "Emma Cole",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/8509971-every-secret-thing"
}