{
  "title": "Mumbai Noir",
  "description": "\"Tyrewala’s insightful introduction greatly enhances the reading experience, and the glossary helps, too . . . The collection is astonishingly diverse . . . Tyrewala’s anthology [offers] a sampling of brand-new authors and [a] superb introduction. It might provide a fictional contrast to Katherine Boo’s Behind the Beautiful Forevers.\"--Library Journal (Starred review)\"Most of the 14 short stories in Akashic’s workmanlike Mumbai volume draw inspiration from the criminal networks and the sordid underbelly the city is infamous for . . . Armchair travelers will find plenty of amusement in touring the seedier parts of this island city in perfect safety.\"--\nPublishers Weekly\n“The fifteen contributors to Mumbai Noir . . . provide a cool composite narrative of a unique human-intensive metropolitan system, whose magnitude, complexity, diversity, and pace can hardly be captured in writing or, for that matter, any other medium. [Mumbai Noir is] rich and diverse in character and characterization.”--\nRain Taxi Review of Books\nFeaturing brand-new stories by: Annie Zaidi, R. Raj Rao, Abbas Tyrewala, Avtar Singh, Ahmed Bunglowala, Smita Harish Jain, Sonia Faleiro, Altaf Tyrewala, Namita Devidayal, Jerry Pinto, Kalpish Ratna, Riaz Mulla, Paromita Vohra, and Devashish Makhija.Bombay’s communal riots of 1992--in which Hindus were alleged to be the primary perpetrators—were followed by retaliatory bomb blasts in 1993, masterminded by the Muslim-dominated underworld. Over a thousand citizens lost their lives in these internecine bouts of violence and thousands more became refugees in their own city. In a matter of months, Bombay ceased to be the cosmopolitan, wholesome, and middle-class bastion it had been for decades. When the city was renamed Mumbai in 1995, it merely formalized the widespread perception that the Bombay everyone knew and remembered had been lost forever.Today Mumbai is like any other Asian city on the rise, with gigantic construction cranes winding atop upcoming skyscrapers and malls . . . Right-wing violence, failing electricity and water supplies, overcrowding, and the ever-looming threat of terrorist attacks—these are some of the gruesome ground realities that Mumbai’s middle and working classes must deal with every day, while the city’s super-rich . . . zip from roof to roof in their private choppers. Abandoned by its wealthy, mistreated by its politicians and administrators, Mumbai continues to thrive primarily because of the helpless resilience of its hardworking, upright citizens.The stories in Mumbai Noir depict the many ways in which the city’s ever-present shadowy aspects often force themselves onto the lives of ordinary people. . . . What emerges is the sense of a city that, despite its new name and triumphant tryst with capitalism, is yet to heal from the wounds of the early '90s, and from all the subsequent acts of havoc wreaked within its precincts by both local and outside forces.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Noir",
    "India",
    "Crime",
    "Mystery",
    "Anthologies"
  ],
  "author": "Altaf Tyrewala",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/13135167-mumbai-noir"
}