{
  "title": "Saraswati Park",
  "description": "A tremendous first novel from an exciting young author. Feted for its electric chaos, the city of Bombay also accommodates pockets of calm. In one such enclave, Mohan, a middle-aged letter writer - the last of a dying profession - sits under a banyan tree in Fort, furnishing missives for village migrants, disenchanted lovers, and when pickings are slim, filling in money order forms. But Mohan's true passion is collecting second-hand books; he's particularly attached to novels with marginal annotations. So when the pavement booksellers of Fort are summarily evicted, Mohan's life starts to lose some of its animating lustre. At this tenuous moment Mohan - and his wife, Lakshmi - are joined in Saraswati Park, a suburban housing colony, by their nephew, Ashish, a diffident, sexually uncertain 19-year-old who has to repeat his final year in college. As Saraswati Park unfolds, the lives of each of the three characters are thrown into sharp relief by the comical frustrations of family annoying relatives, unspoken yearnings and unheard grievances. When Lakshmi loses her only brother, she leaves Bombay for a relative's home to mourn not only the death of a sibling but also the vital force of her marriage. Ashish, meanwhile, embarks on an affair with a much richer boy in his college; it ends abruptly. Not long afterwards, he succumbs to the overtures of his English tutor, Narayan. As Mohan scribbles away in the sort of books he secretly hopes to write one day, he worries about whether his wife will return, what will become of Ashish's life, and if he himself will ever find his own voice to write from the margins about the centre of which he will never be a part. Elliptical and enigmatic, but beautifully rendered and wonderfully involving, Saraswati Park is a book about love and loss and the noise in our heads - and how, in spite of everything, life, both lived and imagined, continues.",
  "genres": [
    "Fiction",
    "India",
    "Indian Literature",
    "LGBT",
    "Literary Fiction",
    "Family",
    "Literature"
  ],
  "author": "Anjali Joseph",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/8517800-saraswati-park"
}