{
  "title": "The Laments",
  "description": "Meet the Laments—the affably dysfunctional globetrotting family at the center of George Hagen’s exuberant debut novel.Howard is an engineer who dreams of irrigating the Sahara and lives by the motto “Laments move!” His wife Julia is a fiery spirit who must balance her husband’s oddly peripatetic nature with unexpected aspirations of her own. And Will is the “waif with a paper-thin heart” who is given to Howard and Julia in return for their own child who has been lost in a bizarre maternity ward mishap. As Will makes his way from infancy to manhood in a family that careens from continent to continent, one wonders where the Laments will ever belong.In Bahrain, Howard takes a job with an oil company and young Will makes his first friend. But in short order he is wrenched off to another land, his mother’s complicated friendship with the American siren Trixie Howitzer causing the family to bolt. In Northern Rhodesia, during its last days as a white colony, the twin enfants terribles Marcus and Julius are born, and Will falls for the gardener’s daughter, a girl so vain that she admires her image in the lid of a biscuit tin. But soon the family’s life is upturned again, thie time by their neighbor Major Buck Quinn, with his suburban tirades against black self-rule. Envisioning a more civilized life on “the sceptered isle,” the Laments board an ocean liner bound for England. Alas, poor Will is greeted by the tribal ferocity of his schoolmates and a society fixated on the Blitz. No sooner has he succumbed to British pop culture in the guise of mop-top Sally Byrd and her stacks of 45s, than the Laments uproot themselves once again, and it’s off to New Jersey, where life deals crisis and opportunity in equal measure.Undeniably eccentric, the Laments are also universal. Every family moves on in life. Children grow up, things are left behind; there is always something to lament. Through the Lament’s restlessness, responses to adversity, and especially their unwieldy love for one another, George Hagen gives us a portrait of every family that is funny, tragic, and improbably true.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Book Club",
    "Novels",
    "Literary Fiction",
    "Roman",
    "Contemporary",
    "Africa"
  ],
  "author": "George Hagen",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/13135518-the-laments"
}