{
  "title": "Pahkasika: Kymmenen kirjainta joihin voit luottaa",
  "description": "Lakkiaispäivänä 1975 ilmestyi ensimmäinen Pahkasika, kymmenen kirjainta joihin aina voi luottaa. Tommi Liimatan kokoama maukas keitos lehden koko historian ajalta.Vakava Pahkasika Jokaisella Pahkasian lukijalla on muistoissaan omanlaisensa Pahkis. Monelle se on hervottomia sanaleikkejä, absurdeja maailmankuvia, tahallisia väärinymmärryksiä, infantiilia hevosenleikkiä typerillä asioilla tai vastuutonta naureskelua kaikelle mikä liikkuu. Tämän kepeän valtavirran ohesta löytyy myös toisenlainen Pahkasika. Huumorilehden 25 vuoteen ja lähes 5 000 julkaistuun sivuun mahtuu mukaan myös tummempia, synkempiä ja raskaampia juonteita. Monien Pahkasika-juttujen takaa löytyy jopa asia, merkittävä epäkohta tai vääryys, jota käsitellään huumorin keinoin. Pahkasika on säännöllisesti nostanut esiin myös aiheita, joihin huumorin yhdistäminen saattaa äkkipäätään ajatellen tuntua vaikealta – jopa mahdottomalta. Iloisesti pirskahtelevien artikkeleiden ja sarjakuvien seasta löytyy materiaalia, jota lukiessa nauru tuntuu juuttuvan kurkkuun. Juttu on kyllä hauska, mutta samalla jotenkin rankka, jopa karmaiseva. Pahkasika on siis myös vakava. Tämän kokoelman toimittanut Tommi Liimatta on sisällyttänyt kirjaan myös laajan otannan tätä vakavampaa Pahkasikaa. Siitä erikoiskiitos. Liimatta antaa omassa Pahkasika-kattauksessaan rohkeasti tilaa kaikkein tyypillisimmästä ja totutuimmasta Pahkis-materiaalista poikkeavalle huumoritarjonnalle. Hän on ansiokkaasti löytänyt pakettiinsa tukevan valikoiman Pahkasian vähemmän tunnettua aineistoa. Esimerkiksi sarjakuvista ne kaikkein populaareimmat hän esittelee sivun tai parin lyhyin esimerkein ja keskittyy sarjoihin, jotka ovat tuntemattomampia Pahkasian keskivertolukijalle. Kaikkien Pahkasian ystävien ulkoa osaamien klassikoiden varjoon aikanaan jääneistä pikku helmistä syntyykin iloinen kronikka Pahkiksen neljännesvuosisadasta. Kaikenkaikkiaan mielenkiintoinen paketti. Pitänee joskus lukaista. Markku ParetskoiPahkasian päätoimittaja vuosina 1975–2000",
  "genres": [
    "Humor"
  ],
  "author": "Tommi Liimatta",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/8515336-pahkasika"
}