{
  "title": "DREAMBOAT",
  "description": "Praise for THE FRISKY CHRONICLES\"Sometimes salacious, sometimes silly, sometimes poignantly tender, and always entertaining, Frisky doesn't disappoint as she puts her adventures on virtual paper for all the world to read. For anyone who wonders where the wild things are, Frisky tells it like it is in the world of online dating.\"Anne Kelleher, author of A Once and Future Love and the Shadowlands trilogy.\"Frisky Dimplebuns will make you laugh and cry – sometimes both at the same time! The Chronicles are funny, insightful and universal. I couldn't read them fast enough. If you decide to follow Frisky on her sizzling adventures, you're in for a great ride.\"Prill Boyle, author of Defying Gravity and host of TV’s AgelessWith nods to Chelsea Handler and \"Eat Pray Love,\" as well as a dash of David Sedaris, this 6,000+ word first installment of THE FRISKY CHRONICLES is a slightly wicked up-to-the-minute romp about successful romance in the electronic age. As a bonus, Frisky shares her tips on the way to attract the lover you are seeking.An equestrienne in her youth, Frisky is now the lead dancer with the Bolshoi Ballet. Despite the demands from the Metropolitan Opera, she has not yet agreed to reprise her role as Carmen for next year's season. But she might! As they say, \"l'amour est un oiseau rebelle, que nul ne peut apprivoiser.\"After last year's ascent of Everest, and her loss of the Hope Diamond pendant at the summit, she has vowed to avoid mountain climbing for the next decade. Tall and slim (taller and slimmer all the time, and younger, too) she has thought of modeling, but is waiting until she is old enough.Frisky is very pleased to have made her fortune writing. Look for her continuing adventures in The Frisky Chronicles, including episodes like Stick Shift, Don Juan de Connecticut, and The Tilt of His Kilt.And never doubt that she will find love in the end. Just like you.",
  "genres": [],
  "author": "Frisky Dimplebuns",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/13135431-dreamboat"
}