{
  "title": "One Day in the Life of Ivan Denisovich",
  "description": "Bringing into harsh focus the daily struggle for existence in a Soviet gulag, Aleksandr Solzhenitsyn's One Day in the Life of Ivan Denisovich is translated by Ralph Parker in Penguin Modern Classics.This brutal, shattering glimpse of the fate of millions of Russians under Stalin shook Russia and shocked the world when it first appeared.Discover the importance of a piece of bread or an extra bowl of soup, the incredible luxury of a book, the ingenious possibilities of a nail, a piece of string or a single match in a world where survival is all. Here safety, warmth and food are the first objectives. Reading it, you enter a world of incarceration, brutality, hard manual labour and freezing cold - and participate in the struggle of men to survive both the terrible rigours of nature and the inhumanity of the system that defines their conditions of life.Though twice-decorated for his service at the front during the Second World War, Aleksandr Isayevich Solzhenitsyn (1918-2008) was arrested in 1945 for making derogatory remarks about Stalin, and sent to a series of brutal Soviet labour camps in the Arctic Circle, where he remained for eight years. Released after Stalin's death, he worked as a teacher, publishing his novel One Day in the Life of Ivan Denisovich with the approval of Nikita Khrushchev in 1962, to huge success. His 1967 novel Cancer Ward, as well as his magnum opus The Gulag Archipelago, were not as well-received by Soviet authorities, and not long after being awarded the Nobel Prize for literature in 1970, Solzhenitsyn was deported from the USSR. In 1994, after twenty years in exile, Solzhenitsyn made his long-awaited return to Russia.If you enjoyed One Day in the Life of Ivan Denisovich, you might also like Yevgeny Zamyatin's We, available in Penguin Classics.'It is a blow struck for human freedom all over the world ... and it is gloriously readable'Sunday Times",
  "genres": [
    "Fiction",
    "Classics",
    "Russia",
    "Historical Fiction",
    "Russian Literature",
    "Literature",
    "Novels"
  ],
  "author": "Aleksandr Solzhenitsyn",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/852538.One_Day_in_the_Life_of_Ivan_Denisovich"
}