{
  "title": "Spiritual Rhythm: Being with Jesus Every Season of Your Soul",
  "description": "\"Abide in me,\" Jesus tells us, \"and you will bear much fruit.\" Yet too often we forget that fruit needs different seasons in order to grow. We measure our spiritual maturity by how much we do rather than how we are responding to our current spiritual season. In Spiritual Rhythm , Mark Buchanan replaces our spirituality of busyness with a spirituality of abiding. Sometimes we are busy, sometimes still, sometimes pushing with all we've got, sometimes waiting. This model of the spiritual life measures and produces growth by Are we living in rhythm with the season we are in? With the lyrical writing for which he is known, Mark invites us to respond to every season of the heart, whether we are flourishing and fruitful, stark and dismal, or cool and windy. In comparing spiritual rhythms to the seasons of the year, he shows us what to expect from each season and how embracing the seasons causes our spiritual lives to prosper. As he draws on the powerful words of Scripture, Mark explores what activities are suitable or necessary in each season--and what activities are useless or even harmful in that season. Throughout the book, Mark weaves together stories of young and old, men and women, families, couples, and individuals who are in or have been through a particular season of the heart. As Mark writes, \"I pray that this book meets you in whatever season you're in, and prepares you for whatever seasons await. I pray that it helps you find your voice, your stride, your rhythm, in season or out. Mostly, I pray that you, with or without my help, find Christ wherever you are. And that, even more, you discover that wherever you are, he's found you.\"",
  "genres": [
    "Nonfiction",
    "Christian Living",
    "Christian",
    "Faith",
    "Christianity",
    "Spirituality",
    "Religion"
  ],
  "author": "Mark Buchanan",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/8524369-spiritual-rhythm"
}