{
  "title": "Wait Till Next Year: A Memoir",
  "description": "Wait Till Next Year is the story of a young girl growing up in the suburbs of New York in the 1950s, when owning a single-family home on a tree-lined street meant the realization of dreams, when everyone knew everyone else on the block, and the children gathered in the streets to play from sunup to sundown. The neighborhood was equally divided among Dodger, Giant, and Yankee fans, and the corner stores were the scenes of fierce and affectionate rivalries.We meet the people who influenced Goodwin's early her father, who emerged from a traumatic childhood without a trace of self-pity or rancor and who taught his daughter early on that she should say whatever she thought and should bring her voice into any conversation at any time; her mother, whose heart problems left her with the arteries of a seventy-year-old when she was only in her thirties and whose love of books allowed her to break the boundaries of the narrow world to which she was confined by her chronic illness; her two older sisters; her friends on the block; the local storekeepers; her school friends and teachers.This is also the story of a girlhood in which the great religious festivals of the Catholic church and the seasonal imperatives of baseball combined to produce a passionate love of history, ceremony, and ritual. It is the story of growing up in what seemed on the surface a more innocent era until one recalls the terror of polio, the paranoia of McCarthyism reflected even in the children's games, the obsession with A-bomb drills in school, and the ugly face of racial prejudice. It was a time whose relative tranquillity contained the seeds of the turbulent decade of the sixties.",
  "genres": [
    "Memoir",
    "Baseball",
    "Nonfiction",
    "Sports",
    "History",
    "Biography",
    "Book Club"
  ],
  "author": "Doris Kearns Goodwin",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/852323.Wait_Till_Next_Year"
}