{
  "title": "The Beautiful Miscellaneous",
  "description": "Nathan Nelson is the average son of a genius. His father, a physicist of small renown, has prodded him toward greatness from an early age—enrolling him in whiz kid summer camps, taking him to the icy tundra of Canada to track a solar eclipse, and teaching him college algebra. But despite Samuel Nelson’s efforts, Nathan remains ordinary.Then, in the summer of 1987, everything changes. While visiting his small-town grandfather in Michigan, Nathan is involved in a terrible accident. After a brief clinical death—which he later recalls as a lackluster affair lasting less than the length of a Top 40 pop song—he falls into a coma. When he awakens, Nathan finds that everyday life is radically different. His perceptions of sight, sound, and memory have been irrevocably changed. The doctors and his parents fear permanent brain damage. But the truth of his condition is more unexpected and leads to a renewed chance for Nathan to find his place in the world.Thinking that his son’s altered brain is worthy of serious inquiry, Samuel arranges for Nathan to attend the Brook-Mills Institute, a Midwestern research center where savants, prodigies, and neurological misfits are studied and their specialties applied. Immersed in this strange atmosphere—where an autistic boy can tell you what day Christmas falls on in 3026 but can’t tie his shoelaces, where a medical intuitive can diagnose cancer during a long-distance phone call with a patient—Nathan begins to unravel the mysteries of his new mind. He also tries to make peace with the crushing weight of his father’s expectations.The Beautiful Miscellaneous is an extraordinary follow-up to Dominic Smith’s critically acclaimed debut, The Mercury Visions of Louis Daguerre. This dazzling new novel explores the fault lines that can cause a family to drift apart and the unexpected events that can pull them back together.",
  "genres": [
    "Fiction",
    "Coming Of Age",
    "Young Adult",
    "21st Century",
    "Novels",
    "Book Club",
    "Audiobook"
  ],
  "author": "Dominic Smith",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/852311.The_Beautiful_Miscellaneous"
}