{
  "title": "The Summer Before",
  "description": "Before there was the Baby-Sitters Club, there were four girls named Kristy Thomas, Mary Anne Spier, Claudia Kishi, and Stacey McGill. As they start the summer before seventh grade (also before they start the BSC), each of them is on the cusp of a big change. Kristy is still hung up on hoping that her father will return to her family. Mary Anne has to prove to her father that she's no longer a little girl who needs hundreds of rules. Claudia is navigating her first major crush on a boy. And Stacey is leaving her entire New York City life behind... ...in order to find new friends in Stoneybrook, Connecticut. The Summer Before . . . is a sweet, moving novel about four girls on the edge of something big - not just the Club that will change their lives, but also all the joys and tribulations of being twelve and thirteen. Amazon Exclusive Interview with Author Ann M. Martin Q: It's been a decade since the last Baby-sitters Club books came out, and 24 years since the first book was published. What was it like to come back to the BSC after so many years away? Martin: I had a great time re-visiting the characters. It was fun to explore their lives in the prequel, “\"The Summer Before,\" and to figure out what led the girls to form The Baby-sitters Club, something that would eventually change their lives. It was like a reunion with friends--friends who haven’t changed a bit. Q: Kristy, Claudia, Mary Anne, and Stacey are very different characters, which is in part why the series was and is still so popular. Every reader can relate to at least one of the characters. So, we have to ask you--which character are you most like? Martin: I am most like Mary Anne who is the shy and quiet one. Like me, Mary Anne enjoys more solitary pursuits such as reading and needlework. My favorite character, however, is Kristy. I think she's my alter ego. Q: Were you allowed to baby-sit when you were twelve? If so, were they any funny or awful stories you'd like to share? Martin: Yes, I did a lot of baby-sitting when I was twelve. One of the worst and also funniest things that ever happened was when I was baby-sitting for our neighbors and the kids wanted to wash their parents' car. They started the job with much enthusiasm--using Brillo pads. Q: More than 200 BSC books were published in the eighties and nineties. Are there any that you are particularly fond of and why? Martin: My favorite Baby-sitters Club book is \"Kristy's Great Idea,\" which is the first book and sets the series in motion. I also like the more serious books such as \"Claudia and the Sad Good-bye,\" which deals with the death of Claudia’s grandmother. This book was written shortly after my own grandmother died. My other favorite BSC books include “Kristy and the Secret of Susan,” in which the members of the BSC baby-sit for a child with autism, and \"Jessi's Secret Language\" in which the girls learn American Sign Language in order to communicate with a sitting charge with profound hearing impairment. Q: Why do you think that the series is so well-loved and has endured over so many years? Martin: I think the characters in the BSC books are easily relatable. The books deal with timeless topics including friendship, family, and school.  Also, the books tackle serious issues including racism, bullying, kids with disabilities (physical and mental), and death of a loved one. These issues were relevant to kids in the 1980s and 1990s, and are still relevant to kids today. In addition to being relatable, these are characters readers can aspire to. The kids run a business--in this case, a baby-sitting business. They are entrepreneurial, independent, creative, and confident. And at the heart of the series is the friendship--the \"glue\" that binds these characters. Sure, they have fights, but they're loyal and they support one another. I think a lot of us--even adults--can relate to that. Q: \"The Summer Before\" takes place during the summer before the girls enter the seventh grade--where suddenly there's a ton of pressure to fit in. The months leading up to it can be filled with anxiety, excitement, and anticipation. Do you remember how you spent the summer before seventh grade? Martin: I was nervous that summer because in the fall I would be going to a new school – the junior high (this was in the time before middle schools). Even the words \"junior high\" seemed terribly grown-up. My friends and I would be attending school with eighth-graders, who were one step away from high school. I spent that summer reading, going to the community pool, taking a family trip to Cape May, New Jersey, doing some baby-sitting, and also recovering from surgery. But the knowledge that I would soon be in junior high school colored every day and every activity and did lend the summer an air of both anxiety and anticipation. Q: Despite the fun the girls have together in \"The Summer Before,\" they're all dealing with pretty tough problems—moving away, an absentee father, a first crush. How did you choose the issues you wanted to focus on? Martin:  One of my favorite things about writing a series was that the characters themselves generated plot ideas for later books. One of the themes that developed as the series progressed was that of Kristy's relationship with her father. It was an idea I enjoyed exploring, and when I had the opportunity to write the prequel I realized that this summer would be a charged time for Kristy, and that I could introduce the issues she had with her father here; then they could unfold in the later books. The same applied to Stacey. Her reasons for moving to Stoneybrook had been revealed in later books, but I realized that during this particular summer the reader could actually watch the events take place. The other issues – a first crush, wanting more independence yet still feeling like a kid--are themes that I felt would resonate with most \"tween\" readers. Q: Even though the books have been out of print for ten years there are still some very devoted fans. Surely you must have received a ton of letters about the series over the years. Are there any that stick out in your mind? Martin: The most memorable are stories of girls who have written to me and told me that I’ve made an impact on their lives, that The Baby-sitters Club books have turned them into readers. Some have also said that the BSC books made them aspire to become writers. I’ve also heard from a lot of the original fans who grew up to become teachers, librarians, editors, journalists, entrepreneurs, etc. To know that this series inspired a generation of readers and writers is very humbling. Q: There’s been a lot of speculation in the blogosphere about where Claudia, Kristy, Mary Ann, and Stacey would be now, in 2010, had they grown up. Do you have any thoughts on what path each would have taken? Martin:  I understand the fascination of the older BSC fans who would like to know what happened with the characters when they got older. It’s thrilling to realize that after all these years the fans remain passionate about the books and the characters in The Baby-sitters Club. I can see Kristy running a business--I can also see her being in politics. I think Mary Anne became a teacher. I imagine Stacey went into fashion--not as a designer, but maybe on the business side. And Claudia became an artist. I think fans can fill in for the rest of the characters!",
  "genres": [
    "Childrens",
    "Middle Grade",
    "Fiction",
    "Young Adult",
    "Realistic Fiction",
    "Juvenile",
    "Friendship"
  ],
  "author": "Ann M. Martin",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/8531013-the-summer-before"
}