{
  "title": "The Replacements: All Over But the Shouting: An Oral History",
  "description": "At the dawn of \"Morning in America\"--a period that would nurse the rise of suit-and-tie culture--there emerged a national network of anti-corporate record shops, college radio stations, fanzines, nightclubs, and entrepreneurial record labels. In the watershed year 1981, this \"indie\" scene fostered several seminal releases. Among recordings by bands such as Sonic Youth, Black Flag, Husker Du, The Minutemen, and R.E.M. was an album called \"Sorry Ma . . . Forgot to Take Out the Trash\", recorded by a scruffy, flannel-clad quartet from Minneapolis called The Replacements. Now, for the first time, all of the hearsay, half-truths, legends, and allegations associated with this maelstrom of a rock & roll band are unraveled in this oral history by longtime Twin Cities music journalist Jim Walsh. Through interviews with family, friends, and fans; former manager Peter Jesperson; Twin/Tone record label cofounder Paul Stark; and musicians around the nation influenced by the band, Walsh lays bare with painful clarity a tale that unfolds like a tragic comedy in three perfect acts. Celebrated by national publications, \"the Mats\" often seemed more hell-bent on sabotaging their status as critical darlings than parlaying it. With their markedly apolitical stance amid their decidedly political peers, their uncool embrace of \"classic rock\" influences like KISS and The Faces, and their Dionysian appetites (and the resulting tendency to literally fall on their own faces), The Replacements lasted 12 years despite themselves. From the bands founding to their rise through the local and national club circuits, their major label deal in 1985, and the slow and painful implosion that followed, The Replacements: All Over But the Shouting lays down the gripping oral history behind the little band that could--but didn't.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Punk",
    "Rock N Roll",
    "Oral History",
    "Musicals"
  ],
  "author": "Jim Walsh",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/852714.The_Replacements"
}