{
  "title": "أنثى السراب",
  "description": "نبذة النيل والفرات:من جديد يأتي صوت الكمان الدافء، يذبحني أنينه، يملأني، أغمض عيني على هذه الحافة الهاربة. أرى إمرأة تتمزق بين رغاباتها وأحلامها الصغيرة والملونة، وبين حياتها الموغلة في عتمة الأرواح المحيطة بها، في وحشة الشوارع وفظاعة الإحساس بالوحدة... أشعر برغبة في البكاء. ذاك الأنين الجميل يعمق إحساسي بالفداحة... كم تراني خسرت طوال هذا الوقت الذي يمضي داخل الخوف والأسئلة التي تبقى معلقة حول حوافّ القلب كالقصة؟ جريت أكثر وكأن الأوامر من ورائي لم تكن تعنيني. مسحت المكان بعيني الحذرتين، بدرجة قاربت المائة والثمانين درجة. عرفت أين هي بالضبط. كانت مريم تسلك الطريق المؤدي إلى واجهة البحر، قبل أن تنزل نحو الميناء القديم. ربما كانت تريد أن تستقل سفينة ما للهرب. لم يكن الشرطي السمين بعيداً عني، فقد شممت رائحة عرقه القوية، وشعرت حتى بظله يثقل جسدي المنهك. جريت أكثر لكي لا تغيب مريم عن نظري. ثم... طلقة ثالثة قريبة في، جمّدت دمي... إرتعش المسدس في يدي، وأصبح فجأة لا يساوي إلا ثقله. بدأت أتهادى، غمرني فجأة صفاء غريب مع قطرات الدم الأولى التي تنزف من صدري، ولونت قميصي البنفسجي الجميل، ببقعة حمراء عند النهد الأيسر تماماً، كانت تتسع أكثر فأكثر، كلما جريت. عاودني الصوت مضخماً كأنه يأتي من بئر فارغة. هل إنتصرت؟ أم هزمت؟ الشيء الوحيد الذي أعرفه هو أنني... ما أزال واقفاً على قدمي، مثخناً بالجراح، وكلها في صدري، لقد فعلت ما إستطعت... وأكثر مما كنت أستطيع.. أما وقد إنتهت المعركة الآن، فإنني آت لأضطجع إلى جانبك، ولأصبح تراباً. الصوت نفسه والنبرة نفسها. كان هذه المرة واضحاً كهذا اليوم لجميل. من هو؟ قال هذه الجملة التي أدخلتني فجأة في دوار الموت. أعرفهن ولكني نسيته أيضاً، مثل خيط العطر المتسرب من مريم. أركض. أحاول أن لا أتوقف. أتشمم الأشياء كحيوان بري ضائع. أشعر بجسدي أخف من الريشة وهو يتسلل بين الناس ببطء شديد. كان تكاثرهم المتزايد يشبه جذوع وأغصان الأشجار الإستوائية التي سلكناها أنا وسينو في جزيرة القديسات... في لمح البصر إنتابتني ملينا وهي تستمتع برمال الكاريبي البيضاء... تتكاثر الأمواج البشرية من حولي ممتزجة بالنداءات الحادة.. أطير في الفراغات. أتحسس جناحي الحلوتين كجناحي فراشة، أقاوم ثقل الأشياء الغامضة التي تسحبني نحو الأرض. فجأة شعرت يعيني تثقلان وتستسلمان لنوم لذيذ منذ زمن بعيد... عندما فتحت عيني وقلبي وبقية حواسي للمرة الأخيرة لم أر شيئاً إلا بياضاً مسح كل النتوءات والملامح المحيطة بي... تأكدت نهائياً من مسلك مريم التي كانت تتجه نحو الميناء القديم كما توقعت، وحتى من نوع عطرها الذي شممته أول مرة وأنا متكئة على أدراج البريد. كيف هرب من الذاكرة حواسي المشتعلة، تشانل فايف... عطري المسروق. عطر أنثى السراب. قد يبدو ما تقصه الراوية غريباً... فقد صممت أن تحكي كل شيء لتتخلص من رماد شخصية ورقبة سحقت تحتها إمرأة لم تكن متفردة في شيء إلا في عشقها لكمانها، ولرجل كانت تظن أنها تخلصت منه بالزواج من غيره، وجدت نفسها فيه حتى الغيبوبة... فكانت كل شيء إلا إمرأة غير مثالية... كجميع الناس... كانت تحتفي بجنونها الخفي وعبثيتها حتى الهبل... فعلت ذلك عن سابق إصرار وترصد، ولهذا فهي لا ترتد لمريم، حتى لو كانتها في بعض تفاصيلها الجسمانية والحياتية، أن تسرق منها طفلة مذهلة أنجبتها بقسوة لا شبيهة لها إلا الموت... وحباً مجنوناً يقع خارج كل المدارات... في ملينا سحر الكاريبي، وكافة خلجانها ودفئها، وصفاء سماء لوس أنجلس... يغرق واسيني الأعرج إلى حدّ التماهي في أعماق النفس الإنسانية لإقتناعه بأن في دواخلنا شخص آخر نحن نعيشه... يحاول قتلنا في بعض الأحيان، ونحاول في آحايين قتله... وريما أكثريتنا تفضل العيش معه بسلام.",
  "genres": [
    "Novels"
  ],
  "author": "واسيني الأعرج",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/8529474"
}