{
  "title": "Henry's Demons: Living with Schizophrenia, A Father and Son's Story",
  "description": "On a cold February day two months after his twentieth birthday, Henry Cockburn waded into the Newhaven estuary outside Brighton, England, and nearly drowned. Voices, he said, had urged him to do it. Nearly halfway around the world in Afghanistan, journalist Patrick Cockburn learned from his wife, Jan, that his son had suffered a breakdown and had been admitted to a hospital. Ten days later, Henry was diagnosed with schizophrenia. Narrated by both Patrick and Henry, this is the extraordinary story of the eight years since Henry’s descent into schizophrenia—years he has spent almost entirely in hospitals—and his family’s struggle to help him recover. With remarkable frankness, Patrick writes of Henry’s transformation from art student to mental patient and of the agonizing and difficult task of helping his son get well. Any hope of recovery lies in medication, yet Henry, who does not believe he is ill, secretly stops taking it and frequently runs away. Hopeful periods of stability are followed by frightening disappearances, then relapses that bleed into one another, until at last there is the promise of real improvement. In Henry’s own raw, beautiful chapters, he describes his psychosis from the inside. He vividly relates what it is like to hear trees and bushes speaking to him, voices compelling him to wander the countryside or live in the streets, the loneliness of life within hospital walls, harrowing “polka dot days” that incapacitate him, and finally, his steps towards recovery. Patrick’s and Henry’s parallel stories reveal the complex intersections of sanity, madness, and identity; the vagaries of mental illness and its treatment; and a family’s steadfast response to a bewildering condition. Haunting, intimate, and profoundly moving, their unique narrative will resonate with every parent and anyone who has been touched by mental illness.",
  "genres": [
    "Nonfiction",
    "Mental Health",
    "Memoir",
    "Psychology",
    "Mental Illness",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Patrick Cockburn",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/8526623-henry-s-demons"
}