{
  "title": "Ideas in Food: Great Recipes and Why They Work: A Cookbook",
  "description": "Alex Talbot and Aki Kamozawa, husband-and-wife chefs and the forces behind the popular blog Ideas in Food , have made a living out of being inquisitive in the kitchen. Their book shares the knowledge they have gleaned from numerous cooking adventures, from why tapioca flour makes a silkier chocolate pudding than the traditional cornstarch or flour to how to cold smoke just about any ingredient you can think of to impart a new savory dimension to everyday dishes. Perfect for anyone who loves food, Ideas in Food is the ideal handbook for unleashing creativity, intensifying flavors, and pushing one’s cooking to new heights. This guide, which includes 100 recipes, explores questions both simple and complex to find the best way to make food as delicious as possible. For home cooks, Aki and Alex look at everyday ingredients and techniques in new ways—from toasting dried pasta to lend a deeper, richer taste to a simple weeknight dinner to making quick “micro stocks” or even using water to intensify the flavor of soups instead of turning to long-simmered stocks. In the book’s second part, Aki and Alex explore topics, such as working with liquid nitrogen and carbon dioxide—techniques that are geared towards professional cooks but interesting and instructive for passionate foodies as well. With primers and detailed usage guides for the pantry staples of molecular gastronomy, such as transglutaminase and hydrocolloids (from xanthan gum to gellan), Ideas in Food informs readers how these ingredients can transform food in miraculous ways when used properly. Throughout, Aki and Alex show how to apply their findings in unique and appealing recipes such as Potato Chip Pasta, Root Beer-Braised Short Ribs, and Gingerbread Soufflé. With Ideas in Food, anyone curious about food will find revelatory information, surprising techniques, and helpful tools for cooking more cleverly and creatively at home.",
  "genres": [
    "Cookbooks",
    "Food",
    "Cooking",
    "Nonfiction",
    "Science",
    "Reference",
    "Food Writing"
  ],
  "author": "Aki Kamozawa",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/8530477-ideas-in-food"
}