{
  "title": "Appetite City: A Culinary History of New York",
  "description": "New York is the greatest restaurant city the world has ever seen. In Appetite City , the former New York Times restaurant critic William Grimes leads us on a grand historical tour of New York's dining culture. Beginning with the era when simple chophouses and oyster bars dominated the culinary scene, he charts the city's transformation into the world restaurant capital it is today. Appetite City takes us on a unique and delectable journey, from the days when oysters and turtle were the most popular ingredients in New York cuisine, through the era of the fifty-cent French and Italian table d'hôtes beloved of American \"Bohemians,\" to the birth of Times Square―where food and entertainment formed a partnership that has survived to this day. Enhancing his tale with more than one hundred photographs, rare menus, menu cards, and other curios and illustrations (many never before seen), Grimes vividly describes the dining styles, dishes, and restaurants succeeding one another in an unfolding historical the deluxe ice cream parlors of the 1850s, the boisterous beef-and-beans joints along Newspaper Row in the 1890s, the assembly-line experiment of the Automat, the daring international restaurants of the 1939 World's Fair, and the surging multicultural city of today. By encompassing renowned establishments such as Delmonico's and Le Pavillon as well as the Bowery restaurants where a meal cost a penny, he reveals the ways in which the restaurant scene mirrored the larger forces shaping New York, giving us a deliciously original account of the history of America's greatest city. Rich with incident, anecdote, and unforgettable personalities, Appetite City offers the dedicated food lover or the casual diner an irresistible menu of the city's most savory moments.",
  "genres": [
    "Food",
    "History",
    "Nonfiction",
    "New York",
    "Travel",
    "Food Writing",
    "Reference"
  ],
  "author": "William Grimes",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/8531295-appetite-city"
}