{
  "title": "آلموت",
  "description": "آلموت هي قلعة على جبل شاهق في خراسان بناها ملوك الديلم ،استولى عليها الحسن بن الصبّاح في شهر شعبان من عام 483ه ومنها بدأ دعوته الإسماعيلية الباطنية.وبالرغم من أن فلاديمير بارتول كان قد كتب روايته (آلموت) قبل ستة وستين عاماً إلا أن الأسئلة المريرة التي تطرحها قد اكتسبت منطقاً وحيثيات واقعية جداً بعد أحداث الحادي عشر من أيلول (سبتمبر) 2001م، فلاديمير بارتول الذي احتفلت بلاده بمئوية ميلاده في الرابع والعشرين من فبراير من العام الحالي كان كاتباً مهتماً بعلم الأحياء والفلسفة ودرس كل الأعمال المنشورة لفرويد وحصل على درجة الدكتوراه المزدوجة في الأحياء والفلسفة في عمر لم يتجاوز خمسة وعشرين عاماً، ولد في الرابع والعشرين من فبراير عام 1903م ونشأ طفلاً مفرط الحساسية وعاش في بلغراد يعمل في عدة صحف وكان دائماً يحلم بأن لا يكون مجرد كاتب فحسب بل إن طموحه كان يتجاوز الحدود المحلية إلى الآفاق العالمية، وبعد الحرب العالمية الثانية أصبح عضواً مساعداً بالأكاديمية السلوفانية للعلوم والفنون التي بقي فيها حتى وفاته في 12سبتمبر عام 1967م.كتب بارتول عدة أعمال مسرحية وقصصية ولكن عمله الذي به اشتهر في العالم هو رواية (آلموت) هذه الرواية التي نحن بصددها، وقد ترجمت إلى أكثر من 19لغة من لغات العالم وأصبحت الرواية التي لم يعترف أو يهتم بها النقاد ولا القراء ساعة نشرها في بلاده، أصبحت ضمن مقررات مناهج التعليم الثانوي في سلوفانيا.لقد رأى فلاديمير بارتول فصولاً كثيرة من عصارات ألموت الواقعية تدور أمامه أيام الحرب العالمية الأولى من مناظر القتل والتدمير الذي تعرض له العالم وبلاده على وجه التحديد، فكان أن عزم على كتابة هذه الرواية واستمر في كتابتها عشرة أعوام منذ عام 1927م حتى نشرها عا 1937م، واستقى بارتول معلوماته التاريخية حول ابن الصباح وجماعة الحشاشين في ألموت من خلال كتابات المستشرقين والرحالة الأوروبيين وبخاصة ما كتبه الشهير ماركو بولو.المصادر التاريخية الإسلامية والغربية تروي لنا قصة (الفدائيين) الذين اصطفاهم الحسن بن الصباح وصاغهم سهاماً مسمومة موجهة لتصفية الخصوم والأعداء، وحرص ابن الصباح على اجتذاب الفتيان من عمر الثانية عشرة إلى العشرين، مشترطاً فيهم ألا يكونوا قد شربوا الخمرة أو عرفوا النساء أو تلطخوا بأي شيء من ملذات الحياة، وقد اجتمع لديه عدد وفير من هؤلاء الفتيان بل إن بعض الأهالي لفرط إيمانهم واقتناعهم بدعوة ابن الصباح كانوا يرسلون أبناءهم إلى القلعة راجين لهم الشهادة في سبيل الدعوة الصباحية (المقدسة).لعلّ أهمية الرواية التي اجتذبت ملايين القراء في العالم تكمن في أنها أصبحت جزءاً من ثقافة العالم الحية لسببين على الأقل، الأول: أن أحداث الحادي عشر من أيلول بدت كاستعارة لأنموذج للإرهاب الإسلامي (والإسلام من كل ذلك براء) بعد إرهاب هتلر وموسوليني وستالين، ولعل (آلموت) إشارة قوية إلى أن ابن الصباح وتنظيمه قد وجد صدى قوياً يتردد بقوة في أرجاء العالم مع ظهور تنظيم القاعدة الذي يتخذ الإسلام شعاراً لكل مشروعاته التدميرية، والسبب الثاني لأهمية الرواية، هو ما تحققه آلموت من متعة نقية في القراءة تماماً كما هي كل الروايات العظيمة، بالحبكة الدرامية الراقية التي تتعامل بمنتهى الاحتراف مع مثل هذه الموضوعات الأكثر حساسية، فخرج نص آلموت بخطاب متعدد من الممكن التعاطي معه كنص سياسي لما يتناوله من صراعات الحشاشين السياسية وتنظيماتهم العسكرية، أو كنص فلسفي عدمي حين يناقش ويحلل بعض مبادئ ابن الصباح وأفكاره التي منها على سبيل المثال \"أن لا شيء حقيقي، وأن كل شيء مباح) فيحاول بارتول أن يردّ كل فلسفات ابن الصباح إلى تطبيقات من الفلسفة الحديثة أو القديمة، كما يمكن التعاطي مع آلموت كنص تاريخي مواز للوقائع التاريخية الأصيلة.بمثل هذه المقومات الفنية والتاريخية انتشرت آلموت في الأدبيات العالمية انتشاراً كبيراً وبيعت منها عشرات الآلاف من النسخ في كل لغة ترجمت إليها، وكما يُروى عن بارتول قوله.. (إنه كان لديه شعور أثناء كتابة العمل أنه يكتبه ليس فقط لمعاصريه لكن أيضاً للقراء الذين عاشوا منذ خمسين سنة وأيضاً للقراء الذين سيعيشون بعد خمسين سنة..) .",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Classics",
    "Novels",
    "Historical",
    "Literature",
    "Philosophy"
  ],
  "author": "Vladimir Bartol",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/8532764"
}