{
  "title": "وحيدة في غرفة أمسح الغبار",
  "description": "تقول لوكس في حوار صحافي، إنها تعتبر شعرها \"شعبياً\" بمعنى قدرته على النفاذ إلى شريحة واسعة من القراء، على الرغم من نخبويته لجهة الأدوات التعبيرية، أي انتمائه إلى تقليد في الكتابة لا يعتمد المباشرة والبوح واستنفار المشاعر العامة، وإن بدا كذلك في بعض الأحيان، ناهيك عن الصعوبة النسبية للغة التي تكتب بها. لكن هذه اللغة توظف باستمرار في كتابة هي أقرب إلى المادية الملموسة، منها إلى رمزية تدور في إطار اللغة وحدها. وهذا بالنسبة إلى لوكس يعني الواقعية بالضرورة، وإن كانت هذه الأخيرة شديدة الحضور في قصائدها، بقدر ما يعني الانطلاق من الواقع لتحويله دائماً إلى شيء آخر. الواقع ربما كذريعة تحاول لوكس أن تقول من خلاله الطبقات المتعددة للخيبة والألم، كما للمسرات وأشكال الاحتفاء بالحياة. كل قصيدة من قصائد لوكس، في دواوينها الأربعة حتى الآن، تكاد تكون نوعاً من البحث عن أسرار الحياة الكثيرة والتي لا تستقر على حال، ولا يمكن تلخيصها برأي أو نظرية أو حتى إحساس. ما يجعل شعر لوكس \"شعبياً\" بالنسبة إليها، وعلى حد قولها، هو أنها هي نفسها عاشت حيوات متعددة، عرفت في طفولتها قسوة الحياة العائلية وحنانها، عرفت التشرد، اختبرت الحب واللذة، اختبرت الزواج والأمومة والطلاق، تنقلت بين وظائف كثيرة جعلتها تحتك بالطبقات السفلى والوسطى من المجتمع، أي أنها نمت لديها إحساساً عميقاً بذاتها، كما بالآخرين، لا بمعنى التضامن العام إزاء قسوة شروط الحياة، بل بمعنى الفهم العميق للفرديات الممزقة والقلقة، للآلام الداخلية الخاصة، لأشكال العزلة، للمطالب البسيطة التي تبدو إزاء تعقيدات الحياة اليومية مستحيلة... كل ذلك يشكل ذات لوكس الشعرية، التي تجعل القصيدة عندها قائمة على مستويين متراكبين، الأول العنصر السردي المنطلق من الواقع، أو السيرة، أو الذاكرة، أو الحياة اليومية، والعنصر الثاني رفع كل هذه الشؤون إلى مستوى السؤال الشعري، واعتماد أدوات تعبيرية (التصوير، التخييل، الاستعارات، التشبيهات، الرموز، الأساطير...الخ) في غاية الدقة، بحيث لا يؤدي السرد لديها إلى عبارة فضفاضة أو فالتة، بل إنها باستمرار مضبوطة بإيقاع داخلي حازم ومتماسك. لعل العنصر الذي يظهر في معظم قصائد لوكس أو الذي تنطلق منه قصيدتها باستمرار، هو الإحساس الدائم بالخسارة، كما الإحساس بفداحة الزمن. هناك شعور دائم بأن هناك شيئاً ما يضيع، حتى في اللحظة الحالية المعيشة، وبالتالي هناك بحث عن أثر هذه اللحظة، عما يجعل حضورها مادياً، والأمر نفسه في ما يتعلق بالماضي البعيد أو القري: أي أثر يتركه هذا الماضي في \"الآن\" و\"هنا\"، كيف يمكننا تجميد لحظة فائتة وضائعة، لمعاودة بثها في الحاضر الذي هي أصلاً تتحرك فيه، وإن في الخفاء.",
  "genres": [
    "Poetry",
    "English Literature",
    "American"
  ],
  "author": "Dorianne Laux",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/8535816"
}