{
  "title": "DO YOU FEEL GOD WALKING BESIDE YOU? : Why we Must Grab Hold of God’s Grace and Love",
  "description": "Due to worldly events, many people are suffering economically, socially and spiritually. They reach out for help from friends, the church and family, only to find their extended hands pushed away. Lately, scientific discoveries and hypothesis has been disseminating news concerning their 'NEW DISCOVERIES' of planets and their interpretation of how the earth was made. Moreover, it seems that politicians and federal courts are destroying people's religious freedom, and trying to eradicate anything that shows reference to God. However, God is real, and despite man's advancement in science and technology, God is still walking with those that have faith in his power. DO YOU FEEL GOD WALKING BESIDE YOU? comprise of words that help mend broken hearts, restore faiths and confidence and remind people that God is real. For centuries, the poor, disadvantage, and oppress has been trampled over by insensitive people in power, whom they put their trust into that wind up abusing them physically, psychologically and financially.  In the DO YOU FEEL GOD WALKING BESIDE YOU?,  people would discover, that reaching out to God, he will walk with them and guide them to answers where they will find answer for love, depression, agony, self-esteem and spiritualism. DO YOU FEEL GOD WALKING BESIDE YOU? encourage the reader that God is alive and ready to walk with them if they would pray and reach out their hand. We all have concerns about life after death, would we see our loved ones again, or will God forgive our sins. DO YOU FEEL GOD WALKING BESIDE YOU? let the reader understand that God listens and will guide them to answers that not only bring them peace but actuate them to spread his word and love. Let God walk with you, order DO YOU FEEL GOD WALKING BESIDE YOU?",
  "genres": [],
  "author": "Raymond Sturgis",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/8535874-do-you-feel-god-walking-beside-you"
}