{
  "title": "The Political Brain: The Role of Emotion in Deciding the Fate of the Nation",
  "description": "The Political Brain is a groundbreaking investigation into the role of emotion in determining the political life of the nation. For two decades Drew Westen, professor of psychology and psychiatry at Emory University, has explored a theory of the mind that differs substantially from the more \"dispassionate\" notions held by most cognitive psychologists, political scientists, and economists—and Democratic campaign strategists. The idea of the mind as a cool calculator that makes decisions by weighing the evidence bears no relation to how the brain actually works. When political candidates assume voters dispassionately make decisions based on \"the issues,\" they lose. That's why only one Democrat has been re-elected to the presidency since Franklin Roosevelt—and only one Republican has failed in that quest. In politics, when reason and emotion collide, emotion invariably wins. Elections are decided in the marketplace of emotions, a marketplace filled with values, images, analogies, moral sentiments, and moving oratory, in which logic plays only a supporting role. Westen shows, through a whistle-stop journey through the evolution of the passionate brain and a bravura tour through fifty years of American presidential and national elections, why campaigns succeed and fail. The evidence is overwhelming that three things determine how people vote, in this order: their feelings toward the parties and their principles, their feelings toward the candidates, and, if they haven't decided by then, their feelings toward the candidates' policy positions.Westen turns conventional political analyses on their head, suggesting that the question for Democratic politics isn't so much about moving to the right or the left but about moving the electorate. He shows how it can be done through examples of what candidates have said—or could have said—in debates, speeches, and ads. Westen's discoveries could utterly transform electoral arithmetic, showing how a different view of the mind and brain leads to a different way of talking with voters about issues that have tied the tongues of Democrats for much of forty years—such as abortion, guns, taxes, and race. You can't change the structure of the brain. But you can change the way you appeal to it. And here's how…",
  "genres": [
    "Politics",
    "Psychology",
    "Nonfiction",
    "Science",
    "Political Science",
    "Sociology",
    "Neuroscience"
  ],
  "author": "Drew Westen",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/853648.The_Political_Brain"
}