{
  "title": "See Jack Die",
  "description": "See Jack Die(See Jack Die #1, Best Sellers in Amazon Kindle eBooks)by Nicholas BlackJack Pagan might as well be 4½ months old. He awoke in a hospital after suffering a head injury that left him dead for over 67 minutes. All of his longterm memories were destroyed. Now he has to start his life again. But his accidental flirt with death left him a special gift. In those few minutes as he fades off to sleep each night, and in those early hours of the morning as he numbly awakens... he sees them.At first, the shadows would just stretch into strange shapes and forms. Jack thought that he was hallucinating. That his medication was playing with his vision. Then the strange shadows began to walk around, moving freely. Jack chalked it up to a brain tumor. Some disease in his cerebral cortex. Schizophrenia, even. Something he could live with.Now these creatures are not only haunting his nights, but his days. And they have a tendency to show themselves around people who are about to die. Seeking help he turns to a psychic who gives him a very special book. A book that he was destined to find. Jack learns that the only way he will ever know about who he was, is to face his worst fears, and die . . . again.In a series of incredible twists and turns, Jack finds out that the worlds of the living and of the dead are much closer than any of us can possibly imagine. And monsters . . . are real.A little bit of Horror, some suspense, a lot of paranormal, and even a bit of romance . . .See Jack Die.By Nicholas Blackwww.nicholasblackbooks.comOTHER BOOKS BY NICHOLAS BLACKThe Last American MercenaryTerrorist University - How Did It Happen That The U.S. Government Knew About The Madrid Bombing and Did Nothing? UKSoul's True Adventures of Medic-13NICHOLAS BLACK’S HOW-TO SERIESHow to Write a Fiction Novel in 30 Days or Less!How to Fix Your Credit in 45 Days or Less!How to Publish a Best Seller on AmazonHow to Find Love, Intimacy & Romance Online!The Tinder How to Use Tinder and Other Online Dating Apps to Sell Tons of Ebooks!Mental The Art of Life and Death Decision-Making!FictionSee Jack DieSee Jack HuntHow My Gay Uncle F'ed up The Legend of Sodomy CatThe The Story of a Contract KillerThree Wise MenChasing Darkness (with Jill Falter)Chasing Daylight (with Jill Falter)Purg Fallen AngelPurg The 4th AngelPurg Burning HeavenPurg Falling Shadows",
  "genres": [],
  "author": "Nicholas  Black",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/8541335-see-jack-die"
}