{
  "title": "The Biology of Transcendence: A Blueprint of the Human Spirit",
  "description": "Uses the insights and research of a new wave of biologists and neurologists to explore how we can transcend our current cultural and societal crises.• Explains new biological understanding of the human organism having five brains, the fifth of which is located in the heart.• Explains that transcendence of our current modes of behavior, thinking, and believing require the dynamic interaction of our fourth and fifth brains (intellect and intelligence).• Explores the idea of Jesus, Buddha, and other historical great beings as models of nature's possibility and our ability to achieve transcendence.• How is it that we as humans seem stuck in a culture of violence and injustice? How is it that we can recognize the transcendent ideal represented by figures such as Jesus, Buddha, Lao-tzu, and many others who have walked among us and yet cannot seem to reach the same state?In The Biology of Transcendence Joseph Chilton Pearce examines the current biological understanding of our neural organization to address how we can transcend our current evolutionary capacities and limitations. This latest research identifies our five neural centers--or brains--and establishes that our fourth and most recently developed brain is located in the head while the fifth is located in the heart. It is the dynamic interaction of this head brain (intellect) and heart brain (intelligence), of biology and spirit, that allows transcendence from one evolutionary place to the next--we are, quite literally, made to transcend. Conversely, it is the breakdown of this interaction through the effects of cultural dictates surrounding us from the time we are children that keeps us where we are, mired in the current crises of violence among people and between people and the planet.But Pearce reminds us that we are not stuck for good. Transcendence is our biological imperative, a state we have been moving toward for millennia.",
  "genres": [
    "Spirituality",
    "Philosophy",
    "Psychology",
    "Nonfiction",
    "Science",
    "Religion",
    "Biology"
  ],
  "author": "Joseph Chilton Pearce",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/854022.The_Biology_of_Transcendence"
}