{
  "title": "Sikander",
  "description": "It's 1986 and Ronald Reagan's commitment to the anti-Soviet mujahideen of Afghanistan is resolute. Meanwhile, 17 year-old Pakistani student, Sikander, yearns for the freedom of his tribal brethren in neighboring Afghanistan, and that leads him to admire everything American but more directly, to want to study and live in America. When a heated quarrel stemming from a naive indiscretion about his parents' financial woes provokes Sikander into leaving the comfort of his upper-middle class home, events lead to his being thrust into the very heart of the Afghan resistance. Between fighting the Russians and living among the mujahideen villagers, Sikander meets Rabia, the independent, uneducated, but sharp-witted niece of his Afghan mentor and he begins to have feelings her. After two years, aided by long-awaited American Stinger missiles, Sikander and the mujahideen prevail. Amid the euphoria of victory and the prospects for peace Sikander and Rabia cement their love in marriage.With the war over, Sikander decides its time he and his new bride head back to Pakistan for a reconciliation with his family. To their delight he is welcomed back as a long missed, war hero and the couple settle in with his now financially recovered family. Years pass, and Sikander prospers in the family business, while feeling though never fulfilling his desire to move to America. But then a bitter civil war rages in neighboring Afghanistan that results in the rise of the Taliban and with it, an unraveling of Rabia's family. Things get far worse when the tragedy of 9/11 strikes, and aided by Rabia's pleadings Sikander feels compelled to make the perilous journey across the border to persuade her family to come back with hm and away from the conflict. He manages to find them and lead them to the relative safety of Pakistan but not without himself being placed on collision course with the country of his dreams - America.Learn more about this remarkable story at http://www.sikanderbook.com",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "War",
    "Pakistan",
    "Literary Fiction",
    "Contemporary",
    "Islam"
  ],
  "author": "M. Salahuddin Khan",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/8545788-sikander"
}