{
  "title": "A Royal Likeness",
  "description": "As heiress to the famous Laurent Fashion Dolls business, Marguerite Ashby's future seems secure. But France still seethes with violence in the wake of the Revolution. And when Marguerite's husband Nicholas is killed during a riot at their shop, she leaves home vowing never to return. Instead, the young widow travels to Edinburgh and joins her old friend, Marie Tussaud, who has established a touring wax exhibition.Under the great Tussaud's patient instruction, Marguerite learns to mold wax into stunningly lifelike creations. When Prime Minister William Pitt commissions a wax figure of military hero Admiral Nelson, Marguerite becomes immersed in a dangerous adventure--and earns the admiration of two very different men. And as Britain battles to overthrow Napoleon and flush out spies against the Crown, Marguerite will find her own loyalties, and her heart, under fire from all sides.With wit, flair, and a masterful eye for telling details, Christine Trent brings one of history's most fascinating eras to vibrant life in an unforgettable story of desire, ambition, treachery, and courage.Praise for Christine Trent's The Queen's Dollmaker\"Exuberant, sparkling, beguiling. . .brims with Dickensian gusto!\" --Barbara Kyle, author of The Queen's Lady\"Winningly original. . .glittering with atmospheric detail!\" --Leslie Carroll, author of Royal Affairs\"Unique, imaginative. . .replete with delightful details and astounding characters, both real and imagined.\" --Donna Russo Morin, author of The Courtier's SecretChristine Trent writes historical fiction from her two-story home library. She lives with her wonderful bookshelf-building husband, three precocious cats, a large doll collection, and over 3,000 fully cataloged books. She and her husband are active travelers and journey regularly to England to conduct book research at historic sites. It was Christine's interest in dolls and history that led to the idea for The Queen's Dollmaker.",
  "genres": [
    "Historical Fiction",
    "France",
    "Fiction",
    "Romance",
    "Historical",
    "British Literature",
    "19th Century"
  ],
  "author": "Christine Trent",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/8546464-a-royal-likeness"
}