{
  "title": "Unholy Messenger: The Life and Crimes of the BTK Serial Killer",
  "description": "To all appearances, Dennis Rader was a model citizen in the small town of Park City, Kansas, where he had lived with his family almost his entire life. He was a town compliance officer, a former Boy Scout leader, the president of his church congregation, and a seemingly ordinary father and husband. But Rader's average life belied the existence of his dark, sadistic other he was the BTK serial killer.The self-named BTK (for Bind, Torture, Kill) had terrorized Wichita for thirty-one years, not only with his brutal, sexually motivated crimes, but also through his taunting, elusive communications with the media and law enforcement. In 1974, BTK committed his first murders -- torturing and strangling four members of the Otero family -- and wrote the police an audacious letter declaring his responsibility for the Oteros' deaths and labeling himself, for the first time, BTK. Thus he established a pattern -- stalking and killing a series of ten victims, then bragging and claiming ownership of his crimes -- that ended in 1991 but left law enforcement confounded and the public with deeply troubling memories. Until, that is, he resurfaced in 2004 with another string of letters that would finally lead to his arrest. Drawing from extensive interviews with Rader's pastor, congregation, detectives, and psychologists who worked the case, and from his unnervingly de-tailed thirty-two-hour confession, bestselling author Stephen Singular delves into the disturbing life and crimes of BTK to explore fully -- for the first time -- the most dangerous and complex serial killer of our generation and the man who embodied, at once, astonishing extremes of normality and abnormality. In Unholy Messenger, Singular recounts the year prior to Rader's arrest, in which the BTK killer reemerged, and the aftermath. Woven throughout are the details of his crimes, elaborate schemes, and bids for public attention, and the wrenching impact his deception had on his family, church, and heartland community. attention, and the wrenching impact his deception had on his family, church, and heartland community. The result is a chilling story of a man considered a \"spiritual leader\" by his pastor and congregation, who turned out to be the devil next door. More than just true crime, Unholy Messenger is a powerful, thoroughly engrossing examination of the intersection between good and evil, and of the psychology and spirituality of a killer in whom faith and bloodshed converged.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "Biography",
    "Psychology",
    "Murder Mystery"
  ],
  "author": "Stephen Singular",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/854761.Unholy_Messenger"
}