{
  "title": "Full Steam Ahead",
  "description": "This is a race against time. Against oneself. This is the Vendée Globe, the most grueling race around the world. Singlehanded. No stopovers. On board is Laurel Benson-Desmarais, a thirty-six-year-old racer from a family of sailors. Five foot and a quarter inch of pure adrenaline junkie. One hundred and forty-seven pounds of thrill-seeking, motor-mouth, caffeine-addict of a woman who redefines the word \"stubborn determination\". Laurel's venture starts admirably. Day one of the race sees her well in advance. Until the meteorological forecasts start messing with her patience. The mother of all storms is gathering speed. Heading straight for the race. For the first time in its history, the Vendée Globe is annulled due to bad weather. She's worked years for this but has to turn the boat around. She's not fast enough. The storm catches up with her, tosses the 60-foot sloop as if it were a bit of cork. Electricity crackles in the air. Spray hits her like rocks. Then as she pitches into a mountain-size wave, everything changes. The water, the very air. As if she crossed over to another world. Crazy. Phineas Hamilton, captain of the brigantine the Brass Baron, never thought he would one day run into a woman who physically looks like the enemy, with pale hair and eyes, but yet is not one of them. The exotic prisoner is also the most obstinate, argumentative, confrontational...and fascinating woman he has ever met. He does not really care where she hails from and what brought her to his ship-no one speaks to him that way. And certainly not on his own damn ship! A lesson in manners is most definitely in order. But for now, he must make sure his crew and ship survives the latest enemy attack. They all depend on him.",
  "genres": [
    "Steampunk",
    "Romance",
    "Fantasy",
    "Fiction",
    "Paranormal Romance",
    "Adult",
    "Erotica"
  ],
  "author": "Nathalie Gray",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/8547207-full-steam-ahead"
}