{
  "title": "African Rhythms: The Autobiography of Randy Weston",
  "description": "The pianist, composer, and bandleader Randy Weston is one of the world’s most influential jazz musicians and a remarkable storyteller whose career has spanned five continents and more than six decades. Packed with fascinating anecdotes, African Rhythms is Weston’s life story, as told by him to the music journalist Willard Jenkins. It encompasses Weston’s childhood in Brooklyn’s Bedford-Stuyvesant neighborhood—where his parents and other members of their generation imbued him with pride in his African heritage—and his introduction to jazz and early years as a musician in the artistic ferment of mid-twentieth-century New York. His music has taken him around the he has performed in eighteen African countries, in Buddhist temples and Shinto shrines, in the Canterbury Cathedral, and at the grand opening of the Bibliotheca The New Library of Alexandria. Africa is at the core of Weston’s music and spirituality. He has traversed the continent on a continuous quest to learn about its musical traditions, produced its first major jazz festival, and lived for years in Morocco, where he opened a popular jazz club, the African Rhythms Club, in Tangier. Weston’s narrative is replete with tales of the people he has met and befriended, and with whom he has worked. He describes his unique partnerships with Langston Hughes, the musician and arranger Melba Liston, and the jazz scholar Marshall Stearns, as well as his friendships and collaborations with Duke Ellington, Dizzy Gillespie, Coleman Hawkins, Thelonious Monk, Billy Strayhorn, Max Roach, Charlie Parker, Miles Davis, the novelist Paul Bowles, the Cuban percussionist Candido Camero, the Ghanaian jazz artist Kofi Ghanaba, the Gnawa musicians of Morocco, and many others. With African Rhythms , an international jazz virtuoso continues to create cultural history.",
  "genres": [
    "Music",
    "Jazz",
    "Nonfiction",
    "Memoir"
  ],
  "author": "Randy Weston",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/8544698-african-rhythms"
}