{
  "title": "Enchanted Island",
  "description": "Gabriella Sanchez is an awkward, eleven year-old girl simply trying to fit in. Bullied by her classmates, she’s forced into a solitary existence. She attempts to change her circumstances by befriending Molly Sinclair, the daughter of the wealthy couple her mother works for. Things seemed to be going well, until the day Molly decided she was embarrassed to be friends with Gabriella in public. Gabriella’s luck changes when she meets new student, Gilberto Padilla. He accepts her just as she is. The two become inseparable. Gabriella is so happy she even forgives Molly and revisits their friendship.With school out for the summer, Gabriella and Gilberto’s family plan a trip to Puerto Rico. A spoiled Molly convinces her parents to let her tag along. Gabriella is overjoyed to be experiencing it for the first time with her best friends. Friendship is tested when a battle begins between the two girls, over Gilberto. But, while in Puerto Rico Gabriella and Molly meet Juan, a friend of the Padilla family. Molly instantly falls for him while he has his eye set on Gabriella. This infuriates Molly, who inadvertently causes a near fatal accident for her friend.Molly’s unscrupulous behavior sets off a peculiar chain of events. Eleven year-old Gabriella then finds herself in the middle of an age old mystery after curious happenings begin to occur. After entrusting only her friends with the information, the four choose never to discuss it again, until Gabriella starts having cryptic dreams, years later. Now well into their teens the trio strengthens their friendship and two even find love with one another. Together, they enter high school and drama ensues. Gabriella finds herself torn between two boys. Tragedy strikes Molly with devastating consequences. Gilberto remains Gabriella’s constant through it all. In the midst of the chaos, the friends learn that they will be returning to Puerto Rico for a wedding. On the second trip to Puerto Rico, Gabriella, now fifteen years-old, is determined to uncover the clues in her dreams. She discovers that her dreams unlock mysteries of the ancient Taino tribe, in which she and her friends play an important role. Together they journey through time, to learn Gabriella’s fate, and a lesson of the inevitable law of Karma.",
  "genres": [],
  "author": "May Torres",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/8545304-enchanted-island"
}