{
  "title": "Islam and the Destiny of Man",
  "description": "Islam and the Destiny of Man is a wide-ranging study of the Muslim religion from a unique point of view. The author, a former member of the British Diplomatic Service, was brought up as an agnostic and embraced Islam at an early age after writing a book (commissioned by T.S. Eliot) on Eastern religions and their influence upon Western thinkers. As a Muslim he has retained his adherence to the perennial philosophy which, he maintains, underlies the teachings of all the great religions.The aim of this book is to explore what it means to be a Muslim, a member of a community which embraces a quarter of the world's population and to describe the forces which have shaped the hearts and the minds of Islamic people. After considering the historic confrontation between Islam and Christendom and analysing the difference between the three monotheistic faiths (Judaism, Christianity, and Islam), the author describes the two poles of Muslim belief in terms of 'Truth' and 'Mercy'--the unitarian truth which is the basis of the Muslim's faith and the mercy inherent in this truth. In the second part of the book he explains the significance of the Qur'an and tells the dramatic story of Muhammad's life and of the early Caliphate. Lastly, the author considers the Muslim view of man's destiny, the social structure of Islam, the role of art and mysticism and the inner meaning of Islamic teaching concerning the hereafter.Throughout this book the author is concerned not with the religion of Islam in isolation, but with the very nature of religious faith, its spiritual and intellectual foundations, and the light it casts upon the mysteries and paradoxes of the human condition.",
  "genres": [
    "Islam",
    "Religion",
    "Philosophy",
    "Nonfiction",
    "History",
    "Spirituality",
    "Cultural"
  ],
  "author": "Charles Le Gai Eaton",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/854930.Islam_and_the_Destiny_of_Man"
}