{
  "title": "In Memory Yet Green: The Autobiography, 1920-1954",
  "description": "The Good Doctor's two-hundredth book!The amazing Isaac Asimov has once more taken pen in hand to tackle his most fascinating subject to date — himself. In this first volume of his autobiography he recounts in his candid and inimitable manner his life's work in science, science fiction, and practically everything else.Beginning in the beginning, Asimov tells of his family's emigration from Russia when he was only three. We see the young Isaac, barely more than a toddler, determined to decipher Brooklynese. Intrigued by signs in the \"new\" language, he taught himself to read and whizzed through school as a child prodigy, without modesty, getting A's in everything except deportment. In his early years at school he befriended a talkative little boy who held Isaac spellbound with his stories. this was Isaac's first introduction to fiction, and soon afterward he began to borrow science fiction magazines from the rack in his father's candy store, reading them in secret, and returning them still looking like new.Entering college at the age of fifteen, he emerged with a doctorate in chemistry from Columbia University. Then there were his stints at the Navy Yard in Philadelphia during World War II and in the Army (for once the military couldn't fail to recognize a genius!), his first marriage, and his years teaching biochemistry — to standing ovations from his classes — at Boston University Medical School. All this time he was rising to prominence as a storyteller, author of The Foundation Trilogy and \"Nightfall,\" and laying the groundwork for his future as our most outstanding diverse science writer.In short, this is a book where the man who has been called a \"national resource and a natural wonder\" tells how he got to be that way. A treasure-trove for Asimov fans of all ages, all walks of life.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Memoir",
    "Biography Memoir",
    "Historical"
  ],
  "author": "Isaac Asimov",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/85519.In_Memory_Yet_Green"
}