{
  "title": "The Empire Novels",
  "description": "3 in 1 Novels. Includes The Stars, Like Dust, The Currents of Space and Pebble in the Sky.Description: In the 1950s, after penning his Future History stories-what would become his most famous series, Robots and Foundation-Isaac Asimov published his first three novels, the classic works that make up this exclusive SFBC omnibus. Set thousands of years after a nuclear holocaust ravaged the Earth, the Empire novels trace the Grand Master's vision of mankind's first halting steps toward galactic civilization and the birth of the first Galactic Empire.The Stars, Like Dust: A native of one of the backward planets conquered by the cruel Tyranni Empire, Biron Farrill is only days away from graduating from the University of Earth when someone tries to murder him in his sleep. The attack is part of a Tyranni plot to eliminate all resistance leaders, one of whom had been his own father. Now Biron has been chosen to step into his father's shoes and rally the rebellion. But once he casts his lot with the freedom fighters, he will find himself guarding against treachery on every side and facing the most difficult choice of his young life: to betray either the woman he loves or the revolution his father died to protect.The Currents of Space: Thousands of years after the events of The Stars, Like Dust, a man named Rik is wiped of his mind and deposited on the planet Florina-a wimpering, thumb-sucking half-child. Valona, a lonely peasant girl, adopts and takes care of him, and slowly his memory returns. But what he remembers entangles the pair in a web of interplanetary intrigue, in which they're hunted by high-ranking officials and spies. For what Rik knows about the future could topple an empire.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Classics",
    "Science Fiction Fantasy",
    "Novels",
    "Fantasy",
    "Space Opera"
  ],
  "author": "Isaac Asimov",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/85563.The_Empire_Novels"
}