{
  "title": "Owned & Owner",
  "description": "A story of unconditional slavery, told from inside a woman’s bound and naked skin. Far in the future exists a world of men, a planet where the only women are rare and exotic pets. These few women, convicted of crimes, have chosen their punishment: slavery on Henth. The few men who buy them know what they are getting: eager submissives, willing to accept the status of animals in order to be owned by men. Etrin is a young woman who makes this choice; Garid is the man who buys her. Their story is one of dominance and submission taken as far as the imagination can go.Long prior to the time of the book, Henth’s colonizers split along gender lines, and the women removed themselves to a separate planet. The two societies have almost lost sight and memory of each other, except for the rare occasions when a woman chooses slavery on Henth over the alternative punishment on her home planet. Driven by a deep need for submission, Etrin pushes her misbehaviour year after year, knowing that she’ll eventually be sent to Henth. When finally convicted and sentenced for her crimes, the bound Etrin is overwhelmed by her first contact with the men on the planet Henth. Soon transferred to the care of animal handlers, she’s caged for transport along with the other exotic pets, and prepared for the auction that will determine her new owner. Once Garid purchases his new pet, Etrin goes through stages of acceptance and the relinquishment of self as she faces the strict demands required of her. Meanwhile, Garid, driven and possessive, establishes a sense of ownership strong enough that he is finally able to share her. Readers learn of Etrin’s struggles in the form of first-person introspection, and Garid’s as he talks with his friend Therin, another dominant. This beautifully crafted novel delves deeply into the psychology and emotions associated with dominance and submission. The strong graphic content includes detailed scenes of masters and slaves, elaborate bondage, humiliation, whipping, punishment, caging, piercing, chastity belts, and ponygirl training.",
  "genres": [
    "BDSM",
    "Erotica",
    "Dark",
    "Science Fiction",
    "Adult",
    "Menage",
    "M F Romance"
  ],
  "author": "Anneke Jacob",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/8556125-owned-owner"
}