{
  "title": "Don't Step in the Leadership",
  "description": "\"For the armies of American office workers, Dilbert is a reminder that they are not alone.\" — Chicago Tribune  \"Cruel and incompetent bosses, plus the pervasive stupidity of people Adams calls 'in-duh-viduals,' are favorite targets in the strip, which appears...on the Internet, in best-selling books, and on refrigerator magnets, coffee mugs, desk calendars, software, neckties, and even underwear.\" — Playboy magazine  Does Dilbert creator Scott Adams have a hidden camera in your office—or is he just completely in tune with the inept managers, wacky office politics, and nonsensical leadership practices that seem to run wild at your company?  Stop looking for the camera. Dilbert has become a hugely successful strip because Adams feels your pain. How? Because this former employee of a major telecommunications company has been there. He's seen the leadership firsthand. And he knows that to successfully navigate the ludicrous world of business, you can't expect common sense to prevail, you need to keep a sense of humor, and above all, you must always look before you leap.  The strip's enormous popularity stems from the fact that its millions of readers easily identify with the crazy plots and wacky characters found within the corporate environment of collections like this one, Don't Step on the Leadership . Sure, most companies don't have a bespectacled engineer with a tie permanently curled up, a cynical talking dog, and a manager with two pointy tufts of hair. But it's the outrageous things Dilbert characters do and say that leave readers knowingly nodding their heads and, of course, laughing uproariously. The antics of Dilbert 's cast are based not only on Adams' own corporate experiences, but on the more than 300 e-mails he receives each day about the office dramas of his devoted fans.",
  "genres": [
    "Humor",
    "Comics",
    "Fiction",
    "Comic Strips",
    "Cartoon",
    "Graphic Novels",
    "Comedy"
  ],
  "author": "Scott Adams",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/85597.Don_t_Step_in_the_Leadership"
}