{
  "title": "Tapas on the Ramblas",
  "description": "Charity Wiser, matriarch of the Wiser clan by virtue of her wealth and power, is an indomitable provocateur ... and private detective Russell Quant's newest employer. There is more than a single rotten apple on this family tree, and Quant has been hired to discover which one is intent on murdering his client. To help him sleuth out the evil culprit, Charity Wiser arranges a family reunion aboard the opulent Friends of Dorothy Cruiseliner as it tours the most exotic ports of the Mediterranean. But smooth sailing is short-lived as undercurrents of clashes — local and tourist, gay and straight, trendy and traditional — offer Russell insight into the Wisers and reveal a family simmering with rage and greed. He begins to who doesn't want Charity Wiser dead? Shifting from his prairie stomping ground to a sea undulating with death, Quant's smarts, senses and sea legs are challenged. From tantalizing tapas and sweet sangria in Spain to the bitter taste of death in Sicily, Quant goes head to head with friends and foes in a series of unforgettable locales. Come aboard a sensual journey of sun and sea brine, caviar and champagne on a cruise replete with the luxury of murder. Anthony Bidulka is the author of Amuse Bouche and Flight of Aquavit, and is the winner of the Lambda Literary Award. Praise for Anthony Bidulka's work \"... another bright and witty novel from Anthony Bidulka ... There's plenty of action here, and Bidulka spreads it out with witty dialogue, smart commentary and plenty of good, sharp writing.\" — The Globe and Mail \"Bidulka treats the reader to enough red herrings with which to open a fishmarket and more than one writer's fair share of keen observations and appealing bons mots.\" — Outlooks \"... the pages turn at a frantic speed, each suspenseful chapter a chaser for the one preceding.\" — Swerve",
  "genres": [
    "Mystery",
    "M M Romance",
    "LGBT",
    "Fiction",
    "Canada",
    "Gay",
    "Gay Fiction"
  ],
  "author": "Anthony Bidulka",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/856134.Tapas_on_the_Ramblas"
}