{
  "title": "Lost Girls",
  "description": "NY Times, USA Today, Wall Street Journal Bestselling Author Bob MayerOver four million books sold. Translated into over a dozen languages.An alias of prolific bestseller Bob Mayer—whose second novel with Jennifer Crusie, Agnes and the Hitman, is due in August (Reviews, June 4)—Doherty is a bestseller in his own right with his Area 51 books, among others. This terrific follow-up to Bodyguard of Lies continues to track the Cellar, a government organization whose task is to police rogue agents in the CIA, FBI and other U.S. bureaus. Maj. Jack Gant is called in from his South Carolina island home to oversee an investigation involving the abduction of Emily Cranston, daughter of Fort Bragg Special Warfare Center commander Col. Samuel Cranston. The motive for the abduction is revenge, and the perpetrators have been highly trained in how to carry it out—by the U.S. government. As related crimes pile up, Doherty delivers top-notch action and adventure, creating a full cast of lethal operatives armed with all the latest weaponry. Excellent writing and well-drawn, appealing characters help make this another taut, crackling read from Doherty. (Aug.)Considered for option by Smokehouse, George Clooney’s production company.Who polices the world of covert operations? Enter the Cellar, the most secret spy organization hiding deep within the United States.Deep in the forests of Kentucky, a girl is held captive.In Oklahoma, a young preschool teacher is murdered in front of her students.In the Panhandle of Florida, a college undergrad is kidnapped from a nightclub.These seemingly unrelated crimes catch the eye of the Cellar, the ultrasecret cell of operatives set up to police all other government agencies. Cellar operatives Gant and Neeley, along with profiler Susan Golden, must track down those responsible. But these are not ordinary criminals. They are a highly trained Special Forces sniper team. Crisscrossing the United States as new Cellar head Hannah Masterson calls the shots from up high, the Cellar operatives soon find themselves being targeted. Whoever is behind this knows the ultra top-secret Cellar's tactics all to well.Underneath this web of death, deceit, and revenge lies an even more shocking crime . . . a conspiracy that powerful men will sacrifice their lives -- and the lives of their families -- to protect.",
  "genres": [
    "Thriller",
    "Fiction",
    "Suspense",
    "M M Romance",
    "Mystery",
    "Adventure",
    "Military Fiction"
  ],
  "author": "Bob Mayer",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/8557976-lost-girls"
}