{
  "title": "Selamatkan Islam Dari Muslim Puritan",
  "description": "Di bawah serbuan gencar modernitas, muslim puritan dan muslim moderat saling berebut klaim “kebenaran iman Islam”. Masalahnya, muslim puritan tak peduli pada “Islam yang hidup” di masa kini maupun dalam sejarah. Mereka malah menggandrungi “Islam yang dibayangkan”, baik sebagai mitologi masa silam maupun utopia masa datang. Mereka agresif, bersuara lantang, dan didanai dengan baik. Yang terburuk dari semua itu, mereka berhasil melakukan aksi kekerasan mengerikan sehingga menyentak kesadaran semua orang, termasuk nonmuslim. Buku ini menyeru mayoritas-diam untuk mengakhiri kebungkaman. Tradisi moral Islam telah dicuri dan dihancurkan oleh minoritas-bersuara-lantang. Tak pelak, muslim moderat harus merebut hati dan pikiran muslim dan nonmuslim seluruh dunia. Mereka mesti memandang diri dalam kondisi jihad-defensif: melindungi Islam dari serangan misinterpretasi dan disinformasi kaum puritan. Jika kaum puritan berbicara lantang disertai kekerasan, maka kaum moderat harus berbicara lebih lantang diiringi tindakan damai. Bagi Abou El Fadl, Islam dan umat Islam mesti menjadi sarana perwujudan rahmat dan kasih sayang Tuhan bagi semua manusia. Kasih sayang dan moderasi yang menjadi nilai dasar Islam harus diingat dan dibiakkan dalam hati umat Islam. Agar ekstremisme tak punya tempat. Agar kebersamaan semua manusia dalam menegakkan nilai-nilai kebertuhanan sungguh-sungguh mendulang kemajuan. Tak ada pilihan lain. Melintasi momen transformatif dengan latar era global, Islam saat ini ditandai dengan pergulatan keras antara dua paradigma pemikiran: moderat dan puritan. Saat terjadi kekosongan otoritas keagamaan dalam dunia Islam modern, keduanya saling berebut klaim untuk mendefinisikan makna kebenaran Islam.Khaled Abou El Fadl memberikan peta cukup komprehensif mengenai kedua gugus pemikiran yang akan banyak berperan dalam menentukan masa depan Islam itu. Dimulai dengan latar besar yang menjadi medan pergulatan keduanya dalam menafsirkan berbagai segi ajaran Islam, buku ini secara khusus menyoroti sejarah kelahiran muslim puritan modern yang berbiak dalam ideologi Wahhabisme dan menyebar dengan bendera Salafisme. Abou El Fadl lalu membandingkan dan memperhadapkan pandangan kaum moderat dan puritan seputar isu-isu kunci yang tak hanya mencerminkan ketegangan kritis di dalam Islam, tetapi juga sering menjadi inti persoalan yang sehari-hari harus diatasi oleh umat Islam dan seluruh umat manusia. Dengan mengupas tema-tema seperti demokrasi dan hak asasi, peran kaum perempuan, interaksi dengan nonmuslim, hingga soal jihad dan terorisme, Abou El Fadl membangun visi Islam moderat yang amat diperlukan saat ini untuk merebut kembali tradisi moral Islam. Buku ini adalah semacam jihad-tandingan untuk menyelamatkan Islam dari ekstremisme dan bidah kaum puritan.",
  "genres": [
    "Islam",
    "Religion",
    "Nonfiction",
    "History",
    "Politics",
    "Faith",
    "Sociology"
  ],
  "author": "Khaled Abou El Fadl",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/8565193-selamatkan-islam-dari-muslim-puritan"
}