{
  "title": "Twisted Christians",
  "description": "Twisted Christians is a story of spiritual warfare. It exposes the realm of the spirit world, where demons manipulate the minds of nonbelievers and Christians alike. It is a story that relates to biblical prophecies as well as paranormal activity and the world of the occult. Sam Johnson's prayer for guidance not only introduces him to the world of spiritual warfare, but it also changes the course of events throughout the Northern Virginia area. Not to mention that the prayer also invokes the wrath of Lucifer—the ancient fallen angel and leader of the rebellion against Yahweh, also known as God. Sam becomes a target for demonic attack. Paul Taylor is a Messianic Jew who befriends Sam. Paul’s views on the Bible help Sam to make more sense of the Holy Scriptures, which seem to conflict with the teachings of his church. As with any person who diligently researches the Holy Scriptures, Sam finds himself struggling to separate the spirit from the flesh. Bill Thorougood is the president and CEO of Vodoun Technologies, Inc. Born in Europe, he now lives in a mansion located in the outskirts of Winchester, Virginia. He is a mysterious man whose ties with the United Nations lead to the installation of 2,048-bit encrypted microchips on all computers' motherboards and in cellular phones and other RF devices. Brian Stultz is a computer hacker who is known throughout the computer underground as Cybermancer. His recent challenge by his colleague, Dark_Impress, is to crack the uncrackable 2,048-bit encryption chip created by Vodoun Technologies. What he discovers within the microchip is that the first 16 bits of binary code within the PROM area contains the string 0000001010011010—translated 666 in decimal form. Dr. Jacqueline Rich is a parapsychologist and independent government contractor whose Top Secret affiliation with the Department of Defense's National Reconnaissance Office leads her on her own spiritual journey. Her employee, Roger Gibson, is gifted with the ability to project his astral body into the spirit world. Their latest research and development techniques prove to be useful in espionage, but deadly as they learn more about the creatures who dwell in the astral plane. Christie Sloan was a Catholic until she was excommunicated from the Church for divorcing her abusive husband. She later became a white witch, practicing Wicca. Her taste of power led her into black magic, and she became a necromancer's apprentice. Conjuring demons has a way of causing her to black out and lose vital memories. Sancho was a fallen angel. Joining the rebellion against Yahweh, he became one of Lucifer’s high-ranking dark angels. His mission was spread adultery and promiscuous sex throughout all of Mexico. But one night while wandering around the east coast of the United States, he met a little girl who reminded him of the innocence of his past. The next two decades would prove to be the hardest for him, as the girl matured into a beautiful woman and his only desire would be to please her.",
  "genres": [],
  "author": "Scott Meade",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/8565310-twisted-christians"
}