{
  "title": "Red Heat",
  "description": "The Cold War was never this cold…CIA analyst Julie Severin hates anything to do with Russia—the country that killed her cold war spy father. She also has a phobia about large bodies of water. Needless to say, she is horrified when she is ordered at the last minute to join an international team of scientists going deep under the frigid waters of the Arctic on an ancient Russian rust bucket of a submarine. Her mission: to recover a tiny data card hidden somewhere on the sub by a murdered CIA mole…and while she’s at it, acquire the sub’s arrogant but annoyingly attractive commander as the asset’s replacement.When Julie’s life is suddenly threatened by an enemy agent hunting the same hidden microcard, she must turn to her nemesis for help. But the killer handsome Russian captain is hiding his own shocking secrets…Or this hot…Daring rogue submarine driver Captain Nikolai Kirill Romanoff is having the worst year of his life. Unfairly disgraced and demoted to driving the oldest, most dilapidated excuse for a diesel submarine in the entire Russian Navy, Nikolai’s youthful KGB past has come back to haunt him in a way he never anticipated: a compulsory undercover mission that will require all his considerable skill as an operative , a submariner…and as a man. Nikolai, his crew, and nine innocent scientists are now hovering at the bottom of the Bering Strait in a 2000 sq foot tin coffin, under attack from an unknown enemy, and he must extract information vital to their survival from a beautiful American spy—by any means necessary.As Nikolai and Julie frantically join forces to save the floundering vessel from a treacherous blitz attack that threatens to send them all to a watery grave, the two former adversaries find themselves fighting a losing battle against a sizzling attraction that far surpasses international borders, ancient hurts, and a ruthless common enemy.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Military Fiction",
    "Suspense",
    "Contemporary",
    "Contemporary Romance",
    "Military Romance"
  ],
  "author": "Nina Bruhns",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/8562960-red-heat"
}