{
  "title": "The Art of Not Being Governed: An Anarchist History of Upland Southeast Asia",
  "description": "For two thousand years the disparate groups that now reside in Zomia (a mountainous region the size of Europe that consists of portions of seven Asian countries) have fled the projects of the organized state societies that surround them—slavery, conscription, taxes, corvée labor, epidemics, and warfare. This book, essentially an “anarchist history,” is the first-ever examination of the huge literature on state-making whose author evaluates why people would deliberately and reactively remain stateless. Among the strategies employed by the people of Zomia to remain stateless are physical dispersion in rugged terrain; agricultural practices that enhance mobility; pliable ethnic identities; devotion to prophetic, millenarian leaders; and maintenance of a largely oral culture that allows them to reinvent their histories and genealogies as they move between and around states.In accessible language, James Scott, recognized worldwide as an eminent authority in Southeast Asian, peasant, and agrarian studies, tells the story of the peoples of Zomia and their unlikely odyssey in search of self-determination. He redefines our views on Asian politics, history, demographics, and even our fundamental ideas about what constitutes civilization, and challenges us with a radically different approach to history that presents events from the perspective of stateless peoples and redefines state-making as a form of “internal colonialism.” This new perspective requires a radical reevaluation of the civilizational narratives of the lowland states. Scott’s work on Zomia represents a new way to think of area studies that will be applicable to other runaway, fugitive, and marooned communities, be they Gypsies, Cossacks, tribes fleeing slave raiders, Marsh Arabs, or San-Bushmen.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Anthropology",
    "Asia",
    "Sociology",
    "Philosophy"
  ],
  "author": "James C. Scott",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/8561344-the-art-of-not-being-governed"
}