{
  "title": "Poser: My Life in Twenty-three Yoga Poses",
  "description": "The studio was decorated in the style of Don’t Be Afraid, We’re Not a Cult. All was white and blond and clean, as though the room had been designed for surgery, or Swedish people. The only spot of color came from the Tibetan prayer flags strung over the doorway into the studio. In flagrant defiance of my longtime policy of never entering a structure adorned with Tibetan prayer flags, I removed my shoes, paid my ten bucks, and walked in . . .Ten years ago, Claire Dederer put her back out while breastfeeding her baby daughter. Told to try yoga by everyone from the woman behind the counter at the co-op to the homeless guy on the corner, she signed up for her first class. She fell madly in love.Over the next decade, she would tackle triangle, wheel, and the dreaded crow, becoming fast friends with some poses and developing long-standing feuds with others. At the same time, she found herself confronting the forces that shaped her generation. Daughters of women who ran away to find themselves and made a few messes along the way, Dederer and her peers grew up determined to be good, good, good—even if this meant feeling hemmed in by the smugness of their organic-buying, attachment-parenting, anxiously conscientious little world. Yoga seemed to fit right into this virtuous program, but to her surprise, Dederer found that the deeper she went into the poses, the more they tested her most basic ideas of what makes a good mother, daughter, friend, wife—and the more they made her want something a little less tidy, a little more improvisational. Less goodness, more joy.Poser is unlike any other book about yoga you will read—because it is actually a book about life. Witty and heartfelt, sharp and irreverent, Poser is for anyone who has ever tried to stand on their head while keeping both feet on the ground.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Book Club",
    "Parenting"
  ],
  "author": "Claire Dederer",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/8564634-poser"
}