{
  "title": "The Drug and Other Stories",
  "description": "With an Introduction by William Breeze and a Foreword by David Tibet. This volume brings together the uncollected short fiction of the poet, writer and religious philosopher Aleister Crowley (1875 1947). Crowley was a successful critic, editor and author of fiction from 1908 to 1922, and his short stories are long overdue for discovery. Of the forty-nine stories in the present volume, only thirty were published in his lifetime. Most of the rest appear here for the first time. Like their author, Crowley's stories are fun, smart, witty, thought-provoking and sometimes unsettling. They are set in places he had lived and knew well: Belle Epoque Paris, Edwardian London, pre-revolutionary Russia and America during the first World War. The title story The Drug stands as one of the first accounts–if not the first–of a psychedelic experience. His Black and Silver is a knowing early noir discovery that anticipates an entire genre. Atlantis is a masterpiece of occult fantasy, a dark satire that can stand with Samuel Butler's \nErewhon\n. Frank Harris considered The Testament of Magdalen Blair the most terrifying tale ever written. Extensive editorial end-notes give full details about the stories.The three characteristics --Ambrosii Magi Hortus Rosarum --The wake world --T'ien Tao --The stone of the philosophers --The murder in X. Street --The drug --Cancer? A study in nerves --At the fork of the roads --The dream circean --Illusion d'amoureux --The soul-hunter --The daughter of the horseleech --The violinist --The vixen --The electric silence --The ordeal of Ida Pendragon --Apollo bestows the violin --Across the gulf --His secret sin --The woodcutter --Professor Zircon --The vitriol-thrower --The testament of Magdalen Blair --Ercildoune --The stratagem --Lieutenant Finn's promotion --The chute --A death bed repentance --Felo de se --The argument that took the wrong turning --The professor and the plutocrat --Robbing Miss Horniman --The ideal idol --Face --Which things are an allegory --The crime of the impasse de l'enfant Jésus --Atlantis --The mysterious malady --The bald man --Black and silver --The humour of Pauline Pepper --A nativity --Every precaution --God's journey --The colour of my eyes --Dedit! --Colonel Pacton's brother --The vampire of Vespuccia --As you were! --Only a dog --The virgin --A masque --The escape",
  "genres": [
    "Horror",
    "Short Stories",
    "Occult",
    "Fiction",
    "Classics",
    "Collections",
    "Fantasy"
  ],
  "author": "Aleister Crowley",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/8566171-the-drug-and-other-stories"
}