{
  "title": "Fable de Venise",
  "description": "Costume de marin, cheveux bruns, anneau à l'oreille gauche. La silhouette élancée et élégante. Une lueur d'amusement et d'ironie bienveillante dans le regard. L'air de se tenir à distance. L'art d'observer choses et gens avec détachement. Certains le disent pirate. Lui se prétend gentilhomme de fortune... Ainsi apparaît Corto Maltese, fils d'une gitane andalouse et d'un marin des Cornouailles. Une gueule, une personnalité, un destin. Une légende de la bande dessinée devenue légende tout court. Certes, Corto est une créature de papier, inventée par le grand Hugo Pratt. Mais à force de le voir hanter notre imaginaire, on finit par s'interroger. Et s'il avait réellement existé ? Et si Pratt ne s'était fait que le dépositaire de ses souvenirs, l'humble biographe d'une destinée trop belle pour n'être qu'une simple fiction ?Corto Maltese voit le jour en 1967, dans La Ballade de la mer salée. Piètres débuts : quand le lecteur fait sa connaissance, il est torse nu, pas rasé, pieds et mains attachés à un radeau grossier, en train de dériver au gré des courants du Pacifique. Mais très vite, Hugo Pratt en fait son personnage fétiche et lui offre une vie hors du commun. Corto a traversé le siècle et parcouru le vaste monde. Sa route a croisé celles de grandes figures de l'Histoire. Il s'est initié aux mystères de l'ésotérisme, frotté aux secrets de la kabbale et de la franc-maçonnerie. Mais s'est toujours voulu un homme libre, refusant tout embrigadement, gardant ses distances avec les dogmes et les drapeaux de toutes sortes. Un homme également libre de tout engagement avec les femmes, même si elles occupent une place essentielle dans l'existence de cet incorrigible romantique. Et puis, un jour des années trente, quelque part du côté de l'Espagne, alors que tonnent les canons de la guerre civile, on perd sa trace. Corto, pourtant, n'est pas mort. Il s'est simplement retiré pour achever sa vie près de l'océan Pacifique, à l'abri du tumulte du monde.Mais Corto Maltese reste à jamais présent pour ses lecteurs, qui puisent dans les livres d'Hugo Pratt de quoi nourrir leurs rêves d'ailleurs. --Gilbert Jacques",
  "genres": [
    "Graphic Novels",
    "Bande Dessinée",
    "Adventure",
    "Fiction",
    "Graphic Novels Comics",
    "Historical Fiction",
    "Comic Book"
  ],
  "author": "Hugo Pratt",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/856708.Fable_de_Venise"
}