{
  "title": "Urgent Message from Mother: Gather the Women, Save the World",
  "description": "The message to all women of the world is \"Wake Up Arise Do not ask for permission to gather the women. What cannot be done by men, or by individual women, can be done by women together. Earth is Home.\" Jean Shinoda Bolen's life's work -- her Jungian-inspired insights in The Tao of Psychology, the blockbuster Goddesss in Every Woman, the empowering Crones Don't Whine and The Millionth Circle -- all lead up to this book. It is an urgent message and an empowering one. \"When women are strong together, women can be fiercely protective of what we love.\" Bolen's poetic polemic explores the psychological, spiritual, and scientific aspects of women as collaborators for change. She begins with a Jungian examination of the idea of the Holy Grail archetype as \"every woman's secret\" and the transformative power of the sacred feminine -- the Goddess, Gaia, Earth Mother. Bolen explains Rupert Sheldrake's Theory of Morphic Resonance, which describes how societies and even species can undergo rapid evolution when they reach a tipping point. She explains that \"we've learned that women gathering together in groups and telling the truth of their lives can actually change the world.\" She points to a fascinating UCLA study proving that women react to stress differently than their male counterparts. Instead of the \"fight or flight\" reaction, women have a \"tend and befriend\" response as a result of an increase in oxytocin, the maternal bonding hormone. While men become more adrenalized and aggressive, women nurture and protect -- biologically. From this and other compelling evidence Bolen makes a strongly convincing case that now is the time for women to lead -- to fiercely protect all that we love. Urgent Message from Mother offers a unique combination of visionary thinking and practical how-to and is Jean Shinoda Bolen's most activist work to-date. Written in a lyrical language that inspires, this book seeks to galvanize the still untapped power of women coming together to change our world. Listen to your mother; she is calling.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Spirituality",
    "Womens",
    "Nature"
  ],
  "author": "Jean Shinoda Bolen",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/85706.Urgent_Message_from_Mother"
}