{
  "title": "Is William Martinez Not Our Brother?: Twenty Years of the Prison Creative Arts Project",
  "description": "A prison arts program attempts to reverse the trends of incarceration in AmericaPrisons are an invisible, but dominant, part of American society: the United States incarcerates more people than any other nation in the world. In Michigan, the number of prisoners rose from 3,000 in 1970 to more than 50,000 by 2008, a shift that Buzz Alexander witnessed firsthand when he came to teach at the University of Michigan. Is William Martinez Not Our Brother? describes the University of Michigan's Prison Creative Arts Project (PCAP), a pioneering program founded in 1990 that provides university courses, a nonprofit organization, and a national network for incarcerated youth and adults in Michigan juvenile facilities and prisons. By giving incarcerated individuals an opportunity to participate in the arts, PCAP enables them to withstand and often overcome the conditions and culture of prison, the policies of an incarcerating state, and the consequences of mass incarceration. Praise for the Prison Creative Arts Project: \"I cannot overstate how profoundly my experience with the Prison Creative Arts Project has shaped my life. It began my engagement with prison issues, developed both my passion and my understanding of them, and I continue to draw on both as I seek to contribute to a more rational, humane and just criminal justice system. PCAP prepared me to adapt to any situation, to take risks, to collaborate with people very different from myself in a manner infused with total respect.\"—Jesse Jannetta, researcher, Justice Policy Center, the Urban Institute \"PCAP provided me with an emotional education that I would not have received otherwise. PCAP continually opens the doors to the stark reality of our criminal justice system as well as our society's ability to right the wrongs of that system and provide justice to millions of men, women, and children . . . PCAP showed me the power I, and the individuals around me, have to make a difference.\"—Anne Bowles, Policy and Outreach Associate, Institute for Higher Education Policy \"PCAP looks beyond past mistakes and personal shortcomings to find the beauty and creative energies that help to heal the hurts we've done to others. They have not forgotten that we are human too! . . . Their program has given me a way to reach people that I would otherwise never reach. For that, I owe PCAP everything. They are my lifeline that I cling to.\"—Bryan Picken, incarcerated artist",
  "genres": [],
  "author": "Buzz Alexander",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/8570080-is-william-martinez-not-our-brother"
}