{
  "title": "تاريخ أوروبا والعالم في العصر الحديث",
  "description": "النيل والفرات:يعتبر هذا الكتاب واحداً من أهم الكتب العربية التي صدرت في هذا القرن فالمؤلف باحث معروف، ومفكر رائد هو الدكتور \"عبد العظيم رمضان\" أما الصفحات فرحلة علمية شيقة تضيء الجوانب المظلمة من تاريخ أوروبا العالم الحديث من ظهور الطبقة البورجوازية الأوروبية في القرن الحادي عشر هذه الطبقة التي غيرت وجه الحياة في أوروبا والعالم وصبغتها بصبغتها، وانتهاء بالحرب الباردة في القرن العشرين. من هنا تأتي أهمية هذا الكتاب، ومن هنا تبرز قيمته كبحث نادر يتجول في هدوء بين أروقة تسعة قرون من الزمن تضم بين دفتيها تاريخ العالم الحديث بكل سماته وخصائصه ومعالمه التي تميزه عن العالم الوسيط. في هذا الكتاب الثلاثي الأجزاء يقيم الباحث التاريخ لكشف الأستار، عن كثير من الحقائق والمواقف والأزمات، وذلك من خلال حديثه في الجزء الأول عن ظهور الطبقة البرجوازية الأوروبية وتطورها وعن عصر النهضة الأوروبية، وحركة الإصلاح الديني، وظهور القومية والحروب الإيطالية والكشوف الجغرافية والموجة الاستعمارية الأولى في القرن 15 وحتى القرن 18، والثورة الفرنسية وحروبها ونابليون. أما في الجزء الثاني فيتابع المؤرخ استعراضه للتاريخ مدوناً تسوية مؤتمر فينا، مستعرضاً الحركات القومية والدستورية في القرن التاسع عشر، والانقلاب الصناعي والتنافس الاستعماري في هذا القرن والوحدة الإيطالية والألمانية، وظهور اليابان، والتحالفات الأوروبية مثل الحرب العالمية الأولى، الثورة الروسية سنة 1917 بعد ذلك يلقي الضوء أسباب الحرب العالمية الأولى، وتأثيرها على العالم. وفي الجزء الثالث يتحدث المؤرخ عن قيام ألمانيا النازية بعد الحرب على أنقاض القيصرية، وعن اشتعال نيران الحرب العالمية الثانية التي انتهت بهزيمة الفاشية والنازية، وبحث انقسام العالم إلى معسكرين رأسمالي واشتراكي، وعن نشوب الحرب الباردة بين المعسكرين، وعن ظهور العالم الثالث ودول عدم الانحياز... ما يميز هذا الكتاب هو إتباعه للمنهج التاريخي من ناحية تقسيماته التي تقوم على أساس زمني، وهو أمر طبيعي استلزمه تتبع النشاط السياسي والاقتصادي والاجتماعي للبرجوازية الأوروبية، والذي كان يحدث بشكل تكاملي ومراحل تترتب على مراحل، وبالنسبة لكتاب في هذا الحجم كان من الضروري إعطاء أولويات في التناول، وتوسيع في بعض الموضوعات وتضيق في بعضها الآخر، وفقاً لرؤية المؤرخ. كما تطلب ذلك التركيز على بعض والاكتفاء بالإشارة إلى موضوعات أخرى في شكل تحليلي، وهذا ما يميز الكتب عن الموسوعات التاريخية، فهدفه هو أن يلم القارئ بما طرأ على العالم الحديث من تطور تاريخي في إطار كتاب محدود بصفحاته، هذا وقد تعمد الباحث إلحاق كتابه ببعض الخرائط وذلك لمادة الكتاب، وكذلك ببعض المراجع لمن رغب في الاستزادة من هذه المادة.",
  "genres": [
    "History"
  ],
  "author": "عبد العظيم رمضان",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/8571374"
}