{
  "title": "Chinaberry Sidewalks",
  "description": "From the acclaimed musician comes a tender, surprising, and often uproarious memoir about his dirt-poor southeast Texas boyhood.The only child of a hard-drinking father and a Holy Roller mother, Rodney Crowell was no stranger to bombast from an early age, whether knock-down-drag-outs at a local dive bar or fire-and-brimstone sermons at Pentecostal tent revivals. He was an expert at reading his father’s mercurial moods and gauging exactly when his mother was likely to erupt, and even before he learned to ride a bike, he was often forced to take matters into his own hands. He broke up his parents’ raucous New Year’s Eve party with gunfire and ended their slugfest at the local drive-in (actual restaurants weren’t on the Crowells’ menu) by smashing a glass pop bottle over his own head.Despite the violent undercurrents always threatening to burst to the surface, he fiercely loved his epilepsy-racked mother, who scorned boring preachers and improvised wildly when the bills went unpaid. And he idolized his blustering father, a honky-tonk man who took his boy to see Hank Williams, Jerry Lee Lewis, Carl Perkins, and Johnny Cash perform live, and bought him a drum set so he could join his band at age eleven.Shot through with raggedy friends and their neighborhood capers, hilariously awkward adolescent angst, and an indelible depiction of the bloodlines Crowell came from, Chinaberry Sidewalks also vividly re-creates Houston in the a rough frontier town where icehouses sold beer by the gallon on paydays; teeming with musical venues from standard roadhouses to the Magnolia Gardens, where name-brand stars brought glamour to a place starved for it; filling up with cheap subdivisions where blue-collar day laborers could finally afford a house of their own; a place where apocalyptic hurricanes and pest infestations were nearly routine.But at its heart this is Crowell’s tribute to his parents and an exploration of their troubled yet ultimately redeeming romance. Wry, clear-eyed, and generous, it is, like the very best memoirs, firmly rooted in time and place and station, never dismissive, and truly fulfilling.",
  "genres": [
    "Music",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Biography Memoir",
    "Autobiography",
    "Coming Of Age"
  ],
  "author": "Rodney Crowell",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/8574352-chinaberry-sidewalks"
}