{
  "title": "Quatre sœurs",
  "description": "В старинном доме Виль-Эрве в двух шагах от Атлантического океана живут сестры Верделен. Они самостоятельно ведут хозяйство, взрослеют, находят друзей и первую любовь. Этим девочкам — от 9 до 23 лет — очень нужна поддержка и любовь родителей. Но мамы и папы рядом нет, они трагически погибли в автокатастрофе.Каждая из четырех частей книги, названная по имени одной из сестер и одновременно по времени года, показывает точку зрения одной из них на происходящие события и указывает на течение времени. Таким образом, вместе с героинями читатель проживает целый год.Постепенно девочки справляются с горем и привыкают к новой жизни. Им помогают в этом кузены и кузины, тетушки, друзья, соседи. И, конечно же, собственное позитивное восприятие этого мира, осознание того, что они — Семья и могут справиться с любыми ситуациями. Приключения и пикантные диалоги, мягкий юмор и мудрость — вместе с сестрами можно смеяться и плакать, радоваться и грустить.Французская писательница Малика Ферджух (родилась в Алжире в 1957 году) создала удивительно обаятельный и солнечный роман. В нем непростая тема потери родителей показана максимально деликатно и светло. В разных героинях любая юная читательница без труда узнает себя. А более взрослая аудитория непременно оценит динамичность повествования и яркие образы всех действующих лиц романа.Автор многие годы занималась историей кино и потому мастерски выстраивает диалоги и блестяще жонглирует толпой самых разных персонажей. В «КомпасГиде» уже выходила трилогия писательницы «Мечтатели Бродвея», которая полюбилась многим читателям.Безупречный перевод Нины Хотинской передает тончайшие оттенки чувств героинь. А портреты сестер, сделанные художницей Дарьей Швейдель, дают читателю возможность почувствовать одновременно их смелость и хрупкость.",
  "genres": [
    "Young Adult",
    "France",
    "Novels",
    "Fiction",
    "Contemporary"
  ],
  "author": "Malika Ferdjoukh",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/8575631-quatre-s-urs"
}