{
  "title": "A Swiftly Tilting Planet",
  "description": "Book four in Madeleine L'Engle's A Wrinkle in Time Quintet. The Murry and O'Keefe Families enlist the help of the unicorn, Gaudior, to save the world from imminent nuclear war.“An intricately woven fantasy.” ―Booklist, starred reviewIn A Swiftly Tilting Planet by Madeleine L'Engle, a companion to the Newbery Award winner A Wrinkle in Time and A Wind in the Door, fifteen-year-old Charles Wallace and the unicorn Gaudior undertake a perilous journey through time in a desperate attempt to stop the destruction of the world by the mad dictator Madog Branzillo.They are not alone in their quest. Charles Wallace's sister, Meg--grown and expecting her first child, but still able to enter her brother's thoughts and emotions by \"kything\"--goes with him in spirit.Charles Wallace must face the ultimate test of his faith and his will as he is sent within four people from another time, there to search for a way to avert the tragedy threatening them all.Praise for A Swiftly Tilting “Charles Wallace (A Wrinkle in Time), now 15, Meg, and the Murrys reappear in an intricately woven fantasy in which the boy time-spins through a tangle of history to find and mend the broken link that threatens to disturb the harmony of today.” ―Booklist, starred reviewBooks by Madeleine L'EngleA Wrinkle in TimeA Wind in the DoorA Swiftly Tilting PlanetMany WatersAn Acceptable TimeA Wrinkle in The GraphicNovel by Madeleine L'Engle; adapted & illustrated by A graphic novel adaptation of Madeleine L'Engle's ground-breakingscience fiction and fantasy classic.Intergalactic P.S. 3 by Madeleine L'Engle; illustrated by Hope Astandalone story set in the world of A Wrinkle in Time!The Austin Family ChroniclesMeet the Austins (Volume 1) The Moon by Night (Volume 2) The Young Unicorns (Volume 3)A Ring of Endless Light (Volume 4) A Newbery Honor book!Troubling a Star (Volume 5)The Polly O'Keefe booksThe Arm of the StarfishDragons in the WatersA House Like a LotusAnd Both Were YoungCamillaThe Joys of Love",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Science Fiction",
    "Childrens",
    "Classics",
    "Middle Grade"
  ],
  "author": "Madeleine L'Engle",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/8581887-a-swiftly-tilting-planet"
}