{
  "title": "Treason: Liberal Treachery from the Cold War to the War on Terrorism",
  "description": "“Liberals’ loyalty to the United States is off-limits as a subject of political debate. Why is the relative patriotism of the two parties the only issue that is out of bounds for rational discussion?”In a stunning follow-up to her number one bestseller Slander , leading conservative pundit Ann Coulter contends that liberals have been wrong on every foreign policy issue, from the fight against Communism at home and abroad, the Nixon and the Clinton presidencies, and the struggle with the Soviet empire right up to today’s war on terrorism. “Liberals have a preternatural gift for always striking a position on the side of treason,” says Coulter. “Everyone says liberals love America, too. No, they don’t.” From Truman to Kennedy to Carter to Clinton, America has contained, appeased, and retreated, often sacrificing America’s best interests and security. With the fate of the world in the balance, liberals should leave the defense of the nation to conservatives.Reexamining the sixty-year history of the Cold War and beyond—including the career of Senator Joseph McCarthy, the Whittaker Chambers–Alger Hiss affair, Ronald Reagan’s challenge to Mikhail Gorbachev to “tear down this wall,” the Gulf War, and our present war on terrorism—Coulter reveals how liberals have been horribly wrong in all their political analyses and policy prescriptions. McCarthy, exonerated by the Venona Papers if not before, was basically right about Soviet agents working for the U.S. government. Hiss turned out to be a high-ranking Soviet spy (who consulted Roosevelt at Yalta). Reagan, ridiculed throughout his presidency, ended up winning the Cold War. And George W. Bush, also an object of ridicule, has performed exceptionally in responding to America’s newest threats at home and abroad.Coulter, who in Slander exposed a liberal bias in today’s media, also examines how history, especially in the latter half of the twentieth century, has been written by liberals and, therefore, distorted by their perspective. Far from being irrelevant today, her clearheaded and piercing view of what we’ve been through informs us perfectly for challenges today and in the future.With Slander , Ann Coulter became the most recognized and talked-about conservative intellectual of the year. Treason , in many ways an even more controversial and prescient book, will ignite impassioned political debate at one of the most crucial moments in our history.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Humor",
    "American History",
    "Audiobook",
    "Terrorism"
  ],
  "author": "Ann Coulter",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/85791.Treason"
}