{
  "title": "Why Romeo Hates Juliet",
  "description": "A Laugh-Out-Loud Romantic Comedy Sure To Tickle Your Funny Bone!A Big-Time Movie Star… As a world-famous celebrity, it would appear that Romeo Boyd is living the life of a… king. But when he grows lazy and spends his days partying, drinking, and sleeping (with and without a partner), it looks like his career is on the high road to the ‘Hollywood Has-Been Heap’. What’s a bad boy to do?A Bestselling Novelist… With a blockbuster book behind her and another one in the oven, it would appear that Juliet Soma is living the life of a… queen. But with her book money spent and suffering a bad case of writer’s block, she’s stressed to the max and on the verge of a nervous breakdown. What’s a desperate girl to do?A Simple Vacation for Him… There’s only one thing for Romeo to do… go to his beach house on Prince Edward Island and party hard & loud with his friends, that’s what!A Simple Vacation for Her… There’s only one thing for Juliet to do… go with her sister, Sara, to a beach house on Prince Edward Island for some quiet time to relax and finish writing her book in peace, that’s what!But neither Romeo nor Juliet get what they want.Instead they get each other…A Desperate Battle Begins... When Romeo mistakes Juliet for a stripper, and Juliet inadvertently gets the movie star arrested, the two neighbors declare all-out war on each other!A Bizarre Romance… And then, when Juliet accidentally causes Romeo to lose his memory and the actor mistakenly believes she is his wife, their worlds flip upside down.A Secret Twist… But does he really have amnesia? No, of course not! He’s just faking it to get his revenge on the sexy troublemaker-next door and make her his slave. But can he really go through with his madcap plan, especially when she kisses like sweet heaven and feels so right in his arms? The ensuing craziness is sure to leave you bent over laughing!",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary Romance",
    "Humor",
    "Contemporary",
    "Fiction",
    "Romantic Comedy"
  ],
  "author": "Anna Mara",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/13141971-why-romeo-hates-juliet"
}