{
  "title": "Minding Ben",
  "description": "At sixteen, Grace Caton boards her first airplane, leaving behind the tropical papaya and guava trees of her small village in Trinidad for another island, this one with tall buildings, graceful parks, and all the books she can read. At least that's what Grace imagines. But from the moment she touches down, nothing goes as planned. The aunt who had promised to watch over her disappears, and Grace finds herself on her own.  Grace stumbles into the colorful world of Crown Heights, Brooklyn, having been taken in hand, sort of, by a fellow islander, Sylvia. Here, she's surrounded by other immigrants also finding their way in America. From her Orthodox Jewish landlord, Jacob, to her wannabe Jamaican friend, Kathy, who feels that every outfit can be improved with a Bedazzler and a low-cut top, there's much to learn about her new city.  Most challenging of all is figuring out her new employers, the Bruckners, an upper-middle-class family in Manhattan. The job is strange Grace's duties range from taking daily nude photos of her pregnant boss (a shock to her, since she's never even seen her own mothernaked) to dressing in a traditional maid's costume to serve Passover seder. But Grace loves four-year-old Ben, and she's intrigued by the alternately friendly and scheming nannies who spend their days in Union Square Park, and by their constant gossip about who's hired, who's fired, and who, scandalously, married her boss. As the seasons change, Grace discovers that the Bruckners have surprising secrets of their own, and her life becomes increasingly complicated and confusing. But opportunities appear in the most unexpected places, and Grace realizes that she's living in a city and a world where anything is possible.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Book Club",
    "Novels",
    "Adult",
    "New York",
    "Chick Lit"
  ],
  "author": "Victoria    Brown",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/8580680-minding-ben"
}