{
  "title": "We Are Not Alone: The Writer's Guide to Social Media",
  "description": "Foreword written by NY Times Best-Selling Author Bob Mayer, “I wished there had been a step-by-step guide for writers on how to not only do social media technically, but do it content-wise. This book is the answer to that wish.”\"Kristen Lamb's WE ARE NOT ALONE is a must-read for any writer dealing with the wildly competitive publishing climate. Even if you think you know what you're doing using social media, Kristen's book will teach you how to use all the tools to maximize your author platform and, most of all, SALES! I'm already recommending this book to all my authors!\" Gina Panettieri from Talcott Notch LiterarySocial Media is more popular than ever. As society becomes more and more technologically advanced, people are seeking new ways to interact. Humans are social creatures. Relationships and community are vital to our survival and our mental and emotional health.Writers, published and unpublished, fiction and non-fiction are hearing words like platform and brand with increasing frequency as the publishing paradigm shifts into the 21st century. The world around us is changing faster than ever, and publishing is certainly not immune.There are more opportunities for a new author today than there has been in the entirety of human history. Yet, the flip side of that reality is, with thousands and thousands of authors with books and blogs, how can a writer ever hope to stand apart let alone succeed?This book will show you how.There are countless social media experts, but Kristen's system is specifically designed to meet the unique needs of a writer. Take charge of your future today. You have great books to write, and don't have time for rookie mistakes that can cost you years of rebuilding your name, brand, and platform.Kristen's method is simple, effective, and helps auhors find ways to harness the imaginatin used for writing and employ this creativity to build a solid platform designed to connect with readers. This system is designed to change the writer's approach, not the writer's personality.And the best part is you have help. Remember, We Are Not Alone.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Social Media"
  ],
  "author": "Kristen Lamb",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/8582699-we-are-not-alone"
}