{
  "title": "Destiny and Desire",
  "description": "Winner of the Cervantes Prize  Carlos Fuentes, one of the world’s most acclaimed authors, is at the height of his powers in this stunning new novel—a magnificent epic of passion, magic, and desire in modern Mexico, a rich and remarkable tapestry set in a world where free will fights with the wishes of the gods.Josué Nadal has lost more than his innocence: He has been robbed of his life—and his posthumous narration sets the tone for a brilliantly written novel that blends mysticism and realism. Josué tells of his fateful meeting as a skinny, awkward teen with Jericó, the vigorous boy who will become his twin, his best friend, and his shadow. Both orphans, the two young men intend to spend their lives in intellectual pursuit—until they enter an adult landscape of sex, crime, and ambition that will test their pledge and alter their lives forever.Idealistic Josué goes to work for a high-tech visionary whose stunning assistant will introduce him to a life of desire; cynical Jericó is enlisted by the Mexican president in a scheme to sell happiness to the impoverished masses. On his journey into a web of illegality in which he will be estranged from Jericó, Josué is aided and impeded by a cast of unforgettable characters: a mad, imprisoned murderer with a warning of revenge, an elegant aviatrix and addict seeking to be saved, a prostitute shared by both men who may have murdered her way into a brilliant marriage, and the prophet Ezekiel himself.Mixing ancient mythologies with the sensuousness and avarice and need of the twenty-first century, Destiny and Desire is a monumental achievement from one of the masters of contemporary literature.",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Fantasy",
    "Spanish Literature",
    "Novels",
    "Literary Fiction",
    "Latin American"
  ],
  "author": "Carlos Fuentes",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/8582856-destiny-and-desire"
}