{
  "title": "Mr. Lincoln's Wars: A Novel in Thirteen Stories",
  "description": "Mr. Lincoln's Wars marks the emergence of a remarkably gifted writer. In this wildly inventive, highly ambitious collection, Adam Braver explores Abraham Lincoln's inner life and personal turmoils -- while also reflecting on the indelible impact Lincoln had on the nation during the last year of his presidency. Writing with lyrical yet muscular prose, Braver brings Abraham Lincoln to life, not just as the strong and resilient president of history books, but as a griefstricken father, heartbroken over the loss of his young son. Narrated from the multiple perspectives of Abraham Lincoln and those whose lives he touched, Mr. Lincoln's Wars shows a president who is distraught over his inability to keep his country from destroying itself through civil war and a man who is fighting inner demons during a time of great crisis. Across a rich canvas of truth and imagination, Mr. Lincoln's Wars reveals the president in his darkest hours within the White House walls. We see Lincoln as he explores the meaning of loss through a chance encounter with the father of a slain soldier. And a goodhearted young Union soldier is quickly turned into a killer in the name of President Lincoln. Finally, there is the assassination and the autopsy, as seen through the eyes of John Wilkes Booth, Mary Lincoln, the assistant surgeon general, and one of Lincoln's closest friends. Brilliant in its depiction of the country during the waning days of the war, the book is an insightful and moving exploration of the myth of celebrity and the passions it arouses. More than anything, however, Mr. Lincoln's Wars introduces a talented new writer whose storytelling ability knows no bounds.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Civil War",
    "Historical",
    "War",
    "Presidents",
    "Adult"
  ],
  "author": "Adam Braver",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/858384.Mr_Lincoln_s_Wars"
}