{
  "title": "Nom de Plume: A (Secret) History of Pseudonyms",
  "description": "ADVANCE \" Nom de Plume  is a fascinating collection of stories - populated by individuals whose 'doubleness' is so distinct that they acquire secondary personalities, and, in some notable cases, multiple personalities.  It's a richly documented literary excursion into the inner, secret lives of some of our favorite writers.\"- Joyce Carol Oates\"Nom de Plume uses the device of the pseudonym to unite the likes ofCharlotte Bronte, Mark Twain, Fernando Pessoa, and Patricia Highsmithinto a cohesive yet highly idiosyncratic literary history. Each pageaffords sparkling facts and valuable insights onto the manufacturingof books and reputations, the keeping and revealing of secrets, thevagaries of private life and public opinion, and the eternallymysterious, often tormented interface between life and literature.\"---Elif Batuman, author of The Possessed : Adventures with Russian Books and the People Who Read Them\"What to make of the paradox that some of the boldest writers have hidden behind pen names?  Carmela Ciuraru has performed a valuable service in examining the phenomenon through her charming, sprightly, and illuminating biographical essays.\"- Phillip Lopate\"This is a fascinating book on a fascinating subject. We all have other selves, but only some of us give them a name and let them loose in the world. Carmela Ciuraru steps behind a host of shadowy facades to interrogate the originals, and the result is both enlightening and wonderfully entertaining.\"- John Banville, author of The Sea (winner of The Man Booker Prize)\" Nom de Plume  is a delicious investigation of what leads the likes of the Brontës, Samuel Clemens, and Karen Blixen to ditch their names for safer, more romantic, or more intriguing identities when they write.  Whether their reasons are practical or mysterious, their lives and choices are here charmingly limned by Carmela Ciuraru (a name that, in itself, has the allure of a pseudonym).\"- Honor Moore, author of  The Bishop's Daughter",
  "genres": [
    "Nonfiction",
    "History",
    "Books About Books",
    "Biography",
    "Writing",
    "Microhistory",
    "Biography Memoir"
  ],
  "author": "Carmela Ciuraru",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/8584995-nom-de-plume"
}