{
  "title": "Electric Barracuda",
  "description": "An alternate cover edition for this ISBN can be found here.Serge Storms, that loveable thermonuclear vigilante and one-stop-Florida-trivia-shop, has been leaving corpses strewn across the Sunshine State for more than a decade. The authorities—especially one tenacious state agent—have begun to notice the exponential body count, and send a police task force to track down Serge. Could his luck finally have run out?Meanwhile, armed with his perpetually baked sidekick, Coleman, Serge decides to blitz the state and resurrect his Internet travel-advice website—which, of course, must be the finest and the final word on trekking the Sunshine State. To up the ante, Serge concocts a theme vacation for his cyberspace audience. And that theme? You, too, can experience Florida through the eyes of a fugitive.Off they go blogging along a getaway route through the state's most remote bayous, back roads, and bars, where the number of cadavers begin stacking up like Serge's website hits. And in the middle of all his make-believe close brushes, Serge finally wises up to his pursuers and realizes that the manic gumball rally is genuinely on \"in the tradition of the great American chase movie.\"Clues and questions mount:Who are all the women being photographed naked in the swamp?What made Coleman draw on his face with magic markers?Where is the cruise-to-nowhere taking its drunk prisoners?When was the last time a Civil War reenactment involved a sports car?But Serge also has some personal business to tidy up. His grandfather's old Miami Beach gang suddenly had their life savings wiped out, and there's a good bet it was no accident. Too much action for Serge to juggle? Not when it all dovetails nicely into his Secret Master Plan. And especially if it involves Serge's favorite new obsession: tracking Al Capone's little-known escapades in the Everglades.So gas up the car, say good-bye to the relatives, and join Serge on the lam as he drives straight for the deepest bowels of Florida to unravel the final mysteries of Electric Barracuda.",
  "genres": [
    "Fiction",
    "Mystery",
    "Humor",
    "Crime",
    "Comedy",
    "Audiobook",
    "Suspense"
  ],
  "author": "Tim Dorsey",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/8586212-electric-barracuda"
}