{
  "title": "My Gender Workbook: How to Become a Real Man, a Real Woman, the Real You, or Something Else Entirely",
  "description": "Gender isn't just about \"male\" or \"female\" anymore - if you have any doubts, just turn on your television. RuPaul is as familiar as tomato ketchup with national radio and television shows, and transgendered folk are as common to talk-shows as screaming and yelling. But if the popularization of gender bending is revealing that \"male\" and \"female\" aren't enough, where are we supposed to go from here? Cultural theorists have written loads of smart but difficult-to-fathom texts on gender, but none provide a hands-on, accessible guide to having your own unique gender. With My Gender Workbook , Kate Bornstein brings theory down to Earth and provides a practical approach to living with or without a gender.Bornstein starts from the premise that there are not just two genders performed in today's world, but countless genders lumped under the two-gender framework. Using a unique, deceptively simple and always entertaining workbook format, Bornstein gently but firmly guides you to discover your own unique gender identity. Whether she's using the USFDA's food group triangle to explain gender, or quoting one-liners from real \"gender transgressors\", Bornstein's first and foremost concern is making information on gender bending truly accessible. With quizzes and exercises that determine how much of a man or woman you are, My Gender Workbook gives you the tools to reach whatever point you desire on the gender continuum.Bornstein also takes aim at the recent flurry of books that attempt to naturalize gender difference, and puts books like Men are from Mars, Women are from Venus squarely where they belong: on Uranus. If you don't think you are transgendered when you sit down to read this book, you will be by the time you finish it!",
  "genres": [
    "Gender",
    "Queer",
    "Nonfiction",
    "LGBT",
    "Gender Studies",
    "Feminism",
    "Transgender"
  ],
  "author": "Kate Bornstein",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/858394.My_Gender_Workbook"
}