{
  "title": "Assault with a Deadly Glue Gun",
  "description": "When Anastasia Pollack's gambling-addicted husband permanently cashes in his chips in Vegas, her life craps out. She's left with two teenage sons, a mountain of debt, and her nasty, cane-wielding Communist mother-in-law. Not to mention a loan shark demanding fifty thousand dollars.Anastasia's job as crafts editor at American Woman magazine makes life even stickier when she discovers the dead body of über-ambitious fashion editor Marlys Vandenburg hot-glued to Anastasia's office chair. Marlys collected enemies and ex-lovers like Jimmy Choos. When evidence surfaces of an illicit affair between Marlys and Anastasia's husband, Anastasia becomes the prime suspect. Can she sew up the case and keep herself out of jail before the real killer puts a permanent end to her investigation?Praise:\"Oddball characters, uproariously funny situations, and a heroine with a strong sense of irony will delight fans of Janet Evanovich, Jess Lourey, and Kathleen Bacus.\"—Booklist, starred review\"Crafty cozies don't get any better than this hilarious confection.  Anastasia is as deadpan droll as Tina Fey's Liz Lemon.\"—Publishers Weekly, starred review\"North Jersey’s more mature answer to Stephanie Plum. Funny, gutsy and determined, Anastasia has a bright future in the planned series.\"—Kirkus Reviews\"Lovers of funny mysteries, outrageous puns, self-deprecating humor, and light romance will all find something here as Anastasia progresses through repeated misadventures to emerge triumphant in the end.\"—ForeWord Magazine\"Winston has turned a sticky situation into a delightful romp through the halls of who-done-it.\"—Star-Ledger\"Quirky, laughable, and loveable . . . Assault with a Deadly Glue Gun is clever and thoroughly entertaining—a must-read!\"—Brenda Novak, New York Times bestselling author of Trust Me and Watch Me",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Cozy",
    "Humor",
    "Mystery Thriller",
    "Crafts"
  ],
  "author": "Lois Winston",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/8586279-assault-with-a-deadly-glue-gun"
}