{
  "title": "Seven Events That Made America America: And Proved That the Founding Fathers Were Right All Along",
  "description": "Every schoolchild is taught the great turning points in American history, such as Gettysburg, Pearl Harbor, the Kennedy assassination, and 9/11. But other, equally significant events have altered our destiny without being understood—or even widely noticed. Acclaimed conservative historian Larry Schweikart now takes an in-depth look at seven such episodes and reveals the profound ways they have shaped America. He also asks listeners to reconsider them not just in terms of what happened but in light of the Founding Fathers' vision for our nation. What would Washington, Jefferson, or Madison have said about these events? In the same accessible style of his previous bestsellers—A Patriot's History of the United States and 48 Liberal Lies About American History—Professor Schweikart doesn't merely recount our history; he forces us to rethink what makes our country great. He shows how individual liberty, private enterprise, and small government helped build a free and prosperous nation. Conversely, whenever these values have been threatened by big government, oppressive taxes, and special interests, we lose sight of the principles that made us strong. You'll be surprised to learn how these events spurred sweeping changes that still affect us today. For instance: —Martin Van Buren's consolidation of the first national political party made it possible for Barack Obama to get elected almost two centuries later —Dwight Eisenhower's heart attack led to a war on red meat, during which the government took control over Americans' diets —The rock 'n' roll craze (often mistakenly claimed as a liberal phenomenon) helped bring about the decline of communism and the fall of the Soviet Union In this time of national uncertainty, it has never been more important for Americans to understand what has shaped our national destiny. This provocative book will enlighten anyone looking for clarity about our past and inspiration for our future.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Politics",
    "Audiobook",
    "Historical",
    "American"
  ],
  "author": "Larry Schweikart",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/8588842-seven-events-that-made-america-america"
}