{
  "title": "William Shakespeare [Apocrypha] - A Yorkshire Tragedy",
  "description": "An Excerpt from the book-SCENE I. A room in Calverly Hall.[Enter Oliver and Ralph, two servingmen.]OLIVER.Sirrah Ralph, my young Mistress is in such a pitiful passionatehumor for the long absence of her love--RALPH.Why, can you blame her? why, apples hanging longer on the treethen when they are ripe makes so many fallings; viz., Madwenches, because they are not gathered in time, are fain todrop of them selves, and then tis Common you know for everyman to take em up.OLIVER.Mass, thou sayest true, Tis common but, sirrah, isneither our young master returned, nor our fellow Sam comefrom London?RALPH.Neither of either, as the Puritan bawd says. Slidd, I hear Sam's come, her's! Tarry! come, yfaith, now my noseitches for news.OLIVER.And so does mine elbow.[Sam calls within. Where are you there?]SAM.Boy, look you walk my horse with discretion; I have rid himsimply. I warrant his skin sticks to his back with very if a should catch cold and get the Cough of the Lungs I werewell served, were I not?[Enter Sam. Furnisht with things from London.]What, Ralph and Oliver.AMBO.Honest fellow Sam, welcome, yfaith! what tricks hast thoubrought from London?SAM.You see I am hangd after the truest three hats, andtwo glasses, bobbing upon em, two rebato wires upon my breast,a capcase by my side, a brush at my back, an Almanack in mypocket, and three ballats in my nay, I am the truepicture of a Common servingman.OLIVER.I'll swear thou art. Thou mayest set up when thou wilt.There's many a one begins with less, I can tell thee, thatproves a rich man ere he dies. But what's the news fromLondon, Sam?RALPH.Aye, that's well said; what's the news from London, Sirrah?My young mistress keeps such a puling for her love.SAM.Why, the more fool she; aye, the more ninny hammer she.OLIVER.Why, Sam, why?SAM.Why, he's married to another Long ago.AMBO.Yfaith, ye jest.SAM.Why, did you not know that till now? why, he's married, beatshis wife, and has two or three children by for you mustnote that any woman bears the more when she is beaten.RALPH.Aye, that's true, for she bears the blows.OLIVER.Sirrah Sam, I would not for two years wages, my young mistressknew so much; she'd run upon the left hand of her wit, andne'er be her own woman again.SAM.And I think she was blest in her Cradle, that he never camein her bed; why, he has consumed all, pawnd his lands, andmade his university brother stand in wax for him--There's afine phrase for a scrivener! puh, he owes more then his skin'sworth.OLIVER.Is't possible?SAM.Nay, I'll tell you moreover, he calls his wife whore asfamiliarly as one would call Mal and Dol, and his childrenbastards as naturally as can be.--But what have we here? Ithought twas somewhat puld down my I quite forgotmy two potingsticks. These came from London; now any thingis good here that comes from London.OLIVER.Aye, far fetcht you know.",
  "genres": [],
  "author": "William Shakespeare",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/8589860-william-shakespeare-apocrypha---a-yorkshire-tragedy"
}