{
  "title": "Tankbread",
  "description": "Tankbread has now been published by Permuted Press. You can find the current edition amazon.com/Tankbread-ebook/dp/B00BVRQ...Ten years ago humanity lost the war for survival against a spreading plague that brought the dead back to life as flesh eating monsters.Now intelligent zombies rule the world. Feeding the undead a steady diet of cloned people called Tankbread, the survivors live in a dangerous world on the brink of final extinction.One outlaw courier must go on a journey through the post-apocalyptic wasteland of Australia. Fighting his way into the very heart of the apocalypse in the desperate search for a way to save the last humans and destroy the undead threat.His only companion is a girl with an extraordinary secret. Her name is Else and she's TankbreadPraise for TankbreadPaul Mannering's TANKBREAD is a guts and glory joyride into very dark territory. Very nasty and lots of fun!\"~ Jonathan Maberry, New York Times bestselling author of DEAD OF NIGHT and DUST & DECAYMannering's take on the post-zombie apocalypse is scarifyingly real. Baked dog while you take orders from your zombie master anyone? Sink your teeth into an Australia where the zombies are in charge - you won't be disappointed.~ Rocky Wood, author of STEPHEN A LITERARY COMPANION and HORRORS! GREAT STORIES OF FEAR AND THEIR CREATORS\"Tankbread reads like a tick-list of genre tens of thousands ofzombies, a brave, wise-cracking warrior hero, a beautiful woman whomight just hold the key to everything, mad scientists, and even a knightin shining armour and a helicopter-piloting mother superior thrown intothe mix! And yet the whole is far greater than the sum of its disparateparts. Tankbread is a blast from start to finish. A breathless,country-crossing zombie epic - kind of like Mad Max colliding head onwith Dawn of the Dead. Mixing great action scenes, laugh-out loud moments, copious amounts ofhorror and lead characters you really grow to give a damn about,Tankbread is a unique and very entertaining entry in the over-saturatedzombie genre. Read it and enjoy it - I did.\"~ David Moody, author of the AUTUMN and HATER series.",
  "genres": [
    "Zombies",
    "Horror",
    "Science Fiction",
    "Post Apocalyptic",
    "Dystopia",
    "Apocalyptic",
    "Fiction"
  ],
  "author": "Paul Mannering",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/13143326-tankbread"
}