{
  "title": "Any Approaching Enemy: A Novel of the Napoleonic Wars",
  "description": "“Jay Worrall depicts the hearts and minds of the late eighteenth century with a facility I have seldom seen equaled. Readers of Patrick O’Brian will find themselves back in familiar gunrooms and wardrooms. Well done, Jay Worrall!”—David Poyer, author of That Anvil of Our SoulsThe year is 1798. The war between England and revolutionary France has reached a stalemate. With rumors swirling that the French are secretly amassing a powerful fleet, the Admiralty dispatches a group of ships under the command of Rear Admiral Horatio Nelson to investigate. But after a ferocious storm blindsides the squadron, Nelson’s flagship and two other ships go missing. Putting his career on the line by disobeying direct orders, Captain Charles Edgemont sets out in pursuit of Nelson and the French fleet on a treacherous voyage along the Tuscan coast. As tensions among the crew rise from a simmer to a boil, Edgemont makes an unexpected discovery in Naples that may compromise his mission. And when the French fleet turns up off the shores of Egypt, Edgemont is suddenly thrown into a crisis of conscience. As circumstances grow dire and require heroic action, the fate of the crucial battle effectively lies in Edgemont’s hands—as does the course of history.Praise for Any Approaching Enemy“A thoroughly enjoyable venture into the venue made famous by C. S. Forester . . . [evoking] the same admiration and sense of adventure [as] the Forester books do.”—The Roanoke Times“Combining engaging characters, witty dialogue and rousing action, Worrall’s nautical series continues its promising start.”—Publishers Weekly",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Military Fiction",
    "Adventure",
    "British Literature",
    "Naval Historical Fiction"
  ],
  "author": "Jay Worrall",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/8596975-any-approaching-enemy"
}