{
  "title": "Lilah",
  "description": "Set in the magnificent culture of the Middle East more than four thousand years ago, \" Lilah\" is a rich and emotionally resonant story of faith, love, and courage. Living in exile, Lilah is in love with Antinoes, a Persian warrior. They have known each other since they were children, and Antinoes dearly wants to make Lilah his wife. Yet Lilah does not feel she can marry without the blessing of her brother, Ezra. She and Ezra are close, and Lilah knows her brother well--he does not want his sister to have a husband outside their faith. Ezra is a scholar of the laws of Moses, and Lilah believes it is her brother's destiny to lead the Jewish people back to the Promised Land. While Antinoes pressures her to accept his proposal, Lilah realizes that before she can consider her own happiness, it is her duty to help her brother accomplish the seemingly impossible task that is before him. Putting herself in grave danger, and with the help of Antinoes, Lilah wins Ezra an audience with Artaxerxes II, the King of Kings, who grants permission to lead the exiles on their journey back to the Promised Land. After a hazardous trip across the desert, Lilah, Ezra, and the thousands who join them arrive in Jerusalem. But the hardship of rebuilding the Temple takes its toll, and the religious enthusiasm of some turns to extremism. Ezra, listening to the zealots, orders all non-Jewish wives and their children banished from Jerusalem. Lilah, whose love for Antinoes has never wavered, is horrified by this command. She knows she must now choose between her brother and her conscience, which tells her that the time has come to defy him. \"Lilah\" is a timeless story of one woman's stand against intolerance; it will linger in the reader's mind long after the last page has been turned. \"From the Hardcover edition.\"",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Biblical Fiction",
    "Biblical",
    "Historical",
    "Religion",
    "Christian"
  ],
  "author": "Marek Halter",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/859969.Lilah"
}