{
  "title": "Joint Hypermobility Handbook: A Guide for the Issues & Management of Ehlers-Danlos Syndrome Hypermobility Type and the Hypermobility Syndrome",
  "description": "As a followup to his previous best-selling book, \"Issues and Management of Joint A Guide for the Ehlers-Danlos Syndrome Hypermobility Type and the Hypermobility Syndrome,\" Dr. Tinkle has created this handbook with several contributors to expand insights into the understanding and management of Ehlers-Danlos Syndrome Hypermobility Type and the Hypermobility Syndrome. Dr. Tinkle has received many accolades for his ability to take a complex condition and make it understandable in everyday \"...provides a wealth of information about the natural history, and physical and medical management... It should be of great value to patients.\" - The American Journal of Medical Genetics Reader comments... \"...a useful tool in helping me obtain the type of care I need to manage my disorder...\" \"This book is simple but not oversimplified. It is an excellent basic resource, giving a clear, concise, and useful overview for those (like myself) who live with hypermobility.\" \"Super book for EDS! Finally a book that everyone can understand.\" \"...thoroughly explores the problems associated with EDS-HM. It is a relief to realize that it is not just me...\" \"...a tremendous service for the health care community and the families and friends of those diagnosed or not yet formally diagnosed folks with EDS-HM... joy and clarity in reading the very 'easy to read' text chapters detailing out the impact of EDS-HM...\" In addition to the weatlth of positive reviews, Dr. Tinkle's previous book on the same subject was a best seller in several - Genetics - Medical Genetics - Orthopedics - Family and General Practice Brad T. Tinkle, M.D., Ph.D., is a clinical and clinical molecular geneticist at Cincinnati Children's Hospital Medical Center (CCHMC). He specializes in caring for individuals with heritable connective tissue disorders such as Ehlers-Danlos syndromes, Marfan syndrome, osteogenesis imperfecta, and achondroplasia among the many.",
  "genres": [
    "Nonfiction",
    "Health",
    "Medical",
    "Science",
    "Self Help"
  ],
  "author": "Brad T. Tinkle",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/8598751-joint-hypermobility-handbook"
}