{
  "title": "The Author Of Himself: The Life Of Marcel Reich-Ranicki",
  "description": "Marcel Reich-Ranicki is remarkable for both his unlikely life story and his brilliant career as the \"pope of German letters.\" His sublimely written autobiography is at once a fascinating adventure tale, an unusual account of German-Jewish relations, a personal rumination on who's who in German culture, and a love letter to literature.Reich-Ranicki's life took him from middle-class childhood to wartime misery to the heights of intellectual celebrity. Born into a Jewish family in Poland in 1920, he moved to Berlin as a boy. There he discovered his passion for literature and began a complex affair with German culture. In 1938, his family was deported back to Poland, where German occupation forced him into the Warsaw Ghetto. As a member of the Jewish resistance, a translator for the Jewish Council, and a man who personally experienced the ghetto's inhumane conditions, Reich-Ranicki gained both a bird's-eye and ground-level view of Nazi barbarism. Written with subtlety and intelligence, his account of this episode is among the most compelling and dramatic ever recorded.He escaped with his wife and spent two years hiding in the cellar of Polish peasants―an incident later immortalized by Günter Grass. After liberation, he joined and then fell out with the Communist Party and was temporarily imprisoned. He began writing and soon became Poland's foremost critical commentator on German literature.When Reich-Ranicki returned to Germany in 1958, his rise was meteoric. In short order, he claimed national celebrity and notoriety as the head of the literary section of the leading newspaper and host of his own television program. He frequently flabbergasted viewers with his bold pronouncements and flexed his power to make or break a writer's career. His list of friends and enemies rapidly expanded to include every influential player on the German literary scene, including Grass and Heinrich Böll. This, together with his keen critical instincts, makes his memoir an indispensable guide to contemporary German culture as well as an absorbing eyewitness history of some of the twentieth century's most important events.",
  "genres": [
    "Nonfiction",
    "Biography",
    "German Literature",
    "Memoir",
    "History",
    "Autobiography",
    "Germany"
  ],
  "author": "Marcel Reich-Ranicki",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/859952.The_Author_Of_Himself"
}