{
  "title": "The Trillion-Dollar Conspiracy: How the New World Order, Man-Made Diseases, and Zombie Banks Are Destroying America",
  "description": "s/t: How the New World Order, Man-Made Diseases, and Zombie Banks Are Destroying AmericaAmerica's economy is in shambles. . . .Its citizens are terrified and dissatisfied. . . .Could it all have been planned by a secret elite one hundred years ago?The New World Order. Hitler referred to it in his diaries. President George H. W. Bush foretold of it in his speeches. Formed by a secretive global elite, the group seeking this new order has taken hold of the nation—and perhaps the world. Its influence pervades every reach of American society, from the products we buy at the grocery store to the topics of evening news programs.But could it also be true that the New World Order caused one of the greatest financial catastrophes of our time?For years, bestselling author and legendary conspiracy researcher Jim Marrs has exposed information that the mainstream corporate media has refused to report. Now, with a crisis upon us, Marrs has yet again unearthed the lies to expose the insidious alliances that make up a secret world.Consider this: In 1910, a handful of the world's most powerful government and corporate men gathered on Jekyll Island to discuss matters at a private hunting lodge. The agenda? First, the overthrow of the sitting American president; second, the creation of a central bank, one headed by a succession of elitists who would unconstitutionally control America's money and its economy for decades. . . .Flash forward one hundred years. Never before have the American people been so unhappy. Apathy and paralysis are the nation's guiding principles. Public education has repeatedly failed. More and more Americans rely on overpriced pills for remedies to fabricated illnesses. The average American household spends eight hours a day in front of the television, ruled by the vague fears of terrorist attacks and economic collapse. Control of the mass media has devolved to a mere five multinational corporations.Throughout The Trillion-Dollar Conspiracy, Marrs investigates the erosion of America's civil liberties and the nation's transformation into a police state: Will the government use a microchip to monitor the populace? How does the Patriot Act relate to Nazi legislation? Have Americans today become merely a poor imitation of the robust citizenry of our nation's past?Jim Marrs responds with a resounding call of \"Yes, we have!\" He also raises powerful questions about so many other things:Was the financial bailout of 2008 nothing but one group of global elites passing money to another?Could the swine flu epidemic have been corporately manufactured?Is Big Pharm behind a lie that claims bipolar disorder is a real illness?Has a Nazi bioweapon caused recent maladies such as fibromyalgia and chronic fatigue syndrome?Why did the government suppress a device that can apparently cure cancer?In the explosive The Trillion-Dollar Conspiracy, Marrs explores the back rooms and shadowy deals of our nation's past to craft a frightening history that no one else is brave enough to tell.",
  "genres": [
    "Nonfiction",
    "Conspiracy Theories",
    "History",
    "Politics",
    "Economics",
    "Philosophy",
    "The United States Of America"
  ],
  "author": "Jim Marrs",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/8596193-the-trillion-dollar-conspiracy"
}