{
  "title": "Eve of Samhain",
  "description": "\"A wonderfully engaging & heart wrenching read! LOVED!\" -- Sparklybearsy of Ramblings Of A Book Bitch\"For fantasy readers it is really a book I would highly recommend!\" -- Inga of Me & Reading\"Sanchez weaves a beautiful story of love, fear, and triumph. The characters and plot line are well-developed, and it's steaminess factor is certainly way up there without being the focal point of the book.\" -- Julie of Forbidden Reviews\"If you love paranormal romance and a hilarious writing style then Lisa Sanchez is definitely a must read.\" -- Kristen of My Bookish Fairy Tale\"I was totally intrigued by the first page and was sad when it ended.\" -- Sarah of Larissa's Bookish Life\"Anyway, really amazing story, with total feel good characters...I think it's got a little bit of everything, love, desire, as well as action, and fear. It had me laughing, crying, pleading, and even white knuckled!\" -- Jennifer of Book Crazy\"A MUST read! Great writing, great story, all around GREAT book!\" -- Amanda JacksonAs a college senior and server at Hanaford Park's hottest nightclub, twenty-one year old Ryann Pierce's plan was work hard, make lots of money, and avoid the ass-grabbers at all costs. What she never planned for was Quinn Donegan—the living, breathing advertisement for sinful behavior that waltzed into her life.With an angelic face, a hard body and a butt-load of charm, Quinn had a way with the ladies—a lot of ladies. Cursed with a deadly, addictive touch, his trail of indiscretion blazed across five hundred years. Tired and jaded, Ryann is a shocking revelation Quinn didn't see coming.Filled with desire, yet unable to touch one another, Ryann and Quinn embark on a daunting journey, battling frustrating physical limitations while exploring their new love. In a race against the clock, Ryann learns she must plead for Quinn's life before…the Eve of Samhain. Determined to end her lover's suffering, not even the danger dogging her every move can keep her from her mission.",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Fantasy",
    "New Adult",
    "Fae",
    "Vampires"
  ],
  "author": "Lisa Sanchez",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/8598222-eve-of-samhain"
}