{
  "title": "Get Trump: The Threat to Civil Liberties, Due Process, and Our Constitutional Rule of Law",
  "description": "In Get The Threat to Civil Liberties, Due Process, and Our Constitutional Rule of Law, Alan Dershowitz—#1 New York Times bestselling author and one of America’s most respected legal scholars—analyses the unremitting efforts by political opponents of Donald Trump to “get” him—to stop him from running in 2024—at any cost.   Alan Dershowitz has been called “one of the most prominent and consistent defenders of civil liberties in America” by Politico and “the nation’s most peripatetic civil liberties lawyer and one of its most distinguished defenders of individual rights” by Newsweek.  Get Trump makes clear that unconstitutional efforts to stop Trump from retaking the presidency challenge the very foundations of our due process, right to counsel, and free speech. Those who justify these dangerous departures from the rule of law argue that the threat posed by a second Trump presidency is “different” and “immediate,” while the departures from constitutional norms are longer term and more abstract.   Dershowitz explains that defenders of Trump’s constitutional rights—even those like him who oppose Trump politically—are sought to be silenced; their free speech rights attacked, their integrity questioned, and their careers threatened. Much of the media substitutes advocacy against Trump for objective reporting, while many in academia petition and propagandize against rights they previously valued—all in the interest of getting Trump.   The essence of justice is that it must be equally applicable to all, Dershowitz notes. No one is above the law but digging to find crimes in order to influence an election does not constitute the equal application of the law. In order to assure equal application in comparable situations, he proposes two criteria for indicting a likely candidate of the opposing the Richard Nixon standard and the Hillary Clinton standard—and most recently, the Joe Biden standard.  Get Trump warns that regardless of whether this anti-democratic effort to stop Trump from running succeeds or fails, it is likely to create dangerous precedents that will lie around like loaded weapons ready to be deployed against other controversial candidates, officials, or citizens about whom it can be argued that the danger they pose “is different.”",
  "genres": [
    "Politics",
    "Nonfiction"
  ],
  "author": "Alan M. Dershowitz",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/85974440-get-trump"
}