{
  "title": "Neutrino",
  "description": "Neutrinos are perhaps the most enigmatic particles in the universe. These tiny, ghostly particles are formed by the billions in stars and pass through us constantly, unseen, at almost the speed of light. Yet half a century after their discovery, we still know less about them than all the other varieties of matter that have ever been seen.In this engaging, concise volume, renowned scientist and popular writer Frank Close gives a vivid account of the discovery of neutrinos and our growing understanding of their significance, also touching on some speculative ideas concerning the possible uses of neutrinos and their role in the early universe. Close begins with the early history of the discovery of radioactivity by Henri Becquerel and Marie and Pierre Curie, the early model of the atom by Ernest Rutherford, and problems with these early atomic models, and Wolfgang Pauli's solution to that problem by inventing the concept of neutrino (named by Enrico Fermi, \"neutrino\" being Italian for \"little neutron\"). The book describes how the confirmation of Pauli's theory didn't occur until 1956, when Clyde Cowan and Fred Reines detected neutrinos, and reveals that the first \"natural\" neutrinos were finally detected by Reines in 1965 (before that, they had only been detected in reactors or accelerators). Close takes us to research experiments miles underground that are able to track neutrinos' fleeting impact as they pass through vast pools of cadmium chloride and he explains why they are becoming of such interest to cosmologists--if we can track where a neutrino originated we will be looking into the far distant reaches of the universe.In telling the story of the neutrino, Close offers a fascinating portrait of a strand of modern physics that sheds light on everything from the workings of the atom and the power of the sun.",
  "genres": [
    "Science",
    "Physics",
    "Nonfiction",
    "Popular Science",
    "History",
    "Astronomy"
  ],
  "author": "Frank Close",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/8602363-neutrino"
}