{
  "title": "Beyond Justice",
  "description": "The breakout novel of New York Times bestselling author Joshua Graham. For fans of John Grisham, Stephen King, Michael Connelly, Dean Koontz, Ted Dekker and Frank Peretti • Amazon #1 Bestseller • Winner of the 2011 International Book Awards • Listed in Suspense Magazine's Best of 2010 \"...A riveting legal thriller.... breaking new ground with a vengeance... demonically entertaining and surprisingly inspiring.\" --PUBLISHERS WEEKLY **** BEYOND JUSTICE THE DESCENT INTO HELL IS NOT ALWAYS VERTICAL… Sam Hudson, a reputable San Diego attorney, learns this when the authorities wrongfully convict him of the brutal rape and murder of his wife and daughter, and sends him to death row. There he awaits execution by lethal injection. If he survives that long. In prison, Sam fights for his life while his attorney works frantically on his appeal. It is then that he embraces the faith of his departed wife and begins to manifest supernatural abilities. Abilities which help him save lives– his own, those of his unlikely allies–and uncover the true killer’s identity, unlocking the door to his exoneration. Now a free man, Sam’s newfound faith confronts him with the most insurmountable challenge yet. A challenge beyond vengeance, beyond rage, beyond anything Sam believes himself capable to forgive the very man who murdered his family, according to his faith. But this endeavor reveals darker secrets than either Sam or the killer could ever have imagined. Secrets that hurtle them into a fateful collision course. BEYOND JUSTICE, a tale of loss, redemption, and the power of faith. “…A riveting legal thriller…. breaking new ground with a vengeance… demonically entertaining and surprisingly inspiring.” PUBLISHERS WEEKLY “…hits the ground running…handled by a deft hand.” Adrian Phoenix, BENEATH THE SKIN (Pocket Books) “This tense, fast-paced story of outrageous injustice, insidious evil, and looming disaster has everything the savvy reader should expect, and more. [Graham] belongs to a new, emerging wave of writers who dare to color outside conventional lines. And he does so with style!” Glen Scorgie, THE JOURNEY BACK TO EDEN (Zondervan)",
  "genres": [
    "Christian Fiction",
    "Thriller",
    "Fiction",
    "Mystery",
    "Suspense",
    "Christian",
    "Spirituality"
  ],
  "author": "Joshua Graham",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/8601811-beyond-justice"
}