{
  "title": "Rules for Virgins",
  "description": "In her startlingly sensual new story, “Rules for Virgins”—this 43-page jewel of a tale is the first fiction she has published in six years—beloved bestselling author Amy Tan (“The Joy Luck Club,” “The Bonesetter’s Daughter”) takes us deep into the illicit world of 1912 Shanghai, where beautiful courtesans mercilessly compete for the patronage of wealthy gentlemen. For the women, the contest is deadly serious, a perilous game of economic survival that, if played well, can set them up for life as mistresses of the rich and prominent. There is no room for error, however: erotic power is hard to achieve and harder to maintain, especially in the loftiest social circles. Enter veteran seducer, Magic Gourd, formerly one of Shanghai’s “Top Ten Beauties” and now the advisor and attendant of Violet, an aspiring but inexperienced courtesan. Violet may have the youth and the allure, but Magic Gourd has the cunning and the knowledge without which the younger woman is sure to fail. These ancient tricks of the trade aren't written down, though; to pass them on to her student, Magic Gourd must reach back into her own professional past, bringing her lessons alive with stories and anecdotes from a career spent charming and manipulating men who should have known better but rarely did.The world of sexual intrigue that Tan reveals in \"Rules for Virgins\" actually existed once, and she spares no detail in recreating it. But this story is more than intriguing (and sometimes shocking) historical literary fiction. Besides inviting us inside a life that few writers but Tan could conjure up, the intimate confessions of Magic Gourd add up to a kind of military manual for the War of the Sexes’ female combatants. The wisdom conveyed is ancient, specific, and timeless, exposing the workings of vanity and folly, calculation and desire that define the mysterious human heart.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Short Stories",
    "China",
    "Historical",
    "Asia",
    "Asian Literature"
  ],
  "author": "Amy Tan",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/13144428-rules-for-virgins"
}