{
  "title": "Nigerian Novels: Half of a Yellow Sun, the Other Side of Truth, a Man of the People, Arrow of God, Beasts of No Nation, No Longer at Ease",
  "description": "This is nonfiction commentary. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Chapters: Half of a Yellow Sun. Source: Wikipedia. Free updates online. Not illustrated. Excerpt: Half of a Yellow Sun is a novel that was written by Nigerian author Chimamanda Ngozi Adichie. It was first published in 2006 by Knopf/Anchor and tells the story of two sisters Olanna and Kainene during the Biafran War. Chimamanda Ngozi Adichie's novel Half of a Yellow Sun takes place in Nigeria during the Nigerian-Biafran War in 1967-1970. The effect of the war is shown through the dynamic relationships of five peoples lives ranging from high ranking political figures, a professor, a British citizen, and a houseboy. After the British left Nigeria and stopped ruling, conflicts arose over what government would rule over the land. The land split and the Nigeria-Biafra war started. The lives of the main characters drastically changed and were torn apart by the war and decisions in their personal life. The book jumps between events that took place during the early 1960s and the late 1960s, when the war was on. In the early 1960s, the main characters are introduced: Ugwu, a 13 year old village boy who moves in with Odenigbo, to work as his houseboy. Odenigbo frequently entertains intellectuals to discuss the political turmoil in Nigeria. Life changes for Ugwu when Odenigbos girlfriend, Olanna, moves in with them. Ugwu forms a strong bond with both of them, and is extremely loyal. Olanna has a twin sister, Kainene, who is a woman with a dry sense of humour, tired by the pompous company she is forced to keep. Her lover Richard is an Englishman come to Nigeria to study the art. Jumping four years ahead, trouble is brewing between the Hausa and the Igbo people and hundreds of people die in the massacres, including Olanna's beloved auntie and uncle. A new republic is crea...More: http: //booksllc.net/?id=1859812",
  "genres": [
    "Fiction"
  ],
  "author": "Books LLC",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/8612971-nigerian-novels"
}