{
  "title": "Pink Boots and a Machete: My Journey from NFL Cheerleader to National Geographic Explorer",
  "description": "A quick examination of her roots, and one may never have guessed that Mireya Mayor would become the woman she is today. Yet, against all odds, this self-professed former \"girly girl\" daughter of overprotective Cuban immigrants blossomed from NFL cheerleader to Fulbright Scholar to field scientist and ultimately, quintessential adventurer. Now, with more than a decade's worth of thrilling exploits under her belt, Mayor recounts her life in a riveting, awe-inspiring new book. In a series of short chapters, she relives each exhilarating event with uncanny charm and self-deprecating humor. Readers have the rare opportunity to follow the renowned primatologist around the globe as she unlocks the mysteries of the natural world and endeavors to save some of the planet's rarest creatures. Says Mayor: \"I love the adventure, the exploration, the scientific discovery and the documentation. But really what drives me is the thought that future generations—my own children and their children—can one day learn to appreciate them like I do.\" Throughout this unforgettable volume, she describes in stunning detail how she survived a plane crash...slept in jungles teeming with poisonous snakes...dove with hungry great white sharks...rappelled down a 14,000-foot sinkhole in search of frogs...draws blood from critically endangered lemurs...was charged by an angry silver-backed gorilla...was chased by elephants...and the list goes. Suffice it to say, Mireya Mayor has seen more in her 30-odd years than most of us will see in a lifetime. Her plucky spirit, brilliance in the face of calamity, and sheer will to succeed make this a classic mission book, and a thoroughly breathtaking read.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Memoir",
    "Biography",
    "Nature",
    "Adventure",
    "Autobiography"
  ],
  "author": "Mireya Mayor",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/8609724-pink-boots-and-a-machete"
}