{
  "title": "In Memory of Greed",
  "description": "You're a middle-class citizen with an average life. What if your normal day suddenly careened out of control? Imagine leaving work early for a doctors appointment only to be caught up in a potential catastrophe that you alone can avert. You spring into action but your efforts are stymied by local authorities. By nightfall you find yourself laying in a hospital bed with a gunshot wound, accused of murder.  Such is the shocking reality of twenty-nine year old Murhkin Mocado. Unbeknownst to this California native, his skills as an ex-Navy SEAL have made him a target.  A powerful, corrupt group of individuals have set their sights on Mocado to help carry out a nefarious scheme. Born of relentless greed and hunger for power, these men are willing to sacrifice countless lives to bring their insidious plans to fruition. However, the purveyors of evil deeds are also being watched by one Joelle Barstow, an operative well versed in the tradecraft of industrial espionage. Initially sent to gather information on the CEO of a specific corporation, Barstow rapidly gets in over her head and uncovers a web of deceit involving big business and government. Once Barstow crosses paths with Murhkin Mocado her skills are pushed to the limit, as she tries desperately to navigate this dangerous and deadly world. Mocado, expertly manipulated by his devious handlers, initiates a chain of events leading to one of the worst man-made ecological disasters the world has ever known. Will the pair escape with their lives in order to bring those responsible to justice?  This mystery/thriller takes the reader on a rapid-fire adventure, beginning in the United States, racing through the breathtaking splendor of Ireland, and culminating in Kenya; one of the most exotic countries within the boundaries of Africa's \"Dark Continent.\"",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Adventure",
    "Mystery Thriller"
  ],
  "author": "Al Boudreau",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/10344700-in-memory-of-greed"
}