{
  "title": "One",
  "description": "For generations, the Gods have been at war. Two rival pantheons, the Old Gods and the New Order, have been vying for the faith of the mortal realm. Bound by the covenants between mortals and themselves, the Old Gods have all but vanished from the land. Now Malik, the God of War and Peace, has devised a plan to champion the war and win back the faithful they have lost. He has created nine swords, each a godslayer in its own right, designed to be given unto the faithful, with the mission to seek out and slay the Gods of the New Order! However, even the best laid plans of a God can go awry, and the swords were cast into the mortal realm, ensorceled in a prophecy that has bound the Gods to a new set of rules, a set that requires their creating a mortal agent in the world to seek out the swords and assure their purpose be carried out.Nathaniel Goodsmith becomes the selected agent of the Old Gods, a reluctant Avatar required by the Gods to seek out their weapons before they can fall into the hands of the New Order. However, though his mother was a devoted druidess, Nathaniel owes no allegiance to the Gods. The last thing he wishes to do is to abandon his family and home and travel across the countryside at the bequest of Gods long-since thought dead. But the machinations of the Old Gods have not left Nathaniel able to easily walk away from his destiny, and in the end, it may take a loss greater than he can bear to compel him to aid the Gods in their foolish war.\"One\" is the first in an ambitious nine book cycle, containing within itself a trilogy of trilogies. The nine swords of the Old Gods are waking and once their existence becomes known, forces from across the world will be vying for the swords powerful enough to slay Gods. If Nathaniel does not rise to his destiny, it could be the end of the world – or at the very least, a world at war!* All proceeds from the book are being donated to GameHearts.org. Please visit their site for more information about their safe and sober recreations program for adults, and to learn more about how you can support their program.",
  "genres": [],
  "author": "Ron Glick",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/13144640-one"
}