{
  "title": "Nursing against the Odds: How Health Care Cost Cutting, Media Stereotypes, and Medical Hubris Undermine Nurses and Patient Care",
  "description": "In the United States and throughout the industrialized world, just as the population of older and sicker patients is about to explode, we have a major shortage of nurses. Why are so many RNs dropping out of health care's largest profession? How will the lack of skilled, experienced caregivers affect patients? These are some of the questions addressed by Suzanne Gordon's definitive account of the world's nursing crisis. In Nursing against the Odds , one of North America's leading health care journalists draws on in-depth interviews, research studies, and extensive firsthand reporting to help readers better understand the myriad causes of and possible solutions to the current crisis. Gordon examines how health care cost cutting and hospital restructuring undermine the working conditions necessary for quality care. She shows how the historically troubled workplace relationships between RNs and physicians become even more dysfunctional in modern hospitals. In Gordon's view, the public image of nurses continues to suffer from negative media stereotyping in medical shows on television and from shoddy press coverage of the important role RNs play in the delivery of health care. Gordon also identifies the class and status divisions within the profession that hinder a much-needed defense of bedside nursing. She explains why some policy panaceas―hiring more temporary workers, importing RNs from less-developed countries―fail to address the forces that drive nurses out of their workplaces. To promote better care, Gordon calls for a broad agenda that includes safer staffing, improved scheduling, and other policy changes that would give nurses a greater voice at work. She explores how doctors and nurses can collaborate more effectively and what medical and nursing education must do to foster such cooperation. Finally, Gordon outlines ways in which RNs can successfully take their case to the public while campaigning for health care system reform that actually funds necessary nursing care.",
  "genres": [
    "Nursing",
    "Medical",
    "Nonfiction",
    "Health Care",
    "Medicine",
    "Science",
    "Health"
  ],
  "author": "Suzanne Gordon",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/86114.Nursing_against_the_Odds"
}