{
  "title": "Paging Aphrodite",
  "description": "Four strong women from different walks of life in Australia, London and San Francisco, they've all come to the breathtakingly beautiful isle of Corfu seeking the same thing—refuge. Between marriage woes, dead-end careers, and demanding families, these women need a vacation—a little sun, a few shots of Sambuca, and a couple of sexy Greek men will surely allow them to relax, right? Maybe not.Australian Claire Dillon is 46, still has amazing legs, and is ready for a change. Her husband is having an affair with a 29-year old masseuse, and her gay son is looking for a father figure in a series of unsuitable boyfriends. When she takes off for Corfu in the middle of disaster, everyone says she's gone mad—and she's out to prove them right.Parker Glass' marriage lasted eleven days, not exactly what the perfectionist interior designer from San Francisco had dreamed of. After a breakdown at work, her partner firmly suggests she use her scheduled honeymoon time for some much needed sun and relaxation in the Greek Isles. At first, the vacation seems just the thing for getting her life back on track... but sometimes the cure is worse than the disease.Anya Soberanes is convinced she's cursed—how else could she still be looking for her soulmate? When her aunt finds her unconscious in her San Francisco apartment after inadvertently overdosing on sleeping pills and telenovelas, her parents give her an either take a vacation with her friend's sister Parker, or check into a mental-health facility. As Anya discovers, facing her fears is easy in Greece—it's making her dreams come true that's the hard part.25-year old Londoner Kelah Morris wants more than anything to publish a brilliant novel and prove to her editor mother that she's destined for more than selling popcorn at the cinema. All Kelah needs is an escape from her overbearing parents, dead-end job, jailbird brother and just-published friends to free herself of her infamous writer's block. Butshe doesn't factor in the possibility of wild career success and true love on her island getaway.Together, these four women discover that sometimes you need to get away from it all to discover what you really need.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Romance",
    "Greece",
    "Novels",
    "Travel"
  ],
  "author": "Kim Green",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/862028.Paging_Aphrodite"
}