{
  "title": "Changing My Mind: A Memoir",
  "description": "In a love story that shocked the world, Margaret Trudeau became the youngest First Lady when at age 22 she married Pierre Trudeau, a man almost thirty years her senior and the 15th Prime Minister of Canada. Pierre Trudeau served from 1968 to 1979 during a critical time in Canadian and international politics and during her term as First Lady, Margaret travelled internationally on government business and met closely with U.S. Presidents Richard Nixon, Gerald Ford, and Jimmy Carter. Stunningly beautiful, Margaret immediately became the focus of attention in any room she entered. Just as Princess Diana refused to submit to traditional expectations to the irritation of Prince Charles and to the criticism of the media, Margaret also remained true to her independent beliefs, which often clashed with the demands of her public role, and the press flocked to her, much to Pierre Trudeau’s chagrin. In her first book in almost thirty years, Margaret looks back on a controversial life and examines the consequences of her lifelong struggle with mental illness. From flower child to self-described “hippie mother,” unpredictable Margaret Trudeau became synonymous with scandal and intrigue internationally. She was criticized for wearing an inappropriately short dress to an official White House Dinner. She acted as Fidel Castro’s photographer for a day. She burst into song at a state dinner for the President of Venezuela. And rather than celebrate her sixth wedding anniversary with her husband, she spent a legendary weekend with the Rolling Stones, leading to worldwide rumours of trysts with Mick Jagger and Ron Wood. But happiness was short-lived for Margaret, who suffered a series of tragic losses: divorce from Pierre Trudeau; the death of her youngest son in a skiing accident; and divorce from her second husband, real estate mogul Fried Kemper. Margaret spiraled through suicidal depression and undiagnosed mania. She self-medicated with marijuana and alcohol, starved herself, and engaged in manic spending sprees that left her penniless until she was finally diagnosed and treated for bipolar disorder. Under intense international scrutiny, Margaret Trudeau has lived a life full of highs and lows, but has worked to regain control of her life. She is currently a national mental health advocate who has been awarded the Society of Biological Psychiatry Humanitarian Award for her efforts to help and inspire people suffering from mental illness. In this poignant memoir, Margaret Trudeau reveals her courageous lifetime struggle with mental illness and her journey of recovery, acceptance, and hope.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Canada",
    "Mental Health",
    "Book Club",
    "Autobiography"
  ],
  "author": "Margaret Trudeau",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/8621593-changing-my-mind"
}