{
  "title": "Cheap Cabernet: A Friendship",
  "description": "I didn't know that people come into our lives, and sometimes, if we're terribly lucky, we get the chance to love them, that sometimes they stay, that sometimes you can, truly, depend on them. Cathie Beck was in her late thirties and finally able to exhale after a lifetime of just trying to get by. A teenage mother harboring vivid memories of her own hardscrabble childhood, Cathie had spent years doing whatever it took to give her children the stability--or at least the illusion of it--that she'd never had. More than that, through sheer will and determination, she had educated them and herself too. With her kids in college, Cathie was at last ready to have some fun. The only problem was that she had no idea how to do it and no friends to do it with. So she put an ad in the paper for a made-up women's group: WOW . . . Women on the Way. Eight women showed up that first night, and out of that group a friendship formed, one of those meteoric, passionate, stand-by-you friendships that come around once in a lifetime and change you forever . . . if you're lucky. Praise for Cheap Cabernet: A Friendship \"This is a beautiful book about two remarkable women. I read Cheap Cabernet in one breathless sitting. I gulped it down and then I sat there and let the taste of love and sorrow and redemption linger for a long time.\" --Alison Smith, author of Name All the Animals  \"Beyond wonderful--wickedly funny, poignant, and smart. Anyone who's a fan of Mary Karr or Anne Lamott will find Cathie Beck's Cheap Cabernet both laugh-out-loud hysterical--and heartbreaking. --Elle Newmark, bestselling author of The Book of Unholy Mischief  \"Cathie Beck's Cheap Cabernet is a bracing story of a woman who took the crappy hand life had dealt her and turned it into a big win. With an awe-inspiring stamina, she kept going long past the point other people--like me--would've quit. I devoured this empowering and very funny memoir from the first page.\" --Julie Klam, author of Please Excuse My Daughter",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Book Club",
    "Chick Lit",
    "Friendship"
  ],
  "author": "Cathie Beck",
  "average_rating": "3.02",
  "url": "https://www.goodreads.com/book/show/8628106-cheap-cabernet"
}