{
  "title": "Reaper's Gale",
  "description": "A brutal, harrowing chapter of the Malazan Book of the Fallen from best selling author Steven EriksonAll is not well in the Letherii Empire. Rhulad Sengar, the Emperor of a Thousand Deaths, spirals into madness, surrounded by sycophants and agents of his Machiavellian chancellor. Meanwhile, the Letherii secret police conduct a campaign of terror against their own people. The Errant, once a farseeing god, is suddenly blind to the future. Conspiracies seethe throughout the palace, as the empire - driven by the corrupt and self-interested - edges ever-closer to all-out war with the neighboring kingdoms.The great Edur fleet--its warriors selected from countless numbers of people--draws closer. Amongst the warriors are Karsa Orlong and Icarium Lifestealer--each destined to cross blades with the emperor himself. That yet more blood is to be spilled is inevitable... Against this backdrop, a band of fugitives seek a way out of the empire, but one of them, Fear Sengar, must find the soul of Scabandari Bloodeye. It is his hope that the soul might help halt the Tiste Edur, and so save his brother, the emperor. Yet, traveling with them is Scabandari's most ancient Silchas Ruin, brother of Anomander Rake. And his motives are anything but certain - for the wounds he carries on his back, made by the blades of Scabandari, are still fresh.Fate decrees that there is to be a reckoning, for such bloodshed cannot go unanswered--and it will be a reckoning on an unimaginable scale. This is a brutal, harrowing novel of war, intrigue and dark, uncontrollable magic; this is epic fantasy at its most imaginative, storytelling at its most thrilling.At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Fiction",
    "High Fantasy",
    "Epic",
    "Dark Fantasy",
    "Audiobook"
  ],
  "author": "Steven Erikson",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/8623112-reaper-s-gale"
}