{
  "title": "Captured In Ink",
  "description": "At 27 yrs old, graphic novelist Shane Larson believes in trusting the greater plan of the universe and doing good to the best of his ability. To him this is a matter of practicality as much as a spiritual belief about how to live right which is why the road Shane chooses to follow in his life is leading him to use his doctorate in clinical psychology to help people. When a one-night stand turns out to be the woman of his dreams, Shane ends up taking a giant detour from his original life path as the universe sends him to Reesa Callahan’s front door. There he finds not just the woman he wants over all others, but a whole family that seems to need him. Though being in love is turning out to be just as rewarding as his father predicted, a relationship with Reesa is definitely a package deal. Shane doesn’t know if he has what it takes to become an instant father of four, but his sense of belonging with Reesa and the kids is the strongest tug of destiny he's ever felt.Reesa Callahan has lost a lot in the 34 years she'd been alive. At ten, she lost her birth family in a car accident. Then in college, she lost both her elderly adoptive parents. But when she lost her sister and her brother-in-law in a plane crash six months ago, Reesa decided she just couldn't lose anyone else. So she didn't even question trading in the life she had planned for custody of all four of her sister's children. Even though she also lost her established career and her fiancée taking on the kids, Reesa becomes determined not to lose her sense of herself as a woman. In hindsight, her decision to end her reluctant celibacy seemed like a good idea, especially with a shaggy, tattooed younger man wearing a tongue stud and eyebrow ring. She felt sure Shane Larson was not the sort of man to ever want more than one night. So when Shane shows up at her home professing to be in love with her, Reesa has to send him away, not because she doesn't want him, but because there’s just no time in her crazy life to fall in love.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction"
  ],
  "author": "Donna McDonald",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/13146151-captured-in-ink"
}