{
  "title": "Light Your Church on Fire Without Burning it Down: Church in the 21st Century: An Introduction the Holy Spirit and Charismatic/Pentecostal Christianity",
  "description": "Ken Blanchard, the \"One Minute Manager,\" \" I have personally sat under David Housholder's teaching on this topic, and I invite you to read this book and open yourself up to the potent, awareness-changing presence of the Holy Spirit in your life.\"This is the definitive \"beginner's guide\" to the biggest and most dynamic social-spiritual movement in human Pentecostalism.In easy-to-understand lay language, Housholder brings you on a moving and personal \"inside tour\" through the heart of Pentecostal spirituality, practice, and temperament.Far from a mere arms-length survey, you will touch, taste, and smell the movement from within during this rollicking, fast, breathtaking read. This book will change your views on Pentecostal Christians and may well re-wire your spirituality as well.This potent book is ideal as a text for seminary survey classes, small group studies, leadership retreats, or just personal journey reflection.Available on Kindle, you can read it on the plane...Ralph Moore \"This is a blast--fun to read, intellectually satisfying and leading straight to experiential faith. A must read for anyone wanting to go deeper with God.\"Richard Bliese, president of Luther Seminary in Minnesota, \"If you don't completely understand the Pentecostal religious experience, and if you don't know the exact vocabulary surrounding the Spirit-filled life, this book is for you.\"Tood Hunter, veteran Vineyard Church leader, Alpha director, and church planter, \"You'll find a way to all the right stuff while navigating around the rough waters of the weirdness you may fear.\"The author, David Housholder, hosts a popular worldwide iTunes podcast at his church (www.RobinwoodChurch.com) in Huntington Beach, California. He is also a surf instructor, sponsored snowboarder, wildcat oil investor in Texas, and author of published Bible study resources (see for his recent Galatians study which Augsburg Fortress has just put out). He is well-known on Twitter (@ RobinwoodChurch), Facebook, and LinkedIn. Raised and ordained in the Lutheran Church, he understands both conventional and Pentecostal Christianity firsthand.David was a Fulbright Scholar in Philosophy, New Testament, and Moral Theology at the University of Bonn, Germany in 1988-1989. He is also the consulting pastor of Hosanna! Lutheran Church in Lakeville, Minnesota. He has taught New Testament Greek at the graduate level and was a contributor to Danker's latest revision of Bauer's Lexicon.David lives with his wife of three decades and has a young adult son. His brothers are also major leaders in the Lutheran Church. His brother Mike, the perfect one, is the pastor of the largest Lutheran Church in North America (www.HopeWDM.org). His other brother, Tim, was the favorite. Search \"Housholder.\" any Sunday you are in Southern California and meet the author in person.This is the first of many books in the \"Church in the 21st Century\" series.",
  "genres": [],
  "author": "David Housholder",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/8627948-light-your-church-on-fire-without-burning-it-down"
}