{
  "title": "Superbug: The Fatal Menace of MRSA",
  "description": "LURKING in our homes, hospitals, schools, and farms is a terrifying pathogen that is evolving faster than the medical community can track it or drug developers can create antibiotics to quell it. That pathogen is MRSA—methicillin-resistant Staphyloccocus aureus —and Superbug is the first book to tell the story of its shocking spread and the alarming danger it poses to us all.Doctors long thought that MRSA was confined to hospitals and clinics, infecting almost exclusively those who were either already ill or old. But through remarkable reporting, including hundreds of interviews with the leading researchers and doctors tracking the deadly bacterium, acclaimed science journalist Maryn McKenna reveals the hidden history of MRSA’s relentless advance—how it has overwhelmed hospitals, assaulted families, and infiltrated agriculture and livestock, moving inexorably into the food chain. Taking readers into the medical centers where frustrated physicians must discard drug after drug as they struggle to keep patients alive, she discloses an explosion of cases that demonstrate how MRSA is growing more virulent, while evolving resistance to antibiotics with astonishing speed. It may infect us at any time, no matter how healthy we are; it is carried by a stunning number of our household pets; and it has been detected in food animals from cows to chickens to pigs.With the sensitivity of a novelist, McKenna portrays the emotional and financial devastation endured by MRSA’s victims, vividly describing the many stealthy ways in which the pathogen overtakes the body and the shock and grief of parents whose healthy children were felled by infection in just hours. Through dogged detective work, she discloses the unheard warnings that predicted the current crisis and lays bare the flaws that have allowed MRSA to rage out of misplaced government spending, inadequate public health surveillance, misguided agricultural practices, and vast overuse of the few precious drugs we have left.Empowering readers with the knowledge they need for self-defense, Superbug sounds an MRSA has evolved into a global emergency that touches almost every aspect of modern life. It is, as one deeply concerned researcher tells McKenna, \"the biggest thing since AIDS.\"",
  "genres": [
    "Science",
    "Nonfiction",
    "Medicine",
    "Health",
    "Medical",
    "Biology",
    "Disease"
  ],
  "author": "Maryn McKenna",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/8622246-superbug"
}