{
  "title": "Lidia's Italian Table: More Than 200 Recipes From The First Lady Of Italian Cooking",
  "description": "Lidia's Italian Table LIDIA MATTICCHIO BASTIANICH \"Let me invite you on a journey with me from my childhood ...\" beckons Lidia Bastianich, hostess of the national public television series Lidia's Italian Table. And what an incredible journey it proves to be. Lidia's Italian Table is overflowing with glorious Italian food, highlighted by Lidia's personal collection of recipes accumulated since her childhood in Istria, located in northern Italy on the Adriatic Sea. Hearty and heartwarming Italian fare is what Lidia understands best, and each chapter of this gorgeous cookbook is infused with Lidia's warm memories of a lifetime of eating and cooking Italian style. Since good Italian food is based on good ingredients, Lidia includes an eloquent discourse on those products that are the cornerstones of Italian olives (and their green-golden oil), Parmigiano-Reggiano cheese, salt, porcini mushrooms, truffles, tomato paste, and hot peppers. She also explains the importance of regional wines and grappa (in flavors from honey to dried fig) in the Italian food experience. Her recipes are filled with these Italian delicacies--Fennel, Olive, and Citrus Salad; Tagliatelle with Porcini Mushroom Sauce; Seared Rabbit Loin over Arugula with Truffle Dressing; Asparagus Gratin with Parmigiano-Reggiano Cheese-, and Zabaglione with Barolo Wine. Lidia explores every corner of Italian from fresh and dry pasta to gnocchi and risotto to game and shellfish, all of which Lidia transforms into exceptional Italian dishes. But that is only the beginning. There are Italian soups to savor, like hearty minestre, bread-enriched zuppe, and the light and flavorful brodi. Polenta's delicious versatility is revealed through Polenta, Gorgonzola, and Savoy Cabbage Torte and White Creamy Polenta with Fresh Plums. And Lidia's luscious dolci, or desserts, invite your indulgence with Sweet Crepes with Chocolate Walnut Filling, Blueberry-Apricot Frangipane Tart, and Soft Ice Cream with Hazelnuts. Lidia attributes her passion and appreciation for Italian food to her family. Lidia's Italian Table is filled with stories of learning to make Easter bread with her Grandma Rosa in the town's communal oven; touching and smelling her way through the food markets of Trieste with her great-aunt Zia Nina; fishing for calamari with her uncle Zio Milio; and collecting briny mussels and sea urchins along the Istrian coastline with her cousins. This gastronomic adventure is more than just a It is an exploration into the heart of Italian cuisine.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Italian Literature",
    "Italy",
    "Nonfiction"
  ],
  "author": "Lidia Matticchio Bastianich",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/864098.Lidia_s_Italian_Table"
}