{
  "title": "Everyday Greens: Everyday Greens",
  "description": "For more than twenty years, San Francisco's beloved Greens Restaurant has been in the avant garde of the cooking revolution in America. Through its endlessly inventive, ever-changing menus and bestselling cookbooks, Greens has introduced millions of delighted fans to a sophisticated, meatless cuisine packed with transcendent, satisfying flavor.The innovation continues. Everyday Greens is the first Greens book in a decade, and author Annie Somerville, executive chef since 1985, has written the most accessible cookbook yet. Greens's high level of flavor and creativity is everywhere, but the cooking is simpler, more relaxed. Here are more than 250 of the restaurant's most popular dishes fine-tuned for the home cook in straightforward recipes for the way we live today.This is spirited cooking for every day—from casual lunches and quick weeknight meals to family feasts and elegant entertaining. There are main-dish salads; soups that make a meal; rustic ragoûts; satisfying stews; vegetables on the grill; quick stir-fries; casseroles layered with flavor; innovative side dishes; pizzas, tortilla dishes, and savory tarts; pastas and risottos; warm beans and grains; sandwiches; salsas; pickles; and the famous Greens desserts.The heart of Greens cooking is to use the best, freshest ingredients—whether from the grocery store or your local farmers' market. Advice on finding and preparing these ingredients is combined with restaurant tips that simplify work in the kitchen. Through clever use of the freezer and pantry, Somerville shows how to minimize prep time with make-ahead dishes and born-again leftovers. Special features include pairing wine with Greens's food; advice on stocking the pantry with Asian ingredients, cooking oils, and dessert-making essentials; a resource guide for locally made cheeses; and the Kitchen Tool Box, a decidedly low-tech list of invaluable equipment. A final section on worm composting brings everything back to the source—the earth—and is sure to delight the passionate gardener.Readers of Fields of Greens love Somerville's warm, inspiring, friend-in-the-kitchen style. And Everyday Greens is more personal, so confidence-building that even beginners will want to dash into the kitchen and start cooking.",
  "genres": [
    "Cookbooks",
    "Food",
    "Cooking",
    "Vegetarian",
    "Nonfiction"
  ],
  "author": "Annie Somerville",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/864063.Everyday_Greens"
}