{
  "title": "The Berlin-Baghdad Express: The Ottoman Empire and Germany's Bid for World Power",
  "description": "The modern Middle East was forged in the crucible of the First World War, but few know the full story of how war actually came to the region. As Sean McMeekin reveals in this startling reinterpretation of the war, it was neither the British nor the French but rather a small clique of Germans and Turks who thrust the Islamic world into the conflict for their own political, economic, and military ends.\"The Berlin-Baghdad Express\" tells the fascinating story of how Germany exploited Ottoman pan-Islamism in order to destroy the British Empire, then the largest Islamic power in the world. Meanwhile the Young Turks harnessed themselves to German military might to avenge Turkey s hereditary enemy, Russia. Told from the perspective of the key decision-makers on the Turco-German side, many of the most consequential events of World War I Turkey s entry into the war, Gallipoli, the Armenian massacres, the Arab revolt, and the Russian Revolution are illuminated as never before.Drawing on a wealth of new sources, McMeekin forces us to re-examine Western interference in the Middle East and its lamentable results. It is an epic tragicomedy of unintended consequences, as Turkish nationalists give Russia the war it desperately wants, jihad begets an Islamic insurrection in Mecca, German sabotage plots upend the Tsar delivering Turkey from Russia s yoke, and German Zionism midwifes the Balfour Declaration. All along, the story is interwoven with the drama surrounding German efforts to complete the Berlin to Baghdad railway, the weapon designed to win the war and assure German hegemony over the Middle East.",
  "genres": [
    "History",
    "Nonfiction",
    "Germany",
    "World War I",
    "War",
    "World History",
    "European History"
  ],
  "author": "Sean McMeekin",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/8638105-the-berlin-baghdad-express"
}