{
  "title": "Bon Appetit Desserts: The Cookbook for All Things Sweet and Wonderful",
  "description": "THE dessert book from THE best food magazine.  For more than 50 years, Bon Appetit magazine has been seducing readers with to-die-for desserts. From quick homestyle cookies to unforgettable special-occasion finales such as spiced chocolate torte wrapped in chocolate ribbons, Bon Appetit showcases meticulously tested recipes that turn out perfectly--every time. Now, culled from Bon Appetit 's extensive archives and including never-before-published recipes, Bon Appetit Desserts promises to be the comprehensive guide to all things sweet and wonderful.Â  Authored by Bon Appetit editor-in-chief Barbara Fairchild, Bon Appetit Desserts features more than 600 recipes--from layer cakes to coffee cakes, tortes and cupcakes to pies, tarts, candies, puddings, souffles, ice cream, cookies, holiday desserts, and much, much more. Certain to inspire both experienced home cooks and those just starting out in the kitchen, each recipe is designed to ensure the dessert preparation process is as enjoyable as the finished result.Bon Appetit Desserts is destined to be the definitive, comprehensive, invaluable dessert resource.  \"This is a gorgeous book that makes me want to make everything--no, taste everything--inside! This is a must-have for every baker, cook, and sweet freak in your life.\" --Elizabeth Falkner, chef and owner of Citizen Cake and Orson  \"At last, a collection of Bon Appetit's most treasured dessert recipes, thoroughly tested as always, beautifully illustrated, and, of course, wonderfully delicious. You'll reach for this book each time sweets are on your menu, but you'll come back to it just as often for its myriad tips; great chapters on ingredients, equipment, and techniques; and the many detailed and easy-to-grasp how-tos.  It's truly a one-stop book for all of us who love baking.\" --Dorie Greenspan, author of From My Home to Yours and Around My French Table  \" Bon Appetit Desserts is filled with exactly the kind of sweets I like to inviting, unpretentious, and easy to love, but also innovative enough to turn a few heads. And the best part is, Bon Appetit Desserts is not only about recipes. With chapters on ingredients, equipment, and techniques, plus a slew of tips from the Bon Appetit test kitchens, it's also a mini-education. Oh, in case you aren't sold yet, I have ten words for Banana Layer Cake with Caramel Cream and Sea Salt-Roasted Pecans.\" --Molly Wizenberg, author of A Homemade Stories and Recipes from My Kitchen Table",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference"
  ],
  "author": "Barbara Fairchild",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/8640210-bon-appetit-desserts"
}