{
  "title": "Dating Game",
  "description": "In her 57th bestselling novel, Danielle Steel brilliantly chronicles the roller-coaster ride of dating the second time around—and tells a captivating story of the surprises one woman encounters when she’s thrust into the terrifying, exhilarating world of the Dating Game .Paris Armstrong never saw it coming. With two grown children and a lovely home in Connecticut, Paris was happy with her marriage, her family, her life. So when her husband of twenty-four years said they needed to talk, Paris couldn’t imagine what he was about to say.“I want a divorce,” Peter tells her. Just like that, the husband she adored had dumped her for a younger woman. And just like that, Peter and his thirty-one-year-old lover had made their plans for their future, leaving Paris to pick up the pieces of a shattered life. Within days, Peter was gone. And Paris was left to figure out how she intended to get through the next day, let alone the rest of her life.The task could not have been more painful. First came the tears. Then the excruciating attempts by well-meaning friends to “fix her up” with men who paled in comparison to Peter. Worse yet, she still loved him. Finally, Paris realized she was in a fight for her very survival. Drastic measures were called for. Even her shrink agreed. It was time to move—as far away as possible, just after Peter remarried. Paris had never felt, or been, more alone.Saying good-bye to the world she knew and loved, Paris heads west, to San Francisco, and discovers being single in a world full of men who were too young, too old, too married, or too good to be true. For Paris, the list seemed endless...the charming commitment-phobe...the drunken Neanderthal...the young Frenchman—so adorably sexy she almost forgot about his age, and did, for a while. With her dating track record veering between disappointing and disastrous, and her daughter now engaged to a man Paris’s age, Paris finally comes to the conclusion that romance is not in her future. That’s when her small circle of offbeat, loving friends becomes more important than ever before. And a decision Paris makes only for herself changes her life once more. The secret, she discovers finally, is in finding the gifts in life’s unexpected twists and turns, and turning despair into freedom and loss into joy.In a poignant, wickedly funny novel about getting dumped and getting over it, about tackling life with both courage and laughter, Danielle Steel explores what it means to start over, whether you wanted to or not, and finding something better than you had before.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Contemporary Romance",
    "Adult Fiction",
    "Novels"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/864806.Dating_Game"
}