{
  "title": "You Say Tomato, I Say Shut Up: A Love Story",
  "description": "In this hilarious and ultimately moving memoir, comedians and real-life married couple Annabelle Gurwitch and Jeff Kahn prove that in marriage, all you need is love—and a healthy dose of complaining, codependence, and pinot noir. After thirteen years of being married, Annabelle and Jeff have found “We’re just not that into us.” Instead of giving up, they’ve held their relationship together by ignoring conventional wisdom and fostering a lack of intimacy, by using parenting as a competitive sport, and by dropping out of couples therapy. The he-said/she-said chronicle of their intense but loving marriage includes an unsentimental account of the medical odyssey that their family embarked upon after their infant son was diagnosed with VACTERL, a very rare series of birth defects. Annabelle and Jeff’s unforgivingly raw, uproariously funny story is sure to strike both laughter and terror in the hearts of all couples (not to mention every single man or woman who is contemplating the connubial state). Serving up equal parts sincerity and cynicism, You Say Tomato, I Say Shut Up is a laugh-out-loud must-read for everyone who has come to realize that being “in love” can only get you so far. On CohabitationHe “Within days of Annabelle’s arrival, I became very aware that she demanded solitude and had the housekeeping habits of a feral animal.”She “The guy had some sort of nudity radar. When I would take my clothes off for even a second, Jeff would be in front of me cheering as if he’d scored box seats at Fenway Park.” On SexHe “I want to have sex every day, but Annabelle only wants to do it once a week. So we we have sex once a week.”She “Jeff says talking about money before you have sex is a turnoff, but it’s only a turnoff if you’re talking about not having money. Talking about money before you have sex when you have money is actually a turn-on.” On PregnancyHe “For God’s sake, all I wanted to do was have sex without a condom for a little while; now we were moments from bringing a new life into the world!”She “My ass was expanding so fast it was like a Starbucks franchise. On every corner of my ass there was a new branch of ass opening up.”",
  "genres": [
    "Nonfiction",
    "Humor",
    "Memoir",
    "Biography",
    "Marriage",
    "Autobiography",
    "Relationships"
  ],
  "author": "Annabelle Gurwitch",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/8646764-you-say-tomato-i-say-shut-up"
}