{
  "title": "Hiding from Reality: My Story of Love, Loss, and Finding the Courage Within",
  "description": "Taylor Armstrong, star of The Real Housewives of Beverly Hills on Bravo, pulls back the curtain on the years she suffered in silence through domestic violence in this searingly honest account of her troubled marriage to the late Russell Armstrong. “The terrible truth is that I felt lost without the control that Russell had imposed on me for the nearly six years that we were married. Disturbingly, I missed that control. I didn’t know what to do once I had no one there to tell me how to dress, act, and behave; what to want; and who, even, to be. In some ways, I missed the abuse. I missed the pain. I missed being scared. Not because I liked feeling any of that. But because it was the life I had become accustomed to, and without anyone to be afraid of, to apologize to, and to cover for, I felt completely lost.” Reality hit Taylor Armstrong hard one tragic evening last August when she found the body of her estranged husband, Russell, hanging in his California home. Fans across the country were shocked at the horrific news of his death and even more shocked to discover that behind the glittering “reality” of Taylor’s life on The Real Housewives of Beverly Hills lurked a painful story of emotional and physical abuse that she had been terrified to tell. To the outside world, the Armstrongs lived like royalty, throwing lavish parties—including a memorable tea party for their daughter’s fourth birthday—and mingling with their privileged Housewives co-stars. It was impossible to hide the cracks in their marriage from the cameras forever, though, and their darkest secrets slowly began to seep through the gilded façade. With searing honesty, Taylor candidly examines her difficult journey from the abusive home in which she was born to the low self-esteem that kept her constantly on the run from herself, to the tumultuous marriage that ended in suicide, and ultimately to her realization that only by sharing her moving story could she help other women.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "True Story",
    "Autobiography",
    "Tv"
  ],
  "author": "Taylor Armstrong",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/13147091-hiding-from-reality"
}