{
  "title": "Knighthorse",
  "description": "The first two books in the #1 bestselling Jim Knighthorse series of detective novels! Written in the tradition of Robert B. Parker's Spenser and Raymond Chandler's Philip Marlowe, Dark Horse and The Mummy Case introduce a hard-hitting, wise-cracking hero with a modern twist.DARK HORSEWhen high school student Derrick Booker, the only black student at a posh Orange County high school, is accused of killing his white girlfriend, ex-college football hero and detective Jim Knighthorse is hired to dig a little deeper into the murder. It doesn't take long for Knighthorse to realize that not all is as it seems at tranquil Huntington High, from a band director who preys on the innocent to a vice-principal with a secret agenda of her own. Not to mention someone's hired a professional killer to keep Knighthorse permanently off the case. As the investigation continues, Knighthorse's personal life is shattered by the discovery of new evidence relating to his mother's unsolved murder, a murder dating back twenty years. Reeling from the discovery, a determined Jim Knighthorse sets out to bring two killers to justice.THE MUMMY CASEPrivate investigator Jim Knighthorse takes on a very, very cold case. When historian Willie Clarke dies of mysteriously of dehydration in the California deserts, ex-football hero Jim Knighthorse is hired to dig a little deeper―and discovers a shocking connection to one of the West's oldest mysteries. Over a hundred years ago, an unnamed cowboy was murdered in the California desert and, due to freak weather conditions, would become mummified within twenty-four hours. Now known to the world as Sylvester the Mummy and displayed in a creepy curiosity shop, Sylvester and historian Willie Clarke will be forever linked in mystery. That is, unless private investigator Jim Knighthorse can survive long enough to untangle one of the West's greatest unsolved murders.**Acclaim for the Novels of J.R. Rain**\"Gripping, adventurous, and romantic―J.R. Rain's The Lost Ark is a breakneck thriller that traces the thread of history from Biblical stories to current-day headlines. Be prepared to lose sleep!\"― JAMES ROLLINS , international bestselling author of Altar of Eden and The Doomsday Key\" Dark Horse is one of the best books I've read in a long time! A great classic detective story with a modern twist. Unique and interesting characters (I think I'm half in love with Jim Knighthorse now!), a great plot that kept me guessing until the end, and some of the funniest lines I've read anywhere.\"― GEMMA HALLIDAY , author of Deadly Cool and Play Dead\"Impossible to put down. J.R. Rain's Moon Dance is a fabulous urban fantasy.\"― APRIL VINE , author of The Midnight Rose and Blindfolded by Lust\" Moon Dance is absolutely brilliant!\"― LISA TENZIN-DOLMA , author of Understanding the Planetary Myths and The Dolphin Experience\" Moon Dance is a must read. If you like Janet Evanovich's Stephanie Plum, bounty hunter, be prepared to love J. R. Rain's Samantha Moon, vampire private investigator.\"― EVE PALUDAN , author of Witchy Business and Taking Back Tara",
  "genres": [
    "Mystery",
    "Thriller",
    "Suspense",
    "Fiction",
    "Amazon",
    "Mystery Thriller"
  ],
  "author": "J.R. Rain",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/8646050-knighthorse"
}