{
  "title": "Being and Time",
  "description": "A revised translation of Heidegger’s most important work.The publication in 1927 of Martin Heidegger’s magnum opus signaled an intellectual event of the first order and had an impact in fields far beyond that of philosophy proper. Being and Time has long been recognized as a landmark work of the twentieth century for its original analyses of the character of philosophic inquiry and the relation of the possibility of such inquiry to the human situation. Still provocative and much disputed, Heidegger’s text has been taken as the inspiration for a variety of innovative movements in fields ranging from psychoanalysis, literary theory, and existentialism to ethics, hermeneutics, and theology. A work that disturbs the traditions of philosophizing that it inherits, Being and Tim e raises questions about the end of philosophy and the possibilities for thinking liberated from the presumptions of metaphysics.The Stambaugh translation captures the vitality of the language and thinking animating Heidegger’s original text. It is also the most comprehensive edition insofar as it includes the marginal notes made by Heidegger in his own copy of Being and Time , and takes into account the many changes that he made in the final German edition of 1976. The revisions to the original translation correct ambiguities and problems that have become apparent since the translation first appeared. Bracketed German words have also been liberally inserted both to clarify and highlight words and connections that are difficult to translate, and to link this translation more closely to the German text. This definitive edition will serve the needs of scholars well acquainted with Heidegger’s work and of students approaching Heidegger for the first time.Praise for the original edition“Stambaugh’s new version has large virtues, and improves on the only alternative … [It] is best suited to beginning or general audiences … These will find its spare and unobtrusive apparatus, which lets the text stand out more simply on its own and not bristling with flagged complications, a decisive virtue … As a supplement or for comparison, or as a vehicle for reacquainting oneself with the work, it gives excellent service.” — TLS“This new translation … offers the text in a more precise and understandable English than earlier editions.” — Library Journal“Stambaugh’s greatest merit as a translator is her ability to render the most difficult of Heidegger’s prose … into an English that remains both elegant and as faithful as possible to the original … The bilingual glossary and index in the back are marvelously helpful … Any translation of Sein und Zeit cannot help being a welcome contribution, even a significant landmark, within the world of Heidegger scholarship.” — MLN",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Classics",
    "Psychology",
    "Theory",
    "German Literature",
    "Science"
  ],
  "author": "Martin Heidegger",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/8650728-being-and-time"
}