{
  "title": "Joe Wilson and His Mates",
  "description": "This edition is written in English. However, there is a running German thesaurus at the bottom of each page for the more difficult English words highlighted in the text. There are many editions of Joe Wilson and His Mates. This edition would be useful if you would like to enrich your German-English vocabulary, whether for self-improvement or for preparation in advanced of college examinations. Webster's edition of this classic is organized to expose the reader to a maximum number of difficult and potentially ambiguous English words. Rare or idiosyncratic words and expressions are given lower priority compared to \"difficult, yet commonly used\" English words. Rather than supply a single translation, many words are translated for a variety of meanings in German, allowing readers to better grasp the ambiguity of English without using the notes as a pure translation crutch. Having the reader decipher a word's meaning within context serves to improve vocabulary retention and understanding. Each page covers words not already highlighted on previous pages. This edition is helpful to German-speaking students enrolled in an English Language Program (ELP), an English as a Foreign Language (EFL) program, an English as a Second Language Program (ESL), or in a TOEFL® or TOEIC® preparation program. Students who are actively building their vocabularies in German or English may also find this useful for Advanced Placement® (AP®) tests. TOEFL®, TOEIC®, AP® and Advanced Placement® are trademarks of the Educational Testing Service which has neither reviewed nor endorsed this book. This book is one of a series of Webster's paperbacks that allows the reader to obtain more value from the experience of reading. Translations are from Webster's Online Dictionary, derived from a meta-analysis of public sources, cited on the site.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Australia"
  ],
  "author": "Henry Lawson",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/8644892-joe-wilson-and-his-mates"
}