{
  "title": "The Evolution of Calpurnia Tate: (Newbery Honor Book)",
  "description": "In this witty historical fiction middle grade novel set at the turn of the century, an 11-year-old girl explores the natural world, learns about science and animals, and grows up. A Newbery Honor Book.“The most delightful historical novel for tweens in many, many years. . . . Callie's struggles to find a place in the world where she'll be encouraged in the gawky joys of intellectual curiosity are fresh, funny, and poignant today.” ― The New YorkerCalpurnia Virginia Tate is eleven years old in 1899 when she wonders why the yellow grasshoppers in her Texas backyard are so much bigger than the green ones. With a little help from her notoriously cantankerous grandfather, an avid naturalist, she figures out that the green grasshoppers are easier to see against the yellow grass, so they are eaten before they can get any larger. As Callie explores the natural world around her, she develops a close relationship with her grandfather, navigates the dangers of living with six brothers, and comes up against just what it means to be a girl at the turn of the century.Author Jacqueline Kelly deftly brings Callie and her family to life, capturing a year of growing up with unique sensitivity and a wry wit.The Evolution of Calpurnia Tate by Jacqueline Kelly was a 2010 Newbery Honor Book and the winner of the 2010 Bank Street - Josette Frank Award. This title has Common Core connections. This is perfect for young readers who like historical fiction, STEM topics, animal stories, and feminist middle grade novels.Don't miss the sequel!The Curious World of Calpurnia TateTo follow Calpurnia Tate on more adventures, read the Calpurnia Tate, Girl Vet chapter book Skunked!Counting SheepWho Gives a Hoot?A Prickly Problem",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Middle Grade",
    "Fiction",
    "Historical",
    "Childrens",
    "Coming Of Age"
  ],
  "author": "Jacqueline Kelly",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/8651098-the-evolution-of-calpurnia-tate"
}