{
  "title": "Me the People: One Man's Selfless Quest to Rewrite the Constitution of the United States of America",
  "description": "The United States Constitution promised a More Perfect Union. It’s a shame no one bothered to write a more perfect Constitution—one that didn’t trigger more than two centuries of arguments about what the darn thing actually says.Until now. Perfection is at hand. A new, improved Constitution is here. And you are holding it.But first, some historical context: In the eighteenth century, a lawyer named James Madison gathered his friends in Philadelphia and, over four long months, wrote four short pages: the Constitution of the United States of America. Not bad.In the nineteenth century, a president named Abraham Lincoln freed an entire people from the flaws in that Constitution by signing the Emancipation Proclamation.  Pretty impressive.And in the twentieth century, a doctor at the Bethesda Naval Hospital delivered a baby—but not just any baby. Because in the twenty-first century, that baby would become a man, that man would become a patriot, and that patriot would rescue a country . . . by single-handedly rewriting that Constitution.Why? We think of our Constitution as the painstakingly designed blueprint drawn up by, in Thomas Jefferson’s words, an “assembly of demigods” who laid the foundation for the sturdiest republic ever created. The truth is, it was no blueprint at all but an Etch A Sketch, a haphazard series of blunders, shaken clean and redrawn countless times during a summer of petty debates, drunken ramblings, and desperate compromise—as much the product of an “assembly of demigods” as a confederacy of dunces.No wonder George Washington wished it “had been made more perfect.” No wonder Benjamin Franklin stomached it only “with all its faults.” The Constitution they wrote is a hot mess. For starters, it doesn’t mention slavery, or democracy, or even Facebook; it plays favorites among the states; it has typos, smudges, and misspellings; and its Preamble, its most famous passage, was written by a man with a peg leg. Which, if you think about it, gives our Constitution hardly a leg to stand on.[Pause for laughter.]Now stop laughing. Because you hold in your hands no mere book, but the most important document of our time. Its creator, Daily Show writer Kevin Bleyer, paid every price, bore every burden, and saved every receipt in his quest to assure the salvation of our nation’s founding charter. He flew to Greece, the birthplace of democracy. He bused to Philly, the home of independence. He went toe-to-toe (face-to-face) with Scalia. He added nightly confabs with James Madison to his daily consultations with Jon Stewart. He tracked down not one but two John Hancocks—to make his version twice as official. He even read the Constitution of the United States.So prepare yourselves, fellow patriots, for the most significant literary event of the twenty-first, twentieth, nineteenth, and latter part of the eighteenth centuries. Me the People won’t just form a More Perfect Union. It will save America.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Politics",
    "History",
    "American History",
    "Memoir",
    "Audiobook"
  ],
  "author": "Kevin Bleyer",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/13147828-me-the-people"
}