{
  "title": "Power Play",
  "description": "In this action adventure thriller, a ship transporting an elite military machine sinks in a storm off the east coast of Australia. The Aquabot is a unique military device has the ability to camouflage itself to its surroundings. Unleashed into the sea, anything can happen. American tourists, Gene and Sheridan McCabe, are scuba diving in the area the next day when Gene is brutally attacked and killed. Dissatisfied when the incident is written off as a shark attack, Sheridan enlists the services of government secret agents and private mercenaries, Ben Logan and Gus Edwards, to track down the mysterious thing that killed her brother.At this time a Russian general learns of the Aquabot's existence and wants to steal the machine in order to study its technology. The general's scheme is complicated when a KGB agent plots against him and plans to take the glory.After an incident occurs at an alleged marine biology facility on the South Australian coast, Ben Logan is called on by the Australian government to infiltrate the facility and unearth its real purpose. His investigation leads him to a base in the desert, where he learns of the Aquabot's connection to the American-owned facilities. But that's not what stuns him the most. In an underground bunker beneath the desert compound, Logan discovers a cache of military machines just waiting to be unleashed.The Aquabot is the brainchild of American billionaire, Jordan Sterling, leader of a corporation that has spent billions of dollars in building an elite robotic force to be used in military take-overs in a quest for global power. But Sterling needs a constant supply of uranium to power his nuclear army, and the most vulnerable source in plentiful supply is found in Australia.Learning that Logan has knowledge of his Australian operations and the whereabouts of the Aquabot, Sterling arranges the kidnapping of Logan and his friends. When Logan refuses to tell Sterling anything, Sterling hands them over to his right-hand man, Raymond Steele. Steele has a passion for hunting. Logan, Gus and Sheridan are dumped on a deserted island in Western Samoa, where Steele hunts them down like animals. Time is running out. If Logan doesn't get back to Australia and stop the take-over, Sterling's plans for global power will be virtually unstoppable, and the freedom of Logan's country lost forever.Find out in one of the best action adventure books of the year!But first he has to contend with Raymond Steele, escape from the island and find his way back home. There, with the streets overrun by people on Sterling's payroll, Russian agents seeking to obtain their own slice of glory, and a myriad of military machines programmed with nothing but death and destruction, Logan can find only one person who can A mysterious CIA Agent who emerges from Sterling's operation. They join forces to concoct the one and only plan that will destroy Sterling's road to global power. It's their only chance, but can they do it in time?",
  "genres": [],
  "author": "Darren G. Burton",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/8658356-power-play"
}