{
  "title": "اغتيال العقل: محنة الثقافة العربية بين السلفية والتبعية",
  "description": "أعلن صعود الهيمنة الأوروبية، والغربية عامة، في العالم أجمع، نهاية المدنيات الكلاسيكية، وبداية تحلل بنياتها الأساسية، وأدخلها في أزمة تاريخية طويلة مادية وروحية، ولم تكن المدنية العربية بمعزل عن هذه الهزة التاريخية، بل كانت في قلبها. وقد أدى تأكد الغلبة الجديدة العسكرية والحضارية منذ القرن الثامن عشر إلى تحلل أكبر إمبراطورية إسلامية تدريجياً وتطاير أشلائها، في مطلع القرن العشرين، في كل الاتجاهات. لقد نخرت هذه الغلبة الأسس الثابتة والتقليدية للهيمنة الداخلية والسلطة الاجتماعية، وأفقدت نظمها القائمة، الاقتصادية والعقلية، فاعليتها وتأثيرها.لذا وفي إطار البحث عن توازنات جديدة عقلية وسياسية واقتصادية منذ انهيار السلطنة العثمانية، وبحافز مقاومة التحلل الكامل والتلاشي تحت ضغط المرحلة الاستعمارية التقليدية، حاولت الجماعة العربية في نهاية القرن الماضي وحتى منتصف هذا القرن محاولات متعددة لإعادة تكوين عناصرها ولحمها وتشكيل نفسها كمدنية فاعلة ضمن الحضارة الجديدة، أي كذات مستقلة وعاملة.إلا أن هناك قناعة صحية اليوم بأن حصاد العقود الثلاثة الماضية كان ضعيفاً جداً في قطاعات رئيسية من التجربة الحضارية. فلم يحصل أي تراكم نوعي وجدّي في ميدان الخبرة الصناعية والتكنولوجية، ولا في ميدان البحث العلمي التطبيقي والأساسي، الطبيعي والإنساني، ولا في بناء الدولة القومية المعبرة عن إرادة الجماعة والمجسمة لها، ولا في تنظيم السلطة الاجتماعية والقانونية وهيكلة المجتمع المدني.كل ذلك يفيد القول بأن الرد المطلوب اليوم من الأمة العربية ليس إصلاح النظام القومي العربي الذي عرفته في العقود الماضية، أو إعادته إلى ما كان عليه كما يطرح ذلك لبعض ما يجب القيام به وعلى ضوء المسألة الكبرى هو مراجعة نقائص الردود العربية منذ النهضة على هذه المشكلة، بهدف إعادة النظر في تصور طبيعة هذه المعركة وتحديد القوى الفاعلة فيها أهدافها ومراميها ورهاناتها، وفي سبيل الوصول إلى رؤية واضحة ومقبولة لما يمكن أن يكون عليه نظام المستقبل العربي، أي أيضاً، الرد على حركة التحلل والتفكيك التي تثيرها صعود الهيمنة الغربية في قلب المدينة العربية. في سبيل ذلك لا بد من القيام بفحص للمفاهيم العربية العقلية والسياسية والاقتصادية والاجتماعية، وإعادة دراستها على ضوء الأوضاع الجديدة.ضمن هذا الإطار تأتي هذه المراجعة حول محنة الثقافة العربية بين السلفية والتبعية، حيث لم يثن الباحث من هذه المراجعة حقبة من حقب التاريخ العربي الحديث. والهدف الكشف عن عوامل الحركة والتطور والوحدة والتلاحم الفكري والمادي وإبرازها وتعميقها وتوسيعها، وهذا بمعنى من المعاني إنشاء الجماعة، أي تكوينها في الذهن كما يجب أن تكون. وقد استدعى ذلك من الباحث الكشف عن المصادر والمنابع الروحية والمادية، الثقافية والاجتماعية والاقتصادية التي تغذي النهضة وإبرازها، كما استدعى ذلك مناقشته الأسس التي قامت عليها التجارب السابقة وتبيان مدى نجاحها أو فشلها في استغلال هذه المصادر وتعبئتها دون تفريط لإنجاز الهدف المطلوب.ولتسهيل البحث تمّ التمييز بين ثلاث مسائل رئيسية تشكل أسس التفكير في مسألة النهضة العربية وهي: المسألة الثقافية، ثم السياسية، ثم الاجتماعية، مخصصاً الكتاب من ثم للمسألة الأولى \"المسألة الثقافية\" وذلك لسببين أولهما: أن مسألة الثقافة والصراع على تقدير مكانة الثقافة العربية في النهضة، كانت ولا زالت ميدان النقاش الرئيسي بين المثقفين العرب حول مشاكل النهضة. وثانيها: لأن العقل يستطيع أن يطلّ من الثقافة باعتبارها مجموعة القيم العامة التي تلهم سلوك الجماعة وممارستها الفكرية والسياسية والاقتصادية على مجمل البنية الاجتماعية.",
  "genres": [
    "Politics",
    "Philosophy",
    "Sociology",
    "Nonfiction",
    "History"
  ],
  "author": "برهان غليون",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/8658794"
}