{
  "title": "Wine of the Mystic: The Rubaiyat of Omar Khayyam: A Spiritual Interpretation",
  "description": "The Rubaiyat of Omar Khayyam as translated by Edward FitzGerald has long been one of the most beloved, and least understood, poems in the English language. In an illuminating new interpretation, Paramahansa Yogananda, author of Autobiography of a Yogi, reveals the mystical essence of this enigmatic masterpiece, bringing to light the deeper truth and beauty behind its veil of metaphor. Commonly thought to be a celebration of wine and other worldly pleasures, these lyrical Persian quatrains find their true voice when read as a hymn to the transcendent joys of Spirit. This beautifully illustrated edition of Wine of the Mystic introduces for the first time in book form Paramahansa Yogananda's complete commentaries on an enduring treasure of world literature. Yogananda \"One day as I was deeply concentrated on the pages of Omar Khayyam's Rubaiyat, I suddenly beheld the walls of its outer meanings crumble away, and the vast inner fortress of golden spiritual treasures stood open to my gaze. Ever since, I have admired the beauty of the previously invisible castle of inner wisdom in the Rubaiyat. I have felt that this dream-castle of truth, which can be seen by any penetrating eye, would be a haven for many shelter-seeking souls invaded by enemy armies of ignorance. Profound spiritual treatises by some mysterious divine law do not disappear from the earth even after centuries of misunderstanding, as in the case of the Rubaiyat. Not even in Persia is all of Omar Khayyam's deep philosophy understood in its entirety, as I have tried to present it.\" Winner of the 1995 Benjamin Franklin Award for Best Book in the Field of Religion, this edition features 50 beautiful original color illustrations and includes Persian text and spiritual commentary to each quatrain.",
  "genres": [
    "Poetry",
    "Spirituality",
    "Classics",
    "Fiction",
    "Philosophy",
    "Iran",
    "Literature"
  ],
  "author": "Omar Khayyám",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/86562.Wine_of_the_Mystic"
}