{
  "title": "The Day Trader: A Novel",
  "description": "Dr. Rich Proffette of the Wharton School in 1999 discovers the Holy Grail of Wall Street: a breakthrough stock trading algorithm with an uncanny ability to predict stock price movements. His trading model, Market Equilibrium Shock Theory, is widely hailed as one of the great economic ciphers of the 20th century and has rewarded him with a vast fortune amid Wall Street's longest Bull Market rampage. It seems that stock traders everywhere from underworld hackers to global banks and the U.S. government want to seize the precious intellectual property of Rich Proffette. Everyone except the one true love of his life: the stunning, gifted, Wharton research assistant, Katherine North, who invented the model with him. She knows a dark secret that may cost him everything. \"The Day Trader\" brings you on a random walk down Market Street in the City of Brotherly Love. This comic novel immerses you in the exotic universe of day trading with a jaunt through virtual Wall Street, where investors drive relentlessly to become rich at the risk of their capital despite the odds against them. Quoted on Forbes.com in \"8 Quotes That Will Make You a Wall Street Success\": http://www.forbes.com/sites/forbesmar...\"Lentz is a novelist whose knowledge of the inner workings of Wall Street and day trading fuels his plots.\" - Greenwich Time \"A talent for blending a compelling story line with pathos and humor...\" -The Greenwich Post \"A 21st century, digital metaphor.\"- The Redding Pilot \"Lentz's approach to writing is soul driven.\"- The Weston Forum \"He does not manufacture cookie-cutter best-sellers.\"- The Wilton Bulletin \"Super entertainment, a real page turner. Before you know it, you are immersed in the day trader's world and fascinated by the action.\" - J.C. Ackerman, CEO, Day Trader \"For those who have worked on Wall Street or have merely owned a few shares in perplexing markets this book hits home.\"- Professor Joseph Connolly, MBA, Paris",
  "genres": [
    "Economics"
  ],
  "author": "David B. Lentz",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/8655016-the-day-trader"
}