{
  "title": "Prowl",
  "description": "The Game Series • Book 12 • Sequel to Apex Predator • MM+MM • Primal Play • D/s • ADHD in Romance • High-Protocol Kink • Age Gap • Second Chances • Ethical Non-MonogamyThe vacation is over for the four men you met in Apex Predator, and now it’s time for Ty and Walker to be on the prowl to secure their happily ever afters.What do you do when you come home from a vacation that changed your life?Walker McKenna was finally back with his husband and beloved submissive, Macklin. They had their work cut out for them, and they were ready. Walker had spent four years trying to get over the love of his life, and it just wasn’t happening. He couldn’t go back to that life-sucking void of an existence. But that didn’t mean his new path was paved with roses and unwavering confidence. When the ghosts of past hurt and insecurities grabbed hold of both men, Walker had to go on a hunt once more—and this time was different. This time, he found support in a new friend. A man with a fresh take on life, devilish charm, and a mission of his own.Ty Madison returned home to DC and the blizzard of the year. He had one goal. To make Lane his—permanently. Ty couldn’t just write off the insane week they’d shared down south as a vacation fling. They belonged together. But before he went after the young man, who had his reasons for avoiding attachments at all costs, they had a storm to weather, and Ty found himself alone in his house with Walker. A man with insight, incredible charisma, and troubles of his own.Maybe some missions were best executed as a team.-The Game Series is a BDSM series where romance meets the reality of kink. Sometimes we fall for someone we don’t match with, sometimes vanilla business gets in the way of kinky pleasure, and sometimes we have to compromise and push ourselves to overcome trauma and insecurities. No matter what, one thing is certain. This is not a perfect world—and maybe that’s why the happily ever after feels so good.",
  "genres": [
    "BDSM",
    "M M Romance",
    "M M M",
    "Contemporary",
    "Romance",
    "Polyamory",
    "Second Chance"
  ],
  "author": "Cara Dee",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/86535213-prowl"
}