{
  "title": "Master of the Senate",
  "description": "Master of the Senate, Book Three of The Years of Lyndon Johnson, carries Johnson’s story through one of its most remarkable periods: his twelve years, from 1949 to 1960, in the United States Senate.At the heart of the book is its unprecedented revelation of how legislative power works in America, how the Senate works, and how Johnson, in his ascent to the presidency, mastered the Senate as no political leader before him had ever done. It was during these years that all Johnson’s experience—from his Texas Hill Country boyhood to his passionate representation in Congress of his hardscrabble constituents to his tireless construction of a political machine—came to fruition. Caro introduces the story with a dramatic account of the Senate itself: how Daniel Webster, Henry Clay, and John C. Calhoun had made it the center of governmental energy, the forum in which the great issues of the country were thrashed out. And how, by the time Johnson arrived, it had dwindled into a body that merely responded to executive initiatives, all but impervious to the forces of change. Caro anatomizes the genius for political strategy and tactics by which, in an institution that had made the seniority system all-powerful for a century and more, Johnson became Majority Leader after only a single term-the youngest and greatest Senate Leader in our history; how he manipulated the Senate’s hallowed rules and customs and the weaknesses and strengths of his colleagues to change the “unchangeable” Senate from a loose confederation of sovereign senators to a whirring legislative machine under his own iron-fisted control. Caro demonstrates how Johnson’s political genius enabled him to reconcile the unreconcilable: to retain the support of the southerners who controlled the Senate while earning the trust—or at least the cooperation—of the liberals, led by Paul Douglas and Hubert Humphrey, without whom he could not achieve his goal of winning the presidency. He shows the dark side of Johnson’s ambition: how he proved his loyalty to the great oil barons who had financed his rise to power by ruthlessly destroying the career of the New Dealer who was in charge of regulating them, Federal Power Commission Chairman Leland Olds. And we watch him achieve the impossible: convincing southerners that although he was firmly in their camp as the anointed successor to their leader, Richard Russell, it was essential that they allow him to make some progress toward civil rights. In a breathtaking tour de force, Caro details Johnson’s amazing triumph in maneuvering to passage the first civil rights legislation since 1875. Master of the Senate, told with an abundance of rich detail that could only have come from Caro’s peerless research, is both a galvanizing portrait of the man himself—the titan of Capital Hill, volcanic, mesmerizing—and a definitive and revelatory study of the workings and personal and legislative power.",
  "genres": [
    "Biography",
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Presidents",
    "Biography Memoir"
  ],
  "author": "Robert A. Caro",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/86525.Master_of_the_Senate"
}