{
  "title": "The Secret Man: The Story of Watergate's Deep Throat",
  "description": "In Washington, D.C., where little stays secret for long, the identity of Deep Throat -- the mysterious source who helped Bob Woodward and Carl Bernstein break open the Watergate scandal in 1972 -- remained hidden for 33 years. Now, Woodward tells the story of his long, complex relationship with W. Mark Felt, the enigmatic former No. 2 man in the Federal Bureau of Investigation who helped end the presidency of Richard Nixon.The Secret Man chronicles the story in intimate detail, from Woodward's first, chance encounter with Felt in the Nixon White House, to their covert, middle-of-the-night meetings in an underground parking garage, to the aftermath of Watergate and decades beyond, until Felt finally stepped forward at age 91 to unmask himself as Deep Throat.The Secret Man reveals the struggles of a patriotic career FBI man, an admirer of J. Edgar Hoover, the Bureau's legendary director. After Hoover's death, Mark Felt found himself in the cross fire of one of Washington's historic contests, as Nixon and his men tried to dominate the Bureau and cover up the crimes of the administration. This book illuminates the ongoing clash between temporary political power and the permanent bureaucracy of government. Woodward explores Felt's conflicts and motives as he became Deep Throat, not only secretly confirming Woodward and Bernstein's findings from dozens of other sources, but giving a sense of the staggering sweep of Nixon's criminal abuses.In this volume, part memoir, part morality tale, part political and journalistic history, Woodward provides context and detail about The Washington Post's expose of Watergate. He examines his later, tense relationship with Felt, when the FBI man stood charged with authorizing FBI burglaries. (Not knowing Felt's secret role in the demise of his own presidency, Nixon testified at Felt's trial, and Ronald Reagan later pardoned him.) Woodward lays bare his own personal struggles as he tries to define his relationship, his obligations, and his gratitude to this extraordinary confidential source.The Secret Man is an intense, 33-year journey, providing a one-of-a-kind study of trust, deception, pressures, alliances, doubts and a lifetime of secrets. Woodward has spent more than three decades asking himself why Mark Felt became Deep Throat. Now the world can see what happened and why, bringing to a close one of the last chapters of Watergate.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "Journalism",
    "American History",
    "Audiobook"
  ],
  "author": "Bob Woodward",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/86616.The_Secret_Man"
}