{
  "title": "دمية النار",
  "description": "في هذا الكتاب رائعة الروائي الجزائري المعروف \"بشير مفتي\" الجديدة \"دمية النار\"يضعنا فيها الكاتب أمام تراجيديا حقيقية يفتح بها أقفالاً مغلقة في سراديب مظلمة عاشتها بلاده في سبعينيات وثمانينيات هذا القرن، حين التقى الروائي بطل روايته \"السيد رضا شاوش\" في العام 1985 عندما \"حدث الانفجار الذي هزّ البلد بأكمله، وكنت قد أنهيت لتوي دراستي الجامعية حينما بدأت تحدث الاغتيالات العجيبة في صفوف المثقفين، ثم راحت أخبار الانفجارات التي تقع في كل مكان من هذه الأرض\".ربما يكون \"بشير مفتي\" هنا يصوغ تجربته الخاصة في مواجهة التبعية والاستقلال الثقافي ليضع أمام القارئ صيرورة الأحداث في حركتها التاريخية والمجتمعية وبناء كينونتها الخاصة إزاء المؤثرات المختلفة التي تجعل القاص في مواجهة بنى السلطة السياسية والاجتماعية، وتلك هي مهمة نضالية للمبدعين العرب حيث وضعت الأحداث السياسية وما رافقها من بؤس وتفسخ اجتماعي وضياع للشباب العربي الأدباء أمام مسؤولية في الاستقلال عن الخطاب الإيديولوجي المهيمن وإسماع أصوات الذات المقموعة، والانغماس في قضايا الواقع والتباساته.وفي هذه الرواية يترك الروائي البطل يتكلم سيرته الشخصية عندما يفاجئ بمخطوط يصله بعد عشر سنوات على اختفاء \"رضا شاوش\" وانتهاء الحرب، أو توقفها لزمن معين يقول: حينما حمل لي البريد ظرفاً بداخله مخطوط مع رسالة قصيرة جاء فيها:عزيزي الروائي بشير م. يصلك هذا المخطوط وأنا ربما في عالم آخر، ليس بالضرورة الموت، وإن كنت لا أستبعد هذا، وفيه ما وعدتك به، المخطوط الذي كتبته تأريخاً لحياتي تلك (...) إنها قصتي أنا بكل حروفها السوداء، وأبجديتها الخارقة. إنها قصتي التي عشتها وتخيلتها، وإنها ذاكرتي التي صنعتها وصنعتني في نفس الوقت، وإنني لأتمنى صادقاً أن تكتب اسمك في أعلى صفحاتها، وتنسبها لنفسك فتكون بالنسبة إليك كقصة خيال مروعة على أن يراها الناس حقيقة مؤكدة.. مع أنني، من خلال ما عشت، لم أعد قادراً على التفريق بين ما هو خيال وحقيقة، واقع وحلم.. شكراً لك على التفهم، وداعاً.. رضا شاوش\".يقول الروائي (...) تركت صوته يحكي قصته كما كتبها هو، وعلى لسانه، متمنياً أن يكون الرجل على قيد الحياة، وأنه سيقرأ كتابه كما تركه بلا أي تغيير أو رتوش..لا شك أن مضمون الرواية هو محاولة لاستنطاق الماضي.. صراع البشر أو بالأحرى صراع الأقوياء، وعدم الجرأة على مخالفة قانون الأمر الواقع الذي يقع تحت وطأته الضعفاء وكيف يتحول الإنسان إلى شخصاً آخر. يقول \"رضا شاوش\" فإذا بي أولد شخصاً آخر مليئاً بأشياء أخرى، ودماء جديدة.. دماء آخرين امتص منهم روحهم، روحهم البريئة لأعيش، صرت الشر، ودمية الشر، صرت الشيطان، ودمية الشيطان، صرت تلك النار اللاهبة والمستعرة، النار الحارقة والمسعورة، صرت مثل دمية النار، تحرق من يمسكها. صرت اللاشيء الفارغ من أي معنى، والذي لن يعيش إلا عندما يقدر على مص دماء الأبرياء الذين يواجههم... كانوا يطلبون مني أشياء غريبة، وكنت أنفذها، وصرت بعدها واحداً منهم (...)\".\"دمية النار\" هي أكثر من رواية هي ذلك العبث الملحمي لواقعنا العربي الذي بقيت رموزه حية تتلاعب بمصائر الشعوب، من سيعيش ومن سيموت، ومن سيحرق بدمية النار الآخرين ليجلس على أنقاضهم، فهذه هي قوانين اللعبة، لعبة الكبار والدمى التي يحركونها في شرقنا بحسب مصالحهم، حيث باتت مجتمعاتنا قابعة تحت جمرة من نار يشعلونها متى شاءوا وفي أي وقت يريدون، أما نحن المتلقون للصدمات أصبحنا أمام ملهاة أكثر منها مأساة لا تؤدي إلى أي يقين..!!",
  "genres": [],
  "author": "بشير مفتي",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/8663316"
}