{
  "title": "Encyclopedia of the Exquisite: An Anecdotal History of Elegant Delights",
  "description": "Encyclopedia of the Exquisite is a lifestyle guide for the Francophile and the Anglomaniac, the gourmet and the style maven, the armchair traveler and the art lover. It’s an homage to the esoteric world of glamour that doesn’t require much spending but makes us feel rich.Taking a cue from the exotic encyclopedias of the sixteenth century, which brimmed with mysterious artifacts, Jessica Kerwin Jenkins’s Encyclopedia of the Exquisite focuses on the elegant, the rare, the commonplace, and the delightful. A com­pendium of style, it merges whimsy and practicality, traipsing through the fine arts and the worlds of fashion, food, travel, home, garden, and beauty.Each entry features several engaging anecdotes, illuminating the curious past of each enduring source of beauty. Subjects covered include the explosive history of champagne; the art of lounging on a divan; the emergence of “frillies,” the first lacy, racy lingerie; the ancient uses of sweet-smelling saffron; the wild riot incited by the appearance of London’s first top hat; Julia Child’s tip for cooking the perfect omelet; the polarizing practice of wearing red lipstick during World War II; Louis XIV’s fondness for the luscious Bartlett pear; the Indian origin of badminton; Parliament’s 1650 attempt to suppress Europe’s beauty mark fad; the evolution of the Japanese kimono; the pil­grimage of Central Park’s Egyptian obelisk; and the fanciful thrill of dining alfresco.Cleverly illustrated, Encyclopedia of the Exquisite is an ode to life’s plenty, from the extravagant to the eccentric. It is a cele­bration of luxury that doesn’t necessarily require money.",
  "genres": [
    "Nonfiction",
    "History",
    "Reference",
    "Fashion",
    "Art",
    "Essays",
    "Travel"
  ],
  "author": "Jessica Kerwin Jenkins",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/8660865-encyclopedia-of-the-exquisite"
}