{
  "title": "هلابيل",
  "description": "في هذا الكتاب رواية بعنوان \"هلابيل\" للروائي الجزائري المعروف \"سمير قسيمي\" وكان قد صدر له في وقت سابق \"يوم رائع للموت\" و\"تصريح بضياع\".وعن روايته هذه يقول القسيمي: \"أن هذه الرواية يحكيها ستة أبطال مختلفون يبحثون بطرقهم الخاصة عن الحقيقة المتمثلة في الإسلام الفطري دون إضافات\". أحد هؤلاء الأبطال ميت من عالمه الآخر إنه \"قدور\" يتأمل الأحياء وتعود إليه ذاكرته أكثر مما كان عليه وهو على قيد الحياة، وبين هذا الخط الفاصل بين الحياة والموت يشبك الروائي أحداث روايته باختلاف الزمان والمكان، ليطرح من خلالها تساؤلات تخرج عن الوصف العادي لسيرورة الأحداث وتذهب بعيداً في قضية الإنسان الوجودية في بداية الخلق لتأخذ شخصية هلابيل من أوراق بابلية قديمة بكل محمولاتها الدينية والحكائية، حيث يستند الروائي لوثائق هامة منها تاريخ اليعقوبي في تعرضه إلى قضية ما قبل الخلق، حيث كان لعزرائيل مرتبة في الجنة، وذلك لتعميق المخيلة وفتحها باتجاه غابر في التاريخ لتعبر عن حقيقة الإنسان المخبوءة. وهنا تبدو بوضوح خيارات الروائي الفلسفية والميتافيزيقية باختياره لشخصية هلابيل المنسية والهامشية. حيث اعتبر أحد النقاد أن \"الهامش هو أصل الحياة وحقيقته ولهذا تم إهماله، بل وحذفه من المخيلة التاريخية العامة، هلابيل هو الأب الروحي لكل المهمشين. فهو الابن الطبيعي لآدم، الأديان المتوارثة تتحدث أكثر عن قابيل وهابيل. بينما بداية الخلق الأسطوري تقوم على فكرة أن حواء ولدت توأمين. في كل توأم ذكر وأنثى. يتزوج الذكر من التوأم الأول تتزوج الأنثى من التوأم الثاني، والعكس أيضاً، إلا أنه بعد حادثة مقتل هلابيل لا بد أن هناك أنثى زائدة. بدون زوج. الكتابات العبرية تقول إن هلابيل أول أبناء زوج الأنثى الفائض لينشئ خارج النظام العام، نسل المهمشين الذي افترضه الكاتب. مما يؤكد أن خيارات الكاتب في استدعاء سلسلة من الشخصيات الهامشية لأداء الوظائف الأساسية في هذه الرواية لم يكن اعتباطياً. المساحة ضيقة والرواية فتحت أسئلة معقدة عن البنية السردية التي تزيح الحكاية بإعادة تنظيمها وتركيبها ومشكلة الوجود والدين والأقدار، والحياة، والصدفة والجوهر المخفي...\".رواية رائعة يوظف فيها \"القسيمي\" التاريخ روائياً بشكل مدهش والكتابات التوراتية بصورة مميزة، لنجد أنفسنا أمام عملاً أدبياً يهيم في التاريخ والصوفية والتعقيد نكتشف من خلاله اللامعنى الذي يحكم حياتنا وتصرفاتنا وعلاقتنا بالحياة والموت.",
  "genres": [],
  "author": "سمير قسيمي",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/8663341"
}