{
  "title": "Zoobiquity: What Animals Can Teach Us About Health and the Science of Healing",
  "description": "In the spring of 2005, cardiologist Barbara Natterson-Horowitz was called to consult on an unusual patient: an Emperor tamarin at the Los Angeles Zoo. While examining the tiny monkey’s sick heart, she learned that wild animals can die of a form of cardiac arrest brought on by extreme emotional stress. It was a syndrome identical to a human condition but one that veterinarians called by a different name—and treated in innovative ways.  This remarkable medical parallel launched Natterson-Horowitz on a journey of discovery that reshaped her entire approach to medicine. She began to search for other connections between the human and animal worlds: Do animals get breast cancer, anxiety-induced fainting spells, sexually transmitted diseases? Do they suffer from obsessive-compulsive disorder, bulimia, addiction?  The answers were astonishing. Dinosaurs suffered from brain cancer. Koalas catch chlamydia. Reindeer seek narcotic escape in hallucinogenic mushrooms. Stallions self-mutilate. Gorillas experience clinical depression.  Joining forces with science journalist Kathryn Bowers, Natterson-Horowitz employs fascinating case studies and meticulous scholarship to present a revelatory understanding of what animals can teach us about the human body and mind. “Zoobiquity” is the term the authors have coined to refer to a new, species-spanning approach to health. Delving into evolution, anthropology, sociology, biology, veterinary science, and zoology, they break down the walls between disciplines, redefining the boundaries of medicine.Zoobiquity explores how animal and human commonality can be used to diagnose, treat, and heal patients of all species. Both authoritative and accessible, offering cutting-edge research through captivating narratives, this provocative book encourages us to see our essential connection to all living beings.",
  "genres": [
    "Nonfiction",
    "Science",
    "Animals",
    "Health",
    "Medicine",
    "Nature",
    "Biology"
  ],
  "author": "Barbara Natterson-Horowitz",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13147888-zoobiquity"
}