{
  "title": "Ten Miles Past Normal",
  "description": "Janie Gorman wants to be normal. The problem with she’s not. She’s smart and creative and a little bit funky. She’s also an unwilling player in her parents’ modern-hippy, let’s-live-on-a-goat-farm experiment (regretfully, instigated by a younger, much more enthusiastic Janie). This, to put it simply, is not helping Janie reach that “normal target.” She has to milk goats every day…and endure her mother’s pseudo celebrity in the homemade-life, crunchy mom blogosphere. Goodbye the days of frozen lasagna and suburban living, hello crazy long bus ride to high school and total isolation--and hovering embarrassments of all kinds. The fresh baked bread is good…the threat of homemade jeans, not so much.It would be nice to go back to that old suburban life…or some grown up, high school version of it, complete with nice, normal boyfriends who wear crew neck sweaters and like social studies. So, what’s wrong with normal? Well, kind of everything. She knows that, of course, why else would she learn bass and join Jam Band, how else would she know to idolize infamous wild-child and high school senior Emma (her best friend Sarah’s older sister), why else would she get arrested while doing a school project on a local freedom school (jail was not part of the assignment). And, why else would she kind of be falling in \"like\" with a boy named Monster—yes, that is his real name. Janie was going for normal, but she missed her mark by about ten miles…and we mean that as a compliment.Frances O’Roark Dowell’s fierce humor and keen eye make her YA debut literary and wise. In the spirit of John Green and E. Lockhart, Dowell’s relatable, quirky characters and clever, fluid writing prove that growing up gets complicated…and normal is WAY overrated.",
  "genres": [
    "Young Adult",
    "Realistic Fiction",
    "Fiction",
    "Contemporary",
    "Music",
    "Teen",
    "Friendship"
  ],
  "author": "Frances O'Roark Dowell",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/8663305-ten-miles-past-normal"
}