{
  "title": "Perfect Kisses",
  "description": "From New York Times bestselling author Susan Johnson and Sylvia Day and Noelle Mack come three sizzling stories about the art of seduction . . . It Starts With One Perfect Kiss . . . School For Scandal Susan Johnson James Bell, Viscount Ormond, is a shameless rake, infamous for his skills in seduction-and Claire Russell doesn't intend for her sister to become his latest conquest. That is why she's come to the viscount's private masked ball. The flagrant sensuality and unabashed decadence on display there are shocking, but they are nothing compared to the scandalous fire Claire feels when James makes a wholly improper suggestion . . . improper, indecent, and very, very tempting . . . Mischief And The Marquess Sylvia Day Justin, the Marquess of Fontaine and Lady Sophie Milton-Riley have no desire to marry. To satisfy their mothers' insistence that they would be quite right together, they set out to demonstrate how completely ill suited they are for one another. Justin is allergic to her perfume. Sophie dislikes his dogs. He prefers blondes; she, brunette men. But the more they seek to prove how wrong their union would be, the more right things feel. And when opposites attract, there's no denying the sparks or the heat . . . The Ruby Kiss Noelle Mack Susannah Fowler is in possession of many temptations-an independent nature, a quick wit, and lush curves. She is also in possession of a fortune in stolen jewels hidden within her favorite corset. If rakehell Carlyle Jameson wants it, he will have to remove it himself. From her boudoir . . . or from her body. One kiss ought to distract her, but one kiss leads to another and another, till there's no turning back . . . and no desire to try . . .",
  "genres": [
    "Romance",
    "Anthologies",
    "Historical Romance",
    "Erotica",
    "Historical",
    "Erotic Romance",
    "Contemporary Romance"
  ],
  "author": "Susan Johnson",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/866751.Perfect_Kisses"
}