{
  "title": "The Man Who Ate the 747",
  "description": "Piece by piece, a farmer is eating a Boeing 747 to prove his love for a woman... Written with tenderness, originality, and insight, filled with old-fashioned warmth and newfangled humor, it is an extraordinary novel, a found treasure that marks the emergence of a major storytelling talent.This is a story of the greatest love, ever. An outlandish claim, outrageous perhaps, but trust me--And so begin the enchanting, unforgettable tale of J. J. Smith, Keeper of the Records for The Book of Records, an ordinary man searching for the extraordinary. J.J. has clocked the world's longest continuous kiss, 30 hours and 45 minutes. He has verified the lengthiest single unbroken apple peel, 172 feet and 4 inches. He has measured the farthest flight of a champagne cork from an untreated, unheated bottle 177 feet 9 inches. He has tasted the world's largest menu item, whole-roasted Bedouin camel.But in all his adventure from Australia to Zanzibar, J.J. has never witnessed great love until he comes upon a tiny windswept town in the heartland of America, where folks still talk about family, faith, and crops. Here, where he last expects it, J.J. discovers a world record attempt like no other: Piece by piece, a farmer is eating a Boeing 747 to prove his love for a woman.In this vast landscape of cornfields and lightning storms, J.J. is doubly astounded to be struck by love from the same woman, Willa Wyatt of the honey eyes and wild blond hair. It is a feeling beyond measure, throwing J.J.'s carefully ordered world upside down, proving that hearts, like world records, can be broken, and the greatest wonders in life can not be qualified.Richly romantic, whimsical, and uplifting, The Man Who Ate the 747 is a flight of fancy from start to finish. It stretches imagination, bends physics and biology, but believe it just a little and you may find yourself reaching for your own records, the kind that really count. Written with tenderness, originality, and insight, filled with old-fashioned warmth and newfangled humor, it is an extraordinary novel, a found treasure that marks the emergence of a major storytelling tale.",
  "genres": [
    "Fiction",
    "Romance",
    "Adult",
    "Humor",
    "Contemporary",
    "Adult Fiction",
    "Literature"
  ],
  "author": "Ben Sherwood",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/866807.The_Man_Who_Ate_the_747"
}