{
  "title": "Be Different: Adventures of a Free-Range Aspergian",
  "description": "“I believe those of us with Asperger’s are here for a reason, and we have much to offer. This book will help you bring out those gifts.” In his bestselling memoir, Look Me in the Eye, John Elder Robison described growing up with Asperger’s syndrome at a time when the diagnosis didn’t exist. He was intelligent but socially isolated; his talents won him jobs with toy makers and rock bands but did little to endear him to authority figures and classmates, who were put off by his inclination to blurt out non sequiturs and avoid eye contact.By the time he was diagnosed at age forty, John had already developed a myriad of coping strategies that helped him achieve a seemingly normal, even highly successful, life. In Be Different, Robison shares a new batch of endearing stories about his childhood, adolescence, and young adult years, giving the reader a rare window into the Aspergian mind.In each story, he offers practical advice—for Aspergians and indeed for anyone who feels “different”—on how to improve the weak communication and social skills that keep so many people from taking full advantage of their often remarkable gifts. With his trademark honesty and unapologetic eccentricity, Robison addresses questions like:• How to read others and follow their behaviors when in uncertain social situations• Why manners matter• How to harness your powers of concentration to master difficult skills• How to deal with bullies• When to make an effort to fit in, and when to embrace eccentricity• How to identify special gifts and use them to your advantageEvery person, Aspergian or not, has something unique to offer the world, and every person has the capacity to create strong, loving bonds with their friends and family. Be Different will help readers and those they love find their path to success.",
  "genres": [
    "Nonfiction",
    "Autistic Spectrum Disorder",
    "Psychology",
    "Memoir",
    "Biography",
    "Self Help",
    "Aspergers"
  ],
  "author": "John Elder Robison",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/8674411-be-different"
}