{
  "title": "The Family: The Secret Fundamentalism at the Heart of American Power",
  "description": "A journalist's penetrating look at the untold story of christian fundamentalism's most elite organization, a self-described invisible network dedicated to a religion of power for the powerfulThey are the Family--fundamentalism's avant-garde, waging spiritual war in the halls of American power and around the globe. They consider themselves the new chosen--congressmen, generals, and foreign dictators who meet in confidential cells, to pray and plan for a \"leadership led by God,\" to be won not by force but through \"quiet diplomacy.\" Their base is a leafy estate overlooking the Potomac in Arlington, Virginia, and Jeff Sharlet is the only journalist to have reported from inside its walls.\"The Family\" is about the other half of American fundamentalist power--not its angry masses, but its sophisticated elites. Sharlet follows the story back to Abraham Vereide, an immigrant preacher who in 1935 organized a small group of businessmen sympathetic to European fascism, fusing the far right with his own polite but authoritarian faith. From that core, Vereide built an international network of fundamentalists who spoke the language of establishment power, a \"family\" that thrives to this day. In public, they host Prayer Breakfasts; in private, they preach a gospel of \"biblical capitalism,\" military might, and American empire. Citing Hitler, Lenin, and Mao as leadership models, the Family's current leader, Doug Coe, declares, \"We work with power where we can, build new power where we can't.\"Sharlet's discoveries dramatically challenge conventional wisdom about American fundamentalism, revealing its crucial role in the unraveling of the New Deal, the waging of the cold war, and the no-holds-barred economics of globalization. The question Sharlet believes we must ask is not \"What do fundamentalists want?\" but \"What have they already done?\"Part history, part investigative journalism, \"The Family\" is a compelling account of how fundamentalism came to be interwoven with American power, a story that stretches from the religious revivals that have shaken this nation from its beginning to fundamentalism's new frontiers. No other book about the right has exposed the Family or revealed its far-reaching impact on democracy, and no future reckoning of American fundamentalism will be able to ignore it.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Religion",
    "History",
    "Christianity",
    "American History",
    "Sociology"
  ],
  "author": "Jeff Sharlet",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/8677694-the-family"
}