{
  "title": "The Two O'Clock War: The 1973 Yom Kippur Conflict and the Airlift That Saved Israel",
  "description": "It's usually called the Yom Kippur War. Or sometimes the October War. The players that surround it are Sadat and Mubarak, Meir and Sharon, Nixon and Kissinger, Brezhnev and Dobyrnin. It was a war that brought Arab and Jew into vicious conflict. A war in which Israel almost unleashed her nuclear arsenal and set two superpowers on a treacherous course of nuclear escalation.And a war that eventually brought peace. But a peace fraught with delicate tensions, disputed borders, and a legacy of further bloodshed.The Two O'Clock War is a spellbinding chronicle of the international chess game that was played out in October 1973. It is a story of diplomacy and military might that accounts for many of the dilemmas faced in the present-day Middle East.This is a war that Israel never thought was possible. Surprised by the fury and excellent execution of the Arab onslaught, and perhaps more than a little complacent, Israel suddenly found itself on the point of losing a war because of a lack of ammunition, planes and tanks. The United States, after much vacillation, finally elected to help Israel, beginning a tremendous airlift (code Operation Nickel Grass) which incurred the wrath of the Arab states, and their sponsor, the Soviet Union.Fortunately the airlift came just in time for Israeli ground forces to stabilize their positions and eventually turn the tide in the Sinai and Golan Heights. And it was all made possible by an operation that dwarfed the Berlin Airlift and the Soviets' simultaneous efforts in Egypt and Syria.The Two O'Clock War is bound to become the definitive history of a war that quite literally approached Armageddon.",
  "genres": [
    "History",
    "Nonfiction",
    "Israel",
    "Military Fiction",
    "War"
  ],
  "author": "Walter J. Boyne",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/868271.The_Two_O_Clock_War"
}