{
  "title": "Resolving Impasses in Therapeutic Relationships",
  "description": "This volume deals with a fundamental issue that all clinicians face at some time or the therapeutic impasse. What should you do when sessions with a client seem hopelessly mired, or when the client feels that you have done something so egregious that therapy goes awry? How about an abrupt when you find the angry or hostile feelings directed toward you to be so intolerable that you decide to terminate?Based on years of clinical and consultation work, Sue Nathanson Elkind presents a theoretical framework for understanding and working with the relational knots that occur between therapists and their patients. Asserting that such episodes are unavoidable pivotal events in therapeutic relationships, she provides a map of the wide range of predicaments that can arise, * Mismatches between therapist and patient* Stalemates resulting from patient-therapist collusion* Irreconcilable conflicts or power struggles* Breaches in the attachment bond* Untimely terminationsElkind demonstrates how patients and therapists function as relational partners. Without blame and with compassion for inevitable difficulties, she describes how impasses arise when these partnerships become rigid, operate outside of conscious awareness, or when the vulnerabilities and defenses of the patient and the therapist intersect in problematic ways. Her concepts of primary vulnerabilities and relational modes benefit both Rather than automatically pathologizing the patient, they empower the patient and humanize the therapist by recognizing normal human limitations.The final section of the book presents an in-depth discussion of a form of consultation for therapeutic impasses that may include both the patient and the therapist. Demonstrating how both may suffer when the therapeutic dyads function in isolation, Elkind advocates setting up a relational network through the presence of a consultant. Vignettes of actual consultations of this type for a wide range of problems illustrate how such consultations work, what functions they can serve, and what their limitations are.Featuring stories that often are not told because of the feelings of shame and failure that arise for therapists and patients caught in therapeutic impasses, this book is compelling reading. It fills a gap in the literature by comprehensively addressing a common, but rarely discussed, aspect of the profession. As such, it is an important volume for both experienced and novice clinicians regardless of theoretical persuasion. Bringing theoretical issues to life through its clinical vignettes, it also serves as an excellent text for graduate and postgraduate courses in psychology, counseling, psychiatry, and psychiatric social work.",
  "genres": [
    "Psychology",
    "Nonfiction"
  ],
  "author": "Sue Nathanson Elkind",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/867690.Resolving_Impasses_in_Therapeutic_Relationships"
}