{
  "title": "Callsign: Knight (Shin Dae-jung)",
  "description": "When a team of Delta operators goes missing in Shenhuang, one of China’s newly constructed ghost cities, Shin Dae-jung— Knight, is called in to assist. But the Osprey transporting him to the scene falls prey to an EMP attack and is forced to crash land atop a parking garage. With a wounded pilot in tow, Knight explores the empty city for signs of life and finds two terrified children, who warn him that something monstrous is stalking the city. When the pilot disappears, leaving a pool of blood and spent bullet casings behind, Knight doesn’t doubt their story. As bullets fly and bodies drop, Knight must protect the children, uncover the fate of the missing Delta team and defend against an unstoppable killer, whose ability to regenerate and whose horrible appearance reminds him of something he’s faced before—the mythological Hydra. But he’s not alone in the surreal abandoned city. A team of SAS soldiers, along with Anna Beck, a former member of Manifold Genetics’ private security force, join the fray. Together, they fight—and die—against a nightmare that follows its objective to the kill them all. Knight was the sixth in a series of Chess Team novellas released in 2011. Each of the eight books in the series—deemed the ‘Chesspocalypse’—follows a single member of the team and is co-authored by Jeremy Robinson and one of six other fantastic authors. The stories take place after the events of Threshold, the third Jack Sigler thriller, and before the events of Ragnarok, the fourth full-length novel in the series. The Chesspocalypse novellas are designed to introduce readers to the series. If you haven’t read the novels, no worries. Enjoy the ride! Praise for Robinson “Rocket-boosted action, brilliant speculation, and the recreation of a horror out of the mythologic past, all seamlessly blend into a rollercoaster ride of suspense and adventure.” —James Rollins, New York Times bestselling author of The Eye of God “With Threshold Jeremy Robinson goes pedal to the metal into very dark territory. Fast-paced, action-packed and wonderfully creepy! Highly recommended!” —Jonathan Maberry, New York Times bestselling author of Rot & Ruin “Jeremy Robinson is the next James Rollins” —Chris Kuzneski, New York Times bestselling author of The Einstein Pursuit “If you like thrillers original, unpredictable and chock-full of action, you are going to love Jeremy Robinson...” —Stephen Coonts, New York Times bestselling author of Pirate Alley “How do you find an original story idea in the crowded action-thriller genre? Two Jeremy Robinson.” —Scott Sigler, New York Times bestselling author of Pandemic “There’s nothing timid about Robinson as he drops his readers off the cliff without a parachute and somehow manages to catch us an inch or two from doom.” —Jeff Long, New York Times bestselling author of The Descent Praise for Cross “A fast paced, all too real thriller with a villain right out of James Patterson and Criminal Minds.” —Andrew Gross, #1 New York Times bestselling author of Reckless and Don’t Look Twice “The Shepherd is a superbly crafted thriller skillfully delving into the twisted mind of a psychopath and the tormented soul of the man destined to bring him down. Ethan Cross weaves a tale so chilling, I was afraid to turn out the lights. Highly recommended!” —D.B.",
  "genres": [
    "Thriller",
    "Fiction",
    "Action",
    "Science Fiction",
    "Adventure",
    "Military Fiction",
    "Novella"
  ],
  "author": "Jeremy Robinson",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/13149078-callsign"
}