{
  "title": "The Music of Pythagoras: How an Ancient Brotherhood Cracked the Code of the Universe and Lit the Path From Antiquity to Outer Space",
  "description": "The enthralling story of Pythagoras and the Pythagoreans, whose insights transformed the ancient world and still inspire the realms of science, mathematics, philosophy, and the arts. \"Pythagoras's influence on the ideas, and therefore on the destiny, of the human race was probably greater than that of any single man before or after him,\" wrote Arthur Koestler. Though most people know of him only for the famous Pythagorean Theorem (a2 +b2=c2), in fact the pillars of our scientific tradition―belief that the universe is rational, that there is unity to all things, and that numbers and mathematics are a powerful guide to truth about nature and the cosmos―hark back to the convictions of this legendary sixth-century B.C. scholar.Born around 570 B.C. on the cultured Aegean island of Samos, Pythagoras (according to ancient tales) studied with the sage Thales nearby at Miletus, and with priests and scribes in Egypt and Babylon. Eventually he founded his own school at Croton in southern Italy, where he and his followers began to unravel the surprising deep truths concealed behind such ordinary tasks as tuning a lyre. While considering why some string lengths produced beautiful sounds and others discordant ones, they uncovered the ratios of musical harmony, and recognized that hidden behind the confusion and complexity of nature are patterns and orderly relationships. They had surprised the Creator at his drafting board and had glimpsed the mind of God! Some of them later would also find something darker in numbers and irrationality, a revelation so unsettling and subversive that it may have contributed to the destruction of their brotherhood. Praised for her ability to illuminate complex subjects, Kitty Ferguson brilliantly evokes the archaic world of Pythagoras, showing how ideas spread in antiquity, chronicling the influence he and his followers have had on so many extraordinary people in the history of Western thought and science, and bringing a poignant human saga to readers who are daily reminded that harmony and chaos can and do coexist.",
  "genres": [
    "History",
    "Science",
    "Philosophy",
    "Music",
    "Nonfiction",
    "Mathematics",
    "Biography"
  ],
  "author": "Kitty Ferguson",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/868121.The_Music_of_Pythagoras"
}