{
  "title": "Gaza: Stay Human",
  "description": "\"It is first and foremost an eyewitness account of an everyman and a true humanist. He was there during the Operation 'Cast Lead' and so his daily dispatches came directly from the killing fields of Gaza, and are therefore free of any media distortion or manipulation.\"—Ilan Pappé, professor of history, University of Exeter An authoritative and deeply moving eyewitness account of the terrible twenty-two-day Israeli offensive against the Gaza Strip in December 2008 and January 2009. These daily dispatches were written in precarious conditions, between bombing raids and intermittent Internet access. Vittorio Arrigoni ends his dispatches with the plea \"stay human,\" which became the motto of the peace protests in his native Italy. This English translation is updated with new entries reflecting on life in Gaza after the offensive and also features an introduction by famous Israeli historian Ilan Pappé. Vittorio Arrigoni was an internationally renowned human rights activist who served as a volunteer with the pacifist International Solidarity Movement and worked closely with fishermen and farmers in Gaza. During the Israeli offensive against the Gaza Strip in 2008-9, Arrigoni acted as a human shield while working with the Palestinian Red Crescent ambulances. Working as a freelance journalist for the Italian daily Il Manifesto , Arrigoni’s daily dispatches, written between bombing raids and patchy internet access, ended with the plea, \"stay human,\" which became the motto of the anti-Israeli peace protests in his native Italy. His authoritative and deeply moving eyewitness account was later published in 2010 in Italian, French, German, and English, which the historian Ilan Pappé described as the \"account of an everyman and a true humanist.\" On April 14, 2011, Arrigoni was kidnapped and brutally murdered by militants in Gaza, which caused an international outcry and was unanimously condemned by Hamas and the Palestinian National Authority.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "War",
    "Israel"
  ],
  "author": "Vittorio Arrigoni",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/8688267-gaza"
}