{
  "title": "Walk on Water: A Memoir",
  "description": "From catfishing as a young girl in the lazy, red clay waters of the South to battling marlin in the Caribbean, Lorian Hemingway has had a passion for fishing all her life. It was a passion that would sustain her even as the burden of a broken family and her own alcoholism threatened to consume her. Walk on Water is her poignant and powerful memoir about loss, recovery, coping with the family you are born into, and making a family of your own. But above all it is an homage to fishing -- its ability to bind people, to challenge, and ultimately, to heal. \"People pair up to fish as they do in life...they keep fishing together because no one else quite comprehends the degree of their obsession,\" Hemingway writes, and from the beginning, her memories of fishing are inextricably linked with the relationships that have shaped her life. There is Catfish, a woman she idolized as a child, who gave her early insights on fishing (\"You wants fish too bad. They knows it.\"); Hemingway's estranged father, with whom she tries to connect during a Herningwayesque marlin hunt in the Caribbean; her big-hearted great-uncle Les, with whom she goes barracuda fishing off Bimini in a pirated sailboat, himself tragically haunted by the family legacy; and her larger-than-life aunt Freda, who once saved her from a deadly water snake with a bow and arrow. But in the colorful cast of characters there is none more appealing than Hemingway herself -- gifted with a dry wit, a keen eye for life's absurdities, and a fierce resilience that comes from being a survivor. She writes passionately about herself and her effort to come to terms with her family legacy, especially with regard to fishing -- whether it's a harrowing encounter in the dark with a hammerhead shark, an inauspicious TV debut on a fly-fishing show, or the quiet pleasures of fishing with her daughter. By turns moving, raw, wry, and hilarious, Walk on Water is a stirring memoir by a woman who, like her quarry, is full of fight and life.",
  "genres": [
    "Nonfiction",
    "Biography"
  ],
  "author": "Lorian Hemingway",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1314923.Walk_on_Water"
}