{
  "title": "God's Fury, England's Fire: A New History of the English Civil Wars",
  "description": "The sequence of civil wars that ripped England apart in the seventeenth century was the single most traumatic event in this country between the medieval Black Death and the two world wars. Indeed, it is likely that a greater percentage of the population were killed in the civil wars than in the First World War. This sense of overwhelming trauma gives this major new history its God’s Fury, England’s Fire. The name of a pamphlet written after the king’s surrender, it sums up the widespread feeling within England that the seemingly endless nightmare that had destroyed families, towns and livelihoods was ordained by a vengeful God – that the people of England had sinned and were now being punished. As with all civil wars, however, ‘God’s fury’ could support or destroy either side in the conflict. Was God angry at Charles I for failing to support the true, protestant, religion and refusing to work with Parliament? Or was God angry with those who had dared challenge His anointed Sovereign?Michael Braddick’s remarkable book gives the reader a vivid and enduring sense both of what it was like to live through events of uncontrollable violence and what really animated the different sides. The killing of Charles I and the declaration of a republic – events which even now seem in an English context utterly astounding – were by no means the only outcomes, and Braddick brilliantly describes the twists and turns that led to the most radical solutions of all to the country’s political implosion. He also describes very effectively the influence of events in Scotland, Ireland and the European mainland on the conflict in England.God’s Fury, England’s Fire allows readers to understand once more the events that have so fundamentally marked this country and which still resonate centuries after their bloody ending.",
  "genres": [
    "History",
    "Nonfiction",
    "English Civil War",
    "Religion",
    "European History",
    "War",
    "British Literature"
  ],
  "author": "Michael Braddick",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/8684693-god-s-fury-england-s-fire"
}