{
  "title": "The Pleasure Was Mine: A Novel",
  "description": "Prate Marshbanks proposed to his future wife on a muggy July night at Pete's Drive-in back in '52. \"She said yes to me between bites of a slaw burger all-the-way.\" A college graduate and daughter of a prominent lawyer, Irene was an unlikely match for Prate, a high school dropout. He lived his married life aware of the question on people's minds: How in the world did a tall, thin, fair-skinned beauty and one of the most respected high school English teachers in all of Greenville County, in all of South Carolina for that matter, wind up married to a short, dark, fat-faced, jug-eared house painter? That their marriage not only survived for fifty years, but flourished, is a source of constant wonder to Prate. Now he faces a new challenge with Irene.From the author of In The Family Way, a novel the Atlanta Constitution called \"an instant classic\" and the Charlotte Observer praised as \"a lovely, moving book,\" comes a powerful story of hard-earned hope. The Pleasure Was Mine takes place during a critical summer in the life of Prate Marshbanks, when he retires to care for his wife, who is gradually slipping away. To complicate things, Prate's son, Newell, a recently widowed single father, asks Prate to keep nine-year-old Jackson for the summer. Though Prate is irritated by the presence of his moody grandson, during the summer Jackson helps tend his grandmother, and grandfather and grandson form a bond. As Irene's memory fades, Prate, a hardworking man who has kept to himself most of his life, has little choice but to get to know his family.With elegance and skillful economy of language, Tommy Hays renders an unforgettable character in Prate Marshbanks. The Pleasure Was Mine is at once a quietly wrenching portrayal of grief, a magical and romantic story about the power of love, and an unexpectedly moving take on the resilience of family.",
  "genres": [
    "Fiction",
    "Book Club",
    "Southern",
    "Contemporary",
    "Adult Fiction"
  ],
  "author": "Tommy Hays",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/86845.The_Pleasure_Was_Mine"
}