{
  "title": "The Sky's the Limit: Passion and Property in Manhattan",
  "description": "From the author of the bestselling Philistines at the Hedgerow, a mesmerizing inside account of the high-stakes world of Manhattan residential real estate Steven Gaines takes us from New York's most expensive condominiums and co-ops to the offices of its most powerful real estate brokers to reveal the outlandish displays of ego, bad behavior, and status hunger that come into play when the best addresses in the city are on the line. With his signature elan, Gaines weaves a gossipy tapestry of brokers, buyers, co-op boards, and eccentric landlords and tells of the apartment hunting and renovating adventures of many celebrities-from Tommy Hilfiger to Donna Karan, from Jerry Seinfeld to Steven Spielberg, from Barbra Streisand to Madonna. Gaines uncovers the secretive, unwritten rules of co-op boards: why diplomats and pretty divorcees are frowned upon, what not to wear to a board interview, and which of the biggest celebrities and CEOs have been turned away from the elite buildings of Fifth and Park Avenues. He introduces the carriage-trade brokers who never have to advertise for clients and gives us finely etched portraits of a few of the discreet, elderly society ladies who decide who gets into the so-called Good Buildings. Here, too, is a fascinating chronicle of the changes in Manhattan's residential skyline, from the slums of the nineteenth century to the advent of the luxury building. Gaines describes how living in boxes stacked on boxes came to be seen as the ultimate in status, and how the co-operative apartment, originally conceived as a form of housing for the poor, came to be used as a legal means of black-balling undesirable neighbors. A social history told through brick and mortar, The Sky's the Limit is the ultimate look inside one of the most exclusive and expensive enclaves in the world, and at the lengths to which people will go to get in.",
  "genres": [
    "Nonfiction",
    "New York",
    "History",
    "Business",
    "Audiobook",
    "Economics",
    "Finance"
  ],
  "author": "Steven Gaines",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/86850.The_Sky_s_the_Limit"
}