{
  "title": "Great Soul: Mahatma Gandhi and His Struggle With India",
  "description": "A highly original, stirring book on Mahatma Gandhi that deepens our sense of his achievements and disappointments—his success in seizing India’s imagination and shaping its independence struggle as a mass movement, his recognition late in life that few of his followers paid more than lip service to his ambitious goals of social justice for the country’s minorities, outcasts, and rural poor.Pulitzer Prize–winner Joseph Lelyveld shows in vivid, unmatched detail how Gandhi’s sense of mission, social values, and philosophy of nonviolent resistance were shaped on another subcontinent—during two decades in South Africa—and then tested by an India that quickly learned to revere him as a Mahatma, or “Great Soul,” while following him only a small part of the way to the social transformation he envisioned. The man himself emerges as one of history’s most remarkable self-creations, a prosperous lawyer who became an ascetic in a loincloth wholly dedicated to political and social action. Lelyveld leads us step-by-step through the heroic—and tragic—last months of this selfless leader’s long campaign when his nonviolent efforts culminated in the partition of India, the creation of Pakistan, and a bloodbath of ethnic cleansing that ended only with his own assassination.India and its politicians were ready to place Gandhi on a pedestal as “Father of the Nation” but were less inclined to embrace his teachings. Muslim support, crucial in his rise to leadership, soon waned, and the oppressed untouchables—for whom Gandhi spoke to Hindus as a whole—produced their own leaders.Here is a vital, brilliant reconsideration of Gandhi’s extraordinary struggles on two continents, of his fierce but, finally, unfulfilled hopes, and of his ever-evolving legacy, which more than six decades after his death still ensures his place as India’s social conscience—and not just India’s.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "India",
    "Politics",
    "Banned Books",
    "Biography Memoir"
  ],
  "author": "Joseph Lelyveld",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/8695301-great-soul"
}