{
  "title": "The Name of the Rose",
  "description": "Ultima settimana del novembre 1327. Ludovico il Bavaro assedia Pisa e si dispone a scendere verso Roma, il papa è ad Avignone e insiste per avere al suo cospetto Michele da Cesena, generale dei francescani, i quali qualche anno prima hanno proclamato a Perugia che Cristo non ha avuto proprietà alcuna. Dottrina eretica, come eretici sono i fraticelli, i cui roghi illuminano l'Italia e la Francia, come eretiche erano le bande armate di fra Dolcino, debellato e bruciato da due decenni. Su questo sfondo storico si svolge la vicenda di questo romanzo, ovvero del manoscritto misterioso di Adso da Melk, un novizio benedettino che ha accompagnato in una abbazia dell'alta Italia frate Guglielmo da Baskerville, incaricato di una sottile e imprecisa missione diplomatica. Ex inquisitore, amico di Guglielmo di Occam e di Marsilio da Padova, frate Guglielmo si trova a dover dipanare una serie di misteriosi delitti (sette in sette giorni, perpetrati nel chiuso della cinta abbaziale) che insanguinano una biblioteca labirintica e inaccessibile. Guglielmo risolverà il caso, forse troppo tardi, in termini di giorni, forse troppo presto, in termini di secoli. E per farlo dovrà decifrare indizi di ogni genere, dal comportamento dei santi a quello degli eretici, dalle scritture negromantiche al linguaggio delle erbe, da manoscritti in lingue ignote alle mosse diplomatiche degli uomini del potere. Difficile da definire (gothic novel, cronaca medievale, romanzo poliziesco, racconto ideologico a chiave, allegoria) questo romanzo (la cui storia si intreccia con la Storia - perché l'autore, forse mendacemente, asserisce che di suo non vi è una sola parola)può forse essere letto in tre modi. La prima categoria di lettori sarà avvinta dalla trama e dai colpi di scena, e accetterà anche le lunghe discussioni libresche, e i dialoghi filosofici, perché avvertirà che proprio in quelle pagine svagate si annidano i segni, le tracce, i sintomi rivelatori. La seconda categoria si appassionerà al dibattito di idee, e tenterà connessioni (che l'autore si rifiuta di autorizzare) con la nostra attualità. La terza si renderà conto che questo testo è un tessuto di altri testi, un \"giallo\" di citazioni, un libro fatto di libri. A ciascuna delle tre categorie l'autore comunque rifiuta di rivelare che cosa il libro voglia dire. Se avesse voluto sostenere una tesi, avrebbe scritto un saggio (come tanti altri che ha scritto). Se ha scritto un romanzo è perché ha scoperto, in età matura, che di ciò di cui non si può teorizzare, si deve narrare.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Historical",
    "Literature",
    "Italy",
    "Crime"
  ],
  "author": "Umberto Eco",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/8694005-the-name-of-the-rose"
}