{
  "title": "Hagase Estas Preguntas",
  "description": "¿Cómo hacer nuestros sueños realidad? Debbie Ford propone un método práctico pero profundamente inspirador para que cada cual encuentre dentro de sí la respuesta a esta cuestión. Nos ofrece diez interrogantes que nos proporcionarán el poder y el estímulo necesarios para que cada una de nuestras decisiones conduzca directamente a nuestros sueños. - Descubriremos las motivaciones inconscientes que han guiado hasta ahora nuestras decisiones y actos. - Hallaremos la fuerza necesaria para recuperar el control. - Aprenderemos a crear la vida que siempre hemos deseado. Una guía inestimable para hacer realidad, día a día, nuestros más profundos deseos. Muchos de nosotros vivimos aguardando el día en que los deseos de nuestro corazón se hagan al fin realidad, en que lleguemos a ser aquella persona que desearíamos, en que nuestra fuerza vital brille con toda su intensidad. Estamos llenos de buenos propósitos, grandes objetivos y sueños maravillosos pero, una y otra vez, somos incapaces de llevarlos a la práctica. Culpamos a las circunstancias, a la mala suerte, a las personas que nos rodean, y creemos que cualquier día nuestra fortuna cambiará. Sin embargo... ese día no llega por arte de es una elección. Y sólo haciendo consciente cada una de nuestras decisiones alcanzaremos esa vida extraordinaria en la que todos soñamos. Con este libro práctico, ameno y profundamente inspirador, Debbie Ford nos ayuda a descubrir cómo a menudo saboteamos nuestro futuro y, sin saberlo, nos comprometemos en causas autodestructivas que dificultan el camino a nuestros objetivos. A través de interrogantes  como \"¿Me aportará esta decisión una satisfacción a largo plazo o sólo una gratificación inmediata?\" , esta obra nos ayuda a definir nuestras verdaderas metas en la vida, a tenerlas presentes en todo momento, a ser conscientes y a poner, al fin, rumbo a nuestros sueños. Respondiendo con rigor y sinceridad, descubriremos la magia que empieza a actuar cuando te haces responsable de tu vida y dejas  aflorar lo mejor que llevas dentro.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Personal Development",
    "Spirituality",
    "Inspirational",
    "Philosophy"
  ],
  "author": "Debbie Ford",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/86909.Hagase_Estas_Preguntas"
}