{
  "title": "The Birch Trees Stand Tall: A Jewish Fighter in the Polish Army, in the Mezritch Ghetto, and in the Concentration Camps",
  "description": "Moshe Brezniak's outstanding story, as told to his son on his death bed, describes in chilling detail the horrors of living as a Jew during the Holocaust. These memoirs, recounted in amazing detail, are one of the clearest, most life-like testimonies of the Nazi death machine. Moshe, serving in the Polish Army, found himself posted at the front lines at the onset of WWII. He was quickly captured as a POW and held in a German prisoner camp, being released after 9 months. In Mezritch began the horrible chapter of suffering in the ghetto, frequent \"actzias\" and deportation: First to Majdanek, then to Auschwitz and from there to the satellite camp Buna-Monowitz, where Moshe managed to escape certain death multiple times. Finally Moshe was among the prisoners that were evacuated in the death march to Buchenwald in the heart of the Reich. This testimony is a personal one, indeed, but it reflects the destinies of a myriad of communities, congregations, professions and races under the Nazi regime. It speaks the voice of the millions who did not survive the Nazi shredding machine. The rhythm of events depicted in this book is relentless. How luck, together with a unique profession and a decisive Mentch character had kept Moshe alive time after time is described in a way that leaves the reader breathless. Brezniak demonstrates that even a nation of murders is composed, in the end, of people. He understands that basic human drives were behind the extermination process, a process that he witnessed along the war in several death camps. During his last six years, Brezniak's son, Naphtali, worked obsessively on the book. He insisted upon prodding his father's memory in order to sanctify the memory of those that are not here. For the sake of the millions who died and for those that survived them, this book sends a message relevant to all of us today.",
  "genres": [],
  "author": "Moshe Brezniak",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/8691528-the-birch-trees-stand-tall"
}