{
  "title": "Shades of Greene: One Generation of an English Family",
  "description": "A remarkable group portrait of one English family -- the famed, intriguing and pioneering Greenes.In the early years of the last century, two brothers, Charles and Edward Greene, settled in Berkhamsted, a small country town thirty miles from London. There they were to found a remarkable dynasty -- fathering twelve children between them -- each of whom were to lead varied, well-documented and extraordinary lives.This book explores for the first time this generation of the Greene family in colourful detail -- their relationships and shared history, and their lives -- as explorers, writers, doctors, spies, politicians and much more. There is Graham, one of the greatest English writers of the twentieth century; Hugh, the Daily Telegraph's Berlin correspondent in the years leading up to WWII, and later Director-General of the BBC; Raymond, a brilliant mountaineer and medical manwho took part in the 1933 Everest expedition; their sister Elisabeth, MI6 agent, enlisting family and friends into the secret service; cousin Ben, a pacifist and Labour Party activist who was interned in 1940 at the same time as Oswald Mosley; his sister, Barbara, who spent the war in Germany; and their younger brother Felix, a pioneer of radio journalism and apologist for Communist China, who moved to a commune in California with his cousin Christopher Isherwood and Aldous Huxley; and Herbert, the black sheep of the family, fantasist and amateur spy.Interlacing biography, history, high adventure and scenes from literary life, Shades of Greene provides a riveting insight into the self-confident, enterprising, upper middle-class English world that flourished between the 1920s and the 1970 and into a truly remarkable tribe.From the Trade Paperback edition.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Jeremy Lewis",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/8692003-shades-of-greene"
}