{
  "title": "Sacred Places: American Tourist Attractions in the Nineteenth Century",
  "description": "Tourism emerged as an important cultural activity in the United States in the 1820s as steamboats and canals allowed for greater mobility and the nation's writers and artists focused their attention on American scenery. From the 1820s until well after the Civil War, American artists, like Thomas Cole and Frederic Church, depicted American tourist attractions in their work, and often made their reputations on those paintings. Writers like Irving, Cooper, Hawthorne, and James described their visits to the same attractions or incorporated them into their fiction. The work of these artists and writers conferred value on the scenes represented and helped shape the vision of the tourists who visited them. This interest in scenery permeated the work of both serious and popular writers and artists, and they produced thousands of images and descriptions of America's tourist attractions for the numerous guidebooks, magazines, and other publications devoted to travel in the United States during the period.Drawing on this fascinating body of material, Sacred Places examines the vital role which tourism played in fulfilling the cultural needs of nineteenth-century Americans. America was a new country in search of a national identity. Educated Americans desperately wished to meet European standards of culture and, at the same time, to develop a distinctly American literature and art. Tourism offered a means of defining America as a place and taking pride in the special features of its landscape. The country's magnificent natural wonders were a substitute for the cathedrals and monuments, the sense of history that Europe had built over the centuries. Moreover, Sears argues, tourist attractions like Mammoth Cave, Mount Auburn Cemetery, Yosemite, and Yellowstone functioned as sacred places for a nation with a diversity of religious sects and without ancient religious and national shrines. For nineteenth-century Americans, whose vision was shaped by the aesthetics of the sublime and the picturesque and by the popular nineteenth-century Romantic view of nature as temple, such places fulfilled their urgent need for cultural monuments and for places to visit which transcended ordinary reality.But these nineteenth-century tourist attractions were also arenas of consumption. Niagara Falls was the most sublime of God's creations, a sacred place, which, like Mount Auburn Cemetery, was supposed to have a profound moral effect on the spectator. But it was also an emporium of culture where the tourist shopped for Niagara's wonders and for little replicas of the Falls in the form of souvenirs. In Sacred Places, Sears describes how this strange, sometimes amusing, juxtaposition of the mythic and the trivial, the sacred and the profane, the spiritual and the commercial remained a significant feature of American tourist attractions even after efforts were made at Yosemite, Yellowstone, and Niagara Falls to curb commercial and industrial intrusions.Sears also explores how the nineteenth-century idealization of home stimulated the tourists' response to such places as the Willey House in the White Mountains, the rural cemeteries, and even the newly established asylums for the deaf, dumb, blind, and insane. And, in an intriguing account of Mauch Chunk, Pennsylvania, he examines the reasons why an important nineteenth-century anthracite transportation center was also a major tourist attraction.Most of the attractions discussed in this book are still visited by millions of Americans. By illuminating their cultural meaning, Sacred Places prompts us to reflect on our own motivations and responses as tourists and reveals why tourism was and still is such an important part of American life.",
  "genres": [
    "Nonfiction",
    "History",
    "American History",
    "Travel"
  ],
  "author": "John F. Sears",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/869870.Sacred_Places"
}