{
  "title": "The Navigator of New York",
  "description": "Wayne Johnston’s breakthrough epic novel The Colony of Unrequited Dreams was published in several countries and given high praise from the critics. It earned him nominations for the highest fiction prizes in Canada and was a national bestseller. His American editor said he hadn’t found such an exciting author since he discovered Don DeLillo. Johnston, who has been writing fiction for two decades, launched his next and sixth novel across the English-speaking world to great anticipation.The Navigator of New York is set against the background of the tumultuous rivalry between Lieutenant Peary and Dr. Cook to get to the North Pole at the beginning of the 20th century. It is also the story of a young man’s quest for his origins, from St. John’s, Newfoundland, to the bustling streets of New York, and the remotest regions of the Arctic.Devlin Stead’s father, an Arctic explorer, stops returning home at the end of his voyages and announces he is moving to New York, as “New York is to explorers what Paris is to artists”; eventually he is declared missing from an expedition. His mother meets an untimely death by drowning shortly after. Young Devlin, who barely remembers either of them, lives contently in the care of his affectionate aunt and indifferent uncle, until taunts from a bullying fellow schoolboy reveal dark truths underlying the bare facts he knows about his family. A rhyme circulated around St. John’s further isolates Devlin, always seen as an odd child who had inherited his parents’ madness and would likely meet a similar fate.Devlin, who has always learned about his father through newspaper reports, now finds other people’s accounts of his parents are continually altering his view of his parents. Then strange secret letters start to arrive, exciting his imagination with the unanticipated notion that his life might contain the possibility of adventure. Nothing is what it once seemed. Suddenly a chance to take his own place in the world is offered, giving him courage and a newfound zest for discovery. “It was life as I would live it unless I went exploring that I dreaded.”Caught up in the mystery of who his parents really were, and anxious to leave behind the image of ‘the Stead boy’, at the age of twenty Devlin sails, carrying only a doctor’s bag, to a New York that is bursting with frenzied energy and about to become the capital city of the globe; where every day inventors file for new patents and three thousand new strangers enter the city, a city that already looks ancient although taller buildings are constructed constantly. There he will become protégé to Dr. Cook, who is restlessly preparing for his next expedition, be introduced into the society that makes such ventures possible, and eventually accompany Cook on his epic race to reach the Pole before the arch-rival Peary. This trip will plunge Devlin into worldwide controversy -- and decide his fate.Wayne Johnston has harnessed the scope, energy and inventiveness of the nineteenth century novel and encapsulated it in the haunting and eloquent voice of his hero. His descriptions of place, whether of the frozen Arctic wastes or the superabundant and teeming New York, have extraordinary physicality and conviction, recreating a time when the wide world seemed to be there for the taking. An extraordinary achievement that seamlessly weaves fact and fabrication, it continues the masterful reinvention of the historical novel Wayne Johnston began with The Colony of Unrequited Dreams.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Canada",
    "Canadian Literature",
    "Book Club",
    "Historical",
    "Literature"
  ],
  "author": "Wayne Johnston",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/870385.The_Navigator_of_New_York"
}