{
  "title": "Race and Reunion: The Civil War in American Memory",
  "description": "No historical event has left as deep an imprint on America's collective memory as the Civil War. In the war's aftermath, Americans had to embrace and cast off a traumatic past. David Blight explores the perilous path of remembering and forgetting, and reveals its tragic costs to race relations and America's national reunion. In 1865, confronted with a ravaged landscape and a torn America, the North and South began a slow and painful process of reconciliation. The ensuing decades witnessed the triumph of a culture of reunion, which downplayed sectional division and emphasized the heroics of a battle between noble men of the Blue and the Gray. Nearly lost in national culture were the moral crusades over slavery that ignited the war, the presence and participation of African Americans throughout the war, and the promise of emancipation that emerged from the war. Race and Reunion is a history of how the unity of white America was purchased through the increasing segregation of black and white memory of the Civil War. Blight delves deeply into the shifting meanings of death and sacrifice, Reconstruction, the romanticized South of literature, soldiers' reminiscences of battle, the idea of the Lost Cause, and the ritual of Memorial Day. He resurrects the variety of African-American voices and memories of the war and the efforts to preserve the emancipationist legacy in the midst of a culture built on its denial.  Blight's sweeping narrative of triumph and tragedy, romance and realism, is a compelling tale of the politics of memory, of how a nation healed from civil war without justice. By the early twentieth century, the problems of race and reunion were locked in mutual dependence, a painful legacy that continues to haunt us today.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "American Civil War",
    "Race",
    "War"
  ],
  "author": "David W. Blight",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/87019.Race_and_Reunion"
}