{
  "title": "Gone Away: Into the Land",
  "description": "Book THE BEAST, JOHN! KILL IT! “Gone Away, Into the Land is unlike anything I have ever read before. It is a completely unique story.” Meet twelve-year-old John Greber, who describes the dark clouds of daily life he, his mother, Ellie, and six- year-old sister, Marny, live under. The fear and loathing that exist within a home ruled by the iron fist of an abusive father is established on the very first page. It is impossible not to feel, in the pit of your stomach, the inevitable onslaught of catastrophe. John’s beast of a father is unpredictable and dangerous. He takes the storybook villain to a whole new level of greed and ignorance. “The beast” finally goes too far when he disappears, taking Marny with him. The search for her leads John and Ellie into the Land, a place they couldn’t have imagined in their wildest dreams. (Think of Candyland crossed with Gregory Maguire’s vision of Oz and you’ll have something of an idea.) Allen skillfully combines the everyday world with the fantastic, a seemingly seamless combination which reminds the reader of the very best of fantasy novels. Yet, after all of the tragedies and triumphs are said and done, Goneaway, Into the Land, will leave you with a feeling of hope and a yearning for more.www.jeffreyballen.com.About the B. Allen is a teacher of writing at Northampton Community College in Bethlehem, Pennsylvania. As well, he is a member of the National Writing Project at Penn State University. Allen’s articles on character development have been published in hard copy magazines and e-zines. Prior to establishing a writing career, he ran a successful architectural woodworking business for twenty-six years and, in 2006, received the Colonel Holt Business Achievement Award. Allen holds a 50-ton Coast Guard Captain’s license and has captained numerous ocean going sailing adventures. His true love has always been writing, and today he plies the craft of writing on a full-time basis.",
  "genres": [
    "Fantasy",
    "Fiction"
  ],
  "author": "Jeffrey B. Allen",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/8702352-gone-away"
}