{
  "title": "The Manor House Governess",
  "description": "This spirited debut pays homage to the British classics—with a genderfluid protagonist and 21st-century twist—perfect for fans of Emily M. Danforth and Andrew Sean Greer.Set against the rarefied backdrop of high society, this one-of-a-kind, queer novel features 5 stunning illustrations of modern-day Cambridge.Orphaned young and raised with chilly indifference at an all-boys boarding school, Brontë Ellis has grown up stifled by rigid rules and social “norms,” forbidden from expressing his gender identity. His beloved novels and period films lend an escape, until a position as a live-in tutor provides him with a chance to leave St. Mary’s behind.Greenwood Manor is the kind of elegant country house Bron has only read about, and amid lavish parties and cricket matches the Edwards family welcomes him into the household with true warmth. Mr. Edwards and the young Ada, Bron’s pupil, accept without question that Bron’s gender presentation is not traditionally masculine. Only Darcy, the eldest son, seems uncomfortable with Bron—the two of them couldn’t be more opposite.When a tragic fire blazes through the estate’s idyllic peace, Bron begins to sense dark secrets smoldering beneath Greenwood Manor’s surface. Channeling the heroines of his cherished paperbacks, he begins to sift through the wreckage. Soon, he’s not sure what to believe, especially with his increasing attraction to Darcy clouding his vision.Drawing energy and inspiration from Charlotte Brontë, Jane Austen, E.M. Forster, and more, while bowing to popular fiction such as Plain Bad Heroines and Red, White, and Royal Blue, The Manor House Governess is a smart, sublimely charming novel destined to become a modern classic.",
  "genres": [
    "LGBT",
    "Queer",
    "Mystery",
    "Gothic",
    "Romance",
    "Contemporary",
    "Fiction"
  ],
  "author": "C.A. Castle",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/87002272-the-manor-house-governess"
}