{
  "title": "Destiny of the Wolf",
  "description": "10th Anniversary Edition of the book that launched Terry Spear's immensely popular Silver Town Wolf series, with brand new bonus content including a novella and research notes from the author.This Red Wolf needs answers, and she won't let anyone stand in her way…Fleeing from her red werewolf pack, Lelandi Wildhaven arrives in Silver Town to find out what happened to her sister. But some of the Silver Wolves don't believe her or her motives—instead insisting she's there to make a bid for the gray alpha leader's heart—and they'll do whatever it takes to protect their home.Pack leader Darien Silver can't help feeling the pain of the past, especially when Lelandi shows up, like a ghost from his memories. When someone tries to silence her, he must accept that things aren't all they seem under his watch—and that this enchanting red wolf might have a place here after all…Silver Town Wolf Destiny of the Wolf (Book 1)Wolf Fever (Book 2)Dreaming of the Wolf (Book 3)Silence of the Wolf (Book 4)Silver Wolf Christmas (Book 5)Alpha Wolf Need Not Apply (Book 6)Between a Wolf and a Hard Place (Book 7)All's Fair in Love and Wolf (Book 8)What People Are Saying About Terry \"A steamy, action-packed romance… This delicious alpha hero will leave you wild for more.\" —Nicole North, author of Devil in a Kilt, for Destiny of the Wolf\"A werewolf tale that will have you believing they live among us! This a definite keeper on my shelf!\" —Paranormal Romance Reviews for Destiny of the Wolf\"Chemistry crackles off the page… This wolf world feels at once palpable and even plausible.\" —Publishers Weekly for Heart of the Wolf\"Essential reading for werewolf-romance fans.\" —Booklist for Alpha Wolf Need Not Apply\"A funny, fun, and extremely intriguing read.\" —Fresh Fiction for SEAL Wolf in Too Deep",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Werewolves",
    "Fantasy",
    "Adult"
  ],
  "author": "Terry Spear",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/8703143-destiny-of-the-wolf"
}