{
  "title": "The Rehearsal",
  "description": "Winner of the Betty Trask Award, the NZ Society of Authors' Best First Book Award, and the Adam Prize; a finalist for the Guardian First Book Award; and longlisted for the International IMPAC Dublin Literary Award and the Orange Prize.Set in the aftermath of a sex scandal at an all-girls’ high school, Eleanor Catton’s internationally acclaimed award-winning debut is a provocative and darkly funny novel about the elusiveness of truth, the slipperiness of identity, and the emotional compromises we make to belong. When news spreads of a high school teacher’s relationship with one of his students, the teenage girls at Abbey Grange are jolted into a new awareness of their own potency and power. Although no one knows the whole truth, the girls have their own ideas about what happened. They obsessively examine the details of the affair with the curiosity and jealousy native to any adolescent girl, and they confide in their saxophone teacher, an enigmatic woman who casts a withering eye on the dramas that unfold – both real and imagined. When the local drama school decides to use the scandal as the basis for its year-end show, the real world and the world of the theatre collide. As the story moves back and forth between the two schools – and characters slip in and out of different personas – the boundaries between public and private, fact and fantasy begin to dissolve.  Sharply observed, brilliantly crafted, and infused with a deliciously subversive wit, The Rehearsal is at once a vibrant portrait of teenage longing and adult regret, and a shrewd exposé of how we are all performers in life. It introduces Eleanor Catton as a boldly inventive new voice in contemporary fiction.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Dark Academia",
    "Young Adult",
    "Novels",
    "Coming Of Age"
  ],
  "author": "Eleanor Catton",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/8701858-the-rehearsal"
}