{
  "title": "The Evangelical Universalist",
  "description": "- Can an orthodox Christian, committed to the historic faith of the Church and the authority of the Bible, be a universalist?- Is it possible to believe that salvation is found only by grace, through faith in Christ, and yet to maintain that in the end all people will be saved?- Can one believe passionately in mission if one does not think that anyone will be lost forever?- Could universalism be consistent with the teachings of the Bible?Gregory MacDonald argues that the answer is yes to all of these questions. Weaving together philosophical, theological, and biblical considerations, MacDonald seeks to show that being a committed universalist is consistent with the central teachings of the biblical texts and of historic Christian theology.\". . . [T]his passionate and lucid advocacy of an evangelical universalism . . . not only engages with key passages in the context of the overall biblical narrative but also treats clearly the profound theological and philosophical issues to which that narrative gives rise . . . readers . . . will find this book an excellent, accessible and indispensable aid in their own attempts to grapple with what its author describes as 'a hell of a problem' . . .”Andrew T. Lincoln, Portland Chair in New Testament Studies, University of Gloucestershire\". . . I was struck by the persuasiveness of many of Gregory MacDonald's arguments, not least since they rest in an unusually adept interweaving of biblical exegesis with relevant philosophical and theological considerations . . .”Joel B. Green, Professor of New Testament Interpretation, Asbury Theological Seminary\"Gregory MacDonald's defense of universalism is well argued logically, theologically, and especially biblically . . . Evangelicals, among whom MacDonald would count himself, will find him a civil and insightfully critical dialogue partner.”Thomas F. Johnson, Professor of Biblical Theology, George Fox University\"With this wonderful book, Gregory MacDonald joins the growing body of Evangelical Christians who now accept a doctrine of universal reconciliation. But I know of no one who has set forth an equally clear, thorough and compelling case for a universalist reading of the Bible as a whole . . .”Thomas Talbott, Professor of Philosophy, Willamette UniversityGregory MacDonald is a pseudonym.",
  "genres": [
    "Theology",
    "Religion",
    "Christian",
    "Christianity",
    "Faith",
    "Nonfiction",
    "Spirituality"
  ],
  "author": "Gregory MacDonald",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/869972.The_Evangelical_Universalist"
}