{
  "title": "Scar Tissue: Seven Stories of Love and Wounds",
  "description": "FROM THE FOREWORD BY J.A. “Scar Tissue will make your heart race and your heart ache, often in the same sentence.” Not only that, but buying this collection helps battle real-life heartache—50% of every e-book sold is donated to fighting pediatric cancer. Marcus Sakey’s thrillers have won numerous awards and been translated into twenty languages. Celebrities like Ben Affleck and Tobey Maguire have snatched up his film rights. Now from the “modern master of suspense” (Chicago Sun-Times) comes seven stories of men and women pushed to—and beyond—the ragged --* “The Desert Here and the Desert Far Away”Nick is back from Iraq, or so he keeps telling himself. But an old squad mate shows there are some battlefields you can’t leave behind. (Twice short-listed for Best Short Story of 2009)* “Gravity and Need”After having sex with a total stranger atop a $3000 television, you’re supposed to walk away. But for two lonely people, that’s just the beginning of a very complicated relationship.* “No One”The line between love and obsession is stretched razor-taut in this story where nothing is as it seems—and no one can be trusted.* “Cobalt”In this comic send-up the dotcom era, as the world panics over the last days of Y2K, one man searches for his soul. If he could only remember where last he saw it…* “The Time Before the Last”The shortest story I’ve ever written. It’s also inspired three paintings and made my wife cry.* “As Breathing”Billy Dexter has sworn off killing. But when he falls in love with the wrong woman, Dex discovers murder is a hard habit to break.* “The Days When You Were Anything Else”Frank has been many a conman, a hustler, a thief. But when his little girl finds herself in desperate trouble, he has one final shot at becoming something that matters.--These seven stories “contain some of the best writing in crime fiction today. You're in for quite a ride.” (J.A. Konrath). And it’s a ride you can feel good about, with 50% of every sale going to defeat pediatric cancer.---A PERSONAL NOTE FROM MARCUS---In 2010, two of the best people I know received unimaginable their four-year-old son had an incurable brain tumor. Julian Boivin was a superhero in training, and fought an epic battle. But in the end, cancer stole this beautiful boy. Nothing can make that right. But the Team Julian Foundation is trying to give other kids a fighting chance against this devastating disease. To help, I’m donating 50% of the proceeds from every single copy of SCAR TISSUE sold to pediatric cancer research. It’s a small way to work toward a big change. Want to get more involved? Visit TeamJulianFoundation.com.---MARCUS SAKEY “A brilliant writer.” -The Huffington Post “Brainy, twisty, twisted, and entirely ingenious.” -Gillian Flynn, bestselling author of GONE GIRL“One of our best storytellers.” -Michael Connelly, bestselling author of THE LINCOLN LAWYER“Exactly the electric jolt crime fiction needs.” -Dennis Lehane, bestselling author of MYSTIC RIVER“The new reigning prince of crime fiction.” -The Chicago Tribune",
  "genres": [
    "Fiction",
    "Thriller",
    "Horror",
    "Audiobook",
    "Short Stories"
  ],
  "author": "Marcus Sakey",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/8701472-scar-tissue"
}