{
  "title": "Signs of Life: A Memoir",
  "description": "“I know. I know. No one says it but I know…” —from Signs of Life Twenty-four-year-old Natalie Taylor was leading a charmed life. At the age of twenty four, she had a fulfilling job as a high school English teacher, a wonderful husband, a new house and a baby on the way.  Then, while visiting her sister, she gets the news that Josh has died in a freak accident.  Four months before the birth of her son, Natalie is leveled by loss.  What follows is an incredibly powerful emotional journey, as Natalie calls upon resources she didn’t even know she had in order to re-imagine and re-build a life for her and her son. In vivid and immediate detail, Natalie documents her life from the day of Josh’s death through the birth their son, Kai, as she struggles in her role as a new mother where everyone is watching her for signs of impending collapse.  With honesty, raw pain, and most surprising, a wicked sense of humor, Natalie recounts the agonies and unexpected joys of her new life.  There is the frustration of holidays, navigating the relationship with her in-laws, the comfort she finds and unlikely friendship she forges in support groups and the utterly breathtaking, but often overwhelming new motherhood.   When she returns to the classroom, she finds that little is more healing than the honesty and egocentricity of teenagers.  Drawing on lessons from beloved books like The Color Purple and The Catcher in the Rye and the talk shows she suddenly can’t get enough of, from the strength of her family and friends, and from a rich fantasy life—including a saucy fairy godmother who guides her grieving—Natalie embarks on the ultimate journey of self-discovery and realizes you can sometimes find the best in yourself during the worst life has to offer.  And she delivers these lessons, in way that feels like she’s right beside you in her bathrobe and with a glass of wine--the cool, funny girlfriend you love to stay up all night with.  Unforgettable and utterly absorbing, Signs of Life features a powerful, wholly original debut voice that will have you crying and laughing to the very last page.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "Grief",
    "Book Club",
    "Family",
    "Adult"
  ],
  "author": "Natalie Taylor",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/8699490-signs-of-life"
}