{
  "title": "A History of the Wife",
  "description": "A History of the Wife weaves a complex tapestry as it outlines the roles, customs, and cultural position of women in Western marriage. The work is engaging, filled with interesting anecdotes and stories, and is an incredibly lively read on a thoroughly interesting subject much in need of a closer look. In breadth, the book ranges from biblical times to the present, and in sheer scale it attempts to present a unified series of images of the Western wife over the course of some 2,000 years. In doing so, Professor Yalom has presented us an interesting grid, well conceived and wonderfully written, with which we can begin to examine this cultural phenomenon.One of the main strengths of the work is its method: Yalom draws heavily on diaries, newspapers, journals, and personal letters, and she interweaves these with citations from the laws, general customs of the times, religious rites, and civic procedure. By moving in a very fluid way from the abstract to the particular, what we see emerging, in each era, is a lively picture of how the general affected the individual. The book makes it real, makes us wonder, and helps to recover for us so many of the lost voices of women over the centuries, silenced by the overshadowing \"great men\" approach to history. These are not so much the stories of \"great women\" as they are the telling of everyday life. In reading them we get a fuller sense of what the time and place may have been like for the women whose voices we are listening to. It is the dignity of these everyday voices that holds us, intrigues us, and invites us to read further. A History of the Wife links the ancient, the medieval, the Victorian, and the modern, and makes a strong historical and narrative case for its subject.Along the way, we are treated to many interesting insights, observations, and historical facts: Nero was officially married five times -- three times to women, twice to boys; until the Middle Ages, marriages in Catholic Europe often did not involve any ceremony at all, and \"church weddings\" do not appear on the scene until well into the evolution of Christian Europe. The role of women changes slowly in the West, and the role of religion, from the biblical period through early Christianity to the changes brought by the Reformation and the voyages to the New World, are mapped for us in a sweeping overview.A particularly strong section of the book is the documentation of the last 50 years of the cultural institution of marriage, and the vast changes brought by World War II and the cultural ferment of the '60s. This is made more impressive because of the compelling histories that the work recounts for us in the 2,000 years before our own era.An old adage maintained that \"everyone needs a wife\"; this lively book tells us who followed that adage, why and how they did so, and how we got to where we are now.",
  "genres": [
    "History",
    "Nonfiction",
    "Feminism",
    "Microhistory",
    "Womens",
    "Sociology",
    "Gender"
  ],
  "author": "Marilyn Yalom",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/87057.A_History_of_the_Wife"
}