{
  "title": "The Sorcerer's Apprentices: A Season in the Kitchen at Ferran Adrià's elBulli",
  "description": "WHAT GOES ON BEHIND THE SCENES AT ELBULLI? Elected best restaurant in the world by Restaurant magazine an unprecedented five times, elBulli is where chef Ferran Adrià’s remarkable cuisine comes to life—with dragon cocktails that make the drinker breathe smoke and caviar made from tiny spheres of olive oil. elBulli is also the object of culinary pilgrimage—millions clamor every year for a reservation at one of its tables. Yet few people know that, behind each of the thirtyor more courses that make up a meal at elBulli, a small army of stagiaires—apprentice chefs—labor at the precise, exhausting work of executing Adrià’s astonishing vision. In The Sorcerer’s Apprentices: A Season in the Kitchen at Ferran Adrià’s elBulli, Lisa Abend explores the remarkable system that Adrià uses to run his restaurant and, in the process, train the next generation of culinary stars. Granted more access to Adrià and the elBulli kitchen than any other writer in the restaurant’s history, Abend follows thirty-five young men and women as they struggle to master the cutting-edge techniques, grueling hours, furious creativity, and interpersonal tensions that come with working at this celebrated institution. Her lively narrative captures a great cast, including a young Korean cook who camps on the doorstep of elBulli until he is allowed to work in the kitchen; an ambitious chef from one of Switzerland’s top restaurants struggling to create his own artistic vision of cuisine; and an American couple whose relationship may not withstand the unique pressures of the restaurant. What emerges is an irresistible tale of aspiring young talents caught, for good or ill, in the opportunity of a lifetime.Taken together, their stories form a portrait of the international team that helps make a meal at elBulli so memorable. They also reveal a Ferran Adrià few ever see, one who is not only a genius chef and artist but also a boss, teacher, taskmaster, businessman, and sometimes- flawed human being. Today, food has become the focus of unprecedented attention, and The Sorcerer’s Apprentices also explores the strange evolution—in less than two decades—of a once-maligned profession into a source of celebrity.",
  "genres": [
    "Food",
    "Nonfiction",
    "Food Writing",
    "Cooking",
    "Culinary",
    "Cookbooks",
    "Memoir"
  ],
  "author": "Lisa Abend",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/8704047-the-sorcerer-s-apprentices"
}