{
  "title": "The Foreign Correspondent",
  "description": "From Alan Furst, whom The New York Times calls “America’s preeminent spy novelist,” comes an epic story of romantic love, love of country, and love of freedom–the story of a secret war fought in elegant hotel bars and first-class railway cars, in the mountains of Spain and the backstreets of Berlin. It is an inspiring, thrilling saga of everyday people forced by their hearts’ passion to fight in the war against tyranny.By 1938, hundreds of Italian intellectuals, lawyers and journalists, university professors and scientists had escaped Mussolini’s fascist government and taken refuge in Paris. There, amid the struggles of émigré life, they founded an Italian resistance, with an underground press that smuggled news and encouragement back to Italy. Fighting fascism with typewriters, they produced 512 clandestine newspapers. The Foreign Correspondent is their story.Paris, a winter night in 1938: a murder/suicide at a discreet lovers’ hotel. But this is no romantic traged–it is the work of the OVRA, Mussolini’s fascist secret police, and is meant to eliminate the editor of Liberazione, a clandestine émigré newspaper. Carlo Weisz, who has fled from Trieste and secured a job as a foreign correspondent with the Reuters bureau, becomes the new editor. Weisz is, at that moment, in Spain, reporting on the last campaign of the Spanish civil war. But as soon as he returns to Paris, he is pursued by the French Sûreté, by agents of the OVRA, and by officers of the British Secret Intelligence Service. In the desperate politics of Europe on the edge of war, a foreign correspondent is a pawn, worth surveillance, or blackmail, or murder. The Foreign Correspondent is the story of Carlo Weisz and a handful of antifascists: the army officer known as “Colonel Ferrara,” who fights for a lost cause in Spain; Arturo Salamone, the shrewd leader of a resistance group in Paris; and Christa von Schirren, the woman who becomes the love of Weisz’s life, herself involved in a doomed resistance underground in Berlin.The Foreign Correspondent is Alan Furst at his absolute best–taut and powerful, enigmatic and romantic, with sharp, seductive writing that takes the reader through darkness and intrigue to a spectacular denouement.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Espionage",
    "Thriller",
    "Mystery",
    "World War II",
    "War"
  ],
  "author": "Alan Furst",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/87068.The_Foreign_Correspondent"
}