{
  "title": "Revolutionary Writings 1755–1775",
  "description": "“I must study Politicks and War that my sons may have liberty to study Mathematicks and Philosophy,” wrote John Adams, who devoted his considerable energy, tenacious intellect, and eloquent pen to his country’s service. A powerful polemicist, leading member of the Continental Congress, brilliant constitutional theorist, and tireless diplomat, Adams was a figure of towering importance during the birth of the American republic. Now, in a two-volume edition charting his education, early career, courtship and marriage, and experience of the American Revolution from the earliest stirrings of discontent in 1761 to his negotiation of the Treaty of Paris in 1783, The Library of America presents the first comprehensive selection of Adams’s vitally important writing for the general reader.This first volume contains seventy-two letters, essays, public messages, and drafts written by John Adams between 1755 and 1775, along with extensive selections from his diary for this period and selected passages from his unfinished autobiography recalling his life up to 1775. Included are the full text of A Dissertation on the Canon and the Feudal Law (1765), the work that transformed a young Boston lawyer into a leader of the emerging American resistance to British rule, and the entire 1775 exchange between Adams (“Novanglus”) and Loyalist Daniel Leonard (“Massachusettensis),” one of the most important newspaper debates in the colonies before independence. Throughout, in revealing excerpts from his diary and in his characteristically warm and frank letters, especially those to his “dearest friend” Abigail, Adams conveys the excitement and dangers of the emerging crisis with Britain, from the Stamp Act riots of 1765, to his successful defense of the British soldiers charged with perpetrating the Boston Massacre, to the Boston Tea Party of December 1773 and the convening of the First Continental Congress in 1774, where Adams, thrust at last onto a stage befitting his outsized ambition, became a leader of the patriot cause.",
  "genres": [
    "History",
    "American History",
    "Presidents"
  ],
  "author": "John  Adams",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/8705107-revolutionary-writings-1755-1775"
}