{
  "title": "Say My Name",
  "description": "From USA Today bestselling author Logan Chance comes a thrilling and sizzling romantic suspense that will have you heating up as you race to uncover the truth!Devereaux Huxley has a problem his billions can’t fix…me.He's the owner of Club Greed, an adult club that caters to the fantasies of the rich and powerful, Devereaux’s the prime suspect when the girls employed at his club start turning up dead.The Greedy Girls.Elegant, poised, and desired by all.And now I’m going undercover to become one.He calls me Swan.He doesn’t know my real name, but that’s how I like it. If he knew the real Chloe, I’d be in more danger than I am now.I might be in over my head, but I won’t let the dazzling whiskey-colored eyes and seductive charm of the mysterious owner make me fail at my first case as a detective.I’m determined to be the best darn Greedy Girl the small town of Saint Pierce has ever seen. And not get myself murdered in the process. I’ll just need to keep my wits about me and keep the devilishly handsome and possible murderer Devereaux Huxley at bay. Which is easier said than done.He tempts me.He desires me.He pushes me to try new things.Naughty things.Things an undercover detective shouldn’t even be imagining.But I am imagining them…with him.When the lines between reality and fantasy blur, it’ll make me question everything I’ve ever known.I’ll need to keep myself out of danger long enough to uncover what’s really going on, but when secrets threaten to crush us, and I end up in his bed, the real danger begins.*Author's Note: Can be read as a standalone. A murder mystery romantic suspense that'll have you flipping the pages like crazy. Featuring one hot sex club, a dirty-talking hero, a woman sleuth heroine, and so much steam it may set your Kindle ablaze!",
  "genres": [
    "Dark Romance",
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Billionaire Romance",
    "Contemporary"
  ],
  "author": "Logan Chance",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/87078930-say-my-name"
}