{
  "title": "The Obama Diaries",
  "description": "The Diary of President Barack ObamaThe White HouseMay 19, 2010I was going to write about tonight’s state dinner for Mexico and the amnesty plan, but we’ve got a national crisis here! I think somebody’s been snooping in this diary! The pages are all wrinkled! And the most personal entries are dog-eared! WHAT THE HELL’S GOING ON HERE?(WASHINGTON, D.C.) On May 20, 2010, Laura Ingraham received a package from an anonymous source that will change the history of the United States and the legacy of President Barack Obama. While retrieving her automobile from the underground garage at the Watergate complex (where she had just enjoyed her weekly pedicure), Ingraham discovered a manila envelope on the hood of her car. When she picked it up, a deep baritone voice called out from a nearby \"Just read it. You’ll know what to do.\" The shadowy figure then disappeared into the darkness without another word.The envelope contained copies of what appeared to be diary entries written by President Barack Obama, his family, and high-ranking administration officials. Because the \"diaries\" are so revealing, Ingraham felt compelled to release them to the American public and the citizens of the world.Major media outlets love to describe the president as \"no drama Obama,\" but The Obama Diaries tells a different tale. Through these \"diary entries,\" readers will see past the carefully constructed Obama façade to the administration’s true plans to \"remake America.\"In The Obama Diaries , Ingraham hilariously skewers the president and his minions. She takes aim •the cynical \"razzle-dazzle\" marketing of Obama’s radical agenda•the use of the Obama \"brand\" and family to obscure Obama’s true aims•Michelle Obama’s gardening and anti-obesity initiative; and much more.Informative and hugely entertaining, The Obama Diaries will inspire both laughter and critical thinking about the future of the nation and the man currently at the helm. •the use of the Obama \"brand\" and family to obscure Obama’s true aims•Michelle Obama’s gardening and anti-obesity initiative; and much more.Informative and hugely entertaining, The Obama Diaries will inspire both laughter and critical thinking about the future of the nation and the man currently at the helm.Excerpts from Laura Ingraham’s The Obama DiariesObama on Sarah \"Hell, doesn’t Palin have anything better to do than criticize me? Shouldn’t she be back home shooting some endangered wolf species from a helicopter?\" (April 9, 2010)Michelle on being First \"I’ll be damned if all this fabulosity is going to go to waste reading Dr. Seuss to snot-nosed kids all day.\" (January 23, 2009)Vice President Joe Biden on Michelle \"She’s kind of like a black Hillary Clinton. I mean that in a good way.\"  (May 5, 2009)Obama on his visit to the \"If I can ingratiate myself with a few more of these red-hats, the pope thing might not be a bad follow-up to the presidency.\"   (July 10, 2009)",
  "genres": [
    "Politics",
    "Nonfiction",
    "Humor",
    "Comedy",
    "Science"
  ],
  "author": "Laura Ingraham",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/8709212-the-obama-diaries"
}