{
  "title": "The Jasmine Trade",
  "description": "Everything was set. Seventeen-year-old Marina Lu had even ordered custom-made gowns for the ten bridesmaids who, in several months' time, would have preceded her down the aisle at her storybook wedding.There isn't going to be a wedding. Marina lies dead, alone in her shiny status car in a suburban shopping center parking lot, her two-carat diamond engagement ring refracting another abruptly shattered Los Angeles dream. Was her death merely a carjacking gone bad? Or is there more to the story?Marina's murder chillingly introduces Los Angeles Times reporter Eve Diamond to a subculture of \"parachute kids,\" the rich Asian teens who are left to their own devices in California while their parents live and work in Hong Kong. Seeking American education and political stability for their children, the affluent parents often leave only an elderly housekeeper in charge of their vulnerable offspring.What was Marina's story? Why was she, at such a young age, marrying twenty-four-year-old Michael Ho? Why is Marina's father, banker Reginald Lu, so reluctant to provide information? As Eve delves deeper into the mysteries surrounding Marina's life and death, she stumbles upon a troubled world of unmoored youth and parental neglect.But Marina, in many ways, would seem to have been among the fortunate. She had money and her parents had power. Eve soon discovers a dramatically more tragic subculture, where destitute young Asian immigrants live in virtual sexual slavery. The story of May-li and her journey from a poor farming home in Fujian, China, to a brothel in Los Angeles is one that Eve will fight to tell and will never forget.A moving, noir-accented crime novel that opens a rare window to an intriguing subject, The Jasmine Trade is a passionate and polished debut from an exciting new author.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Denise Hamilton",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/8707013-the-jasmine-trade"
}