{
  "title": "Novels by Barbara Kingsolver: The Bean Trees, Pigs in Heaven, the Poisonwood Bible, Animal Dreams, Prodigal Summer",
  "description": "This is nonfiction commentary. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Chapters: The Bean Trees, Pigs in Heaven, the Poisonwood Bible, Animal Dreams, Prodigal Summer. Source: Wikipedia. Free updates online. Not illustrated. Excerpt: The Bean Trees, first published in 1988, is the first book written by Barbara Kingsolver, followed by a sequel Pigs in Heaven. The protagonist of the novel, Taylor Greer, a native of Kentucky, finds herself in Oklahoma near Cherokee territory. The novel begins with a woman leaving a Cherokee infant with Taylor. The remainder of the novel traces the experiences of Taylor and the child, whom Taylor has named Turtle. Covering Turtle's early childhood, the story includes a colorful cast of characters, including a Guatemalan couple and Mattie, the owner of Jesus Is Lord Used Tires. The novel also makes reference to the issue of Native American parental rights. The Bean Trees opens in rural Kentucky. Taylor goes on to tell the story of how she is scared of tires. Taylor was the one to escape small-town life. She did so by avoiding pregnancy, getting a job working at the hospital, and saving up enough money to buy herself an old Volkswagen bug. About five years after high school graduation, she decides to go on a journey to see what life has to offer her. Her car breaks down in the middle of the Cherokee Nation in Oklahoma. As she sits in her car, getting ready to leave, a woman approaches and puts a baby in the front seat of Taylors car, telling her to take it. She tells Taylor she is the sister of the childs mother and that the baby was born in a Plymouth car. The woman leaves with no further explanation. Taylor is bewildered, but drives off with the child. They go to a hotel, and while bathing the baby, Taylor discovers that the baby, a girl, has been abused and sexually molested. She names the baby Tur...More: http: //booksllc.net/?id=138820",
  "genres": [
    "Fiction"
  ],
  "author": "Books LLC",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/8709163-novels-by-barbara-kingsolver"
}