{
  "title": "Revolutionary Writings 1775–1783",
  "description": "The second of two volumes gathering the essential writings of one of the towering figures of the American Revolution traces John Adams’s career from his leading role in the debate over independence (he was “our Colossus on the floor,” remembered Thomas Jefferson), to his tireless efforts to establish the fledgling government of the United States and supply its army in the field, to his crucial diplomatic service in Europe, where he was hailed as “the George Washington of negotiation.”Here are 191 letters, essays, reports, resolutions, and memoranda written by John Adams between 1775 and 1783, along with extensive selections from his diary for this period and selected passages from his unfinished autobiography recalling his service in the Continental Congress and in Europe during the American Revolution. Included are Thoughts on Government (1776), the pamphlet that shaped many of the state constitutions established after independence, and all of the “Letters from a Distinguished American” and “Replies to Hendrik Calkoen,” crucial essays Adams wrote in 1780 to influence European views of the newly independent United States and create a framework for postwar international relations. Also included is the “Report of a Constitution for Massachusetts,” Adams’s 1780 blueprint for what remains the world’s oldest working political charter. Throughout, in revealing excerpts from his diary and in his characteristically warm and frank letters, especially those to his “dearest friend” Abigail, Adams recounts the debate in Congress over independence, the struggles to form the government and law of the United States, and the intrigues and frustrations of diplomatic service.",
  "genres": [
    "History",
    "American Revolution",
    "Politics",
    "American History",
    "Essays",
    "American",
    "Presidents"
  ],
  "author": "John  Adams",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/8705108-revolutionary-writings-1775-1783"
}