{
  "title": "The Fan Who Knew Too Much: Aretha Franklin, the Rise of the Soap Opera, Children of the Gospel Church, and Other Meditations",
  "description": "A dazzling exploration of American culture—from high pop to highbrow—by acclaimed music authority, cultural historian, and biographer Anthony Heilbut, author of the now classic The Gospel Sound (“Definitive” — Rolling Stone ), Exiled in Paradise , and Thomas Mann (“Electric”—Harold Brodkey).In The Fan Who Knew Too Much , Heilbut writes about art and obsession, from country blues singers and male sopranos to European intellectuals and the originators of radio soap opera—figures transfixed and transformed who helped to change the American cultural landscape.Heilbut writes about Aretha Franklin, the longest-lasting female star of our time, who changed performing for women of all races. He writes about Aretha’s evolution as a singer and performer (she came out of the tradition of Mahalia Jackson); before Aretha, there were only two blues-singing gospel women—Dinah Washington, who told it like it was, and Sister Rosetta Tharpe, who specialized, like Aretha, in ambivalence, erotic gospel, and holy blues.We see the influence of Aretha’s father, C. L. Franklin, famous pastor of Detroit’s New Bethel Baptist Church. Franklin’s albums preached a theology of liberation and racial pride that sold millions and helped prepare the way for Martin Luther King Jr. Reverend Franklin was considered royalty and, Heilbut writes, it was inevitable that his daughter would become the Queen of Soul.In “The Children and Their Secret Closet,” Heilbut writes about gays in the Pentecostal church, the black church’s rock and shield for more than a hundred years, its true heroes, and among its most faithful members and vivid celebrants. And he explores, as well, the influential role of gays in the white Pentecostal church.In “Somebody Else’s Paradise,” Heilbut writes about the German exiles who fled Hitler—Einstein, Hannah Arendt, Marlene Dietrich, and others—and their long reach into the world of American science, art, politics, and literature. He contemplates the continued relevance of the émigré Joseph Roth, a Galician Jew, who died an impoverished alcoholic and is now considered the peer of Kafka and Thomas Mann.And in “Brave Tomorrows for Bachelor’s Children,” Heilbut explores the evolution of the soap opera. He writes about the form itself and how it catered to social outcasts and have-nots; the writers insisting its values were traditional, conservative; their critics seeing soap operas as the secret saboteurs of traditional marriage—the women as castrating wives; their husbands as emasculated men. Heilbut writes that soaps went beyond melodrama, deep into the perverse and the surreal, domesticating Freud and making sibling rivalry, transference, and Oedipal and Electra complexes the stuff of daily life. And he writes of the “daytime serial’s unwed mother,” Irna Phillips, a Chicago wannabe actress (a Margaret Hamilton of the shtetl) who created radio’s most seminal soap operas— Today’s Children , The Road of Life among them—and for television, As the World Turns , Guiding Light , etc., and who became known as the “queen of the soaps.” Hers, Heilbut writes, was the proud perspective of someone who didn’t fit anywhere, the stray no one loved.The Fan Who Knew Too Much is a revelatory look at some of our American icons and iconic institutions, high, low, and exalted.",
  "genres": [
    "Music",
    "Nonfiction",
    "Essays",
    "Art",
    "History"
  ],
  "author": "Anthony Heilbut",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/13151578-the-fan-who-knew-too-much"
}