{
  "title": "All Of Grace - C.H. Spurgeon",
  "description": "CONTENTS What Are We At? God Justifieth The Ungodly \"It Is God That Justifieth\" Just and the Justifier Concerning Deliverance from Sinning By Grace Through Faith Faith, What Is It? How May Faith Be Illustrated? Why Are We Saved by Faith? Alas! I Can Do Nothing! The Increase of Faith Regeneration and the Holy Spirit \"My Redeemer Liveth\" Repentance Must Go with Forgiveness How Repentance Is Given The Fear of Final Falling Confirmation Why Saints Persevere CloseTO YOU HE WHO SPOKE and wrote this message will be greatly disappointed if it does not lead many to the Lord Jesus. It is sent forth in childlike dependence upon the power of God the Holy Ghost, to use it in the conversion of millions, if so He pleases. No doubt many poor men and women will take up this little volume, and the Lord will visit them with grace. To answer this end, the very plainest language has been chosen, and many homely expressions have been used. But if those of wealth and rank should glance at this book, the Holy Ghost can impress them also; since that which can be understood by the unlettered is none the less attractive to the instructed. Oh that some might read it who will become great winners of souls! Who knows how many will find their way to peace by what they read here? A more important question to you, dear reader, is this--Will you be one of them? A certain man placed a fountain by the wayside, and he hung up a cup near to it by a little chain. He was told some time after that a great art-critic had found much fault with its design. \"But,\" said he, \"do many thirsty persons drink at it?\" Then they told him that thousands of poor people, men, women, and children, slaked their thirst at this fountain; and he smiled and said, that he was little troubled by the critic's observation, only he hoped that on some sultry summer's day the critic himself might fill the cup, and he refreshed, and praise the name of the Lord. Here is my fountain, and here is my find fault if you please; but do drink of the water of life. I only care for this. I had rather bless the soul of the poorest crossing-sweeper, or rag-gatherer, than please a prince of the blood, and fail to convert him to God. Reader, do you mean business in reading these pages? If so, we are agreed at the outset; but nothing short of your finding Christ and Heaven is the business aimed at here. Oh that we may seek this together! I do so by dedicating this little book with prayer. Will not you join me by looking up to God, and asking Him to bless you while you read? Providence has put these pages in your way, you have a little spare time in which to read them, and you feel willing to give your attention to them. These are good signs. Who knows but the set time of blessing is come for you? At any rate, \"The Holy Ghost saith, Today, if ye will hear his voice, harden not your hearts.\" WHAT ARE WE AT? I HEARD A STORY; I think it came from the North A minister called upon a poor woman, intending to give her help; for he knew that she was very poor. With his money in his hand, he knocked at the door; but she did not answer. He concluded she was not at home, and went his way. A little after he met her at the church, and told her that he had remembered her \"I called at your house, and knocked several times, and I suppose you were not at home, for I had no answer.\" \"At what hour did you call, sir?\" \"It was about noon.\" \"Oh, dear,\" she said, \"I heard you, sir, and I am so sorry I did not answer; but I thought it was the man calling for the rent.\" Many a poor woman knows what this meant. Now, it is my desire to be heard, and therefore I want to say that I am not calling for the rent; indeed, it is not the object of this book to ask anything of you, but to tell you that salvation is all of grace, which means, free, gratis, for nothing.",
  "genres": [
    "Theology",
    "Christian",
    "Nonfiction",
    "Christian Living",
    "Christianity",
    "Audiobook",
    "Religion"
  ],
  "author": "Charles Haddon Spurgeon",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/8712221-all-of-grace---c-h-spurgeon"
}