{
  "title": "Final Verdict: What Really Happened in the Rosenberg Case",
  "description": "A new narrative of the famed case that finally solves its remaining mysteries, by the author of the bestselling Invitation to an InquestWalter and Miriam Schneir’s 1965 bestseller Invitation to an Inquest was among the first critical accounts of the controversial case of Julius and Ethel Rosenberg, famously executed in 1953 for passing atom bomb secrets to Soviet Russia. In Invitation the Schneirs presented exhaustive and damning evidence that key witnesses in the trial had changed their stories after coaching from prosecutors, and that the FBI had forged evidence.  The conclusion was The Rosenbergs were innocent. But were they? Thirty years after the publication of Inquest , Walter Schneir was back on the case after bits and pieces of new evidence started coming to light, much of it connecting Julius Rosenberg to Soviet espionage. Over more than a decade, Schneir continued his search for the truth, meeting with former intelligence officials in Moscow and Prague, and cross checking details recorded in thousands of government documents. The result is an entirely new narrative of the Rosenberg case. The reality, Schneir demonstrates, is that Rosenbergs ended up hopelessly prosecuted for atomic espionage they didn’t commit—but unable to admit earlier espionage activities during World War II. As it happened, Julius Rosenberg was only marginally involved in the atomic spy ring he was depicted as leading—while Ethel, critically, was not at all involved. The two lied when the contended they knew nothing about espionage. Ethel knew about it and Julius had practiced it, but the government’s contention that they had stolen the “secret” of the atom bomb was critically and fatally flawed.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Politics",
    "Espionage",
    "American History"
  ],
  "author": "Walter Schneir",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/8709990-final-verdict"
}