{
  "title": "Elfhome",
  "description": "Book Three of the Elfhome series, the follow-up to exciting Wolf Who Rules and the award-winning fantasy-SF novel that started it all, Tinker.Elfhome. A world of powerful magic, beautiful elves, man-eating trees, frost-breathing wargs, and god-like dragons. Pittsburgh. A city that has been stranded deep in virgin elfin forest to stave off an invasion by the merciless oni. Its population of sixty thousand humans and a handful of elves are pitted in war that will only end in genocide. Winter is coming. Supplies are running low. All political ties are fraying. Hidden somewhere in Pittsburgh's crumbling neighborhoods, a vanguard of oni are growing in number and attacking from the shadows. And children are disappearing.Girl genius Tinker was once a human orphan, growing up on the Pittsburgh streets. Now she's an elf princess with all the bells and whistles. She rules over a melting pot of humans, elves, half-oni, and the crow-like tengu. Prejudices are rampant, pitting even the elves against each other. Hoverbike races, concerts of rock and roll fused with elf music, and artist communes of human and elves are proof that Pittsburgh can be a place where races and species can meet and meld in freedom. Tinker is determined to make her city a place of such freedom. She's going to have to kick butt and take names. And she has to do it quickly. Seven elf children are already missing -- and the oni eat their prisoners when they outlive their usefulness. Tinker uncovers ancient secrets and a web of betrayal as she searches for the children. The oni will stop at nothing to win, so neither can she. At five foot nothing, Tinker's greatest weapon has always been her intelligence. Politics, she discovers, is a battle of wits, and she's heavily armed.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Science Fiction",
    "Dragons",
    "Magic",
    "Fiction",
    "Romance"
  ],
  "author": "Wen Spencer",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/13151638-elfhome"
}