{
  "title": "The Friend Who Got Away: Twenty Women's True Life Tales of Friendships that Blew Up, Burned Out or Faded Away",
  "description": "Losing a friend can be as painful and as agonizing as a divorce or the end of a love affair, yet it is rarely written about or even discussed. THE FRIEND WHO GOT AWAY is the first book to address this near-universal experience, bringing together the brave, eloquent voices of writers like Francine Prose, Katie Roiphe, Dorothy Allison, Elizabeth Strout, Ann Hood, Diana Abu Jabar, Vivian Gornick, Helen Schulman, and many others. Some write of friends who have drifted away, others of sudden breakups that took them by surprise. Some even celebrate their liberation from unhealthy or destructive relationships. Yet at the heart of each story is the recognition of a loss that will never be forgotten. From stories about friendships that dissolved when one person revealed a hidden self or moved into a different world, to tales of relationships sabotaged by competition, personal ambition, or careless indifference, THE FRIEND WHO GOT AWAY casts new light on the meaning and nature of women’s friendships. Katie Roiphe writes with regret about the period in her life when even close friends seemed expendable compared to men and sex. Mary Morris reveals how a loan led to the unraveling of a lifelong friendship. Vivian Gornick explores how intellectual differences eroded the bond between once inseparable companions. And two contributors, once best friends, tell both sides of the story that led to their painful breakup.Written especially for this anthology and touched with humor, sadness, and sometimes anger, these extraordinary pieces simultaneously evoke the uniqueness of each situation and illuminate the universal emotions evoked by the loss of a friend.",
  "genres": [
    "Nonfiction",
    "Essays",
    "Memoir",
    "Friendship",
    "Short Stories",
    "Anthologies",
    "Womens"
  ],
  "author": "Jenny Offill",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/871302.The_Friend_Who_Got_Away"
}