{
  "title": "A Step Too Far",
  "description": "Gina Tortomelli and Nikki Manning have been friends since childhood, but now with their crazy college days behind them and the stresses of working life upon them their relationship is beginning to unravel. The bold Nikki is moving further and further toward exploring her kinky, submissive desires, but while Gina is interested she isn't as comfortable submitting as Nikki is. In a local counter-culture magazine, Nikki discovers a new, avant-garde company specializing in bringing women a submissive sexual experience in a completely safe environment. Anxious to try bondage and kinky sex with a male Dom, Nikki raises a fuss when Gina doesn’t want to play. Gina is alarmed enough to call the magazine and what she finds out amazes her. It seems the company has been thoroughly checked out by the police department using an undercover female cop named Andrea. Anxious to speak to Andrea personally to see what her experience was like, Gina makes a lunch date and when she meets Andrea sexual sparks fly between the two women. Still loyal to Nikki, Gina invites Andrea back to their apartment to see if a three way relationship is in the cards, but when Nikki and Andrea hit it off better than Gina expected her insecurity flares and Nikki becomes bitchy in return.With turmoil reigning, Nikki decides to invite Andrea to do a joint bondage and sex session, but for the sake of diplomacy Andrea turns her down leaving the determined Nikki to go alone. At the bondage club, Nikki meets Jack Gabriel, who is posing and working as an experienced Dom while actually doing a very different job. As soon as Jack sees Nikki, he knows she will fit his needs and Nikki is hopelessly drawn to Jack's edgy and unconventional way of dominating her. As Nikki is slowly trained by Jack to the point of being his puppet, Gina begins to worry about her friend and lover. With Andrea she discovers a way she can visit the bondage club without submitting, and what she sees of Nikki scares her.Has Nikki taken a step too far and fallen under Jack's control forever, or can Gina and Andrea rescue their friend and lover?",
  "genres": [
    "BDSM",
    "Erotica"
  ],
  "author": "Jennifer      Campbell",
  "average_rating": "2.83",
  "url": "https://www.goodreads.com/book/show/8711515-a-step-too-far"
}