{
  "title": "A Decadent Way to Die",
  "description": "Plus-sized P.I. Savannah Reid prides herself on cracking even the toughest cases. But her latest investigation is leaving her hungry for answers as she tries to unmask the identity of a cunning, would-be killer. His prey? A famous octogenarian with a fortune in the bank and a target on her back. . .As the creator of the world-famous Helene doll, legendary designer Helene Strauss is equally well-known for her exquisite taste and her brassy, take-no-prisoners style. While Helene's business acumen made her a huge success, it also made her a quite a few enemies. So when the feisty 80-year-old has several suspicious brushes with death, Savannah Reid is hired to find out why.Once on the case, Savannah quickly learns that tensions within the Strauss family have been raging for years. To Helene's chagrin, her niece and arch nemesis, Ava, has managed to claw her way to the helm of the family doll company, steering the business in a seedy new direction. Their latest creation--a sexy fashion doll replete with oversized lips and an over-the-top boob job--has Helene particularly rankled. . .leaving Savannah to wonder if the family ties that bind the Strauss' are tight enough to kill.With the help of her friend, Detective Dirk Coulter, Savannah discovers that Ava isn't the only one with a motive to do Helene harm. In fact, the Strauss matriarch seems to be surrounded by friends and family bent on inheriting her fortune by any means necessary. Before long, Savannah is sure she has a handle on the case. But when two key players turn up dead in Helene's sizzling hot Jacuzzi, Savannah will have to start from scratch--and question everything she thought she knew about the Strauss's twisted family tree. . .",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Fiction",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "G.A. McKevett",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/8713814-a-decadent-way-to-die"
}