{
  "title": "Wisdom Sits in Places: Landscape and Language Among the Western Apache",
  "description": "This remarkable book introduces us to four unforgettable Apache people, each of whom offers a different take on the significance of places in their culture. Apache conceptions of wisdom, manners and morals, and of their own history are inextricably intertwined with place, and by allowing us to overhear his conversations with Apaches on these subjects Basso expands our awareness of what place can mean to people.Most of us use the term \"sense of place\" often and rather carelessly when we think of nature or home or literature. Our senses of place, however, come not only from our individual experiences but also from our cultures. \"Wisdom Sits in Places,\" the first sustained study of places and place-names by an anthropologist, explores place, places, and what they mean to a particular group of people, the Western Apache in Arizona. For more than thirty years, Keith Basso has been doing fieldwork among the Western Apache, and now he shares with us what he has learned of Apache place-names--where they come from and what they mean to Apaches.\"This is indeed a brilliant exposition of landscape and language in the world of the Western Apache. But it is more than that. Keith Basso gives us to understand something about the sacred and indivisible nature of words and place. And this is a universal equation, a balance in the universe. Place may be the first of all concepts; it may be the oldest of all words.\"--N. Scott Momaday\"In \"Wisdom Sits in Places\" Keith Basso lifts a veil on the most elemental poetry of human experience, which is the naming of the world. In so doing he invests his scholarship with that rarest of scholarly qualities: a sense of spiritual exploration. Through his clear eyes we glimpse the spirit of a remarkable people and their land, and when we look away, we see our own world afresh.\"--William deBuys\"A very exciting book--authoritative, fully informed, extremely thoughtful, and also engagingly written and a joy to read. Guiding us vividly among the landscapes and related story-tellings of the Western Apache, Basso explores in a highly readable way the role of language in the complex but compelling theme of a people's attachment to place. An important book by an eminent scholar.\"--Alvin M. Josephy, Jr.",
  "genres": [
    "Anthropology",
    "Nonfiction",
    "Ethnography",
    "Indigenous",
    "Philosophy",
    "History",
    "Language"
  ],
  "author": "Keith H. Basso",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/871243.Wisdom_Sits_in_Places"
}