{
  "title": "A Fatal Debt",
  "description": "This timely debut thriller by an award-winning Financial Times columnist is a gripping tale of lethal intrigue set in the high-stakes Wall Street world—where wealth and privilege are no match for jealousy and betrayal.   Ben Cowper, an attending psychiatrist at the prestigious New York–Episcopal Hospital, is stunned to learn the identity of the emergency patient he’s just been assigned to treat: Harry Shapiro, a Wall Street colossus and one of Episcopal’s most prominent donors. But a high-profile reversal of fortune has left the once powerful investment banker jobless, bitter, and possibly desperate—judging by the handgun his wife finds him clutching. In Ben’s expert opinion, Shapiro is a suicide waiting to happen. But when the headstrong financier balks at an extended stay in the hospital psych ward, Ben reluctantly releases him, bowing to political pressure from Episcopal’s chief administrator, who’s more concerned with the patient’s money than his mind.   Days later, the shocking news breaks: There’s been a shooting death in Harry Shapiro’s Hamptons mansion. But even more shocking is the identity of the victim. A tragedy sets in motion an explosive chain of events that turns Ben Cowper’s life upside-down.   As hard-nosed cops close in with harder questions, the hospital closes ranks to protect its own interests. But with colleagues freezing Ben out, innocent circumstances conspire to incriminate him. Hounded by a DA who’s out for blood, and haunted by the specter of a shattered career, Ben has no choice: He must delve into the hearts and minds of the people who know Harry best, uncover the secrets they’d rather die—or kill—to keep, and expose the truth behind a web of malice disguised as madness.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "John Gapper",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/13151736-a-fatal-debt"
}