{
  "title": "Beyond Katrina: A Meditation on the Mississippi Gulf Coast",
  "description": "Beyond Katrina is poet Natasha Trethewey’s very personal profile of the Mississippi Gulf Coast and of the people there whose lives were forever changed by hurricane Katrina.Trethewey spent her childhood in Gulfport, where much of her mother’s extended family, including her younger brother, still lives. As she worked to understand the devastation that followed the hurricane, Trethewey found inspiration in Robert Penn Warren’s book Segregation: The Inner Conflict in the South, in which he spoke with southerners about race in the wake of the Brown decision, capturing an event of wide impact from multiple points of view. Weaving her own memories with the experiences of family, friends, and neighbors, Trethewey traces the erosion of local culture and the rising economic dependence on tourism and casinos. She chronicles decades of wetland development that exacerbated the destruction and portrays a Gulf Coast whose citizens—particularly African Americans—were on the margins of American life well before the storm hit. Most poignantly, Trethewey illustrates the destruction of the hurricane through the story of her brother’s efforts to recover what he lost and his subsequent incarceration.Renowned for writing about the idea of home, Trethewey’s attempt to understand and document the damage to Gulfport started as a series of lectures at the University of Virginia that were subsequently published as essays in the Virginia Quarterly Review. For Beyond Katrina, Trethewey has expanded this work into a narrative that incorporates personal letters, poems, and photographs, offering a moving meditation on the love she holds for her childhood home.A Sarah Mills Hodge Fund Publication.",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Memoir",
    "Essays",
    "History",
    "Contemporary",
    "Read For College"
  ],
  "author": "Natasha Trethewey",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/8717024-beyond-katrina"
}