{
  "title": "Do As I Say (Not As I Do): Profiles in Liberal Hypocrisy",
  "description": "Prominent liberals support a whole litany of policies and principles: progressive taxes, affirmative action, greater regulation of corporations, raising the inheritance tax, strict environmental regulations, children’s rights, consumer rights, and more. But do they actually live by these beliefs? Peter Schweizer decided to investigate the private lives of politicians like the Clintons, Nancy Pelosi, the Kennedys, and Ralph Nader; commentators Michael Moore, Al Franken, Noam Chomsky, and Cornel West; entertainers or philanthropists Barbra Streisand and George Soros. Using publicly-available real estate records, IRS returns, court depositions, and their own published statements, he sought to examine whether they lived by the principles they so forcefully advocate.What he found was a long list of contradictions. Many of these proponents of organized labor had developed various methods to sidestep paying union wages or avoid employing unions altogether. They were also adept at avoiding taxes; invested heavily in corporations they had denounced; took advantage of foreign tax credits to use non-American labor overseas; espoused environmental causes while opposing those that might affect their own property rights; hid their investments in trusts to avoid paying estate tax; denounced oil companies but quietly owned them.Schweizer’s conclusion is simple: liberalism in the end forces its adherents to become hypocrites. They adopt one pose in public, but when it comes to what matters most in their own lives–their property, their privacy, and their children--they jettison their liberal principles and adopt conservative ones. If these ideas don’t work for the very individuals who promote them, Schweizer asks, how can they work for the country?",
  "genres": [
    "Politics",
    "Nonfiction",
    "Audiobook",
    "Cultural"
  ],
  "author": "Peter Schweizer",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/871598.Do_As_I_Say_Not_As_I_Do_"
}