{
  "title": "The Confederacy's Last Hurrah: Spring Hill, Franklin, and Nashville",
  "description": "Following the fall of Atlanta, rebel commander John Bell Hood rallied his demoralized troops and marched them off the Tennessee, desperately hoping to draw Sherman after him and forestall the Confederacy's defeat. But Sherman refused to be lured and began his infamous \"March to the Sea,\" while Hood charged headlong into catastrophe.In this compelling dramatic account of a final and fatal invasion by the Confederate Army of Tennessee, Wile Sword illuminates the missed opportunities, senseless bloody assaults, poor command decisions, and stubborn pride that resulted in 23,500 Confederate losses—including 7,00 casualties in one battle—and the pulverization of the South's second largest army.Sword follows Hood and his army as they let an early advantage and possible victory slip away at Spring Hill, then engage in a reckless and ill-fated frontal attack on Franklin, often called the \"Gettysburg of the West.\" Despite that disaster, Hood refuses to yield and presses on the Nashville and a two-day bloodbath that unhinges what is left of his battered troops—the worst defeat suffered by any army during the war.Telling the story from both the Confederate and the Union perspectives, Sword pursues personalities as well as battles and troop strategy. He portrays Hood as a gutsy yet irresponsible leader—\"a fool with a license to kill his own men\"—whose valiant but rapidly dwindling troops were no match for the methodical General George G. Thomas and his better prepared—and entrenched—Union army. Hood, however, was not entirely to blame for Confederate failures, says Sword, who shows how decision making and actions—both good and bad, logical and chaotic—by key players on both sides helped determine the battles' outcomes.Reviews:\"Just as commercial blight covers the once bloodstained battlefields of Franklin and Nashville, so have other Civil War battles obscured the significance of Rebel defeats there. Here, Sword (Shiloh, 1974) compellingly re-creates the heroism, missed chances, political backbiting, and flawed Rebel leadership underlying the outcome at these killing grounds. In the summer of 1864, desperate to halt Sherman's campaign through Georgia, Jefferson Davis named John Bell Hood to head the Army of the Tennessee, a force torn apart by quarreling generals. Wounded in love and war, Hood, with his melancholy mien and artificial leg, seemed to embody the Southern chevalier--yet a subordinate summed him up as having ``a lion's heart'' but ``a wooden head.'' Sword is equally uncharitable: ``a disabled personality prone to miscalculation and misperception...a fool with a license to kill his own men.'' In November and December, Hood's post-Atlanta dash into Tennessee (an attempt to threaten Sherman's supply lines and terrorize Union strongholds in the Ohio Valley) was catastrophic: miscommunication that foiled a chance to crumple up a Federal column at Spring Hill; an angry frontal attack against Union entrenchments the next day at Franklin, remembered as ``the Gettysburg of the West'' because of the desperate valor and needless sacrifice of the Confederate rank and file; a stinging lesson in strategy at the Battle of Nashville from Hood's former West Point instructor, the Union's methodical George G. Thomas; and the miserable attempt to escape the Federals in icy weather. The outcome was unprecedented: 23,500 casualties out of 38,000 Confederate troops--the only instance in the war when an entire army collapsed as a fighting force. A critical Civil War campaign, narrated with brisk attention to the nuances of strategy--and with measured solemnity over the waste of life in war. (Forty-six b&w photographs and 17 maps--not seen.)\" - Kirkus Reviews\"Sword has written a very descriptive narrative of the self-destruction of the last remnants of the Confederate Army of Tennessee. Through a skillful interweaving of federal and Confederate strategies he leads the reader through the final battles as if from the shoulder of each commanding general. The vivid descriptions of each battle are supplemented by testimony from participants. Sword's criticisms of Generals Hood, Schofield, and Thomas are thoroughly grounded and make the reader wonder how either side finally won. Hood is pictured as a glory-seeking leader willing to sacrifice his troops no matter what the odds against him; Schofield was unwilling to make a decision unless forced to from above. This is one of the best historical accounts of the final battles of the Civil War in the Western theater. Public, academic, and specialized libraries should add it.\" - Library Journal",
  "genres": [
    "Civil War",
    "History",
    "American Civil War",
    "Nonfiction",
    "War",
    "Military History",
    "Military Fiction"
  ],
  "author": "Wiley Sword",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/87198.The_Confederacy_s_Last_Hurrah"
}