{
  "title": "Thomas Becket: Warrior, Priest, Rebel",
  "description": "A revisionist new biography reintroducing readers to one of the most subversive figures in English history—the man who sought to reform a nation, dared to defy his king, and laid down his life to defend his sacred honor Becket’s life story has been often told but never so incisively reexamined and vividly rendered as it is in John Guy’s hands. The son of middle-class Norman parents, Becket rose against all odds to become the second most powerful man in England. As King Henry II’s chancellor, Becket charmed potentates and popes, tamed overmighty barons, and even personally led knights into battle. After his royal patron elevated him to archbishop of Canterbury in 1162, however, Becket clashed with the King. Forced to choose between fealty to the crown and the values of his faith, he repeatedly challenged Henry’s authority to bring the church to heel. Drawing on the full panoply of medieval sources, Guy sheds new light on the relationship between the two men, separates truth from centuries of mythmaking, and casts doubt on the long-held assumption that the headstrong rivals were once close friends. He also provides the fullest accounting yet for Becket’s seemingly radical transformation from worldly bureaucrat to devout man of God. Here is a Becket seldom glimpsed in any previous biography, a man of many facets and the skilled warrior as comfortable unhorsing an opponent in single combat as he was negotiating terms of surrender; the canny diplomat “with the appetite of a wolf” who unexpectedly became the spiritual paragon of the English church; and the ascetic rebel who waged a high-stakes contest of wills with one of the most volcanic monarchs of the Middle Ages. Driven into exile, derided by his enemies as an ungrateful upstart, Becket returned to Canterbury in the unlikeliest guise of as an avenging angel of God, wielding his power of excommunication like a sword. It is this last apparition, the one for which history remembers him best, that will lead to his martyrdom at the hands of the king’s minions—a grisly episode that Guy recounts in chilling and dramatic detail. An uncommonly intimate portrait of one of the medieval world’s most magnetic figures, Thomas Becket breathes new life into its subject—cementing for all time his place as an enduring icon of resistance to the abuse of power.NAMED ONE OF THE BEST BOOKS OF THE YEAR BYKansas City Star • Bloomberg",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Religion",
    "Medieval",
    "British Literature",
    "Medieval History"
  ],
  "author": "John Guy",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/13152216-thomas-becket"
}