{
  "title": "The Husbands and Wives Club: A Year in the Life of a Couples Therapy Group",
  "description": "A PAGE-TURNING GLIMPSE INTO FIVE MARRIAGES AND THE FIGHT TO SAVE THEMFor more than a year, journalist Laurie Abraham sat in with five troubled couples as they underwent the searing process of group marriage therapy. Published as The New York Times Magazine ’s cover story \"Can This Marriage Be Saved?\" the resulting article generated intense reader response and received the Award for Excellence in Journalism from the American Psychoanalytic Association. Though the article allowed Abraham to focus on only one couple, this book, which grew out of it and the reaction it inspired, tells the moving, fascinating story of all five.The Can Leigh and Aaron find the intimacy their marriage lacks; will Bella and Joe resolve the imbalance of power that threatens to topple their marriage; are Sue Ellen and Mark as ideal as they seem; what happened to Rachael that Michael cannot acknowledge; and do Marie and Clem, with the help of therapist Judith Coché, come back from the brink of divorce?With the dexterity of a novelist, Abraham recounts the travails, triumphs, and reversals that beset the five couples. They work with their therapist—and each other—to find out whether they can rediscover the satisfaction in marriage that they once had. At times wrenching, at times inspiring, the sessions bring out the long-hidden resentments, misunderstandings, unmet desires, and unspoken needs that bedevil any imperiled couple. At the same time, these encounters provide road maps to reconciliation and revival that can be used by anyone in a relationship. Along the way, the author draws on her explorations of literature and Freudian theory, modern science, and today’s cutting-edge research to decode the patterns and habits that suggest whether a troubled marriage will survive or die. Both an important look at the state of marital dysfunction and a reaffirmation of the enduring bonds of love, The Husbands and Wives Club is an extraordinary year in the life of the American marriage.",
  "genres": [
    "Nonfiction",
    "Marriage",
    "Psychology",
    "Relationships",
    "Audiobook",
    "Self Help",
    "Romance"
  ],
  "author": "Laurie Abraham",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/8724492-the-husbands-and-wives-club"
}