{
  "title": "The Pastor: A Memoir",
  "description": "'This book is the story of my formation as a pastor, and how the vocation of pastor formed me. I had never planned to be a pastor, never was aware of any inclination to be a pastor, never 'knew what I was going to be when I grew up.' And then--at the time it seemed to arrive abruptly--there it Pastor. I can't imagine now not being a pastor. I was a pastor long before I knew I was a pastor; I just never had a name for it. Once the name arrived, all kinds of things, seemingly random experiences and memories, gradually began to take a form that was congruent with who I was becoming, like finding a glove that fit my hand perfectly-a calling, a fusion of all the pieces of my life, a Pastor. But it took a while.' In 1962, Eugene Peterson was asked by his denomination, the Presbyterian Church USA, to begin a new church outside Baltimore, in Bel Air, Maryland. And so was born Christ Our King Presbyterian Church. But Peterson quickly learned that he was not exactly sure what a pastor should do. He had met many ministers in his life, from his Pentecostal upbringing in Montana to his seminary days in New York, and he admired a few, but for all his study and all his experience, he soon discovered that the variety and quantity of the tasks put before him were overwhelming. The demands would drown him unless he figured out a way to measure what the heart of the job really was and whether he was living up to his calling. And that he was he set out to do. What Peterson discovered is that back then, just like now, few people understood what he meant to pastor a church, how he would measure himself, what he would do day to day after Sunday's service, how he would know if he was doing it well. After 29 years in the pulpit of Christ Our King Presbyterian Church, he found that being a pastor wasn't about how many people filled his pews each week but rather about 'paying attention and calling attention to 'what is going on right now' between men and women, with each other and with God. I want to give witness to this way of understanding pastor... I would like to provide dignity to this essentially modest and often obscure way of life in the kingdom of God.' The Pastor steers away from abstractions, offering instead a beautiful rendering of a life tied to the physical world-the land, the holy space, the people-all shaping his path as a pastor and his faith. We expect this book to be widely reviewed and discussed. Peterson takes on church marketing, mega pastors, and the church's too cozy relationship to American glitz and consumerism. We think it will become the definitive statement on the subject for years to come.",
  "genres": [
    "Biography",
    "Memoir",
    "Christian",
    "Nonfiction",
    "Leadership",
    "Christianity",
    "Theology"
  ],
  "author": "Eugene H. Peterson",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/8726477-the-pastor"
}