{
  "title": "Purple Mountain: A Story of the Rape of Nanking",
  "description": "By December 1937, the Japanese Imperial Army had advanced into the heartland of China and reached toward their inevitable Nanjing, China's capital and glorious ancient city nestled at the base of the Purple Mountain, was besieged. The government had fled, leaving several hundred thousand civilians and soldiers behind, among them a twelve-year-old girl.To face the unthinkable.An unprecedented historical novel, When the Purple Mountain Burns presents a riveting, profoundly intimate portrait of Nanjing and its people during the first six days after its fall to the Japanese army. Within the city walls are men and women, young and old, soldiers and civilians, Chinese and a dozen foreigners, all caught up in the whirling, turbulent fires of history.Purple A Story of the Rape of Nanking probes deeply into the souls of victims and perpetrators of war atrocities, and hails its unassuming heroes and heroines. It is a powerful allegory against the folly of war and the horrors of genocide.This WindsAsClouds edition is based on When the Purple Mountain A Novel published by the Long River Press (2005). Two Chinese editions (one in simplified Chinese and one in classic Chinese) were published in Shanghai and Hong Kong respectively at the same time. A screenplay Qi wrote on the same story has been optioned for production. The novel was inspired by the author’s intimate knowledge of his hometown and by letters, testimonies, survivor accounts, diaries, and other documents made available through the work of many scholars, journalists, and others in China, Japan, and the United States. A native of Nanjing, Shouhua Qi came to the United States for his doctoral studies in 1989. He is the author of When the Purple Mountain A Novel (in both English and Chinese editions), Red Guard Fantasies and Other Stories, Bridging the Searching for Cross-Cultural Understanding Between the United States and China, and more than ten other books. Qi is Professor of English at Western Connecticut State University.",
  "genres": [
    "War",
    "History"
  ],
  "author": "Shouhua Qi",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/8726615-purple-mountain"
}