{
  "title": "Seminary Boy: A Memoir",
  "description": "John Cornwell evokes a vanished time and way of life in this moving and, at times, troubling memoir of an adolescence spent in the isolated all-male world of the seminary. Born into a destitute family with a dominating Irish-Catholic mother and an absconding father during World War II in London, John Cornwell's childhood was deeply dysfunctional. When he was thirteen years old he was sent to Cotton College, a remote seminary for boys in the West Midlands countryside. For the next five years Cornwell lived under an austere monastic regime as he wrestled with his emotional and spiritual demons. In the hothouse atmosphere of the seminary he strove to find stable, loving friendships among his fellows and fatherly support from the priests, one of whom proved to be a sexual predator.The wild countryside around the seminary, the moving power of church ritual and music, and a charismatic priest enabled him to persevere. But while normal teenagers were being swept up by the rock ’n’ roll era, Cornwell and his fellow seminarians continued to be emotionally and socially repressed. Secret romantic attachments between seminarians were not uncommon; on visits home they were overwhelmed by the powerful attractions of the emerging youth culture of the 1950s. But when they returned to Cotton College, the boys were once again governed by the age-old traditions and disciplines of seminary life. And like many young seminarians, Cornwell struggled with a natural adolescent rebelliousness, which in one crucial instance provoked a crisis that would eventually lead to his decision to abandon his dream of becoming a priest. Written with tremendous warmth and humor, Seminary Boy is a truly unforgettable memoir and a penetrating glimpse into the hidden world of seminary life.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Religion",
    "Biography",
    "Catholic"
  ],
  "author": "John Cornwell",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/872965.Seminary_Boy"
}