{
  "title": "Free Within Ourselves: Fiction Lessons for Black Authors",
  "description": "A Bird by Bird for the African-American market--A top-notch writer's guide filled with practical guidance, essays, and journal exercises for the African-American writer including advice from E.Lynn Harris, Charles Johnson, and Yolanda Joe.In her introduction, Jewell Parker Rhodes \"Never (in four years of college or five years of graduate school) was I assigned an exercise or given a story example that included a person of color...While the educational system and the publishing world have become progressively more welcoming of African-American authors, there is still little attention to educating, supporting, and sustaining the writing process of African-American authors. Free Within Ourselves is a solid first step--it is the book I wished I had when I started out as a writer. It is meant to be a song of encouragement for African-American artisits and visionaries. Free Within Ourselves is a step-by-step introduction to fictional technique, exploring story ideas, and charting one's progress, as well as a resource guide for publishing fiction.\"For the legions of people who have a novel stuck in their word processors, help is finally on the way! Free Within Ourselves is an excellent guide to all the elements necessary to crafting character development, point of view, plot, atmosphere, dialogue, diction, sentence variety, and revision. Writing techniques are taught using exercises, journaling, story examples, and analyses of famous writing fragments, as well as several complete stories (including those of James Baldwin, Zora Neale Hurston, and Edwidge Dandicat, among others). The book is further enhanced by inspirational advice from successful contemporary black writers (such as Bebe Moore Campbell, Rita Dove, Henry Louis Gates, John Edgar Wideman, and others), a bibliography, and a guide to workshops, journals, magazines, contests, and fellowships supportive of black arts.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Jewell Parker Rhodes",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/873405.Free_Within_Ourselves"
}