{
  "title": "Fang Bangers",
  "description": "FANG BANGERS collects 14 hot stories of fanged and clawed love and lust - Vampires loving shape shifters, werewolves lusting for fairies and every creature imaginable with the girl next door!It's a collection of the ultimate taboos!Erotic super star Cecilia Tan gives us some Vampire BDSM, New York Times best-selling author Lois Gresh gives us a clawed creature of unique proportions and propensities, and Gina McQueen (New York Times best-selling author John Skipp in drag) shows us some new werewolf tricks.Looking for more HOT paranormal reads? Don't miss these great titles from Ravenous Romance!Night's Fall by Angela CameronGabrielle Pearce lost her husband. Her baby. And her life. Being abducted and thrown into a room in a dilapidated plantation home with a darkly seductive vampire could be the start of the life-and the storybook romance-she's been missing. What do you when you've lost it all and true love could cost you your life?Mercury Rising by Daisy HarrisTake a sexy romp with the gods in this hilarious and hot ménage when the gods gather for the \"Deities International Conference and Kibbitz\"! contains male-male loving, male-female loving, male-male-female loving, male-male-male...well, you get the idea!Summer of the Beast by Trinity BlacioWhen they say summer is hot, they aren't kidding, but it's sizzling as far as Violet and Whitnee are concerned. Especially when the men around them have enough testosterone to melt the North Pole! Don't miss this HOT summer read!Running in Escaped by Trinity BlacioJaycee has been on the run since her sixteenth birthday. After growing up fast and depending on no one, how is she supposed to handle three male werewolves who claim to be her mates? Can she learn to trust them or will she continue to run?Running in Ghost Warrior by Trinity BlacioNo matter what came her way, she’s always been a fighter. Yet, when Lissa learns she is mated to four men, she swears someone is out to get her! With war coming ever closer, can Lissa and her mates build their relationship while they keep each other safe?Revenge and Redemption from Jennie BrumleyHow far will one man go to avenge his sister, his last remaining family?How far will one woman go to protect her new found freedom, and her inexperienced heart?Don't miss this tale of revenge, lust, and love!",
  "genres": [
    "Vampires"
  ],
  "author": "Lori Perkins",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/8729996-fang-bangers"
}