{
  "title": "The Jedi Path: A Manual for Students of the Force",
  "description": "The Jedi Path, Fully Illustrated, with Removable Features and a Mechanical VaultWith the push of a button, the doors of the vault open in a wash of light and Star Wars sound effects. The inner platform rises, revealing this exclusive edition of The Jedi Path.This ancient training manual, crafted by early Jedi Masters, has educated and enlightened generations of Jedi. It explains the history and hierarchy of the Jedi Order, and what Jedi must know to take their place as defenders of the peace in the galaxy — from mastery of the Force to the nuances of lightsaber combat.Passed down from Master to Padawan, the pages of this venerable text have been annotated by those who have held it, studied it, and lived its secrets. From Yoda and Luke Skywalker to Count Dooku and Darth Sidious, they have shaped the content of the book by leaving mementos tucked within the pages, tearing out pages, and adding their personal experiences as tangible reminders of the lessons they’ve learned.Through wars and rebellion, only a single copy of this manual has survived. It is now passed on to you.The ancient Masters who wrote the text: Fae Coven, Grand Master and head of the Jedi Council; Crix Sunburris, Jedi Ace starfighter pilot; Restelly Quist, Jedi Chief Librarian; Skarch Vaunk, Jedi Battlemaster and lightsaber expert; Bowspritz, Jedi Biologist and expert on the Living Force; Sabla-Mandibu, Jedi Seer and Holocron expert; Morrit Ch’gally, Jedi Recruiter; Gal-Stod Slagistrough, Jedi leader of the Agricultural Corps.Jedi who added personal commentary: Yoda, Thame Cerulian, Count Dooku, Qui-Gon Jinn, Obi-Wan Kenobi, Anakin Skywalker, Ahsoka Tano, Darth Sidious, and Luke Skywalker.Removable features: A letter tracing the book’s history, a severed Padawan braid, a metal Jedi Credit medallion, a Jedi starfighter patch, a burned poster of the Jedi Code, a map of the Jedi Temple, a lightsaber diagram sketched on the back of a napkin from Dex’s Diner, and a note on the missing pages torn from the book by a Sith.Created in collaboration with Lucasfilm — along with an acclaimed Star Wars author and revered Star Wars illustrators — this volume provides new insights into the history and lore of the Jedi Order while introducing never-before-seen ships, creatures, characters, and details about how one trains to become a Jedi.",
  "genres": [
    "Star Wars",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Reference",
    "Young Adult",
    "Philosophy"
  ],
  "author": "Daniel  Wallace",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/8729077-the-jedi-path"
}