{
  "title": "The Little Town Where Time Stood Still",
  "description": "Includes The Little Town Where Time Stood Still and Cutting It Short.In the 1930s Europe is tangoing to the tune of a new age, but in rural Czechoslovakia Maryska dances to a rhythm all her own. In a town dominated by a somber municipal brewery, she is a colorful and rather alarming apparition speeding through the quiet village on her bicycle, her long, tempestuous hair billowing behind her. Not even her husband, Francin (the brewery manager), can control her, as Maryska shocks the populace with her scandalous behavior, and incurs the disapproval of a proper little town that is blissfully unaware of the cataclysmic world events into which it is about to be engulfed. As World War II draws to a close and communism looms on the horizon, Maryska and her town appear to have survived unscathed. But subtle changes begin to appear - in Maryska and her family, and most noticeably at the brewery, where the new political order creates tensions that tear through the social fabric of the town in ways that Maryska in her wildest days could not possibly have imagined. The two linked narratives brought together in The Little Town Where Time Stood Still comprise Bohumil Hrabal's poignant and witty evocation of the passing of an era and display a master writer at the height of his powers as he creates, in an enchanting fictional work, an elegy for a nation that is no more.From the flamboyant and unpredictable Maryska, who scandalises the town when she cuts short her golden tresses, to the eccentric Uncle Pepin, who always has to have a ready supply of furniture to smash when he's angry, Bohumil Hrabal creates a range of enchanting and memorable characters - confirming his status as one of Europe's greatest writers.",
  "genres": [
    "Fiction",
    "Czech Literature",
    "Classics",
    "Literature",
    "20th Century",
    "Novels",
    "Historical"
  ],
  "author": "Bohumil Hrabal",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/87285.The_Little_Town_Where_Time_Stood_Still"
}