{
  "title": "The Great Cryptogram; Francis Bacon's Cipher in the So-called Shakespeare Plays",
  "description": "This historic book may have numerous typos and missing text. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1888 edition. Excerpt: ...exultantly does ne depict his own country--\"that little body with a mighty heart,\" as he calls it elsewhere: This royal throne of kings, this sceptered isle, This earth of majesty, this seat of Mars, This other Eden, demi-paradise, This fortress built by Nature for herself 1 Swinburne, Study of Shak., p. 113. ' Essay xxix, The TrueGreaituss of Kingdoms. Mbid., p. 73. \"Ibid. Against infection and the hand of war; This happy breed of men, this little world, This precious stone set in the silver sea, Which serves it in the office of a wall, Or as a moat defensive to a house. Against the envy of less happier lands; This blessed plot, this earth, this realm, this England, This teeming womb of royal kings, Fear'd for their breedand famous by their birth, Renowned for their deeds as far from home (For Christian service and true chivalry), As is the sepulcher in stubborn Jewry Of the world's ransom, blessed Mary's son; This land of such dear souls, this dear, dear land, Dear for her reputation through the world.1 And again he speaks of England as Hedged in with the main, That water-walled bulwark, still secure And confident from foreign purposes. And again he says: Let us be back'd with God, and with the seas, Which he has given for fence impregnable.3 And again he says: Which stands As Neptune's park, ribbed and paled in With rocks unscalable and roaring waters.4 And again: Britain is A world by itself.5 And again: 1\" the world's volume, Our Britain is as of it, but not in it; In a great pool, a swan's nest. And, while Shakespeare alludes to the sea as England's \" water-walled bulwark,\" Bacon speaks of ships as the \"walls\" of England. And he says: To be master of the sea is an abridgment of a monarchy.1 And he further says: No man can by care-taking (as...",
  "genres": [],
  "author": "Ignatius L. Donnelly",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/8734509-the-great-cryptogram-francis-bacon-s-cipher-in-the-so-called-shakespear"
}