{
  "title": "Harriet Tubman: Imagining a Life",
  "description": "“I am at peace with God and all mankind.”—Harriet Tubman to Mary Talbert, on the occasion of their last visit, 1913Now, from the award-winning novelist and biographer, an astonishing reimagining of the remarkable life of Harriet Tubman—the “Moses of Her People.”During her lifetime Harriet Tubman was an escaped slave, lumberjack, laundress, raid leader, nurse, fund-raiser, cook, intelligence gatherer, Underground Railroad organizer, and abolitionist. She was known both as Moses and as General Tubman.In Harriet Tubman: Imagining a Life, Beverly Lowry goes beyond the familiar tales to create a portrait of Tubman in lively imagined vignettes that, as Lowry writes, “catch her on the fly” and portray her life as she herself might have presented it. Lowry offers readers an intimate look at Tubman’s early life firsthand: her birth as Araminta Ross in 1822 in Dorchester, Maryland; the harsh treatment she experienced growing up—including being struck with a two-pound iron when she was twelve years old; and her triumphant escape from slavery as a young woman and rebirth as Harriet Tubman. We travel with Tubman along the treacherous route of the Underground Railroad and hear of her friendships with Frederick Douglass, John Brown, and other abolitionists. We accompany her to the battlefields of the Civil War, where she worked as a nurse and a cook and earned the name General Tubman, join her on slave-freeing raids in the heart of the Confederacy, and share her horror and sorrow as she witnesses the massacre of Colonel Shaw and the black soldiers of the 54th Regiment at Fort Wagner.Integrating extensive research and interviews with scholars and historians into a stunningly rich and mesmerizing chronicle, Lowry brings Tubman to life as never before.With 62 photographs, illustrations, and maps",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Classics",
    "Historical",
    "American",
    "Womens"
  ],
  "author": "Beverly Lowry",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/873773.Harriet_Tubman"
}