{
  "title": "The Roots of Obama's Rage",
  "description": "Critics of President Obama have attacked him as a socialist, an African-American radical, a big government liberal. But somehow the critics have failed to reveal what's truly driving Barack Obama. Now bestselling author Dinesh D’Souza throws out these misplaced attacks in his new book, The Roots of Obama’s Rage.The reason, explains D'Souza, that Obama appears to be working to destroy America from within is found, as Obama himself admits, in \"The Dreams of His Father\": a deeply-hostile anti-colonialism. Instilled in him by his father, this worldview has led President Obama to resent America and everything for which we stand.Viewing Obama through this anti-colonialism prism and drawing evidence from President Obama’s own life and writings, D’Souza masterfully shows how Obama is working to weaken and punish America here and abroad. From enacting crippling financial reforms to setting artificial withdrawal dates in Iraq and Afghanistan, Obama is trying to muzzle the capitalism which he sees as exploiting the weak. Our president, argues D'Souza, is more concerned with being labeled as America the Oppressor than winning the war on terror. Other examples of how Obama's anti-colonial mindset influence his policies include:in the midst of the BP oil spill Obama made a point of saying that while the United States has 2 percent of the world’s oil, it uses 25 percent of the world’s (apparently limited) oil resources – as if using that additional 23 percent were a form of Western piracy and inequity,the Churchill bust in the Oval Office—given to the U.S. by Tony Blair after the September 11 attacks—was banished from the White House and sent back to Britain,Obama’s conference on Iran and North Korea’s nuclear weapons programs ends with nothing being done about Iran and North Korea, but with reductions in the Soviet and American stockpiles, andObama spent 20 years in the Afrocentric church of the Reverend Wright—to whose church he was first attracted by a sign outside that said: FREE AFRICA.The Roots of Obama’s Rage reveals Obama for who he really is: a man driven by the anti-colonial ideology of his father and the first American president to actually seek to reduce America's strength, influence, and standard of living. Controversial and compelling, The Roots of Obama’s Rage is poised to be the one book that truly defines Obama and his presidency.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Biography",
    "History",
    "Political Science",
    "Philosophy",
    "Presidents"
  ],
  "author": "Dinesh D'Souza",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/8738445-the-roots-of-obama-s-rage"
}