{
  "title": "The Sufi Message: Volume 2: Mysticism of Music, Sound and Word",
  "description": "Pages: 273About the BookThe inspiring practical philosophy of Sufi Hazrat Inayat Khan (Baroda 1882-Delhi 1927) in this guidebook is pre- sented in terms of music, sound and mysticism, and yet it relates to daily life and spirituality in general. It presents you with insights into the metaphysical foundation of music and sound and its effects upon our daily doings. You may acquire a deeper understanding of both the cosmical manifestation and the rhythm and harmony of everyday life. Although his philosophy is thorough and deep yet the unaccustomed reader will find himself inspired and understanding. The author combines depth and simplicity and speaks to the heart of the reader. You may find new dimensions to your everyday speech, thoughts and actions. The book contains four parts: The Mysticism of Sound; Music; The Power of the Word; and Cosmic Language. PrefaceThe Mysticism of Music, Sound, and Word presents an essential part of the-highly practical-philosophy of Hazrat lnayat Khan. Born a musician music and sound were for him the essence of life. Even when later he had to give up his practice of what in Indian philosophy is called struck music the unstruck music remained with him, and increasingly so. Not only did he enjoy it in his meditations and all through life, whether in silent nature or in the roaring streets of Manhattan. In its fullness it came out in his discourses and other presentations he made to the amazed and yet not fully understanding public of the West in the 'twenties. Hi's realization of sound and music transformed his words into living beings, attuning the atmosphere, bringing inspiration to the public. 'I gave up my music because I had received from it all that I had to receive. To serve God one must sacrifice what is dearest to one; and so I sacrificed my music. I had composed songs; I sang and played the vina; an",
  "genres": [
    "Music",
    "Spirituality",
    "Philosophy",
    "Nonfiction",
    "Islam",
    "Religion",
    "Mysticism"
  ],
  "author": "Hazrat Inayat Khan",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/875118.The_Sufi_Message"
}