{
  "title": "Confessions of a Pastor: Adventures in Dropping the Pose and Getting Real with God",
  "description": "The Dark Side of a Pastor’s Life—A Breath of Fresh Air Are you tired of pretending? Living walled up? Going only skin deep? Craig Groeschel, pastor of the thriving LifeChurch.tv, sure was. And in his refreshingly raw and real book, he comes clean. Not that he has anything other than typical, human stuff to confess. Check out a few of his musings: I have to work hard to stay sexually pure, I hate prayer meetings, sometimes I doubt God , and I can’t stand a lot of Christians . Through his incredible honesty, he opens the door for you to follow suit. Are you ready to dig deep and let God shine through the genuine you? No more living just to please others. No more hiding. You can be who God called you to be. You can live for an audience of One. Is the real you getting lost  because the fake you is just so annoyingly  impressive? “Stepping onto the platform to preach that morning, I admitted to myself that I was not a pastor first, but a regular, scared, insecure, everyday guy whose life had been changed by Jesus. And if Jesus really loved me as I was (I knew He did), then why should I go on trying to be someone I wasn’t?”  Why do we fake it so much? Why do we spend so much time trying to please everyone else and make so little effort trying to please God? When Craig Groeschel asked himself those questions, he couldn’t come up with a good answer. So one day he decided to drop the act and start getting real. With that one choice, his life began to change in a big way. And yours can too. Craig’s passionate, funny, warts-and-all confessions—and the lessons he learned from them—will help you find your own path to authentic living and a deeper relationship with God (you know He’s on to you anyway!). Story Behind the Book“For too many years my life had been a show—my lines well rehearsed and every performance polished. By college, I played so many different roles I lost track of the real me. I began to wonder if there was a real me. Exhausted from playing the parts, I finally took off the masks—and met a God who loved me unconditionally. Confessions of a Pastor reveals in graphic detail my inner struggles, questions, doubts, and fears—to inspire others to abandon lives of pretending—and to meet the authentic love of God like never before.” — Craig Groeschel",
  "genres": [
    "Christian",
    "Leadership",
    "Christian Living",
    "Faith",
    "Church",
    "Nonfiction",
    "Religion"
  ],
  "author": "Craig Groeschel",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/87527.Confessions_of_a_Pastor"
}