{
  "title": "SONS OF MAFIA : Inspired by True Events",
  "description": "\"Son’s of Mafia…WHAT A READ!I absolutely could not put this book down and even though the subject matter is dark and serious, Ed Frederico’s flair for humor and sensuality makes this book unique and most definitely one of a kind.This book gets my A+ RatingRichard BellLas Vegas, NVUNBELIEVABLE, this book comes to life and spins a web of not only Love and Intrigue, but also of Treachery and Deceit. The author writes with superior intellect and a keen understanding of the human condition.The book is bigger than life because “It is real life.”John Arn, New HampshireWow! This is the first Novel I’ve ever read I could not put down.Rick SolitzFresno, CAThe Author, Ed Frederico, illustrates quite thoughtfully the predicament of How Eddie D’Amico struggles to maintain his love and humanity. Because of the circumstance of birth, although born an innocent he is placed into a world of crime, treachery, and betrayal. This book takes off like a rocket with all its thrust and power. Son’s of Mafia is such a Power-House! The book is impossible to put down and this experience allows us to take an inside look into the strange world of Money, Greed, and Death.Jamal ArgrowSavannah GAIn Son’s of Mafia, although there is explicit raw sex the author has unique ability to soften and add the human touch of passion with great Sensitivity, Care and Good Taste. Come experience an unusual journey through the forbidden world of life inside the mafia where you will be allowed to travel first class. Ed Frederico gives the reader his inside view as never before experienced. Not only will you be able to see the inner workings of the families business but also the inner workings of family life and how the dangerous decisions needed to be made affected everyone involved.Joel Jen BuschDetroit MI\"",
  "genres": [],
  "author": "Ed Frederico",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/8752284-sons-of-mafia"
}