{
  "title": "Landover: Magic Kingdom for Sale - Sold!, the Black Unicorn, Wizard at Large, a Princess of Landover, the Tangle Box, Witches' Brew",
  "description": "Chapters: Magic Kingdom for Sale - Sold , the Black Unicorn, Wizard at Large, a Princess of Landover, the Tangle Box, Witches' Brew. Source: Wikipedia. Pages: 30. Not illustrated. Free updates online. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Excerpt: Magic Kingdom for Sale SOLD is the first of Terry Brooks's Magic Kingdom of Landover novels. Written in 1986, it tells the story of how Ben Holiday, a talented but depressed Chicago trial lawyer, comes to be king of Landover, an otherworldly magical kingdom. The book was re-released as part of a Landover omnibus in 2009. The novel begins with Ben Holiday, a trial lawyer from Chicago, lamenting the loss of his wife and unborn child in a car accident. He finds an advertisement in an upscale Christmas catalog claiming to offer a magical kingdom for one million dollars by a man named Mr. Meeks. Although skeptical, Ben pursues the offer out of a desperate need to start a new life. Ben receives a magical medallion and is transported through a swirling mist to the kingdom of Landover. He learns that Landover is a world that connects many other worlds such as Earth. It is surrounded by the Fairy Mist wherein reside creatures of Fairy that created Landover and guard the passages to these worlds. Unfortunately, he finds it not exactly as described. He soon finds that Landover has not had a true king in twenty years. The son of the last king did not wish to take up the throne and escaped with the court wizard, Meeks, to Earth. They have been selling the throne to dozens of people in the past two decades, but no one has been able to face the challenge and successfully complete so much as a few months as king. Further, kings of Landover used to be protected by a magical knight called the Paladin, but he has not been seen since the last king's death. Further, Ben has only four loyal subjects. T...More: http: //booksllc.net/?id=683389",
  "genres": [
    "Fantasy"
  ],
  "author": "Books LLC",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/8752891-landover"
}