{
  "title": "Finding Ultra: Rejecting Middle Age, Becoming One of the World's Fittest Men, and Discovering Myself",
  "description": "Finding Ultra is Rich Roll’s incredible-but-true account of achieving one of the most awe-inspiring midlife physical transformations ever.   One cool evening in October 2006, the night before he was to turn forty, Rich experienced a chilling glimpse of his future. Nearly fifty pounds overweight at the time and unable to climb the stairs without stopping, he could see where his current sedentary lifestyle was taking him.   Most of us, when granted such a moment of clarity, look the other way—but not Rich.   Plunging into a new way of eating that made processed foods off-limits and that prioritized plant nutrition, and vowing to train daily, Rich morphed—in a matter of mere months—from out-of-shape midlifer to endurance machine. When one morning ninety days into his physical overhaul, Rich left the house to embark on a light jog and found himself running a near marathon, he knew he had to scale up his goals.   How many of us take up a sport at age forty and compete for the title of the world’s best within two years? Finding Ultra recounts Rich’s remarkable journey to the starting line of the elite Ultraman competition, which pits the world’s fittest humans against each other in a 320-mile ordeal of swimming, biking, and running. And following that test, Rich conquered an even greater one: the Epic5—five Ironman-distance triathlons, each on a different Hawaiian island, all completed in less than a week.   But Finding Ultra is much more than an edge-of-the-seat look at a series of jaw-dropping athletic feats—and much more than a practical training manual for those who would attempt a similar transformation. Yes, Rich’s account rivets—and, yes, it instructs, providing information that will be invaluable to anyone who wants to change their physique. But this book is most notable as a powerful testament to human resiliency, for as we learn early on, Rich’s childhood posed numerous physical and social challenges, and his early adulthood featured a fierce battle with alcoholism.   Ultimately, Finding Ultra is a beautifully written portrait of what willpower can accomplish. It challenges all of us to rethink what we’re capable of and urges us, implicitly and explicitly, to “go for it.”",
  "genres": [
    "Nonfiction",
    "Health",
    "Sports",
    "Biography",
    "Memoir",
    "Audiobook",
    "Fitness"
  ],
  "author": "Rich Roll",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/13152949-finding-ultra"
}