{
  "title": "The Complete Guide to Writing & Publishing Your First E-Book Insider Secrets You Need to Know to Become a Successful Author",
  "description": "The advent of Amazon’s Kindle in 2007 allowed millions of writers to make the leap from paper to the electronic screen. Several eReader competitors recently joined the ring, introducing products such as the Apple iPad, Barnes & Noble Nook, the updated Sony Reader, and Samsung Papyrus. The publishing world is experiencing a revolution with these electronic readers — and you can catch up to speed by learning the ins and outs of publishing with this low-cost, high-profit publisher. The Complete Guide to Writing & Publishing Your First eBook is a guide for anyone who’s dreamt about becoming a published author and is intrigued by the profitable new prospect of ePublishing — but didn’t know where to start. EBook sales hovered around $500 million at the end of 2009, and are steadily climbing. If you’re passionate about writing and using new technology to market yourself and your work, this book will explain how you can do what you love and increase your earning potential. Start off with understanding what an eBook is and the differences between traditional and digital publishing, and the benefits involved. You will identify and learn the details of more than 15 eReaders, including the three Kindle, Nook, and Sony Reader. You will employ the basics of analyzing your audience, brainstorming, writing, editing, and marketing — according to the type of eReader. You will learn the process of getting your book published, how to change or alter the format or style of your book to match the necessities of the eReader, and how to optimize the format of any text for e-reading. We spent dozens of hours interviewing writers who are experts in the art of digital publishing to provide a complete overview of everything you need to know about publishing your eBook. Not only will you learn how to upload your work through an eReader, you will also hone your writing skills with tips, writing exercises, and writing resources. You will learn how to target your book to the right demographic and what you can do to promote your book in online inventories. You will learn the basics of viral marketing promotion, SEO, and building a business with digital publications. You will learn how to work with your eReader to produce innovative content, and you will learn how to monitor for updates to the electronic publishing industry. No matter what your goals are, you can start publishing from your home with eReader technology and this book.",
  "genres": [],
  "author": "Atlantic Publishing Company",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/8761522-the-complete-guide-to-writing-publishing-your-first-e-book-insider-sec"
}