{
  "title": "Alfred Hitchcock Presents: Stories to Stay Awake By",
  "description": "That master of the macabre Alfred Hitchcock has only scorn for people who dream their nights away. No one should waste those deliciously dark hours between dusk and dawn when the wind howls the loudest and the smallest sounds can reap the greatest dividends of dread. Therefore in his latest collection Hitch has personally selected tales tailored to break the stranglehold of slumber and make sure that all your nightmares are waking ones. Thirty-five startling, frightening, suspenseful, chilling exercises in the art of murder and suspense   Contents1.   Success of a Mission  / by William Arden2.   The Splintered Monday  / by Charlotte Armstrong3.   Death by Judicial Hanging  / by Francis Beeding4.   Floral Tribute  / by Robert Bloch5.   Red Wine  / by Lawrence G. Blochman6.   Canavan's Back Yard  / by Joseph Payne Brennan7.   A Murderous Slice  / by Marguerite Dickinson8.   The New Deal  / by Charles Einstein9.   Boomerang  / by Guy Fleming10.   Sleep is the Enemy  / by Anthony Gilbert11.   The Second Coming  / by Joe Gores12.   From the Mouse to the Hawk  / by Dion Henderson13.   Letter to the Editor  / by Morris Hershman14.   The Spy Who Came to the Brink  / by Edward D. Hoch15.   Second Talent  / by James Holding16.   The Ohio Love Sculpture  / by Adobe James17.   The Great Three-Month Super Supersonic Transport Stack-Up of 1999  / by John Keefauver18.   Homicide House  / by Day Keene19.   A Feline Felony  / by Lael J. Littke20.   The Devil-Dog  / by Jack London21.   The Homesick Buick  / by John D. MacDonald22.   Campaign Fever  / by Patricia McGerr23.   Run With the Wind  / by James McKimmey24.   Squeakie's Second Case  / by Margaret Manners25.   The Silent Butler  / by Harold Q. Masur26.   McGowney's Miracle  / by Margaret Millar27.   Ten Minutes From Now  / by Jack Ritchie28.   See and Tell  / by Mary Linn Roby29.   Fair's Fair  / by Jane Speed30.   The Doe and the Gantlet  / by Pat Stadley31.   The Last Day of All  / by Fay Grissom Stanley32.   The Nail and the Oracle  / by Theodore Sturgeon33.   Doctor's Orders  / by John F. Suter34.   The Man Who Laughs at Lions  / by Bryce Walton35.   The Unsuspected  / by Jay Wilson",
  "genres": [
    "Short Stories",
    "Mystery",
    "Horror",
    "Anthologies",
    "Fiction",
    "Thriller",
    "Literature"
  ],
  "author": "Alfred Hitchcock",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/87607.Alfred_Hitchcock_Presents"
}