{
  "title": "I'll Be There",
  "description": "Emily Bell believes in destiny. To her, being forced to sing a solo in the church choir--despite her average voice--is because it's while she's singing that she first sees Sam. At first sight, they are connected.Sam Border wishes he could escape, but there's nowhere for him to run. He and his little brother, Riddle, have spent their entire lives constantly uprooted by their unstable father. That is, until Sam sees Emily. That's when everything changes.As Sam and Riddle are welcomed into the Bells' lives, they witness the warmth and protection of a family for the first time. But when tragedy strikes, they're left fighting for survival in the desolate wilderness, and wondering if they'll ever find a place where they can belong. Beautifully written and emotionally profound, I'll Be There is a gripping story that explores the complexities of teenage passions, friendships, and loyalties.I'LL BE THERE has 14 U.S.A. / Little, BrownEngland/Picadilly PressBrazilian Portuguese / Novo ConceitoGerman / Arena VerlagHebrew / KinneretDutch / QueridoFrench / GallimardSimplified Chinese / Hachette-PheonixSwedish / B. WahlstromsFinland / WSOYSpanish / Ediciones SMCatalan / CruillaKorean / GaeAm NaMuTurkish / Detay YayincilikIt has been honored * The Children's Literature Council of Southern California 2012 Award for Best YA Fiction* YALSA Best Books for Young Adults (2012)* A Los Angeles Library Best Book For Teens (2012)* Milwaukee County Teen Book Finalist (2011)* Chicago Public Library Best of the Best (2012)* Field Family Foundation Teen Author Pick --  Free Public Library Philadelphia 2011* Rahn Emanuel's Reader - Chiciago Public Library Teen Book for July 2012* Finalist State of South Dakota -- Teen Book of the year 2012-2013* Finalist State of Missouri -- Teen Book of the Year 2012-2013* Finalist State of Arkansas -- Teen Book of the Year 2012 - 2013",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary",
    "Realistic Fiction",
    "Fiction",
    "Teen",
    "Family"
  ],
  "author": "Holly Goldberg Sloan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13153167-i-ll-be-there"
}