{
  "title": "Jerusalem Delivered",
  "description": "Arguably the greatest Italian poet after Dante, Torquato Tasso was born in Sorrento in 1544 and died in Rome in 1595, having served as the court poet in Ferrara, been confined for years in a madhouse after attacking a servant with a knife, and composed one of the great works of Renaissance literature. Unjustly neglected today, Tasso's epic poem 'Jerusalem Delivered' (first published in 1581) is set in the 11th century and tells the story of the First Crusade and the siege which gave Christian armies control over Jerusalem and the Holy Lands for a time.As in other epic poems, 'Jerusalem Delivered' deftly mixes history and myth. Tasso's heroes - Godfrey, leader of the Christian armies; Rinaldo, bravest of the Christian warriors; and Tancred, the Italian prince who falls in love with the pagan warrioress Clorinda, whom he eventually (and simultaneously) converts and kills - must face not only the Saracens and their allies, but also a host of fearsome and manipulative devils, demons, and sorcerers. This is a sweeping and often thrilling tale of war, faith, love, and sex that easily rivals its classical predecessors. Writing at a time when Christianity was bitterly divided, Tasso was naturally concerned with the nature of leadership and loyalty, with the importance of sacrifice, with the evils of corruption, and with the existence of truth, themes that continue to resonate today. No wonder that for three centuries, 'Jerusalem Delivered' was considered the great modern epic. Indeed, Spenser borrowed scenes and episodes from this poem in writing the 'Faerie Queen', and Milton was greatly influenced by Tasso when writing his own Christian epic, 'Paradise Lost'.English-language readers who are familiar with Tasso's grand romance have until now known it only through a verse translation by English poet Edward Fairfax published in 1600. In order to fit Tasso's stanzas into the then popular Spenserian verse form, Fairfax had to alter the original poem considerably. Now, 400 years later, Anthony Esolen presents a new translation that transforms 'Jerusalem Delivered' into an English-language masterpiece. The first major verse translation into English since Fairfax's, Esolen's version is both more true to its original source and more fluid than that of his Elizabethan predecessor. Esolen has translated 'Jerusalem Delivered' with the care of poet, capturing the delight of Tasso's descriptions, the different voices of its cast of characters, the shadings between glory and tragedy, and does them all in an English as powerful as Tasso's Italian. Esolen's will immediately be acclaimed as the definitive translation of this powerful work of faith and war. Like the Fagles 'Iliad' and 'Odyssey', the Pinsky 'Inferno', and Seamus Heaney's imaginative new rendering of 'Beowulf', Anthony Esolen's bold, fast-moving, and faithful translation of Tasso's Crusade-era adventure will introduce a new generation of readers to a masterpiece of world literature.",
  "genres": [
    "Poetry",
    "Classics",
    "Italian Literature",
    "Fiction",
    "Italy",
    "Epic",
    "Literature"
  ],
  "author": "Torquato Tasso",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/875623.Jerusalem_Delivered"
}