{
  "title": "Highland Master",
  "description": "When eighteen-year-old Lady Catriona Mackintosh discovers a wounded man in the forest near her Highland home, little does she know that he has sworn a sacred oath to kill her father and other members of the powerful Highland confederation known as Clan Chattan. Nor does she realize that she has met her soul mate. Independent, competent, intelligent, fiercely proud of her heritage, determined always to live near her own family, and known to her family as the \"wee wildcat\" because of her quick temper, Catriona is the daughter of a Highland chieftain and granddaughter of the even more powerful Chief (or Captain) of Clan Chattan. But her life changes forever when she persuades Sir Finlagh Cameron to return with her to her home to recover from his wounds. Sir Finlagh \"Fin\" Cameron is on a mission for the heir to Scotland's throne, who has sent him to the Highlands to persuade the Chief of Clan Chattan to arrange a secret meeting for him with two other great lords (the Lord of the Isles and the Lord of the North). Until Fin meets Catriona, however, he has no idea that her father was the Clan Chattan war leader who led them in the battle that wiped out many of Clan Cameron's best warriors, including Fin's own father. The sole survivor of that battle, Fin accepted a bequest of vengeance from his dying father, providing him with a dilemma to face as he begins to fall in love with Catriona. He is not the only one enticed by her charms, either. There are two other contenders, one of whom is his own master, the heir to Scotland's throne. With royal mischief afoot, if Catriona and Fin are ever to find happiness, they must first avoid disaster that could change Scotland's history, and find ways to be open and honest with each other.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Scotland",
    "Historical Fiction",
    "Fiction",
    "Medieval"
  ],
  "author": "Amanda Scott",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/8762441-highland-master"
}