{
  "title": "Greetings from Below",
  "description": "Winner of the Mary McCarthy Prize in short fiction, selected by David Means, and the University of Nevada's Silver Pen Award.What would have become of Nick Adams if he'd been born along the ragged edges of a new American city, one with more churches per capita than any other, and twice the suicide rate? Meet Nick Danze, the main character of David Philip Mullins's vital debut collection, Greetings from Below . The opening story finds fourteen-year-old Nick and his pal Kilburg sitting in the Las Vegas desert, drinking whiskey from Kilburg's fake leg. It's the first of many shocks in Nick's sexual education, which begins with a kiss from Kilburg he calls \"practice.\" In later stories, Nick hires a call girl, visits a swingers' club on Christmas Eve, obsesses over obese middle-aged women, and meets the love of his life, Annie, only he's not sure he loves her and he's compulsively unfaithful. Ashamed of his behavior, he stubbornly repeats it. And lurking behind it all is Vegas, with its gilded casinos, neon-tinted suburbs, and dingy, outer-ring strip clubs. In Nick's wounded honesty and queasy self-consciousness, Mullins awakens us to the perverse power of alienation and shame.\"Mullins writes about these journeys, and about sex and the desert, with a wonderful, edgy lucidity. Greetings from Below is a remarkable debut.\"––Margot LiveseyDavid Philip Mullins grew up in Las Vegas, Nevada, and is a graduate of the Iowa Writers’ Workshop. His stories have appeared in The Yale Review, The Massachusetts Review, New England Review, Cimarron Review, Fiction, Ecotone , and Folio . He has received awards from Yaddo and the Sewanee Writers’ Conference and lives in Omaha, Nebraska, with his wife and two children, where he teaches writing and literature at Creighton University.",
  "genres": [
    "Fiction",
    "Short Stories"
  ],
  "author": "David Philip Mullins",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/8774095-greetings-from-below"
}