{
  "title": "The Democratization of American Christianity",
  "description": "In this prize-winning book Nathan O. Hatch offers a provocative reassessment of religion and culture in the early days of the American republic, arguing that during this period American Christianity was democratized and common people became powerful actors on the religious scene. Hatch examines five distinct traditions or mass movements that emerged early in the nineteenth century—the Christian movement, Methodism, the Baptist movement, the black churches, and the Mormons—showing how all offered compelling visions of individual potential and collective aspiration to the unschooled and unsophisticated. \"Rarely do works of scholarship deserve as much attention as this one. The so-called Second Great Awakening was the shaping epoch of American Protestantism, and this book is the most important study of it ever published.\"—James Turner, Journal of Interdisciplinary History \"The most powerful, informed, and complex suggestion yet made about the religious, political, and psychic 'opening' of American life from Jefferson to Jackson. . . . Hatch's reconstruction of his five religious mass movements will add popular religious culture to denominationalism, church and state, and theology as primary dimensions of American religious history.\"—Robert M. Calhoon, William and Mary Quarterly \"Hatch's revisionist work asks us to put the religion of the early republic in a radically new perspective. . . . He has written one of the finest books on American religious history to appear in many years.\"—James H. Moorhead, Theology Today The manuscript version of this book was awarded the 1988 Albert C. Outler Prize in Ecumenical Church History from the American Society of Church History Awarded the 1989 book prize of the Society for Historians of the Early American Republic for the best book in the history of the early republic (1789-1850) Co-winner of the 1990 John Hope Franklin Publication Prize given by the American Studies Association for the best book in American Studies Nathan O. Hatch is professor of history and vice president for Graduate Studies and Research at the University of Notre Dame.",
  "genres": [
    "History",
    "Religion",
    "American History",
    "Church History",
    "Nonfiction",
    "Theology",
    "Christianity"
  ],
  "author": "Nathan O. Hatch",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/877088.The_Democratization_of_American_Christianity"
}