{
  "title": "The Navajo People and Uranium Mining",
  "description": "The Navajo Nation covers a vast stretch of northeastern Arizona and parts of New Mexico and Utah. The area is also home to more than one thousand abandoned uranium mines and four former uranium mills, a legacy of the U.S. nuclear program. In the early 1940s the Navajo Nation was in the early stages of economic development, recovering from the devastating stock reduction period of 1930. Navajo men sought work away from the reservation on railroads and farm work in Phoenix and California. Then came the nuclear age and uranium was discovered on the reservation. Work became available and young Navajo men grabbed the jobs in the uranium mines. The federal government and the mining companies knew of the hazards of uranium mining; however, the miners were never informed. They had to find out about the danger on their own. When they went to western doctors, they were diagnosed with lung cancer and were simply told they were dying. A team of Navajo people and supportive whites began the Navajo Uranium Miner Oral History and Photography Project from which this book arose. That project team, based at Tufts University School of Medicine in Boston, recruited the speakers who told their stories, which are reproduced here. There are also narrative chapters that assess the experiences of the Navajo people from diverse perspectives (history, psychology, culture, advocacy, and policy). While the points of view taken are similar, there is a range of perspectives as to what would constitute justice. REMEMBRANCE TO AVOID AN UNWANTED FATE by Navajo Nation President Joe Shirley, Jr. Sixty years ago, the United States turned to the tiny atom to unleash the most destructive force known to mankind and bring an end to World War II. Ironically, the uranium used to create the most technologically advanced weapon ever invented came from the land of the most traditional indigenous people of North America, and was dug from the earth with picks and shovels. Nuclear weapons transformed the United States into the greatest military force the world has ever known, and the term \"Super Power\" was coined. Lost in the history of this era is the story of the people -- the Diné -- who pulled uranium out of the ground by hand, who spoke and continue to speak an ancient tongue, and who pray with sacred corn pollen at dawn for good things for their families. By the thousands, these were, and remain, the forgotten victims of America's Cold War that uranium spawned. The Navajo People and Uranium Mining is the documented history of how these Navajo people lived, how they worked and now, sadly, how they died waiting for compassionate federal compensation for laboring in the most hazardous conditions imaginable, and which were known at the time yet concealed from them. These Navajo miners and their families became, in essence, expendable people. Today, the Navajo Nation, with the help of law firms, environmental groups, writers, photographers and historians, is doing all it can to correct this horrendous wrong done to Navajo uranium miners, their families and their descendents. This excellent book allows the people who lived this to tell their story in their own words. Genocide. There is no other word for what happened to Navajo uranium miners. The era of uranium mining on Navajoland was genocidal because the hazards of cancer and respiratory disease were known to doctors and federal officials, and yet they allowed Navajos to be exposed to deadly radiation to see what would happen to them. As a result, radiation exposure has cost the Navajo Nation the accumulated wisdom, knowledge, stories, songs and ceremonies -- to say nothing of the lives -- of hundreds of our people. Now, aged Navajo uranium miners and their families continue to fight the Cold War in their doctors' offices as they try to understand how the invisible killer of radiation exposure left them with many forms of cancer and other illnesses decades after leaving the uranium mines. No one ever told them that mining uranium would steal their health and cripple their lives when they became grandparents. But it did. They continue to leave us to this day only because they were the ones who answered the call. Because of this painful history, in 2005 the Navajo Nation passed the Diné Natural Resources Protection Act. This law prohibits uranium mining and processing in all its forms on Navajoland. It protects our land and our water from being contaminated as it was in the past. Despite our sovereignty and our will, there are those today who still seek to weaken our resolve in order to gain access to the uranium under our land just to enrich themselves. Only the telling of this story, as The Navajo People and Uranium Mining does so excellently, can protect us from this unwanted fate and a repeat of one of the more sorrowful periods of the Navajo Nation's history.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Doug Brugge",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/877538.The_Navajo_People_and_Uranium_Mining"
}