{
  "title": "Barrow's Boys: The Original Extreme Adventurers: A Stirring Story of Daring Fortitude and Outright Lunacy",
  "description": "Barrow's Boys is a spellbinding account of perilous journeys to uncharted areas under the most challenging conditions. Re-creating the successes and harrowing failures of the original extreme adventurers, Fergus Fleming captures the incredibly brave, and often downright insane, passion for exploration that led a band of men into situations that would humble even the bravest adventurers today.These men served under John Barrow, Second Secretary to the Admiralty, who, after the Napoleonic wars, launched the most ambitious program of exploration the world has ever seen. For the next thirty years, his handpicked teams of elite naval officers scoured the globe on a mission to fill the blanks that littered the atlases of the day.From the first disastrous trip down the Congo, in search of the Niger River, Barrow maintained his resolve in the face of continuous catastrophes. His explorers often died of sickness or at the hands of unfriendly natives, and they struggled under minuscule budgets that forced them to resort to pulling enormous ships across floating ice fields; to eating mice, raw meat, or their own shoes; and even to horrifying acts of cannibalism.While many of the journeys failed entirely, Barrow and his men ultimately opened Africa to the world, discovered Antarctica, and pried apart the mandibles of the Arctic. Many of the missions have gone down among the greatest in history, yet they have never before been collected into one volume that captures the full sweep of Barrow's program. Beyond their own renowned discoveries, Barrow's officers inspired scores of men, from Livingstone to Shackleton, to continue the incredible quest for knowledge well into the twentieth century.Never again would such a disparate and entertaining band of explorers stalk the world.",
  "genres": [
    "History",
    "Nonfiction",
    "Adventure",
    "Travel",
    "19th Century",
    "World History",
    "Africa"
  ],
  "author": "Fergus Fleming",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/878082.Barrow_s_Boys"
}