{
  "title": "Revival: The Struggle for Survival Inside the Obama White House",
  "description": "Revival is the dramatic inside story of the defining period of the Obama White House. It is an epic tale that follows the president and his inner circle from the crisis of defeat to historic success. Over the span of an extraordinary two months in the life of a young presidency, Obama and his senior aides engaged in a desperate struggle for survival that stands as the measure of who they are and how they govern. Bestselling Obama biographer Richard Wolffe draws on unrivaled access to the West Wing to write a natural sequel to his critically acclaimed book about the president and his campaign. He traces an arc from near death to resurrection that is a repeated pattern for Obama, first as a candidate and now as president. Starting at the first anniversary of the inauguration, Wolffe paints a portrait of a White House at work under exceptional strain across a sweeping set of from health care reform to a struggling economy, from two wars to terrorism. Revival is a road map to understanding the dynamics, characters, and disputes that shape the Obama White House. It reveals for the first time the fault lines at the heart of the West Wing between two groups competing for control of the president’s agenda. On one side are the Revivalists, who want to return to the high-minded spirit of the presidential campaign. On the other side are the Survivalists, who believe that government demands a low-minded set of compromises and combat. At the center of this compelling story is a man who remains opaque to supporters, staff, and critics alike. What motivates him to risk his presidency on health care? What frustrations does he feel at this incredible time of testing? Written by the author who knows Obama best, Revival is a frank and intimate account of a president struggling to adapt, enduring failure, and outfoxing his foes. It is a must-read volume, full of exclusive insights into the untold and unfinished story of a new force in world politics.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Us Presidents",
    "Political Science",
    "Audiobook",
    "Presidents"
  ],
  "author": "Richard Wolffe",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/8780329-revival"
}