{
  "title": "Tommy's Honor: The Story of Old Tom Morris and Young Tom Morris, Golf's Founding Father and Son",
  "description": "In the tradition of Seabiscuit, the riveting tale of twoproud Scotsmen who beat all comers to become the heroesof a golden age—the dawn of professional golf  Bringing to life golf’s founding father and son, Tommy’s Honor is a stirring tribute to two legendary players and a vivid evocation of their colorful, rip-roaring times.  The Morrises were towering figures in their day. Old Tom, born in 1821,began life as a nobody— he was the son of a weaver and a maid. But he was born in St. Andrews, Scotland, the cradle of golf, and the game was in his blood. He became the Champion Golfer of Scotland, a national hero who won tournaments (and huge bets) while his young son looked on. As “Keeper of the Green” at the town’s ancient links, Tom deployed golf’s first lawnmower and banished sheep from the fairways.  Then Young Tommy’s career took off. Handsome Tommy Morris, the Tiger Woods of the nineteenth century, was a more daring player than his father. Soon he surpassed Old Tom and dominated the game. But just as he reached his peak—with spectators flocking to see him play— Tommy’s life took a tragic turn, leading to his death at the age of twenty-four. That shock is at the heart of Tommy’s Honor. It left Tom to pick up the pieces—to honor his son by keeping Tommy’s memory alive.  Like the New York Times bestseller The Greatest Game Ever Played, Tommy’s Honor is both fascinating history and a moving personal saga. Golfers will love it, but this book isn’t only for golfers. It’s for every son who has fought to escape a father’s shadow and for every father who had guided a son toward manhood, then found it hard to let him go.",
  "genres": [
    "Sports",
    "Biography",
    "Nonfiction",
    "History",
    "Autobiography",
    "Historical",
    "Scotland"
  ],
  "author": "Kevin Cook",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/877795.Tommy_s_Honor"
}