{
  "title": "Perking the Pansies - Jack and Liam move to Turkey",
  "description": "Jack and Liam, fed up with kiss-my-arse bosses and nose-to-nipple commutes, quit their jobs and move to a small town in Turkey. Join the culture-curious gay couple on their bumpy rite of passage in a Muslim country. Meet the oddballs, VOMITs, vetpats, emigreys, semigreys, debauched waiters and middle England miseries.When bigotry and ignorance emerge from the crude underbelly of Turkey's expat life, Jack and Liam waver. Determined to stay the course, the happy hedonistas hitch up their skirts, move to the heart of liberal Bodrum and fall in love with their intoxicating foster land. Enter Jack's irreverent world for a right royal dose of misery and joy, bigotry and enlightenment, betrayal and loyalty, friendship, love, earthquakes, birth, adoption and a senseless murder. Perking the Pansies will make you laugh out loud one minute and sob into your crumpled tissue the next.\"Scott pulls no punches. A good read and hopefully the first of many by new boy on the block.\" Jane Akatay, journalist\"An insightful tale of life abroad - with a twist - from the pen of a serial people watcher. Expat Jack lays his characters bare along with his heart and soul, ''Kym Ciftci, On the Ege Magazine, Ontheege.com\"Jack and Liam bring a certain je ne sais quoi to the souks and heap a plate of dry British wit to their Ottoman misadventures,\"Charles Ayres, author, Impossibly Glamorous Impossiblyglamorous.com..\". hilarious, saucy, witty, heartwarming and incredibly moving, Perking the Pansies is chock full of odd characters and odder situations. Jack Scott has a way with words and proves that it is the relationships we surround ourselves with that matter most,\"Linda A Janssens, Writer and Co-Author, Turning Points, Adventuresinexpatland.com",
  "genres": [
    "Travel",
    "Nonfiction",
    "Environment",
    "LGBT"
  ],
  "author": "Jack  Scott",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/13154192-perking-the-pansies---jack-and-liam-move-to-turkey"
}