{
  "title": "The Free World",
  "description": "A New York Times Notable Book for 2011 \n\nA Globe and Mail Best Books of the Year 2011 Title\n\nSummer, 1978. Brezhnev sits like a stone in the Kremlin, Israel and Egypt are inching towards peace, and in the bustling, polyglot streets of Rome, strange new creatures have appeared: Soviet Jews who have escaped to freedom through a crack in the Iron Curtain. Among the thousands who have landed in Italy to secure visas for new lives in the West are the members of the Krasnansky family — three generations of Russian Jews. \nThere is Samuil, an old Communist and Red Army veteran, who reluctantly leaves the country to which he has dedicated himself body and soul; Karl, his elder son, a man eager to embrace the opportunities emigration affords; Alec, his younger son, a carefree playboy for whom life has always been a game; and Polina, Alec's new wife, who has risked the most by breaking with her old family to join this new one. Together, they will spend six months in Rome — their way station and purgatory. They will immerse themselves in the carnival of emigration, in an Italy rife with love affairs and ruthless hustles, with dislocation and nostalgia, with the promise and peril of a new life. Through the unforgettable Krasnansky family, David Bezmozgis has created an intimate portrait of a tumultuous era.\nWritten in precise, musical prose, The Free World is a stunning debut novel, a heartfelt multigenerational saga of great historical scope and even greater human debth. Enlarging on the themes of aspiration and exile that infused his critically acclaimed first collection, Natasha and Other Stories, The Free World establishes Bezmozgis as one of our most mature and accomplished storytellers.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Canada",
    "Jewish",
    "Italy",
    "Russia",
    "Contemporary"
  ],
  "author": "David Bezmozgis",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/8801805-the-free-world"
}