{
  "title": "If I Don't Write it Nobody Else Will",
  "description": "The long awaited story of one of Britain's greatest comic legends. 'Some people walk on stage and the audience warms to them. You can't explain it, and you shouldn't try. It's an arrogant assumption to say you 'decide' to become a comedian. The audience decides for you.' Eric Sykes, December 2001 From his early days writing scripts for Bill Fraser and Frankie Howerd through decades of British radio and television comedy - 'Educating Archie', 'Sykes And A ...', 'Curry and Chips', 'The Plank' - to his present day ventures into film and theatre, starring in 'The Others' with Nicole Kidman and appearing in Peter Hall's recent production of 'As You Like It', Eric Sykes has carved himself an enduring place as one of Britain's greatest writers and performers. In his much anticipated autobiography, Sykes reveals his extraordinary life working alongside a generation of legendary comedians and entertainers, despite being dogged by deafness and eventually virtual blindness. His hearing problems began in the early days of his career in the 1950s, around the time he wrote, directed and performed in the spoof pantomime 'Pantomania' for the BBC. Undeterred however, Sykes learned to lip-read, going on to write and appear in a number of BBC productions including 'Opening Night' and Val Parnell's 'Saturday Spectacular', the first of two shows he made with Peter Sellers, a great life-long friend. From 1959 until her death in 1980, Syke's starred with Hattie Jacques in one of Britain's best loved sitcoms 'Sykes and A ...' Throughout the two decade run of this show he continued to work alongside a host of stars including Charlie Drake, Tommy Cooper, Tony Hancock, Spike Milligan, Johnny Speight, Ray Galton and Alan Simpson. Eric Sykes's comedy has always sported an essential core of warm humanity and this, along with his genuine creative genius, continues to prove an unforgettably winning combination.",
  "genres": [
    "Biography",
    "Autobiography",
    "Nonfiction",
    "Comedy",
    "Humor"
  ],
  "author": "Sykes",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/880614.If_I_Don_t_Write_it_Nobody_Else_Will"
}