{
  "title": "The Last Full Measure: How Soldiers Die in Battle",
  "description": "In this brilliantly researched, deeply humane work of history, Michael Stephenson traces the paths that have led soldiers to their graves over the centuries, revealing a wealth of insight about the nature of combat, the differences among cultures, and the unchanging qualities of humanity itself.Behind every soldier’s death lies a story, a tale not just of the cold mathematics of the battlefield but of an individual human being who gave his life. What psychological and cultural pressures brought him to his fate? What lies—and truths—convinced him to march toward his death? Covering warfare from prehistory through the present day, The Last Full Measure tells these soldiers’ stories, ultimately capturing the experience of war as few books ever have.In these pages, we march into battle alongside the Greek phalanx and the medieval foot soldier. We hear gunpowder’s thunder in the slaughters of the Napoleonic era and the industrialized killing of the Civil War, and recoil at the modern, automated horrors of both World Wars. Finally, we witness the death of one tradition of “heroic” combat and the construction of another in the wars of the modern era, ranging from Vietnam to America’s latest involvements in Iraq and Afghanistan.In exploring these conflicts and others, Stephenson draws on numerous sources to delve deep into fascinating, period-specific detail—tracing, for instance, the true combat effectiveness of the musket, the utility of the cavalry charge, or the vulnerabilities of the World War II battle tank. Simultaneously, he examines larger themes and reveals surprising connections across both time and culture. What does the medieval knight have in common with the modern paratrooper? What did heroism and bravery mean to the Roman legionary, or to the World War I infantryman—and what is the true motivating power of such ideals? How do men use religion, friendship, or even nihilism to armor themselves against impending doom—and what do we as human beings make of the undeniable joy some among us take in the carnage?Combining commanding prose, impeccable research, and a true sensitivity to the combatant’s plight, The Last Full Measure is both a remarkably fresh journey through the annals of war and a powerful tribute to the proverbial unknown soldier.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "War",
    "Military History",
    "World History",
    "The World"
  ],
  "author": "Michael Stephenson",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/13154904-the-last-full-measure"
}