{
  "title": "Against Equality: Queer Critiques of Gay Marriage",
  "description": "While what feels like the entirety of the gay and lesbian movement is marching in unison towards some vague notion of equality, the Against Equality collective has been quietly assembling a digital archive to document the critical resistance to the politics of inclusion. This pocket-sized book of archival texts lays out some of the historical foundations of queer resistance to the gay marriage mainstream alongside more contemporary inter-subjective critiques that deal directly with issues of race, class, gender, citizenship, age, ability, and more. In portable book form, the critical conversations that are happening so readily on the internet will no longer be withheld from those with little to no online access like queer and trans prisoners, people of low income, rural folks and the technologically challenged. Contributors include Kate Bornstein, Eric Stanley, Dean Spade, Craig Willse, Kenyon Farrow, Kate Raphael, Deeg, John D’Emilio, Ryan Conrad, Yasmin Nair, Martha Jane Kaufman, Katie Miles, and Mattilda Bernstein Sycamore.- - -\"Against Equality makes the powerful argument that same-sex marriage is an essentially conservative cause, an effort to prop up a fundamentally unfair system. As an alternative, it offers us the inspiring vision of a truly radical queer politics, devoted to attacking injustice, not just allowing a few more gay people to benefit from it.\" – Walter Benn Michaels, The Trouble with Diversity: How We Learned to Love Identity and Ignore Inequality\"Rather than being merely anti-marriage, the book deliberately articulates multiple alternative visions – such as building and valuing our own grassroots familial 'networks of accountability' – thus edging us closer to true 'equality,' or dare I say liberation, celebrating our differences as queers. – Jessica Max Stein (Make/Shift Magazine)\"A powerful, moving read from a side often overlooked by mainstream society. A must read for anyone 'for' or 'against' gay marriage.\" – Steve Mason (California State Inmate/Queer Librarian)[This Anthology] brings to light that a venomous black-and-white rhetorical split has developed on gay marriage. The dichotomous engagement with the issue is damaging to the cohesion of the GLBTQ community and stops discussions short. This collection offers valuable, if controversial, much needed nuance to a radically fractured debate.\" – Ericka Steckle (Bitch Magazine)",
  "genres": [
    "Queer",
    "Nonfiction",
    "LGBT",
    "Politics",
    "Essays",
    "Theory",
    "Sexuality"
  ],
  "author": "Ryan Conrad",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/8801547-against-equality"
}