{
  "title": "Skipped Parts: A Novel",
  "description": "\" Skipped Parts is somewhere between The Catcher in the Rye and Even Cowgirls Get the Blues .\"- Los Angeles Times Book Review The novel that inspired the movie starring Mischa Barton and Drew Barrymore Banished to the hinterlands of Wyoming , rebellious Lydia Callahan and her thirteen-year-old son Sam have no choice but to cope. But while Lydia drinks and talks to the moose head on the wall, Sam finds a friend in local girl Maurey Pierce . Sam and Maurey set out to discover for themselves what happens in the \"skipped parts\" of the novels they read – between the first kiss and the next morning. With Lydia's support the two teens set out on their sexual exploration, and deal with its consequences. One of the wildest, raunchiest, most heartfelt coming-of-age novels of the past thirty years, Skipped Parts puts Tim Sandlin in the upper echelon of contemporary comic novelists. This contemporary novel is raunchy, funny, and full of heart, perfect for fans of Nick Hornby, Jack Kerouac, Tom Robbins, Larry McMurtry, Joseph Heller, John Irving, Kurt Vonnegut, Carl Hiaasen. Other books in Tim Sandlin's GroVant Skipped Parts, Book 1 Sorrow Floats, Book 2 Social Blunders, Book 3 Lydia, Book 4 What readers are saying about Skipped Parts : \"deals with coming of age in a humorous and often poignant way\" \" Plot twists that would make J.K. Rowling jealous , humor, beautifully drawn characters, a great sense for the detail of the West\" \" sometimes heartwarming, often heartbreaking \" \" poignant, FUNNY, SHOCKING, and even heartbreaking\" \"the deep humor comes from the extraordinary characters\" \"funny, sad, and full of heart \" What reviewers are saying about Skipped Parts : \" DAZZLING ...moving...Sam's carapace is humor...He thinks like Holden Caulfield and has Joseph Heller's take on despair . His Walter Mitty–like fantasies are tiny comic gems... In the end you'll find yourself rooting for Sam.\" - New York Times Book Review \"A lighthearted, amusing, and tender story of preteen wisdom, adult immaturity, and the fine line between...An offbeat, engaging novel.\" - Publisher's Weekly \"This witty, often touching portrayal of a dirt-street-wise youth's coming-of-age sparkles with intelligence.\" - Booklist \"Thoughtful, surprising, and delightful entertainment.\" - St. Louis Post-Dispatch What everyone is saying about Tim \"Tim Sandlin's stuff is as tight and funny as anyone doing this comedy novel thing.\" -Christopher Moore \"His prose, his characters, all amazing .\" \"A story of grand faux pas and dazzling dysfunction ...a wildly satirical look at the absurdities of modern life.\" - The New York Times Book Review",
  "genres": [
    "Fiction",
    "Young Adult",
    "Humor",
    "Contemporary",
    "Coming Of Age",
    "Romance",
    "Novels"
  ],
  "author": "Tim Sandlin",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/8808480-skipped-parts"
}