{
  "title": "Fresh from the Vegetarian Slow Cooker: 200 Recipes for Healthy and Hearty One-Pot Meals That Are Ready When You Are",
  "description": "For the millions of home cooks who swear by the ease and convenience of the slow cooker, this book provides a whole new array of healthy, delicious recipes - that don't rely on canned soup for flavor! And for the millions of vegetarians looking for simple, hearty fare, this book introduces them to the magic of slow cooking.Fresh from the Vegetarian Slow Cooker proves that slow cookers can be used for much more than just tough, inexpensive cuts of meat. They are perfect for vegetarian and healthy cooking because slow cooking is a foolproof way to make beans, grains, and root vegetables, in preparations such as Spicy White Bean and Sweet Potato Stew with Collards, Balsamic-Glazed Carrots and Parsnips, and Boston Brown Bread. Stuffed vegetables, such as Bell Peppers Stuffed with Couscous and Lentils, are moist and tender, with none of the oven's dryness. Even desserts, such as Chocolate Fantasy Fondue and Brandy-Laced Pear Brown Betty, are sensational.Chapters on appetizers, soups, stews, beans, vegetables, condiments, breakfasts, desserts, and beverages ensure that nothing is overlooked. A complete introduction provides information on all the latest advances in slow cooker models and accessories.By now the remarkable convenience of the slow cooker is no secret: it's practically a miracle to come home after a long day out and have dinner ready and waiting. It can be left unattended; it keeps the kitchen cool on warm days; and it's inexpensive and durable. At last, vegetarians and anyone looking for healthy meal alternatives can take full advantage of this amazing appliance.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference",
    "Vegetarian",
    "Vegan"
  ],
  "author": "Robin    Robertson",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/881348.Fresh_from_the_Vegetarian_Slow_Cooker"
}