{
  "title": "The World After WW1: 1918 - 1921",
  "description": "Starting in September 1918 and continuing through December 1921 my two Great Aunts and my Grandmother amassed an amazing amount of letters that chronicled the events of their world at the end of WW1. My Great Aunt, Rosalie O'Donnell, joined the Red Cross just at the time that WWI was ending. She was sent overseas, traveling through Uboat infested waters on the Orita with the other Red Cross workers. They reached England without incident and from there crossed the Channel into France. Rosalie's first Commission was in Bern Switzerland to meet the incoming trains bearing our just released POWs. Among them was Sgt. Edgar Hallyburton, the first American to be captured by the Germans. She entertained the family with her tales of learning to ski and climbing Swiss Alps, of taking tea with the Queen of Romania, fighting off fleas in Montenegro and watching General Pershing place the wreath on the tomb of the French unknown soldier. She tells of her friend, James Thurber, who she knows someday will become a famous author - she was right! There are stories of those fleeing into Romania from Russia and a baby boy left on their doorstep. She takes her family along as she visits unhealed battlefields, such as Verdun. In the meantime her sisters, located in St. Louis and Chicago, were keeping her up to date with not only the doings of friends and family but about everything else going on, ranging from the Black Sox baseball scandal, race riots, strikes, political affairs, the Irish question and Eamon DeValera, fashions, and the impact of the Spanish Flu. Celeste O'Donnell, in St. Louis, described the Silent picture shows, attending concerts given by Caruso, McCormack and the Vatican Choir. She wrote about the troops coming home and how 'a lump in one's throat' didn't allow for cheering as the first troops paraded through the streets of St. Louis. She wrote of births and weddings and heart-breaking deaths. Anna Mae Malin gave the news from Chicago. Anna Mae's were more family oriented but gave laugh-out-loud accounts of 'Miss Mitchell' the family car and of learning to drive. She describes an emotional charged Chicago when November 11 (and November 10) was celebrated. She complains about 'hobble skirts' and pointed shoes; and finding places to live becomes an ever increasing concern as rents continue to rise. It was as if they were writing a history book from the view point of middle class America - written as it happened - with no 'spin' historians adding their personal interpretations of past events as seen by today's standards. The letters detail not only history but genealogical information of people living in St. Louis, Chicago, as well as those working with the Red Cross overseas at the end of WW1.",
  "genres": [],
  "author": "Julie Chitwood",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/13155013-the-world-after-ww1"
}