{
  "title": "The Cowboy and His Elephant: The Story of a Remarkable Friendship",
  "description": "In the late 1980s, a female baby elephant was born into a herd that lived on the plains of southern Africa. Her mother has carried her for two years, and normally she would have nursed her for five more. But the close-knit family of wild elephants was to face a predator for which it was no match--humans. In a \"cull,\" her family was slaughtered in a few moments. Only the newborn female's life was spared. Terrified and bewildered the young elephant was transported to America to be sold. There she met the person who was to change her life forever.Bob Norris is a cowboy with an enormous empathy for animals that overwhelms his other emotions. He was raised with a pet bear and as a boy decided to become a real cowboy. He saw his dream come true in Colorado on one of the larger horse-and-cattle ranches in America. Handsome as a movie star, he became the Marlboro Man and appeared on TV and on billboards around the world. But with the passing of years, and with his own family grown up, he felt the need for something that he could not name.When she came into his life by happenstance, the hurt, vulnerable little elephant tapped the fullness of Bob's empathy, and an incredible bond between the most unlikely of friends was forged.Bob adopted the baby orphan elephant--named Amy--and patiently set about helping her recover from the trauma of her ordeal. He had never seen a real African elephant up close, except in zoos. He was a horseman and breeder of champion quarter horses. But through close observation, gentle training, humor, and endless perseverance, Bob gradually coaxed Amy into overcoming her mistrust of humans, and indeed, her fear of the world. The little elephant became a \"hand\" on Bob's ranch, tending to simple chores, riding the fences, and shadowing Bob on his horse. She developed a winning personality, and a strong character, and became a beloved member of the Norris family and partner to the ranch hands.But Bob knew from the start that the ultimate goal was for Amy to regain her confidence and her independence - even, if it were possible, to go back to the savannahs of Africa.This is the true story of how Amy and Bob came together. No one who reads The Cowboy and His Elephant can fail to be moved by such a simple tale of unlikely love.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Memoir",
    "Biography",
    "Nature",
    "Africa",
    "Wildlife"
  ],
  "author": "Malcolm MacPherson",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/8825733-the-cowboy-and-his-elephant"
}