{
  "title": "Hystories",
  "description": "This provocative and illuminating book charts the persistence of a cultural phenomenon. Tales of alien abduction, chronic fatigue syndrome, Gulf War syndrome, and the resurgence of repressed memories in psychotherapy are just a few of the signs that we live in an age of hysterical epidemics.As Elaine Showalter demonstrates, the triumphs of the therapeutic society have not been able to prevent the appearance of hysterical disorders, imaginary illnesses, rumor panics, and pseudomemories that mark the end of the millenium.Like the witch-hunts of the 1690s and the hypnotic cures of the 1980s, the hysterical syndromes of the 1990s reflect the fears and anxieties of a culture on the edge of change. Showalter highlights the full range of contemporary syndromes and draws connections to earlier times and settings, showing that hysterias mutate and are renamed; under the right circumstances, everyone is susceptible.Today, hysterical epidemics are not spread by viruses or vapors but by stories, narratives Showalter calls hystories that are created \"in the interaction of troubled patients and sympathetic therapists... circulated through self-help books, articles in newspapers and magazines, TV talk shows, popular films, the Internet, even literary criticism.\" Though popular stereotypes of hysteria are still stigmatizing, largely because of their associations with women, many of the most recent manifestations receive respectful and widespread coverage. In an age skeptical of Freud and the power of unconscious desires and conflicts, personal troubles are blamed on everything from devil-worshipping sadists to conspiring governments. The result is the potential for paranoia and ignorance on a massive scale.Skillfully surveying the condition of hysteria―its causes, cures, famous patients, and doctors―in the twentieth century, Showalter also looks at literature, drama, and feminist representations of the hysterical. Hysterias, she shows, are always with us, a kind of collective coping mechanism for changing times; all that differs are names and labels, and at times of crisis, individual hysterias can become contagious.Insightful and sensitive, filled with fascinating new perspectives on a culture saturated with syndromes of every sort, Hystories is a gift of good sense from one of our best critics.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Feminism",
    "History",
    "Science",
    "Gender",
    "Cultural"
  ],
  "author": "Elaine Showalter",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/881779.Hystories"
}