{
  "title": "The Doublet Affair",
  "description": "A tantalizing re-creation of Elizabethan life and manners told with intelligence and wit,\" raved Library Journal upon the publication of To Shield the Queen, the volume that introduced twenty-six-year-old Ursula Blanchard, Lady of the Presence Chamber to Queen Elizabeth I, and one of the most entrancing mystery heroines to come along in many a season. Young Ursula knows it can be treacherous easing herself into the petty foibles at court, but now, having once saved the Virgin Queen from political disaster, she faces an even greater challenge. Sortie of Ursula's old acquaintances may be plotting to overthrow Elizabeth in favor of Mary, Queen of Scots, and the re-establishment of the Catholic faith. Ardent, some would say fanatical, believers will stop at nothing -- smuggling, counterfeiting, civil war, perhaps murder -- to further their cause. One of Elizabeth's spies is already dead and the clues to his death point in a troubling direction. Most disturbing to Ursula is whether her old friends Ann and Leonard Mason could be mixed up in a treasonous plot against the Queen. There have been rumors that all is not as it should be with the Masons. Secretary of state Sir William Cecil needs his own spy in the Mason home and Ursula is the obvious choice, She knows the family, she can justify her visit by helping to care for the Masons' five children, and she can perhaps use her newly acquired skill at lockpiching to uncover some surprising truths. Torn between her devotion to Elizabeth, still a young woman like herself, and her longing to be reunited with her exiled Catholic husband, Matthew, in France, Ursula makes a difficult bargain that balances personal happiness against duty to Queen and country. Her journey takes her into dangerous territory eventually into the underground cells of the Tower of London itself Whatever happens, she will never again be quite as trusting or quite as secure.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "British Literature",
    "Audiobook"
  ],
  "author": "Fiona Buckley",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/882560.The_Doublet_Affair"
}