{
  "title": "Attracting Native Pollinators; Protecting North America's Bees and Butterflies",
  "description": "The recent decline of the European honey bee and other pollinators in North America poses a serious challenge to our food supply and ecological health. About 75 percent of all flowering plants rely on pollinators in order to set seed or fruit, and from these plants comes one-third of the planet's food.Attracting Native Pollinators is a comprehensive guidebook for gardeners, small farmers, orchardists, beekeepers, naturalists, environmentalists, and public land managers on how to protect and encourage the activity of the native pollinators of North America. Written by staff of the Xerces Society, an international nonprofit organization that is leading the way in pollinator conservation, this book presents a thorough overview of the problem along with positive solutions for how to provide bountiful harvests on farms and gardens, maintain healthy plant communinities in wildlands, provide food for wildlife, and beautify the landscape with flowers.Full-color photographs introduce readers to more than 80 species of native pollinators -- including bees, flies, butterflies, wasps, and moths -- noting each one's range and habits. The heart of the book provides detailed garden plans and techniques showing how to create flowering habitat to attract a variety of these pollinators, help expand the pollinator population, and provide pollinators with inviting nesting sites. Readers will also find useful instructions for creating nesting structures, educational activities for involving children, and an extensive list of resources. Attracting Native Pollinators is an essential reference book and action guide for anyone who is involved in growing food or is concerned about the future of our food supply.",
  "genres": [
    "Gardening",
    "Nature",
    "Nonfiction",
    "Science",
    "Reference",
    "Plants",
    "Animals"
  ],
  "author": "The Xerces Society",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/8823835-attracting-native-pollinators-protecting-north-america-s-bees-and-butte"
}