{
  "title": "38 Nooses: Lincoln, Little Crow, and the Beginning of the Frontier's End",
  "description": "In August 1862, after decades of broken treaties, increasing hardship, and relentless encroachment on their lands, a group of Dakota warriors convened a council at the tepee of their leader, Little Crow. Knowing the strength and resilience of the young American nation, Little Crow counseled caution, but anger won the day. Forced to either lead his warriors in a war he knew they could not win or leave them to their fates, he declared, “[Little Crow] is not a coward: he will die with you.” So began six weeks of intense conflict along the Minnesota frontier as the Dakotas clashed with settlers and federal troops, all the while searching for allies in their struggle. Once the uprising was smashed and the Dakotas captured, a military commission was convened, which quickly found more than three hundred Indians guilty of murder. President Lincoln, embroiled in the most devastating period of the Civil War, personally intervened in order to spare the lives of 265 of the condemned men, but the toll on the Dakota nation was still staggering: a way of life destroyed, a tribe forcibly relocated to barren and unfamiliar territory, and 38 Dakota warriors hanged—the largest government-sanctioned execution in American history. Scott W. Berg recounts the conflict through the stories of several remarkable characters, including Little Crow, who foresaw how ruinous the conflict would be for his tribe; Sarah Wakefield, who had been captured by the Dakotas, then vilified as an “Indian lover” when she defended them; Minnesota bishop Henry Benjamin Whipple, who was a tireless advocate for the Indians’ cause; and Lincoln, who transcended his own family history to pursue justice.Written with uncommon immediacy and insight, 38 Nooses details these events within the larger context of the Civil War, the history of the Dakota people, and the subsequent United States–Indian wars. It is a revelation of an overlooked but seminal moment in American history.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Native American",
    "Civil War",
    "Native Americans",
    "Native American History"
  ],
  "author": "Scott W. Berg",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/13155467-38-nooses"
}