{
  "title": "Vampire Wardens",
  "description": "The Vampire WardensVolume 1-3Three sexy vampire RomancesIn blood they will find destiny and the eternal bond of passion…Includes Hot Vampire Kiss, Hot Vampire Seduction, Hot Vampire Touch***Each also available for 99 cents each***Collection 75,000 wordsIn blood they will find destiny and the eternal bond of passion…HOT VAMPIRE The werewolf population is entrenched in a century long civil war, and now they are plagued by a virus that is turning wolves into killers. The Brooks brothers pursue one such rogue werewolf to Temple, Texas. It is in Temple that Evan encounters a beautiful nurse named Marissa who instantly melts the hundred years of ice running through his veins. When she is brutally attacked by the wolf, he breaks the rules of the Vampire Council and uses his blood to save her. Now, if he doesn’t kill the wolf by the next full moon, Marissa will become a killer wolf, and he will be sentenced to death.HOT VAMPIRE The underground vampire population of Austin, Texas has taken to hosting orgies with human women who've been forced to indulge in a new aphrodisiac.The drug, Blood Red, is a mixture of a rare type of werewolf blood and that of a vampire. Blood Red creates an insatiable desire for sex in the user to the point of pain in the absence of pleasure. Sometimes that pain leads to death.Vampire Warden, Aiden Brooks, has spent more than a hundred years enforcing the laws of his race, and life has taught him that anyone that he allows into his world ends up dead. Despite knowing this all too well, having painfully loved and lost in his past, when his search for the creator of Blood Red places coroner Kelly Riggs directly in both his path, and that of a dangerous clan of vampires, his desire for her goes well beyond offering her protection. He's drawn to her bravery, seduced by her feisty spirit and beauty, but he is determined to resist her, fearing he will put her in harms way. But Kelly is already on the radar of the enemy, and when she gets too close to the evil vampire clan's secrets, she is given Blood Red. Now Aiden's hunger for her might be the only thing that can keep her alive but who will save her from him?HOT VAMPIRE In blood they will find destiny and the eternal bond of passion…A Vampire Warden betrayed by a werewolf he loved, turned into something not Vampire or Wolf. The woman – the wolf – who will heal him…if he doesn’t destroy them both first.ABOUT THE The Wardens series begins with the three Brooks brothers, Evan (34), Aiden (32) and Taylor (28). They were early settlers of the town of Braunfels, Texas. When the town was haunted by a series of brutal animal attacks, that left a half-dozen townsmen murdered, the Brooks brothers took things into their own hands. Armed and ready for action, they set out into the wilderness, determined to find this animal and kill it. What they found was a female vampire who decided the brothers were scrumptious morsels, worth keeping around for a lifetime. She attacked the brothers and turned them to vampires.No sooner did she turn them, though, than another vampire appeared and killed her. This vampire declared himself a “Warden” of the Vampire Council. Wardens uphold the rules of the Vampire race and report to the Council. Killing a human is punishable by death and their ‘Maker’ had broken that rule. The brothers were then taken to the Council, where they were taught how to survive without killing, how to mingle with humans as if one of them, and when to move on from a location so that they would not be suspected as vampires. Most importantly, they learned who their enemies were and how to defeat them.In the end, the brothers were granted a financial dowry that had belonged to their Maker and given the choice of freedom, under Council rule, or an alternative—to become Wardens.Now, the brothers travel together as Wardens, tracking outlaw vampires, killing them and protecting innocent humans.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Novella",
    "Adult"
  ],
  "author": "Lisa Renee Jones",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/13155820-vampire-wardens"
}