{
  "title": "Dante's Equation: A Novel",
  "description": "In a breathless thriller that explores the relationship between science and the divine, good and evil, space and time, Jane Jensen takes us from the world we know into a reality we could only scarcely imagine. Until now.“Powerful . . . A combustible mixture of science and mysticism, a high-altitude thriller fizzing with intrigue.”—John Case, author of  The Eighth DayRabbi Aharon Handalman’s expertise with Torah code—rearranging words and letters in the Bible—has uncovered a man’s name. Who is Yosef Kobinski, and why did God hide his name in His sacred text? To find the answers, Aharon begins an investigation, and discovers that Kobinski, a Polish rabbi, was not only a mystic but also a brilliant physicist who authored what may be the most important lost work in human history.In Seattle, Jill Talcott’s work with energy wave equations is being linked to Yosef Kobinski, now deceased, who claimed nearly fifty years ago that he discovered an actual physical law of good and evil. But when Jill’s lab explodes, she is forced to flee for her life, realizing that her cutting-edge research is far more dangerous than she ever has imagined. And that powerful people have a stake in what she may have uncovered.Now Jill, her research partner, and a writer fascinated by Kobinski are about to meet Handalman in Poland—all four desperate to solve the astonishing riddle. Searching through the past, they trace Kobinski to a clearing in the woods near Auschwitz. And in that clearing they come face-to-face with the that Kobinski, drawing on his own alchemy of science and the Kabbalah, made himself vanish from the death camp in a blaze of fire. Now, with intelligence agents hot on their trail, the investigators have no choice. They must follow Kobinski—to wherever he may have gone. . . .",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Thriller",
    "Fantasy",
    "Suspense",
    "Religion",
    "Holocaust"
  ],
  "author": "Jane Jensen",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/882974.Dante_s_Equation"
}