{
  "title": "Hunter and Hunted: The Ed and Am Hunter Novels",
  "description": "Fredric Brown was a popular American pulp writer whose work appeared in mystery and science fiction magazines of the 1930s through the 1960s. Hunter and The Ed and Am Hunter Novels, Part One reprints four of his mystery novels that originally appeared in the period from 1947 to 1950. The novels included in chronological order in this volume -- The Fabulous Clipjoint, The Dead Ringer, The Bloody Moonlight, and Compliments of a Fiend – feature the uncle-and-nephew detective team of Ed and Ambrose Hunter, the only recurring characters in Brown’s longer fiction. The Fabulous Clipjoint was Brown’s first published novel and is as much a coming-of-age novel as it is a mystery novel. In the book, young Ed Hunter sets out to enlist his Uncle Ambrose’s aid in tracking down his father’s killer. In the process, Ed comes to terms with his upbringing in the slums of Chicago and finally escapes to a new life in the traveling carnival. The Dead Ringer finds Ed and his Uncle Am on the road in a creepy murder mystery filled with vivid descriptions and authentic slang from the bygone days of the carnival. The Hunters take on a job for the Starlock Detective Agency in The Bloody Moonlight, and Ed finds himself alone in a disturbing rural setting that seems to include werewolves and radio signals from the moons of Jupiter. Finally, in Compliments of a Fiend, Uncle Am himself becomes the victim in a race against time. The only clue to solving the mystery of his disappearance seems to be a passage in the works of paranormal investigator Charles Fort. Hunter and Hunted collects the early Ed and Am Hunter novels together in one volume for the first time ever. A second volume is planned that will collect the later novels and stories featuring the Hunters.",
  "genres": [
    "Fiction",
    "Crime",
    "Mystery"
  ],
  "author": "Fredric Brown",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/882934.Hunter_and_Hunted"
}