{
  "title": "Endgame: The Betrayal And Fall Of Srebrenica, Europe's Worst Massacre Since World War II",
  "description": "In 1993, the UN Security Council officially made Srebrenica the world's first UN-protected civilian safe area and stripped the town's Muslim defenders of their tanks and artillery. Two years later, Srebrenica fell after UN commanders turned down repeated requests for NATO air strikes to halt attacking Bosnian Serbs. As many as 7,000 Muslim men perished in mass executions or ambushes along a harrowing forty-mile flight one survivor called “The Marathon of Death.”In The Betrayal and Fall of Srebrenica, Europe's Worst Massacre Since World War II, Pulitzer Prize–winning author David Rohde follows the experiences of seven central characters—three Muslims in Srebrenica, two Dutch peacekeepers charged with defending the surrounded town, and two Serb Army soldiers attacking it—through the ten-day period that changed the course of the war in Bosnia and was arguably the darkest hour in United Nations history.Rohde exposes how the United States, France, Great Britain, the United Nations and the Bosnian government—out of incompetence or cynicism—allowed 40,000 Muslims to fall into the hands of their potential executioners. Part of an apparent Serb endgame to win the war, Srebrenica's fall ended up playing a crucial role in the Clinton administration's “endgame strategy” that halted the conflict. A new afterword by the author updates recent efforts to find the missing victims of Srebrenica and to apprehend and prosecute the executioners.The most comprehensive book to date on the subject, Endgame is a tale of cynical power politics in the post–Cold War era, a case study in genocide, and a disturbing testament to the power of propaganda and self-delusion.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Politics",
    "European History",
    "Historical",
    "Military Fiction"
  ],
  "author": "David Rohde",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/88341.Endgame"
}