{
  "title": "Embers Of War: The Fall of an Empire and the Making of America's Vietnam",
  "description": "The struggle for Vietnam occupies a central place in the history of the twentieth century. Fought over a period of three decades, the conflict drew in all the world’s powers and saw two of them—first France, then the United States—attempt to subdue the revolutionary Vietnamese forces. For France, the defeat marked the effective end of her colonial empire, while for America the war left a gaping wound in the body politic that remains open to this day.   How did it happen? Tapping into newly accessible diplomatic archives in several nations and making full use of the published literature, distinguished scholar Fredrik Logevall traces the path that led two Western nations to lose their way in Vietnam. Embers of War opens in 1919 at the Versailles Peace Conference, where a young Ho Chi Minh delivers a petition for Vietnamese independence to President Woodrow Wilson. It concludes in 1959, with a Viet Cong ambush on a U.S. outpost outside Saigon and the deaths of two American officers whose names would be the first to be carved into the black granite of the Vietnam Veterans Memorial. In between come years of political, military, and diplomatic maneuvering and miscalculation, as leaders on all sides embark on a series of stumbles that makes an eminently avoidable struggle a bloody and interminable reality.   Logevall takes us inside the councils of war—and gives us a seat at the conference tables where peace talks founder. He brings to life the bloodiest battles of France’s final years in Indochina—and shows how from an early point, a succession of American leaders made disastrous policy choices that put America on its own collision course with history: Harry Truman’s fateful decision to reverse Franklin Delano Roosevelt’s policy and acknowledge France’s right to return to Indochina after World War II; Dwight Eisenhower’s strenuous efforts to keep Paris in the fight and his escalation of U.S. involvement in the aftermath of the humiliating French defeat at Dien Bien Phu; and the curious turnaround in Senator John F. Kennedy’s thinking that would lead him as president to expand that commitment, despite his publicly stated misgivings about Western intervention in Southeast Asia.   An epic story of wasted opportunities and tragic miscalculations, featuring an extraordinary cast of larger-than-life characters, Embers of War delves deep into the historical record to provide hard answers to the unanswered questions surrounding the demise of one Western power in Vietnam and the arrival of another. This book will become the definitive chronicle of the struggle’s origins for years to come.Advance praise for Embers of War   “Fredrik Logevall has gleaned from American, French, and Vietnamese sources a splendid account of France’s nine-year war in Indochina and the story of how the American statesmen of the period allowed this country to be drawn into the quagmire.”—Neil Sheehan, author of A Bright Shining Lie, winner of the Pulitzer Prize and the National Book Award   “Fredrik Logevall is a wonderful writer and historian. In his new book on the origins of the American war in Vietnam, he gives a fascinating and dramatic account of the French war and its aftermath, from the perspectives of the French, the Vietnamese, and the Americans. Using previously untapped sources and a deep knowledge of diplomatic history, Logevall shows to devastating effect how America found itself on the road to Vietnam.”—Frances FitzGerald, author of Fire in the Lake, winner of the Pulitzer Prize and the National Book Award",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "American History",
    "Military History",
    "Asia",
    "Politics"
  ],
  "author": "Fredrik Logevall",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/13155847-embers-of-war"
}