{
  "title": "On Combat: The Psychology and Physiology of Deadly Conflict in War and in Peace",
  "description": "A brief, but insightful look at history shows the evolution of combat, the development of the physical and psychological leverage that enables humans to kill other humans, followed by an objective examination of domestic violence in America. The authors reveal the nature of the warrior, brave men and women who train their minds and bodies to go to that place from which others flee. After examining the incredible impact of a few true warriors in battle, On Combat presents new and exciting research as to how to train the mind to become inoculated to stress, fear and even pain. Expanding on Lt. Col. Grossman’s popular \"Bulletproof mind\" presentation, the book explores what really happens to the warrior after the battle, and shows how emotions, such as relief and self-blame, are natural and healthy ways to feel about having survived combat. A fresh and highly informative look at post traumatic stress syndrome (PTSD) details how to prevent it, how to survive it should it happen, how to come out of it stronger, and how to help others who are experiencing it.On Combat looks at the critical importance of the debriefing, when warriors gather after the battle to share what happened, critique, learn from each other and, for some, begin to heal from the horror. The reader will learn a highly effective breathing technique that not only steadies the warrior’s mind and body before and during the battle, but can also be used afterwards as a powerful healing device to help separate the emotion from the memory.Concluding chapters discuss the Christian/Judeo view of killing in combat and offers powerful insight that Lt. Col. Grossman has imparted over the years to help thousands of warriors understand and come to terms with their actions in battle. A final chapter encourages warriors to always fight for justice, not vengeance, so that their remaining days will be healthy ones filled with pride for having performed their duty morally and ethically.This information-packed book ploughs new ground in its vision, in its extensive new research and startling findings, and in its powerful, revealing quotes and anecdotes from top people in the warrior community, people who have faced the toxic environment of deadly combat and now share their wisdom to help others. On Combat is easy to read and powerful in scope. It is a true classic that will be read by new and veteran warriors for years to come.",
  "genres": [
    "Psychology",
    "Military Fiction",
    "Nonfiction",
    "War",
    "Martial Arts",
    "History",
    "Science"
  ],
  "author": "Dave Grossman",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/88431.On_Combat"
}