{
  "title": "Martha Peake: A Novel of the Revolution",
  "description": "A hypnotic tale of psychological suspense and haunting beauty. Set among the teeming streets and desolate wharves of Hogarth's London, then shifting to the powder-keg colony of Massachusetts Bay.Master storyteller Patrick McGrath--author of the critically acclaimed novel Asylum and a finalist for England's prestigious Whitbread Prize for fiction--once again spins a hypnotic tale of psychological suspense and haunting beauty. Set among the teeming streets and desolate wharves of Hogarth's London, then shifting to the powder-keg colony of Massachusetts Bay, Martha Peake envelops the reader in a world on the brink of revolution, and introduces us to a flame-haired heroine who will live in the imagination long after the last page is turned.Settled with our narrator beside a crackling fire, we hear of the poet and smuggler Harry Peake--how Harry lost his wife, Grace, in a tragic fire that left him horribly disfigured; how he made a living displaying his deformed spine in the alehouses of eighteenth-century London; and how his only solace was his devoted daughter, Martha, who inherited all of his fire but none of his passion for cheap gin. As the drink eats away at Harry's soul, it opens ancient wounds; when he commits one final act of unspeakable brutality, Martha, fearing for her life, must flee for the American colonies. Once safely on America's shores, Martha immerses herself in the passions of smoldering rebellion. But even in this land of new beginnings, she is unable to escape the past. Caught up in a web of betrayals, she redeems herself with one final, unforgettable act of courage.Superbly plotted and wholly absorbing, Martha Peake is an edge-of-your-seat shocker that is crafted with the psychological precision Patrick McGrath's fans have come to expect. A writer whose novels The New York Times Book Review has called both \"mesmerizing\" and \"brilliant,\" McGrath applies his remarkable imaginative powers to a fresh and broad historical canvas. Martha Peake is the poignant, often disturbing tale of a child fighting free of a father's twisted love, and of the colonists' struggle to free themselves from a smothering homeland. It is Patrick McGrath's finest novel yet.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Gothic",
    "British Literature",
    "Thriller",
    "Novels"
  ],
  "author": "Patrick McGrath",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/88384.Martha_Peake"
}