{
  "title": "The Boston Fracture",
  "description": "The discovery of a strange device abandoned on a remote beach in Puerto Rico puts FBI Agent Floyd Allister and CIA Master Spy Chance Flanagan on a race against a terrorist sleeper cell hiding in the US. Their pursuit takes them from the Middle East to South America and finally to Boston, Massachusetts, where Floyd and Chance discover that ruthless radical Islamists are planning to ram a suicide mini-submarine into a gas tanker to unleash an apocalyptic firestorm the size of a nuclear blast for the worst terrorist attack, ever.The details on the locations, the methods of the terrorists, the weapons of mass destruction, the underwater actions and the suicide submarines, and an environment that reveals the irreconcilable differences between two different worlds feel so real, it keeps the reader wondering what is coming next .\"Herve Jaubert has written a fast-paced, exciting, true-to-life thriller that has the side benefit of also conveying an important message about Islamist terrorism.\" Daniel Pipes, President of the Middle East Forum.\"Herve Jaubert has expertly penned this spine tingling suspense thriller. He takes the readers into the deep dark world of Muslim terrorists. This epic traverses the world uncovering this terrifying tale as only a former spy can describe. Never before has anyone exposed the inner workings of the minds behind these evil doers and what makes them tick.\" Jeff Probst, Jupiter Digital\"A thrilling and terrifying story, so real it could be happening tomorrow!\" Irina \"Captivating story and what an eye opening message!\" “How the war on terror leads to a war of the West against Islam.\" Craig William\"An FBI agent races against the clock in a spine-tingling attempt to thwart a horrific terrorist attack on Boston, Massachusetts.\" Michael W",
  "genres": [],
  "author": "Herve Jaubert",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13156210-the-boston-fracture"
}