{
  "title": "The White Cascade: The Great Northern Railway Disaster and America's Deadliest Avalanche",
  "description": "The never-before-told story of one of the worst rail disasters in U.S. history in which two trains full of people, trapped high in the Cascade Mountains, are hit by a devastating avalancheIn February 1910, a monstrous blizzard centered on Washington State hit the Northwest, breaking records. The world stopped--but nowhere was the danger more terrifying than near a tiny town called Wellington, perched high in the Cascade Mountains, where a desperate situation evolved minute by minute: two trainloads of cold, hungry passengers and their crews found themselves marooned without escape, their railcars gradually being buried in the rising drifts. For days, an army of the Great Northern Railroad's most dedicated men--led by the line's legendarily courageous superintendent, James O'Neill--worked round-the-clock to rescue the trains. But the storm was unrelenting, and to the passenger's great anxiety, the railcars--their only shelter--were parked precariously on the edge of a steep ravine. As the days passed, food and coal supplies dwindled. Panic and rage set in as snow accumulated deeper and deeper on the cliffs overhanging the trains. Finally, just when escape seemed possible, the unthinkable occurred: the earth shifted and a colossal avalanche tumbled from the high pinnacles, sweeping the trains and their sleeping passengers over the steep slope and down the mountainside.Centered on the astonishing spectacle of our nation's deadliest avalanche, The White Cascade is the masterfully told story of a supremely dramatic and never-before-documented American tragedy. An adventure saga filled with colorful and engaging history, this is epic narrative storytelling at its finest.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Book Club",
    "Survival",
    "Audiobook",
    "Historical"
  ],
  "author": "Gary Krist",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/88365.The_White_Cascade"
}