{
  "title": "Hunter's Moon",
  "description": "Doc Ford faces his greatest challenge ever, in the stunning new novel by the New York Times-bestselling writer.  Book after book, Randy Wayne White's audience and critical acclaim continue to grow. His most recent thriller, Dark Light, was \"one of his brightest novels\" (South Florida Sun-Sentinel), \"darkly marvelous\" (The Miami Herald), \"a compelling, readable tale in the justly celebrated Doc Ford series by one of this country's premier crime novelists\" (Booklist). With Hunter's Moon, White is ready to take another giant leap.  On a foggy, tropic October night, the full moon burning through the mist, I stopped paddling when I heard unexpected voices. Muted whispers, neither English nor Spanish, the voices of men moving in stealth. They shouldn't have been here. I shouldn't have been here. There were plausible explanations, but I didn't like any of them.  When Ford saves from assassination a controversial former president of the United States who is staying on an island off Florida's west coast, he has no idea what he's just let himself in for. J. C. Wilson knows that he has only a short time to live, and he has a full agenda. In seven days, the United States is planning a secret strike on a Central American oil-rich nation, and Wilson intends to intercede-but he'll need help from certain people. One of them is an old adversary, the former dictator of the targeted country, long since disappeared and rumored to be a recluse. Another is a former lover, a woman of considerable influence and mystery. And the third is Doc Ford . . . whether he likes it or not. . . .  Rich with passion and vivid, pungent prose and some of the best characters found in suspense fiction today, Hunter's Moon is White's most remarkable novel yet.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Audiobook",
    "Suspense",
    "Adventure"
  ],
  "author": "Randy Wayne White",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/88360.Hunter_s_Moon"
}