{
  "title": "The Estrogen Alternative: A Guide to Natural Hormonal Balance",
  "description": "With almost 100,000 copies sold in earlier editions, this revised edition provides the most up-to-date information on natural alternatives to synthetic hormone replacement therapyA must-read for any woman taking synthetic hormones for infertility, birthcontrol, PMS, or menopause• Includes the latest research on using natural progesterone to combat osteoporosis, endometriosis, heart disease, PMS, fibroids, and breast, ovarian, and uterine cancerMore and more women are seeking alternatives to synthetic hormones and their harmful side effects. Despite increasing awareness of the dangers of synthetic hormones, over-prescription of estrogen is still rampant, as is confusion among doctors and patients whether the benefits of conventional hormone replacement therapy (HRT) outweigh the risks.This updated fourth edition offers the latest information on how botanical progesterone therapy, also known as natural HRT, can provide safe, natural relief for many of the problems women face from hormone deficiency, including PMS, fibromyalgia, depression, menstrual irregularity, miscarriages, uterine fibroids, and infertility. Botanical progesterone supplementation can be also extremely effective in relieving hot flashes, insomnia, night sweats, vaginal dryness, and even cancer. The authors sift through misinformation and contradictory studies, warning against corporate-sponsored research in a multi-billion dollar menopausal industry, and guide readers to natural alternatives. This fourth edition also includes new studies regarding the dangers of a diet rich in soy contributing to the onset of premature menopause, as well as thyroid disorders. The dangers of mammography and the importance of focusing on safer, more effective methods of cancer detection are also well documented.",
  "genres": [
    "Health"
  ],
  "author": "Raquel  Martin",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/883706.The_Estrogen_Alternative"
}