{
  "title": "Who Said It Couldn't Be Done?",
  "description": "With privilege comes Responsibility. Those not up to the Responsibility do not deserve the privilege. -Hadassadajah C. Akusani \"The mother of James and John . . . brought them to Jesus and respectfully asked a favor. 'What is your request? he asked. She replied, 'In your kingdom, will you let my two sons sit on two thrones next to yours? 'But Jesus told her, 'You don't know what you are asking! Then he turned to James and John and asked them, 'Are you able to drink from the terrible cup I am about to drink from? 'Yes' they replied, 'we are able' 'You shall indeed drink from it, he told them. 'But I have no right to say who will sit on the thrones next to mine. These places are reserved for the persons my Father selects' . . . Jesus called the (other disciples) together and said, 'Among the heathen, kings are tyrants and each minor official lords it over those beneath him. But among you it is quite different. Anyone wanting to be a leader among you must be your servant. And if you want to be right at the top, you must serve like a slave. Your attitude must be like my own, for I, the Messiah, did not come to be served, but to serve, and to give my life as a ransom for many\" -Matthew 20:20-28 Here in this scenario, the mother of these two disciples of Jesus was not content that they were among his chosen twelve apostles. She wanted them to be granted special privilege of being seated on thrones beside the heavenly king! While Jesus remarked that that privilege of selection belonged to his Father, he taught a valuable lesson here in humility and responsibility. In the scenario above, the other ten disciples felt that James and John-if it was indeed their desire (and not merely that of the mother) had quite a nerve desiring such positions of prominence. Jesus, in his response, showed that with privilege comes awesome responsibility, and if one is not up",
  "genres": [],
  "author": "MS Denise Jones",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/8844935-who-said-it-couldn-t-be-done"
}