{
  "title": "Make Willing the Prey",
  "description": "Some fantasies start with a horror story.Before Sandy Windham became a faerie hunter, she started life as a lonely history major piled up to her elbows in books, facts, and the names of dead kings. She's the least likely person to believe in faeries. That's why she's caught the eye of Haun, a wicked faerie who's been put to an interesting Get a banal girl to marry him.At first Sandy is delighted to receive so many luxurious gifts from a secret admirer. All she has to do is play his silly little games. It's flattering and fun, and she hopes to one day meet this mysterious romantic. Before long the seduction turns chilling and Sandy wants the game to stop. By then it's too late. She and her friend Jina are ensnared in a web of illusions they may never be able to escape. Once upon a time, fairytales were scary. Now they are again. Make Willing the Prey is a horror novella, the prequel to Emerald City Dreamer. It will startle you into believing in draft fluttered the book open. It sped through some pages, while on others it slowed, as though it were looking for a specific paragraph.The pages stopped moving near the center of the book. Sandy leaned in to read the page, looking for some kind of meaning or reason. Before she could see a single word, the center of the book began filling with red. Not wax this time. Blood.The blood seeped upward from the center, absorbing into the white paper and crisp black words.\"What, did you get a little bored you sick f***?\" Sandy shouted at the ceiling. \"Decided it's time to play again?\"There was no answer. Instead, the edge of the pages, untouched by blood, began to rot. They crumbled with age, as though the book were bio-degrading before her eyes. The blood-soaked portion remained unchanged.Yet the blood continued to flow. It now pushed away brittle bits of paper. Dirtied and thickened with dust, it oozed gently onto the floor.\"We've done something wrong,\" Lewis whispered.Sandy smelled something dead. An acrid, nose biting smell. She looked up and around, sniffing, trying to find its direction. Jina had moved to her side, firelight shining on her face.Sandy looked back at the book and Jina screamed. The body of a green salamander twisted back and forth as it walked off the edge of the cloth binding. Tiny footprints of blood trailed behind it.\"Let's go. Now.\" Lewis pulled Jina towards the door. Sandy followed close behind.",
  "genres": [
    "Urban Fantasy",
    "Fae"
  ],
  "author": "Luna Lindsey",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/8848332-make-willing-the-prey"
}