{
  "title": "Ender's Game Series Short Stories: Ender's Game, a Young Man With Prospects, Investment Counselor, Ender in Flight, Mazer in Prison",
  "description": "This is nonfiction commentary. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Chapters: Ender's Game, a Young Man With Prospects, Investment Counselor, Ender in Flight, Mazer in Prison, the Gold Bug, the Polish Boy, Ender's Stocking, Cheater, Ender's Homecoming, Pretty Boy, Teacher's Pest. Source: Wikipedia. Free updates online. Not illustrated. Excerpt: \"Ender's Game\" is a story by Orson Scott Card. It first appeared in the August 1977 issue of Analog magazine and was later expanded into the novel Ender's Game. Although the foundation of the Ender's Game series, the short story is not properly part of the Ender's Game universe, as there are many discrepancies in continuity. This story begins as Ender Wiggin is made the commander of Dragon Army at Battle School, an institution designed to make young boys into military commanders to fight in the next interstellar war against an unspecified enemy. Armies are groups of students which fight mock battles in the Battle Room, a null gravity environment, and are subdivided into squads known as \"toons.\" Due to Ender's genius in leadership, Dragon Army goes on to dominate the competition, despite the teachers' attempts to put obstacles in their way. After his nineteenth consecutive victory, Ender is told that his Army is being broken up and his toon leaders promoted to be commanders in their turn, while he is being transferred to Command School for the next stage of his education. Here, a veteran named Mazer Rackham tutors him in the use of a space battle simulator. Eventually, many of his former toon leaders are brought along to serve under him once more. Once they are familiar with the simulator, they begin to fight a series of what Mazer tells them are mock battles against a computer-controlled enemy. Ender's team wins again and again, finally destroying a planet that the enemy fleet seems ...More: http: //booksllc.net/?id=1472964",
  "genres": [
    "Science Fiction"
  ],
  "author": "Books LLC",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/8856775-ender-s-game-series-short-stories"
}