{
  "title": "Growing Up Laughing: My Story and the Story of Funny",
  "description": "Growing Up My Story and the Story of Funny is a book that only Marlo Thomas could write--a smart and gracious, witty and confident autobiographical journey.For as long as Marlo Thomas can remember, she's lived with laughter. Born to comedy royalty--TV and nightclub star Danny Thomas--she grew up among legendary funny men, carved much of her career in comedy and, to this day, surrounds herself with people who love and live to make others laugh. In this long-awaited memoir, Thomas takes us on a funny and heartwarming adventure, from her Beverly Hills childhood, to her groundbreaking creation of That Girl and Free to Be . . . You and Me , to her rise as one of America's most beloved actress-comediennes, to her marriage to talk-show king Phil Donahue.Her youth was star-studded--Milton Berle performed magic tricks (badly) at her backyard birthday parties. George Burns, Bob Hope, Sid Caesar, Bob Newhart and other great comics passed countless hours gathered around her family's dinner table. And behind it all was the rich laughter nurtured by a close and loving family.Growing Up Laughing is not just the story of an iconic entertainer, but also the story of comedy. In a voice that is curious, generous and often gleeful, Thomas not only opens the doors on the funny in her own life, but also explores the comic roots of today's most celebrated comedians, in personal interviews Alan Alda, Joy Behar, Stephen Colbert, Billy Crystal, Tina Fey, Whoopi Goldberg, Kathy Griffin, Jay Leno, George Lopez, Elaine May, Conan O'Brien, Don Rickles, Joan Rivers, Chris Rock, Jerry Seinfeld, Jon Stewart, Ben and Jerry Stiller, Lily Tomlin, Robin Williams and Steven Wright.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Humor",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "Comedy"
  ],
  "author": "Marlo Thomas",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/8855532-growing-up-laughing"
}