{
  "title": "Why Does the World Exist?: An Existential Detective Story",
  "description": "\"Why is there a world rather than nothing at all?\" remains the darkest and most enduring of all metaphysical mysteries. Following in the footsteps of Christopher Hitchens, Roger Penrose, and even Stephen Hawking, Jim Holt now enters this fractious debate with his lively and deeply informed narrative that traces the latest efforts to grasp the origins of the universe. The slyly humorous Holt takes on the role of cosmological detective, suggesting that we might have been too narrow in limiting our suspects to Yahweh vs. the Big Bang. Tracking down an eccentric Oxford philosopher, a Physics Nobel Laureate, a French Buddhist monk who lived with the Dalai Lama, and John Updike just before he died, Holt pursues unexplored angles to this cosmic puzzle. As he pieces together a solution--one that sheds new light on the question of God and the meaning of existence--he offers brisk philosophical asides on time and eternity, consciousness, and the arithmetic of nothingness.“The pleasure of this book is watching the match: the staggeringly inventive human mind slamming its fantastic conjectures over the net, the universe coolly returning every serve.... Holt traffics in wonder, a word whose dual meanings—the absence of answers; the experience of awe—strike me as profoundly related. His book is not utilitarian. You can’t profit from it, at least not in the narrow sense.... And yet it does what real science writing should: It helps us feel the fullness of the problem.” (Kathryn Schulz, New York Magazine)\" Jim Holt leaves us with the question Stephen Hawking once asked but couldn't answer, ‘Why does the universe go through all the bother of existing?’” (Ron Rosenbaum, Slate )",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Science",
    "Physics",
    "Religion",
    "History",
    "Spirituality"
  ],
  "author": "Jim Holt",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/8854815-why-does-the-world-exist"
}