{
  "title": "The Lady Penitent",
  "description": "Two goddesses vie for the heart of a people!Halisstra Melarn thought she was doing her goddess’s work when she set out to discover the secret behind Lolth’s Silence, but instead she found a new goddess, and a tragic destiny. Now enslaved to the cruel whim of the Spider Queen, Halisstra’s mission is simple: destroy everything Lolth wishes destroyed, starting with the tattered remnants of Halisstra’s own soul.1. Sacrifice of the Widow: Goddesses vie for the soul of people... Halisstra Melarn, convert to the cause of the goddess Eilistraee, was sent to the deepest depths of the Outer Planes to kill the demon goddess she once worshiped, but instead was transformed into a hideous creature bent to the vengeful will of her former mistress. For the Queen of the Demonweb Pits not only survived her Silence but evolved into something greater than she was before - something that no longer needs to share the domain she calls her own. Could it be that the War of the Spider Queen has just begun?2. Storm of the Dead: Drow god vs. Drow god! When Lolth and Eilistraee, two drow goddesses, compete for control of the dark elves of Faerun, more than just the drow are caught in the middle. Though the drow will survive their game, what's at stake is the very nature of what it means to be a dark elf.3. Ascendancy of the Last: Is it the end for the Lady Penitent? Is it the end for Lolth?Lolth has come out of hibernation with a plan that may seem too ambitious even for her, and to pull it off she'll need the help of a drow who's betrayed her at least once already--a drow she's transformed into the demonic Lady Penitent. The shocking conclusion to a trilogy that will change the Forgotten Realms world forever.Forgotten Realms readers have fully embraced Lisa Smedman’s follow-up to the best-selling series R.A. Salvatore’s War of the Spider Queen. This handsome omnibus edition collects all three volumes of the Lady Penitent trilogy—Sacrifice of the Widow, Storm of the Dead, and Ascendancy of the Last—all under one cover, with stunning new art.",
  "genres": [
    "Forgotten Realms",
    "Fantasy"
  ],
  "author": "Lisa Smedman",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/8855894-the-lady-penitent"
}