{
  "title": "The Handicap Principle: A Missing Piece of Darwin's Puzzle",
  "description": "Ever since Darwin, animal behavior has intrigued and perplexed human observers. The elaborate mating rituals, lavish decorative displays, complex songs, calls, dances and many other forms of animal signaling raise fascinating questions. To what degree can animals communicate within their own species and even between species? What evolutionary purpose do such communications serve? Perhaps most importantly, what can animal signaling tell us about our own non-verbal forms of communication? In The Handicap Principle , Amotz and Ashivag Zahavi offer a unifying theory that brilliantly explains many previously baffling aspects of animal signaling and holds up a mirror in which ordinary human behaviors take on surprising new significance.The wide-ranging implications of the Zahavis' new theory make it arguably the most important advance in animal behavior in decades. Based on 20 years of painstaking observation, the Handicap Principle illuminates an astonishing variety of signaling behaviors in animals ranging from ants and ameba to peacocks and gazelles. Essentially, the theory asserts that for animal signals to be effective they must be reliable, and to be reliable they must impose a cost, or handicap, on the signaler. When a gazelle sights a wolf, for instance, and jumps high into the air several times before fleeing, it is signaling, in a reliable way, that it is in tip-top condition, easily able to outrun the wolf. (A human parallel occurs in children's games of tag, where faster children will often taunt their pursuer before running). By momentarily handicapping itself--expending precious time and energy in this display--the gazelle underscores the truthfulness of its signal. Such signaling, the authorssuggest, serves the interests of both predator and prey, sparing each the exhaustion of a pointless chase. Similarly, the enormous cost a peacock incurs by carrying its elaborate and weighty tail-feathers, which interfere with food gathering, reliably communicates its value as a mate able to provide for its offspring. Perhaps the book's most important application of the Handicap Principle is to the evolutionary enigma of animal altruism. The authors convincingly demonstrate that when an animal acts altruistically, it handicaps itself--assumes a risk or endures a sacrifice--not primarily to benefit its kin or social group but to increase its own prestige within the group and thus signal its status as a partner or rival. Finally, the Zahavis' show how many forms of non-verbal communication among humans can also be explained by the Handicap Principle. Indeed, the authors suggest that non-verbal signals--tones of voice, facial expressions, body postures--are quite often more reliableindicators of our intentions than is language.Elegantly written, exhaustively researched, and consistently enlivened by equal measures of insight and example, The Handicap Principle illuminates virtually every kind of animal communication. It not only allows us to hear what animals are saying to each other--and to understand why they are saying it--but also to see the enormously important role non-verbal behavior plays in human communication.",
  "genres": [
    "Evolution",
    "Biology",
    "Science",
    "Nonfiction",
    "Popular Science",
    "Psychology"
  ],
  "author": "Amotz Zahavi",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/885547.The_Handicap_Principle"
}