{
  "title": "The Mercury 13",
  "description": "In 1961, just as NASA launched its first man into space, a group of women underwent secret testing in the hopes of becoming America’s first female astronauts. They passed the same battery of tests at the legendary Lovelace Foundation as did the Mercury 7 astronauts, but they were summarily dismissed by the boys’ club at NASA and on Capitol Hill. The USSR sent its first woman into space in 1963; the United States did not follow suit for another twenty years.For the first time, Martha Ackmann tells the story of the dramatic events surrounding these thirteen remarkable women, all crackerjack pilots and patriots who sometimes sacrificed jobs and marriages for a chance to participate in America’s space race against the Soviet Union. In addition to talking extensively to these women, Ackmann interviewed Chuck Yeager, John Glenn, Scott Carpenter, and others at NASA and in the White House with firsthand knowledge of the program, and includes here never-before-seen photographs of the Mercury 13 passing their Lovelace tests. Despite the crushing disappointment of watching their dreams being derailed, the Mercury 13 went on to extraordinary achievement in their lives: Jerrie Cobb, who began flying when she was so small she had to sit on pillows to see out of the cockpit, dedicated her life to flying solo missions to the Amazon rain forest; Wally Funk, who talked her way into the Lovelace trials, went on to become one of the first female FAA investigators; Janey Hart, mother of eight and, at age forty, the oldest astronaut candidate, had the political savvy to steer the women through congressional hearings and later helped found the National Organization for Women. A provocative tribute to these extraordinary women, The Mercury 13 is an unforgettable story of determination, resilience, and inextinguishable hope.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "History",
    "Space",
    "Science",
    "Biography",
    "Feminism",
    "Womens"
  ],
  "author": "Martha Ackmann",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/885220.The_Mercury_13"
}