{
  "title": "Harriet Tubman: The Life and the Life Stories",
  "description": "Harriet Tubman’s name is known world-wide and her exploits as a self-liberated Underground Railroad heroine are celebrated in children’s literature, film, and history books, yet no major biography of Tubman has appeared since 1943. Jean M. Humez’s comprehensive Harriet Tubman is both an important biographical overview based on extensive new research and a complete collection of the stories Tubman told about her life—a virtual autobiography culled by Humez from rare early publications and manuscript sources. This book will become a landmark resource for scholars, historians, and general readers interested in slavery, the Underground Railroad, the Civil War, and African American women.Born in slavery in Maryland in or around 1820, Tubman drew upon deep spiritual resources and covert antislavery networks when she escaped to the north in 1849. Vowing to liberate her entire family, she made repeated trips south during the 1850s and successfully guided dozens of fugitives to freedom. During the Civil War she was recruited to act as spy and scout with the Union Army. After the war she settled in Auburn, New York, where she worked to support an extended family and in her later years founded a home for the indigent aged. Celebrated by her primarily white antislavery associates in a variety of private and public documents from the 1850s through the 1870s, she was rediscovered as a race heroine by woman suffragists and the African American women’s club movement in the early twentieth century. Her story was used as a key symbolic resource in education, institutional fundraising, and debates about the meaning of \"race\" throughout the twentieth century.Humez includes an extended discussion of Tubman’s work as a public performer of her own life history during the nearly sixty years she lived in the north. Drawing upon historiographical and literary discussion of the complex hybrid authorship of slave narrative literature, Humez analyzes the interactive dynamic between Tubman and her interviewers. Humez illustrates how Tubman, though unable to write, made major unrecognized contributions to the shaping of her own heroic myth by early biographers like Sarah Bradford. Selections of key documents illustrate how Tubman appeared to her contemporaries, and a comprehensive list of primary sources represents an important resource for scholars.",
  "genres": [
    "Biography",
    "American History",
    "History"
  ],
  "author": "Jean M. Humez",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/886232.Harriet_Tubman"
}