{
  "title": "First Footsteps in East Africa Or, an Exploration of Harar",
  "description": "This historic book may have numerous typos and missing text. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1894 edition. Excerpt: ...route settled by a former Sahib. He appears, though famed for honesty and justice, to have taken a partial view of Lieutenant Speke's property. When the traveller complained of his Abban, the reply was, \" This is the custom of the country, I can see no fault; all you bring is the Abban's, and he can do what he likes with it.\" The next day was passed unpleasantly enough in the open air, to force a march, and the Sultan and his party stuck to the date-bag, demanding to be fed as servants till rations were served out to them. i8th November.--About 2 A.m. the camels (eleven in number) were lightly loaded, portions of the luggage being sent back to Kurayat till more carriage could be procured. The caravan crossed the plain southwards, and after about two miles' march entered a deep stony watercourse winding through the barren hills. After five miles' progress over rough ground, Lieutenant Speke unloaded under a tree early in the afternoon near some pools of sweet rain water collected in natural basins of limestone dotting the watercourse. The place is called Iskodubuk; the name of the watercourse is Duktura. The Sultan and the Abban were both left behind to escort the baggage from Las Kuray to Kurayat. They promised to rejoin Lieutenant Speke before nightfall; the former appeared after five, the latter after ten, days. The Sultan sent his son Abdallah, a youth of about fifteen years old, who proved so troublesome that Lieutenant Speke was forced repeatedly to dismiss him: still the lad would not leave the caravan till it reached the Dulbahanta frontier. And the Abban delayed a Negro servant, Lieutenant Speke's gun-bearer, trying by many offers and promises to seduce him from service. 1gth November.--At dawn the camels were brought in; they had been...",
  "genres": [
    "Travel",
    "Africa",
    "History",
    "Nonfiction",
    "Adventure",
    "Somalia",
    "Memoir"
  ],
  "author": "Richard Francis Burton",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/8863289-first-footsteps-in-east-africa-or-an-exploration-of-harar"
}