{
  "title": "Jesus and Muhammad: Parallel Tracks, Parallel Lives",
  "description": "Jesus and Muhammad are two of the best known and revered figures in history, each with a billion or more global followers. Now, in this intriguing volume, F.E. Peters offers a clear and compelling analysis of the parallel lives of Jesus and Muhammad, the first such in-depth comparison in print.  Like a detective, Peters compiles \"dossiers\" of what we do and do not know about the lives and portraits of these towering figures, drawing on the views of modern historians and the evidence of the Gospels and the Quran. With erudition and wit, the author nimbly leads the reader through drama and dogma to reveal surprising similarities between the two leaders and their messages. Each had a public career as a semi-successful preacher. Both encountered opposition that threatened their lives and those of their followers. Each left a body of teaching purported to be their very words, with an urgent imperative that all must become believers in the face of the approaching apocalypse. Both are symbols of hope on the one hand and of God's terrible judgment on the other. They are bringers of peace--and the sword. There is, however, a fundamental difference. Muslims revere Muhammad ibn Abdullah of Mecca as a mortal prophet. Although known as a prophet in his day, the Galilean Jew Jesus was and is believed by his followers to have been the promised Messiah, indeed the son of God. The Quran records revelations received by Muhammad as the messenger of God, whereas the revelations of the Gospels focus on Jesus and the events of his life and death. A lasting contribution to interfaith understanding, Jesus and Muhammad offers lucid, intelligent answers to questions that underlie some of the world's most intractable conflicts.",
  "genres": [
    "Islam",
    "Religion",
    "Christianity",
    "History"
  ],
  "author": "F.E. Peters",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/8867709-jesus-and-muhammad"
}