{
  "title": "Paddle to the Arctic: The Incredible Story of a Kayak Quest Across the Roof of the World",
  "description": "Don Starkell decided to paddle a kayak from Hudson Bay 3,000 miles through the Northwest Passage.Paddle to the Arctic is Don's diary of his journey from Churchill, Manitoba, north and then west all the way to Tuktoyaktuk, close to Alaska. The voyage took him three Arctic summers. Each attempt almost cost him his life.The first year, aged fifty-seven and \"very scared,\" Don paddled north through the thawing ice-fields. How he survived a spill in frigid waters miles from shore before fighting his way home is in itself an incredible story. On his return to Churchill he was greeted by a local with the words \"I was hoping you wouldn't make it back.\" Why? \"If guys like you are successful, it will encourage others to try, and the whole west shore of Hudson Bay will be piled deep with bodies.\"Undeterred, Don tried again the next year with two companions. Fred soon gave up, but Victoria gamely survived their jousts with polar bears, walrus, and other hazards all the way to Repulse Bay. (For most readers, one of the book's pleasures is learning the geography of the North as Don visits each community in turn.)The third year was the big test. Dragging their sleds across the peninsulas proved to be too tough, and snowmobiles had to be used to get to Spence Bay. Then it was straight across the frozen sea, hauling their kayaks on sleds.Although Victoria had to give up (\"My God, he'll kill us both,\" she told a Winnipeg paper), Don kept on, not seeing another human being for weeks, and risking his life as he waded across the thawing ice (\"Fell through the ice up to my neck at least ten times yesterday ...\"). At Cambridge Bay he abandoned the sled and threaded his way through the breaking ice by kayak, out into open water. There he confronted storms, giant Arctic seas, and (\"August 19 - snow!\") the growing threat of freeze-up.The variety of Don's adventures will astonish every reader. \"So far on my voyage,\" he writes, \"I have seen polar bear, grizzly, caribou, reindeer, muskox, belugas, whales, seal, walrus, Arctic hare, siksik, lemmings, fox, and lots of Arctic birds.\" Whenever his days seem about to settle into a rhythm, another crisis erupts. The landscape changes, from welcoming Inuit settlements or camps, to permanently smoking hills, and from an historic site where he finds an explorer's sword hilt, to surf-lashed cliffs.And as he closes in on his destination, his supplies running out and his ocean highway freezing over, we find ourselves sharing his blazing, driving determination to reach his goal, at the risk of his life. This compelling book makes armchair travel the ideal way to go.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Canada",
    "Adventure",
    "Biography",
    "Survival"
  ],
  "author": "Don Starkell",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/886797.Paddle_to_the_Arctic"
}