{
  "title": "King Arthur and the Goddess of the Land: The Divine Feminine in the Mabinogion",
  "description": "Reveals how the ancient Celtic text of the Mabinogion was the mythical predecessor to the legends of King Arthur. • Revised edition of Arthur and the Sovereignty of Britain (UK) that includes the author's latest research and insights. • A comprehensive reader's companion with synopsis of stories and full commentary. • Written by renowned scholar Caitlín Matthews, author of The Celtic Wisdom Tarot (15,000 sold). The ancient Celtic stories of the Mabinogion have received universal recognition from scholars as both sources of the Arthurian legend and keys to insights into the ancient magic of the Celtic Otherworld. Now renowned Celtic scholar Caitlín Matthews, drawing on a full range of medieval texts and ancient Welsh writings, provides a fully revised and updated reader's guide to these rich and far-reaching tales. In King Arthur and the Goddess of the Land, Matthews sheds particular light on Sovereignty, the Goddess of the sacred land of Britain, and the spiritual principle of the Divine Feminine. Clearly revealed are the many alternate forms taken by the Goddess of the Land--including her incarnation as Morgan of Avalon, who plays a dominant role in the Arthurian cycle. Also established are links between the legendary characters of the Mabinogion and their counterparts in other living myths of the Western world. Through the marriage of the Celtic kings to the Goddess of the Land, the sacred contract between political rulership and responsibility for the land's well-being is dramatically revealed. In King Arthur and the Goddess of the Land, Matthews once again articulates definitively the continuing relevance of ancient Celtic thought and belief as illustrated in the powerful myths and legends of ancient Britain.",
  "genres": [
    "Mythology",
    "Arthurian",
    "Nonfiction",
    "History",
    "Paganism",
    "Reference",
    "Witchcraft"
  ],
  "author": "Caitlín Matthews",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/88711.King_Arthur_and_the_Goddess_of_the_Land"
}