{
  "title": "The Diary of Dawid Sierakowiak: Five Notebooks from the Lodz Ghetto",
  "description": "\"In the evening I had to prepare food and cook supper, which exhausted me totally. In politics there's absolutely nothing new. Again, out of impatience I feel myself beginning to fall into melancholy. There is really no way out of this for us.\" This is Dawid Sierakowiak's final diary entry. Soon after writing it, the young author died of tuberculosis, exhaustion, and starvation―the Holocaust syndrome known as \"ghetto disease.\" After the liberation of the Lodz Ghetto, his notebooks were found stacked on a cookstove, ready to be burned for heat. Young Sierakowiak was one of more than 60,000 Jews who perished in that notorious urban slave camp, a man-made hell which was the longest surviving concentration of Jews in Nazi Europe. The diary comprises a remarkable legacy left to humanity by its teenage author. It is one of the most fastidiously detailed accounts ever rendered of modern life in human bondage. Off mountain climbing and studying in southern Poland during the summer of 1939, Dawid begins his diary with a heady enthusiasm to experience life, learn languages, and read great literature. He returns home under the quickly gathering clouds of war. Abruptly Lodz is occupied by the Nazis, and the Sierakowiak family is among the city's 200,000 Jews who are soon forced into a sealed ghetto, completely cut off from the outside world. With intimate, undefended prose, the diary's young author begins to describe the relentless horror of their predicament: his daily struggle to obtain food to survive; trying to make reason out of a world gone mad; coping with the plagues of death and deportation. Repeatedly he rallies himself against fear and pessimism, fighting the cold, disease, and exhaustion which finally consume him. Physical pain and emotional woe hold him constantly at the edge of endurance. Hunger tears Dawid's family apart, turning his father into a thief who steals bread from his wife and children. The wonder of the diary is that every bit of hardship yields wisdom from Dawid's remarkable intellect. Reading it, you become a prisoner with him in the ghetto, and with discomfiting intimacy you begin to experience the incredible process by which the vast majority of the Jews of Europe were annihilated in World War II. Significantly, the youth has no doubt about the consequence of deportation out of the ghetto: \"Deportation into lard,\" he calls it. A committed communist and the unit leader of an underground organization, he crusades for more food for the ghetto's school children. But when invited to pledge his life to a suicide resistance squad, he writes that he cannot become a \"professional revolutionary.\" He owes his strength and life to the care of his family.",
  "genres": [
    "History",
    "Holocaust",
    "Nonfiction",
    "Memoir",
    "World War II",
    "Biography",
    "Jewish"
  ],
  "author": "Dawid Sierakowiak",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/887213.The_Diary_of_Dawid_Sierakowiak"
}