{
  "title": "Listening through the Noise: The Aesthetics of Experimental Electronic Music",
  "description": "Electronic music since 1980 has splintered into a dizzying assortment of genres and subgenres, communities and subcultures. Given the ideological differences among academic, popular, and avant-garde electronic musicians, is it possible to derive an aesthetic theory that accounts for this variety? And is there even a place for aesthetics in twenty-first-century culture? This book explores genres ranging from techno to electroacoustic music, from glitch to drone music, and from dub to drones, and maintains that culturally and historically informed aesthetic theory is not only possible but indispensable for understanding electronic music.The abilities of electronic music to use preexisting sounds and to create new sounds are widely known. This book proceeds from this starting point to consider how electronic music changes the way we listen not only to music, but to sound itself. The common trait in recent experimental electronic music is a concern with whether sound, in itself, bears meaning. The use of previously undesirable materials like noise, field recordings, and extremely quiet sounds has contributed to electronic music's destruction of the \"musical frame\", the conventions that used to set apart music from the outside world. In the void created by the disappearance of the musical frame, different philosophies for listening have emerged. Some electronic music genres insist upon the inscrutability and abstraction of sound. Others maintain that sound functions as a sign pointing to concepts or places beyond the work. But all share an approach towards listening that departs fundamentally from the expectationsthat have governed music listening in the West for the previous five centuries.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Philosophy",
    "Art History"
  ],
  "author": "Joanna Demers",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/8868451-listening-through-the-noise"
}