{
  "title": "The Second Mark: Courage, Corruption, and the Battle for Olympic Gold",
  "description": "It was billed as the greatest event in the history of pair skating: three of the best teams of all time battling for Olympic gold on one night in Salt Lake City. Technical ability was approximately equal. It was the artistic merit score that would decide the gold medal -- the second mark.Representing Canada, China, and Russia, the three pairs illuminated their distinct cultures. On the second mark, whose culture would triumph? Would it be the beauty of the Russians' ballet on ice, the thrill of the Chinese pair's heart-stopping acrobatics, or the Canadians' passionate connection with the audience? In a down-to-the-wire nail-biter, the difference between gold and silver came down to the vote of a single judge. Hours later, a bombshell: the confession of a French judge unleashed a worldwide debate -- and ultimately produced an unprecedented duplicate gold medal.\"The Second Mark\" reveals what an athlete really goes through to become the best in the world, through the riveting stories of unforgettable people. We meet Yelena Berezhnaya of Russia, who survives emergency brain surgery after a near-fatal training accident and makes it back to the Olympics in less than two years. We meet Zhao Hongbo, a young boy skating in subzero weather in remotest China, who will fulfill his coach's twenty-year dream of catching up to the West. And we meet two Canadians, a barista and a concession stand worker, who had almost quit the sport before deciding to give it one last try -- and becoming world champions.Exhaustively researched by a skating insider, \"The Second Mark\" takes readers deep into the world of the Olympic athlete, illuminating the fascinating differences between East and West. From the frozen fields of China to the secret corridors of the old Soviet sports system, from a tiny farm village in remotest Quebec to the judges' backstage world, \"The Second Mark\" tells the compelling human stories behind one of the most controversial nights in Olympic history.",
  "genres": [
    "Nonfiction",
    "Sports",
    "Figure Skating",
    "Biography",
    "History"
  ],
  "author": "Joy Goodwin",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/887164.The_Second_Mark"
}