{
  "title": "Cargo to Kill For",
  "description": "John and Diane Tate disappear, and as the days pass, presumptions and theories about their untimely demise begin to be whispered on the docks of the Blue Fin Yacht Club. But Clara Dare’s hope that her friends are still alive grows when she becomes convinced that the Tates needed to disappear. At the somewhat unusually inspired request of her childhood friend, Detective Tara Thompson, Clara Dare sets out to discover from who, or what, the Tates were running. In a dangerous, and highly unorthodox, game of cat and mouse, Clara Dare and Tara rush against time, and a growing body count, to find out what happened to John and Diane.****Chessen Parker is an avid mystery reader and writer, based in Atlanta, Georgia. Raised in North Carolina, where she attended Meredith College and Duke University School of Law, she chose to set her first amateur sleuth series on North Carolina’s beautiful Crystal Coast and Outer Banks.The author's goal in developing the series was to recreate the elegance and wit of Agatha Christie, in a modern, coastal village setting. The series features strong, independent, witty and intelligent women; promotes volunteerism; and allows readers to experience the often humorous, aristocratic flavor of a small Southern town (steeped in tradition) from the inside. It is not necessary to read the series in order -- each book is a self-contained, exciting mystery. The first book in the series, Blackbeard's Curse, is available in Kindle Edition and paperback. Join Clara Dare Ivankova and her friends as they comb the North Carolina coast for clues to uncover the who, why and how of the clever, and often desperate, murders that hit close to home. Experience beautiful beaches, remote island villages, cozy harbors, and coastal living at its finest with the sleuths in the Crystal Coast Mysteries. Cover Art by Patti Reinheimer of Mariposa Negra Studio.",
  "genres": [
    "Mystery"
  ],
  "author": "Chessen Parker",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/8869424-cargo-to-kill-for"
}