{
  "title": "The Arabian Nights",
  "description": "The Arabian Nights is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble ClassicsNew introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences--biographical, historical, and literary--to enrich each reader's understanding of these enduring works. Once upon a time, the name Baghdad conjured up visions of the most magical, romantic city on earth, where flying carpets carried noble thieves off on wonderful adventures, and vicious viziers and beautiful princesses mingled with wily peasants and powerful genies. This is the world of the Arabian Nights, a magnificent collection of ancient tales from Arabia, India, and Persia.  The tales--often stories within stories--are told by the sultana Scheherazade, who relates them as entertainments for her jealous and murderous husband, hoping to keep him amused and herself alive. In addition to the more fantastic tales which have appeared in countless bowdlerized editions for children and have been popularized by an entire genre of Hollywood films, this collection includes far more complex, meaningful, and erotic stories that deal with a wide range of moral, social, and political issues.  Though early Islamic critics condemned the tales' \"vulgarity\" and worldliness, the West has admired their robust, bawdy humor and endless inventiveness since the first translations appeared in Europe in the eighteenth century. Today these stories stand alongside the fables of Aesop, the fairy tales of the Brothers Grimm, and the folklore of Hans Christian Andersen as some of the Western literary tradition's most-quoted touchstones.",
  "genres": [
    "Classics",
    "Fiction",
    "Fantasy",
    "Short Stories",
    "Mythology",
    "Literature",
    "Historical Fiction"
  ],
  "author": "Henry William Dulcken",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/8873605-the-arabian-nights"
}