{
  "title": "المسألة الدينية في القرن الواحد والعشرين",
  "description": "... آمل أن يجد القارئ العربي ما يفيده من معلومات حول ما يسمّى بظاهرة \"عودة الدين\"، المنتشرة في كل المجتمعات التي تعتنق إحدى الديانات الثلاث التوحيدية. صحيح انني تعمقت أكثر في تخبّط المجتمعات المسيحية بهذه الظاهرة، وذلك من منظور التاريخ الطويل، عائداً إلى محاكم التفتيش للكنيسة في القرون الوسطى الأوروبية والحروب الدينية الشعواء بين البروتستانت والكاثوليك في ما سمّي، بالرغم من ذلك، \"عصر النهضة\" في أوروبا. وأعتقد، بعد المراجعة التاريخية الدقيقة التي يحتوي عليها هذا المؤلَّف، ان هذا التعمق ضروري لنا كعرب، وكمسلمين في غالبيتنا الكبرى، لشرح ما يصيبنا نحن من أزمة مجتمعية وفقدان للشرعية، تختلط فيها بشكل معقد للغاية قضايا الهوية الجماعية والدين والسياسة والثقافة.لقد سعيت، من خلال فصول هذا المؤلـَّف، إلى تبيان سخافة الأفكار والرؤى التي تحملها القيادات السياسية الغربية ومدى الضرر الذي تلحقه بنا بشكل خاص. فلنترك القيادات السياسية والأعمال الأكاديمية الغربية المنخرطة فيها، أما نحن فعلينا أن نعيد بناء منظومة ثقافية كأساس لنهضة عربية ثانية مستقلة عمّا يأتينا من الغرب من دفق إعلامي وأكاديمي متواصل أصبحنا مسجونين فيه. وعلينا أن ندخل في مراجعة نقدية صارمة لممارساتنا الثقافية والإعلامية التي صارت تشبه، إلى حد بعيد، ما يأتينا من الغرب من أدبيات مفخخة حول \"عودة الديني\" وحرب الحضارات والقيم \"اليهودية-المسيحية\" في مقابل قيم \"عربية- إسلامية\".من مقدمة المؤلفالدكتور جورج قرم لبناني من مواليد 1940، وهو خريج جامعة باريس في القانون الدستوري والعلوم الاقتصادية. عمل في حياته المهنية كخبير اقتصادي ومالي وكوزير مالية لبنان (1998ـ2000) وهو أستاذ في الجامعة اليسوعية في بيروت.من أهم مؤلفاته:• تعدد الأديان وأنظمة الحكم، 1977.• الاقتصاد العربي أمام التحدي، 1977 .• التبعية الاقتصادية، مأزق الإستدانة في العالم الثالث في المنظور التاريخي، 1980.• التنمية المفقودة، دراسات في الأزمة الحضارية والتنموية العربية، 1981.• الفوضى الاقتصادية الدولية الجديدة، 1994.• شرق وغرب: الشرخ الأسطوري، 2003.• لبنان المعاصر: تاريخ ومجتمع، 2004.• انفجار المشرق العربي، دار الفارابي، 2006.",
  "genres": [
    "Politics",
    "Religion"
  ],
  "author": "Georges Corm",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/8876364"
}