{
  "title": "Ohio Outback: Learning to Love the Great Black Swamp",
  "description": "A collection that reveals the surprising variety of life in northwest Ohio Ohio Outback is a unique compilation of writings by Claude Clayton Smith about his experiences of living in Ohio for the past twenty-two years. Smith offers a vibrant, humorous portrait of life that focuses on individuals and events in out-of-the-way places throughout northwest Ohio. The pieces in this book reflect a growing curiosity and fondness for Ohio, with topics ranging from the manufacturing process of NFL footballs and the anatomy of ditches to an Ohio section of a ten-thousandmile drive by interstate highway across the forty-eight states and Smith’s reflections as a licensed professional boxing judge. Ohio Outback also contains “Yard Wars of the Ohio Outback,” a lighthearted piece that forms the book’s narrative core with tales of bird, pool, and driveway battles. “Claude Clayton Smith, an Easterner who found himself transplanted to the ‘outback’ of northwest Ohio, has written a poignant and funny account of his longstanding attempt to feel at home there. The happy result of his struggle to come to terms with the region’s landscape, customs, and history is a thoughtful meditation on the charms and challenges of an obscure part of the world that some of us, no matter where we ended up, still call home.” ―Jeffrey Hammond, author of Ohio A Twentieth-Century Midwestern and Small Essays at Middle Age “Claude Clayton Smith writes of his adventures in the countryside of northwest Ohio with a bemused humor that fans of James Thurber (one of his heroes) and Dave Barry will appreciate. Natives may think that only an immigrant like Smith would find cottonwood fluff, horseflies, driveway gravel, woodlots, cicadas, feisty red squirrels, and birds that attack picture windows so exotic. But his perplexed celebration of his struggles to coexist with these―and much more―reminds us all just how much strangeness lurks within the everyday.” ―Jeff Gundy, author of Trees and Scattering The World in a Mennonite Eye",
  "genres": [],
  "author": "Claude Clayton Smith",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/8881412-ohio-outback"
}