{
  "title": "Helen of Pasadena",
  "description": "A Los Angeles Times BestsellerA witty, timely and richly entertaining tale of a modern mother in transition, from the author of The Sweeney SistersHelen Fairchild is leading a privileged Pasadena married to a pillar of the community; raising a water polo-playing son destined for the most select high school; volunteering her time on the most fashionable committees. It only bothers Helen a tiny bit that she has never quite fit in with the proper Pasadena crowd, never finished that graduate degree in Classics, and never had that second baby. But the rigid rules of society in Pasadena appeal to Helen, the daughter of Oregon fiber artists, even if she'll never be on the inside.And then along comes a Rose Parade float, killing her philandering husband and leaving Helen broke, out of her “forever\" house, and scrambling to salvage her once-rarefied existence. Enter Patrick O'Neill, excavator of Troy and wearer of nubby sweaters. A job as Dr. O'Neill's research assistant is the lifeline Helen needs to reinvent herself. Ancient mysteries to solve! Charity events to plan! School admissions advisors to charm! If Helen wasn’t so distracted by her incredibly attractive boss, she might be able to pull off this new life.Helen's world widens to include a Hollywood star, a gossip columnist, an old college nemesis, a high-powered Neutron Mom, an unforgiving school headmistress, the best Armenian real estate agent in the biz, and, of course, the intriguing Patrick O'Neill. While uncovering secrets about ancient Troy alongside her archaeologist boss, Helen discovers something much a new sense of self and a new love.With its keen social observations, laugh-out-loud scenes and whip-smart dialogue, Helen of Pasadena delivers humor, insight, and wisdom on reinventing yourself.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Book Club",
    "Contemporary",
    "Womens Fiction",
    "Humor"
  ],
  "author": "Lian Dolan",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/8882001-helen-of-pasadena"
}