{
  "title": "Johnny Halloween: Tales of the Dark Season",
  "description": "Norman Partridge's Halloween novel, Dark Harvest, was chosen as one of Publishers Weekly's 100 Best Books of 2006. A Bram Stoker Award winner and World Fantasy nominee, Partridge's rapid-fire tale of a small town trapped by its own shadows welcomed a wholly original creation, the October Boy, earning the author comparisons to Stephen King, Ray Bradbury, and Shirley Jackson.Now Partridge revisits Halloween with a collection featuring a half-dozen stories celebrating frights both past and present. In \"The Jack o' Lantern,\" a brand new Dark Harvest novelette, the October Boy races against a remorseless döppelganger bent on carving a deadly path through the town's annual ritual of death and rebirth. \"Johnny Halloween\" features a sheriff battling both a walking ghost and his own haunted conscience. In \"Three Doors,\" a scarred war hero hunts his past with the help of a magic prosthetic hand, while \"Satan's Army\" is a real Partridge rarity previously available only in a long sold-out lettered edition from another press.But there's more to this holiday celebration besides fiction. \"The Man Who Killed Halloween\" is an extensive essay about growing up during the late sixties in the town where the Zodiac Killer began his murderous spree. In an introduction that explores monsters both fictional and real, Partridge recalls what it was like to live in a community menaced by a serial killer and examines how the Zodiac's reign of terror shaped him as a writer.Halloween night awaits. Join a master storyteller as he explores the layers of darkness that separate all-too-human evil from the supernatural. Let Norman Partridge lead you on seven journeys through the most dangerous night of the year, where no one is safeŠand everyone is suspect.* Praise for the Author's \"Partridge has always had a knack for sifting deeper significance from period pop culture, but here he brilliantly distills a convincing male identity myth from teen rebel drive-in flicks, garish comic book horrors, hard-boiled crime pulps and other bits of lowbrow Americana. Whether read as potent dark fantasy or a modern coming-of-age parable, this is contemporary American writing at its finest.\" - Publishers Weekly (starred review of Dark Harvest)\"Partridge is at his best when he combines graphic terror with teenage angst... No one evokes the nostalgia of growing up in the 1960s better... If you're looking for a scary Halloween tale, with lots of blood and gore‹and candy‹you've come to the right place.\" - Rocky Mountain News\"Dark Harvest thrills with staccato scenes of action, ideal for a horror novel. Using a quick, lean prose reminiscent of the finest Gold Medal-era fiction and, at the same time, as fresh as a Quentin Tarantino film, Partridge packs more into this slim volume than most authors do in a bloated 600-page epic.\" - The Austin Chronicle\"Norman Partridge is the finest writer of short horror fiction going.\" - RevolutionSF\"This wonderful writer offers challenges, surprises, and deep satisfactions to anyone willing to think about what they are reading. Partridge consistently writes as though his life depends on the words he sets down on the page.\" - Peter Straub\"Norman Partridge displays his unique ability to give a reader all the kick-ass pleasure of pulp suspense and action along with vibrant, complex characters and deep insight into the mythic hearts of distinctly American Nightmares.\" - Jeffrey Ford\"Norman Partridge pulls no punches whether he¹s writing hard-boiled westerns, contemporary noir, or monster tales‹often combined. His stories will take you on a helluva ride.\" - Ellen Datlow\"Any new book with the name ŒNorman Partridge¹ on the front is cause for celebration.\" - Duane Swierczynski\"Norm Partridge is an extraordinary storyteller and his welding of noir and horror has created a signature style renowned for its lean, sinewy power.\" - Laird Barron\"Norman Partridge writes as if the devil himself had a sawed-off shotgun pointed at his head.\" - Joe Schreiber\"Norman Partridge has such a wealth of talent‹a prose style of wondrous luminosity and grace; a narrative drive that carries the reader inexorably to the spectacular climax; an ability to convey violence and gruesomeness without the least suggestion of crudity or exploitation; and an imagination that opens new worlds to all who venture within his realm‹that it will be engaging to chart his course in the future.\" - S. T. Joshi, editor of Black Tales of Lovecraftian Horror",
  "genres": [
    "Horror",
    "Halloween",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Contemporary",
    "Collections"
  ],
  "author": "Norman Partridge",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/8878844-johnny-halloween"
}