{
  "title": "Death and the Sisters",
  "description": "The tangled relationships between Frankenstein author Mary Shelley, poet Percy Bysshe Shelley, and Mary’s stepsister Jane Clairmont form the backdrop for an intriguing historical mystery, set in London in 1814, that explores the complex dynamic between sisters and the birth of teenaged Mary’s creative genius.London, 1814: Mary Godwin and her stepsister Jane Clairmont, both sixteen, possess quick minds bolstered by an unconventional upbringing, and have little regard for the rules that other young ladies follow. Mary, whose mother famously advocated for women’s rights, rejects the two paths that seem open to her—that of an assistant in her father’s bookshop, or an ordinary wife. Though quieter and more reserved than the boisterous Jane, Mary’s imagination is keen, and she longs for real-world adventures. One evening, an opportunity arrives in the form of a dinner guest, Percy Bysshe Shelley. At twenty-one, Shelley is already a renowned poet and radical. Mary finds their visitor handsome and compelling, but it is later that evening, after the party has broken up, that events take a truly intriguing turn. When Mary comes downstairs in search of a book, she finds instead a man face down on the floor—with a knife in his back. The dead man, it seems, was a former classmate of Shelley’s, and had lately become a personal and professional rival. What was he doing in the Godwins’ home? Mary, Jane, and Shelley are all drawn to learn the truth behind the tragedy, especially as each discovery seems to hint at a tangled web that includes many in Shelley’s closest circle. But as the attraction between Mary and the married poet intensifies, it sparks a rivalry between the sisters, even as it kindles the creative fire within . . .",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Mystery Thriller",
    "Historical Mystery",
    "19th Century"
  ],
  "author": "Heather Redmond",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/88837922-death-and-the-sisters"
}