{
  "title": "أسرار القوة الذاتية",
  "description": "سبع أسرار خاصة جدًا لبناء قوتك الشخصيةجذبني العنوان وَ هو بارز على أرفف المكتبة .. لم أكن أقرأ هذه النوعيات من الكتب أجدها بنظرني مملةلكن ما إنْ بدأت بهِ حتّى غيرت وجهتي تمامًا و ملتُ له بطريقة عجيبةالكلام فَاتن وَ مهم أيضًايبدأ بالتحدث عن الإدراك الداخلي وَ هو ما يتحدث عن أفكارك ، معتقداتك ، عواطف و قيمك .. )و عن الإدراك الخارجي أي تصبح مدركًا لكل ما تقول و تعمل و تخلق التميز في حياتك وحياة الآخرينثمّ بدأ بالتحدث عن تجربة الألم و المتعةو الحقيقة نعانيه كثيرًا في كثير من الأوقات يقول في الكتّاب( تقول الاحصائيات أن أقل من ١٠٪ من الأفراد الذين يشترون كتابًا أو أشرطة تسجيل يستخدمونهافعلاً و الباقي لا يستخدمونها ، ألا يبدو هذا غريبًا ؟يذهب الناس إلى محلات بيع الكتب و يدفعون المال و يصطحبون الكتب معهم إلى المنزلو هم يعرفون أنّ المعلومات التي بداخلها تفيدهم و مع ذلك لا يستخدمونها ! )وهذا فعلا حتى تطرق للتخفيف الصحي لماذا لا نستمر عليه أو سواء الاجهزه الرياضيةو ذكر تأثير تجربة الألم و المتعة على العلاقات مثلًا و كثير من المحاور الرئيسية ..ينتقل بعد ذلك إلى الأبعاد السبعة التي بتطويرها نستطيع العيش بحياة متوازنه و هيالبعد الروحاني .. الصحي .. العائلي .. المالي .. الشخصي .. المهني و الاجتماعي ..و سرد لكل منهم تفصيل ممتع جميل !و ينتقل بعد ذلك إلى الأسرار الأخرى بطريقة منظمة و أسلوب جاذب حقًالا تفوتوه على أنفسكم مفيد للتمنية في كل مجالات الحياة ..الاقتباسات ..( عندما نشعر بالمتعة لوجودنا مع شخص من الأشخاص ، نحاول بذل مافي وسعنا لنكون في صحبتهوفي المقابل عندما نستشعر الألم لوجودنا مع شخص ما نستخدم كل طاقتنا لتجنبه أو التخلص من صحبته )( بالنسبة للحمية الغذائية هم يضعون أنفسهم في تجربة الألم من خلال موقفهمأو نظرتهم السلبية تجاه أنفسهم لذلك يعمل دماغهم و جسمهم على حد سواء بشكل معاكسلما يقهرون أنفسهم عليه إلى أن يعودوا إلى الطعام بشكل جنوني )( لو كنت تريد أن تتصل بصديق ووجدت نفسك مترددًا في إجراء الاتصالفما عليك إلا أن تغير تركيزك راقب شعورك و اربط الألم بعدم اجرائك للاتصال ،تذكر متعة الكلام معه بشكل خاص و متعة الكلام مع صديقبشكل عام .. بهذه الطريقة أنت تبدأ باستخدام الألم و المتعةو تسخيرهما لصالحك عوضًا من تركهما يسيرانك )( احلم أحلامًا كبيرة ، عش لغاية محددة ، عش بالايمان و لتحيا مع القوة )( هنالك صوت بداخلنا يتكلم فيقول : هذا هو الأنا الحقيقي )( أقول لكَ أمرًا ، إذا كنت تعرف أين تقف ، و تعرف ماذا تريد و تعرف إلى أين تتجهفأنتَ في عداد أعظم رجال و نساء العالم الذين يصنعون التغيير فعلًا ،سيفتح لك العالم ذراعيه و كما يقول نابليون هيل :( اعتاد العالم أن يصنع مكانًا للرجل الذي تبدي أقوالهو أعماله أنه يعرف أين يتجه ) .. )( مبادئ قوة الغايةالاعتقادالرغبةالأملالأفكارالأحلام )( و كما تحلم ستكون )(أن يكون لك أحلام ثم أن تكتبها هكذا ستنشطها و تمنحها القوةعندما تكتبها فأنتَ تستخدم جسمك و عقلك معًا )( يجب أن يكون لديك حلم من كل بعد من الأبعاد الخمسواحد من حياتك الروحانية .. واحد من حياتك الصحية ،واحد من حياتك المهنية ، المالية و الشخصية هذا يحقق لذهنك توازنًا أفضل )( في اللحظة التي تبدأ فيها بالتفكير في حلمك ،تكون قد بدأت في ايقاظ رغبتك و كلما استغرقت في تفكيرك بهوجدت أنه ممكن التحقيق كلما نمت رغبتك في تحقيقه ..مع الرغبة أنت تطور العاطفة و تبدأ تبحث عن أشياء لتحقيقها )( إن أقوى عوامل الادراك البشري هو الإيمان معه ستجد نفسك تعيش مع أحلامك )( الايمان هو القوة وراء كل الانجازات إنه الثقة المطلقةبأن ما تؤمن به سوف يتحقق ..الايمان هو اعتقاد نضج إلى المرحلة التي تمكننا من اتخاذ خطوة أو القيام بالعمل )( عندما يكون لديك ايمان بالله فسوف تتحسن نوعية حياتك ..و عندما يكون لديك إيمان بنفسكفستتصرف بثقة و قوة إلى أن تصل إلى أهدافك و تعيش أحلامك )( لا يوجد شيء اسمه الماضي السلبي فالماضي عبارة عن مجموعة خبرات و تجارب )( إنّهم لا يشعرون بأنهم يستحقون الوصول إلى ما يريدون )( إذا لاحظت أنّك تماطل ضع ملاحظاتك حول أسباب المماطلة ..قسم العمل إلى أعمال أصغرولابد من المثابرة حتّى ينتهي الأمر تمامًا )( كل من يرغب بتقديم الخير للآخرين فإنه يخدم بذلك نفسه ) * كونفو شيوس( يقول الدكتور ويليام جيمس : إنّ الجمال الذي يتمتع به أبناء جيلي هو أنّهم يستطيعونتغير حياتهم بتغير مواقفهم الفكرية )( الحياة هي سلسلة من الدروس يجب أن نعيشها كي نفهمها ) * رالف والدو( إنّ أعظم قوة لدينا هي قوة الاختيارفنحن نستطيع أن نقرر أين نذهب وماذا نفعلوبماذا نفكر و ماذا نريد أن نكون .. و هذه هي نعمة الله للبشرية بأكملها )",
  "genres": [],
  "author": "إبراهيم الفقي",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/8890283"
}