{
  "title": "In the Interests of Justice: Reforming the Legal Profession",
  "description": "PTwo thousand years ago, Seneca described advocates not as seekers of truth but as accessories to injustice, \"smothered by their prosperity.\" This unflattering assessment has only worsened over time. The vast majority of Americans now perceive lawyers as arrogant, unaffordable hired guns whose ethical practices rank just slightly above those of used car salesmen. br In this penetrating new book, Deborah L. Rhode goes beyond the commonplace attacks on lawyers to provide the first systematic study of the structural problems confronting the legal profession. A past president of the Association of American Law Schools and senior counsel for the House Judiciary Committee during Clinton's impeachment proceedings, Rhode brings an insider's knowledge to the labyrinthine complexities of how the law works, or fails to work, for most Americans and often for lawyers themselves. She sheds much light on problems with the adversary system, the commercialization of practice, bar disciplinary processes, race and gender bias, and legal education. She argues convincingly that the bar's current self-regulation must be replaced by oversight structures that would put the public's interests above those of the profession. She insists that legal education become more flexible, by offering less expensive degree programs that would prepare paralegals to provide much needed low cost assistance. Most important, she calls for a return to ethical standards that put public service above economic self-interest. br Elegantly written and touching on such high profile cases as the O.J. Simpson trial and the Starr investigation, bIn the Interests of Justice/b uncovers fundamental flaws in our legal system and proposes sweeping reforms.",
  "genres": [
    "Law"
  ],
  "author": "Deborah L. Rhode",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/8890634-in-the-interests-of-justice"
}