{
  "title": "The Perfect Love Song: A Christmas Story",
  "description": "Just in time for Christmas, escape with a perfect love song, a perfect love story, and a perfect dose of holiday magic. \"Patti Callahan Henry is quickly becoming one of my favorites.\" —Debbie Macomber, New York Times bestselling author Can one song change the course of a life? Brothers Jimmy and Jack Sullivan live a nomadic life doing what they love: touring with their band, The Unknown Souls. But Jack’s recent engagement to Kara has everyone looking forward to a Christmas destination wedding in Ireland.Unlike his brother, Jimmy never expected to fall in love. But he feels a sense of peace and happiness whenever he’s around Kara’s best friend, Charlotte—which has him wondering what he’s missing. Over Thanksgiving, Jimmy and Charlotte write a song while sitting together on the back porch. When the band sings it at a Christmas concert the next night, Jimmy insists it’s the perfect love song—but a manager for another famous duo is adamant that it’s the perfect Christmas song. Before Jimmy knows what’s happening, he’s on tour with the hottest country band around and suddenly everyone knows his name.But fame isn’t all it’s cracked up to be, and Jimmy finds himself far away from those he loves—especially Charlotte. Only a Christmas miracle—or two—will be able to lead Jimmy back to Ireland, to his brother, and to love.“I fell in love with both Patti Callahan Henry and her work. The Perfect Love Song is a lyrical and heartwarming tale of love and forgiveness. Patti takes you to those places in the heart you didn’t even know you wanted to go.” —Pat Conroy, New York Times bestselling author of The Prince of Tides and South of Broad “Patti Callahan Henry’s The Perfect Love Song is a wonderfully romantic and inspiring novel about love and redemption that sings with emotional truth. An essential read by a master storyteller.” —Cassandra King, New York Times bestselling author of Same Sweet Girls “Her characters are so real, you feel as if you’ve known them a very long time.” —Emily Giffin, New York Times bestselling author of Something Borrowed",
  "genres": [
    "Christmas",
    "Fiction",
    "Romance",
    "Contemporary",
    "Holiday",
    "Audiobook",
    "Ireland"
  ],
  "author": "Patti Callahan Henry",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/8890015-the-perfect-love-song"
}