{
  "title": "An Experiment with Time",
  "description": "J.W. Dunne (1866-1949) was an accomplished English aeronautical engineer and a designer of Britian's early military aircraft. His An Experiment with Time, first published in 1927, sparked a great deal of scientific interest in—and controversy about—his new model of multidimensional time. A series of strange, troubling precognitive dreams (including a vision of the then future catastrophic eruption of Mt. Pelee on the island of Martininque in 1902) led Dunne to re-evaluate the meaning and significance of dreams. Could dreams be a blend of memories of past and future events? What was most upsetting about his dreams was that they contradicted the accepted model of time as a series of events flowing only one into the future. What if time wasn't like that at all? All of this prompted Dunne to think about time in an entirely new way. To do this, Dunne made, as he put it,\"an extremely cautious\" investigation in a \"rather novel direction.\" He wanted to outline a provable way of accounting for multiple dimensions and precognition, that is, seeing events before they happen. The result was a challenging scientific theory of the \"Infinite Regress,\" in which time, consciousness, and the universe are seen as serial, existing in four dimensions. Astonishingly, Dunne's proposed model of time accounts for many of life's the nature and purpose of dreams, how prophecy works, the immortality of the soul, and the existence of the all-seeing \"general observer,\" the \"Witness\" behind consciousness (what is now commonly called the Higher Self). Here in print again is the book English playwright and novelist J.B. Priestley called \"one of themost fascinating, most curious, and perhaps the most important books of this age.\"",
  "genres": [
    "Philosophy",
    "Science",
    "Nonfiction",
    "Psychology",
    "History",
    "Metaphysics",
    "Spirituality"
  ],
  "author": "J.W. Dunne",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/8894467-an-experiment-with-time"
}