{
  "title": "Tied In: The Business, History and Craft of Media Tie-In Writing",
  "description": "A unique, ground-breaking collection of lively, informative, and provocative essays & interviews from some of the most acclaimed and bestselling authors of tie-in books & novelizations about what they do and how they do it.Tie-in novels are books based on pre-existing media properties -- like TV shows, movies and games -- and they regularly top the national bestseller lists. But as popular as tie-ins books and novelizations are among readers, few people know how the books are written or the rich history behind the hugely successful and enduring genre. Contributors include Donald Bain, Max Allan Collins, Tod Goldberg, Elizabeth Massie, William C. Dietz, Aaron Rosenberg, Paul Kupperberg, Jeff Mariotte, Raymond Benson, Robert Greenberger, David Spencer, Greg Cox, Burl Barer, Jeff Ayers, Nancy Holder, Brandie Tarvin, Alina Adams and William Rabkin.EDITORIAL \"There have always been formidable writers doing tie-ins, but they have generally been dismissed, not unreasonably, as quickies tossed off for a fast buck. That image has been improved somewhat by the quality work of editor Goldberg, the late Stuart Kaminsky, Max Allan Collins, and some of the International Association of Media Tie-in Writers members contributing to this volume. With it's helpful how-to tips and articles, the book is primarily directed towards other writers, and established pros at that. But many fans and scholars will enjoy the inside-the-business stuff.\" Jon Breen, Mystery Scene Magazine\" Tied-In doesn’t focus solely on television tie-ins. It also covers movie novelizations, comic book tie-ins and computer game tie ins. But that actually makes it even more valuable and more interesting. Tied-In is a fascinating exploration of the media tie-in business.\" -- Television Obscurities Blog\"This is really interesting and entertaining stuff. I was genuinely surprised at how much fun I had reading this book, and I'm sure most of you would like it, too\" -- Bill Crider's Pop Culture Magazine\"I say this without a whit of exaggeration Tied-In is the most fascinating, entertaining and honest book about the writing life I've ever read...\" --Ed Gorman, founder of Mystery Scene Magazine",
  "genres": [
    "Nonfiction",
    "Essays",
    "Writing",
    "Media Tie In"
  ],
  "author": "Lee Goldberg",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/8902870-tied-in"
}