{
  "title": "No Vacancies, A Collection of Short Stories Vol 4",
  "description": "The fourth installment of the No Vacancies adventure series is here. InVolume 4, Black delivers the final episodes of both the High Stakes andOutcast stories, continues the Independent Initiative and introduces awhole new series, Myth.In the last installment of Outcast, Nathaniel and Ramuel have united asone and now stand together against Adrian Vandenberg. Will theircombined strength be enough to stop the magical prowess of AdrianVandenberg? Will Nathaniel’s friends make it out of Vandenberg Towersalive? Find out in this last action packed episode of Outcast.In High Stakes, Part 4, everything comes to a head. Jack and theResistance come face to face against the Protectorate in battle. Will theResistance be able to escape and free the children? The first in the trilogyof the High Stakes saga comes to an end with a mind-blowing secret aboutthe Protectorate and their origin.The Independent Initiative continues with an action packed episode.Cassie Matthews heads to Washington DC to track down theIndependent’s killer. When she arrives Cassie comes face to face withanother squad of insurgents that are hell bent on ending her life and aRussian operative on a vengeful mission.In Myth, the first in a new series, Lucien Black introduces Nick Maverick,an A list actor that can’t seem to find work worth his mettle. Instead heslaves away on the set of a television series called What Lies Beneathwaiting for his next big break. What Nick doesn’t know is that he comesfrom a very powerful and noble family that lives in another realm. MountOlympus. His father, Zeus, has gone missing and the Gods turn to Nickfor help.Black continues to weave tales of the unimaginable in the currentinstallment of the No Vacancies adventure series.",
  "genres": [],
  "author": "Lucien Black",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/8905949-no-vacancies-a-collection-of-short-stories-vol-4"
}