{
  "title": "The Water Of The Wondrous Isles",
  "description": "The Water of the Wondrous Isles is a fantasy novel written by William Morris. The story takes place in a mythical land where magic and enchantment are the norm. The main character is a young woman named Birdalone who has been raised in seclusion by a witch. After the witch dies, Birdalone sets out on a journey to find her true love. Along the way, she encounters a variety of magical creatures, including a talking wolf, a giant, and a mermaid. She also discovers a magical water that has the power to grant wishes. However, the water is guarded by a powerful sorceress who will stop at nothing to keep it for herself. As Birdalone continues on her quest, she must use her wits and bravery to overcome the obstacles in her path and find her true love. The Water of the Wondrous Isles is a classic tale of adventure, magic, and romance that will captivate readers of all ages.Hah, thrall! said the lady, thou art bold; thou art over-bold, thou naked wretch, to bandy words with me. What heed I thy tale now thou art under my hand? Her voice was cold rather than fierce, yet was there the poison of malice therein. But Birdalone If I be bold, lady, it is because I see that I have come into the House of Death. The dying may well be bold.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Classics",
    "Speculative Fiction",
    "Science Fiction Fantasy",
    "19th Century",
    "Novels"
  ],
  "author": "William Morris",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/890344.The_Water_Of_The_Wondrous_Isles"
}