{
  "title": "Doc",
  "description": "The year is 1878, peak of the Texas cattle trade. The place is Dodge City, Kansas, a saloon-filled cow town jammed with liquored-up adolescent cowboys and young Irish hookers. Violence is random and routine, but when the burned body of a mixed-blood boy named Johnnie Sanders is discovered, his death shocks a part-time policeman named Wyatt Earp. And it is a matter of strangely personal importance to Doc Holliday, the frail twenty-six-year-old dentist who has just opened an office at No. 24 Dodge House.Beautifully educated, born to the life of a Southern gentleman, Dr. John Henry Holliday is given an awful choice at the age of twenty-two: die within months in Atlanta or leave everyone and everything he loves in the hope that the dry air and sunshine of the West will restore him to health. Young, scared, lonely, and sick, he arrives on the Texas frontier just as an economic crash wrecks the dreams of a nation. Soon, with few alternatives open to him, Doc Holliday is gambling professionally; he is also living with Mária Katarina Harony, a high-strung Hungarian whore with dazzling turquoise eyes, who can quote Latin classics right back at him. Kate makes it her business to find Doc the high-stakes poker games that will support them both in high style. It is Kate who insists that the couple travel to Dodge City, because “that’s where the money is.” And that is where the unlikely friendship of Doc Holliday and Wyatt Earp really begins—before Wyatt Earp is the prototype of the square-jawed, fearless lawman; before Doc Holliday is the quintessential frontier gambler; before the gunfight at the O.K. Corral links their names forever in American frontier mythology—when neither man wanted fame or deserved notoriety.Authentic, moving, and witty, Maria Doria Russell’s fifth novel redefines these two towering figures of the American West and brings to life an extraordinary cast of historical characters, including Holliday’s unforgettable companion, Kate. First and last, however, Doc is John Henry Holliday’s story, written with compassion, humor, and respect by one of our greatest contemporary storytellers.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Westerns",
    "Historical",
    "Book Club",
    "Audiobook",
    "19th Century"
  ],
  "author": "Mary Doria Russell",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/8911226-doc"
}