{
  "title": "Wait for Me!",
  "description": "Deborah Mitford, Duchess of Devonshire, is the youngest of the famously witty brood of six daughters and one son that included the writers Jessica and Nancy, who wrote, when Deborah was born, “How disgusting of the poor darling to go and be a girl.” Deborah’s effervescent memoir Wait for Me! chronicles her remarkable life, from an eccentric but happy childhood roaming the Oxfordshire countryside, to tea with Adolf Hitler and her sister Unity in 1937, to her marriage to Andrew Cavendish, the second son of the Duke of Devonshire. Her life changed utterly with his unexpected inheritance of the title and vast estates after the wartime death of his brother, who had married “Kick” Kennedy, the beloved sister of John F. Kennedy. Her friendship with that family would last through triumph and tragedy.In 1959, the Duchess and her family took up residence in Chatsworth, the four-hundred-year-old family seat, with its incomparable collections of paintings, tapestry, and sculpture—the combined accumulations of generations of tastemakers. Neglected due to the economies of two world wars and punitive inheritance taxes, the great house soon came to life again under the careful attention of the Duchess. It is regarded as one of England’s most loved and popular historic houses.Wait for Me! is written with intense warmth, charm, and perception. A unique portrait of an age of tumult, splendor, and change, it is also an unprecedented look at the rhythms of life inside one of the great aristocratic families of England. With its razor-sharp portraits of the Duchess’s many friends and cohorts—politicians, writers, artists, sportsmen—it is truly irresistible reading, and will join the shelf of Mitford classics to delight readers for years to come.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "History",
    "Biography Memoir",
    "Autobiography",
    "British Literature"
  ],
  "author": "Deborah Mitford",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/8909722-wait-for-me"
}