{
  "title": "J is for Judgment",
  "description": "\"J\" is for Jaffe: Wendell Jaffe, dead these past five years. Or so it seemed until his former insurance agent spotted him in the bar of a dusty little Mexican resort halfway between Cabo San Lucas and La Paz.What did Kinsey Millhone have to say? \"In truth, the facts about Wendell Jaffe had nothing to do with my family history, but murder is seldom tidy and no one ever said revelations operate in a straight line. It was my investigation into the dead man's past that triggered the inquiry into my own, and in the end the two stories became difficult to separate.\"Five years ago, when Jaffe's thirty-five-foot ketch was found drifting off the Baja coast, it seemed a sure thing he'd gone overboard. The note he left behind admitted he was flat broke, his business bankrupt, and his real estate gambit nothing but a huge Ponzi scheme about to collapse with criminal indictment certain to follow. When the authorities descended on his bank and his books soon after, there was nothing left; Jaffe had stripped the lot.But Jaffe wasn't quite without assets. There was his $500,000 life insurance policy made out to his wife and underwritten by California Fidelity. With no corpse to prove death, however, the insurance company was in no hurry to pay the claim. Dana Jaffe had to wait out the statutory five years until her missing husband could be declared legally dead. Just two months before Wendell Jaffe was sighted in that Mexican bar, California Fidelity finally paid in full. Now they wanted the truth. And they were willing to hire Kinsey Millhone to dig it up.J is for judgment - the kind we're quick to make and often quicker to regret. It's about family, Wendell's and Kinsey's. \"J Is for Judgment\" is Kinsey Millhone's tenth excursion into the dark places of the heart where duplicity is the governing rule and murder the too-frequent result.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Audiobook",
    "Detective",
    "Thriller"
  ],
  "author": "Sue Grafton",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/89165.J_is_for_Judgment"
}