{
  "title": "Carrots and Sticks: Unlock the Power of Incentives to Get Things Done",
  "description": "Could you lose weight if you put $20,000 at risk? Would you finally set up your billing software if it meant that your favorite charity would earn a new contribution? If you’ve ever tried to meet a goal and came up short, the problem may not have been that the goal was too difficult or that you lacked the discipline to succeed. From giving up cigarettes to increasing your productivity at work, you may simply have neglected to give yourself the proper incentives.In Carrot and Sticks , Ian Ayres, the New York Times bestselling author of Super Crunchers , applies the lessons learned from behavioral economics—the fascinating new science of rewards and punishments—to introduce readers to the concept of “commitment contracts”: an easy but high-powered strategy for setting and achieving goals already in use by successful companies and individuals across America. As co-founder of the website stickK.com (where people have entered into their own “commitment contracts” and collectively put more than $3 million on the line), Ayres has developed contracts—including the one he honored with himself to lose more than twenty pounds in one year—that have already helped many find the best way to help themselves at work or home. Now he reveals the strategies that can give you the impetus to meet your personal and professional goals, including how to • motivate your employees• create a monthly budget • set and meet deadlines• improve your diet• learn a foreign language• finish a report or project you’ve been putting off• clear your desk Ayres shares engaging, often astounding, real-life stories that show the carrot-and-stick principle in action, from the compulsive sneezer who needed a “stick” (the potential loss of $50 per week to a charity he didn’t like) to those who need a carrot with their stick (the New York Times columnist who quit smoking by pledging a friend $5,000 per smoke . . . if she would do the same for him). You’ll learn why you might want to hire a “professional nagger” whom you’ll do anything to avoid—no, your spouse won’t do!—and how you can “hand-tie” your future self to accomplish what you want done now. You’ll find out how a New Zealand ad exec successfully “sold his smoking addiction,” and why Zappos offered new employees $2,000 to quit cigarettes. As fascinating as it is practical, as much about human behavior as about how to change it , Carrots and Sticks is sure to be one of the most talked-about books of the year.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Business",
    "Productivity",
    "Management",
    "Audiobook"
  ],
  "author": "Ian Ayres",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/8914703-carrots-and-sticks"
}