{
  "title": "Vowed",
  "description": "\"A book to rival TWILIGHT and VAMPIRE DIARIES, and one that will have you wanting to keep reading until the very last page! If you are into adventure, love and vampires this book is the one for you!\"--Vampirebooksite. com (re Turned)VOWED is book #7 in the Bestselling series THE VAMPIRE JOURNALS, which begins with TURNED (Book #1), a free download on Amazon with over 600 five star reviews!In VOWED (Book #7 of the Vampire Journals), Caitlin and Caleb find themselves in medieval Scotland, in 1350, a time of knights and shining armor, of castles and warriors, of the quest for the Holy Grail said to contain the key to true vampire immortality. Landing on the shores of the ancient Isle of Skye, a remote island off the Western coast of Scotland where only the most elite warriors live and train, they are ecstatic to reunite with Sam and Polly, Scarlet and Ruth, a human king and his warriors, and with all of Aiden’s coven.Before they can continue their mission for the fourth and final key, the time has come for Caleb and Caitlin to wed. Against the most amazing backdrop Caitlin could ever hope for, an elaborate vampire wedding is planned, including all of the ancient rituals and ceremonies that accompany it. It is the wedding of a lifetime, meticulously planned by Polly and the others, and Caitlin and Caleb are happier than they’ve ever been.Simultaneously, Sam and Polly, to their own surprise, are each falling deeply in love with one another. As their relationship accelerates, Sam surprises Polly with a vow of his own. And Polly surprises him with her own shocking news.But all is not well beneath the surface. Blake has appeared again, and his deep love for Caitlin might just threaten her union, on the day before her wedding. Sera has appeared again, too, and vows to break apart what she cannot have.Scarlet, too, finds herself in danger, as the source of her deep powers are revealed—along with the revelation of who are her true parents.Worst of all, Kyle has landed back in time, and has tracked down his old protégé, Rynd, to force him to use his shapeshifting skill to trick and kill Caitlin and her people. As they fall into his elaborate trap, Caitlin and the others find themselves in deeper danger than ever before. It will be a race to find the final key, before everyone Caitlin holds dear is wiped out for good. This time, she will have to make the hardest choices and sacrifices of her life.All 11 books in THE VAMPIRE JOURNALS are now available!",
  "genres": [
    "Vampires",
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Fiction",
    "Supernatural",
    "Romance"
  ],
  "author": "Morgan Rice",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/13161657-vowed"
}