{
  "title": "Study in Pyramidology",
  "description": "E. Raymond CaptAn in-depth study of the Great Pyramid of Giza in Egypt including an analysis of its historical record its construction details its symbolism and its relation to the Bible.\"As I set about the task of writing a new study of the Great Pyramid of Giza I am reminded of the words of John Taylor one of the earliest students of 'Many must approve before the thought will enter into the popular mind; and if that result ever takes place I am only one among many who are entitled to a commendation; nay there is no room for commendation to any one for all do but impart what has been given.\"I am only one in a long line of students who have expounded on the Great Pyramid. My original work on the subject  The Great Pyramid Decoded (first published in 1971) was only intended to be an introduction to the subject. It was to draw attention to other more comprehensive works. (Ex.  The Great Pyramid - Its Divine Message  by David Davidson and H. Aldersmith;  Great Pyramid Passages  by John and Morton Edgar;  Pyramidology  in four volumes by Dr. Adam Rutherford).\"All these writers have passed away and their works are out of print...[Artisan Publishers stocks Dr. Rutherford's four volumes,  and  Great Pyramid Passages  by John and Morton Edgar...see our Pyramidology/Stonehenge section ed.]. Modern day writers on the Great Pyramid have brought out some excellent books but they all fail to present the most important feature of the Great Pyramid - God's plan for humanity architecturally embodied in its construction.\"It was the desire to fill this  void  that motivated me to produce a second book on the Great Pyramid expanding my earlier work with additional details and illustrations without weighing it down with complex and technical information available from past research. And most important to present the spiritual aspects and current theories concerning prophecy revealed in the design of the Pyramid as an unbiased observer. I will let the reader choose what position he or she will take.\" - E. Raymond CaptMr. Capt through his efforts as explained above has richly rewarded the reader with the contents of this valuable book. It is truly an in-depth study of the Great Pyramid of Giza in Egypt including an analysis of its historical record its construction details its interior passages its symbolism and its relationship to the Bible. Most interesting is the section dealing with the 20th century probes into its interior and its remarkable coffin in the King's Chamber not to mention the discovery that the Great Pyramid is the source for our modern weights and measures.Nearly every page is accompanied by a drawing or photograph placed there to enable the reader to better understand the subject and thereby receive a greater blessing.Paperback264 pages",
  "genres": [
    "History",
    "Christian",
    "Science"
  ],
  "author": "E. Raymond Capt M.A.  A.I.A. & F.S.A.",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/1316176.Study_in_Pyramidology"
}