{
  "title": "King Solomon's Temple / A Study of its Symbolism",
  "description": "E. Raymond CaptThis study will not only lead you to the \"Lord of the Temple\" but will reveal a truth hidden by the Almighty for illumination in this present day.The Temple of Solomon known as the House of God was in some respects the most wonderful building constructed by human craft. The biblical reference of the Temple conveys to the reader it's grandeur and holiness but reveals so few details that little hope was held of ever producing an accurate reconstruction.Many attempts in the past to reconstruct the Temple have produced a wide variety of sketches and plans some of them fantastically imaginative.Modern archaeologist seeking to shed light on the Bible's most famous building have dug amid the ancient masonry of Mt. Moriah or Temple Hill in Jerusalem and searched for parallels and origins in contemporary buildings in Egypt Mesopotamia and Phoenicia.Their discoveries have revealed the architectural skill and building power of Solomon and his successors. Not only has the accuracy of the sacred scriptures been confirmed but we can more vividly visualize the buildings decorations and furnishings of the temple.Today a visitor to Jerusalem can see the very stones placed in position by the masons of Solomon. He can explore the ingenious system by which water was brought to the Temple Hill and stored there. He can enter the great cavern under the old city now known with some justification as Solomon's Quarries where the famous white limestone that formed the basic building material of the Temple was cut and finished by Phoenician craftsman.In recent years several conceptions of Solomon's Temple have been published. The Howland-Garber model a work incorporating most recent discoveries is in the opinion of the author the most realistic presentation to date. Linear illustrations of this reconstruction are shown in this work.It is the author's hope that through this brief study of the Temple the reader will have a better understanding of it's spiritual meaning.Paperback96 pages",
  "genres": [],
  "author": "E. Raymond Capt",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/1316177.King_Solomon_s_Temple_A_Study_of_its_Symbolism"
}