{
  "title": "The Ocean in the Closet",
  "description": "“Yuko Taniguchi’s writing is remarkable for its music and vision. In the sounds of ice breaking in the river, silkworms eating mulberry leaves in the night, and Mahler played on the double bass, her characters hear the music of human suffering and redemption. . . . The Ocean in the Closet is a compelling and moving novel.”—Kyoko MoriIn sunny California, the Vietnam War may have just ended, but nine-year-old Helen Johnson’s world is beginning to crumble. Her father, a former POW and Vietnam veteran, has become increasingly distant; her mother, a Japanese adoptee, is struggling with mental illness; and her six-year-old brother is too young to understand what’s happening. Determined to find out more about her mother’s past and with a boldness that belies her timid self-image, Helen writes to her great-uncle Hideo in Japan, beginning a journey that will take her across the ocean and through the imperial legacies of both countries.As Hideo and his wife recount the stories of his family’s silk business in Hiroshima, their experiences in China and Japan during and after World War II, and the fate of his sister Ume, Helen’s grandmother, they discover that although their lives have been darkened by war, their future can be healed by tending their shared roots. In this beautiful debut novel, Yuko Taniguchi creates a moving story of hope and redemption, of tragedy and resilience, and of the secrets, burdens, and ultimate strength that lie in a young girl’s heart.Yuko Taniguchi, author of the critically acclaimed book of poetry Foreign Wife Elegy, was born in Yokohama, Japan, in 1975. At the age of fifteen, she came to the United States and attended high school in Maryland, obtaining her collegiate degrees in Minnesota, where she continues to make her home. Visit her website at www.yukotaniguchi.com.",
  "genres": [
    "Japan",
    "Fiction",
    "Historical Fiction",
    "Literary Fiction",
    "Mental Illness",
    "Family",
    "Asian Literature"
  ],
  "author": "Yuko Taniguchi",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/892329.The_Ocean_in_the_Closet"
}