{
  "title": "Text Me, A Tale of Love and Technology",
  "description": "FROM APEX REVIEWS\"Surprisingly witty, Text Me, A Tale Of Love And Technology is an engaging read. In clever fashion, author Alisa Dana Steinberg has crafted a touching, timely love story set against the backdrop of the Techno Revolution currently engulfing modern society. Many readers are sure to find themselves empathizing with Penelope's low-tech plight, just as much as they're sure to identify with her ongoing struggle to learn what really matters most when it comes to the leanings of the heart. Given the countless conveniences that they provide, it's easy to become swept up in the thrill of embracing BlackBerries, iPhones, iPads, Wii systems, and the like; however, as Penelope ultimately realizes, when it comes to real, lasting love, gizmos can only go so far - forcing us to discover that which will sustain us long after their enticing allure has passed. An equally entertaining and enlightening read.\" - Kendra Carroll, Apex Reviews ABOUT TEXT ME, A TALE OF LOVE AND TECHNOLOGYSmall-town girl Penelope McAdams has one huge problem - she doesn't know a thing about technology - and when she moves to the all-wired-up and wireless world of New York City, where she makes the mistake of buying her first Blackberry minus the text messaging service (the modus operandi of communications for the Manhattan social scene), she's in for trouble ... In the romantic comedy \"Text Me, A Tale of Love and Technology,\" Penelope's failed love life causes her to go on a quest to recover lost and important texts sent from her male suitors, resulting in a series of mishaps with everything from MP3 players to gaming equipment and two very different men who compel her to choose between the truth and a lie.Aspiring to become an upwardly-mobile Manhattan woman, Penelope receives technology lessons from Ted Hollis, the anti-social-techno-geek who retrieves her texts, and begins a relationship with Luke Carson, the handsome shipping entrepreneur who texts her for a night out on the town. All seems to be going well, but Ted needs more time than expected to teach her that an Apple Store isn’t a fruit stand and how to work an iPod and GPS locator when she can’t even work a simple coffee machine, so she finds herself spending a majority of her afternoons and evenings with both Luke, the type of man she’s always dreamt of, and Ted, the type of man she never desired … But when Ted survives her knocking him unconscious with a Wii Remote, and endures her frantic, midnight phone calls when she can’t turn on the HDTV, does Penelope have a change of heart? With a tie-in to the film \"It's a Wonderful Life\" and its main character, George Bailey, who Penelope shares similarities with in her yearning to start anew outside of a small town, this is a humorous story of self-discovery and love.",
  "genres": [],
  "author": "Alisa Steinberg",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/8922213-text-me-a-tale-of-love-and-technology"
}