{
  "title": "Harry Potter and the Paganization of Culture",
  "description": "The Harry Potter Series, book by book. Parental Strategies for Healthy Family Culture. Pope Benedict and Harry Potter. The War of Disinformation and Opinion. Harry Potter and the Gnostic Mind. Where Is It All Going? Twilight of the West. The Golden Compass or the Moral Compass? Master story-teller and artist Michael O’Brien—the man to whom CNN went for comment on Harry Potter—has penned the definitive work assessing the Potter phenomenon. This book is essential reading for all parents whose children have read or are considering reading the wildly popular offerings by J.K.Rowling and similar works such as Stephenie Meyer’s Twilight series. Although this is an analytical work, the reader will be captivated from the beginning, from the must-read preface onward. O’Brien's earlier work, A Landscape with Dragons, delineated authentic Christian fantasy literature from its counterfeits. Now in Harry Potter and the Paganization of Culture, he fascinatingly contrasts Potter-world with C.S. Lewis’s Narnia and with Tolkein’s The Lord of the Rings, and specifically Harry with Frodo. For those whose children have consumed Potter, O’Brien’s analysis will enable parents to comprehend the messages which have been fed their children and give them the points and arguments which will hopefully be the antidote to properly reset their moral order. The book goes beyond Potter, however, to address other bestselling series such as Twilight by Stephenie Meyer and Phillip Pullman’s The Golden Compass. In addition to these and other fantasy books, O’Brien reviews the films which they spawned. In all, the author’s new book teaches Christians how to discern harmless fantasy literature and film from that which is destructive to heart, mind and soul. I cannot recommend this work highly enough. John-Henry Westen Co-Founder and Editor-in-Chief LifeSiteNews.com See F&T Press for more info www.ftbookstore.com",
  "genres": [
    "Nonfiction",
    "Christian",
    "Catholic",
    "Education"
  ],
  "author": "Michael D. O'Brien",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/8932174-harry-potter-and-the-paganization-of-culture"
}