{
  "title": "Jon Hansen and the Dragon Clan of Yden",
  "description": "This edition is out of print, for the new revised edition see The Last Great Wizard of Yden.Jon Hansen is a seemingly ordinary, artistically inclined teen who lives in a Southern California beach community. On his 16th birthday, he witnesses the mysterious disappearance of his father in a flash of light and a sound like muffled thunder. Jon thinks his father has been kidnapped, but no one believes him. He'd always figured his father's amazing stories about a fantastic planet in a parallel universe were just fairy tales. But when Jon discovers his father's magical transporter cuff, he begins a trans-dimensional journey that changes his life forever. With the help of three unlikely school friends and a beautiful warrior princess he rescues on Yden, Jon embarks on a quest to free his father from the clutches of the evil Wolf Clan wizard Efysian. Along the way, Jon discovers his own special kind of magic, matches wits with an ambitious and ruthless Warlord and reunites with the reclusive Dragon Clan grandfather he never knew he had. Ultimately, Jon fights for his own life as he battles the fearsome Wolf Clan wizard who is draining the magic from Yden. Jon Hansen and the Dragon Clan of Yden provides a wonderful escape to a place where dragons are drawn and come to life off a sheet of paper, where one can think of a place and instantly be transported there and where good triumphs over evil-even when it appears like victory is against all odds. Full of fast-paced action, witty dialogue and unforgettable characters, Jon Hansen and the Dragon Clan of Yden gives us a hero for our times. Recommended for ages 12 and up.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Dragons",
    "Magic",
    "Adventure",
    "Science Fiction Fantasy",
    "Young Adult Fantasy"
  ],
  "author": "S.G. Rogers",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/8928516-jon-hansen-and-the-dragon-clan-of-yden"
}