{
  "title": "Writings",
  "description": "One of the most vivid, influential, and controversial figures of the American founding, Alexander Hamilton was an unusually prolific and vigorous writer. As a military aide to George Washington, forceful critic of the Articles of Confederation, persuasive proponent of ratification of the Constitution, first Secretary of the Treasury, and leader of the Federalist party, Hamilton devoted himself to the creation of a militarily and economically powerful American nation guided by a strong republican government. His public and private writings demonstrate the perceptive intelligence, confident advocacy, driving ambition, and profound concern for honor and reputation that contributed both to his rise to fame and to his tragic early death.Arranged chronologically, Writings contains more than 170 letters, speeches, essays, reports, and memoranda written between 1769 and 1804. Included are all 51 of Hamilton's contributions to The Federalist, as well as subsequent writing calling for a broad construction of federal power under the Constitution; his famous speech to the Constitutional Convention, which gave rise to accusations that he favored monarchy; early writings supporting the Revolutionary cause and a stronger central government; his visionary reports as Treasury secretary on the public credit, a national bank, and the encouragement of American manufactures; a detailed confession of adultery made by Hamilton in order to defend himself against charges of official misconduct; and his self-destructive attack on John Adams during the 1800 campaign. An extensive selection of private letters illuminates Hamilton's complex relationship with George Washington, his deep affection for his wife andchildren, his mounting fears during the 1790s regarding the Jeffersonian opposition and the French Revolution, and his profound distrust of Aaron Burr. Included in an appendix are conflicting eyewitness accounts of the Hamilton-Burr duel.",
  "genres": [
    "History",
    "Politics",
    "Philosophy",
    "American History",
    "Economics",
    "Nonfiction",
    "American Revolution"
  ],
  "author": "Alexander Hamilton",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/89305.Writings"
}