{
  "title": "Fred & Edie",
  "description": "In the winter of 1922 Edith Thompson and her younger lover, Freddy Bywaters, were found guilty of murdering Percy Thompson, Edith's boorish husband. The two lovers were executed in a whirl of publicity in 1923. The case caused a sensation, a crime of passion that gripped the nation's imagination and became the raw material for Jill Dawson's sensual and captivating novel Fred and Edie, a fictional account of the lovers' romance and their subsequent trial, predominantly told through Edie's imaginary letters addressed to her lover, \"Darlint Freddie\". This is a remarkable novel, that brilliantly evokes the suburban world of 1920s London (T.S. Eliot's The Waste Land, published the same year as the trial, runs like a leitmotif throughout the novel). Edie, viewed from the public gallery as \"silly, vain\" is a superb literary creation--sensual, intelligent, articulate and liberated, bitterly denouncing in her letters to Freddy a world that denies \"that our love might be a real love, on a par with other great loves. That just because you are from Norwood and work as a ship's laundry man and I grew up in Stamford Hill and read a certain kind of novel, we are not capable of true emotions, of having feelings and experiences that matter\".Dawson's novel gradually reveals that Edie's \"crime\" is actually her articulate, contradictory and assertive femininity. \"I am not all sweetness and light\" she insists, but it is her independent behaviour that ultimately stands trial, as Freddy becomes an increasingly enigmatic and questionable figure on the margins of the novel. Elegantly written and carefully researched, Fred and Edie is as passionate and assured as the tragic heroine it portrays. --Jerry Brotton",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Crime",
    "Historical",
    "Literary Fiction",
    "British Literature",
    "True Crime"
  ],
  "author": "Jill Dawson",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/892331.Fred_Edie"
}