{
  "title": "Bridge of Spies: A True Story of the Cold War",
  "description": "Who were the three men the American and Soviet superpowers exchanged at Berlin's Glienicke Bridge and Checkpoint Charlie in the first and most legendary prisoner exchange between East and West? Bridge of Spies vividly traces their paths to that exchange on February 10, 1962, when their fate helped to define the conflicts and lethal undercurrents of the most dangerous years of the Cold War.Bridge of Spies is the true story of three extraordinary characters – William Fisher, alias Rudolf Abel, a British born KGB agent arrested by the FBI in New York City and jailed as a Soviet superspy for trying to steal America’s most precious nuclear secrets; Gary Powers, the American U-2 pilot who was captured when his plane was shot down while flying a reconnaissance mission over the closed cities of central Russia; and Frederic Pryor, a young American graduate student in Berlin mistakenly identified as a spy, arrested and held without charge by the Stasi, East Germany’s secret police.  By weaving the three strands of this story together for the first time, Giles Whittell masterfully portrays the intense political tensions and nuclear brinkmanship that brought the United States and Soviet Union so close to a hot war in the early 1960s. He reveals the dramatic lives of men drawn into the nadir of the Cold War by duty and curiosity, and the tragicomedy of errors that eventually induced Khrushchev to send missiles to Castro. Two of his subjects — the spy and the pilot — were the original seekers of weapons of mass destruction. The third, an intellectual, fluent in German, unencumbered by dependents, and researching a Ph.D. thesis on the foreign trade system of the Soviet bloc, seemed to the Stasi precisely the sort of person the CIA should have been recruiting. He was not. In over his head in the world capital of spying, he was wrongly charged with espionage and thus came to the Agency’s notice by a more roundabout route. The three men were rescued against daunting odds by fate and by their families, and then all but forgotten. Yet they laid bare the pathological mistrust that fueled the arms race for the next 30 years. Drawing on new interviews conducted in the United States, Europe and Russia with key players in the exchange and the events leading to it, among them Frederic Pryor himself and the man who shot down Gary Powers, Bridge of Spies captures a time when the fate of the world really did depend on coded messages on microdots and brave young men in pressure suits. The exchange that frigid day at two of the most sensitive points along the Iron Curtain represented the first step back from where the superpowers had stood since the building of the Berlin Wall the previous summer – on the brink of World War III.",
  "genres": [
    "History",
    "Nonfiction",
    "Espionage",
    "Politics",
    "War",
    "Audiobook",
    "Russia"
  ],
  "author": "Giles Whittell",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/8931789-bridge-of-spies"
}