{
  "title": "Under a Cruel Star: A Life in Prague, 1941-1968",
  "description": "“A story of the human spirit as its most indomitable... one of the outstanding autobiographies of the century.” – San Francisco Chronicle“Once in a rare while we read a book that puts the urgencies of our time and ourselves in perspective, making us confront the darker realities of human nature... Mrs. Kovaly experienced the two supreme horrors of what Hannah Arendt called this terrible century. But her book is not just a personal memoir of inhumanity. In telling her story – simply, without self-pity – she illuminates some general truths of human behavior... Quietly, with cumulative force, it shows us how the totalitarian state feeds on the blindness and the weakness of man.” – Anthony Lewis, The New York Times“A wonderfully expressive writer. Although her approach is above all personal, Kovaly’s reflections on her experiences reveal a high degree of insight into politics, individual and institutional behavior, and the formation of attitudes.” – Christian Science Monitor“A Jew in Czechoslovakia under the Nazis, Kovaly spent the war years in the Lodz ghetto and several concentration camps, losing her family and barely surviving herself. Returning to Prague at the end of the war, she married an old friend, a bright, enthusiastic young Jewish economist named Rudolf Margolius, who saw the country’s only hope for the future in the Communist Party. Thereafter, Rudolf became deputy minister for foreign trade. For a time, the Margoliuses lived like royalty, albeit reluctantly, but then, in a replay of the Stalinist purges of the 1930s, Rudolf and others, mostly of Jewish background, were arrested and hung in the infamous Slansky Trial of 1952. Kovaly’s memoir of these years that end with her emigration to the West after the Soviet invasion of Czechoslovakia in 1968 are a tragic story told with aplomb, humor and tenderness. The reader alternately laughs and cries as Kovaly describes her mother being sent to death by Dr. Mengele, Czech Communist Party leader Klement Gottwald drunk at a reception, the last sight of her husband, the feverish happiness of the Prague Spring. Highly recommended.” – Publishers Weekly",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "Holocaust",
    "Biography",
    "World War II",
    "War"
  ],
  "author": "Heda Margolius Kovály",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/8937028-under-a-cruel-star"
}