{
  "title": "Thunder Below!: The USS Barb Revolutionizes Submarine Warfare in World War II",
  "description": "The thunderous roar of exploding depth charges was a familiar and comforting sound to the crew members of the USS Barb, who frequently found themselves somewhere between enemy fire and Davy Jones's locker. Under the leadership of her fearless skipper, Captain Gene Fluckey, the Barb sank the greatest tonnage of any American sub in World War II. At the same time, the Barb did far more than merely sink ships-she changed forever the way submarines stalk and kill their prey. This is a gripping adventure chock-full of \"you-are-there\" moments. Fluckey has drawn on logs, reports, letters, interviews, and a recently discovered illegal diary kept by one of his torpedomen. And in a fascinating twist, he uses archival documents from the Japanese Navy to give its version of events. The unique story of the Barb begins with its men, who had the confidence to become unbeatable. Each team helped develop innovative ideas, new tactics, and new strategies. All strove for personal excellence, and success became contagious. Instead of lying in wait under the waves, the USS Barb pursued enemy ships on the surface, attacking in the swift and precise style of torpedo boats. She was the first sub to use rocket missiles and to creep up on enemy convoys at night, joining the flank escort line from astern, darting in and out as she sank ships up the column.Surface-cruising, diving only to escape, \"Luckey Fluckey\" relentlessly patrolled the Pacific, driving his boat and crew to their limits. There can be no greater contrast to modern warfare's long-distance, videogame style of battle than the exploits of the captain and crew of the USS Barb, where they sub, out of ammunition, actually rammed an enemy ship until it sank. Thunder Below! is a first-rate, true-life, inspirational story of the courage and heroism of ordinary men under fire.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "Military History",
    "World War II",
    "War",
    "Audiobook"
  ],
  "author": "Eugene B. Fluckey",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/893889.Thunder_Below_"
}