{
  "title": "Wingshooters",
  "description": "\"Revoyr does a remarkable job of conveying [protagonist] Michelle’s lost innocence and fear through this accomplished story of family and the dangers of complacency in the face of questionable justice.\"-- Publishers Weekly (starred review)\"Revoyr's fourth novel is a coming-of-age saga in which racism cuts across loyalties between family and friends . . . Gripping and insightful.\"-- Kirkus ReviewsMichelle LeBeau, the child of a white American father and a Japanese mother, lives with her grandparents in Deerhorn, Wisconsin--a small town that had been entirely white before her arrival. Rejected and bullied, Michelle spends her time reading, avoiding fights, and roaming the countryside with her dog Brett. She idolizes her grandfather, Charlie LeBeau, an expert hunter and former minor league baseball player who is one of the town's most respected men. Charlie strongly disapproves of his son's marriage to Michelle's mother but dotes on his only grandchild.This fragile peace is threatened when the expansion of the local clinic leads to the arrival of the Garretts, a young black couple from Chicago. The Garretts' presence deeply upsets most of the residents of Deerhorn--when Mr. Garrett makes a controversial accusation against one of the town leaders, who is also Charlie LeBeau's best friend.In the tradition of To Kill a Mockingbird, A River Runs Through It, and Snow Falling on Cedars , Revoyr's new novel examines the effects of change on a small, isolated town, the strengths and limits of community, and the sometimes conflicting loyalties of family and justice. Set in the expansive countryside of Central Wisconsin, against the backdrop of Vietnam and the post-civil rights era, Wingshooters explores both connection and loss as well as the complex but enduring bonds of family.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Historical",
    "Coming Of Age",
    "Race",
    "Japanese Literature"
  ],
  "author": "Nina Revoyr",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/8936934-wingshooters"
}