{
  "title": "Perseverance",
  "description": "In this inspiring and beautifully illustrated book, bestselling author Margaret Wheatley offers guidance to people everywhere for how to persevere through challenges in their personal lives, with their families, at their workplaces, in their communities, and in their struggles to make a better world. She provides hope, wisdom, and perspective for learning the discipline of perseverance.Wheatley does not offer the usual feel-good, rah-rah messages. Instead, she focuses on the situations, feelings, and challenges that can, over time, cause us to lose heart or lose our way. Perseverance is a day-by-day decision not to give up. We have to notice the moments when we feel lost or overwhelmed or betrayed or exhausted and note how we respond to them. And we have to notice the rewarding times, when we experience the joy of working together on something hard but worthwhile, when we realize we’ve made a small difference.In a series of concise and compassionate essays Wheately names a behavior or dynamic—such as fearlessness, guilt, joy, jealousy—that supports or impedes our efforts to persevere. She puts each in a broader human or timeless perspective, offering ways to either live by or transcend each one. These essays are self-contained—you can thumb through the book and find what attracts you in the moment. Perseverance helps you to see yourself and your situation clearly and assume responsibility for changing a situation or our reaction to it if it’s one that troubles us. There deliberately are no examples of other people or their experiences. You are the example—your personal experiences are the basis for change.In addition to Wheatley’s graceful essays there are poems and quotations drawn from traditions and cultures around the world and throughout history. The book is deeply grounded spiritually, accessing human experience and wisdom from many sources. This grounding and inclusiveness support the essential message—human being throughout time have persevered. We’re just the most recent ones to face these challenges, and we can meet them as those who came before us did. As Wheatley quotes the elders of the Hopi “We are the ones we have been waiting for.”",
  "genres": [
    "Leadership",
    "Nonfiction",
    "Spirituality",
    "Self Help",
    "Philosophy",
    "Psychology",
    "Poetry"
  ],
  "author": "Margaret J. Wheatley",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/8942184-perseverance"
}