{
  "title": "Borders and Boundaries: How Women Experienced the Partition of India",
  "description": "As an event of shattering consequence, the Partition of India remains significant today. While Partition sounds smooth on paper, the reality was horrific. More than eight million people migrated and one million died in the process. The forced migration, violence between Hindus and Muslims, and mass widowhood were unprecedented and well-documented. What was less obvious but equally real was that millions of people had to realign their identities, uncertain about who they thought they were. The rending of the social and emotional fabric that took place in 1947 is still far from mended.While there are plenty of official accounts of Partition, there are few social histories and no feminist histories. Borders and Boundaries changes that, providing first-hand accounts and memoirs, juxtaposed alongside official government accounts. The authors make women not only visible but central. They explore what country, nation, and religious identity meant for women, and they address the question of the nation-state and the gendering of citizenship.In the largest ever peace-time mass migration of people, violence against women became the norm. Thousands of women committed suicide or were done to death by their own kinsmen. Nearly 100,000 women were \"abducted\" during the migration. A young woman might have been separated from her family when a convoy was ambushed, abducted by people of another religion, forced to convert, and forced into marriage or cohabitation. After bearing a child, she would be offered the opportunity to return only if she left her child behind and if she could face shame in her natal community. These stories do not paint their subjects as victims. Theirs are the stories of battles over gender, the body, sexuality, and nationalism-stories of women fighting for identity.",
  "genres": [
    "History",
    "India",
    "Nonfiction",
    "Feminism",
    "Politics",
    "Pakistan",
    "Womens"
  ],
  "author": "Ritu Menon",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/895366.Borders_and_Boundaries"
}