{
  "title": "The Fresco",
  "description": "The FrescoThe bizarre events that have been occurring across the United States--unexplained \"oddities\" tracked by Air Defense, mysterious disappearances, shocking deaths--seem to have no bearing on Benita Alvarez-Shipton's life. That is, until the soft-spoken thirty-six-year-old bookstore manager is approached by a pair of aliens asking her to transmit their message of peace to the powers that be in Washington. Suddenly an ordinary woman with a poor self-image and low self-esteem has been thrust into the limelight, as she leaves behind an Albuquerque home on the brink of foreclosure and a drunken bully of an abusive husband to undertake a mission of utmost importance to her planet and its peoples.Her obligation does not end once the message is delivered, however, for the Pistach have offered their human hosts a spectacular opportunity for knowledge and enrichment. And Benita is to act as sole liaison between the two sentient races. The more she learns about the extraterrestrials who transformed her gray existence, the more her appreciation grows for their culture, their beliefs, and their art--especially the ancient and mystical Fresco that appears to dominate their collective lives. And the easier it becomes to shed the psychological and societal restraints that inhibited her own growth as an individual.But alongside the promise is a dire, unspoken threat. Because the Pistach are not the only space-faring species making their presence known on Earth. There are others--cold, malevolent, hungry--who have now set their sights on Benita, and their accomplices may be as close as Capitol Hill. And the desperate race to save herself and two worlds could carry Benita Alvarez far from her home planet ... and light years away from anything she has ever been.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Aliens",
    "Feminism",
    "Speculative Fiction"
  ],
  "author": "Sheri S. Tepper",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/894514.The_Fresco"
}