{
  "title": "Meditation and Psychotherapy: A Professional Training Course for Integrating Mindfulness into Clinical Practice",
  "description": "Course Apply the R.A.I.N. technique in your work with clients• Utilize mindfulness meditation to clear blockages that prevent living fully• Discuss basic concepts of Buddhist psychology• Recognize aspirations and intentions that support awakening• Practice a variety of different guided meditations• Adapt specific mindfulness practices to individual client needs• Integrate mindfulness into your personal and professional lifeLearning How to Face Our Tangled Emotions and Release Our Limiting BeliefsThere are many skillful means that we can use to train ourselves and our clients to become aware, teaches Brach, a psychotherapist and meditator of more than 30 years. But they all lead to one essential Can I be here in this moment?Using her R.A.I.N. technique, a four-part process that helps us learn how to stop running away from our tangled emotions and start to lovingly face them, we'll investigate and unblock the beliefs that cause suffering. Guiding us through meditations and practices on mindfulness, loving-kindness, forgiveness, allowing, and more, Brach shares key tools and expert insights for moving through this liberating process so that we can open and allow our lives to unfold, moment by moment.\"Mindfulness can strengthen our attention, awaken compassion and empathy, and expand our acceptance of our own inner states,\" teaches Brach. Meditation and Psychotherapy draws on the strengths of mindfulness meditation and the practice of modern therapeutic methods to help clear the emotional blocks holding us back.R.A.I.N., a liberating four-step process for learning how to end the suffering caused by clinging to our emotions• How we all can awaken from the trance of unworthiness using mindful awareness and lovingkindness• The alchemy of self-compassion and how it can help in our relationships with others• Why we don't have to believe our thoughts―the transformative power of self-inquiry• \"Touch and go,\" an approach for gently disarming the energy of trauma• Tips for adapting practices for your individual client's needs• A new model of psychotherapy that emphasizes the client/therapist relationship as an unfolding partnership• More than eight hours of expert insights, practices, and tips for using mindfulness meditation and modern therapeutic methods to help untangle our difficult emotions",
  "genres": [
    "Psychology",
    "Spirituality",
    "Nonfiction",
    "Social Work"
  ],
  "author": "Tara Brach",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/8950823-meditation-and-psychotherapy"
}