{
  "title": "Falling Star",
  "description": "Falling Star is about the discovery of mysterious objects buried deep in the ocean and what happens when they wake up and start sending signals to outer space. Mike, pulled back into a clandestine world to help decipher these signals, is attacked by gangs of ordinary Americans bent on killing him. On top of everything else, he learns that a revered friend has died. Will the death of Mike's friend mean that the secret of the objects will remain forever buried in the silt and muck of the ocean bottom? Set in the ocean, on land, and in the air,Paul Caruba, charter member of the National Book Critics Circle says the \"It is rare when a novelist makes his debut with as powerful a novel as Philip Chen's Falling Star .... This novel stands out for the way you are introduced not just to the characters, but the physical reality in which they live, the sights and even the smells. Slowly and then with increasing intensity, the mysteries are unraveled, the enemies identified, as life and death often hangs in the balance ... Chen brings an authenticity to the novel that provides a heart-pounding reality that forces you to ask \"What if?\" What if Earth was under observation by those from another planet that is circling a dying sun? What if they intended to colonize it? What if the year for this was 2013? If you read just one novel in 2011, make it Falling Star.\"Other reviewers have said the following about Falling \"In 'Falling Star' Philip Chen writes with such quiet authority and such a wealth of expert knowledge that I was lulled into the belief that I was reading a factual version of events rather than a work of fiction. The book quickly sets off with the discovery of objects suggestive of an alien presence on Earth and this aspect of the book is quietly progressed throughout, culminating in a conclusion which raises as many questions as it answers, giving the reader plenty to think about. At the same time I was carried through the book by the compulsively exciting tale of undercover agents and the infiltration of their organisation by a network of spies so carefully absorbed into American society as to be almost untraceable. The main character, Mike, was well drawn and likeable but complex and psychologically convincing. I also enjoyed the presence of strong female characters in the inimitable Mildred and the brilliant and beautiful Martha. Interesting premise, convincingly handled in an exciting and compelling novel.\"\"Mr. Chen's writing style is precise, almost military and chock full of information that makes the reader wonder if this story might not be fiction at all, but something very real and very disturbing.\"\"With the political/military intrigue of a Tom Clancy novel and the Sci-Fi feel of the 2001/2010/2061 Arthur C. Clarke novels coupled with the page turner, fast paced plot of a Dan Brown novel how could you go wrong.\"\"... an absolutely stunning read! I could not stop reading! I was intrigued from the first words, and just kept on reading.\"\"From the early pages, I knew this was a writer to be taken seriously. Mr. Chen has penned a dynamic, thought-provoking cross between contemporary thriller and science fiction tome. His characters are well developed, the multiple storylines complex, and the ending ...\"\"I haven't enjoyed a book this much since Tom Clancy stopped putting out novels.\"\"Mysterious and provocative, an intelligently written page turner by someone who knows his subject. Once I began reading Falling Star, I had to read this well-detailed thriller right through to the end.\"\"Anyone interested in the future of America's defense and weaponry will find this novel gripping.\"\"I will never see the ocean in the same light again.\"Cover image by Tomo Yun",
  "genres": [
    "Thriller",
    "Fiction"
  ],
  "author": "Philip Chen",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/8942913-falling-star"
}