{
  "title": "Queen Takes King",
  "description": "Jackson Power. A name like the man himself: aggressive, ambitious, bullish. The prodigal son, heir to millions, built his own Manhattan real estate empire and revels in seeing his moniker -- Power! -- on glittering skyscrapers around the city that never sleeps. Beneath his desk in the towering Power headquarters, Jacks has a stack of newspapers and photographs of himself, shaking hands with the most famous men and women of his generation. Here's a man who's always loved to see his name in ink. Until now. Cynthia Hunsaker Power. She is the epitome of elegance and society. The perfect foil for a man of Jacks's stature -- his first and only wife, he'd proudly tell any of his Master of the Universe (read: Gargoyle) friends. The former prima ballerina arrived in New York at eighteen, off the bus from Missouri, brimming with talent, beauty, and drive. She met a struggling painter, fell in love, and only later learned she'd won the Power lottery. Now she sits on the New York Ballet Theater board, effortlessly outdoing herself with one gala after another. But the press coverage of the Power silver anniversary party at the Waldorf takes the cake.Jacks Power appears twice in the \"New York Post\" the next morning -- once gallantly dancing with his wife of twenty-five years, Cynthia; and once hand in hand with Lara Sizemore, morning television star, exiting her Upper West Side apartment building that very same night.To Jackson Power, Lara is ever ything his wife Cynthia is not -- wild, voluptuous, mysterious, and selfsustaining. A new passion has swept Jacks off his well-shod feet -- and she is Lara Sizemore. He is ready for the divorce, ready to marry his mistress, America's Sweetheart. But Cynthia isn't ready to be swept out of the picture quite so easily.Let the Divorce Games begin.Whether they're changing the locks on each other in their Park Avenue triplex or sabotaging each other's dinner parties, it's The People's Billionaire vs. The Ballerina, in a split-up that will trump the most scandalous divorces known to polite New York society. Cynthia's got their twenty-five-year-old artist daughter, Vivienne, in her camp; Jacks has the young bartending playwright Adrian, whom he intends to pay to seduce Cynthia into an easy split. But Cynthia might have a few tricks up her well-tailored Chanel sleeve, and she -- like Jacks -- is prepared to use every weapon in her divorce arsenal to win the game. It's a battle of wits, of charm, of two of the biggest egos -- and personalities and bank accounts -- in Manhattan, and neither side will go down without a fight.From beloved and best selling author Gigi Levangie Grazer comes a sexy, sassy, smart new novel, \"Queen Takes King.\"",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Romance",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Gigi Levangie Grazer",
  "average_rating": "3.09",
  "url": "https://www.goodreads.com/book/show/895304.Queen_Takes_King"
}