{
  "title": "Colt's Choice",
  "description": "Bad in Boots - Colt's Choice By Patrice Michelle Book Two in the Bad in Boots series Elise Hamilton.sultry green eyes, long dark hair and kissable lips, damn, he'd never been more attracted to a woman. Colt has waited half his life to fully own the Lonestar ranch. The new part owner of his rodeo ranch might be one of the smartest, sexiest women he'd ever laid eyes on, but Colt knows she's out of his league and 100% wrong for him. Even if he could ignore the fact she's a city-slicker, he won't allow himself to forget she was born with a silver spoon in her mouth. He'd learned from his father's mistakes and had no intention of repeating history. But, like all temptations, the more he tells himself Elise Hamilton is \"hands off', the more he wants to put his hands on. Colt Tanner.tall, broad-shouldered and lean hipped, there's just something about the steely confidence this rough-around-the-edges cowboy exudes that takes Elise's breath away. He may be her partner by circumstance, but Elise knows he's the bona fide real deal, aka Mr. Right. But first she has to concentrate on proving to Colt she's serious about helping him run the ranch. Man, if only all these thoughts about just how good they could be together would stop getting in the way. Elise has never really settled on any one thing in her life, be it a relationship or a career. Regardless of her nomadic ways, one constant has always held true-her love for horses and being outdoors. When she inherits half ownership to a rodeo ranch, she knows her path in life has finally been laid. Little did she expect to find her very own cowboy at the end of it. Then again, maybe she can rope her cowboy and have him, too.",
  "genres": [
    "Romance",
    "Westerns",
    "Erotica",
    "Contemporary Romance",
    "Erotic Romance",
    "Contemporary",
    "Adult"
  ],
  "author": "Patrice Michelle",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/8941408-colt-s-choice"
}