{
  "title": "The Revenants",
  "description": "The ghoulish misdeeds and conflicted psychology of the undead are memorably explored in this classic supernatural thriller, published in England in 1983 and previously unavailable in the US.¨¨In the terse, atmospheric opening pages, an unnamed narrator finds a partially charred manuscript in the vicinity of an abandoned country house in Cornwall that has mysteriously burned to the ground. It's the \"Narrative of John Richard Le Perrowne,\" born in 1830 to middle-agedparents, sickly and reclusive throughout a lonely childhood?and the chosen victim of his ancestress Helena, a vampire whose seductive presence leads¨John into a thrilling new anti-world of empowerment and glamour. But the initiate vampire retains a conscience, and Farrington expertly contrasts his reluctant surrender to the lure of the night with the amoral Helena, a coven of inordinately bloodthirsty fellow creatures, and the young farm girl (Elizabeth) who becomes John's creation, far outdistancing him in calculated villainy. The story is exactly as baroque and lurid as it needs to be, and its most effective set pieces (John awakening in bed to find Helena lying beside him; a feverish dream that's prelude to an equally appalling reality) have a truly cinematic intensity. Farrington's prose is¨pitched agreeably high, and his protagonist's increasingly fearful intuitions are expressed with vivid emotion and mordant irony (\"Death . . . seems much sweeter when you know you cannot have it\"). And the closing¨sequences build impressively, as Perrowne discovers the truth of the ancestral secret that has shaped his fate, travels to Ireland in search of the \"Master Revenant\" rumored to be the father of them all, undertakes a¨climactic \"journey to Hell,\" and experiences a grotesque parody of theResurrection. Thus summarized, it sounds egregiously flamboyant; in fact, it's smashingly effective.",
  "genres": [
    "Horror",
    "Vampires",
    "Gothic",
    "Fiction",
    "Fantasy",
    "Supernatural",
    "Historical Fiction"
  ],
  "author": "Geoffrey Farrington",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/89593.The_Revenants"
}