{
  "title": "90 Days to Your Novel: A Day-by-Day Plan for Outlining & Writing Your Book",
  "description": "Got 90 Days? Then You Can Be a Novelist...Many famous authors write their novels in a matter of weeks. William Faulkner wrote As I Lay Dying in six weeks. Joyce Carol Oates often cranks out two or three books a year. Stephen King believes first drafts should take no more than three months to complete. So, what's the trick? Novel writing isn't about inspiration. It's about the time, energy, and discipline to see the project to its finish.With 90 Days To Your Novel at your side, now is the time. This inspiring guide will be your push, your deadline, and your spark to finally, without excuses, and in three short months, nail that first draft of your novel.The difference between wanna-be writers and real writers is the difference between talk and work. If you commit to the schedule and the techniques within 90 Days to Your Novel and invest two to three hours a day for twelve weeks, you will complete your book. An outline will appear. Characters will take shape. A plot will emerge. Scenes will come together and form a story worth reading. And then the talking can begin!This helpful guide provides:Instruction that distills the elements of the novel - from crafting your outline to developing intriguing characters and believable plotsStrategies for gaining support from your family and friendsMotivating insights about writing and writers to minimize your inevitable moments of doubtA schedule to keep you in the writing zone and keep you focused, creative, and workingWhether you're writing your first novel or your third, this guide provides the coaching, the planning, and the writerly commiseration to help get your book written.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "Education",
    "Self Help",
    "How To"
  ],
  "author": "Sarah Domet",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/8956049-90-days-to-your-novel"
}