{
  "title": "The Rain Before it Falls",
  "description": "Following \"The Rotters' Club \"and its sequel, \"The Closed Circle, \"Jonathan Coe now offers his first stand-alone novel in a decade, a story of three generations of women whose destinies reach from the English countryside in World War II to London, Toronto, and southern France at the turn of the new century.Evacuated to Shropshire during the Blitz, eight-year-old Rosamond forged a bond with her cousin Beatrix that augured the most treasured and devastating moments of her life. She recorded these memories sixty years later, just before her death, on cassettes she bequeathed to a woman she hadn't seen in decades. When her beloved niece, Gill, plays the tapes in hopes of locating this unwitting heir, she instead hears a family saga swathed in promise and the story of how Beatrix, starved of her mother's affection, conceived a fraught bloodline that culminated in heart-stopping tragedy--its chief victim being her own granddaughter. And as Rosamond explores the ties that bound these generations together and shaped her experience all along, Gill grows increasingly haunted by how profoundly her own recollections--not to mention the love she feels for her grown daughters, listening alongside her--are linked to generations of women she never knew.A stirring, masterful portrait of motherhood and family secrets, \"The Rain Before It Falls\" is also a meditation on the tapestries we weave out of the past, whether transcendent or horrific. Hailed by the \"Los Angeles Times\" for his \"sustained, intricate brilliance,\" Jonathan Coe once again proves himself \"an artist of character and of his characters' stories,\" here more astutely than ever before.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "British Literature",
    "Contemporary",
    "LGBT",
    "Book Club",
    "Novels"
  ],
  "author": "Jonathan Coe",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/895807.The_Rain_Before_it_Falls"
}