{
  "title": "Loser",
  "description": "From the author of STARGIRL, a powerful novel of a young boy who is like all kids, yet unlike all kids. Loser is unique, a one-off, a touching and powerful book about the pull of individuality over the need to fit in… Donald Zinkoff has a problem. And it isn't just his name. Though, having a name beginning with Z does cause him lots of problems, not least making him last to be called for everything. Donald's main problem is his happiness; his enthusiasm – particularly for school where he arrives early every day. His happiness leads to laughter – loud laughter. It sometimes gets him into trouble at school. It sometimes gives people the wrong impression. His classmates think he is bonkers, a bit of a problem, a loser. But Donald is blissfully unaware of this. He thinks when they cheer and jeer him, that they like him. He thinks when they don't pick him for their team, oh well, maybe tomorrow. Donald is the eternal optimist – a delight. Throughout his school life there are people that recognize his individuality and admire him; two of his teachers; the old lady he 'delivers' mail too; Claudia, the little girl who lives down the road, always on a harness, in case she runs away; The Waiting Man – still waiting after thirty years for his son to return from Vietnam. And most of all, his parents, and sister, Polly, who love him to bits and will always be there to support him.The novel offers snapshots of Donald's life as he progresses through his first year in school, to his graduation to High School. It is warm, witty and wonderful and has the reader reaching for a hanky and shouting 'Go, Donald, go!' simultaneously. With some of his finest writing to date, Jerry Spinelli uses wit and emotion to create this unique novel about a unique person. As with Stargirl and Wringer, the author writes about the power of individuality over the need to fit in; the importance of attitudes to failure and how any name can ultimately be replaced with 'hero'.",
  "genres": [
    "Fiction",
    "Realistic Fiction",
    "Young Adult",
    "Middle Grade",
    "Childrens",
    "School",
    "Contemporary"
  ],
  "author": "Jerry Spinelli",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/895917.Loser"
}