{
  "title": "The House of Sleep",
  "description": "A dream of a novel.\"--Erica Wagner, The Times (London)Following The Winshaw Legacy--Coe's ecstatically reviewed American debut, winner of the John Lewellyn Rhys Prize in England and France's coveted Prix du Meilleur Livre Étranger--comes this beguiling, eccentric entertainment.        Ashdown--a vast clifftop manor on the English coast--was once a university residence, where a group of students met briefly before going their separate ways. Twelve years later, it has been transformed into a clinic for sleep disorders, and a series of strange coincidences and ostensible synchronicities draws the same group of people together once again, each of them in different ways plagued by sleep.        Sarah is narcoleptic, and her inability to distinguish between dreams and waking reality gives rise to a great many misunderstandings--one of which is to change Robert's life forever, as he persists for years (and then some) in his attempt to win her love. For Terry, a disillusioned film critic whose career has been derailed by Sarah's affliction, sleep is merely a memory, for his insomnia is complete and he can only yearn for the tantalizing dreams he enjoyed in youth. And for the increasingly deranged Dr. Dudden, who has made the subject the focus of his medical practice, sleep is nothing less than a global disease.        With panache worthy of Nabokov, and with the heart to match his sophistication, Jonathan Coe has written a breathtakingly original comedy about the powers we acquire--and those we relinquish--when we fall asleep, or fall in love.\"This is a remarkable book, most impressive for its subtle narrative patterning, like a dapple of light and shade, allowing us to indulge the illusion of understanding its characters, until, all at once, the darkness, the isolation and the mystery return. Perhaps most strange of all, for a novel about insomniacs, The House of Sleep is a wonderful bedtime read.\"--David Nokes, Sunday Times",
  "genres": [
    "Fiction",
    "Contemporary",
    "British Literature",
    "Romance",
    "Novels",
    "Psychology",
    "Literature"
  ],
  "author": "Jonathan Coe",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/895832.The_House_of_Sleep"
}