{
  "title": "Breaking Lauren",
  "description": "Seventeen-year-old Danny Cummings' life is far from a fairytale, but that's okay since he doesn't believe in happy endings. After spending a year in juvenile hall for maliciously beating his sister's boyfriend, Danny embraces his badass image. Spending most nights drinking, fighting and collecting gambling debts for his Uncle, Danny's life is out of control. His addiction to the bad boy lifestyle won't let him do anything about it, even with his family begging him to go straight. But, when fifteen-year-old Lauren McIntosh stumbles into one of his nightly escapades, the self-proclaimed anti-romantic can't concentrate on anything except Lauren and the fact that she's on the same path his sister was on. Danny knows true love happening for the villain is as common as gamblers paying their debt on time, but he's never backed away from a challenge before and he hates the idea that history will repeat itself. Growing old with the man she loves-in the small town where she was born-is the only dream Lauren McIntosh has ever had; that is until her family is practically run out of town amidst rumors of arson and adultery. So, when she meets Danny at her new school and hears the rumors about his activities from her new friends, she wants nothing to do with him or the gossip that seems to follow Danny everywhere. After a dangerous and ill-fated attempt at sneaking out, she develops unwelcomed feelings for Danny that he seems to reciprocate. But, Danny's unrelenting pursuit makes Lauren nervous, especially since he's the only one that wants to know the secrets surrounding her family's move. Lauren can't tell if Danny's intentions are true or if he has other plans for their newfound and unlikely friendship. The only way to figure out is to let him in and that could destroy everything, including the popularity and social acceptance she desperately seeks.",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary"
  ],
  "author": "Jordan Deen",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/8969919-breaking-lauren"
}