{
  "title": "Brothers, Rivals, Victors: Eisenhower, Patton, Bradley and the Partnership that Drove the Allied Conquest in Europe",
  "description": "The true story of the friendship-and rivalry-among the greatest American generals of World War II.Supreme Allied Commander Dwight D. Eisenhower, General George S. Patton, and General Omar N. Bradley engineered the Allied conquest that shattered Hitler's hold over Europe. But they also shared an intricate web of relationships going back decades. In the cauldron of World War II, they found their prewar friendships complicated by shifting allegiances, jealousy, insecurity, patriotism, and ambition.Meticulously researched and vividly written, Jonathan W. Jordan's Brothers Rivals, Victors recounts the battle for Europe through the eyes of these three legendary generals who fought to liberate two continents. For the first time in such detail, the bonds between these battle captains are explored, and readers are treated to a rare insider's view of life at the summit of raw, violent power. Throughout three years of hard, bloody warfare, Eisenhower, the Alliance's great diplomat, sought victory in the fighting qualities and tactical genius of his most trusted subordinates, Bradley and Patton. Bradley and Patton, in turn, owed their careers to Eisenhower, who protected them from the slings and arrows of politicians, rival generals, their allies, and the U.S. Navy. The twin pillars of their working relationships were duty and trust. Yet their friendship, so genuine and unalloyed before the war, would be put to the ultimate test as life-and-death decisions were thrust upon them, and honor and duty conflicted with personal loyalty.Brothers Rivals Victors is drawn from the candid accounts of its main characters, and strips away much of the public image of \"Ike\" (Eisenhower), the \"G.I.'s General\" (Bradley), and \"Old Blood and Guts\" (Patton) to reveal the men lurking beneath the legend. Adding richness to this insider's story are the words and observations of a supporting cast of generals, staff officers, secretaries, aides, politicians, and wives, whose close proximity to Eisenhower, Bradley and Patton in times of stress and tranquility are brought together to produce a uniquely intimate account of a relationship that influenced a war. The story of how these three great strategists pulled together to wage the deadliest conflict in history, despite their differences and rivalries, is marvelously told in this eye-opening narrative, sure to become a classic of military history.",
  "genres": [
    "History",
    "Biography",
    "World War II",
    "Nonfiction",
    "Military History",
    "Military Fiction",
    "War"
  ],
  "author": "Jonathan W. Jordan",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/8965840-brothers-rivals-victors"
}