{
  "title": "Habeas Corpses",
  "description": "¿Mark Simmons, who never met a wisecrack, pun, or pop culture reference he didn¿t like, explores different degrees of deadness in his latest Christopher Cjesthe novel. Poor Chris . . . if he¿s not being made unwilling ruler of the vampires, he¿s discorporated and floating through walls. Lupe the Werewolf, Suki the cat/vampire, the voluptuous Deidre, and, oh yes, Teresa¿s head . . . all are back for this lates event-packed romp through a vivid world that leaps into existence every time we open a Simmons book.¿ Charlaine Harris¿. . . manages to combine enough wacky hilarity to satisfy a Terry Pratchett fan, and a plethora of puns guaranteed to make a Piers Anthony buff groan. . . . Mark might even have created himself a new genre¿cybercafé.¿¿ Mercedes Lackey¿. . . vampire Chris Haim has more problems than merely protecting his secret . . . a jealous werewolf can ruin your whole day. Plots and subplots and vignettes abound . . . fans of the early Terry Pratchett or Eric Flint's Joe fantasies will enjoy the humorous bits.¿¿ Publishers Weekly¿[Chris Cjesthe] is back for a new and even greater (and funnier) adventure. . . . Snappy dialogue, lots of amusing details, a clever plot, and a generally witty sense of humor combine to make this one of those rare novels that combine levity and the supernatural in just the right balance.¿¿ Chronicle¿Readers who desire something off beat but humorous in their fantasy/horror literature will want to read Dead on My Feet [prequel to Habeas Corpses ]. . . this book is fun.¿¿ Midwest Book Review¿[ Dear on My Feet ] works because it is simply over the top . . . I love the way Mr. Simmons plays with the standard action scenes¿for instance a philosophy discussion during a car chase. . . .¿¿Philadelphia Weekly Press",
  "genres": [
    "Urban Fantasy",
    "Vampires",
    "Fantasy",
    "Fiction",
    "Werewolves",
    "Science Fiction",
    "Horror"
  ],
  "author": "Wm. Mark Simmons",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/89653.Habeas_Corpses"
}