{
  "title": "Do They Hear You When You Cry?",
  "description": "A true story of persecution, friendship, and ultimate triumph, Do They Hear You When You Cry chronicles the struggles of two extraordinary Fauziya Kassindja, who fled her African homeland to escape female genital mutilation only to be locked up in American prisons for sixteen months; and Layli Miller Bashir, a driven young law student who fought for Fauziya's freedom.Fauziya Kassindja's harrowing story begins in Togo, Africa, where she enjoyed a sheltered childhood, shielded by her progressive father from the tribal practice of polygamy and genital mutilation. But when her father died in 1993, Fauziya's life changed dramatically. At age seventeen Fauziya was forced to marry a man she barely knew who already had three wives, and prepare for the tribal ritual of female genital mutilation--a practice that is performed without painkillers or antibiotics. But hours before the ritual was to take place, Fauziya's sister helped her escape to Germany, and from there she traveled to the United States seeking asylum--and freedom. Instead, she was stripped, shackled, and locked up in various INS detention facilities for sixteen months.Enter Layli Miller Bashir, a driven twenty-three-year-old law student who took on Fauziya's case. When the two women met, Layli found an emotionally broken, emaciated girl with whom she forged an extraordinary friendship. Putting her heart and soul into Fauziya's case, Layli enlisted help from the American University International Human Rights Clinic. The clinic's acting director, Karen Musalo, an expert in refugee law, devoted her own considerable efforts to the case, and assembled a team to fight with her on Fauziya's behalf. Ultimately, in a landmark decision that has given hope to many seeking asylum on the grounds of gender-based persecution, Fauziya was granted asylum on June 13, 1996.Here, for the first time, is Fauziya's dramatic personal story, told in her own words, vividly detailing her life as a young woman in Togo and her nightmarish day-to-day existence in U.S. prisons. It is a story of faith and freedom, courage and inspiration--one that you will not soon forget.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Feminism",
    "Togo",
    "History",
    "Biography Memoir"
  ],
  "author": "Fauziya Kassindja",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/896465.Do_They_Hear_You_When_You_Cry_"
}