{
  "title": "Talk of the Ton",
  "description": "Nothing sets tongues wagging like a scandalous dalliance. In the salons of the Ton, no tidbit is more delicious than a rumor of amour--the more outrageous the better. Rakes and rogues, ladies of high station and low morals are choice fodder for the gossips of society. Now, four of today's most popular Regency authors titillate the Ton with tales of how untoward talk can fan the flames of passion.Eloisa James - A Proper EnglishwomanBetrothed since they were children, Gilbert Baring-Gould, Earl of Kerr, and the Honorable Emma Loudan are not quite what one would call a perfect match. The whole Ton knows him to be a complete rakehell, hardly the ideal spouse for a lady.When he horrifies the Ton by announcing that he won't go through with the marriage until Emma is carrying his child--or did he say that she was already carrying a child?--the gossips (and Emma) go wild.Obviously she should hand this Beelzebub his ring back directly. But curiosity, and a strong wish to teach her brazen-faced fiancé some manners, demand that she beat him at his own game.So she does.It's the story of a reluctant bridegroom (engaged since childhood, and hasn't seen his fiancée in years), a bride who's losing her patience, and a wild night in which the said bridegroom meets a wicked, delicious Frenchwoman... or is she?Julia London - The Vicar's WidowDarien, Lord Montgomery, has always had a thing for the vicar's wife. He is convinced she is the loveliest creature on earth, and even managed a passionate kiss with her one time during a party. When her husband dies, Darien is ready to court her as soon as she throws off mourning. However, a young miss making her debut wants Darien for herself. She decides to spread two rumors. The first is that Darien is on the verge of offering for her, and the second is that Mrs. Beckett (the vicar's widow) is loose with her morals. Both rumors spread like wildfire, with sad consequences for Mrs. Beckett and Darien.Rebecca Hagan Lee - Clearly a Couple (Free Fellows League #4.5)This novella ties in with her Free Fellows series.Jonathan Manners, Earl of Barclay, plans to return home to London after picking up a package for one of his Free Fellows colleagues. When Jonathan is nearly killed by a murderous Turk with a scimitar, he discovers that the \"package\" is Lady India Burton, a noblewoman who was kidnapped by Barbary pirates and spent the last six years as part of a sultan's harem. She's recently been ransomed and needs an escort to London. As Jonathan and India talk (and work on thwarting her horrible keeper) they quickly fall for each other. India shares details about her amazing and difficult life, and Jonathan knows he's in love with her.Jacqueline Navin - Miss Jenny Alt's First KissJenny Alt is a poor relation who tends to fade into the background while her more flashy cousin steals the spotlight. Jenny eschewed a season of her own for several years, but finally goes to London with her aunt when her cousin Cassandra makes her comeout. Jenny has spoiled Cassandra for years, giving in to her every whim. Now the group is taken by surprise when the aunt's distant cousin Miles comes to town. He needs help finding a new wife and asks for her guidance. There is almost an immediate spark between Miles and Jenny, but Cassandra wants him for herself and starts unkind rumors about Jenny. Jenny tries to give Miles up and even discourages his advances, but--well, you can guess how that goes.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Anthologies",
    "Regency",
    "Historical Fiction",
    "Short Stories"
  ],
  "author": "Julia London",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/896596.Talk_of_the_Ton"
}