{
  "title": "The Diamond in Your Pocket: Discovering Your True Radiance",
  "description": "This book is meant for the rapidly growing number of spiritual seekers who are approaching the end of their seeking and who are ready for the undiluted truth. The fact that you are reading these words means that it is your destiny to be an essential part of this great adventure of collective awakening.--From the foreword by Eckhart Tolle, author of The Power of NowWith The Diamond in Your Pocket, Gangaji describes our never-ending search to find fulfillment, which, paradoxically, already exists if we will only stop long enough to discover its true source. I have discovered that it is actually impossible to find happiness, she explains. As long as you are seeking to find happiness somewhere, you are overlooking where happiness is--in your true nature.Gangaji, the American-born teacher who has influenced the lives of thousands of people through her retreats and public events, helps us to reconcile the observations and questions that arise along the spiritual path. Like a precious gem, The Diamond in Your Pocket cuts through what is false and illuminates what is true.Here is a brilliant series of contemplations and insights you will want to hold dear and return to again and again. Exploring a breadth of topics from how to let go of your need to control, to the trance of language, to despair's hidden treasure, The Diamond in Your Pocket helps you cultivate the courage to be vulnerable so that you can meet and deeply merge with the unknown. Gangaji shows you thought-by-thought how to stop the endless activity of your mind, and experience the brilliance and radiance of who you really are in every present moment. Unabridged, read by the author.",
  "genres": [
    "Spirituality",
    "Self Help",
    "Nonfiction",
    "Philosophy",
    "Psychology",
    "Theology",
    "Eastern Philosophy"
  ],
  "author": "Gangaji",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/897884.The_Diamond_in_Your_Pocket"
}