{
  "title": "George Washington's First War: His Early Military Adventures",
  "description": "“I heard the bullets whistle, and, believe me, there is something charming in the sound.” So said the young George Washington, something no veteran soldier would say. He had not been the target of enemy fire. Instead, he was papering over the fact that his men and Indian allies had just massacred a diplomatic party, setting off the French and Indian War of 1754–63. He had violated international law, something else he would not admit. Washington could, after all, tell a lie. That is but one revelation that acclaimed military historian and Washington expert David A. Clary offers in George Washington’s First War . Washington spent his adolescence in military service, starting as a colonel in command at the age of twenty-two. He came from a society without a military tradition, and had no training or battle-wise sergeants to keep him out of trouble. He was a young glory hound thrust into circumstances he was not prepared to handle by elders who should have known better. Leading reluctant amateur soldiers against French professionals, when he took command he was on his own. Accordingly, Washington survived a five-year ordeal unlike that endured by any other Founding Father. He emerged from it not yet the steady supreme commander of the Revolution, but he had started on the road that led him to become the great soldier and statesman of his age. How he began his life’s journey is what George Washington’s First War is about. It is a dramatic story of frontier warfare played out against the anxieties and resentments of an ambitious adolescent. Here are accounts of harrowing ordeals in the wilderness, the decisive part played by the Indian nations whose continent this was, and the epic clash of empires. Others have looked at Washington’s activities during the French and Indian War without recognizing that he played his part in that history during his painful transition from boy to man. His repeated blunders and defeats arose from his youthful impetuosity and inexperience and weak support from his government. Clary has a sound understanding of eighteenth-century wilderness warfare, and his descriptions of battles are vivid, exciting, and laced with horrifying details. Brought to dramatic life are Washington’s harrowing wintertime journey into the wilderness to order the French to leave the territory, the Jumonville Massacre, his bloody defeat at Fort Necessity, his heroism at the Battle of the Monongahela (Braddock’s Defeat), his years of frustration commanding the Virginia Regiment, the Forbes Expedition of 1758, his insubordination to civil and military superiors, and his resignation from the army. A revealing portrait of Washington during a crucial, formative period of his life, this is the indispensable backstory to the making of a great man.",
  "genres": [
    "History",
    "American Revolution",
    "American History",
    "Biography"
  ],
  "author": "David A. Clary",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/8977696-george-washington-s-first-war"
}