{
  "title": "The Year We Left Home",
  "description": "From National Book Award–finalist Jean Thompson comes a mesmerizing, decades-spanning saga of one ordinary American family—proud, flawed, hopeful—whose story simultaneously captures the turbulent history of the country at large.In The Year We Left Home, Thompson brings together all of her talents to deliver the career-defining novel her admirers have been waiting for: a sweeping and emotionally powerful story of a single American family during the tumultuous final decades of the twentieth century. It begins in 1973 when the Erickson family of Grenada, Iowa, gathers for the wedding of their eldest daughter, Anita. Even as they celebrate, the fault lines in the family emerge. The bride wants nothing more than to raise a family in her hometown, while her brother Ryan watches restlessly from the sidelines, planning his escape. He is joined by their cousin Chip, an unpredictable, war-damaged loner who will show Ryan both the appeal and the perils of freedom. Torrie, the Ericksons' youngest daughter, is another rebel intent on escape, but the choices she makes will bring about a tragedy that leaves the entire family changed forever.Stretching from the early 1970s in the Iowa farmlands to suburban Chicago to the coast of contemporary Italy—and moving through the Vietnam War's aftermath, the farm crisis, the numerous economic booms and busts—The Year We Left Home follows the Erickson siblings as they confront prosperity and heartbreak, setbacks and triumphs, and seek their place in a country whose only constant seems to be breathtaking change. Ambitious, richly told, and fiercely American, this is a vivid and moving meditation on our continual pursuit of happiness and an incisive exploration of the national character.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Literary Fiction",
    "Contemporary",
    "Family",
    "Audiobook"
  ],
  "author": "Jean Thompson",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/8979518-the-year-we-left-home"
}