{
  "title": "Prayers and Lies",
  "description": "When seven-year-old Bethany meets her six-year-old cousin Reana Mae, it's the beginning of a kinship of misfits that saves both from a bone-deep loneliness. Every summer, Bethany and her family leave Indianapolis for West Virginia's Coal River Valley. For Bethany's mother, the trips are a reminder of the coalmines and grinding poverty of her childhood, of a place she'd hoped to escape. But her loving relatives, and Bethany's friendship with Reana Mae, keep them coming back.But as Bethany grows older, she realizes that life in this small, close-knit community is not as simple as she once thought. . .that the riverside cabins that hold so much of her family's history also teem with scandalous whispers. . .and that those closest to her harbor unimaginable secrets. Amid the dense woods and quiet beauty of the valley, these secrets are coming to light at last, with a force devastating enough to shatter lives, faith, and the bond that Bethany once thought would last forever.Spanning four decades, Sherri Wood Emmons' debut is a haunting, captivating novel about the unexpected, sometimes shocking events that thrust us into adulthood--and the connections that keep us tethered, always, to our pasts.Advance praise for Sherri Wood Emmons and Prayers and Lies\"From the first sentence, the voice of the narrator, Bethany, rings true and never falters. By the end of the book, I cared for every aunt and cousin, mother and sister, even the most troubled and dangerous. Prayers and Lies is the story of a family that knows how to love and forgive and get on with life.\" --Drusilla Campbell, author of The Good Sister\"Through the careful rendering of this dysfunctional family, Emmons makes us fall in love with Bethany Wylie, the young girl at the heart of this story, as well as her wayward cousin, Reana Mae. The evolution of their friendship--the way they grow together and grow apart--is heart-breaking.\" --T. Greenwood, author of Two Rivers\"Prepare to stay up all night reading! Sherri Wood Emmons perfectly captures the devastating impact of family secrets in her beautifully written--and ultimately hopeful--debut novel. With its evocative setting and realistically crafted characters, Prayers and Lies is a must read for fans of rich family drama.\" --Diane Chamberlain, author of The Lies We Told\"A sweet, revealing tale of family, friendship, long-held secrets and includes the all-important ingredients of forgiveness and love.\" --Kris Radish, author of The Shortest Distance Between Two Women\"I loved it.\" --Cathy Lamb, author of Such A Pretty FaceThe KissWe always knew when Bobby Lee came home. Folks up anddown the Coal River Valley heard the roar of his motorcycleon the gravel road long before he tore around the final bend, turningso sharp he lay nearly sideways on the ground. Sometimes he'dbe gone weeks at a time, sometimes just a few days. But his homecomingnever changed.He rode into the valley like a conquering hero. And Jolene, hiswife, would come flying out of their shabby cabin, long red hairstreaming behind her, just as Bobby Lee pulled into their little dirtyard. He'd be off the huge bike in a flash as she ran down the twobroken and patched steps and into his arms. And then there wouldbe the kiss--scandalous for that rural West Virginia community inthe 1960s. We children would stand on our own porches or in theroad, gaping at the two of them, our mouths and eyes wide.Usually, Reana Mae was waiting on the porch, too, but BobbyLee didn't notice her right off. His wife was such a whirlwind ofred curls and short skirts and hunger that their daughter--thin,freckled, and silent--went unnoticed. After the kiss would comegifts, if his haul had been a long one. Sometimes, Bobby Lee drovehis rig all the way from Charleston to California, and he broughtJolene and Reana presents from places like Los Angeles and LasVegas. Usually a toy or coloring book for Reana. For Jolene, hebrought clothes--shocking clothes. Like the halter top and hotpants he brought from San Francisco. Or the lime green minidressfrom Chicago. Jolene strutted around like a peacock in them, whilethe rest of the valley folk shook their heads and whispered to oneanother over their fences and laundry lines. Jolene was the firstwoman in the valley to go braless, her round, full breasts barelycontained beneath the tight T-shirts and sweaters she wore.After the gifts and the hellos and the \"What's happenin' in theworld?\" talk, Jolene would send Reana Mae off to her greatgrandma's,then disappear into the house with her husband for therest of the afternoon. Sometimes, Reana spent the night at herGrandma Loreen's before Jolene remembered to come for her.Loreen would make up Jolene's old room, and she'd fry pork chopsand boil potatoes with green beans and bacon fat like Reanawanted, and she'd sing her the lullaby she used to sing to her ownbabies. And so, on those days, Reana Mae got cherished a little bit.Jolene wasn't from the valley, though her people were. She'dspent most of her childhood up north in Huntington with hermama, EmmaJane Darling. Her father, whoever he might havebeen, was long gone before Jolene made her appearance at OurLady of Mercy Charity Hospital in Huntington. Jolene came to livewith her grandparents, Ray and Loreen, after EmmaJane died, andshe was a handful.But Bobby Lee fell for Jolene the first time he laid his eyes onher, the day she came to the Coal River. She was just twelve yearsold then, but she looked sixteen in her tight black skirt, low-cutblouse, and bright-red lipstick. And Bobby Lee told his littlebrother, \"I'm gonna marry that girl.\" Five years later, he did. Anddon't you suppose Ray and Loreen were relieved to have Jolenemarried off? They fairly beamed at the wedding, didn't even bat aneye when Jolene wore a short blue dress to be married in instead ofthe nice, long white gown with lace that Loreen had offered tomake for her.\"At least,\" my Aunt Belle had whispered, \"it ain't red.\"They were scandalous, those two, even in a valley that tolerateda good bit of questionable goings-on. Times were hard, after all, and people had to take their happiness when and where they foundit. Folks in the valley were philosophical about such things. ButBobby Lee and Jolene Colvin, they pushed it too far by half.They didn't go to church, for one thing. Everyone else in thevalley spent long Sunday mornings at Christ the King BaptistChurch, praying for redemption, hearing the true gospel, and assuringtheir eternal salvation. But not Bobby Lee and Jolene.They sent Reana Mae to church, though, every Sunday morning,scrubbed clean and wearing her one Sunday dress, her spindly legsbare in summer and winter alike. Folks sometimes said Jolene senther daughter to church just so she could lie abed with Bobby Lee,desecrating the Lord's Day. And the church folk were sugary sweetto Reana on account of it. But she never even smiled at them; shejust stared with her unblinking, green cat-eyes and all those brownfreckles. Not a pretty child, folks whispered. Small, knobby, wild-haired, and so quiet you'd hardly notice her, till you felt her eyesstaring through you. You couldn't hardly tell she was Jolene'sdaughter, except for those eyes--just like Jolene's.Reana Mae sometimes sat with my sisters and me at church, andshe never wrote notes on the bulletin or whispered or wriggled orpinched. She just sat with her hands folded in her lap and stared upat Brother Harley preaching. Sometimes her lips moved like shewas praying, but she never said a word. She didn't even sing whenMiss Lucetta started up a hymn on the piano.Christ the King Baptist Church was the glue that held that communitytogether. The weathered white house of God had marriedand buried valley folk for longer than anyone could remember.Brother Harley, the pastor, was a heavy-jowled, sweaty, baldingman who liked a good joke and a cold beer. When he didn't wearhis black robe, he donned plaid shirts with a breast pocket, wherehe tucked the white handkerchiefs he used to wipe the sweat fromhis forehead and neck. His daddy had been the first pastor ofChrist the King Baptist Church, and he was hoping his grandson,Harley Boy, would take the pulpit when he retired.Brother Harley was great friends with my Great-Aunt Belle.Often on quiet summer nights, you could hear his belly laugh echoall through the valley when he sat on Belle's porch, drinking beerand sharing gossip. His tiny, sharp-eyed wife, Ida Louise, didn'tjoin him at Belle's. Folks sometimes wondered, quietly over theirlaundry lines, just why Brother Harley spent so much time with arich widow and so little time at home. \"But\"--Loreen would sighto my mother, her head bobbing earnestly--\"knowing Ida's temper,maybe it ain't such a wonder as all that.\"Aunt Belle--Arabella was her Christian name--was born andbred in the Coal River Valley, the eldest of the three Lee sisters. Mygrandmother, Araminta, was the youngest. Arathena, Bobby Lee'sgrandmother, was the middle child.When she was nineteen, Belle caught the eye of a much olderand very wealthy man. Mason Martin owned a chain of drugstoresin East Virginia, West Virginia, and Kentucky. He'd come to thevalley to look into property, before deciding the community wastoo small to support a drugstore. He left without a store but with abeautiful young wife. The couple settled into a fine house inCharleston, and for eleven years lived happily together.At thirty, Belle came back to the valley, widowed and childless.Mason had dropped dead in his rose garden at the age of sixty-two,leaving Belle the sole heir to his drugstore wealth. They'd had justone child, a scrawny son who died of whooping cough before hisfirst birthday.When Mason died, Aunt Belle had her big house built and proceededto buy from the Coal River Excavation Company as manyof the small riverfront cabins as she could talk them out of. Theseshe sold to the families who had long lived in them, for monthlypayments of about half what their previous rents had been. It wasBelle who waged war with the electric company to get the valleywired in 1956, and Belle who hired the contractors to installplumbing and septic tanks for her little houses a few years later.Aunt Belle always sat right up front at Christ the King BaptistChurch, marching in solemnly, winking sidelong at friends, just asthe first hymn began. When we first started coming to the river, sheand my mother had battled fiercely over whether we would sit withher.\"Pride of place,\" my mother said softly, in that velvety firmvoice that brooked no argument, \"does not belong in the house ofthe Lord.\"\"You all are my family,\" Belle had hollered. \"You ought to be upfront with me. What do folks think, you all sitting way at the backof the church, like you're ashamed before the Lord?\"But my mother would not be moved. Aunt Belle had all the resourcesof her drugstore empire and the indebtedness of an entirevalley, but they were nothing in the face of my mother's rock-solidbelief in the rightness of her faith.That was always the difference between valley faith and mymother's. Valley folk took their religion tempered with a hard doseof pragmatism. If Brother Harley spent more time than was absolutelyseemly with Arabella Lee . . . well, look at his wife, after all.If the mining men drank too much beer or even whiskey on a Saturdaynight . . . well, didn't they earn that privilege, working undergroundsix days a week? If Reana Mae had been born only sixmonths after Bobby Lee and Jolene got married . . . well, at leastthey made it legal in time.My mother's fiery faith allowed for no such dalliances with theLord and His ways. There was no liquor in our house, no card playing,no gossip. And there was definitely not pride of place; no,ma'am, we would not sit up in the front pew with my Aunt Belle,no matter how loudly she argued. We sat quietly in the back, withReana Mae.Most of the valley kids teased Reana Mae, but my sister Tracywas the worst. Tracy seemed to really hate Reana. I wasn't sure why,but then I didn't understand a lot about Tracy in those days. Shewas purely mean most of the time, and poor Reana Mae bore thebrunt of it when we came south. I wonder sometimes that Reanadidn't fight back earlier. Later, much later, she learned to hurtTracy more than Tracy ever hurt her. But in those hot and stickydays of the 1960s, she only took whatever Tracy gave and cameback for more.\"Why doesn't your mother get you some clothes that fit?\"Reana Mae looked down at the faded yellow swimsuit that hungfrom her shoulders, her cheeks reddening. She shrugged and lowered her head. We were building mud and sand castles at the stripof cleared land that passed for a beach.\"I guess she doesn't want to waste her money,\" Tracy continued,shoveling dirt into a pink bucket and smashing it down with bothhands. \"Why, it'd be like dressing up a scarecrow. Like putting Barbiedresses on a stick doll. Ain't that so, Bethany?\" She paused,looking up at me expectantly. I didn't make a sound, so Tracy wenton. \"I guess she wants to keep all Bobby Lee's money for herself soshe can buy those trashy dresses she wears, the ones that show herbutt.\"Reana Mae just stared at the ground, her small frame slumpedand still.\"My daddy says people down here breed like rabbits,\" Tracycontinued, \"but your mama and daddy just have you. How come?\"Reana shrugged her shoulders again, still silent. She shoved herdirty-blond hair back from her freckled face with a muddy hand.\"I guess when they saw how ugly you turned out, they didn'twant any more babies.\" Tracy smirked.Still, Reana Mae said nothing, and neither did I. At least Tracywasn't focused on me.\"What's white and ugly and disgusting to look at?\" Tracy continued.Neither of us said anything.\"A pile of maggots . . . and Reana Mae's face.\"Tracy's laughter rang shrill up and down the river. Reana Maelooked up at me, to see if I would laugh, too. She looked like a dogwaiting to be kicked.\"Shut up, Tracy,\" I heard myself say out loud.Tracy's eyes widened in surprise, then she snickered. \"Well, Iguess you finally found your real sister, Bethany-beanpole-bonybutt-baby. You and Hillbilly Lilly must have come from the samegarbage can. That's where we found Bethany, you know.\" Sheturned to Reana Mae now that I was the target. \"She was crying ina garbage can and Mother felt sorry for her and brought her home.She's not our real sister. Mother has to pay people just to be herfriends.\" She laughed again, her brilliant hazel eyes sparklingmean.Reana Mae stared directly into Tracy's beautiful, hateful faceand finally whispered, \"I think you're the meanest girl that everwas.\"Tracy stopped laughing abruptly and hurled the contents of herbucket at the two of us, drenching us both with wet sand and mud.\"You two are just alike,\" she hissed as she rose. \"You're thetrash-can twins.\"With that, she picked up her bucket and ran up the road.We sat there silently for a moment, dripping and muddy andmiserable. Then Reana said to me, smiling shyly, \"Well, I guess I alwayswanted a twin anyhow.\"I smiled back at her. All my life I'd had three sisters--threestrangers I lived with but never really knew. Sitting in the mud onthat muggy day, I found my real sister. I was seven, Reana Mae wassix, and I had no way of knowing just how intertwined our liveswould become. But from that day forward, Reana and I were connectedin a way I've never been with anyone else. Her story andmine got so tangled up together, sometimes it felt like I was justwatching from the outside, like she was the one living. Sometimes,I hated her for that. But mostly, I loved her.",
  "genres": [
    "Fiction",
    "Book Club",
    "Drama",
    "Contemporary",
    "Coming Of Age",
    "Family",
    "Abuse"
  ],
  "author": "Sherri Wood Emmons",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/8978978-prayers-and-lies"
}