{
  "title": "Cualquier otro día",
  "description": "Ambientada en Boston a finales de la Primera Guerra Mundial, Cualquier otro día -primera entrega de la serie Coughlin- es una impresionante epopeya que cuenta la historia de dos familias arrastradas por la vorágine política y social de un mundo que se recupera con enormes dificultades de los estragos de la Gran Guerra.Estamos en 1918. Debido a un cúmulo de azares, un joven obrero negro de Ohio llamado Luther Laurence es llevado a disputar un partido de béisbol frente a Babe Ruth, estrella emergente de ese deporte, una amarga experiencia que Luther nunca olvidará. Al mismo tiempo, el agente Danny Coughlin, hijo mayor de un legendario capitán irlandés de la policía de Boston, recibe un encargo envenenado: infiltrarse en los medios sindicales y anarquistas. A priori, Luther y Danny no tienen nada en común, pero el destino va a unirlos en Boston en 1919, el año de todas las desgracias. Y en esa ciudad en la que los bolcheviques y otros grupos de agitadores se han adueñado de las calles, la huelga de las fuerzas policiales va a prender la mecha.A través de algunos de los acontecimientos fundamentales del momento, con un tratamiento cuasi cinematográfico de la narración y unos personajes arrolladores, Dennis Lehane explora la devastadora violencia y la incontenible efervescencia de un país en busca de la libertad y en guerra consigo mismo. Considerada uno de los ejemplos más señeros de «la gran novela americana», Cualquier otro día captura de forma admirable el espíritu de una época y aborda muchos temas que nos siguen acuciando un siglo después: la raza, la inmigración, el terrorismo, la inestabilidad económica o la brecha creciente entre ricos y pobres.La crítica ha dicho...«Una novela de una fuerza desgarradora. [...] Una epopeya fiera y majestuosa. Un libro colosal, apasionado y muy bien documentado que nos hace revivir la historia.»The New York Times«El mejor libro de Lehane. [...] El autor capta la esencia de la vida estadounidense en una sociedad cambiante que refleja de forma sobrecogedora la actual.»USA Today«Sincera y conmovedora. [...] Lehane merece ser incluido entre los novelistas estadounidenses más interesantes y consumados de cualquier género o categoría.»The Washington Post Book World«Una gran novela histórica. [...] Espectacular en los detalles, inteligentemente construida, con escenas soberbiamente escritas.»The Boston Globe",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Historical",
    "Crime",
    "Thriller",
    "Book Club"
  ],
  "author": "Dennis Lehane",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/8978022-cualquier-otro-d-a"
}