{
  "title": "Tangerine Dream",
  "description": "Wellington, New Zealand. Gayle Sterling is vacationing with her daughter Dylan when they're in an accident with a drunk driver. They are quickly taken to hospital, Gayle with a fractured femur and all the bones in her right foot broken, Dylan with a punctured lung. Just before surgery, her doctor assures Gayle that both she and her daughter are going to be fine. Long Beach, California. Psychiatrist Sanford (Sandy) Sterling is called away from a charity function to the site of the new Sterling Hotel. Gina Sealy, one of his patients is out on a fifteenth floor balcony of the newest hotel in the family hotel group, threatening to jump. She'd called the media, because she's in love with Sandy and she thinks he doesn't want her. Newsman Nick Nesbitt is on the ground with a news van, Gina is wired for sound and Sandy has to talk her out of jumping with the whole world listening in. Newport Beach, California. Haley Harrison and Taylor Sterling are lounging around by the Sterling's pool when all of a sudden Taylor feels a sharp pain in her chest. \"Dylan,\" she cries. She knows immediately her twin is in pain. She tries to get a hold of her father, Senator Stacy Sterling, who is running for the Presidency of the United States, but his cell phone is off. She calls his administrative aid in Washington and has him book tickets for herself and Haley on the next flight from L.A. to Auckland. San Francisco, California. While his wife and daughter are in surgery in New Zealand, while his younger brother is trying to keep a desperate girl from jumping in Long Beach, and while his other daughter and her best friend are frantically worrying about Gayle and Dylan, Presidential Candidate Stacy Sterling is in the penthouse sweet of the San Francisco Sterling, making love to a teenage prostitute. Wellington, New Zealand. Sandy, Taylor and Haley arrive in New Zealand just in time for Haley and Taylor to say goodbye to Dylan before she dies. The tragedy draws Haley and Taylor close, they become lovers and that alone would be enough to shake Stacy's campaign to it's roots, but Dylan kept a journal on her laptop that falls into the hands of Nick Nesbitt who desperately wants a story that will put him on the map. Plus there is that little matter of the little girls the candidate likes to sleep with.",
  "genres": [
    "Fiction"
  ],
  "author": "Ken Douglas",
  "average_rating": "2.29",
  "url": "https://www.goodreads.com/book/show/89756.Tangerine_Dream"
}