{
  "title": "The Beekeeper's Bible: Bees, Honey, Recipes & Other Home Uses",
  "description": "The Beekeeper’s Bible is as much an ultimate guide to the practical essentials of beekeeping as it is a beautiful almanac to be read from cover to cover. Part history book, part handbook, and part cookbook, this illustrated tome covers every facet of the ancient hobby of beekeeping, from how to manage hives safely to harvesting one's own honey, and ideas for how to use honey and beeswax. Detailed instructions for making candles, furniture polish, beauty products, and nearly 100 honey-themed recipes are included. Fully illustrated with how-to photography and unique etchings, any backyard enthusiast or gardener can confidently dive into beekeeping with this book in hand (or daydream about harvesting their own honey while relaxing in the comfort of an armchair).Praise for The Beekeeper's Bible:\"Jones and Sweeney-Lynch explain the science and society of bees in clear, accessible language. And the recipes are admirably useful: honey scones, honey soap, honey hangover cures. 'Oh, stuff and fluff,' as Pooh might say. Dip a paw into this richly satisfying volume and you won't have to do stoutness exercises.\" -The New York Times <!--StartFragment--> “Lip-smackin’ throughout, The Beekeeper's Bible is, at its heart, a glorious invitation into the depths of the honeybee hive.” —Chicago Tribune<!--StartFragment--> \"An elegant, information-packed addition to the library of the most serious beekeeper.\" —Better Homes & Gardens Country Gardens“An amazing compendium of information, lore, facts, tips, techniques, and benefits of having bees in your life—whether you choose to keep a hive yourself, enjoy the by-products, or just appreciate these wonderful creatures for all that they contribute to our human ecosystem.” —About.com",
  "genres": [
    "Nonfiction",
    "Reference",
    "Gardening",
    "Cookbooks",
    "Nature",
    "Cooking",
    "Animals"
  ],
  "author": "Richard A. Jones",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/8985725-the-beekeeper-s-bible"
}