{
  "title": "The Measure of a Man: A Spiritual Autobiography",
  "description": "\"I have no wish to play the pontificating fool, pretending that I've suddenly come up with the answers to all life's questions. Quite that contrary, I began this book as an exploration, an exercise in self-questing. In other words, I wanted to find out, as I looked back at a long and complicated life, with many twists and turns, how well I've done at measuring up to the values I myself have set.\"—Sidney Poitier In this luminous memoir, a true American icon looks back on his celebrated life and career. His body of work is arguably the most morally significant in cinematic history, and the power and influence of that work are indicative of the character of the man behind the many storied roles. Sidney Poitier here explores these elements of character and personal values to take his own measure—as a man, as a husband and a father, and as an actor. Poitier credits his parents and his childhood on tiny Cat Island in the Bahamas for equipping him with the unflinching sense of right and wrong and of self-worth that he has never surrendered and that have dramatically shaped his world. \"In the kind of place where I grew up,\" recalls Poitier, \"what's coming at you is the sound of the sea and the smell of the wind and momma's voice and the voice of your dad and the craziness of your brothers and sisters...and that's it.\" Without television, radio, and material distractions to obscure what matters most, he could enjoy the simple things, endure the long commitments, and find true meaning in his life. Poitier was uncompromising as he pursued a personal and public life that would honor his upbringing and the invaluable legacy of his parents. Just a few years after his introduction to indoor plumbing and the automobile, Poitier broke racial barrier after racial barrier to launch a pioneering acting career. Committed to the notion that what one does for a living articulates to who one is, Poitier played only forceful and affecting characters who said something positive, useful, and lasting about the human condition. Here is Poitier's own introspective look at what has informed his performances and his life. Poitier explores the nature of sacrifice and commitment, price and humility, rage and forgiveness, and paying the price for artistic integrity. What emerges is a picture of a man in the face of limits—his own and the world's. A triumph of the spirit, The Measure of a Man captures the essential Poitier.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "African American",
    "Book Club"
  ],
  "author": "Sidney Poitier",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/898258.The_Measure_of_a_Man"
}