{
  "title": "Gold Rush 2000",
  "description": "Mystery thriller, Gold Rush 2000 Winner of the National Publishers Freedom Award - Best New Fiction in the USA. Issued by the American Self-Publishers Association.This story induces an adrenaline rush by weaving modern gold exploration, spy satellites, gene manipulation, hostile takeovers, and US. national security operations into a tapestry of conflict and suspense.In the year 2000, a ruthless international conglomerate, stalks Desert Storm hero, Nolen Martin, to steal the massive, gold vein he discovers in northern California. Simultaneously, the FBI attempts to falsely arrest Nolen for treason to prevent the inevitable gold rush from exposing the government's illegal weapon site.Swarming, fighting, coveting, the Californians struggle to create and profit from a modern-day gold rush. Out of Monterey California, through the San Francisco Bay Area, and west of Reno Nevada, high-technology gold hunters battle each other before a tidal wave of humanity surges into the new gold field.What Readers Are Saying About Gold Rush 2000:\"At first I was skeptical (after all, it's a Mitchell not a Clancy) and expected it to be second rate. Then I was swept up in the triangular tension. The ending was terrific!\" -- Bob T., Manager Aerospace Company\"I received your book and am now having a wonderful experience readingit. It has a great story line and I am having a hard time putting itdown. I was reading it this a.m. in the restaurant. My eyes were sofull of tears! Such a great story!\" -- Grace V., Housewife\"Friends, the title is Gold Rush 2000 and I can't stop reading it. If you like the Tom Clancy Red October type story, you will love this book. Normally I don't share things like this unless I feel strongly about it.\" (E-mail message) -- Bruce V., Product Assurance Engineer\"I loved the hero, Nolen. He's the type of man any woman would want to marry.\" -- Brenda C., Medical Assistant\"I finished the book last night; it was great! I have to tell you, it makes me proud to say that I know you. I can't wait for the sequel, you left quite a few pieces and people hanging. I know you must have planned to write another book. You could be another Clive Cussler.\" -- Howard M., Retired Engineer\"Just finished reading the first chapter. I'm very impressed. I didn't think it would spellbound me. It did. I look forward to buying the book!\" -- Robin D., Executive Legal Assistant\"Finished Gold Rush 2000 yesterday. Congratulations!!!! You've done a hell of a job. It held my attention from beginning to end. The subject was intriguing, and it was certainly evident that you are knowledgeable about prospecting. I will recommend it to friends.\" -- Gerry K., Logistics Manager\"A great read! The subject was not my ordinary selection, but I couldn't put it down. Now I'm waiting for the sequel.\" -- Mary D., Special Education Teacher\"I'm having fun with this book. I'm glad I bought it.\" -- Vel J., Senior Configuration AnalystFive reasons why Gold Rush 2000 is the best fiction book buy available this year: #1. Gold Coin Contest: Readers can experience \"Gold Fever\". The book buyer has the opportunity to win a 1 oz gold Krugerrand by accurately answering five questions from the story. In addition, the bookstore owner who sells the book to the winning book buyer will receive a 1/2 oz gold Krugerrand. #2. E-mail Feedback to the Author:This book pioneers interactive contact with the reader. The author's e-mail address is printed in the book to encourage the reader to praise, question, or criticize the author concerning the story. This is a new feature of the American novel. Other authors will follow Mitchell's lead.#3 News Letter at web site:The author has created a news letter entitled \"From the Author's Chair\". The news letter allows the reader to follow the excitement and struggle of the author, as the book progresses from obscurity to best seller status or some level in between.#4. Captivating story and a magnetic read.",
  "genres": [],
  "author": "Ed Mitchell",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/8989106-gold-rush-2000"
}