{
  "title": "The Trouser Press Record Guide: The Ultimate Guide to Alternative Music",
  "description": "Note: Despite several name changes, these are several editions of the same book.1st Ed. (1983) published as The Trouser Press Guide to New Wave Records.2nd Ed. (1985) published as The New Trouser Press Record Guide.3rd Ed. (1989) published as The New Trouser Press Record Guide (Revised Edition).4th Ed. (1991) published as The Trouser Press Record Guide: The Ultimate Guide to Alternative Music.5th Ed. (1997) published as The Trouser Press Guide to '90s Rock.\"The Trouser Press Record Guide\" has been hailed by music fans and the record industry as \"the bible\" of nonmainstream rock, stretching across the stylistic boundaries of punk, grunge, indie-pop, techno, noise, avant-garde and ska into hip-hop, new country, metal, roots rocks, folk, modern dance and world music.All new and bigger than ever, \"The Trouser Press Record Guide to '90's Rock\" definitively covers 2,300 of this decade's most innovative and influential artists, reviewing 8,500 records -- insanely obscure and familiar alike -- from all over the world. Each insightful entry contains pungent critical analysis, biographical information and a complete album disography.Selected praise for \"The Trouser Press Record Guide to '90's Rock\"\"My trustworthy fact checker, be-all-and-end-all arguement settler and the last word on modern rock. I don't go on the air without it.\" -- Gary Cee, WLIR-FM\"Still the most comprehensive guide through the labryrinth of indie and alternative rock. WHen you need a refresher course on all of Steve Albini's bands, or if you just want to know what Boy George did after Cultrue Club, this is the book to grab.\" -- David Browne, \"Entertainment Weekly\"",
  "genres": [
    "Music",
    "Reference",
    "Nonfiction",
    "History"
  ],
  "author": "Ira A.  Robbins",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/899268.The_Trouser_Press_Record_Guide"
}