{
  "title": "Fireseed One",
  "description": "Fireseed One is a futuristic thriller that can be enjoyed by both teens and adults. The year is 2089. Temperate climate has replaced Arctic ice, and much of what is now the United States is a lethal Hotzone, cut off by an insurmountable border from its northern, luckier neighbors, Ocean and Land Dominion. It is rumored that roving Hotzone nomads will kill for a water pellet or a slice of insect loaf, and that the ZWC, a dangerous Hotzone activist group, has infiltrated the border to the northern Dominions. Up in Ocean Dominion, all eighteen year-old Varik Teitur wants is to party on SnowAngel Island with his friend Audun and flirt with college girls he dreams of joining next year in his quest to become a doctor. Instead, he inherits a vast sea farm, following the death of his father, famous marine biologist Professor Teitur. Five weeks later, ZWC member Marisa Baron breaks into the farm’s secret seed vault and a fellow activist poisons the farm’s agar crops, the world’s food source. In order to save the last agar seedlings Varik is forced to journey to the Hotzone in search of Fireseed, a plant his father supposedly developed with magical hybridization properties. Varik takes Marisa along. Aside from being a terrorist, she’s the daughter of Melvyn Baron, the biggest real estate mogul in Land Dominion, and the professor’s old rival. Oddly, she knows lots about Fireseed, and what Hotzone land Professor Teitur bought to test the crop, before becoming embittered and trashing the project. No one except Varik knows whether Fireseed once existed off the drawing board. Might the refugees in Vegas-by-the-Sea have answers, or the bizarre Fireseed cult in the Chihuahua desert? Varik, the reluctant hero, must risk burning in the Hotzone, as his mother did, to save the ailing agar, and the world. Praise for Fireseed “Extraordinary thriller with a fascinating setting and rich, engaging characters who feel recognizable and human.” –Katia Lief, international bestselling author of You Are Next and Soul Catcher \"Fully imagined, fast-paced, and thoroughly captivating, Catherine Stine's Fireseed One sucks you into its fascinating world on page one and doesn't let go until the very end.\" –Dale Peck, award-winning author of Sprout and The Drift House series “FIRESEED is so full of startling ideas that I couldn't stop reading! Recommended for fans of science fiction, thrillers, or for anyone looking for a story full of big surprises.” -- Amy Kathleen Ryan, author of Glow, the first novel in The Sky Chasers series “Action, adventure, love, and loss plus superb world building all adds up to an incredibly imaginative story – one that should not be missed.” -Carolyn MacCullough, author of Once a Witch and Always a Witch *Illustrated by the Author",
  "genres": [
    "Young Adult",
    "Dystopia",
    "Science Fiction",
    "Amazon",
    "Futuristic",
    "Fantasy",
    "Romance"
  ],
  "author": "Catherine Stine",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/13164955-fireseed-one"
}