{
  "title": "In Stitches",
  "description": "Scrubs meets David Sedaris in this hilarious fish-out-of-water memoir about a young Korean-American nerd turned renowned plastic surgeon.Dr. Tony Youn grew up one of two Asian-American kids in a small town where diversity was uncommon. Too tall and too thin, he wore thick Coke-bottle glasses, braces, Hannibal Lecter headgear, and had a protruding jaw that one day began to grow, expanding to an unthinkable, monstrous size. After high school graduation, while other seniors partied at the beach or explored Europe, Youn lay strapped in an oral surgeon’s chair where he underwent a life-changing jaw reconstruction. Ironically, it was this brutal makeover that led him to his life’s calling, and he continued on to endure the four horrific, hilarious, sex-starved, and tension-filled years that eventually earned him an M.D. Offering a window into a side of medicine that most people never see, Youn shares his bumpy journey from a shy, skinny, awkward nerd into a renowned and successful plastic surgeon.Now, Youn is the media’s go-to plastic surgeon. He appears regularly on The Rachael Ray Show, and his blog, Celebrity Cosmetic Surgery, is widely read and the most popular blog by a plastic surgeon in the country. But it was a long road to success, and In Stitches recounts Dr. Youn’s misfit adolescence and his four tumultuous years in medical school with striking wit, heart, and humility.For anyone who has ever experienced the awkward teenage years, who has struggled to find his or her way in college, who has been worried that their “calling” would never come, who wants to believe that their doctor really cares, or is just ready for a read that will make you laugh and cry at the same time, this book is for you.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Medicine",
    "Medical",
    "Humor",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Anthony Youn",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/8992204-in-stitches"
}