{
  "title": "Overcoming Trauma through Yoga: Reclaiming Your Body",
  "description": "Survivors of trauma—whether abuse, accidents, or war—can end up profoundly wounded, betrayed by their bodies that failed to get them to safety and that are a source of pain. In order to fully heal from trauma, a connection must be made with oneself, including one’s body. The trauma-sensitive yoga described in this book moves beyond traditional talk therapies that focus on the mind, by bringing the body actively into the healing process. This allows trauma survivors to cultivate a more positive relationship to their body through gentle breath, mindfulness, and movement practices.Overcoming Trauma through Yoga is a book for survivors, clinicians, and yoga instructors who are interested in mind/body healing. It introduces trauma-sensitive yoga, a modified approach to yoga developed in collaboration between yoga teachers and clinicians at the Trauma Center at Justice Resource Institute, led by yoga teacher David Emerson, along with medical doctor Bessel van der Kolk. The book begins with an in-depth description of trauma and post-traumatic stress disorder (PTSD), including a description of how trauma is held in the body and the need for body-based treatment. It offers a brief history of yoga, describes various styles of yoga commonly found in Western practice, and identifies four key themes of trauma-sensitive yoga. Chair-based exercises are described that can be incorporated into individual or group therapy, targeting specific treatment goals, and modifications are offered for mat-based yoga classes. Each exercise includes trauma-sensitive language to introduce the practice, as well as photographs to illustrate the poses. The practices have been offered to a wide range of individuals and groups, including men and women, teens, returning veterans, and others. Rounded out by valuable quotes and case stories, the book presents mindfulness, breathing, and yoga exercises that can be used by home practitioners, yoga teachers, and therapists as a way to cultivate awareness, tolerance, and an increased acceptance of the self.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Health",
    "Self Help",
    "Mental Health",
    "Spirituality",
    "Counselling"
  ],
  "author": "David Emerson",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/8991101-overcoming-trauma-through-yoga"
}