{
  "title": "Tintin au pays des soviets",
  "description": "First published as strip comics in 1929 & 1930, published in book form in 1930.Tintin, a reporter for Le Petit Vingtieme, and his dog Snowy are sent on assignment to the Soviet Union. Departing from Brussels, his train is blown up en route to Moscow by an agent of the Soviet secret police, the OGPU. Tintin survives and is blamed by the authorities in Berlin for the \"accident\". He is put in jail and even taken to a torture chamber, but wrings his way out by deceit and disguise. He then steals a car and goes through several adventures before eventually reaching Moscow. In observing a Soviet election, Tintin finds that the Communists make people vote for their list by pointing guns at them, and that apparently productive factories are just hollow shells intended to fool foreign visitors (British communists) by burning hay to produce smoke and hitting a large sheet of corrugated iron to imitate the sound of machinery. In wandering the streets of Moscow, he discovers that Soviet authorities hand out bread to starving children only if they declare themselves Communists; if they fail to do so, the children are beaten. Due to the bulk of Russia's wheat crop being exported for Soviet propaganda purposes, Moscow is experiencing severe famine. Thus, the Communist leadership plans to pillage productive farms. Tintin manages to save several kulaks by warning them of the approaching troops, but is again captured. Escaping across the snowy wastes, Tintin stumbles upon the secret cache of riches that Stalin, Lenin and Trotsky have stolen from the Soviet people, such as vodka and caviar. Armed with this knowledge, he flees Russia via airplane, landing in Tempelhof Airport in Berlin, where he has a final encounter with OGPU agents who attempt to dispose of him before he can reveal what he has seen in the U.S.S.R. Finally returning to Belgium, he is greeted with great pomp by the rapturous public, arriving to a tremendous reception in the Grand Place in Brussels.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Bande Dessinée",
    "Fiction",
    "Adventure",
    "France",
    "Graphic Novels Comics"
  ],
  "author": "Hergé",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/900500.Tintin_au_pays_des_soviets"
}