{
  "title": "Das fliegende Klassenzimmer",
  "description": "Erich Kästner selbst zählte seine klassische Internatsgeschichte um eine Handvoll frecher Lausbuben Das fliegende Klassenzimmer zu seinem besten Kinderbuch.Die Kämpfe und Keilereien zwischen Gymnasiasten und Realschülern haben sich wohl seither nicht wesentlich verändert und auch die Jungs sind bis heute dieselben geblieben: Matthias, der ständig eine Semmel in der Hand hat, um das ewige Knurren im Magen zu besänftigen oder Johnny, der dauernd mit Sehen und Hören beschäftigt ist und nur manchmal an seine Eltern denkt, die ihn nicht mehr bei sich haben wollen. Uli ist der Kleinste, der vor Angst immer gleich wegläuft und mit einem gefährlichen Fallschirmsprung sich und den anderen seinen Mut beweisen will.Nur die Erwachsenen, wie der Hauslehrer Dr. Bökh und sein Freund, der Nichtraucher, vermutlich einer der ersten Aussteiger in der deutschen Kinderliteratur, die haben heute leider oft nicht mehr so viel Geduld, den Kindern zuzuhören, wenn sie von ihren Sorgen und Nöten erzählen. Die Zeit, ihnen mit Rat und Tat zur Seite zu stehen, fehlt den meisten völlig. (Übrigens wurde Dr. Bökh in der Verfilmung von 1954 hervorragend von Joachim Fuchsberger gespielt.)Wen wundert´s, daß sich Kinder für ihr Leben gern von Erich Kästner in seine abenteuerliche Schulwelt entführen lassen, die zwar ganz bestimmt nicht heil ist, aber in der es eine Menge Wärme und Verständnis für die großen und kleinen Probleme gibt.\"Wie kann ein erwachsener Mensch seine Jugend so vollkommen vergessen, daß er eines Tages überhaupt nicht mehr weiß, wie traurig und unglücklich Kinder zuweilen sein können.\" Doch es wäre nicht Erich Kästner, wenn er ein paar Seiten später nicht warnte: \"Ihr sollt hart im Nehmen werden, wie Boxer das nennen. Ihr sollt lernen, Schläge einzustecken und zu verdauen. Sonst seid ihr bei der ersten Ohrfeige, die euch das Leben versetzt, groggy. Denn das Leben hat eine verteufelt große Handschuhnummer, Herrschaften!\"Diese Zeilen erhalten ein ganz besonderes Gewicht, wenn man bedenkt, daß sie erstmals 1933 veröffentlicht wurden, im Jahre Hitlers Machtergreifung. Die kommende Ära der Nationalsozialisten wurde für einen Individualisten wie Kästner, der, obwohl er Schreibverbot hatte, in Deutschland blieb, eine dunkle Zeit. -- Manuela Haselberger",
  "genres": [
    "Classics",
    "Childrens",
    "Fiction",
    "German Literature",
    "Germany",
    "Christmas",
    "Young Adult"
  ],
  "author": "Erich Kästner",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/9004184-das-fliegende-klassenzimmer"
}