{
  "title": "Embracing Shame: How to Stop Resisting Shame and Turn It into a Powerful Ally",
  "description": "Discover a proven pathway for transforming shame from a self-punishing emotion into a powerful ally for your health and happiness.Why do we feel shame? Given how painful and destructive shame can be, it’s easy to see this emotion as an inner demon that turns our own mind against us. Yet shame is a universal emotion―and it serves an important purpose. “While toxic shame can keep us stuck in a self-defeating vortex,” say Bret Lyon and Sheila Rubin, “there is a healthy expression of shame designed to protect us, help us change, and actually build our self-esteem.”With Embracing Shame, these expert teachers share an invaluable guide to an emotion so volatile that most of us―including therapists―avoid talking about it. Here this husband and wife team, cofounders of the Center for Healing Shame, examine the dynamics of shame, the reasons it arises, why it causes such harm, and how we can heal its negative effects. Through case studies, creative tools, and body-based practices, they invite you to • The purpose of shame―How it is meant to protect and guide us, and why it gets distorted into a self-sabotaging emotion• How shame disguises itself by “binding” to other emotions―and methods for disentangling these complex feelings• The ways shame forms in childhood, evolves as we grow, is impacted by trauma, and takes residence in the body• Practical guidance for regulating common shame-based challenges―including the inner critic, imposter syndrome, perfectionism, intimacy in relationships, and much moreWhile no amount of self-talk, personal success, or therapy can eradicate shame, we can transform shame into the supportive, health-promoting force it was meant to be. Created as a go-to resource for laypersons and healing professionals alike, Embracing Shame offers an achievable path for reclaiming the true potential of this vital emotion to help us grow, connect, and find a new confidence in the way we move through life.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Mental Health",
    "Personal Development"
  ],
  "author": "Bret Lyon",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/90202114-embracing-shame"
}