{
  "title": "The Fish That Ate the Whale: The Life and Times of America's Banana King",
  "description": "A legendary tale, both true and astonishing, from the author of Israel is Real and \nSweet and Low\n\n\nWhen Samuel Zemurray arrived in America in 1891, he was tall, gangly, and penniless. When he died in the grandest house in New Orleans sixty-nine years later, he was among the richest, most powerful men in the world. In between, he worked as a fruit peddler, a banana hauler, a dockside hustler, and a plantation owner. He battled and conquered the United Fruit Company, becoming a symbol of the best and worst of the United States: proof that America is the land of opportunity, but also a classic example of the corporate pirate who treats foreign nations as the backdrop for his adventures. In Latin America, when people shouted “Yankee, go home!” it was men like Zemurray they had in mind.            Rich Cohen’s brilliant historical profile The Fish That Ate the Whale unveils Zemurray as a hidden kingmaker and capitalist revolutionary, driven by an indomitable will to succeed. Known as El Amigo, the Gringo, or simply Z, the Banana Man lived one of the great untold stories of the last hundred years. Starting with nothing but a cart of freckled bananas, he built a sprawling empire of banana cowboys, mercenary soldiers, Honduran peasants, CIA agents, and American statesmen. From hustling on the docks of New Orleans to overthrowing Central American governments, from feuding with Huey Long to working with the Dulles brothers, Zemurray emerges as an unforgettable figure, connected to the birth of modern American diplomacy, public relations, business, and war—a monumental life that reads like a parable of the American dream.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Business",
    "Audiobook",
    "Book Club",
    "Entrepreneurship"
  ],
  "author": "Rich Cohen",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13166586-the-fish-that-ate-the-whale"
}