{
  "title": "The Quintessence of Quick",
  "description": "The Quintessence of Quick continues the Saga of Jack Mason, which began with 2002's The Rough English Equivalent. The saga unfolds from 1946, but its beginning is in the year 4231. Jack, age 2285, is truly bored. Earth's population is less than a million, and there are very few challenges left on humanity's home planet. Elected to Phi Beta Kappa in 1957, he's been a motorcyclist, a carrier pilot, a hurricane hunter, owner of a jet charter service, a hugely successful investor, a galactic explorer and a felon. A lifelong risk-taker, he was an accessory to fraud and murder in support of Moses, his boyhood mentor and ex-Luftwaffe pilot. Investing millions left to him through Moses faked-death plot, Jack was rich by the end of the 20th century. He's much more so by the 43rd. Migrating in stages over two centuries from human to a fully-synthetic entity, Jack succeeds in becoming an essentially massless life form, the first to be produced by a superset of teleportation. Testing his new capabilities, he finds that he can move freely in spacetime, and decides to intervene in the crucifixion of Jesus. Succeeding in that, Jack then explores his youth, taking the form of a Northern Goshawk. Jack dubs the bird Flx, after the FLXible bus in which he and his mother Serena flee Los Alamos, where his father was working on the Manhattan Project. Scorning the suburbia of her peers, Serena elects to manage the Bisque Hotel, the property of her father, Lawton J. \"Pap\" Redding, a cotton broker and real estate investor. Flx lingers to observe Jack's growth to young manhood in Bisque, her Georgia hometown, pronounced BIS-kew by its natives.In 1946, nine-year-old Jack and his friend Ricky meet stranded traveler Moses Kubielski in Ricky's granddad's radiator repair shop. His Buick limousine has blown its radiator, and the boys volunteer to walk to the hotel with him. Seeing Serena convinces Moses, a former member of the Abwehr, the Nazi intelligence organization, that he should stay on in Bisque for awhile. He can afford it, having taken flight in mid-1941 with $3 million earmarked as a down payment to the Irish Republican Army for the assassination of President Roosevelt and Winston Churchill. His Bisque sojourn lasts for several years, during which time he becomes Serena's lover, Jack's mentor and Pap Redding's partner in a beer distributorship that prospers under his direction. The appearance of an old Abwehr associate, now with the Soviet KGB, makes an immediate exit from Bisque necessary. Sharing his plan to have himself and the KGB man picked up at sea after a faked crash, he wills the beer distributorship, in which he has since acquired 100% ownership, to Jack. Moses will contact him, he promises, when it's safe to do so.When Jack enters college, Serena returns to New York, where they'd lived before Los Alamos, to pursue her career as a sculptor. Visiting her, he meets her new client, Clare Boothe Luce, noted writer, editor, Congresswoman and Ambassador. Their affair begins the same day in the Luces' Waldorf-Astoria suite. Her penchant for powerful men attracts her to Jack as if she foresees his incredible destiny. Later, Jack introduces her to his sometime partners in crime, Moses and Linda, the woman who's been both his and Moses' lover. The three are now partners in a Miami-based air taxi service. Intrigued, Mrs. Luce calls her friend William Pawley, an Allen Dulles crony, and soon Moses and Linda are flying CIA-directed missions into Castro's Cuba.Jack, now in the Navy, is caught up in the maelstrom of the JFK assassination. Both Moses and his old friend Rick, a Special Forces officer, kill figures in the plot. Jack's primary reason for wanting to relive this crucial part of his early life was to save them from the plotters' retribution. Jack flies the men to refuge on an offshore starship, where they join Jesus (\"Call me Naz.\") over breakfast pork chops...",
  "genres": [],
  "author": "Stan Hayes",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/9017545-the-quintessence-of-quick"
}