{
  "title": "Mrs Tim of the Regiment",
  "description": "The classic comic novel based on the author's real experiences as the wife of a British Army officer in the 1920s'The writer's unflagging humour, her shrewd, worldly wisdom, and her extremely realistic pictures of garrison life make it all good reading ... delightful' Times Literary Supplement'Stevenson has spiced this tale of British army life with an unobtrusive, effortless wit which often proves deceptively sharp' New York Times_______________________Vivacious young Hester Christie tries to run her home like clockwork, as would befit the wife of British Army officer, Tim Christie. However hard Mrs Tim strives for seamless living amidst the other army wives, she is always moving flat-out to remember groceries, rule lively children, side-step village gossip and placate her husband with bacon, eggs, toast and marmalade.Left alone for months at a time whilst her husband is with his regiment, Mrs Tim resolves to keep a diary of events large and small in her family life. Once pen is set to paper no affairs of the head or heart are overlooked.When a move to a new regiment in Scotland uproots the Christie family, Mrs Tim is hurled into a whole new drama of dilemmas; from settling in with a new set whilst her husband is away, to disentangling a dear friend from an unsuitable match. Against the wild landscape of surging rivers, sheer rocks and rolling mists, who should stride into Mrs Tim's life one day but the dashing Major Morley, hellbent on pursuit of our charming heroine. And Hester will soon find that life holds unexpected crossroads..._______________________Mrs Tim of the Regiment is part of The Bloomsbury Group, a new library of books from the early twentieth century chosen by readers for readers",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Classics",
    "Humor",
    "British Literature",
    "Romance",
    "Historical"
  ],
  "author": "D.E. Stevenson",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/9032993-mrs-tim-of-the-regiment"
}