{
  "title": "The Seven Principles of Golf: Mastering the Mental Game On and Off the Golf Course",
  "description": "\"This succinct, persuasive 128-page book belongs on your golf shelf next to Harvey Penick's Little Red Book and Ben Hogan's Five Lessons. \"                                                                                      - Barnes & NobleThe Seven Principles of Golf are PowerfulThis unique and innovative golf instruction approach will increase your distance, cut strokes, lower scores and effortlessly improve your golf game without changes to your grip, swing or clubs.The Seven Principles of Golf are SimpleThis book offers simple and cohesive step-by-step instruction with detailed explanations, exercises and illustrations all designed to help you hit straighter, longer and more accurate shots. Learn easy and practical skills to hit more consistent shots, eliminate mental errors and break through the 100, 90, 80 or 70 stroke barriers.The Seven Principles of Golf are EffectiveGolf is 90% mental. That means that 90% of poor swings, penalties, mistakes, miscues, mishits, bogeys, double bogeys or worse are caused by mental game errors. Improve your mental game, commonly known as sports psychology, and you will hit the sweet spot, maximize power and increase accuracy. For over 15 years, the coaching offered in this book has been tested and proven at mental golf expert Darrin Gee's Spirit of Golf Academy, named one of the top golf schools in America by Golf Magazine .The Seven Principles of Golf is a Lifetime Collectible BookThis book is beautifully designed with a clothbound hardcover, picture plate tip-on, ribbon bookmark and illustrations by renowned artist Keith Witmer in the classical pen and ink line style similar to those seen in the bestselling Ben Hogan's Five Lessons .A Note from the AuthorAll golfers from PGA and LPGA Touring Professional to beginners have experienced frustration on the golf course. I am no exception. I started playing golf when I was in college. My skills steadily improved over the years and I eventually broke 80 and achieved a single-digit handicap. Then I plateaued. I started messing with my swing and my scores skyrocketed. I knew I was capable of playing better and shooting lower scores. I was so frustrated, I quit the game of golf.After a long break, I started hitting golf balls again. However, something had changed this time around. When I hit a great shot, I noticed I was doing something different. What was I doing? NOTHING. No swing thoughts, no distractions, no second-guessing, no effort. I got out of my own way. This was the beginning of my exploration into the power of the mental game and sports psychology. With my education, research and commitment to the sport of golf, I started my golf academy that focuses exclusively on helping golfers play to their potential utilizing mental game techniques, instruction and The Seven Principles of Golf.These principles are the foundation for my golf academy as we have coached thousands of golfers like you. My philosophy has always been to keep it simple and practical with a Zen-like approach. The results have been tremendous. I hope you enjoy The Seven Principles of Golf and experience a transformation in your golf game and life.Scroll up, click the buy button and get started today.",
  "genres": [],
  "author": "Darrin Gee",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/903061.The_Seven_Principles_of_Golf"
}