{
  "title": "Exotic Music of the Belly Dancer",
  "description": "Hank Fitzpatrick's life is what you might expect from a man-child stumbling his way through and beyond adolescence in the late 1980s in small town hypersexual, drunk, stoned, prone to fits of spontaneous masturbation, occasionally Catholic, and accidentally well-intentioned. His life is in perpetual conflict as he confuses sex for love, heartache for passion, desperation for honesty, and abuse for affection. Caught in the crossfire of raging hormones, bad decisions and family tragedy, Hank is just a boy not yet ready to be a man. And like many boys growing up, Hank is desperate to impress his father. The impossibly perfect patriarch of the family, John Fitzpatrick decides at age forty-two he wants to have a vasectomy reversal. Is Hank ready to be a brother again at age seventeen? What about his mother's narcotics and gimlet-soaked uterus? A child will come of this, but not without consequences. Laura is Hank's first true love. From their stolen nights together as high-school sweethearts to their final encounter as twentysomething adults, they never figure out how to stop hurting one another. Beth, the girl who loves Hank unconditionally, can only wait for so long before longing turns to regret. But everything will be okay as long as Hank's best friend Hatch is there to help him exorcise his demons with a half-gallon of bourbon and a bottle of cough syrup. Exotic Music of the Belly Dancer is more than just a tribute to the last uninhibited pre-9/11, pre-Facebook generation. It's a comedy. It's a tragedy. It's a love story. It's a subversive yet empathetic, warts-and-all portrait rooted in real-life that kids will read behind their parents' backs. And if somewhere along the way we can all share in the redemptive power of a belly dancer's love. well, that's okay, too.",
  "genres": [
    "Fiction"
  ],
  "author": "Brian Sweany",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/9037514-exotic-music-of-the-belly-dancer"
}