{
  "title": "Not Tonight, Honey: Wait 'Til I'm A Size 6",
  "description": "\"Not Tonight, Honey Wait Til I'm a Size 6\" is the book people are talking about. Syndicated Gannett News Services columnist Susan Reinhardt takes every topic on men's and women's minds and blows them wide open with a never-before-seen candor. The humor is explosive. Topics range from bodies that have gone to pot, to grandmothers taking up smoking at age 80 and hiding lit cigarettes in bras and aprons. Once, the author had to \"marry\" her best friend when the minister (also the bride's yard man) blew a gasket in his colostomy bag.Reinhardt's stories are often compared to that of a female David Sedaris or a married and middle-aged Bridget Jones. She is Erma Bombeck if Erma had Chef Emeril kicking it up a notch! People say they've never read funnier, but the poignant stories she tells pull a few tears.From the AuthorI wrote this book because people need to laugh. If it weren't for the odd things in life, the every day that can turn hilarious if viewed in the right frame of mind, most of us might as well stay in bed with popcorn, Lifetime and QVC.I needed to bring the humorous to the surface because there are too many Eeyores and sad sacks in this world and I love those who love to laugh. Power is laughter. Humor heals.I held nothing back. My mother, one of the more eccentric characters in the book, said she wasn't letting her Baptist church friends know about the book. But finally, she's relenting. One Baptist at a time.I sure hope you enjoy reading these wild but heart-infused stories as much as I enjoyed writing them. It isn't easy being married, nearly middle-aged, and watching my skin sag and teats fall to my knees. But it sure helps to write about it, and laugh so hard the tears salt the face.Like an edgier, naughtier Erma Bombeck, award-winning columnist Susan Reinhardt has made die-hard fans of fellow writers and newspaper readers across the country with her wickedly skewed reports from the trenches of American family life.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Essays",
    "Chick Lit",
    "Southern",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Susan Reinhardt",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/902869.Not_Tonight_Honey"
}