{
  "title": "The Grand Ellipse",
  "description": "The Grand EllipseIn the modern, civilized republic of Vonahr, a land blessed with gaslight, steam engines, and indoor plumbing, the need for magic seems a thing of the past. But soon the Vonahrish will find that magic is their only hope--for an unstoppable evil is on the march. The Grewzians, an imperialistic race of fanatics, are intent on conquering the world. Nation after nation has disappeared down the maw of these barbaric invaders. No one has been able to halt them--and now they are massing on Vonahr's borders.  But the Vonahrish still have one slim chance for salvation. In a nearby neutral kingdom, a brilliant savant has conjured up the ultimate Sentient Fire, a miraculous flame that responds to the command of its maker. The potential military value of such a discovery is immeasurable.  But Low Hetz's mad, flamboyant king refuses to relinquish the secret and jeopardize his nation's neutrality. And so the desperate government of Vonahr, unable to take no for an answer, has come up with an enterprising plan.... Her name is Luzelle Devaire. An intrepid adventurer of rare beauty, she is exactly the sort to appeal to the king's weakness for exquisite women. There is just one To obtain an audience, Luzelle must enter and win the Grand Ellipse, King Miltzin's extraordinary test of endurance, ingenuity, and valor--a race that will cover distant lands and harsh terrain.  To the daring Luzelle, it is a challenge worth taking, for she has her own reasons for wanting to win. But it won't be easy--ahead lie more obstacles, more mystery, and more perils than she ever dreamed. The race is on...and the future of the world rests on its outcome.  Superbly written and imbued with drama and magic, poignancy and power, The Grand Ellipse is fantasy at its finest--unforgettable and deliciously entertaining.",
  "genres": [
    "Fantasy",
    "Steampunk",
    "Fiction",
    "Adventure",
    "Science Fiction",
    "Romance",
    "Science Fiction Fantasy"
  ],
  "author": "Paula Volsky",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/902942.The_Grand_Ellipse"
}