{
  "title": "Love, Life, and Elephants: An African Love Story",
  "description": "Daphne Sheldrick, whose family arrived in Africa from Scotland in the 1820s, is the first person ever to have successfully hand-reared newborn elephants. Her deep empathy and understanding, her years of observing Kenya’s rich variety of wildlife, and her pioneering work in perfecting the right husbandry and milk formula have saved countless elephants, rhinos, and other baby animals from certain death. In this heartwarming and poignant memoir, Daphne shares her amazing relationships with a host of orphans, including her first love, Bushy, a liquid-eyed antelope; Rickey-Tickey-Tavey, the little dwarf mongoose; Gregory Peck, the busy buffalo weaver bird; Huppety, the mischievous zebra; and the majestic elephant Eleanor, with whom Daphne has shared more than forty years of great friendship.  But this is also a magical and heartbreaking human love story between Daphne and David Sheldrick, the famous Tsavo Park warden. It was their deep and passionate love, David’s extraordinary insight into all aspects of nature, and the tragedy of his early death that inspired Daphne’s vast array of achievements, most notably the founding of the world-renowned David Sheldrick Wildlife Trust and the Orphans’ Nursery in Nairobi National Park, where Daphne continues to live and work to this day.  Encompassing not only David and Daphne’s tireless campaign for an end to poaching and for conserving Kenya’s wildlife, but also their ability to engage with the human side of animals and their rearing of the orphans expressly so they can return to the wild, Love, Life, and Elephants is alive with compassion and humor, providing a rare insight into the life of one of the world’s most remarkable women.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Animals",
    "Biography",
    "Nature",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Daphne Sheldrick",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/13166621-love-life-and-elephants"
}