{
  "title": "The Quiet Game",
  "description": "The Barnes & Noble ReviewGreg Iles, a gifted young suspense novelist from Natchez, Mississippi, is nothing if not ambitious. His first two novels, Spandau Phoenix and Black Cross, were sprawling, wide-screen thrillers set against meticulously researched World War II backdrops. His third book, Mortal Fear, combined cutting edge computer technology with an effective variation on that modern archetype, the serial killer. (Mortal Fear, unfortunately, seemed to run out of steam in the final chapters, but for most of its length, was an original and thoroughly engrossing piece of work.) And now we have The Quiet Game, which may be Iles's most ambitious novel to date, a book that is at once a courtroom drama, a murder mystery, a meditation on the recent history of race relations in Mississippi, and a lively, full-blooded example of the Southern Gothic.As The Quiet Game opens, Penn Cage -- a prosecuting attorney turned bestselling novelist -- is returning, with his four-year-old daughter, to his childhood home of Natchez, where he hopes to recover from the extended trauma of his wife's recent death. Once there, he finds himself quickly caught up in an interconnected series of events whose roots reach back into his -- and his family's -- personal past, and into the troubled, sometimes violent history of Natchez itself.Shortly after his arrival, Penn discovers that his father, a respected physician, is being blackmailed by a local lowlife named Ray Presley. At about the same time, during the course of an interview with Caitlin Masters, the beautiful, Boston-born publisher of The Natchez Examiner, he inadvertently draws attention to the most notorious race crime in the city's history: the unsolved murder of Del Payton, a black factory worker killed by a car bomb in 1968. Penn's caustic, casually delivered comments on the case have immediate and unexpected consequences: Del's widow, Althea Payton, asks Penn to reinvestigate her husband's murder, while several other parties, each with their own agendas to protect, attempt to pressure Penn into ignoring the request, and allowing the case to remain safely -- and permanently -- unsolved.Penn's own inclination is to do just that until he meets a tormented, alcoholic policeman named Ike Ransom. Ransom makes the unsubstantiated claim that the person responsible for the Payton murder was Judge Leo Marsden, the man who nearly destroyed Penn's father by implacably pursuing a frivolous malpractice suit some 20 years before. Yielding to the desire for personal revenge, Penn reverses his original position and agrees to take a fresh look at the 30-year-old mystery.Penn's investigation forms the heart of the narrative and leads, eventually, in some unexpected directions. Before it is complete, that investigation will widen to encompass not only the Payton murder, but the personal history of the Cage family, the tragic sexual secrets of Livy Marsden -- Penn's former lover and Leo Marsden's daughter -- and the paranoid manipulations of the long-deceased J. Edgar Hoover. His pursuit of the elusive truth leads Penn from the mansions and ghettos of Natchez to a cabin in the Colorado mountains, and culminates in a desperate, winner-take-all slander trial whose outcome remains uncertain until the final pages.The Quiet Game is a densely detailed, swiftly paced novel that constantly runs the risk of going over the top, but never quite does. In the end, Iles holds it all together through an impressive combination of nerve, ingenuity, and narrative energy, and through the sense of personal conviction with which he invests the entire complex enterprise. Like its edgy, impulsive narrator/hero, The Quiet Game moves relentlessly toward closure, and toward a hard-won sense of personal redemption. Along the way, it addresses a number of difficult issues, issues concerning race, class, family, the burdens of history, and the enduring importance of moral accountability. The result is an intricate and absorbing story by a writer who is constantly evolving and who seems likely to produce some significant popular fiction in the years to come. (Bill Sheehan)",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Suspense",
    "Audiobook"
  ],
  "author": "Greg Iles",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/9039789-the-quiet-game"
}