{
  "title": "The Blind Watchmaker",
  "description": "From the author of The God Delusion, Richard Dawkins' The Blind Watchmaker has been acclaimed as the most influential work on evolution in the last hundred years. In 1802 the Rev. William Paley's argued in Natural Theology that just as finding a watch would lead you to conclude that a watchmaker must exist, the complexity of living organisms proves that a Creator exists. Not so, says Richard Dawkins, and in this brilliant and controversial book, the acclaimed evolutionary biologist sets out to demonstrate that the theory of evolution by natural selection - the unconscious, automatic, blind yet essentially non-random process discovered by Charles Darwin - is the only answer to the biggest question of why do we exist? 'I want to persuade the reader, not just that the Darwinian world-view happens to be true, but that it is the only known theory that could, in principle, solve the mystery of our existence' To Dawkins, The Blind Watchmaker is nature itself, gradually forming order from the very building-blocks of DNA. 'This might just be the most important evolution book since Darwin'  John Gribbin 'Richard Dawkins has updated evolution ... his subject is nothing less than the meaning of life'  The Times 'Enchantingly witty and persusive ... pleasurably intelligible to the scientifically illiterate'  Observer Richard Dawkins is a Fellow of both the Royal Society and the Royal Society of Literature, and Vice President of the British Humanist Association. He was first catapulted to fame with The Selfish Gene, which he followed with a string of bestselling The Extended Phenotype, The Blind Watchmaker, River Out of Eden, Unweaving the Rainbow, and an impassioned defence of atheism, The God Delusion.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Philosophy",
    "Religion",
    "Atheism",
    "Popular Science"
  ],
  "author": "Richard Dawkins",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/904698.The_Blind_Watchmaker"
}