{
  "title": "Growing Up Filipino: Stories for Young Adults",
  "description": "GROWING UP STORIES FOR YOUNG ADULTS is the acclaimed collection of stories about the experience of growing up Filipino. Emerging and established award-winning writers are the authors of this fine collection of 29 short stories about what it means to be young and Filipino in the Philippines and the United States. Filipinos in America are the second largest in the umbrella group of Asian Americans, yet there is a scarcity of books by and for Filipinos. This impressive array captures the complexities of both the culture and history and the realities of the lives of young adults no matter what their ethnic affiliation. Each story is assigned to one of five universal family, angst, friendship, love, and home. Each story is introduced by a thumbnail sketch of the author and a paragraph or two about some element of Filipino culture or history that is relevant to the story. Authors include those born and continuing to live in the Philippines, emigres, and American-born Filipinos.A finalist for the Philippine National Book Award, the book was in the National Geographic Summer Reading List for 2020. \"These 29 short stories offer a highly textured portrait of Filipino youth and an excellent sampling of creative writing. Thematically arranged, most of the pieces have been written since the turn of the 21st century. Each story is introduced by a thumbnail sketch of the author and a paragraph or two about some element that is relevant to the story ... The high caliber and broad but wholly accessible range of this collection, however, makes this title a solid purchase for multiple reasons.\" ~ School Library Journal \"Emerging and established award-winning writers are the authors of this fine collection of 29 stories about what it means to be Filipino in the Philippines and in the United States ... This impressive array captures the complexities of both the Filipino culture and history and the realities of the lives of young adults no matter what their ethnic affiliation.\" Bookbird Journal International Children's Literature (Glenna Sloan) \"In this fine short-story collection, 29 Filipino American writers explore the universal challenges of adolescence from the unique perspectives of teens in the Philippines or in the U.S. Organized into five sections -- Family, Angst, Friendship, Love, and Home -- all the stories are about growing up and what the introduction calls \"growing into Filipino-ness, growing with Filipinos, and growing in or growing away from the Philippines ... The cultural flavor aspect never overwhelms the stories, and readers will be drawn to the particulars as well as the universal concerns of family, friends, love, and leaving home.\"' ~ Booklist \"A wide range of views and insights into growing up Filipino are compiled in this anthology of short stories and memoirs.... The term Flip, the penchant for singing songs in front of relatives and friends, social conflicts among American-born and Philippine-born Filipinos, experiences of being gay, and experiences working in migrant camps are among the more significant cultural, social, and political realities depicted in this collection. Because the writings focus on issues related to childhood and adolescence, with a style that appeals to teen readers, this book is highly recommended for young adults. ~ Multicultural Review",
  "genres": [
    "Young Adult",
    "Fiction",
    "Asia",
    "Short Stories",
    "Anthologies"
  ],
  "author": "Cecilia Manguerra Brainard",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/903962.Growing_Up_Filipino"
}