{
  "title": "The Real Crash: America's Coming Bankruptcy---How to Save Yourself and Your Country",
  "description": "Peter D. Schiff has fully revised and updated his provocative New York Times , Wall Street Journal , and USA Today bestseller The Real Crash . First published in 2012, The Real Crash argues that America is enjoying a government-inflated bubble, one that reality will explode...with disastrous consequences for the economy and for each of us.Since 2012, what has happened with our economy? The stock market continues its illusory gains, the Fed \"tapers\" while some jobs return, and yet the fundamental threat to our way of life has only grown worse-- much, much worse. The United States government nearly defaulted on its debts and the solution was to raise the debt limit-- to spend yet more money, to go even deeper in hock to China, and to burden every American with obligations that are impossible to repay.With incisive analysis and expert financial understanding, Peter D. Schiff reveals that the road we're on will lead to an abrupt devaluation of our currency and a crash that will upend our power, our political system, and our way of life. This new edition of The Real Crash includes more than 35,000 new words of text, which -The 2013 government shutdown, the debt crisis, and how the solution only dug a deeper hole-The IRS political auditing scandal and why the average American should care-What will happen when the government stops inflating the stock and real estate market bubbles-How Detroit's bankruptcy mirrors our national too many promises, not enough revenueTo avoid complete collapse, America must drastically reduce government spending, and regulations that drain businesses and suppress economic growth, eliminate costly and unnecessary agencies, stop foreign military escapades, and cut entitlements of all kinds for all classes of people. And, with wisdom born from having predicted the Crash of 2008, Peter D. Schiff explains how to protect yourself, your family, your money, and your country from the even greater crash that lies ahead.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "Finance",
    "Business",
    "History",
    "Audiobook"
  ],
  "author": "Peter D. Schiff",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/13166898-the-real-crash"
}