{
  "title": "Dragon Blood",
  "description": "They were the last of their kind--brothers born of the last dragon and doomed never to find mates of their own--not of their own kind, at any rate. Carnal/Erotica—graphic violence and sexual encounters, multiple sexual partners. Paranormal Romance. Author Madelaine Montague was first published by Harlequin Enterprises in 1994 under the pen name of Madris Dupree after nearly a decade of ‘apprenticeship’ --struggling to learn the business, the marketing, and the writing skills necessary for a career in commercial fiction. That ‘first’ published book, a historical, (which was actually her fourth attempt at a marketable piece of fiction) was successful, however, selling nearly 80,000 copies in the U.S., Switzerland, France, and the U.K. Writing wasn’t actually her first career OR her first love, though, despite a life-long love of books. It was her third career. Her first career was in the then just emerging computer science field. After studying computer programming, she worked in the computer field from seventeen into her twenties—starting at the data processing center of the college she attended. She worked at the J.C. Penney catalogue distribution center in Atlanta, at the University of South Florida in Tampa, and South Georgia Medical Center in Valdosta until she met the future father of her children and married for the second time. Her second career (and the one dearest to her heart) was in motherhood. She began writing so that she could bring in an income and still stay at home to rear her children. One son, three daughters, 7 grandchildren (and counting), and a gazillion pets later, she now lives in the ‘castle’ she designed and (partly) built herself (the woodworking, anyway) with her boyfriend, Benjamin, a native, Native American—(they have DNA proof!)-- And her two miniature horses, Napoleon and Stormy. Sadly, Napoleon lost his Josephine, but he’s enjoying a new romance with Stormy, a pretty little golden palomino only recently acquired. Madelaine has a wide variety of interests. She writes various genres (or sub-genres since she always writes romance!) under different pen names. She has written paranormal under several--Marie Morin for her French ancestry through her paternal grandparents who were French Canadian, and K. M. (Kimberly) Zant. Madelaine would love to hear from her fans. Please email her at madelainemontague@yahoo.com. Titles by this Breeding Ground Call of the Wolf Darkling Seas Dragon Blood Feline Heat Hell's Mark of the Wolf Hunger of the Wolf Night Breeds Nocturnal Of Unknown Wolf Wolfen This author also writes under the pen names Kaitlyn O'Connor and Kimberly Zant.",
  "genres": [
    "Paranormal",
    "Menage",
    "Dragons",
    "Romance",
    "Erotica",
    "Paranormal Romance",
    "Fantasy"
  ],
  "author": "Madelaine Montague",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/9048370-dragon-blood"
}