{
  "title": "No Space for Further Burials",
  "description": "A brutal and \"fascinating\" novel of an American held captive in an asylum in Afghanistan (Stewart O'Nan).Set in Afghanistan in 2002, No Space for Further Burials is a chilling indictment of the madness of war and our collective complicity in the perpetuation of violence. The novel's narrator, a US Army medical technician in Afghanistan helping to \"liberate\" the country from the Taliban, has been captured by rebels and thrown into an asylum. The other inmates are a besieged gathering of society's forgotten and unwanted refugees and derelicts, disabled and different, resilient and maddened, struggling to survive the lunacy raging outside the asylum compound. The novel becomes a powerful evocation of the country's desolate history of plunder and war, waged by insiders and outsiders, all fueled by ideology, desperation, and greed.This astonishingly powerful story unfolds the tragedy of Afghanistan, as told by the captive narrator in hauntingly beautiful prose. While the characters try to cope with their individual destinies, the terrible madness of war is counterpointed with the poignancy of their lives and the narrator's own peculiar predicament--the \"victor\" now a victim, his ambivalence a metaphor for everything Afghanistan symbolizes.\"A novel of unrelenting truth held in transcendent prose and an exquisite grace. There is no easy redemption here, but there is light and more light.\" --Chris Abani, author of GraceLand and Song for Night\"In writing through the eyes of an American captive in Afghanistan, Feryal Ali Gauhar has fashioned a fascinating two-way mirror in which we see the author creating an Other confronting Otherness. As in Richard Powers' hostage novel Ploughing in the Dark , the mask of character reveals as much as it conceals.\" --Stewart O'Nan, author of Songs for the Missing\"An unbearably beautiful book, one you will not soon forget . . . What Gauhar shows us is that in a war there are only those who die and those who survive, and sometimes even those lines get blurred. And that's what keeps you hungrily turning the pages.\" --Radhika Jha, author of Smell",
  "genres": [
    "Fiction"
  ],
  "author": "Feryal Ali Gauhar",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/9056821-no-space-for-further-burials"
}