{
  "title": "The Way",
  "description": "HAILED BY O, THE OPRAH MAGAZINE, AS “A TITLE TO PICK UP NOW!”In Kristen Wolf’s audacious and timely fiction debut, an unusual girl in the heart of ancient Palestine escapes her life of oppression—undertakes an epic and dangerous journey—and struggles to accept her remarkable calling as a great spiritual leader. Deeply emotional, provocative and edge-of-your-seat suspenseful, THE WAY transports readers to an exotic world brimming with mystery, betrayal, passion, unforgettable characters and jaw-dropping plot twists.“Wow, is all I can say. This novel blew me away!”—Book Pleasures“I don’t think I could rave anymore about this book … truly one of a kind.”—Chick Lit Plus“THE WAY is a magical, evocative first novel that I plan to buy a carton of to give to my family and friends. This message of compas­sion, healing, and respect for women could indeed transform our world.”—Joan Borysenko, Ph.D., author of A Woman’s Journey to God\"I was surprised in more ways than I ever could have imagined.”—Javier Sierra, New York Times bestselling author of The Secret Supper\"A bold and powerful story...needs to make its way to the reading lists of women everywhere.\" —Rainbow ReaderAnna is a young girl with a big spirit living in ancient Palestine where a daughter is a disappointment. As if this were not painful enough, her striking but androgynous appearance provokes ridicule from the people around her and seeds doubt within her own heart. While struggling to find her place in the world, an unexpected tragedy strikes her family and Anna's father—dressing her as a boy—sells his daughter to a band of shepherds.Abandoned and armed with only bravery and wits, Anna must learn to survive the harsh desert and unruly men. Yet just when she masters her life of disguise, she stumbles upon a den of mysterious caves and is captured by the secret band of women living inside. Tempted at first to escape, she soon discovers that the sisterhood’s mystical teachings and healing abilities have forced her to question everything she’s been told to believe and—to her amazement—unleashed an astonishing power within her.But when violent enemies opposed to the women's ways threaten to destroy them, Anna vows to save her friends and preserve their priceless wisdom. Forced again to leave her home and loved ones behind, a transformed Anna returns to the world of men—as only she can—determined to unfold a daring and dangerous quest: One that will put everything she's become to the test. Will she succeed…or be condemned? Gorgeously written, cinematic in scope and utterly captivating, Anna’s bold journey of courage—and its startling revelations—will thrill and inspire readers everywhere.PRAISE FOR THE WAY:\"This imaginative novel may make you a believer.\"—O, The Oprah Magazine “THE WAY is a daring and passionate debut from an author to watch in the future.”—Historical Novel Society“Respelendent writing.”—Minding Spot“…page turning and utterly creative.”—Maria’s Space\"Highly descriptive settings, imaginative plot, and flowing script abound.”—Literary R & R“THE WAY challenges you to think beyond what you have learned…to expand your vision.\"—Library Girl Reads“…sure to be a book-club darling.”—Booklist“A remarkable story, beautifully told. —Mary Johnson, NYT bestselling author of An Unquenchable Thirst: A Memoir",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Spirituality",
    "Feminism",
    "Book Club",
    "Novels"
  ],
  "author": "Kristen Wolf",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/9058501-the-way"
}