{
  "title": "Bootscootin' Blahniks",
  "description": "International Bestselling Author D. D. Scott two-steps into your heart with book one of her chart-topping debut series. A #1 Free Title on all of the major ebook etailers, it’s been downloaded over 600,000 times and was a Top 10 Mother’s Day Pick.Think Sex and the City meets Urban Cowboy.It’s Chick Lit Gone Country.Manhattan apparel designer Roxy Rae Vaughn, who's also a still-in-the-closet, country line dancing queen, is tired of being a Fifth Avenue up-and-comer. Against her parent’s wishes and without their financial backing, she moves to Nashville, Tennessee and opens a boutique in a local tractor supply store, the only retail space she can afford. Short on cash and luck, she rear-ends a pick-up truck belonging to a tomato-growin', bootscootin' cowboy who is anything but the perfect fit for her career plans, although he is her ideal dance partner. Can Roxy accept that her best fit is on the dance floor moving to her own style and her cowboy's lead?Tomato farmer by day and bootscootin' instructor by night Zayne McDonald doesn't give a damn about winning Nashville's heirloom tomato contest, even though his late father did. Zayne wants to honor his father, but what he really wants is to line dance his way into a winner's spotlight. When he and Roxy are discovered by a huge dance show producer, Zayne learns it's partnering with Roxy that's his winning hybrid mix. That is, if he can keep her and the tomato contest away from Beefsteak Jack Baudlin, the toughest tomato man in CMT country.About the D. Scott is an Amazon Top 100, International Bestselling Author. With over 300,000 books sold, including 30 titles in 5 genres and chart-topping audio books, too, she treats her readers to stories with loads of laughs and a bunch of heart. You can get the scoop on her, her books and her adventures as a new, vegetarian (almost vegan) yogi in her new cyber home—www.ddscottville.comPRAISE FOR D. D. \"...one of the top Romantic Comedy/Humorous Mystery writers out right now.\" — ENT (Ereader News Today)Books available by D. D. Bootscootin’ BooksBootscootin’ BlahniksStompin’ on StetsonsBuckles Me BabyThe Cozy Cash MysteriesThug GuardLip GlockHullabaloo and Holly TooCarats & CoconutsThe Royal DigsThe Mom Squad Mini-Mayhem MysteriesFluid FulfillmentLicensed for LoveBoxed SetsBootscootin’ and Cozy Cash Mystery Boxed SetThe Cozy Cash Mysteries Boxed Set #1The Stuck with a Series Boxed Set #1The Stuck with a SeriesStuck with a StiffStuck with a SpellStuck with Sleigh BellsStuck with a SlutBelle Bishop Queen of WitchesPractical MischiefPractical Mayhem—Coming 2015Practical Madness—Coming 2016Home for The HolidaysHollywood HolidaysNon-FictionMuse Unleashing Your Inner Sybil10 Years and 24 Hours to Indie Epublishing SuccessThe WG2E All-For-Indies AnthologiesWinter Wonderland EditionViva La Valentine EditionSpring Hop EditionSummer Fling EditionSpooky Shorts EditionMartini Madness EditionAudio BooksBootscootin’ BlahniksStompin’ on StetsonsBuckles Me BabyStuck with a StiffStuck with a SpellStuck with Sleigh BellsThe Stuck with a Series Audio Book Boxed Set #1Thug GuardLip Glock&",
  "genres": [
    "Romance",
    "Westerns",
    "Chick Lit",
    "Contemporary Romance",
    "Fiction",
    "Humor",
    "Adult"
  ],
  "author": "D.D. Scott",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/9056848-bootscootin-blahniks"
}