{
  "title": "In Over Our Heads: The Mental Demands of Modern Life",
  "description": "If contemporary culture were a school, with all the tasks and expectations meted out by modern life as its curriculum, would anyone graduate? In the spirit of a sympathetic teacher, Robert Kegan guides us through this tricky curriculum, assessing the fit between its complex demands and our mental capacities, and showing what happens when we find ourselves, as we so often do, in over our heads. In this dazzling intellectual tour, he completely reintroduces us to the psychological landscape of our private and public lives. A decade ago in The Evolving Self, Kegan presented a dynamic view of the development of human consciousness. Here he applies this widely acclaimed theory to the mental complexity of adulthood. As parents and partners, employees and bosses, citizens and leaders, we constantly confront a bewildering array of expectations, prescriptions, claims, and demands, as well as an equally confusing assortment of expert opinions that tell us what each of these roles entails. Surveying the disparate expert \"literatures, \" which normally take no account of each other, Kegan brings them together to reveal, for the first time, what these many demands have in common. Our frequent frustration in trying to meet these complex and often conflicting claims results, he shows us, from a mismatch between the way we ordinarily know the world and the way we are unwittingly expected to understand it. In Over Our Heads provides us entirely fresh perspectives on a number of cultural controversies - the \"abstinence vs. safe sex\" debate, the diversity movement, communication across genders, the meaning of postmodernism. What emerges in these pages is a theory of evolving ways of knowing that allows usto view adult development much as we view child development, as an open-ended process born of the dynamic interaction of cultural demands and emerging mental capabilities. If our culture is to be a good \"school, \" as Kegan suggests, it must offer, along with a challenging curriculu",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Philosophy",
    "Sociology",
    "Self Help",
    "Leadership",
    "Business"
  ],
  "author": "Robert Kegan",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/905156.In_Over_Our_Heads"
}