{
  "title": "Ölümcül Kimlikler",
  "description": "\"Bana 'içimin derinliğinde' ne olduğu sorulduğunda, bunda herkesin 'içinin derinliğinde' ağır basan tek bir aidiyetin, bir bakıma 'kişinin derin gerçekliğinin', doğarken ebediyen belirlenen ve artık değişmeyecek olan 'öz'ünün varolduğu inanışı yatıyor; sanki geri kalanın, bütün geri kalanın -özgür insan olarak katettiği yolun, benimsediği inanışların, tercihlerin, kendine özel duygusallığının, yakınlıklarının, sonuçta yaşamının- hiçbir önemi yokmuş gibi.\"Kimlik insanın zamanın içindeki incelişinde onu dünyaya bağlayan bir ayna.Amin Maalouf, Ölümcül Kimlikler'de çok yönlü ve saydam bir sorgulamanın eşiğinde, aynadaki görüntünün tutulabileceğine işaret ediyor.Ölümcül Kimlikler, dünyanın yeni zamanlarında insanlığın küllerinden kuracağı düzenin temeline konan bilge bir taş.Daha karmaşık bir kimlik talep eden herkes toplum dışına itilmiş bulur kendini. Cezayirli ana babadan Fransa'da doğan bir genç, içinde apaçık iki aidiyet taşımaktadır ve her ikisini de üstlenecek durumda olması gerekir. Lafı bulundırmamak için iki dedim ama onun kişiliğinin bileşenleri çok daha fazla sayıdadır. İster dil söz konusu olsun, ister inanışlar, yaşam biçimi, aile ilişkileri, sanat ve mutfak zevkleri, Fransız, Avrupa, Batı etkileri ondaki Arap, Berberi, Afrika, Müslüman etkilerine karışmış durumdadır... Bu delikanlı bunu dolu dolu yaşamakta özgür hissetse kendini, tüm çeşitliliğini üstlenmede cesaretlendirildiğini hissetse, zenginleştirici ve verimli bir deneyim olur; tersine, ne zaman Fransızlığını vurgulasa, bazıları ona bir hainmiş, hatta satılmış gözüyle baktığından, ne zaman Cezayir'le olan bağlarını, tarihini, kültürünü, dinini ortaya koysa, anlaşılmamak, küçümsenmek tehlikesiyle ya da düşmanlıkla karşılaşacağından, yolu yıpratıcı olabilir.Durum Ren'in öte yakasında daha da naziktir. Otuz yıl önce Frankfurt yakınkarında doğan, hep, dilini ailesininkinden çok daha iyi konuşup yazdığı Almanya'da yaşamış olan bir Türk'ün durumunu düşünüyorum. Benimsediği toplumun gözünde o bir Alman değildir; köklerinin geldiği toplum ise artık tam olarak Türk sayılmaz.",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Sociology",
    "Politics",
    "France",
    "Psychology",
    "Essays"
  ],
  "author": "Amin Maalouf",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/10347811-l-mc-l-kimlikler"
}