{
  "title": "The Corrosion of Character: The Personal Consequences of Work in the New Capitalism",
  "description": "In The Corrosion of Character, Richard Sennett, \"among the country's most distinguished thinkers . . . has concentrated into 176 pages a profoundly affecting argument\" (Business Week) that draws on interviews with dismissed IBM executives, bakers, a bartender turned advertising executive, and many others to call into question the terms of our new economy. In his 1972 classic, The Hidden Injuries of Class (written with Jonathan Cobb), Sennett interviewed a man he called Enrico, a hardworking janitor whose life was structured by a union pay schedule and given meaning by his sacrifices for the future. In this new book-a #1 bestseller in Germany-Sennett explores the contemporary scene characterized by Enrico's son, Rico, whose life is more materially successful, yet whose work lacks long-term commitments or loyalties. Distinguished by Sennett's \"combination of broad historical and literary learning and a reporter's willingness to walk into a store or factory [and] strike up a conversation\" (New York Times Book Review), this book \"challenges the reader to decide whether the flexibility of modern capitalism . . . is merely a fresh form of oppression\" (Publishers Weekly, starred review). Praise for The Corrosion of Character: \"A benchmark for our time.\"—Daniel Bell \"[A]n incredibly insightful book.\"—William Julius Wilson \"[A] remarkable synthesis of acute empirical observation and serious moral reflection.\"—Richard Rorty \"[Sennett] offers abundant fresh insights . . . illuminated by his concern with people's struggle to give meaning to their lives.\"—[Memphis] Commercial Appeal",
  "genres": [
    "Sociology",
    "Nonfiction",
    "Economics",
    "Politics",
    "Philosophy",
    "Business",
    "Psychology"
  ],
  "author": "Richard Sennett",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/90631.The_Corrosion_of_Character"
}