{
  "title": "The beautiful buttons : a memoir",
  "description": "Beautiful Buttons is the amazing story of an improbable journey. Today Cathrine Ann is the award-winning founder and CEO of Consumer Connections Inc.?a multi-million dollar company that specializes in customer service evaluation and analysis. Smart and sophisticated, she radiates confidence. But it wasn’t always that way. The story begins on the floor of a tenement apartment where six-year-old Cathrine sits staring up at her drunken father. “My million dollars” he calls her. But to his male friends and neighbourhood perverts, she is a sexual object to be exploited. Her mother seems too lost in her own bitterness to care much what happens to Cathrine. Things just seem to run downhill from poverty, a lonely adolescence, physical and social abuse, loser boyfriends, pregnant at fifteen, school dropout, single motherhood, jail at eighteen, welfare, sleeping on the streets or with strangers, a sex trade worker in her twenties, thoughts of suicide and an eventual mental breakdown. Then, a pendulum an exciting new life that includes partying with celebrities, marriage to a socially prominent businessman, life in an exclusive upscale suburb?complete with lavish mansion and full-time maid?and a successful startup business. Like a fairy tale, the little girl who had nothing has it all. Too bad it couldn’t last. When her world implodes she finds herself back to having nothing, but determined to make something of her life?no matter what. Beautiful Buttons is a rough, raw, remarkably candid and often surprisingly funny portrait of a life lived and redeemed. Make no mistake, Cathrine was no saint. She is brutally honest about the mistakes she has made?the mistakes she continues to make. Her story will have readers alternately weeping, laughing and shaking their heads in admiration and astonishment. Beautiful Buttons is not about succeeding in business. It is a story about believing in yourself and your own abilities.",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Cathrine Ann",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/9065418-the-beautiful-buttons"
}