{
  "title": "Hallowed Bones",
  "description": "The southern Delta has never been more exhilarating, evocative, and wickedly funny than in the mysteries of Carolyn Haines. Now she takes readers on another rollicking ride across the Mississippi cotton fields and into the glamour of New Orleans…as P.I. Sarah Booth Delaney follows a winding trail of murder and deception into a world where ghosts make fashion statements—and where one person’s miracle is another person’s mayhem.The leaves of the calendar may be shedding faster than the sycamores on her family’s decaying Mississippi plantation, but thirty-something southern belle Sarah Booth Delaney isn’t ready to sing the blues. Not when she’s got a thriving detective agency and the outspoken, outrageously attired ghost of her great-great-grandmother’s nanny to keep her on her toes. But the matchmaking phantom may have the last word on motherhood when Sarah Booth takes on the controversial case of an accused baby killer.Although Doreen Mallory’s been arrested for feeding sleeping pills to her ten-week-old daughter, no one could accuse her of lacking faith. A healer who, tragically, couldn’t save her own baby girl, born with multiple birth defects, Doreen has her own crosses to bear. While the local law seems convinced of Doreen’s guilt, Sarah Booth isn’t so sure. But why is Doreen reluctant to talk about the men in her life? Like the televangelist who stands to lose a lot more than his flock. Or the married politician with family ties to the Mob. Either of them could be little Rebekah’s father; either of them could also be her killer.With Halloween approaching and her own personal life up for grabs, Sarah Booth could use a little faith healing herself. Torn between a married sheriff and an old flame who’s literally sweeping her off her feet, she’d better be prepared for the fallout of her most unpopular case yet. Justice may not stand a ghost of a chance as a decades-old secret explodes, unleashing a storm of fury on Sarah Booth and all those she loves.Witty, suspenseful, and featuring a cast of memorable characters, Hallowed Bones is a riveting tale of faith, murder, and maternal love. It is Carolyn Haines’s most accomplished novel yet.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Southern",
    "Cozy",
    "Audiobook",
    "Paranormal"
  ],
  "author": "Carolyn Haines",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/905888.Hallowed_Bones"
}