{
  "title": "America Fantastica",
  "description": "At 11:34 a.m. one Saturday in August 2019, Boyd Halverson strode into Community National Bank in Northern California. “How much is on hand, would you say?” he asked the teller. “I’ll want it all.” “You’re robbing me?” He revealed a Temptation .38 Special. The teller, a diminutive redhead named Angie Bing, collected eighty-one thousand dollars. Boyd stuffed the cash into a paper grocery bag. “I’m sorry about this,” he said, “but I’ll have to ask you to take a ride with me.” So begins the adventure of Boyd Halverson—star journalist turned notorious online disinformation troll turned JCPenney manager—and his irrepressible hostage, Angie Bing. Haunted by his past and weary of his present, Boyd has one goal before the authorities catch up with settle a score with the man who destroyed his life. By Monday the pair reach Mexico; by winter, they are in a lakefront mansion in Minnesota. On their trail are hitmen, jealous lovers, ex-cons, an heiress, a billionaire shipping tycoon, a three-tour veteran of Iraq, and the ghosts of Boyd’s past. Everyone, it seems, except the police. In the tradition of Jonathan Swift and Mark Twain,  America Fantastica  delivers a biting, witty, and entertaining story about the causes and costs of outlandish fantasy, while also marking the triumphant return of an essential voice in American letters. And at the heart of the novel, amid a teeming cast of characters, readers will delight in the tug-of-war between two memorable and iconic human beings—the exuberant savior-of-souls Angie Bing and the penitent but compulsive liar Boyd Halverson. Just as Tim O’Brien’s modern classic,  The Things They Carried , so brilliantly reflected the unromantic truth of war, America Fantastica puts a mirror to a nation and a time that has become dangerously unmoored from truth and greedy for delusion.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Literary Fiction",
    "Contemporary",
    "Audiobook",
    "Humor"
  ],
  "author": "Tim O'Brien",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/90588971-america-fantastica"
}