{
  "title": "Wormwood Forest: A Natural History of Chernobyl",
  "description": "When a titanic explosion ripped through the Number Four reactor at the Chernobyl Nuclear Plant in 1986, spewing flames and chunks of burning, radioactive material into the atmosphere, one of our worst nightmares came true. As the news gradually seeped out of the USSR and the extent of the disaster was realized, it became clear how horribly wrong things had gone. Dozens died - two from the explosion and many more from radiation illness during the following months - while scores of additional victims came down with acute radiation sickness. Hundreds of thousands were evacuated from the most contaminated areas. The prognosis for Chernobyl and its environs - succinctly dubbed the Zone of Alienation - was grim. Today, 20 years after the worst nuclear power plant accident in history, intrepid journalist Mary Mycio dons dosimeter and camouflage protective gear to explore the world's most infamous radioactive wilderness. As she tours the Zone to report on the disaster's long-term effects on its human, faunal, and floral inhabitants, she meets pockets of defiant local residents who have remained behind to survive and make a life in the Zone. And she is shocked to discover that the area surrounding Chernobyl has become Europe's largest wildlife sanctuary, a flourishing - at times unearthly - wilderness teeming with large animals and a variety of birds, many of them members of rare and endangered species. Like the forests, fields, and swamps of their unexpectedly inviting habitat, both the people and the animals are all radioactive. Cesium-137 is packed in their muscles and strontium-90 in their bones. But quite astonishingly, they are also thriving. If fears of the Apocalypse and a lifeless, barren radioactive future have been constant companions of the nuclear age, Chernobyl now shows us a different view of the future. A vivid blend of reportage, popular science, and illuminating encounters that explode the myths of Chernobyl with facts that are at once beautiful and horrible, Wormwood Forest brings a remarkable land - and its people and animals - to life to tell a unique story of science, surprise and suspense.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Nature",
    "Environment",
    "Natural History",
    "Ukraine"
  ],
  "author": "Mary Mycio",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/906332.Wormwood_Forest"
}