{
  "title": "Savage Continent: Europe in the Aftermath of World War II",
  "description": "The Second World War might have officially ended in May 1945, but in reality it rumbled on for another ten years...The end of the Second World War in Europe is one of the twentieth century’s most iconic moments.  It is fondly remembered as a time when cheering crowds filled the streets, danced, drank and made love until the small hours.  These images of victory and celebration are so strong in our minds that the period of anarchy and civil war that followed has been forgotten.  Across Europe, landscapes had been ravaged, entire cities razed and more than thirty million people had been killed in the war. The institutions that we now take for granted - such as the police, the media, transport, local and national government - were either entirely absent or hopelessly compromised. Crime rates were soaring, economies collapsing, and the European population was hovering on the brink of starvation.  In Savage Continent, Keith Lowe describes a continent still racked by violence, where large sections of the population had yet to accept that the war was over.  Individuals, communities and sometimes whole nations sought vengeance for the wrongs that had been done to them during the war. Germans and collaborators everywhere were rounded up, tormented and summarily executed.  Concentration camps were reopened and filled with new victims who were tortured and starved.  Violent anti-Semitism was reborn, sparking murders and new pogroms across Europe.  Massacres were an integral part of the chaos and in some places – particularly Greece, Yugoslavia and Poland, as well as parts of Italy and France – they led to brutal civil wars. In some of the greatest acts of ethnic cleansing the world has ever seen, tens of millions were expelled from their ancestral homelands, often with the implicit blessing of the Allied authorities.Savage Continent is the story of post WWII Europe, in all its ugly detail, from the end of the war right up until the establishment of an uneasy stability across Europe towards the end of the 1940s.  Based principally on primary sources from a dozen countries, Savage Continent is a frightening and thrilling chronicle of a world gone mad, the standard history of post WWII Europe for years to come.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "European History",
    "Politics",
    "World History"
  ],
  "author": "Keith Lowe",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/13167112-savage-continent"
}