{
  "title": "Stuntman!: My Car-Crashing, Plane-Jumping, Bone-Breaking, Death-Defying Hollywood Life",
  "description": "The classic no-holds-barred memoir from Hollywood's most legendary stuntman -- an inspiration for Brad Pitt's character Cliff Booth in  Once Upon a Time in Hollywood -- is \"full of incredible stories as told by a real man of action\" (Arnold Schwarzenegger). Yep that's me, Hal Needham, on the cover doing a fire stunt. When you're on fire you don't dare breathe because if you do, you'll suck those flames right down your throat. I was Hollywood's highest paid stuntman so I should know.I wrecked hundreds of cars, fell from tall buildings, got blown up, was dragged by horses, and along the way broke 56 bones, my back twice, punctured a lung and knocked out a few teeth...I hung upside down by my ankles under a bi-plane in The Spirit of St. Louis , jumped between galloping horses inLittle Big Man , set a world record for a boat stunt on Gator , jumped a rocket powered pick-up truck across a canal for a GM commercial, was the first human to test the car airbag-and taught John Wayne how to really throw a movie punch.Life also got exciting outside of the movie business. I had my Ferrari stolen right from under my nose, flew in a twin-engine Cessna with a passed out pilot, rescued the cast and crew from a Russian invasion in Czechoslovakia, and once took six flight attendants on a date. I owned the Skoal-Bandit NASCAR race team, the sound-barrier breaking Budweiser Rocket Car and drove a souped-up, fake ambulance in a \"little\" cross-country race called The Cannonball Run , which became the movie I directed by the same name. Oh yeah, I also directed Smokey and the Bandit , Hooper and several other action/comedy movies that I liked a bunch.I was a sharecropper's son from the hills of Arkansas who became a Hollywood stuntman. That journey was a tough row to hoe. I continually risked my life but that was the career I chose. I was never late to the set and did whatever I had to do to get the job done.Hollywood's not all sunglasses and autographs. Let me tell you a few stories...",
  "genres": [
    "Biography",
    "Memoir",
    "Nonfiction",
    "Film",
    "Media Tie In",
    "Autobiography"
  ],
  "author": "Hal Needham",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/9078474-stuntman"
}