{
  "title": "Time and Free Will: An Essay on the Immediate Data of Consciousness",
  "description": "Internationally known and one of the most influential philosophers of his day (and for a time almost a cult figure in France, where his lectures drew huge crowds), Henri Bergson (1859-41) led a revolution in philosophical thought by rejecting traditional conceptual and abstract methods, and arguing that the intuition is deeper than the intellect. His speculations, especially about the nature of time, had a profound influence on many other philosophers, as well as on poets and novelists; they are said to have been the seed for À la recherce de temps perdu by Marcel Proust (whose cousin was Bergson's wife). Though his ideas were sometimes difficult to follow, Bergson was also a fine stylist, who once declared, \"there is nothing in philosophy which could not be said in everyday language,\" and who was awarded the Nobel Prize for Literature in 1927.In Time and Free Will, written as his doctoral thesis, Bergson tries to dispel the arguments against free will. These arguments, he shows, come from a confusion of different ideas of time. Physicists and mathematicians conceive of time as a measurable construct much like the spatial dimensions. But in human experience, life is perceived as a continuous and unmeasurable flow rather than as a succession of marked-off states of consciousness — something that can be measured not quantitatively, but only qualitatively. And because human personalities express themselves in acts that cannot be predicted, Bergson declares free will to be an observable fact. Students and teachers of philosophy are sure to welcome this inexpensive reprint of Bergson's classic, influential essay, long a staple of college philosophy courses.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Psychology",
    "France",
    "Classics",
    "Science",
    "19th Century"
  ],
  "author": "Henri Bergson",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/907548.Time_and_Free_Will"
}