{
  "title": "I Shudder at Your Touch",
  "description": "There is no sexual act that is not dangerous...And every caress, no matter how innocent, has the power to open our lives to the dark mysteries of desire, the places where outrageous fantasies and fears are held in check.Held in check, that is, until it occurs to such supremely talented manipulators of the macabre as Stephen King, Ruth Rendell, Clive Barker, or Patrick McGrath, to let them loose, turning our erotic anxieties into art. Here are gathered the best of their chilling, thrilling, upsetting, and unsettling experiments with our sexual psyches. And rest assured, flesh will tingle--but whether from horror or pleasure or a bit of both, we'll leave you to judge.From its opening pages, with King's blackly humorous portrait of a very, very mad housewife to its conclusion, where we find Barker's wholly shocking tale of a deadly quest into the heart of passion, I Shudder at Your Touch brings you a host of kinky, perverse, bizarre and creepy figures. You'll find a cricket-playing vampire, a sleek sea creature likely to give mermaids a bad name, a strangely seductive handyman who's equally adept at knocking down apartment walls and female inhibitions, and a plastic religious statue offering X-rated enlightenment from its perch atop the family TV.I Shudder at Your Touch features 22 daring writers who prefer to go too far, writers whose every tale will have you fighting back a scream...and a cry of delight.Contents:The revelations of 'Becka Paulson / Stephen King --Sea lovers / Valerie Martin --Psychopomp / Haydn Middleton --A glowing future / Ruth Rendell --The tiger returns to the mountain / T.L. Parkinson --Consanguinity / Ronald Duncan --Keeping house / Michael Blumlein --The Villa Desiree / May Sinclair --Cleave the vampire, or, a gothic pastorale / Patrick McGrath --The swords / Robert Aickman --Salon Satin / Carolyn Banks --How love came to Professor Guildea / Robert Hichens --Wings / Harriet Zinnes --The Basilisk / R. Murray Gilchrist --A quarter past you / Jonathan Carroll --The master builder / Christopher Fowler --Festival / Eric McCormack --Ladies in waiting / Huch B. Cave --Death and the single girl / Thomas M. Disch --Master / Angela Carter --The conqueror worm / Stephen R. Donaldson --Jacqueline Ess: her will and testament / Clive Barker",
  "genres": [
    "Horror",
    "Fiction",
    "Short Stories",
    "Erotica",
    "Anthologies",
    "Fantasy",
    "Romance"
  ],
  "author": "Michele Slung",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/906622.I_Shudder_at_Your_Touch"
}