{
  "title": "Hollywood Diary: Twelve Untold Tales of Gary Cooper, Patsy Kelly, Pola Negri, Robert Taylor, Zeppo Marx, The Grapes of Wrath, A Star is Born, Our ... Hudson, Soupy Sales, Quentin Crisp, Mae West",
  "description": "Twelve Untold Tales of Gary Cooper, Patsy Kelly, Pola Negri, Robert Taylor, Zeppo Marx, Quentin Crisp, The Grapes of Wrath, \"Our Gang,\" Rock Hudson, Soupy Sales, and more.A Work of Non-Fiction by Richard LamparskiAuthor of the eleven volume Whatever Became of...? series and Hidden Where the Stars Lived, Loved & Died and Manhattan DiaryAuthor of the eleven volume Whatever Became of…? series, interviews and stories with and about the great actors and actresses of yesteryear, Richard Lamparski reveals incredible, but true, heretofore untold stories of some of the stellar stars he has met, some of whom became good friends and others who did not. With other 40 illustrations and fascinating stories, Richard kicks some closet doors wide open, reveals the dirt on others, and praises some of the celebrities any gay person of worth will know about to some degree. If you want an intimate look deep inside Hollywood, told with great skill, humor and empathy, add this wonderful book to your “must-read” list. With chapter titles like “The Queen of Sex,” “The Absolute Worst Story I know,” “A Rainy Afternoon in Beverly Hills,” and “Lassie’s Master,” how could you pass this one by? Hollywood Diary is definitely a keeper!- Badpuppy MagazineYet another great read has come my way with the newly published Hollywood Diary, Twelve Untold Tales by Richard Lamparski (best known for his excellent series of books entitled Whatever Became of…?). Once I started this fascinating 175 page tome, I just couldn’t put it down, with its untold tales of the likes of Patsy Kelly, Gary Cooper, Robert Taylor, Mae West, Rock Hudson, Zeppo Marx, Pola Negri, Martin Kosleck, Darla Hood (of Our Gang), Richard Cromwell and a most touching story of the casting of Ma Joad in The Grapes of Wrath – a choice between Jane Darwell and Beulah Bondi, two of Hollywood’s best character actresses ever. There are several “eyebrow lifting” moments here and there, but overall it is always highly entertaining, and illustrated throughout. I highly recommend this book, and can’t wait to read Mr. Lamparski’s companion volume, entitled Manhattan Diary which promises to be another frank and explosive read.- Movie Memories",
  "genres": [],
  "author": "Richard Lamparski",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/1316733.Hollywood_Diary"
}