{
  "title": "Entering Fire",
  "description": "This startling and brilliantly comic novel tells the stories of two a father and his estranged son. Lamprias de Bergerac is a gentle mystic and amateur botanist who spends his middle-aged years in an erotic utopia deep in the Amazonian jungle, collecting specimens of rare orchids and ultimately finding Cucla, the young and free-spirited native woman who has become the love of his life. Meanwhile, his demented son Septimus is raised by his mother in prewar Europe, seething with hatred of the father who abandoned him. He rises to power in Nazi-occupied France, where he goes mad in an obsessive pursuit of racial purity. Rikki Ducornet has a gift for combining the horrific with the hilarious, the realistic with the fantastic. Through a wildly inventive narrative, Entering Fire scrutinizes the sources of fascist mentality in nations and, potentially, in all humans. \"Linguistically explosive and socially relevant, [her] works are solid evidence that Rikki Ducornet is one of the most interesting writers around ... We are living in an age of intellectual and emotional starvation that is largely without spirituality, cynical about social change and disconnected from the natural world. We need writers to look at these difficult issues in a sophisticated manner. Ducornet has done this. She is the mirror of our innermost selves. And she gives us back to ourselves—despairing , hopeful, active, contemplative, fractured but surviving, playful, even happy sometimes, and always whole ... Ducornet's villains have the best lines ... one only has to think of Hitler or PolPot or any of our assorted tyrants to know that Ducornet's figures are ... taken from life.\"— The Nation \" Entering Fire displays a cheerfully gruesome audacity and an imagination both lively and bizarre.\"— The New York Times \" Entering Fire is about the metaphoric and potentially evil properties of language; it is about origins and motives of myth-making. This is a novel of ideas (often strange ideas) that is sustained throughout by brilliant writing.\"— London Sunday Times \"Far from being an escapist fantasy, Entering Fire takes on some of the biggest issues of the 20th century … For sheer power, inventiveness and verbal density, [it] is the best read I've come across for a long time.\"— The Observer \"A drastically beautiful comic writer who stitches sentences together as if Proust had gone into partnership with Lenny Bruce.\"— City Limits \" … imaginative and unbridled fantasy.\"— Le Monde \" … an imagination and a style as captivating as it is devastating.\"— Lire \"Unlike anything you've ever read before.\"— L'Express Rikki Ducornet has a gift for combining the horrific with the hilarious, the realistic with the fantastic. Through a wildly inventive narrative, Entering Fire scrutinizes the sources of fascist mentality in nations and, potentially, in all humans.",
  "genres": [
    "Fiction",
    "Novels",
    "20th Century",
    "France",
    "United States",
    "Literature",
    "American"
  ],
  "author": "Rikki Ducornet",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/907037.Entering_Fire"
}