{
  "title": "Theories of International Politics and Zombies",
  "description": "What would happen to international politics if the dead rose from the grave and started to eat the living? Daniel Drezner's groundbreaking book answers the question that other international relations scholars have been too scared to ask. Addressing timely issues with analytical bite, Drezner looks at how well-known theories from international relations might be applied to a war with zombies. Exploring the plots of popular zombie films, songs, and books, Theories of International Politics and Zombies predicts realistic scenarios for the political stage in the face of a zombie threat and considers how valid—or how rotten—such scenarios might be. Drezner boldly lurches into the breach and \"stress tests\" the ways that different approaches to world politics would explain policy responses to the living dead. He examines the most prominent international relations theories—including realism, liberalism, constructivism, neoconservatism, and bureaucratic politics—and decomposes their predictions. He digs into prominent zombie films and novels, such as Night of the Living Dead and World War Z, to see where essential theories hold up and where they would stumble and fall. Drezner argues that by thinking about outside-of-the-box threats we get a cognitive grip on what former U.S. Secretary of Defense Donald Rumsfeld famously referred to as the \"unknown unknowns\" in international security.Correcting the zombie gap in international relations thinking and addressing the genuine but publicly unacknowledged fear of the dead rising from the grave, Theories of International Politics and Zombies presents political tactics and strategies accessible enough for any zombie to digest.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Zombies",
    "International Relations",
    "Political Science",
    "Horror",
    "Humor"
  ],
  "author": "Daniel W. Drezner",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/9076475-theories-of-international-politics-and-zombies"
}