{
  "title": "The Storm at the Door",
  "description": "The past is not past for Katharine Merrill. Even after two decades of volatile marriage, Katharine still believes she can have the life that she felt promised to her by those first exhilarating days with her husband, Frederick. For two months, just before Frederick left to fight in World War II, Katharine received his total attentiveness, his limitless charms, his astonishing range of intellect and wit. Over the years, however, as Frederick’s behavior and moods have darkened, Katharine has covered for him, trying to rein in his great manic passions and bridge his deep wells of an unending project of keeping up appearances and hoping for the best. But the project is failing. Increasingly, Frederick’s erratic behavior, amplified by alcohol, distresses Katharine and their four daughters and gives his friends and family cause to worry for his sanity. When, in the summer of 1962, a cocktail party ends with her husband in handcuffs, Katharine makes a fateful She commits Frederick to Mayflower Home, America’s most revered mental asylum.There, on the grounds of the opulent hospital populated by great poets, intellectuals, and madmen, Frederick tries to transform his incarceration into a creative exercise, to take each meaningless passing moment and find the art within it. But as he lies on his room’s single mattress, Frederick wonders how he ever managed to be all that he once a father, a husband, a business executive. Under the faltering guidance of a self-obsessed psychiatrist, Frederick and his fellow patients must try to navigate their way through a gray zone of depression, addiction, and insanity.Meanwhile, as she struggles to raise four young daughters, Katharine tries to find her way back to Frederick through her own ambiguities, delusions, and the damages done by her rose-colored belief in a life she no longer lives.Inspired by elements of the lives of the author’s grandparents, this haunting love story shifts through time and reaches across generations. Along the way, Stefan Merrill Block stunningly illuminates an age-old even if one’s daily life appears ordinary, one can still wage a silent, secret, extraordinary war.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Drama",
    "Mental Illness",
    "American",
    "Contemporary",
    "Book Club"
  ],
  "author": "Stefan Merrill Block",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/9085576-the-storm-at-the-door"
}