{
  "title": "The Evolutionary World: How Adaptation Explains Everything from Seashells to Civilization",
  "description": "\"One of the master naturalists of our time\" (American Scientist) reveals how evolutionary theory explains and affects not just the natural world but our society---and its future.Evolution has outgrown its original home in biology and geology. The Evolutionary World shows how evolution---descent with modification---is a concept that organizes, explains, and predicts a multitude of unconnected facts and phenomena. Adaptation plays a role not only in the development of new species but the development of human civilization. By understanding how evolutionary theory has played out in areas such as our economic system, our preparation for catastrophes, and even the development of communities, we can learn not just how these systems work but also what challenges lie ahead.Blind since the age of three, Dr. Geerat J. Vermeij has become renowned for his unique abilities to recognize details in the natural world that other scientists would never have noticed. In this book, he presents a new argument for evolution's broader importance. He explores similarities between genomes and languages, the contrasting natural economies of islands and continents, the emergence and importance of human values, the long-range consequences of global warming, and the perils of monopoly. He also shows that the lessons of evolution have implications for education, our system of laws, and economic growth.The Evolutionary World makes a fascinating argument about the broad-reaching impact and importance of evolution. It offers a way for us to understand and work with evolution's principles so that we can devise better solutions for our own lives, society, and the environment around us.",
  "genres": [
    "Science",
    "Evolution",
    "Nonfiction",
    "Biology",
    "Nature",
    "Palaeontology"
  ],
  "author": "Geerat Vermeij",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/9086287-the-evolutionary-world"
}