{
  "title": "Hung: A Meditation on the Measure of Black Men in America",
  "description": "Following in the footsteps of such bestselling, taboo-breaking books as Randall Kennedy’s Nigger and J. L. King’s On the Down Low, Hung brings a topic previously discussed only in intimate settings out into the open. In a brilliant, multilayered look at the pervasive belief that African American men are prodigiously endowed, Scott Poulson-Bryant interweaves his own experiences as a black man in America with witty analyses of how black male sexuality is expressed in books, film, television, sports, and pornography.“Hung” is a double entendre, referring not only to penis size but to the fact that black men were once literally hung from trees, often for their perceived sexual prowess and the supposed risk it posed to white women. As a poignant reminder, he begins his book with a letter to Emmett Till, the teenager who was lynched in Mississippi in the mid-1950s for whistling at a white woman.For Poulson-Bryant and other men of his generation, society’s deep-seated obsession with the sexual powers of black men has had an enormous, if often deceptive, influence on how they perceive themselves and on the assumptions made by others. His tales of his sexual encounters with both sexes, along with anecdotes about the lives of various friends and colleagues, are wryly and at times shockingly revealing. Enduring racial perceptions have shaped popular culture as well, and Poulson-Bryant offers a thorough, thought-provoking look at media-created images of the “Well-Hung Black Male.” He deftly deconstructs movies like Mandingo and Shaft, articles in the popular press, and edgy works like Robert Mapplethorpe’s Black Book, while also providing distinctive profiles of icons like porn star Lexington Steele and rapper L.L. Cool J.A scintillating mixture of memoir and cultural commentary, Hung is the first and only book to take on phallic fixation and uncover what lies below. Readers may be scandalized, but they’ll also have plenty to ponder about America’s views on how black men measure up.",
  "genres": [
    "Nonfiction",
    "Race",
    "Gender and Sexuality",
    "Cultural Studies",
    "Science",
    "Psychology",
    "Sociology"
  ],
  "author": "Scott Poulson-Bryant",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/908325.Hung"
}