{
  "title": "Conner",
  "description": "Erin is a young psychologist, with no time for anything but her work, and unable to remember anything about her past. She leads an uneventful life, but a lonely one, in which she secretly wishes for a soulmate... Conner is an unusual patient who approaches her, thrusting her into a strange world of darkness that runs beneath our own. He believes himself to be a creature of legend-a werewolf. But he also draws Erin with a roguish charm, and an irresistible feeling that seems to bind them together... Conner desperately tries to save her from an unknown evil that persues her with a relentless passion that crosses centuries, an evil that once took her very soul away, somewhere in Erin's lost memories. As she becomes more entwined in a series of events that will remind her of who she really is, will she make it away from the oncoming darkness unscathed...? \"In Connor, we meet Dr. Erin Miller -a professor who specialises in Mental Illnesses and more specifically Schizophrenia. When an old colleague who owns his own private practice arrives asking for her help , Erin has second thoughts but when she discovers that he believes he is in fact a werewolf that has lived for over 2000 years and asking specifically for her , she is intrigued. Erin decides to meet Connor and reads his file, soon she is drawn into his world and to her surprise discovers that Werewolves are in fact - well REAL. Erin herself though since connecting to Connor , has been having nightmares -ones that feel almost like memories but she can't have experienced what she's dreaming or has she ? We discover that Erin cannot remember much that happened prior to becoming in her early 20's in the Human world and soon we are drawn into a world of werewolves and memories and where Erin may not be exactly human ? A fast paced novel that keeps readers entertained and has not only Werewolf storylines but also pyschiatry sprinkled throughout.\" 4/5 Stars, Paula Philips, The Phantom Photographer Blog, May 2012",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Werewolves",
    "Amazon",
    "Fiction"
  ],
  "author": "Miranda Stork",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/9083775-conner"
}