{
  "title": "The Doctrine Of Chances: Or A Method Of Calculating The Probability Of Events In Play",
  "description": "The Doctrine of Chances, written by Abraham De Moivre and first published in 1718, is a seminal work in the field of probability theory. The book provides a method for calculating the probability of events in games of chance, such as dice and cards, and is considered one of the earliest works on the subject. De Moivre's approach to probability is based on the idea of calculating the number of possible outcomes for a given event and then determining the likelihood of each outcome occurring. He also introduces the concept of expected value, which is the average outcome of a series of trials. The book is divided into three parts. The first part provides an introduction to the basic principles of probability theory, including the concept of probability and the laws of probability. The second part focuses on the application of these principles to games of chance, such as dice and cards. De Moivre provides detailed calculations for various games, including the probability of rolling certain numbers with dice and the likelihood of drawing certain cards from a deck. The third part of the book explores more advanced topics in probability theory, such as the law of large numbers and the central limit theorem. These concepts have since become fundamental to the field of statistics. Overall, The Doctrine of Chances is a groundbreaking work that laid the foundation for modern probability theory. It remains a valuable resource for anyone interested in the mathematics of chance and probability.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Science",
    "Mathematics",
    "History"
  ],
  "author": "Abraham de Moivre",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/9081462-the-doctrine-of-chances"
}