{
  "title": "Kismet's Kiss: An Epic Fantasy Romance inspired by Arabian Fantasy",
  "description": "*** KISMET'S KISS is a two-time RWA Golden Heart® Finalist and a winner of the Duel on the Delta, Molly, and Put Your Heart in a Book contests. ***In the desert realm of Kad, a deadly epidemic strikes the palace of Sultan Kuramos. Only a magical healer from an enemy land may have the skill to save his household. He doesn't realize that healer is a woman.Varene finds her own surprises in Kad. She expects the sultan's arrogance, but not his courage or his selfless care of the ill—or the possibility that the epidemic is the curse of a vengeful goddess.Kaddite culture condemns Varene's mystical talents and her presence triggers a plot to overthrow Kuramos. Yet as he and the healer toil for the cure, he loses his heart to her. She falls for him as well, but how can she relinquish her homeland and her principles for him—especially when he already has a harem and his family may be cursed?Praise for KISMET'S \"Magic, passion, and intrigue—KISMET'S KISS has it all! Cate Rowan's uniquely compelling fantasy debut is set in a fascinating and fully realized world where danger lurks in every shadow. Rowan is definitely an author to watch!\"– Alyssa Day, New York Times bestselling author\"KISMET'S KISS is a compelling tale of love and duty set amid the clash of cultures. A thoroughly enjoyable adventure!\"– Jana Oliver, author of the Time Rovers series and DEMON TRAPPER'S DAUGHTER\"A wonderful Arabian Nights story laced with humor and scheming with intriguing twists.\"– Robin D. Owens, RITA-winning author of HEART THIEF and GUARDIAN OF HONOR\"KISMET'S KISS is a lush, inviting, immersive gem of a book. No one who loves being swept away by a great story should miss this!\"– Kendra Leigh Castle, author of CALL OF THE HIGHLAND MOON and RENEGADE ANGEL\"KISMET'S KISS has everything a reader of fantasy could ask for—suspense, action, incredible world-building and magic. What captured me most was a romance so exquisitely crafted that it kept me up all night, devouring every word until the very last page. This story is a one-sitting read to be savored again and again!\"– Shelby Reed, author of THE FIFTH FAVOR and MIDNIGHT ROSE",
  "genres": [
    "Fantasy",
    "Romance",
    "Magic",
    "Paranormal Romance",
    "Paranormal",
    "Fantasy Romance",
    "Harem"
  ],
  "author": "Cate Rowan",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/9080341-kismet-s-kiss"
}