{
  "title": "Amor de Perdição",
  "description": "Nas «Memórias do Cárcere», referindo-me ao romance que novamente se imprime, escrevi estas linhas: «O romance, escrito em seguimento daquele («O Romance de um Homem Rico»), foi o «Amor de Perdição». Desde menino, ouvia eu contar a triste história de meu tio paterno Simão António Botelho. Minha tia, irmã dele, solicitada por minha curiosidade, estava sempre pronta a repetir o facto aligado à sua mocidade. Lembrou-me naturalmente, na cadeia, muitas vezes, meu tio, que ali deveria estar inscrito no livro das entradas no cárcere e no das saídas para o degredo. Folheei os livros desde os de 1800, e achei a notícia com pouca fadiga, e alvoroços de contentamento, como se em minha alçada estivesse adornar-lhe a memória como recompensa das suas trágicas e afrontosas dores em vida tão breve. Sabia eu que em casa de minha irmã estavam acantoados uns maços de papéis antigos, tendentes a esclarecer a nebulosa história de meu tio. Pedi aos contemporâneos que o conheceram notícias e miudezas, a fim de entrar de consciência naquele trabalho. Escrevi o romance em quinze dias, os mais atormentados de minha vida. Tão horrorizada tenho deles a memória, que nunca mais abrirei o «Amor de Perdição», nem lhe passarei a lima sobre os defeitos nas edições futuras, se é que não saiu tolhiço incorrigível da primeira. Não sei se lá digo que meu tio Simão chorava, e menos sei se o leitor chorou com ele. De mim lhe juro que…»Vão passados quase dois anos, depois que protestei não mais abrir este romance. […] Este livro, cujo êxito se me antolhava mau, quando eu o ia escrevendo, teve uma recepção de primazia sobre todos os seus irmãos. Movia-me à desconfiança o ser ele triste, sem interpolação de risos, sombrio, e rematado por catástrofe de confranger o ânimo dos leitores, que se interessam na boa sorte de uns, e no castigo de outros personagens. Em honra e louvor das pessoas que estimaram o meu livro, confessarei agradavelmente que julguei mal delas. […] O livro agradou como está. Seria desacerto e ingratidão demudar sensivelmente, quer na essência, quer na compostura, o que, tal qual é, foi bem recebido.Do Prefácio da Segunda Edição. Porto, Setembro de 1863Camilo Castelo Branco",
  "genres": [
    "Classics",
    "Romance",
    "Portuguese Literature",
    "Fiction",
    "Portugal",
    "School",
    "19th Century"
  ],
  "author": "Camilo Castelo Branco",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/909710.Amor_de_Perdi_o"
}