{
  "title": "Zero Regrets: Be Greater Than Yesterday",
  "description": "“Zero regrets. It’s a philosophy not just about sport but about life. School, business, academics, love—anything and everything. It’s complicated and yet not. You have to figure out who it is you want to be. Not what you want to be—who. There has to be a vision, a dream, a plan. Then you chase that with everything you’ve got.” Over three consecutive Olympic games, Apolo Ohno has come to symbolize the very best of the competitive spirit—remaining equally gracious in victory and defeat, always striving to improve his performance, and appreciating the value of the hard work of training as much as any reward it might bring. In Zero Regrets, Apolo shares the inspiring personal story behind his remarkable success, as well as the hard-won truths and strategies he has discovered in good times and bad. Raised by his single father, an immigrant from Japan who often worked twelve-hour days, the young Apolo found it difficult to balance his enormous natural gifts as an athlete with an admittedly wild, rebellious streak. After making a name for himself as a promising young speed skater, his career was almost over before it began when his lack of preparation caused him to finish last at the U.S. Olympic trials in 1998. A life-changing week of solitary soul-searching at the age of fifteen led him to recommit himself to his training, and at the 1999 world junior championships he won first place overall—one of the most remarkable turnarounds in sports history. From that moment on, the world of speed skating had a new champion and Apolo was on his way to legendary status. Much more than an account of races won and lost, Zero Regrets is a compelling portrait of a father-and-son relationship that deepened over time and was based on respect, love, and unshakable faith in each other. For the first time, Apolo reveals what he knows about his long-absent mother; he makes us feel what it is like to face the best competitors on the planet with the eyes of millions of fans upon you; and he shares his secrets for achieving total focus and mental toughness, secrets that can be applied in situations well beyond sports. We learn the details of the unbelievably intense workout and diet that he endured while training for the 2010 Winter Olympics, a regime that literally reshaped his body and led to some of his most thrilling victories. In this deeply personal and entertaining book, Apolo shows how we can all come closer to living with zero regrets. While Apolo’s own journey may be unique, the insights he has gleaned along the way have the power to help us all feel like champions every day. ***   Nine days after dropping me off, Dad came to pick me up. In that call from the pay phone, I hadn’t said anything to him about what decision I had made. On the car ride back home, I told him. “I want to try this,” I said. “Are you willing,” he asked, “to really put forth a true effort? From the bone?” I told my father: “I want to skate.” With clarity of purpose, everything suddenly seemed different. I didn’t just want to skate—I loved it. I realized, too, that while I had to want to buy into the training, the discipline, the self-sacrifice, I needed direction and guidance, too. You truly can’t get there by yourself. I needed not only to truly and profoundly depend upon Dad for help but also to welcome those—coaches, trainers, others—who could help me along the way. . . . I was also making promises to myself and writing them in my journal: I’m not going to mess it up this time. When I go home, I really am going to be the different person I decided in Iron Springs I would be. I know what I want to do. I want to be the best in the world. I didn’t know quite yet how I would get there. But I was clear, and I had no doubt— that’s what I was after. —From Zero Regrets",
  "genres": [
    "Nonfiction",
    "Biography",
    "Sports",
    "Autobiography",
    "Biography Memoir",
    "Adult",
    "Memoir"
  ],
  "author": "Apolo Anton Ohno",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/9101293-zero-regrets"
}