{
  "title": "Souls/Houston, Houston, Do You Read?",
  "description": "Two novellas: Souls by Joanna Russ (1982) (88 pages) and Houston, Houston, do you read? by James Tiptree Jr. (1976)(92 pages)Houston, HoustonThe astronauts had the \"right Stuff\" to deal with . . . almost anything...Houston isn't there any moreLorimer comes through to the command module in time to hear a girl's voice over the speaker, \"--Dinko trip. What did Lorna say? Gloria over!\"He starts up the Lurp and begins scanning. No results this time. \"They're either in line behind us or on the sunward quadrant,\" he tells Dave and Bud. \"I can't isolate their position.\"Presently the speaker holds another thin thread of sound. A hard soprano says suddenly, \"--should be outside your orbit. Try around Beta Aries.\"The first girl's voice comes back. \"We see them, Margo! But they're so small, how can they live in there. Maybe they're tiny aliens. Over.\"Bud chuckles. \"Dave, this is screwy, it's all in English. It has to be some UN thingie.\"Dave massages his elbows, flexes his fists; thinking. The three astronauts wait. In thirteen minutes the voice from Earth says, \"Judy, call the others, will you? We're going to play you the conversation, we think you should all hear. Oh, while you're waiting, Zebra wants to tell Connie the baby is fine. And we have a new cow.\"\"Code,\" says Dave.SoulsThe Vikings thought the pickings would be easy--but the Abbess was more than she seemed.The woman who had been Radegunde did not change; it was still Radegunde's gray hairs and wrinkled face and old body in the peasant woman's brown dress, and yet at the same time it was a stranger who stepped out of the Abbess Radegunde as out of a gown dropped to the floor. This stranger was without feeling, though Radegunde's tears still stood on her cheeks, and there was no kidness or joy in her. She said in a voice I had never heard before, one with no feeling in it, as if I did not concer her or Thorvald Einarsson either, as if neither of us were worth a second glance:\"Thorvald, turn around.:Far up the hall something stirred.\"Now come back. This way.\"There were footsteps, coming closwer. Then the big Norseman walked clumsily into the room--jerk! jerk! jerk! at ever step as if he were being pulled by a rope. Sweat beaded his face. He said, \"You--how?\"\"By my nature,\" she said.(From the blurb in each novella)",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Queer",
    "Novella",
    "Speculative Fiction",
    "Short Stories"
  ],
  "author": "James Tiptree Jr.",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/91055.Souls_Houston_Houston_Do_You_Read_"
}