{
  "title": "Illusion",
  "description": "In the two hundred years since their magical powers defended the nation against invaders, the Exalted class has ruled unchallenged. Now, after ten generations, they neglect their powers, preferring the pleasures their Exalted station affords them, and ignore the abject poverty of the lower classes.A product of her upbringing, Eliste vo Derrivalle was the beautiful, spirited daughter of a provincial landowner on her way to the capital city of Sherreen to take her place at court. Little did she realize she was walking into a world of trouble.Dref Zeenoson was the property of the vo Derrivalles, bound to the land he served not by blood, but by law. A handsome and precocious boy, he was a source of amusement to his masters, who educated him alongside Eliste. Like any Exalted, he was taught to read, to write, to figure—and ultimately to resist.Sparked by the frustration of the lower classes and fired by the writings of a megalomaniac named Whiss v’Aleur, a revolt suddenly breaks over Vonahr in a red wave of violence, destruction, and death. Without their powers to protect them, the Exalted fall quickly and v’Aleur begins a bloody reign of terror. Deprived of rank, home, and family, Eliste scrambles for bread in the teeming streets of Sherreen and risks her life to call on dormant Exalted powers to save a dying wolrd; while Dref, appalled by the atrocities of the Revolution, works in secret to help stem the tide of blood. Thrown together by fate, carried forward by destiny, they will fight side by side for survival, no longer enemies, and free to explore the once-forbidden love they’d always felt for each other. And yet, waiting for them both, as she waits for all enemies of the Revolution, is the Kokotte, a Sentient killing machine, a goddess of death with an unappeasable hunger for terror.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Historical Fiction",
    "Historical",
    "Science Fiction Fantasy",
    "Romance",
    "Historical Fantasy"
  ],
  "author": "Paula Volsky",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/910725.Illusion"
}