{
  "title": "Ordo Lupus and the Temple Gate: An Ex Secret Agent Paranormal Investigator Thriller",
  "description": "Why is a notorious religious cult of assassins keeping him alive? In this nail-biting, paranormal thriller, the hero's teenage daughter is viciously murdered in Lyon by a long-forgotten and blood-thirsty biblical monster; her body is left mysteriously shrivelled and crushed. A former WWII MI6 agent, our hero is suspected of the crime by the police and his divorcing wife. With strange powers of foresight he goes on the run to clear his name. He has only one friend - a historian and member of the modern Knights Hospitaller but with his help he embarks on a white-knuckle ride to salvation. In Paris a witch servant of the mysterious Catholic assassin sect Concilium Putus Visum seduces him during his quest for the secret weapon of the Cathars. If he can solve a puzzling set of clues to find the weapon, he might kill the monster and save his marriage. But why do the assassins and the vampire snakes seem to be protecting him? Why is his grandfather’s body no longer where it should be; in his grave? What supernatural secret about the family was the old man trying to reveal to him before he died? Lovers of Dan Brown’s evocative mix of mystery and history will love this Occult Thriller – a dark, powerful, nerve-shredding tale, which deftly combines crime thriller aspects with the occult and historical. Also available as an eBook in DRM-Free formats at smashwords.com/books/view/28619 From the My own family's roots, uncovered over ten years, had led me to one Guillaume; a Chevalier (Knight) in 13th Century Languedoc, France; my earliest ancestor. Simultaneously, I had pursued a theological interest in the Cathars, first through reading a number of books about the Knights Templar and Dan Brown's The Da Vinci code and later, an interest in Monségur and the Rennes-le-Château, near where the lost treasure of the Cathars is said to be hidden. My interest in the paranormal became focused around reincarnation and lycanthropy (werewolves and vampires). I have always loved old Hammer Horror films and particularly the work of Christopher Lee and Peter Cushing. I have also always been interested in luck, and the constant battle between good and evil, light and dark, and yin and yang; who isn't? My own luck seems to run in phases of waves; periods of good luck followed by periods of very bad luck. I decided that my main character, as well as being physically imperfect, must have some kind of rare interaction with luck and the forces of good and evil. From there, I developed the idea that luck might have something to do with the effect of the battle between good and that in fact both Satan and God might both have one hand on the tiller of luck. I knew the main character would be flawed physically and yet have strange psychic powers but only when I wrote a scene in a graveyard, Highgate Cemetery, did I know that he would also become a Secret Agent and later an amateur sleuth. Yet another theme is Witchcraft. I have long been interested in the influence of Gurdjieff and Mdm. Blavatsky on modern western ideas. I also make frequent references to the Malleus Maleficarum - the witch-hunter's bible - and wicca, particularly Gardnerian wicca. You will also find references to some cult films such Eye of the Devil. The final theme I wanted to get into my novel was the gothic. The themes of murder, werewolves, vampires, blood, eroticism, sex and the paranormal are all things that I like in a novel. My influences are Kate Bush, The Mission, Lord Byron, John Keats (The Eve of St. Agnes is a particularly favourite poem of mine) and, to some extent, Tolkien's Lord of the Rings. Sex and death are the themes that everyone seems attracted to. As a consequence, I couldn't resist a climax to my novel that took place in one of the world's greatest Gothic buildings.",
  "genres": [
    "Paranormal"
  ],
  "author": "Lazlo Ferran",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/9110134-ordo-lupus-and-the-temple-gate"
}