{
  "title": "Walking with Elephants",
  "description": "Walking with Elephants will make you laugh, cry, and more importantly...think. Suze Hall is Ms. Bell's Willy Loman. She is an everyday woman, a woman in midlife, an ordinary hard-working mother of three. She entered the workforce after her kids became school age. Not a great career-path choice for success. And this stay-at-home mother for several years, continues these established roles in her household. Basically she began her marriage by running the house and now she continues to do it all after a full day at work.In Suze Hall, Karen Bell has created a character that is quite believable, relatable, and likable. We root for her, we cry with her, and we have a hearty chuckle at her predicaments. But Suze is more than just a storyline or comic clone creating antics that mimic Lucille Ball. She raises important questions about women's role in modern society and the cost to families by a society that appears indifferent to the plight of working moms. In the last chapter of the novel, Suze writes an essay suggesting that perhaps life in our western societies would be better if woman were in charge. Matriarchal societies are found in nature, elephants for example. And that's when the reader gets the big reveal as to the title of this novel. The essay goes on to also support the empowerment of women but not women mimicking men, women as nurturers, strong goddess mothers. And thus the cover art is a perfect metaphor for the message in this novel; a goddess cradling the Earth.Walking with Elephants is a wake-up call to women. A call to mentor each other in the workplace. A call to band together to advance some desperately needed workplace changes. For starters, in other countries maternity leave is at least a year, why not here?Not only is Suze Hall Karen Bell's every woman. She is you.",
  "genres": [],
  "author": "Karen S. Bell",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/9111323-walking-with-elephants"
}