{
  "title": "Incidents in the Life of a Slave Girl",
  "description": "Incidents in the Life of a Slave Girl by Harriet Jacobs is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.In what has become a landmark of American history and literature, Incidents in the Life of a Slave Girl recounts the incredible but true story of Harriet Jacobs, born a slave in North Carolina in 1813. Her tale gains its importance from her descriptions, in great and painful detail, of the sexual exploitation that daily haunted her life—and the life of every other black female slave. As a child, Harriet Jacobs remained blissfully unaware that she was a slave until the deaths of both her mother and a benevolent mistress exposed her to a sexually predatory master, Dr. Flint. Determined to escape, she spends seven years hidden away in a garret in her grandmother’s house, three feet high at its tallest point, with almost no air or light, and with only glimpses of her children to sustain her courage. In the face of seemingly insurmountable odds, she finally wins her battle for freedom by escaping to the North in 1842. A powerful, unflinching portrayal of the brutality of slave life, Incidents in the Life of a Slave Girl stands alongside Frederick Douglass’s classic autobiographies as one of the most significant slave narratives ever written. Farah Jasmine Griffin is Professor of English and Comparative Literature and African American Studies at Columbia University in New York City.",
  "genres": [
    "Nonfiction",
    "History",
    "Classics",
    "Memoir",
    "Biography",
    "African American",
    "Autobiography"
  ],
  "author": "Harriet Ann Jacobs",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/911075.Incidents_in_the_Life_of_a_Slave_Girl"
}