{
  "title": "Never Mind the Balkans, Here's Romania",
  "description": "Looking for a unique travel guide that goes beyond the usual tourist destinations and provides a fresh perspective on Romania's culture and people? 'Never Mind the Balkans, Here's Romania' by British author Mike Ormsby is just what you need. With his witty, frank, and insightful travel writing, Ormsby takes you on a fascinating journey through post-communist Romania, from the friendly hikers and shepherds of Transylvania to the exasperated taxi drivers and bossy bureaucrats in Bucharest.Ormsby's true-life stories offer a colourful cast of characters that will entertain, educate, and even enrage readers, depending on their perspective. His humorous and affectionate portrayal of Romania's people and culture sheds light on the country's paradoxical heart, with nods to historical figures like Vlad the Impaler, the real-life inspiration for gothic legend Dracula.Whether you're an armchair traveller or planning a trip, this book is a must-read for anyone interested in discovering the beauty, warmth, and contradictions of modern Romania. Ormsby's bittersweet short stories are a quick and easy read, yet offer a unique and intimate tour of the country's geography and culture. His comical slant and anecdotal review of life in Romania provide a realistic and humorous insight into the Romanian psyche that will resonate with both expats and visitors alike.'Never Mind the Balkans, Here's Romania' has become one of the best-selling books ever written about Romania by a foreigner. Published in 2008, it remains relevant today as a modern variation on the more conventional Romania travel guide. So close your guide book and meet the people of Romania! With Ormsby's expert guidance, you'll discover why locals say, 'Ca la noi, la nimeni - there's nobody quite like us.’Readers' praise for 'Never Mind the Balkans, Here's Romania':“This chronicle of slightly agonised passion for a country and its people is exactly the kind of Romania guidebook that a visitor needs -an insight into the culture's paradoxical heart.”“Wonderfully captures many aspects of living and working in Romania -funny, frequently frustrating and uniquely Romanian.”“A good read on the cultural changes in post-communist Romania with a comical slant. An interesting piece of social commentary.”“A fascinating view of Romanian people, witty and readable.”“If you enjoy honest travel writing, this is definitely worth a read.”“If you're planning a trip or have already been, this is an insightful, informative, and funny book on Romania and Romanians.”“The book is a series of short witty essays about everyday life and friendships in modern Romania. Ormsby skilfully brings out the contradictions, contrasts, warmth, and beauty of a fascinating country and its colourful people.”“‘Never Mind the Balkans, Here’s Romania’ offers an intimate tour of Romania with an expert guide. Perfect for the truly adventurous as well as the armchair traveller. Ormsby smuggles you deep inside this extraordinary country and into the minds of its people. A brilliant read.”“A fascinating journey through Romanian geography and culture, told with warmth and hope.”“I loved this book. An anecdotal review of life in Romania from the perspective of an Englishman with typically dry humour. Highly recommended, a great read, and I was laughing from beginning to end.”“A realistic and very humorous insight into the Romanian psyche. As someone who has travelled extensively in Romania, I could relate to many incidents.",
  "genres": [
    "Romania",
    "Travel",
    "Nonfiction",
    "Short Stories",
    "Memoir",
    "Amazon",
    "Humor"
  ],
  "author": "Mike Ormsby",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/9108122-never-mind-the-balkans-here-s-romania"
}