{
  "title": "On Black Sisters Street",
  "description": "On Black Sisters Street tells the haunting story of four very different women who have left their African homeland for the riches of Europe—and who are thrown together by bad luck and big dreams into a sisterhood that will change their lives.Each night, Sisi, Ama, Efe, and Joyce stand in the windows of Antwerp’s red-light district, promising to make men’s desires come true—if only for half an hour. Pledged to the fierce Madam and a mysterious pimp named Dele, the girls share an apartment but little else—they keep their heads down, knowing that one step out of line could cost them a week’s wages. They open their bodies to strangers but their hearts to no one, each focused on earning enough to get herself free, to send money home or save up for her own future.Then, suddenly, a murder shatters the still surface of their lives. Drawn together by tragedy and the loss of one of their own, the women realize that they must choose between their secrets and their safety. As they begin to tell their stories, their confessions reveal the face in Efe’s hidden photograph, Ama’s lifelong search for a father, Joyce’s true name, and Sisi’s deepest secrets—-and all their tales of fear, displacement, and love, concluding in a chance meeting with a handsome, sinister stranger.On Black Sisters Street marks the U.S. publication debut of Chika Unigwe, a brilliant new writer and a standout voice among contemporary African authors. Raw, vivid, unforgettable, and inspired by a powerful oral storytelling tradition, this novel illuminates the dream of the West—and that dream’s illusion and annihilation—as seen through African eyes. It is a story of courage, unity, and hope, of women’s friendships and of bonds that, once forged, cannot be broken.",
  "genres": [
    "Fiction",
    "Africa",
    "Nigeria",
    "Belgium",
    "African Literature",
    "Literary Fiction",
    "Contemporary"
  ],
  "author": "Chika Unigwe",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/9125646-on-black-sisters-street"
}