{
  "title": "A Life In the Cinema",
  "description": "Signed by Stephen King, Clive Barker, Mick Garris and Tobe Hooper this is the first short story collection by Mick Garris (director of the mini-series THE STAND and THE SHINING). 502 signed copies (52 lettered, 450 numbered). Clive Barker provides the cover art and 2 cover concept sketches. King writes a long introduction. Tobe Hooper provides an afterword. From Publishers WeeklyReaders with a taste for clever horror and kinky sex will devour this debut collection of eight randy, gross-out tales and one screenplay by filmmaker Garris. The director of Stephen King's movie Sleepwalkers and small-screen adaptations of The Shining and The Stand, Garris makes good use of his movie-making experience in the title story. A disillusioned horror film director purchases a deformed infant from her mother, then features the \"monster\" in his new film. The narrative, which is alternately comical, surreal and graphic, sets the tone for the tales that follow. In \"Baby Shower,\" a man finds his septuagenarian parents center stage in a sexually overactive retirement colony, and \"Forever Gramma\" culminates in a retch-inducing act of necrophilia. \"Starfucker\" pokes fun at nostalgia for old Hollywood when its main character pays $100,000 for a sexual encounter with a resuscitated but crumbling Jean Harlow. \"Flesh and Fantasy\" is a kind of bonus; a screenplay based on one of the stories, \"Chocolate,\" in which a man's mysterious psychic connection with a female stranger leads him to stalk and kill her. Although readers with delicate constitutions might want to steer clear of Garris's work, fans of scary movies and sci-fi fiction will relish his stomach-turning plot twists. Garris does not have Stephen King's sophistication, but he does create and sustain a compelling, colloquial narrative voice, with a witty, informed skewering of the film industry.",
  "genres": [
    "Short Stories",
    "Horror",
    "Audiobook"
  ],
  "author": "Mick Garris",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/9120639-a-life-in-the-cinema"
}