{
  "title": "Symbiotic Planet: A New Look at Evolution",
  "description": "Although Charles Darwin’s theory of evolution laid the foundations of modern biology, it did not tell the whole story. Most remarkably, The Origin of Species said very little about, of all things, the origins of species. Darwin and his modern successors have shown very convincingly how inherited variations are naturally selected, but they leave unanswered how variant organisms come to be in the first place.In Symbiotic Planet, renowned scientist Lynn Margulis shows that symbiosis, which simply means members of different species living in physical contact with each other, is crucial to the origins of evolutionary novelty. Ranging from bacteria, the smallest kinds of life, to the largest—the living Earth itself—Margulis explains the symbiotic origins of many of evolution’s most important innovations. The very cells we’re made of started as symbiotic unions of different kinds of bacteria. Sex—and its inevitable corollary, death—arose when failed attempts at cannibalism resulted in seasonally repeated mergers of some of our tiniest ancestors. Dry land became forested only after symbioses of algae and fungi evolved into plants. Since all living things are bathed by the same waters and atmosphere, all the inhabitants of Earth belong to a symbiotic union. Gaia, the finely tuned largest ecosystem of the Earth’s surface, is just symbiosis as seen from space. Along the way, Margulis describes her initiation into the world of science and the early steps in the present revolution in evolutionary biology; the importance of species classification for how we think about the living world; and the way “academic apartheid” can block scientific advancement. Written with enthusiasm and authority, this is a book that could change the way you view our living Earth.",
  "genres": [
    "Science",
    "Biology",
    "Nonfiction",
    "Evolution",
    "Nature",
    "Ecology",
    "Philosophy"
  ],
  "author": "Lynn Margulis",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/91263.Symbiotic_Planet"
}