{
  "title": "Camilla",
  "description": "Experience this story of first love by A Wrinkle in Time author Madeleine L'Engle. This classic novel is now a major motion picture, Camilla Dickinson. Fifteen-year-old Camilla Dickinson has led a sheltered life on the Upper East Side with her architect father and stunningly beautiful mother. But this winter the security she has always known has vanished, because her parents' marriage is coming apart - and Camilla is caught in the middle. She finds a way to escape her troubles when she meets Frank, her best friend's brother, who is someone she can really talk to about life, death, God, and her dream of becoming an astronomer. When Frank introduces her to the important people in his life, who are so different from anyone she has met before, he opens her eyes to worlds beyond her own, almost as if he were a telescope helping her to see the stars. This novel, one of the author's earliest, is the story of a girl who, with the help of her first love, leaves childhood behind and enters adulthood with a newfound sense of self and inner strength.Books by Madeleine L'EngleA Wrinkle in Time QuintetA Wrinkle in TimeA Wind in the DoorA Swiftly Tilting PlanetMany WatersAn Acceptable TimeA Wrinkle in The Graphic Novel by Madeleine L'Engle; adapted & illustrated by Hope LarsonIntergalactic P.S. 3 by Madeleine L'Engle; illustrated by Hope A standalone story set in the world of A Wrinkle in Time.The Austin Family ChroniclesMeet the Austins (Volume 1) The Moon by Night (Volume 2) The Young Unicorns (Volume 3)A Ring of Endless Light (Volume 4) A Newbery Honor book!Troubling a Star (Volume 5)The Polly O'Keefe booksThe Arm of the StarfishDragons in the WatersA House Like a LotusAnd Both Were YoungCamillaThe Joys of Love",
  "genres": [
    "Young Adult",
    "Fiction",
    "Romance",
    "Coming Of Age",
    "Audiobook",
    "Classics",
    "Historical Fiction"
  ],
  "author": "Madeleine L'Engle",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/9141308-camilla"
}