{
  "title": "الحديقة الصخرية",
  "description": "«Ο \"Βραχόκηπος\" είναι η ιστορία ενός ανθρώπου που προσπαθεί να σώσει την ψυχή του, έχοντας, ωστόσο, έντονη την επίγνωση ότι άλλοι γύρω του μάχονται για την ίδια τους τη ζωή και τον καλούν να ενωθεί μαζί τους. Ίσως κανένα άλλο έργο τού Νίκου Καζαντζάκη δεν πλησιάζει τόσο στο να μας δώσει ολόκληρο το μέτρο τού πνευματικού αγώνα του, όσο αυτό το μυθιστόρημα, που γράφτηκε στο ζενίθ της βίαιης σύγκρουσης μεταξύ Ιαπωνίας και Κίνας.» (Από την αγγλική έκδοση Nikos Kazantzakis, \"The Rock Garden\", Simon and Schuster, New York 1963.)Ο Νίκος Καζαντζάκης έγραψε τον \"Βραχόκηπο\" απευθείας στα γαλλικά, γλώσσα στην οποίαν έμελλε να εκδοθεί το 1959, δύο χρόνια μετά τον θάνατό του. Η ελληνική έκδοση περιλαμβάνει, εκτός από το κείμενο του μυθιστορήματος, Πρόλογο και Σημείωμα του Παντελή Πρεβελάκη, ο οποίος το μετέφρασε στα ελληνικά.«Όταν ο Καζαντζάκης έκανε το πρώτο του ταξίδι στην Άπω Ανατολή το 1936, συγκινήθηκε βαθιά από τον γαλήνιο και αφοσιωμένο ηρωισμό των δύο ανταγωνιστικών φυλών: των Κινέζων, που ξεσηκώνονταν απελπισμένα ενάντια στους εχθρούς και στους δικούς τους αφέντες, και των Ιαπώνων, που αφιερώνονταν σε μιαν ανένδοτη και πολεμόχαρη λατρεία. »Ο Καζαντζάκης, που πάντα ενδιαφερόταν για την προσπάθεια του ανθρώπου να διαγάγει έναν ηρωικό βίο, κεντρίσθηκε από τις ομοιότητες που βρήκε μεταξύ τής Ανατολικής σκέψης και της δικής του φιλοσοφίας, και επέστρεψε στην Ευρώπη για να διοχετεύσει όλες του τις εμπειρίες και τις παρατηρήσεις σ' αυτό το λυρικό και παθιασμένο μυθιστόρημα.»Η δράση τού Βραχόκηπου εξελίσσεται σε δύο επίπεδα εμπειρίας: Πρώτα, είναι η ιστορία τού Ευρωπαίου ταξιδιώτη που ερωτεύεται την κόρη ενός Κινέζου μανδαρίνου και εμπλέκεται στους κινδύνους τής επαναστατικής δράσης και του ωμού πολέμου.»Όμως, \"Ο Βραχόκηπος\" είναι κάτι παραπάνω από ένα μυθιστόρημα έρωτα, ίντριγκας και ανδρείας. Είναι μια σε βάθος μελέτη των ίδιων των συγκρούσεων και των επιθυμιών τού Καζαντζάκη: ο ήρωας του μυθιστορήματος, ο ανικανοποίητος περιπλανώμενος που αποζητά μια πνευματική σιγουριά ανάμεσα στις μεγάλες θρησκείες και φιλοσοφίες της Ανατολής, είναι ο ίδιος ο Νίκος Καζαντζάκης. Ελκόμενος στη μάχη, μπαίνοντας στον πειρασμό να δεσμεύσει τον εαυτό του σε ένα σκοπό, ρουφώντας ολόκληρο το περίπλοκο πνεύμα της Κίνας, ο Καζαντζάκης κατορθώνει αριστοτεχνικά να \"προβάλει\" τη δική του προσωπικότητα μέσα στη μυθοπλασία μιας συγκινητικής ιστορίας αγάπης και στην πραγματικότητα της απέραντης αναταραχής.»(Από την αγγλική έκδοση Nikos Kazantzakis, \"The Rock Garden\", Simon and Schuster, New York 1963)",
  "genres": [
    "Fiction",
    "Philosophy",
    "Novels",
    "Literature",
    "Classics",
    "Literary Fiction"
  ],
  "author": "Nikos Kazantzakis",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/9138046"
}