{
  "title": "The Hundred Secret Senses",
  "description": "Set in San Francisco and in a remote village of southern China, this is a tale of American pragmatism shaken, and soothed, by Chinese ghosts. What proof of love do we seek between mother and daughter, among sisters, lovers, and friends? What are its boundaries and failings? Can love go beyond 'Until death do us part?' And if so, which aspects haunt us like regretful ghosts? In 1962, Olivia, nearly six years old, meets Kwan, her adult half sister from China, for the first time. Olivia's neglectful mother, who in pursuing a new marriage can't provide the attention her daughter needs, finds Kwan to be a handy caretaker. In the bedroom the sisters share, Kwan whispers secrets about ghosts and makes Olivia promise never to reveal them. Out of both fright and resentment, Olivia betrays her sister -- with terrible consequences. From then on she listens to Kwan's stories and pretends to believe them. Thirty years pass, and Olivia is about to divorce her husband, Simon, after a lengthy marriage. She is certain he has never given up his love for a former girlfriend, who died years before. Kwan and her ghosts believe otherwise, and they provide Olivia with ceaseless advice and pleas to reconsider. But Olivia has long since dismissed the ghosts of her childhood and the wacky counsel of her sister. Just as Kwan anticipates, fate intervenes and takes her, Olivia, and Simon to China. In the village where Kwan grew up, Olivia confronts the tangible evidence of what she has always presumed to be her sister's fantasy of the past. And there, she finds the proof that love endures, and comes to understand what logic ignores, what you can know only through the hundred secret senses.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "China",
    "Asia",
    "Contemporary",
    "Asian Literature",
    "Novels"
  ],
  "author": "Amy Tan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/913371.The_Hundred_Secret_Senses"
}