{
  "title": "The Philosophical Breakfast Club: Four Remarkable Friends Who Transformed Science and Changed the World",
  "description": "The Philosophical Breakfast Club recounts the life and work of four men who met as students at Cambridge University: Charles Babbage, John Herschel, William Whewell, and Richard Jones.  Recognizing that they shared a love of science (as well as good food and drink) they began to meet on Sunday mornings to talk about the state of science in Britain and the world at large.  Inspired by the great 17th century scientific reformer and political figure Francis Bacon—another former student of Cambridge—the Philosophical Breakfast Club plotted to bring about a new scientific revolution.   And to a remarkable extent, they succeeded, even in ways they never intended.  Historian of science and philosopher Laura J. Snyder exposes the political passions, religious impulses, friendships, rivalries, and love of knowledge—and power—that drove these extraordinary men.  Whewell (who not only invented the word “scientist,” but also founded the fields of crystallography, mathematical economics, and the science of tides), Babbage (a mathematical genius who invented the modern computer), Herschel (who mapped the skies of the Southern Hemisphere and contributed to the invention of photography), and Jones (a curate who shaped the science of economics) were at the vanguard of the modernization of science.  This absorbing narrative of people, science and ideas  chronicles the intellectual revolution inaugurated by these men, one that continues to mold our understanding of the world around us and of our place within it.  Drawing upon the voluminous correspondence between the four men over the fifty years of their work, Laura J. Snyder shows how friendship worked to spur the men on to greater accomplishments, and how it enabled them to transform science and help create the modern world.",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "Philosophy",
    "Biography",
    "History Of Science",
    "Biography Memoir"
  ],
  "author": "Laura J. Snyder",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/9138231-the-philosophical-breakfast-club"
}