{
  "title": "Rain Dance",
  "description": "Bundle of FOUR #1 bestselling mystery and suspense novels by J.R. Rain, MOON DANCE (Vampire for Hire #1)The thrilling first novel in J.R. Rain's epic vampire mystery series! For fans of Charlaine Harris, Laurell K. Hamilton and Bella Forrest.Six years ago federal agent Samantha Moon was the perfect wife and mother, your typical soccer mom with the minivan and suburban home. Then the unthinkable happens, an attack that changes her life forever. And forever is a very long time for a vampire. Now working the night shift as a private investigator, Samantha is hired by Kingsley Fulcrum to investigate the murder attempt on his life, a horrific scene captured on TV and seen around the country. But as the case unfolds, Samantha discovers Kingsley isn't exactly what he appears to be; after all, there's a reason why he survived five shots to the head...DARK HORSE (Jim Knighthorse #1)Written in the tradition of Robert B. Parker's Spenser and Raymond Chandler's Philip Marlowe, J.R. Rain introduces a new hard-hitting, wise-cracking hero with a modern twist.When high school student Derrick Booker, the only black student at a posh Orange County high school, is accused of killing his white girlfriend, ex-college football hero and detective Jim Knighthorse is hired to dig a little deeper into the murder. It doesn't take long for Knighthorse to realize that not all is as it seems at tranquil Huntington High, from a band director who preys on the innocent to a vice-principal with a secret agenda of her own. Not to mention someone's hired a professional killer to keep Knighthorse permanently off the case. As the investigation continues, Knighthorse's personal life is shattered by the discovery of new evidence relating to his mother's unsolved murder, a murder dating back twenty years. Reeling from the discovery, a determined Jim Knighthorse sets out to bring two killers to justice.THE WITCH AND THE GENTLEMAN (Allison Lopez #1)Allison Lopez is not your everyday Psychic Hotline operator. She's a real psychic with real abilities that seem to grow daily, thanks to her close association with an immortal friend.Now, as her abilities continue to grow, Allison meets a very strange woman who reveals a starling secret to her. Life, for Allison Lopez, is about to get even stranger...and more fantastic. And when she gets a phone call from a distraught father seeking answers to his daughter's murder, Allison finds herself in unfamiliar looking for a cold-blooded killer. It will take all of Allison's abilities, both old and new, to catch an animal who preys on the innocent. And as the case unfolds, Allison is about to discover that not all is as it seems and life still has a few tricks up its sleeve.THE VAMPIRE WITH THE DRAGON TATTOO (Spinoza #1)Three years ago, high school student Veronica Fortune witnessed the brutal murder of her parents.Now armed, dangerous—and immortal—she sets out to hunt down the very thing that destroyed her life. That is, until she disappears. Spinoza is a private investigator who specializes in finding the missing. Hired to find Veronica, he soon realizes this is no ordinary case. After following a bizarre set of clues, Spinoza soon finds himself in strange territory...undead territory. Indeed, Spinoza is about to come face-to-face with something legendary—and hungry for blood.Scroll up and click ORDER NOW or READ FOR FREE today!",
  "genres": [
    "Fantasy",
    "Mystery",
    "Mystery Thriller"
  ],
  "author": "J.R. Rain",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/9145712-rain-dance"
}