{
  "title": "Turn Here Sweet Corn: Organic Farming Works",
  "description": "When the hail starts to fall, Atina Diffley doesn’t compare it to golf balls. She’s a farmer. It’s “as big as a B-size potato.” As her bombarded land turns white, she and her husband Martin huddle under a blanket and reminisce: the one-hundred-mile-per-hour winds; the eleven-inch rainfall (“that broccoli turned out gorgeous”); the hail disaster of 1977. The romance of farming washed away a long time ago, but the love? Never. In telling her story of working the land, coaxing good food from the fertile soil, Atina Diffley reminds us of an ultimate truth: we live in relationships—with the earth, plants and animals, families and communities.A memoir of making these essential relationships work in the face of challenges as natural as weather and as unnatural as corporate politics, her book is a firsthand history of getting in at the “ground level” of organic farming. One of the first certified organic produce farms in the Midwest, the Diffleys’ Gardens of Eagan helped to usher in a new kind of green revolution in the heart of America’s farmland, supplying their roadside stand and a growing number of local food co-ops. This is a story of a world transformed—and reclaimed—one square acre at a time.And yet, after surviving punishing storms and the devastating loss of fifth-generation Diffley family land to suburban development, the Diffleys faced the ultimate challenge: the threat of eminent domain for a crude oil pipeline proposed by one of the largest privately owned companies in the world, notorious polluters Koch Industries. As Atina Diffley tells her David-versus-Goliath tale, she gives readers everything from expert instruction in organic farming to an entrepreneur’s manual on how to grow a business to a legal thriller about battling corporate arrogance to a love story about a single mother falling for a good, big-hearted man.",
  "genres": [
    "Food",
    "Nonfiction",
    "Gardening",
    "Memoir",
    "Book Club",
    "Environment",
    "Biography"
  ],
  "author": "Atina Diffley",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/13171360-turn-here-sweet-corn"
}