{
  "title": "Isadora Duncan: An Intimate Portrait",
  "description": "\"\"Isadora An Intimate Portrait\"\" is a biography written by Sewell Stokes that explores the life and legacy of Isadora Duncan, a revolutionary dancer and choreographer who revolutionized the art of modern dance in the early 20th century. The book delves into Duncan's personal life, including her tumultuous relationships with men and her unconventional parenting style, as well as her professional achievements and her impact on the world of dance. Stokes draws on a wealth of primary sources, including letters, diaries, and interviews with those who knew Duncan, to paint a vivid and nuanced portrait of this complex and fascinating figure. Throughout the book, Stokes offers insights into the cultural and social context of Duncan's life and work, and explores the ways in which she challenged traditional gender roles and paved the way for future generations of female artists. \"\"Isadora An Intimate Portrait\"\" is a must-read for anyone interested in dance, women's history, or the cultural history of the early 20th century.1928. This is the story of the life of an American dancer, written by one who knew her and called her a friend. Duncan was born in San Francisco and at the age of 25 joined Loie Fuller's dance company, touring Germany where she was acclaimed in Budapest and Vienna. Two years later, she established a dance school for children near Berlin at Gruenwald. In 1921, Duncan was invited to Russia where she opened another dance school in Moscow and married Sergey Yesenin, the Russian poet. Tragically, Duncan was killed in an automobile accident in 1927.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Biography"
  ],
  "author": "Sewell Stokes",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/9145542-isadora-duncan"
}