{
  "title": "تهذيب سيرة ابن هشام",
  "description": "قصة الكتاب : كتاب تهذيب سيرة ابن إسحق كتاب حديث، صنعه المرحوم عبد السلام هارون، واستبعد فيه ما ليس له صلة بصميم السيرة النبوية، مثل أسماء أسارى بدر، وأسماء خيل المسلمين ببدر، وأشباه ذلك من الأمور السردية والأشعار المسهبة والأنساب المطولة والاستطرادات اللغوية. قال: (ولم أذكر من الأسناد إلا ما هو ضروري لإقامة النص، وعنيت بضبط تلك النصوص جميعا، وأن أفسر منها ما يحتاج إلى توضيح معتمدا في ذلك على شراح السيرة) ونشر كتابه في رمضان سنة (1374هـ) أماسيرة ابن هشام التي هذبها فأشهر ما ألف في السيرة النبوية الشريفة. طبعت لأول مرة في (غوتنغن) سنة 1858م بعناية الألماني ووستنفلد. اختصرها ابن هشام المتوفى يوم 13 / ربيع الآخر / 218هـ من كتاب المغازي والسير لابن إسحق (ت 151هـ) وكان ابن إسحق قد جمع كتابه للخليفة المهدي العباسي، بأمر أبي جعفر المنصور. فذكر فيه أخبار الخليقة منذ آدم (ع) حتى وفاة النبي (ص). فأسقط منها ابن هشام ما كان قبل إسماعيل (ع) وما لا يخص آباء النبي (ص) من أخبار أبناء إسماعيل، وما ليس لرسول الله (ص) فيه ذكر، ولا نزل به قرآن، وترك أشعاراً ذكرها ابن إسحق، لم ير أحداً من أهل العلم بالشعر يعرفها، وأشياء: بعضها يشنع الحديث به، وبعض يسوء الناس ذكره، وبعض لم يقر له البكائي بروايته، والبكائي: هو شيخ ابن هشام الذي يروي عنه سيرة ابن إسحق. وقد وصلتنا أقسام من سيرة ابن إسحق برواية أخرى، هي رواية: يونس بن بكير، منها قطعة في (300) صفحة في القرويين بفاس، وأخرى في الظاهرية بدمشق (انظر سوزكين تاريخ التراث م1 ج2 ص89) ولسيرة ابن إسحق رواة، غير البكائي وابن بكير، أوصلها مطاع الطرابيشي إلى (61) راوياً في كتابه (رواة المغازي والسير). قال الطناحي في موجزه: (وفي خزانة القرويين أيضاً نسخة من سيرة ابن هشام ، بقلم أندلسي نفيس ، كتبت سنة (719هـ) ، وبحواشيها معارضات وتقييدات قيمة . والجزء الثالث من نسخة أخرى ، بقلم أندلسي عتيق ، على رق غزل . وصور ذلك كله في معهد المخطوطات بالقاهرة). وقال ابن النديم في صدد حديثه عن ابن إسحق: (كان تعمل له الأشعار، ويؤتى بها، ويسأل أن يدخلها في السيرة فيفعل، فضمن كتابه من الأشعار ما صار فضيحة عند رواة الشعر) الفهرست 136. ونوه ابن سلام إلى ذلك في (طبقات الشعراء) وذكر أنه بلغ في رواية الشعر إلى عاد وثمود، ثم قال: (أفلا يرجع إلى نفسه فيقول: من حمل هذا الشعر، ومن أداه منذ آلاف السنين?) وقد أثبت ابن هشام بعض هذا الشعر وتعقبه بالإنكار، كقصيدة أبي بكر وسعد بن أبي وقاص، وحمزة، وأبي جهل. وللعلماء مؤاخذات وتنبيهات كثيرة على سيرة ابن إسحق، منها ما ذكره من أن أصحاب الرجيع ستة نفر، وهم في البخاري عشرة، وأن أصحاب بئر معونة أربعون رجلاً، وهم في البخاري سبعون، وما ذكره من مؤاخاة النبي (ص) لعلي (ر) فقد أنكر ذلك ابن كثير في (البداية 3 / 227) كما أنكر ما ذكره من مؤاخاة جعفر ومعاذ، قال: (وكان جعفر في الحبشة زمن وقوع المؤاخاة). قال القفطي: (وهذه السيرة التي يرويها ابن هشام عن ابن إسحق، قد هذب منها أماكن، مرة بالزيادة، ومرة بالنقصان، وصارت لا تعرف إلا بسيرة ابن هشام) ولسيرة ابن هشام مختصرات كثيرة، و شرحان أندلسيان، هما: (الروض الأنف) للسهيلي (ت 581هـ) و(الإملاء المختصر) لأبي ذر الخشني (ت 604هـ) وانظر في مجلة التراث العربي (السيرة النبوية في التراث الأندلسي) بقلم رضوان الداية (ع1 ص69) وفي مجلة (عالم الكتب: مج2 ص442) السيرة النبوية في الأدب التركي: مسعد سويلم الشامان. وفي مجلة الوثيقة س1 ع1 ص36 تحقيقاً في رسائله (ص) الموجودة حتى اليوم.",
  "genres": [
    "Religion",
    "Islam",
    "History"
  ],
  "author": "ابن هشام",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/9151583"
}