{
  "title": "Impractical Jokes",
  "description": "'A diabolical ping-pong game of prank and counter-prank across the generations. Hilarious and warm-hearted, Impractical Jokes is both a comic evocation of the Australian larrikin spirit and an ode to a loving father. Don't just read the jacket blurb - buy it!' - Shaun MicallefIn 1986, Charlie Pickering's dad, Ron, was pushed into a pool by his best friend, Richard. What followed was an all-out water pistol ambush in a five-star restaurant and then ten years of tit-for-tat payback and near fatal hijinx that eventually involved the State Emergency Service. When maturity is the first casualty of war, things tend to escalate.Impractical Jokes is the true story of two seemingly responsible, middle-aged men who opted out of having a mid-life crisis and instead gave themselves permission to be silly. It is also the tale of how Charlie finally learnt something from his dad - that being grown-up shouldn't mean losing your sense of humour - a lesson he lives to the full as one of Australia's leading comedians.About Charlie PickeringCharlie Pickering is a comedian, writer and presenter. After throwing away his career as a lawyer, Charlie toured the world performing stand-up from London to Bahrain, earning a nomination for the prestigious Perrier Award for best newcomer at the Edinburgh Fringe Festival. Upon his return to Australia, Charlie and fellow comedian Michael Chamberlin created and starred in The Mansion on The Comedy Channel, before going on to host Toast, a weekend breakfast show on Triple M and rocketing to national popularity on Network Ten's The 7pm Project and Talkin' 'Bout Your Generation. He now lives in Melbourne in a small house with a West Highland Terrier named Waldon and a Scottish Terrier named Kennedy.'Charming company and a natural raconteur' - The Scotsman'Australia's best' - The Adelaide Advertiser'More than witty - side-shakingly funny' - The Age",
  "genres": [
    "Nonfiction",
    "Biography",
    "Humor",
    "Autobiography",
    "Comedy",
    "Memoir",
    "Australia"
  ],
  "author": "Charlie Pickering",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/9157795-impractical-jokes"
}