{
  "title": "In the Shadow of Dragons",
  "description": "It is said that long before the Dark Age king of the Britons called Arthur was ever heard of, his golden reign was prophesied, and after decades of invasion and civil violence had wracked post-Roman Britain, his presaged leadership was a rare promise of future peace. Events leading to that time, some of them full of hope, more often full of sacrifice, inevitably began to fall into place...When the mysterious druid Myrddin Emrys, known in legend as Merlin the Enchanter, is certain the high king is in imminent danger of yet another assassination attempt, he summons iron-willed spy and master of disguise Marcus ap Iorwerth to unearth the conspirators and destroy their plots. Marcus reluctantly agrees to help after his wife Claerwen, driven by her otherworldly gift of visions, insists that she must accompany him on the quest.It is soon discovered that Pascentius, the youngest son of an earlier and well-hated king, is allied with dreaded Saxon mercenaries and readily poised to reclaim his father's throne. But before Marcus and Claerwen can spoil his plans, a second conspiracy of personal revenge closes in on them. Falsely declared fugitives by the very ones they had sought to help, they become trapped in a labyrinthine intrigue between their accusers and the traitors. In a desperate race against time, they must endure hardship and profound personal loss, while pushing Britain towards freedom, peace and the future called Arthur.In the Shadow of Dragons continues the spectacular four-part Macsen's Treasure series, blending Dark Age Celtic history, Arthurian legend and extraordinary original characters into an unstoppable, heart-thumping adventure.About the AuthorCeltic writer Kathleen Cunningham Guler has published numerous historical articles and essays as well as short stories and poetry. Her first novel, Into the Path of Gods, published in 1998, introduced the four-part Macsen's Treasure series set in early Arthurian Britain, and was very well received by reviewers.The author has studied Celtic history and Arthurian legend for nearly twenty years in both Great Britain and the United States. A descendant of the Celtic nations of Wales and Scotland, she is currently working on the third book of this series.",
  "genres": [
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Kathleen Cunningham Guler",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/915633.In_the_Shadow_of_Dragons"
}