{
  "title": "A New Look at Vegetarianism",
  "description": "A New Look at Vegetarianism contains various aspects of plant-based, or meatless, diets. It provides not only economical, cultural, biological and evolutionary viewpoints but also modern perspectives on health promotion and disease prevention. The material is presented succinctly, with good use of tables, and is referenced appropriately. In Chapter-1, vegetarian diets are classified as lacto-vegetarian, ovo-vegetarian, lacto-ovo-vegetarian, or vegan, respectively, if they include dairy products, eggs, both dairy products and eggs, or no animal products at all. Lacto-ovo- or lacto-vegetarians, diets can be followed without much concern about nutrition even in growing children, whereas children who are vegans may require special attention and may have slower growth even if they are in good health.  Vegetarians in general and vegans in particular should be concerned about nutrients in vegetarian diets. However, appropriately planned vegan or lacto-ovo-vegetarian diets can be nutritionally adequate. There is concern about the adequacy of vitamin B12 and D in vegans in general, but these needs can be met by food fortification. In Chapter-4 health-promoting phytochemicals (beyond the traditional nutrients) provide information about the food and herbal sources that can be used against cancer, heart problems, and even to live-longer. Whether phytochemicals or otherwise, the book recommends that whole foods rather than juices and supplements be consumed for the best protection against disease or even irregularity.The discussion of vegetarian diets in relation to the U.S. Dietary Guidelines and disease-specific guidelines show overlap with vegetarian eating patterns. For heart disease, obesity, hypertension, diabetes, and cancer both of these recommend eating unrefined grains, fruits, and vegetables and the reduction of the intake of saturated fat and cholesterol (present in all animal products and not in plants). The current dietary guidelines suggest that diets rich in plant foods with small or minimal amounts of animal foods may be the remedy for modern life-style diseases.'' Dietary guidelines for vegetarians could be developed with the aim of promoting the consumption of a variety and abundance of plant foods; primarily unrefined and minimally processed plant foods; optional dairy products, eggs, or both; and a generous amount of water and other fluids. There are historical references to “vegetarianism” as a religious practice in the East and John Harvey Kellogg in the West, a 20th-century Seventh-Day Adventist, who was trained as a physician and operated a Seventh-Day Adventist Sanitarium in Battle Creek, Michigan. He developed meat substitutes and other vegetarian health foods, including the breakfast cereals that have immortalized the family name worldwide.The book includes appendices: Quiz on myth and reality of vegetarianism, Nutritionally balanced vegetarian menus, and Vegetarian diet recipes",
  "genres": [],
  "author": "Sukhraj S. Dhillon",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/9166269-a-new-look-at-vegetarianism"
}