{
  "title": "Blessings of a Curse - USA Edition",
  "description": "Book One of The Nexus of Kellaran Series. A mighty world of magic and wonder approaches a global turning point, and a global war. Young Mark finds himself at the center of an intense whirlwind of adventure, romance, and action that will transform the world of Kellaran in only seven days! A passionately acclaimed High Fantasy Epic! Uses American Imperial (Standard) measurement units.New Professionally Published Edition! Features greatly improved cover art and graphics, better maps, new appendices including a recurring character list with descriptions and first appearance notes, proofreading by six editors to eliminate every typo, and professional editing including chapter breaks.Kellaran is a mighty world many times larger than the Earth, its technology is almost entirely magical, and it is home to many modern and advanced societies. The humans, unicorns, dragons, elves, dwarves, giants, gnomes, selkies, and gargoyles each have their own powerful nations, and the precarious peace is about to be shattered yet again.Many fantasy novels have central events that are supposed to affect the entire world, yet they are only described as affecting a part of one continent. Blessings Of A Curse is a story with true global scope; an epic of world-changing events, all interacting in a frantic global crisis.It's a book that is cheering and emotionally uplifting. It seldom seems emotionally dark, though it sometimes deals with tragic events.The magic in the story is self-consistent, and is as consistent as possible with real physics and physical constants.This novel contains adult themes, and deals with issues of sexuality. It is not recommended for those under 14 years of age.Many of the readers of this fantasy series also loved this author's science fiction series. Even many who had never read or enjoyed science fiction before were so impressed with The Nexus Of Kellaran Series that they then tried The Rational Future Series, and loved it just as much. The Rational Future Series; People Of The Tiger, Hunters In The Sky, and Victory Or Extinction are available now.Wayne Edward Clarke has been a professional musician, an inventor, a bio-sociological engineer, a gardener, and an author of fantasy, science fiction, erotica, and non-fiction books. He recently formed a fully staffed publishing company; Wayne Edward Clarke Publishing, which will soon be publishing other new and talented authors.5.0 out of 5 stars Amazing book, May 28, 2012 By Paulsub63 - See all my reviewsThis review is Blessings Of A Curse - Metric Pro. Edition (The Nexus Of Kellaran Series) (Kindle Edition)This book was incredible. A I read it, I was immersed in another world. The main character's evolution from a total neophyte to an accomplished master kept me riveted, and I was hooked. I have also read the second book in the series and I am anxiously awaiting the final book.This book, series and author will expand your horizons. Please give the book a try and you too will come to know what makes his writing so addictive.5.0 out of 5 stars One of the best i've had the pleasure of reading, April 16, 2012By HjÃrtur Ãžorgeirsson - See all my reviewsThis review is Blessings Of A Curse - USA Pro EditionThis is my first review I've done on Amazon and it's mainly because I haven't felt compelled to until now. Grave unjustice would be done to this incredible author if someone doesn't comment on how f-ing awesome this book truly is. Let me put it this way, only two books have I read that I enjoyed more than this book! Truly a modern masterpiece.5.",
  "genres": [
    "Fantasy",
    "Menage"
  ],
  "author": "Wayne Edward Clarke",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/9164137-blessings-of-a-curse---usa-edition"
}