{
  "title": "Bound for the Promised Land: Harriet Tubman: Portrait of an American Hero",
  "description": "The essential, “richly researched”* biography of Harriet Tubman, revealing a complex woman who “led a remarkable life, one that her race, her sex, and her origins make all the more extraordinary” (* The New York Times Book Review ). Harriet Tubman is one of the giants of American history—a fearless visionary who led scores of her fellow slaves to freedom and battled courageously behind enemy lines during the Civil War. Now, in this magnificent biography, historian Kate Clifford Larson gives us a powerful, intimate, meticulously detailed portrait of Tubman and her times. Drawing from a trove of new documents and sources as well as extensive genealogical data, Larson presents Harriet Tubman as a complete human being—brilliant, shrewd, deeply religious, and passionate in her pursuit of freedom. A true American hero, Tubman was also a woman who loved, suffered, and sacrificed. Praise for Bound for the Promised Land “[ Bound for the Promised Land ] appropriately reads like fiction, for Tubman’s exploits required such intelligence, physical stamina and pure fearlessness that only a very few would have even contemplated the feats that she actually undertook. . . . Larson captures Tubman’s determination and seeming imperviousness to pain and suffering, coupled with an extraordinary selflessness and caring for others.” — The Seattle Times “Essential for those interested in Tubman and her causes . . . Larson does an especially thorough job of . . . uncovering relevant documents, some of them long hidden by history and neglect.” — The Plain Dealer “Larson has captured Harriet Tubman’s clandestine nature . . . reading Ms. Larson made me wonder if Tubman is not, in fact, the greatest spy this country has ever produced.” — The New York Sun",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "Race",
    "Biography Memoir",
    "Womens"
  ],
  "author": "Kate Clifford Larson",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/916637.Bound_for_the_Promised_Land"
}