{
  "title": "You Can Run: Gay, Glam, and Gritty Travels in South America",
  "description": "From Machu Picchu to a cocaine purchase in a Bolivian jail―and beyond!How do you rough it in extreme South American travels and still dare to be different? You Can Gay, Glam, and Gritty Travels in South America follows the intrepid and fantastic―and totally true―adventures of flamboyant gay men through the gritty rough and tough of South America. Author Jesse Archer and his American boyfriend Zane spent nearly two years traveling the continent in search of adventure. And find it they did. Discover incredible individuals like Patricia the pink lady, the Wolfman of Borneo, and Santusa the fanged Chola of a different color. Thrill to the astounding experiences of dodging crocodiles, doing a striptease for a Colombian bathroom bitch, admiring exultant transsexuals caught in a rainstorm, and navigating the most dangerous road in the world. This wild travel chronicle takes you through the real South America with wit, wisdom―and a hot pink wig!An excerpt from You Can Gerardo runs off to buy the meat for baiting piranha and then we're in his tin boat out on the choppy Amazon. The humidity and heat on the earth's surface here seems to bounce back into the sky and burst, returning a downpour of rain. Luckily Gerardo's tin can has a roof. Yet for some reason we aren't headed to the jungle, but downriver to a shantytown along the bank.I ask where we are going and Gerardo feebly utters something in Portuguese. I can't make it out. Zane is now convinced I've employed a waterfront gangster. We pull up to a shoddy pier of three planks supported by timbers that rot in the lapping water.“We should have gone with the other one!” Zane decries my flagrant frugality. “See? There's his accomplice.” When Gerardo reappears outside the shack with another man Zane announces he hates to be killed with a cheapskate like me. “I'm gonna die, washed up over there with all that trash, my body all white and fat and . . . bloated!” zane has exercised too much in his life to die bloated. Dying bloated has just become the worst of all fates. Zane gasps earnestly to his active imagination. “Oh God, please not bloated!” You Can Run is a funny, piercing, and poignant examination of memorable outcasts in the third world. Follow some of travel's most different adventure seekers―extreme travelers with a lot of sparkle!",
  "genres": [
    "LGBT"
  ],
  "author": "Jesse Archer",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/916675.You_Can_Run"
}