{
  "title": "To Fetch a Thief: A Chet and Bernie Mystery",
  "description": "In the third installment in the brilliant New York Times bestselling series featuring a lovable and wise dog narrator, Chet and Bernie go under the big top to solve the most unlikely missing persons (and animals!) case ever.Chet has smelled a lot of unusual things in his years as trusted companion and partner to P.I. Bernie Little, but nothing has prepared him for the exotic scents he encounters when an old-fashioned traveling circus comes to town. Bernie scores tickets to this less-than-greatest show-on-earth because his son Charlie is crazy about elephants. The only problem is that Peanut, the headlining pachyderm of this particular one-ring circus, has gone missing—along with her trainer, Uri DeLeath. Stranger still, no one saw them leave. How does an elephant vanish without a trace? At first there’s nothing Bernie and Chet can do—it’s a police matter and they have no standing in the case. But then they’re hired by Popo the Clown, who has his own reasons for wanting to find out what has become of the mysteriously missing duo. After Chet takes a few sniffs in Peanut’s trailer and picks up her one-of-a-kind scent, he and Bernie are in hot pursuit, heading far away from the bright lights of the traveling show and into the dark desert night. Some very dangerous people would prefer that Chet and Bernie disappear for good and will go to any lengths to make that happen. Across the border in Mexico and separated from Bernie, Chet must use all his natural strength and doggy smarts to try to save himself—not to mention Bernie and a decidedly uncooperative Peanut, too. To Fetch a Thief shows why readers everywhere have fallen head-over-paws in love with the Chet and Bernie mystery series. Top-notch suspense, humor, and insight into the ways our canine companions think and behave make this the most entertaining and irresistible book in the series yet.",
  "genres": [
    "Mystery",
    "Fiction",
    "Dogs",
    "Animals",
    "Humor",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "Spencer Quinn",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/9182075-to-fetch-a-thief"
}