{
  "title": "Infinite Possibilities",
  "description": "Remember writers telling fast-paced, complex tales in a few hundred pages? Rbt A. Heinlein was such a one--his books are concise yet never rushed, richly plotted, never bloated. His '50s juveniles were among his best work. Here are 3: Tunnel in the Sky, Time for the Stars & Citizen of the Galaxy.Tunnel in the Sky: Just a test, but something went wrong. As part of a final exam, Rod Walker's Advanced Survival class was dropped thru a teleportation gate to an unknown location. A standard 10-day field exercise became an indefinite life-or-death struggle. Stranded beyond contact with Earth, divested of all luxuries & laws, they were forced to forge a future of their own--a future where sometimes not even the fittest survive.Time for the Stars: The ship Lewis & Clark sought worlds for overpopulated Earth to colonize. Twins Tom & Pat Bartlett participated. Scientists had discovered thoughts travel faster than light & the twins were telepathic. Pat remained on Earth, growing old, while Tom made a 70-year voyage. As the pioneer torchship discovered seemingly habitable new planets at Tau Ceti & Deneb Kaitos, messages Tom sent back spoke of disaster.Citizen of the Galaxy: Thorby had been taken from his parents & sold into slavery while young. His life had been under cruel masters on planets across the Terran Hegemony. His new owner was different. With the beggar, he found kindness & hope, not just for safety but for freedom. Baslim the Cripple was more than he seemed. He taught him a message that would take him to the stars. Thorby's true identity would stay secret thru his adventures with an odd society of traders, until service as a Terran Hegemony Guardsman brought him to his lost homeworld & destiny.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Young Adult",
    "Collections",
    "Fantasy",
    "Adventure"
  ],
  "author": "Robert A. Heinlein",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/916949.Infinite_Possibilities"
}