{
  "title": "The Diary of Frida Kahlo: An Intimate Self-Portrait",
  "description": "An intimate self-portrait of one of the most renowned Mexican artists of the twentieth century, The Diary of Frida An Intimate Self-Portrait is “a visual document, engaging the eye with a volcanic profusion of penned-and-painted imagery” ( New York Times ).Published in its entirety, Frida Kahlo’s amazing, illustrated journal documents the last 10 years of her turbulent life. These passionate, often surprising, intimate records, kept under lock and key for some 40 years in Mexico, reveal many new dimensions in the complex personal life of this remarkable artist.The 170-page journal contains the artist’s thoughts, poems, and dreams—many reflecting her stormy relationship with her husband, artist Diego Rivera—along with 70 mesmerizing watercolor illustrations. Her views of love, politics, and more come into sharp focus in a kaleidoscope of creativity and thought.In his introduction, award-winner Carlos Fuentes, one of Mexico’s most important writers and critics, ties Kahlo’s images of pain, loss, mutilation, and transcendence to Mexico’s historic cycles of revolution and reaction. Sprinkled with irony, black humor, even gaiety, and augmented with translations of the diary entries plus commentaries and photographs, her diary stands as a reminder of not only Kahlo’s formidable talent, but also her resilience and courage.The text entries, written in Frida’s round, full script in brightly colored inks, make the journal as captivating to look at as it is to read. Her writing reveals the artist’s political sensibilities, recollections of her childhood, and her enormous courage in the face of more than 35 operations to correct injuries she had sustained in an accident at the age of 18.This intimate portal into her life is sure to fascinate fans of the artist, art historians, and women’s culturalists alike.",
  "genres": [
    "Art",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Feminism",
    "Biography Memoir",
    "Art History"
  ],
  "author": "Frida Kahlo",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/91760.The_Diary_of_Frida_Kahlo"
}