{
  "title": "The King of Methlehem",
  "description": "From a widely acclaimed author and prominent prosecutor, an electrifying novel that deftly penetrates America's latest and fastest-growing drug epidemicDetective Wyatt James is a veteran police officer with the Meth Lab team in Pierce County, Washington -- an epicenter of methamphetamine production. At the core of the local meth problem is the elusive, self-proclaimed \"King of Meth-lehem.\" The king moves from one shelter to another, relying on the kindness and desperation of a variety of women. He's the top meth cook in the region, a dangerously successful identity thief, and he travels under a number of famous aliases, among them Lars Ulrich, Peter Farrelly, Ted Nugent, and most recently Howard Schultz.Wyatt has been chasing Howard relentlessly, but the pursuit has become a fixation that threatens to destroy Wyatt's personal life and disrupt the lives of his bookish girlfriend, Suki, who just moved into his loft, and his best friend, Mike, a prosecutor -- and perhaps involve them all in a dangerously volatile situation. Neither Suki nor Mike nor Wyatt's supervisor seems able to deter him from his obsessive hunt.Though Wyatt is closing in on him, Howard is on the verge of a breakthrough as he transforms his small-time \"guerrilla\" cooking into a large-scale meth lab. As he becomes more ambitious, plotting to stay one move ahead of Wyatt and rival dealers, he descends to fascinating levels of addiction, paranoia, egoism, and madness. His newfound success forces him to take greater risks, and his list of enemies becomes more extensive and more dangerous. The king will not go down without a fight.With startling precision and compelling prose, the author of \"Never Mind Nirvana\"once again brings his insight and wit to a topical slice of our popular culture. Lindquist takes us deep into the heart of what has become America's most dangerous drug epidemic, exposing the complex and horrifying lengths to which addicts -- tweekers -- will go for their meth, as well as the extraordinary challenges that society faces in eradicating a nationwide plague.",
  "genres": [
    "Fiction",
    "Mystery",
    "Crime"
  ],
  "author": "Mark    Lindquist",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/917683.The_King_of_Methlehem"
}