{
  "title": "Mathematical Sorcery: Revealing the Secrets of Numbers",
  "description": "There are two kinds of those who can do mathematics, and then there's the rest of us. Math is boring. Females have no facility for mathematics (and really don't need it, anyway).For many people who do not like math, these myths ring true. Calvin Clawson, the celebrated author of Mathematical Mysteries , has a unique talent for opening the door for the uninitiated to the splendors of mathematics. A writer in love with his subject, Clawson offers readers the perfect antidote to the phobias and misconceptions surrounding mathematics in Mathmatical Sorcery . Contending that the power and beauty of mathematics are gifts in which we all can partake, he shows that the field of mathematics holds a bounty of wonder that can be reaped by any one of us in the hopes of discovering new truths. In this captivating quest for pure knowledge, Clawson takes us on a journey to the amazing discoveries of our ancient ancestors. He divulges the wisdom of the Ancient Greeks, Sumerians, Babylonians, and Egyptians, whose stunning revelations still have deep meaning to us today. The secrets of the constellations, the enigma of the golden mean, and the brilliance of a proof are just some of the breakthroughs he explores with unbridled delight. Enabling us to appreciate the achievements of Newton and other intellectual giants, Clawson inspires us through his eloquence and zeal to actually do mathematics, urging us to leap to the next level. He helps us intuitively comprehend and follow the very building blocks that too long have been a mystery to most of us, including infinity, functions, and the limit. As he elegantly \"Mathematics is pursued not only for the sheer joy of the pursuit, as with the Ancient Greeks, but for the truths it reveals about our universe.\" Through Mathmatical Sorcery , we taste the fruit of knowledge that has eluded us until now.",
  "genres": [
    "Mathematics",
    "Nonfiction",
    "Science",
    "Physics"
  ],
  "author": "Calvin C. Clawson",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1317325.Mathematical_Sorcery"
}