{
  "title": "The Grace of Silence: A Memoir",
  "description": "In the wake of talk of a “postracial” America upon Barack Obama’s ascension as president of the United States, Michele Norris, cohost of National Public Radio’s flagship program All Things Considered, set out to write, through original reporting, a book about “the hidden conversation” on race that is unfolding nationwide. She would, she thought, base her book on the frank disclosures of others on the subject, but she was soon disabused of her presumption when forced to confront the fact that “the conversation” in her own family had not been forthright. Norris unearthed painful family secrets that compelled her to question her own from her father’s shooting by a Birmingham police officer weeks after his discharge from the navy at the conclusion of World War II to her maternal grandmother’s peddling pancake mix as an itinerant Aunt Jemima to white farm women in the Midwest. In what became a profoundly personal and bracing journey into her family’s past, Norris traveled from her childhood home in Minneapolis to her ancestral roots in the Deep South to explore the reasons for the “things left unsaid” by her father and mother when she was growing up, the better to come to terms with her own identity. Along the way she discovered how her character was forged by both revelation and silence. Extraordinary for Norris’s candor in examining her own racial legacy and what it means to be an American, The Grace of Silence is also informed by rigorous research in its evocation of time and place, scores of interviews with ordinary folk, and wise observations about evolving attitudes, at once encouraging and disturbing, toward race in America today. For its particularity and universality, it is powerfully moving, a tour de force.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Book Club",
    "Biography Memoir",
    "History",
    "Race"
  ],
  "author": "Michele Norris",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/9192508-the-grace-of-silence"
}