{
  "title": "Don't Know Much About Mythology: Everything You Need to Know About the Greatest Stories in Human History but Never Learned",
  "description": "The latest installment in the New York Times bestselling Don't Know Much About® series - a magical journey into the timeless world of mythology.It has been fifteen years since Kenneth C. Davis first dazzled audiences with his instant classic Don't Know Much About® History, vividly bringing the past to life and proving that American's don't hate history, they just hate the dull, textbook version they were fed in school. With humor, wit, and a knack for storytelling, Davis has been bringing readers of all ages up to speed on history, geography, and science ever since. Now, in the classic traditions of Edith Hamilton and Joseph Campbell, he turns his talents to the world of myth.Where do we come from? Why do stars shine and the seasons change? What is evil? Since the beginning of time, people have answered such questions by crafting imaginative stories that have served as religion, science, philosophy, and popular literature. In his irreverent and popular question-and-answer style, Davis introduces and explains the great myths of the world, as well as the works of literature that have made them famous. In a single volume, he tackles Mesopotamia's Gilgamesh, the first hero in world mythology; Achilles and the Trojan War; Stonehenge and the Druids; Thor, the Nordic god of thunder; Chinese oracle bones; and the dramatic life and times of the man who would be Buddha.Ever familiar and instructive, Davis shows why the ancient tales of gods and heroes - from Mount Olympus to Machu Picchu, from ancient Rome to the icy land of the Norse - continue to speak to us today, in our movies, art, language, and music. For mythology novices and buffs alike, and for anyone who loves a good story, Don't Know Much About® Mythology is a lively and insightful look into the greatest stories ever told.",
  "genres": [
    "Nonfiction",
    "Mythology",
    "History",
    "Reference",
    "Religion",
    "Audiobook",
    "Historical"
  ],
  "author": "Kenneth C. Davis",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/919927.Don_t_Know_Much_About_Mythology"
}