{
  "title": "The Witch's Trinity",
  "description": "The year is 1507, and a friar has arrived in Tierkinddorf, a remote German village nestled deeply in the woods. The village has been suffering a famine, and the villagers are desperately hungry. The friar’s arrival is a miracle, and when he claims he can restore the town to prosperity, the men and women gathered to hear him rejoice. The friar has a book called the Malleus Maleficarum—“The Witch’s Hammer”—a guide to gaining confessions of witchcraft. The friar promises he will identify the guilty woman who has brought God’s anger upon the town; she will be burned, and bounty will be restored. Tierkinddorf is filled with hope. Neighbors wonder aloud who has cursed them and how quickly can she be found? They begin sharing secrets with the friar.Güde Müller, an elderly woman, has stark and frightening visions—recently she has seen things that defy explanation. None in the village know this, and Güde herself worries that perhaps her mind has begun to wander—certainly she has outlived all but one of her peers in Tierkinddorf. Yet of one thing she is absolutely She has become an object of scorn and a burden to her son’s wife. In these desperate times her daughter-in-law would prefer one less hungry mouth at the family table. As the friar turns his eye on each member of the tiny community, Güde dreads what her daughter-in-law might say to win his favor.Then one terrible night Güde follows an unearthly voice and the scent of charred meat into the snow-filled woods. Come morning, she no longer knows if the horror she witnessed was real or imagined. She only knows that if the friar hears of it, she may be damned in this life as well as the next.The Witch’s Trinity beautifully illuminates a dark period of history; it is vividly imagined, elegantly written, haunting, and unforgettable.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Witches",
    "Historical",
    "Fantasy",
    "Horror",
    "Germany"
  ],
  "author": "Erika Mailman",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/919275.The_Witch_s_Trinity"
}