{
  "title": "Taste Me",
  "description": "** Lightly revised/reissued edition of Tamara Hogan's award-winning debut novel, originally published in 2011... ** TASTE ME won a Daphne du Maurier Award for Mystery and Suspense, was nominated for the Romance Writers of America’s Golden Heart Award®, and won Prism Awards for Best Dark Paranormal, Best First Book, and Best of the Best. ** 95,000 words  When your first lover is a sex demon, it’s all downhill from there…  Coming home after a grueling year on tour, siren rock star Scarlett Fontaine needs to rest, recover, and finally get over incubus security expert Lukas Sebastiani. After one incendiary night together, Lukas moved on, and she needs to find the strength to do the same. Determined to avoid him, ignore him, and finally stop dreaming about him, Scarlett's plans go awry when her life is threatened...and the big, bad bodyguard insists on guarding her body himself.  He’ll sacrifice everything for the woman he can’t let himself have again…  Her siren song is his Achilles' heel, her emotions an intoxicating ambrosia he can’t let himself taste again, but with a killer addicted to death energy on the loose and Scarlett’s life in danger, Lukas must protect her no matter what the personal cost. By keeping her safe, he can finally start making amends—but when their long-suppressed emotions surge to the surface, Lukas learns that ‘amends’ are the last thing Scarlett wants.  The secret that can never be revealed…  As the killer spirals out of control, he threatens not only their lives, but to expose the secret that humanity isn’t ready to learn—that they’ve shared their planet with paranormal creatures for thousands of years, whose origins are out of this world…  Reader note: This is a lightly revised edition of a book originally published in March, 2011.",
  "genres": [
    "Paranormal Romance",
    "Urban Fantasy",
    "Romance",
    "Fantasy",
    "Demons",
    "Vampires",
    "Music"
  ],
  "author": "Tamara Hogan",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/9193799-taste-me"
}