{
  "title": "The Bugville Critters Explore the Solar System",
  "description": "A full-color, premium-size, perfect-bound children's picture book! Over 2.5 million Bugville books sold worldwide. In this 42-page story, Buster's imagination takes him on a trip through the solar system on a rocket ship. He sees the earth and moon from space. As he sets off to explore the rest of the solar system, he encounters asteroids and many strange and wonderful sights. The wonderfully-crafted story is paired with energetic illustrations and playful examples that help children discover the world around them and the joy of reading. Other Big Little Reader stories you may enjoy include Break Their Bad Habits, Stay After School, Have a Bad Day, Visit City Hall, Have a Surprise Party, Have a Backyard Picnic, and Compete in the Big Spelling Bee. ABOUT THE A gifted and distinguished writer, respected and skilled teacher and recipient of our nation's highest flying honor, the Distinguished Flying Cross, Robert Stanek wrote over 200 books of both fiction and nonfiction in his 30-year career. Although his works were published and/or distributed by nearly every major US publisher, including Simon & Schuster, Penguin Random House, Macmillan, Microsoft, McGraw-Hill, Hachette, and HarperCollins, Robert operated against the grain and became the first breakout author of the digital publishing movement. The first to serialize an ebook, the first to e-author a bestseller, and the first to e-author a digital audio bestseller. Robert is the recipient of multiple awards recognizing his outstanding contributions and excellence in writing, and a recent nominee for a Lifetime Achievement award. Translated into 57 languages, Robert Stanek's books have sold nearly 20 million copies worldwide. Praise for Robert Stanek's Bugville Critters... \"Instructive and entertaining.\" -- Follett Early Learning \"The bright, colorful illustrations are reminiscent of David Kirk's Little Miss Spider books and will captivate the young reader for whom the book is intended.\" -- Foreword Magazine \"Bugville Critters helps children sort out real lessons about life, family and the natural world.\" -- Foreword Magazine \"Robert Stanek is one of our most featured and respected Kids & Young Adults, K-12 Educators and Kids authors.\" -- The Audio Book Store \"Recommended series.\" -- Parenting Magazine \"Recommended children's book.\" -- Dr. Stacie Bunning, Clinical Psychologist and resident expert for GreatSchools.org Robert Stanek's Bugville Critters recommended by / featured in...+ Parenting Magazine (2008)+ The Children's Bookshelf (Publisher's Weekly) (2007, 2008)+ Children's Writer (2007)+ Foreword Magazine (2007)+ School Library Journal (2008, 2009)+ Library Journal (2008, 2009)+ The Publisher's Weekly Cover Story (2009)+ VOYA magazine for youth librarians (2007)+ Much, much more! Read letters to Buster from kids all over the world at the Bugville Critters web site.",
  "genres": [
    "Science"
  ],
  "author": "Robert Stanek",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/9194009-the-bugville-critters-explore-the-solar-system"
}