{
  "title": "Sense and Sensibility",
  "description": "Though not the first novel she wrote, Sense and Sensibility was the first Jane Austen published. Though she initially called it Elinor and Marianne, Austen jettisoned both the title and the epistolary mode in which it was originally written, but kept the essential theme: the necessity of finding a workable middle ground between passion and reason. The story revolves around the Dashwood sisters, Elinor and Marianne. Whereas the former is a sensible, rational creature, her younger sister is wildly romantic--a characteristic that offers Austen plenty of scope for both satire and compassion. Commenting on Edward Ferrars, a potential suitor for Elinor's hand, Marianne admits that while she \"loves him tenderly,\" she finds him disappointing as a possible lover for her sister:  Oh! Mama, how spiritless, how tame was Edward's manner in reading to us last night! I felt for my sister most severely. Yet she bore it with so much composure, she seemed scarcely to notice it. I could hardly keep my seat. To hear those beautiful lines which have frequently almost driven me wild, pronounced with such impenetrable calmness, such dreadful indifference!  Soon however, Marianne meets a man who measures up to her ideal: Mr. Willoughby, a new neighbor. So swept away by passion is Marianne that her behavior begins to border on the scandalous. Then Willoughby abandons her; meanwhile, Elinor's growing affection for Edward suffers a check when he admits he is secretly engaged to a childhood sweetheart. How each of the sisters reacts to their romantic misfortunes, and the lessons they draw before coming finally to the requisite happy ending forms the heart of the novel. Though Marianne's disregard for social conventions and willingness to consider the world well-lost for love may appeal to modern readers, it is Elinor whom Austen herself most evidently admired; a truly happy marriage, she shows us, exists only where sense and sensibility meet and mix in proper measure. --Alix Wilber",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Literature",
    "Historical",
    "Audiobook",
    "19th Century",
    "Classic Literature"
  ],
  "author": "Jane Austen",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/920017.Sense_and_Sensibility"
}