{
  "title": "The First Emancipator: The Forgotten Story of Robert Carter, the Founding Father Who Freed His Slaves",
  "description": "Robert Carter III, the grandson of Tidewater legend Robert “King” Carter, was born into the highest circles of Virginia’s Colonial aristocracy. He was neighbor and kin to the Washingtons and Lees and a friend and peer to Thomas Jefferson and George Mason. But on September 5, 1791, Carter severed his ties with this glamorous elite at the stroke of a pen. In a document he called his Deed of Gift, Carter declared his intent to set free nearly five hundred slaves in the largest single act of liberation in the history of American slavery before the Emancipation Proclamation.How did Carter succeed in the very action that George Washington and Thomas Jefferson claimed they fervently desired but were powerless to effect? And why has his name all but vanished from the annals of American history? In this haunting, brilliantly original work, Andrew Levy traces the confluence of circumstance, conviction, war, and passion that led to Carter’s extraordinary act.At the dawn of the Revolutionary War, Carter was one of the wealthiest men in America, the owner of tens of thousands of acres of land, factories, ironworks–and hundreds of slaves. But incrementally, almost unconsciously, Carter grew to feel that what he possessed was not truly his. In an era of empty Anglican piety, Carter experienced a feverish religious visionthat impelled him to help build a church where blacks and whites were equals. In an age of publicly sanctioned sadism against blacks, he defied convention and extended new protections and privileges to his slaves. As the war ended and his fortunes declined, Carter dedicated himself even more fiercely to liberty, clashing repeatedly with his neighbors, his friends, government officials, and, most poignantly, his own family.But Carter was not the only humane master, nor the sole partisan of freedom, in that freedom-loving age. Why did this troubled, spiritually torn man dare to do what far more visionary slave owners only dreamed of? In answering this question, Andrew Levy teases out the very texture of Carter’s life and soul–the unspoken passions that divided him from others of his class, and the religious conversion that enabled him to see his black slaves in a new light.Drawing on years of painstaking research, written with grace and fire, The First Emancipator is a portrait of an unsung hero who has finally won his place in American history. It is an astonishing, challenging, and ultimately inspiring book.From the Hardcover edition.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "Biography Memoir",
    "Research"
  ],
  "author": "Andrew Levy",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/919907.The_First_Emancipator"
}