{
  "title": "The New Weird",
  "description": "This avant-garde anthology that presents and defines the New Weird—a hip, stylistic fiction that evokes the gritty exuberance of pulp novels and dime-store comic books—creates a new literature that is entirely unprecedented and utterly compelling. Assembling an array of talent, this collection includes contributions from visionaries Michael Moorcock and China Miéville, modern icon Clive Barker, and audacious new talents Hal Duncan, Jeffrey Ford, and Sarah Monette. An essential snapshot of a vibrant movement in popular fiction, this anthology also features critical writings from authors, theorists, and international editors as well as witty selections from online debates.ContentsIntroduction: The New Weird: “It’s Alice?” by Jeff VanderMeer“The Gutter Sees the Light That Never Shines” by Alistair Rennie“Watson’s Boy” by Brian Evenson“Cornflowers Beside the Unuttered” by Cat Rambo“Jack” by China Miéville“In the Hills, the Cities” by Clive Barker“Forfend the Heaven’s Rending” by Conrad Williams“Locust-Mind” by Daniel Abraham“Tracking Phantoms” by Darja Malcolm-Clarke“Constable Chalch and the Ten Thousand Heroes” by Felix Gilman“The Lizard of Ooze” by Jay Lake“Festival Lives: Preamble: An Essay” by Jeff VanderMeer and Ann VanderMeer“At Reparata” by Jeffrey Ford“Immolation” by Jeffrey Thomas“The Art of Dying” by Darja Malcolm-Clarke“Whose Words You Wear” by K. J. Bishop“The Neglected Garden” by Kathy Koja“Letters from Tainaron” by Leena Krohn“The Luck in the Head” by M. John Harrison“Crossing Cambodia” by Michael Moorcock“Death in a Dirty Dhorti” by Paul Di Filippo“All God’s Chillun Got Wings” by Sarah Monette“The Braining of Mother Lamprey” by Simon D. Ings“The Ride of the Gabbleratchet” by Steph Swainston“A Soft Voice Whispers Nothing” by Thomas Ligotti“European Editor Perspectives on the New Weird: An Essay” by Martin Šust, Michael Haulica, Hannes Riffel, Jukka Halme, Konrad Walewski“The New Weird: I Think We’re the Scene” by Michael Cisco“New Weird Discussions: The Creation of a Term” by various authors",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Horror",
    "Fiction",
    "New Weird",
    "Anthologies",
    "Science Fiction"
  ],
  "author": "Ann VanderMeer",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/920795.The_New_Weird"
}