{
  "title": "Behind the Lens",
  "description": "WARNING: Rated R18. Contains sexually explicit content, both M/F & M/M.Dante Rata learns what’s Behind the Lens in this explosive sequel to Behind the Tears.Dante has a problem with sex – he gets way too much of it. Women want him, force themselves upon him, fight each other to get into his bed, and this ripped to the bones sex god even attracts male admirers. But when Dante discovers hidden cameras in his bedroom, he soon learns his sexual prowess is famous and the women who have been throwing themselves at him are porn actresses, paid to trick him into performing for the financial gain of an underground pornography ring - an organisation who forces people into sexual slavery. Dante’s efforts to outwit Ant Torres, the porn-ring’s instigator, ends with Dante trapped into performing live for his fans; with the threat of death to his loved ones if he doesn’t.Dante’s brother, Sledge, also has a problem with sex – but with the same-sex. He finds himself attracted to Corey, his best mate. After Sledge is told devastating news about his family, he falls into Corey’s bed, taking him as a lover. Ashamed of what he has done, Sledge tries to hide the relationship from his family and friends, something which makes Corey feel like a dirty little secret. When he finds Sledge talking to a pair of females at a party, he flies into a jealous rage, outing Sledge in front of everyone. Humiliated, Sledge runs out on Corey, which inadvertently leads Corey to Torres’s bed, where he is made to perform for the camera.When Corey is dropped off at home, drugged and traumatised, Sledge learns about the pornography ring and the danger his brother is in. Intent on revenge as well as saving his brother, he sets out to bring down Torres, along with his crime syndicate anyway he can – whether it takes him with it or not.",
  "genres": [
    "Erotica",
    "M M Romance",
    "Dark",
    "Abuse",
    "Contemporary",
    "New Adult",
    "Romance"
  ],
  "author": "Marita A. Hansen",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/13175110-behind-the-lens"
}