{
  "title": "No Excuse! Incorporating Core Values, Accountability, and Balance into Your Life and Career",
  "description": "“Jay Rifenbary has given the world a most generous gift. Anyone who reads this book and applies the No Excuse! philosophy daily can create the life they want and make a difference.” —Jack Canfield, CPAE, President, Jack Canfield Coaching, Bestselling Co-Author of Chicken Soup for the Soul This “International Bestseller” gives you a treasury of ideas to help you overcome obstacles and achieve excellence. It provides a concise plan for increasing personal responsibility in our homes, at work, in our businesses, and in all other areas of our lives. The book helps organizations and individuals increase this sense of ownership so they can truly succeed, live a better life, and be happy. You’ll learn how to live the No Excuse! Lifestyle built on a solid foundation of self-responsibility, purpose, and integrity, without which failure is inevitable. Then you’ll discover the secrets of the innovative THESAURUS FACTOR—12 key principles that are essential for personal, professional, and business success. No Excuse! is filled with anecdotes to clarify key points, while its inspirational messages will touch your soul and lift your spirits. Every chapter wraps up with an Action Plan for easy reference and application. You’ll Discover... • Why you need to forgive, and how to do it so you can move on. • How to live a self-esteem lifestyle for greater happiness and success. • How to elevate your attitude and enthusiasm so you can be more productive and inspire others to take action. • How to sustain self-control for personal and professional excellence. • How to always be honest with yourself and others for utmost integrity, • Why you need a dream and how to discover it and set goals to achieve it. • How to upgrade your knowledge and skills to get the results you want. • How to understand people and personalities for more effective communication and leadership. • How to honor your family and friends for personal happiness and joy. • How to upraise your determinations to make your dreams come true. • Over 100 quotes and affirmations for inspiration to keep you going. • How to truly succeed for a happy, fulfilling, and well-balanced life. “Jay has found the key to personal power, internal motivation, and individual excellence! This book gives a simple, practical blueprint for outstanding performance. Everyone needs to read it.” —Brian Tracy, CPAE, Speaker and Bestselling Author “I read your book! Exciting! Filled with good stuff. Have quoted you in two speeches and two TV shows this week.” —Ty Boyd, CPAE, Executive Communications and Coaching “I’m very impressed with No Excuse! You’ve gathered a wealth of knowledge and compiled it into a simple, clear, concise volume. I hope its circulation spreads far and wide.” —Robert A. Rohm, PhD, Pres., Personality Insights, Inc. “Well done...No Excuse! is a tough but caring view of the mission of our lives...read it and use the principles. I recommend it wholeheartedly.” —Larry Wilson, CPAE, Co-Author of The One Minute Salesperson “You have no excuse for not reading No Excuse!...or for accomplishing all that you’re capable of achieving as a result! Jay's No Excuse! Action Plans could positively change your life.” —Michael P. McKinley, CPAE Former Pres., National Speakers Association “Never before in my lifetime has this society needed the philosophy contained in these pages more. In business, government, education, and religion the time is now to stand up and be totally accountable for our actions. The antithesis has failed miserably in socialist countries as well as in social programs in our great nation. It’s time to stop expecting government to coddle us from cradle to grave. It’s time to be a No Excuse! person.” —J. Charles Plumb, Bestselling Author of I’m No Hero, Former Vietnam POW Jay is a graduate of West Point, former Airborne Ranger, sales executive and entrepreneur. He speaks for Fortune 500 corporations, organizations, and schools throughout the US.",
  "genres": [
    "Self Help"
  ],
  "author": "Jay Rifenbary",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/921279.No_Excuse_Incorporating_Core_Values_Accountability_and_Balance_into_Your_Life_and_Career"
}