{
  "title": "Magic and Mystery in Tibet",
  "description": "For centuries Tibet has been known as the last home of mystery, the hidden, sealed land, where ancient mysteries still survive that have perished in the rest of the Orient. Many men have written about Tibet and its secret lore, but few have actually penetrated it to learn its ancient wisdom. Among those few was Madame Alexandra David-Neel, a French orientalist. A practicing Buddhist, a profound historian of religion, and linguist, she actually lived in Tibet for more than 14 years. She had the great honor of being received by the Dalai Lama; she studied philosophical Buddhism and Tibetan Tantra at the great centers; she meditated in lonely caves and on wind-swept winter mountains with yogi hermits; and she even witnessed forbidden corpse-magic in the forests. Her experiences have been unique.Magic and Mystery in Tibet tells the story of her experiences in Tibet, among lamas and magicians. It is neither a travel book nor an autobiography but a study of psychic discovery, a description of the occult and mystical theories and psychic training practices of Tibet. She tells of great sages and sorcerers that she met; of the system of monastic education; the great teachers and their disciples; Tibetan folklore about their spiritual athletes; reincarnation and memory from previous lives; elaborate magical rites to obtain siddhis; the horrible necromantic magic of the pre-Buddhist Bonpa shamas; mental visualization exercises to create disembodied thought forms (tulpas); visions; phenomena of physical yoga, control of the body heat mechanism; breathing exercises; sending “messages on the wind”; and much similar material.An unusual aspect of Madame David-Neel’s book is that she herself experienced many of the phenomena she describes, yet she describes them with precision and in a matter-of-fact manner, permitting the reader to draw his own conclusions about validity, interpretation in terms of psychology, and value. Particularly interesting for the modern experiencer are her detailed instructions for tumo (the yoga of heat control) and creation of thought projections.",
  "genres": [
    "Buddhism",
    "Nonfiction",
    "Travel",
    "History",
    "Religion",
    "Spirituality",
    "Occult"
  ],
  "author": "Alexandra David-Néel",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/921455.Magic_and_Mystery_in_Tibet"
}