{
  "title": "Blue Highways Revisited",
  "description": "In 1978, William Least Heat-Moon made a 14,000-mile journey on the back roads of America, visiting 38 states along the way. In 1982, the popular Blue Highways, which chronicled his adventures, was published. Three decades later, Edgar Ailor III and his son, Edgar IV, retraced and photographed Heat-Moon’s route, culminating in Blue Highways Revisited, released for publication on the thirtieth anniversary of Blue Highways. A foreword by Heat-Moon notes, \"The photographs, often with amazing accuracy, capture my verbal images and the spirit of the book. Taking the journey again through these pictures, I have been intrigued and even somewhat reassured that America is changing not quite so fast as we often believe. The photographs, happily, reveal a recognizable continuity – but for how much longer who can say – and I'm glad the Ailors have recorded so many places and people from Blue Highways while they are yet with us.\" Through illustrative photography and text, Ailor and his son capture once more the local color and beauty of the back roads, cafes, taverns, and people of Heat-Moon’s original trek. Almost every photograph in Blue Highways Revisited is referenced to a page in the original work. With side-by-side photographic comparisons of eleven of Heat-Moon’s characters, this new volume reflects upon and develops the memoir of Heat-Moon’s cross-country study of American culture and spirit. Photographs of Heat-Moon’s logbook entries, original manuscript pages, Olympia typewriter, Ford van, and other artifacts also give readers insight into Heat-Moon’s approach to his trip. Discussions with Heat-Moon about these archival images provide the reader insight into the travels and the writing of Blue Highways that only the perspective of the author could provide. Blue Highways Revisited reaffirms that the \"blue highway\" serves as a romantic symbol of the free and restless American spirit, as the Ailors lose themselves to the open road as Heat-Moon did thirty years previously. This book reminds readers of the insatiable attraction of the “blue highway”—“But in those brevities just before dawn and a little after dusk—times neither day or night—the old roads return to the sky some of its color. Then, in truth, they carry a mysterious cast of blue, and it's that time when the pull of the blue highway is strongest, when the open road is a beckoning, a strangeness, a place where a man can lose himself” (Introduction to Blue Highways).",
  "genres": [
    "Travel",
    "Nonfiction",
    "Photography",
    "History"
  ],
  "author": "Edgar I. Ailor III",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/13174839-blue-highways-revisited"
}