{
  "title": "The Three of Us: Growing Up with Tammy and George",
  "description": "The marriage of George Jones and Tammy Wynette was hailed as a union made in honky-tonk heaven. And when little Tamala Georgette Jones was born in 1970, she was considered country music’s heir apparent. For the first four years of her life, Georgette had two adoring parents who showed her off at every opportunity, and between her parents, grandparents, older sisters, and cheering fans, Georgette’s feet seldom hit the ground. But as in every fairy tale, dark forces were just around the corner. Her parents fought, and George drank. George and Tammy divorced when Georgette was four, and it would be years before she understood just what that meant. The Three of Us is an honest and heartfelt look into the life of a broken family living in the glare of the public spotlight. Like so many of her generation, Georgette had to make sense of loving two parents who couldn’t love each other. With never-before-told stories about George and Tammy, it recounts Tammy’s descent into prescription pill addiction, her dependence on her fifth husband, George Richey, and her untimely death at the age of fifty-five. Georgette opens up about her broken relationship with her father and what it took for them to come back together. Lastly, Georgette discusses the ups and downs of her adult failed marriages, illness, an arrest, and now, an unexpected but thrilling career as a musician. The Three of Us is a story of both extreme privilege and great trials, of larger-than-life people with larger-than-life problems. Rich in country music history, it contains twists and turns, highs and lows, but in the end, it stands as an intensely moving tale of love, loss, heartbreak, and what it means to be a family.",
  "genres": [
    "Nonfiction",
    "Music",
    "Biography",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Georgette Jones",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/9212234-the-three-of-us"
}