{
  "title": "Into the Wilderness",
  "description": "Weaving a vibrant tapestry of fact and fiction, Into the Wilderness sweeps us into another time and place...and into the heart of a forbidden, incandescent affair between a spinster Englishwoman and an American frontiersman. Here is an epic of romance and history that will captivate readers from the very first page.When Elizabeth Middleton, twenty-nine years old and unmarried, leaves her Aunt Merriweather's comfortable English estate to join her father and brother in the remote mountain village of Paradise on the edge of the New York wilderness, she does so with a strong will and an unwavering to teach school.It is December of 1792 when she arrives in a cold climate unlike any she has ever experienced. And she meets a man different from any she has ever encountered--a white man dressed like a Native American, tall and lean and unsettling in his blunt honesty. He is Nathaniel Bonner, also known to the Mohawk people as Between-Two-Lives.Determined to provide schooling for all the children of the village--white, black, and Native American--Elizabeth soon finds herself at odds with local slave owners. Much to her surprise, she clashes with her own father as well. Financially strapped, Judge Middleton has plans for his daughter--betrothal to local doctor Richard Todd. An alliance with Todd could extract her father from ruin but would call into question the ownership of Hidden Wolf, the mountain where Nathaniel, his father, and a small group of Native Americans live and hunt.As Judge Middleton brings pressure to bear against his daughter, she is faced with a choice between compliance and deception, a flight into the forest, and a desire that will bend her hard will to compromise and transformation. Elizabeth's ultimate destiny, here in the heart of the wilderness, lies in the odyssey to trials of faith and flesh, and passion born amid Nathaniel's own secrets and divided soul.Interweaving the fate of the remnants of the Mohawk Nation with the destiny of two lovers, Sara Donati's compelling novel creates a complex, profound, passionate portrait of an emerging America.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Historical",
    "Historical Romance",
    "Adventure",
    "Audiobook"
  ],
  "author": "Sara Donati",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/9217604-into-the-wilderness"
}