{
  "title": "Slave Narratives",
  "description": "No literary genre speaks as directly and as eloquently to the brutal contradictions in American history as the slave narrative. The works collected in this volume present unflinching portrayals of the cruelty and degradation of slavery while testifying to the African-American struggle for freedom and dignity. They demonstrate the power of the written word to affirm a person's—and a people's—humanity in a society poisoned by racism. Slave Narratives shows how a diverse group of writers challenged the conscience of a nation and, through their expression of anger, pain, sorrow, and courage, laid the foundations of the African-American literary tradition.This volume collects ten works published between 1772 and 1864:Two narratives by James Albert Ukawsaw Gronniosaw (1772) and Olaudah Equiano (1789) recount how they were taken from Africa as children and brought across the Atlantic to British North America.The Confessions of Nat Turner (1831) provides unique insight into the man who led the deadliest slave uprising in American history.The widely read narratives by the fugitive slaves Frederick Douglass (1845), William Wells Brown (1847), and Henry Bibb (1849) strengthened the abolitionist cause by exposing the hypocrisies inherent in a slaveholding society ostensibly dedicated to liberty and Christian morality.The Narrative of Sojourner Truth (1850) describes slavery in the North while expressing the eloquent fervor of a dedicated woman.Running a Thousand Miles for Freedom (1860) tells the story of William and Ellen Craft's subversive and ingenious escape from Georgia to Philadelphia.Incidents in the Life of a Slave Girl (1861) is Harriet Jacobs's complex and moving story of her prolonged resistance to sexual and racial oppression.The narrative of the \"trickster\" Jacob Green (1864) presents a disturbing story full of wild humor and intense crueltyTogether, these works fuse memory, advocacy, and defiance into a searing collective portrait of American life before emancipation.Slave Narratives contains a chronology of events in the history of slavery, as well as biographical and explanatory notes and an essay on the texts.The editors of this volume are William L. Andrews, E. Maynard Adams Professor of English at the University of North Carolina at Chapel Hill, and Henry Louis Gates Jr., W.E.B. Du Bois Professor of Humanities at Harvard University.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "Race",
    "Classics",
    "Autobiography"
  ],
  "author": "William L. Andrews",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/922040.Slave_Narratives"
}