{
  "title": "Perla la Loca",
  "description": "From the third book that collects the classic \"Locas\" comics storyline from Love and Rockets : Jaime drops a narrative bomb on Hopey in \"Wigwam Bam.\" And Maggie contends with her inner demons, a murderer, a woman wrestler, and … gets married? The fifth book in The Complete Love and Rockets Library is the third in the classic \"Locas\" comics storyline. Perla La Loca begins with the \"Wigwam Bam,\" arguably writer-artist Jaime Hernandez's definitive statement on post-punk culture. As Maggie, Hopey, and the rest of the Locas prowl Los Angeles, the East Coast, and parts in between, they try to recapture the carefree spirit of those early days. \"Wigwam Bam\" brings us up to date on all the members of Jaime's extensive cast of characters and then drops a narrative bomb on Hopey (and us) in the very last pages. Split up from Hopey yet again, Maggie bounces back and forth between a one-laundromat town in Texas (the \"Chester Square\" that serves as the title of two of the strongest stories in the book), where she has to contend with both her own inner demons, a murderous foe, and Camp Vicki, where she has to fend off her aunt Vicki's attempts to make her a professional wrestler and the unwanted advances of champ-to-be, Gina. These stories originally appeared circa 1990–1996 in the long-running (and ongoing) Love and Rockets comic book series, also featuring work by Jaime's brothers, Gilbert and Mario. Characters change as they age in \"real-time\" in stories that span generations. L&R has been called \"the greatest American comic book series of all time\" by Rolling Stone and \"a great, sprawling American novel\" by GQ . It broke ground with its craft and the casual intersectionality of its huge and diverse casts of nuanced characters (many of whom are LGBQTIA+) who live and have relationships in often-naturalistic settings and situations. Black and white illustrations throughout",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Fiction",
    "Graphic Novels Comics",
    "Queer",
    "Sequential Art",
    "Comix"
  ],
  "author": "Jaime Hernández",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/922724.Perla_la_Loca"
}