{
  "title": "The Pope's Daughter: The Extraordinary Life of Felice della Rovere",
  "description": "The illegitimate daughter of Pope Julius II, Felice della Rovere became one of the most powerful and accomplished women of the Italian Renaissance. Now, Caroline Murphy vividly captures the untold story of a rare woman who moved with confidence through a world of popes and princes. Using a wide variety of sources, including Felice's personal correspondence, as well as diaries, account books, and chronicles of Renaissance Rome, Murphy skillfully weaves a compelling portrait of this remarkable woman. Felice della Rovere was to witness Michelangelo paint the Sistine Chapel, watch her father Pope Julius II lay the foundation stone for the new Saint Peter's, and see herself immortalized by Raphael in his Vatican frescos. With her marriage to Gian Giordano Orsini--arranged, though not attended, by her father the Pope--she came to possess great wealth and power, assets which she turned to her advantage. While her father lived, Felice exercised much influence in the affairs of Rome--even negotiating for peace with the Queen of France--and after his death, Felice persevered, making allies of the cardinals and clerics of St. Peter's and maintaining her control of the Orsini land through tenacity, ingenuity, and carefully cultivated political savvy. She survived the Sack of Rome in 1527, but her greatest enemy proved to be her own stepson Napoleone. The rivalry between him and her son Girolamo had a sudden and violent end, and brought her perilously close to losing everything she had spent her life acquiring. With a marvelous cast of characters, this is a spellbinding biography set against the brilliant backdrop of Renaissance Rome.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Italy",
    "Womens",
    "European History",
    "Historical"
  ],
  "author": "Caroline P. Murphy",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/9223059-the-pope-s-daughter"
}