{
  "title": "The Oldest Living Vampire Tells All: Revised and Expanded",
  "description": "“My legal name where I currently reside in the city of Liege, Belgium, in the year 2010 A.D., is Gaspar Valessi, but that is not my real name. The name I was given some 30,000 years ago, when I was born in a Paleolithic settlement in the region that is now called Germany-- the name my father gave me shortly after I was voided, bloody and howling, from my mother's womb-- is Gon.” So begins the saga of the immortal Gon, a 30,000 year old vampire. This, the first volume of his memoirs, recounts his mortal life in prehistoric Germany alongside his male companion Brulde and his two wives, the Neanderthal Eyya and his Cro-Magnon mate Nyala, and details the fearsome events that lead to his transformation from man to undying monster. This Revised and Expanded Edition includes more than 30,000 words of new material, adding depth to much loved characters and more fully realizing the author's vision of the Oldest Living Vampire and the prehistoric world that gave birth to him. By turns beautiful and subversive, poetic and seductive, the Oldest Living Vampire Saga is like no other vampire series you've ever read! Readers Rave About The Oldest Living Vampire Saga \"Sensual and exciting\"...\"Had me on the edge of my seat\"...\"Anyone who enjoys Anne Rice's Lestat stories will find this a great read.\"...\"The story of Gon is incredible\"...\"This author has tremendous talent\"...\"Not your run of the mill vampire\"...\"BRAVO!\"...\"I'm an Anne Rice fan but decided to dive in to what I hoped would be a good read. I was not disappointed!\" What The Critics Say \"In the competitive literary world of glittery immortals and undead enchantresses, [Mr. Duncan] has successfully created a unique vampire with an extensive historical background that has been embraced by multitudes of fans.\"--Examiner.com...\"I wasn’t expecting much. But again, my initial impression was proved wrong. It’s an interesting book with a very unique main character.\"--Uwanted2C.com The Oldest Living Vampire Tells All has been a Kindle best-seller since its debut in 2010... find out for yourself what all the rave reviews are about! The Oldest Living Vampire Saga  Volume The Oldest Living Vampire Tells All Side Nyal's Story Volume The Oldest Living Vampire on the Prowl Volume The Oldest Living Vampire In Love Side Apollonius Volume The Oldest Living Vampire Betrayed Volume The Oldest Living Vampire Reborn",
  "genres": [
    "Vampires",
    "Fantasy",
    "Horror",
    "Paranormal",
    "Fiction",
    "Historical Fiction",
    "Historical"
  ],
  "author": "Joseph Duncan",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/9218899-the-oldest-living-vampire-tells-all"
}