{
  "title": "The History of England",
  "description": "In these two forgotten gems of English literature, Jane Austen and Charles Dickens offer delightful, irreverent histories of their native land. When she was only sixteen years old, Jane Austen composed her bitingly satirical History of England for performance in her family's drawingroom. A startling and precocious example of her celebrated wit—not to mention a brilliant social commentary—this lively piece sweeps rapidly across almost four centuries of British monarchy. In rambunctious and wickedly funny prose, Austen's critique spans from Henry IV to Charles I, from Richard III to Mary Queen of Scots, offering a fierce parody of the kind of biased history that young ladies of Austen's time were being forced to study. Reproduced here in its entirety, this is a rare, tantalizing look at the great novelist's budding talent, and an extraordinary bit of literary history that lay unpublished for more than 130 years.Charles Dickens's A Child's History of England, by contrast, was written and published at the height of its author's considerable fame. A gory and dramatic account, full of villains and heroes, the essay was originally intended as a study-piece for his children, but in fact represented a sly, unconventional countertext to the more straitlaced historical canon. Dickens's exciting, flamboyant narrative is hugely evocative, both of the history he describes and of the time in which he himself was writing.With an insightful introduction by bestselling historian David Starkey, Two Histories of England brings together, in a single, irresistible volume, these remarkable—and remarkably overlooked—literary treasures by two of the world's most beloved writers.",
  "genres": [
    "Classics",
    "History",
    "Nonfiction",
    "Humor",
    "Short Stories",
    "Historical",
    "British Literature"
  ],
  "author": "Jane Austen",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/922868.The_History_of_England"
}