{
  "title": "New Texas History Movies",
  "description": "Many will remember Texas History Movies , a cartoon booklet that was distributed to Texas history students from the 1920s through the 1960s by Mobil Oil with its familiar Flying Red Horse logo. For decades Texas History Movies taught thousands of school children the varied history of Texas, from Columbus to the discovery of oil. Though the original version is now considered racist, it was for many students their first and only taste of Texas history.It is with great pride that the Texas State Historical Association announces the publication of our newest version of this timeless Texas history classic by the late Jack Jackson, award-winning scholar and illustrator. The New Texas History Movies is a totally revised edition with new cartoon strips and text by Jackson. Jackson gained fame as an underground cartoonist in the 1960s and, later, as an independent scholar who specialized in the history of the Spanish presence in Texas.Jack took much pride in this revision, for the original Texas History Movies was a great inspiration to him. As Jackson states in the afterword, it was his objective \"to create a 'time- machine' effect that would make readers feel like they were there when the events occurred.\" He hoped that his \"rendition of the old classic, Texas History Movies , would 'grab' a few young minds and make them want to learn more about the interesting people and events briefly touched on in this booklet.\" It could almost be said that Jack's love for Texas history began with Texas History Movies ; and it is fitting that his work has come full circle with his rendition of this enduring Texas history classic.An Educator's Edition with additional content by Jana Magruder is available to help teachers incorporate this book into the seventh- grade curriculum. The TEKS-based guide contains activities and TAKS-based assessments for each chapter. It is designed to facilitate interdisciplinary connections between history and language arts teachers while building student skills in reading, writing, and social studies. Included in this Educator's Edition is a CD-ROM containing the materials necessary for easy classroom use.",
  "genres": [
    "History",
    "Comics"
  ],
  "author": "Jack Jackson",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/923762.New_Texas_History_Movies"
}