{
  "title": "Cold Trail",
  "description": "Two decades have passed since Dell Shannon first introduced the character of Lt. Luis Mendoza to readers, and no title better explains the strong and steady popularity of both the series and its central figure than COLD TRAIL, a fast-paced, timely and totally involving mystery novel that depicts the current world of crime in a big city with gritty realism and unpredictablility.Fully seasoned to the anonymous urban violence that is all in a day's work, Lieutenant Mendoza must once again adapt his mode of operation to a chilling sequence of senseless crimes. As Cold Trail opens, a murderous rapist and child molester is loose in the streets; an unidentified female body is found under a condemned house in a decaying section of the city; a thug is shot to death and a chain of robberies continues unabated--all without a clue.Mendoza and his colleagues in the Robery and Homicide Division of the Los Angeles Police Department follow what appears to be a cold trail until, through meticulous detective work and routine persistence, the men bring this set of mysteries to its conclusion.Veteran admireers and newcomers to the series alike will be hooked from page one of Cold Trail, marveling at Dell Shannon's abilities to depict crime as it really exists in cities today and thrilling to the suspense and danger Lieutenant Mendoza and his men face in what seems the impossible challenge of criminal justice in the urban setting.With Cold Trail, Dell Shannon has written 29 Lieutenant Mendoza mysteries. Meticulous in her research of the Los Angeles Police Department, she has a firsthand knowledge of police procedures and criminal laboratory techniques, which accounts in large part for the vivid realism and strong characterizations in the series. Dell Shannon lives in Southern California with a menagerie that includes several cats, two sheep and a dog.",
  "genres": [
    "Mystery"
  ],
  "author": "Dell Shannon",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/923042.Cold_Trail"
}