{
  "title": "Star Wars: Tales",
  "description": "This omnibus Anthology collection of 40 short stories, novelettes and novellas set in the fictional Star Wars universe provides background and information on many of the characters in the popular Star Wars universe. If you've ever wanted to know more about the Bounty Hunters that appear in The Empire Strikes Back, this is the book!Contents: Tales from the Mos Eisley Cantina [Star Wars: Tales] (1995) 16 short stories / anthology by Kevin J. Anderson: In a far corner of the universe, on the small desert planet of Tatooine, there is a dark, nic-i-tain-filled cantina where you can down your favorite intoxicant while listening to the best jazz riffs in the universe. But beware your fellow denizens of this pangalactic watering hole, for they are cutthroats and cutpurses, assassins and troopers, humans and aliens, gangsters and thieves... Tales of the Bounty Hunters [Star Wars: Tales] (1996) 5 novellas / anthology by Kevin J. Anderson: In a wild and battle-scarred galaxy, assassins, pirates, smugglers, and cutthroats of every description roam at will, fearing only the professional bounty hunters-amoral adventurers who track down the scum of the universe...for a fee. Tales from Jabba's Palace [Star Wars: Tales] (1996) 19 short stories / anthology by Kevin J. Anderson: In the dusty heat of twin-sunned Tatooine lives the wealthiest gangster in a hundred worlds, master of a vast crime empire and keeper of a vicious, flesh-eating monster for entertainment (and disposal of his enemies). Bloated and sinister, Jabba the Hutt might have made a good joke -- if he weren't so dangerous. A cast of soldiers, spies, assassins, scoundrels, bounty hunters, and pleasure seekers have come to his palace, and every visitor to Jabba's grand abode has a story. Some of them may even live to tell it....",
  "genres": [
    "Star Wars",
    "Fiction",
    "Science Fiction",
    "Science Fiction Fantasy",
    "Adventure",
    "Short Stories",
    "Anthologies"
  ],
  "author": "Kevin J. Anderson",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/131777.Star_Wars"
}