{
  "title": "The Confident Hope of a Miracle: The True History of the Spanish Armada",
  "description": "The Confident Hope of a Miracle is a gripping account of the defeat of the Spanish Armada-the defining international event of the Elizabethan age. In 1588, determined to reclaim England for the Catholic Church, King Philip II of Spain launched a fleet of huge castle-crowned galleons that stretched for miles across the ocean. A battle-hardened Spanish Army waited in Holland, ready to crush England's barely trained conscripts, many armed only with scythes, stakes or longbows. All that stood between Spain and victory was the English Navy. But English ships, tactics, weapons and crews were much superior to those of the Armada, and the pious and ascetic Philip's \"confident hope of a miracle\" to give him victory was not fulfilled.The story of the Spanish Armada is one of the great epics, with a cast of characters as rich and varied as any in history, with results that shaped Europe for centuries to come. Neil Hanson, the acclaimed author of The Great Fire of London and The Custom of the Sea,  brings the story to vivid life, tracing the origins of the conflict from the Old World to the New, delineating the Armada campaign in rousing prose, and illuminating the lives of kings and popes, spymasters and assassins, military commanders and common sailors, and the ordinary men and women caught up in this great event when the fate of nations hung in the balance. Hanson also depicts the terrible fate that befell the seamen of both sides long after the decisive battles were over, and he takes a fresh, hard look at Elizabeth I, shaking the pedestal of \"England's greatest ever monarch.\"The Confident Hope of a Miracle is authentic and original history written with the pace and drama of a novel.",
  "genres": [
    "History",
    "Nonfiction",
    "Spain",
    "Military History",
    "British Literature",
    "World History",
    "Military Fiction"
  ],
  "author": "Neil Hanson",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/924317.The_Confident_Hope_of_a_Miracle"
}