{
  "title": "Coming Home to the Pleistocene",
  "description": "\"When we grasp fully that the best expressions of our humanity were not invented by civilization but by cultures that preceded it, that the natural world is not only a set of constraints but of contexts within which we can more fully realize our dreams, we will be on the way to a long overdue reconciliation between opposites which are of our own making.\" --from Coming Home to the PleistocenePaul Shepard was one of the most profound and original thinkers of our time. Seminal works like The Tender Carnivore and the Sacred Game, Thinking Animals, and Nature and Madness introduced readers to new and provocative ideas about humanity and its relationship to the natural world. Throughout his long and distinguished career, Paul Shepard returned repeatedly to his guiding theme, the central tenet of his that our essential human nature is a product of our genetic heritage, formed through thousands of years of evolution during the Pleistocene epoch, and that the current subversion of that Pleistocene heritage lies at the heart of today's ecological and social ills.Coming Home to the Pleistocene provides the fullest explanation of that theme. Completed just before his death in the summer of 1996, it represents the culmination of Paul Shepard's life work and constitutes the clearest, most accessible expression of his ideas. Coming Home to the Pleistocene pulls together the threads of his vision, considers new research and thinking that expands his own ideas, and integrates material within a new matrix of scientific thought that both enriches his original insights and allows them to be considered in a broader context of current intellectual controversies. In addition, the book explicitly addresses the fundamental question raised by Paul Shepard's What can we do to recreate a life more in tune with our genetic roots? In this book, Paul Shepard presents concrete suggestions for fostering the kinds of ecological settings and cultural practices that are optimal for human health and well-being.Coming Home to the Pleistocene is a valuable book for those familiar with the life and work of Paul Shepard, as well as for new readers seeking an accessible introduction to and overview of his thought.",
  "genres": [
    "History",
    "Anthropology",
    "Nonfiction",
    "Science",
    "Psychology",
    "Philosophy",
    "Prehistory"
  ],
  "author": "Paul Shepard",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/926475.Coming_Home_to_the_Pleistocene"
}