{
  "title": "Miami and the Siege of Chicago",
  "description": "\"I am a Left conservative:\" That was Norman Mailer's jaunty but slightly defensive self-description when 1st I met him at the beginning of the '80s. At the time, I was inclined to attribute this glibness to the triumph of middle age & to the compromises perhaps necessary to negotiate the then-new ascendancy of Reagan. But, looking back over this extraordinary journal of a plague year, written 40 years ago, I suddenly appreciate that Mailer in 1968 had already been rehearsing for some kind of ideological synthesis, & discovering it in the most improbable of places. Party conventions have been such dull spectacles of stage-management for so long that this year (I happen to be writing on the day after the closing Democratic primaries) it has been considered nothing less than shocking that delegates might arrive in Denver in August with any more than ceremonial or coronational duties ahead of them. The coverage of such media-events, now almost wholly annexed by the cameras & those who serve them, has undergone a similar declension into insipidity. Mailer could see this coming: having left the Republican gathering in Miami slightly too early \"he realized he had missed the most exciting night of the convention, at least on the floor, & was able to console himself only with the sad knowledge that he could cover it better on tv than if he had been there.\" This wasn't quite true yet: what we have here is the last of the great political-convention essayists, & the close of a tradition that crested with H.L. Mencken & was caught so deftly in Gore Vidal's play The Best Man. You will note the way in which Mailer decided to write about himself in the 3rd person, using for a title the name \"the reporter.\" This isn't invariably a good idea but it generally works in this instance, even when he muses, of himself, that: \"The Democratic Convention in 1960 in Los Angeles which nominated John F. Kennedy, & the Republican in San Francisco in 1964 which installed Barry Goldwater, had encouraged some of his very best writing.\" \"They venerated Nixon for his service to Eisenhower, & his comeback now--it was his comeback which had made him a hero in their eyes, for America is the land which worships the Great Comeback, & so he was Tricky Dick to them no more, but the finest gentleman in the land; they were proud to say hello.\" Pauline Kael was later to make herself a laughing stock by exclaiming in astonishment that she didn't \"know anybody\" who had voted for Nixon. Mailer was determined to avoid this mistake in advance, confessing his own ignorance & admitting that in a large Miami ballroom filled with delegates, \"there were not 10 people he recognized.\" The only other person of liberal/radical temper who tried to avoid condescending to Nixon & to Nixonism was that other master of convention-floor prose, the late Murray Kempton. It was from Kempton himself that Mailer annexed what eventually became the running theme & essential insight of his attendance at both events. \"'Politics is property'...[a] delegate's vote is his holding--he will give it up without return no more than a man will sign over his house entire to a worthy cause.\" More self-evident, perhaps, among the Chamber of Commerce types in Miami (& Nelson Rockefeller with his \"catfish mouth\"), this extended metaphor worked particularly well--and Mailer did his level best to extend it--in the gaunt, unsentimental world of Chicago stock-yard ward-heeling: that rugged inland coast on which the waves of 60s idealism broke in vain. It wasn't to be \"new phalanxes of order\" that were conjured. It was the bitter old phalanx of the Daley machine & the Chicago PD. Of necessity, the Illinois chapter was much longer & more intense than the Florida one, but before we shift the scene it is worth saluting Mailer 1st for seeing clearly that Nixon would be \"the one\" & 2nd for guessing that Ronald Reagan might well be the next one. His method in the 2nd case was equally intuitive. He noticed the clever rebound from the Goldwater defeat while also understanding the purely showbiz aspect. Could that gifted but gruesome twosome of Burroughs & Genet help to explain Mailer's recurrence to the threat of \"nihilism\"? He hated the war & the police and had contempt for the mobbed-up big mayors & union men who constituted the muscle of the Democrats. But he found Eugene McCarthy brittle & dislikeable, & McCarthy supporters addicted to defeat. Then there was this: \"He liked his life. He wanted it to go on, which meant that he wanted America to go on--not as it was going, not Vietnam--but what price was he really willing to pay?\" Mailer here was being plaintive but honest, as in the case of the above account of his Lincoln Park funk. It was becoming another of those moments where the best lacked all conviction while the worst...well, we know how that goes. Incidentally, one can't be too careful about making familiar poetic citations. Mailer quotes Edward Kennedy as saying of Bobby's supporters that they had \"followed him, honored him, lived in his mild & magnificent eye,\" & one suddenly realizes that he thinks he is quoting Teddy himself rather than Robert Browning's famous lines from The Lost Leader. As Joan Didion once observed, there are those who say \"No Man Is an Island\" who firmly believe that they are echoing Ernest Hemingway. Our Democratic primaries are run the way they are now mainly because of the way they were run then. Mailer dryly watched the roll-call in Chicago & noted that the state which put Hubert Humphrey over the top (Pennsylvania) was the one where McCarthy had received 90% of the primary votes. To touch on another comparison with today's politics, Mailer also noticed in Miami that Nixon had won the nomination in such a way as to also win the election: in other words without splitting or embittering his party. These & similar reflections are of interest & value in a year where the Democratic nominee is, in one of his many protean incarnations, a Chicago South Side operator with a wife whose father was a Daley precinct captain, while the Republican candidate is a repository of something in which almost nobody in 1968 would ever have believed: America's residual pride about its own valor in Vietnam. The almost-closing line of the book is the prediction that Mailer wishes he had made to Eugene McCarthy's daughter: \"'Dear Miss,' he could have told her, 'we will be fighting for 40 years.'\" He got that right, among many other things.--Christopher Hitchens",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Journalism",
    "American History",
    "American",
    "Essays"
  ],
  "author": "Norman Mailer",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/131788.Miami_and_the_Siege_of_Chicago"
}