{
  "title": "River Monsters: True Stories of the Ones that Didn't Get Away",
  "description": "I’m Jeremy Wade, biologist and fishing detective. For twenty-five years, I’ve explored our planet’s remotest rivers and lakes, hunting for monster-sized fish. It’s become something of an obsession for me. . . .  Called “the greatest angling explorer of his generation” ( Independent on Sunday ), Jeremy Wade, host of Animal Planet’s wildly popular TV series River Monsters , takes viewers where no wildlife program has gone before, revealing the creatures that lurk in the murky depths of our planet’s inland waterways. Now, Wade goes truly beneath the surface, disclosing full details of how he tracks down and catches each species while also recounting the off-camera highlights of his extraordinary life. From his arrest as a suspected spy in Southeast Asia to a plane crash in the Amazon, every page of River Monsters is packed with adventure. Each chapter unfolds an enthralling detective story, where fishermen’s tales of underwater man-eaters and aquatic killers are subjected to scientific scrutiny. Follow Wade step-by-step as, armed with just a fishing line, he closes in on his prey and separates fact from fiction. From the heart of the Congo, where he wrestles with supernatural goliath tigerfish, to the depths of the Amazon, where the most feared creature is one that could fit in your palm, the results are fish of staggering proportions and terrifying demeanor. Wade also reveals monsters from upcoming episodes, including deadly electric eels, a giant described as a cross between a shark and a chainsaw, and a snake-like beast that truly is the stuff of legend. In the tradition of the most gripping adventure writing, River Monsters shows that there’s more to this world than what’s visible on the surface. As Wade says, with a fishing line anything is possible—sometimes it can even reveal the future, or at least one possible version of it. In similar fashion, Wade’s writings are much more than exhilarating they reveal a vision of the world more awe-inspiring than any individual myth made flesh. Ultimately, River Monsters explores the real mysteries that still exist, capturing the story of one man’s obsession—and his relentless pursuit of the truth.",
  "genres": [
    "Nonfiction",
    "Science",
    "Animals",
    "Travel",
    "Nature",
    "Biography",
    "Memoir"
  ],
  "author": "Jeremy Wade",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/9267564-river-monsters"
}