{
  "title": "American Pharaoh: Mayor Richard J. Daley - His Battle for Chicago and the Nation",
  "description": "\"This is Chicago, this is America.\" With those words, Chicago mayor Richard J. Daley famously defended his brutal crackdown on protesters at the 1968 Democratic convention. Profoundly divided racially, economically and socially, Chicago was indeed a microcosm of America, and for more than two decades Daley ruled it with an iron fist. The last of the big city bosses, Daley ran an unbeatable political machine that controlled over one million votes. From 1955 until his death in 1976, every decision of any importance -- from distributing patronage jobs to picking Congressional candidates -- went through his office. He was a major player in national politics as well: Kennedy and Johnson owed their presidencies to his control of the Illinois vote, and he made sure they never forgot it. In a city legendary for its corruption and backroom politics, Daley's power was unrivaled. Daley transformed Chicago -- then a dying city -- into a modern metropolis of skyscrapers, freeways and a thriving downtown. But he also made Chicago America's most segregated city. A man of profound prejudices and a deep authoritarian streak , he constructed the nation's largest and worst ghettos, sidestepped national civil rights laws, and successfully thwarted Martin Luther King's campaign to desegregate Northern cities.A quarter-century after his death, Daley's outsize presence continues to influence American urban life, and a reassessment of his career is long overdue. Now, veteran journalists Adam Cohen and Elizabeth Taylor present the definitive biography of Richard J. Daley, drawn from newly uncovered material and dozens of interviews with his contemporaries. In today's era of poll-tested, polished politicians, Daley's rough-and-tumble story is remarkable. From the working-class Irish neighborhood of his childhood, to his steady rise through Chicago's corrupt political hierarchy, to his role as national power broker, American Pharaoh is a riveting account of the life and times of one of the most important figures in twentieth-century domestic politics. In the tradition of Robert Caro's classic The Power Broker, this is a compelling life story of a towering individual whose complex legacy is still with us today.",
  "genres": [
    "Biography",
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Biography Memoir",
    "Urban Studies"
  ],
  "author": "Adam Cohen",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/92731.American_Pharaoh"
}