{
  "title": "The Literary Underground of the Old Regime",
  "description": "Robert Darnton introduces us to the shadowy world of pirate publishers, garret scribblers, under-the-cloak book peddlers, smugglers, and police spies that composed the literary underground of the Enlightenment.Here are the ambitious writers who crowded into Paris seeking fame and fortune within the Republic of Letters, but who instead sank into the miserable world of Grub Street―victims of a closed world of protection and privilege. Venting their frustrations in an illicit literature of vitriolic pamphlets, libelles , and chroniques scandaleuses , these “Rousseaus of the gutter” desecrated everything sacred in the social order of the Old Regime. Here too are the workers who printed their writings and the clandestine booksellers who distributed them.While censorship, a monopolistic guild, and the police contained the visible publishing industry within the limits of official orthodoxies, a prolific literary underworld disseminated a vast illegal literature that conveyed a seditious ideology to readers everywhere in France. Covering their traces in order to survive, the creators of this eighteenth-century counterculture have virtually disappeared from history. By drawing on an ingenious selection of previously hidden sources, such as police ledgers and publishers’ records, Robert Darnton reveals for the first time the fascinating story of that forgotten underworld.The activities of the underground bear on a broad range of issues in history and literature, and they directly concern the problem of uncovering the ideological origins of the French Revolution. This engaging book illuminates those issues and provides a fresh view of publishing history that will inform and delight the general reader.",
  "genres": [
    "History",
    "Nonfiction",
    "France",
    "Microhistory",
    "18th Century",
    "French Revolution",
    "Books About Books"
  ],
  "author": "Robert Darnton",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/927226.The_Literary_Underground_of_the_Old_Regime"
}