{
  "title": "The Donzerly Light",
  "description": "Praise for Ryne Douglas Pearson's novels... \"A must... A gripping blend of techno-thriller and detective story... The suspense runs at a high pitch\"   Publishers Weekly  for 'Cloudburst' \"Mind-boggling... A hyperreal whiz-bang novel by a gifted high-tech specialist\"   Kirkus Reviews  for 'Cloudburst' \"Suspenseful and filled with precise descriptions of weaponry; will appeal to Tom Clancy's readers\"   Booklist  for 'October's Ghost' \"Pearson delivers another riveting technothriller... Highly recommended\"   Library Journal  for 'October's Ghost' \"...chillingly prescient..down-to-the-wire suspense\"   Publishers Weekly  for 'Capitol Punishment' \"Action-packed and fast-paced... Keeps the reader flipping pages frantically\"   Library Journal  for 'Simple Simon' \"Excellent entertainment from first page to last\"   Booklist  for 'Simple Simon' \"Aerodynamic prose and superb pacing... A one-sitting book that will make the hours fly by\"   Publishers Weekly  for 'Simple Simon' \"An interesting twist on the serial-killer thriller\"   Publishers Weekly  for 'Top Ten' __________________________________________________  With a destitute childhood and the tragic loss of his parents a distant but constant memory, Jay Grady has come to Wall Street to make a name, and a fortune, for himself. But the success he'd imagined is frustratingly elusive.Until he meets the bum. An enigmatic transient who occupies a Manhattan corner, offering puzzling morsels of wisdom on a sign he changes daily. Drawn to the bum one day by a familiar snippet on his sign, Jay gives the man some spare change.What he gets in return shakes him to his core.Suddenly gifted with some power of prescience, Jay becomes the darling of Wall Street, picking winning stocks as if he can glimpse the future.Or shape it.But the dark side of this gift reveals itself as a curse when Jay tries to turn away from what he's been given, leading the bum to reach into his life with murderous results. Running from the horrific reality that his power now unleashes, Jay finds his flight coming full circle as he must face the man, the thing, that set him on this path.",
  "genres": [
    "Fiction",
    "Horror",
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Paranormal"
  ],
  "author": "Ryne Douglas Pearson",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/9276669-the-donzerly-light"
}