{
  "title": "The Complete Handbook Of Novel Writing: Everything You Need to Know About Creating & Selling Your Work",
  "description": "Get advice from the best in the business on every part of the novel writing and publishing process! In \"The Complete Handbook of Novel Writing, 2nd Edition,\" you'll learn from the invaluable advice of established writers. Discover new ways to generate ideas, implement intriguing techniques, and find the inspiration you need to finish your work. This fully-revised edition includes a revamped marketing section that covers the unique challenges of today's publishing market and the boundless opportunities of online promotion.Inside you'll find expert advice from dozens of bestselling authors and publishing professionals on how Master the elements of fiction, from plot and characters to dialogue and point of viewDevelop a unique voice and sensibility in your writingManage the practical aspects of writing, from overcoming writer's block to revising your workDetermine what elements your story needs to succeed in a particular genre - science fiction, fantasy, mystery, suspense, inspirational, romance (mainstream and Christian), or historical fictionFind an agent, market your work, and get published - or self-publish - successfullyYou'll also find interviews with some of the world's finest writers, including Margaret Atwood, Tom Clancy, Brock Clarke, Cory Doctorow, Dave Eggers, Elizabeth George, Jerry Jenkins, Stephen King, Megan McCafferty, Audrey Niffenegger, Joyce Carol Oates, Chuck Palahniuk, James Patterson, Richard Russo, Anne Tyler, John Updike, and Kurt Vonnegut. Their words will provide you with the guidance and encouragement of your very own writing mentor.\"The Complete Handbook of Novel Writing\" is your one-stop resource for everything you need to know about the craft and business of creating a bestseller.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "How To",
    "Self Help",
    "Crafts",
    "Business"
  ],
  "author": "The Writer's Digest",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/9282386-the-complete-handbook-of-novel-writing"
}