{
  "title": "Masters Of Deceit: The Story Of Communism In America And How To Fight It",
  "description": "\"\"Masters of The Story of Communism in America and How to Fight It\"\" is a non-fiction book written by J. Edgar Hoover, the first director of the Federal Bureau of Investigation (FBI). The book was published in 1958 and provides a detailed account of the history and tactics of communism in the United States. Hoover argues that communism is a dangerous ideology that seeks to undermine American values and institutions, and he outlines the ways in which the Communist Party has infiltrated American society. The book covers a range of topics, including the origins of communism, the rise of the Communist Party in America, and the tactics used by communists to spread their ideology. Hoover also describes the ways in which the FBI has been working to combat communism and protect American democracy. Throughout the book, Hoover emphasizes the importance of vigilance and education in the fight against communism. He argues that Americans must be aware of the dangers of communism and must work to counter its influence in all areas of society. The book includes a number of practical suggestions for how individuals and organizations can take action to fight communism, including supporting anti-communist legislation and exposing communist propaganda. Overall, \"\"Masters of Deceit\"\" is a comprehensive and detailed account of the threat posed by communism in America. While some of the book's arguments and tactics may be controversial, it remains an important historical document that sheds light on a critical period in American Who is Your Enemy? How Communism Began; The Communist Appeal in the U.S.; Life in the Party; The Communist Trojan Horse in Action; The Communist Underground; Bibliography of Major Communist Classics.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Cult Classics",
    "Political Science",
    "American History",
    "Biography"
  ],
  "author": "J. Edgar Hoover",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/928010.Masters_Of_Deceit"
}