{
  "title": "العروبة والقرن الحادي والعشرين",
  "description": "نبذة النيل والفرات:يوّثق هذا الكتاب أوراق أعمال المؤتمر الذي عقد في بيروت في الفترة ما بين 25 و28 شباط/فبراير من العام الحالي 2009، وكان تحت عنوان: \"مستقبل للعروبة في القرن الحادي والعشرين\". مجموعة من المفكرين والباحثين المختصين تولوا أعمال هذا المؤتمر الهام الذي انصبّ اهتمامه، انطلاقاً من مفهوم العروبة، على العديد من المسائل الفكرية والقضايا السياسية والاجتماعية الحالية، المطروحة على بساط البحث، والتي تطال مختلف جوانب مجتمعاتنا العربية.يظهر البيان الختامي لأعمال هذا المؤتمر \"مدى التطور الذي لحق بالفكر العربي المعاصر في نظرته ومراجعاته لحصيلة تجاربه ونظرياته السابقة، ما يعدّ بمثابة \"نقلة نوعية\" على المستوى التنظيري العام... ويبقى التطبيق العملي رهناً بتوجهات القائمين على رسم السياسات..\".بعد التقديم الذي يبرز أهمية المؤتمر في وقت باتت فيه \"هويتنا العربية تواجه خطراً محدقاً، ليس بنتيجة التشرذم والانقسام السياسي في بلداننا العربية، فحسب، ذلك أن الخلافات التي تنشب في البيت الواحد والأمة الواحدة من شأنها أن تضرب مناعة شعوبنا وقدرتها على التماسك والصمود\"، وبعد التمهيد الذي جاء تحت عنوان: \"مستقبل العروبة وعروبة المستقبل\"، والذي يبرز أهمية موضوع المؤتمر وأوراقه وأبحاث مفكريه، تقسّم المواد على خمسة محاور.المحور الأول ويبحث في موضوع \"العروبة موضوعاً للجدل السياسي\"، وفي \"تساؤلات الهوية في التجربتين العربية والغربية\"، ويتضمن شرح المفهوم الفرنسي لمسائل كالهوية القومية والدولة والأمة، ولمفهوم القومية الألمانية، وللعروبة في المرحلة الراديكالية.في المحور الثاني \"العروبة وتحولاتها في الفكر العربي المعاصر\"، يتطرق البحث إلى تحولات الخطاب القومي المعاصر، وموضوع إيديولوجيات العروبة في ظل صعود التيارات الدينية، كما يتطرق إلى مفهوم العروبة من منظار تاريخ الهوية ومعضلات القومية.أما المحور الثالث الأكثر إسهاباً، فيتحدث عن العروبة في الصيغة اللبنانية وتحولاتها في ظل البيئة الإقليمية والدولية المتغيرة، وفيه سبعة أوراق مفصّلة لسبعة من المفكرين الكبار، تضيء جوانب هذا الموضوع الشائك.يطرح المحور الرابع جدلا في العروبة والمواطنة، ويطال قضايا الديمقراطية وحقوق الإنسان لدى العرب بشكل عام، وفي الفكر العربي المعاصر الذي يتخذ التيارات المصرية نموذجاً، ومن ثم إشكاليات الوضع في العراق على هذا المستوى، كما يطال مسألة الأقليات في الوطن العربي. في المحور الأخير يجمع الكتاب ثلاثة أوراق من أوراق المؤتمر، تتناول \"مستقبل العروبة في القرن الحادي والعشرين\".يختم الكتاب بالبيان الختامي للمؤتمر، ومما جاء فيه: \"تطلع المؤتمر إلى تجديد فكرة العروبة أصلاً، بروح نقدية لرؤى الماضي، وأحوال الحاضر، تطلعاً إلى تصورات مستقبيلة\"، و\"يمكن القول أن نسيج الأمة العربية يتكّون من وحدة اللغة، والتراث والذاكرة التاريخية للنضال في سبيل الاستقلال، والوحدة، والنضال ضد الاستعمار\"، وقد خرج بمجموعة من التوصيات العامة الهامة، وبدعوة إلى العمل على ضوء ما توصل إليه الفكر الواعي والمثقف، وبعهد بالمتابعة على نفس النهج \"بوسائل شتى\".",
  "genres": [],
  "author": "برهان غليون",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/9292839"
}