{
  "title": "Blood Moon",
  "description": "Fugitive shifter, Aria Legreve, is always on the run. With her own life at risk, she helps a badly beaten shifter to his Pack, knowing the danger her meddling entails. Hoping to use her status as an Outcast and be set free, her world changes when she meets head on with no other than her Mate—who is dead.Alpha Lukas MacLeod has been searching for his wife for the past year, until Aria walks straight into his lair. Fate intervenes and gives them a second chance. Caught up in an intricate web of lies and prophecies in the making for generations, Aria and Lukas must discover a way to balance the darkness in their world, but will their love be strong enough to save their pack and each other?“What kind of torture is this? You’re dead.”The muscles of his throat worked, but no sound emerged. Behind him, Thaddeus winked and gave her a smug smile.“So are you.”Oh dear God, even his voice was the same! The warmth in the deep rumble broke her tenuous control. Tearing her gaze from his, she pressed a hand over her mouth and pulled her knees to her chest. Perhaps if she held herself tightly enough, she wouldn’t splinter.She took small, frantic sips of air, attempting to hold back the sobs pushing out of her throat. A low keening noise, high-pitched and slightly mad, warbled through the room. On some level, she knew it emanated from her, but she spent her energy on making herself small. Her fingernails bit into her jeans. The gaping wound where her heart had been patched over so many times after Lukas’ death, ruptured. Her soul bled, and each ragged breath she heard him draw clawed the hole wider.The whole room seemed to be consumed by Lukas’ presence. Escape was impossible, and she knew it, even as she searched for an exit. She had to get out. If she didn’t, there wouldn’t be anything left to save.Lukas moved across the room, crouched in front of her, his hands on either side of the chair. His mismatched, unearthly stare met hers, but she couldn’t make the tears stop.“Leave us.”It wasn’t right. His voice both soothed and tore at her frayed nerves. The others moved from the room. Her opportunity to run passed as they pulled the door closed with a soft click. She couldn’t have torn her gaze from Lukas if her life depended on it. Hesitantly, as if he too were afraid, he smoothed one calloused hand over her cheek, thumbing away the wetness. At his touch, her whole body jerked like she’d been struck. Every place his fingers touched tingled, and warmth began to shimmer in her soul.“I need to hear you say the words. Are you Aria Lagreve?”She drew a deep shuddering breath, captured his hand against her face and rubbed her cheek over the palm. “No.”Pain and anger flared in his eyes. His features hardened, and he tried to pull his hand away. She stopped him, reaching out with one shaking digit to trace the scar along his cheek.“When you died, I was Aria MacLeod.”* * * * * * * * * * *About the Keener is a high school teacher by day and writer by night. She lives in rural Virginia with one cat and enjoys long walks on the beach, good books, and big drinks with little umbrellas.",
  "genres": [
    "Paranormal Romance",
    "Shapeshifters",
    "Paranormal",
    "Werewolves"
  ],
  "author": "Ellen Keener",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/9293840-blood-moon"
}