{
  "title": "Rudyard Kipling's Tales of Horror & Fantasy by Rudyard Kipling",
  "description": "\"Rudyard Kipling is one of the finest writers of fantasy in the last one hundred years.\"-Ray Bradbury\"Kipling has seen a perfect Odyssey of strange experiences.\"-Andrew LangThis volume collects many of the Nobel Prize-winning writer's fantastical pieces ranging from traditional ghost stories to works of psychological horror.Rudyard Kipling (1865-1936) was born in Bombay, India, but was raised in England until he returned to India in 1881 as a journalist. In 1907, Kipling became the first English writer to win the Nobel Prize in Literature. He is best known for The Jungle Book (1894), Kim (1902), and Just So Stories (1902), which are renowned throughout the world.Includes:The vampireThe dream of Duncan ParrennessThe city of dreadful nightAn Indian ghost story in EnglandThe phantom 'rickshawThe strange ride of Morrowbie JukesThe unlimited draw of Tick BoileauIn the house of SuddhooThe Bisara of PooreeHaunted subalternsBy word of mouthThe recurring smashThe dreitarbundBubbling well roadThe sending of Dana DaMy own true ghost storySleipner, late ThurindaThe man who would be kingThe solid muldoonBaboo Mookerji's undertakingThe jokerThe wandering JewThe courting of Dinah ShaddThe mark of the beastAt the end of the passageThe recrudescence of ImrayThe finances of the godsThe finest story in the worldChildren of the zodiacThe lost legionA matter of factThe bridge-buildersThe brushwood boyThe tomb of his ancestorsWireless\"They\"With the night mail : a story of 2000 ADThe house surgeonThe knife and the naked chalkIn the same boatAs easy as A.B.C.: a tale of 2150 ADSwept and garnishedMary PostgateThe village that voted the earth was flatA madonna of the trenchesThe wish houseThe gardenerThe eye of AllahOn the gate: a tale of '16The appeal",
  "genres": [
    "Horror",
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Classics",
    "Literature",
    "Supernatural"
  ],
  "author": "Rudyard Kipling",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/9293886-rudyard-kipling-s-tales-of-horror-fantasy-by-rudyard-kipling"
}