{
  "title": "Personal Velocity",
  "description": "A Washington Post Best Book of 2001, Rebecca Miller's powerful debut, Personal Velocity, is the basis for her Sundance Festival award-winning film by the same name. Acclaimed by The New York Times as \"the work of a talented and highly visual writer,\" the vibrantly fresh and lustrous stories in Miller's collection explore the multifaceted lives of women in seven arresting portraits. From within the secret self of each character we see the surprising shape of her life created as she hurtles through it. Modern and diverse, these women of different classes and ages struggle with sexuality, fate, motherhood, infidelity, desperation, and an overriding will to survive. We meet Greta, a cookbook editor who is chosen by Tavi, the hottest writer of his generation, to edit his new book. The book becomes a best-seller and Greta is propelled out of her marriage by her own ambition and success. The story, however, ends with a poignant flashback to the moment when one morning Greta realizes that ambition has grabbed her as she looks down at her kind, lackluster husband's wing-tip shoes. She suddenly knows she is leaving him and that their marriage is effectively over. Other characters include Paula, a pregnant twenty-one-year-old, who is on the run from the horror of a man who was hit by a car and died walking her home from a club the night before; Delia, an abused, working-class wife who goes into hiding with her children; and Louisa, a painter who moves rapidly from one lover to the next, acting out a self-perpetuating drama over which she has no control. Edgy, fearless, and beautifully spare, Personal Velocity marks the emergence of a singular new voice in American fiction.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Contemporary",
    "Novels",
    "Coming Of Age",
    "The United States Of America",
    "Media Tie In"
  ],
  "author": "Rebecca Miller",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/929004.Personal_Velocity"
}