{
  "title": "Rapunzel and Other Maiden in the Tower Tales From Around the World: Fairy Tales, Myths, Legends and Other Tales About Maidens in Towers",
  "description": "A Unique Collection of Fairy Tales, Myths, Legends and Other Tales About Maidens in Towers RAPUNZEL. Just the name conjures up images of long golden hair and tall stone towers. She remains part of our popular culture thanks to countless children's books, as well as advertising, movies, and merchandise. Rapunzel, far from falling into historical obscurity, is very much a part of modern culture. However, she is far from the only maiden in a tower to be found in folklore. Her tale and those of other imprisoned women reach back hundreds of years and come from many cultures from around the world. This anthology of tales offers several stories similar to Rapunzel. A few better resemble the tale of Maid Maleen, another imprisoned daughter. Most are tales of other imprisoned maidens, princesses, and wives from around the world. Not all of the women are kept in literal towers, some are entombed instead, but all are unwilling captives. They are imprisoned by their parents for their own safety, as punishment, or to guard their virtue. Wives are imprisoned by jealous husbands hoping to avoid cuckolding. A few women are political prisoners. A surprising number of the tales come from France where tower prisons were popular devices of the French salon authors, especially Madame d'Aulnoy. This collection contains over fifty tales and stories--some well-known, some almost forgotten--reaching back to ancient myths and moving forward to recent centuries. Also included are two tales newly translated into English from the original French, \"Persinette\" and \"Parsillette,\" the latter a rare variant of the tale with an unusual ending. Whether you are a student of folklore or an armchair enthusiast, this anthology offers a diverse array of tales with a unifying theme that both entertains and educates, all gathered for the first time in one helpful collection.",
  "genres": [
    "Fairy Tales",
    "Research",
    "Reference"
  ],
  "author": "Heidi Anne Heiner",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/9301813-rapunzel-and-other-maiden-in-the-tower-tales-from-around-the-world"
}