{
  "title": "A Storyteller in Zion",
  "description": "Award-winning science-fiction writer Orson Scott Card candidly admits that he is no scholar and that his role in the Church gives him no special claim to inspiration for the body of the Saints. And yet, in A Storyteller in Zion, Card uses his unique perspective as a storyteller to provide readers with a priceless collection of insights and wisdom, defining and strengthening the community of Saints as they seek to build Zion.Broad in scope and deeply relevant to all Latter-day Saints, this volume includes speeches and essays on such topics as the complexity and internal integrity of the Book of Mormon as a story, the importance of moral storytelling, the role of the artist in Mormon society, and the importance of creating Zion, first in the hearts of the Latter-day Saints and then in their communities. Fundamental to all his writings is Card's belief that LDS storytellers, artists, and other members must learn to put the Lord first and avoid the temptation to become \"assimilationists\" who \"long to reconcile the world and the Church by changing the Church to fit the world.\" Instead, Card argues, as the Saints begin to establish Zion among themselves, the good people of the world will be drawn to assimilate with them and accept the laws of the Lord.\"There's a chance,\" writes Card regarding his hopes for this book, \"that when I speak the truth I've learned in my limited experience, there will be readers who have been waiting to hear it in the way I've learned to say it.\" All such readers will find a wealth of important, edifying insights in A Storyteller in Zion.The coming of the nonmembers --The Book of Mormon : artifact or artifice? --Sunday meetings : a preparation for work --Family art --The problem of evil in fiction --On art, morals, and morality --Art as an act of charity --Sermons in critical form --Walking the tightrope --Prophets and assimilationists --Science fiction and the Mormon religion --Consecration : a law we can live with --Eugene England and the lighted lamp --The hypocrites of homosexuality --Living in Zion",
  "genres": [
    "Nonfiction",
    "Lds",
    "Religion",
    "Writing",
    "Church",
    "Mormonism",
    "Literature"
  ],
  "author": "Orson Scott Card",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/92975.A_Storyteller_in_Zion"
}