{
  "title": "Sleeping Beauties: Sleeping Beauty and Snow White Tales From Around the World",
  "description": "Sleeping Beauty and Snow White are two of the most popular fairy tales of all time and have intrigued readers for centuries. Both have been retold continuously in modern times in novels, poetry, plays, movies and more. Both have also been criticized for their apparently passive and occasionally foolish heroines. Despite first impressions, the stories and their many variants are filled with female characters, good and evil, active and passive. Whatever your view of either tale, it is fascinating to study their histories and explore why they have resonated with our ancestors as well as our own generations. In all the tales, whether the sleep is enchanted with a time limit or intended to be a permanent death, it is ultimately overcome, sometimes through accidental means and other times through heroic methods. With motivations ranging from petty offenses to overwhelming bouts of jealousy, the tales also present interesting villains.Offering over seventy stories, this collection compiles several variants of Sleeping Beauty and Snow White tales from around the world, some dating back to Greek myths and others to medieval times. Many of the tales are new translations, a few appearing for the first time in English. At times the stories are obviously related to each other and at other times the relationship is tenuous. Some additional stories with sleeping heroines, as well as heroes, are also presented although they are not strictly classified as Sleeping Beauty or Snow White tales. Whether you are a student of folklore or an armchair enthusiast, this anthology offers a diverse array of tales with a unifying theme that both entertains and educates, all gathered for the first time in one helpful collection.",
  "genres": [
    "Fairy Tales",
    "Fantasy",
    "Short Stories",
    "Folklore",
    "Reference"
  ],
  "author": "Heidi Anne Heiner",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/9301809-sleeping-beauties"
}