{
  "title": "The Liberation of Max McTrue",
  "description": "For Max McTrue, life is not mysterious. He simply does what he’s told and that path has served him well, has been easy and free of conflict. He’s a good kid. 3.04 grade point average, plays football and baseball, has membership in a couple of school clubs. He’s not much of a blip on anyone’s radar, a fact he has wholly embraced for all of his seventeen years.Until one winter day when all that changes.That cold February 1st morning at Java Jewel, the café he works in before school, Max meets Clara Jane Ramsey. But Max doesn’t know any of this yet. In fact, he sees her only briefly and then goes to class where the only thing (he thinks) of interest is the fact that his student teacher in Senior English has opted not to wear a bra that day. Sitting in class, with three thick college application folders on the desk in front of him (college applications he has until five o’clock that day to mail), he sees Clara Jane out toward the baseball field, and for reasons he certainly cannot explain to himself, he raises his hand to ask for the pass, gathers his things, and joins her.Clara Jane is homeschooled and her family is on the last day of their motor-home stop through the small foothill town where Max lives. Max spends the day with Clara Jane and along the way, Clara Jane meets Emerson, Max’s best friend who is on Home Hospital for her allergies, has perfect SAT scores, and drives a converted ice cream truck that holds her archery equipment and a portable reading library of used titles. And then there’s Darcy, Max’s on again off again – he’s never quite sure – girlfriend, who puts a slight crimp in the clearly romantic tension that has been building.Clara Jane and Max explore each other’s own longings and trappings and ideas. About what it means to learn, what it means to love something, and what it means to seek something. Eventually, the three packets Max has been hauling around become an issue. Why doesn’t he just send them?",
  "genres": [
    "Young Adult",
    "Contemporary"
  ],
  "author": "Kim Culbertson",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/13181001-the-liberation-of-max-mctrue"
}