{
  "title": "Callsign: Deep Blue (Tom Duncan)",
  "description": "Tom Duncan— Deep Blue, former Army ranger, former president of the United States and handler of the black ops force known as Chess Team, is visiting the team’s new secret headquarters. The underground facility, known as Alpha, once belonged to Manifold Genetics, a corrupt corporation shut down by Chess Team. But despite being abandoned for years, Alpha still hides secrets. Security doors slam shut and lock, sealing Duncan and his assistants inside. As Matt Carrack, the leader of Duncan’s security team, attempts to gain access, Duncan discovers they are not alone inside the abandoned facility. High tech intruders have infiltrated the base, their goal unknown. But a far greater threat rises from the subterranean depths beneath Alpha—failed regenerative experiments from the days of Manifold, and they’re fast, hostile and hungry. While the security team are beset by ingenious death traps, determined mercenaries and vicious creatures that defy their imaginations, Duncan and his personal bodyguard must battle the growing tide of creatures, stave off the incursion of enemy forces and prevent the violent intruders from releasing the horror currently contained inside Alpha, to an unsuspecting outside world. And as the battle rages, a bomb quietly counts down in the shadows. Deep Blue was the seventh in a series of Chess Team novellas released in 2011. Each of the eight books in the series—deemed the ‘Chesspocalypse’—follows a single member of the team and is co-authored by Jeremy Robinson and one of six other fantastic authors. The stories take place after the events of Threshold, the third Jack Sigler thriller, and before the events of Ragnarok, the fourth full-length novel in the series. The Chesspocalypse novellas are designed to introduce readers to the series. If you haven’t read the novels, no worries. Enjoy the ride! Praise for Robinson “Rocket-boosted action, brilliant speculation, and the recreation of a horror out of the mythologic past, all seamlessly blend into a rollercoaster ride of suspense and adventure.” —James Rollins, New York Times bestselling author of The Eye of God “With Threshold Jeremy Robinson goes pedal to the metal into very dark territory. Fast-paced, action-packed and wonderfully creepy! Highly recommended!” —Jonathan Maberry, New York Times bestselling author of Rot & Ruin “Jeremy Robinson is the next James Rollins” —Chris Kuzneski, New York Times bestselling author of The Einstein Pursuit “If you like thrillers original, unpredictable and chock-full of action, you are going to love Jeremy Robinson...” —Stephen Coonts, New York Times bestselling author of Pirate Alley “How do you find an original story idea in the crowded action-thriller genre? Two Jeremy Robinson.” —Scott Sigler, New York Times bestselling author of Pandemic “There’s nothing timid about Robinson as he drops his readers off the cliff without a parachute and somehow manages to catch us an inch or two from doom.” —Jeff Long, New York Times bestselling author of The Descent Praise for Gilmour “Resurrect is high adventure in the grand tradition, with a brash hero, relentless villains, beautiful women, and breathtaking locales from the Himalaya to Hong Kong. It is as addictive as hot buttered popcorn—you’ll keep coming back for more.” —Stephen M.",
  "genres": [
    "Thriller",
    "Fiction",
    "Action",
    "Adventure",
    "Science Fiction",
    "Military Fiction",
    "Novella"
  ],
  "author": "Jeremy Robinson",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/13180815-callsign"
}