{
  "title": "House of Silver Magic",
  "description": "The author of Wizards , The Spellbinder & Inspector Monde does it again.THE FAMILY :Mandy - eldest daughter of the recently deceased James Grange.William - her annoyingly clever younger brother.Jenny - her pre-teen sister.Eleanor - their mother.THE HOUSE Glass - silver and mercury girl, war leader of the Dees.Hat - A living hat stand who steals back what the guests thieve.Mower - guards the grounds.Pipes - made of the pipes and power lines in the house with control of them.Windy - a stained glass boy who guards the front of the house.Mrs Tub - Their leader and heart of the house.THE Mrs Constance - uses magic to control people.Pettigrew Blane - Can open any lock.Bert - likes to kill slowly with his knife, but mostly likes to kill.The Brother's Grimm - two hit men who stick exactly to their contract and think nothing of killing children.THE Save the neighbours from Mrs Constance and Bert.Protect the house and the mysterious SOURCE that generates all the magic in the world.Short ExcerptGlass appeared in the middle of the cellar and the two men opened fire. Holding their triggers down their weapons pumped forty bullets straight into her. Glass seemed unaffected by the shells, not even flinching as they hit her. She walked slowly up to the brothers and blew towards them. The bullets flew out of her mouth and bounced off the men's faces. S and M shuddered under the onslaught, putting their arms up to protect themselves.\"You're under my control and will do exactly what I say,\" Mrs. Constance ordered. Glass turned and stepped towards her.\"You killed Windy. Would you like to taste death?\" Glass asked in a whisper.Mrs. Constance had no idea what this mirror creature was talking about, but then she had killed so many people it was often difficult to remember all their names.Book #2 Sapphire Breaking Glass &Book #3 Gold Terror in Mind are now available on Kindle",
  "genres": [
    "Fantasy",
    "Magic"
  ],
  "author": "John Booth",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/13180746-house-of-silver-magic"
}