{
  "title": "Crossing Three Wildernesses",
  "description": "In a harrowing but ultimately triumphant affirmation of the human spirit, celebrated Cambodian poet U Sam Oeur narrates his incredible life story, testifies to the horrors of genocide and shares his fervent prayers for peace and freedom through the process of democracy.Born in 1936 to a large and moderately prosperous farming family, Oeur spent his childhood herding water buffalo and tending rice paddies in the lush Cambodian countryside. He was educated under the French colonial system and selected to attend California State University in Los Angeles. While in the United States, he awakened to the possibilities of the democratic ideal and went on to receive his MFA from the Iowa Writers’ Workshop.Upon returning to Cambodia in 1968, Oeur married, became a captain in Lon Nol’s army, served in the National Assembly and was part of the Cambodian delegation to the United Nations. When Pol Pot assumed power in 1975, Oeur, having vowed to help establish democracy in Cambodia and unaware of the events ahead, elected to stay. Driven out of Phnom Phen with millions of the city’s residents, Oeur, along with his wife and son, miraculously survived the killing fields, feigning illiteracy and relying upon the skills he had learned as a child to endure six forced-labor camps over the next four years. Millions, however, died during the Khmer Rouge regime, including Oeur’s twin daughters.Crossing Three Wildernesses is a personal account of survival, an astute political analysis and a beautiful illustration of the Cambodian culture—its people, myths and traditions. In a world still plagued by genocide and terror, this remarkable memoir is a moving call to freedom and a passionate plea for peace.A devout Buddhist, U Sam Oeur is the author of the bilingual collection of poems Sacred Vows. He lives in Texas, where he continues to translate the poems of Walt Whitman into Khmer.",
  "genres": [
    "Nonfiction",
    "History",
    "Autobiography"
  ],
  "author": "U Sam Oeur",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/930146.Crossing_Three_Wildernesses"
}