{
  "title": "Mary Tudor: Princess, Bastard, Queen",
  "description": "She was the first woman to inherit the throne of England, a key player in one of Britain’s stormiest eras, and a leader whose unwavering faith and swift retribution earned her the nickname “Bloody Mary.” Now, in this impassioned and absorbing debut, historian Anna Whitelock offers a modern perspective on Mary Tudor and sets the record straight once and for all on one of history’s most compelling and maligned rulers.    Though often overshadowed by her long-reigning sister, Elizabeth I, Mary lived a life full of defiance, despair, and triumph. Born the daughter of the notorious King Henry VIII and the Spanish Katherine of Aragon, young Mary was a princess in every sense of the word—schooled in regal customs, educated by the best scholars, coveted by European royalty, and betrothed before she had reached the age of three. Yet in a decade’s time, in the wake of King Henry’s break with the pope, she was declared a bastard, disinherited, and demoted from “princess” to “lady.” Ever her deeply devout mother’s daughter, Mary refused to accept her new status or to recognize Henry’s new wife, Anne Boleyn, as queen. The fallout with her father and his counselors nearly destroyed the teenage Mary, who faced imprisonment and even death. It would be an outright battle for Mary to work herself back into the king’s favor, claim her rightful place in the Tudor line, and ultimately become queen of England, but her coronation would not end her struggles. She flouted the opposition and married Philip of Spain, sought to restore Catholicism to the nation, and fiercely punished the resistance. But beneath her brave and regal exterior was a dependent woman prone to anxiety, whose private traumas of phantom pregnancies, debilitating illnesses, and unrequited love played out in the public glare of the fickle court.     Anna Whitelock, an acclaimed young British historian, chronicles this unique woman’s life from her beginnings as a heralded princess to her rivalry with her sister to her ascent as ruler. In brilliant detail, Whitelock reveals that Mary Tudor was not the weak-willed failure as so often rendered by traditional narratives but a complex figure of immense courage, determination, and humanity.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Tudor Period",
    "Historical",
    "British Literature",
    "European History"
  ],
  "author": "Anna Whitelock",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/9305792-mary-tudor"
}