{
  "title": "Shenanigans!",
  "description": "Benjamin “Benji” Palko is just trying to get by, to fly under life’s radar. But random events keep happening to him and to those he cares about most that make him question what he thinks he knows along the way.In this collectio(novel)la, Ben gets entangled in a strange and humiliating coffee debacle that results in a trip to the Emergency Room. He has a standoff with his dog over a routine toenail trimming. A bike ride in the Rocky Mountains turns into a learning experience is dressing climate appropriate. Ben’s nunchucks-wielding neighbor provides an odd sense of calm in the wake of a rash of home invasions.\"The voice in Shenanigans! is muscular, rhythmic, and full of whizz-bang linguistic energy. The stories view the world with the kind of self-deprecating humor that makes you want to spend an afternoon just wandering around in Benjamin’s mind. Read Shenanigans! You’ll laugh, you’ll think…you’ll have a great time.\" -- Amy Hassinger, author of Nina Adolescence“Shenanigans! is the textual photo-album of Anna and Ben, language made to Polaroid the gentle tangle of coupling and maturation. This is a collection wonderfully tinged with humor, beautifully tempered with landscape, and soaked in the genuine.”– J. A. Tyler, author of Girl With Oars & Man Dying\"The charm of Joseph Michael Owens's debut collection, Shenanigans! can be found in his voice. At heart, these are a young man‟s stories of love and loss, of life and death. There‟s a sincerity that flirts with retro yet feels like innovation. Each one reads like a conversation … unscathed by the unsentimental tone that too often passes for hipness in this day and age, yet clearly of his own time. These are honest stories.\" – Karen Gettert Shoemaker author of Night Sounds and Other Stories\"Between Hunter S. Thompson and David Foster Wallace‟s essays, Joseph Owens‟s stories will take you through a caffeinated romp through his life, its exciting highs and frightening lows. Dogs, horses, bicycles come alive with as much love and empathy as the people he holds dear. Owens's voice, spirited, crackling with energy, is too fierce, and engaging to be ignored.\" – Catherine Texier, author of Russian Lessons, The Breakup\nArt Faccia\n interview with Joseph Michael Owens: http://artfaccia.com/post/21864318201...",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "Joseph Michael Owens",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/13181961-shenanigans"
}