{
  "title": "The Manuscript Found in Saragossa",
  "description": "Originally published in Polish [as Rękopis Znaleziony w Saragossie, 1847], later translated into French as Manuscrit trouvé à Saragosse, the work is a supposed translation of a manuscript from the time of the Napoleonic Wars which depicts events several decades earlier. As for the plot - the plot! The Manuscript Found in Saragossa collects intertwining stories, all of them set in whole or in part in Spain, with a large and colorful cast of Gypsies, thieves, inquisitors, a cabbalist, a geometer, the cabbalist's beautiful sister, two Moorish princesses (Emina and Zibelda), and others.Alphonse, a young Walloon officer is travelling to join his regiment in Madrid in 1739. But he soon finds himself mysteriously detained at a highway inn in the strange and varied company of these thieves, brigands, cabbalists, noblemen, coquettes and gypsies. He records their stories over sixty-six days. The resulting manuscript is discovered some forty years later in a sealed casket, from which the tales of the characters, transformed through disguise, magic and illusion, of honour and cowardice, of hauntings and seductions, leap forth to create a vibrant polyphony of human voices. The novel's stories quickly overshadow van Worden's frame story. The bulk of the stories revolve around the Gypsy chief Avadoro, whose story becomes a frame story itself. Eventually the narrative focus moves again toward van Worden's frame story and a conspiracy involving an underground - or perhaps entirely hallucinated - Muslim society, revealing the connections and correspondences between the hundred or so stories told over the novel's sixty-six days. Jan Potocki (1761-1812) used a range of literary styles - gothic, picaresque, adventure, pastoral, erotica - in his novel of stories-within-stories - which provides entertainment on an epic scale. The stories cover a wide range of genres and as a whole the novel reflects Potocki's far-ranging interests, especially his deep fascination with secret societies, the supernatural, and \"Oriental\" cultures. These \"stories-within-stories\" sometimes reach several levels of depth, and characters and themes - a few prominent themes being honor, disguise, metamorphosis, and conspiracy - recur and change shape throughout. Because of its rich and varied interlocking structure, the novel echoes favorable comparison to many celebrated literary antecedents such as the ancient BCE Jatakas and Panchatantra as well as the medieval Arabian Nights and Decameron.",
  "genres": [
    "Fiction",
    "Classics",
    "Fantasy",
    "Gothic",
    "Polish Literature",
    "Horror",
    "Poland"
  ],
  "author": "Jan Potocki",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/93180.The_Manuscript_Found_in_Saragossa"
}