{
  "title": "The Oatman Girls: The Capture & Captivity of Two Young American Women in the 1850s by the Apache Indians",
  "description": "The story of the Oatman girls, Olive and Mary Ann, is one of the most famous accounts of the abduction of white women by indigenous Indians in the annals of the history of the American western frontier. The Oatman's, led by their patriarch Royce, were a family of nine. Members of the Mormon faith, they had become dissenters of Brigham Young's leadership and allying themselves with James Brewster and his 'Brewsterites' resolved to move to California in 1850. The original substantial wagon-train they had formed for security split as a result of disagreements within the party and the group to which the Oatman's belonged further fragmented until the family were left travelling alone, against all advice, in hostile Indian territory. On the banks of the Gila River (in present day Arizona) the family were attacked by Indians and all were slaughtered with the exception of two girls, aged 13 and 7 years, who were abducted and a brother. Their brother Lorenzo was felled by a club blow, presumed dead by the assailants, and left among the corpses of his mother, father and siblings, but he regained consciousness and eventually found his way to safety. The girl's captors, Tolkepayas or Yavapais, kept the girls in slavery for a period then sold them to Mohave Apaches. The story of the ordeals of the Oatman girls has inspired fiction and works of history alike. Olive Oatman's face, with its distinctive tattoo has all but become a western icon. Written during the 1850s this book became a bestseller of its day. This Leonaur edition is available in in softcover and hardback with dustjacket or collectors.",
  "genres": [
    "History",
    "Nonfiction",
    "Native American",
    "Biography",
    "American History",
    "Native Americans",
    "Westerns"
  ],
  "author": "Royal B. Stratton",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/13182669-the-oatman-girls"
}