{
  "title": "The Adventures of Buckaroo Banzai Across the Eighth Dimension",
  "description": "\"I speak Spanish to God, French to women, English to men, and Japanese to my horse.\"—Buckaroo Banzai.Buckaroo Banzai. A strange, elusive figure, his name whispered in barrooms and boardrooms, his advice sought by pashas and presidents, his exploits recounted in movies, novels, and comic books that seem somehow more real than life itself.Buckaroo Banzai. First and foremost an extraordinary brain surgeon. In his spare time designer and driver of the electrifying Jet Car, a speed machine faster than sound! Buckaroo Banzai. A happy man whose life has been marked by great tragedy, who speaks a dozen languages and writes songs in all of them. His musical sidekicks the Hong Kong Cavaliers: Rawhide, Reno, the Swede, Perfect Tommy, Flyboy, Big Norse, Pecosóare, one of the toughest, most popular hard-rocking bar bands in east Texas. Join Team Banzai on their two-fisted, action-packed assault against the evil red Lectroids from Planet 10! Experience the horrors of the Shock Tower and the Pitt deep within the walls of Yoyodyne Propulsion Systems as Buckaroo Banzai fights against impossible odds to rescue Penny Priddy from the clutches of Dr. Emilio Lizardo, the diabolically alien dictator. Pray that Buckaroo will succeed, knowing only too well that if he fails the Earth itself will be blown to dust!For the first time in nearly twenty years, Pocket Books is proud to present The Adventures of Buckaroo Banzai. This special edition features a new introduction by the author and a color insert featuring photos and illustration seen here for the very first time!No matter where you go, there you are.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Adventure",
    "Science Fiction Fantasy",
    "Humor",
    "Media Tie In",
    "Speculative Fiction"
  ],
  "author": "Earl Mac Rauch",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/93233.The_Adventures_of_Buckaroo_Banzai_Across_the_Eighth_Dimension"
}