{
  "title": "How Opal Mehta Got Kissed, Got Wild, and Got a Life",
  "description": "Opal Mehta is a young woman with a laser focus: getting into Harvard. Since her birth, Amal and Meena Mehta have raised their only daughter with Harvard emblazoned on her pajamas, her walls, and her brain. Everything she does is meant to add up to the perfect Harvard application. There have been flowcharts, diagrams, and endless checklists. At seventeen, Opal is valedictorian, president of three honor societies, and founder of the Science Bowl team. She ven took welding classes to appear well-rounded. With SAT and AP scores to die for, getting in looks like a sure thing.Then, at her interview with Harvard’s Dean of Admissions, he sets aside her résumé and asks her the single question she never prepped for:“What do you like to do for fun?”For once, Opal is at a loss. The interview screeches to a nightmarish halt. The Dean says she still has a chance—but only if she can show that she is more than just another 4.0 GPA.And so the Mehtas turn their ingenuity and determination to a whole new plan: getting Opal a life. Dating, partying, and popularity are the new subjects of late-night cramming, and Opal’s study guides are now MTV and the WB, Vogue and InStyle. The girl who wore high-water cords and hung out with her cat for fun is now rocking Manolos, cutting class to shop with the queen bees, and winning the attention of her longtime lust object.But when Opal finally faces the Dean again—this time in a Diane von Furstenberg blouse and Theory pants—she is more confused than ever. Does lip gloss actually matter? Does life have to have a crimson theme? What—and whom—does she really love?For anyone who’s ever sweated a crisis, How Opal Mehta Got Kissed, Got Wild, and Got a Life is a hilarious and painfully real novel about family, love, and daring to push your life to the limit.",
  "genres": [
    "Fiction",
    "Young Adult",
    "Chick Lit",
    "Romance",
    "India",
    "Indian Literature",
    "Teen"
  ],
  "author": "Kaavya Viswanathan",
  "average_rating": "2.84",
  "url": "https://www.goodreads.com/book/show/93173.How_Opal_Mehta_Got_Kissed_Got_Wild_and_Got_a_Life"
}