{
  "title": "Physical Education",
  "description": "\"Physical Education takes an erotic peek at a school of sexual discovery with just a touch of danger to spice things up even more.\" --Joyfully ReviewedTired of boring sex and wanting to expand her pleasure, 24-year-old Amanda \"Mandi\" Wilkinson enrolls in summer school at San Francisco Sex University, an exclusive sex school located in the heart of San Francisco. What Mandi doesn't realize is that not all of the mysterious dropouts are simply flunking sex-ed.Reed McAllister came to Sex U. for reasons all his own. Undercover, he's searching for a woman, the right woman, and so far he doesn't have any leads. Reed never saw himself working at a place such as SFSU, let alone instructing, but he had to admit it - the job did come with its perks. When Mandi turns up on the missing list, will Reed be able to save her and give her the lessons she so desires?Looking for more HOT reads? Don't miss these great titles from Ravenous Romance!A Stranger's Desire by Cameo BrownSometimes good girls have to do naughty things to get what they want, and Miss Lilly Gillingham is no different. Stubborn and determined, she'll do anything to make sure her mentor, Miss Jennetta, receives a proper burial. So what if she has to have sex with the funeral director in a casket to make it happen?Pleasure 2035 by Cameo BrownIn the year 2035, a thousand-year-old vampire takes up a job as a gigolo, and a star nightclub performer disguises herself as a pleasure synth to escape her insane boyfriend in this hot sci-fi read!Running in Abandoned by Trinity BlacioJaycee Manz has finally found her mates. Among others of her kind, you would think she would be happy. But like everything else, achieving a dream often comes with a price. How can a person feel totally abandoned when surrounded twenty-four hours a day?Running in Ghost Warrior by Trinity BlacioNo matter what came her way, she’s always been a fighter. Yet, when Lissa learns she is mated to four men, she swears someone is out to get her! With war coming ever closer, can Lissa and her mates build their relationship while they keep each other safe?Running in Cupid's Venom by Trinity BlacioSix years of living in a cell sure can be hell on a girl. Not to mention the fact that Cecil was only sixteen years old when her family was taken away for scientific experiments. After escaping, all Cecil wanted to do was die, but the snake DNA that had been injected into her wouldn't let that happen - and neither will her mates.",
  "genres": [
    "Romance"
  ],
  "author": "Louisa Bacio",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/9318269-physical-education"
}