{
  "title": "Super Natural Every Day: Well-Loved Recipes from My Natural Foods Kitchen",
  "description": "HEIDI SWANSON'S approach to cooking whole, natural foods has earned her a global readership. From her Northern California kitchen, she introduced us to a less-processed world of cooking and eating through her award-winning blog, 101 Cookbooks, and in her James Beard Award–nominated cookbook, Super Natural Cooking, she taught us how to expand our pantries and integrate nutrient-rich superfoods into our diets. In Super Natural Every Day, Heidi helps us make nutritionally packed meals part of our daily repertoire by sharing a sumptuous collection of nearly 100 of her go-to recipes. These are the dishes that Heidi returns to again and again because they’re approachable, good for the body, and just plain delicious. This stylish cookbook is equal parts inspiration and instruction, showing us how to create a welcoming table filled with nourishing food for friends and family.  The seductively flavorful vegetarian recipes for breakfast, lunch, dinner, snacks, treats, and drinks are quick to the table but tasty enough to linger over. Grab a Millet Muffin or some flaky Yogurt Biscuits for breakfast on the go, or settle into a lazy Sunday morning with a stack of Multi-grain Pancakes and a steaming cup of Ginger Tea. A bowl of Summer Squash Soup or a couple of Chanterelle Tacos make for a light and healthy lunch, and for dinner, there’s Black Sesame Otsu, Pomegranate-Glazed Eggplant with Tempeh, or the aptly named Weeknight Curry. Heidi’s Rose Geranium Prosecco is the perfect start to a celebratory meal, and the Buttermilk Cake with fresh plums or Sweet Panzanella will satisfy even the most stubborn sweet tooth. Gorgeously illustrated with over 100 photos that showcase the engaging rhythms of Heidi’s culinary life and travels, Super Natural Every Day reveals the beauty of uncomplicated food prepared well and reflects a realistic yet gourmet approach to a healthy and sophisticated natural foods lifestyle.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference",
    "Nutrition",
    "Vegetarian"
  ],
  "author": "Heidi Swanson",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/9326166-super-natural-every-day"
}