{
  "title": "Jesus, King Arthur, and the Journey of the Grail: The Secrets of the Sun Kings",
  "description": "Reveals how the super-science of the sun and the higher orders of spirituality are concealed and contained in the Holy Grail• Connects the discovery of 4,000-year-old Celtic mummies in China with the transmission of this ancient knowledge• Documents the truth of the Holy Grail’s connection with King Arthur and Joseph of Arimathea• Confirms the pedigree of the Grail using secret information from the Mayan Pyramid of Inscriptions in Mexico and the Gateway of the Sun in PeruUsing the same knowledge that enabled him to break the codes of the Mayas, Peruvians, Egyptians, and Chinese, Maurice Cotterell now follows the migration of the Celts 4,000 years ago from Asia, across Europe, to Ireland. His account of this epic journey together with his knowledge of the secret codes of the Celts help him to identify and locate the Holy Grail, the actual cup used by Christ and his disciples at the Last Supper.The author explains the true story of the how it contains the secret super-science of the sun and the higher orders of spirituality; how it was carried to England by Joseph of Arimathea; how in A.D. 453 it was found by King Arthur, who engraved it with the same esoteric information found on the Pyramid of Inscriptions in Palenque, Mexico, and the Gateway of the Sun at Tiahuanaco in ancient Peru. His discoveries reveal that the Grail does actually radiate light, in accordance with the Arthurian legends, proving that the so-called legends are actually based on fact. The author goes on to show how the holy cup was passed for safekeeping to the monks of Lindisfarne, who copied the secrets of the Grail into the Lindisfarne Gospels and the Book of Kells. Fleeing from Viking raids, the monks carried their treasures to Ireland, explaining how the cup found its way to the Dublin Museum--where it rests today.",
  "genres": [],
  "author": "Maurice M. Cotterell",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/93289.Jesus_King_Arthur_and_the_Journey_of_the_Grail"
}