{
  "title": "Repeat After Me",
  "description": "When Repeat After Me was first published in the 1980's, it was a time when adult children of alcoholic families were coming out of the closet by the thousands. Until that time these were people who were silently making their way through adulthood not understanding why they were so unsatisfied and unhappy when \"everything seemed okay,\" or why some one thing, person or place \"was never enough.\" For many there was a chronic gnawing sense that something was missing. This great number of people happily took on the identity of being an ACA or ACOA (Adult Child of Alcoholic). They were grateful to have a framework in which to understand and conceptualize their experience. They had been given a language in which to voice their experiences. Yet what was true for this particular population could be generalized to people from other types of troubled families. They were from homes where there were abuses, other addictions, compulsive behaviors or mental illness - homes that for whatever the reasons were characterized by loss and shame. Repeat After Me was written in the spirit of offering all who were raised in troubled families a process of self-exploration, insight and healing that would lead to a positive change in their lives.As adults began that process of asking how their childhood was influencing their present day life, the intent was never one of blame but of insight and understanding. It has been the author's contention that we repeat the life scripts of our family as a result of internalized beliefs and behaviors that were either modeled for us or were a part of our survivorship. We cannot put a painful past history behind us without first owning it. It is not enough to say I came from an alcoholic family or an abusive family. We must go beyond that acknowledgment to see how our internalized beliefs and behaviors have shaped us to be the person we are today. With that in mind Repeat After Me was written.Repeat After Me is not a book that explains how problems come to be as much as it is a book that takes you through a process of letting go of hurtful beliefs and behaviors. While insight is often the precursor to change, insight alone is not enough for most people to create change. People need to believe they deserve positive change and they need to develop skills that make change occur. While many of the changes in this second edition of Repeat After Me are subtle, it is written to support the reader's belief in their personal worth and assist them in identifying and focusing on skills. The knowledge that comes in owning the past and connecting it to the present is vital to developing empathy for the strength of both our defenses and skills. It also helps us to lessen our shame and not hold ourselves accountable for the pain we have carried. When we understand the reasons for why we have lived our life as we have, that understanding fuels our ongoing healing. The change we want to create in our life is made most directly as a result of letting go of old, hurtful belief systems and learning new skills. Repeat After Me guides you in this process.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Relationships",
    "Mental Health",
    "Abuse",
    "Self Help",
    "Counselling"
  ],
  "author": "Claudia Black",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/933415.Repeat_After_Me"
}