{
  "title": "النمر الأبيض",
  "description": "يُقدم الروائي الهندي \"آرافيند أديفا\" رواية تعد بمثابة صرخة ضد الظلم والاستبداد التي يعانيها الإنسان في الهند خصوصاً، جاءت بعنوان \"النمر الأبيض\" فيكشف لنا بما تهيأ له من قدرات ذاتية في السرد التناقضات الحادة في الواقع في ذلك البلد حيث يتقصى التفاصيل من هنا وهناك فيستلهم شخصيات روايته من هذا الواقع بكل تناقضاته الصارخة كاشفاً المؤامرة التي يعيش فيها المواطن الهندي البسيط من قبل الملاكون وأصحاب الثروات الطائلة التي كونوها عبر استيلائهم على الثروات الطبيعية للبلاد، وبطل الرواية \"بالرام حلوي\" أو \"النمر الأبيض\" هو واحد من هؤلاء الفقراء، أطلق عليه مصطلح \"نصف مخبوز\" كناية عن نصف المتعلم الطامح إلى العبور من عالم الظلام إلى عالم النور ليحقق إنسانيته، ولكن ما هي وسيلته هل هي مشروعة ومبررة أم لا؟ وهنا لا بد من التعرف على بالرام أكثر، ولد بالرام في قرية تقع في القلب المظلم من الهند، وهو ابن لرجل يعمل في دفع العربات اليدوية، أبعدته عائلته عن المدرسة لتقحمه في عمل المقاهي. وبينما كان يكسّر الفحم، ويمسح الطاولات، كان يرعى حلماً بالهرب من ضفتي النهر - الأم الغانج، حيث تضخّ الأعماق الضبابية رفات مئات الأجيال. تواتيه الفرصة الكبيرة عندما يستخدمه أحد مُلاّك القرية ليعمل سائقاً لابنه وزوجة ابنه مع كلبيهما البومرانيين الصغيرين طويلي الشعر. ومن خلف مقود سيارة الهونداسيتي يشاهد بالرام مدينة \"دلهي\" للمرة الأولى. وما المدينة إلا وحي. ومن بين الصراصير ومراكز التخابر وأحياء الفقراء والأسواق الكبيرة والازدحامات المرورية التي تشل الحركة يبدأ بالرام تعلّمه من جديد. كان محصوراً بين غريزته أن يكون ابناً مخلصاً وخادماً، وبين رغبته في أن يكون في حال أفضل، فيتعلم أخلاقية جديدة في قلب الهند الجديدة. وبينما يقلّب بقية الخدم صفحات مجلة جريمة الأسبوع، يشرع بالرام في دراسة الطريقة التي يمكن للنمر من خلالها أن يهرب من قفصه، إذ من المؤكد أن أي رجل ناجح لا بد له من أن يسفك القليل من الدماء وهو في طريقه إلى القمة. تتوالى الأحداث في هذه الرواية الشيقة إلى درجة المواجهة السافرة لارتكاب جريمة القتل العمد والسرقة، فهل جريمته مبررة ومن سيدفع الثمن في النهاية؟ هذا ما تخبأه هذه الرواية الحائزة على جائزة بوكر لعام 2008، الناقدة اللاذعة لظروف الفوضى الاجتماعية والسياسية التي عليها حال الهند، فهي رواية غضب من اللاعدالة، ودعوة صادقة للتغيير، في بلد رفعت فيه الشعارات الطنانة الزائفة لمن يسمون أنفسهم بالاشتراكيين، للدفاع عن حقوق الشعب والمواطن الهندي المقهور، فعبّر عن ذلك الروائي \"آرافيند أديفا\" أصدق تعبير",
  "genres": [
    "Fiction",
    "India",
    "Book Club",
    "Contemporary",
    "Indian Literature",
    "Novels",
    "Literary Fiction"
  ],
  "author": "Aravind Adiga",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/9331570"
}