{
  "title": "The Naked Gardener",
  "description": "In a remote forest of northern Vermont, Katelyn Cross takes five women on a wilderness canoe trip where they hope to come up with ideas for saving their dying town. Although the river is not always what it seems and the women have not left their problems behind, a painting ritual creates a new way to look at the world - and themselves. Artist Katelyn Cross loves Greg Mazur and he loves her. He wants to be married but a previous relationship that went sour has made Katelyn overly cautious about any permanent commitment. And what about Greg's first wife? He lost her to cancer and Katelyn worries that he's only looking for a replacement. What's a girl to do? Canoe down a river with five gal pals, camp out, catch fish, talk about life and men. The problem is, a river can be as unpredictable as any relationship and just as hard to manage. On their last day, when the river turns wild, the women face the challenge of a lifetime and find that staying alive means saving themselves first while being open to help from a most unlikely source. As Katelyn navigates the raging water, she learns how to overcome her fear of change in a world where nothing stays the same. When Katelyn returns to her garden, she'll face one more obstacle and the naked gardener will meet the real Greg Mazur.What readers are saying about The Naked Gardener:Lyrical ... Scandalous ... Empowering ... Exhilarating ... Honest ... Sensual ... Fun ... Gentle ... Pleasurable ... Transporting ... TimelessIn her first novel, award winning writer L B Gschwandtner explores the push and pull of love, a woman's need to maintain her individuality within marriage, and the bonds that can make women stronger even when the world feels as if it's breaking apart.",
  "genres": [
    "Fiction",
    "Romance",
    "Relationships",
    "Womens Fiction",
    "Contemporary",
    "Book Club"
  ],
  "author": "L.B. Gschwandtner",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/9337443-the-naked-gardener"
}