{
  "title": "Women's Bodies, Women's Wisdom: Creating Physical and Emotional Health and Healing",
  "description": "Międzynarodowy bestseller – biblia kobiecego zdrowia„Ciało kobiety, mądrość kobiety” dr Christiane Northrup to ekscytująca podróż przez kobiecość w wymiarze fizycznym i duchowym. Książka, która na zawsze zmieni twoje życie, sprawiając, że inaczej spojrzysz na swoje ciało i zrozumiesz zachodzące w nim procesy, a także poczujesz przepływającą przez ciebie energię oraz odmienisz swoje relacje z samą sobą i ze swoim otoczeniem. Jesteś całością: ty, twoje ciało, twój duch. Poznaj siebie i zadbaj o swoje zdrowie.Zastanów się nad tym, jak traktowane jest kobiece ciało. Odsłaniane, gdy ktoś szuka w nim biznesowych korzyści i zasłaniane z oburzeniem, gdy spełnia swoje naturalne funkcje. Doświadczające procesów, które brzydzą i wiążą się z tabu i poddawane niekończącym się zabiegom, by lepiej wpisywać się w kulturowe normy. Z narządami, które w naszym języku czasem nawet trudno nazwać nie medycznie, nie protekcjonalnie i nie wulgarnie. Zdolne do budowania nowego życia i ośmieszane jako niedoskonałe i słabe. Sprawiające dyskomfort i będące źródłem największej przyjemności. Zawsze poddawane kontroli i na cenzurowanym. Problematyczne – a może raczej nierozumiane?Przed stereotypami, normami opartymi na kruchych podstawach i wierzeniami przeczącymi logice nie zdołała się uchronić nawet medycyna. Kobiece problemy fizyczne i psychologiczne często są bagatelizowane, choć szybka reakcja na niepokojące objawy może uratować życie. Przekonanie, że to naturalne, że kobiety cierpią, a ich ciała są słabe i niewydolne, jest niebezpiecznym mitem, bo pociąga za sobą niedostateczną dbałość o zdrowie fizyczne i psychiczne. To cały zestaw problemów, z którymi w różnych momentach życia mierzy się każda kobieta.Dr Christiane Northrup, amerykańska ginekolożka i badaczka kobiecości, obala te mity, opierając się na swojej wieloletniej praktyce lekarskiej. W efekcie powstał podręcznik dla każdej kobiety – przewodnik po jej organizmie: jego częściach, zachodzących w nim procesach (seksualności, menstruacji, menopauzie, ciąży, porodzie), chorobach i ich źródłach, ukazujący niezwykłą moc i ogromną siłę kobiecego ciała i kobiecości, która nie musi się wiązać z dyskomfortem i bólem.To jednak tylko wierzchołek góry lodowej. Dr Northrup ma do każdej kobiety prośbę: pamiętaj, że jesteś całością. Składasz się z ciała, ducha i umysłu, które nie są od siebie oddzielone. Tak jak fizyczny dyskomfort wpływa na twój stan psychiczny, tak to, że źle się czujesz z samą sobą, że nie lubisz swojego ciała, nie traktujesz go z miłością, nie słuchasz go – odbija się jak w lustrze w twoim stanie zdrowia.Autorka zachęca do wsłuchania się w siebie i zrozumienia własnego ciała – najważniejszej rzeczy, jaką posiadamy. Każda kobieta powinna wziąć sprawę w swoje ręce: poznać siebie jak najlepiej; zrozumieć procesy zachodzące w organizmie i w głowie; wsłuchać się w siebie. Twoje ciało, umysł i duch razem składają się na zdrową osobę. By ciało było zdrowe, trzeba zaufać swoim uczuciom i intuicji, która podpowiada nam, co jest dla nas dobre, a co nam szkodzi.Dr Christiane Northrup dostarcza rzetelną wiedzę na temat kobiecej anatomii i najczęstszych chorób i przypadłości. Prezentuje metody leczenia zarówno w duchu konwencjonalnej medycyny, jak i metod alternatywnych wspomagających terapię, podkreślając, że psychiczne nastawienie i dążenie do harmonii wewnątrz siebie i w relacjach ze światem to jedno z najlepszych lekarstw. Jej zdaniem choroba to przede wszystkim sygnał, za pomocą którego ciało chce nam coś powiedzieć: poprosić o lepszą dbałość o jego stan, zmobilizować do przewartościowania życia, zachęcić do introspekcji i lepszego poznania siebie; zażegnania konfliktu, często nieuświadomionego, który wyniszcza od środka.„Ciało kobiety, mądrość kobiety” to lektura potrzebna każdej z nas – wyposaży cię w wiedzę na temat twojego ciała i ułatwi ci zmianę nastawienia do swojej fizyczności, byś mogła się z samą sobą zaprzyjaźnić, zaakceptować siebie i otoczyć się jak najlepszą troską – bo na nią zasługujesz.",
  "genres": [
    "Health",
    "Nonfiction",
    "Self Help",
    "Womens",
    "Reference",
    "Feminism",
    "Psychology"
  ],
  "author": "Christiane Northrup",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/131830.Women_s_Bodies_Women_s_Wisdom"
}