{
  "title": "Strictly G.I.: The WWII Letters of Cpl. Wanda M. Renn",
  "description": "This book is a view of WWII enlisted life from the WAC perspective. Wanda maintains a positive outlook during her time a a WAC. Strictly G.I. is a historical account of World War II from one of the first female soldiers... Created from an actual collection of letters and Vmail. Wanda served in the 149th WAAC Post Hq. Co., the first group of Womens Auxiliary Army Corps (WAAC) during World War II to be sent overseas. \"Strictly G.I.\" is a phrase Wanda used to describe herself. She advanced quickly in the ranks, and shared her proudest moments in the letters, beginning with her initial training in Des Moines to marches before the general in North Africa. She also shares more humorous moments and interesting observations. Here is a quote from one \"We have a radio in our “room” and whenever we get a short wave station from the states, it makes a person stop and think. You don’t know – you can’t possibly know what war really is – in all reality.\" The letters document Wanda's training in 1942 at Fort Des Moines, Iowa to the dispatch of her unit overseas to French North Africa. Wanda's portrayal of life as a teletypist is lively and descriptive. Also unfolding in the letters is her concern for her male counterparts, and her growing affection for one special soldier. Women in America will be inspired Wanda's witt and resilience. Unlike servicemen, the auxiliaries could not receive overseas pay or government life insurance. If they became sick or wounded, they would not receive veterans’ hospitalization. If they were killed, their parents received no death gratuity. Enjoy this first person account of WWII from the perspective of a hard-working and very human female soldier. This sequential set of letters are from Wanda only. Any return correspondence from family and friends has been lost to time. Because Wanda's letters home are historical, the author hasn't recreated any letters written to Wanda.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Biography",
    "Memoir",
    "Historical"
  ],
  "author": "Patricia    Arnold",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/13183191-strictly-g-i"
}