{
  "title": "My Mother's Keeper: A Daughter's Memoir Of Growing Up In The Shadow Of Schizophrenia",
  "description": "Dawn Elgin was destined to be a 1940s big-band star. From the time she was fourteen, she took her place at the microphone in Houston's elite Empire Room and sang with the voice of a jazz angel. Vibrant and glamorous, she boldly pursued her love of performing to New Orleans, Hollywood, and New York, where she gave birth to her daughter, Tara, when she was twenty-one. Then Dawn began to suffer persistent visions of a deathly specter at her bedside. She was diagnosed with acute paranoid schizophrenia and began a lifetime spent in and out of institutions. My Mother's Keeper is Tara's deeply moving story of growing up in the shadow of her mother's tragic illness. As Dawn's state worsened, Tara lived in the care of her imperious great-great-aunt Elsa - the family's elderly matriarch, who drew her into a rich world of old-fashioned treasures and Houston history - while her mother drifted in and out of Tara's life like a fading fairy princess. Though Tara yearned for her mother during her childhood, Dawn's condition was usually kept from her, the subject of secretive family discussion and neighborhood gossip. By the time Tara was seventeen she had become Dawn's guardian, bent on rescuing the shambling street person her mother had become and transforming her back into the beautiful, lively woman she remembered. Above all, it is a deeply moving exploration of the mother-daughter bond - of how Tara learned to balance her mother's needs with her own, and how she finally came to terms with Dawn's legacy when she became a mother herself. Emotionally compelling and powerfully rendered, My Mother's Keeper offers indelible proof of love's power to transcend a devastating illness.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Psychology",
    "Mental Health",
    "Mental Illness",
    "Autobiography"
  ],
  "author": "Tara Elgin Holley",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/1318348.My_Mother_s_Keeper"
}