{
  "title": "Shadows",
  "description": "\"The wide front door hung open, a seductive invitation to a dark interior veiled by dust motes that glittered in the spectral greenish glow...\" The Shadows is a historic 1920s house that inspires preservationists' dreams -- and developers' schemes. Built during Prohibition by a notorious rumrummer who vanished at sea, it was inherited by his son, a local athlete and war hero who lived down his father's wild reputation. He served a successful term as Miami mayor and raised his four young children at the Shadows -- until a shotgun ambush on a hot summer night forty-four years ago. His murder was never solved. Since then, only secrets and whispers have inhabited the Shadows.Now, a resourceful young preservationist approaches the Miami Police Department's Cold Case Squad to help block a developer's plan to bulldoze the Shadows and build high-rise towers. The detectives visit the long-abandoned pioneer house, now surrounded by a wild and overgrown subtropical forest. They discover the rumrunner's secret limestone cellar, a tunnel to Biscayne Bay, and seven small, heartbreaking new mysteries -- a lost generation.Cold Case Squad Lt. K. C. Riley and her detectives seek out the murdered man's widow and children for answers. All are evasive and paranoid, haunted by lies, guilt, and tangled pasts that each recalls differently. Ultimately the squad finds that the killer is still out there, and the old, cold case is hotter than ever.In another dazzling example of Edna Buchanan's masterful weaving of stories and histories, Cold Case Squad Detective Sam Stone uncovers a still violent and long-hidden connection between his parents' murders when he was a child and their summer as civil rights workers in Mississippi more than thirty years ago.\"Life would be simple,\" Buchanan writes, \"if people told the truth.\" But for those who live among the shadows, the truth is never simple. Shadows is Edna Buchanan's most suspenseful novel.",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Action",
    "Detective"
  ],
  "author": "Edna Buchanan",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/933023.Shadows"
}