{
  "title": "Scottish Fold: The Cat Who'll Live Forever, a Cat Abroad, the Cat Who Went to Paris",
  "description": "Chapters: The Cat Who'll Live Forever, a Cat Abroad, the Cat Who Went to Paris. Source: Wikipedia. Pages: 19. Not illustrated. Free updates online. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Excerpt: The Scottish Fold is a breed of cat with a natural dominant-gene mutation that makes its ear cartilage contain a fold, causing the ears to bend forward and down towards the front of their head, which gives the cat what is often described as an \"owl-like\" appearance Originally called lop-eared or just lops after the lop-eared rabbit, Scottish Fold became the breed's name in 1966. Depending on registries, longhaired Scottish Folds are varying known as Highland Fold, Scottish Fold Longhair, Longhair Fold and Coupari. Solid cream Scottish FoldThe original Scottish Fold was a white barn cat named Susie, who was found at a farm near Coupar Angus in Perthshire, Scotland, in 1961. Susie's ears had an unusual fold in their middle, making her resemble an owl. When Susie had kittens, two of them were born with folded ears, and one was acquired by William Ross, a neighbouring farmer and cat-fancier. Ross registered the breed with the Governing Council of the Cat Fancy(GCCF) in Great Britain in 1966 and started to breed Scottish Fold kittens with the help of geneticist Pat Turner. The breeding program produced 76 kittens in the first three years42 with folded ears and 34 with straight ears. The conclusion from this was that the ear mutation is due to a simple dominant gene; if one parent provides the gene for straight ears, and one parent provides the gene for folded ears, the kittens will be Folds. Susie's only reproducing offspring was a female Fold named Snooks who was also white; a second kitten was neutered shortly after birth. Three months after Snooks' birth, Susie was killed by a car. All Scottish Fold cats share a common ancestry to Susie...More: http: //booksllc.net/?id=14568",
  "genres": [],
  "author": "Books LLC",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/9336107-scottish-fold"
}