{
  "title": "Une année chez les Français",
  "description": "C'est en 1970 que le ciel tombe sur la tête de Medhi Khatib. Ébloui par l'intelligence et la boulimie de lecture de son jeune élève, son instituteur s'est battu comme un lion pour lui obtenir une bourse d'interne dans le prestigieux lycée Lyautey de Casablanca, réservé aux enfants des hauts fonctionnaires français et des familles les plus influentes du régime marocain. Medhi a passé ses dix premières années au pied de l'Atlas. Pauvre, libre, heureux, choyé par une mère imprégnée de culture ancestrale et par un père qui rêve pour son pays d'un avenir démocratique et moderne, il n'envisageait rien d'autre que de continuer à jouir de l'existence et de se repaître de ces livres merveilleux dont l'abreuvait son instituteur. Du jour où l'un de ses oncles l'abandonne à l'entrée du lycée Lyautey, en lui fourrant dans les bras une paire de dindons qu'il est censé offrir au responsable de l'établissement, la vie de Medhi change de dimension.Les jours passent, des individus mystérieux bouleversent son existence, des situations étonnantes se succèdent et Medhi doit se rendre à l'évidence : il ne comprend rien ! Ni la vie qu'il a menée dans sa famille, ni les mots qu'il a appris dans tous ces livres qu'il adore ne sont en mesure de l'aider. Pourtant, il s'accroche. Et, au bout de quelques semaines, au moment où il commence à s'habituer à cet univers, une nouvelle épreuve lui est infligée. Il est l'unique interne du lycée qui ne rentre pas chez lui le week-end et le directeur, refusant de mobiliser trois personnes pour un seul élève pendant les vacances de la Toussaint, lui demande tout à trac quel est son meilleur ami. Medhi, au hasard, donne le nom d'un camarade qu'il connaît à peine. Le père de ce garçon, touché par la situation de Medhi, accepte de le prendre chez lui pendant les week-ends. Peut-être espère-t-il changer les idées de sa femme qui ne se remet pas de la perte d'un de leurs deux fils.Avec cet humour corrosif qu'on lui connaît, Fouad Laroui raconte le terrible choc culturel que représente pour ce modeste petit Marocain la découverte du mode de vie des Français : ces gens invraisemblables qui vivent dans un luxe inouï, qui mangent des choses dégoûtantes, qui parlent sans la moindre pudeur des sujets les plus sacrilèges et lui manifestent une tendresse et un intérêt qu'il ne comprend absolument pas. Le jour viendra où l'enfant devra choisir entre le paradis qu'on lui promet et sa famille d'origine.",
  "genres": [
    "France",
    "Morocco",
    "Fiction",
    "Africa",
    "Novels",
    "Roman"
  ],
  "author": "Fouad Laroui",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/9326916-une-ann-e-chez-les-fran-ais"
}