{
  "title": "Poverty Is No Crime",
  "description": "The tone of Poverty Is No Crime (1854), written only four years after A Family Affair, is in sharp contrast with that of its predecessor. In the earlier play Ostrovsky had adopted a satiric tone that proved him a worthy disciple of Gogol, the great founder of Russian realism. Not one lovable character appears in that gloomy picture of merchant life in Moscow; even the old mother repels us by her stupidity more than she attracts us by her kindliness. No ray of light penetrates the \"realm of darkness\" -- to borrow a famous phrase from a Russian critic -- conjured up before us by the young dramatist. In Poverty Is No Crime we see the other side of the medal. Ostrovsky had now been affected by the Slavophile school of writers and thinkers, who found in the traditions of Russian society treasures of kindliness and love that they contrasted with the superficial glitter of Western civilization. Life in Russia is varied as elsewhere, and Ostrovsky could change his tone without doing violence to realistic truth. The tradesmen had not wholly lost the patriarchal charm of their peasant fathers. A poor apprentice is the hero of Poverty Is No Crime, and a wealthy manufacturer the villain of the piece. Good-heartedness is the touchstone by which Ostrovsky tries character, and this may be hidden beneath even a drunken and degraded exterior. The scapegrace, Lyubim Tortsov, has a sound Russian soul, and at the end of the play rouses his hard, grasping brother, who has been infatuated by a passion for aping foreign fashions, to his native Russian worth. Alexander Ostrovsky (1823-1886) was an early Russian Realist whose work led to the founding of the Moscow Arts Theatre and to the career of Stanislavsky. He has been acknowledged to be the greatest of the Russian dramatists.",
  "genres": [
    "Plays",
    "Classics",
    "Russia",
    "Drama",
    "Fiction",
    "Russian Literature"
  ],
  "author": "Aleksandr Ostrovsky",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/934219.Poverty_Is_No_Crime"
}