{
  "title": "Ash: Return of the Beast",
  "description": "ASH: RETURN OF THE BEAST is a modern-day supernatural crime chiller, a tale of revenge steeped in the occult. The story is a work of fiction inspired by a little known factoid about the death of Aleister \"The Beast\" Crowley (1875-1947), the notorious occultist whose favorite number was 666 and whom the British press once labeled as \"The Wickedest Man In The World\". Crowley’s body was cremated but the unexplained 1947 disappearance of the urn containing his ashes has remained a mystery… until now.This diabolical tale propels the reader through a series of curiously interconnected events spanning the years from 1947 (and the death of Aleister Crowley) to the 1990s and the coming-of-age (and eventual stardom) of a \"death-metal\" rocker with the unlikely name of Rodney Duckworth.The time-line shifts to the present day where Brian Kane, a gruff and gritty street-worn Seattle Police Detective, reluctantly teams up with the mysterious Rowena Ravenwood, an attractive and rather unconventional female FBI agent assigned to a most unusual investigative unit. Their task is to figure out why good, healthy, God-fearing preachers in their fair city are suddenly dropping dead... one at a time... exactly nine days apart.What is the meaning of the strange symbols branded onto the bodies of these hapless victims? Are they all part of some bizarre cult? No eyewitnesses. No fingerprints. Is it really murder? Where’s the evidence? And what is the disturbing secret that Detective Kane is holding so close to his chest?The investigation catapults Kane and Ravenwood headlong into life-threatening situations as they feel their way through the strange, dark labyrinth of the world of the occult and find themselves battling for their lives against the powerful forces of ritual magick.A bloody carnage of unimaginable horror is about to be unleashed upon the world as the offspring of the fabled “Old Ones” are awakened from their ancient slumber. The survival of the entire human race hangs in the balance and the clues to help solve the case are in desperately short supply. Worse yet, so is the amount of time left to stop the mysterious killer's reign of terror before all Hell breaks loose. And – according to Special Agent Ravenwood – that’s not just a figure of speech.",
  "genres": [
    "Horror"
  ],
  "author": "Gary Val Tenuta",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/13183685-ash"
}