{
  "title": "The Extra 2%: How Wall Street Strategies Took a Major League Baseball Team from Worst to First",
  "description": "What happens when three financial industry whiz kids and certified baseball nuts take over an ailing major league franchise and implement the same strategies that fueled their success on Wall Street? In the case of the 2008 Tampa Bay Rays, an American League championship happens—the culmination of one of the greatest turnarounds in baseball history.In The Extra 2% , financial journalist and sportswriter Jonah Keri chronicles the remarkable story of one team’s Cinderella journey from divisional doormat to World Series contender. When former Goldman Sachs colleagues Stuart Sternberg and Matthew Silverman assumed control of the Tampa Bay Devil Rays in 2005, it looked as if they were buying the baseball equivalent of a penny stock. But the incoming regime came armed with a master to leverage their skill at trading, valuation, and management to build a model twenty-first-century franchise that could compete with their bigger, stronger, richer rivals—and prevail.Together with “boy genius” general manager Andrew Friedman, the new Rays owners jettisoned the old ways of doing things, substituting their own innovative ideas about employee development, marketing and public relations, and personnel management. They exorcized the “devil” from the team’s nickname, developed metrics that let them take advantage of undervalued aspects of the game, like defense, and hired a forward-thinking field manager as dedicated to unconventional strategy as they were. By quantifying the game’s intangibles—that extra 2% that separates a winning organization from a losing one—they were able to deliver to Tampa Bay something that Billy Beane’s “Moneyball” had never brought to an American League pennant.A book about what happens when you apply your business skills to your life’s passion, The Extra 2% is an informative and entertaining case study for any organization that wants to go from worst to first.",
  "genres": [
    "Baseball",
    "Sports",
    "Nonfiction",
    "Business",
    "Audiobook",
    "History",
    "Economics"
  ],
  "author": "Jonah Keri",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/9359172-the-extra-2"
}