{
  "title": "Mahadevi Varma: Political Essays on Women, Culture, and Nation",
  "description": "This edited volume of translations covers the major political essays of India's first feminist Hindi poet. A devout follower and advocate of Gandhi, Mahadevi Varma is a household name in India and is a major woman of letters in the modern Hindi world. The essays collected in this volume represent some of Mahadevi Varma's most famous writings on the woman question in India. The collection also includes an introduction to her life, with biographical notes, an analysis of her importance in the field of Hindi letters, as well as a selection of her poems; these latter because Mahadevi Varma made her mark in the world of Hindi literature through her poetry, and a volume of translations would be incomplete without a sampling of them. The introduction to the translated volume sketches Mahadevi Varma's life and work and her significance to both the development of modern standard Hindi as well as to the nascent women's movement underway in the 1920s in India. Little scholarly attention has been given in the academy outside of India to Varma's numerous contributions to women's education, to the development of modern standard Hindi, and to political thought during the Independence movement in late-colonial India. This volume of translations engages themes like language and nationalism, women's roles as artists, the politics of motherhood and marriage themes that continue to be relevant to women's lives in contemporary India and to movements for women's rights outside India as well. This volume of translations of Mahadevi Varma's feminist political essays is the first of its kind. While some of these essays, especially those from Mahadevi Varma's Hamari Shrinkhala Ki Kariyan collection have been translated by Neera K. Sohoni and published under the title Links in the Chain (Katha, 2003), there is no sustained treatment of Varma's political thinking in one, accessible volume. While there is ample work on Varma in Hindi, scholars of feminism (and students of Hindi who are in the nascent stages of language acquisition) have nowhere to turn for a comprehensive sampling of her work. Mahadevi Varma is also one of the most difficult writers to access even for trained scholars of Hindi language and literature. Her highly Sanskritized diction and her stylized prose sketches make her work a pleasure to read in the original but daunting to translate into English. This volume has contributions from some of the most highly regarded Hindi experts. In the editor's introduction to the volume of translations a brief biographical sketch followed by an analysis of the political climate of Northern India has been provided so that the reader unfamiliar with India of the 1920s—1940s will have the necessary historical context to place her work. The introduction to the volume also raises the issue of why she gave up writing poetry and turned solely to writing prose when she became involved with the movements for women's rights and national independence. Finally, the volume provides feminist cultural historians a rich archive of how Indian women like Mahadevi Varma were actively negotiating their lives as women, activists, artists, teachers, and married women. This work will be of use to scholars of Hindi language and literature in the US/European academy and should be of interest to cultural and feminist historians of modern India. This volume will introduce Mahadevi Varma's literary scope to an English-speaking audience, and will serve as a reference for feminist historians of the nationalist period in the Indian subcontinent.\"",
  "genres": [],
  "author": "Mahadevi Verma",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/9362084-mahadevi-varma"
}