{
  "title": "Stalin",
  "description": "From the author of The Last Tsar, the first full-scale life of Stalin to have what no previous biography has fully obtained: the facts. Granted privileged access to Russia's secret archives, Edvard Radzinsky paints a picture of the Soviet strongman as more calculating, ruthless, and blood-crazed than has ever been described or imagined. Stalin was a man for whom power was all, terror a useful weapon, and deceit a constant companion.As Radzinsky narrates the high drama of Stalin's epic quest for domination-first within the Communist Party, then over the Soviet Union and the world-he uncovers the startling truth about this most enigmatic of historical figures. Only now, in the post-Soviet era, can what was suppressed be told: Stalin's long-denied involvement with terrorism as a young revolutionary; the crucial importance of his misunderstood, behind-the-scenes role during the October Revolution; his often hostile relationship with Lenin; the details of his organization of terror, culminating in the infamous show trials of the 1930s; his secret dealings with Hitler, and how they backfired; and the horrifying plans he was making before his death to send the Soviet Union's Jews to concentration camps-tantamount to a potential second Holocaust. Radzinsky also takes an intimate look at Stalin's private life, marked by his turbulent relationship with his wife Nadezhda, and recreates the circumstances that led to her suicide.As he did in The Last Tsar, Radzinsky thrillingly brings the past to life. The Kremlin intrigues, the ceaseless round of double-dealing and back-stabbing, the private worlds of the Soviet Empire's ruling class-all become, in Radzinsky's hands, as gripping and powerful as the great Russian sagas. And the riddle of that most cold-blooded of leaders, a man for whom nothing was sacred in his pursuit of absolute might--and perhaps the greatest mass murderer in Western history--is solved.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Russia",
    "Politics",
    "Russian History",
    "Biography Memoir"
  ],
  "author": "Edvard Radzinsky",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/93653.Stalin"
}