{
  "title": "Glimpses: A Collection of Nightrunner Short Stories",
  "description": "Lynn Flewelling's Glimpses explores \"lost\" moments from her popular Nightrunner Series, events alluded to or passed over - Alec's parents and childhood, Seregil's early liaisons in Skala, Seregil and Alec's first night as lovers, how Seregil and Micum Cavish met. Each story offers a new perspective on events readers have speculated about for years. For new readers, it offers an introduction to the characters Romantic Times calls \"two of the most memorable heroes in fantasy.\" Professional and amateur art provided by Flewelling's fans accompany Glimpses' stories, as she honors the dedication and devotion her fans have given her over the years. \"Glimpses is full of treasures like Lynn Flewelling's deceptively easy and addictive storytelling, her vivid and engaging characters, and the amazing and heartfelt illustrations. This book is a must have for fans of Lynn's Nightrunner books, and if you haven't started the series yet, then Glimpses will leave you eager to discover more about Seregil and Alec, their adventures and the unique and fantastical world that the pair inhabit.\" -Suzanne McLeod, Spellcrackers.com series \"It's hard to imagine a lovelier gift to fans than this exquisite collection of gorgeously illustrated short stories. Flewelling indulges her loyal readers with these graceful glimpses 'between the lines' of the long-running and immensely popular Nightrunner series.\" -Josh Lanyon, Adrien English Mysteries and the Holmes & Moriarity Mysteries \"An unmissable short story collection from Flewelling. Set in the Nightrunner universe Glimpses captures Flewelling's characters at formative moments in their various timelines. Some of the stories fill in details that I've been waiting on for years...\" -T.A. Moore, The Even Series \"Glimpses is a terrific collection, lovingly illustrated, a gift to all of us who love the Nightrunners. This rocks.\" -Patricia Briggs, Mercy Thompson Series",
  "genres": [
    "Fantasy",
    "Romance",
    "M M Romance",
    "Short Stories",
    "LGBT",
    "Queer",
    "Anthologies"
  ],
  "author": "Lynn Flewelling",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/9368252-glimpses"
}