{
  "title": "Lee Konitz: Conversations on the Improviser's Art",
  "description": "\"Meticulously researched, detailed and documented, this long awaited overview justly establishes Konitz as one of the most consistently brilliant, adventurous and original improvisers in the jazz tradition—a genius as rare as Bird himself.” —John Zorn\"Hamilton’s work may well mark the inception of a format new to writing on Western music, one which avoids both the self-aggrandizing of autobiography and the stylized subjectification of biography.” —The Wire\"An extraordinary approach to a biography, with the man himself speaking for extended sessions. The main vibration I felt from Lee’s words was total honesty, almost to a fault. Konitz shows himself to be an acute observer of the scene, full of wisdom and deep musical insights, relevant to any historical period regardless of style. The asides by noted musicians are beautifully woven throughout the pages. I couldn’t put the book down—it is the definition of a living history.” —David LiebmanThe preeminent altoist associated with the \"cool” school of jazz, Lee Konitz was one of the few saxophonists of his generation to forge a unique sound independent of the influence of Charlie Parker. In the late 1940s, Konitz began his career with the Claude Thornhill band, during which time he came into contact with Miles Davis, with whom he would later work on the legendary Birth of the Cool sessions. Konitz is perhaps best known through his association with Lennie Tristano, under whose influence much of his sound evolved, and for his work with Stan Kenton and Warne Marsh. His recordings have ranged from cool bop to experimental improvisation and have appeared on such labels as Prestige, Atlantic, Verve, and Polydor. Crafted out of numerous interviews between the author and his subject, the book offers a unique look at the story of Lee Konitz’s life and music, detailing Konitz’s own insights into his musical education and his experiences with such figures as Miles Davis, Stan Kenton, Warne Marsh, Lennie Tristano, Charles Mingus, Bud Powell, and Bill Evans.Andy Hamilton is a jazz pianist and contributor to major jazz and contemporary music magazines. He teaches philosophy, and the history and aesthetics of jazz, at Durham University in the United Kingdom. He is also the author of the book Aesthetics and Music (Continuum 2007).",
  "genres": [
    "Music",
    "Jazz",
    "Biography"
  ],
  "author": "Andy   Hamilton",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/936388.Lee_Konitz"
}