{
  "title": "Heaven's Fury",
  "description": "New York Times bestselling author Stephen Frey thrills readers with the mesmerizing tale of a small-town sheriff who must confront the worst violence that man and nature possess.  Bruner, Wisconsin, is really two different towns. On one side are the magnificent summer estates of wealthy families who value their privacy and privilege above all else. A few miles away, but a world apart, are the homes of the working men and women who cook, clean, and tend to the needs of the summer visitors. It’s a place of staggering natural beauty, but where death can come unexpectedly and with no regard for a person’s bank account or family tree. A place of steadfast loyalties and friendships, but where the long and brutal winter can make even the most intimate friends turn on each other with frightening intensity. This is the place where Sheriff Paul Summers finds himself grasping for answers when the wild, unpredictable woman who captured his heart years ago is discovered brutally and spectacularly murdered inside her family’s snowbound estate. As the last person to see her alive, and given his complicated history with the victim, Paul is not only lead investigator on the case but, in the eyes of many in Bruner, the prime suspect in her killing. Battling rumors of an evil cult’s being formed just outside of town, the disappearance of another citizen, and a wife whose grasp of reality is quickly slipping away, Paul must race to find the true guilty party before a massive winter storm leaves them all cut off from the outside world and at the mercy of a remorseless killer. As the approaching storm gathers in intensity, so do the twists and turns that bring Paul ever closer to unraveling the big secrets that haunt this small town. In a stunning conclusion, Paul witnesses firsthand the startling power and beauty of heaven’s fury.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Stephen W. Frey",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/9371145-heaven-s-fury"
}