{
  "title": "The Distant Hours",
  "description": "The discovery of a long-lost letter reveals an old secret and the the truth behind a woman's mysterious past in the eagerly awaited new novel from international publishing sensation, Kate Morton, author of The Shifting Fog and The Forgotten Garden.It started with a letter. A letter that had been lost for a long time, waiting out half a century, stifling summer after cooling winter, in a forgotten postal bag in the dim attic of a nondescript house in Bermondsey ... Edie Burchill and her mother have never been close, but when a long lost letter arrives one Sunday afternoon with the return address of Millderhurst Castle, Kent, printed on its envelope, Edie begins to suspect that her Mother's emotional distance masks an old secret.Evacuated from London as a thirteen year old girl, Edie's mother is chosen by the mysterious Juniper Blythe, and taken to live at Millderhurst Castle with the Blythe family: Juniper, her twin sisters and their father, Raymond, author of the 1920s children's classic, The True History of the Mud Man. In the grand and glorious Millderhurst Castle, a new world opens up for Edie's mother. She discovers the joys of books and fantasy and writing, but also, ultimately, the dangers.Fifty years later, as Edie chases the answers to her mother's riddle, she, too, is drawn to Millderhurst Castle and the eccentric Sisters Blythe. Old ladies now, the three still live together, the twins nursing Juniper, whose abandonment by her fiance in 1941 plunged her into madness. Inside the decaying castle, Edie begins to unravel her mother's past. But there are other secrets hidden in the stones of Millderhurst Castle, and Edie is about to learn more than she expected. The truth of what happened in the distant hours has been waiting a long time for someone to find it.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Historical",
    "Gothic",
    "Book Club",
    "Romance"
  ],
  "author": "Kate Morton",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/9374851-the-distant-hours"
}