{
  "title": "Ayn Rand Hates Tuscaloosa, And You Too Joplin!",
  "description": "It's popular these days to blame and vilify the government. No one really considers the necessary services that the government provides, as we all take them for granted.But when tragedy strikes, as it did in Tuscaloosa, Al and Joplin, Mo, the need for government becomes too painfully obvious to the decent Americans who suffered massive losses at the hands of nature.What is not obvious to these good people, who are all our neighbors, is the intent of the politicians and the party that they vote into power and support. The very politicians that draw their support from main street America such as Tuscaloosa and Joplin, conspire to destroy the necessary functions that allow neighbors to help neighbors, and the downfallen an opportunity to rise again.The values of America are being attacked, distorted, and morphed into a perverted worldview by these people. To these people, it is no longer our duty to help our neighbor. To these people, there is no reason to respect anyone but the wealthy. To these people, there is no respect for the working men and women. To these people, there is no world but this one, and the new goal of society is to maximize selfishness above all other values.These values are of Ayn Rand and she lives thirty years after her death in the policies of the once great Republican Party. Ayn Rand preaches no need to love your neighbor and demanded the individual live only for himself.Ayn Rand hates Tuscaloosa and Joplin too; for here there exists no valid reason to sacrifice for those who need. Ayn Rand is worshipped by those in the highest levels of influence as a founder of a new morality.It's time to realize who Ayn Rand was, what she believed, and how those thoughts corrupt our country, to the detriment of those who vote into power her disciples.Ayn Rand hates America. America would be better off hating her back.",
  "genres": [],
  "author": "George Kelley",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/13184629-ayn-rand-hates-tuscaloosa-and-you-too-joplin"
}