{
  "title": "Minimalism: Live a Meaningful Life",
  "description": "Live a Meaningful Life is our finest, most important creation to date. It’s also the best thing we’ve ever written about Minimalism and will likely serve as the cornerstone to our work for years to come. It took us a year to write this book—a year of creating the best material possible and finding ways to relate it back to our lives so you would have practical ways to relate the subject matter to your life.Chapter Do you jump out of bed every morning excited about the day in front of you? Do you live a life defined by deep meaning, endless passion, excellent health, empowering relationships, and constant growth?You can.Ultimately, the eight chapters and ninety-eight sections inside this book are meant to help you take small actions each day that will radically improve your life over a short period of time.This book’s foreword and first chapter go into vast detail on our personal backgrounds, our troubled pasts, our depression, and how we made changes that transformed our lives over two years. These chapters discuss why didn’t feel fulfilled by our careers and why we turned to our society’s idea of a meaningful we bought stuff, we spent too much money, and we lived paycheck to paycheck trying to purchase happiness in every trip to the shopping mall or luxurious vacation we could find. Instead of finding our passion, instead of searching for our mission, we pacified ourselves with ephemeral indulgences, inducing a crack-cocaine high that didn’t last far past the checkout line.The subsequent chapters move on the the five dimensions that comprise a meaningful 1. Health2. Relationships3. Passions4. Growth5. ContributionThese are the things we changed in our lives that had the most impact. These changes resulted in more meaningful lives for the two of us. These five chapters discuss each of these concepts in depth, much more than our website. Throughout these chapters we consider why these areas are the most important dimensions of our lives and how minimalism allowed us to focus on these areas. We give you personal examples of how we changed everything in our lives over two year span. We left our big corporate jobs, changed our diets, started exercising regularly, got healthy, strengthened our core relationships, made great new relationships, started pursuing our passions, contributed to more people than we ever had, and found ways to be happy and content with our lives.The final chapter of this book, \"The Confluence of Meaning,\" binds together the five dimensions and asks the reader important questions about their life. These questions are not rhetorical, they are meant to make you think. The entire book is designed to help you actively engage in each chapter by reading the content more than once, taking notes, highlighting meaningful passages, making lists, and, most importantly, taking action.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Audiobook",
    "Philosophy",
    "Psychology",
    "Memoir"
  ],
  "author": "Joshua Fields Millburn",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/13185350-minimalism"
}