{
  "title": "Daylight in Blossom",
  "description": "They are coming to kill her. It doesn't matter if anyone believes her or not. They are out to kill her and she can hear them calling her name.  Autumn Rees is lost in Blossom, Ohio. As a matter of fact, she is lost no matter where she runs to. She simply doesn’t fit into a world filled with those whispering voices and frightening shadows that always seem to be chasing her down.  After discovering that making it on her own isn’t going to work, she returns to Blossom and to her lifelong super hero – a man she calls \"The Great Typhoon\".  Tyler Rees is stuck in Blossom, Ohio. He never left the dying town in his whole life and he probably never will. A horrible car accident leaves him both physically and emotionally broken. Every day feels like he is being sucked deeper into the abyss of the crumbling town.  Best friends for as long as they can remember, Tyler and Autumn set out on a journey of healing that will take them beyond the razor-wire, pain-filled, troublesome boundaries of Blossom. Escaping however, may not prove to be the true road to healing. The shadows and those hideous whispering voices seem to follow them wherever they go.  From the Xulon Award winning author of the international bestsellers The Mystic Saga, Dominion, One Crazy Summer, Ghosts of Ophidian, and Alastair. Scott is a veteran of the US Navy. He has been happily married for more than 18 years and has two wonderful sons. Currently, he works at the Matco Tools headquarters as a supervisor in the finance department while maintaining his \"side job\" as an author of suspense and science fiction.  ~~~~~~~~~~~~~ EDITORIAL REVIEWS: ~~~~~~~~~~~~~ \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Beacon Journal Book Review  \"He brings something refreshing to the '99-cent Kindle' section of Amazon.\" ~ Associated Content  Over 175,000 of his books have been downloaded worldwide",
  "genres": [
    "Fiction"
  ],
  "author": "Scott McElhaney",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/13185182-daylight-in-blossom"
}