{
  "title": "Beyond the Elastic Limit",
  "description": "THE EPIC FABLELoring’s books are epic fables, simple stories with universal implications. The narrative is dialogue driven, sweeping in scope and action.Each book deals with time, but the plots are unconnected. Both share similar language and employ the same technology -- a time-viewing machine.Though technically defined as Science Fiction and/or Fantasy, Loring’s novels defy classification. Both works embrace similar genres: mystery, detective tale, historical fiction, adventure saga and love story.Each novel possesses a dual literary nature. Both are fables, usually defined as simple tales conveying a moral, or moral lesson. As well, they are epics, larger stories that dwell on internal changes that lead to personal growth.In Beyond the Elastic Limit: An Epic Fable, a time-viewing machine used by an advanced civilization malfunctions and time explodes, creating havoc. Actions employed to rectify the situation force characters to explore larger issues. This novel probes human values, multiple gods, social development and civil ethos.Piercing the Elastic Limit: An Epic Fable, takes a mysterious “Old Man” through time using the machine. He meets such historic figures as Julius Caesar, Christopher Marlow, Robert Schumann and others, in order to defeat foes that are deliberately distorting the flow of time. This novel incorporates the theme of business and technology run amok, and how each can be misused for devious ends.UNIVERSAL THEMES – MYTH, LEGEND AND FOLKLOREBoth books are redemptive tales, dealing with basic philosophical concepts such as truth and justice, good and evil and “might makes right vs. right makes might.”As in any epic, flawed characters evolve as a result of their quests, gleaning insight into these universal human ideals. All must grapple with difficult personal choices. Hard decisions, forced by dire circumstances yield unforeseen consequences, challenges that must be met and overcome.As in any fable, the narrative style is simplistic, yet the action is layered with fast-paced sequences often presented through flashbacks and proceeding from different points of view. In the end, each major character develops a personal morality.Beyond the Elastic Limit: An Epic Fable is technically a myth, a story dealing with ancient gods who hold dominion over human activities.Piercing the Elastic Limit: An Epic Fable is properly folklore, fiction based on real characters as opposed to legend, traditionally considered stylized portrayals of actual historic events.",
  "genres": [
    "Time Travel",
    "Fiction",
    "Science Fiction",
    "Fantasy"
  ],
  "author": "Howard Loring",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/9376349-beyond-the-elastic-limit"
}