{
  "title": "Truth",
  "description": "In a quiet rural village in late 19th-century France, an eleven-year-old boy is found dead in his room, sexually molested and strangled by an unknown assailant. The shocked townsfolk erupt in outrage: Who could have committed this horrible crime? Rumors immediately begin to fly and suspicions shift from one person to another as ignorant conjecture begins to feed on itself.At first a vagrant is suspected; he could have come in through the open window while passing through the town at night. But in a matter of days another story begins to circulate: the culprit must be Simon, the Jewish schoolmaster, and the murdered boy's uncle and guardian. Did he not, it is rumored, resent the fact that the boy was the product of a mixed Catholic-Jewish marriage and was raised Catholic by his now deceased mother? Despite the total lack of evidence against him, as a Jew in the midst of a predominantly Christian community, Simon is completely vulnerable to these vicious allegations. The web of mendacity that is quickly spun around him is the product of centuries of entrenched anti-Semitism and the long-standing bitter rivalry between the Catholic majority of the town and an emerging secular minority. Through political pressure by influential Catholic clergymen and the manipulation of public opinion, the Church deftly deflects the suspicions of some that the murderer is actually one of the Christian Brothers and succeeds in gaining advantage against the threat of encroaching secularism in the town.Based on his experiences with the infamous Dreyfus case, this powerful last novel by Émile Zola about the scapegoating of a Jewish schoolteacher is a chilling depiction of anti-Semitism fully embedded in European society and an eerie presentiment of the Holocaust that would sweep across the Continent only forty years later. But this is not the whole story, for Zola also brilliantly demonstrates how truth, though suppressed for a generation, slowly but inexorably comes to light through the dedication and perseverance of a few humble defenders, who remain unswerving in their demand for justice.",
  "genres": [
    "Fiction",
    "French Literature",
    "Classics",
    "Literature",
    "Novels",
    "France",
    "Roman"
  ],
  "author": "Émile Zola",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/938008.Truth"
}