{
  "title": "What to Cook and How to Cook It",
  "description": "\"What to Cook and How to Cook It\" is the ultimate cookbook for beginners, showing how to cook easy, delicious meals for every day of the week. With a winning combination of clear step-by step-photographs, and authoritative, foolproof recipes, it takes 100 favourite everyday dishes and guides the reader through every step of the cooking process with recipes that absolutely anyone can follow. Each ingredient and stage of the cooking process is illustrated with a clear colour photograph, and the striking, simple design will encourage anyone who lacks confidence at cooking to have a go at producing nutritious, home-cooked food for their family and friends. Every stage is clearly explained, with no prior knowledge taken for granted. Even common terms such as 'finely chopped' are explained in an illustrated glossary. The recipes are written by a highly experienced food writer with years of expertise in creating simple, foolproof recipes, and each one has been tested several times to ensure that it is easy to follow. Additional hints and tips are provided on how to choose ingredients, how to rescue a recipe if things go wrong, and how to adapt the dish with different ingredients. Unlike most beginners' cookbooks, this one does not attempt to teach techniques, such as pastry and it focuses purely on creating straightforward, enjoyable meals that are easy to cook. The recipes are extremely practical, using ingredients available in any market or supermarket, do not require specialist equipment, and are economical and nutritious. To make it simple to decide what to cook, the recipes are divided into chapters on breakfasts and brunches, light weekday meals and lunches, dishes for sharing, quick and easy suppers, weekend main meals that take longer to cook, and desserts and baking. What to Cook will equip any novice cook with a repertoire of simple, crowd-friendly dishes that they can cook to perfection with confidence.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference",
    "Food and Drink"
  ],
  "author": "Jane Hornby",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/9382624-what-to-cook-and-how-to-cook-it"
}