{
  "title": "The Natural Step for Communities: How Cities and Towns can Change to Sustainable Practices",
  "description": "Sustainability may seem like one more buzzword and cities and towns like the last places to change, but The Natural Step for Communities provides inspiring examples of communities that have made dramatic changes toward sustainability and explains how others can emulate their success. Chronicled in the book are towns like Övertorneå, whose government operations recently became 100 percent fossil fuel-free, demonstrating that unsustainable municipal practices really can be overhauled. Arguing that the process of introducing change—whether converting to renewable energy or designing compact development—is critical to success, the authors outline why well-intentioned proposals often fail to win community approval and why an integrated approach—not \"single-issue\" initiatives—can surmount challenges of conflicting priorities, scarce resources and turf battles. The book first clarifies the concept of sustainability, offering guiding principles—the Natural Step framework—that help identify sustainable action in any area. It then introduces the 60+ eco-municipalities of Sweden that have adopted changes to sustainable practices throughout municipal policies and operations. The third section explains how they did it and outlines how other communities in North America and elsewhere can do the same. Key to success is a democratic, \"bottom-up\" change process and clear guiding sustainability principles, such as the Natural Step framework. The book will appeal to both general readers wishing to understand better what sustainability means and practitioners interested in introducing or expanding sustainable development in their communities. Sarah James is the principal of a community planning consulting firm. She co-authored the American Planning Association’s Planning for Sustainability Policy Guide and has published articles throughout the U.S. on this subject. Torbjörn Lahti was the planner for Sweden’s first eco-municipality and is directing a five-year sustainable community demonstration project. He was instrumental in forming the Swedish National Association of Eco-municipalities.",
  "genres": [
    "Sustainability",
    "Nonfiction",
    "Environment"
  ],
  "author": "Sarah    James",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/938474.The_Natural_Step_for_Communities"
}