{
  "title": "Scarred by Struggle, Transformed by Hope",
  "description": "Everyone goes through times of pain and sorrow, depression and darkness, stress and suffering. It is in the necessary struggles of life, however, that we stretch our souls and gain new insights enabling us to go on.Building on the biblical story of Jacob wrestling with God and on the story of her own battle with life-changing disappointment, Sister Joan Chittister deftly explores the landscape of suffering and hope, considering along the way such wide-ranging topics as consumerism, technology, grief, the role of women in the Catholic Church, and the events of September 11, 2001. We struggle, she says, against change, isolation, darkness, fear, powerlessness, vulnerability, exhaustion, and scarring; and while these struggles sometimes seem insurmountable, we can emerge from them with the gifts of conversion, detachment, faith, courage, surrender, limitations, endurance, transformation, and (perhaps most important) hope. Each of these struggles and gifts is discussed in a chapter of its own.Meant to help readers cope with their own suffering and disappointment,  Scarred by Struggle, Transformed by Hope  is, in Chittister's words, \"an anatomy of struggle and an account of the way hope grows in us, despite our moments of darkness, regardless of our regular bouts of depression. It is an invitation to look again at the struggles of life in order that we might remember how to recognize new life in our souls the next time our hearts turn again to clay.\"Neither a self-help manual nor a book offering pat answers, but supremely practical and relevant, Chittister's  Scarred by Struggle, Transformed by Hope  will richly reward those readers seeking solace in the empathic, wise, and accessible meditations of a fellow struggler.",
  "genres": [
    "Spirituality",
    "Religion",
    "Faith",
    "Nonfiction",
    "Self Help",
    "Christian",
    "Christianity"
  ],
  "author": "Joan D. Chittister",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/938219.Scarred_by_Struggle_Transformed_by_Hope"
}