{
  "title": "From the Fjords",
  "description": "REFRIGERATOR GENERALI am wrapped only in a wet towel when the refrigerator general knocks on my door. I need to inspect your refrigerator he says. You can’t just go around inspecting people’s refrigerators I say, the cold air from the door on my flushed thighs. But, ma’am, I’m the refrigerator general he says. Well, may I see your identification? I ask. The refrigerator general digs around in his breast pocket and pulls out a card designed to look a little like a refrigerator. That’s very clever but I’m not sure it proves anything I say. Ma’am he says with urgency. He pushes open the door a little and steps inside. But I’m in my towel I say. Relax, ma’am, I’m a professional he says from the kitchen. But I don’t even have a refrigerator I say. Just as I suspected he says. I stand completely motionless in the corner of the kitchen and start humming. He stops writing his citation and stares at me, eyes like a bat’s eyes, the blood draining from his face. Ma’am? he asks. Ma’am? He tugs gently on my towel and looks inside. I can see it in his eyes, how he wants me to be something human. LARGE REFRIGERATOR OF THE VALLEYI come down from the mountains carrying heavy refrigerator parts on my back and build a very large refrigerator. It is the largest refrigerator ever built, roughly fifteen to twenty times the size of an average refrigerator. I have built a very large refrigerator I announce to one woman who lives in a shack by the river. You may put anything you want in it I say. The woman who lives in the shack appears skeptical. Does it look like I have anything to refrigerate? she asks. Maybe not now I say but perhaps you could see the large refrigerator as a way to change your life. The woman who lives in a shack stares for a while, her face like a plate. I can tell she is really thinking about how the large refrigerator could change her life. Then, slowly, it begins to happen. The woman who lives in a shack looks to the top of the refrigerator which is peeking out over the trees in the distance, like a low white sun. Owwwwwooooooooooga owwwwoooooga! she howls. Change has come to the valley. Yes, owwwwoooooooga I say, my strong arms now around her waist, owwwwoooooooga.",
  "genres": [
    "Poetry"
  ],
  "author": "Zachary Schomburg",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/9399518-from-the-fjords"
}