{
  "title": "Stonewall of the West: Patrick Cleburne and the Civil War",
  "description": "To Jefferson Davis, he was the \"Stonewall of the West\"; to Robert E. Lee, he was \"a meteor shining from a clouded sky\"; and to Braxton Bragg, he was an officer \"ever alive to a success.\" He was Patrick Ronayne Cleburne, one of the greatest of all Confederate field commanders.An Irishman by birth, Cleburne emigrated to the United States in 1849 at the age of 21. He achieved only modest success in the peacetime South, but rose rapidly in the wartime army to become the Confederacy's finest division commander. He was admired by peers and subordinates alike for his leadership, loyalty, honesty, and fearlessness in the face of enemy fire. The valor of his command was so inspirational that his unit alone was allowed to carry its own distinctive battle flag.In Stonewall of the West , Craig Symonds offers the first full-scale critical biography of this compelling figure. He explores all the sources of Cleburne's commitment to the Southern cause, his growth as a combat leader from Shiloh to Chickamauga, and his emergence as one of the Confederacy's most effective field commanders at Missionary Ridge, Ringgold Gap, and Pickett's Mill. In addition, Symonds unravels the \"mystery\" of Spring Hill and recounts Cleburne's dramatic and untimely death (at the age of 36) at Franklin, Tennessee, where he charged the enemy line on foot after having two horses shot from under him.Symonds also explores Cleburne's role in the complicated personal politics of the Army of Tennessee, as well as his astonishing proposal that the decimated Confederate ranks be filled by ending slavery and arming blacks against the Union.Symonds' definitive and immensely readable narrative casts new light on Cleburne, on the Army of Tennessee, and on the Civil War in the West. It finally and firmly establishes Cleburne's rightful place in the pantheon of Southern military heroes.",
  "genres": [
    "Civil War",
    "History",
    "Biography",
    "American Civil War",
    "Nonfiction",
    "American History",
    "Civil War Western Theater"
  ],
  "author": "Craig L. Symonds",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/1035011.Stonewall_of_the_West"
}