{
  "title": "Her Mother's Hope",
  "description": "Book one in the bestselling series that has captivated millions of readers around the world!A New York Times, USA Today, and Publisher’s Weekly bestseller.“ Her Mother’s Hope has all the meaty elements of a blockbuster.” ― Denver PostThe first in a two-book family saga by the beloved author of Redeeming Love and The Masterpiece , Her Mother’s Hope is a rich, moving epic about faith and dreams, heartache and disappointment, and the legacy of love passed down through four generations in one family.Near the turn of the twentieth century, fiery Marta Schneider leaves Switzerland for a better life, determined to fulfill her mother’s hope. Her formative journey takes her through Europe and eventually to Canada, where she meets handsome Niclas Waltert. But nothing has prepared her for the sacrifices she must make for marriage and motherhood as she travels to the Canadian wilderness and then to the dusty Central Valley of California to raise her family.Marta’s hope is to give her children a better life, but experience has taught her that only the strong survive. Her tough love is often misunderstood, especially by her oldest daughter, Hildemara Rose, who craves her mother’s acceptance.Amid the drama of World War II, Hildie falls in love and begins a family of her own. But unexpected and tragic events force mother and daughter to face their own shortcomings and the ever-widening chasm that threatens to separate them forever.“Emotionally rich. . . . As her compelling characters seek to do what they feel their faith demands, Rivers sets their resonant struggles against dusty streets, windswept Canadian plains, and California vineyards in vivid scenes readers will not soon forget.” ― Booklist , starred review“Writers like Rivers are why people buy Christian it’s dramatic, engaging . . . [and] this well-told tale will have readers eagerly awaiting the story’s resolution.” ― Publishers Weekly",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Historical Fiction",
    "Christian",
    "Historical",
    "Book Club",
    "Romance"
  ],
  "author": "Francine  Rivers",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/9400688-her-mother-s-hope"
}