{
  "title": "Subversia",
  "description": "In this bare-knuckled, frankly autobiographical collection, D.R. Haney shares a series of personal essays on his life, struggles, and artistic evolution; from punk-rock malcontent in 1980s New York, to B-movie actor in the films of Roger Corman; to screenwriter on Friday the 13th Part VII; to expatriated American writer in Serbia; to author of the celebrated underground novel Banned for Life. Consisting of material originally published by the popular online literary magazine The Nervous Breakdown, Subversia is written with the bracing candor and lyrical beauty that have earned Haney a well-deserved cult following worldwide. \"Subversia is an excellent collection of autobiographical short pieces, original and often raw...Haney is what you could call an authentically authentic voice—he comes out of the mold of beat-punk Kerouac worship, which has inspired enough writing and music making that it should be considered genre, and judged by its own standards...but, if such a genre exists, then Haney rises above it easily. He is a near-master of the final sentence, the one that pulls it all together and adds a dimension to the whole piece...\" - L.A. Observed\"...a fast ride on the wild side...Subversia is an accounting of real life in perfect focus...\" - The New York Journal of Books\"Frequently heartfelt and personal, Haney interweaves tiny details with weighty subjects deftly, through articles smartly ordered for just the right balance of thematic lilt and interest-holding lurch...[he] writes in a way that is infectious and gimmick-free...his enthusiasm for people, creativity and the whole world, is bottomless...[Subversia is] a joyful read on depressing subjects, and the consistency and precision of the writing makes it work.\" - PANK Magazine\"...whether he’s fantasizing about killing his talkative girlfriend (and then sharing that thought with her) or taking a shower for his camp counselor’s private Kodak moment—no matter how ugly, Haney just puts it out there without care or thought to judgment.\" - BookFetish \"Drug abuse, wild punk rock concerts, a short-lived James Dean icon phase, a car accident that nearly killed him, all of the shitty side jobs he worked and screenplays he wrote to keep a dollar in his pocket... it's all in here...Subversia reads like a conversation between two very close friends.\" - The Next Best Book Blog \"...a series of vivid episodes—formative and destructive, hilarious and heartbreaking—that illuminate the mind of an intense soul whose charisma is outshined only by his unrelenting honesty.\" - Richard Cox, author of Rift and The God Particle\"D.R. Haney may very well be the illegitimate love child of Henry Rollins and David Sedaris.\" - Jeff Martin, author of My Dog Ate My Nobel Prize and editor of The Customer Is Always Wrong: The Retail Chronicles\"Haney's blend of intoxicating content, sharply selected language, and unexpected humor is better than all the heroin in Serbia.\" - Lenore Zion, author of My Dead Pets Are Interesting\"Haney is absolutely compelling. You'll want to read his pieces over and over, and each time you'll marvel at how he took you someplace utterly different than the time before.\" - Robin Antalek, author of The Summer We Fell Apart\"It is a tribute to Haney's immense charisma, brutal honesty, and charming prose that in spite of everything he confesses, one can't help but fall hopelessly in love with him.\" - Jessica Anya Blau, author of The Summer of Naked Swim Parties and Drinking Closer to Home \"The man writes a book. It is a great book of fiction. How will I ever top this? he says. He walks around, and sits and thinks. Then he writes a great book of essays.\" - Ben Loory, author of Stories for Nighttime and Some for the Day",
  "genres": [
    "Essays",
    "Biography",
    "Memoir",
    "Nonfiction"
  ],
  "author": "Duke Haney",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/9397197-subversia"
}