{
  "title": "Black Light",
  "description": "Bob Lee Swagger has seen -- and delivered -- dozens of deaths. As a United States Marine sniper in Vietnam, his astonishing accuracy with a rifle earned him the nickname \"Bob the Nailer\"; twenty years later he was forced to kill again to unravel a brutal conspiracy (in Stephen Hunter's classic Point of Impact). Now happily secluded with his wife and young daughter in the Arizona desert, Swagger believes all the killing is behind him. Until a young writer, Russ Pewtie, arrives at his door with troubling questions about the past.Forty years earlier, Swagger's father, a dedicated state trooper, was gunned down by two robbers in a sensational shoot-out just outside of Blue Eye, Arkansas. Faced with Russ's persistence and a desire to make peace with a father he never really knew, Swagger decides to discover what really happened that long-ago Arkansas night. But as soon becomes clear, powerful people don't want the truth uncovered -- and Swagger must use all his combat skills and ruthless cunning to survive.Like the infrared \"black light\" that exposes a sniper's target in the dead of night, Swagger homes in on the shadowy figures desperate to keep the secret of his father's murder buried. And with the relentless you-must-turn-the-page suspense that is Stephen Hunter's trademark Black Light accelerates to its exhilarating climax -- an explosion of gunfire that blasts open the secrets of two generations.With Black Light, Stephen Hunter solidifies his reputation as the best thriller writer in business.Stephen Hunter spent two years in the United States Army and since 1971 has been on the staff of the Baltimore Sun, where he is now the film critic. Hes is the author of seven previous novels, including Dirty White Boys, Point of Impact and The Day Before Midnight. He lives in Columbia, Maryland.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Action",
    "Crime",
    "Horror",
    "Suspense"
  ],
  "author": "Stephen Hunter",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/940676.Black_Light"
}