{
  "title": "Amorous Appetites: A History Of Sex and Food",
  "description": "No town can live peacefully, whatever its laws, when its citizens...do nothing but feast and drink and tire themselves out in the cares of love. Plato From antiquity to present day, people have consciously and unconsciously intermingled sex with food. Languages around the world are full of sex-food metaphors. Chaucer, Rabelais, Shakespeare, Swift and Balzac all employed them, and that literary genre referred to as the picaresque brought sex and food together to create some of modernity's most commonly used \"dirty words.\" Bread, sugar, coffee, tomatoes, chocolate, and wine all have fantastic histories, especially when it comes sex. Edible aphrodisiacs and anaphrodisiacs have been discussed, explored and sold for thousands of years and food has been blamed for sexual excess and the lack of it for as long. Even America's Jazz musicians showed no fear when they wrote sexy food lyrics that thrilled 1920s audiences with lines that would make the 21st century reader blush. Anorexia has a very long history, all about women manipulating their bodies with - and without - food, in order to avoid sex. Enter the \"Holy Anorexics.\" And the conflicts of the late 20th and early 21st centuries have led to what sociologists have called \"food insecurity, better known by its historical reference, prostitution. World War II brought Rosie the Riveter who returned to the home after the war, where she was expected to be the perfect wife, mother, and cook. Or, as the founder of Betty Crocker put '...good things baked in the kitchen will keep romance alive longer than bright lipstick.' Today, the tradition of women doing the cooking has been turned on its head by the gastro sexual movement. Men have discovered just how sexy women find a man who is good...in the kitchen.",
  "genres": [
    "History"
  ],
  "author": "Aine Collier",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/13186694-amorous-appetites"
}