{
  "title": "A Vampire's Tale",
  "description": "After their honeymoon was rudely interrupted by Tanis’ brother and ex-wife, Jay Dee and Tanis go to a resort in Arizona in order to forget about their horrible wedding night before heading to Wales to meet Tanis’ cover. While on the road, they stop and help a stranger. Instantly Tanis realizes something is wrong when Tayte starts speaking Norwegian to them; an Aslak spy? Tanis starts having dreams, but they are more than that. They are memories, and one is of being told the location of the secret army meant to fight to save Jay Dee. Jay Dee is kidnapped while hunting with Tanis after they were ambushed by Aslak soldiers. However it wasn’t the Aslak that took her, it was Tayte, the younger brother of the man Jay Dee was supposed to marry. Tayte wants to take her to his brother, to give him a chance, when Jay Dee realizes that his brother isn’t the same that Toran introduced her to, they were Aslak spies. With d'Artagnan’s help, Tanis finds Jay Dee and more than they had bargained for, a terrifying, trigger happy, Alchemist named Soleil that is married to Tayte. Jay Dee reunites with her brother Jarvis while passing through to Wales, and they are attacked on the streets of Moscow, and Jarvis decides to quit school in order to protect his sister. In Wales, Jay Dee meets Tanis’ coven, and one of the vampires stands out; Declan. Declan is like Tanis, more human than most, and he has taken a special liking to Jay Dee. Declan called werewolves mom and dad, two keepers of Queen Aesa, Jay Dee’s biological mother, secrets. It appears that Aesa placed watchers in various places around the world in order to find and protect those that are more human than most of the vampire variety in order to secure her daughter’s future and husband. However, what no one expected was Declan’s biological daughter, half vampire half witch, Naoise, who knows the location of the next totem in order to find Aesa’s army so they can defeat the Aslak.",
  "genres": [
    "Urban Fantasy"
  ],
  "author": "Danae Ayusso",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/9404923-a-vampire-s-tale"
}