{
  "title": "Known and Unknown",
  "description": "Like Donald Rumsfeld, Known and Unknown pulls no punches.  With the same directness that defined his career in public service, Rumsfeld's memoir is filled with previously undisclosed details and insights about the Bush administration, 9/11, and the wars in Afghanistan and Iraq. It also features Rumsfeld's unique and often surprising observations on eight decades of history: his experiences growing up during the Depression and World War II, his time as a Naval aviator; his service in Congress starting at age 30; his cabinet level positions in the Nixon and Ford White Houses; his assignments in the Reagan administration; and his years as a successful business executive in the private sector.  Rumsfeld addresses the challenges and controversies of his illustrious career, from the unseating of the entrenched House Republican leader in 1965, to helping the Ford administration steer the country away from Watergate and Vietnam, to bruising battles over transforming the military for the 21st century, to the war in Iraq, to confronting abuse at Abu Ghraib and allegations of torture at Guantanamo Bay.  Along the way, he offers his plainspoken, first-hand views and often humorous and surprising anecdotes about some of the world's best known figures, from Margaret Thatcher to Saddam Hussein, from Henry Kissinger to Colin Powell, from Elvis Presley to Dick Cheney, and each American president from Dwight D. Eisenhower to George W. Bush.  Rumsfeld relies not only on his memory but also on previously unreleased and recently declassified documents. Thousands of pages of documents not yet seen by the public will be made available on an accompanying website. Known and Unknown delivers both a fascinating narrative for today's readers and an unprecedented resource for tomorrow's historians.",
  "genres": [
    "Politics",
    "Biography",
    "History",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Military Fiction"
  ],
  "author": "Donald Rumsfeld",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/9403549-known-and-unknown"
}