{
  "title": "Kidnapped American Children: Murder of Samantha Runnion, Lindbergh Kidnapping, Kidnapping of Jaycee Lee Dugard, Johnny Gosch, Steven Stayner, Georg",
  "description": "Please note that the content of this book primarily consists of articles available from Wikipedia or other free sources online. Pages: 48. Chapters: Murder of Samantha Runnion, Lindbergh kidnapping, Kidnapping of Jaycee Lee Dugard, Johnny Gosch, Steven Stayner, George Weyerhaeuser kidnapping, Murder of Adam Walsh, Carlina White kidnapping, Bizzy Bone, Bobby Dunbar, Edward Cudahy, Jr., Jessica Lunsford, Lyon sisters, Peggy Ann Bradnick, Amy Mihaljevic, Elizabeth Smart, Sandra Cantu homicide, Murder of Polly Klaas, Charley Ross, June Robles, Erica Pratt, Marion Parker, Jimmy Ryce, Jeanine Nicarico murder case, Michaela Garecht, Goldman child abduction case, Michael Anthony Hughes, Etan Patz, Bobby Greenlease, Jacob Wetterling, Murder of Charlie Keever, Jonathan Sellers, Kevin Andrew Collins, Kiplyn Davis, Paul Martin Andrews, Shauna Howe, Florence Sally Horner, Katie Beers kidnapping, Steven Damman, Marci Klein, Levi Frady. Excerpt: The kidnapping of Charles Augustus Lindbergh, Jr., was the abduction of the son of aviator Charles Lindbergh and Anne Morrow Lindbergh. The toddler, 18 months old at the time, was abducted from his family home in East Amwell, New Jersey, near the town of Hopewell, New Jersey, on the evening of March 1, 1932. Over two months later, on May 12, 1932, his body was discovered a short distance from the Lindberghs' home. A medical examination determined that the cause of death was a massive skull fracture. After an investigation that lasted more than two years, Bruno Richard Hauptmann was arrested and charged with the crime. In a trial that was held from January 2 to February 13, 1935, Hauptmann was found guilty of murder in the first degree and sentenced to death. He was executed by electric chair at the New Jersey State Prison on April 3, 1936, at 8:44 in the evening. Hauptmann proclaimed his innocence to the end. Newspaper writer H. L. Mencken called the kidnapping and subsequent trial \"the biggest story since the Resurrection.\" The...",
  "genres": [],
  "author": "Books LLC",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/9411711-kidnapped-american-children"
}