{
  "title": "Riddley Walker",
  "description": "\"A hero with Huck Finn's heart and charm, lighting by El Greco and jokes by Punch and Judy.... Riddley Walker is haunting and fiercely imagined andâ this matters mostâ intensely ponderable.\" â Benjamin DeMott, The New York Times Book Review\"This is what literature is meant to be.\" â Anthony Burgess\"Russell Hoban has brought off an extraordinary feat of imagination and style.... The conviction and consistency are total. Funny, terrible, haunting and unsettling, this book is a masterpiece.\" â Anthony Thwaite, Observer\"Extraordinary... Suffused with melancholy and wonder, beautifully written, Riddley Walker is a novel that people will be reading for a long, long time.\" â Michael Dirda, Washington Post Book World\"Stunning, delicious, designed to prevent the modern reader from becoming stupid.\" â John Leonard, The New York Times\"Highly enjoyable... An intriguing plot... Ferociously inventive.\" â Walter Clemons, Newsweek\"Astounding... Hoban's soaring flight of imagination is that golden rarity, a dazzlingly realized work of genius.\" â Jane Clapperton, Cosmopolitan\"An imaginative intensity that is rare in contemporary fiction.' â Paul Gray, TimeRiddley Walker is a brilliant, unique, completely realized work of fiction. One reads it again and again, discovering new wonders every time through. Set in a remote future in a post-nuclear holocaust England (Inland), Hoban has imagined a humanity regressed to an iron-age, semi-literate stateâ and invented a language to represent it. Riddley is at once the Huck Finn and the Stephen Dedalus of his cultureâ rebel, change agent, and artist. Read again or for the first time this masterpiece of 20th-century literature with new material by the author.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Post Apocalyptic",
    "Dystopia",
    "Speculative Fiction",
    "Fantasy",
    "Apocalyptic"
  ],
  "author": "Russell Hoban",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/941149.Riddley_Walker"
}