{
  "title": "Gunnar's Game",
  "description": "Paranormal Shape-shifter Dawn Endeavor; Previous Julian's JeopardyGenetic manipulation has created the first super soldier, the Circ. The second generation of Circs, able to transform into hulking, inhuman beasts at will and psychically gifted is much more dangerous than the first. Under Project Dawn Endeavor, the secret four-man team belongs to the mysterious Mrs. Sharpe who is bent on cleaning up science gone wrong around the globe on behalf of the United States government. But there’s more to her agenda than patriotism. If only the team knew what she really had planned.Gunnar Tersch has never met a man he couldn’t defeat. There’s no one stronger than this Viking come to life, and he knows it. When the team needs an extra push, he unleashes the berserker inside him and clears a path through the enemy. Except lately, it’s all he can do to control the monster within. It’s worse since he knows the truth about Ava, the woman his beast, his berserker, and Gunnar, the man, want to claim as mate. Yet Gunnar can barely say the word “love” without sneering.A tragic event in his past has assured him he’s not a safe man to be the violence that rages inside him can too easily hurt those he loves. But Ava won’t keep her distance, convinced she can trick him into loving her. Too late, because he already does, though he has no plans to act on his feelings. Soon Gunnar has more to worry about than the crafty beauty, because there’s deceit at the heart of their team. Only by trusting in himself and his feelings can Gunnar help avert the end of Dawn Endeavor and all he holds dear.Publisher's This book contains explicit sexual content, graphic language, and situations that some readers may find Menage/moresome (m/m/m/m), sex in shifted form.",
  "genres": [
    "Paranormal",
    "Menage",
    "Paranormal Romance",
    "Romance",
    "M M Romance",
    "Shapeshifters",
    "Erotica"
  ],
  "author": "Marie Harte",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/9408261-gunnar-s-game"
}