{
  "title": "Moon Rising",
  "description": "Marinette (Nessy) is half vampire and half human flees her maker Hervidor, the strongest of their kind and the ruler of the underworld of vampires. As Nessy flees to be able to live her life as she chooses, her vengeance for the coven Hervidor created, The Tellis coven rises to the surface as she ventures into unknown parts of life that she has never seen or experienced. Hervidor has kept Nessy locked away for centuries, his taunting and those tauntings of his coven have made Nessy stronger and one day capable of fleeing his grasp. As she runs through the unknown woods with her thirst on high alert she meets Charles and his coven, their ways and teachings of the new world that Nessy hasn't seen before are shocking and exciting to Nessy who quickly learns to adjust and adapt so she can easily walk among humans during both day and night. Nessy quickly falls in love with Charles and they seal the bond that will capture and seal them together for eternity, their love being sealed and both of them finding their mate to walk the earth for as long as either one of them shall survive the passage of time and the changes it brings. With the threat of Hervidor constantly at their heels and Nessy trying to run and making that final decision to stand and face him in the fight that will decide her fate, the Gulon and their own pack of cats become involved Heracio (Hera) is Nessy's biological cousin and decides to impart to Nessy the many family traits she wasn't aware off as a human, her own self discovery becomes apparent as she too transforms into the Gulon creature. As the biggest and strongest of the Gulon and long ago destined to become their leader, Nessy hands over the reins of the leadership back to Hera, claiming the ownership is his by mutual right, mutual consent and adoration of his pack. As Nessy tries to come to terms with the changes happening to her and around her, she continues to slide on the path of love, together Charles, his coven and Nessy make the final stand against Hervidor and the detested Tellis coven to banish them from the earth but will they succeed in banishing Hervidor and his coven?",
  "genres": [
    "Paranormal",
    "Vampires",
    "Romance"
  ],
  "author": "Laurie Bowler",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/9407664-moon-rising"
}