{
  "title": "Letters from Home",
  "description": "A Goodreads Choice Awards Semifinalist for Best Historical Fiction by New York Times and USA Today bestselling author Kristina McMorrisInspired by her grandparents’ WWII courtship letters, New York Times bestselling author Kristina McMorris delivers a moving tale of friendship, family, and the twists of fate that change us forever…It’s 1944, and although foreign battles are escalating, the war seems distant in every way to sensible college student Liz Stephens. That is, until her chance encounter with charming infantryman Morgan McClain at a USO dance in Chicago. Their deep connection feels mutual to Liz, but to her dismay, her bombshell roommate Betty is the one who promises to write the deploying soldier. Singer Betty Cordell delights in the prospect of a dashing serviceman filling her life with adventure, marital bliss, and societal circles outranking her modest roots. It only makes sense for her to beg Liz for help penning an eloquent letter to Morgan, now bound for a dangerous front. After all, she’s certain the beauty of Liz’s ghostwritten prose would ensure a courtship as enviable as their roommate Julia’s relationship with her beloved sailor—and Betty is right, though not how she foresees. Likewise, Julia Renard’s betrothal is more complicated than it appears. When tempting opportunities arise, the future she always envisioned as a devoted wife and mother risks derailment. And yet, as the Allies edge toward victory, every person—through heart-wrenching choices and life-altering letters—will discover within themselves profound courage, bittersweet hope, and the true meaning of home.  ******************************************\"A gripping and memorable story, Letters from Home is a timeless lesson in love and loss and the moments that shape our lives.\"—Pam Jenoff, New York Times bestselling author of The Lost Girls of Paris",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "World War II",
    "Historical",
    "Historical Romance",
    "War"
  ],
  "author": "Kristina McMorris",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/9413657-letters-from-home"
}