{
  "title": "Rachel Calof's Story: Jewish Homesteader on the Northern Plains",
  "description": "\"Calof's [story] has the 'electricity' one occasionally finds in primary sources. It is powerful, shocking, and primitive, with the kind of appeal primary sources often attain without effort. . . . it is a strong addition to the literature of women's experience on the frontier.\" ―Lillian SchlisselIn 1894, eighteen-year-old Rachel Bella Kahn travelled from Russia to the United States for an arranged marriage to Abraham Calof, an immigrant homesteader in North Dakota. Rachel Calof's Story combines her memoir of a hard pioneering life on the prairie with scholarly essays that provide historical and cultural background and show her narrative to be both unique and a representative western tale. Her narrative is riveting and candid, laced with humor and irony.The memoir, written by Rachel Bella Calof in 1936, recounts aspects of her childhood and teenage years in a Jewish community, (shtetl) in Russia, but focuses largely on her life between 1894 and 1904, when she and her husband carved out a life as homesteaders. She recalls her horror at the hardships of pioneer life―especially the crowding of many family members into the 12 x 14' dirt-floored shanties that were their first dwellings. \"Of all the privations I knew as a homesteader,\" says Calof, \"the lack of privacy was the hardest to bear.\" Money, food, and fuel were scarce, and during bitter winters, three Calof households―Abraham and Rachel with their growing children, along with his parents and a brother's family―would pool resources and live together (with livestock) in one shanty.Under harsh and primitive conditions, Rachel Bella Calof bore and raised nine children. The family withstood many dangers, including hailstorms that hammered wheat to the ground and flooded their home; droughts that reduced crops to dust; blinding snowstorms of plains winters. Through it all, however, Calof drew on a humor and resolve that is everywhere apparent in her narrative. Always striving to improve her living conditions, she made lamps from dried mud, scraps of rag, and butter; plastered the cracked wood walls of her home with clay; supplemented meagre supplies with prairie forage―wild mushrooms and garlic for a special supper, dry grass for a hot fire to bake bread. Never sentimental, Caolf's memoir is a vital historical and personal record.J. Sanford Rikoon elaborates on the history of Jewish settlement in the rural heartland and the great tide of immigration from the Russian Pale of Settlement and Eastern Europe from 1880–1910. Elizabeth Jameson examines how Calof \"writes from the interior spaces of private life, and from that vantage point, reconfigures more familiar versions of the American West.\" Jameson also discusses how the Calofs adapted Jewish practices to the new contingencies of North Dakota, maintaining customs that represented the core of their Jewish identity, reconstructing their \"Jewishness\" in new circumstances.",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "Biography",
    "Jewish",
    "Womens",
    "American History"
  ],
  "author": "Rachel Calof",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/942921.Rachel_Calof_s_Story"
}