{
  "title": "Poems of Heinrich Heine",
  "description": "Excerpt from Poems of Heinrich Heine: Three Hundred and Twenty-Five Poems, Selected and TranslatedBut it needs something more than a list of antitheses to understand this restless genius, a confusing figure who has been paired with such names as Catullus, Aristophanes, Burns, Rabelais, Cervantes, Voltaire, Swift, Villon - in fact to every writer who is known as a master of either simplicity or irony. It needs a close and interpretive reading of his Book of Songs it needs a general knowledge of the politically experimental and altogether chaotic times of which he was so fiery a product; and it needs, first and last, the constant reminder that Heine was a sensitive Jew, born in a savagely anti-semitic country that taught him, even as a child, that Jew and pariah were synonymous terms. The traditions and tyrannies that weighed down on all the German people of his day were slight compared to the oppressions imposed upon the Jews. The demands upon them, the petty persecu tions, the rigorous orders and taboos would form an incredible list. Let these few facts suffice: In Frank fort, when Heine was a boy, no Jew might enter a park or pleasure resort; no Jew might leave his ghetto after four o'clock on a Sunday afternoon; and only twenty four Jews were allowed to marry in one year. In such an atmosphere Heine received his heritage of hate and his baptism of fire.About the PublisherForgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.comThis book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works.",
  "genres": [
    "Poetry",
    "German Literature",
    "Classics",
    "Germany",
    "Literature",
    "Fiction",
    "19th Century"
  ],
  "author": "Heinrich Heine",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/9424093-poems-of-heinrich-heine"
}