{
  "title": "Leaving Neverland: Why Little Boys Shouldn't Run Big Corporations",
  "description": "'An insightful depiction of the dangers we face in having the perpetual ‘boys’ of this world in positions of power - incomplete men with arrested development. The style, pace and delightful skewering are reminiscent of Hunter S Thomson!’Rex Finch, Finch Publishing.Daniel Prokop takes a humorous, satirical swipe at the adolescent society we live in which is gradually sinking under a sea of depression, environmental degradation, corporate, military and parental domination and the sea, see? We live in a world where growing up is seen as bad, boring even stupid but the consequences of living in Neverland are catching up with us. imagine a world where responsibility isn't a four letter word times 3 1/2 (the maths is correct). Try to think of a world where a person's physical maturity is limited to their level of emotional maturity i.e. if you consistently behave like a petulant, spoiled child then your body size never gets bigger than that of a child. Fun, huh? Rites of Passage are our missing link between emotional maturity and physical maturity.They are our way out of Neverland.It is time for us to start to grow up. It is actually that simple. The difficulty of course, is that growing up is much easier said than done. Just shouting “Grow up!” or “Act your age, not your shoe size!” does not work. Fortunately Rites of Passage offer a timely solution to the growing up conundrum. Without Rites of Passage many people can get stuck in the adolescent stage and some people never escape it. It is time for us to Leave Neverland for our sake, for our children's sake, ffs (for our future's sake)Published by Continuum Media a division of Continuum Media. First Chapter available free from http://leavingneverland.net/?q=conten...Was launched at the Byron Bay Writer's Festival in august 2010. see menu/writers/book launcheshttp://www.byronbaywritersfestival.co...",
  "genres": [
    "Economics"
  ],
  "author": "Daniel  Prokop",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/9426615-leaving-neverland"
}