{
  "title": "Blind Alley",
  "description": "The New York Times bestselling author of Firestorm, Iris Johansen, returns with a psychological thriller so terrifying, so relentlessly paced, it won’t leave you time to catch your breath before the next shock comes. A forensic sculptor is locked in a deadly duel with a serial killer determined to destroy her—one life at a time.Eve Duncan’s job is to put a face on the faceless victims of violent crimes. Her work not only comforts their survivors—but helps catch their killers. But there is another, more personal reason that Eve Duncan is driven to do the kind of work she does—a dark nightmare from a past she can never bury. And as she works on the skull of a newly discovered victim, that past is about to return all over again.The victim is a Jane Doe found murdered, her face erased beyond recognition. But whoever killed her wasn’t just trying to hide her identity. The plan was far more horrifying. For as the face forms under Eve’s skilled hands, she is about to get the shock of her life. The victim is someone she knows all too well. Someone who isn’t dead. Yet.Instantly Eve’s peaceful life is shattered. The sanctuary of the lakeside cottage she shares with Atlanta detective Joe Quinn and their adopted daughter Jane has been invaded by a killer who’s sent the grimmest of threats: the face of his next victim. To stop him, Eve must put her own life in the balance and question everything and everyone she trusts. Not even Quinn can go where Eve must go this time. As the trail of faceless bodies leads to a chilling revelation, Eve finds herself trying to catch a master murderer whose grisly work is a testament to a mind warped by perversion and revenge. Now she must pit her skills against his in a showdown where the stakes are life itself—and where the unbearable cost of failure will make Eve’s own murder seem like a mercy killing.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Romance",
    "Crime"
  ],
  "author": "Iris Johansen",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/94306.Blind_Alley"
}