{
  "title": "Killer Dreams",
  "description": "The #1 New York Times bestselling author of Countdown returns with a knock-out suspense thriller that pits a mother and son against a killer who's the stuff of nightmares.If you close your eyes, he’ll get you. Sophie Dunston knows all too well how dreams can kill. As one of the nation’s top sleep therapists, she specializes in the life-threatening night terrors that her ten-year-old son, Michael, suffers from. But she is also an expert in another kind of terror–the kind that can turn a dream life into a living nightmare in the blink of an eye.Someone is watching. He’s a shadowy figure from out of her darkest fears and he hasn’t forgotten her. In one shocking moment of violence, he’d shattered Sophie’s world forever and left her with only one thing to live for: her son. But the nightmare isn’t over for Sophie Dunston. It’s just begun. He’s been waiting. Sophie was supposed to die the first time around, but fate intervened. This time he’ll make sure that not even a miracle will save her.It wasn’t a miracle that saved Jock Gavin, but it was pretty close. A semiretired hit man, commando, and jack-of-all-deadly-trades, he knows what Sophie is up against–and that she’ll need help. But the man he’s chosen for the job is as unpredictable as he is dangerous. Matt Royd is a wild card–hard, cool, merciless–and putting him into play changes the game completely. But to whose advantage?Sophie will soon find out. She will have to trust Royd because she has no choices left. Because the bogeyman haunting her dreams is all too real and he’s on the hunt again. Because the nightmare he’s got planned for Sophie won’t end when she wakes up screaming. It won’t end. Ever.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Suspense",
    "Thriller",
    "Romance",
    "Fiction",
    "Romantic Suspense",
    "Mystery Thriller"
  ],
  "author": "Iris Johansen",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/94302.Killer_Dreams"
}