{
  "title": "Gottes Werk und Teufels Beitrag",
  "description": "»Hier in Saint-Cloud’s haben wir nur ein Problem«, schreibt Dr. Wilbur Larch, Amateurhistoriker, Arzt, pessimistischer Philanthrop und Waisenhausvorsteher 193... in sein Miszellenjournal, »und sein Name ist Homer Wells.« Homer Wells ist anders als die andern Waisen, welche von ihren Müttern in dem gottverlassenen Waisenhaus hinter den grünen und nebelverhangenen Hügeln und Wäldern von Maine zurückgelassen werden: Er will nicht weg. Nach vier gescheiterten Adoptionsversuchen erlaubt Dr. Larch daher Homer, Saint-Cloud’s zu seinem Zuhause zu machen – unter einer Bedingung: dass er sich nützlich mache. Und wie macht man sich in einem Waisenhaus mit angeschlossener Entbindungs- und Abtreibungsstation anders nützlich, als indem man ›Sankt‹ Larch (wie dieser von den ihm über vierzig Jahre aufopfernd zur Seite stehenden Schwestern Angela und Edna genannt wird) bei »Gottes Werk« – dem Entbinden – und bei »Teufels Beitrag« – dem Abtreiben – assistiert. Denn nach Dr. Larchs Ansicht sollte jede Frau, die nach Saint-Cloud’s gekommen ist, die freie Entscheidung haben darüber, was sie will: eine Abtreibung oder eine Waise. Sankt Larch weiß, dass sein Jünger – ›Arzt‹ und Abtreiber wider Willen – Saint-Cloud’s verlassen wird. Auch eine Waise muss wählen können. Doch Homer hat mit Melony, dem tyrannischen Schlägerweib aus der Mädchenabteilung, die ihn in die Sexualität einführt, einen Pakt abgeschlossen: »Solange ich bleibe, bleibst auch du, Sonnenstrahl.« Homers Weg führt ihn zu den paradiesischen Apfelgärten von Ocean View, wo er die Freundschaft und die Freiheit kennenlernt, den Lobster, die Regeln der Apfelpflücker, das Böse und wozu Drive-in-Kinos da sind, wie man Äpfel erntet und was es heißt, sich zu verlieben. Doch das Unglück erreicht auch Ocean View (und nicht nur in der Gestalt der rachsüchtigen Melony). Während in Saint-Cloud’s ein alternder Dr. Larch immer öfter in Ätherräuschen und in der fiktiven Welt seines Miszellenjournals Zuflucht sucht und über Pearl Harbor die Bomben niedergehen, befindet sich Homer bereits auf dem Weg, der ihn unweigerlich zurückführt nach Saint-Cloud’s.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Literature",
    "Literary Fiction",
    "Contemporary",
    "Novels"
  ],
  "author": "John Irving",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/942197.Gottes_Werk_und_Teufels_Beitrag"
}