{
  "title": "The Fist",
  "description": "A collection of five erotic short stories with explicit sexual male on male action including fisting and anal penetration.The Fist by G.R. RichardsWhen The Fist finds a slab of shortening in Deepack’s locker, he wants to know what it’s for and he just won’t let it go. In the end, things get very heated on the factory floor and a crew of turned-on men can make a lot of noise. Eventually, they have to turn the compacting machine on to mask their yells of excitement.Wired by Landon DixonTim, the sparky, is on the job when he catches his bosses, Elliot and Dan on the job too. Unaware they know he’s watching he ‘enjoys’ their display. The next day, Elliot accuses him of being a pervert and says he’s going to teach him a lesson he won’t forget in a hurry. Tied to the bed with his own wire, Tim is in no hurry for the lesson to finish.Unleashing A Demon by Eva HoreI knew I was gay, but I wasn’t sure if Brad knew what he wanted. So when we end up alone on a hot nudist beach, I’m nervous as well as excited. But it isn’t long before Brad is making some pretty hot moves.The Running Man by Jade TaylorMatt loves running, but the thought of his sexy next-door neighbour, Josh, always has him running faster towards home than away from it. He’s too shy to make a move but then Josh asks him to help move a box from his wardrobe. The box breaks to reveal its contents: Dozens of pictures of men in erotic poses. And very soon Matt and Josh are trying out some erotic poses of their own.Basic Rules of Anal Sex by Kay JaybeeNew to London, Rob visits a club, and is handed a note by a stranger. The list is headed up Basic Rules of Anal Sex. When the stranger invites Rob back to his flat he goes without question. But will they both stick to the rules?These stories have also been published in Boy Fun.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Anthologies",
    "Erotica"
  ],
  "author": "Lucas Steele",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/9428757-the-fist"
}