{
  "title": "Countdown",
  "description": "When it reaches zero, you die.#1 New York Times bestselling author Iris Johansen sets her readers’ pulses racing once again in this relentless psychological thriller of a young woman caught in a maze of secrets and stalked by a merciless killer. The countdown begins the moment you open this riveting novel that only grows more electrifying as the pages turn, more exciting as time runs out. . . .“Don’t kill her. She’s no good to us dead.” These words haunt Jane MacGuire after a shocking attack shatters her world in an instant. Was it a random kidnapping attempt–or the countdown to something far more sinister?Who is after her–and what do they want so badly they’ll kill anyone in their way? That’s what Jane is determined to find out, without the help of the police, the FBI, or her adoptive parents, forensic sculptor Eve Duncan and her husband, Joe Quinn, of the Atlanta PD–because whoever is after her won’t hesitate to hurt those she loves the most. Now Jane will go on the run with the only man who may be more dangerous than those who are pursuing her. A smuggler, a con man, and who knew what else, Mark Trevor had his own mysterious reasons for wanting to keep Jane safe and out of the hands of a killer obsessed with a two-thousand-year-old mystery that could rock the modern-day world. Orphaned at an early age, Jane grew up the hard way, but she was given a new life, a loving family, and a chance to pursue her interest in one of the greatest archaeological finds ever unearthed. Now someone was trying to destroy that new life before it could even get started. The past is returning with the kind of vengeance that knows no mercy. The countdown has already begun, and it’s approaching zero faster than anyone thinks.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Romance",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "Iris Johansen",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/94301.Countdown"
}