{
  "title": "Anna in the Tropics",
  "description": "Winner of the 2003 Pulitzer Prize for Drama. . . there are many kinds of light.The light of fires. The light of stars.The light that reflects off rivers.Light that penetrates through cracks.Then there’s the type of light that reflects off the skin.—Nilo Cruz, Anna in the TropicsThis lush romantic drama depicts a family of cigar makers whose loves and lives are played out against the backdrop of Depression-era America. Set in Ybor City (Tampa) in 1930, Cruz imagines the catalytic effect the arrival of a new \"lector\" (who reads Tolstoy’s Anna Karenina to the workers as they toil in the cigar factory) has on a Cuban-American family. Cruz celebrates the search for identity in a new land.\"The words of Nilo Cruz waft from the stage like a scented breeze. They sparkle and prickle and swirl, enveloping those who listen in both specific place and time . . . and in timeless passions that touch us all. In Anna in the Tropics , Cruz claims his place as a storyteller of intricate craftsmanship and poetic power.\"— Miami Herald“Deeply engrossing.” –Robert Hurwitt, San Francisco Chronicle“Earnestly poetic…Mr. Cruz has created a work as wistful and affectingly ambitious as its characters. Anna in the Tropics reaches for the artistic heavens -- specifically, that corner of eternity occupied by the plays of Anton Chekhov, where yearning is an existential condition.” –Ben Brantley, New York TimesNilo Cruz is a young Cuban-American playwright whose work has been produced widely around the United States, including the Public Theater (New York, NY), South Coast Repertory (Costa Mesa, CA), Magic Theatre (San Francisco, CA), Oregon Shakespeare Festival, McCarter Theater (Princeton, NJ) and New Theatre (Coral Gables, FL). His other plays include Night Train to Bolina, Two Sisters and a Piano, Hortensia and the Museum of Dreams, and Anna in the Tropics (Winner of 2003 Pulitzer Prize). Mr. Cruz teaches playwriting at Yale University and lives in New York City.",
  "genres": [
    "Plays",
    "Drama",
    "Theatre",
    "School",
    "Fiction",
    "Historical Fiction",
    "Read For School"
  ],
  "author": "Nilo Cruz",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/943450.Anna_in_the_Tropics"
}