{
  "title": "A Touch of Greek",
  "description": "Older cover edition of ASIN B0045JK2UA.NEW YORK TIMES & USA TODAY Bestselling Author Tina Folsom presents: A Touch of Greek (Out of Olympus #1)Selfish and gorgeous Greek God Triton is cast out of Olympus after seducing Zeus' mistress and can only gain reentry if he finds a woman who loves him for his kindness and selflessness, not his beauty. When the mortal Sophia - recovering from an eye operation and virtually blind - needs a home healthcare worker, he takes on the role, hoping she will be his ticket home.While defending Sophia from an unknown adversary, Triton's protective instinct emerges. At the same time rival Gods do everything to doom him to failure. And even if Triton can win Sophia's love, will he throw it away to return home, or will he lose his own heart to the only woman who truly sees him?A Touch of Greek is the first book in the humorous and sexy paranormal romance series Out of Olympus following the romantic adventures of four Gods: Triton, Dionysus, Eros, and Hermes.\"A Touch of Greek is a fun, blazing hot read that will have you asking, \"Where's MY Greek God?\" Tina Folsom's super sexy romances will be your favorite guilty pleasure!\" --- Stephanie Bond, Author of the #1 Kindle bestselling romantic comedy Stop the Wedding!Out of Olympus Series (A romantic comedy series about Greek Gods):Book 1: A Touch of GreekBook 2: A Scent of GreekBook 3: A Taste of GreekBook 4: A Hush of Greek (coming in 2016)Scanguards Vampires Series:Book 1: Samson's Lovely MortalBook 2: Amaury's HellionBook 3: Gabriel's MateBook 4: Yvette's HavenBook 5: Zane's RedemptionBook 6: Quinn's Undying RoseBook 7: Oliver's HungerBook 8: Thomas's ChoiceBook 8 1/2: Silent Bite (A Scanguards Wedding)Book 9: Cain's IdentityBook 10: Luther's ReturnNovella: Mortal WishBook 11: Blake's Pursuit (coming in 2016)Venice Vampyr Novella Series:Venice Vampyr (#1)Venice Vampyr (#2): Final AffairVenice Vampyr (#3): Sinful TreasureVenice Vampyr (#4): Sensual DangerStealth Guardians Series:Lover Uncloaked (#1)The Stealth Guardians series will continue in 2016.Eternal Bachelors Club (contemporary romance):Lawful EscortLawful LoverLawful Wife One Foolish NightOne Long Embrace One Sizzling Touch In collaboration with Lara Adrian: The Phoenix Code Book 1 & 2: Cut and RunBook 3 & 4: Hide and Seek",
  "genres": [
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Mythology",
    "Fantasy",
    "Erotica",
    "Adult"
  ],
  "author": "Tina Folsom",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/9435887-a-touch-of-greek"
}