{
  "title": "Dupes: How America's Adversaries Have Manipulated Progressives for a Century",
  "description": "In this startling, intensively researched book, bestselling historian Paul Kengor shines light on a deeply troubling aspect of American the prominent role of the \"dupe.\" From the Bolshevik Revolution through the Cold War and right up to the present, many progressives have unwittingly aided some of America's most dangerous opponents.Based on never-before-published FBI files, Soviet archives, and other primary sources, Dupes exposes the legions of liberals who have furthered the objectives of America's adversaries. Kengor shows not only how such dupes contributed to history's most destructive ideology—Communism, which claimed at least 100 million lives—but also why they are so relevant to today's politics.Dupes • Shocking reports on how Senator Ted Kennedy secretly approached the Soviet leadership to undermine not one but two American presidents• Stunning new evidence that Frank Marshall Davis—mentor to a young Barack Obama—had extensive Communist ties and demonized Democrats• Jimmy Carter's woeful record dealing with America's two chief foes of the past century, Communism and Islamism• Today's dupes, including the congressmen whose overseas anti-American propaganda trip was allegedly financed by foreign intelligence• How '60s Marxist radicals—Tom Hayden, Mark Rudd, Jane Fonda, Jeff Jones, Bill Ayers, and more—have suddenly reemerged as \"progressives for Obama\" • How Franklin Roosevelt was duped by \"Uncle Joe\" Stalin—and by a top adviser who may have been a Soviet agent—despite clear warnings from fellow Democrats• How John Kerry's accusations that American soldiers committed war crimes in Vietnam may have been the product of Soviet disinformation• The many Hollywood stars who were duped, including Humphrey Bogart, Lauren Bacall, Katharine Hepburn, Gene Kelly—and even Ronald Reagan• Soviet records that demonstrate beyond doubt the Communists' expansionist aims and their targeting of American liberals, especially academics and the Religious Left• How liberals still defend the same Communists who trashed Democratic icons like Woodrow Wilson, FDR, Harry Truman, and JFK—and still attack the anti-Communists who tried to spare them from manipulation• Details on many other dupes (and dupers), including Arthur Miller, Dr. Benjamin Spock, John Dewey, H. G. Wells, George Bernard Shaw, Lillian Hellman, Howard Zinn, Walter Cronkite, and Helen Thomas",
  "genres": [
    "History",
    "Politics",
    "American History",
    "Cult Classics",
    "Nonfiction"
  ],
  "author": "Paul Kengor",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/9431863-dupes"
}