{
  "title": "Edge",
  "description": "Behind the well-known U.S. security organizations— the FBI and CIA among them—lies a heavily guarded, anonymous government agency dedicated to intelligence surveillance and to a highly specialized brand of citizen protection. Shock waves of alarm ripple through the clandestine agency when Washington, D.C., police detective Ryan Kessler inexplicably becomes the target of Henry Loving, a seasoned, ruthless “lifter” hired to obtain information using whatever means necessary. While Loving is deft at torture, his expertise lies in getting an “edge” on his victim—leverage—usually by kidnapping or threatening family until the “primary” caves under pressure. The job of keeping the Kessler family alive falls to a man named Corte, a senior federal protection officer known as a “shepherd.” Uncompromising, relentlessly devoted to protecting those in his care and a passionate board game aficionado, he applies brilliant gaming strategy to his work. For Corte, the reappearance of Loving—the man who, six years earlier, had tortured and killed someone close to him—is also an opportunity to avenge his friend’s death. The assignment soon escalates into a fast-paced duel between Corte and Loving, a dangerous volley of wits and calculated risks. As he shepherds the Kesslers to a concealed safe house, Corte must anticipate Loving’s every step as the lifter moves in on his prey, and with the help of razor-sharp investigator Claire DuBois and his longtime ally, FBI agent Paul Fredericks, pinpoint which of Kessler’s seemingly insignificant cases has triggered Loving’s return. As the team digs deeper, each of the Kesslers comes under close scrutiny, and in captivity their family bonds are stretched to the breaking point—as the lifter draws near, Corte must ultimately choose between protecting his charges and exposing them to a killer in the name of long-awaited revenge.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Crime",
    "Suspense",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Jeffery Deaver",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/9435890-edge"
}