{
  "title": "Escape from Slavery: The True Story of My Ten Years in Captivity and My Journey to Freedom in America",
  "description": "In this groundbreaking modern slave narrative, Francis Bok shares his remarkable story with grace, honesty, and a wisdom gained from surviving ten years in captivity.May, 1986: Selling his mother's eggs and peanuts near his village in southern Sudan, seven year old Francis Bok's life was shattered when Arab raiders on horseback, armed with rifles and long knives, burst into the quiet marketplace, murdering men and women and gathering the young children into a group. Strapped to horses and donkeys, Francis and others were taken north, into lives of slavery under wealthy Muslim farmers. For ten years, Francis lived alone in a shed near the goats and cattle that were his responsibility. Fed with scraps from the table, slowly learning bits of an unfamiliar language and religion, the boy had almost no human contact other than his captor's family. After two failed attempts to escape-each bringing severe beatings and death threats-Francis finally escaped at age seventeen, a dramatic breakaway on foot that was his final chance. Yet his slavery did not end there, for even as he made his way toward the capital city of Khartoum, others sought to deprive him of his freedom. Determined to avoid that fate and discover what had happened to his family on that terrible day in 1986, the teenager persevered through prison and refugee camps for three more years, winning the attention of United Nations officials and being granted passage to America.Now a student and an anti-slavery activist, Francis Bok has made it his life mission to combat world slavery. His is the first voice to speak for an estimated twenty seven million people held against their will in nearly every nation, including our own. Escape from Slavery is at once a riveting adventure, a story of desperation and triumph, and a window revealing a world that few have survived to tell.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Africa",
    "Biography",
    "Sudan",
    "War",
    "Biography Memoir"
  ],
  "author": "Francis Bok",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/944388.Escape_from_Slavery"
}