{
  "title": "Eve of Warfare",
  "description": "Lycans, vampires, and cherubs... oh my.All Evangeline Hollis wants is to stay out of trouble long enough to lose the Mark of Cain, which drafted her into hunting demons for God. A former agnostic, she’s still recovering from being the latest point of contention between the two men in her life--Cain and Abel. Now she’s working for a cherub who thinks putting her undercover as a housewife is the best way to ferret out a rogue vampire hiding in an idyllic Orange County, California residential community.Eve knows when she’s being used as a pawn in the celestial political game. Now, she just has to figure out who’s the greater the vampire she’s hunting, the cherub yanking her chain, or the two brothers vying to play the role of her spouse--‘til death do them part. Which in her line of work, could happen any minute...(\"Eve of Warfare\" is a stand-alone novella, which falls after EVE OF CHAOS in the Marked series chronology.)REVIEWS\"Exhilarating adventure in an edgy world of angels and demons... Dynamic and vibrant, Eve is an impressive protagonist, and her fierce spirit and determination to make the best of her circumstances will keep readers enthralled.\" -- Publishers Weekly\"Day, aka multitalented author Sylvia Day, explodes onto the urban fantasy scene with a new twist on the Cain and Abel story. It’s dark, gritty and sexy to the max...\"--RT BOOKreviews\"Great characters and terrific storytelling in a hot-blooded adrenaline ride. A keep-you-up-all-night read.\" -- Patricia Briggs, #1 New York Times bestselling author (on EVE OF DARKNESS)\"EVE OF DARKNESS is a sizzling, heart-pounding urban fantasy that thrilled and fascinated me from beginning to end. Eve is a smart, spirited heroine I won’t soon forget!\" -- Jeri Smith-Ready, award-winning author of WICKED GAME and SHADE",
  "genres": [
    "Romance",
    "Angels",
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Paranormal Romance",
    "Fiction"
  ],
  "author": "Sylvia Day",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/9443049-eve-of-warfare"
}