{
  "title": "Gesundheit!: Bringing Good Health to You, the Medical System, and Society through Physician Service, Complementary Therapies, Humor, and Joy",
  "description": "The inspiring and hilarious story of Patch Adams's quest to bring free health care to the world and to transform the way doctors practice medicine• Tells the story of Patch Adam's lifetime quest to transform the health care system• Released as a film from Universal Pictures, starring Robin WilliamsMeet Patch Adams, M.D., a social revolutionary who has devoted his career to giving away health care. Adams is the founder of the Gesundheit Institute, a home-based medical practice that has treated more than 15,000 people for free, and that is now building a full-scale hospital that will be open to anyone in the world free of charge. Ambitious? Yes. Impossible? Not for those who know and work with Patch. Whether it means putting on a red clown nose for sick children or taking a disturbed patient outside to roll down a hill with him, Adams does whatever is necessary to help heal. In his frequent lectures at medical schools and international conferences, Adams's irrepressible energy cuts through the businesslike facade of the medical industry to address the caring relationship between doctor and patient that is at the heart of true medicine.All author royalties are used to fund The Gesundheit Institute, a 40-bed free hospital in West Virginia. Adams's positive vision and plan for the future is an inspiration for those concerned with the inaccessibility of affordable, quality health care.Today's high-tech medicine has become too costly, impersonal, and grim. In his frequent lectures to colleges, churches, community groups, medical schools, and conferences, Patch shows how healing can be a loving, creative, humorous human exchange--not a business transaction.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Health",
    "Humor",
    "Memoir",
    "Psychology",
    "Medical"
  ],
  "author": "Patch Adams",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/945082.Gesundheit_"
}