{
  "title": "La mort est mon métier",
  "description": "La mort est mon métier sont les pseudo-mémoires de Rudolf Höß (renommé Rudolf Lang dans l'ouvrage). Rudolf Höß était le commandant du camp de concentration et d'extermination d'Auschwitz pendant la Seconde Guerre mondiale.L'histoire commence en 1913 alors que Rudolf Lang a 13 ans.Il reçoit une éducation catholique mal comprise et très normative. Son père, un commerçant, ayant reçu une éducation militaire (famille militaire), totalement psychorigide, qui a commis un péché dans sa jeunesse à Paris et avec qui il entretient des rapports tendus, veut qu'il devienne prêtre pour expier les fautes que lui-même a commises. Rudolf croit en Dieu, jusqu'au jour où, en se battant avec un de ses camarades d'école (Werner), il lui casse la jambe. Immédiatement, il va se confesser à un prêtre. Le soir même, son père devient fou de rage après avoir appris que son fils a commis un « péché » sans lui en parler. Rudolf se sent trahi par le prêtre, seule personne au courant de l'épisode, les autres croyant à un accident. Or, on apprendra que c'est en fait le père de l'enfant blessé qui s'est plaint devant une assemblée de parents d'élèves. Le mal est fait : Rudolf ne croit plus en Dieu. Son père meurt peu avant la déclaration de guerre en 1914.À seize ans, Lang débute sa carrière militaire, d'abord en partant directement pour le front Ouest où il sera intercepté puis renvoyé à l'arrière car il est trop jeune, puis comme aide à l'hôpital militaire où il rencontrera un dragon de cavalerie qui le persuadera de rentrer dans son unité et de partir sur le front en Turquie.À la fin de la guerre, il se retrouve au chômage, rejeté par sa famille. Il s'apprête à se suicider lorsqu'un de ses collègues arrive et lui brandit un tract en lui disant de ne pas trahir l'Allemagne en se donnant la mort.Il adhère au parti nazi et se voit confier la direction d'une ferme avec sa femme Elsie, où il vit des journées de dur labeur, mais paisibles. Puis, après la prise du pouvoir par Hitler, il entre dans les SS, n'ayant pourtant pas les critères requis pour y adhérer. Il accède à des fonctions de plus en plus importantes dans la hiérarchie SS, jusqu'à devenir commandant du camp d'Auschwitz. Ce camp, d'abord de concentration, puis d'extermination, devient le lieu de la lente et tâtonnante mise au point de l'Usine de Mort du village d'Auschwitz. Il y reçoit l'ordre du Reichsführer Himmler de supprimer 500 000 unités par an au lieu des ridicules 80 000 unités de Treblinka. Lang va s'attacher à accomplir la mission qui lui a été assignée : tuer le plus grand nombre de Juifs et éliminer le plus efficacement possible les cadavres. Après la guerre et la chute d'Hitler, il est emprisonné, puis condamné à la pendaison après son procès où il affirmera avoir seulement suivi les ordres, indiquant d'un air naturel qu'il a supervisé et participé activement au meurtre de « seulement » 2,5 millions de personnes au lieu des 3,5 millions prévus3.Tout au long du livre, il se montre incapable de sentiments et même d'action personnelle, car sa conduite lui a toujours été dictée par un chef en qui il portait une confiance totale. À la fin, on le sent cependant en colère se disant trahi par Himmler, qui, tel un lâche, s'est suicidé, et n'a ainsi pas voulu assumer son rôle dans l'extermination des Juifs, laissant Rudolf seul responsable de ses actes. Jusqu'au bout, il assume cependant son idée du chef, en répétant froidement et méthodiquement qu'il est le seul responsable de ce qui s'est passé à Auschwitz, et en énonçant sans difficulté les atrocités commises. Son seul moment de doute survient lorsque sa femme apprend ses activités, mais, ayant été choisi pour ses rares qualités de conscience il n'accorde pas d'importance à la morale.",
  "genres": [
    "History",
    "France",
    "Classics",
    "War",
    "French Literature",
    "World War II",
    "Historical"
  ],
  "author": "Robert Merle",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/94498.La_mort_est_mon_m_tier"
}