{
  "title": "Degeneration",
  "description": "Max Nordau was a famous writer, a practicing physician, a bourgeois examplar of enterprise and energy when his Degeneration appeared in Germany in 1892. He argued that the spirit of the times was characterized by enervation, exhaustion, hysteria, egotism, and inability to adjust or to act. Culture had degenerated, he said, and if criminals, prostitutes, anarchists, and lunatics were degenerates, so were the authors and artists of the era.Degeneration, and the controversy it aroused, served to define the fine de siècle. Its targets included Nietzsche, Oscar Wilde, Ibsen, Tolstoy, Richard Wagner, Zola, and Walt Whitman. The book was enormously influential. Nordau anticipated Freud in describing art as a product of neurosis, and he set a precedent for psychological and sociological critiques of literature. You may wish to talk back to Degeneration, as George Bernard Shaw did, but you will be entertained by its vitality. Holbrook Jackson, in The Eighteen Nineties, called the book \"an example of the very liveliness of a period which was equally lively in making or marring itself.\"Excerpt:Fin-de-siècle is a name covering both what is characteristic of many modern phenomena, and also the underlying mood which in them finds expression. Experience has long shown that an idea usually derives its designation from the language of the nation which first formed it. This, indeed, is a law of constant application when historians of manners and customs inquire into language, for the purpose of obtaining some notion, through the origins of some verbal root, respecting the home of the earliest inventions and the line of evolution in different human races. Fin-de-siècle is French, for it was in France that the mental state so entitled was first consciously realized. The word has flown from one hemisphere to the other, and found its way into all civilized languages. A proof this that the need of it existed. The fin-de-siècle state of mind is to-day everywhere to be met with; nevertheless, it is in many cases a mere imitation of a foreign fashion gaining vogue, and not an organic evolution. It is in the land of its birth that it appears in its most genuine form, and Paris is the right place in which to observe its manifold expressions.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Sociology",
    "Criticism",
    "Theory",
    "Art"
  ],
  "author": "Max Nordau",
  "average_rating": "3.04",
  "url": "https://www.goodreads.com/book/show/945048.Degeneration"
}