{
  "title": "God’s Good Man: A Simple Love Story! A Romantic Classic By Marie Corelli! AAA+++",
  "description": "There was a certain 'man of worship' in the world at the particular time when this present record of life and love begins, who found himself very well-disposed to 'flourish his heart' in the Maloryan manner prescribed, when after many dark days of unseasonable cold and general atmospheric depression, May at last came in rejoicing. Seated under broad apple-boughs, which spread around him like a canopy studded with rosy bud-jewels that shone glossy bright against the rough dark-brown stems, he surveyed the smiling scenery of his own garden with an air of satisfaction that was almost boyish, though his years had run well past forty, and he was a parson to boot. A gravely sedate demeanour would have seemed the more fitting facial expression for his age and the generally accepted nature of his calling,--a kind of deprecatory toleration of the sunshine as part of the universal 'vanity' of mundane things,--or a condescending consciousness of the bursting apple-blossoms within his reach as a kind of inferior earthy circumstance which could neither be altered nor avoided.------------------------------------------------------------------------------Dear We are dedicated to providing our customers with cutting edge information with the latest and most popular ebooks & hot topics at very affordable prices. Our mission is to create positive change in your life. We carry hundreds of unique titles including \"Literary Classics\" under many categories for your convenience. Please click on the name \"Manuel Ortiz Braschi\" at the top of the page, next to the title, or write \"Manuel Ortiz Braschi\" at the search box and you will be taken to our main page in Amazon, where you will be able to check all the interesting, unique and informative titles that we carry at Amazon Kindle.",
  "genres": [],
  "author": "Marie Corelli",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/9453994-god-s-good-man"
}