{
  "title": "Love in the Driest Season: A Family Memoir",
  "description": "Against a background of war, terrorism, disease and unbearable uncertainty about the future, this story of how a foreign correspondent and his wife fought to adopt a Zimbabwean baby emerges as an inspiring testament to the miracles that love and dogged determination can sometimes achieve. Don't miss this gripping memoir.Foreign correspondent Neely Tucker and his wife, Vita, arrived in Zimbabwe in 1997. After witnessing firsthand the devastating consequences of AIDS on the population, especially the children, the couple started volunteering at an orphanage that was desperately underfunded and short-staffed. One afternoon, a critically ill infant was brought to the orphanage from a village outside the city. She’d been left to die in a field on the day she was born, abandoned in the tall brown grass that covers the highlands of Zimbabwe in the dry season. After a near-death hospital stay, and under strict doctor’s orders, the ailing child was entrusted to the care of Tucker and Vita. Within weeks Chipo, the girl-child whose name means gift, would come to mean everything to them.Still an active correspondent, Tucker crisscrossed the continent, filing stories about the uprisings in the Congo, the civil war in Sierra Leone, and the postgenocidal conflict in Rwanda. He witnessed heartbreaking scenes of devastation and violence, steeling him further to take a personal role in helping anywhere he could. At home in Harare, Vita was nursing Chipo back to health. Soon she and Tucker decided to alter their lives forever—they would adopt Chipo. That decision challenged an unspoken social norm—that foreigners should never adopt Zimbabwean children.Raised in rural Mississippi in the sixties and seventies, Tucker was familiar with the mores associated with and dictated by race. His wife, a savvy black woman whose father escaped the Jim Crow South for a new life in the industrial North, would not be deterred in her resolve to welcome Chipo into their loving family.As if their situation wasn’t tenuous enough, Zimbabwe President Robert Mugabe was stirring up national fervor against foreigners, especially journalists, abroad and at home. At its peak, his antagonizing branded all foreign journalists personae non grata. For Tucker, the only full-time American correspondent in Zimbabwe, the declaration was a direct threat to his life and his wife’s safety, and an ultimatum to their decision to adopt the child who had already become their only daughter.Against a background of war, terrorism, disease, and unbearable uncertainty about the future, Chipo’s story emerges as an inspiring testament to the miracles that love—and dogged determination—can sometimes achieve. Gripping, heartbreaking, and triumphant, this family memoir will resonate throughout the ages.",
  "genres": [
    "Nonfiction",
    "Africa",
    "Memoir",
    "Adoption",
    "Zimbabwe",
    "Biography",
    "Book Club"
  ],
  "author": "Neely Tucker",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/94554.Love_in_the_Driest_Season"
}