{
  "title": "Son of a Hundred Kings",
  "description": "Little Ludar Prentice arrived in the busy Canadian town of Balfour with an appealing sign on his back but with no place to go. He had been shipped from England to join the father he had never known, but fate decreed that father and son were never to meet. Fortunately, some kind citizens, led by Mr. Milner, the newspaper publisher, rallied 'round, and Ludar was given a home.The home was with the Christians. Billy Christian, a spare-time inventor, was a big-hearted man, had a sharp tongue but a sympathetic, conscientious heart. They were good to Ludar. But as the years passed and Ludar grew to young manhood, his lot was not an easy one.Inevitably, he became involved in the lives of many of the townspeople. There was Lockie McGregor, the merchant with the extraordinary sign; his daughter Catherine, whose experience with pride and love was fraught with drama; Sloppy Bates, the newspaper reporter who accomplished a miracle. And there was the Craven family, Balfour's best, headed by two brothers now engaged - with their very different wives - in a struggle for supremacy and revenge.Still, set apart by his unknown background - an the rumors and speculations which persisted about him were not all optimistic - Ludar could not freely enter the tempting, gay world of such people as the Cravens. Most distressingly, he not not step easily over the barriers separating him from Antoinette Milner, the publisher's lovely and charming daughter. And Norman Craven was a formidable rival.Loyal and unselfish, Ludar shouldered the burden of responsibility for the Christians when they suffered reverses. He was not one to complain, but would his talent and ambitions never be fulfilled? Would his heart always ache with hopeless love to Tony Milner, so beyond his reach, perhaps to be lost to him forever?Of all people, it was tony and her father who uncovered the secret of Ludar's origins. They did not reveal their discovery to him until - in an exciting turn of events whereby Ludar became the center of a mystery case which shook the town - Ludar, in an unexpected way, proved himself to be of truly gallant, noble stature.With his brilliant gift for storytelling, with his remarkable ability to create lively, distinctive characters and to capture the atmosphere of a nostalgic period, Thomas B. Costain has in Son of a Hundred Kings achieved another well-deserved, smashing success.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Canada",
    "Canadian Literature",
    "Romance"
  ],
  "author": "Thomas B. Costain",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/13190828-son-of-a-hundred-kings"
}