{
  "title": "Vegan's Daily Companion: 365 Days of Inspiration for Cooking, Eating, and Living Compassionately",
  "description": "\"Full of wisdom, intelligence, and thoughtfulness, Vegan's Daily Companion is one of those books that inspires you to be a better person with each page you read.\"—John Robbins, bestselling author of The Food Revolution, Diet for a New America, and The New Good Life \"An unfettered, unabashed daily affirmation of the joy of being vegan. An invitation and a promise, a process and a guide for creating a compassionate world. And some darn good recipes, too!\"—Carol J. Adams, author of The Sexual Politics of Meat\"As a vegan advocate for nearly two decades, I was pleasantly surprised to learn a wealth of brand new and fascinating information in this completely unique book that combines practical tips and insightful wisdom for eating healthfully and living joyfully. Full of stunning photos and interesting facts about animals in history and literature, this is a fantastic resource for vegans as well as for curious, compassionate non-vegans.\"—Melanie Joy, Ph.D., author of Why We Love Dogs, Eat Pigs, and Wear Cows Live a joyful, compassionate life, every day of the year with Colleen Patrick-Goudreau's guide, Vegan's Daily Companion ! Mondays : For the Love of Food – A celebration of familiar and not-so-familiar foods to spark enthusiasm for eating healthfully. Tuesdays : Effective Communication – Techniques and tactics for speaking on behalf of veganism effectively and compassionately. Wednesdays : Optimum Health for Body, Mind, and Spirit – Care and maintenance for becoming and remaining a joyful vegan. Thursdays : Animals in the Literature, Film, Painting – Inspiration across the ages that reflects our consciousness of and relationship to non-human animals. Fridays : Stories of Hope, Rescue, and Transformation – Heartening stories of people who have become awakened and animals have found sanctuary. Saturdays + Sundays : Healthful Recipes – Favorite recipes to use as activism and nourishment.",
  "genres": [
    "Vegan",
    "Cookbooks",
    "Nonfiction",
    "Cooking",
    "Food",
    "Health",
    "Unfinished"
  ],
  "author": "Colleen Patrick-Goudreau",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/9462708-vegan-s-daily-companion"
}