{
  "title": "Undead",
  "description": "Zombie Double Bill George A. Romero's classic 1968 film, Night of the Living Dead, launched a new era of gut-munching mayhem, relentelessly terrorizing the hearts of moviegoers and launching the zombie movie phenomenon. Screenwriter John A. Russo turned the flesh-eating frenzy into two horrific, blood-drenched novels. . . Night Of The Living Dead A cemetery in rural Pennsylvania. A brother and sister putting flowers on their father's grave. A strange figure shambling toward them--eyes dead and teeth gnashing. So begins a night of endless terror that would live on in infamy. Seven strangers locked inside a small farmhouse fight off an army of walking corpses. Who will survive? And who will have their flesh devoured. . .? Return Of The Living Dead Not long after the first zombie outbreak, a bus crashes in a small American town. Local churchgoers rush to the scene to save the living--and destroy the dead. But they're too late. A terrifying new plague of undead has been unleashed. A new horde of victims has been infected. And this time, they are ravenous. . . Two great, gruesome zombie thrillers in one volume!  John Russo wants everyone to know he's a really nice guy even though he loves to scare people. He started it by co-scripting the 1968 horror classic Night of the Living Dead, one of the greatest fright flicks of all time, ranked #18 on the Internet Movie Database's top 100 Scariest Movies. (In a fine example of showmanship and multi-tasking, Russo also played a zombie in the film.) He also wrote the screenplays and/or stories for Midnight, Santa Claws, The Majorettes, Return of the Living Dead, Bloodsisters, and Inhuman. Mr. Russo has authored fifteen terror-suspense novels, including Living Things, The Awakening, Voodoo Dawn, and Inhuman. His nonfiction books, Scare Tactics and Making Movies are considered bibles of independent filmmaking by film students and horror fans. Those who are not faint of heart will enjoy digging into this presentation of Night of the Living Dead and the original stark-and-dark version of Return of the Living Dead. Look for John Russo's upcoming cinematic shockfest Escape of the Living Dead, which is now in preproduction for a 2011 release. Mr. Russo resides in a suburb of Pittsburgh, PA. To his knowledge, none of his neighbors are zombies, though \"there is that one guy around the corner who is rumored to have devoured the mailman a few years ago.\" \"Truly harrowing.\" --Roger Ebert, Chicago Sun-Times",
  "genres": [
    "Horror",
    "Zombies",
    "Fiction",
    "Literature",
    "Novels"
  ],
  "author": "John A. Russo",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/9458232-undead"
}