{
  "title": "A Touch of Greek",
  "description": "A Touch of Greek is a steamy Romantic Comedy.Recipe for a good hunky Greek Gods, mischief galore, a pinch of humor, stir with lots of fun characters!Selfish and gorgeous Greek God Triton is cast out of Olympus after seducing Zeus’ mistress and can only gain reentry if he finds a woman who loves him for his kindness and selflessness, not his beauty. When the mortal Sophia – recovering from an eye operation and virtually blind – needs a home health care worker, he takes on the role, hoping she will be his ticket home.While defending Sophia from an unknown adversary, Triton’s protective instinct emerges. At the same time rival Gods do everything to doom him to failure. And even if Triton can win Sophia’s love, will he throw it away to return home, or will he lose his own heart to the only woman who truly sees him?A Touch of Greek is the first book in the humorous and steamy paranormal romance series Out of Olympus following the romantic adventures of four Triton, Dionysus, Eros, and Hermes.Full length approx. 80,000 words / 375 pages on the Nook When he turned a corner, Triton almost collided with a wheelchair in the hospital corridor. He cursed. “What in Hades!” The words nearly got stuck in his throat when he looked at the person sitting in the wheelchair. There she was, Sophia, his mystery woman! What by the Gods had happened? Had the accident paralyzed her?Sophia didn’t look at him – she completely ignored him. Did he really deserve that? Had he been such an ass that night? Wasn’t it enough that she’d put him in her place then?He stood almost frozen until the nurse gave him a stern look and a determined “Excuse us, please” which made him jump aside. The nurse pushed the wheelchair past him and continued down the hall.Behind him Dionysus cleared his throat. “What’s going on? Would you please now explain to me what we're doing here? And who this mysterious woman is you’re running all over town for to find.”With an impatient movement of his hand, Triton stopped his friend. “Not now, Dionysus. Follow me.”Several large strides and Triton had caught up with the nurse pushing the wheelchair. He walked behind them.“Yes, I need a healthcare worker who can help me around the house. No. I can walk.” Triton felt relief when he heard her say that she could walk. He’d enjoyed dancing with her, and it would be a shame if she couldn’t do that anymore. He would love to take her dancing again and whirl her around the dance floor. “Yes, otherwise I’m healthy. I don’t need a real nurse, just somebody who can help me find my way around the house.” She paused again, listening intently to the other person. “No, it’s both eyes. I can see only shapes and colors, not much of anything else.” There was a quiet sigh he would have almost missed had he not listened so closely. “Yes, for now, I’m virtually blind.”Blind? She was blind? She hadn’t been blind the night he’d met her at the nightclub. On the contrary, those eyes had practically devoured him. “When do you think you can get somebody out to me? Tomorrow? … That’s good. Yes, the name is Sophia Baker. And I live at –” She stopped abruptly then chuckled softly. For the first time her voice took on a carefree tone. “You knew Aunt Eleni? … Yes, I still live in the same house. … Thank you, that’s so kind of you. We all miss her. I’ll be expecting the healthcare worker tomorrow morning then. Thanks so much.”Sophia disconnected the call. Triton watched her put the cell phone away. Virtually blind? Could it be true? Part of him hated his next thought, but that didn’t stop it from coming. Could this be his second chance? If he could make sure that she didn’t recognize his voice, he could pretend to be somebody else. That night, he had given a false name anyway. If he managed to get close to her, insinuate himself into her life, then he could prove to her that he wasn’t just some himbo as she’d called him. He could prove to her that he cared, that he was reliable, that he had a heart. And he would be close to her again – by the Gods, how he’d missed her. How he’d longed to drink in her scent, to touch her smooth skin, to feel her body close to his. He could be there for her, help her with anything she needed. He could be her eyes.",
  "genres": [
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Mythology",
    "Fantasy",
    "Erotica",
    "Adult"
  ],
  "author": "Tina Folsom",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/9462232-a-touch-of-greek"
}