{
  "title": "What You See Is What You Get: My Autobiography",
  "description": "'Lord Sugar is a self-made man and one of Britain's finest business brains. His story so far is inspirational to the end' The Sun'Sugar is unusual among celebrity memoirists in that he's a clever man who has done a lot with his life, and the tale of his rise from nothing, and nowhere is genuinely revealing' Private EyeFrom a Hackney council estate to the House of Lords, this is the extraordinary story of one of our greatest entrepreneurs.Alan Sugar was born in 1947 and brought up on a council estate in Clapton, in Hackney. As a kid he watched his dad struggle to support the family, never knowing from one week to the next if he'd have a job. It had a huge impact on him, fuelling a drive to succeed that was to earn him a sizeable personal fortune. Now he describes his amazing journey, from schoolboy enterprises like making and selling his own ginger beer to setting up his own company at nineteen; from Amstrad's groundbreaking ventures in hi-fi and computers, which made him the darling of the stock exchange, to the dark days when he nearly lost it all; from his pioneering deal with Rupert Murdoch to his boardroom battles at Tottenham Hotspur FC.In this compelling autobiography, he takes us into the world of The Apprentice, and describes his appointment as advisor to the government and elevation to the peerage. Like the man himself, What You See Is What You Get is forthright, funny and sometimes controversial.'I'm addicted to autobiographies and What You See Is What You Get is one of the best I've read. Love him or loathe him, Baron Sugar of Clapton is the walking, snarling embodiment of all the values he espouses on The Apprentice' Piers Morgan",
  "genres": [
    "Biography",
    "Autobiography",
    "Nonfiction",
    "Business",
    "Entrepreneurship",
    "Finance",
    "British Literature"
  ],
  "author": "Alan Sugar",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/9459042-what-you-see-is-what-you-get"
}