{
  "title": "Deutsche Policy of Pretention: Der Abstieg eines Kriegerstaates 1871-1914",
  "description": "In diesem Sammelband geht es um die Europäische Krise von 1914. Ob die deutsche Geschichtswissenschaft den Gedenktag im Jahre 2014 feiern wird oder nicht, stellen muss sie sich der Kontroverse um den Ausbruch des Ersten Weltkrieges. Dieser Aufsatzband, der 1983 in erster Auflage erschien (\"Europäische Krise und Erster Weltkrieg. Beiträge zur Militärpolitik des Kaiserreiches, 1871-1914\" - jetzt als E-Book), schlägt mit dem neuen Beitrag zur \"Policy of Pretention. Krisenkonferenzen und informelles Regierungssystem im Kaiserreich, 1905-1914\" den Bogen über 25 Jahre Weltkriegforschung.Dass in diesem Zusammenhang dem Problem der Krisenkonferenzenallgemein, und im November/Dezember 1912 im Besonderen, innerhalb des Entscheidungsprozesses der politischen und militärischen Führungselite des Deutschen Reiches, entscheidende Bedeutung, im Hinblick auf einen Krieg in absehbarer Frist, zukommt, belegen die hier vorgelegten neuen Quellen. Die deutsche Historiker-Zunft mag es begrüßen oder es geht um den Entschluss des Kaiserreiches von 1912, den großen Krieg bei nächster sich bietender Gelegenheit zu führen.Dazu wird das Spektrum des innenpolitischen Kräftespiels im Deutschen Reich von 1871, unter dem dezidiert entwickelten Blickwinkel des Einsatzes der Armee im Inneren (Staatsstreich-, Anarchismus-, Streik-, Revolutions- und Bürgerkriegsdrohung), aus der Sicht der Militärbehörden schärfer konturiert und damit der Weg in den Ersten Weltkrieg ergänzend, unter dem Aspekt der Kriegsvorbereitung, beleuchtet. Die These der Düsseldorfer Schule, es sei auf Grund der inneren Strukturen des Reiches (informeller Regierungsstil Wilhelms II.) von einer \"Polykratie\", d. h. der vielfach behaupteten, jede Entscheidung paralysierenden \"Zerklüftetheit der Entscheidungsträger\" in Berlin, auszugehen, dieser Theorie im Gefolge Gerhard Ritters, wird hier, mit dem Blick auf die Institution20der \"Krisenkonferenzen\"(1875-1912) im Kaiserreich, der Boden entzogen. Wie dieser Begriff, durch Wolfgang Mommsen zunächst adaptiert, die Düsseldorfer Argumentation zu Fall bringt, ist in dem abschließenden Beitrag zur \"Policy of Pretention\" desReichs für die Jahre 1871 bis 1914 entwickelt.Dass das Deutsche Reich im Kriege nicht den allseits erwartetenmilitärischen Erfolg erzielte, war u.a. in den tiefliegenden Defektendes deutschen Staatswesens und dessen Streitkräften begründet. Ein inden gesellschaftlichen Strukturen erstarrtes Staatswesen hatte dieZeichen der Zeit nicht erkannt. Mittelmäßiges \"Management\", veranlasste u.a. im September 1914 Fehlschläge (Marneschlacht) die irreparabel waren. Der Krieg, so wie er politisch und militärisch zuvor gedacht gewesen war, ging verloren. Ein vierjähriges, verlustreiches und nutzloses Ringen folgte. Alle Beteiligten büßten in der Folge ihre -bis dato - errungenen Positionen als Groß- oder Weltmächte ein.",
  "genres": [],
  "author": "Bernd F. Schulte",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/9461705-deutsche-policy-of-pretention"
}