{
  "title": "The Unknown Errors of Our Lives",
  "description": "A collection of moving stories about family, culture, and the seduction of memory. The tales of journeys and returns, of error, of loss and recovery, all resound with Divakaruni's unique understanding of the human spirit.From acclaimed and beloved author Chitra Banerjee Divakaruni comes a new collection of moving stories about family, culture, and the seduction of memory. With the rich prose and keen insight that made Mistress of Spices and Sister of My Heart national bestsellers, these tales of journeys and returns, of error, of loss and recovery, all resound with her unique understanding of the human spirit.\"Don't we all have to pay, no matter what we choose?\" a young woman asks in \"The Love of a Good Man,\" one of the unforgettable stories in Chitra Divakaruni's beautifully crafted exploration of the tensions between new lives and old. In tales set in India and the United States, she illuminates the transformations of personal landscapes, real and imagined, brought about by the choices men and women make at every stage of their lives.\"The Love of a Good Man\" tells of an Indian woman happily settled in the United States who must confront the past when her long-estranged father begs to meet his only grandson. In the acclaimed \"Mrs. Dutta Writes a Letter\", a widow, inadvertently eavesdropping, discovers that her cherished, old-fashioned ways are an embarrassment to her daughter-in-law. A young American woman joins a pilgrimage of women in Kashmir and, in the land of her ancestors, comes to view herself and her family in a new light in \"The Lives of Strangers.\" Two women, uprooted from their native land by violence and deception, find unexpected comfort and hope in each other in \"The Blooming Season for Cacti.\" And in the title story, a young woman turns to her painting and the wisdom of her grandmother for the strength to accept her fiance's past when it arrives on her doorstep.Whether writing about the adjustments of immigrants to a foreign land or the accommodations families make to the disruptive differences between generations, Divakaruni poignantly portrays the eternal struggle to find a balance between the pull of home and the allure of change.",
  "genres": [
    "Short Stories",
    "Fiction",
    "India",
    "Literary Fiction",
    "Book Club",
    "Asia",
    "Novels"
  ],
  "author": "Chitra Banerjee Divakaruni",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/94665.The_Unknown_Errors_of_Our_Lives"
}