{
  "title": "Bard's Oath",
  "description": "In The Last Dragonlord and Dragon and Phoenix Joanne Bertin created a world unlike our own, where Dragonlords soar in the skies above the many realms of the land. The Dragonlords’ magic is unique, giving them the ability to change from dragon to human form; to communicate silently among themselves; and other abilities not known to mortals. For many millennia, the Dragonlords have been a blessing to the world, with their great magic and awesome power. And though they live far longer than the humans who they resemble when not in their draconic state, these fabled changelings are still loyal to their human friends. Now in Bard's Oath, their magic is not the only power abroad in the world. And not all the magic is as benign as theirs. Leet, a master bard of great ability and vaulting ambition, has his own magic, but of a much darker nature. Years ago, death claimed the woman he loved, setting him on a course to avenge her death, no matter the consequences. Now, mad with hatred and consumed by his thirst for revenge, Leet has set in motion a nefarious plot that ensnares the friend of a Dragonlord, using his bardic skills . . . and dark powers only he can summon, to accomplish his bitter task. Raven, a young horse-breeder friend of the Dragonloard Linden Rathan, is ensnared by Leet and under the bard’s spell, is one of the bard’s unwitting catspaws. When accused of a heinous crime, Raven turns to Linden, and while Dragonlords normally do not meddle in human affairs, Linden comes to Raven’s aid, loath to abandon him in his time of desperate need. But Raven, and others victimized by Leet, are at the mercy of human justice. Can even a Dragonlord save them from a dire fate before it is too late?",
  "genres": [
    "Fantasy",
    "Dragons",
    "Fiction",
    "Adventure",
    "Science Fiction Fantasy",
    "Epic Fantasy",
    "Romance"
  ],
  "author": "Joanne Bertin",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/9463800-bard-s-oath"
}