{
  "title": "Soldier On",
  "description": "73700 words. Approximately 300 pages.Edited by Monique HappyMonique Happy Editorial ServicesSoldier On is Book Two in the Surviving the Zombie Apocalypse series, picking up on day four where “Trudge: Surviving the Zombie Apocalypse” left off.Day one began the same as any other Saturday in Portland, Oregon. After months of rain people were out and about enjoying the sights and sounds of summer.Cade Grayson dropped his wife Brook and daughter Raven off at Portland International Airport. They were bound for Myrtle Beach, South Carolina to visit Brook’s parents.On that eye opening first day, Cade’s introduction to the new world was hard to wrap his mind around. He was forced, in self defense, to kill his infected neighbors Ted and Lisa.Pioneer Courthouse Square, nestled in the center of downtown Portland, was but one of the many flashpoints of a viral outbreak in the United States. By evening all of the hospitals in and around Portland were ravaged and teeming with ravenous walking dead. There was no triage, no way to cure them and by evening, for those unfortunate enough to be in a major metropolitan area, no way to escape them.Day two saw Washington D.C. fall to the reanimated hordes in search of human flesh. After declaring martial law and calling back all of the soldiers, airmen and marines from overseas, President Bernard Odero was never heard from again.Former Speaker of the House and now President by succession Valerie Clay is saddled with the seemingly insurmountable task of leading the country back from the brink of what may prove to be mankind’s Extinction Level Event. Her first order of business is to set up a safe haven in Colorado Springs as the new Capitol of the United States.Delta Force commander Mike Desantos embarks on a new mission with his small team of Tier-One operators. They must rescue critical personnel from the Center for Disease Control in Atlanta, Georgia and retrieve any useful information they have gleaned concerning the Omega virus.Cade Grayson, ex Delta Force operator narrowly escaped Portland, Oregon ahead of the massive exodus. He eventually ended up leading a group of survivors through the western high desert, losing five of them violently along the way.After battling zombies and humans across the west, and still unsure of the well being or whereabouts of his family, Cade linked up with retiree Harry Conrad and Vietnam-era aviator Duncan Winters in Draper, Utah at Camp Williams, garrison for the 19th Special Forces Group.While suffering a night of fitful sleep trying to block out the moans of the living dead, Cade made the decision to leave the base and soldier on alone, resuming his cross country search for his loved ones.Can Valerie Clay bring the United States back from the brink and find a way to deal with the millions of undead?Will Cade Grayson survive long enough to find his wife and daughter... still alive?Can Mike Desantos complete his mission to the CDC and return to Colorado Springs in time to attend the birth of his first boy?Or will the insatiable dead succeed in breaking the indomitable spirit of mankind...?",
  "genres": [
    "Zombies",
    "Horror",
    "Apocalyptic",
    "Post Apocalyptic",
    "Adventure",
    "Audiobook",
    "Fiction"
  ],
  "author": "Shawn Chesser",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/13192017-soldier-on"
}