{
  "title": "Cross Rhodes: Goldust, Out of the Darkness",
  "description": "He first burst onto the scene in the nineties, covered in gold face paint and exhibiting a one-of-a- kind flamboyant style that bewildered his foes and thrilled his fans. Inside the ring, Goldust is as tough as they come, known for using outrageous mind games and taking down his opponents with unparalleled ruthlessness. It’s no surprise, then, that wrestling is in his blood; Goldust is the son of Dusty Rhodes, “The American Dream.” What is it like to be the son of a wrestling icon and follow him into the same profession? In this no-holds-barred account, Dustin Rhodes speaks frankly and openly about his journey. He talks about being a young boy who desperately missed his dad. A young man who only wanted to follow in his father’s footsteps and threw aside a football scholarship to eke out a meager existence in regional wrestling. A green wrestler struggling to prove to his peers that his work, not his name, had gotten him to where he was. Rhodes describes how, in the midst of a painful five-year estrangement with his father, he finally made a name for himself as Goldust and then let it all go, tumbling into a descent of self-medication that led him away from a red-hot career as a WWE Superstar and nearly cost him his life. When he finally hit bottom, Rhodes knew where to look for help from the family he always had: his father and World Wrestling Entertainment. When he got clean and sober and was offered the chance to wrestle for WWE, he snapped up the offer. The everyday existence of life on the road, working with and watching the new Superstars— like his brother Cody Rhodes—has reminded Rhodes of why he loves being a wrestler. Cross Rhodes is an intimate portrait of one man’s road to redemption and a unique glimpse into one of the most famous families in WWE.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Sports",
    "Autobiography",
    "Memoir"
  ],
  "author": "Dustin Rhodes",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/9466920-cross-rhodes"
}