{
  "title": "Οκτάνα",
  "description": "Η Οκτάνα αποτελεί ένα από τα κορυφαία έργα της ελληνικής λογοτεχνίας, στο οποίο ο Ανδρέας Εμπειρίκος είχε οραματιστεί την ύπαρξη μιας ερωτικής οικουμενικής ουτοπίας, όπου οι άνθρωποι ζουν σε μια απόλυτη ευδαιμονία.Το βιβλίο εκφράζει ένα συγκροτημένο φιλοσοφικό και κοσμικό σύστημα, που πραγματεύεται τον έρωτα, τον θάνατο και το όραμα ενός νέου κόσμου ως βασικά του θέματα. Αποτελείται από 31 πεζά κείμενα, λυρικής διάθεσης, τα οποία καλύπτουν μία μεγάλη χρονική περίοδο, γραμμένα από το 1958 μέχρι το 1965.Και τώρα ο καθείς θα διερωτηθή ευλόγως: «Μα τί θα πη Οκτάνα;»Δίκαιον το ερώτημα και η απάντησις θα έλθη γρήγορα. Όμως διά να γίνη πλήρως νοητή, ρίξετε πρώτα μέσα σας μια καλή ματιά και ευθύς μετά ρίξετε άλλη μία τριγύρω σας δεξιά και αριστερά, πάνω και κάτω. Έπειτα κλείστε τα μάτια σας για μια στιγμή και ανοίξτε τα αποτόμως, ανοίγοντας διάπλατα και τις ψυχές σας. Η απάντησις θα βρίσκεται μπροστά σας, όχι μονάχα νοητή, μα και απτή — σώμα περικαλλές και έμψυχον και σφύζον.Και τώρα (αμήν, αμήν) λέγω υμίν:Οκτάνα, φίλοι μου, θα πη μεταίχμιον της Γης και του Ουρανού, όπου το ένα στο άλλο επεκτεινόμενο ένα τα δύο κάνει.Οκτάνα θα πη πυρ, κίνησις, ενέργεια, λόγος σπέρμα.Οκτάνα θα πη έρως ελεύθερος με όλας τας ηδονάς του.Οκτάνα θα πη ανά πάσαν στιγμήν ποίησις, όμως όχι ως μέσον εκφράσεως μόνον, μα ακόμη ως λειτουργία του πνεύματος διηνεκής.Οκτάνα θα πη η εντελέχεια εκείνη, που αυτό που είναι αδύνατον να γίνη αμέσως το κάνει εν τέλει δυνατόν, ακόμη και την χίμαιραν, ακόμη και την ουτοπίαν, ίσως μια μέρα και την αθανασίαν του σώματος και όχι μονάχα της ψυχής.Οκτάνα θα πη το «εγώ» «εσύ» να γίνεται (και αντιστρόφως το «εσύ» «εγώ») εις μίαν εκτόξευσιν ιμερικήν, εις μίαν έξοδον λυτρωτικήν, εις μίαν ένωσιν θεοτικήν, εις μίαν μέθεξιν υπερτάτην, που ίσως αυτή να αποτελεί την θείαν Χάριν, το θαύμα του εντός και εκτός εαυτού, κάθε φοράν που εν εκστάσει συντελείται.Απόσπασμα από το ποίημα “Όχι Μπραζίλια μα Οκτάνα” (1965).",
  "genres": [
    "Poetry"
  ],
  "author": "Ανδρέας Εμπειρίκος",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/9465859"
}