{
  "title": "Hidden Mickey 2: It All Started...",
  "description": "HIDDEN MICKEY 2: It All Started...Flesch-Kincaid Grade 5.6 - Flesch Reading Ease 78.3 Volume 2 in the HIDDEN MICKEY series, for age 10 to Adult.MISSING A CLUE LANCE STUMBLES ON A MYSTERIOUS GEMSTONEWhat was in the instructions Walt gave him just before he died? Is there more to the Hidden Mickey quest? A mysterious Red Diamond comes from the depths of the Jungle.WHAT IS THE POWER BEHIND IT?Lance Brentwood, the spoiled bad-boy of Hidden Mickey, finds himself in an unfamiliar position—alone and at the receiving end of a gun.ONE CRYPTIC CLUE INVOLVES A MAN'S ENTIRE DESTINYWhen Lance learns the legacy Walt set in place is more far-reaching than he had ever imagined. Can he earn the trust of the Blond-Haired Man’s daughter, or does this feisty beauty have plans of her own? Intrigue heats up when Lance has to team up with her as the two embark on an even wilder quest to unravel Walt Disney’s final clue to ultimately find the very treasure that helped Walt build the greatest entertainment company in the world.THEIR ADVERSARY STOPS AT NOTHING TO GAIN THAT POWERDaniel Crain was content to sit on the sidelines and live the easy life. Now with a chance to up the stakes, he stops at nothing to step into the position of power he feels he deserves. The only thing standing in his way is Lance.THEY ARE IN A LIFE-OR-DEATH RACE TO UNCOVER THE MYSTERYWho will win the battle for Walt’s legacy—the one man determined to preserve it or the other man determined to destroy it? In what seems to be a no-way-out situation, Lance discovers there is far more to the Legacy of the great showman, Walt Disney, and is thrust into a life-or-death race to uncover what the Master Storyteller wants someone to find. Most readers after reading this book in the Hidden Mickey series can't wait to read the next novel... HIDDEN MICKEY 3 Wolf: The Legend of Tom Sawyer's Island",
  "genres": [
    "Mystery"
  ],
  "author": "Nancy Temple Rodrigue",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/9467593-hidden-mickey-2"
}