{
  "title": "Familyhood",
  "description": "For the longest time, based on no evidence other than our own insecurity and sense of incompetence, my wife and I were convinced that we were the flat-out, no-question-about-it, least-skilled parents in the country. Furthermore, we were convinced that every other set of parents we knew was perfect. They were more thorough in going over their kids' homework, they set better boundaries than we do, didn't let their kids watch as many hours of TV as we do, raised kids who are unfailingly polite in public and have a far greater sense of community and public service than our underachieving offspring over there on the couch watching SpongeBob. We were certain everybody else's kids willingly and joyfully eat nothing but healthy foods, shunning all candy and candy-based products, they all sensibly and automatically put on weather-appropriate clothing, and voluntarily call their grandparents with clockwork regularity, giving fully detailed accounts of their numerous accomplishments, ending with testimonials to their wonderful and perfect parents.Turns not so much. At all.In the number one New York Times bestseller Couplehood , Paul Reiser wrote about the highs and lows of falling in love and getting married-and the heartbreak and hilarity that comes with it. In Babyhood , he turned his sharply observant eye to the experiences of having a brand-new family. And now in Familyhood , Reiser shares his observations on parenting, marriage, and mid-life with the wit, warmth, and humor that he's so well-known for.From the first experience of sending his two boys off to summer camp-the early feelings of gleeful freedom in an empty house, to realizing how empty the house actually was -to maneuvering the minefield of bad words learned at school, this hilarious new book captures the spirit of familyhood, the logical next frontier for Reiser's trademark perspective on the universal truths of life, love, and relationships.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Memoir",
    "Biography",
    "Parenting",
    "Biography Memoir",
    "Family"
  ],
  "author": "Paul Reiser",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/9464743-familyhood"
}