{
  "title": "Persistence: All Ways Butch and Femme",
  "description": "Lambda Literary Award finalistAmerican Library Association Stonewall Honor BookIn the summer of 2009, butch writer and storyteller Ivan Coyote and gender researcher and femme dynamo Zena Sharman wrote down a wish-list of their favourite queer authors; they wanted to continue and expand the butch-femme conversation. The result is Persistence: All Ways Butch and Femme. The stories in these pages resist simple definitions. The people in these stories defy reductive stereotypes and inflexible categories. The pages in this book describe the lives of an incredible diversity of people whose hearts also pounded for some reason the first time they read or heard the words \"butch\" or \"femme.\"Contributors such as Jewelle Gomez (The Gilda Stories), Thea Hillman (Intersex), S. Bear Bergman (Butch is a Noun), Chandra Mayor (All the Pretty Girls), Amber Dawn (Sub Rosa), Anna Camilleri (Brazen Femme), Debra Anderson (Code White), Anne Fleming (Anomaly), Michael V. Smith (Cumberland), and Zoe Whittall (Bottle Rocket Hearts) explore the parameters, history, and power of a multitude of butch and femme realities. It's a raucous, insightful, sexy, and sometimes dangerous look at what the words butch and femme can mean in today’s ever-shifting gender landscape, with one eye on the past and the other on what is to come.Includes a foreword by Joan Nestle, renowned femme author and editor of The Persistent Desire: A Femme-Butch Reader, a landmark anthology originally published in 1992.Ivan E. Coyote is the author of seven books (including the novel Bow Grip, an American Library Association Stonewall Honor Book) and a long-time muser on the trappings of the two-party gender system.Zena Sharman is the assistant director of Canada's national Institute of Gender and Health.",
  "genres": [
    "Queer",
    "Nonfiction",
    "LGBT",
    "Feminism",
    "Gender",
    "Essays",
    "Lesbian"
  ],
  "author": "Ivan E. Coyote",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/9475378-persistence"
}