{
  "title": "A Brief History of Drugs: From the Stone Age to the Stoned Age",
  "description": "A clear-eyed look at the instrumental role drugs have played in our cultural, social, and spiritual development.• First American publication of the surprising European bestseller.• Examines everything from the ancient use of ergot and datura to the modern phenomenon of \"designer\" drugs such as Ecstasy and crack cocaine.From remotest antiquity to the present era of designer drugs and interdiction, drugs have played a prominent role in the cultural, spiritual, and social development of civilizations. Antonio Escohotado demonstrates how the history of drugs illuminates the history of humanity as he explores the long relationship between mankind and mind-altering substances. Hemp, for example, has been used in India since time immemorial to stimulate mental agility and sexual prowess. Aristotle's disciple Theophrastus testifies to the use of datura by the ancient Greeks and further evidence links the rites at Eleusis to the ingestion of a hallucinogen. Similar examples can be found in cultures as diverse as the Celts, the ancient Egyptians, the Aztecs, and other indigenous peoples around the world.Professor Escohotado also looks at the present-day differences that exist between the more drug-tolerant societies like Holland and Switzerland and countries advocating complete repression of these substances. The author provides a comprehensive analysis of the enormous social costs of the drug war that is coming under increasing fire from all levels of society. Professor Escohotado's work demonstrates that drugs have always existed and been used by societies throughout the world and the contribution they have made to humanity's development has been enormous. The choice we face today is to teach people how to use them correctly or to continue to indiscriminately demonize them. \"Just say no,\" the author says, is not an option. Just say \"know\" is.Antonio Escohotado is a professor of philosophy and social science methodology at the National University of Distance Education in Madrid, Spain. He travels widely, offering lectures and seminars on the subject of drugs and history.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Philosophy",
    "Sociology",
    "Health",
    "Classics"
  ],
  "author": "Antonio Escohotado",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/947188.A_Brief_History_of_Drugs"
}