{
  "title": "Ancora dalla parte delle bambine",
  "description": "Le eroine dei fumetti le invitano a essere belle. Le loro riviste propongono test sentimentali e consigli su come truccarsi. Nei loro libri scolastici, le mamme continuano ad accudire la casa per padri e fratelli. La pubblicità le dipinge come piccole cuoche. La moda le vuole in minigonna e tanga. Le loro bambole sono sexy e rispecchiano (o inducono) i loro sogni: diventare ballerine, estetiste, infermiere, madri. Questo è il mondo delle nuove bambine.Negli anni settanta, Elena Gianini Belotti raccontò come l’educazione sociale e culturale all’inferiorità femminile si compisse nel giro di pochi anni, dalla nascita all’ingresso nella vita scolastica. Le cose non sono cambiate, anche se le apparenze sembrano andare nella direzione contraria. Nessuno, è vero, impone più il grembiulino rosa alle bambine dell’asilo, ma in tutti i toni del rosa è dipinto il mondo di Barbie e delle sue molte sorelle. Libri, film e cartoni propongono, certo, più personaggi femminili di un tempo: ma confinandoli nell’antico stereotipo della fata e della strega. Ancora: l’immaginario recente tende a fotografare una scuola divisa in bulli e brave alunne, ma è proprio nel (presunto) rispetto delle regole che si fonda, da sempre, la creazione di un piccolo branco femminile che, crescendo, tramanderà a sua volta frustrazione, sudditanza, impotenza, rancore alle proprie figlie.Del resto, basta gettare uno sguardo al mondo adulto: al mondo occidentale, per essere esatti, dove è in atto quella che non sembri esagerato chiamare una guerra contro le donne, con relativi morti e feriti. Viceversa, la rappresentazione e la narrazione del femminile dipingono un panorama ancora una volta rosa: dove le donne sarebbero potenti come gli uomini perché in grado di licenziare un subordinato, o di consumare sesso, con lo stesso cinismo.Sembra legittimo chiedersi cosa sia accaduto negli ultimi trent’anni, e come mai coloro che volevano tutto (il sapere, la maternità, l’uguaglianza, la gratificazione) si siano accontentate delle briciole apparentemente più appetitose. E bisogna cominciare con l’interrogarsi sulle bambine: perché è ancora una volta negli anni dell’infanzia che le donne vengono indotte a consegnarsi a una docilità oggi travestita da rampantismo, a una certezza di subordine che persiste, e trova forme nuove persino in territori dove l’identità è fluida, e fluidissimi dovrebbero essere i generi, come il web. Per dirla con Pink, la popstar che nel video Stupid girls denunciava tempi cupi per il femminismo, bisogna dunque capire come sia possibile che le ragazze che volevano diventare presidenti degli Stati Uniti abbiano partorito figlie che sognano di sculettare seminude al fianco di un rapper. E per farlo, occorre tornare negli stessi luoghi dove le bambine compiono ancora oggi il loro apprendistato al secondo sesso: la famiglia, la scuola, il mondo dei media, l’immaginario dei libri e dei cartoni.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Italian Literature",
    "Womens",
    "Gender",
    "Essays",
    "Gender Studies"
  ],
  "author": "Loredana Lipperini",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/9470023-ancora-dalla-parte-delle-bambine"
}