{
  "title": "Pimps, Whores and Welfare Brats: From Welfare Cheat to Conservative Messenger",
  "description": "Star Parker holds nothing back in her memoir that explores how she went from a delinquent teenager to a conservative messenger.She was a delinquent teenager, mixed up with crime and drugs. In the 1970s, Star Parker came to Los Angeles with a dream of dancing on Soul Train— and ended up an unemployed single mom, barely literate, and living on welfare. But life on county aid was far from impoverished—she was able to lounge in her own jacuzzi, party at Venice Beach, bring in extra income with under-the-table jobs, and take the system for all it was worth.It was the power of Christianity that turned her life around. But it was Star's no-excuses attitude of self-empowerment that firmly positioned her on the fast track of conservative politics, speaking out against welfare as the cause of urban America's moral and economic decline—and in favor of taxpayer vouchers for private school education, banning abortion, and condemning condom distribution in public schools. Guided by her faith, Star has broken the \"code of silence\" among blacks to speak out -Affirmative \"What we haven't told our people is that they can start their own businesses. Entrepreneurship works for everybody.\"-Equal \"Capitalism doesn't have any racial boundaries.\"-The death \"How many murders do we have to read about before we get serious?\"-Black \"Blacks cannot cry racism every time something doesn't go their way.\"-The Los Angeles \"After three decades of handouts...they had evolved into a group of government-dependent, out-of-control, racist monsters.\"- \"White liberals are afraid. That monster they created in their socialist lab has gone crazy on them....Their liberalism has backfired.\"Speaking her mind and taking control of her life, Star Parker has forged a bright future. And while she'll always stir up controversy, there's no disputing that her rise from public assistance to public prominence is proof that the American dream is alive and well—for all of us.",
  "genres": [
    "Biography",
    "Politics",
    "Nonfiction",
    "Autobiography"
  ],
  "author": "Star Parker",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/94740.Pimps_Whores_and_Welfare_Brats"
}