{
  "title": "Back to the Garden",
  "description": "Back to the Garden - Original (Uncut, Unrevised, Uncensored)Discover the deliciously taboo lure of an incestuous siren call with four stories bundled into a wickedly hot anthology that’s determined to keep it all in the family!When Patrick's father went off to war in 1944, he told his eighteen-year-old son, You’re the “Man of the House” now. Patrick’s mother has struggled to keep them afloat, and he does what he can to help. He knows she’s tired, sad and very lonely, but when circumstance brings a young woman into their lives for a brief time, it alters everything between he and his mother forever. Will Patrick become the real “man of the house” before his father returns from the war?In “The Garden of Eden,” Libby has lived her whole life with her father, Ed, in a nudist colony. It’s a very open, natural life, and they’ve never had an issue--until Libby’s mother, Kim, re-enters their lives. Kim is appalled by their living and sleeping arrangements and wants to take Libby away from the nudist life. Libby, still devastated by her mother’s abandonment, wants to have nothing to do with the shopping trips and material things her mother is offering, but the longer Kim stays, the more everything --everything--becomes a greater temptation.In “Lassoing the Moon,” Leila knows she’s always been closer to her son, Rich, than most mothers, since Rich’s father left when he was just a baby. He’s been the man in her life forever--but now he’s really a man, and his coming-of-age is a test for both of them.In “Lost Souls,” eighteen-year-old Lily, raised by her fundamentalist preacher father, Adam, isn’t allowed to date or do anything against church “law.” Asked to the Halloween dance by a boy she really likes, Lily defies Adam. But when they are caught in a compromising position by her father, what will her punishment and repentance be?Warnings: This title contains graphic language and sex as well as mother-son and father-daughter incest.",
  "genres": [
    "Erotica",
    "Short Stories",
    "M F Romance",
    "Erotic Romance",
    "Anthologies"
  ],
  "author": "Selena Kitt",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/9476080-back-to-the-garden"
}