{
  "title": "Eating Beauty: The Eucharist and the Spiritual Arts of the Middle Ages",
  "description": "\"The enigmatic link between the natural and artistic beauty that is to be contemplated but not eaten, on the one hand, and the eucharistic beauty that is both seen (with the eyes of faith) and eaten, on the other, intrigues me and inspires this book. One cannot ask theo-aesthetic questions about the Eucharist without engaging fundamental questions about the relationship between beauty, art (broadly defined), and eating.\"―from Eating Beauty In a remarkable book that is at once learned, startlingly original, and highly personal, Ann W. Astell explores the ambiguity of the phrase \"eating beauty.\" The phrase evokes the destruction of beauty, the devouring mouth of the grave, the mouth of hell. To eat beauty is to destroy it. Yet in the case of the Eucharist the person of faith who eats the Host is transformed into beauty itself, literally incorporated into Christ. In this sense, Astell explains, the Eucharist was \"productive of an entire 'way' of life, a virtuous life-form, an artwork, with Christ himself as the principal artist.\" The Eucharist established for the people of the Middle Ages distinctive schools of sanctity―Cistercian, Franciscan, Dominican, and Ignatian―whose members were united by the eucharistic sacrament that they received. Reading the lives of the saints not primarily as historical documents but as iconic expressions of original artworks fashioned by the eucharistic Christ, Astell puts the \"faceless\" Host in a dynamic relationship with these icons. With the advent of each new spirituality, the Christian idea of beauty expanded to include, first, the marred beauty of the saint and, finally, that of the church torn by division―an anti-aesthetic beauty embracing process, suffering, deformity, and disappearance, as well as the radiant lightness of the resurrected body. This astonishing work of intellectual and religious history is illustrated with telling artistic examples ranging from medieval manuscript illuminations to sculptures by Michelangelo and paintings by Salvador Dalí. Astell puts the lives of medieval saints in conversation with modern philosophers as disparate as Simone Weil and G. W. F. Hegel.",
  "genres": [
    "Theology",
    "Medieval"
  ],
  "author": "Ann W. Astell",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/1319487.Eating_Beauty"
}