{
  "title": "Under Her Skin",
  "description": "Three short stories of paranormal Jeaniene Frost's \"Pack\" brings you a tale of a lost hiker and her encounter with some very frightening--and sexy--wolves. A female werewolf helps a sheriff track down a killer \"In Sheep's Clothing\" by Meljean Brook. A woman must repay her family's debt to a shapeshifting magician in Ilona Andrews's \"Grace of Small Magics.\"These stories previously appeared in print in Mammoth Book of Paranormal Romance.About the Jeaniene Frost is the New York Times and USA Today bestselling author of the Night Huntress series and the Night Huntress World novels. To date, foreign rights for her novels have sold to fifteen different countries. Jeaniene lives in Florida with her husband Matthew, who long ago accepted that she swears like a sailor, rarely cooks, and always sleeps in on the weekends. Aside from writing, Jeaniene enjoys reading, poetry, watching movies with her husband, exploring old cemeteries, spelunking and traveling - by car. Airplanes, children, and cookbooks frighten her.Meljean Brook is the bestselling author of the Guardian series and the Iron Seas series. She was raised in the middle of the woods, and hid under her blankets at night with fairy tales, comic books, and romances. Meljean left the forest and went on a misguided tour through the world of accounting before focusing on her first loves, reading and writing-and she realized that monsters, superheroes, and happily-ever-afters are easily found between the covers, as well as under them, so she set out to make her own. Meljean lives in Portland, Oregon with her husband and daughter. Ilona Andrews is the pseudonym for a husband-and-wife writing team. Ilona is a native-born Russian and Gordon is a former communications sergeant in the U.S. Army. Contrary to popular belief, Gordon was never an intelligence officer with a license to kill, and Ilona was never the mysterious Russian spy who seduced him. They met in college, in English Composition 101, where Ilona got a better grade. (Gordon is still sore about that.)  Gordon and Ilona currently reside in Portland, Oregon with their two children, three dogs and one cat. They have co-authored two bestselling series, the urban fantasy of Kate Daniels and romantic urban fantasy of The Edge.",
  "genres": [
    "Urban Fantasy",
    "Paranormal",
    "Paranormal Romance",
    "Anthologies",
    "Romance",
    "Fantasy",
    "Short Stories"
  ],
  "author": "Jeaniene Frost",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/9487275-under-her-skin"
}