{
  "title": "Broken Words: The Abuse of Science and Faith in American Politics",
  "description": "Abortion. Homosexuality. Environmentalism. Evolution. Conservative positions on these topics have divided American politics and defined mainstream evangelical Christianity. But what if the strongest arguments against popular evangelical stances on these issues come from evangelical Christianity itself?     Growing up as an evangelical Christian, Jonathan Dudley was taught that abortion is murder, homosexuality sin, evolution nonsense, and environmentalism a farce. He learned to accept these conclusions--the \"big four\"--as part of the package deal of Christianity. Yet, when he began studying biology at the evangelical Calvin College and theology at Yale Divinity School, Dudley's views started to change. He soon realized that what he had been told about the Bible--and those four big issues involving scripture and biology--may have been misconstrued and that what so many Christians believe about key social and political issues may be wrong.     Arguing against absolutism on abortion and opposition to embryonic stem cell research, Dudley shows that most Christian theologians throughout history, including Augustine, Aquinas, and even American evangelicals up until the 1980s, have believed that life does not begin at conception. He argues that evangelical opposition to gay marriage has more to do with allegiance to socially conservative cultural values than allegiance to the Bible. He demonstrates that traditional Christian valuations of science, as well as scientific evidence itself, should lead evangelicals to accept evolution and reject both creationism and intelligent design. And he surveys how evangelicals are changing their minds about environmentalism, and how this development supports a new way of thinking about the Bible. Throughout the book, Dudley, now an M.D. student at The Johns Hopkins School of Medicine, also illustrates the scientific problems with popular evangelical views. In the process, he lays the groundwork for a new generation of post-Religious Right evangelical political activists, who believe in evolution, rally behind the environmental movement, are moderate on abortion, and support gay marriage--and who are more faithful to orthodox Christianity than their counterparts.",
  "genres": [
    "Religion",
    "Science",
    "Politics",
    "Nonfiction",
    "Theology",
    "Christianity",
    "Faith"
  ],
  "author": "Jonathan Dudley",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/9489306-broken-words"
}