{
  "title": "Twelve Dancing Princesses: Tales from Around the World",
  "description": "The Twelve Dancing Princesses is a fairy tale known under several names such as \"The Dancing Shoes,\" \"The Worn-out Shoes,\" and \"The Shoes that Were Danced to Pieces.\" The best known version of the tale comes from the Brothers Grimm and yet the tale remains relatively obscure in comparison to tales such as Cinderella, Sleeping Beauty and Rapunzel. However, it has been a popular favorite with fairy tale readers for decades, appearing in countless collections of tales, but rarely studied. In recent years, many books and even a toy collection, a movie and a musical have used the story as inspiration. This collection offers over twenty variants of The Twelve Dancing Princesses, some that are new English translations. In addition, several Grateful Dead tales and Greek myths are presented as interesting comparisons to the tale. Sometimes the princesses journey to a version of hell, at other times they visit a version of heaven. Many of the stories are obviously related to each other and at times the relationship is tenuous. Some additional stories with similar motifs or elements are also included, illustrating that the elements of this tale are not as obscure as they first appear. In the over fifty tales collected here, strange journeys are made, secrets are revealed, and curses are broken. Most-but not all-of the heroes and heroines live happily ever after. Either way, the journeys and the mysteries they solve provide fascinating visits to other realms. Whether you are a student of folklore or an armchair enthusiast, this anthology offers a diverse array of tales with a unifying theme that both entertains and educates, all gathered for the first time in one helpful collection.",
  "genres": [
    "Fairy Tales",
    "Reference",
    "Classics",
    "Fantasy"
  ],
  "author": "Heidi Anne Heiner",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/9489708-twelve-dancing-princesses"
}