{
  "title": "The Ages of Chaos",
  "description": "The Ages of Chaos includes Stormqueen! and Hawkmistress! , two acclaimed novels by Marion Zimmer Bradley and part of the expansive, genre-bending Darkover series. Set during the lawless Ages of Chaos, when the ruling families of the Seven Domains of Darkover ruthlessly inbred their psychic offspring to gain powerful and fearsome talents, two young women are born with \"wild\" psychic gifts. These stories— Stormqueen!  and  Hawkmistress! , one tragic and one triumphant—combine to give the reader a vivid and poignant picture of a devastating time period in the history of this fantastic world. Stormqueen!During the lawless Ages of Chaos, when the ruling families of Darkover ruthlessly inbred their laran -gifted offspring to gain powerful talents, a baby was born to the lord of Aldaran. This child, born on a dark and thunder-filled night­­­­, was possessed of a terrifying and uncontrolled talent: Dorilys, heiress to her father’s domain, could unwittingly call forth lightning, even while still a fretful child. Fearful for his daughter’s life and the safety of his domain, Lord Aldaran sent to a tower for help. But even the powers of a trained monitor and a Hastur lord might not be enough to save this painfully afflicted and deadly young woman. Hawkmistress!Romilly was an independent tomboy from a noble family, contrary to the social demands of Darkovan women. That was bad enough, but when Romilly’s father arranged her marriage to a nobleman she found repulsive, she rebelled. Disguising herself as a boy, she fled into the deep forests. Living off the land was not nearly as difficult for Romilly as for most people, for she possessed a rare and highly-treasured gift—telepathic communication with hawk and horse. But Romilly soon discovered her newfound freedom was far from complete. Pulled into the maelstrom of a civil war, could Romilly find her true role in life without sacrificing her ideals?",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Romance",
    "Epic Fantasy",
    "Own"
  ],
  "author": "Marion Zimmer Bradley",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/948961.The_Ages_of_Chaos"
}