{
  "title": "Out of the Flames: The Remarkable Story of a Fearless Scholar, a Fatal Heresy, and One of the Rarest Books in the World",
  "description": "Michael Servetus is one of those hidden figureheads of history who is remembered not for his name, but for the revolutionary deeds that stand in his place. Both a scientist and a freethinking theologian, Servetus is credited with the discovery of pulmonary circulation in the human body as well as the authorship of a polemical masterpiece that cost him his life. The Chrisitianismi Restituto, a heretical work of biblical scholarship, written in 1553, aimed to refute the orthodox Christianity that Servetus' old colleague, John Calvin, supported. After the book spread through the ranks of Protestant hierarchy, Servetus was tried and agonizingly burned at the stake, the last known copy of the Restitutio chained to his leg.Servetus's execution is significant because it marked a turning point in the quest for freedom of expression, due largely to the development of the printing press and the proliferation of books in Renaissance Europe. Three copies of the Restitutio managed to survive the burning, despite every effort on the part of his enemies to destroy them. As a result, the book became almost a surrogate for its author, going into hiding and relying on covert distribution until it could be read freely, centuries later. Out of the Flames tracks the history of this special work, examining Servetus's life and times and the politics of the first information during the sixteenth century. Lawrence and Nancy Goldstone follow the clandestine journey of the three copies through the subsequent centuries and explore its author's legacy and influence over the thinkers that shared his spirit and genius, such as Leibniz, Voltaire, Rousseau, Jefferson, Clarence Dorrow, and William Osler.Out of the Flames is an extraordinary story providing testament to the power of ideas, the enduring legacy of books, and the triumph of individual courage.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Books About Books",
    "Biography",
    "Science",
    "Historical"
  ],
  "author": "Lawrence Goldstone",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/948508.Out_of_the_Flames"
}