{
  "title": "Sex, Race and Class: The Perspective of Winning: A Selection of Writings 1952-2011",
  "description": "“It’s time to acknowledge James’s path-breaking analysis: from 1972 she reinterpreted the capitalist economy to show that it rests on the usually invisible unwaged caring work of women.” —Dr. Peggy Antrobus, feminist, author of The Global Women’s Movement: Origins, Issues and Strategies“For clarity and commitment to Haiti’s revolutionary legacy…Selma is a sister after my own heart.” —Danny Glover, actor and activist“The publication of these essays reflects in concentrated form the history of the new society struggling to be born. Their appearance today could not be timelier. As the fruit of the collective experience of the last half-century, they will help to acquaint a whole new generation with not only what it means to think theoretically, but, more importantly, the requirement of organization as the means of testing those ideas. In this respect, Selma James embodies in these essays the spirit of the revolutionary tradition at its most relevant.” —Dr. Robert A. Hill, Literary Executor of the estate of C.L.R. James, University of California, Los Angeles, Director, Marcus Garvey Papers Project“In this incisive and necessary collection of essays and talks spanning over five decades, Selma James reminds us that liberation cannot be handed down from above. This is a feminism that truly matters.” —Dr. Alissa Trotz, Associate Professor of Women and Gender Studies, Director of Caribbean Studies, University of Toronto“With her latest book, Selma James reaffirms what has been evident for some time: she is—quite simply—not only one of the most outstanding feminist thinkers of her generation but, as well, an insightful and exceedingly intelligent political analyst.” —Dr. Gerald Horne, historian and author, John J. and Rebecca Moores Chair of History and African American Studies at the University of Houston“Selma James’s, Sex, Race and Class: The Perspective of Winning, a collection of her works over the decades. James was a founder of the Wages for Housework movement, and probably the one person whose thoughts on work, care, and power has influenced my work the most. She’ll change your life.” —Sarah Jaffe",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Politics",
    "Race",
    "Gender",
    "Economics",
    "Womens"
  ],
  "author": "Selma James",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/13198864-sex-race-and-class"
}