{
  "title": "The Slum",
  "description": "First published in 1890, and undoubtedly Azevedo's masterpiece, The Slum is one of the most widely read and critically acclaimed novels ever written about Brazil. Indeed, its great popularity, realistic descriptions, archetypal situations, detailed local coloring, and overall race-consciousness may well evoke Huckleberry Finn as the novel's North American equivalent. Yet Azevedo also exhibits the naturalism of Zola and the ironic distance of Balzac; while tragic, beautiful, and imaginative as a work of fiction, The Slum is universally regarded as one of the best, or truest, portraits of Brazilian society ever rendered.This is a vivid and complex tale of passion and greed, a story with many different strands touching on the different economic tiers of society. Mainly, however, The Slum thrives on two intersecting story lines. In one narrative, a penny-pinching immigrant landlord strives to become a rich investor and then discards his black lover for a wealthy white woman. In the other, we witness the innocent yet dangerous love affair between a strong, pragmatic, \"gentle giant\" sort of immigrant and a vivacious mulatto woman who both live in a tenement owned by said landlord. The two immigrant heroes are originally Portuguese, and thus personify two alternate outsider responses to Brazil. As translator David H. Rosenthal points out in his useful Introduction: one is the capitalist drawn to new markets, quick prestige, and untapped resources; the other, the prudent European drawn moth-like to \"the light and sexual heat of the tropics.\"A deftly told, deeply moving, and hardscrabble novel that features several stirring passages about life in the streets, the melting-pot realities of the modern city, and the oft-unstable mind of the crowd, The Slum will captivate anyone who might appreciate a more poetic, less political take on the nineteenth-century naturalism of Crane or Dreiser.",
  "genres": [
    "Classics",
    "Fiction",
    "Brazil",
    "Romance",
    "Literature",
    "Portuguese Literature",
    "School"
  ],
  "author": "Aluísio Azevedo",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/949601.The_Slum"
}