{
  "title": "The Widow's Son",
  "description": "Enjoy the music, politics, fashion, televison and movie fare of the 1960s. Did you know that 2 days before the blizzard of 1967 that brought the Midwest to a halt, it was a balmy 65 degrees? Or that Wild Thing by the Troggs kicked the Beatle's Paperback Writer off the top of the pop charts? Or that Gomer Pyle USMC replaced the Dick Van Dyke Show? These details unique to 1966 and 1967 also include the Apollo 1 disaster, what young men did to avoid the draft and Vietnam, and President Johnson's conclusion in 1966 that the Vietnam War had been as good as won. All of this incredible history, accurately researched and woven into this incredible story without a seam, presents a historic backdrop for a powerful tale of survival - and the detemination of a neighborhood filled with beloved nuts and bolts who go beyond the call to save a broken family. And it all begins with these words of a child's lament - When I hear the news I want to jump on the dining room clock and make time go backwards . . . Based on the real life loss of the author's father, Bruce Steinberg brings his passionate tale home as told through the eyes of his oldest brother - a child on the cusp of manhood who does not easily take to wearing the crown of New Man of the House.The moment 12-year-old Jeremy Rosenberg witnesses his father's death, Jeremy loses the world he assumed would last forever. With a young brother expecting their father to yet come home, a sister blaming herself, and a mother falling toward isolation, Jeremy is sent fatherless into the world just as he enters adolescence. Beautifully and memorably set in mid-1960s Chicago suburbia, The Widow's Son is launched on a devastating moment. But this tale of misguided efforts and accidental triumphs of children forced into adult emotions creates a humorous, poignant novel. The reader's laughter and tears are sure to flow together to the last page as Jeremy battles to make his family into a family once again.Author Bruce Steinberg also writes under the name B.R. Robb, and is the author of River Ghosts, a critically acclaimed novel for your review under Amazon.com's Look Inside program.",
  "genres": [
    "Historical Fiction",
    "Contemporary",
    "Historical"
  ],
  "author": "Bruce Steinberg",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/9494657-the-widow-s-son"
}