{
  "title": "Marching Bands Are Just Homeless Orchestras, Half-Empty Thoughts Vol. 1",
  "description": "From back If you're looking for glass-half-full affirmations, you're in luck. The bookstore or library is half full of that kind of crap. What you're holding here is a collection of quips and observations with a refreshingly gloomy, sometimes twisted, always funny take on life. Or lack thereof.With illustrations by renowned artist Brian Andreas, this book is a glimpse inside the humorously askew mind of a writer whose witticisms have been featured on NPR, printed onto t-shirts, performed on stage in Germany, and posted online at the Washington Post, Wall Street Journal, and New York Times. He's been named one of the top ten funniest people on Twitter by the likes of Maxim, MSNBC, and Mashable.\"Tim Siedell clearly has no life, but he's extremely funny while not having one.\" Rob Reiner; Actor, Director, Writer, ProducerFrom Oxford University At some point, I think we’ve all asked ourselves, “When is the best time to start training a kitten to hold a knife?”That question—written by Tim Siedell, a.k.a Twitter’s badbanana – is one of the expertly crafted one-liners you can find in his new book Marching Bands Are Just Homeless Half-empty Thoughts Vol 1. It’s the funnest/funniest book I’ve picked up in donkey’s years, and it’s also pretty and shiny and full of cool illustrations by Brian Andreas. Unless you hate puppies and America, you should give yourself and your minions this tremendous book... -by Mark PetersMore on author Tim \"Smart, insightful, and genuinely hilarious.\" Adam Savage, Co-host, MythBusters\"In a medium that rewards wit, Tim Siedell is the most rewarding.\" Scott Simon, Host, NPR Weekend Edition\"A barrage of funny.\" Maxim.com\"The dude is a one-liner machine.\" Mark Sullivan, MSNBC.com",
  "genres": [
    "Humor",
    "Nonfiction",
    "Comedy"
  ],
  "author": "Tim Siedell",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/9504484-marching-bands-are-just-homeless-orchestras-half-empty-thoughts-vol-1"
}