{
  "title": "Digger's Bones",
  "description": "Archaeologist Angie Cooper's colleague and friend, Tarek \"Digger\" Rashid, is murdered in front of her. But not before giving her cryptic photographic clues to a hidden tomb and the two thousand year old bones within. Angie must battle a ruthless hitman, hired by a U.S. senator with presidential aspirations, and a sociopathic religious zealot while overcoming severe acrophobia. Caught in a web of lies, deceit, and betrayal, she works to unravel the secret of Digger's bones. Bones that affect the lives of all they touch.Digger's Bones is an action packed thriller that takes you from the churches and burial tombs of ancient Jerusalem to the harrowing cliffs of Bandelier National Monument and the glacier capped Zugspitze in Germany. Angie Cooper, her career in shambles, finds herself on the run from mercenaries, the Holy See, the FBI, and Interpol while trying to solve one of archaeology’s great mysteries. Yet some things are better left in the past.What reviewers are saying about the The book is fast paced and full of action. I feel the book was well written and very enjoyable. There are many plot twists that keep the reader guessing till the very end.There is a kind of an \"Indiana Jones\" and \"DaVinci Code\" feeling to the book.—Allen Cook, The Book ReviewPaul Mansfield Keefe has written a thrilling book that takes you on a ride worthy of the big screen.Angie is a very likable and interesting character, and you find yourself rooting for her. There are several unexpected twists and turns, and you're barely given time to catch your breath before Angie is off and running again.I wanted to keep reading to discover what happened next. (…) the last few pages of the book are satisfying to the reader who has (read) the story the whole way through.—Grace Krispy, MotherLodeIn Digger’s Bones, Paul Mansfield Keefe has brought to life a possibility of epic proportions. Keefe has written a story that is well researched, and just unbelievable enough to be believable.Digger’s Bones is a roller coaster of emotion; this story is full of surprises, and the ending is no different.I would recommend this book to anyone who loves a great adventure, (a) book club or reading group would find a great deal of different and interesting, and possibly controversial (reading).—Leslie Wright, blogcritics.comWith a lot of suspense, action and an intelligent plot, Keefe’s work is promising—and will probably bother some religious people.We get to see a lot of Jerusalem, DC and the Zugspitze in Germany throughout the story. If you like suspense novels with some history in them, this book is for you. It has a lot of details—result of an extensive research, I assume—that make the story believable, gripping.—Mavea, Murphy’s Library",
  "genres": [
    "Fiction",
    "Mystery"
  ],
  "author": "Paul Mansfield Keefe",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/9504832-digger-s-bones"
}