{
  "title": "The Next Boom: What You Absolutely, Positively Have to Know About the World Between Now and 2025",
  "description": "In The Next Boom , Jack W. Plunkett, widely followed analyst and CEO of Plunkett Research, Ltd., persuasively demonstrates the emerging trends, technologies and changes that will lead to a new period of substantial economic growth in emerging nations as well as many of the world's leading economies. He presents a panorama of carefully documented developments in areas including energy, health care, education, demographics, trade, technologies and the rapidly-growing global middle class - showing how trends in America and around the world have tremendous synergy that will lead to a long-term surge in global business. Plunkett supports his theory through an entertaining analysis of global prospects for what he defines as the \"near future,\" from 2013-2025. The author explains opportunities for significant economic growth for America and other well-developed nations. He also details how mature countries like the U.S. will face competition of growing intensity in the areas of higher education, motivated young workforces, entrepreneurship and government support of business investment. Provocative and far-reaching, the author demonstrates how The Next Boom and its underlying causes will have a deep, evolutionary effect on all of us. The Next Boom , with its powerful and optimistic vision of the surprising changes ahead, arrives at a timely juncture. Plunkett details the most exciting technologies for the future, including those in which America has a solid nanotechnology, remote wireless sensors and biotechnology. At the same time, he shows how America is one of few nations with a rapidly growing population, and explains how this can be a tremendous economic advantage by providing both a vital young workforce and a growing tax base. The next billion consumers will soon emerge on a worldwide basis. The author details how and why this continued growth of the global middle class will vastly increase demand for goods and services, attracting ever-greater innovation, competition and global trade. Plunkett is not suggesting that you look at the world through rose-colored glasses. Instead, he believes that you will benefit most from the state of the world today by understanding the changes, challenges, opportunities and risks that are occurring around you in order to prepare yourself for The Next Boom . The book includes a reading group guide for book club use and discussion. In addition, the author has produced a series of 10 short videos, each one related to a chapter in The Next Boom . Links to the videos are included within the book, and they can also be found on YouTube. This book shows what you absolutely, positively have to know about the near future. The Next Boom will be an exciting period of solid global growth that will create immense opportunities for investment, business formation, innovation and job creation. However, Plunkett shows how and why not all nations will benefit equally. The information provided in The Next Boom is vital to investors, managers, consultants, leaders in government and educators. This book will help you understand how to best position your business, your investments and your career to benefit from the coming era of global growth.",
  "genres": [
    "Business"
  ],
  "author": "Jack W. Plunkett",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/9504532-the-next-boom"
}