{
  "title": "Uprooting Racism: How White People Can Work for Racial Justice",
  "description": "Continuously at the top of New Society Publishers’ best-seller list for five years, Uprooting Racism has sold over 25,000 copies since its first printing. Substantially revised and expanded, the new edition has more tools to help white people understand and stand-up to racism.Uprooting Racism explores the manifestations of racism in politics, work, community, and family life. It moves beyond the definition and unlearning of racism to address the many areas of privilege for white people and suggests ways for individuals and groups to challenge the structures of racism. Uprooting Racism’s welcoming style helps readers look at how we learn racism, what effects it has on our lives, its costs and benefits to white people, and what we can do about it.In addition to updating existing chapters, the new edition of Uprooting Racism explores how entrenched racism has been revealed in the new economy, the 2000 electoral debacle, rising anti-Arab prejudice, and health care policy. Special features include exercises, questions, and suggestions to engage, challenge assumptions, and motivate the reader towards social action. The new edition includes an index and an updated bibliography.Marketing Plans: • Print review campaign to progressive and social action magazines • Web publicity campaign to progressive and activist sites • Course adoption campaign • Advertising in Education magazines • Promotional mailing to librariesPaul Kivel is the author of Boys Will Be Men (ISBN: 0-86571-395-2, New Society Publishers, 1999) and Men's Work (ISBN: 0-34537-939-X, Ballantine, 1998). He is the founder of the nationally recognized Oakland's Men's Project and has conducted hundreds of workshops on racism and anti-violence for teens and men all over the country. He lives in Oakland, California.Also Available by Paul KivelBoys Will Be Men: Raising Our Sons for Courage, Caring, and Community TP $16.95, 0-86571-395-2 • USA",
  "genres": [
    "Race",
    "Social Justice",
    "Nonfiction",
    "Anti Racist",
    "Sociology",
    "Politics",
    "History"
  ],
  "author": "Paul Kivel",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/95099.Uprooting_Racism"
}