{
  "title": "Short Nights of the Shadow Catcher: The Epic Life and Immortal Photographs of Edward Curtis",
  "description": "How a lone man's epic obsession led to one of America's greatest cultural treasures: Prize-winning writer Timothy Egan tells the riveting, cinematic story behind the most famous photographs in Native American history -- and the driven, brilliant man who made them.Edward Curtis was charismatic, handsome, a passionate mountaineer, and a famous photographer, the Annie Leibovitz of his time. He moved in rarefied circles, a friend to presidents, vaudeville stars, leading thinkers. And he was thirty-two years old in 1900 when he gave it all up to pursue his Great Idea: to capture on film the continent’s original inhabitants before the old ways disappeared.An Indiana Jones with a camera, Curtis spent the next three decades traveling from the Havasupai at the bottom of the Grand Canyon to the Acoma on a high mesa in New Mexico to the Salish in the rugged Northwest rain forest, documenting the stories and rituals of more than eighty tribes. It took tremendous perseverance - ten years alone to persuade the Hopi to allow him into their Snake Dance ceremony. And the undertaking changed him profoundly, from detached observer to outraged advocate. Eventually Curtis took more than 40,000 photographs, preserved 10,000 audio recordings, and is credited with making the first narrative documentary film. In the process, the charming rogue with the grade school education created the most definitive archive of the American Indian. His most powerful backer was Theodore Roosevelt, and his patron was J. P. Morgan. Despite the friends in high places, he was always broke and often disparaged as an upstart in pursuit of an impossible dream. He completed his masterwork in 1930, when he published the last of the twenty volumes. A nation in the grips of the Depression ignored it. But today rare Curtis photogravures bring high prices at auction, and he is hailed as a visionary. In the end he fulfilled his promise: He made the Indians live forever.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Photography",
    "Native American",
    "Art",
    "American History"
  ],
  "author": "Timothy Egan",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/13202051-short-nights-of-the-shadow-catcher"
}