{
  "title": "Seaborn",
  "description": "Seaborn is the middle part of Kassandra’s story--that begins with Saltwater Witch and concludes with Seaborn's sequel, Sea Throne.Seaborn is a contemporary fantasy about the loss of freedom. There are two heroines. One, Corina Lairsey has just lost all physical control, and her story is about how she fights, convinces, bargains with the evil inside in order to get her self back. The other is Kassandra, who is from the sea, but has grown up in Nebraska in exile. She has the opposite problem Corina has. Kassandra’s one of the most powerful things from the sea, but she’s the product of others’ manipulations, following a path to the throne she’s not sure she wants to take, struggling to be certain that any motive in her head is really her own.\"From the first page of Seaborn, you are immersed. Chris Howard navigates a wild ride through a brilliantly edgy and richly atmospheric alter-world. Here is a fresh, formidable spin on fantasy, and Howard is a talent to watch out for. Seaborn will leave you spellbound.\"—Adele Griffin, author of where I want to be\"Dark and atmospheric, Seaborn is an imaginative new entry in the world of paranormal fiction.\"—Liz Maverick, author of Wired, a Publishers Weekly Best Book of 2007\"...a fresh and entertaining read and I fully expect we will be hearing more from Chris Howard in the future.\"—SciFiGuy\"Fascinating read...\" —Romantic Times 4 star reviewJuno Books Corina Lairsey has just clawed her way free from one controlling relationship when she finds herself in another-only this guy, Aleximor, has really gotten under her skin. Literally. A 400-year-old sorcerer who gathers the drowned dead off the ocean's floor for the King of the Seaborn, he's inside her head and is wearing her body like a suit. Corina desperately schemes to regain control of her self, fighting against time as Aleximor trades pieces of her life away in exchange for power over the path between the worlds of the living and the dead . . . Kassandra is the King of the Seaborn's granddaughter. She comes from the sea, but has spent her whole life in exile on the surface, struggling to control frightening powers she barely understands. She declares war on her murderous grandfather and manipulates her family, friends, oceanic royalty, and the US Navy to aid her--but Aleximor intends to use Kass to carry out his revenge against the entire Seaborn royal line. And she's also fallen in love-one more struggle for an already troubled soul.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Mermaids",
    "Young Adult",
    "Paranormal",
    "Fiction",
    "Unfinished"
  ],
  "author": "Chris  Howard",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/9510325-seaborn"
}