{
  "title": "The Personal MBA: Master the Art of Business",
  "description": "Getting an MBA is an expensive choice-one almost impossible to justify regardless of the state of the economy. Even the elite schools like Harvard and Wharton offer outdated, assembly-line programs that teach you more about PowerPoint presentations and unnecessary financial models than what it takes to run a real business. You can get better results (and save hundreds of thousands of dollars) by skipping B-school altogether.Josh Kaufman founded PersonalMBA.com as an alternative to the business school boondoggle. His blog has introduced hundreds of thousands of readers to the best business books and most powerful business concepts of all time. Now, he shares the essentials of entrepreneurship, marketing, sales, negotiation, operations, productivity, systems design, and much more, in one comprehensive volume. The Personal MBA distills the most valuable business lessons into simple, memorable mental models that can be applied to real-world challenges.The Personal MBA explains concepts such * The Iron Law of the Why every business is limited by the size and quality of the market it attempts to serve-and how to find large, hungry markets.* The 12 Forms of Products and services are only two of the twelve ways you can create value for your customers.* The Pricing Uncertainty All prices are malleable. Raising your prices is the best way to dramatically increase profitability-if you know how to support the price you're asking.* 4 Methods to Increase There are only four ways a business can bring in more money. Do you know what they are?True leaders aren't made by business schools-they make themselves, seeking out the knowledge, skills, and experience they need to succeed. Read this book and you will learn the principles it takes most business professionals a lifetime of trial and error to master.",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Finance",
    "Entrepreneurship",
    "Management",
    "Personal Development"
  ],
  "author": "Josh Kaufman",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/9512985-the-personal-mba"
}