{
  "title": "GALAPAGOS",
  "description": "Galápagos is the story of a small band of mismatched humans who get shipwrecked on the fictional island of Santa Rosalía in the Galápagos Islands after a global financial crisis has crippled the world's economy. Shortly thereafter, a disease renders humans infertile, with the exception of the people on Santa Rosalía, making them the last specimens of humankind. Over the next million years, their descendants, the only fertile humans left on the planet, eventually evolve into a species resembling seals: tho possibly still able to walk upright (it is not explicitly mentioned, but it is stated that they occasionally catch land animals), they have a snout with teeth adapted for catching fish, a streamlined skull & flippered hands with rudimentary fingers. The novel is not the story of how they survived on the island. It is the story of how a series of unrelated events got these people to the island. The story's narrator is a spirit who has been watching over humans for the last million years. This particular ghost is the immortal spirit of Leon Trotsky Trout, son of Vonnegut's recurring character Kilgore Trout. Leon, a Vietnam War veteran who is affected by the massacres there, goes AWOL settling in Sweden where he works as a shipbuilder & dies during the construction of the ship, the Bahía de Darwin. This ship is used for the Nature Cruise of the Century which would help the human race to survive on Galápagos. Kilgore Trout, tho deceased, makes four appearances, urging his son to enter the \"blue tunnel\" that leads to the Afterlife. When Leon refuses the 4th time, Kilgore pledges that he, & the blue tunnel, will not return for a million years, which leaves Leon to observe the slow process of evolution that transforms the species into aquatic mammals--a process which begins when a Japanese woman on the island, grandchild of a Hiroshima survivor, gives birth to a fur-covered daughter. Trout maintains that all the sorrows of humankind were caused by \"the only true villain in my story: the oversized human brain\". Fortunately, natural selection eliminates this problem, since the humans best fitted to Santa Rosalía were those who swim best, which required a streamlined head, which in turn required a smaller brain size.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Classics",
    "Humor",
    "Literature",
    "Novels",
    "American"
  ],
  "author": "Kurt Vonnegut Jr.",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/951582.GALAPAGOS"
}