{
  "title": "God's Fool",
  "description": "Born attached at the chest, Chang and Eng were considered a marvel, an omen, an act of God, evidence of His glory or proof of His wrath. Uniquely cursed, enslaved to one another for life, they were a joke of nature variously feared and abhorred, disturbing our most basic assumptions about the human condition. Mark Slouka’s dazzling achievement in God’s Fool is the ease and compassion with which he draws the story of one human being from this ghastly predicament. Looking beyond the twins’ physical connection, he imagines one man’s life of ordinary grace and suffering, longing and resistance, and the ties of love, as well as of blood, that bind and redeem us all.By any standard, theirs is a history of epic variety and drama. Their birth, to an illiterate fishmonger, sent midwives screaming from the room. Condemned to death, they survived to be brought, at the age of thirteen, to the Royal Palace in Bangkok for an audience with King Rama III. At seventeen, laboring as merchants on the Meklong River, they saw their world erased by a typhoon. Consigned for three hundred pounds to an opium trader by their mother, who was desperate to ensure their survival, they sailed for Europe. There they entertained kings and counselors in salons and drawing rooms from Brussels to Rome, and, in Paris, met the woman who would divide them as no surgeon ever could.When the culture that had lifted them up inevitably cast them down, they landed in the flophouses of London, where, penniless and starving, they were discovered by Phineas T. Barnum, who packed them off to America along with an assortment of bearded ladies and two-headed calves, albino beauties and dog boys, German midgets and twelve-fingered flute players. Leaving Barnum at the height of their fame to take a last stab at normal life, they settled in North Carolina, where, despite the tensions growing between them, they found, for a time, tranquillity as farmers and slave owners, marrying a pair of sisters and fathering, between them, twenty children. Their peace, however, would prove to be short-lived. As the Civil War drew closer, and their world began to tilt, they would first turn against each other and then, faced with a trial unlike any theyhad ever known, draw together once more. No longer young, they set off to find the war, and to save what could be saved. It would be there, on that very real battlefield, that Chang would enact his final, terrifying battle with fate.Sweeping and intimate, vibrant and austere, God’s Fool is a novel of soaring ambition and accomplishment from a fiercely gifted storyteller.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Literary Fiction",
    "Family",
    "American"
  ],
  "author": "Mark Slouka",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/950966.God_s_Fool"
}