{
  "title": "Ivan and Misha: A Novel in Stories",
  "description": "\"\"Ivan and Misha is the Great American Russian Novel told as Chekhov would tell it, in stories of delicacy, humanity, and insight. From Kiev to Manhattan, Brighton Beach, and Bellevue, Michael Alenyikov lays out a series of compelling arguments for brotherhood between brothers, between lovers, between men from an old country. Alenyikov confronts big subjects---illness and madness, sex and love in the age of AIDS, Old and New World values, a fallen wall, the metaphysics of survival, the march of generations.\"---Carolyn Cooke, author of The Bostons and Daughters of the Revolution.\" \"\"For the Russian immigrant twins who are the main characters of lvan and Misha, everyday existence consists of heartbreak, love, and the unexpected. With exuberance and dark humor, Michael Alenyikov depicts their life in New York. These wonderful connected stories are full of warmth, psychological insight, and winning originality.\"---Alice Mattison, author of Nothing Is Quite Forgotten in Brooklyn.\" \"\"A haunting collection of love and duty. There is much to admire on every page.\"---Marie Myung-Ok Lee, author of Somebody's Daughter\"In lvan and Misha, Michael Alenyikov portrays the complexities of love, sexuality, and the bonds of family with boldness and lyric sensitivity. As the Soviet Union collapses, two young brothers are whisked away from Kiev by their father to start life anew in America. The intricately linked stories in this powerful debut, set in New York City at the turn of the millennium, swirl about the uneasy bond between fraternal twins, Ivan and Misha, devoted brothers who could not be more different: Bipolar Ivan, like their father, is a natural seducer, a gambler who always has a scheme afoot between fares in his cab and stints in Bellevue. Misha struggles to create a sense of family with his quixotic boyfriend, Smith, his wildly unpredictable brother, and their father, Lyov (\"Call me Louie!\"), marooned in Brighton Beach yet ever the ladies' man. Father and sons are each haunted by the death of Sonya, a wife to Lyov, a mother to his sons. An evocative and frank exploration of identity, loss, dislocation, and desire, Ivan and Misha marks the arrival of a uniquely gifted voice in American fiction.Prologue. --Ian and Misha. --Barrel of laughs. --It takes all kinds. --Whirling dervish. --Who did what to whom? --Epilogue",
  "genres": [
    "Fiction",
    "Short Stories",
    "Gay",
    "LGBT",
    "Russia"
  ],
  "author": "Michael Alenyikov",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/9509570-ivan-and-misha"
}