{
  "title": "Η γυναίκα της Ζάκυθος: Χρηστική έκδοση",
  "description": "Η «Γυναίκα της Ζάκυθος» αρχίζει να γράφεται στη Ζάκυνθο στο διάστημα της δεύτερης πολιορκίας του Μεσολογγιού (1825-1826), συμπυκνώνοντας και αναμορφώνοντας γεγονότα της περιόδου αυτής. Είναι η αφήγηση ενός υποθετικού Διονυσίου Ιερομονάχου εγκάτοικου στο ξωκλήσι τον Αγίου Λύπιου (Αλύπιου) στη Ζάκυνθο. Πίσω από το πρόσωπο αυτό κρύβεται βέβαια ο Σολωμός. Είναι άλλωστε μια συμβατική κάλυψη, αντίστοιχη προς το Βιβλικό ύφος του έργου. Κανείς δεν θα αμφέβαλλε ότι πρόκειται για τον ίδιο.Η \"Γυναίκα της Ζάκυθος\" αρχίζει να γράφεται στη Ζάκυνθο στο διάστημα της δεύτερης πολιορκίας του Μεσολογγιού (1825-1826), συμπυκνώνοντας και αναμορφώνοντας γεγονότα της περιόδου αυτής. Είναι η αφήγηση ενός υποθετικού Διονυσίου Ιερομονάχου εγκάτοικου στο ξωκλήσι τον Αγίου Λύπιου (Αλύπιου) στη Ζάκυνθο. Πίσω από το πρόσωπο αυτό κρύβεται βέβαια ο Σολωμός. Είναι άλλωστε μια συμβατική κάλυψη, αντίστοιχη προς το Βιβλικό ύφος του έργου. Κανείς δεν θα αμφέβαλλε ότι πρόκειται για τον ίδιο.Ο αφηγητής, μιλώντας σε πρώτο πρόσωπο, είναι παρών ή αοράτως παρών σε όλη την έκταση της αφήγησης, και ορισμένα τμήματα αποτελούν οράματά του με την έννοια μεταφοράς σε άλλο τόπο ή χρόνο. Το θέμα είναι μια Γυναίκα στην πόλη της Ζακύνθου, η ασκήμια και η κακία της, η σκληρή συμπεριφορά της απέναντι στις Μεσολογγίτισσες που είχαν καταφύγει στη Ζάκυνθο, το απροκάλυπτο μίσος της εναντίον της επαναστατημένης Ελλάδας, και η μελλοντική τιμωρία της Γυναίκας αυτής.Στα 1829 ο Σολωμός, έπειτα από την εγκατάστασή του στην Κέρκυρα, καθαρογράφει και συγχρόνως επεξεργάζεται και πάλι το έργο. Αν και η δράση εξακολουθεί να εντοπίζεται αποκλειστικά στη Ζάκυνθο, ο αφηγητής μεταφέρεται από τον Άγιο Λύπιο της Ζακύνθου στη μονή της Πλατυτέρας στην Κέρκυρα. Εκεί υποτίθεται ότι ζούσε ως την πρώτη ή δεύτερη δεκαετία του 18ου αιώνα ο \"Ιερομόναχος Σολωμός\". Ο συγγραφέας (προφανώς παρουσιαζόμενος σαν απόγονος της ίδιας οικογένειας) είχε δήθεν βρει στο κελλί του Ιερομονάχου, σε κρύπτη στον τοίχο, το χειρόγραφο με το κείμενο αυτό, που έτσι μεταβάλλεται σε προφητεία όχι μόνο για τη Γυναίκα και το Μεσολόγγι, αλλά και για την ίδια την επανάσταση του 1821. Πολύ γρήγορα το τέχνασμα αυτό, που διέλυε τον ρεαλιστικό και δραματικό χαρακτήρα του έργου και δημιουργούσε συγκεκριμένες αντιφάσεις, εγκαταλείπεται από τον Σολωμό, και η λέξη Πλατυτέρα διαγράφεται. Γίνονται όμως άλλες τροποποιήσεις, αναδιαρθρώσεις, διαγραφές, προσθήκες και σημειώσεις [...]. Θα δούμε παρακάτω λεπτομερέστερα, στην εξέταση της δομής του έργου, τις δοκιμές, τους δισταγμούς και τις αντιφάσεις των προσθηκών της δεύτερης επεξεργασίας",
  "genres": [
    "Poetry",
    "Classics",
    "Short Stories"
  ],
  "author": "Dionysios Solomos",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/9510798"
}