{
  "title": "A Mindful Nation: How a Simple Practice Can Help Us Reduce Stress, Improve Performance, and Recapture the American Spirit",
  "description": "In one of the most optimistic books to come out of Washington during these trying times, Congressman Tim Ryan presents us with an inspiring and hopeful view of our country’s future—and a roadmap for how to get there. Across America, people are feeling squeezed, exhausted, and running faster and faster while falling farther behind. The economy continues to struggle, wars rage on, and every week brings news of another environmental disaster. Everything seems broken and people feel helpless to make a difference. Despite this bleak outlook, there are strands of quiet hope and confidence. People are beginning to take action in a new they are slowing down, paying attention, and gaining an awareness of the inner resources at their disposal. This new way is based on the timeless and universal practice of mindfulness, the natural capabilities of our brains and minds, and the core American values of self-reliance, stick-to-it-iveness, and getting the job done.  And it’s manifesting in every sector of our society—it’s helping sick people work with their pain, school children improve their learning, veterans heal from trauma, and CEOs become more inclusive and effective leaders. All these benefits—and more—are supported by scientific research on mindfulness that is regularly reported by the mainstream media, such as ABC World News with Diane Sawyer. In A Mindful Nation , Congressman Tim Ryan—an all-American guy from the heartland who is also a thoughtful, committed leader—takes this story about the benefits of mindfulness to the next level. He connects the dots between what’s happening with mindfulness in the classrooms, hospitals, boardrooms, research labs, and army bases across the country by sharing his interactions with experts in education, defense, health care, criminal justice, and the environment. A Mindful Nation paints a picture of emerging solutions that both benefit the reader and address the societal difficulties we are facing. Ryan’s folksy, warm, and encouraging voice uplifts us and shows that there is something we can do right here and right now to help ourselves and our country. Both inspiring and pragmatic, A Mindful Nation shows how the benefits of mindfulness apply to the current challenges that affect each of us in our own lives and in our communities, and thus have implications for our society as a whole. With a hard-nosed understanding of politics, government budgets, and what it takes to get something done, Ryan connects a practical approach—lead with the science, show the savings and show how this can help us educate our children to be competitive in the world arena—with a hopeful vision for how mindfulness can reinvigorate our core American values and transform and revitalize our communities.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Buddhism",
    "Self Help",
    "Spirituality",
    "Mental Health"
  ],
  "author": "Tim Ryan",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/13202298-a-mindful-nation"
}