{
  "title": "The Undead That Saved Christmas",
  "description": "The Undead That Saved Christmas is the heart-chilling anthology with stories across the spectrum of holiday mythology. The perfect stocking stuffer that doesn't include a box of shotgun shells or a macheté, The Undead That Saved Christmas brings together various talented authors and artists from Great Britain, the United States and Ireland.Full table of ContentsTable of ContentsHow the Undead Saved ChristmasBy Lyle Perez-TinicsIntroductionBy S.G. BrowneShort StoriesNight of the Frozen ElfBy Richard S. CrawfordMerry Christmas, Sarah!By Rhonda E. KachurThe GingerbreadsBy Lyle Perez-TinicsThe Magic of ChristmasBy Rebecca BesserYes, Rindy, There is a Santa ClausBy TW BrownLiving Dead Babes in ToylandBy Robert FreeseA Christmas WishBy Tony and Heather FavilleRudolph the Undead ReindeerBy Jason TudorSanta's HelpersBy Scott MorrisSanta Claws is Coming to TownBy Calvin A. L. Miller IIBrains Like Figgy PuddingBy Sean HoadeThe Santa EpidemicBy Mandy TinicsThe Legend of Zombie ClausBy Joe FilipponeAnd to All a Good FrightBy Stacey GrahamRefuse to DonateBy Angelica RaeneGingerBrainsBy Edward J. RussellPoems and CarolsUndead to the WorldBy Angie MansfieldOh Tanenbrain, Oh TanenbrainBy Rusty FischerThe Worst NoelBy J Gilliam MartinThe Night of the Living Dead...Before ChristmasBy Kevin Preece 'The Zombieking'We Wish you Reanimation & O Rotting CorpseBy Stacey GrahamJingle Bells, Something SmellsBy Beth BartlettZombies Having a Wonderful Christmas TimeBy Lyle Perez-TinicsComicsTed Dead, Just Your Everyday Zombie...By Calvin A. L. Miller IIIllustrated by Calvin A. L. Miller IIChristmas For CreepsBy Lyndal FergusonIllustrated by Lyndal FergusonA Puppy For ChristmasBy Mike SchneiderIllustrated by Brian GermainSnow Day of the DeadBy Mike SchneiderIllustrated by Anders SkoglundA Very Undead ChristmasBy Nate CallIllustrated by Nate CallProceeds from the sales of The Undead That Saved Christmas benefit the Hugs Foster Family Agency (hugsffa.org) and will help them give their foster children gifts this holiday season.",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction",
    "Christmas",
    "Anthologies"
  ],
  "author": "Lyle Perez-Tinics",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/9517759-the-undead-that-saved-christmas"
}