{
  "title": "Biopunk: Kitchen-Counter Scientists Hack the Software of Life",
  "description": "Bill Gates recently told Wired that if he were a teenager today, he would be hacking biology. \"If you want to change the world in some big way,\" he says, \"that's where you should start-biological molecules.\"The most disruptive force on the planet resides in DNA. Biotech companies and academic researchers are just beginning to unlock the potential of piecing together life from scratch. Champions of synthetic biology believe that turning genetic code into Lego-like blocks to build never-before-seen organisms could solve the thorniest challenges in medicine, energy, and environmental protection. But as the hackers who cracked open the potential of the personal computer and the Internet proved, the most revolutionary discoveries often emerge from out-of-the-way places, forged by brilliant outsiders with few resources besides boundless energy and great ideas.In Biopunk , Marcus Wohlsen chronicles a growing community of DIY scientists working outside the walls of corporations and universities who are committed to democratizing DNA the way the Internet did information. The \"biohacking\" movement, now in its early, heady days, aims to unleash an outbreak of genetically modified innovation by making the tools and techniques of biotechnology accessible to everyone. Borrowing their idealism from the worlds of open-source software, artisinal food, Internet startups, and the Peace Corps, biopunks are devoted advocates for open-sourcing the basic code of life. They believe in the power of individuals with access to DNA to solve the world's biggest problems.You'll meet a new breed of hackers who aren't afraid to get their hands wet, from entrepreneurs who aim to bring DNA-based medical tools to the poorest of the poor to a curious tinkerer who believes a tub of yogurt and a jellyfish gene could protect the world's food supply. These biohackers -A duo who started a cancer drug company in their kitchen-A team who built an open-source DNA copy machine-A woman who developed a genetic test in her apartment for a deadly disease that had stricken her familyAlong with the potential of citizen science to bring about disruptive change, Wohlsen explores the risks of DIY bioterrorism, the possibility of genetic engineering experiments gone awry, and whether the ability to design life from scratch on a laptop might come sooner than we think.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Technology",
    "Audiobook",
    "Popular Science",
    "Genetics"
  ],
  "author": "Marcus Wohlsen",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/9521936-biopunk"
}