{
  "title": "What Terrorists Want: Understanding the Enemy, Containing the Threat",
  "description": "How can the most powerful country in the world feel so threatened by an enemy infinitely weaker than we are? How can loving parents and otherwise responsible citizens join terrorist movements? How can anyone possibly believe that the cause of Islam can be advanced by murdering passengers on a bus or an airplane? In this important new book, groundbreaking scholar Louise Richardson answers these questions and more, providing an indispensable guide to the greatest challenge of our age.After defining–once and for all–what terrorism is, Richardson explores its origins, its goals, what’s to come, and what is to be done about it. Having grown up in rural Ireland and watched her friends join the Irish Republican Army, Richardson knows from firsthand experience how terrorism can both unite and destroy a community. As a professor at Harvard, she has devoted her career to explaining terrorist movements throughout history and around the globe. From the biblical Zealots to the medieval Islamic Assassins to the anarchists who infiltrated the cities of Europe and North America at the turn of the last century, terrorists have struck at enemies far more powerful than themselves with targeted acts of violence. Yet Richardson understands that terrorists are neither insane nor immoral. Rather, they are rational political actors who often deploy carefully calibrated tactics in a measured and reasoned way. What is more, they invariably go to great lengths to justify their actions to themselves, their followers, and, often, the world.Richardson shows that the nature of terrorism did not change after the attacks of September 11, 2001; what changed was our response. She argues that the Bush administration’s “global war on terror” was doomed to fail because of an ignorance of history, a refusal to learn from the experience of other governments, and a fundamental misconception about how and why terrorists act. As an alternative, Richardson offers a feasible strategy for containing the terrorist threat and cutting off its grassroots support. The most comprehensive and intellectually rigorous account of terrorism yet, What Terrorists Want is a daring intellectual tour de force that allows us, at last, to reckon fully with this major threat to today’s global order.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Terrorism",
    "Philosophy",
    "Sociology",
    "War"
  ],
  "author": "Louise Richardson",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/95215.What_Terrorists_Want"
}