{
  "title": "Grammatica della fantasia",
  "description": "Sinossi«Un sasso gettato in uno stagno suscita onde concentriche che si allargano sulla sua superficie, coinvolgendo nel loro moto, a distanze diverse, con diversi effetti, la ninfea e la canna, la barchetta di carta e il galleggiante del pescatore... Non diversamente una parola, gettata nella mente a caso, produce onde di superficie e di profondità, provoca una serie infinita di reazioni a catena, coinvolgendo nella sua caduta suoni e immagi ni, analogie e ricordi, significati e sogni...» Sono parole di Gianni Rodari, che chiariscono in modo esemplare la vocazione di questo libro diventato ormai un classico: parlare dei processi della fantasia e delle regole della creazione per renderne l'uso accessibile a tutti. Partendo dall'esame dei congegni che muovono l'immaginazione, l'autore non ci consegna, però, un ricettario per costruire storie, ma ci offre \"materia prima\", idee, occasioni di riflessioni fantastiche utilissime per superare la muraglia della routine scolastica e per riconoscere il ruolo della creatività all'interno del processo educativo.“Lo que estoy haciendo es buscar las constantes de los mecanismos fantásticos, las leyes todavía no profundizadas de la invención, para volver accesible a todos, su uso. Insisto en esto porque pese a que el romanticismo la ha rodeado de misterio y ha creado en torno suyo una especie de culto, el proceso creativo está implícito en la naturaleza humana y, por lo tanto, la felicidad que significa expresarse y jugar con las fantasías se halla al alcance de todos\". De esta investigación que Gianni Rodari llevará adelante durante muchos años, ha nacido gramática de la fantasía, una propuesta concreta para que chicos y grandes inventen sus propias historias.",
  "genres": [
    "Nonfiction",
    "Writing",
    "Education",
    "Italian Literature",
    "Childrens",
    "Teaching",
    "Fairy Tales"
  ],
  "author": "Gianni Rodari",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/9516488-grammatica-della-fantasia"
}