{
  "title": "Immortal Obsession",
  "description": "Immortal Obsession is a must read for all paranormal romance fans! While very reminiscent of Anne Rice’s vampire novels, make no mistake, it is all very different and very much original. Rago takes vampire lore and turns it on its head. I was entranced from the very first page. ~ Devilishly Delicious Book Reviews ~ 5 Stars When the last descendant of a French-Revolution era vampire and his mortal aristocratic lover witnesses her brother’s savage murder in New York City’s Central Park - and narrowly escapes her own demise - an ethereal stranger begins to draw her even deeper into a previously unimaginable world.In this gripping paranormal romance, the beautiful, young Amanda Perretti, a promising museum curator, becomes entangled with a group of French vampires who carry their eighteenth century grudges into twenty-first century New York. Desperate to find the stranger who saves her life that fateful night, Amanda pursues her brother’s killer from the halls of the Metropolitan Museum of Art to the Goth clubs of the East Village. After meeting the heroic vampire who intervened on her behalf, Amanda becomes increasingly torn between the wish to preserve her cherished career and her safe, “normal” life and her growing desire for the handsome, alluring vampire Christian Du Mauré. Ultimately, Amanda finds herself falling deeper into the dangerous realm of immortals, as not one but two vampires vie for her love. Full of intrigue and suspense, yet grounded in artfully drawn characters and settings, this historical love story follows the journey of the mortal yet courageous Amanda as she discovers far more about herself than she ever dreamed possible. Immortal Obsession is a great vampire book. The author's writing style reminded me a lot of Anne Rice's. The plot had me turning pages late into the night wondering what was going to happen next. I can't wait for the next book in the series. I recommend it for fans of paranormal romance. I also recommend it for Anne Rice fans. ~ Kayla’s Reads and Reviews 5 Stars Immortal Obsession is a book with so many layers of history and emotion you simply cannot stop turning pages to see what happens next. ~ Vampire Romance BooksMs. Rago’s debut book really shines with great writing, a plot that moves smoothly, with twists and turns, and great characterization. This is a great mix of paranormal and intrigue and I cannot wait to see what else comes out from this author. ~ Storm Goddess Book Reviews ~ 4 Lightning BoltsImmortal Obsession seamlessly takes the reader into the world of vampires from 18th century France to present day Manhattan. The vivid imagery in her writing made me feel as though I was walking the streets of Paris with the French Revolution raging around me. ~ Vampire Romance Books This book is a story about obsession, love and passion among mortals and vampires. A captivating and extremely well written book. Immortal Obsession is a must read! ~ Serious ReadingThere’s something really captivating about a passionate love story made up of beautiful words strung together and that is how I felt when I read Immortal Obsession. It’s a rare feeling. ~ Tranquil Dreams Review",
  "genres": [
    "Paranormal Romance",
    "Vampires",
    "Romance",
    "Paranormal"
  ],
  "author": "Denise K. Rago",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/9517191-immortal-obsession"
}