{
  "title": "South Carolina: A History",
  "description": "The authoritative source for the Palmetto State's dramatic historyIn this comprehensive history of South Carolina, Walter Edgar presents a sweeping chronicle of a state with an illustrious, sometimes infamous, past. He describes in very human terms 475 years of recorded history in the Palmetto State, including the experiences of all South Carolinians―those with roots in Africa and in Europe as well as Native Americans; male and female; rich and poor. In an eminently readable presentation, Edgar uses letters, diaries, and other writings to let voices from the past take part in telling the state's fascinating story.Recounting the period from the first Spanish exploration to the end of the Civil War, Edgar charts South Carolina's rising national and international prominence and its parallel economic ascendancy. He dispels myths about the state's early history―including the notion that the colony was inhabited by a homogeneous white population―and tells how South Carolina developed an agricultural economy that relied heavily on African American slave labor. Edgar examines, among other topics, the impact of the American revolution, Charleston's significance as a metropolis and major seaport, and the state's leadership in the Secession movement.With changes wrought by the Civil War, South Carolina slipped from national prominence into a period marked by economic, social, civil, and political strife. Edgar details the everyday life of blacks and whites during Reconstruction, the state's mixed efforts to join the \"New South,\" and Benjamin Ryan Tillman's rise to power. He also chronicles South Carolina's changing politics in the once-solid South, the state's reawakening after World War II, the casualties and victories of an extended civil rights struggle, and the Palmetto State's present economic, educational, and political challenges.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Audiobook"
  ],
  "author": "Walter Edgar",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/951734.South_Carolina"
}