{
  "title": "Myths and Magic: Legends of Love",
  "description": "The 1002nd Arabian Nights Tale – Michael GoudaScheherazade tells yet one more story (never before recorded) of a Prince in peril on the high seas who is rescued through the heroic actions of a handsome sailor. Will the tale—and the storyteller—be enough to win the Sultan’s approbation at last? A Fairy in His Bed – Corinna Silver & Aundrea SingerWhen Daniel Tibbits, recently single, unhappy, and in the grip of terminal writer’s block, inherits a teapot from his great aunt, the last thing he expects is for it to contain a fairy named Quinn. After Daniel saves Quinn’s life, Quinn grants him a wish and stays with him as Daniel decides exactly what that wish will be. The problem is that despite Quinn’s best efforts, Daniel doesn’t believe in fairy tales or happy endings. Kissing the Dragon – Heidi CullinanBao Fischer, born Korean but raised in middle America, can only see his “heritage” as an excuse for people to treat him differently and wants to leave it behind. So why is he dreaming of a dragon every night? The day his dreams start to overlap into the real lives of his overbearing boss and the hot barista at the office coffee stand, Bao needs to figure out what the dragon is trying to tell him before it’s too late to set things right. Something Pipeth Like a Bird – David CheaterBored with tending sheep, young Judean shepherd boy Yosef follows the music coming from a nearby ruin, never expecting to encounter a Djinn. But Masul is nothing like the demons described in Scripture… and Masul finds himself surprised by the Human as well.Greenleaf’s Blessing – M. KingRhynn, orphaned as a child and apprenticed to his village’s Herb Mage, is a man whose trade—a potent mix of herbalism and magic—creates distrust even among those who ask for aid. After an unexpected encounter drives away the one person Rhynn considered a friend, he flees into the old forest… only to meet the wood’s guardian spirit, who awakens the dormant power within him.On Wild Wings – Connie BaileyChuneh is a dragon rider, partnered on border patrol with She Who Is Sister to the Sun. Though older, wiser, and mightier than mankind, even the she-dragon cannot explain how a young male has reached Ascension without being sensed by any other dragons. Sadorey is not a typical dragon, as Chuneh is about to learn—to his cost and his delight.The Sower and the Reaper – Helen MaddenHosa, from the Red Sky clan, came looking for a God when a meteor storm wiped out his tribe’s crops. Ozzie doesn’t look like any God Hosa has ever heard of, but the only chance to redeem himself and save his tribe from starvation will be if Hosa can convince Ozzie to perform a miracle.The One – Ariel TachnaTrapped in human form when an injury prevents him from shifting, Rylan is befriended by Thorin, a man with a dangerous secret. Rylan has a secret of his own—in his other form, as a unicorn, he’s as hunted as Thorin. While Rylan knows he should leave before Thorin discovers the truth, Thorin has an allure that’s almost impossible for Rylan to resist.Of Genies and Sea Monsters – Scarlet BlackwellA buyer and seller of gems, Ephram leaves to seek his fortune, only to find riches a poor substitute for his lover, Eber. Desperate to return home despite the sea monster that blocks the way, Ephram enlists the help of a boisterous genie, a mysterious magician, and even his landlord. Only by completing a series of seemingly impossible tasks will Ephram have any chance of being reunited with the man he loves.The Wild Hunt – Cari Z.David Evans was five years old when he first witnessed the wild hunt on Halloween night. Fascinated by its magnificent leader, David returns to the same spot year after year, hoping to prove worthy to be chosen by the hunter. But can a mortal ride with the Tylwyth Teg and survive?The Light of Foreign Places – Rodello Santos & Damon ShawJai is a seducer, winning converts for the Snake Goddess, Striyn. At the holy carnival outside the desert city of Ramsha’hla, Jai meets Duphal, one of the few city dwellers to respond to the carnival’s attractions. Duphal is attracted to Jai, too, even though in his culture, to act on that attraction is punishable by death….Night and Day – Rowan SpeedwellNate Pederowski is about as far down as he can go when he’s tipped to a job as a singer in a speakeasy. A veteran of WWI dishonorably discharged for being “queer,” Nate is embittered and lonely. The club’s handsome owner, Rick Bellevue, is wowed by Nate’s voice and offers him the job, and Nate’s life is about to change in ways he can scarcely imagine, let alone believe.The Flower Boy – Belinda McBrideStarving student Philip Yeoh can barely make ends meet while he attends art school in San Francisco. With his rent coming due, he spends the last of his money on flowers to sell on a busy street corner—a plan that seems to be a failure until an odd, androgynous young man approaches him, also selling flowers. Since Lan looks even more destitute than Philip, the young student buys a handful of flowers from the stranger. Within minutes, Philip’s luck changes, but when he offers to buy the rest of the stranger's flowers, Lan will only accept a kiss in payment—a kiss that literally transports Philip to another world.",
  "genres": [
    "M M Romance",
    "Anthologies",
    "Fantasy",
    "Romance",
    "Paranormal",
    "M M Fantasy",
    "LGBT"
  ],
  "author": "Anne Regan",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/9517988-myths-and-magic"
}