{
  "title": "The Scout: A Novel",
  "description": "Epic in scope and grand beyond our imaginings.   The Scout continues the magnificent story that began the highly acclaimed novel Brules .  In his stunning new novel, Harry Combs recreates a time when the West was the white man's greatest challenge and the red man's last battleground... a towering tale of dreams unfettered, of mustangs running free, and of young men riding hell-bent-for-leather into Indian country for no other reason than they were young, brave and wild.By 1900 the Old West was vanishing, but the man many called its fastest gun was still alive.  By then Car Brules had shut himself and his secrets away in a cabin on Colorado's Lone Cone Peak.  Only one person knew his real story, a boy of eleven who became his friend and heard his extraordinary tales in 1909.  The Scout is that unforgettable story, just as young Steven Cartwright heard it, just as Brules told hard and gritty, wry with a cowboy's humor, and true to the spirits of all those who loved the west--and died for it--from Custer to Crazy Horse.Many hard, hurting things had driven Cat Brules to become the man he was.  The death of his beloved Shoshone bride, Wild Rose, was one of them.  Months after Brules lost her--brutally and far too soon--Wild Rose still came to him in his dreams.  With a void in his heart and a reckless spirit, Brules signed on as a Scout for General George Crook, whose cavalry was headed into the Badlands. Then, the U.S. Army still didn't know that there were fifteen thousand Sioux and Cheyenne in those Wyoming foothills, and under chiefs Sitting Bull and Crazy Horse, every one of them was willing to fight to the death to live free.Brules's account of the violence that ensued, told with eyewitness immediacy and chilling authenticity, is one of courage and shame as he rides the trail toward the Little Big Horn and the battles that followed.  Seeing for himself the dying of a way of life, Brules tells a searing truth about America's the betrayal of Custer to the Sioux, the hunting of Geronimo, and the U.S. Army's cruel pursuit of Chief Joseph and his Nez Perce.  And here too are the women who loved White Antelope, the gentle Indian maiden who wanted what Brules felt he could never give again--and Melisande, the saucy Mormon girl who might be too much for even Cat Brules to handle.Debunking the myths of the Old West and the romanticism of movies, renowned Western writer Harry Combs creates a vision at once more complex, magnificent and genuine--from the make of the rifle to the caliber of the bullet that cut Custer down.  A novel unmatched in excitement and adventure, The Scout lets you smell the cordite, feel a man's hard need for a woman, and discover that the real flesh and blood inhabitants of those legendary days were tougher, bolder and more fascinating than we ever dared to imagine.",
  "genres": [
    "Westerns",
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Harry Combs",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/1004381.The_Scout"
}