{
  "title": "Sideways on a Scooter: Life and Love in India",
  "description": "When twentysomething reporter Miranda Kennedy leaves her job in New York City and travels to India with no employment prospects, she longs to immerse herself in the turmoil and excitement of a rapidly developing country. What she quickly learns in Delhi about renting an apartment as a single woman—it’s next to impossible—and the proper way for women in India to ride scooters—perched sideways—are early signs that life here is less Westernized than she’d counted on.Living in Delhi for more than five years, and finding a city pulsing with possibility and hope, Kennedy experiences friendships, love affairs, and losses that open a window onto the opaque world of Indian politics and culture—and alter her own attitudes about everything from food and clothes to marriage and family. Along the way, Kennedy is drawn into the lives of several Indian women, including her charismatic friend Geeta—a self-described “modern girl” who attempts to squeeze herself into the traditional role of wife and mother; Radha, a proud Brahmin widow who denies herself simple pleasures in order to live by high-caste Hindu principles; and Parvati, who defiantly chain-smokes and drinks whiskey, yet feels compelled to keep her boyfriend a secret from her family.In her effort to understand the hopes and dreams that motivate her new friends, Kennedy peels back India’s globalized image as a land of call centers and fast-food chains and finds an ancient place where, in many ways, women’s lives have scarcely changed for centuries. Incisive, witty, and written with a keen eye for the lush vibrancy of the country that Kennedy comes to love, Sideways on a Scooter is both a remarkable memoir and a cultural revelation.",
  "genres": [
    "Travel",
    "India",
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "Asia",
    "Biography"
  ],
  "author": "Miranda Kennedy",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/9524132-sideways-on-a-scooter"
}