{
  "title": "Down the Highway: The Life of Bob Dylan",
  "description": "Based on three years of research, new documentary evidence, and interviews with 250 of Dylan's intimates -- many exclusive -- Down the Highway has gone beyond the scope of other accounts to become the most complete, authoritative biography of Bob Dylan now in print. It was praised by The Orlando Sentinel \"for the insights it offers to Dylan at work ... from young upstart to grand old man of rock 'n' roll.\" Sounes's prodigious research has resulted in new insights on every aspect of Dylan's life. His is the only biography to seriously address the past twenty years of Dylan's life, leading up to the extraordinary recent releases Time Out of Mind and Love and Theft. He has obtained exclusive information to provide the clearest picture yet of Dylan's 1966 motorcycle accident and subsequent \"lost years\" in Woodstock, New York, and he uncovered the star's unknown second marriage. He gives inside accounts of the tours, the creation of every album and the most celebrated songs, Dylan's labyrinthine love life, his life-threatening heart illness in 1997, and more -- directly from interviews with girlfriends, family, friends, producers, concert promoters, and fellow musicians. Candid, refreshing, and written with a sincere appreciation of Dylan's music and influence, Down the Highway is an essential book for the millions of people who have enjoyed Dylan's music over the years. \"Dylan comes alive.... Sounes has added a wealth of new information to Dylan studies.\" -- Perry Meisel, The New York Times Book Review \"Fascinating and finely written.\" -- Ronald Radosh, The New Republic \"Convincing ... [generates] sympathy for an isolated artist.\" -- Daniel Cooper, The Washington Post Book World \"Sounes ... opens new angles on the enigmatic polyhedron that is Dylan.... Monumental.\" -- Gene Santoro, The Nation \" \"A portrait of Mr. Dylan that is often unflattering, sometimes puzzling, but, to the author's credit, never sensational.\" -- Al Brumley, The Dallas Morning News \"Engrossing ... fast-moving yet rich in detail ... [Down the Highway] chronicles a remarkable and contradictory artist.\" -- Carlo Wolff, The Kansas City Star \"[This] fast-paced book has a fine interest in details [and is] rich with the observations of new witnesses.\" -- Sheri Linden, Variety \"Irresistible ... What Dylanphile wouldn't want to sift through what Sounes has dug up.\" -- Terry Lawson, Detroit Free Press",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Autobiography",
    "Audiobook"
  ],
  "author": "Howard Sounes",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/132038.Down_the_Highway"
}