{
  "title": "The Heart and the Fist: The Education of a Humanitarian, the Making of a Navy SEAL",
  "description": "“Meet my hero—Eric Greitens. His life and this book remind us that America remains the land of the brave and generous.” — Tom Brokaw Like many young idealists, Eric Greitens wanted to make a difference, so he traveled to the world’s trouble spots to work in refugee camps and serve the sick and the poor. Yet when innocent civilians were threatened with harm, there was nothing he could do but step in afterward and try to ease the suffering. In studying humanitarianism, he realized a fundamental truth: when an army invades, the weak need protection. So he joined the Navy SEALs and became one of the world’s elite warriors. Greitens led his men through the unforgettable soul-testing of SEAL training and went on to deployments in Kenya, Afghanistan, and Iraq, where he faced harrowing encounters and brutal attacks. Yet even in the deadliest combat situations, the lessons of his humanitarian work bore fruit. At the heart of this powerful story lies a paradox: sometimes you have to be strong to do good, but you also have to do good to be strong. The heart and the fist together are more powerful than either one alone. “If you're restless or itching for some calling you can't name, read this book. Give it to your son and daughter. The Heart and the Fist epitomizes — as does Mr. Greitens's life, present and future — all that is best in this country, and what we need desperately right now.” — Steven Pressfield, author of Gates of Fire “Vivid and compelling . . . a great read.” — Washington Times A Hudson Booksellers Top Ten Nonfiction Book of the Year A USA Today and Publishers Weekly Bestseller WITH A NEW AFTERWORD",
  "genres": [
    "Nonfiction",
    "Military Fiction",
    "Biography",
    "Memoir",
    "War",
    "History",
    "Leadership"
  ],
  "author": "Eric Greitens",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/9525402-the-heart-and-the-fist"
}