{
  "title": "No Safe Haven",
  "description": "Jenna and Andi Tikaani-Gray are hoping for a fresh start. Though twelve year-old Andi has long struggled with a rare medical disorder, she and her mother have finally received good news from out-of-town specialists. It's news they desperately needed, especially after the recent death of Jenna's husband (Andi's dad) in a car accident.But as they are flying home to Alaska, ready to begin again, the unthinkable happens. The pilot sabotages their small plane and crashes into Sultana, one of the most remote and dangerous mountains in the Land of the Midnight Sun. Even worse, a winter storm is headed their way along with someone who doesn't want to save them, but to kill them.Only one man can keep them alive: Cole Maddox, the mysterious last-minute passenger who joined them on their flight. But trust doesn't come easy to Jenna or Andi, and they both sense Cole is hiding something.A relentless tale of survival and suspense unfolds, involving military technology designed by Jenna's late husband that some would do anything to possess.Endorsements and Reviews:\"I'd only made it to page 8 when I realized I was holding my breath. Shivers are still traveling up my arms from a story that is both dramatic and heart-warming.\"Tricia Goyer, award-winning author\"Kimberley and Kayla Woodhouse know how to weave powerful, faith-building, can't-put-down stories - in life and now, brilliantly, in fiction.\"Susan May Warren, best-selling author of Nightingale\"A novel of high adventure, exhilarating suspense, powerful divine proteection and enough love to bring tears all around.\"\nChristian Retailing\n (Top Pick review)\"A thrilling adventure of the heart and mind . . . No Safe Haven is a brilliant start to what will be an unmissable series from this mother and daughter team.\"\nRelz Reviewz\n\"Romance, suspense, intrigue--Kimberley and Kayla Woodhouse have crafted a book that has it all. You won't be able to put this one down!\"Jenny B. Jones, award-winning author of Save the Date and A Charmed Life series\"A nail-biting delight of a romantic suspense novel. I loved the Alaskan setting and characters. The Woodhouse writing duo is dynamite!\"Colleen Coble, author of The Lightkeeper's Ball and the Rock Harbor series\"Non-stop action from an unforgettable mother/daughter team.\"Brandilyn and Amberly Collins, co-authors of the award-winning Rayne Tour Series\"An incredible adventure thriller that kept me turning pages well into the wee hours. I look forward to more from this incredible mother-daughter team.\"Tracie Peterson, best-selling author of the Striking a Match series\"Based on personal knowledge and experience, the authors create realistic characters. Alternating perspectives, love, loss and mystery hold the reader's attention. The authors remind us that faith is simple: All one must do is believe.\"RT Book Reviews (4 stars)\"The story is captivating and the action is fast-paced.\"TitleTrakk.com",
  "genres": [
    "Christian Fiction",
    "Romance",
    "Christian",
    "Suspense",
    "Fiction",
    "Romantic Suspense",
    "Adventure"
  ],
  "author": "Kimberley Woodhouse",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/9524154-no-safe-haven"
}