{
  "title": "Wrongful Death: The AIDS Trial",
  "description": "If you like courtroom drama in the style of John Grisham, you’ll want to read this book. If you ever knew someone with AIDS or HIV, you need to read this book. If you still believe the government and the FDA are protecting you against deadly diseases and dangerous drugs, you must read this book!\"WRONGFUL The AIDS Trial\" is a work of fiction based on the true story behind the government lies and incompetence, gross medical malpractice, and unbridled greed by a drug company that caused our American AIDS epidemic and cost 300,000 lives in just ten years.Follow along with attorney Benjamin Messick and health reporter Sarah Meadows in this class-action lawsuit as they expose the man who claims to have discovered the cause of AIDS, Dr. Robert Gallo. Dr. Gallo announced to the world at a press conference on April 23, 1984 that a virus later to be called HIV was the culprit. Unfortunately, Dr. Gallo’s peers were never given the chance to prove his theories, and still can’t to this day.In the last twenty years, Dr. Gallo has been exposed as nothing more than a common criminal, a thief, and a liar. He finally admitted he had stolen the AIDS virus from a French researcher. He also stole another virus from the Japanese. He lied on his patent application for the HIV blood test. A congressional investigation found Dr. Gallo guilty of “intellectual recklessness of a high degree,” and the Office of Research Integrity of the Department of Health and Human Services found Dr. Gallo guilty of scientific misconduct and called some of Dr. Gallo's key AIDS research, “of dubious scientific merit” and “really crazy.” As one German scientist put it, Dr. Gallo is “an American scientific gangster who has committed so many crass, self-aggrandizing blunders…that he could not really be relied upon to tell the time correctly.”Attorney Messick questions a number of witnesses who all agree with 2700 of the world’s leading doctors and medical researchers today, including Nobel Prize winners in chemistry and medicine and members of the U.S. National Academy of Sciences, that HIV cannot cause AIDS. At the end of the book you'll find out what actually DOES cause AIDS.The testimony in this court case finally discloses that in the decade from 1987 to 1997, three-hundred-thousand Americans (mostly homosexual men) died NOT from some horrible disease they caught from a virus, but as a result of taking the very drug they were told would cure them. Urged on by their doctors, parents, families and loved-ones, these HIV-positives took AZT, a drug originally designed and created in 1964 to kill cancer cells, but never approved because it was found to be far too toxic to a human body.Read the testimony of witness after witness - all based on over 900 actual medical and scientific research papers and reports - that when the FDA finally approved AZT for the treatment of AIDS in 1987, it began causing Acquired Immune Deficiency Syndrome; and every person who took it - healthy or not at the time - would die within three years from one of many different opportunistic diseases. Be prepared for the anger and outrage you will feel when you realize that hundreds of thousands of innocent women and children are still being murdered today in Africa with AZT, simply because they have been declared to be HIV-positive, while the drug company rakes in billions of dollars in profits.The question After 30 years and 300 billion dollars, why don't we have a cure or a vaccine for AIDS? The witnesses in this court case provide the only answer that makes any We have the wrong cause.\"I enjoyed the book. It read like a cross between a John Grisham legal thriller and an informative scientific treatise on AIDS.\"- D.D. Steele, attorney\"Congratulations Mr. Davis, you actually pulled it off and created a legitimate page-turner from the debacle of HIV/AIDS.\"- Harvey Bialy, author",
  "genres": [
    "Fiction",
    "Medical",
    "Thriller"
  ],
  "author": "Stephen  Davis",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/9531190-wrongful-death"
}