{
  "title": "A Cancer Prevention Guide for the Human Race",
  "description": "Few diseases create the level of fear associated with a new diagnosis of cancer. Fortunately, cancer experts have estimated that at least 50 to 60 percent of all cancer cases can be prevented through evidence-based modifications in lifestyle and diet. \"A Cancer Prevention Guide for the Human Race\" is a landmark, evidence-based guide to a healthy cancer-prevention lifestyle, and comprehensively informs readers on the important findings of hundreds of recent cutting-edge cancer research studies, performed by the world's foremost cancer research scientists. Written for lay readers by Robert A. Wascher, MD, FACS, an internationally recognized cancer physician, cancer surgeon, cancer researcher, educator, professor, and author, \"A Cancer Prevention Guide for the Human Race\" offers health-conscious readers a vital research-based guide that will enable them to significantly reduce their lifetime risk of developing cancer. \"A Cancer Prevention Guide for the Human Race\" is an absolutely essential health information resource for the 21st Century, and belongs in every home and office.The Author is a Clinical Associate Professor of Surgery at the University of California, Irvine, and the editor of the popular global health information website, \"Weekly Health Update\" (www.doctorwascher.com). Dr. Wascher is the author of numerous research papers, book chapters, articles, essays, and columns on a variety of health-related topics, and serves as a Consultant in both Oncology and Surgery for multiple health care and health information organizations. Dr. Wascher's next book, \"Hormone Replacement Therapy (HRT) & the Breast Cancer Epidemic,\" is scheduled for publication in 2011.",
  "genres": [
    "Health",
    "Nonfiction",
    "Self Help",
    "Science",
    "Reference"
  ],
  "author": "Robert A. Wascher",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/9529978-a-cancer-prevention-guide-for-the-human-race"
}