{
  "title": "Έτσι ισχυρίζεται ο Περέιρα",
  "description": "Σε ποιον και κάτω από ποιες συνθήκες διηγείται ο Περέιρα τον πιο κρίσιμο μήνα της ζωής του, τον μοιραίο εκείνο Αύγουστο του 1938; Αυτό δεν αποκαλύπτεται ποτέ, ο αναγνώστης αφήνεται να κάνει τις δικές του υποθέσεις. Ο Περέιρα όμως είναι ένας εξαιρετικά ακριβής μάρτυρας και με μια πεισματάρικη σχολαστικότητα αφηγείται, σαν να καταθέτει σε κάποιο δικαστήριο, μια τραγική στιγμή της ύπαρξής του αλλά και της ιστορίας της Ευρώπης. Στο πλαίσιο του πορτογαλικού σαλαζαρισμού, του ιταλικού φασισμού και του ισπανικού εμφύλιου πολέμου, η συγκινητική ιστορία της συνειδητοποίησης ενός μοναχικού και δυστυχούς ηλικιωμένου δημοσιογράφου.Λισαβόνα, 1938. Η καταπιεστική δικτατορία του Σαλαζάρ, η θύελλα του επερχόμενου ισπανικού εμφυλίου, ο ιταλικός φασισμός στο βάθος. Ο Περέιρα είναι ένας πρώην δημοσιογράφος του άστυνομικού ρεπορτάζ στον όποιο έχουν εμπιστευτεί την πολιτιστική σελίδα μιας μέτριας απογευματινής εφημερίδας, της Λισμπόα. Ο Περέιρα έχει μια θανατερή αντίληψη της κουλτούρας: άγαπά τα νεκρώσιμα εγκώμια των συγγραφέων που αποβιώνουν, τη λογοτεχνία του παρελθόντος, τις γραμμένες από πριν νεκρολογίες. Στο πρόσωπο του Μοντέιρο Ρόσσι, ενός νεαρού ιταλικής καταγωγής, και της αρραβωνιαστικιάς του Μάρτα, βρίσκει δύο παράξενους όσο και αταίριαστους συνεργάτες. Μιά συνεργασία που θα οδηγήσει στην ανατροπή της ζωής του γέρου δημοσιογράφου, σε μια έντονη εσωτερική επίπονη συνειδητοποίηση.Με αυτές τις σελίδες έντονου πολιτικού και άνθρωπιστικού ύφους, με αυτή τη σπαρακτική φιγούρα του πρωταγωνιστή που θα παραμείνει αναλλοίωτη στη μνήμη του αναγνώστη, ο Ταμπούκι μας έδωσε ενα μεγάλο μυθιστόρημα για τη λογική του παρελθόντος μας η οποία μπορεί να εξηγεί τέλεια και τη λογική του άβέβαιου παρόντος μας.",
  "genres": [
    "Fiction",
    "Italian Literature",
    "Portugal",
    "Historical Fiction",
    "Italy",
    "Novels",
    "Literature"
  ],
  "author": "Antonio Tabucchi",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/9531905"
}