{
  "title": "II إنسان مفرط في إنسانيته",
  "description": "نبذة المؤلف:لا تستخدم الآلة التي هي نتاج الملكة الفكرية العليا، لدى الذين يستخدمونها سوى الطاقات الدنيا وليس الفكر. وبفعلها ذلك تطلق كمية هائلة من الطاقة التي لولاها لظلت كامنة، هذا صحيح ولكنها لا تدفع المرء إلى التسامي، إلى القيام بما هو أفضل، لأن يصب فناناً. إنها تجعله نشطاً مكرراً نفس العمل بانتظام، ولكن هذا يثير على التمادي رد فعل، يثير في الروح ضجراً يائساً تتعلم من خلاله أن تطمح إلى تسليات الكسل.نبذة النيل والفرات:يقول نيتشه في مقدمة كتابه في معارضته للتشاؤم الرومانسي، أي لتشاؤم المحيطين والناقصين والمهزومين: \"تعتبر إرادة المأساة والتشاؤم علام على الصرامة وقوة الذكاء (قوة الذوق والإحساس والوعي). حيث تكون هذه الإرادة في قلبنا فإننا لا نعود نخشى الأشياء المرعبة في هذا الوجود، بل إننا نسعى إليها. وراء تلك الإرادة نجد الشجاعة والأنفة، والرغبة في أن يكون لنا عدد كبير ذلك هو منذ البداية منظوري المتشائم. وهو منظور جديد على ما يبدو لي؟ ولا يزال اليوم منظوراً جديداً وغريباً، وما زالت متعلقاً به حتى الآن سواء حين يكون لصالحي أو حين يقف ضدي أحياناً...\".هكذا شرع نيتشه في ممارسة ذلك الكلام في كتابه هذا الكلام الذي لا يتقنه إلا الصمدتون والمعانون أشد المعاناة...يتكلم عن اشياء لا يهمه أي شيء فيها، متصنعاً عثوره فيها على منفعة ما، آنذاك تعلم فن إظهار نفسه مرحاً، موضوعياً، فضولياً، وبالخصوص متمتعاً بصحة جيدة وفظاً، وذلك ما يبدو له أنه هو \"الذوق السليم\" لدى المريض.في كتابه هذا، كتب نيتشه قصة مرض وشفاء، لأن مجار الأمر كله على الشفاء، مجرد تجربة شخصية فقط، لتكون فقط ذلك الجزء \"الإنساني المفرط في إنسانيته\" في شخصيته. وكان قد أصدر \"آراء وحكم مختلطة\" وكذلك \"المسافر وظله\" في كتابين منفصلين، وكان كل واحد منهما تتمة وملحقاً لهذا الكتاب الخاص بالعقول الحرة، أي كتاب \"إنسان مفرد في إنسانيته\" الذي اعتبره في ذات الوقت تتمة وتكرار لعلاج ثقافي، لعلاج تلقائي من الرومانسية وصنعته له فطرته التي ظلت سالمة. وبعد مرور ست سنوات على شفائه يقدم للقارئ أعماله هذه في هذا الكتاب الذي هو الجزء الثاني من \"إنسان مفرط في إنسانيته\"، فلربما تستطيع وهي مجموعة أن تنقل إلى الناس تعاليم نيتشه وفلسفته تلك بقوة ووضوح أكثر، تعاليم تتعلق بالصحة ستوصي ذوي العقول المتطلبة من أبناء الجيل الصاعد بالامتثال الطوعي لها. ويقول نيتشه بأن المتحدث في هذا الكتاب هو متشائم غالباً ما ينسلخ من جلده، لكنه دائماً يعود ليندمج فيه، هو إذن متشائم ميال إلى التشاؤم، وهو بذلك غير رومانسى بالمدة: وأي عيب في ذلك؟ ألا يحق لعقل قد انغمس مثل الأفعى في فن تغيير الجلد أن يعطي درساً لمتشائمي الوقت الراهن الذي لا يزال خطر الرومانسية يترصدهم؟ وأن يبين لهم على الأقل كيف يفعلون. تلك هي فلسفة نيتشه في الحياة يقدمها من خلال نصوص هذا الكتاب مبرهناً بأنه ما زال للفكر متسع رحب للفلسفة.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Classics",
    "German Literature",
    "Germany"
  ],
  "author": "Friedrich Nietzsche",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/9537933-ii"
}