{
  "title": "A Woman's Touch: 11 Stories of Murder and Misdemeanors",
  "description": "This collection of 11 short stories places women at the heart of murder and misdemeanors--in some they are committing the crime, in others solving it, and in some cases both. These shorts are by both established and new authors, and House Rules, by Libby Fischer If Marge had known their trip to Las Vegas would break all the rules, she would have gone to the Wisconsin Dells. Her husband thinks his luck has changed when they find a valuable hidden cache, but when the box's owners come looking for it, it seems their luck has changed for the worse.Crazy, by Laura With a mother who is always just this side of crazy, a girl needs to stay on her toes.Never Kill a Cat, by Miles There is an old saying among mystery writers--never kill a cat. This story about an old lady whose beloved cat is killed by a wicked neighbor boy shows why--when she decides to seek vengeance.Aunt Charlotte, by Courtney L. Ashley thought her Aunt Charlotte was dead, until the day that the elegant woman shows up at the family home--trailing danger.Victory, by Marianne A micro-short story, in which a husband really should have listened to his wife.A Feast for Fools, by JoAnne It's All Fool's Eve and some smart-alecky clowns are serving up death in the town's poshest restaurant, owned by a brother-sister team. Now the sister must prove the case, or her chef brother might be accused of wielding the killing knife.Do the Right Thing, by Karen Detective Kathy Martinez convinced Lerone Johnson to do the right thing and testify against the man who killed her neighbor. So when the jury fails to convict him, she feels she must protect the woman and her daughter. But can she?The Murder of Katie Boyle, by Libby Fischer When the body of Katie Boyle tumbles out of a closet in a North Shore health club, it will take two women to solve the case. This story marks the first pairing of this author's two series' protagonists.Annie's Blue Christmas, by Denise In this amusing tale, Annie's doctor has just told her she's got an incurable illness and she suspects her husband of two-timing her, but she's not about to go quietly into the Christmas night.Pyro, by Tracie It's 2 a.m. and there's a cop at her door. Will Julie's heart be warmed by the flames of her boyfriend's car?Ants, by M.M. De Pull up a chair and enjoy this tale of a rich woman who insists she's communing with intelligent ants. Is it possible they know something about her missing two-timing husband?",
  "genres": [],
  "author": "Anne Stuessy",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/9536861-a-woman-s-touch"
}