{
  "title": "Spoiled Rotten America: Outrages of Everyday Life",
  "description": "Like Kofi Annan, Larry Miller is one of the most irresistible comic personalities working today. Known for years as an actor, writer, comedian, and sexual pioneer, he's gained a new following as a cultural commentator and frequent guest on political shows. Now, in Spoiled Rotten America, he fixes his gaze on what's funny about our daily lives—which includes, roughly speaking, everything. From middle-aged drinking (\"When you're in your twenties, you can drink all night and bungee-jump off a bridge the next day. If I drank all night, I'd want to go off that bridge without the cord\") to the excesses of our eating habits (\"This is why the world hates the size of the portions we order. Thank God they've never shown us eating on Al Jazeera—that would be the end of it\"), Miller finds the silver lining of absurdity within every black cloud. Ultimately, though, Spoiled Rotten America is more than just the average yukfest. It's an insightful, and surprisingly heartfelt, plea for us to notice what's best and worst about ourselves. \"The American pendulum only swings to extremes,\" he writes. \"The news is on all day, but we know less and less; there's music in every mall, but we don't hear it; everyone has a phone but nothing to say. The chubbiest of us have the strictest diets, because we can't learn to modulate and moderate. It's all or nothing. One bite of a cookie, and suddenly you're on a plane to Vegas with a hooker. To the Cranky Nitpickers of America—a club I'd join in a second if I weren't already its president—it's long been understood that the world is going to Hell in a handbasket. \"What better time for a collection of seventeen comic essays?\" What better time indeed.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Comedy",
    "Politics",
    "Audiobook",
    "Essays"
  ],
  "author": "Larry Miller",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/954513.Spoiled_Rotten_America"
}