{
  "title": "Defiant Victim",
  "description": "Defiant Victim could easily be the result of a collaborative effort between James Patterson and Dan Brown, exploring the mysterious, uncharted realm between life and death. As the victim of a murder attempt gone wrong, and with his body near death in an Intensive Care unit, Matt Kimber is launched into the unknown.Though he can still see and hear his loved ones surrounding his battered body, lying motionless in the hospital bed, they cannot see or hear him as his stands among them in his new form. Adding to the suspense, Kimber’s girlfriend and family must come to terms with a shocking, embarrassing revelation that paints Kimber as a deranged man in the global media.Defiant Victim is set against the backdrop of the declining American economy, brought to its knees by greedy corporate and political leaders. While the finger pointing continues in Washington, the leaders of both major parties have a secret, late night meeting to discuss the frightening, most unexpected voter anger that threatens their cozy and lucrative arrangement. Americans in record numbers are suddenly demanding accountability, and neither party has any real answers, only the standard accusations they routinely hurl across the isle.The shadowy, heartless Client is in the final stages of his membership induction into a secretive organization intent on controlling the global economy. He becomes enraged when the assassin informs him that Kimber survived the hit. Delving deep into the mind of the assassin reveals that to him, taking a human life is routine and justifiable, like pulling weeds from a rose garden. All that matters is to whom the garden belongs, and how much they are willing to pay the gardener. The Client is relentless and orders the assassin to finish off Kimber, but with the world media converging on the hospital, the stakes are much higher.While life in the physical world continues without Kimber, unseen forces push him closer to his destiny. Will he cross the great divide and enter eternity, or will he return to his body? Along the way, anxiety and uncertainty prevails.It becomes apparent that time is a precious commodity humans routinely take for granted, assuming tomorrow will come, when in reality there is no guarantee of another heartbeat. Kimber realizes that when a human reaches the end of their life, it is too late to have regrets.Each character faces unique and defining moments, artfully woven into a rich tapestry depicting a compelling human drama. In this physiological and paranormal thriller, the never-ending war between good and evil claims more victims as the epic battles reach a fever pitch.Climb on board, pull the safety strap tight, and hold on with both hands because a thrilling, emotional roller coaster ride awaits those who enter the Defiant Victim.",
  "genres": [],
  "author": "Otis Farmer",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/9542696-defiant-victim"
}