{
  "title": "Sacrificium",
  "description": "\"The age of the castratos was one of the most dazzling and remarkable in European music history. Seldom has there ever been such a complete fusion of sensuousness and splendor, form and content, poetry and music, and, above all, such a perfection of vocal virtuosity, as was achieved in the glory days of the Baroque era. The legendary art of the castratos continues to exert its fascination even today, and despite the great human sacrifice it exacted, a new assessment of this extraordinary period is surely justified.\" - Cecilia BartoliCecilia Bartoli uncovers the extraordinary and cruel world of the `Castrati' and sings the glorious music they inspired. The all-new album consists almost entirely of world-premiere recordings of some of the most virtuosic music ever written for the human voice. The arias on the album are drawn from the works of Nicola Porpora (1686-1768), Antonio Caldara (c. 1670-1736), Francesco Araia (1709-1770), Carl Heinrich Graun (c. 1703-1759), Leonardo Leo (1694-1744), Leonardo Vinci (1696-1730), Riccardo Brosc hi (c. 1658-1756) and Geminiano Giacomello (c. 1692- 1740).After extensive research Bartoli has produced not only a new recording, but also a comprehensive study of the castrati and their time period through two lavishly produced and illustrated articles included in the deluxe package.Sacrificium marks the first collaboration of Il Giardino Armonico, Giovanni Antonini, and Bartoli since their Grammy® Award-winning The Vivaldi Album ten years ago. This deluxe package is a hardback book (12 x 14 cm) including 2 CDs of music including 11 world-premiere recordings. The extensive booklet includes two essays on the castrati: \"Evviva il coltellino!\" (\"Long live the the little knife\") & \"Castrato Compendium\" (a 108-page \"A-Z\" of the castrati). The entire project features lavish illustrations and photos throughout along with an additional 44-page libretto.",
  "genres": [],
  "author": "Cecilia  Bartoli",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/9544762-sacrificium"
}