{
  "title": "Personal History: A Memoir",
  "description": "2 cassettes / 3 hoursRead by the AuthorListen to Katharine Graham tell you her story.Winner of the 1998 Pulitzer Prize for BiographyAn extraordinarily frank, honest, and generous book by one of America's most famous and admired women, Personal History is, as its title suggests, a book composed of both personal memoir and history.It is the story of Graham's the multimillionaire father who left private business and government service to buy and restore the down-and-out Washington Post , and the formidable, self-absorbed mother who was more interested in her political and charity work, and her passionate friendships with men like Thomas Mann and Adlai Stevenson, than in her children.It is the story of how The Washington Post struggled to succeed -- a fascinating and instructive business history as told from the inside (the paper has been run by Graham herself, her father, her husband, and now her son).It is the story of Phil Graham -- Kay's brilliant, charismatic husband (he clerked for two Supreme Court justices) -- whose plunge into manic-depression, betrayal, and eventual suicide is movingly and charitably recounted.Best of all, it is the story of Kay Graham herself. She was brought up in a family of great wealth, yet she learned and understood nothing about money. She is half-Jewish, yet -- incredibly -- remained unaware of it for many years.She describes herself as having been naive and awkward, yet intelligent and energetic. She married a man she worshipped, and he fascinated and educated her, and then, in his illness, turned from her and abused her. This destruction of her confidence and happiness is a drama in itself, followed by the even more intense drama of her new life as the head of a great newspaper and a great company, a famous (and even feared) woman in her own right. Hers is a life that came into its own with a vengeance -- a success story on every level.Graham's book is populated with a cast of fascinating characters, from fifty years of presidents (and their wives), to Steichen, Brancusi, Felix Frankfurter, Warren Buffett (her great advisor and protector), Robert McNamara, George Schultz (her regular tennis partner), and, of course, the great names from the Post : Woodward, Bernstein, and Graham's editor/partner, Ben Bradlee. She writes of them, and of the most dramatic moments of her stewardship of the Post (including the Pentagon Papers, Watergate, and the pressmen's strike), with acuity, humor, and good judgment. Her book is about learning by doing, about growing and growing up, about Washington, and about a woman liberated by both circumstance and her own great strengths.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "History",
    "Autobiography",
    "Biography Memoir",
    "Politics"
  ],
  "author": "Katharine Graham",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/95420.Personal_History"
}