{
  "title": "Sisterhood is Powerful: An Anthology of Writings from the Women's Liberation Movement",
  "description": "Here is the first comprehensive collection of writings from the Women's Liberation Movement, including articles, poems, photo-graphs, and manifestos. This anthology captures the range of problems being considered by the new feminists, and the variety of approaches to analysis and action. Over fifty contributors, all women, write about how the \"51% minority group\" is used and abused by the major institutions of our society--marriage, the family, church, courts, the media, welfare, the schools, the professions, business, and industry. A section on the psychological and sexual repression of women attacks the freudian view of the female, and discusses the problems of the aging woman, abortion and birth control, prostitution, the persecution of lesbians. Black women, a Mexican woman, high school women, ex-New Leftists, housewives, and seasoned feminists speak from their experience in tones that range from detachment to outrage. ARE MEN REALLY THE ENEMY?A Questionnaire by Jayne West, from No More Fun and Games True or False __ Woman's work is never done. __ You can't tell a book by its cover. __ Housework can be fun. __ A female dog is referred to as a bitch. __ One of the more degrading terms that can be applied to a man is \"son of a bitch.\" Multiple Choice 1. Most rapes are committed by: (a) women; (b) children; (c) men (perverts); (d) I am unable to distinguish rape from ordinary sexual relations. 2. Which do you prefer being called: (a) lady; (b) woman; (c) female; (d) girl; (e) none of the above. 3. If I could do away with anything I wanted, the first thing I would do away with is: (a) the family; (b) the state; (c) private property; (d) menstrual periods; (e) all of the above. Essay Discuss the variations in tone possible when asking a male druggist: \"Have you Tampax Super?\"",
  "genres": [
    "Feminism",
    "Nonfiction",
    "History",
    "Womens",
    "Politics",
    "Essays",
    "Gender"
  ],
  "author": "Robin Morgan",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/132084.Sisterhood_is_Powerful"
}