{
  "title": "The Queen's Head",
  "description": "1587, and Mary, Queen of Scots, dies by the executioner’s axe; her head, shorn of its auburn wig, rolling across the platform. Will her death end the ceaseless plotting against Mary’s red-haired cousin, Elizabeth?1588, the year of the Spanish Armada, is a time of more terror and triumph, not just for queen and court but for the whole of England. The turmoil is reflected in its theatres and under the galleries of inns like London’s “The Queen’s Head” where Lord Westfield’s Men perform. The scene there grows even more tumultuous when one of the actors is murdered by a mysterious stranger during a brawl.Nicholas Bracewell, the company’s bookholder (a role far wider than mere producer) faces two immediate repercussions. The first is to secure a replacement acceptable to its temperamental star  and chief shareholder  Lawrence Firethorn. The second is to keep his promise to the dying Will Fowler and catch his killer.Soon further robberies, accidents, and misfortunes strike Lord Westfield’s Men even as their stage successes swell. Bracewell begins to suspect a conspiracy, not a single murderous act, but where lies the proof? Then the players are rewarded with the ultimate accolade  an appearance at court  and the canny bookholder senses the end to the drama is at hand…First published to great acclaim in 1988, The Queen’s Head anticipated the lure of bawdy, boisterous, yet elegant epics like Shakespeare in Love. Actor and playwright Marston has followed with, to date, ten more lusty, historically grounded, theatrically sound Bracewell mysteries that explore the face of England and reveal his deep love for its rich literary and dramatic heritage. The Roaring Boy was nominated for a 1996 Edgar Award for Best Novel.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Fiction",
    "Historical",
    "Crime",
    "16th Century"
  ],
  "author": "Edward Marston",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/954867.The_Queen_s_Head"
}