{
  "title": "The Dream Culture of the Neanderthals: Guardians of the Ancient Wisdom",
  "description": "Explores the influence of Neanderthal man on the cultural and biological development of humanity• Traces the power of long-held beliefs and superstitions to the influence of Neanderthal lunar and dream-based traditions• Offers a compelling vision of a unified humanity that can benefit from the gifts of both its Neanderthal and Cro-Magnon ancestors• Provides evidence that direct descendants of the Neanderthal race may still be alive in Central AsiaA number of long-standing beliefs and superstitions show how the ideas that dominated the lives of our ancestors still have a powerful influence on us today. The disturbing power attributed to the number thirteen, the positive influence of the number seven, and the comfort offered by the admonition “knock wood” all reveal the enduring presence of our most ancient the Neanderthals. Contrary to current theories, Stan Gooch maintains that the Neanderthals were not destroyed by the younger Cro-Magnon culture but were incorporated into that culture through interbreeding. The blending of the disparate influences of the lunar, matriarchal-based Neanderthals and the solar, patriarchal Cro-Magnons may explain the contradictory impulses and influences that have generated human conflict for millennia. In fact, the author suggests that the caste system in India may have been constructed to utilize the strengths of both lunar and solar cultures and to minimize the conflict between the two.There is evidence that direct descendents of the moon-worshipping, dream-­cultivating Neanderthal race are still living in Central Asia today. While their physical descendants may be almost extinct, the influence of Neanderthal wisdom remains strong and can be found not only in witchcraft lore and the Kabbalah, but in the formative tenets of the Knights Templar, the Rosicrucians, and even Christianity.",
  "genres": [
    "History",
    "Anthropology",
    "Religion",
    "Science",
    "Philosophy",
    "Psychology"
  ],
  "author": "Stan Gooch",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/954809.The_Dream_Culture_of_the_Neanderthals"
}