{
  "title": "Ρωμιοσύνη",
  "description": "Η Ρωμιοσύνη (γραμμένη το 1945-47 και τυπωμένη πρώτη φορά το 1954 μέσα στην ευρύτερη συλλογή Αγρύπνια που περιέχει το έργο του ποιητή από το 1941 ως το 1953) είναι μια μεγάλη ποιητική σύνθεση χωρισμένη σε επτά μέρη-ενότητες. Στη σύνθεση αυτή ο ποιητής, συνδέοντας με τρόπο προσωπικό διάφορα στοιχεία της ιστορικής παράδοσης και ποικίλους εκφραστικούς τρόπους, μας δίνει ανάγλυφη τη μορφή της Ελλάδας και των ανθρώπων της στον αδιάκοπο αγώνα τους για ελευθερία, δικαιοσύνη και ανθρωπιά.Το ποίημα αποτελείται από επτά ενότητες:Η ενότητα Ι αναδεικνύει την αντιστοιχία, τη συνάρτηση του ήθους τοπίου και ανθρώπων και την εμμονή της αντίστασής τους. Ο χώρος και οι άνθρωποι πολιορκούνται από στεριά και θάλασσα, αλλά η πολιορκία αυτή αναιρείται από ένα θαύμα που εξακοντίζεται στον ορίζοντα.Η ενότητα ΙΙ αποδίδει εικόνες της Ρωμιοσύνης στην καθημερινότητά τους αλλά και στη διαχρονική τους σύνθεση. Εδώ το τοπίο καταυγάζεται από την αρχετυπική παρουσία της γυναίκας, την Παναγία \"με τ’ αργυρά ματόκλαδα\", που συνυπάρχει πολύ ανθρώπινα με την κόρη του πεταλωτή αλλά και την ορφική μητέρα, τη Λήδα, \"που κλωσά τ’ αυγά του κεραυνού\", τη Νιόβη, με τα \"επτά σφαγμένα παλικάρια\" της, τη Σολωμική ελευθερία, \"που θα πάρει πάλι τ’ άρματα\" και την Περσεφόνη που μοιράζει σπορά και γονιμότητα. Όλες αυτές οι γυναικείες μορφές συγκλίνουν στη μορφή της μητέρας Ελλάδας.Η ενότητα ΙΙΙ τονίζει ιδιαίτερα τη διαχρονικότητα της ρωμαίικης ζωής και τη διαρκή αγωνιστική ετοιμότητά της. Εδώ η ιστορία υφαίνεται μ’ ένα όνομα από τρεις χιλιάδες χρόνια μ’ έναν άγιο, με μια κόκκινη γοργόνα, αλλά και με την μυθική παρουσία του Προμηθέα σ’ ένα ανακυκλούμενο αιώνιο γίγνεσθαι.Η ενότητα ΙV περιγράφει την αγωνιστική πορεία, \"δέντρο το δέντρο, πέτρα την πέτρα, πέρασαν τον κόσμο\", και την άδοξη κατάληξή της, \"και τούτοι μεσ’ τα σίδερα και κείνοι μεσ’ το χώμα\", αλλά και την πεποίθηση για την τελική απολύτρωση.Η ενότητα V σκιαγραφεί το αίσθημα της καταστροφής και της ερήμωσης του μαρτυρικού τόπου αλλά και την προσδοκία της παλιννόστησης της ζωής. Τότε, \"θα διαβάσουμε όλη την καρδιά τους\" (των μαρτύρων της ελευθερίας)\"σαν να διαβάζουμε από την αρχή την ιστορία του κόσμου\".Η ενότητα VI αποδίδει παραστατικότερα την εφιαλτική πραγματικότητα του εμφύλιου σπαραγμού και του θανάτου αλλά και την επιμονή στη συνέχιση της ζωής και του αγώνα. Μόνο \"για τα ψηλά είναι ακόμα δρόμος\".Τέλος η VII ενότητα προβάλλει και πάλι την ταυτότητα του τόπου και των ανθρώπων, που μέσα από τη γνώση του θανάτου προχωρούν με περισσότερη σιγουριά προς τη ζωή και την αγάπη, πέρα από τους διαχωρισμούς του πολέμου.",
  "genres": [
    "Poetry",
    "Classics"
  ],
  "author": "Yiannis Ritsos",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/9541777"
}