{
  "title": "Perceforest: The Prehistory of King Arthur's Britain",
  "description": "Perceforest is one of the largest and certainly the most extraordinary of the late Arthurian romances. Justly described as -an encyclopaedia of 14th-century chivalry- and -a mine of folkloric motifs-, it is the subject of rapidly increasing attention and research. The author of Perceforest draws on Alexander romances, Roman histories and medieval travel writing (not to mention oral tradition, as he gives, for example, the distinctly racy first written version of the Sleeping Beauty story), to create a remarkable prehistory of King Arthur's Britain. It begins with the arrival in Britain of Alexander the Great. His follower Perceforest, the first of Arthur's Greek ancestors, is made king of the island and finds it infested by the -evil clan- of Darnant the Enchanter. Magic plays a dominant part in the adventures which follow, as Perceforest ousts Darnant's clan despite their supernatural powers. He founds the knightly order of the -Franc Palais-, an ideal of chivalric civilisation prefiguring the Round Table of Arthur and indeed that of Edward III. But that civilisation is, the author shows, all too fragile. The vast imaginative scope of Perceforest/I> is matched by its variety of tone, ranging from tales of love and enchantment to bawdy comedy, from glamorous tournaments to unvarnished descriptions of the havoc wrought by war. And the author's surprising view of pagan gods and the coming of Christianity is as fascinating as the prominence he gives to women and his understanding of how the world of chivalry should work. Because of its enormous length - it runs to over a million words - Nigel Bryant has provided a version which gives a complete account of every episode, linking extensive passages of translation, to make a manageable and highly readable version (including the previously unpublished Books Five and Six), of this remarkable and largely unexplored work. Nigel Bryant has worked as a producer for BBC Radio 3 and as head of drama at Marlborough College. This is his fourth major translation of medieval Arthurian romance.",
  "genres": [
    "Arthurian",
    "Medieval",
    "Fiction"
  ],
  "author": "Unknown",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/9547839-perceforest"
}