{
  "title": "Owning Arabella",
  "description": "Against her will, Arabella is gambled by her stepfather in a card game and won by the fiercely scarred Lord Darth Peregrine. A man who believes that no woman could desire him. Lord Peregrine holds Arabella captive to his sexual desires. He is the lord and master and she is naked to his control. In the end Lord Peregrine saves Arabella's young brother ... and he saves himself. m/f HEA.Owning Arabella is previously published in Allure Gold Two Erotic NovelsFavorite Punishment! Darth had said punishment! Arabella squealed again as Darth hauled her to one of the bedposts. There he lifted her wrists high over her head as she wiggled and fought his hold. But he took the thinnest belt and wrapped both of her wrists, pulling them higher to bind the belt around the bedpost. Bringing even her heels off the ground. She was hung helplessly naked and heaving from the exertion of trying to escape him. “God, you are beautiful,” he uttered, swiping a broad hand across his scarred mouth as if he had not meant to say it.He was standing to the side of her with one of his hands hung down at his side and the wide leather strap dangling to the floor. Arabella clenched her eyes and tensed in terrified anticipation of the lash she knew was coming. Flinching when Darth moved, only no sudden pain came across her back. Instead, she heard the soft whoosh of the feather mattress. Then she dared to open her eyes to see Darth stretched out like a great feline cat crossways on the corner of the bed. His penetrating gray eyes were gazing up at her. She had never felt more exposed in her life, stripped naked, and helpless before a man. “I hate you!” she cried, not knowing what else to say or to do as Darth lay there, and then he smiled slowly. Arabella’s heart caught unreasonably, for she would never think this brute, this bully, who was so utterly male, could be attractive in his own way.",
  "genres": [
    "Historical Romance",
    "Historical",
    "BDSM",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "Regency"
  ],
  "author": "Shirl Anders",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/9553789-owning-arabella"
}