{
  "title": "The Panic Years: A Guide to Surviving Smug Married Friends, Bad Taffeta, and Life on the Wrong Side of 25 without a Ring",
  "description": "Have you ever found yourself thinking, “If one more friend gets engaged I’m going to scream”?Do the words taffeta and crinoline make you break into a cold sweat?Does reading the wedding announcements section in the newspaper induce outright hyperventilation?If so, congratulations! You’ve hit the Panic Years.According to author Doree Lewak, the Panic Years mark the point (usually around your twenty-sixth birthday) when your dating agenda fundamentally changes—from dating for a fling to dating for a ring. Suddenly your newly married friends feel more like enemies, weddings become mocking reminders of your own single status, and you contemplate going on a reality TV show to find true love. What’s a girl to do?In The Panic Years, Lewak delivers a hilarious and helpful road map for conquering the Panic and finding Mr. Right. As Lewak shows, you can win the race to the altar by changing your tactics from Panicked to Proactive—and keeping your sense of humor along the way. You will learn how Cope with Panic by Proxy—pushy friends and parents.Successfully hunt for PFs (Potential Fiancés).Project hotness and desirability.Set—and stick to—dating time lines.Avoid being bitter at your friends’ weddings — and ruining all their pictures with that scowl on your face.Get the ring and the proposal and seal the deal!Packed with true-life stories from the Panic trenches as well as indispensable advice, The Panic Years is the ultimate guide for anyone who wants to survive her single years (with sanity intact), snag her perfect guy, and remain fabulous throughout it all.You know you’re in the Panic Years Your mom slips you the number of her tennis partner’s son … for the fifth time.You’ve walked down the aisle dozens of times—just not as a bride.Your “concerned friends” chip in for a subscription to Match.com for your birthday.It’s down to you and the five-year-old flower girl at the bouquet toss.Upon hearing “Guess what? I’m engaged!” for the second time in one week, you disconnect your phone.You actively scheme to win back your ex—even though he’s already engaged to someone else.",
  "genres": [
    "Nonfiction",
    "Self Help"
  ],
  "author": "Doree Lewak",
  "average_rating": "2.56",
  "url": "https://www.goodreads.com/book/show/954918.The_Panic_Years"
}