{
  "title": "Anatoly Medlov: Complete Reign",
  "description": "From the bestselling series, the Medlov Crime Family, comes the highly-anticipated story about America's favorite bad boy...Anatoly Medlov is the youngest crime boss in the Medlov Organized Crime Family’s history. Now, he has to prove himself to a council who thinks his legacy has not been well-earned, amidst a grueling investigation by Lt. Nicola Agosto of the Memphis Police Department and during plot to destroy him by his ex-lover, Victoria. In his loneliness, the only one he can confide in is the shop girl, Renee, an old friend who knows more than anyone about his personal journey. However, his friendship soon turns to love for a woman he knows that he cannot have because of the feared code his is bound to by the Vory v Zakone. When his estranged mother dies suddenly, Anatoly flies to Russia to pay his last respects and discovers a jolting secret. The late Ivan Medlov’s own brutal legacy still lives through his son, Gabriel, and his New York crime family. Anatoly’s father and former Czar of the underworld, Dmitry, sees this as an opportunity to unite the two major families and blesses both men. However, Anatoly sees Gabriel as a threat to his empire and competition for the affection of his father. Will cousins kill because of the sins of their fathers? Gabriel Medlov has always resented his existence. Now as an undercover DEA agent, he plans destroy the Medlov Crime Family once and for all. Only in order to get close enough to destroy the organization, he must also get close enough to love his estranged family. Will blood prove thicker than water or will one man’s revenge end the Family for good?Follow the story of one young man who fights to be king in a room full of royalty and suffers the pain of his position in the romantic suspense guaranteed to make you want more. Note from Latrivia S. truly hope that you enjoy my latest addition to The Medlov Crime Family Series. This book is different, because it’s a stand-alone. If you have never read the series, you still will be able to follow the characters and the plot of this book without having read Dmitry’s Closet or Dmitry’s Royal Rise of the Queen. So don’t worry. For those with sensitive reading eyes, there is no rape scene. However, for those hopeless romantics, there is plenty of love You’ll see the complex relationships between father and son, husband and wife, mother and daughter, best friends, etc.Also, at the end of the book, you will have a few questions. They all will be answered in the last book of the series due out December 2011. This book was written with the suggestions that have been given over the last year in mind. Each and every review has been taken into consideration, and I’d like to thank all of you for your continued support of my work. It is my most sincere desire to get better and better at writing stories that take you from your everyday life. We have enough on our plates to keep us anchored to reality. Why not have something to pull you away for awhile? With the Medlov family you get a chance to enter into a world of make believe where you jet set across the world to foreign locales with handsome, powerful men and beautiful women, go on exciting adventures and still arrive back at your home in time to fix dinner and wash clothes for the next dayI encourage you to read the books and share your opinions. Thank you again and God bless,Latrivia S. Nelson",
  "genres": [
    "Interracial Romance",
    "Romance",
    "Contemporary",
    "Romantic Suspense",
    "Russia",
    "Erotic Romance"
  ],
  "author": "Latrivia S. Nelson",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/10352005-anatoly-medlov"
}