{
  "title": "Celestial Selenite Scry",
  "description": "The Celestial Selenite Scry (Book I of The Moon God Trilogy)Magic and supernatural stories have always had a way of adding mystery and fascination to the every day world. Many dream of possessing the ability to harbor great powers that can create what they most desire and un-create what they wish never to exist. A witch born into the bloodline of a centuries old lord of the underworld can do just that, but not just any witch. This is a one of kind witch born male. This male is not a warlock, wizard, magician or any other practitioner of this basic sort. This male witch need not dabble in potion mixing, require the use of wands or fabricate illusions to work magic. This male witch need only be born as prophesized in order to defeat a mighty and ever-vigilant savior that has awaited his coming throughout the ages. The Celestial Selenite Scry is the lunar sphere that portends the birth of this master male of magic and power. This male is classed to be the perfection of an old and new domination. A witch predestined to obliterate entire worlds. The story of this destroyer of creation begins on a stormy November night in 1796. A female subservient of the evil underworld lord is expected to give birth to this son of death. Her family bloodline carries the key to his making. His pre-eminent release into the world is severed, but not prevented when two males are unexpectedly born instead of one. What follows will alter the duty of immortal enemies bonded in blood as fraternal twins and affect the fate of every existence in the known and unknown universe, forever. The Celestial Selenite Scry is a dark, daring, and dramatic telling about two predominate icons originating from opposite realms located above and below the boundaries of Earth. The view through The Celestial Selenite Scry travels a two hundred year span through the bloodline, which links the destiny of these formidable rivals reformed as brothers. Their undying and adjoined existence weaves through a haunting foretelling of the imminent future, while revisiting an unforgettable past. ~ This Novel Contains Illicit & Explicit Sex and Adult Subject Matter.~ ~Not for readers under 18 years of age ~",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Paranormal",
    "LGBT"
  ],
  "author": "Marlene K. Slade",
  "average_rating": "3.16",
  "url": "https://www.goodreads.com/book/show/9558085-celestial-selenite-scry"
}