{
  "title": "Harnessed: How Language and Music Mimicked Nature and Transformed Ape to Man",
  "description": "The scientific consensus is that our ability to understand human speech has evolved over hundreds of thousands of years. After all, there are whole portions of the brain devoted to human speech. We learn to understand speech before we can even walk, and can seamlessly absorb enormous amounts of information simply by hearing it. Surely we evolved this capability over thousands of generations.Or did we? Portions of the human brain are also devoted to reading. Children learn to read at a very young age and can seamlessly absorb information even more quickly through reading than through hearing. We know that we didn’t evolve to read because reading is only a few thousand years old.In Harnessed, cognitive scientist Mark Changizi demonstrates that human speech has been very specifically “designed” to harness the sounds of nature, sounds we’ve evolved over millions of years to readily understand. Long before humans evolved, mammals have learned to interpret the sounds of nature to understand both threats and opportunities. Our speech—regardless of language—is very clearly based on the sounds of nature.Even more fascinating, Changizi shows that music itself is based on natural sounds. Music—seemingly one of the most human of inventions—is literally built on sounds and patterns of sound that have existed since the beginning of time.From Library Journal:\"Many scientists believe that the human brain's capacity for language is innate, that the brain is actually \"hard-wired\" for this higher-level functionality. But theoretical neurobiologist Changizi (director of human cognition, 2AI Labs; The Vision Revolution) brilliantly challenges this view, claiming that language (and music) are neither innate nor instinctual to the brain but evolved culturally to take advantage of what the most ancient aspect of our brain does best: process the sounds of nature ... it will certainly intrigue evolutionary biologists, linguists, and cultural anthropologists and is strongly recommended for libraries that have Changizi's previous book.\"From Forbes:“In his latest book, Harnessed, neuroscientist Mark Changizi manages to accomplish the extraordinary: he says something compellingly new about evolution.… Instead of tackling evolution from the usual position and become mired in the usual arguments, he focuses on one aspect of the larger story so central to who we are, it may very well overshadow all others except the origin of life itself: communication.”",
  "genres": [
    "Science",
    "Music",
    "Nonfiction",
    "Psychology",
    "Language",
    "Linguistics",
    "Evolution"
  ],
  "author": "Mark Changizi",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/9562831-harnessed"
}