{
  "title": "Carnal Machines",
  "description": "The Victorians wrote some of the best and most enduring erotica. For such a tightly-laced age, people spent a lot of time thinking about things carnal. Jules Verne, Sir Arthur Conan Doyle, Mary Shelley, H.G. Wells, et al enthralled us with their visions of new possibilities. The rich and slightly decadent visuals of the steam age lend themselves perfectly to the new carnality of post-punk era. And, of course, what is repressed will be even more exciting once the corset is unlaced. Steampunk, even without sex, is erotic; with sex, it’s over-the-top hot. A widowed lady engineer invents a small device that can store the energy from sexual frustration and convert it to electricity to help power a home. Teresa Noelle Roberts shows us what it can do, confronted with sexual fulfillment. What volume of steampunk would be complete without a tale of sailing ships and the men who sail them? If your taste runs to sexy pirates in space, Poe Von Page will delight you with the mutinous crew of the Danika Blue and their new captain. Then there’s the very special room on the top floor in the House of the Sable Locks, a brothel where sexually discriminating men go to have their fantasies fulfilled. Even if a man daren’t put those fantasies into words, Elizabeth Schechter’s “Succubus” will give the madam all the information she needs with which to make her clients happy. There are brothels, flying machines, steam-powered conveyances, manor houses, spiritualist societies. The following stories afford intelligently written, beautifully crafted glimpses into other worlds, where the Carnal Machines won’t fail to seduce you, get you wet or make you hard so, lie back, relax; a happy ending is guaranteed.",
  "genres": [
    "Steampunk",
    "Erotica",
    "BDSM",
    "Fiction",
    "Romance",
    "Anthologies",
    "Short Stories"
  ],
  "author": "D.L. King",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/9569273-carnal-machines"
}