{
  "title": "The Healing Power of Pets: Harnessing the Amazing Ability of Pets to Make and Keep People Happy and Healthy",
  "description": "From Dr. Marty Becker, co-author of the bestsellers Chicken Soup for the Pet Lovers Soul, and Chicken Soup for the Cat and Dog Lovers Soul comes a groundbreaking new book that reveals the stirring stories and medical miracles behind the healing power of pets. Pets and people have been living together for thousands of years, but as pets have moved indoors, there have been extraordinary changes in the relationship. In the last twenty years, medical research has increasingly proven the healing effect pets can have for the ill, the elderly, the stressed-out, and the emotionally disengaged. Research shows that people with pet companions have fewer doctor visits and recover more quickly from severe illnesses. In The Healing Power of Pets, Dr. Marty Becker, resident vet on ABC-TV's Good Morning America shows readers how pets can prevent, detect, treat, and in some cases cure a variety of maladies, from arthritis to asthma, and from Alzheimer's to depression. Pets decrease cardiovascular risk factors, motivate their sedentary owners to exercise, and help people deal with chronic pain. In addition, the book offers heartwarming true stories of pets who have enriched—even saved—their owners lives to reveal the lasting physical, emotional, and social benefits of the human–animal bond. \"For those of us who have always believed that pets enhance our lives and make us better human beings, Marty Becker drives the lesson home with compassion and wit. Our beloved animals never had a better friend.\" —Nancy L. Snyderman, M.D. \"Dr. Becker steps confidently and competently into the animal–human arena, adding a strong voice for the healing powers of animals.\" —Susan Chernak McElroy, author of Animals as Teachers and Healers",
  "genres": [
    "Animals",
    "Nonfiction",
    "Dogs"
  ],
  "author": "Marty Becker",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/956566.The_Healing_Power_of_Pets"
}