{
  "title": "The Fortune of the Rougons",
  "description": "In the small Provençal town of Plassans, the day after the coup d'état from which the Second Empire was born, two teenagers, Miette and Silvère, join the insurgents. Their love story like the Republican uprising runs through the novel, but beyond them, it is also the birth of a family that is evoked: the Rougons at the same time as the Macquarts whose double lineage, legitimate and bastard, descends from Silvere's grandmother, Aunt Dide. And between Pierre Rougon and his half-brother Antoine Macquart, the fight will quickly begin. The first novel in the long Rougon-Macquart series, La Fortune des Rougon, which Zola published in 1871, is indeed the novel of origins. At the moment when the imperial regime that the writer slays is established, it is here that the patient conquest of power and money begins, a slow family rise which must make us forget the sordid beginnings, in poverty and in crime. “Your comedy is tragic,” wrote Hugo just after reading the book: “You have firm drawing, frank color, relief, truth, life. Continue these deep studies. »❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇❇Dans la petite ville provençale de Plassans, au lendemain du coup d’Etat d’où va naître le Second Empire, deux adolescents, Miette et Silvère, se mêlent aux insurgés. Leur histoire d’amour comme le soulèvement des républicains traversent le roman, mais au-delà d’eux, c’est aussi la naissance d’une famille qui se trouve évoquée : les Rougon en même temps que les Macquart dont la double lignée, légitime et bâtarde, descend de la grand-mère de Silvère, Tante Dide. Et entre Pierre Rougon et son demi-frère Antoine Macquart, la lutte rapidement va s’ouvrir. Premier roman de la longue série des Rougon-Macquart, La Fortune des Rougon que Zola fait paraître en 1871 est bien le roman des origines. Au moment où s’installe le régime impérial que l’écrivain pourfend, c’est ici que commence la patiente conquête du pouvoir et de l’argent, une lente ascension familiale qui doit faire oublier les commencements sordides, dans la misère et dans le crime. « Votre comédie est tragique », écrit Hugo juste après avoir lu le livre : « Vous avez le dessin ferme, la couleur franche, le relief, la vérité, la vie. Continuez ces études profondes. »",
  "genres": [
    "Classics",
    "Fiction",
    "France",
    "French Literature",
    "19th Century",
    "Historical Fiction",
    "Literature"
  ],
  "author": "Émile Zola",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/956734.The_Fortune_of_the_Rougons"
}