{
  "title": "Unmodern Philosophy and Modern Philosophy",
  "description": "In 1947 America’s premier philosopher, educator, and public intellectual John Dewey purportedly lost his last manuscript on modern philosophy in the back of a taxicab. Now, sixty-five years later, Dewey’s fresh and unpretentious take on the history and theory of knowledge is finally available. Editor Phillip Deen has taken on the task of editing Dewey’s unfinished work, carefully compiling the fragments and multiple drafts of each chapter that he discovered in the folders of the Dewey Papers at the Special Collections Research Center at Southern Illinois University Carbondale. He has used Dewey’s last known outline for the manuscript, aiming to create a finished product that faithfully represents Dewey’s original intent. An introduction and editor’s notes by Deen and a foreword by Larry A. Hickman, director of the Center for Dewey Studies, frame this previously lost work. In Unmodern Philosophy and Modern Philosophy, Dewey argues that modern philosophy is anything but; instead, it retains the baggage of outdated and misguided philosophical traditions and dualisms carried forward from Greek and medieval traditions. Drawing on cultural anthropology, Dewey moves past the philosophical themes of the past, instead proposing a functional model of humanity as emotional, inquiring, purposive organisms embedded in a natural and cultural environment. Dewey begins by tracing the problematic history of philosophy, demonstrating how, from the time of the Greeks to the Empiricists and Rationalists, the subject has been mired in the search for immutable absolutes outside human experience and has relied on dualisms between mind and body, theory and practice, and the material and the ideal, ultimately dividing humanity from nature. The result, he posits, is the epistemological problem of how it is possible to have knowledge at all. In the second half of the volume, Dewey roots philosophy in the conflicting beliefs and cultural tensions of the human condition, maintaining that these issues are much more pertinent to philosophy and knowledge than the sharp dichotomies of the past and abstract questions of the body and mind. Ultimately, Dewey argues that the mind is not separate from the world, criticizes the denigration of practice in the name of theory, addresses the dualism between matter and ideals, and questions why the human and the natural were ever separated in philosophy. The result is a deeper understanding of the relationship among the scientific, the moral, and the aesthetic. More than just historically significant in its rediscovery, Unmodern Philosophy and Modern Philosophy provides an intriguing critique of the history of modern thought and a positive account of John Dewey’s naturalized theory of knowing. This volume marks a significant contribution to the history of American thought and finally resolves one of the mysteries of pragmatic philosophy.",
  "genres": [
    "Philosophy"
  ],
  "author": "John Dewey",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/13211391-unmodern-philosophy-and-modern-philosophy"
}