{
  "title": "The Gods Drink Whiskey: Stumbling Toward Enlightenment in the Land of the Tattered Buddha",
  "description": "A sometimes funny, always thoughtful, action–packed spiritual travelogue through Southeast Asia where the oldest form of Buddhism is slowly emerging from its post–Khmer Rouge oppression. The Gods Drink Whiskey is about a relatively unexplored part of Buddhism––the Theravada Buddhist tradition (considered the oldest and purest form of Buddhism, which focuses on the historical Buddha) as it is manifested in Southeast Asia (Cambodia, Thailand, Vietnam, Sri Lanka, etc.). An accomplished teacher, Asma tells wonderful, exciting stories about his time in Southeast Asia teaching Buddhist philosophy in Phnom Penh years after that area (and its religion) was decimated in the early 70s by the Communist Khmer Rouge and the invasion by US and Vietnamese troops. Through his first–hand experiences (of drinking with holy men and poets, encounters with overzealous Christian evangelical missionaries, witnessing a political assassination, climbing mountains to visit ancient animistic temples, observing the clash of Western pop culture and Southeast Asian culture, etc.), Asma successfully teaches the reader a great deal about Buddhism. In addition to observations on Western/Eastern culture clash which these books provide, the edge Asma has going for him is his academic credentials and interests which focus his book more on explaining the tenets and history of Buddhism within the context of a lively travelogue. o For armchair travellers and those interested in Buddhism and Eastern Philosophy. o Asma has a wonderful narrative style that draws the reader in and keeps them reading–he's a born storyteller, and this book is all about the stories–both his and the unusual people and places he meets. o There has been relatively little written about the Theravada Buddhist tradition (the oldest branch, which focuses on the historical Buddha); Asma explores and immerses himself in Theravada Buddhism as it's practiced in Southeast Asia, and finds it much different than he expected. o Asma has taught Buddhism for several years, and in his travels, experienced Buddhism in its many forms.",
  "genres": [
    "Buddhism",
    "Nonfiction",
    "Travel",
    "Religion",
    "Philosophy",
    "Asia",
    "History"
  ],
  "author": "Stephen T. Asma",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/956696.The_Gods_Drink_Whiskey"
}