{
  "title": "Mousejunkies!: More Tips, Tales, and Tricks for a Disney World Fix: All You Need to Know for a Perfect Vacation",
  "description": "A guidebook with a decidedly different approach, the second edition of Mousejunkies is a collection of humorous travelogues and insider how-to secrets compiled after scores of trips to Walt Disney World. The book draws on the insights of a panel of Disney fanatics — The Mousejunkies — following dozens of personal vacations, trade shows and press trips in recent years. This second edition brings everything up to date with countless new tips, tricks, and tales.Mousejunkies provides tips and travel plans told through personal accounts – something that sets it apart from all the other guides.All of the most important topics are covered: When to go, where to stay, what to do and where to eat. But readers will also learn how to indulge in an all-day chicken wing and beer football orgy at Walt Disney World, how to extract your family from Fantasmic with your sanity intact, where to catch a mid-afternoon catnap in the theme park, and even how wrong a Disney cruise can go.Mousejunkies is more than one travel writer’s experiences at one of the most popular vacation destinations in the world. The Mousejunkies are a group of seemingly well-adjusted adults who have found themselves inexplicably drawn to Walt Disney World, again and again. Each has taken his or her own path, finding their way separately. When the smoke cleared, the group found itself back in reality, staring at one another over a pile of discarded annual passes and a useless collection of novelty hats.The stories - wry, humorous and told with an affection gained through years of Disney addiction - paint vivid portraits of a creatively engineered world, where unexpected surprises create lasting memories.The tips – valuable information designed to help readers get more out of their vacations – are told with a sly wink and the desire to share the secrets that make trips to central Florida more memorable.From touring plans to tongue-in-cheek reviews of the theme parks’ restrooms, Mousejunkies provides readers with useful information couched in obsessively-detailed narrative with a humorous touch.",
  "genres": [
    "Travel",
    "Nonfiction"
  ],
  "author": "Bill Burke",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/9576442-mousejunkies"
}