{
  "title": "Prince of Bryanae",
  "description": "Elven soldier Willow serves the human Kingdom of Bryanae in a bid to overcome her traumatic past. Emotionally crippled and driven by her personal demons, she has buried that past so deeply that she has forgotten it altogether ... but it hasn't forgotten her. Paralyzed by an inexplicable terror, she watches helplessly as old enemies kidnap the Prince. Considered by most of Bryanae to be a coward and a traitor, Willow decides she must confront her past and plunge into the heart of the enemy empire to rescue the Prince. Aside from the steel blade she wields with lethal expertise, Willow has only dubious allies upon whom to rely-a headstrong private who's in love with her, an inscrutable winged mage with a hidden agenda, and a dashing but opportunistic captain whom she desires against her better judgment. An army of fanatical warriors stands in her way. Leading them is the mad and seemingly immortal Warlord who has a personal grudge to settle with Willow: one that spans centuries. Willow has devoted her life to discipline and now she must bring that discipline to bear. Pain will not stop her. Fear will not stop her. She will rescue the Prince or die trying. Willow has been honing her combat and weaponry skills for a very long time. It's time to put those skills to good use. PRINCE OF BRYANAE is an epic fantasy novel filled with intense battles, romance, betrayal, and redemption. \"Fresh and strong and full of energy!\" - New York Times Bestselling Author R. A. Salvatore \"Getzin makes you feel like a part of the intricate and fascinating world he's created. This is solid storytelling and spicy yarns. Once inside, you won't want to leave.\" - Mike Freeman, author of The New York Times notable book Bloody Sundays \"This is a splendid book full of adventure and a sympathetic character in Willow. The story has heart and excitement. I'd recommend it to anyone who loves a rollicking good fantasy. Jeffrey Getzin is a writer to watch\" - Billie Sue Mosiman, author of Legions of the Dark \"I recommend [Prince of Bryanae] to anyone who enjoys a good story with nonstop action and suspense, combined with strong, memorable characters and an imaginative setting.\" - Scotti Cohn, author of Liberty's Children",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy"
  ],
  "author": "Jeffrey Getzin",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/9574711-prince-of-bryanae"
}