{
  "title": "Lazarus Rising: A Personal and Political Autobiography",
  "description": "John Howard spent decades under media scrutiny, and while his credentials as a political leader, devoted family man and sports tragic are beyond dispute, in this autobiography he reveals much more about himself. In Lazarus Rising, Howard traces his personal and political journey, from childhood in the post-World War II era through to the present day, painting a fascinating picture of a changing Australia.We see the youngster who had to overcome serious deafness and who latched onto the family passion for current affairs and politics. From school debating, to a legal career, to the Liberal Party and life with Janette, it all seemed such a natural progression. Yet no one would say that Howard had it easy; not when his own colleagues sidelined him . . . twice. An economic radical and social conservative, John Howard's ideology united many Australians and divided just as many others.Long before he attained the role of prime minister, he first had to convince his fellow Liberals that he was the man they needed. To do that, he had to tough it out; it took several attempts and many years biding his time. When he finally got his turn to take on the ALP, he proved wrong all his doubters, and showed a whole nation that it had been a mistake ever to underestimate John Howard. He led the Liberal Party to victory in four elections and became the second-longest-serving PM in the nation's history.Lazarus Rising is history seen through the eyes of the ultimate insider; an account of a 30-year political career. No prime minister of modern times has reshaped Australia and its place in the world as forcefully as John Howard. As part of his reform agenda he privatized Telstra, dismantled excessive union power and compulsory trade union membership, instituted the unpopular Goods and Services Tax, and established the ‘work for the dole' scheme.Then there are the insights into political leadership and character, the stuff that drives history. Without his deep reserves of resilience - and the support of a strong wife and loving family - there would have been no Prime Minister John Howard walking the world stage. He tells us how he responded on issues vital to Australia, such as gun control, the aftermath of 9/11, Iraq and the rising tide of asylum-seekers. He also shares his thoughts on his former Treasurer and leadership aspirant, Peter Costello, and the Rudd-Gillard debate.Lazarus Rising takes us through the life and motivations of John Howard and through the forces which have changed and shaped both him and the country he led for 11 years.",
  "genres": [
    "Politics",
    "Biography",
    "Nonfiction",
    "History",
    "Australia",
    "Audiobook",
    "Memoir"
  ],
  "author": "John Howard",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/9572649-lazarus-rising"
}