{
  "title": "Angel Heart",
  "description": "First in the \"Glorious Companions\" series of historical romance adventures!For fans of Outlander, Ahab's Wife and The Red Tent. The epic saga of kings, queens, angels, adventure and eternal love. Join the heroes of old, and be transported into a land of danger and romance!When eighteen-year-old Kenana is sold into marriage to the elderly Prince Jubal of Mesopotamia, she's determined to make the best of the situation, However, she cannot help but wish for what might have been - especially when her strikingly handsome guardian angel, Malluch, returns to her life in a very corporeal form, serving as no small distraction.Malluch's mere presence is enough to stir feelings of unrest in Kenana, who holds fast to her resolve to remain faithful to her new husband. But Malluch's persistence grows, and the new princess begins to question his is he truly her guardian angel or a creature with dubious intentions?And when word reaches the palace that the Nephilim, giants sired by fallen angels and born of human women, seek to do her harm, Kenana is forced to flee the palace. Now on the run, Kenana will soon discover who's friend and who's foe. And, in one case, an unlikely guardian angel...\"The story ends with some major cliffhangers, leaving the reader with hope for a sequel to this fascinating book. I know I will be looking forward to it!\" —Kwips and Kritiques on Summer Lee's Angel Heart\"Congratulations to Mrs. Lee for a moving conclusion to a wonderful series!\" —Wild On Books on Summer Lee's Kindred Spirits\"Kindred Spirits is a deeply moving and fascinating look at life before the Great Flood. I loved this book!\" —J.R. Rain, author of Moon Dance and The Body Departed\"Thrilling, adventurous, and deeply romantic!\" —Elaine Babich, author Relatively Normal and You Never Called Me Princess\"Angel Heart is well written and imbues all the flavor of ancient times but in modern easy-to-read language. The history is well-researched but helps, rather than hinders, the story, as the past comes alive on pages of a young woman's heart. Five stars.\" —Eve Paludan, author of Witchy Business and Taking Back Tara",
  "genres": [
    "Romance",
    "Historical",
    "Historical Fiction",
    "Amazon"
  ],
  "author": "Verna Hargrove",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/9574781-angel-heart"
}