{
  "title": "American Diplomacy",
  "description": "For more than sixty years, George F. Kennan’s American Diplomacy has been a standard work on American foreign policy. Drawing on his considerable diplomatic experience and expertise, Kennan offers an overview and critique of the foreign policy of an emerging great power whose claims to rightness often spill over into self-righteousness, whose ambitions conflict with power realities, whose judgmentalism precludes the interests of other states, and whose domestic politics frequently prevent prudent policies and result in overstretch. Keenly aware of the dangers of military intervention and the negative effects of domestic politics on foreign policy, Kennan identifies troubling inconsistencies in the areas between actions and ideals—even when the strategies in question turned out to be decided successes.In this expanded sixtieth-anniversary edition, a substantial new introduction by John J. Mearsheimer, one of America’s leading political realists, provides new understandings of Kennan’s work and explores its continued resonance. As America grapples with its new role as one power among many—rather than as the “indispensable nation” that sees “further into the future”—Kennan’s perceptive analysis of the past is all the more relevant. Today, as then, the pressing issue of how to wield power with prudence and responsibility remains, and Kennan’s cautions about the cost of hubris are still timely. Refreshingly candid, American Diplomacy cuts to the heart of policy issues that continue to be hotly debated today.“These celebrated lectures, delivered at the University of Chicago in 1950, were for many years the most widely read account of American diplomacy in the first half of the twentieth century.”— Foreign Affairs, Significant Books of the Last 75 Years",
  "genres": [
    "History",
    "Politics",
    "International Relations",
    "Nonfiction",
    "American History",
    "Political Science",
    "American"
  ],
  "author": "George F. Kennan",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/13212137-american-diplomacy"
}