{
  "title": "M. Butterfly",
  "description": "Winner of the Tony Award for Best Play, nominated for the Pulitzer Prize for Drama, and soon to be back on Broadway in a revival directed by the Lion King's Julie Taymor, starring Clive Owen \"A brilliant play of ideas... a visionary work that bridges the history and culture of two worlds.\"--Frank Rich, New York TimesBased on a true story that stunned the world, and inspired by Giacomo Puccini's opera Madama Butterfly, M. Butterfly was an immediate sensation when it premiered in 1988. It opens in the cramped prison cell where diplomat Rene Gallimard is being held captive by the French government--and by his own illusions. He recalls a time when Song Liling, the beautiful Chinese diva, touched him with a love as vivid, as seductive--and as elusive--as a butterfly.How could he have known that his true love was, in fact, a spy for the Chinese government--and a man disguised as a woman? The diplomat relives the twenty-year affair from the temptation to the seduction, from its consummation to the scandal that ultimately consumed them both.M. Butterfly is one of the most compelling, explosive, and slyly humorous dramas ever to light the Broadway stage, a work of unrivaled brilliance, illuminating the conflict between men and women, the differences between East and West, racial stereotypes--and the shadows we cast around our most cherished illusions.The original cast included John Lithgow as Gallimard and BD Wong as Song Liling. During the show's 777-performance run, David Dukes, Anthony Hopkins, Tony Randall, and John Rubinstein were also cast as Gallimard. Hwang adapted the play for a 1993 film directed by David Cronenberg, starring Jeremy Irons and John Lone.TEXT OF THE BROADWAY REVIVAL",
  "genres": [
    "Plays",
    "Drama",
    "Fiction",
    "Classics",
    "School",
    "Theatre",
    "Historical Fiction"
  ],
  "author": "David Henry Hwang",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/95833.M_Butterfly"
}