{
  "title": "The Floor of Heaven: A True Tale of the Last Frontier & the Yukon Gold Rush",
  "description": "New York Times bestselling author Howard Blum expertly weaves together three narratives to tell the true story of the 1897 Klondike Gold Rush.It is the last decade of the 19th century. The Wild West has been tamed and its fierce, independent and often violent larger-than-life figures--gun-toting wanderers, trappers, prospectors, Indian fighters, cowboys, and lawmen--are now victims of their own success. But then gold is discovered in Alaska and the adjacent Canadian Klondike and a new frontier suddenly looms: an immense unexplored territory filled with frozen waterways, dark spruce forests, and towering mountains capped by glistening layers of snow and ice.In a true-life tale that rivets from the first page, we meet Charlie Siringo, a top-hand sharp-shooting cowboy who becomes one of the Pinkerton Detective Agency's shrewdest; George Carmack, a California-born American Marine who's adopted by an Indian tribe, raises a family with a Taglish squaw, and makes the discovery that starts off the Yukon Gold Rush; and Jefferson \"Soapy\" Smith, a sly and inventive conman who rules a vast criminal empire. As we follow this trio's lives, we're led inexorably into a perplexing mystery: a fortune in gold bars has somehow been stolen from the fortress-like Treadwell Mine in Juneau, Alaska. Charlie Siringo discovers that to run the thieves to ground, he must embark on a rugged cross-territory odyssey that will lead him across frigid waters and through a frozen wilderness to face down \"Soapy\" Smith and his gang of 300 cutthroats. Hanging in the balance: George Carmack's fortune in gold.At once a compelling true-life mystery and an unforgettable portrait of a time in America's history, The Floor of Heaven is also an exhilarating tribute to the courage and undaunted spirit of the men and women who helped shape America.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Canada",
    "True Crime",
    "Crime",
    "Westerns"
  ],
  "author": "Howard Blum",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/9581463-the-floor-of-heaven"
}