{
  "title": "Il diamante dell'harem",
  "description": "Venezia 1604. Una gondola fende l'acqua nera come il petrolio. La lanterna dell'imbarcazione illumina fiocamente il volto pensieroso di Paul Pindar, mercante dell'onorevole Compagnia del Levante. L'uomo si trova ormai a Venezia da diversi mesi e consuma le sue notti e il suo denaro tra gioco d'azzardo e cortigiane. Ma niente riesce a fargli dimenticare Celia, la sua promessa sposa, rapita dai turchi per la pelle di luna e i biondi capelli. La sua bellezza l'ha resa una delle favorite del sultano. Ma ora il suo destino è sconosciuto. Nessuno sa se sia ancora rinchiusa tra i cancelli dorati dell'harem di Costantinopoli, un mondo proibito e impenetrabile, o se sia scomparsa per sempre.Eppure, proprio quando Paul ha quasi perso la speranza di reincontrarla, ecco che fra i vicoli veneziani inizia a serpeggiare una voce sempre più insistente. Si dice che in città sia nascosta una misteriosa pietra, L'Azzurro del sultano, un diamante blu dal valore inestimabile appartenuto al sovrano di Costantinopoli. Pindar non ha dubbi: deve imposessarsene a tutti i costi. È convinto che il gioiello lo ricondurrà in qualche modo a Celia. Ma la strada è irta di pericoli. Perché molti altri sono disposti a uccidere pur di averlo.L'unica in grado di aiutarlo è Annetta, una monaca che si trova in un convento di clausura nella laguna veneziana. La ragazza non è una suora come tutte le altre. Il suo è un passato oscuro, indissolubilmente legato all'harem. Pindar deve incontrarla e parlarle, almeno una volta. Niente è come sembra tra gli intricati corridoi del convento e dietro le grate delle celle monacali, che nascondono pericoli, trame silenziose e lotte di potere. E mentre l'ossessione del mercante per il misterioso diamante aumenta sempre più, diventa chiaro che ci sono altre forze segrete in gioco. Il diamante è reale, o si tratta solo di un tranello per trascinarlo verso la rovina?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Italy",
    "Mystery",
    "Romance",
    "Adult Fiction"
  ],
  "author": "Katie Hickman",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/10352620-il-diamante-dell-harem"
}