{
  "title": "Sleeping With the Dictionary",
  "description": "Harryette Mullen's fifth poetry collection, Sleeping with the Dictionary, is the abecedarian offspring of her collaboration with two of the poet's most seductive writing partners, Roget's Thesaurus and The American Heritage Dictionary. In her ménage à trois with these faithful companions, the poet is aware that while Roget seems obsessed with categories and hierarchies, the American Heritage, whatever its faults, was compiled with the assistance of a democratic usage panel that included black poets Langston Hughes and Arna Bontemps, as well as feminist author and editor Gloria Steinem. With its arbitrary yet determinant alphabetical arrangement, its gleeful pursuit of the ludic pleasure of word games (acrostic, anagram, homophone, parody, pun), as well as its reflections on the politics of language and dialect, Mullen's work is serious play. A number of the poems are inspired or influenced by a technique of the international literary avant-garde group Oulipo, a dictionary game called S+7 or N+7. This method of textual transformation--which is used to compose nonsensical travesties reminiscent of Lewis Carroll's \"Jabberwocky\"--also creates a kind of automatic poetic discourse.Mullen's parodies reconceive the African American's relation to the English language and Anglophone writing, through textual reproduction, recombining the genetic structure of texts from the Shakespearean sonnet and the fairy tale to airline safety instructions and unsolicited mail. The poet admits to being \"licked all over by the English tongue,\" and the title of this book may remind readers that an intimate partner who also gives language lessons is called, euphemistically, a \"pillow dictionary.\"",
  "genres": [
    "Poetry",
    "African American",
    "College",
    "Language",
    "The United States Of America",
    "United States",
    "Read For School"
  ],
  "author": "Harryette Mullen",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/95874.Sleeping_With_the_Dictionary"
}