{
  "title": "Destined for Divinity",
  "description": "***This is an epic saga, in which each book averages 230,000 words in length (the equivalent of 4 - 5 typical novels)Sindy is a vampiress of little morals and large aspirations...or at least, the old Sindy was. Love and friendship are becoming more important to her, and after becoming an accomplice to kidnapping and an agent of betrayal, she would be willing to settle for escaping the tangled web she has woven without getting herself dusted.Felicity is being held for a ransom that no one of sound moral conscience should be willing to pay. Coven Master Arif, a vampire whose terrifying talent of mind-control holds her more tightly than chains, wants control of The United One; Alyson. A vampire of great power unlike any other, Alyson is a good friend to Felicity and a dear covenmate of... Cain, a vampire who declared his love for Felicity, but left her to fulfill her dreams of having a human family. Since renouncing his vampiric tendencies, Cain’s existence has been one of self-sacrifice and benevolence. To rescue Felicity, he would have to betray Alyson and endanger the world, an act that would torture his conscience for eternity. Perhaps Felicity’s husband Ben can rescue her, but to ensure Felicity’s safety he would have to play by Arif’s rules. Is Ben willing to make a deal with the devil to retrieve his wife? Or should he put his differences aside to try and work with Cain, his former rival, to find a solution? Cain may be able to help rescue Felicity, but is he willing to give her up...again? Alyson has never been one to meekly follow others. Is it time for The United One to take a stand of her own? Her blood dictates that her divine destiny is to rule vampire-kind. Maybe it is time to lay down some rules! A battle is sure to ensue...can Alyson protect everyone she loves? Will Felicity survive Arif’s wrath to keep her life...and her humanity, or when all is said and done, will she find herself ALMOST HUMAN?",
  "genres": [
    "Paranormal",
    "Vampires"
  ],
  "author": "Melanie Nowak",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/9586690-destined-for-divinity"
}