{
  "title": "ثلج",
  "description": "ركام يخفي ما تحته , و ثلج يغطي رماد المدينة.هكذا تبدو كارس -إحدى مدن الأناضول - بعيدة كل البعد عن استانبول، غارقة في الفقر و الانقسامات السياسية و البؤس.تاريخها المضطرب يتمور تحت أكوام البياض.لها من العثمانيين و الأرمن بعض الآثار و لها من الروس و الأتراك ما تبقى من نزف البشر.لم تكن رحلة ( كا) رحلة عادية. ف ( كا) شاعر موهوب، شيوعي و يساري، تم نفيه من تركيا قبل رحلته إلى كارس بعشر سنوات .عاد إلى استانبول بعد حصوله على اللجوء السياسي من ألمانيا لحضور جنازة أمه .و أثناء وجوده في المدينة يتم تكليفه - من صحيفة معروفة في استانبول - بزيارة كارس و بالتحري عن موجة الانتحار التي قامت بها بعض فتيات المدينة المحجبات ، و يطلب منه أيضا تغطية انتخابات البلدة و التي يتوقع فوز الإسلاميين فيها. أيبك يا أيبكلم تكن حب حياته ، كانت زميلته فقط أيام الدراسة . ما يذكره بها هو جمالها الخاص و جاذبيتها الملحة. تزوجها أحد رفاقه و كانت قد انفصلت عنه حديثا.حين علم بوجودها في كارس،تحمس للذهاب إليها و استحوذت عليه صورتها.كا يعاني من الوحدة و الفراغ ، و ماء شعره قد جف لسنوات ، و مع المنفى لفه الحزن كيفما توجه.الموات هو ما يعيشه. فلماذا لا يلجأ إليها ؟ لماذا لا يتزوجها و يعود بها إلى فرانكفورت؟ هذا الهاجس يدفع به إلى كارس النائية دفعا، و أثناء ذهابه تتعرض المدينة لعاصفة ثلجية تضطره للإقامة لمدة ثلاثة أيام في نزل يملكه والد أيبك و يديره .و يرى أيبك.. أجمل مما يذكر، أشهى مما يحلم !!و كما تنهمر ثلوج كارس على ساكنيها ، تنجرف في قلبه سيول من الحب!! يعيش معها علاقة قصيرة ترسم له حياة سعيدة للحظات، و يظل يجترها لسنوات عدة بعد عودته إلى ألمانيا.أيبك لها أخت ( كاديفي) تصغرها بأعوام عدة و تتزعم حركة الفتيات المتحجبات اللاتي يرفضن نزع الحجاب عن رؤوسهن و مقايضته بحق التعليم.و بين أيبك التي تنفصل عن زوجها بسبب انتمائه للإسلاميين و مطالبته لها بالحجاب ، و كاديفي ابنة أحد أعلام العلمانيين و التي تغطي رأسها ، تدور أسئلة لا تنتهي عن من تكون ، و كيف تكون ، و لماذا تكون نسيج وحدك .",
  "genres": [
    "Fiction",
    "Literature",
    "Contemporary",
    "Turkish",
    "Historical Fiction",
    "Turkish Literature",
    "Novels"
  ],
  "author": "Orhan Pamuk",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/9586177"
}