{
  "title": "Vince Flynn Collectors' Edition #1: Term Limits, Transfer of Power, and The Third Option",
  "description": "In this special collectors’ edition, relive the action in Vince Flynn's #1 New York Tmes bestselling political Term Limits , Transfer of Power, and The Third Option.Term LimitsIn one bloody night, three of Washington’s most powerful politicians are executed with surgical precision. Their assassins then deliver a shocking set aside partisan politics and restore power to the people. A joint FBI-CIA task force reveals the killers are elite military commandos. Only Michael O'Rourke, a former U.S. Marine and freshman congressman, holds a clue to the a haunting incident in his own past with explosive implications for his country's future.Transfer of PowerOn a busy Washington morning, the stately calm of the White House is shattered as terrorists gain control of the executive mansion, slaughtering dozens of people, taking hundreds hostage, and threatening the life of the president. One man is sent in to take control of the crisis. Mitch Rapp, the CIA's top counterterrorism operative, makes a chilling discovery that could rock Washington to its someone within his own government wants his rescue attempt to fail.The Third OptionCIA counterterrorism operative Mitch Rapp falls prey to government forces with an agenda of their own after Dr. Irene Kennedy is named the successor to dying CIA Director Thomas Stansfield -- a choice that enrages many inside the world's most powerful intelligence agency. Her detractors will resort to extreme measures to prevent her from taking the reins, which makes Rapp an expendable asset. But Mitch Rapp is no one's pawn, and he will stop at nothing to find out who has set him up.These special collectors’ edition hardcover books are bound in premium bonded leather with foil stamping.",
  "genres": [
    "Thriller",
    "Fiction"
  ],
  "author": "Vince Flynn",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/9586680-vince-flynn-collectors-edition-1"
}