{
  "title": "Cupcakes, Lies, and Dead Guys",
  "description": "CUPCAKES, LIES, AND DEAD GUYS - #2 Kindle BESTSELLER in Hot New Releases - Ghost Fiction. Moving from Wisconsin to sunny Los Angeles was the frosting on the cake of Annie Graceland's perfect life. Her boutique bakery business was blossoming, she was happily married to a handsome, ambitious actor, and they were planning to have a baby. Besides her derelict friends, the only thing that got Annie in serious trouble was her smidge of psychic feeling other people's sensations in her own body. She hated experiencing someone else's peanut butter addiction, foot fetish, or murderous rage. Thank God, her psychic curse only kicked in when she was stressed. When Annie discovers her husband is possibly cheating with oh-so-famous, self-help author, Dr. Fuller. Fuller ends up dead, poisoned with one of Annie's signature cupcakes, and she becomes a prime murder suspect. When the not-so-good Doctor's ghost doesn't pass to the After-Life and is stuck on earth, Fuller decides to recruit, (aka, haunt), a live personal assistant to investigate and bring his killer to justice. Who better to help than Annie? Now Annie is not only stuck with the most irritating ghost in the world, but is forced to spy on, and infiltrate the lives of Hollywood's elite; the motley crew of suspects who wanted Fuller dead. Was it the porn star, the trophy wife, the talent manager, the personal trainer? Will Annie survive the L.A. whackos who wanted Fuller dead before she is whacked by the real killer? Check out the next   Cupcakes, Sales, and Cocktails - A Novella (99 cents!)Annie's re-entering the dating world and her friends push her to \"sex-up,\" her wardrobe. At Snotsky's Department Store sale, Annie meets and squares off against the world's most obnoxious Edith Flowers. When Edith's murdered and doesn't pass to the After-Life, Annie agrees to investigate her demise. With Edith's help, Annie infiltrates the crew of Snotsky's suspects. Was the killer the new manager, the archrival in cocktail attire, the bra fitter? Will Annie solve Edith's murder so she can go to the light? Will she find anything new to wear that she can afford? Can Annie resolve her latest debacle before hottie Detective Rafe Campillio finds it odd she keeps showing up at murder scenes? First chapter excerpt from  Cupcakes, Pies, and Hot Guys ! (Next novel in the series.)   Check out Pamela DuMond's new novel,  The Messenger's Handbook , a Young Adult romantic thriller. Kindle only $2.99.   What if you discovered that your soul mate lived three centuries before you were even born? Sixteen year old Madeline learns that falling in love, and falling through time doesn't have to be accidental, could be deadly, but is worth the fight of her life.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Chick Lit",
    "Paranormal",
    "Humor",
    "Fiction",
    "Mystery Thriller"
  ],
  "author": "Pamela DuMond",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/9591625-cupcakes-lies-and-dead-guys"
}