{
  "title": "The Narrative of Arthur Gordon Pym of Nantucket",
  "description": "The Narrative of Arthur Gordon Pym of Nantucket is a novel written by Edgar Allan Poe, first published in 1838. The story follows the adventures of Arthur Gordon Pym, a young man from Nantucket who stows away on a whaling ship, the Grampus, with his friend Augustus. They encounter various dangers and hardships on their journey, including mutiny, starvation, and encounters with hostile natives. As the story progresses, Pym and Augustus are rescued by a passing ship, the Jane Guy, but their troubles are far from over. They become stranded on an island inhabited by a mysterious tribe, and their attempts to escape lead them into even greater danger. Eventually, Pym is the only one left alive, and he is forced to make a desperate bid for survival.The Narrative of Arthur Gordon Pym of Nantucket is a gripping tale of adventure and survival, filled with vivid descriptions of life at sea and the harsh realities of the whaling industry. It is also notable for its exploration of themes such as isolation, madness, and the limits of human endurance. Despite being one of Poe's lesser-known works, it has been praised for its imaginative storytelling and its influence on later writers such as Jules Verne and H.P. Lovecraft.A strong hand held him on the cabin floor, with a tight grasp upon his throat--still he was able to see what was going on around him. His father was tied hand and foot, and lying along the steps of the companion-way with his head down, and a deep wound in the forehead, from which the blood was flowing in a continued stream. He spoke not a word, and was apparently dying. Over him stood the first mate, eying him with an expression of fiendish derision, and deliberately searching his pockets, from which he presently drew forth a large wallet and a chronometer.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Fiction",
    "Horror",
    "Adventure",
    "Gothic",
    "19th Century",
    "Literature",
    "Fantasy"
  ],
  "author": "Edgar Allan Poe",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/9596841-the-narrative-of-arthur-gordon-pym-of-nantucket"
}