{
  "title": "The Ultimate Foundation of Economic Science: An Essay on Method",
  "description": "Written toward the end of Mises’s life, his last monograph, \nThe Ultimate Foundation of Economic Science,\n returned to economics as a science based on human action. Mises believed that, since the publication of Human Action, economists and scientists alike had misinterpreted the idea of economics as a science by deeming it epistemological positivism—that they believed that the “science” basis was still more rooted in philosophy than in actual science.In this volume, Mises argued that economics is a science because human action is a natural order of life and that it is the actions of humans that determine markets and capital decisions. Since Mises believed these links could be proven scientifically, he concluded that economics, with its basis on that human action, is indeed a science in its own right and not an ideology or a metaphysical doctrine.What has been described as his most passionate work, \nThe Ultimate Foundation of Economic Science\n brings together all of the themes from Mises’s previous works to proclaim what Israel Kirzner calls “the true character of economics.”Ludwig von Mises (1881–1973) was the leading spokesman of the Austrian School of Economics throughout most of the twentieth century. He earned his doctorate in law and economics from the University of Vienna in 1906. In 1926, Mises founded the Austrian Institute for Business Cycle Research. From 1909 to 1934, he was an economist for the Vienna Chamber of Commerce. Before the Anschluss, in 1934 Mises left for Geneva, where he was a professor at the Graduate Institute of International Studies until 1940, when he emigrated to New York City. From 1948 to 1969, he was a visiting professor at New York University.Bettina Bien Greaves is a former resident scholar, trustee, and longtime staff member of the Foundation for Economic Education. She has written and lectured extensively on topics of free market economics. Her articles have appeared in such journals as Human Events, Reason, and The Freeman: Ideas on Liberty. A student of Mises, Greaves has become an expert on his work in particular and that of the Austrian School of economics in general. She has translated several Mises monographs, compiled an annotated bibliography of his work, and edited collections of papers by Mises and other members of the Austrian School.",
  "genres": [
    "Economics",
    "Philosophy",
    "Nonfiction",
    "History",
    "Science"
  ],
  "author": "Ludwig von Mises",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/95934.The_Ultimate_Foundation_of_Economic_Science"
}