{
  "title": "The Crystal Variation",
  "description": "From Book 1: Thirty‑three shorter tales of the Liaden Universe® brought together for the first time in two mega‑volumes.  Seventeen tales to start with in Volume One!The nationally best‑selling Liaden Universe® novels are treasured by space opera aficionados for their wit, world‑building, strong characterizations, tender romance, and edge‑of‑the‑chair action.Since 1995, Sharon Lee and Steve Miller also created shorter tales, illuminating additional facets of the Liaden experience. Here is a vast tapestry of tales of the scouts, artists, traders, priestesses, sleight of hand magicians, and pilots who fill the Liaden Universe® with the excitement, action, and romance that readers of the hit series have come to adore. At the publisher's request, this title is sold without DRM (Digital Rights Management).Maine-based writers Sharon Lee and Steve Miller teamed up in the late 80s to bring the world the story of Kinzel, a inept wizard with a love of cats, a thirst for justice, and a staff of true power. Since then, the husband-and-wife team have written dozens of short stories, and eighteen novels, most set in their star-spanning Liaden Universe®. Before settling down to the serene and stable life of a science fiction and fantasy writer, Steve was a traveling poet, a rock-band reviewer, reporter, and editor of a string of community newspapers. Sharon, less adventurous, has been an advertising copywriter, copy editor on night-side news at a small city newspaper, reporter, photographer, and book reviewer. Both credit their newspaper experiences with teaching them the finer points of collaboration. Sharon and Steve passionately believe that reading fiction ought to be fun, and that stories are entertainment.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Space",
    "Fantasy",
    "Romance",
    "Science Fiction Fantasy"
  ],
  "author": "Sharon Lee",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/9591501-the-crystal-variation"
}