{
  "title": "Solitary",
  "description": "“Fresh and ferocious, Lockdown will hook boys with its gritty, unrelenting surprises.” ―James Patterson, for Lockdown (Escape from Furnace Book 1)Alex tried to escape.He had a perfect plan.He was almost free. Even felt the cool, clean air on his face.Then the dogs came.Now he's locked in a place so gruesome―so hellish―that escape doesn't even matter.He just wants to survive.Alex Sawyer and his mates should have known there was no way out of Furnace Penitentiary.Their escape attempt only lands them deeper in the guts of this prison for young offenders, and then into solitary confinement. And that's where a whole new struggle begins--a struggle not to let the hellish conditions overwhelm them.Because before another escape attempt is even possible, they must first survive the nightmare that now haunts their endless nights.Praise for Solitary :“Fast paced and packed with nail-biting scenarios . . . This is a dark story with a dark ending, but the gritty action and compelling characters will have reluctant readers enthralled.” ― School Library Journal“Once again, Smith has created a thrill ride that will leave the audience wanting more. Smith's prose is fast paced, witty, and sometimes downright terrifying. Some of the images he creates could manifest into a nightmare or two. Teens who are looking for a great thriller/horror story will definitely want to pick up these novels.” ― VOYA“Adrenaline-fueled action infuses the narrative as it did in Lockdown (2009), keeping the pages turning. . . . The author knows what keeps his readers locked to the page and delivers it soundly.” ― Kirkus Reviews\"Breathlessly paced.\" --BooklistPraise for Lockdown :“Fresh and ferocious, Lockdown will hook boys with its gritty, unrelenting surprises.” ― James Patterson“Furnace is hotter than hell and twice as much fun! Sign me up for a life sentence of Alexander Gordon Smith!” ― Darren Shan, author of the Demonata seriesAlso by Alexander Gordon The Devil's Engine seriesThe Devil's Hellraisers (Book 1)The Devil's Hellfighters (Book 2)The Devil's Hellwalkers (Book 3)The FuryThe Escape from Furnace seriesLockdown (Book 1)Solitary (Book 2)Death Sentence (Book 3)Fugitives (Book 4)Execution (Book 5)",
  "genres": [
    "Young Adult",
    "Horror",
    "Science Fiction",
    "Dystopia",
    "Fiction",
    "Thriller",
    "Fantasy"
  ],
  "author": "Alexander Gordon Smith",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/9591447-solitary"
}