{
  "title": "A Heckuva Job: More of the Bush Administration in Rhyme",
  "description": "Somehow, despite everything Calvin Trillin wrote about the Bush Administration in Obliviously On He Sails, his 2004 bestseller in verse, George W. Bush is still in the White House. Taking a philosophical view, Trillin has said, “We weren’t going to know whether you could bring down a presidency with iambic pentameter until somebody tried it.”Now Trillin is trying again, back at his pithy and hilarious best to comment on the President’s decision to go to war in Iraq (“Then terrorists could count on what we’d / Attack us, we’ll strike back, though not at you”), his religiosity (“He treats his critics in the press / As if they’re yapping Pekineses. / Reporters deal in mundane facts; / This man has got the word from Jesus”), and whether he was wearing a transmitting device in the first presidential debate (“Could this explain his odd expressions? Is there proof he / Was being told, ‘If you can hear me now, look goofy’?”)Trillin deals with the people around Bush, such as Nanny Dick Cheney and Mushroom Cloud Rice and Orange John Ashcroft and Orange John’s successor, Alberto Gonzales (“The A.G.’s to be one Alberto Gonzales– / Dependable, actually loyal über alles”). He tries to predict the behavior of the famously intemperate John Bolton as ambassador to the United Nations in poems with titles like “Bolton Chases French Ambassador Up Tree” and “White House Says Bolton Can Do Job Even While in Straitjacket.”Finally, in dealing with whether the entire Bush Administration, like the unfortunate Brownie, has done a heckuva job, he composes a small-government sea chantey for the ’Cause government’s the problem, lads,Americans would all do well to shun it.Yes, government’s the problem, lads.At least it is when we’re the ones who run it.",
  "genres": [
    "Poetry",
    "Politics",
    "Nonfiction",
    "Humor",
    "History"
  ],
  "author": "Calvin Trillin",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/95967.A_Heckuva_Job"
}