{
  "title": "Petrodollar Warfare: Oil, Iraq and the Future of the Dollar",
  "description": "The invasion of Iraq may well be remembered as the first oil currency war. Far from being a response to 9/11 terrorism or Iraq’s alleged weapons of mass destruction, Petrodollar Warfare argues that the invasion was precipitated by two converging the imminent peak in global oil production and the ascendance of the euro currency. Energy analysts agree that world oil supplies are about to peak, after which there will be a steady decline in supplies of oil. Iraq, possessing the world’s second-largest oil reserves, was therefore already a target of US geostrategic interests. Together with the fact that Iraq had switched to paying for oil in euros—rather than US dollars—the Bush administration’s unreported aim was to prevent further OPEC momentum in favor of the euro as an alternative oil transaction currency standard. Meticulously researched, Petrodollar Warfare examines US dollar hegemony and the unsustainable macroeconomics of ‘petrodollar recycling,’ pointing out that the issues underlying the Iraq war also apply to geostrategic tensions between the United States and other countries, including the member states of the European Union, Iran, Venezuela and Russia. The author warns that without changing course, the American experiment will end the way all empires end—with military overextension and subsequent economic decline. He recommends the multilateral pursuit of both energy and monetary reforms within a UN framework to create a more balanced global energy and monetary system—thereby reducing the possibility of future oil and oil currency-related warfare. A sober call for an end to aggressive US unilateralism, Petrodollar Warfare is a unique contribution to the debate about the future global political economy. William R. Clark is manager of performance improvement at Johns Hopkins University School of Medicine. His research on oil depletion, oil currency issues and US geostrategy received a 2003 Project Censored Award and was published in Censored 2004 . He lives in Columbia, Maryland.",
  "genres": [
    "Politics",
    "Economics",
    "Nonfiction",
    "History",
    "War"
  ],
  "author": "William R.  Clark",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/95977.Petrodollar_Warfare"
}