{
  "title": "Two Minute Orgasm",
  "description": "Answering a bizarre newspaper ad at a research clinic, Janine Taylor’s life is turned topsy-turvy when she agrees to be a test subject for a study on extending the length of orgasms for women. Caught in a debauched world of sexual nirvana, Janine, soon becomes their star pupil. Can she go back to her old life? Given the choice would she even want to.  Warning: Some may find Two Minute Orgasm offensive.  Approx. 21000 words, 130 pages ________________________________ EXCERPT I laid on the gurney about thirty seconds before he returned. My palms were clammy. I tittered nervously. It looks like the doctor is going to tickle my fancy.  He slipped in wearing a reassuring smile. “Okay, I’m going to reach under the sheet and do things to you similar to what your gynecologist would do. The only difference is I’m going to make you feel good. Hopefully, good enough to make you climax. I watched him pull latex gloves onto his good-sized hands. Then they disappeared from view and I felt them on my thighs.  My mouth was dry and my heart started beating hard and fast. As his hand moved up my thigh to the juncture of leg and body, I stiffened. So far, everything felt good, but my nervousness increased having a strange man’s hands near my goodie box, even if he was a doctor.  “I can tell you’re jumpy, so I’m going to do this slow and easy. I want you to know I’ve done this numerous times. It’s my profession and I’m very good at it. So good, I’ve never failed to bring on an orgasm. Are you ready?”  My breathing had become stilted. “Yes,” I said in breathy voice.  His right hand slid over my mound. I gasped when his thumb hung over the edge and rubbed the length of my clitoral sheath. “Ooh,” I said, as tickly little tendrils of pleasure threaded their way throughout my torso. I gasped as his thumb moved the very tip of my protuberance. Concentrating on my clit, it seemed grow in size and sensitivity. As my pleasure purred from within, heat and dampness built within my core. His thumb wandered down and back transferring some of the lubricating juices, which had formed near my opening, to my little pearl. With his thumb slick with my crème, each stroke sent tingly sensations crashing through my wriggling body. After warming my love bud, I felt his other hand glide into position at the rim of my moist recess. I sensed heat and wetness building in my pussy in anticipation of his fingers.  Suddenly, there was a knock on the door and another man in a physician’s smock looked in. “Ah, there you are.”  “Robbie, come in. Janine, this is my colleague, Robin McDonald.”  He stepped in and offered his hand. “Hi, I’m pleased to meet you. We’re on a casual basis here so everyone calls me Robbie. I believe we talked on the phone, yesterday. It’s always nice to get new subjects. Especially, pretty ones like you.”  Rolling my eyes at the thought of meeting another man in this compromising position, I shook his hand. He was every bit as handsome as Dr. Charles, with brown eyes and dark hair graying at the temples. “Janine Taylor. I’m pleased to meet you, doctor.”  “What area are you volunteering for?”  “I came for the orgasm portion, but since it’s full, Dr. Charles is testing me, for other study groups, until I can get into orgasms.”  Robbie glanced at his colleague. “Like what, Charlie, fellatio, toys, anal, bond…”  I noticed Charlie subtly shake his head. “We’re not sure.",
  "genres": [
    "Erotica",
    "BDSM"
  ],
  "author": "La Marchesa",
  "average_rating": "3.03",
  "url": "https://www.goodreads.com/book/show/9607898-two-minute-orgasm"
}