{
  "title": "In Search of Human Nature: The Decline and Revival of Darwinism in American Social Thought",
  "description": "Winner of the Pulitzer Prize in History in 1972, and a past president of both the Organization of American Historians and the American Historical Association, Carl Degler is one of America's most eminent living historians. He is also one of the most versatile. In a forty year career, he has written brilliantly on race ( Neither Black Nor White , which won the Pulitzer Prize), women's studies ( At Odds , which Betty Friedan called \"a stunning book\"), Southern history ( The Other South ), the New Deal, and many other subjects. Now, in The Search for Human Nature , Degler turns to perhaps his largest subject yet, a sweeping history of the impact of Darwinism (and biological research) on our understanding of human nature, providing a fascinating overview of the social sciences in the last one hundred years.The idea of a biological root to human nature was almost universally accepted at the turn of the century, Degler points out, then all but vanished from social thought only to reappear in the last four decades. Degler traces the early history of this idea, from Darwin's argument that our moral and emotional life evolved from animals just as our human shape did, to William James's emphasis on instinct in human behavior (then seen as a fundamental insight of psychology). We also see the many applications of biology, from racism, sexism, and Social Darwinism to the rise of intelligence testing, the eugenics movement, and the practice of involuntary sterilization of criminals (a public policy pioneered in America, which had sterilization laws 25 years before Nazi Germany--one such law was upheld by Oliver Wendell Holmes's Supreme Court). Degler then examines the work of those who denied any role for biology, who thought culture shaped human nature, a group ranging from Franz Boas,Ruth Benedict, and Margaret Mead, to John B. Watson and B.F. Skinner. Equally important, he examines the forces behind this fundamental shift in a scientific paradigm, arguing that ideological reasons--especially the struggle against racism and sexism in America--led to this change in scientific thinking. Finally, Degler considers the revival of Darwinism without the Social Darwinism, racism, and sexism, led first by ethologists such as Karl von Frisch, Nikolaas Tinbergen, Konrad Lorenz, and Jane Goodall--who revealed clear parallels between animal and human behavior--and followed in varying degrees by such figures as Melvin Konner, Alice Rossi, Jerome Kagen, and Edward O. Wilson as well as others in anthropology, political science, sociology, and economics.What kind of animal is Homo sapiens and how did we come to be this way? In this wide ranging history, Carl Degler traces our attempts over the last century to answer these questions. In doing so, he has produced a volume that will fascinate anyone curious about the nature of human beings.",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "Anthropology",
    "Sociology",
    "Psychology",
    "Evolution"
  ],
  "author": "Carl N. Degler",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/959733.In_Search_of_Human_Nature"
}