{
  "title": "Journey Of A Hope Merchant: From Apartheid To The Elite World Of Solo Yacht Racing",
  "description": "Seemingly the most unlikely of men to compete in the elite sport of world-class yachting, Neal Petersen has lived a modern-day adventure that affirms one can overcome adversity with determination and hard work. Of mixed race, Petersen was born physically disabled and impoverished in apartheid-era South Africa, where he found healing and equality in the turbulent waters surrounding Cape Town. Petersen dreamed of building his own boat and of sailing in the great solo races of the world. Journey of a Hope Merchant recounts the epic journey that took him from a racially segregated neighborhood to the prestigious BOC Challenge and ultimately to a place in history as the first black man to race solo around the globe. Petersen’s thrilling narrative places him among the ranks of such famous sailors as Joshua Slocum and Sir Francis Chichester. Petersen describes mining for diamonds underwater; rounding Cape Horn; surviving near-fatal accidents, killer storms, and a mid-Atlantic collision; capsizing in the Roaring Forties; and overcoming heartbreak, loneliness, continual financial difficulties, and adversity at every turn. His heroic experiences illustrate the incredible resourcefulness required of a sailor, especially one alone at the helm of a homemade boat. His gripping account of the 1998–99 Around Alone race, made famous by the mid-ocean rescue of the French sailor Isabelle Autissier, will become a classic of nautical writing. While Petersen sailed his boat alone, his story extends beyond himself. He describes the unforgettable individuals who have sustained him—an activist mother, a generous community of Irish citizens, a cadre of eminent sailors including his mentor Harry Mitchell, and the woman who ultimately ended their relationship because Petersen chose to follow his dreams of sailing. Written with a freshness and style that reflect his unstoppable optimism, the story of Petersen’s compelling journey is a testament to endurance, survival, perseverance, and ingenuity. His autobiography vividly portrays both the sacrifice and joy entangled in this love affair with the sea. Journey of a Hope Merchant is proof that the harshest lessons learned at sea apply to all aspects of life and that even the wildest dreams are attainable.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Neal Petersen",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/1321814.Journey_Of_A_Hope_Merchant"
}