{
  "title": "Blood and Champagne: The Life and Times of Robert Capa",
  "description": "Robert Capa was arguably the finest photojournalist of the twentieth century and without doubt its greatest combat photographer-he covered every major conflict from the Spanish Civil War to the beginnings of Vietnam. An inveterate gambler who coined the dictum \"if your pictures aren't good enough, you're not close enough,\" Capa risked his life again and again, most dramatically as the only photographer landing with the first wave on Omaha Beach on D-Day, and he created some of the most enduring images ever made with a camera.But the drama in Capa's life wasn't limited to one side of the lens. Born in Budapest as Andre Freidman, Capa fled political repression and anti-Semitism as a teenager by escaping to Berlin, where he first picked up a Leica and then witnessed the rise of Hitler. By the time his images of D-Day appeared in Life Magazine , he had become a legend, the first photographer to make his calling appear glamorous and sexy, and the model for many of the most intrepid photographers to this day. In 1947, after a decade covering war, he founded a cooperative agency-Magnum-and in the process revolutionized the industry. For the first time, photographers would retain their own copyrights and negatives, and nearly half a century later, Magnum remains the most prestigious agency of its kind.By the time he died, at just forty-one in 1954, Capa was not only the greatest adventurer in photographic history. He had become a colleague and confidant to writers Irwin Shaw, John Steinbeck, and Ernest Hemingway and director John Huston, and a seducer of several of his era's most alluring icons, including Ingrid Bergman.From Budapest in the twenties to Paris in the thirties, from post-war Hollywood to Stalin's Russia, and from New York in the fifties to Indochina, Blood and Champagne is a wonderfully evocative account of Capa's life and times. Based on extensive interviews with Capa's friends and contemporaries, as well as FBI and Soviet files and other previously unpublished materials, Alex Kershaw's biography is every bit as compelling as its charismatic subject.",
  "genres": [
    "Biography",
    "Photography",
    "Nonfiction",
    "History",
    "Journalism",
    "Biography Memoir",
    "War"
  ],
  "author": "Alex Kershaw",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/95976.Blood_and_Champagne"
}