{
  "title": "Valentine's Day Daddy",
  "description": "Ezra Ezra Mullen is the CEO of his family’s media conglomerate. He’s rich, powerful, good looking, and has been one of the most eligible bachelors in the city of Los Angeles for a while. He’s a man with unlimited wealth who’s got the world at his fingertips. The one thing he doesn’t have though, is any prospects at love. Ezra has been alone so long, he’s given up hope of ever finding anyone who can meet his lofty standards, believing he’d rather be alone than be with somebody who doesn’t tic off all the boxes on his checklist. It's ironic given that one of the companies that fall beneath the umbrella of his media group, Soulmates, is one of the premier dating sites on the Internet. At a Valentine’s Day event designed to promote Soulmates though, Ezra meets a woman who more than piques his interest. She challenges him and turns his worldview on its head. He’s never met anybody like her and he finds himself in a position to rig the system in his favor to get what he wants—but by doing so, Ezra could jeopardize his entire relationship with Ashton. If he doesn’t though, he risks losing her anyway. He finds himself asking that age old question… is it better to ask for permission or for forgiveness? Ashton Ashton Rodgers is a woman with her path in life charted out. A recent college graduate, she is getting her feet wet at an advertising agency with her eye on the bigger prize—building her own agency from the ground up. Ashton is smart, clever, and has a keen eye when it comes to putting together ad campaigns. She’s so caught up in her pursuit of her goals though, Ashton is alone in this world with no romantic prospects on the horizon. She claims to prefer it that way but deep down, she sometimes in the darkness of the night, she feels that bitter sting of loneliness. Not that her pride would ever allow her to admit that to anybody. Badgered into going to a speed dating event by her best friend, Ashton goes along just to humor her with no intention of participating. When she gets her matches though, she’s shocked to find that she has one—one she never recalled requesting a match with. But when she meets him, she finds herself intrigued. And from there, Ashton finds herself opening up to Ezra in ways she never anticipated. Ways she never thought she could open up to anybody. For the first time in her life, Ashton finds herself in love. But will uncovering his secret and knowing what Ezra did, ruin it all?",
  "genres": [],
  "author": "Lena Little",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/95998029-valentine-s-day-daddy"
}