{
  "title": "The Fall of the House of Zeus: The Rise and Ruin of America's Most Powerful Trial Lawyer",
  "description": "“Over the past four decades no reporter has critiqued the American South with such evocative sensitivity and bedrock honesty as Curtis Wilkie.”—Douglas BrinkleyThe Fall of the House of Zeus tells the story of Dickie Scruggs, arguably the most successful plaintiff's lawyer in America. A brother-in-law of Trent Lott, the former U.S. Senate Majority Leader, Scruggs made a fortune taking on mass tort lawsuits against “Big Tobacco” and the asbestos industries. He was hailed by Newsweek as a latter day Robin Hood, and portrayed in the movie, The Insider, as a dapper aviator-lawyer. Scruggs’ legal triumphs rewarded him lavishly, and his success emboldened both his career maneuvering and his influence in Southern politics--but at a terrible cost, culminating in his spectacular fall, when he was convicted for conspiring to bribe a Mississippi state judge.Here Mississippi is emblematic of the modern South, with its influx of new money and its rising professional class, including lawyers such as Scruggs, whose interests became inextricably entwined with state and national politics.Based on extensive interviews, transcripts, and FBI recordings never made public, The Fall of the House of Zeus exposes the dark side of Southern and Washington legal games and power politics: the swirl of fixed cases, blocked investigations, judicial tampering, and a zealous prosecution that would eventually ensnare not only Scruggs but his own son, Zach, in the midst of their struggle with insurance companies over Hurricane Katrina damages. In gripping detail, Curtis Wilkie crafts an authentic legal thriller propelled by a “welter of betrayals and personal hatreds,” providing large supporting parts for Trent Lott and Jim Biden, brother of then-Senator Joe, and cameos by John McCain, Al Gore, and other DC insiders and influence peddlers.Above all, we get to see how and why the mighty fail and fall, a story as gripping and timeless as a Greek tragedy.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Law",
    "Business",
    "Politics",
    "Crime",
    "History"
  ],
  "author": "Curtis Wilkie",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/9598220-the-fall-of-the-house-of-zeus"
}