{
  "title": "Murder in the North End",
  "description": "“It’s always a good day when a new Nell Sweeney book arrives.”—CA ReviewsJuly 1870: Nell Sweeney’s position as governess for the venerable Hewitts of Boston affords her a unique perspective in an era of sharp class distinctions. Neither servant nor gentlewoman, she can fit in among the denizens of a waterfront tenement or the bluebloods of Colonnade Row. But there are many of the latter who regard her as just another good-for-nothing Irisher.Nell is shocked to learn that her friend Detective Colin Cook is a fugitive from justice, having reputedly killed a petty criminal in a North End concert saloon called Nabby’s Inferno, after which he fled the scene of the crime. Cook’s nemesis on the force, the loathsome Constable Skinner, thinks Nell knows where the Irish detective is hiding. She doesn’t, nor does she believe that Cook is capable of murder. To gather evidence in Cook’s favor, Nell must venture into the most depraved and crime-ridden neighborhood in the North End. William Hewitt, back home from his sojourn in Shanghai, isn’t about to let her undertake such a dangerous investigation on her own. Posing as husband and wife, they infiltrate the so-called “Murder District,” but the more they find out, the more hopeless it looks for Cook.Originally published by Berkley Prime Crime.“This is the latest in a unique and enjoyable series. The necessary background is easily dispensed with, making it easy for newcomer and longtime reader alike. The author uses the historical period to great advantage, depicting the class separations and prejudices that existed at the time without romanticizing them. Nell and Will are both fascinating characters. From wholly disparate backgrounds, they should have no common ground. But they each have past pains and secrets that allow them to understand each other. They make a great sleuthing team, as well. It’s always a good day when a new Nell Sweeney book arrives.”—CA Reviews“Plucky Nell and her helpmate Will are well developed characters who are likeable and smart. The cast of supporting characters in this book is colorful and well drawn, making the book an easy read. All of the books in this series are enjoyable; Murder in the North End is no exception…. I eagerly await the next Gilded Age mystery.”—Cozy Library“Murder in the North End is a light read that you can cozy up to on a cold winter night in your easy chair by the fire...”—MyShelf.comAbout the Author: Patricia Ryan, a.k.a. P.B. Ryan, is the USA Today bestselling author of more than two dozen novels, including the #1 national bestseller Still Life with Murder. Pat's books have garnered rave reviews and been published in over twenty countries. She is currently writing book 1 of a “spin-off” of the Nell Sweeney mystery series.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Fiction",
    "Romance",
    "Crime"
  ],
  "author": "P.B. Ryan",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/9615617-murder-in-the-north-end"
}