{
  "title": "Murder on Black Friday",
  "description": "“A mesmerizing mystery. Not only does Ryan provide readers with a tightly wound, suspenseful novel peopled with multidimensional characters, she writes about an era whose problems mirror our own. This is a historical period she knows and brings to life so clearly that readers are totally immersed. Nell is an ideal heroine: smart, intrepid and human. Be on the lookout for her return.”—RT BookReviewsOn Sept. 24, 1869, the gold market crumbles, and fortunes are lost in a matter of minutes. When two of Boston’s most prominent men are found dead on Wall Street’s first “Black Friday,” it’s widely assumed that they committed suicide over their financial losses. But upon examining the bodies, forensic scientist Dr. William Hewitt concludes that one of the men was most likely murdered.Will wants to investigate the circumstances surrounding the suspicious death, but to do so, he needs to navigate the upper echelons of Boston society, which are foreign to him. He enlists the aid of Nell Sweeney, the Irish-born governess employed by his estranged parents. Not only is Nell acquainted with many of the city’s most prominent citizens, she understands how their wealth and power can be used to keep dark secrets under wraps. As their investigation progresses, Nell and Will discover that the two dead men were linked by something more valuable—and far more treacherous—than gold.Originally published by Berkley Prime Crime.“Nell and Will are a confirmed pair of amateur sleuths in this fourth entry in the popular Gilded Age series, and this makes the setting perhaps slightly cozier, but as usual, P B Ryan is spot on with her period detail. This is the best part about the series for me, as these books really do open a window into how both the high and low society of Boston operated. She thankfully doesn’t shrink (Anne Perry style) from showing it, warts and all...probably the best entry yet.”—MyShelf.com“As always, Nell and Will’s predicament tugs at my heart. Loved it!”—Babbling Book Reviews“The author has an amazing grasp of life during this period of history. Each detail is crafted to let the reader feel immersed in the time; from the major historical events, to the minutiae of everyday life. These facts are effortlessly woven into the overall narrative.”—The Romance Reader’s ConnectionAbout the Author: Patricia Ryan, a.k.a. P.B. Ryan, is the USA Today bestselling author of more than two dozen novels, including the #1 national bestseller Still Life with Murder. Pat's books have garnered rave reviews and been published in over twenty countries.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Fiction",
    "Romance",
    "Crime"
  ],
  "author": "P.B. Ryan",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/9615618-murder-on-black-friday"
}