{
  "title": "The Spooky Art: Thoughts on Writing",
  "description": "“Writing is spooky,” according to Norman Mailer. “There is no routine of an office to keep you going, only the blank page each morning, and you never know where your words are coming from, those divine words.” In The Spooky Art, Mailer discusses with signature candor the rewards and trials of the writing life, and recommends the tools to navigate it. Addressing the reader in a conversational tone, he draws on the best of more than fifty years of his own criticism, advice, and detailed observations about the writer’s craft.   Praise for The Spooky Art   “The Spooky Art shows Mailer’s brave willingness to take on demanding forms and daunting issues. . . . He has been a thoughtful and stylish witness to the best and worst of the American century.”—The Boston Globe   “At his best—as artists should be judged—Mailer is indispensable, an American treasure. There is enough of his best in this book for it to be welcomed with gratitude.”—The Washington Post  “[The Spooky Art] should nourish and inform—as well as entertain—almost any serious reader of the novel.”—Baltimore Sun“The richest book ever written about the writer’s subconscious.”—The Philadelphia Inquirer   “Striking . . . entrancingly frank.”—Entertainment Weekly   Praise for Norman Mailer   “[Norman Mailer] loomed over American letters longer and larger than any other writer of his generation.”—The New York Times   “A writer of the greatest and most reckless talent.”—The New Yorker   “A devastatingly alive and original creative mind.”—Life   “Mailer is fierce, courageous, and reckless and nearly everything he writes has sections of headlong brilliance.”—The New York Review of Books   “The largest mind and imagination [in modern] American literature . . . Unlike just about every American writer since Henry James, Mailer has managed to grow and become richer in wisdom with each new book.”—Chicago Tribune   “Mailer is a master of his craft. His language carries you through the story like a leaf on a stream.”—The Cincinnati PostFrom the Hardcover edition.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Essays",
    "Literature",
    "American",
    "Art",
    "Literary Criticism"
  ],
  "author": "Norman Mailer",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/96117.The_Spooky_Art"
}