{
  "title": "The Isaiah Effect: Decoding the Lost Science of Prayer and Prophecy",
  "description": "A Groundbreaking Interpretation of Prayer, Quantum Science, and Prophecy.Only one document was discovered completely intact among the 25,000 fragments of papyrus, parchment, and hammered copper known as the Dead Sea the Great Isaiah Scroll. Nearly one thousand years older than existing copies of the Old Testament's Book of Isaiah, the twenty-two-foot-long parchment was still rolled and sealed in its original earthen vase when it was discovered in 1946. The completeness of the Isaiah Scroll offers unprecedented insight into the power of an ancient mystery — a lost mode of prayer — that modern science is just beginning to understand. Displayed today in Jerusalem's Shrine of the Book Museum, the Great Isaiah Scroll is believed to be so precious by modern scholars that it's withdrawn into a vault beneath the building's floor in the event of a natural or man-made disaster.In The Isaiah Effec t, the dazzling new work from the author of Awakening to Zero Point and Walking Between the Worlds , scientist and visionary Gregg Braden offers a radical departure from traditional interpretations of Isaiah's text. Weaving state-of-the-art research with his extensive knowledge of the ancient Essenes (the creators of the scroll texts), Braden invites us on a journey where science and miracles are merged into a new wisdom — and lead to a startling conclusion. He suggests that Isaiah, the first Old Testament prophet, left precise instructions to the people of the future describing an unconventional mode of prayer.Using principles recognized only recently in quantum physics, Braden demonstrates how Isaiah's nonreligious, nondenominational form of prayer transcends time and distance to bring healing to our bodies and peace to the nations of our modern world.",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Philosophy",
    "Religion",
    "New Age",
    "Audiobook",
    "Psychology"
  ],
  "author": "Gregg Braden",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/962541.The_Isaiah_Effect"
}