{
  "title": "King of Hearts",
  "description": "About this Backstage Boys romantic comedy Unjustly accused of being a harlot, preacher’s daughter Nadine runs away to Chicago to become a waitress at the stagehands' favorite restaurant. There she is the sole witness to King Dave Flaherty’s humiliation at his ex-wife’s hands. Nadine knows what it’s like to fall from grace. And she knows that only she can use this teaching moment to reform that prince of players. All King Dave knows is that if he doesn’t seduce this waitress, his reputation will be mud for the rest of his life. ___________________________________ Praise for KING OF HEARTS I thoroughly enjoyed King Of Hearts. Ms. Stevenson exposes a little known sub culture in the entertainment industry, while spinning a tale of romance. She creates a raucous, bawdy environment as outrageous as it is humorous. I highly recommend it. — Miriam Sanchez Stevenson dares to write her characters as they speak and act. It made it easy to picture the story as it unfolded. … Did I mention that it was also pretty hot? … an often hilarious journey … never a dull moment … King of Hearts is a must-read for a mature audience with a sense of humor and appreciation for naughty bits. — S Keiko Mushi I opened it, scanned the first page, and read the whole book through in one sitting. — Caroline Stevermer They have a love hate relationship that turns into hot and steamy one. And ohhh shall I say steamy i am sure you could see the steam coming out of my ears while reading certain scenes. … King if hearts is a great romantic quirky book that is easy to read. Can I just say if you have just read this 1st chapter and wondering if you should buy it. Go for it as it is so funny and quirky I loved it. I totally recommend this book it is a great romantic comedy and I can’t wait for the next stagehand book. — Mel Haffner I really enjoyed this book, it was bloody hilarious. I loved the war of wills between King Dave and Nadine, their love/hate relationship was brilliant…lol. The things they did to each other was funny – but if you ask me Nadine plays a better game … no matter what he did Nadine would get one over on him. … this a great romantic comedy that is easy to read. Go grab a copy and see for yourself. — Kiki Silk ___________________________________ About the author Jennifer Stevenson lives in the Chicago area with her very own stagehand hero and two kittens who won't grow up. She gardens, bikes, and skates with the Fleetwood Speed Skating team. Visit her website Sign up for her newsletter Hang with her on Facebook Follow her on Twitter For more Jennifernalia, see what she's doing at the Book View Cafe blog About King Dave says of his calling, “I wouldn’t have picked anything else. For those of us in it, it’s a noble calling. Show business doesn’t happen without us. We’re the guts, the dirty underbelly, the grease on the transmission under all the chrome and shiny headlights.” Jennifer says about \"I love my stagehand heroes. Who wants a skinny, self-absorbed actor or rock star who wears more makeup than I do? Stagehands have more fun, more family, and in many cases they make more money.",
  "genres": [
    "Romance",
    "Fiction"
  ],
  "author": "Jennifer Stevenson",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/9632440-king-of-hearts"
}