{
  "title": "The Jakarta Pandemic",
  "description": "\"RIPPED FROM TODAY'S HEADLINES AND METICULOUSLY RESEARCHED, The Jakarta Pandemic walks you through a family's near impossible struggle to survive a lethal pandemic virus.\"\"A rare, up-all-night thriller series. Alex Fletcher is the 'hero' we need when disaster strikes and the bonds of society start to break.\"THE JAKARTA Cases of a highly lethal virus appear in major cities around the globe. Most ignore the warning signs.Alex Fletcher, Iraq War veteran, has read the signs for years. With his family and home prepared to endure an extended period of seclusion, Alex thinks he's ready for the pandemic. He's not even close.The unstoppable H16N1 virus rapidly spreads across the United States, stretching the fragile bonds of society to the breaking point. Schools close, grocery stores empty, fuel deliveries stop, hospitals start turning away the sick...riots engulf the cities. As hostility and mistrust engulfs his idyllic Maine neighborhood, Alex quickly realizes that the H16N1 virus will be the least of his problems.\"It delivers a vicious punch of violence and heroism for the reader to endure and admire. I could hardly put The Jakarta Pandemic down until I finished it.\" - Amazon reviewer\"The tension builds as difficult choices are made, when no good options seem to be available. I found certain segments to be uncomfortably realistic, at times creepy in the way you could feel things closing in around the family.\" - Amazon reviewer\"It makes you think...how far are you willing to go to protect your loved ones? Every day that goes by, these characters have to question what is right and what is wrong. Take the trip thru this book. You won't be disappointed.\" - Amazon reviewerThe Alex Fletcher Books (In Order):The Jakarta Pandemic, Book OneThe Perseid Collapse, Book TwoEvent Horizon, Book ThreePoint of Crisis, Book FourDispatches, Book Five _________________________________________________________________________________Steven's novels are recommended for fans of Brad Thor's Scot Harvath, Vince Flynn's Mitch Rapp, Brad Taylor's Pike Logan, Tom Clancy's Jack Ryan, Lee Child's Jack Reacher, Robert Ludlum's Jason Bourne, L.T. Ryan's Jack Noble, C.G. Cooper's Daniel Briggs, Daniel Silva's Gabriel Allon, Mark Greaney's Gray Man and Michael Crichton.Learn to survive COVID19—coronavirus",
  "genres": [
    "Fiction",
    "Thriller",
    "Post Apocalyptic",
    "Dystopia",
    "Apocalyptic",
    "Science Fiction",
    "Horror"
  ],
  "author": "Steven Konkoly",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/9632773-the-jakarta-pandemic"
}