{
  "title": "Trader Vyx",
  "description": "Advanced weapons manufactured for Space Command are being offered for sale on the galactic black market. Trader Vyx, an undercover operative for Space Command, the military arm of the Galactic Alliance, has been sent into the Frontier Zone to procure several weapons from an Alyysian arms merchant, as part of an effort to trace the serial numbers and end the thefts. All is going smoothly until a Tsgardi mercenary enters the room. He utters a profanity as he recognizes Vyx and immediately reaches for his sidearm. Vyx grabs for his own sidearm, but then has to dive for cover as the weapon merchant's bodyguards open up, turning the room into a killing zone of deadly crossfire. Vyx manages to kill the mercenary and escape, but is hotly pursued by bodyguards who believe him responsible for the shooting incident that severely wounded their boss. The chase continues through the small Gollasko Colony as Vyx uses all of his skills to evade guards bent on ending his life. Each time he thinks he's lost his pursuers, they turn up again.While Vyx is fighting for his life on Gollasko, Commander Jenetta Carver is facing problems of her own in another part of the galaxy. The Galactic Alliance has decided to expand the border, and Commander Jenetta Carver is venturing into the new territory as captain of a prototype scout ship. An onboard accident sends the small ship flying wildly out of control. They find themselves in a disabled ship, unable to contact anyone, with life support systems beginning to fail. When a passing Raider warship happens across the apparently derelict ship, Jenetta must face the question of resistance or surrender.108,500 Words - 328 Pages",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Military Fiction",
    "Space",
    "Military Science Fiction",
    "Adventure",
    "War"
  ],
  "author": "Thomas DePrima",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/9631450-trader-vyx"
}