{
  "title": "Guardian Spirit",
  "description": "A little girl's world should be all sugar and spice and everything nice, but that is not the case for twelve-year-old Sadie Madison. She, her mother Millie, and little brother Sammy have all felt the strong hand of Brad, Sadie's abusive father. After many failed attempts, they escape to the childhood playground of Millie. From Texas to North Carolina, they travel to the cabin in the beautiful Blue Ridge Mountains, back to the memories that were left behind when Millie's mother left with her over twenty years before. Millie longs for her cherished Grandma Ann, but can she risk contacting her? Brad might be watching. Besides, her grandmother hasn't even looked for her, has she? She might not even care anymore. Will their lost spirits find a way to reconnect? How long can Millie hide her family before Brad finds them? And what horrible things will he do to them if he does? The image of five-year-old Sammy's battered face flashes before Millie, fueling her resistance and determination. Who or what can save them? They need a miracle. As the summer of 1968 comes to a close, Millie knows they can't winter at the cabin. It would be much too dangerous with only the fireplace for heat. The children need to be in school, and she has to find a doctor to renew her prescription. She can't risk doing without her cancer drug. Once Brad finds his family though, all Millie's other worries become insignificant. In the local town, the Cherokee medicine woman Nyoaka feels their presence and the upcoming arrival of \"the evil one.\" She has the gift of visions. She knows that her grandson Doctor Lewis Townsend will at long last come to the end of his trail of tears. With this new family he will find forgiveness and healing if they - especially the girl Sadie - also believe. Sadie, too, has the magic. The Madisons walk as the proud Indians did all those years ago on their horrible Trail of Tears. Millie, Sadie and Sammy willingly leave their home to escape torture; the Cherokees were forced out of their homes and into the torment. Both tribes endure suffering and humiliation, neither deserving. The Madisons believe in guardian angels. The Cherokee believe in the Guardian Spirit. Are they one and the same? Can the Madison family survive the clash of wills as good collides with evil? How can the painful tears of yesteryear become tears of joy for the Cherokee? Can a long overdue reunion of souls bestow a miracle of healing? A journey that started 130 years ago will finally come to an end. Sadie's Indian name is \"Wakanda\" which means possessor of magic power. Will this young girl be able to harness that power in time to help the Guardian Spirit save them? Yes!",
  "genres": [],
  "author": "Sarah Martin Byrd",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/9633466-guardian-spirit"
}