{
  "title": "Ombra",
  "description": "Alma apre gli occhi. Incredula, con la testa dolorante, si ritrova su un pavimento di legno, all'interno di un negozio del centro. Accanto a lei, il corpo senza vita del vecchio cartolaio, che lei ben conosce e che tanto spesso, col suo sorriso gentile, le ha regalato un momento di conforto nelle sue giornate. Non ci sono dubbi: è l'ennesima vittima dei Master, le creature provenienti dal mondo malefico che getta la sua ombra sulla Città. Alma non può fare altro che fuggire, sempre più terrorizzata e sola. Morgan, l'enigmatico ragazzo dagli occhi viola, l'unico che sembrava capirla e conoscerla davvero, è scomparso nel nulla. Senza di lui, la scuola è solo una stanza vuota. Alma non prova più gioia nel suo cuore, nemmeno per l'amica Seline, che sembra finalmente serena vicino ad Adam. Del resto, quando è stata l'ultima volta che Alma si è sentita felice? Com'è possibile che non sia mai riuscita a legarsi a un ragazzo prima di Morgan? E perché anche nei suoi riguardi quel che sente, in fondo, è solo tanta confusione? Le risposte, scoprirà, hanno a che fare con la sua stessa natura e le sue vere, oscure origini. Risposte affidate agli occhi di una ragazza di cui Alma fissa incredula la fotografia esposta a una mostra, riconoscendovi il proprio ritratto. Risposte che giacciono sott'acqua. In quell'acqua in cui lei, chissà perché, non può, non riesce a immergersi. Quelle risposte sono a portata di mano, nel mondo parallelo di My Land da cui Alma proviene, al di là di una porta chiusa che solo Morgan può insegnarle ad aprire e di cui lei, senza saperlo, possiede già la chiave. Dopo il successo di Buio, continua con Ombra la saga di My Land, mentre si fa sempre più serrata la lotta di Alma per sfuggire al suo destino e al richiamo del malvagio Leviatano, riaffermando la sua libertà di vivere e amare.",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Fiction",
    "Urban Fantasy"
  ],
  "author": "Elena P. Melodia",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/9632216-ombra"
}