{
  "title": "Barcelona Noir",
  "description": "\"One-of-a-kind Barcelona is as enchanting in real life as in literature, and the latest in the Akashic city noir series, Barcelona Noir, is a terrific entry point to sample its charms or to relive the adventure of traveling there […] this collection of 14 stories that tap into history, politics and culture to cast a cloak of horror and humor on the city’s distinctive neighborhoods.\"--\nMiami Herald\n\"The 14 stories in Akashic’s Barcelona volume hew closely to the bleak spirit of the noir genre, whether reaching back to the 1920s [...] or chronicling chaotic immigrant-infused present-day Barcelona.\"--\nPublishers Weekly\n\"Each [contributor] presents his or her own personal picture of the city, and as a whole, the anthology projects a many-hued sense of place. As portrayed here, Barcelona is a city that looks different from every angle.\"--\nBooklist\n\"With 50 titles in its noir series and counting, Akashic adds another fine anthology to the lineup, this time evoking the cultural, social, and physical precincts of Barcelona from the early 20th century to the present. Fans of Spanish literature and crime fiction will enjoy.\"--\nLibrary Journal\nIncludes brand-new stories by: Jordi Sierra i Fabra, Imma Monso, Santiago Roncagliolo, Francisco “Paco” Gonzalez Ledesma, Valerie Miles, David Barba, Isabel Franc, Lolita Bosch, Eric C. Aragon, Antonia Cortijos, Cristina Fallaras, Raul Argemi, Teresa Solana, and Andreu Martin.For some, Barcelona is a European enchantress of nouveau architecture, fusion tapas, and fine cava. To others, it’s a Gothic labyrinth of tiny streets to lose oneself in; hashish-clouded after-hours bars to forget the time; dimly lit plazas with global bohemians squatting, prostitutes tempting. But come morning, its cold cobblestones and misty beachfronts have even darker stories to tell.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Noir",
    "Mystery",
    "Anthologies",
    "Crime",
    "Spain"
  ],
  "author": "Achy Obejas",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/9638032-barcelona-noir"
}