{
  "title": "Kay Thompson: From Funny Face to Eloise",
  "description": "Kay Thompson’s larger-than-life story is an effervescent toast to show business with a shot of Auntie Mame and a twist of The Devil Wears Prada.A multi-threat entertainer and a world-class eccentric, Kay Thompson was the mentor/best friend of Judy Garland, the vocal guru for Frank Sinatra and Lena Horne, and the godmother/Svengali of Liza Minnelli (who recreated Thompson’s nightclub act in her 2009 Tony Award–winning event, Liza’s at the Palace ).She went to school with Tennessee Williams, auditioned for Henry Ford, got her first big break from Bing Crosby, trained Marilyn Monroe, channeled Elvis Presley, rejected Andy Warhol, rebuffed Federico Fellini, got fired by Howard Hughes, and snubbed Donald Trump.She coached Bette Davis and Eleanor Roosevelt; she created nightclub acts for Marlene Dietrich and Ginger Rogers; and when Lucille Ball had to sing on Broadway, Kay was the wind beneath her wings, too.Kay’s legion of fans included Queen Elizabeth of England, King Juan Carlos of Spain, and Princess Grace (Kelly) of Monaco. Danny Kaye masqueraded in drag as her; Noël Coward and Cole Porter wrote musicals for her; and The Beatles wanted to hold her hand. She was a charter member of the Rat Pack, costarred in a whodunit with Ronald Reagan, and directed John F. Kennedy’s Inaugural Gala.The dame cut a wide swath through the arts. After conquering radio in the 1930s she commandeered MGM’s vocal department in the 1940s, where she revolutionized the studio’s greatest musicals with her audacious arrangements, from The Harvey Girls to Ziegfeld Follies .In the 1950s she became the highest-paid cabaret attraction in the world with her groundbreaking act \"Kay Thompson and the Williams Brothers,\" featuring her young protégé—and secret lover—Andy Williams.In a stunning feat of reinvention, Thompson next became the bestselling author of Eloise (first published by Simon & Schuster in 1955), chronicling the mischievous adventures of the six-year-old mascot of The Plaza, spawning an industry that is still going strong today.Then Kay took the silver screen by storm as the \"Think Pink!\" fashion magazine editor in Funny Face , stealing the film right out from under Audrey Hepburn and Fred Astaire.The Thompson saga swells from small town wannabe to international headliner, dissolving into self-destruction and madness—the storyline usually reserved for a rags-to-riches potboiler—yet with unexpected twists, outlandish turns, and a last-minute happy ending that, even by Hollywood’s standards, is nothing short of preposterous. But that is Kay Thompson. Fascinating. Frustrating. Fabulous!",
  "genres": [
    "Biography",
    "Nonfiction",
    "Film",
    "New York",
    "Biography Memoir",
    "Autobiography",
    "Music"
  ],
  "author": "Sam Irvin",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/9638669-kay-thompson"
}