{
  "title": "The Long Hello",
  "description": "A stirring memoir of a daughter caring for a mother with dementia that is sure to become a touchstone for many others.The Long Hello explores the emotional rewards and challenges that Cathie Borrie experienced in caring for her mother, who was living with Alzheimer’s disease, for seven years. Between the two, a wondrously poetic dialogue develops, which Ms. Borrie further illuminates with childhood memories of her family, and her struggle to maintain a life outside her caregiving responsibilities. The Long Hello demonstrates how caregiving creates an opportunity to experience the change in a relationship that illness necessitates, one in which joy, innocence, and profound intimacy can flourish.Written in spare, beautiful prose, largely in the form of a dialogue, The Long Hello exquisitely captures the intricacies and nuances of a daughter’s relationship with her mother. - See more at: http://books.simonandschuster.ca/Long...Additional Info:In this shimmering jewel of a memoir, \"The Long Hello The Other Side of Alzheimer's,\" author Cathie Borrie traverses rich terrain as she unearths the hidden and often painful treasures of a life well lived: the shadows and joys of childhood, the relationships that leave us both illuminated and bereft, the love, longing and loss that surge to the fore when a parent is ailing. Memory, and the losing of it, serves as a powerful guide, and Borrie follows her mother's eccentric and poetic lead into the past, transformed by the unexpected brilliance of the elder woman's shifting dementia mind. A paean of redemptive beauty, \"The Long Hello\" cherishes the bond between mothers and daughters, and creates a startling change in society's perception of those journeying through Alzheimer's.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Canada",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Cathie Borrie",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/9643849-the-long-hello"
}