{
  "title": "Loser Sons: Politics and Authority",
  "description": "There are sons who grow up unhappily believing that no matter what they do, they cannot please their fathers. Often unable to shed their sense of lifelong failure, either they give up and suffer in a permanent sulk, or they try with all their might to prove they are worth something after all. These are the \"loser sons,\" a group of historical men as varied as President George W. Bush, Osama bin Laden, and Mohammed Atta. Their names quickly illustrate that not only are their problems serious, but they also make serious problems for others, expanding to whole nations. When God is conceived and inculcated as an angry and impossible-to-please father, the problems can last for generations. In Loser Sons, Avital Ronell draws on current philosophy, literary history, and political events to confront the grim fact that divested boys become terrifying men. This would be old news if the problem didn't recur so often with such disastrous consequences. Looking beyond our current moment, she interrogates the problems of authority, paternal fantasy, and childhood as they have been explored and exemplified by Franz Kafka, Goethe's Faust, Benjamin Franklin, Jean-François Lyotard, Hannah Arendt, Alexandre Kojève, and Immanuel Kant. Brilliantly weaving these threads into a polyvocal discourse, Ronell shows how, with their arrays of powerful symbols, ideologies of all sorts perpetuate the theme that while childhood represents innocence, adulthood entails responsible cruelty. The need for suffering--preferably somebody else's--has become a widespread assumption, not only justifying abuses of authority, but justifying authority itself.  Shockingly honest, Loser Sons recognizes that focusing on the spectacular catastrophes of modernity might make writer and reader feel they're engaged in something important, while in fact what they are engaged in is still only spectacle. To understand the implications of her insights, Ronell addresses them directly to her readers, challenging them to think through their own notions of authority and their responses to it.",
  "genres": [
    "Philosophy"
  ],
  "author": "Avital Ronell",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/13222543-loser-sons"
}