{
  "title": "Spying in High Heels",
  "description": "#1 Amazon,  New York Times  &  USA Today  Bestselling series! High Crime meets High Fashion when shoe designer turned amateur sleuth Maddie Springer is on the case...with laugh-out-loud results!Struggling LA shoe designer, Maddie Springer, lives her life by three Fashion. Fashion. Fashion. But when her boyfriend suddenly disappears--along with $20 million in embezzled funds--her life takes an unexpected turn from Manolos to murder. Now her every move is under scrutiny by the LAPD's sexiest cop, dead bodies are dropping around her faster than last season's trends, and the deeper she digs the more she realizes maybe she didn't know her man as well as she thought. With the help of her post-menopausal bridezilla of a mother, a Venice Beach psychic, and her wanna-be actress best friend, Maddie finds herself stepping out of her stilettos and onto the trail of a murderer. But can she catch a killer before the killer catches up to her...   This story does not contain any graphic violence, language, or sexual encounters. Its rating would be similar to PG-13 or what you would find on a Hallmark Channel movie or TV series. High Heels  #1 Spying in High Heels #2 Killer in High Heels #3 Undercover in High Heels #3.5 Christmas in High Heels (short story) #4 Alibi in High Heels #5 Mayhem in High Heels #5.5 Honeymoon in High Heels (short story) #5.75 Sweetheart in High Heels (novella) #6 Fearless in High Heels #7 Danger in High Heels #8 Homicide in High Heels #9 Deadly in High Heels #10 Suspect in High Heels What critics are saying about  Spying in High Heels : \"A saucy combination of romance and suspense that is simply irresistible.\" ~  Chicago Tribune \"Stylish... nonstop action...guaranteed to keep chick lit and mystery fans happy!\" ~  Publishers' Weekly , starred review \"Smart, funny and snappy,  Spying in High Heels  is the perfect beach read!\" ~  Fresh Fiction \" Spying in High Heels  is a roller coaster ride full of fun and excitement!\" ~  Romance Reviews Today",
  "genres": [
    "Mystery",
    "Romance",
    "Chick Lit",
    "Cozy Mystery",
    "Fiction",
    "Humor",
    "Contemporary"
  ],
  "author": "Gemma Halliday",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/9640483-spying-in-high-heels"
}