{
  "title": "Squeeze This!: A Cultural History of the Accordion in America",
  "description": "No other instrument has witnessed such a dramatic rise to popularity--and precipitous decline--as the accordion. Squeeze This! is the first history of the piano accordion and the first book-length study of the accordion as a uniquely American musical and cultural phenomenon. Ethnomusicologist and accordion enthusiast Marion Jacobson traces the changing idea of the accordion in the United States and its cultural significance over the course of the twentieth century. From the introduction of elaborately decorated European models imported onto the American vaudeville stage and the instrument's celebration by ethnic musical communities and mainstream audiences alike, to the accordion-infused pop parodies by \"Weird Al\" Yankovic, Jacobson considers the accordion's contradictory status as both an \"outsider\" instrument and as a major force in popular music in the twentieth century. Drawing on interviews and archival investigations with instrument builders and retailers, artists and audiences, professionals and amateurs, Squeeze This! explores the piano accordion's role as an instrument of community identity and its varied musical and cultural environments. Jacobson concentrates on six key moments of the Americanization of the piano accordion, originally produced and marketed by sales-savvy Italian immigrants; the transformation of the accordion in the 1920s from an exotic, expensive vaudeville instrument to a mass-marketable product; the emergence of the accordion craze in the 1930s and 1940s, when a highly organized \"accordion industrial complex\" cultivated a white, middle-class market; the peak of its popularity in the 1950s, exemplified by Lawrence Welk and Dick Contino; the instrument's marginalization in the 1960s and a brief, ill-fated effort to promote the accordion to teen rock 'n' roll musicians; and the revival beginning in the 1980s of the accordion as a \"world music instrument\" and a key component for cabaret and burlesque revivals and pop groups such as alternative experimenters They Might Be Giants and polka rockers Brave Combo. Loaded with dozens of images of gorgeous instruments and enthusiastic performers and fans, Squeeze This! A Cultural History of the Accordion in America represents the accordion in a wide range of popular and traditional musical styles, revealing the richness and diversity of accordion culture in America.",
  "genres": [
    "Music",
    "History",
    "Nonfiction"
  ],
  "author": "Marion Jacobson",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/13222561-squeeze-this"
}