{
  "title": "Death Sentences",
  "description": "Japan, 1980s: A special police squad is tracking down one of the “afflicted” to recover the “stuff.” Although the operation seems like a drug bust, the “stuff” is actually some kind of text. Death Sentences—a work of science fiction that shares its conceit with the major motion picture The Ring—tells the story of a mysterious surrealist poem, penned in the 1940s, which, through low-tech circulation across time, kills its readers, including Arshile Gorky and Antonin Artaud, before sparking a wave of suicides after its publication in 1980s Japan. Mixing elements of Japanese hard-boiled detective story, horror, and science fiction, the novel ranges across time and space, from the Left Bank of Paris to the planet Mars.Paris, 1948: André Breton anxiously awaits a young poet, Who May. He recalls their earlier encounter in New York City and the mysterious effects of reading Who May’s poem “Other World.” Upon meeting, Who May gives Breton another poem, “Mirror,” an even more unsettling work. Breton shares it with his fellow surrealists. Before Breton can discuss the poem with him, Who May vanishes. Who May contacts Breton about a third poem, “The Gold of Time,” and then slips into a coma and dies (or enters another dimension). Copies of the poem are mailed to all of Who May’s friends—Breton, Gorky, Paul Éluard, Marcel Duchamp, and other famous surrealists and dadaists. Thus begins the “magic poem plague.”Death Sentences is the first novel by the popular and critically acclaimed science fiction author Kawamata Chiaki to be published in English. Released in Japan in 1984 as Genshi-gari (Hunting the magic poems), Death Sentences was a best seller and won the Japan Science Fiction Grand Prize. With echoes of such classic sci-fi works as George Orwell’s 1984, Ray Bradbury’s Fahrenheit 451, William Gibson’s Neuromancer, and Philip K. Dick’s Martian Time-Slip, Death Sentences is a fascinating mind-bender with a style all its own.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Japanese Literature",
    "Horror",
    "Japan",
    "Fantasy",
    "Literature"
  ],
  "author": "Kawamata Chiaki",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/13222629-death-sentences"
}