{
  "title": "Fighting For Life",
  "description": "Fought on almost every continent, the Second World War confronted American GIs with unprecedented threats to life and health posed by combat on Arctic ice floes and African deserts, steamy island jungles and remote mountain villages, the stratosphere and the depths of the sea. Service men were assaulted by frostbite, malaria, shrapnel, and landmines. But the demands of war provoked unparalleled medical advances in the years 1941-45, as well. In a war that unleashed the technology of destruction as no previous conflict had, the tale of those whose duty it was to save lives in World War II, not destroy them, has remained untold. Now, award-winning author Albert Cowdrey has written the first comprehensive history of one of the most important yet underappreciated weapons of World War II - America's extraordinary military medicine.Cowdrey tells the remarkable story of how American units developed and implemented new technology under dire pressures, succeeding so brilliantly that World War II became the first American war in which more men died in combat than of disease. Penicillin brought the antibiotic revolution to the battlefield, air evacuation plucked the wounded from jungles and deserts, and a unique system brought blood, still fresh from America, to our soldiers all over the world. Surgeons working just behind the front lines stabilized the worst cases, while physicians and public health experts suppressed epidemics and cured exotic diseases. Psychiatrists, nurses and medics all performed heroic feats amidst unspeakable conditions. Together, these men and women improvised medical miracles on the battlefield that could not have been imagined by practitioners in peacetime. Cowdrey recalls those triumphant years when Americans, blessed with the skill, courage, and dedication of a formidable medical fighting force, achieved a spectacular victory.",
  "genres": [
    "Nonfiction",
    "History",
    "Military History"
  ],
  "author": "Albert E. Cowdrey",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/9645179-fighting-for-life"
}