{
  "title": "The First World War",
  "description": "“This serious, compact survey of the war’s history stands out as the most well-informed, accessible work available.” (\n\n\nLos Angeles\n\n\n\n Times\n\n\n)\n Nearly a century has passed since the outbreak of World War I, yet as military historian Hew Strachan argues in this brilliant and authoritative new book, the legacy of the “war to end all wars” is with us still. The First World War was a truly global conflict from the start, with many of the most decisive battles fought in or directly affecting the Balkans, Africa, and the Ottoman Empire. Even more than World War II, the First World War continues to shape the politics and international relations of our world, especially in hot spots like the Middle East and the Balkans. Strachan has done a masterful job of reexamining the causes, the major campaigns, and the consequences of the First World War, compressing a lifetime of knowledge into a single definitive volume tailored for the general reader. Written in crisp, compelling prose and enlivened with extraordinarily vivid photographs and detailed maps, The First World War re-creates this world-altering conflict both on and off the battlefield—the clash of ideologies between the colonial powers at the center of the war, the social and economic unrest that swept Europe both before and after, the military strategies employed with stunning success and tragic failure in the various theaters of war, the terms of peace and why it didn’t last. Drawing on material culled from many countries, Strachan offers a fresh, clear-sighted perspective on how the war not only redrew the map of the world but also set in motion the most dangerous conflicts of today. Deeply learned, powerfully written, and soon to be released with a new introduction that commemorates the hundredth anniversary of the outbreak of the war, The First World War remains a landmark of contemporary history.",
  "genres": [
    "History",
    "Nonfiction",
    "World War I",
    "War",
    "Military History",
    "Military Fiction",
    "World History"
  ],
  "author": "Hew Strachan",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/96404.The_First_World_War"
}