{
  "title": "The Fire Inside",
  "description": "Jack King is going scorch the city to avenge his friend's murder.When his best friend is murdered, former crime-fighter Jack leaps head-first back into a world he walked away from - a world more complicated and dangerous than he ever knew. With a squad of ruthless killers on his six and uncertain allies by his side, Jack is going to find his friend's murderer — even if he has to burn the city down!\"By the end of this book I was fist punching the air and looking for things to fight with my epic Highlander broadsword!\" - Kelly, Reading the ParanormalThe first book in the Sidekicks Series, The Fire Inside is an urban fantasy crime thriller that grabs you by the throat and doesn't let go. Filled with exciting characters, sharp dialogue, and an edge-of-your-seat plot, The Fire Inside takes the reader on a roller-coaster ride where right and wrong isn't always black and white.Interview with the AuthorQ- Tell us about yourself?A- My name is Raymond M Rose and I took my passion for science fiction, thrillers, comic books, and mysteries and mixed them into something exciting and fun-to-read.Q- Like...A- X-Men meets Person of Interest, Arrow meets Elvis Cole, X-Files meets The Avengers. The best of all worlds mixed together. It's got Science Fiction Superhumans caught up in an Action Packed plot.Q- Your main character--A- Jack KingQ- He's got a bit of a temper. That seems like a bad trait for someone who can control fire?A- Quite bad.Q- Can he control it?A- Usually. But when his best friend is murdered, well...Q- Things seem a little different in the Sidekicks world...?A- It's a Science Fiction Alternative History world where superheroes have changed the world.Q- Are there more books to the Sidekicks Series?A- I'm just getting started. Head over to www.raymondmrose.com to find out what I'm up to.And enjoy. Sidekicks: Action Packed Urban Fantasy Crime Series eBook Categories: Science Fiction & Fantasy : Science Fiction : Adventure : Thriller or Mystery Science Fiction & Fantasy : Science Fiction : Alternative History : Mystery Science Fiction & Fantasy : Science Fiction : Cyberpunk Mystery, Thriller & Suspense : Thrillers : Assassinations",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Superheroes",
    "Crime"
  ],
  "author": "Raymond M. Rose",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/9647312-the-fire-inside"
}