{
  "title": "Yes, We Have No Neutrons: An Eye-Opening Tour Through the Twists and Turns of Bad Science",
  "description": "An entertaining and irreverent expose of science gone wrongIn his critically acclaimed success 200% of Nothing, A.K. Dewdney revealed the alarming shenanigans of those who use \"bad math\" to deceive us. Now he turns his sharp-witted eye on the practitioners of \"bad science\" and offers an equally amusing and informative tour of the often odd, sometimes disturbing mistakes scientists make. Dewdney profiles eight notorious cases of bad science, revealing fundamental errors from the subtle to the ridiculous, including claims hailing from major research centers backed by millions of dollars of funding. We learn the inside scoop about the infamous fusion fiasco, scrutinize the strange saga of the media-hyped Biosphere, probe the appealing but flawed logic of the Search for Extra Terrestrial Intelligence, and much more.Written in Dewdney's trademark humorous style and full of intriguing and eye-opening facts and figuresA.K. DEWDNEY (London, Ontario) is the author of 200% of Nothing (Wiley) as well as past author of the popular \"Mathematical Recreations\" column in Scientific American.An Eye-Opening Tour Through the Twists and Turns of Bad Science A.K. Dewdney.\"We need more books like this-especially if they're this much fun to read.\"-Wired.\"Written with wit and a touch of pathos-and sure to please science lovers.\"-Scientific American.A deliciously irreverent expose of science gone wrong.In his critically acclaimed book 200% of Nothing, A.K. Dewdney revealed the absurd shenanigans of those who use \"bad math\" to deceive us. Now he focuses his mercilessly comic perspective on the practitioners of \"bad science\" and offers an equally entertaining and informative tour of eight notorious cases of bad science, ranging from the subtle (the infamous cold fusion fiasco) to the ridiculous (the case of the phantom \"N-rays\").A.K. Dewdney (London, Ontario) is the author of A Mathematical Mystery Tour, 200% of Nothing (both from Wiley), The Armchair Universe, and The Planiverse. He is the former Mathematical Recreations columnist for Scientific American.",
  "genres": [
    "Science",
    "Nonfiction",
    "Popular Science"
  ],
  "author": "A.K. Dewdney",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/964833.Yes_We_Have_No_Neutrons"
}