{
  "title": "Crash",
  "description": "L’automobile come metafora della vita dell’uomo nella società odierna. Lo scontro automobilistico come sinistro presagio di un orrendo connubio tra sesso e tecnologia. La tecnologia come mezzo di sfruttamento delle nostre psicopatologie.Il libroAd accomunare le vite del narratore, James Ballard, e dello scienziato televisivo e psicopatico Robert Vaughan sarà la passione morbosa per gli incidenti stradali con il loro strascico di morte, deformazione e mutilazione dei corpi, commistione di tecnologia e carne, lamiere e sesso. Entrambi sono reduci da scontri che hanno modificato la loro percezione di cose e persone. Hanno una visione autenticamente pornografica del mondo, si concentrano su particolari svincolati dalla personalità, deviano feticisticamente la libido sui dettagli tecnologici e umani. Attorno a loro si muovono le figure di Catherine, la moglie di James, con la sua attrazione omoerotica per Karen, la dottoressa Helen Remington, il cui marito è morto nello schianto con l’automobile di James, e altri individui a loro volta presi nelle spire del fascino perverso della tecnologia e del suo impatto sulla vita umana. Il tutto descritto con algido, clinico distacco. Si spiana così la strada, come ha detto lo scrittore, \"a tutti i nostri piaceri più concreti e delicati – quelli delle delizie del dolore e della mutilazione; del sesso come arena perfetta, come brodo di coltura di sterile pus, per tutte le veroniche delle nostre perversioni; della libertà morale di attendere alla nostra psicopatologia come a un gioco; dell’apparente illimitatezza delle nostre capacità di concettualizzazione. Ciò che i nostri figli hanno da temere realmente non sono le autostrade del domani, bensì il nostro sottile piacere nel calcolare i più eleganti parametri delle loro morti\"",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Horror",
    "Novels",
    "Literature",
    "Classics",
    "British Literature"
  ],
  "author": "J.G. Ballard",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/9646735-crash"
}