{
  "title": "Skye",
  "description": "Book One of \"The Jacobites.\" Centuries of endless feuds and cold revenge. Decades lost in senseless betrayal and hot-blooded murder. Passing years marked by awakening love and mindless passion. The internal stresses of day to day life in the Western Isles are marked by external interruptions from the south, from who sits on the English Throne. Since the death of Elizabeth the first in 1603, the Crown has been controlled by the Stewart family. But after eighty-five years of rule and civil war, the Stewarts have been pushed out. Now, brooding in exile, their leader, ‘The throne of England. This will be their final revenge on the foreign usurpers, the House of Hanover, and their traitorous supporters. They have tried before in 1715 and 1719, fanning the few embers of revolt, which quickly fizzled out with lack of support. The inhabitants of the north of Scotland and islands of the Hebrides are ardent Jacobites, dating back from before the time of Mary, Queen of the Scots. Pushed down, they have risen back up, time after time, to fight again for the Stewart cause. This support for the Scottish Royal Family has triggered constant flare-ups, interactions, and switching loyalties. These dynastic and religious struggles have been going on and off since 1642, with no signs of abating. The Stewarts have been winning, losing, and plotting for the English throne for one hundred years. On the Isle of Skye, other battles rage on a smaller scale, but no less fierce. Three contesting families push their young hot-heads to wage raiding, feuding, and bloodshed; all for control of the windswept island. These tales cover the lives of five generations of the Fawkes family. At the heart of the adventures is their fealty to the clan MacKellan and its chief, and the interactions of their clan with the other two clans that share the Isle of Skye on the northwest coast of Scotland. This struggle has lasted for nearly seven hundred years, the scales tilting back and forth between two ancient adversaries, the MacDonald and the MacLeod. The Clan MacDonald and the Clan MacLeod have fought many a bloody battle against each other, and the Isle split between them. Three hundred years ago, a band of newcomers, under the banner of the MacKellans, left their home on Mull, and landed on the peninsula of Sleat. They found easy prey in the once powerful MacDonalds, who were weakened by plague and decades of war. The MacKellans pushed them off the peninsula of Sleat, and took up residence at Armadale. The MacDonalds reestablished their seat of power in the northeast of the isle near the town of Thorsglen. The Laird of the MacKellans has taken up residence in the MacDonalds former castle, “Gallowglass.” The three-story castle takes its name from the mercenary Norse-Scottish warriors who fought in Ireland. Peace is common now, even intermarriage among the laird’s families, just an occasional scruffy bandit, or cattle thief to mar the ‘Pax Britannica’ of the United Kingdom of England, Ireland, Scotland, and Wales. Sir Donald ‘Black Donald’ MacDonald, the Laird of the MacDonalds, is growing in wealth and power. He wants their ancestral lands back from the intruding MacKellans. Black Donald is plotting his return to Sleat. Death. Death to the last of his enemies.",
  "genres": [
    "Historical Fiction",
    "Medieval"
  ],
  "author": "Kevin John Grote",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/13223089-skye"
}