{
  "title": "Ricordi di un vicolo cieco",
  "description": "Cinque racconti per cinque personaggi che, in seguito a eventi improvvisi e dolorosi, si interrogano sul significato della propria vita e sulla possibilità di essere felici. Nel primo racconto, intitolato La casa degli spiriti, due compagni di università, Setsuko e Iwakura, sono legati da un profondo legame di amicizia destinato a trasformarsi in un amore profondo. Il secondo racconto, intitolato Mamma!, parla di un tentativo di avvelenamento ai danni di Matsuoka, una ragazza che lavora in una casa editrice. Matsuoka rimette in discussione il legame con le persone che credeva di amare e decide di tornare per un pò di tempo nel paese natale dove, grazie alla quiete e alle attenzioni della nonna, recupera la fiducia in se stessa e nei rapporti umani. Il terzo racconto è una tragica storia di amicizia tra bambini. Mitsuyo, una scrittrice affermata, ricorda il suo rapporto con Makoto, un amico d'infanzia con il quale trascorreva tutti i pomeriggi dopo la scuola. Nel quarto racconto, Tomo è vittima di uno stupro. Sarà l'amore per Misawa, un uomo incontrato per caso alla mensa aziendale, a farle ritrovare la serenità? È quello che si chiede Banana alla fine del racconto, in un'amara riflessione sulla solitudine dell'uomo di fronte al dolore e sulla possibilità o meno di essere felici. L'ultimo racconto, che dà il titolo al libro, ha come protagonista Mimi, una ragazza che scopre il tradimento del fidanzato. Decide allora di cambiare città per cercare di dimenticarlo e incontra Nishiyama, la felicità: un piatto di riso al curry buonissimo fatto mescolando per caso alcuni ingredienti avanzati, tragicamente impossibile da ripetere una seconda volta con lo stesso, identico sapore. Con un linguaggio semplice e scorrevole, Banana Yoshimoto affronta in queste storie tematiche complesse ma, alla fine, i suoi personaggi riescono sempre a trovare nella riscoperta dei rapporti umani e nella placida quotidianità dei legami affettivi la serenità e la forza per continuare a vivere.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Japan",
    "Japanese Literature",
    "Contemporary",
    "Asian Literature",
    "Literary Fiction"
  ],
  "author": "Banana Yoshimoto",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/9646835-ricordi-di-un-vicolo-cieco"
}