{
  "title": "The Secret Mistress",
  "description": "In this enticing new romance ripe with sensuality and wit, \"New York Times \"bestselling author Mary Balogh proves that comfort is no match for passion when a stuffy gentleman becomes the object of desire of an adoring and spirited young woman. THE SECRET MISTRESS While Lady Angeline Dudley's pedigree dictates that she must land a titled gentleman, the irrepressible beauty secretly longs for a simple, ordinary suitor. No wild rakes like the men of her family, just a kind heart and good nature. So when Edward Ailsbury, the new Earl of Heyward, rescues her with unmatched civility from the advances of a scoundrel, Angeline thinks that she has found her true love. Persuading the earl is another matter entirely. Edward has his future neatly mapped out. He hopes to wed his steadfast companion, a woman who shares his values of loyalty, respect, and decorum. But arriving in London to take his seat in the House of Lords, he is derailed by Angeline, an exquisite bird of paradise seemingly devoted to sending his predictable life into chaos. From the brilliant hues of her fashion to her hoydenish antics, Angeline is the last woman on earth for Edward. And yet a stolen kiss in the moonlight awakens something deep and primal within him. Naturally, being a gentleman, he does the right thing after compromising a lady: He offers marriage. Angeline knows that Edward's proposal is born of duty, not love. But denying something so provocative and passionate is easier said than done. Deep down, Angeline believes that Edward's dedication to convention will melt behind closed doors, where sensuality and seduction play wicked games. For a proper wife by day can become a husband's secret mistress by night, when delicious desire rules.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Fiction",
    "Regency Romance"
  ],
  "author": "Mary Balogh",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/9645394-the-secret-mistress"
}