{
  "title": "From a Clear Blue Sky",
  "description": "A powerful survivor's account of the IRA bomb that killed the author's 14-year-old twin brother, his grandparents and a family friend, published on the 30th anniversary of the atrocity. Winner of the 2011 Christopher Ewart-Biggs Literary Award, and nominated for the 2009-2010 PEN/JR Ackerley prize.On the August bank holiday weekend in 1979, 14-year-old Timothy Knatchbull went out on a boat trip off the shore of Mullaghmore in County Sligo, Ireland. It was a trip that would cost four lives - and change his own for ever.The IRA bomb that exploded in their boat killed Knatchbull's grandfather Lord Mountbatten, his grandmother Lady Brabourne, his twin brother Nicholas, and local teenager Paul Maxwell. In telling this story for the first time, Knatchbull is not only revisiting the terrible events he and his family lived through, but also writing an intensely personal account of human triumph over tragedy.For thirty years, Knatchbull has lived with the echoes of that day: the death of the twin from whom he had been inseparable; the loss of his adored grandparents, whose funerals along with his twin's he and his parents were too injured to attend; the recovery from physical wounds; and the emotional legacy that proved harder to endure.In From A Clear Blue Sky Timothy Knatchbull delves into his past, present and future, and reveals a story of courage and fortitude as he, his family, and their English and Irish friends dealt with the shocking assassinations and their aftermath. Taking place in Ireland at the height of the Troubles, it gives a compelling insight into that period of Irish history. But more importantly it brings home that although tragedy can strike at any moment, the human spirit is able to recover and evolve over time.This book about truth and reconciliation, unflinching in its detail, asks searching questions about why human beings inflict misery on others, and holds lessons about how we can learn to forgive, to heal and to move on. It will resonate with readers the world over.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Ireland",
    "Biography",
    "History",
    "Biography Memoir",
    "Book Club"
  ],
  "author": "Timothy Knatchbull",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/9649017-from-a-clear-blue-sky"
}