{
  "title": "His Very Own Girl",
  "description": "From the author of Flawless and Starlight comes an emotional, sensual romance set during World War II about a female British civilian pilot and the American paratrooper medic who opens her heart. An eBook exclusive from Pocket Star! After the War took the lives of Lulu Davies's parents and her fiancé, she promised herself she would guard her heart carefully and concentrate on her great love--flying the biggest and best airplanes in the sky. Lulu is a pilot in the British civilian air force, ferrying planes around Great Britain and keeping her eye on a coveted spot in a training program for world-class pilots. She's perfectly content to strive for greatness in the skies, and dance with a few GIs on the way. Brawny, quiet American medic Joe Weber signed up with the paratroopers to escape his checkered past; he's hoping that jumping out of planes and patching up soldiers will earn him respect and a hopeful future. Joe's first real test of medical skill is on a pilot whose plane takes a hard landing in a training field; after rushing to the crash scene, he is stunned to come face-to-face with a gorgeous Rita Hayworth lookalike. And when the two cross paths at a dance hall a couple weeks later, he can't resist the urge to find out more about this spirited, dark-haired beauty.Their flirtation breaks all of Lulu's rules, but dance by dance, week by week, walk by walk, she finds herself falling in love with this honest, vulnerable man on the run from his demons. But as Lulu and Joe's undeniable attraction gains momentum, World War II steadily intensifies toward D-Day. Only time and hope will tell if the two lovers can overcome the past to form a beautiful life together in peace-time.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "World War II",
    "Historical Fiction",
    "War",
    "Military Fiction"
  ],
  "author": "Carrie Lofty",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/13223671-his-very-own-girl"
}