{
  "title": "Una storia di amore e di tenebra",
  "description": "Amore e tenebra sono due delle forze che agiscono in questo libro, un’autobiografia in forma di romanzo, un’opera letteraria complessa che comprende le origini della famiglia di Oz, la storia della sua infanzia e giovinezza prima a Gerusalemme e poi nel kibbutz di Hulda, l’esistenza tragica dei suoi genitori, e una descrizione epica della Gerusalemme di quegli anni, di Tel Aviv che ne è il contrasto, della vita in kibbutz, negli anni trenta, quaranta e cinquanta.La narrazione si muove avanti e indietro nel tempo, scavando in 120 anni di storia familiare una saga di rapporti d’amore e odio verso l’Europa, che vede come protagonisti quattro generazioni di sognatori, studiosi, uomini d’affari falliti e poeti egocentrici, riformatori del mondo, impenitenti donnaioli e pecore nere. Questa vasta galleria di personaggi mette a punto una sorta di \"cocktail genetico\" da cui nascerà un figlio unico, nutrito di fantasia, che, in un fatale momento di rivelazione avvenuta attraverso un dolore scioccante e atroce, scoprirà di essere un artista, uno scrittore.Amos Oz ci consegna la storia della sua infanzia e dell’adolescenza colma di aspirazioni poetiche, zelo politico e una paura costante di un altro genocidio degli ebrei, questa volta nella stessa Israele, a opera degli arabi, degli inglesi, dell’intero mondo cristiano, dell’intero mondo islamico. Il giovane Amos temeva che il mondo intero stesse tramando per uccidere tutti gli ebrei, bambini compresi, giovani sognatori fanatici compresi, proprio come era lui. \"A quell’epoca speravo di diventare un libro una volta adulto,\" scrive Oz, \"non un autore ma un libro… sapevo ovviamente che anche i libri possono bruciare, ma se fossi diventato un libro, avrei avuto almeno la possibilità di sopravvivere in una dimenticata libreria…\"Al centro di questo romanzo autobiografico sta il grande tabù di Oz: il suicidio della madre, nel 1952. L’esplorazione dolorosa e coraggiosa di questa tragedia viene condotta con lucidità, nostalgia e rancore, con pietà e travaglio, con schiettezza e un \"flusso di coscienza\" incredibilmente poetico che, con immediatezza, giunge al cuore del lettore.",
  "genres": [
    "Israel",
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "Jewish",
    "Literature"
  ],
  "author": "Amos Oz",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/9652282-una-storia-di-amore-e-di-tenebra"
}