{
  "title": "Paul Lafargue and the Founding of French Marxism, 1842–1882",
  "description": "Paul Lafargue, disciple and son-in-law of Karl Marx, was among the most important persons giving organized political expression to Marxism in France. He helped found both the first French collectivist party and the first French Marxist party. He was the first Marxist to sit in the French legislature and for three decades served as the chief theoretician and propagandist for Marxism in France. With his wife, Laura, he translated the Communist Manifesto and other works, introducing and applying Marxist thought in France.Demonstrating an almost seamless web between intellectual and family history, Leslie Derfler relates ideas and family identity in this account of the first forty years of Paul Lafargue’s life. Lafargue, like his famous father-in-law, called for ideological purity and demanded total hostility to anarchists and reformists. He insisted on economic determinism, the primacy of the concept of the class struggle, and the theory of surplus value. But he made his own contributions as well, particularly in his insistence on rejecting the domination of bourgeois values. Lafargue’s most famous pamphlet, The Right To Be Lazy , showed the advantages that labor could derive by rejecting the bourgeois work ethic. An intellectual of power, he pioneered in the application of Marxist methods of analysis to questions of anthropology, aesthetics, and literary criticism.Born in Cuba of mixed racial descent, Lafargue joined in demonstrations as a medical student in Paris in the 1860s and was forced into exile. Resuming his studies in London, he became a fixture in the Marx household until he married Laura Marx and moved to Paris. There he worked to expand the influence of the International Workingmen’s Association, but fled to Spain following the general repression after the fall of the Paris Commune. He continued his efforts on behalf of Marxism in Spain and then for ten years in London before returning to France, where he helped to found the new Marxist Parti Ouvrier Français, in 1882.",
  "genres": [],
  "author": "Leslie Derfler",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/966098.Paul_Lafargue_and_the_Founding_of_French_Marxism_1842_1882"
}