{
  "title": "Infinite Space, Infinite God II",
  "description": "Twelve science fiction stories featuring great adventure with a twist of faith. Infinite Space, Infinite God II spans the gamut of science fiction, from near-future dystopias to time travel to space opera, puzzles of logic to laugh-out-loud humor and against-the-clock suspense. A great read for any science fiction fan; a must-read for those seeking something new in their fiction.\"The Ghosts of Kourion\" by Andrew Seddon: A grieving professor escapes back in time to live among a doomed people.\"Antivenin\" by Karina Fabian: Rescue Sister Rita takes on a ship full of venomous snakes in order to save a friend. \"An Exercise in Logic\" by Barton Paul Levenson: How do you convince an infuriatingly logical race to stop an asteroid?\"Cathedral\" by Tamara Wilhite: A genetically engineered human spends the last of her tortured days righting her wrongs.\"Otherworld\" by Karina Fabian: Does sin really count when it's virtual?\"The Battle of the Narthex\" by Alex Lobdell: An alien battle in a most unusual setting--tickles the funny bone and touches the heart! \"Tenniel\" by Colleen Drippe': The battle for souls becomes a battle to the death.\"Tin Servants\" by J. Sherer: In order to serve his people, Paul becomes an android--but can he really care for them as a tin servant?\"Basilica\" by John Rundle: Caprizo battles machines and thwarts an enemy armada to keep a doomsday weapon from their hands.\"Cloned to Kill\" by D. Mak: How can a man of peace protect a clone designed to kill?\"Frankie Phones Home\" by Karina Fabian: A sixteen-year-old alien abductee calls her family on the way back for official First Contact. \"Dyads\" by Ken Pick and Alan Loewen: Enter the fascinating culture of the Thalendri in a story of intrigue, terrorist and religious tolerance.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Catholic"
  ],
  "author": "Andrew M. Seddon",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/9658622-infinite-space-infinite-god-ii"
}