{
  "title": "The Parnas: A Scene from the Holocaust",
  "description": "\"The psychiatrist's insight and the storyteller's skill offer an absorbing tale.\"—Elie Wiesel \"A book to read again and again with the same piety with which it has been written. A rare event in at once an accurate and documented historical study, and in the interpretation made by one of today's greatest psychologists of a strange and symbolic disease.\"—Primo Levi The Parnas  recreates the final days of Giuseppe Pardo Roques, the lay leader, or parnas, of the Sephardic Jewish community of Pisa, Italy, who was killed in his home by the Nazis in August, 1944. Pardo was a mentor to the author, and, indeed, he was a figure adored and celebrated not only by the Jews of Pisa but by the Christians as well. He was learned and generous, but he was also profoundly phobic. Animals terrified so much so that he almost never left his house—except to go to the synagogue—for fear of encountering stray dogs or cats. At the outbreak of World War II, Arieti fled to America where he became a renown psychiatrist. But the parnas, despite a wealth of connections that could have helped him escape, was too phobic to flee Pisa. On the morning of August 1, 1944, Nazi soldiers, searching for Pardo's fabled riches, entered his home. The soldiers found neither gold nor silver, but they did find the parnas, along with six fellow Jews whom he was sheltering and five Christian neighbors. All were murdered. In  The Parnas , Arieti imagines what took place in the home, and in the mind, of this devout, kindly, and tormented man in the last days of his life, providing, in the process, an overview of Italian Jewry. Arieti hopes to show \"that tragic times have a perfume of their own, and smiles of hope, and traces of charm, and offer olive branches and late warnings that may not be too late.\" \"This is one of the most extraordinary stories yet to reach us from the bitter ashes of Nazism…Dr. Arieti weaves his story so beautifully that to unravel it would mean losing its dramatic effect. Suffice it to say that God, Jews, Christians, fascism, cowardice, and bravery are discussed throughout the story in such a way that the reader is at once shaken and enlightened as the plot unfolds. It is like a parable, suffused with the dignity of both the parnas and the author…a work of art.\"— New York Times Book Review From the Foreword by Rabbi Harold S. \"In this brief, deceptively simple narrative, Arieti has told the story of Giuseppe Pardo, parnas (lay leader) of his native community of Pisa, and of his death at the hands of the Nazis. Pardo was the leading citizen of a small Jewish community that produced more that its share of distinguished Jews. He was a learned man, familiar with Bible, Talmud, and secular subjects. He was a wealthy man, and charitable to Jew and non-Jew alike. (He ultimately met his death together with six fellow Jews and five gentiles who had sought the protection of his home.) And he was a profoundly neurotic man, who had an irrational fear of animals, especially dogs. When he walked in the streets of Pisa—which was not often because of his fears—he would swing a cane from side to side behind him to drive away the imaginary animals. The distinguished psychiatrist tells of his strange life and equally strange death.\"",
  "genres": [
    "Holocaust",
    "Italy",
    "Judaica",
    "Nonfiction",
    "World War II"
  ],
  "author": "Silvano Arieti",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/966117.The_Parnas"
}