{
  "title": "No Word for Welcome: The Mexican Village Faces the Global Economy",
  "description": "Winner of the 2011 National Book Prize for Nonfiction from Grub Stree t and the 2012 International Latino Book Award for Best History / Political Book .\"Locals know the Isthmus of Tehuantepec, the 120-mile-wide strip of land that connects the Yucatan Peninsula to Oaxaca and Veracruz, as \"Mexico's little waist.\" The region is a hotbed of environmental and economic issues, such as the industrial shrimp farming that threatens to leave behind \"the coastal equivalent of a desert.\" Drawing on research, extensive interviews, and firsthand experiences living there in the early 2000s, Call, a translator of Mexican poetry and fiction, portrays villagers' traditional ways of life in the throes of massive change. (A Wal-Mart has already set up shop.) She cites Huatulco, a former fishing village, as foreshadowing what may lie in store for the \"more than 51,000 acres of beach, field, and forest became federal government property, controlled by FONATUR, the national tourism development agency.\" Villagers were expropriated, and two residents who refused to leave their homes wound up murdered. Call is never dry or academic; rather, she writes lively narrative, detailed description, and engaging scenes that render her subjects--a schoolteacher, fishermen, activists--three-dimensional. By relating the lives and concerns of isthmus dwellers and the struggles they face, the author raises awareness of globalization's effects on the village economy.\"-- Publishers Weekly\"Call's graceful movement between cultures demonstrates her considerable skills as a writer, and especially as a translator. For indeed she has a translator's ear.... Wendy Call's book is at once a portrait and a piece of that resistance, and a warning to the rest of the citizens of our global village.\"-- The Iowa Review\"We should be grateful for Wendy Call's delightful, yet painfully truthful, story of the challenges facing one of Mexico's lesser-known regions.\"-- Orion Magazine\"The book is full of color and life. When necessary, Call gives us numbers, quantities, and economic analysis. But...the book is simple, enlightening, and sensitizing. The economic discourse suggested by the words 'Global Economy' in the title is in fact secondary to the real-life stories of the 'Mexican Village.'\"-- Foreign Policy in Focus",
  "genres": [
    "Nonfiction"
  ],
  "author": "Wendy Call",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/9662842-no-word-for-welcome"
}