{
  "title": "Vampire for Christmas",
  "description": "New York Times and USA Today Best-selling paranormal romance author Felicity Heaton presents  Vampire for Christmas It was one last mission. Shannon, a demon hunter with the agency, is looking forward to leaving behind the small town and the vampire she’s been stuck with for the past two years. Things are getting complicated fast and she wants out. A fresh start, free of her vampire partner, awaits her if she can survive their final mission and the lonely Christmas holidays.  It was one last mission. Rafe, a vampire doing time with the agency, watches it approach with dread weighing heavily in his stomach. Two years of working with Shannon has been difficult, especially since he started falling for her, but he doesn’t want their partnership to end. He has barely a few days to make her face her feelings and stop her from leaving, and he intends to do just that.  When a slimy demon threatens the season of peace and goodwill, it’s the chance Rafe has been waiting for and the moment Shannon secretly fears. Rafe’s determination to prise open her heart and her own resolve to keep it closed clash as violently as they do with the demon, and threatens to end as messily.  Can Rafe make Shannon see that his love for her is real and that she feels something for him too? Can Shannon face her fears and her past, and stop herself from running away from both? Will a wish on a star bring her what her heart truly desires—a vampire for Christmas?  Other paranormal romance books by Felicity Heaton Her Angel romance series (Read the first book, Her Dark Angel, for FREE on Amazon Kindle) Eternal Mates romance series Vampire Erotic Theatre / V.E.T romance series (Read the first book, Covet, for FREE on Amazon Kindle) Vampires Realm romance series (Read the first book, Prophecy: Child of Light, for FREE on Amazon Kindle)",
  "genres": [
    "Vampires",
    "Paranormal Romance",
    "Romance",
    "Paranormal",
    "Christmas",
    "Holiday",
    "Novella"
  ],
  "author": "Felicity Heaton",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/9664620-vampire-for-christmas"
}