{
  "title": "Grand Hotel",
  "description": "Grand Hotel, della austriaca Vicki Baum, è stato uno dei primi best seller internazionali. Pubblicato in Germania nel 1929, presto tradotto in tutta Europa, già nel 1932 era diventato quel film da Oscar (con Greta Garbo e John Barrymore) che oggi ricordiamo meglio del romanzo che ne era all’origine: con la battuta finale – «Grand Hotel, gente che va, gente che viene» – che volgarizzava la fine del libro: «Si entra, si esce... si entra, si esce... si entra, si esce... Del resto è così che è la vita». Difatti è l’ambientazione – il Grand Hotel, appunto, in quegli anni simbolo popolare di vita privilegiata e moderna, sogno di massa –, il principale fattore, forse, del grande successo di lettori. «Gli hotel offrono opportunità infinite – asserisce la scrittrice Monica Ali –. Ogni ospite potenzialmente ha una storia. Altre storie nascono quando gli ospiti interagiscono. Basta il ruotare di una porta girevole. Grand Hotel, di Vicki Baum, dimostra questo principio alla perfezione. Sei persone si fermano in un albergo e nei successivi cinque giorni le loro vite si intrecciano. Il romanzo si muove tra personaggi storie e luoghi diversi e solo il Grand Hotel fa da collante a tutti questi frammenti». Un movimento frenetico, che trascina il tragico passato di ciascun personaggio in un’apparente pausa del presente in cui al contrario i destini si compiono; e questo è reso dall’autrice con una strategia narrativa, con un «montaggio» visivo significativamente attuale: l’affaccendato cicaleccio della hall dell’albergo, l’aprirsi e il richiudersi della bussola rotante, scandiscono i diversi quadri della trama, come se i sei personaggi ogni volta fossero zoom che inquadrano e lanciano in primo piano i volti isolati, presi da una moltitudine indifferenziata. E come se le mura dell’albergo racchiudenti i personaggi, rappresentassero al contrario la città che escludono, metafora della sterminata e modernissima metropoli berlinese. Sicché Grand Hotel, best seller senza apparenti pretese simboliche, mostra oggi la forza di figurare la moderna folla solitaria al suo nascere, la massa anonima, dentro cui s’ammucchiano innumerevoli tragedie silenziose, l’una affiancata all’altra ma prive perfino dell’energia esistenziale di accorgersi l’una dell’altra.",
  "genres": [
    "Fiction",
    "Classics",
    "Germany",
    "German Literature",
    "Historical Fiction",
    "Literary Fiction",
    "20th Century"
  ],
  "author": "Vicki Baum",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/9667308-grand-hotel"
}