{
  "title": "Alphabetter Juice or, The Joy of Text",
  "description": "Fresh-squeezed Lexicology, with TwistsNo man of letters savors the ABC’s, or serves them up, like language-loving humorist Roy Blount Jr. His glossary, from ad hominy to zizz , is hearty, full bodied, and out to please discriminating palates coarse and fine. In 2008, he celebrated the gists, tangs, and energies of letters and their combinations in Alphabet Juice , to wide acclaim. Now, Alphabetter Juice . Which is better .This book is for anyone—novice wordsmith, sensuous reader, or career grammarian—who loves to get physical with words. What is the universal sign of disgust, ew , doing in beautiful and cutie ? Why is toadless , but not frogless , in the Oxford English Dictionary? How can the U. S. Supreme Court find relevance in gollywoddles ? Might there be scientific evidence for the sonicky value of hunch ? And why would someone not bother to spell correctly the very word he is trying to define on Urbandictionary.com?Digging into how locutions evolve, and work, or fail, Blount draws upon everything from The Tempest to The Wire . He takes us to Iceland, for salmon-watching with a “girl gillie,” and to Georgian England, where a distinguished etymologist bites off more of a “giantess” than he can chew. Jimmy Stewart appears, in connection with kludge and the bombing of Switzerland. Litigation over supercalifragilisticexpialidocious leads to a vintage werewolf movie; news of possum-tossing, to metanarrative.As Michael Dirda wrote in The Washington Post Book World , “The immensely likeable Blount clearly possesses what was called in the Italian Renaissance ‘sprezzatura,’ that rare and enviable ability to do even the most difficult things without breaking a sweat.” Alphabetter Juice is brimming with sprezzatura. Have a taste.",
  "genres": [
    "Nonfiction",
    "Language",
    "Humor",
    "Linguistics",
    "History"
  ],
  "author": "Roy Blount Jr.",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/9663292-alphabetter-juice-or-the-joy-of-text"
}