{
  "title": "The Dirty Big Book of Sex Quotes: Plus Sexy Biographies from Woody Allen, Madonna, Marilyn Monroe, Jenna Jameson, Mae West, Oscar Wilde, Bill Maher and More!",
  "description": "American poet Amy Lowell once remarked that \"Sexual love is the most stupendous fact of the universe, and the most magical mystery our poor blind senses know.\" As Lowell suggests sex can be an amazing part of human nature that touches the core of our being and gives us the opportunity to lose ourselves in mind-blowing bliss and ecstasy. But, on the other hand many still see sex as a taboo subject fraught with seemingly life and soul threatening dangers at every turn. This fear of human sexuality is so deeply embedded within our psyche that Martin Luther, the great Protestant reformer, once suggested that ‘had God consulted me in the matter [of human reproduction], I should have advised Him to continue the generation of the species by fashioning them out of clay.’While such negative beliefs around sex and been slowly eroding over the past 50 years, it is still very difficult for many to accept their own sexuality. Unfortunately, we are still conflicted with a tremendous amount of religious infused guilt over sex. Perhaps we should consider the sage advice of actress Bette Davis when she remarked that \"sex is God's joke on human beings.\" If the joke is really on us then it would it not make a whole lot more sense for society to drop all its pious pretenses around sex and embrace and celebrate it whole heartedly? In my view the answer to that question is a resounding YES!This celebration of sex is what the readers of my first collection, The DIRTY Little Book of SEX Quotes thoroughly enjoyed. Just like the first collection, this compilation concentrations on delivering more of what my readers found so enjoyable; a collection of evocative, thought provoking, contentious, witty, outrageous, uplifting and hilariously funny sex quotes; plus a whole lot MORE! In The DIRTY Big Book of SEX Quotes you will find it jam packed with so much new material including:• More than 600 new sex quotes that you will thoroughly enjoy.• Over 100 strange sex laws from around the world that will leave you dumbfounded.• More than 300 fascinating pieces of sex trivia.• Nearly a 1,000 hilarious sex euphemisms. • Over 100 beautiful illustrations and pictures.Moreover, this book has been organized into over 100 page turning categories divided into 10 chapters. At the start of each chapter you will find a biography from a famous personality complete with their collection of juicy sex quotes. Included are biographies from such icons and public figures as:• Woody Allen• Marilyn Monroe• Madonna• Jenna Jameson• George Burns• Mae West• Bill Maher• Jerry Falwell• Rodney Dangerfield• Oscar Wilde. D.H. Lawrence once remarked that \"Sex and beauty are inseparable, like life and consciousness. And the intelligence which goes with sex and beauty, and arises out of sex and beauty, is intuition.\" Something this beautiful should clearly be celebrated! The DIRTY Big Book of SEX Quotes is my contribution to that celebration by injecting humor, joyfulness, beauty and irreverence into a area of our lives that truly deserves it.",
  "genres": [
    "Sexuality"
  ],
  "author": "Mark Zedler",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/13225126-the-dirty-big-book-of-sex-quotes"
}