{
  "title": "Pick Your Poison: How Our Mad Dash to Chemical Utopia is Making Lab Rats of Us All",
  "description": "How the chemicals in everyday products are killing us—and what the government is not doing about it Did you know that \"\"nontoxic\"\" usually means \"\"never tested\"\"? Or that many green cleaners are good for the environment but terrible for you? Chemist and activist Monona Rossol goes from under your sink to the halls of the powerful, tracing America’s love affair with chemicals that kill, explaining how much worse the problem has gotten in the last decade. Shocking and appalling and completely reckless—that’s how she describes the current prevalence of harmful chemicals in our everyday lives. Scientists have started linking our increased rates of cancer, autism, obesity, and asthma (among others) to chemical exposure and Rossol points the finger directly at the companies and executives making millions of dollars by polluting our environment and introducing toxic chemicals into our bodies. She chronicles how everyday toxins get into our bodies and accumulate over time and provides us with inspiration to make changes at the checkout lines. She also explains that Americans are not nearly as well protected by our government as we might think we are. Unlike the European Union, the United States allows chemical companies to produce toxins for use in U.S. consumer products with little to no oversight. While her tone is wry and entertaining, she’s also well informed, and her fact-filled treatise makes for absolutely terrifying reading. If you’re alarmed by the health risks of the many hazardous chemicals we encounter at home, work, and school, don’t get frightened, get informed. Read Pick Your Poison to learn the facts and find out what you can do about the daily onslaught of toxins that are making lab rats of us all.",
  "genres": [
    "Nonfiction",
    "Health",
    "Science",
    "Reference",
    "Audiobook"
  ],
  "author": "Monona Rossol",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/9667541-pick-your-poison"
}