{
  "title": "The Crash Course: The Unsustainable Future of Our Economy, Energy, and Environment",
  "description": "The next twenty years will be completely unlike the last twenty years. The world is in economic crisis, and there are no easy fixes to our predicament. Unsustainable trends in the economy, energy, and the environment have finally caught up with us and are converging on a very narrow window of time—the \"Twenty-Teens.\" The Crash Course presents our predicament and illuminates the path ahead, so you can face the coming disruptions and thrive--without fearing the future or retreating into denial. In this book you will find solid facts and grounded reasoning presented in a calm, positive, non-partisan manner. Our money system places impossible demands upon a finite world.  Exponentially rising levels of debt, based on assumptions of future economic growth to fund repayment, will shudder to a halt and then reverse. Unfortunately, our financial system does not operate in reverse. The consequences of massive deleveraging will be severe. Oil is essential for economic growth. The reality of dwindling oil supplies is now internationally recognized, yet virtually no developed nations have a Plan B.  The economic risks to individuals, companies, and countries are varied and enormous. Best-case, living standards will drop steadily worldwide. Worst-case, systemic financial crises will toss the world into jarring chaos. This book is written for those who are motivated to learn about the root causes of our predicaments, protect themselves and their families, mitigate risks as much as possible, and control what effects they can. With challenge comes opportunity, and The Crash Course offers a positive vision for how to reshape our lives to be more balanced, resilient, and sustainable.From the Warning Signs for the PlanetAuthor Dr. Chris Martenson Warning signs for our minerals and energy • Oil discoveries peaked in 1964• New oil discoveries have been outpaced by oil consumption by nearly 4 to 1 each year• Known deposits of several critical minerals will be completely exhausted within 20 years, assuming the energy is there to extract them. Others will peak all on their own soon thereafter, and even sooner if Peak Oil limits our ability to obtain them.• New ore deposits are getting harder to find, more remote, deeper down, more dilute, and/or all of the above.Warning signs for our food and water • World population will climb to 9.5 billion by 2050.• Nearly all high-quality arable land is already under production.• Food yields are heavily dependent on fertilizers, which are either energy intensive to make or are being depleted and will someday peak.• Soils are being mined by the practice of removing essential nutrients without replacing them.Warning signs for our • 40% decline in oceanic phytoplankton since 1950• Birds, bees, and bats in serious population decline over the past few years• Fisheries collapsing all over the globe• Mercury levels in marine mammals so high that the EPA would treat their carcasses as toxic waste• Sterilized soils and advancing deserts• Species extinction rates that rival anything in geologic records",
  "genres": [
    "Economics",
    "Nonfiction",
    "Environment",
    "Sustainability",
    "Business",
    "Politics",
    "History"
  ],
  "author": "Chris Martenson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/9663894-the-crash-course"
}