{
  "title": "The Hungry Years: Confessions of a Food Addict",
  "description": "“Hunger is the loudest voice in my head. I’m hungry most of the time.”William Leith began the eighties slim; by the end of that decade he had packed on an uncomfortable amount of weight. In the early nineties, he was slim again, but his weight began to creep up once more. On January 20th, 2003, he woke up on the fattest day of his life. That same day he left London for New York to interview controversial diet guru Dr. Robert Atkins. But what was meant to be a routine journalistic assignment set Leith on an intensely personal and illuminating journey into the mysteries of hunger and addiction.From his many years as a journalist, Leith knows that being fat is something people find more difficult to talk about than nearly anything else. But in The Hungry Years he does precisely that. Leith uses his own pathological relationship with food as a starting point and reveals himself, driven to the kitchen first thing in the morning to inhale slice after slice of buttered toast, wracked by a physical and emotional need that only food can satisfy. He travels through fast food-scented airports and coffee shops as he explores the all-encompassing power of advertising and the unattainable notions of physical perfection that feed the multibillion dollar diet industry.Fat has been called a feminist William Leith’s unblinking look at the physical consequences and psychological pain of being an overweight man charts fascinating new territory for everyone who has ever had a craving or counted a calorie. The Hungry Years is a story of food, fat, and addiction that is both funny and heartwrenching.I was sitting in a café on the corner of 3rd Avenue and 24th Street in Manhattan, holding a menu. I was overweight. In fact, I was fat. Like millions of other people, I had entered into a pathological relationship with food, and with my own body. For years I had desperately wanted to write about why this had happened — not just to me, but to all those other people as well. I knew it had a lot to do with food. But I also knew it was connected to all sorts of outside forces. If I could understand what had happened to me, I could tell people what had happened to them, too. Right there and then, I decided that I would do everything to discover why I had got fat. I would look at every angle. And then I would lose weight, and report back from the slim world.—Excerpt from The Hungry YearsFrom the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Health",
    "Food",
    "Autobiography",
    "Biography",
    "Cooking"
  ],
  "author": "William Leith",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/967340.The_Hungry_Years"
}