{
  "title": "Sing Them Home",
  "description": "The eagerly anticipated second novel from the author of Broken for You - a national best seller and selection of the Today Show Book Club - is a sweeping, gorgeously crafted family story set in the American heartland.With her best-selling debut novel, Broken for You, Stephanie Kallos earned comparisons to John Irving, Anne Tyler, Margaret Atwood, and Carol Shields, establishing her as a writer of uncommon “wisdom and soulfulness” (Sue Monk Kidd). Sing Them Home is a deeply moving portrait of three grown siblings who have lived in the shadow of unresolved grief since their mother’s mysterious disappearance when they were children. Everyone in Emlyn Springs, Nebraska, knows the story of Hope Jones, the physician’s wife whose big dreams for their tiny town were lost along with her in the tornado of 1978. For Hope’s three young children, the stability of life with their distant, preoccupied father, and with Viney, their mother’s spitfire best friend, is no match for their mother’s absence. Larken, the eldest, is an art history professor who seeks in food an answer to a less tangible hunger; Gaelan, the only son, is a telegenic weatherman who devotes his life to predicting the unpredictable and whose profession, and all too much more, depend on his sculpted frame and ready smile; and Bonnie, the baby of the family is a self-proclaimed archivist who combs the roadsides for clues to her mother’s legacy, and permission to move on. When, decades after their mother’s disappearance, they are summoned home after their father’s sudden death, they are forced to revisit the childhood tragedy at the center of their lives. With breathtaking lyricism, wisdom, and humor, Stephanie Kallos explores the consequences of protecting the ones we love. Sing Them Home is a magnificent tapestry of lives connected and undone by tragedy, lives poised—unbeknownst to the characters themselves—for redemption.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Audiobook",
    "Family",
    "Adult",
    "Literary Fiction"
  ],
  "author": "Stephanie Kallos",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/96703.Sing_Them_Home"
}