{
  "title": "The Fall of the House of Zeus: The Rise and Ruin of America's Most Powerful Trial Lawyer",
  "description": "“Masterful . . . an epic tale of backbiting, shady deal-making, and greed [that] reads like a John Grisham novel.”—The Wall Street Journal A real-life legal thriller as timeless as a Greek tragedy, tracing the downfall of one of America’s most famous lawyers and exposing the dark side of Southern politics—from the author of When Evil Lived in Laurel Dickie Scruggs was arguably the most successful plaintiff’s lawyer in America. A brother-in-law of former U.S. Senate majority leader Trent Lott, Scruggs made a fortune taking on mass tort lawsuits against Big Tobacco and the asbestos industries. He was hailed by Newsweek as a latter-day Robin Hood and was portrayed in the movie The Insider as a dapper aviator-lawyer. Scruggs’s legal triumphs rewarded him lavishly, and his success emboldened both his career maneuvering and his influence in Southern politics—but at a terrible cost, culminating in his spectacular fall, when he was convicted for conspiring to bribe a Mississippi state judge. Based on extensive interviews, transcripts, and FBI recordings never made public, The Fall of the House of Zeus uncovers the Washington legal games and power the swirl of fixed cases, blocked investigations, judicial tampering, and a zealous prosecution that would eventually ensnare not only Scruggs but his own son, Zach, in the midst of their struggle with insurance companies over Hurricane Katrina damages. Featuring Trent Lott and Jim Biden, brother of then-Senator Joe Biden, in supporting roles, with cameos by John McCain, Al Gore, and other Washington insiders, Curtis Wilkie’s account of this uniquely American tragedy reveals the seedy underbelly of institutional power.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Law",
    "Business",
    "Politics",
    "Crime",
    "History"
  ],
  "author": "Curtis Wilkie",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/9670636-the-fall-of-the-house-of-zeus"
}