{
  "title": "Daisy Comes Home",
  "description": "The Barnes & Noble ReviewLegendary author and illustrator Jan Brett transforms Scandinavian illustrations and stories to explore the beauty and color of China. Inspired by a favorite childhood story, The Story of Ping, Brett writes of six hens in China. Cared for by the young Mei Mei, the hens lay eggs for selling at the market. But one hen, Daisy, is not so happy. Picked at and plucked by the others, she is ousted from the clan and often sleeps alone on the cold damp floor. Eager for a good night's rest, she retires to a basket on the edge of the river. But the river rises and takes Daisy with it! She awakes surrounded by water and soon fends off a frightful dog, a terrifying buffalo, and a clan of squawking monkeys. But Daisy stands up to every one of these creatures and survives the wild waters. However, when a fisherman captures her and plans to eat her for dinner, there is nothing she can do. Meanwhile, Mei Mei's unsuccessful search for Daisy ends as she tearfully packs up the eggs and heads to market. Luckily, she finds Daisy there, and with a little call of \"Gu-gu-gu-gu-gu!\" Daisy comes running.Back at the henhouse, Daisy uses her newly learned skills to stave off the mean hens and gain a rightful spot on the perch. Brett's illustrations truly amaze. Her well-known eye for detail flourishes in the beautiful land of China. From exquisite landscapes to the fine features of all the animals, Brett lets her imagination and her wondrous skill take hold. Mountains become animals upon closer investigation, and the market will entice readers with its color and the bustling activity of the many people selling their wares. Brett traveled to China for inspiration and it shows in every page. The layouts are framed with bamboo and feature mini-scenes from the story in the corners. This tale of empowerment will appeal to young readers as Daisy stands on her own and doesn't run away. Rather, she returns to face her foes and holds her ground. An important lesson and a beautiful tale. (Amy Barkat)",
  "genres": [
    "Picture Books",
    "Childrens",
    "China",
    "Animals",
    "Fiction",
    "Asia",
    "Adventure"
  ],
  "author": "Jan Brett",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/967508.Daisy_Comes_Home"
}