{
  "title": "A Very Merry Chase",
  "description": "Set in early 19th century Regency England, and harking back in style to the heyday of Georgette Heyer and Barbara Cartland, A Very Merry Chase is a comedy of manners and errors that boasts empire fashions, dashing characters, verbal sparring matches and witty repartee mingled with just a hint of mystery, danger and intrigue.***The highwayman was tall, so much so that he had to stoop to see his worthy opponent...even through the coach's open door. He wore a dark cloak topped off with a wide brimmed hat and a black mask, off-setting large gray eyes, which glittered like steel in the moonlight. A sardonic smile played over his generous, well formed lips and highlighted the strength of his jaw.\"Would I be correct in assuming you to be the famous—or shall we say, infamous—Lady Sabrina St. Clair? She, who dazzles the male population of the ton with her beauty only to break their hearts, and who causes the ladies to bristle with envy as dark and as green as her own lovely eyes?\"Her look of disgust elicited a deep laugh that only made her more beautifully angry. The devil took hold of him. He could not resist further goading her. \"Before you so rudely interrupted me, My Lady, I do believe we were discussing recompense.\"Sabrina grabbed up her reticule which she flung once more into his smirking face. \"Take this and be done with it! Aye, and the jewels as well,\" she said, kicking the heavy case nearer to the door. \"Take them all and be done with it. ‘tis a small enough price to pay to be rid of you.\"\"You offer your jewels most freely, my pet. Could it be that you do not cherish them overmuch—or could it be that you have other jewels upon which you set a higher value?\"“I am most certainly not your pet! And I am indeed most assuredly apologetic, sir, if you are disappointed in my meager supply of jewels.\" Her carefully articulated words slowly dripped with near deadly venom. \"When next we meet, I will contrive to bring a better selection for your procurement.\"\"Ah, but you mistake my simple words, my p... my lovely Firebrand. Cold hard stones cannot hold a candle to the living, breathing prize I see before me. No...my love, I think I would prefer that which mere coin cannot purchase…a closer look at the emerald of your eyes, the warm luster of your pearly skin, and the touch of your ruby lips—that...that my dear lady would be prize plunder indeed.\"He expected genteel fireworks; but received instead a heartfelt shock. His reward was neither ladylike blushes nor even a delicate swoon. Sabrina retaliated with a stinging slap and a veritable tirade of angry rants and furious imprecations.When her angry diatribe finally wound to a breathless close, he laughed out loud before slowly, exaggeratedly applauding her most unladylike display of temper. \"Well done. Well done, indeed, little Firebrand.\"Insulted and outraged, she started to speak, but he stopped her with a finger to his well-formed lips and a shake of his head. \"Seriously, my dear. Tsk. Tsk. And here I believed myself in the company of a fine lady—showing you all the courtesy due to one of your supposedly elevated station.\"\"Bloody hell, you did.\" she replied, attempting to land another stinging slap.At this point, Lady Bethany, shocked absolutely to the core of her gentle soul, could take no more and swooned dead away.He pointed this out with no little enjoyment. \"Now, my fine lady, look what you've done.",
  "genres": [
    "Historical Romance",
    "Regency Romance",
    "Historical",
    "Historical Fiction",
    "Romance"
  ],
  "author": "Teresa Thomas Bohannon",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/9676803-a-very-merry-chase"
}