{
  "title": "The Devil's Tickets: A Vengeful Wife, a Fatal Hand, and a New American Age",
  "description": "Kansas City, 1929: Myrtle and Jack Bennett sit down with another couple for an evening of bridge. As the game intensifies, Myrtle complains that Jack is a “bum bridge player.” For such insubordination, he slaps her hard in front of their stunned guests and announces he is leaving. Moments later, sobbing, with a Colt .32 pistolin hand, Myrtle fires four shots, killing her husband.The Roaring 1920s inspired nationwide fads–flagpole sitting, marathon dancing, swimming-pool endurance floating. But of all the mad games that cheered Americans between the wars, the least likely was contract bridge. As the Barnum of the bridge craze, Ely Culbertson, a tuxedoed boulevardier with a Russian accent, used mystique, brilliance, and a certain madness to transform bridge from a social pastime into a cultural movement that made him rich and famous. In writings, in lectures, and on the radio, he used the Bennett killing to dramatize bridge as the battle of the sexes. Indeed, Myrtle Bennett’s murder trial became a sensation because it brought a beautiful housewife–and hints of her husband’s infidelity–from the bridge table into the national spotlight. James A. Reed, Myrtle’s high-powered lawyer and onetime Democratic presidential candidate, delivered soaring, tear-filled courtroom orations. As Reed waxed on about the sanctity of womanhood, he was secretly conducting an extramarital romance with a feminist trailblazer who lived next door.To the public, bridge symbolized tossing aside the ideals of the Puritans–who referred derisively to playing cards as “the Devil’s tickets”–and embracing the modern age. Ina time when such fearless women as Amelia Earhart, Dorothy Parker, and Marlene Dietrich were exalted for their boldness, Culbertson positioned his game as a challenge to all housebound women. At the bridge table, he insisted, a woman could be her husband’s equal, and more. In the gathering darkness of the Depression, Culbertson leveraged his own ballyhoo and naughty innuendo for all it was worth, maneuvering himself and his brilliant wife, Jo, his favorite bridge partner, into a media spectacle dubbed the Bridge Battle of the Century. Through these larger-than-life characters and the timeless partnership game they played, The Devil’s Tickets captures a uniquely colorful age and a tension in marriage that is eternal.From the Hardcover edition.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Book Club",
    "Mystery",
    "Historical"
  ],
  "author": "Gary M. Pomerantz",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/9680083-the-devil-s-tickets"
}