{
  "title": "Your Movie Sucks",
  "description": "Roger Ebert's I Hated Hated Hated This Movie , which gathered some of his most scathing reviews, was a best-seller. This new collection continues the tradition, reviewing not only movies that were at the bottom of the barrel, but also movies that he found underneath the barrel.From Roger's review of Deuce European Gigolo (0 stars): \"The movie created a spot of controversy in February 2005. According to a story by Larry Carroll of MTV News, Rob Schneider took offense when Patrick Goldstein of the Los Angeles Times listed this year's Best Picture nominees and wrote that they were 'ignored, unloved, and turned down flat by most of the same studios that . . . bankroll hundreds of sequels, including a follow-up to Deuce Male Gigolo , a film that was sadly overlooked at Oscar time because apparently nobody had the foresight to invent a category for Best Running Penis Joke Delivered by a Third-Rate Comic.'Schneider retaliated by attacking Goldstein in full-page ads in Daily Variety and the Hollywood Reporter . In an open letter to Goldstein, Schneider 'Well, Mr. Goldstein, I decided to do some research to find out what awards you have won. I went online and found that you have won nothing. Absolutely nothing. No journalistic awards of any kind. . . . Maybe you didn't win a Pulitzer Prize because they haven't invented a category for Best Third-Rate, Unfunny Pompous Reporter Who's Never Been Acknowledged by His Peers. . . .'Schneider was nominated for a 2000 Razzie Award for Worst Supporting Actor, but lost to Jar-Jar Binks. But Schneider is correct, and Patrick Goldstein has not yet won a Pulitzer Prize. Therefore, Goldstein is not qualified to complain that Columbia financed Deuce European Gigolo while passing on the opportunity to participate in Million Dollar Baby, Ray, The Aviator, Sideways , and Finding Neverland . As chance would have it, I have won the Pulitzer Prize, and so I am qualified. Speaking in my official capacity as a Pulitzer Prize winner, Mr. Schneider, your movie sucks.\"",
  "genres": [
    "Nonfiction",
    "Film",
    "Media Tie In",
    "Essays",
    "Humor",
    "Reference",
    "Criticism"
  ],
  "author": "Roger Ebert",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/96765.Your_Movie_Sucks"
}