{
  "title": "Charles Sanders Peirce: A Life",
  "description": "Charles Sanders Peirce was born in September 1839 and died five months before the guns of August 1914. He is perhaps the most important mind the United States has ever produced. He made significant contributions throughout his life as a mathematician, astronomer, chemist, geodesist, surveyor, cartographer, metrologist, engineer, and inventor. He was a psychologist, a philologist, a lexicographer, a historian of science, a lifelong student of medicine, and, above all, a philosopher, whose special fields were logic and semiotics. He is widely credited with being the founder of pragmatism. In terms of his importance as a philosopher and a scientist, he has been compared to Plato and Aristotle. He himself intended \"to make a philosophy like that of Aristotle.\" Peirce was also a tormented and in many ways tragic figure. He suffered throughout his life from various ailments, including a painful facial neuralgia, and had wide swings of mood which frequently left him depressed to the state of inertia, and other times found him explosively violent. Despite his consistent belief that ideas could find meaning only if they \"worked\" in the world, he himself found it almost impossible to make satisfactory economic and social arrangements for himself. This brilliant scientist, this great philosopher, this astounding polymath was never able, throughout his long life, to find an academic post that would allow him to pursue his major interest, the study of logic, and thus also fulfill his destiny as America's greatest philosopher. Much of his work remained unpublished in his own time, and is only now finding publication in a coherent, chronologically organized edition. Even more astounding is that,despite many monographic studies, there has been no biography until now, almost eighty years after his death. Brent has studied the Peirce papers in detail and enriches his account with numerous quotations from letters by Peirce and by his friends. In this edition Brent refines his interpretation of Peirce's thought and character based on new research, and has added a glossary and a detailed chronology. \"Brent ...has given us a full and compelling account of Peirce's troubled career and a wealth of persuasive arguments and plausible inferences (what Peirce called 'abductions') to help explain it.\" - \"Science\". \"Joseph Brent's splendid biography of Charles S. Peirce (1839ETH1914) dispels much of the mystery that has surrounded the difficult life and career of America's greatest philosopher.\" - \"American Historical Review\" \"This outstanding book, the first full-scale biography of Peirce, illuminates both Peirce's life and his philosophy.\" - \"Library Journal\". \" ...an extraordinary, inspiring portrait of the largely forgotten Peirce, a progenitor of modern thought who devised a realist metaphysics and attempted to achieve direct knowledge of God by applying the logic of science.\" - \"Publishers Weekly\". \" ...a forceful and beautifully written account of the life and work of Peirce ...places the demonic aspects of Peirce's personality in their proper social and psychological contexts.\" - \"Semiotica\". \"Brent's book is a great example of biographical writing. The final essay, \"The Wasp in the Bottle,\" is astonishingly good, a masterpiece.\" - \"Charles Hartshorne\".",
  "genres": [
    "Biography",
    "Philosophy",
    "History"
  ],
  "author": "Joseph Brent",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/967616.Charles_Sanders_Peirce"
}