{
  "title": "Queer Others in Victorian Gothic: Transgressing Monstrosity",
  "description": "In Queer Others in Victorian Gothic, Ardel Haefele-Thomas examines a number of nineteenth- and twentieth-century Gothic novels, short stories, and films through the lens of queer cultural studies. In some of these works, as Haefele-Thomas demonstrates, the author or filmmaker fully intended to explore the complicated landscape of queer sexuality and gender identity. In most, however, the author or filmmaker’s intentions are unclear. Haefele-Thomas takes on these works, first employing “queer” in its nineteenth-century historical context, to point to their generally weird, odd, or ill components. She then explores them using “queer” in the complex and politically charged context from the late twentieth and early twenty-first centuries. Haefele-Thomas argues that part of what makes these texts Gothic are their covert queer content. She also reveals that queer theory—lacking the gender specificity found in gay and lesbian theories and historiographies—allows room to convey gender, sexuality, race, class, and familial structures in a specific state of anti-categorization. Queers Others in Victorian Gothic will appeal to anyone interested in the intersection of gender, sexuality, and literary criticism.TABLE OF CONTENTS:Acknowledgements1. Introduction2. The Spinster and the Hijra: How Queers Save Heterosexual Marriage in Wilkie Collins’s The Woman in White and The Moonstone3. Escaping Heteronormativity: Queer Family Structures in Elizabeth Gaskell’s Lois the Witch and ’The Grey Woman’4. Disintegrating Binaries, Disintegrating Bodies: Queer Imperial Transmogrification in H. Rider Haggard’s She5. ’One does things abroad that one would not dream of doing in England’: Miscegenation and Queer Female Vampirism in J. Sheridan Le Fanu’s Carmilla and Florence Marryat’s The Blood of the Vampire6. In Defence of Her Queer Community: Vernon Lee’s Decoded Decadent GothicNotesBibliographyIndex",
  "genres": [
    "Nonfiction",
    "Gothic",
    "LGBT",
    "Queer",
    "19th Century",
    "Horror",
    "History"
  ],
  "author": "Ardel Haefele-Thomas",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13226478-queer-others-in-victorian-gothic"
}