{
  "title": "Ozark Magic and Folklore",
  "description": "The Ozark region of Missouri and Arkansas has long been an enclave of resistance to innovation and \"newfangled\" ideas. Many of the old-time superstitions and customs have been nurtured and kept alive through the area's relative isolation and the strong attachment of the hillfolk to these old attitudes. Though modern science and education have been making important inroads in the last few decades, the region is still a fertile source of quaint ideas, observances, and traditions.People are normally reticent about their deepest beliefs, especially with outsiders. The author, however, has lived in the Ozarks since 1920 and has long since been a student of Ozark life—and a writer of a number of books and articles on various aspects of the subject. Through casual conversations rather than by direct questioning, he has been able gradually to compile a singularly authentic record of Ozark superstition. His book contains a vast amount of folkloristic material, including legends, beliefs, ritual verses and sayings and odd practices of the hillpeople, plus a wealth of general cultural data. Mr. Randolph discusses weather signs; beliefs about auspicious times for planting crops, butchering hogs, etc.; prenatal influence in \"marking\" babies; backwoods beauty treatments; lucky charms, omens and auguries; courtship jinxes, love potions, etc.; dummy suppers; and numerous other customs and convictions—many racy and amusing, others somewhat grisly or spooky.Here you'll meet and learn about the yarb doctor who prepared curious remedies of herbs and odd concoctions; power doctors who use charms, spells, and exorcism to effect cures; granny-women (mountain midwives); \"doodlebuggers\" and witch wigglers who find water with the aid of divining rods; \"conjurefolk\" and Holy Rollers; witches and goomer doctors; clairvoyants and fortune-tellers; plus the ordinary finger-crossing, wish-making citizens of the area. The general reader as well as the specialist in particular fields of cultural anthropology, etc. will truly enjoy this lively survey of lore and practice—a little-known but fascinating slice of American life.Its gentle humor takes the reader into the hills with the author. The book deserves a place in any general collection of Americana and in all collections of folklore,\" U.S. QUARTERLY BOOKLIST. \"A veritable treasury of backwoods custom and belief… [ a ] wealth of circumstantial detail and cultural background,\" Carl Withers, N.Y. TIMES.",
  "genres": [
    "History",
    "Folklore",
    "Nonfiction",
    "Witchcraft",
    "American History",
    "Anthropology",
    "Magic"
  ],
  "author": "Vance Randolph",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/967817.Ozark_Magic_and_Folklore"
}