{
  "title": "Rough Cut",
  "description": "Jude, the son of Vanna St Clair - the voluptuous star of a series of controversial British horror films in the 1970s, who died forgotten - is offered the opportunity to write her biography, a warts-and-all expose of the seamy side of the British film industry.But this proves no ordinary book, and Vanna is no ordinary subject.When Jude discovers the existence of \"Charred Image\", a fabled lost film - the last project Vanna worked on with director Derek Reef, her lover - his life is changed forever. Jude is led on a dark journey that leads to the Daleside, a brooding derelict mental asylum, the location where the footage was shot. Only there can he finally lay his ghosts to rest.As phantoms tumble off the silver screen, Jude realises that life, unlike most movies, doesn’t always have a neat and happy ending.Sometimes the roughest cut is the deepest.Cover illustration and design by Vincent Chong.\"A compelling search for a lost film and then rises to heights of visionary horror. Richly atmospheric, it builds on classic terrors to reveal new ones. Its sense of a haunted landscape is worthy of the greats.\" - Ramsey Campbell\"An unguided tour through the secret history of the British horror film, in which its stock elements – inverted crucifixes, exposed breasts, fake blood – are revealed as a mask for something far more disturbing. McMahon prowls the backstreets of trash cinema and weird fiction with his own private agenda. His writing is fierce, intelligent and mood-swingy. Like a signet ring, this story will leave its mark on you.\" - Joel Lane\"[A]n intelligent, well-crafted novel that was obviously written from the heart... told just as it has to be told, knife-blade straight and underlain with passion.\" - Terry Grimwood, Whispers of Wickedness\"[E]ssentially a well crafted and very readable piece... [it] marks McMahon out as a writer of no little class and promise - definitely a name to watch for.\"- John Berlyne, SFRevu\"McMahon can stand up proudly with the masters of the genre. [A]n expertly crafted tale by a writer who understands the horror genre.\"- Joe Kroeger, Horrorworld",
  "genres": [
    "Horror"
  ],
  "author": "Gary McMahon",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/9676693-rough-cut"
}