{
  "title": "How to Read the Bible: A Guide to Scripture, Then and Now",
  "description": "As soon as it appeared, How to Read the Bible was recognized as a masterwork, “awesome, thrilling” (The New York Times), “wonderfully interesting, extremely well presented” (The Washington Post), and “a tour de force...a stunning narrative” (Publishers Weekly). Now in its tenth year of publication, the book remains the clearest, most inviting and readable guide to the Hebrew Bible around—and a profound meditation on the effect that modern biblical scholarship has had on traditional belief.Moving chapter by chapter, Harvard professor James Kugel covers the Bible’s most significant stories—the Creation of the world, Adam and Eve, Cain and Abel, Noah and the flood, Abraham and Sarah, Jacob and his wives, Moses and the exodus, David’s mighty kingdom, plus the writings of Isaiah, Jeremiah, and the other prophets, and on to the Babylonian conquest and the eventual return to Zion.Throughout, Kugel contrasts the way modern scholars understand these events with the way Christians and Jews have traditionally understood them. The latter is not, Kugel shows, a naïve reading; rather, it is the product of a school of sophisticated interpreters who flourished toward the end of the biblical period. These highly ideological readers sought to put their own spin on texts that had been around for centuries, utterly transforming them in the process. Their interpretations became what the Bible meant for centuries and centuries—until modern scholarship came along. The question that this book ultimately asks is: What now? As one reviewer wrote, Kugel’s answer provides “a contemporary model of how to read Sacred Scripture amidst the oppositional pulls of modern scholarship and tradition.”",
  "genres": [
    "Religion",
    "Nonfiction",
    "History",
    "Theology",
    "Judaism",
    "Christianity",
    "Christian"
  ],
  "author": "James L. Kugel",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/967775.How_to_Read_the_Bible"
}