{
  "title": "We Have Met the Enemy: Self-Control in an Age of Excess",
  "description": "An intelligent and irreverent investigation into the age-old problem of self-control finds that, in the modern world, solving it is the most important thing we can do.More calories, sex, and intoxicants are more readily and privately available than at any time in memory. Pornography and gambling are now instantly and anonymously accessible to anyone with an Internet- connected computer. Trying to work? If so, chances are you're also struggling to resist the siren call of the Internet-to say nothing of the snack machine. As America's bulging waistlines can attest, mealtime is no longer a discrete part of the day, and our struggles with weight have never been more desperate. We Have Met the Enemy examines overeating, overspending, procrastination, wayward sexual attraction, and other everyday transgressions that bedevil modern society.While temptations have multiplied, many of the longstanding social constraints on behavior have eroded. Tradition, ideology, and religion have lost their grip on many of us, while commonly accepted standards of attire, speech, and comportment in the public sphere have largely dissolved. Financial constraints, once a ready substitute for willpower, were swept away by surging affluence and the remarkable openhandedness of lenders. (And we all know what happened then.) A remarkable confluence of freedom, affluence, and technology are sorely testing the limits of human willpower.This conundrum of self-control has occupied thinkers since the time of Socrates. Philosophers, theologians, psychologists, and lately economists have wrestled with the question of how it is possible for us to act against our own best interest, but the issue has never been more urgent than it is today. For affluent societies, the struggle for self- mastery is the preeminent challenge of our times. In essence, willpower is the ballgame.If our humanity hinges on anything, it's our ability as individuals to guide our behavior according to our own judgment of what is best. Self- control is what makes you a mensch. Using self-control as a lens rather than a cudgel, Daniel Akst combines social insight with history, literature, psychology, and economics to alarm, teach, and empower us. We Have Met the Enemy is a call to arms for each of us to exercise more control over our own destiny-and thereby to be happier, healthier, and ultimately more fully human.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Sociology",
    "Philosophy",
    "Personal Development",
    "Health"
  ],
  "author": "Daniel Akst",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/9680823-we-have-met-the-enemy"
}