{
  "title": "Hard Goals : The Secret to Getting from Where You Are to Where You Want to Be",
  "description": "“Ever felt like you weren’t reaching your goals as fast as you would like? HARD GoalsK shows you how to change your thinking and get on the path to tremendous achievement!”-- Marshall Goldsmith, world-renowned executive coach and author of the New York Times bestsellers MOJO and What Got You Here Won’t Get You There Want to increase sales? Get promoted? Change the world? There’s a goal for that . . . Steve Jobs, Jeff Bezos, the school teacher next door who amassed a million-dollar fortune . . . Did these people succeed because they were more motivated or because they were more disciplined? The answer to both questions is yes―but not in the ways you might think. Anyone can achieve extraordinary things. The secret is setting goals that test the very limits of your abilities. In Hard Goals , Mark Murphy, the acclaimed author of Hundred Percenters , explains the science behind getting from where you are to where you want to be in your career, business, and life. Leadership IQ, Murphy’s top-rated leadership training consultancy, studied nearly 5,000 workers from virtually every field and found that extraordinary goals―the kind that got America to the moon and back, developed the iPod, created nanotechnology, and helped individuals overcome tremendous personal adversity―stimulate and engage the brain in ways that are profoundly different from the goals most people set. Research conducted for this book revealed that people who set Hard goals are up to 75 percent more fulfilled than people with easy goals. In these pages, Mark Murphy explains how success, and the satisfaction it brings, comes from knowing how to set goals that",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Productivity",
    "Leadership",
    "Management"
  ],
  "author": "Mark Murphy",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/9679874-hard-goals"
}