{
  "title": "Rockettes, Rockstars and Rockbottom",
  "description": "After a foreword from Tony award winning director and choreographer, Jerry Mitchell, Keltie Colleen introduces herself – an average, everyday sort of girl from an average town with average parents. Ever since she can remember, she wanted to be a dancer. Throughout Rockettes, Rockstars and Rockbottom, we watch Keltie move to New York City and follow her dreams. She struggles and overcomes incredible odds to be invited into the world’s premier dance company, The Radio City Rockettes. All of her dreams come true just as she falls madly in love for the first time with her complete opposite: a long-haired, whisky-drinking, rockstar. Keltie takes us on an adventure complete with painful missteps on her path to finding love, dealing with loss and working as a performer in the entertainment industry. When rockstar number one breaks her heart, Keltie replaces him with a long-haired, skinny jean wearing clone. And when that relationship ends, she finds herself dancing on the MTV Video Music Award stage making love eyes at her next skinny jean wearing future boyfriend, whose face in the coming months would taunt her from the cover of Rolling Stone magazine. Keltie hits rockbottom after finding out that rockstar number three had not only been touring all over the world, but touring the beds of various women. Left in a state of disbelief, she vows to break her addiction to emotionally unavailable men in skinny jeans. She does what any women does when her heart is broken: she cries, stops eating and is sure her life is over. Keltie walks us through the steps of healing heartbreak and finding yourself after your identity is stolen by someone else’s heart. Her ability to be honest to herself and then share that with the world is not only incredibly brave, but inspiring. Charminglyawkward, her resiliency, determination and love of life are truly something to aspire to.It’s the one story we want to hear again and again, a love story with a happy ending.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Music",
    "Chick Lit"
  ],
  "author": "Keltie Colleen",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/9680854-rockettes-rockstars-and-rockbottom"
}