{
  "title": "Dancing at the Odinochka",
  "description": "Nearly 150 years ago, when Alaska belonged to Russia and was called Russian America, Erinia Pavaloff lived at the Nulato odinochka on the banks of the Yukon River. Owned by the Russian American Company, an \"odinochka\" was a trading post where native people traded their furs for precious Russian supplies.Erinia is always busy -- learning to make fur clothing, emptying buckets of snow into water barrels, helping Mamma, gathering spruce boughs to make fish traps, and grinding paint for a new canoe. It seems that Erinia works all the time. So she can hardly wait for visitors -- the company men who bring stock for trading, or the Indians who come to fish or sell furs. When visitors come, Erinia and the others are delighted to listen to old stories and music, and everyone dances at the odinochka.Life has a good sameness that Erinia counts on...until the day when American Western Union Telegraph men arrive. Sent up north to build a telegraph line, the men bring news of the outside world, new inventions, and customs unfamiliar to Erinia's people. Everyone at the odinochka listens to the Americans' stories, learns their funny songs, and dances the waltz that the telegraph men teach them.But as suddenly as they've come, the telegraph men leave -- their telegraph line abandoned -- and Erinia is bereft. Word comes that the United States has purchased Russian America from Russia; Erinia and her people have become American Alaskans. Their lives will never be the same, as they struggle to find their place in this American world that doesn't care about the old ways. Will there ever again be dancing at their odinochka?Inspired by a five-page memoir written in 1936 by the real Erinia Pavaloff, a relative of the author's stepfather, \"Dancing at the Odinochka\" is a stunning story of family, culture, and hope that will leave no reader untouched.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Realistic Fiction"
  ],
  "author": "Kirkpatrick Hill",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/968146.Dancing_at_the_Odinochka"
}