{
  "title": "River's Edge",
  "description": "\"One extraordinary woman will come of age-and come into her own- in this haunting, elegiac portrait of an ever-changing America during the tumult and uncertainty of World War II. After the death of her mother, Elise Braun is sent to live with a new family in the United States and to start a new life. Her father only wants to save his daughter from the impending war in her native Germany-and the horrors of the new Nazi regime. But Elise can only feel a sense of abandonment and resentment toward the one man who is supposed to protect her. An accomplished pianist, music has become her only solace from the loneliness and loss that makes it so difficult for her to love or trust anyone... Devastated by his wife's death, Herman Braun knows that he's incapable of caring for the daughter he loves so deeply. He also knows that Germany is becoming a treacherous country in the hands of a tyrant, one he must defy at any price-even the price of sending his daughter away to a strange new land. It's a choice that may cost him his family-and his life. Now, with the war over, Elise has grown into the beautiful and brave young woman her father always hoped she would be. But underneath the polished façade, she remains torn between her love for her adoptive home and the heartbreak caused by her homeland. As she struggles to find her place in a harrowing new world, she must also learn to acknowledge her love for her father, the man who traded his happiness for her own... Praise for Fields of \"Captivating and hauntingly beautiful, this debut is a true gem.\"- Romantic Times Book Club (4 1/2 stars) \"A lyrical, lush, and lovely novel from a clever and talented new writer.\" -Jane Green \"A gripping, heartwarming story...complete with fascinating characters and a page-turning plot.\" -Dorothy Garlock Marie Bostwick was born and raised in the Northwest. Since marrying the love of her life twenty-four years ago, she has never known a moment's boredom. Marie and her family have moved a score of times, living in eight U.S. states and two Mexican cities, and collecting a vast and cherished array of friends and experiences. Marie now lives with her husband and three handsome sons in Connecticut where she writes, reads, quilts, and is privileged to serve the women of her local church. Visit her at www.mariebostwick.com. View ChapterMarie Bostwick visits with readers during a \"Meet and Greet\" at Ft. Bragg.\"",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "World War II",
    "Romance",
    "Fiction"
  ],
  "author": "Marie Bostwick",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/968355.River_s_Edge"
}