{
  "title": "The Panic Virus: A True Story of Medicine, Science, and Fear",
  "description": "A riveting medical detective story that explores the limits of rational thoughtIn 1998, Andrew Wakefield, a British gastroenterologist with a history of self-promotion, published a paper with a shocking allegation: the measles-mumps-rubella vaccine might cause autism. The media seized hold of the story and, in the process, helped to launch one of the most devastating health scares ever. In the years to come Wakefield would be revealed as a profiteer in league with class-action lawyers, and he would eventually lose his medical license. Meanwhile, one study after another failed to find any link between childhood vaccines and autism. Yet the myth that vaccines somehow cause developmental disorders lives on. Despite the lack of corroborating evidence, it has been popularized by media personalities such as Oprah Winfrey and Jenny McCarthy and legitimized by journalists who claim that they are just being fair to “both sides” of an issue about which there is little debate. Meanwhile, millions of dollars have been diverted from potential breakthroughs in autism research; families have spent their savings on ineffective “miracle cures\"; and declining vaccination rates have led to outbreaks of deadly illnesses like Hib, measles, and whooping cough. Most tragic of all is the increasing number of children dying from vaccine-preventable diseases. In The Panic Virus Seth Mnookin draws on interviews with parents, public-health advocates, scientists, and anti-vaccine activists to tackle a fundamental question: How do we decide what the truth is? The fascinating answer helps explain everything from the persistence of conspiracy theories about 9/11 to the appeal of talk-show hosts who demand that President Obama “prove” he was born in America. The Panic Virus is the ultimate cautionary tale for our time.",
  "genres": [
    "Nonfiction",
    "Science",
    "Medicine",
    "History",
    "Medical",
    "Health",
    "Psychology"
  ],
  "author": "Seth Mnookin",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/9691004-the-panic-virus"
}