{
  "title": "The Autobiography of Mrs. Tom Thumb",
  "description": "In her national bestseller Alice I Have Been, Melanie Benjamin imagined the life of the woman who inspired Alice in Wonderland. Now, in this jubilant new novel, Benjamin shines a dazzling spotlight on another fascinating female figure whose story has never fully been told: a woman who became a nineteenth century icon and inspiration - and whose most daunting limitation became her greatest strength.  \"Never would I allow my size to define me. Instead, I would define it.\"  She was only two-foot eight-inches tall, but her legend reaches out to us more than a century later. As a child, Mercy Lavinia \"Vinnie\" Bump was encouraged to live a life hidden away from the public. Instead, she reached out to the immortal impresario P. T. Barnum, married the tiny superstar General Tom Thumb in the wedding of the century, and transformed into the world's most unexpected celebrity. Here, in Vinnie's singular and spirited voice, is her amazing adventure - from a showboat \"freak\" revue where she endured jeering mobs to her fateful meeting with the two men who would change her life: P. T. Barnum and Charles Stratton, AKA Tom Thumb. Their wedding would captivate the nation, preempt coverage of the Civil War, and usher them into the White House and the company of presidents and queens. But Vinnie's fame would also endanger the person she prized most: her similarly-sized sister, Minnie, a gentle soul unable to escape the glare of Vinnie's spotlight. A barnstorming novel of the Gilded Age, and of a woman's public triumphs and personal tragedies, The Autobiography of Mrs. Tom Thumb is the irresistible epic of a heroine who conquered the country with a heart as big as her dreams - and whose story will surely win over yours.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Adult Fiction",
    "19th Century",
    "Audiobook"
  ],
  "author": "Melanie Benjamin",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/9689093-the-autobiography-of-mrs-tom-thumb"
}