{
  "title": "Cthulhurotica",
  "description": "REVISED EDITION! From independent publisher Dagan Books, Cthulhurotica is an exciting new anthology of erotic horror, inspired by the writing of H. P. Lovecraft.This decadent collection contains unique creations of Mythos fiction, plus thought-provoking academic essays. In addition, the revised edition contains more than 20 pieces of original art.With work by Cody Goodfellow, Kenneth Hite, Steven J. Scearce, Silvia Moreno-Garcia, Gabrielle Harbowy, Matthew Marovich, Kirsten Brown, Richard Baron, Don Pizarro, K.V. Taylor, Jennifer Brozek, Galen Dara, Mae Empson, Nathan Crowder, Leon J. West, and many more ...ContentsAstrophobos by H.P. LovecraftIntroduction by Carrie CuinnDescent of the Wayward Sister by Gabrielle HarbowyThe C-Word by Don PizarroInfernal Attractors by Cody GoodfellowDaddy’s Girl by Madison WoodsVictim of Victims by AnonymousThe Cry in the Darkness by Richard BaronRiemannian Dreams by Juan Miguel MarinTurning On, Tuning In, and Dropping Out at the Mountains of Madness by Ahimsa KerpSong of the Catherine Clark by Maria MitchellBetween a Rock and an Elder Goddess by Mae EmpsonThe Fishwives of Sean Brolly by Nathan CrowderFlash Frame by Silvia Moreno-GarciaTransfigured Night by K.V. TaylorThe Lake at Roopkund by Andrew ScearceIpsa Scientia by Constella EspjAmid Disquieting Dreams by Leon J. WestThe Dreamlands of Mars by Travis KingThe Assistant from Innsmouth by Steven J. ScearceThe Summoned by Clint CollinsSense by Matthew MarovichOptional On The Beach At The Festival Of Shug Niggurath by Gary Mark BernsteinLe Ciél Ouvert by Kirsten BrownAstrophobos, conclusion by H.P. LovecraftESSAYSCthulhu’s Polymorphous Perversity by Kenneth HiteThe Sexual Attraction Of The Lovecraftian Universe by Jennifer BrozekCthulhurotica, Female Empowerment, and the New Weird by Justin Everett, PhDILLUSTRATIONS Cthulhurotica by Oliver WetterGlyphs by Carrie CuinnInto the Darkness by Galen DaraThe Widow's Walk by Galen DaraInfernal Machine by Galen DaraShirley's Demon Lover by Galen DaraWhateley Family Portrait by Kirsten BrownWandering Bride by Galen DaraLovecraftian Love by Galen DaraDeep Ones by Galen DaraWoman, Yellow by Galen DaraLove from the Black Lagoon by Galen DaraYour Fisheater by Stephen StanleyThe Whateley Estate by Galen DaraAnna by Galen DaraThe Box by Galen DaraThe Brides of Tindalos by Kirsten BrownGreat Rift by Galen DaraPlus additional interior images by Carrie Cuinn",
  "genres": [
    "Horror",
    "Fantasy",
    "Erotica",
    "Short Stories",
    "Fiction",
    "Romance",
    "Anthologies"
  ],
  "author": "Carrie Cuinn",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/9688895-cthulhurotica"
}