{
  "title": "Petty Magic: Being the Memoirs and Confessions of Miss Evelyn Harbinger, Temptress and Troublemaker",
  "description": "Evelyn Harbinger sees nothing wrong with a one-night stand. At 149 years old, Eve may look like she bakes oatmeal cookies in the afternoon and dozes in her rocking chair in the evening, but once the gray hair and wrinkles are traded for jet-black tresses and porcelain skin, she can still turn heads as the beautiful girl she once was. Can’t fault a girl for having a little fun, can you? This is all fine and well until Eve meets Justin, who reminds her so much of a former lover that one night is no longer enough. Eve’s coven has always turned a blind eye to her nighttime mischief, but this time they think she’s gone too far—and they certainly don’t hesitate to tell her so. Dodging the warnings of family and friends, Eve must also defend her sister, Helena, when another beldame accuses Helena of killing her own husband sixty years before. As the evidence against Helena begins to pile up, Eve distracts herself by spending more and more nights—and days—romancing Justin as her former self.  There are so many peculiar ways in which Justin is like Jonah, her partner behind enemy lines in World War II and the one true love of her life.  Experts in espionage, Jonah and Eve advanced the allied cause at great personal sacrifice.  Now Eve suspects that her Jonah has returned to her, and despite the disapproval of her coven and the knowledge that love with a mortal man can only end in sorrow, she can’t give him up.  But can she prove it’s really him? In this captivating tale of adventure and timeless romance, novelist Camille DeAngelis blends World War II heroics with witchcraft and wit, conjuring a fabulously rich world where beldames and mortal men dare to fall in love.",
  "genres": [
    "Fantasy",
    "Witches",
    "Fiction",
    "Romance",
    "Historical Fiction",
    "Paranormal",
    "Magic"
  ],
  "author": "Camille DeAngelis",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/9690900-petty-magic"
}