{
  "title": "صائد اليرقات",
  "description": "\"صائد اليرقات\" عمل روائي جديد للأديب السوداني البارز \"أمير تاج السر\"، ارتكز فيه على نقد جذري لاذع لواقع الحال الذي آل إليه الفن الروائي إلى درجة تشويهه من قبل فئة من الروائيين الذين يمتهنون الكتابة ويجعلونها أداة للكسب والمعاش، أدواتهم في ذلك، الناس المخدوعون بأسمائهم البراقة والدعاية الإعلامية المركزة، من دون أن يقدموا جديداً يغني أو يضيف معنى جديداً للحياة. ففي حبكة روائية فريدة، يتخللها سرد فني مشوق استطاع الروائي أن يستولد في كل مرة شخصية جديدة تعكس حالة خاصة. يبدأ الكاتب بشخصية \"عبد الله حرفش\" ضابط الأمن المتقاعد الذي تروقه فكرة الكتابة، فيبدأ بالبحث عن الفكرة، فيقرر الجلوس في مقهى (قصر الجميز) أقدم مقاهي العاصمة في بلده، وأكثرها ضجيجاً وزحاماً، وعرضاً للوجوه المشبوهة في نظره بحسب مهنته السابقة، حيث كان يكتب تقاريره بمتعة غريبة كما يصف ذلك، وفي هذا الفضاء الرحب يحاول بطل الرواية أن يبحث في وجوه الناس عن مرجع لعمله الجديد - الكتابة - يقول: \"كانت في الواقع وجوهاً لكتاب يحتلون مواقع لامعة في الكتابة، وآخرين يقاتلون بحثاً عن مواقع تبدو لهم بعيدة المنال: شعراء متأنقين في سراويل وقمصان زاهية، وشعراء حفاة حتى من صنادل ممزقة، صحفيين يائسين، وسياسيين يدخنون ويرطنون ويتصارعون، ويرسمون للناس وطناً آخر غير الوطن الذي نعيش فيه ونعرفه، ونحبّه بكل حسناته وعيوبه. ودائماً ثمة نساء يتحلقن حول الضجيج، أو يساهمن في خلقه بضحكات كثيراً ما رسمناها على تقاريرنا الأمنية باعتبارها ضحكات أفاعٍ). محطات متعددة، ومواقف ساخرة، يقف عندها أمير تاج السر لينقل لنا واقعاً أرقه، فكتب عنه كاشفاً عن مآسٍ متعددة لحالات إنسانية داخل مجتمع مليء بالتناقضات، فينتقده ساخراً، مغلفاً عباراته بعفوية هادفة، تكشف في كل مرة واقعاً جديداً تختبئ في تلاوينه حقيقة ما. \"صائد اليرقات\" عمل روائي أقل ما يقال عنه، هادف، يطرح قضية، هامة، وراهنة، ألا وهي تشويه الثقافة واللعب على الحروف والكلمات، فتصدى أديبنا لها وكتب عنها في حس مسؤول، وموضوعي في آن معاً.والجدير بالذكر أن هذه الرواية وصلت للقائمة القصيرة للجائزة العالمية للرواية العربية 2011-البوكر",
  "genres": [
    "Novels",
    "Fiction",
    "Sudan",
    "Africa",
    "African Literature",
    "Literature"
  ],
  "author": "Amir Tag Elsir",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/9689436"
}