{
  "title": "Ender's Shadow",
  "description": "Ender's Shadow is being dubbed as a parallel novel to Orson Scott Card's Hugo and Nebula Award-winning Ender's Game. By \"parallel,\" Card means that Shadow begins and ends at roughly the same time as Game, and it chronicles many of the same events. In fact, the two books tell an almost identical story of brilliant children being trained in the orbiting Battle School to lead humanity's fleets in the final war against alien invaders known as the Buggers. The most brilliant of these young recruits is Ender Wiggin, an unparalleled commander and tactician who can surely defeat the Buggers if only he can overcome his own inner turmoil.  Second among the children is Bean, who becomes Ender's lieutenant despite the fact that he is the smallest and youngest of the Battle School students. Bean is the central character of Shadow, and we pick up his story when he is just a 2-year-old starving on the streets of a future Rotterdam that has become a hell on earth. Bean is unnaturally intelligent for his age, which is the only thing that allows him to escape--though not unscathed--the streets and eventually end up in Battle School. Despite his brilliance, however, Bean is doomed to live his life as an also-ran to the more famous and in many ways more brilliant Ender. Nonetheless, Bean learns things that Ender cannot or will not understand, and it falls to this once pathetic street urchin to carry the weight of a terrible burden that Ender must not be allowed to know. Although it may seem like Shadow is merely an attempt by Card to cash in on the success of his justly famous Ender's Game, that suspicion will dissipate once you turn the first few pages of this engrossing novel. It's clear that Bean has a story worth telling, and that Card (who started the project with a cowriter but later decided he wanted it all to himself) is driven to tell it. And though much of Ender's Game hinges on a surprise ending that Card fans are likely well acquainted with, Shadow manages to capitalize on that same surprise and even turn the table on readers. In the end, it seems a shame that Shadow, like Bean himself, will forever be eclipsed by the myth of Ender, because this is a novel that can easily stand on its own. Luckily for readers, Card has left plenty of room for a sequel, so we may well be seeing more of Bean in the near future. --Craig E. Engler",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Young Adult",
    "Fantasy",
    "Science Fiction Fantasy",
    "Audiobook",
    "Space"
  ],
  "author": "Orson Scott Card",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/969456.Ender_s_Shadow"
}