{
  "title": "Tao: The Pathless Path",
  "description": "In The Pathless Path , Osho, one of the greatest spiritual teachers of the twentieth century, comments on five parables from the Leih Tzu, bringing a fresh and contemporary interpretation to the ancient wisdom of Tao. Leih Tzu was a well-known Taoist master in the fourth century B.C., and his sly critiques of a Confucius provide abundant opportunities for the reader to explore the contrasts between the rational and irrational, the male and female, the structured and the spontaneous. “Who Is Really Happy” uses the discovery of a human skull on the roadside to probe into the question of immortality and how misery arises out of the existence of the ego. “A Man Who Knows How to Console Himself” looks beneath the apparent cheerfulness of a wandering monk and asks if there is really a happiness that endures through life’s ups and downs. “No Regrets” is a parable about the difference between the knowledge that is gathered from the outside and the “knowing” that arises from within. “No Rest for the Living” uses a dialogue between a despondent seeker and his master to reveal the limits of philosophy and the crippling consequences of living for the sake of some future goal. “Best Be Still, Best Be Empty” discusses the difference between the path of the will, the via affirmitiva of Christianity, Judaism, and Islam, versus the path of the mystic, the via negativa of Buddha and Lao Tzu. The Pathless Path also features a Q&A section that addresses how Taoist understanding applies to everyday life in concrete, practical terms. Osho challenges readers to examine and break free of the conditioned belief systems and prejudices that limit their capacity to enjoy life in all its richness. He has been described by the Sunday Times of London as one of the “1000 Makers of the 20th Century” and by Sunday Mid-Day (India) as one of the ten people―along with Gandhi, Nehru, and Buddha―who have changed the destiny of India. Since his death in 1990, the influence of his teachings continues to expand, reaching seekers of all ages in virtually every country of the world.",
  "genres": [
    "Spirituality",
    "Philosophy",
    "Taoism",
    "Nonfiction",
    "Religion",
    "Eastern Philosophy",
    "Mysticism"
  ],
  "author": "Osho",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/97021.Tao"
}