{
  "title": "L'arco di trasformazione del personaggio",
  "description": "Nelle grandi narrazioni, non solo quelle cinematografiche, i protagonisti si dividono al fondo in due grandi categorie. Da una parte gli eroi che non cambiano, qualcuno che entra nella storia già come eroe e per questo dopo mille avventure risolve il problema e ristabilisce l’equilibrio e l’ordine senza cambiare di una virgola (è il caso degli eroi western alla John Wayne, di 007 o di quasi tutti i protagonisti dei B-movie d’azione). Dall’altra, ed è quella che produce i film migliori, il protagonista durante i conflitti che deve affrontare per arrivare alla risoluzione finale si modifica, acquista consapevolezza e supera un problema interiore che spesso non sapeva di avere. In questo caso il raggiungimento dell’obiettivo sul piano della trama è servito a fare crescere umanamente il nostro eroe, e noi spettatori con lui. Questo è il libro che spiega come gestire l’arco di trasformazione del personaggio. Il nucleo del modello teorico e narrativo di Dara Marks fonde gli studi di Chris Vogler (Il viaggio dell’eroe) con quelli di Linda Seger (Come scrivere una grande sceneggiatura) e di Robert Mckee (Story) per arrivare all’individuazione di un motore immobile che sottende la scrittura di ogni grande storia. La scoperta cioè che a dare spessore umano al film è una profonda relazione tra il movimento del plot e lo sviluppo interiore del personaggio a partire da una “ferita inconscia” che affligge il protagonista all’inizio del suo percorso. L’arco di trasformazione dunque è insieme il cammino necessario a risolvere la maggior parte dei problemi di base di una sceneggiatura ma anche il racconto delle tappe di un processo di crescita verso una consapevolezza che riguarda tutti noi.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Film",
    "Essays",
    "Reference",
    "Media Tie In",
    "How To"
  ],
  "author": "Dara Marks",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/9698435-l-arco-di-trasformazione-del-personaggio"
}