{
  "title": "The Great Disruption: Why the Climate Crisis Will Bring On the End of Shopping and the Birth of a New World",
  "description": "\"One of those who has been warning me of [a coming crisis] for a long time is Paul Gilding, the Australian environmental business expert. He has a name for this moment-when both Mother Nature and Father Greed have hit the wall at once-'The Great Disruption.' \" -Thomas Friedman in the New York TimesIt's time to stop just worrying about climate change, says Paul Gilding. We need instead to brace for impact because global crisis is no longer avoidable. This Great Disruption started in 2008, with spiking food and oil prices and dramatic ecological changes, such as the melting ice caps. It is not simply about fossil fuels and carbon footprints. We have come to the end of Economic Growth, Version 1.0, a world economy based on consumption and waste, where we lived beyond the means of our planet's ecosystems and resources.The Great Disruption offers a stark and unflinching look at the challenge humanity faces-yet also a deeply optimistic message. The coming decades will see loss, suffering, and conflict as our planetary overdraft is paid; however, they will also bring out the best humanity can compassion, innovation, resilience, and adaptability. Gilding tells us how to fight-and win-what he calls The One Degree War to prevent catastrophic warming of the earth, and how to start today.The crisis represents a rare chance to replace our addiction to growth with an ethic of sustainability, and it's already happening. It's also an unmatched business Old industries will collapse while new companies will literally reshape our economy. In the aftermath of the Great Disruption, we will measure \"growth\" in a new way. It will mean not quantity of stuff but quality and happiness of life. Yes, there is life after shopping.",
  "genres": [
    "Nonfiction",
    "Environment",
    "Science",
    "Climate Change",
    "Economics",
    "Sustainability",
    "Politics"
  ],
  "author": "Paul Gilding",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/9697369-the-great-disruption"
}