{
  "title": "La vera storia dell'ultimo re socialista",
  "description": "«E se le cose fossero andate in un altro modo? Se in un momento cruciale avessero preso un corso diverso?». Domande che qualsiasi persona ragionevole si pone ogni volta che tocca quella strana, impalpabile materia che si chiama Storia. Roy Lewis l’ha affrontata in questo romanzo con la stessa sottile verve, con la stessa illuminante disinvoltura con cui aveva trattato la preistoria in Il più grande uomo scimmia del Pleistocene, anche qui usando il gioco per dare evidenza e plasticità a pensieri che vanno lontano. Così ha voluto seguire una vena del possibile, immettendo, per così dire, in un supercomputer «la vittoria del socialismo, anziché quella del capitalismo, nella rivoluzione che travolse l’Europa del 1848». Dopo lunga elaborazione, il computer ha prodotto questo teorema in forma di romanzo. Osserviamo i fatti: anzitutto la regina Vittoria non regna per più di mezzo secolo, bensì deve abdicare nel 1849 davanti alla rivolta dei cartisti (i socialisti inglesi). Ma che avviene dopo? Si stabilisce un regime socialista (ma senza abolire la monarchia, perché siamo pur sempre in Inghilterra). Di un socialismo relativamente mite e bucolico, preoccupato soprattutto di garantire il lavoro a tutti e di mantenere l’uguaglianza. Il risultato è un lento disastro. Soprattutto perché socialismo e tecnologia non vanno insieme. La tecnologia, che è la vera rivoluzione, scompagina continuamente i rapporti sociali – e questo i bravi e un po’ tonti socialisti non riescono a sopportarlo. Si preparano così le basi per una rivoluzione che abbatta il sistema. Ma che accadrà se complice di questa rivoluzione diventa «l’ultimo re socialista»? Ce lo racconterà lui stesso, e non sarà facile dimenticare il personaggio di questo gentile, amabile sovrano, che avrebbe senz’altro preferito insegnare matematica in qualche oscura università, e si ritrova invece, spinto dalla forza delle cose, a guidare una controrivoluzione per rovesciare il proprio regime – quindi per esautorare se stesso. La vera storia dell’ultimo re socialista è apparso in Inghilterra nel 1990.",
  "genres": [
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Roy  Lewis",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/9702333-la-vera-storia-dell-ultimo-re-socialista"
}