{
  "title": "His for the Holidays",
  "description": "Mistletoe at Midnight By LB GreggOwen McKenzie has traveled to Vermont to spend an old-fashioned Christmas with his family when he finds himself staying at the same inn as his first love. Owen is disconcerted to realize he's still attracted to Caleb Black but refuses to pursue him. Caleb left him once, and Owen's not going down that road again.Caleb is ready for a second chance with Owen and gets it when fate and the matchmaking McKenzies conspire to strand the two men in a rustic cabin during a snowstorm on Christmas Eve. Can Caleb convince Owen to rekindle their romance so they can stop spending their holidays apart?Nine Lights Over Edinburgh By Harper FoxDetective Inspector James McBride is riding high on the belief that he's about to bust a human-trafficking ring. But just five days before Christmas, his unorthodox methods catch up with him and his world comes crashing down.McBride tries to concentrate on his new day job as security for the visiting Israeli ambassador. He even starts to feel a renewed sense of self-worth when the leader of the Israeli team, the aristocratic Tobias Leitner, takes a bullet for him in the line of duty. But he can't forget the trafficking case, especially when his investigations result in the kidnapping of his own daughter! McBride has no one to turn to for help-no one, except Toby.Can these two very different men work together to bring about a holiday miracle-and heal one another's heart in the process?I Heard Him Exclaim By Z.A. MaxfieldWho Likes a Skinny Santa?Steve Adams's heart hasn't been in the Christmas spirit ever since doctors put a stent in it and ordered him to clean up his act. No longer filling out his Santa suit or allowed to make merry, he's forgoing the holidays this year and heading to Vegas to indulge in the few vices left to him: gambling and anonymous sex.His road trip takes a detour when he encounters Chandler Tracey, who's just inherited guardianship of his five-year-old niece. Overwhelmed, Chandler's on his way to deliver Poppy to his parents. But fate has other plans and, after car trouble, Chandler and Poppy accept a ride home with Steve. Though the heat between the two men is obvious, they put it on simmer while they band together to make Poppy's Christmas as perfect as possible.Steve soon comes to believe that while Chandler is the right person to look after Poppy, someone needs to look after Chandler. Fortunately, Steve knows just the man for the job.Icecapade By Josh LanyonOn the eve of the new millennium, diamond thief Noel Snow seduced FBI special agent Robert Cuffe, then fled into the dawn. Now a successful novelist, Noel uses his capers as fodder for his books, and has modeled his hero's nemesis (and potential love interest) on Cuffe. Though he leaves Robert a drunken phone message every New Year's Eve, Noel hasn't seen or heard from him in a decade.So he's thrilled when his former lover shows up at his upstate farm one Christmas Eve. Elation quickly turns to alarm when Robert accuses Noel of being responsible for a recent rash of diamond heists. Robert is all business and as cold as ice: it seems his only interest in Noel is to put him behind bars.Innocent of the crimes, and still as attracted as ever to the oh-so-serious lawman, Noel plans a second seduction-providing he can stay out of jail long enough!",
  "genres": [
    "M M Romance",
    "Anthologies",
    "Romance",
    "Holiday",
    "Contemporary",
    "Christmas",
    "Audiobook"
  ],
  "author": "L.B. Gregg",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/9705875-his-for-the-holidays"
}