{
  "title": "Vita del lappone",
  "description": "Johan Turi era un lappone con gli «occhi azzurri raggrinziti dal vento e dalle intemperie» che visse molti anni cacciando e guidando mandrie di renne, come tutta la sua gente. A lungo questo libro si elaborò nella sua mente, in silenzio. Pensava che tutto il male incombente sui lapponi, ormai trattati come «cani stranieri», fosse dovuto alla scarsa conoscenza della loro vita che avevano i popoli vicini. Così tentò di raccontare quella vita, con la massima precisione e sobrietà. Non sapeva che in quel momento stava offrendo risposte preziose a quesiti che sempre torniamo a porci: che cos’è un nomade? Che cos’è un cacciatore arcaico? Che cosa significa vivere in simbiosi con un animale (in questo caso la renna)? Attraverso le sue parole sentiamo risuonare una voce ammutolita da tempi molto antichi. E, dice Johan Turi, «nei tempi antichi ogni cosa sapeva parlare, tutti gli animali e gli alberi e le pietre e ogni cosa sulla terra, e così parleranno anche al momento del giudizio finale». Johan Turi nacque nel 1854, quando già i lapponi cominciavano a essere maltrattati e perseguitati da norvegesi e finlandesi. La Vita del lappone, nelle sue intenzioni, doveva servire a illuminare lo spirito della sua gente, che gli stranieri non capivano e i lapponi stessi non riuscivano a spiegare, perché il lappone – come dice Turi – «non capisce molto quando sta dentro una stanza chiusa, quando il vento non gli soffia nel naso». Turi diede forma definitiva al suo libro, con l’aiuto prezioso dell’artista danese Emilie Demant, che condivise la sua vita in Lapponia nel 1907-1908. La prima edizione della Vita del lappone, annotata dalla Demant apparve in edizione bilingue (lappone e danese) nel 1910. Il libro ebbe immediatamente fortuna ed è oggi considerato il primo grande classico della letteratura lappone. Qui ne presentiamo la prima edizione italiana.",
  "genres": [
    "Nonfiction",
    "Indigenous",
    "History",
    "Scandinavian Literature"
  ],
  "author": "Johan Turi",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/9714931-vita-del-lappone"
}