{
  "title": "Radical Medicine: Cutting-Edge Natural Therapies That Treat the Root Causes of Disease",
  "description": "A “radical” approach to holistic healing that examines the root causes and cures for ailments such as Alzheimer’s disease, breast cancer, and heart attacks• Offers cutting-edge detoxification and draining therapies to address the tremendous chemical onslaught of modern life• Explains the profound health problems caused by dental amalgams, vaccinations, antibiotics, cosmeticsWith the historic use of toxic mercury amalgam fillings, excessive courses of antibiotics, damaging childhood vaccines, and the many industrial pollutants and chemicals that have been spread into our air, water, and food over the past century, general holistic health guidelines are simply no longer adequate for most people. Only through radical measures--that is, getting to the true root or underlying cause of disease--can effective healing occur. In Radical Medicine , naturopathic physician Louisa Williams describes how to treat these and other modern-day “obstacles to cure,” in order to ensure against future degenerative disease and achieve the optimal health that is our birthright.Examining the many health problems triggered by dental amalgams and poor dentistry, Dr. Williams explains that our teeth are focal points for health issues that arise elsewhere in the body. She explores the impact of vaccinations, the excessive use of antibiotics, and the chemical-laden products used as health and beauty aids--which are linked to Alzheimer’s disease, heart attacks, and breast and other cancers--and provides information on cutting-edge detoxification treatments as well as drainage and nutritional therapies. A practical guide for practitioners and patients alike, Radical Medicine offers a wealth of holistic, natural therapies for overcoming what is poisoning us and our world so we can achieve optimal health and well-being.",
  "genres": [
    "Health",
    "Nonfiction"
  ],
  "author": "Louisa L. Williams",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/9721524-radical-medicine"
}