{
  "title": "The Suppressed History of America: the Murder of Meriwether Lewis and the Mysterious Discoveries of the Lewis and Clark Expedition",
  "description": "An investigation into the discoveries of Lewis and Clark and other early explorers of America and the terrible acts committed to suppress them• Provides archaeological proof of giants, the fountain of youth, and descriptions from Lewis’s journals of a tribe of “nearly white, blue-eyed” Indians• Uncovers evidence of explorers from Europe and Asia prior to Columbus and of ancient civilizations in North America and the Caribbean• Investigates the Smithsonian conspiracy to cover up Lewis and Clark’s discoveries and what lead to Lewis’s murderMeriwether Lewis discovered far more than the history books tell--ancient civilizations, strange monuments, “nearly white, blue-eyed” Indians, and evidence that the American continent was visited long before the first European settlers arrived. And he was murdered to keep it all secret.Examining the shadows and cracks between America’s official version of history, Xaviant Haze and Paul Schrag propose that the America of old taught in schools is not the America that was discovered by Lewis and Clark and other early explorers. Investigating the discoveries of Spanish conquistadors and Olmec stories of contact with European-like natives, the authors uncover evidence of explorers from Europe and Asia prior to Columbus, sophisticated ancient civilizations in North America and the Caribbean, the fountain of youth, and a long-extinct race of giants. Verifying stories from Lewis’s journals with modern archaeological finds, geological studies, 18th- and 19th-century newspapers, and accounts of the world in the days of Columbus, the authors reveal how Lewis and Clark’s finds infuriated powerful interests in Washington--including the Smithsonian Institution--culminating in the murder of Meriwether Lewis.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "American",
    "Archaeology",
    "Conspiracy Theories",
    "Science"
  ],
  "author": "Paul Schrag",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/9721534-the-suppressed-history-of-america"
}