{
  "title": "The Zombie's Survival Guide: Thrive In The Zombie Apocalypse After You Turn...",
  "description": "Love Bites. Hate Eats... The \"Zombie\" Apocalypse is coming. It's not \"if\" it's \"when\", and if you think you are going to be one of the brave survivors you see in the movies and video games or read about in books and graphic novels you are sadly mistaken. You know who I mean, the handsome and tough hero who was a Navy Seal that women love and men want to be. Or the beautiful, big breasted, brilliant heroine with a PhD in \"Science\". You aren't even the wisecracking sidekick who lives to defend the heroes. You are a regular person, an everyman. Just as I was before I created this fully illustrated guidebook. So face it, the odds are much more in favor of you becoming one of the undead. A ghoul. A Dead. A \"Zombie\". But don't worry, there is hope. There are ways for you to \"live\" a very rewarding \"life\" after you turn. How long, well that depends. But you might as well enjoy it while you can. Sure, it's not as cool as being a vampire. They get the late nights partying, looking like the heroes I mentioned above, the cool clothes, and getting to sleep all day. No, you will be a staggering, oozing, puss-filled mess. But how can you fight Healthies armed with weapons that can be anything from a boy with a screwdriver to a soldier with an automatic rifle? You will not only have physical limitations but you will also be stupid, right? Wrong. Many \"zombies\" retain much of their intelligence after they turn. The ones that are out in the open and shuffling toward people who have guns or other weapons are the dumb ones. The ones that weren't prepared. The smart ones know what to do. They go unnoticed. They wait for their chance to attack. They plot. But if the \"Zombie Apocalypse\" is coming and hasn't happened yet, how do I know all of this? Because it has already started. It just hasn't reached you yet, or maybe you're not aware. The mind can play tricks. And because I'm Hetfield Madden. And I'm a \"Zombie\"...",
  "genres": [
    "Zombies",
    "Horror"
  ],
  "author": "Calvin A.L. Miller II",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/9724265-the-zombie-s-survival-guide"
}