{
  "title": "Parlor Politics: In Which the Ladies of Washington Help Build a City and a Government",
  "description": "When Thomas Jefferson moved his victorious Republican administration into the new capital city in 1801, one of his first acts was to abolish any formal receptions, except on New Year's Day and the Fourth of July. His successful campaign for the presidency had been partially founded on the idea that his Federalist enemies had assumed dangerously aristocratic trappings―a sword for George Washington and a raised dais for Martha when she received people at social occasions―in the first capital cities of New York and Philadelphia. When the ladies of Washington City, determined to have their own salon, arrived en masse at the president's house, Jefferson met them in riding clothes, expressing surprise at their presence. His deep suspicion of any occasion that resembled a European court caused a major problem, however: without the face-to-face relationships and networks of interest created in society, the American experiment in government could not function. Into this conundrum, writes Catherine Allgor, stepped women like Dolley Madison and Louisa Catherine Adams, women of political families who used the unofficial, social sphere to cement the relationships that politics needed to work. Not only did they create a space in which politics was effectively conducted; their efforts legitimated the new republic and the new capital in the eyes of European nations, whose representatives scoffed at the city's few amenities and desolate setting. Covered by the prescriptions of their gender, Washington women engaged in the dirty business of politics, which allowed their husbands to retain their republican purity. Constrained by the cultural taboos on \"petticoat politicking,\" women rarely wrote forthrightly about their ambitions and plans, preferring to cast their political work as an extension of virtuous family roles. But by analyzing their correspondence, gossip events, \"etiquette wars,\" and the material culture that surrounded them, Allgor finds that these women acted with conscious political intent. In the days before organized political parties, the social machine built by these early federal women helped to ease the transition from a failed republican experiment to a burgeoning democracy.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Politics",
    "American Revolution",
    "School"
  ],
  "author": "Catherine Allgor",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/972240.Parlor_Politics"
}