{
  "title": "Three Reckless Wishes",
  "description": "\"Evocative, erotic . . . a sensual treat!\"-- SYLVIA DAY, #1 New York Times bestselling author.Inspired by Charles Perrault's classic fairy tale, \"Three Wishes,\" a SCORCHING HOT historical in the acclaimed Fiery Tales Series...Luc de Moutier, Marquis of Fontenay, is haunted by the writings of a dead woman. He is the subject of her romantic interest. Obsessed with her journals, he can't stop thinking about the sweetly sensual words of the late Isabelle Laurent. Though he'd never noticed her watching him from afar, he now compares every woman to the innocent enchantress who invades his thoughts and most erotic dreams...The old Isabelle is dead. Sought after by the most powerful men in the realm, Isabelle has her choice of wealthy lovers. Her only goals are to provide for her young son, and to maintain the ruse of her demise. Three reckless wishes led her down the path she now walks. And there is no turning back. Only in her anonymously published books and with her son does she let down her guard. Charming and witty, she dons her social mask each day, her performance flawless until the very man of her long-held private fantasies walks into her life--and shakes the foundations of her carefully crafted world.When Luc meets the beautiful courtesan, she captures his fascination and ignites an untamable hunger. He's determined to know the woman behind the façade. To deliciously decimate her defenses, show her true passion and the pleasure of complete abandon and surrender. Soon he discovers books written in a style all too familiar to him... and that the past and dark secrets can't stay hidden forever.Note: This book is a full length EXTRA steamy historical. Keep the smelling salts nearby.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Fairy Tales",
    "Erotic Historical Romance",
    "Regency",
    "Historical Fiction"
  ],
  "author": "Lila DiPasqua",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/13229308-three-reckless-wishes"
}