{
  "title": "Wings",
  "description": "Laurel ha quindici anni e si è appena trasferita con i genitori in una nuova città. Scuola nuova, nuovi amici... una prova difficile, per lei che è così timida. Laurel non ne è ancora cosciente, ma è davvero bella: carnagione chiarissima, capelli biondi, grandi occhi verdi. Piccolina, esile, mangia solo frutta e verdura, ama molto la Natura e al pranzo in mensa preferisce i picnic sull'erba e le passeggiate nei boschi.È proprio la sua diversità rispetto alle altre studentesse del liceo ad attirare subito l'attenzione di David, bello, dolce e sensibile che l'aiuta a socializzare nel nuovo ambiente. È evidente a tutti che ha un debole per Laurel, anche se lei sembra considerarlo solo un amico. Finché a Laurel non succede qualcosa di inspiegabile che la terrorizza e David, per confortarla, la bacia...Per svelare il mistero di ciò che le sta accadendo, Laurel sente di dover tornare nella sua vecchia casa, nella cittadina dove ha vissuto per dodici anni. Là, immersa nella quiete del bosco che sempre la rassicurava, fa uno strano incontro: da dietro un albero sbuca un bellissimo ragazzo i cui magnetici occhi color smeraldo esercitano su di lei una sorta di malia tanto irresistibile quanto enigmatica. Tamani, così si presenta, sembra conoscerla da sempre, sa di lei cose che Laurel stessa ignora, e le rivela una verità sconvolgente.Da quel momento Laurel si troverà sospesa tra due mondi e divisa tra due ragazzi ugualmente affascinanti che la attraggono in direzioni opposte. A chi consegnerà il suo cuore?Straordinario esordio narrativo, Wings mescola amore, avventura e fantasia in una storia tenera e appassionante, che si legge tutta d'un fiato. E che alla fine ci lascia con una domanda incalzante: chi avrei scelto, se fossi stata al posto di Laurel?",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Paranormal",
    "Fairies",
    "Fae",
    "Fiction"
  ],
  "author": "Aprilynne Pike",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/9719509-wings"
}