{
  "title": "Winter Wishes",
  "description": "A woman has the Christmas Eve from Hell. Two cat shifters play naughty games. And a witch brings out the beast inside the man. The magic of the season takes on a whole new meaning in these three fantastic—and festive—novellas from some of the best voices in paranormal romance.Anthology Tangled Tinsel by Vivian ArendShe's the cat's meow, and he's ready to pounce!Five miles of leather-clad leg is all it takes to lure Kyle Branegan out from his carefully hidden lifestyle as part of the Cougar Corp, a secret branch of the Shifter Enforcer League. He's hoping for a night of fun and frolic, cat-style, no strings attached. With a sultry swing of her hips, Eloise Scott tangles him up in her ball of tricks, and just when he thinks he's about to get lucky, she cuffs him--naked--to her bed.An undercover cop in the human police force, El's been given a top-secret mission to keep the big cat under her paw until he's needed to testify in court in the New Year. Her decision to take him home for a quiet Christmas in her sleepy hometown turns out to be far more interesting than she expected. Her parents are suddenly rich, her old boyfriend is sniffing around and all six-feet-plus of sexy cougar male is sleeping in her bed.And that's before they announce their fake engagement...No Angel by Vivi AndrewsWhen Sasha's boyfriend, Jay, is sucked through a fiery vortex to Hell, an angel reveals that Sasha's been chosen as the Champion of Virtue in the battle for his immortal soul. As a perennial offender on Santa's naughty list, Sasha can't believe she's anyone's idea of a girl fighting on the side of the angels. But if she doesn't save Jay, he'll be stuck in Hell forever!Jay—aka Jevroth—isn't surprised to find himself back in Hell. His visa to visit the mortal plane expired three months ago, but to steal more time with Sasha he's been ignoring his mother's demands that he come home to spend time with his new Lucifer.Sasha has until dawn on the twenty-fifth of December to fight the Legions of Hell and rescue Jay, or be trapped there for eternity herself. But now she must decide if the lying son-of-a-demon is even worth saving...Freeze Line by Moira RogersShe can't survive in his world; he can't stay sane in hersA twenty-first century ice age dulls the magic that emanates from the earth. Shane Sullivan is a lone wolf above the freeze line. He has no desire to join the packs that range closer to the border, where feral instincts can turn a man into a monster. Not until the winter solstice, when he stumbles across a dying witch who needs his help to get back to her people—and her magic—in the south.Nadia is a powerful woman in her own world, but she's been drained by her escape from captivity in a northern lab. She knows it's foolhardy to trust a werewolf, but he's her only chance to survive the vast white wilderness. The farther south they travel, the harder it is for Shane to keep the beast within under control, and as their mutual attraction intensifies, Nadia's no longer sure she wants him to.",
  "genres": [
    "Anthologies",
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Witches",
    "Fantasy"
  ],
  "author": "Vivi Andrews",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/9728137-winter-wishes"
}