{
  "title": "مذكرات حرب أكتوبر",
  "description": "(نبذة من موقع النيل والفرات)كتبت حرم الفريق سعد الشاذلى السيدة \"زينات السحيمى\" فى إهداء هذا الكتاب فى الصفحة الأولى منه \"إلى شباب 25 يناير الذين صنعوا أعظم الثورات والتى لولاها لما رأى هذا الكتاب النور\"نعم هذا الكتاب ظل منفياً بعيداً عن وطنه طيلة أكثر من ثلاثين عاماً.. مطارداً كصاحبه الذى رفض الصمت على حساب الحق ووطنه و الحقيقة؟ فضحى بمنصبه ورغد عيشه وقال كلمته الحين رغم أننا السلطان الجائر.. فكان نصيبه النفى و الهروب من الملاحقة و أخيراً تسليم نفسه ليقضى عقوبة بالسجن بدلاً من تكريم عن حرب شهد لها الجميع بأنها معجزة حربية بالحقائق لا بالكلمات والعبارات الإنشائية.. ولكن هل يستحق هذا الكتاب كل ذلك؟ نعم.. فهو فيه فضح لكل الأكاذيب التى روجها السادات وحاول إخفائها عن حرب أكتوبر, فقد وضح وأجاب فيه \"الفريق سعد الدين الشاذلي\" عن أسئلة فاصلة ومحورية فى تلك الحرب بل فى ذلك الصراع العربى الإسرائيلى فيقول الفريق سعد الدين عن كتابه فى مقدمة طبعته الأولى (على الرغم من صدور كتب كثيرة عن حرب أكتوبر 1973 بين العرب و إسرائيل, فما زال هناك الكثير من الحقائق الخافية؛ التى لم يتعرض لها أحد حتى الأن كما أن ثمة حقائق أخرى قام بعضهم بتشويهها, أحياناً عن جهل, وأحياناً أخرى عن خطأ معتمد لإخفاء هذه الحقائق, ومن بين الموضوعات التى مازالت غامضة تبرر التساؤلات الأتية:لماذا لم تقم القوات المصرية بتطوير هجومها نحو الشرق بعد نجاحها فى عبور قناة السويس, ولماذا لم تستول على المضائق فى سيناء؟هل حقاً كان من تصور القيادة العامة للقات المسلحة المصرية أن يقوم الدو بالإختراق فى منطقة الدفرسوار بالذات, وأنها أعدت الخطة اللازمة لدحر هذا الإختراق فى حالة وقوعه؟ وإذ كان هذا حقيقياً, فلماذا لم يقم المصريون بالقضاء على الإختراق فور حدوثه؟كيف تطور أختراق العدو فى منطقة الدفرسوار يوماً بعد يوم, وكيف كانت الخطط التى يضعها العسكريون تنقض من قبل رئيس الجمهورية ووزير الحربية؟ من هو المسئول عن حصار الجيش الثاث؟ من هم القادة العسكريون أم القادة السياسيون؟ كيف أثر حصار الجيش الثالث على نتائج الحرب سياسياً وعسكرياً, لا على مصر وحدها بل على العالم العربى بأسره؟عندما قررت أن أبدأ فى كتابة مذكراتى فى أكتوبر 76- أى بعد ثلاث سنوات من حرب أكتوبر 73- أم يكن هدفى هو كشف أكاذيب السادات التى عمد تأليفها جزافاً أن وضعت الحرب أوزارها, بل كان هدفى الأول هو إعطاء صورة حقيقية للأعمال المجيدة والمشرفة التى قام بها الجندى المصرى فى هذه الحرب. إن من المؤسف حقاً أن السادات ورجاله لم يستطيعوا تقديم هذه الحرب فى الإطار الذى تستحقه كعمل من أروع الأعمال العسكرية فى العالم. ولقد عمدوا إلى الكلمات الإنشائية و البلاغية دون الإستعانة بلغة الأرقام والتحليل العلمى للعوامل المحيطة بها. لقد أنحصر همهم فى إخفاء وطمس دور الفريق سعد الدين الشاذلى الذى كان يشغل منصب رئيس أركان حرب القوات المسلحة المصرية لمدة إمتدت من مايو 71 \"29 شهراً قبل بداية الحرب\" وحتى 12 ديسمبر 73 \"سبعه أسايبع بعد وقف إطلاق النار\", ولم يعلم السادات أنه بهذا الحقد على الفريق سعد الدين الشاذلى قد أساء إساءة بالغة للقوات المسلحة المصرية).لم يكن \"الشاذلى\" يكذب فالكتاب شهادة تقذف الباطل فتدفعه تصيبه فى مقتل رغم كل السلطة و الإعلام وكل من حاول إخفاء الحقيقة عن الشعب المصرى و العربى والعالم أجمع.. ولكن بعد هذه السنوات والقيود خرجت الحقيقة من قمتها وكسرت الأغلال والقيود عن الشعب المصرى وقالت الأيام كلمتها وبودلت الأماكن فصار الكتاب حراً طليقاً وصار سجانيه أذلاء فى حياتهم و موتهم.. فلنرى فى قصة هذا الكتاب وما كتب فى سطوره عبرة الأيام فى الأكاذيب و الكاذبين وعظمة الجندى المصرى وعبقريته وصموده.. جندياً وقائداً.(مقتبس من مدونة أكثر من حياة)",
  "genres": [
    "Politics",
    "History",
    "Biography",
    "Egypt",
    "Nonfiction",
    "War",
    "Military Fiction"
  ],
  "author": "سعد الدين الشاذلي",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/9730695"
}