{
  "title": "A Blade Away",
  "description": "\"There are two kinds of \"disturbing\" novels, the kind that splashes blood and depravity around for cheap shock value, and the other kind- a novel so delicately contstructed that the reader goes willingly into that dark night. And such is the case with this novel, A Blade Away. The journey, while disturbing, reads honest and true. The details maybe gruesome at times, but what other than horrendous acts of violence could give birth to a serial killer who doesn't even realize that's what he's become. Not to sound like a PSA, but serial killers are people too, though society often forgets that. Wallen has given us a complex bad-guy with deep battle scars and a warped sense of purpose. Serial Killers may not think like the average person, but they do think and feel just ilke the rest of us. Wallen is that good... I found myself both repulsed by and empathetic towards the twisted Doctor at the same time.\" -- Karen Fowler  \" \"A Blade Away\" is a dark, raw, unflinching, at times bleak and yes, gruesome, look at the horrors inflicted upon a certain minority of humans in our world: the LGBT community.\" -- M. Frastley  \"A Blade Away made my skin crawl. It is an in-depth picture of the inner workings of a serial killer's mind--a serial killer who doesn't know he IS a serial killer. It deals with the hardships of being homosexual, being a female police officer, and the identity issues transgendered folks face. It is touching, painful, and intriguing. I'm looking forward to reading more from this author.\" -- Bookish Witch  Prepare to meet the most twisted serial killer since Hannibal Lecter.  On the surface Lakme appears human, but deep below the the skin and meat beats a heart so damaged he has no choice but to unleash a special blend of horror upon the transgendered men of Louisville, Kentucky.  The “God of Gender” will not stop until he has brought each of his victims closer to their truest selves with the gift of transformation.  A struggling young police officer, Jamie Davenport, finds herself fighting the suspicions of a victimized population reluctant to cooperate, a police force unwilling to take the crimes seriously, and a killer that is always one step ahead.",
  "genres": [
    "Mystery",
    "Horror"
  ],
  "author": "Jack Wallen",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/9729576-a-blade-away"
}