{
  "title": "People Get Ready!: A New History of Black Gospel Music",
  "description": "People Get Ready!: A New History of Gospel Music is a passionate, celebratory, and carefully researched chronology of one of America's greatest treasures. From Africa through the spirituals, from minstrel music through jubilee, and from traditional to contemporary gospel, People Get Ready! shows the links between styles, social patterns, and artists. The emphasis is on the stories behind the songs and musicians. From the nameless slaves of Colonial America to Donnie McClurkin, Yolanda Adams, and Kirk Franklin, People Get Ready! provides, for the first time, an accessible overview of this musical genre. In addition to the more familiar stories of Thomas A. Dorsey and Mahalia Jackson, the book offers intriguing new insights into the often forgotten era between the Civil War and the rise of jubilee-that most intriguing blend of minstrel music, barbershop harmonies, and the spiritual. Also chronicled are the connections between some of gospel's precursors (Blind Willie Johnson, Arizona Dranes, and Sister Rosetta Tharpe) and modern gospel stars, including Andrae Crouch and Clara Ward. People Get Ready! knits together a number of narratives, and combines history, musicology and spirituality into a coherent whole, stitched together by the stories of dozens of famous and forgotten musical geniuses.FROM THE INTRODUCTION\"Among the richest of the lavish gifts Africa has given to the world is rhythm. The beat. The sound of wood on wood, hand on hand. That indefinable pulse that sets blood to racing and toes to tapping. It is rhythm that drives the great American musical exports, the spiritual (and, by extension, gospel), the blues, jazz and rock 'n' roll. But first you must have the spirituals-religion with rhythm.In this book, I will show the evolution of a musical style that only occasionally slows down its evolution long enough to be classified before it evolves yet again. In historical terms, spirituals emerged from African rhythm, work-songs, and field hollers in a remarkably short time-years, perhaps days-after the first African slaves landed on American shores. From the spirituals sprang not just their spiritual heir jubilee, but jazz and blues. And gospel music in its modern understanding morphed from the spirituals, the blues, jubilee and-of course-African rhythm.What today's gospel music is and what it is becoming is part of the continuing evolution of African American music. Religion with rhythm.\"",
  "genres": [
    "Music",
    "History"
  ],
  "author": "Robert Darden",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/972973.People_Get_Ready_"
}