{
  "title": "The Honourable Schoolboy",
  "description": "Tinker, Tailor, Soldier, Spy -- John le Carre's last tremendous success-ended with the devastating unmasking of a double agent at the heart of the British Secret Service (known as the Circus to le Carre's millions of readers round the world). Now, in The Honourable Schoolboy, George Smiley -- who has assumed the unenviable job of restoring the health, and reputation, of his demoralized organisation -- goes over to the attack. Salvaging what he can of the Service's ravaged network of spies, summoning back a few trustworthy old colleagues, working them -- and himself-around the clock, he searches for a whisper, a hint, a clue that will lead him back to his opposite Karla, the Soviet officer in Moscow Centre who masterminded the infamous treachery.When he finds his opening, Smiley moves without hesitation. His the Far East. His choice of the Honourable Gerald (Jerry) Westerby, an Old Asia Hand, veteran of several marriages (and wars), unquestioning in his readiness to answer Smiley's summons. \"You point me and I'll march,\" says Jerry.Jerry's odyssey to Hong Kong-and blackmail and murder; to collapsing Cambodia and Vietnam-and drug traffickers, the CIA, and a huge and mystifying \"gold seam\" spilling out of Russia. Slowly, manipulated by Smiley and his cohorts back in the Circus, Jerry thrusts himself into the centre of an intrigue of money, defection, passion -- and finds not only fertile ground for Smiley's revenge, but a drama of loyalty and love that both tests his courage and spurs his belated coming of age, in tragic defiance of the voracious requirements of the trice which owns his allegiance.Here is John le Carre's richest, most accomplished work. Suspense, excitement, the techniques of espionage as only he has been able to make them real for us -- together with a Towing capacity for sustained action, a grandly conceived and intricately drawn plot, and profound observation of the Far Eastern landscape. The Honourable Schoolboy is both a supreme entertainment and a major novel.",
  "genres": [
    "Fiction",
    "Espionage",
    "Thriller",
    "Mystery",
    "Audiobook",
    "Spy Thriller",
    "Mystery Thriller"
  ],
  "author": "John Le Carré",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/972516.The_Honourable_Schoolboy"
}