{
  "title": "Pox: An American History",
  "description": "The untold story of how America's Progressive-era war on smallpox sparked one of the great civil liberties battles of the twentieth century.At the turn of the last century, a powerful smallpox epidemic swept the United States from coast to coast. The age-old disease spread swiftly through an increasingly interconnected American landscape: from southern tobacco plantations to the dense immigrant neighborhoods of northern cities to far-flung villages on the edges of the nascent American empire. In Pox, award-winning historian Michael Willrich offers a gripping chronicle of how the nation's continentwide fight against smallpox launched one of the most important civil liberties struggles of the twentieth century.At the dawn of the activist Progressive era and during a moment of great optimism about modern medicine, the government responded to the deadly epidemic by calling for universal compulsory vaccination. To enforce the law, public health authorities relied on quarantines, pesthouses, and \"virus squads\"-corps of doctors and club-wielding police. Though these measures eventually contained the disease, they also sparked a wave of popular resistance among Americans who perceived them as a threat to their health and to their rights.At the time, anti-vaccinationists were often dismissed as misguided cranks, but Willrich argues that they belonged to a wider legacy of American dissent that attended the rise of an increasingly powerful government. While a well-organized anti-vaccination movement sprang up during these years, many Americans resisted in subtler ways-by concealing sick family members or forging immunization certificates. Pox introduces us to memorable characters on both sides of the debate, from Henning Jacobson, a Swedish Lutheran minister whose battle against vaccination went all the way to the Supreme Court, to C. P. Wertenbaker, a federal surgeon who saw himself as a medical missionary combating a deadly-and preventable-disease.As Willrich suggests, many of the questions first raised by the Progressive-era antivaccination movement are still with us: How far should the government go to protect us from peril? What happens when the interests of public health collide with religious beliefs and personal conscience? In Pox, Willrich delivers a riveting tale about the clash of modern medicine, civil liberties, and government power at the turn of the last century that resonates powerfully today.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medicine",
    "Medical",
    "Health",
    "History Of Medicine"
  ],
  "author": "Michael Willrich",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/9730383-pox"
}