{
  "title": "Raising Brooklyn: Nannies, Childcare, and Caribbeans Creating Community",
  "description": "Stroll through any public park in Brooklyn on a weekday afternoon and you will see black women with white children at every turn. Many of these women are of Caribbean descent, and they have long been a crucial component of New York’s economy, providing childcare for white middle- and upper-middleclass families. Raising Brooklyn offers an in-depth look at the daily lives of these childcare providers, examining the important roles they play in the families whose children they help to raise. Tamara Mose Brown spent three years immersed in these Brooklyn communities: in public parks, public libraries, and living as a fellow resident among their employers, and her intimate tour of the public spaces of gentrified Brooklyn deepens our understanding of how these women use their collective lives to combat the isolation felt during the workday as a domestic worker.Though at first glance these childcare providers appear isolated and exploited—and this is the case for many—Mose Brown shows that their daily interactions in the social spaces they create allow their collective lives and cultural identities to flourish. Raising Brooklyn demonstrates how these daily interactions form a continuous expression of cultural preservation as a weapon against difficult working conditions, examining how this process unfolds through the use of cell phones, food sharing, and informal economic systems. Ultimately, Raising Brooklyn places the organization of domestic workers within the framework of a social justice movement, creating a dialogue between workers who don’t believe their exploitative work conditions will change and an organization whose members believe change can come about through public displays of solidarity.",
  "genres": [
    "Nonfiction",
    "Sociology"
  ],
  "author": "Tamara R. Mose",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/9727459-raising-brooklyn"
}