{
  "title": "Folly Beach",
  "description": "Folly BeachHome is the place that knows us best. . . .A woman returns to the past to find her future in this enchanting new tale of loss, acceptance, family, and love.With its sandy beaches and bohemian charms, surfers and suits alike consider Folly Beach to be one of South Carolina's most historic and romantic spots. It is also the land of Cate Cooper's childhood, the place where all the ghosts of her past roam freely. Cate never thought she'd wind up in this tiny cottage named the Porgy House on this breathtakingly lovely strip of coast. But circumstances have changed, thanks to her newly dead husband whose financial—and emotional—bull and mendacity have left Cate homeless, broke, and unmoored.Yet Folly Beach holds more than just memories. Once upon a time another woman found unexpected bliss and comfort within its welcoming arms. An artist, writer, and colleague of the revered George Gershwin, Dorothy Heyward enjoyed the greatest moments of her life at Folly with her beloved husband, DuBose. And though the Heywards are long gone, their passion and spirit lingers in every mango sunset and gentle ocean breeze.And for Cate, Folly, too, holds the promise of unexpected fulfillment when she is forced to look at her life and the zany characters that are her family anew. To her surprise, she will discover that you can go home again. Folly Beach doesn't just hold the girl she once was . . . it also holds the promise of the woman she's always wanted—and is finally ready—to become.Folly Beach, filled with the irresistible charm, saucy wit, and lush atmosphere that have won her the devotion of fans and propelled her books to bestsellerdom, is vintage Dorothea Benton Frank.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Southern",
    "Womens Fiction",
    "Historical Fiction",
    "Audiobook"
  ],
  "author": "Dorothea Benton Frank",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/9729507-folly-beach"
}