{
  "title": "Progeny",
  "description": "Nikalys and his sister Kenders grew up living a peaceful life in the quiet farming village of Yellow Mud... until the blistering hot day when they go to the nearby lake for a swim. When they reach the lake, they spy an unknown mage conjure a massive water creature hundreds of feet tall. They watch in horror as the water creature plunges toward their home, apparently drowning all in its path, including their parents and older brother, Jak.As the only survivors, brother and sister strike out on their own, hoping to discover the reason their home and family was destroyed. They must make their way through a countryside where magic is outlawed, punishable by imprisonment or even death while struggling with the revelation that Kenders has magical abilities herself.Although Kenders can feel and touch the many-colored \"strands\" of magic she has no idea how to use them until she and Nikalys are attacked by a pack of wolves and Kenders instinctively summons a bolt of lightning, immediately collapsing when the effort drains her of all her energy. From nowhere a giant lynx appears and saves the pair from certain death and then miraculously morphs into his natural self, a seven-foot-tall man. The shape changer's name is Broedi and when the time is right, he reveals to the siblings that he is one of the original White Lions and he recites to them an ancient prophecy that tells of the coming of a new and even more terrible war than the one centuries ago. The evil Gods of Chaos, Strife, and Sorrow and Pain would combine efforts to unite the orcs, gnolls and razorfiends --- normally sworn enemies. The forces of good would be led by two children of other White Lions; those children are Nikalys and Kenders, the Progeny.As brother and sister struggle with the revelation that the only parents they could remember were not their birth parents, some of the Gods and Goddesses were busy setting other events in motion. Others people - strangers at first - would gather and become allies of the Progeny. Together, they were about to be caught up in the greatest conflict the world had ever seen.Ancient, powerful forces still seek the Progeny on their travels, some intent to eliminate the threat they pose, some hoping to help them fulfill a destiny of which they are unaware. Myths and legends come to life, whisking the pair along a journey they never could have imagined possible.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult",
    "Epic Fantasy",
    "Magic",
    "Action",
    "Science Fiction"
  ],
  "author": "R.T. Kaelin",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/9729882-progeny"
}