{
  "title": "Leave If You Can",
  "description": "There is something different about Angelina. She is passionate and idealistic by nature, thanks to her Italian mother. But her German father's influence makes her stubborn and headstrong as well. With Europe embroiled in World War II and her father missing on the Russian front, Angelina journeys alone to seek out her mother's family in Italy. There she finds a kindred spirit--her cousin Giulia, two years her senior.Both girls are idealistic atheists and ardent Communists. With Fascist Italy reeling under repeated defeats in the summer of 1943, the two decide to fight for the socialist world revolution in whatever way they can. Setting out alone through the wartime chaos, the two soon join the Italian partisan group known as \"L'Altalena\" led by the dashing Antonio.After Italy's surrender to the Allies and Hitler's subsequent occupation of the country, Antonio's partisans are soon in action against the Nazi troops. Angelina's courage and devotion to the cause soon earns her Antonio's admiration--and his love. But during a battle with the Germans, L'Altalena is scattered, Antonio is injured, and Angelina is missing. Giulia returns to the scene of the battle to look for her cousin, and what she finds there amazes her. Angelina is alive and living in the abandoned ruins of the nearby abbey of Santa Maria del Monte. What's more, from sheer necessity, Angelina has donned the habit of a Benedictine nun.When Giulia tries to convince Angelina to leave the abbey, she finds Angelina engaged in a spiritual struggle every bit as daunting as her physical battle against the Nazis. Though in love with Antonio, Angelina is mystically tied the abbey by a force she can only explain by pointing to the inscription over a shattered egredere si potes -- leave if you can. Her internal struggle becomes even more intense after she witnesses the terrible aerial bombing of the ancient abbey of Monte Cassino, founded by Saint Benedict himself in the sixth century.When the war ends, Angelina is faced with a return to the world and marry Antonio--now an important figure in Italian politics, or remain and serve God.Orignally written in German in 1959, Leave If You Can is a beautiful novella of wartime Italy that explores the challenge of God's mystical call versus the overpowering allure of the world.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Luise Rinser",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/9733026-leave-if-you-can"
}