{
  "title": "A Plague on All Houses",
  "description": "\"I laughed until I cried and gnawed to the quick of my nails as I was held in Dana Fredsti’s thrall. I will never watch Zombie movies in the same way again.\" --Night Owl Reviews (5 Stars- A Reviewer Top Pick)\"Fredsti's writing is razor sharp as her heroes fight off the horde while fighting their attraction for each other. Who will win? Ashley and Gabriel or the Undead outside their door?\" Stacey Graham - author of The Zombie Dating Guide\"A PLAGUE ON ALL HOUSES is sexy, weird, creepy, over-the-top zombie goodness. Required reading for the deranged.\" -Jonathan Maberry, New York Times bestselling author of Patient Zero and Marvel Zombie ReturnsAshley Drake is just a pretty northern California co-ed with a love/hate crush on the strong-jawed, golden-haired Gabriel, her frustratingly handsome teaching assistant. But neither are what they appear to be...In the space of one day the world has gone topsy-turvy. A viral outbreak is bringing the dead to life. Ashley discovers strength and abilities she never dreamed she had when she becomes drawn into the struggle against the walking dead as part of an elite zombie hunting unit. Her new squad leader? Gabriel, who is shouldering more than a few secrets of his own. Between fighting with zombies and fighting with Gabriel, Ashley is about to learn the true meaning of drop-dead gorgeous.\"Spooks, scaries, and zombies, oh my! Treat yourself to Dana Fredsti's A Plague on all Houses, a zombie romance (don't worry, romance between humans, no one losing body parts in the midst of--romance!) Chills and thrills for that season when you're looking for--chills and thrills! --Heather Graham, author of Hallowed Ground & The Flynn Brothers Trilogy\"Dana Fredsti has created a world as familiar as our own back yard and populated it with recognizable people we care about ... and zombies. But this isn't just another zombie novel. It spans a spectrum of emotion and action that sets it above the rest. A PLAGUE ON ALL YOUR HOUSES will have you turning pages fast ... and checking the locks on all the doors.\"-- Ray Garton, author of Live Girls and Sex and Violence in Hollywood\"As adorable an end of the world as you're liable to get, Fredsti's A PLAGUE ON ALL HOUSES is brisk, witty ultraviolent romantic gurlventure.... It is, in a word, a hoot.\" --Gina McQueen, author of Opposite Sex and Apocalypse as Foreplay",
  "genres": [
    "Zombies",
    "Horror",
    "Urban Fantasy",
    "Fantasy",
    "Fiction"
  ],
  "author": "Dana Fredsti",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/9738520-a-plague-on-all-houses"
}