{
  "title": "Among Other Things, I've Taken Up Smoking",
  "description": "An arresting new literary talent addresses the journey of light years-or is it a hop-from an island in Maine to the island of ManhattanMiranda's father has always seemed to her as obscure and elusive as the thick New England fog that surrounds their isolated island home. When she was three years old, her parents moved from Manhattan to tiny Crab Island off the coast of Maine so he could work on his translation of Ovid's Metamorphoses . Not long after, her mother took the boat out one day, disappeared into the fog, and never came back. Miranda grew up quickly and quietly in the lonely house, caring for her brilliant but troubled father and sustaining herself with fantasies that grew out of the ill-fated stories of lustful nymphs and vengeful gods that he read to her from his manuscript. Aside from a halfhearted friendship with one of the girls at her school, her only true friend was Mr. Blackwell-a fisherman who had helped her father adjust to life on the island all those years ago and whose relationship with her father is-like so much else about her father-complicated and shrouded in mystery.But when Miranda graduates from high school, her father announces that he has arranged for her to travel to New York to stay with friends from his old life, and Miranda embarks on a journey that will finally reveal the truth about her father's past and open up her world in ways she cannot begin to imagine.Sweeney's spare, essential writing brings the contrasts of stark, sea-misted Maine and the chaotic blur of Manhattan into striking relief. Hers is a haunting story about loneliness, about the isolation of island life, whether it's a deserted island off Maine or the overcrowded noisy island of Manhattan. Sweeney's remarkable ability to capture the peculiarities of a place and its inhabitants is astonishing, and her delicate rendering of Miranda's own metamorphosis elevates this novel from a typical coming-of-age story to a work of lasting literary value.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Contemporary",
    "Literary Fiction",
    "Coming Of Age",
    "Novels"
  ],
  "author": "Aoibheann Sweeney",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/973528.Among_Other_Things_I_ve_Taken_Up_Smoking"
}