{
  "title": "Lucky Stiff",
  "description": "\"Evanovich...with a dash of CSI.\" - Publishers WeeklyEveryone Has a Hidden TalentFor Lucky O'Toole it's murder...solving it.Surviving in Sin City takes cunning, a pair of five-inch heel, and a wiseass attitude. Lucky has mastered them all and has a pair of legs she uses to kick butt and turn heads.As the Chief Problem Solver for the Babylon, Las Vegas's most over-the-top destination, mischief is in her job description.She's good at her job.She's less good at life. But who has time for a life when there's a killer on the lose?LUCKY STIFFSomeone fed Numbers Neidermeyer to the tiger shark in the tank at Mandalay Bay resort.Lucky's friend, the Beautiful Jeremy Whitlock, is suspect Numero Uno.Miss P, Jeremy's squeeze and Lucky's partner in crime, is in a tailspin.A tractor-trailer full of honeybees jackknifes on the Strip in front of the Babylon, spilling its load.The district attorney--apparently the odd man out in a threesome--is hiding in the buff in a laundry room.And Lucky's mother decides to auction a young woman's virginity.Can Lucky get Jeremy out of the hot seat, handle the new hot French chef and her mother...and restore order in her life?Join the fun! Get your copy today!READING ORDERWanna Get Lucky? (The Lucky O'Toole Vegas Adventure Series Book 1)Lucky Stiff (The Lucky O'Toole Vegas Adventure Series Book 2)Lucky in Love (A Lucky O'Toole Original Novella 1)So Damn Lucky (The Lucky O'Toole Vegas Adventure Series Book 3)Lucky Bang (A Lucky O'Toole Original Novella 2)Lucky Now and Parts One and Two (A Lucky O'Toole Original Novella 3-4)Lucky Bastard (The Lucky O'Toole Vegas Adventure Series Book 4)Lucky Catch (The Lucky O'Toole Vegas Adventure Series Book 5)Lucky Flash (A Lucky O'Toole Original Novella 5)Lucky Break (The Lucky O'Toole Vegas Adventure Series Book 6)Lucky the Hard Way (The Lucky O'Toole Vegas Adventure Series Book 7)AN INTERVIEW WITH DEBORAH COONTSWhy did you decide to write humor?I'm not sure I decided to add snark to the Lucky, books, specifically to Lucky's own voice, it just happened that way. When I was a kid, my mouth always got me into trouble. Finally, I've found a way to harness the sarcasm for the Forces of Good--or at least in a way not to anger my grandmother. And when Lucky started talking to me, she had a strong dose of sass in her.The Lucky O'Toole Vegas Adventure series is hard to categorize. Is that by design?When I set out to write Wanna Get Lucky? , I knew I wanted to write a romp through Las Vegas. I had the characters and the setting but no real understanding of narrative drive. So, I threw a young woman out of a tour helicopter into the middle of the Pirate Show and let the story unfold. A bit of murder to keep the plot moving, some wisecracking and Vegas mischief to make you laugh, and some romance to keep it interesting. A bit of a mash up, but it works.PRAISE FOR Lucky Stiff\"Las Vegas is the perfect setting for this witty tale of misdirection and larger-than-life characters. Fans of J. A . Konrath's Jack Daniels series will love this .\" - Library Journal, starred review\"Coonts covers Sin City territory with a dash of CSI and Janet Evanovich in her second glitzy, lighthearted novel.\" - Publishers Weekly\"Fast-paced, witty, and full of colorful characters, Lucky Stiff is a sure bet to be a readers' favorite .\" - Booklist\"A prize fight, a pop star and a virginity auction. Could we be anywhere else but Las Vegas?... [ Lucky Stiff ] is as lively and endearingly wacky as Wanna Get Lucky? \" - Kirkus Reviews\"This wonderfully funny and entertaining mystery stars Lucky O'Toole, head of customer relations at a Las Vegas resort. Readers who like cozy mysteries with a lot of sass, great dialogue and a plot that flies will love this .\" - RT Book Reviews",
  "genres": [
    "Mystery",
    "Fiction",
    "Romance",
    "Cozy Mystery",
    "Humor",
    "Audiobook",
    "Chick Lit"
  ],
  "author": "Deborah Coonts",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/9744503-lucky-stiff"
}