{
  "title": "Punished",
  "description": "‘Punished’ is the inspiring true story of an unusual little girl, Vanessa, whose childhood was devastated by torture and abuse at the hands of her sadistic mother. Vanessa was nearly destroyed until she discovered a secret that ultimately saved her life.From the age of 3, Vanessa lived in daily terror of her mother's unpredictable rage. If she was 'naughty', her mother would lash out at her – with beatings, torture, starvation and making Vanessa sleep in their garden's pigsty, tied up like an animal. Her mother said her punishments were God's revenge on her for being the devil's child. Her father lived in denial of her suffering.When she was 6 years old, Vanessa's grandfather began to sexually abuse her – to her despair, aided and abetted by both her mother and grandmother. At eight years old, she then discovered that the 'mother' who hated her so much had adopted her as a baby and would never love her as her own.At the most horrific times of Vanessa's abuse, she nearly lost all hope that she would escape her prison, until mysterious things started to happen to her that allowed her to fight back.This is the story of how Vanessa survived a childhood that nearly destroyed her and how her secret led her out of the horrors of her past.Vanessa Steel was born and brought up on the outskirts of Birmingham in the 1950s. She survived her childhood ordeals and developed a psychic gift (as a young child she foresaw the assassination of Kennedy in 1963 oblivious to who he was), and started working professionally as a medium. She is now one of the most sought after psychic mediums in Britain with a long list of private clients including many celebrities, both in the UK and abroad.",
  "genres": [
    "Nonfiction",
    "Abuse",
    "Memoir",
    "Biography",
    "True Crime",
    "True Story",
    "Biography Memoir"
  ],
  "author": "Vanessa Steel",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/9740553-punished"
}