{
  "title": "16th-Century Treaties: Union of Utrecht, Triple Alliance, Union of Lublin, Pacification of Ghent, Treaty of Grimnitz, Act of Abjuration",
  "description": "Please note that the content of this book primarily consists of articles available from Wikipedia or other free sources online. Pages: 37. Chapters: Union of Utrecht, Triple Alliance, Union of Lublin, Pacification of Ghent, Treaty of Grimnitz, Act of Abjuration, Treaty of Zaragoza, Peace of Augsburg, Treaty of Berwick, Sandugo, Treaty of Stettin, Union of Mielnik, Treaty of Nemours, Treaty of Edinburgh, Treaty of Perpetual Peace, Concordat of Bologna, Franco-Hungarian alliance, Treaty of London, First Congress of Vienna, Treaty of Chambord, Reservatum ecclesiasticum, Edict of Beaulieu, Edict of Boulogne, Declaratio Ferdinandei, Treaty of Ferhat Pasha, Treaty of Cebu, Treaty of Plussa, Treaty of Joinville, Edict of Amboise, Truce of Jam Zapolski, Treaty of Teusina, Franco-Polish alliance, Treaty of Greenwich, Treaty of Hampton Court, Union of Arras, Treaty of Frankfurt, Peace of Saint-Germain-en-Laye, Treaty of Nonsuch, Peace of Passau, Pragmatic Sanction of 1549, Treaty of Weissenburg, Treaty of Rouen, Treaty of Blois, Edict of 1577, First Treaty of Bromsebro, Treaty of Speyer, Peace of Amasya, Union of Grodno, Treaty of Krakow, Treaty of Bergerac, Treaty of Grosswardein, Treaty of Novgorod, Treaty of the More, Treaty of Malmo, Treaty of Drohiczyn, Treaty of Bassein, Treaty of Plessis-les-Tours, Treaty of Fleix, Treaty of Trodesillas, Peace of Longjumeau, Treaty of Gorinchem, Treaty of Dorpat. Excerpt: The Triple Alliance of 1596 (full title: Tract of alliance between England, France and the United Netherlands), was an alliance between England, France and the Republic of the Seven United Netherlands. The Republic joined as a third party to an earlier agreement between England and France, but the alliance did in fact not take effect until the Republic joined. By signing the treaty, France and England were the first states to recognize the Republic of the Seven United Netherlands as an independent state. The three parties in the alliance were all at war with Spain...",
  "genres": [],
  "author": "Books LLC",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/9749569-16th-century-treaties"
}