{
  "title": "Organized Agriculture and the Labor Movement before the UFW: Puerto Rico, Hawai’i, California",
  "description": "Puerto Rico, Hawai'i, and California share the experiences of conquest and annexation to the United States in the nineteenth century and mass organizational struggles by rural workers in the twentieth. Organized Agriculture and the Labor Movement before the UFW offers a comparative examination of those struggles, which were the era's longest and most protracted campaigns by agricultural workers, supported by organized labor, to establish a collective presence and realize the fruits of democracy. Dionicio Nodín Valdés examines critical links between the earlier conquests and the later organizing campaigns while he corrects a number of popular misconceptions about agriculture, farmworkers, and organized labor. He shows that agricultural workers have engaged in continuous efforts to gain a place in the institutional life of the nation, that unions succeeded before the United Farm Workers and César Chávez, and that the labor movement played a major role in those efforts. He also offers a window into understanding crucial limitations of institutional democracy in the United States, and demonstrates that the widespread lack of participation in the nation's institutions by agricultural workers has not been due to a lack of volition, but rather to employers' continuous efforts to prevent worker empowerment. Organized Agriculture and the Labor Movement before the UFW demonstrates how employers benefitted not only from power and wealth, but also from imperialism in both its domestic and international manifestations. It also demonstrates how workers at times successfully overcame growers' advantages, although they were ultimately unable to sustain movements and gain a permanent institutional presence in Puerto Rico and California.",
  "genres": [],
  "author": "Dionicio Nodín Valdés",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/9754615-organized-agriculture-and-the-labor-movement-before-the-ufw"
}