{
  "title": "Tangled Webs: How False Statements are Undermining America: From Martha Stewart to Bernie Madoff",
  "description": "Bestselling author James B. Stewart's newsbreaking investigation of our era's most high-profile perjurers, revealing the alarming extent of this national epidemic.Our system of justice rests on a simple that witnesses will raise their hands and tell the truth. In Tangled Webs , James B. Stewart reveals in vivid detail the consequences of the perjury epidemic that has swept our country, undermining the very foundation of our courts.With many prosecutors, investigators, and participants speaking for the first time, Tangled Webs goes behind the scene of the trials of media and homemaking entrepreneur Martha Stewart; top White House political adviser Lewis \"Scooter\" Libby; home-run king Barry Bonds; and Wall Street money manager Bernard Madoff.The saga of Martha Stewart's conviction captured the nation, but until now no one has answered the most basic Why would Stewart risk prison, put her entire empire in jeopardy, and lie repeatedly to government investigators to save a few hundred thousand dollars in stock gains? Moreover, how exactly was the notoriously meticulous Stewart brought down?Drawing on the accounts of then-deputy attorney general James Comey and U.S. Attorney Patrick Fitzgerald, Stewart sheds new light on the Libby investigation, making clear how far into the White House the Valerie Plame CIA scandal extended, and why Libby took the fall.In San Francisco, Giants home-run king Barry Bonds faces trial due to his testimony before a grand jury investigating the use of illegal steroids in sports. Bonds was warned explicitly that the only crime he faced was perjury. Stewart unlocks the story behind the mounting evidence that he nonetheless lied under oath.Bernie Madoff's Ponzi scheme is infamous, but less well known is how he eluded detection for so long in the face of repeated investigations. Of the four he is the only one who has admitted to lying.The perjury outbreak is symptomatic of a broader breakdown of ethics in American life. It isn't just the judicial system that relies on an honor Academia, business, medicine, and government all depend on it. Tangled Webs explores the age-old tensions between greed and justice, self-interest and public interest, loyalty and duty. At a time when Americans seem hungry for moral leadership and clarity, Tangled Webs reaffirms the importance of truth.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Business",
    "Law",
    "Sociology",
    "Audiobook"
  ],
  "author": "James B. Stewart",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/9754472-tangled-webs"
}