{
  "title": "Never Mind Yaar",
  "description": "The coming of age of three young girls from different backgrounds in Mumbai, a city fraught with communal tensions. When long time friends Binaifer and Louella meet Shalini at Gyan Shakti College, gyan for knowledge and shakti for strength, a true friendship that transcends cultural and religious backgrounds is born. Louella is a Christian and Binaifer, a Parsi. Shalini is from a traditional Hindu family. She's been brought up to believe her parents and autocratic grandma will choose her life partner for her. On the very first day at college her eyes accidentally look into those of a young fellow student's and her heart is lost forever. She knows she must resist as her family won't allow a match with a mere student. But she has two unlikely cupids to contend with. Binaifer (Binny) and Louella (Lou) think Bhagu, the young student, is perfect for Shali. The girls go through four years of college together, facing many challenges on the one hand but also the comfort and reassurance on the other, of growing up in the cultural, political and bewildering mosaic that is Mumbai. The author admits there's a message - that of the curse of communalism (or racism). But first, the book is about the light hearted years of college and true friendship between the girls. This is how it all begins: Dr. Naakwaa of Gyan Shakti College couldn't help smiling to himself as he looked at the sea of eager, animated young faces. They all seemed to speak at once, or so it seemed to an old man like himself, their ceaseless chatter outdone only by sudden bursts of loud laughter. Even as they talked and laughed in their own groups, he saw their eyes covertly watching the others. An air of breathless expectancy hung about them, as if something momentous would sweep them up on a wing and fly them away to an unknown destination. Without exception, they all clamoured to go, even the ones standing at the periphery, hesitant and slightly lost though they appeared to be.",
  "genres": [],
  "author": "K. Mathur",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/9748847-never-mind-yaar"
}