{
  "title": "From Birdland to Broadway: Scenes from a Jazz Life",
  "description": "In the 1950s, New York City's Birdland was the center of the world of modern jazz--and a revelation to Bill Crow, a wet-behind-the-ears twenty-two-year-old from Washington State. Located on Broadway between 52nd and 53rd streets, the club named for the incomparable Charlie \"Bird\" Parker boasted lifesize photo murals of modern jazzmen like Dizzy Gillespie, Lennie Tristano, and, of course, Bird himself, looming large against jet black walls. Exotic live birds perched in cages behind the bar. The midget master of ceremonies, 3'9\" Pee Wee Marquette, dressed in a zoot suit and loud tie, smoked huge cigars and screeched mispronounced introductions into the microphone. And the jazz-struck young Crow would park in the bleachers till 4 am, blissfully enveloped by the heady music of Bird, Bud Powell, Max Roach, and a host of other jazz giants.From Birdland to Broadway is an enthralling insider's account of four decades of a life in jazz. Bill Crow, journeyman bass player, superb storyteller, and author of the successful Jazz Anecdotes , here narrates many moving and delightful tales of the pioneers of modern jazz he played with and was befriended by. We find Dizzy Gillespie, with whom Crow, because of prior commitments, regretfully declined steady work, dancing at the Royal Roost, Stan Getz sadly teetering on the brink of losing himself to drugs, and Harry Belafonte (known then as \"the Cinderella Gentleman\") running a lunch counter in New York's Sheridan Square between music dates. And we also witness many of the highlights of Crow's career, such as in 1955 when the Marian McPartland Trio (with Crow on bass) was named \"Small Group of the Year\" by Metronome ; Crow playing with the Gerry Mulligan Quartet at venues like Storyville in Boston and Harlem's Apollo Theater (where they appeared with Dinah Washington); and the tourof the Soviet Union with Benny Goodman, a journey that might have been a high point of Crow's travels abroad but was marred by Goodman's legendary mistreatment of his band.Moving beyond jazz clubs to the Broadway concert pit and a variety of studio gigs in the '60s, Crow encounters actors such as Yul Brynner and pop-rock acts like Simon and Garfunkel. From the great to the near-great, from Billie Holiday to Judy Holliday, Bill Crow's wealth of personal anecdotes takes the reader from Birdland, to the Half Note, to the Playboy Club, to the footlights of Broadway. This revealing book is a marvelous portrait of the jazz world, told by someone who's been there.",
  "genres": [
    "Music",
    "Jazz",
    "Biography Memoir"
  ],
  "author": "Bill Crow",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/97577.From_Birdland_to_Broadway"
}