{
  "title": "Green Is the New Red: An Insider's Account of a Social Movement Under Siege",
  "description": "At a time when everyone is going green, most people are unaware that the FBI is using anti-terrorism resources to target environmentalists and animal rights activists. The courts are being used to push conventional boundaries of what constitutes \"terrorism\" and to hit nonviolent activists with disproportionate sentences. Some have faced terrorism charges for simply chalking slogans on the sidewalk. Like the Red Scare, this \"Green Scare\" is about fear and intimidation, using a word—\"eco-terrorist\"—to push a political agenda, instill fear and silence dissent. The animal rights and environmental movements directly threaten corporate profits every time activists encourage people to go vegan, to stop driving, to consume fewer resources and live simply. Their boycotts are damaging, and corporations and the politicians who represent them know it. In many ways, the Green Scare, like the Red Scare, can be seen as a culture war, a war of values. Will Potter outlines the political, legal, extra-legal and public relations strategies that are being used to threaten even acts of nonviolent civil disobedience with the label of \"terrorism.\" Here is a guided tour into the world of radical activism that introduces the real people behind the headlines and tells the story of how everyday people are being prevented from speaking up for what they believe in. \"Will Potter unveils this complex movement with its virtues and its flaws, the courage of a few and the false bravado of others. I see this book as the definitive overview of the genesis of what is emerging as the most important social movement in human history – the war to save ourselves from ourselves.\"—Captain Paul Watson, Sea Shepherd Conservation Society \"If we are to survive capitalism's death grip on our discourse and on our lives, it will be in great measure due to the work of people like Will Potter. His courage and integrity, which set him apart from most journalists, are evident throughout this important book, and throughout all of his other crucial work. Thank you, Will Potter.\"—Derrick Jensen, author of Endgame \"Part history, part action thriller and courtroom drama, part memoir, Green is the New Red plunges us into the wild, unruly, and entirely inspirational world of extreme environmental activism. Will Potter, participant-observer and partisan-reporter, is the perfect guide, unpacking with wit and skill the most elusive concepts . . .\"—Bill Ayers Potter (a contributor to The Next Eco-Warriors) warns that the U.S. government is using post-9/11 anti-terrorism resources to target environmentalists and animal right activists (in some cases for doing nothing but speaking up) . . . Potter warns of the crumbling of \"the legal wall separating 'terrorist' from 'dissident' or 'undesirable,'\" and concludes his account with a call to action and a decry of the injustice that results in the \"terrorist\" label being put on those who threaten American corporate interests. Alarming.\"— Publishers Weekly \"In this hard-hitting debut, journalist Potter likens the Justice Department targeting of environmentalists today to McCarthyism in the 1950s . . . A shocking exposé of judicial overreach.\"— Kirkus Reviews (Starred review) Will Potter is an award-winning reporter who has written for publications including the Chicago Tribune, the Dallas Morning News and Legal Affairs, and has testified before the U.S. Congress about his reporting. He is the creator of www.GreenIsTheNewRed.com, where he blogs about the Green Scare.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Environment",
    "History",
    "Activism",
    "Vegan",
    "Animals"
  ],
  "author": "Will Potter",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/9759438-green-is-the-new-red"
}