{
  "title": "Wicked",
  "description": "Setting: Medieval England Sensuality: 7 Lady Sofia Howard is richly dowered and the ward of her powerful cousin, King Edward of England. Willful, independent, and full of mischief, she foils every attempt the king makes to betroth her to an acceptable nobleman. But at age 12, Sofia falls head over heels in love when she looks across a sea of people at a fair and into the eyes of a handsome knight, Sir Tobin de Clare. Over the next several years, Sofia and Tobin are thrown together on occasion; given Sofia's stubborn nature and Tobin's arrogance, it's not surprising that their acquaintance is stormy.  But no one could have predicted the fireworks that erupt when King Edward betroths Sofia to Tobin without her knowledge or consent. While there is no denying the passion that blazes between them, Sofia wonders if she'll ever really know the hard-edged knight. At the same time, Tobin struggles to come to terms with the depth of his feelings for his impossible wife. Each has emotional scars from their childhood and Sofia needs to know that she is loved by Tobin for herself alone and not for just her rich dower. And when fate intervenes with war, hostages, and duty to his king, the arrogant Tobin may make one wrong decision too many and lose Sofia forever. Set against the backdrop of medieval England with all its pageantry, pomp, danger, and strife, Wicked is the story of two passionate, prideful people as they struggle to find a way to live and love together. Following Sofia and Tobin as they evolve from youthful sweethearts, embark on the heart-wrenching seas of matrimony as newlyweds, and at last reap the rewards of a deep and abiding love is a wonderful journey.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Medieval",
    "Medieval Romance",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Jill Barnett",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/9756498-wicked"
}