{
  "title": "Lions of Kandahar: The Story of a Fight Against All Odds",
  "description": "One of the most critical battles of the Afghan War is now revealed as never before. Lions of Kandahar is an inside account from the unique perspective of an active-duty U.S. Army Special Forces commander, an unparalled warrior with multiple deployments to the theater who has only recently returned from combat there.Southern Afghanistan was slipping away. That was clear to then-Captain Rusty Bradley as he began his third tour of duty there in 2006. The Taliban and their allies were infiltrating everywhere, poised to reclaim Kandahar Province, their strategically vital onetime capital. To stop them, the NATO coalition launched Operation Medusa, the largest offensive in its history. The battlefield was the Panjwayi Valley, a densely packed warren of walled compounds that doubled neatly as enemy bunkers, lush orchards, and towering marijuana stands, all laced with treacherous irrigation ditches. A mass exodus of civilians heralded the carnage to come.Dispatched as a diversionary force in support of the main coalition attack, Bradley’s Special Forces A-team and two others, along with their longtime Afghan Army allies, watched from across the valley as the NATO force was quickly engulfed in a vicious counterattack. Key to relieving it and calling in effective air strikes was possession of a modest patch of high ground called Sperwan Ghar. Bradley’s small detachment assaulted the hill and, in the midst of a savage and unforgettable firefight, soon learned they were facing nearly a thousand seasoned fighters—from whom they seized an impossible victory.Now Bradley recounts the whole remarkable story as it actually happened. The blistering trek across Afghanistan’s infamous Red Desert. The eerie traces of the elusive Taliban. The close relations with the Afghan people and army, a primary mission focus. Sperwan Ghar itself: unremitting waves of fire from machine guns and rocket-propelled grenades; a targeted truck turned into an inferno; the death trap of a cut-off compound. Most important: the men, Americans and Afghans alike—the “shaky” medic with nerves of steel and a surgeon’s hands in battle; the tireless sergeant who seems to be everywhere at once; the soft-spoken intelligence officer with laser-sharp insight; the diminutive Afghan commander with a Goliath-sized heart; the cool maverick who risks all to rescue a grievously wounded comrade—each unique, all indelible in their everyday exercise of extraordinary heroism.Praise for Lions of Kandahar\n \n “A raw and authentic war story about untamed Green Berets in action.”—Dalton Fury, New York Times bestselling author of Kill Bin Laden    “A powerful and gripping account of a battle that helped shape the war in Afghanistan . . . With crisp writing and page-turning action, Lions of Kandahar is one of the best books written about the conflict.”—Mitch Weiss, Pulitzer Prize–winning investigative journalist and co-author of Tiger Force: A True Story of Men and War   “One of the most important documents to emerge from the war in Afghanistan.”—The Seattle Times   “Powerful . . . a riveting account of a strategic battle that doesn’t glorify war or focus on heroic deeds . . . Make room on your military bookshelf for Lions of Kandahar.”—San Antonio Express-News  “Bradley takes the reader into battle.”\n—Time",
  "genres": [
    "Military Fiction",
    "History",
    "Nonfiction",
    "War",
    "Military History",
    "Biography",
    "Memoir"
  ],
  "author": "Rusty Bradley",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/9755391-lions-of-kandahar"
}