{
  "title": "Sejarah Dunia Kuno: Dari Cerita-cerita Tertua Sampai Jatuhnya Roma",
  "description": "Apa yang terlintas di benak kita ketika membaca ending sebuah buku seperti di atas? Dan bukan sembarang buku, melainkan sebuah buku sejarah dengan tebal nyaris 800 halaman? Pertama kali ketika saya menerima buku tersebut, setelah puas melihat judul, sinopsis, review dan acknowledgement-nya, saya langsung membuka (karena iseng, memang), halaman terakhir di mana terdapat kalimat terakhir dari ‘buku berat’ ini. Waktu itu imaji yang terlintas di benak saya adalah sebuah ending yang ‘tidak biasa’ untuk sebuah buku sejarah, tidak datar, tidak monoton, tapi menyimpan sebuah ‘sisa akhir’ dari rangkaian aksi luar biasa sebelumnya, sekaligus menjanjikan sebuah ‘episode’ berikutnya yang lebih memukau. Seperti menonton bagian akhir dari Lord of The Rings episode pertama atau kedua. Ada kesan kepuasan, pemenuhan (accomplishment), dan pencerahan dari babak yang baru saja kita lewati. Sebuah ending yang sungguh ‘hidup.’ Kesan ini sesungguhnya memang terdapat di seluruh bagian buku The History of the Ancient World, From the Earliest Account to the Fall of Rome, karya penulis sejarah Susan Wise Bauer. Membaca karya Bauer ini seperti menonton sebuah film-film sejarah kolosal, seperti Alexander The Great atau Julius Caesar. Pembaca tidak dibiarkan berlama-lama larut dalam kebosanan membaca fakta-fakta sejarah seperti kejadian, tanggal, tahun dan nama pelaku. Nama pelaku sejarah dalam buku ini tidak hanya sekadar nama untuk dihapalkan, melainkan mempunyai kekuatan pribadi, atau dengan kata lain, menjadi sebuah karakter penentu jalannya cerita. Kejadian pun bukan hanya diuraikan sebab akibatnya, melainkan dipaparkan dengan hidup, dilengkapi fakta-fakta lain yang biasanya diabaikan dalam buku sejarah lainnya, seperti peninggalan arkeologi, peta dan alur waktu (time line). Bauer sendiri ketika diminta menulis ini cukup ragu-ragu. Bayangkan, dia (yang kini mengajar di College of William & Mary, Virginia, AS) harus menulis sebuah buku sejarah dunia lama yang komprehensif. Menurut penuturannya, siapa pun yang mendengar proyek yang ia kerjakan itu, pastilah akan menertawakannya. Namun, berkat arahan dan support dari editornya di W.W. Norton, New York, Bauer menerima tantangan ini dan menuliskan semuanya dengan gaya naratif yang unik. Hasilnya? Sebuah buku tentang sejarah dunia lama yang sangat komprehensif (dan pasti tebal), namun tetap enak dibaca, bahkan oleh orang awam sekali pun.",
  "genres": [
    "History",
    "Nonfiction",
    "Ancient History",
    "World History",
    "Audiobook",
    "Historical",
    "Ancient"
  ],
  "author": "Susan Wise Bauer",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/9757702-sejarah-dunia-kuno"
}