{
  "title": "Mommy's Choice",
  "description": "The bestselling author of One Crazy Summer, Wildwood Shadows, and Saving Brooksie now brings you this updated version of his 2008 Christian Choice Award winning novel “Mommy’s Choice” – a tale of woman who seems to be losing her sanity in the midst of losing her son.  According to Stephanie, her last name is Tanner. According to everyone else, it’s not. According to Stephanie, her 22 year old son just simply vanished. According to everyone else, he did a little more than “vanish.”  Has Stephanie lost touch with reality?  Why can’t she figure out what happened between her and Jonathan?  Perhaps returning to her old job (a job she apparently never had) and talking to her old friend Dave (who apparently never met her) could help uncover the clues necessary to answer her nagging question – What happened to her son & best friend Jonathan?  It will keep you guessing up until the final page!  This updated version of the original novel simply brings the story to more recent times, making it easier to relate to. For the most part, all the years in the timeline have changed, with minor changes throughout to keep the story properly connected.  Scott McElhaney is the winner of the 2008 Christian Choice Book Award for his debut suspense novel \"Mommy's Choice.\" With over 250,000 books downloaded worldwide, he is making nearly all of his novels available to Kindle readers at the very accessible price of only 99 cents. Scott is a veteran of the US Navy, a father of two teenage boys, and he has been happily married for more than 20 years.  EDITORIAL REVIEWS:   \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Beacon Journal Book Review  \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and, if you like a good storyteller Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer and Vine Voice Michael Gallagher",
  "genres": [
    "Mystery",
    "Christian Fiction",
    "Christian",
    "Thriller",
    "Suspense",
    "Fiction"
  ],
  "author": "Scott  Curtis",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/13233512-mommy-s-choice"
}