{
  "title": "Healer",
  "description": "From national bestselling author Carol Cassella comes the story of one doctor’s struggle to hold her family together through a storm of broken trust and questioned ethics.Claire is at the start of her medical career when she falls in love with Addison Boehning, a biochemist with blazing genius and big dreams. A complicated pregnancy deflects Claire’s professional path, and she is forced to drop out of her residency. Soon thereafter Addison invents a simple blood test for ovarian cancer, and his biotech start-up lands a fortune. Overnight the Boehnings are catapulted into a financial and social tier they had never anticipated or they move into a gracious Seattle home and buy an old ranch in the high desert mountains of eastern Washington, and Claire drifts away from medicine to become a full-time wife and mother.Then Addison gambles everything on a cutting-edge cancer drug, and when the studies go awry, their comfortable life is swept away. Claire and her daughter, Jory, move to a dilapidated ranch house in rural Hallum, where Claire has to find a job until Addison can salvage his discredited lab. Her only offer for employment comes from a struggling public health clinic, but Claire gets more than a second chance at medicine when she meets Miguela, a bright Nicaraguan immigrant and orphan of the contra war who has come to the United States on a secret quest to find the family she has lost. As their friendship develops, a new mystery unfolds that threatens to destroy Claire’s family and forces her to question what it truly means to heal.Healer exposes the vulnerabilities of the American family, provoking questions of choice versus fate, desire versus need, and the duplicitous power of money.",
  "genres": [
    "Fiction",
    "Medical",
    "Book Club",
    "Contemporary",
    "Relationships",
    "Novels",
    "Womens Fiction"
  ],
  "author": "Carol Cassella",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/9761817-healer"
}