{
  "title": "The Painted Bridge",
  "description": "An elegant, emotionally suspenseful debut, The Painted Bridge is a story of family betrayals, illicit power, and a woman sent to an asylum against her will in Victorian England.JUST OUTSIDE LONDON, behind a high stone wall, lies Lake House, a private asylum for genteel women of a delicate nature. In the winter of 1859, Anna Palmer becomes its newest patient. To Anna’s dismay, her new husband has declared her in need of treatment and brought her to this shabby asylum. Confused and angry, Anna is determined to prove her sanity, but with her husband and doctors unwilling to listen, her freedom will notbe easily won. As the weeks pass, she finds other allies: a visiting physician who believes the new medium of photography may reveal the state of a patient’s mind; a longtime patient named Talitha Batt, who seems, to Anna’s surprise, to be as sane as she is; and the proprietor’s bookish daughter, who also yearns to escape. Yet the longer Anna remains at Lake House, the more she realizes that—like the ethereal bridge over the asylum’s lake—nothing and no one is quite as it appears. Not her fellow patients, her husband, her family—not even herself. Locked alone in her room, driven by the treatments of the time into the recesses of her own mind, she may discover the answers and the freedom she seeks . . . or how thin the line between madness and sanity truly is. Wendy Wallace’s taut, elegantly crafted first novel, The Painted Bridge is a story of family betrayals and illicit power; it is also a compelling portrait of the startling history of the psychiatric field and the treatment of women— in society and in these institutions. Wallace sets these ideas and her characters on the page beautifully, telling a riveting story that is surprising and deeply moving.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Mystery",
    "Gothic",
    "Victorian",
    "Book Club"
  ],
  "author": "Wendy Wallace",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/13233587-the-painted-bridge"
}