{
  "title": "Hot Sour Salty Sweet: A Culinary Journey Through Southeast Asia",
  "description": "Luminous at dawn and dusk, the Mekong is a river road, a vibrant artery that defines a vast and fascinating region. Here, along the world's tenth largest river, which rises in Tibet and joins the sea in Vietnam, traditions mingle and exquisite food prevails. Award-winning authors Jeffrey Alford and Naomi Duguid followed the river south, as it flows through the mountain gorges of southern China, to Burma and into Laos and Thailand. For a while the right bank of the river is in Thailand, but then it becomes solely Lao on its way to Cambodia. Only after three thousand miles does it finally enter Vietnam and then the South China Sea.It was during their travels that Alford and Duguid—who ate traditional foods in villages and small towns and learned techniques and ingredients from cooks and market vendors—came to realize that the local cuisines, like those of the Mediterranean, share a distinctive culinary approach: Each cuisine balances, with grace and style, the regional flavor quartet of hot, sour, salty, and sweet. This book, aptly titled, is the result of their journeys.Like Alford and Duguid's two previous works, Flatbreads and Flavors (\"a certifiable publishing event\" —Vogue) and Seductions of Rice (\"simply stunning\"—The New York Times), this book is a glorious combination of travel and taste, presenting enticing recipes in \"an odyssey rich in travel anecdote\" (National Geographic Traveler).The book's more than 175 recipes for spicy salsas, welcoming soups, grilled meat salads, and exotic desserts are accompanied by evocative stories about places and people. The recipes and stories are gorgeously illustrated throughout with more than 150 full-color food and travel photographs.In each chapter, from Salsas to Street Foods, Noodles to Desserts, dishes from different cuisines within the region appear side by side: A hearty Lao chicken soup is next to a Vietnamese ginger-chicken soup; a Thai vegetable stir-fry comes after spicy stir-fried potatoes from southwest China.The book invites a flexible approach to cooking and eating, for dishes from different places can be happily served and eaten together: Thai Grilled Chicken with Hot and Sweet Dipping Sauce pairs beautifully with Vietnamese Green Papaya Salad and Lao sticky rice.North Americans have come to love Southeast Asian food for its bright, fresh flavors. But beyond the dishes themselves, one of the most attractive aspects of Southeast Asian food is the life that surrounds it. In Southeast Asia, people eat for joy. The palate is wildly eclectic, proudly unrestrained. In Hot, Sour, Salty, Sweet, at last this great culinary region is celebrated with all the passion, color, and life that it deserves.",
  "genres": [
    "Cookbooks",
    "Food",
    "Cooking",
    "Nonfiction",
    "Travel",
    "Asian Literature",
    "Asia"
  ],
  "author": "Jeffrey Alford",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/97658.Hot_Sour_Salty_Sweet"
}