{
  "title": "Good Tidings",
  "description": "Black Friday – the official opening of the holiday shopping season – and Patrice Marcum is stuck in the middle of her local superstore with a crying infant, a near-hysterical desire to just abandon the diapers and milk she desperately needs, and the snowstorm of the century dumping half a foot of snow on the parking lot outside. She needs a miracle.The little old lady seems sweet, but there was no way Patrice was going to leave three-month-old Jeremy with a stranger. She looks outside at the snow-covered parking lot and sees yet another distressed shopper’s cart topple over in the drifts. The old lady senses her distress and volunteers to call a store employee to help watch over Jeremy while Patrice gets her car. The older gentleman, wearing a store badge with the name “Ron,” seems too good to be true. What could be safer?Less than five minutes later, after brushing the snow off the van and driving across the crowded and snow-packed parking lot, Patrice pulls up in front of the store. Jeremy is not there. Pushing back panic, she rushes into the store and looks around. Jeremy is not inside either. She pushes through the line at Customer Service; the associate calls Ron on the intercom and issues a Code Adam. When Ron appears and he’s only seventeen years old, Patrice realizes the worst. “Oh God! They’ve taken my baby!”Mary O’Reilly, private investigator, is decorating her office for the holiday season when the newly installed bell over her door jingles. She looks over to see a six-year-old boy standing next to her desk. His name is Joey Marcum and he wants to hire Mary to find his baby brother.Mary nodded. “Okay, Joey, but I’ll want to work with the police on this one. Do you have any problems with that?”Joey paused. “No, I guess you can talk to them.” “That’ll be helpful.”“But you can’t tell my mom you’re working for me,” he said, “Promise?”“Yes, I promise.”Joey shrugged. “I don’t think she’d understand, seeing that I’m dead, you know.”",
  "genres": [
    "Mystery",
    "Paranormal",
    "Ghosts",
    "Romance",
    "Fiction",
    "Paranormal Mystery",
    "Cozy Mystery"
  ],
  "author": "Terri Reid",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/9761317-good-tidings"
}