{
  "title": "Metal Cowboy: Tales from the Road Less Pedaled",
  "description": "An excerpt Our story so Oh, To Be Young and Go Very, Very Fast It was 5:30 a. m. in Pocatello, Idaho, a thin sheet of icy rain masked sunrise, and I wasn't quite sure I was up for my latest bicycling adventure. Coasting through the nearly deserted streets of this small Western town, I found myself poised at a stoplight. An ingrained obedience to traffic laws coupled with a sleepy hangover from the long train ride kept me anchored in place though there wasn't a car in sight. As I waited, an old rancher ambled up to the intersection. The fur collar on his long coat was tattered, crusted with tobacco stains, and faded. As his cane tapped its way over my bike, I noticed for the first time that he was blind. One eye drooped shut like that of a tomcat that had seen too many late-night brawls, while the other, still open, was cloudy and distant. That eye reminded me of an African tribesman seen in the pages of National Geographic who suffered from river blindness. The old rancher continued to work his cane over me, tapping as he went. And though the light changed from red to green several times, I remained frozen, allowing this slow survey of my person. The moment felt intimate and awkward, but I did not break it. When he was done, the old rancher stood back, grinned through a ruin of teeth, and said, \"Ah, metal cowboy.\" I was dumbfounded and surprised; first, that he had spoken at all, and more importantly, that this battered husk of man had hit upon a perfect description of me at the time, and my story. Though I looked more like a surfer, or a guy on a fool's journey, to him I felt like a metal cowboy, the bike my horse, and the asphalt my trail. \"Keep the wind at your back, and find where the innocent sleep,\" he added. Then, without fanfare, my rancher crossed the street and dissolved into the early morning mist. A chill passed through me. I have thought about that old man many times during my travels. He was right about the wind, and as for locating where the innocent sleep, I want to believe he meant to look for the best in people along the road, and that's what you will often find. My bicycle has also brought me to the innocence and the best in myself. Collective",
  "genres": [
    "Travel",
    "Cycling",
    "Nonfiction",
    "Sports",
    "Memoir",
    "Autobiography",
    "Bicycles"
  ],
  "author": "Joe Kurmaskie",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/976162.Metal_Cowboy"
}