{
  "title": "7 Day Confidence and Ego-Boost Affirmation Plan",
  "description": "This 7 Day Confidence and Ego-Boost Affirmation Plan by million seller self-help guru Stepen Richards is one of the most powerful ways to help build confidence and assertiveness and will help transform your life. In order for you to discover the difference between just repeating an affirmation and how it can be used as a potent life-changing tool here is a 7 day plan with ego-boosting and confidence affirmations designed to work with days. By using these specially formulated affirmations and working with them two or three times a day will invoke great change from within.These power affirmations have been double filtered for positivity, and in clean language will give you a most potent force for change. These power affirmations in this 7 day plan are not meant to overcome negative statements in your mind, but will invoke change from within you in a safe and natural way. These affirmations have been designed to work over a 7 day period, and will eventually attract good corresponding events into your life.ABOUT THE AUTHORSTEPHEN RICHARDS, the Golden Pen, has had numerous books serialised in the national press and magazines. He has authored and co-authored over 70 titles for other well respected publishers.TV credits Panorama, Trevor McDonald’s Tonight programme, Real Lives, BBC TV (and BBC TV digital Horizon channel), BBC and independent radio, Channel 4, Channel 5 TV and Independent TV.Independent film and TV companies regularly seek his advice, also having contributed to numerous newspaper and magazine features. As well as being a qualified Clinical Hypnotherapist, he is also a qualified stress counsellor, and was once listed with the British Association of Counsellors’ Disaster Team, Family & Sexual Division and was also a Student Stress Counsellor. Now concentrating on Mind, Body & Spirit books and audios, Stephen has dedicated himself to coaching mind power techniques and regularly runs courses and workshops. When not publishing other authors and working on therapeutic projects, Stephen is also a successful property developer. He also has a portfolio of rental properties which is valued at millions (pound sterling). His success is solely through his self-development and use of mind power, for which he is ranked as one of the world’s top experts.",
  "genres": [
    "Self Help"
  ],
  "author": "Stephen Richards",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/13234466-7-day-confidence-and-ego-boost-affirmation-plan"
}