{
  "title": "War Talk",
  "description": "As the United States pushes for war on Iraq, Arundhati Roy, the internationally acclaimed author of The God of Small Things, addresses issues of democracy and dissent, racism and empire, and war and peace in this collection of new essays. The eloquence, passion, and political insight of Roy’s political essays have added legions of readers to those already familiar with her Booker Prize-winning novel. -Invited to lecture as part of the prestigious Lannan -Foundation series on the first anniversary of the unconscionable attacks of September 11, 2001, Roy challenged those who equate dissent with being \"anti-American.\" Her previous essays on globalization and dissent have led many to see Roy as \"India's most impassioned critic of globalization and American influence\" ( New York Times ). War Talk collects new essays by this prolific writer. Her work highlights the global rise of religious and racial violence. From the horrific pogroms against Muslims in Gujarat, India, to U.S. demands for a war on Iraq, Roy confronts the call to militarism. Desperately working against the backdrop of the nuclear recklessness between her homeland and Pakistan, she calls into question the equation of nation and ethnicity. And throughout her essays, Roy interrogates her own roles as \"writer\" and \"activist.\" \"If [Roy] continues to upset the globalization applecart like a Tom Paine pamphleteer, she will either be greatly honored or thrown in jail,\" wrote Pawl Hawken in Wired Magazine. In fact she was jailed in March 2002, when -India's Supreme Court found Roy in contempt of the court after months of attempting to silence her criticism of the government. Fully annotated versions of all Roy's most recent -essays, including her acclaimed Lannan Foundation -lecture from September 2002, are included in War Talk . Arundhati Roy is the winner of the Lannan Foundation’s Prize for Cultural Freedom, 2002, and will be returning to the U.S. in association with the Lannan Foundation in 2003. Roy’s most recent collection of essays, Power Politics , now in its second edition, sold over 25,000 copies in its first 12 months.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Essays",
    "India",
    "History",
    "War",
    "Philosophy"
  ],
  "author": "Arundhati Roy",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/9774.War_Talk"
}