{
  "title": "Why Not Me? The Inside Story",
  "description": "First came Theodore White's The Making of the President , 1960.  Then All the President's Men .  Now the searing chronicle that will forever change the way we view the man and the office .  .  .  The dramatic rise and dizzying fall of Al Franken, who would become the first Jewish president of the United States.Franken began his unique American journey in the small town of Christhaven, Minnesota, the self-described \"son of the son of immigrants and the son of a daughter of a son and daughter of immigrants.\"Follow the Franken campaign from its infancy as the candidate pledges \"to walk the state of New Hampshire, diagonally and then from side to side.\" As he candidly admits \"causing pain in his marriage,\" then boldly refuses to dignify any questions from the media regarding past, present, or future sexual behavior.  Go behind the scenes and meet Team Franken, the candidate's brain trust.  Including brother and deputy campaign manager Otto, a recovering sex addict and alcoholic.  Campaign manager Norm Ornstein, the think-tank policy wonk who masterminds the single-issue (ATM fees) campaign.  Media consultant Dick Morris, who exploits the shocking millennium bug-induced \"ATM meltdown\" by building an ad campaign around a diabetic woman who loses her right foot after computers erase all her ATM deposits.  And former Grizzly Adams star Dan Haggerty.  Cheer as Franken stuns the pundits by defeating Al Gore for the Democratic nomination, then is swept into office with a landslide victory over Newt Gingrich.  As he chooses an all-Jewish Cabinet because \"America doesn't want a Cabinet that looks like America, it wants a Cabinet the President is comfortable with.\"Then, through excerpts from Bob Woodward's detailed account of the first hundred days, The Void , go inside the Franken White House.  Gripped by crisis from day one, the president develops a severe case of chronic fatigue syndrome.  After the highly medicated chief executive exhibits a roller coaster of bipolar behavior, including the \"slugging Nelson Mandela\" incident and an attempt to clone himself, Franken is forced to cooperate with the Joint Congressional Committee on the President's Mood Swings.  And when the committee releases Franken's personal diaries to the public, his presidency faces its ultimate crisis.",
  "genres": [
    "Humor",
    "Politics",
    "Fiction",
    "Comedy",
    "Audiobook",
    "20th Century",
    "The United States Of America"
  ],
  "author": "Al Franken",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/977249.Why_Not_Me_The_Inside_Story"
}