{
  "title": "Voyager: The Art of Pure Awareness",
  "description": "Restoring Your True Self Through Spiritual AlchemyInspired by Upanishads sacred writings, Hinduism philosophy and spirituality, and the poetry of Zen, Taoism and Eastern Mysticism, Voyager is an inspirational and transformational work on spiritual and personal growth.When you identify less with your mind and physical form and become more aware of your formless and timeless essence within, you have the potential to discover \"There is a light that shines beyond all things on earth, beyond the highest, the very highest heavens. This is the light that shines in your heart.\" —Chandogya Upanishad.Deep within you is the real secret to true peace and happiness. Each of the twenty-five chapters presents a spiritual voyage toward your inner, authentic self. Exploring the shores of human-beingness ever more deeply, you may come to realise the “soul is the lighthouse—the light that guides us safely home.”By simply experiencing life without distraction from the negative mind, you see through personal drama to your truest nature. \"It is only the mind which appears as the world and as bondage; there is no world other than the mind. On inquiry, this mind turns out to be nothing more than ripples (thoughts) in the still ocean of Pure Awareness.\" —The Ribhu Gita.Pure awareness is an art that requires practice to quiet the surface of your over-active mind and still the rippling waters of your emotional seas. Awakening is recognising you are the timeless spaciousness for all appearances of the world, illuminated by the light that shines within.You stand at the bow of your ship. The sky is clear, the sea is calm. \"...Now voyager, sail thou forth to seek and find.\" —Walt WhitmanColour illustrations are best enjoyed by reading the paperback version or viewing on a colour-screen device.",
  "genres": [
    "Spirituality",
    "Self Help",
    "Nonfiction",
    "Philosophy",
    "Psychology"
  ],
  "author": "Robin Craig Clark",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/9768204-voyager"
}