{
  "title": "Heaven and Hell",
  "description": "Lux Collins now knows what lurks behind the beautiful images of her new boarding school...a danger so evil and terrifying, she barely survived her first semester. Now she's faced with battling the forces that threatens her very soul and the souls of others, but can she continue without her best friend Brax and guardian Asher, whom she now has strong feelings for?EXCERPT from Heaven and Hell (Beautiful Beings #2) - © Reprinted by permission. All rights reserved.The dark night, veiled in a cool mist, collapsed around me, closing in as I ran. The forest grew dense while the mist danced through the leaves and flailing branches. For a brief moment I lost sight of my prey.I pressed through the tightly packed shrubs and saw him, running at a speed that was astonishing, but not quite past my own capabilities. He darted around a huge tree, leaped over a stream with ease and clambered up a boulder with a quick glance back at me.\"I don't want to fight you, Lux,\" he said, his voice clear and well-controlled, completely unaffected by the chase. \"Not here. Not ever.\" I jumped to grasp his ankle, but he climbed on, out of reach.\"If I must, I ll keep running just to prevent a confrontation with you.\" Climbing over the boulder, I saw him, running along the edge of the cliff, undisturbed by the sharp drop just inches from his every footfall. The distance between us grew. I had to pound harder, faster, ignoring the possible peril of just one small slip. I had to catch him. Beyond anything else, I had to.\"You can't keep running\", I called out as I closed the space that kept us apart. \"Eventually you'll get tired and you ll have to stop.\" \"You're wrong,\" he shouted back. \"You may get tired, but I won't. I never will.\" While I concentrated on the chase, my heart held back, longing for another way to resolve our differences. I still loved him.\"It's stronger now\", he said. \"So much stronger. I barely feel human anymore. I could run on and on, tirelessly, endlessly.\"\"But you won't\", I argued. Just yards behind him, I could smell him. The scent of his skin had changed. Gone was the sweet masculinity that had always appealed to my senses. His odor was now bitter and pungent.\"I'll keep running as long as I have to. You're chasing me to fight and that would force me to fight back. That's something I won't allow, Lux. I won't fight you. I don't want to hurt you. I'd rather die.\"Beautiful Beings (Beautiful Beings #1)  - Now AvailableHeaven and Hell (Beautiful Beings #2)  - Now AvailableShadow Light (Beautiful Beings #3) - Now Available",
  "genres": [],
  "author": "Kailin Gow",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/9772642-heaven-and-hell"
}