{
  "title": "Everyday Stalinism: Ordinary Life in Extraordinary Times: Soviet Russia in the 1930s",
  "description": "Here is a pioneering account of everyday life under Stalin, written by one of our foremost authorities on modern Russian history.Focusing on urban areas in the 1930s, Sheila Fitzpatrick shows that with the adoption of collectivization and the first Five-Year Plan, everyday life was utterly transformed. With the abolition of the market, shortages of food, clothing, and all kinds of consumer goods became endemic. Aspeasants fled the collectivized villages, major cities were soon in the grip of an acute housing crisis, with families jammed for decades in tiny single rooms in communal apartments, counting living space in square meters. It was a world of privation, overcrowding, endless queues, and brokenfamilies, in which the regime's promises of future socialist abundance rang hollowly. We read of a government bureaucracy that often turned everyday life into a nightmare, and of the ways that ordinary citizens tried to circumvent it, primarily by patronage and the ubiquitous system of personalconnections known as blat . And we read of the police surveillance that was endemic to this society, and the waves of terror like the Great Purges of 1937, that periodically cast this world into turmoil. Fitzpatrick illuminates the ways that Soviet city-dwellers coped with this world, examining suchdiverse activities as shopping, traveling, telling jokes, finding an apartment, getting an education, landing a job, cultivating patrons and connections, marrying and raising a family, writing complaints and denunciations, voting, and trying to steer clear of the secret police.Based on extensive research in Soviet archives only recently opened to historians, this superb book illuminates the ways ordinary people tried to live normal lives under extraordinary circumstances.",
  "genres": [
    "History",
    "Russia",
    "Nonfiction",
    "Russian History",
    "Politics",
    "Soviet Union",
    "Soviet History"
  ],
  "author": "Sheila Fitzpatrick",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/978045.Everyday_Stalinism"
}