{
  "title": "يوميات فرانتس كافكا: 1910-1923",
  "description": "تمتد اليوميات على ثلاث عشرة سنة تقريبا، شرع صاحبها بكتابتها عندما كان في السابعة والعشرين ثم أقلع عنها على مشارف الأربعين، لتكون كتابتها بذلك مصحوبة بحياة الشقاء الاجتماعي والمعرفي في بلاد كانت تتهيأ للدخول في حرب عبثية طاحنة هي الحرب العالمية الأولى.ربما تكون هذه اليوميات، التي تنسب إلى الأدب المحض أكثر من انتسابها إلى منطقة شائكة بين ما هو أدبي وما هو تاريخي، تعبير عن «محنة» شخصية في الكتابة السردية، إذ تنطوي اليوميات في مفاصل كثيرة على تفكير تأملي في بعض القصص، بل وما يكاد يكون صراعا مع بعض شخصيات من هذه القصص.وفي سياق هذا الوعي الشقي تكشف اليوميات عن منابع أدب كافكا الذي يوصف عادة بأنه كابوسي وسوداوي، بل وإفشاء لطابع هذا الأدب ومنابعه ومصادره الأولى التي قد يكون الروائي الروسي المعروف ديستويفسكي واحدا أصيلا منها، ذلك أن الشخصيات لدى الأخير تحمل طابعا معقدا على المستوى النفسي وتحيا غالبا شقاء ما في مجتمع يعيش وضعا مضطربا باستمرار. وهذا من جهة.ومن جهة أخرى، يراقب كافكا الحياة العبثية في يومياته فيراها بعين العبث ذاته، فيكتب في الثاني من يوليو من العام 1914: «حالة» بسبب تقرير ماريا أبراهام، وهي امرأة في الثالثة والعشرين، أقدمت بسبب الفاقة والجوع على خنق طفلتها باربارا، التي لم تكد تبلغ تسعة أشهر، مستخدمة ربطة عنق رجالية استعملتها كرباط. قصة روتينية تماما.بفضل النار التي في غرفة الاستحمام استطعت أن أرسم لشقيقتي صورة هزلية سينمائية. لماذا لا أستطيع أن أفعل ذلك أمام الغرباء على الإطلاق؟. إنني لن أقدم على الزواج من فتاة عشت معها في مدينة واحدة مدة سنة». هذه التناقضات كلها في واحدة من اليوميات التي تشير إلى أن هذه الطريقة في الكتابة، ربما تكون أشبه بتمرين على استلهام الشخصيات التي أدخلها إلى صنيعه الأدبي وجعل منها مادة طيّعة لأهوائه ونزواته الأدبية إذا جاز التوصيف، تلك النزوات التي أنجزت فنّا سرديا رفيعا بحق، لكنها بالمقابل تشير إلى طبيعة الحياة المضطربة التي كان يعيشها كافكا إلى حدّ أن المرء يتساءل مع نفسه أثناء قراءة اليوميات: هل كان كافكا حقا شخصا سويا؟ هذا السؤال قد يجد الإجابة عنه عند محللين نفسيين أكثر من التحليل الأدبي.وهنا، فإن ما يلاحظه المترجم خليل الشيخ بخصوص المزج بين الحلم والواقع في مقدمة «يوميات فرانتس كافكا» جدير بالانتباه: «أدى- ذلك- إلى إنتاج عوالم رمزية شديدة الغموض، تحيل العالم المادي المشخَّص إلى كيان هلامي مسكون بالسوداوية والرعب.» غير أن كافكا يمارس هذه التقنية، في اليوميات، على نحو مثير للرعب بالفعل، أو على نحو مرض ربما لكن بطريقة «قاتل ما» لهذه الشخصيات من طراز خاص.يبقى أخيرا الحديث عن الترجمة، فإذا صحّ القول بأن سلاسة السرد ووضوح الأفكار وتبلورها في بنية تركيبية ونحوية عربية صرفة في النقل عن اللغات الأخرى فإن ترجمة الدكتور خليل الشيخ لهذا الكتاب الضخم هي ترجمة ناجحة إلى حدّ بعيد وتشير إلى مترجم محترف بقدرات عالية في التمكن من أدوات الترجمة وفهم العبارة الكافكاوية ومداورتها والتغلب على مصاعب التأويل في الكلام.",
  "genres": [
    "Nonfiction",
    "Classics",
    "Biography",
    "Memoir",
    "Literature",
    "Diary",
    "German Literature"
  ],
  "author": "Franz Kafka",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/9776039"
}