{
  "title": "Freud: A Life for Our Time",
  "description": "To read this book is to enter the world of Sigmund Freud as never before: his family, his city, his professional struggles, his long, extraordinarily fruitful and embattled life. We see him at work in times of declining liberalism, devastating war, uneasy peace, the rise of Hitler and the fall of Austria. We watch him devising and revising his epoch-making theories. We are there as he struggles toward his discoveries, haunted by the problems he poses for himself, brooding over his publications, quarreling with his disciples. And we encounter Freud, always energetic, often troubled and sometimes vindictive, as his ideas spread from a small inner circle in Vienna, through Europe, across the ocean to the United States⁠—and the world.Drawing on a vast instructive store of unpublished documents, including hundreds of hitherto unknown or inaccessible letters, Peter Gay probes Freud's mind, uncovers Freud's passions, and follows Freud's astonishing career. He analyzes Freud the psychoanalyst as politician, seeking support for his controversial findings. He discloses for the first time the dimensions of Freud's love for his daughter Anna, and his unorthodox analysis of her. He offers a thoughtful, detailed, fascinating account of Freud's relations with such problematic followers as Jung and Ferenczi. He deals frankly with the controversies that have long swirled around Freud's impassioned friendships, his love life, and his theoretical innovations, which, as Freud himself put it, agitated the sleep of mankind.Perhaps most important and rewarding of all. no previous biography has so securely integrated into Freud's life his case histories, technical papers, speculative aesthetics, and excursions into prehistory and cultural criticism. The sections scattered across this book in which Peter Gay lucidly expounds and explains Freud's theories of dreams and sexuality, development and neurosis, love and hate amount to a comprehensive⁠—and comprehensible⁠—liberal education in psychoanalytic thought, which is far more discussed than it is understood. Fitting as they do into Freud's most intimate concerns and cultural loyalties, these ideas gain a vivid life of their own.The reader will long remember the Freud that Peter Gay reveals here⁠—student, physician, psychologist, lover, husband, father, friend, founder, controversialist, Jew, victim, and victor. This book, brilliantly argued and brilliantly written, evokes an age, and the life and ideas of a man who, in W. H. Auden's phrase, is \"no more a person now but a whole climate of opinion.",
  "genres": [
    "Biography",
    "Psychology",
    "Nonfiction",
    "Psychoanalysis",
    "History",
    "Philosophy",
    "Biography Memoir"
  ],
  "author": "Peter Gay",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/97746.Freud"
}