{
  "title": "A Bucket of Ashes",
  "description": "“As always, the author excels at setting the scene, evoking the time and place by use of the day-to-day details as well as historical events. The resolution of the central mystery is almost secondary to the revelations about Nell’s past and the way the author ties up all the loose ends of her present situation. Longtime readers will enjoy this aspect immensely; I know I did. This has been a gorgeously written series, populated with unique and unforgettable characters.”—CA ReviewsSummers at the Hewitts family’s palatial Cape Cod “cottage” are always bittersweet for governess Nell Sweeney, for it was on the Cape that she lost all but one of her siblings to disease. Then she married Duncan, a ne’er-do-well charmer who abused her and coaxed her into petty crime before being condemned to spend the rest of his life in prison. Her dark past has been a deeply buried secret for years—but soon she’ll learn that it wasn’t buried quite deeply enough.Nell has proven herself an exemplary governess, and she is deeply devoted to little Gracie. But now the possibility that she might be carrying Will Hewitt’s child threatens to destroy everything she’s worked so hard for. Even if she were free to marry, she doubts that Will, a rootless cardsharp and recovering addict, could ever truly settle down. Not that marriage is even an option, since Duncan adamantly refuses to grant her a divorce. When the pregnancy is discovered, she’ll be ruined.Nell is dealt another blow when she finds out that her beloved brother Jamie has been discovered dead in a burned-out farm shed—and that he was wanted for murder. With help from an injured Will and her former mentor, Dr. Greaves, Nell attempts to clear Jamie’s name, a mission that takes her from the criminal underworld to the top ranks of Cape Cod society.Originally published by Berkley Prime Crime.“Ryan’s historical atmosphere is spot on. It’s a memorable look into the Gilded Age. I can’t help but recommend this series to those who enjoy cozy type historical mystery series.”—MyShelf.com“P.B. Ryan writes a heartwarming mystery that capture the ambivalence of the rich on the east coast five years after the civil war ended. The protagonist leads a troubled life but she rises above her upbringing to become a solid citizen who loves the responsibility of caring for her young charge. Will comes back from France where he was applying his medical skills and is there for Nell when she needs him most. Readers will care about him because he feels he is unworthy to love someone as pure as Nell.”—Genre Go Round ReviewsAbout the Author: Patricia Ryan, a.k.a. P.B. Ryan, is the USA Today bestselling author of more than two dozen novels, including the #1 national bestseller Still Life with Murder. Pat's books have garnered rave reviews and been published in over twenty countries.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Fiction",
    "Romance",
    "Historical Romance"
  ],
  "author": "P.B. Ryan",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/9776477-a-bucket-of-ashes"
}