{
  "title": "Paris, Paris: Journey into the City of Light",
  "description": "“Beautifully written and refreshingly original . . . makes us see [Paris] in a different light.”— San Francisco Chronicle Book Review Swapping his native San Francisco for the City of Light, travel writer David Downie arrived in Paris in 1986 on a one-way ticket, his head full of romantic notions. Curiosity and the legs of a cross-country runner propelled him daily from an unheated, seventh-floor walk-up garret near the Champs-Elysées to the old Montmartre haunts of the doomed painter Modigliani, the tombs of Père-Lachaise cemetery, the luxuriant alleys of the Luxembourg Gardens and the aristocratic Île Saint-Louis midstream in the Seine.Downie wound up living in the chic Marais district, married to the Paris-born American photographer Alison Harris, an equally incurable walker and chronicler. Ten books and a quarter-century later, he still spends several hours every day rambling through Paris, and writing about the city he loves. An irreverent, witty romp featuring thirty-one short prose sketches of people, places and daily life, Paris, Journey into the City of Light ranges from the glamorous to the least-known corners and characters of the world’s favorite city. Photographs by Alison Harris. Praise for Paris, Paris“I loved his collection of essays and anyone who’s visited Paris in the past, or plans to visit in the future, will be equally charmed as well.” —David Lebovitz, author of The Sweet Life in Paris “[A] quirky, personal, independent view of the city, its history and its people” —Mavis Gallant “Gives fresh poetic insight into the city . . . a voyage into ‘the bends and recesses, the jagged edges, the secret interiors’ [of Paris].” —Departures",
  "genres": [
    "Travel",
    "France",
    "Nonfiction",
    "History",
    "Essays",
    "Memoir",
    "Unfinished"
  ],
  "author": "David Downie",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/9780582-paris-paris"
}