{
  "title": "CCCP: Cosmic Communist Constructions Photographed",
  "description": "Elected the architectural book of the year by the International Artbook and Film Festival in Perpignan, France, Frédéric Chaubin’s Cosmic Communist Constructions Photographed explores 90 buildings in 14 former Soviet Republics. Each of these structures expresses what Chaubin considers the fourth age of Soviet architecture, an unknown burgeoning that took place from 1970 until 1990.Contrary to the 1920s and 1950s, no “school” or main trend emerges here. These buildings represent a chaotic impulse brought about by a decaying system. Taking advantage of the collapsing monolithic structure, architects went far beyond modernism, going back to the roots or freely innovating. Some of the daring ones completed projects that the Constructivists would have dreamt of (Druzhba Sanatorium, Yalta), others expressed their imagination in an expressionist way (Palace of Weddings, Tbilisi). A summer camp, inspired by sketches of a prototype lunar base, lays claim to Suprematist influence (Prometheus youth camp, Bogatyr). Then comes the “speaking architecture” widespread in the last years of the a crematorium adorned with concrete flames (Crematorium, Kiev), a technological institute with a flying saucer crashed on the roof (Institute of Scientific Research, Kiev), a political center watching you like Big Brother (House of Soviets, Kaliningrad).In their puzzle of styles, their outlandish strategies, these buildings are extraordinary remnants of a collapsing system.In their diversity and local exoticism, they testify both to the vast geography of the USSR and its encroaching end of the Soviet Union, the holes in a widening net. At the same time, they immortalize many of the ideological dreams of the country and its time, from an obsession with the cosmos to the rebirth of identity.",
  "genres": [
    "Architecture",
    "Photography",
    "Nonfiction",
    "Art",
    "History",
    "Russia",
    "Design"
  ],
  "author": "Frédéric Chaubin",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/9784750-cccp"
}