{
  "title": "Ruby Holler",
  "description": "Winner of the UK's 2003 Carnegie MedalThe Barnes & Noble ReviewFrom Newbery Medal winner Sharon Creech comes a heartwarming tale about second chances, unconditional love, and the true meaning of family. With wry humor, a quirky cast of characters, and a setting that is as magical as it is beautiful, Creech examines what happens when two pairs of very different people come together to form a family.Ruby Holler is the name of a wondrous place that an older couple named Tiller and Sairy call home. However, \"home\" for Dallas and Florida, twin orphans who are known for their troublemaking tendencies, is the nearby Boxton Creek Home, a place run by a crusty couple with a very long list of stringent rules. The twins have managed to leave the orphanage a few times when foster families have taken them in, but things never seem to work out, and they always get sent back. With each return, their lives become more restricted and their hopes for a successful adoption dim.They have no reason to think that things will be any different when Tiller and Sairy adopt them and take them to their home in the Holler. In fact, things might well be worse, since Sairy and Tiller are planning separate vacations, each of them intending to take a twin along. The only thing Florida and Dallas feel they can truly depend upon is each other, and at the thought of being separated -- even for a short while -- they panic and make plans to run away from their newfound home. But their plans get changed when they begin to realize that Sairy and Tiller aren't like all the other adults they've known. Creech enriches her story with hidden treasures, discovered secrets, and several adventures. Her characters are likable though flawed, and their ever-changing emotions are subtly -- and often humorously -- conveyed. But as the story unfolds, it soon becomes clear that the most important element of all is the magic that's afoot in Ruby Holler -- a wondrous and powerful magic called love. (Beth Amos)",
  "genres": [
    "Fiction",
    "Middle Grade",
    "Young Adult",
    "Realistic Fiction",
    "Childrens",
    "Family",
    "Juvenile"
  ],
  "author": "Sharon Creech",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/978730.Ruby_Holler"
}