{
  "title": "Freeman",
  "description": "Freeman, the new novel by Leonard Pitts, Jr., takes place in the first few months following the Confederate surrender and the assassination of Abraham Lincoln. Upon learning of Lee's surrender, Sam--a runaway slave who once worked for the Union Army--decides to leave his safe haven in Philadelphia and set out on foot to return to the war-torn South. What compels him on this almost-suicidal course is the desire to find his wife, the mother of his only child, whom he and their son left behind 15 years earlier on the Mississippi farm to which they all \"belonged.\"At the same time, Sam's wife, Tilda, is being forced to walk at gunpoint with her owner and two of his other slaves from the charred remains of his Mississippi farm into Arkansas, in search of an undefined place that would still respect his entitlements as slaveowner and Confederate officer.The book's third main character, Prudence, is a fearless, headstrong white woman of means who leaves her Boston home for Buford, Mississippi, to start a school for the former bondsmen, and thus honor her father’s dying wish.At bottom, Freeman is a love story--sweeping, generous, brutal, compassionate, patient--about the feelings people were determined to honor, despite the enormous constraints of the times. It is this aspect of the book that should ensure it a strong, vocal, core audience of African-American women, who will help propel its likely critical acclaim to a wider audience. At the same time, this book addresses several themes that are still hotly debated today, some 145 years after the official end of the Civil War. Like Cold Mountain, Freeman illuminates the times and places it describes from a fresh perspective, with stunning results. It has the potential to become a classic addition to the literature dealing with this period. Few other novels so powerfully capture the pathos and possibility of the era particularly as it reflects the ordeal of the black slaves grappling with the promise--and the terror--of their new status as free men and women.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "African American",
    "Civil War",
    "Historical",
    "Book Club",
    "Race"
  ],
  "author": "Leonard Pitts Jr.",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/13235659-freeman"
}