{
  "title": "This Just In",
  "description": "Yolanda Joe, the bestselling author of He Say, She Say and Bebe's by Golly Wow! , is back with her most heartfelt novel yet--a delicious peep into the lives of women who work in the cutthroat world of broadcast news.While portraying the slippery business of television news through the lives of five friends--four black and one white--who work at the fictional WKBA in Chicago, Joe investigates two explosive topics, racism and sexism. Joe, who was a broadcast newswriter for more than a decade,writes with the singular knowledge of an insider.Step into the all-consuming world of TV news as Joe weaves her way through the lives of her unforgettable upstart reporter/anchor Holly Johnston--the drop-dead-gorgeous new kid on the block, striving to prove she's up to the task and more than just eye candy; broadcast veteran Alexandra Harbor, WKBA's sole black female photographer--talented, burned out, trying valiantly to keep her last good nerve intact; wife/mother/novice producer Kenya Adams, struggling to make the transition from print reporter to TV newswriter/producer without sacrificing her family life in the process; WKBA's first camerawoman, Meg \"Beans\" Rippley--white, working-class, and troop leader to many women in the office, wondering if her friendships with the black women at WKBA will withstand the fallout from a newsroom racist incident; and Denise Mitzler, a trailblazing news manager who finds herself stuck between being a \"company woman\" and doing the right thing when a crisis arises...Filled with fascinating tidbits and page-turning twists, This Just In... brims with fun and intrigue. As the characters negotiate the glass ceiling and contend with office politics and corporate roulette, Joe plumbs her signature themes of friendship and family, and gets to the heart of issues that will strike a chord with women everywhere.previous territory and investigates two explosive topics, racism and sexism, while portraying the slippery world of broadcast news through the lives of five friends--four black and one white--who work at WKBA in Chicago.Filled with fascinating insider tidbits and page-turning twists, Joe weaves her way into the lives of her Upstart reporter/anchor Holly Johnston; broadcast veteran Alexandra Harbor; wife/mother/producer Kenya Adams; WKBA's first female cameraman Meg \"Beans\" Rippley; and corporate trailblazing news manager Denise Mitzler. As these women try to negotiate the glass ceiling and contend with officepolitics and corporate roulette, Joe plumbs her signature themes of friendship and family, and gets to the heart of issues that will strike a chord with women everywhere. -->",
  "genres": [],
  "author": "Yolanda Joe",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/978426.This_Just_In"
}