{
  "title": "Stompin' on Stetsons",
  "description": "International Bestselling Author D. D. Scott heats up your heart and your kitchen with book two of her chart-topping debut series The Bootscootin’ Books. Think Hell’s Kitchen mixed with Meet the Fockers. It’s cupcakes and BBQ!Manhattan-raised, culinary-schooled pastry chef Jules Lichtenstien wants to make her new Nashville, Tennessee bakery a success. Catering the wedding of a Music City socialite and her country music, chart-topping beau could do just that. But learning the Wedding Planner from Hell is her ex has Jules’ nerves frosted. Having never found the sweet comfort in a man that she gets from her sugary confections, she vows to never again cook up anything but food in her kitchen.Meat n’ Three diner heir and produce man Cody Weiss is fantastic with food but lousy with relationships. Or so says his ex-fiancé whose wedding he’s unwittingly agreed to help his friend Jules cater. Cody wants to help Jules, but what he really wants is to succeed in their relationship where he’s failed in the past.With both of their exes stirring the pots, can Jules and Cody pull off the wedding without making minced meat of their relationship? And when a hat causes heat to simmer between them, will they be able to survive both in and out of the kitchen?Love is a lot like cooking — delicious with the right ingredients.About the D. Scott is an Amazon Top 100, International Bestselling Author. With over 300,000 books sold, including 30 titles in 5 genres and chart-topping audio books, too, she treats her readers to stories with loads of laughs and a bunch of heart. You can get the scoop on her, her books and her adventures as a new, vegetarian (almost vegan) yogi in her new cyber home—www.ddscottville.comPRAISE FOR D. D. \"...one of the top Romantic Comedy/Humorous Mystery writers out right now.\" — ENT (Ereader News Today)Books available by D. D. Bootscootin’ BooksBootscootin’ BlahniksStompin’ on StetsonsBuckles Me BabyThe Cozy Cash MysteriesThug GuardLip GlockHullabaloo and Holly TooCarats & CoconutsThe Royal DigsThe Mom Squad Mini-Mayhem MysteriesFluid FulfillmentLicensed for LoveBoxed SetsBootscootin’ and Cozy Cash Mystery Boxed SetThe Cozy Cash Mysteries Boxed Set #1The Stuck with a Series Boxed Set #1The Stuck with a SeriesStuck with a StiffStuck with a SpellStuck with Sleigh BellsStuck with a SlutBelle Bishop Queen of WitchesPractical MischiefPractical Mayhem—Coming 2015Practical Madness—Coming 2016Home for The HolidaysHollywood HolidaysNon-FictionMuse Unleashing Your Inner Sybil10 Years and 24 Hours to Indie Epublishing SuccessThe WG2E All-For-Indies AnthologiesWinter Wonderland EditionViva La Valentine EditionSpring Hop EditionSummer Fling EditionSpooky Shorts EditionMartini Madness EditionAudio BooksBootscootin’ BlahniksStompin’ on StetsonsBuckles Me BabyStuck with a StiffStuck with a SpellStuck with Sleigh BellsThe Stuck with a Series Audio Book Boxed Set #1Thug GuardLip GlockHullabaloo and Holly Too-Coming soon!Carats and Coconuts-Coming Soon!Practical Mischief",
  "genres": [
    "Romance",
    "Contemporary",
    "Chick Lit"
  ],
  "author": "D.D. Scott",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/9792627-stompin-on-stetsons"
}