{
  "title": "Safari artico",
  "description": "Diciannove anni e un sogno: l’avventura nelle incontaminate distese di ghiaccio del Polo Nord. Diventare un cacciatore artico, capace di confrontarsi con una natura grandiosa di gigantesche montagne, interminabili fiordi, immensi laghi e ghiacciai, e in quel mettersi alla prova, trovare il se stesso sconosciuto che si porta dentro. È questo che vagheggia Anton, mentre a bordo della Veslemari, è in viaggio verso la costa nordorientale della Groenlandia. Ma dopo l’esaltazione degli inizi, dopo aver imparato a cacciare, a sopravvivere, a condurre i cani da slitta, la monotonia della quotidianità co-mincia a insinuare i primi dubbi, il pentimento, la nostalgia. Ma è proprio allora che Anton è davvero diventato parte di quel mondo di rudi cacciatori, con le loro personalità fuori misura, che non potrà più abbandonare. Lo humour e il divertimento sono gli ingredienti di queste avventure nell’estremo Nord, con cui Riel ha già riempito una quarantina di volumi, con gli stessi personaggi che vanno e vengono, si perdono in quelle solitudini o reinghiottiti dalla civiltà, per poi ricomparire come se niente fosse. Accanto al veterano Mads Madsen, ecco Joensen il tatuatore, il Luogotenente Hansen, il filosofo Herbert con l’inseparabile gallo Alexander, tutti più o meno innamorati della bella Emma, affascinante frutto delle loro fantasie, che per un anno intero passa di cuore in cuore e di letto in letto, nonché l’indomabile lady Herta, arrivata per organizzare, con la sua britannica imperturbabilità, un safari artico. Storie in cui la comicità si mescola a una nascosta poesia e alla testimonianza umana di vite che, nelle loro follie, nella loro elementare semplicità e saggezza, restano improntate all’autenticità e a una fondamentale solidarietà.",
  "genres": [
    "Fiction",
    "Danish",
    "Short Stories",
    "Scandinavian Literature",
    "Humor"
  ],
  "author": "Jørn Riel",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/9794474-safari-artico"
}