{
  "title": "In the Country of Empty Crosses: The Story of a Hispano Protestant Family in Catholic New Mexico",
  "description": "Arturo Madrid's homeland is in the shadow of the Rocky Mountains in northern New Mexico, where each town seems a world apart from the next, and where family histories that extend back four centuries bind the people to the land and to one another.This New Mexico is a land of struggle and dispute, a place in which Madrid's ancestors predate those who landed at Plymouth Rock.In the Country of Empty Crosses is Madrid’s complex yet affirming memoir about lands before the advent of passable roads--places such as Tierra Amarilla, San Augustín [insert \"u\" and note accent on I], and Los Fuertes that were once among the most remote in the nation. Madrid grew up in a family that was doubly removed from the as Hispanic Protestants, they were a minority among the region's politically dominant Anglo Protestants and a minority within the overwhelmingly Catholic Hispanic populace.Madrid writes affectingly of the tensions, rifts, and disputes that punctuated the lives of his family as they negotiated prejudice and racism, casual and institutional, to advance and even thrive as farmers, ranchers, and teachers. His story is affectionate as well, embracing generations of ancestors who found their querencias—their beloved home places—in that beautiful if sometimes unforgiving landscape. The result is an account of New Mexico unlike any other, one in which humor and heartache comfortably coexist. Complemented by stunning images by acclaimed photographer Miguel Gandert -- ranging from intimate pictures of unkempt rural cemeteries to New Mexico's small villages and stunning vistas -- In the Country of Empty Crosses is a memoir of loss and survival, of hope and redemption, and a lyrical celebration of an often misunderstood native land and its people.",
  "genres": [
    "Religion"
  ],
  "author": "Arturo Madrid",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/13235816-in-the-country-of-empty-crosses"
}