{
  "title": "Signs from the Universe",
  "description": "If you've ever felt deep love and then lost it; if you miss a grandparent who has passed away; if you ever had to put a pet down; or if you've ever seen your own Signs from the Universe, you'll \"get\" this book. GO BIKE & OTHER SIGNS FROM THE UNIVERSE is a series of vignettes that exemplify events that most would see as “coincidences,” but, as will be understood, there are no such things as \"coincidences.\" GO BIKE & OTHER SIGNS FROM THE UNIVERSE highlights the author's uncanny knack for receiving messages from the Universe, most of which are delivered to her in the form of license plates, of all things! From GO LOOK to URDSIRE to GO BIKE to WRITE ON to CARMEL to THYKNGDM to HOT4LP and more, the author was shown these license plates only moments after having a related thought or question. As an avid cyclist, for cycling is her muse, she became noticeably aware of license plates while out on daily rides. When she realized these plates were practically screaming at her, she awakened to the Universe’s mode for delivering messages she needed to know. After eight years of compiling the most compelling vignettes, some of which occurred right up to the final draft of this book, she is now releasing them in this inquisitive and fun book. ABOUT THE AUTHOR:Heather Hummel is a celebrity ghostwriter and an award-winning, best-selling author. Her published works include:Journals from the Heart Series:Whispers from the Heart (2011)Write from the Heart (2011)NonfictionGO BIKE & Other Signs from the Universe (2011)Gracefully: Looking and Being Your Best at Any Age (McGraw-Hill, 2008),Awards:2009 Mature Media Awards, Merit Award2009 New York Book Festival, Honorable MentionHeather's books have appeared in newspapers such as: Publishers Weekly, USA Today and the Washington Post; and in magazines that include: Health, Body & Soul, First, and Spry Living, a combined circulation of nearly 15 million. A graduate with High Distinction from the University of Virginia, Heather holds a Bachelor of Interdisciplinary Studies degree with concentrations in English and Secondary Education. She is currently earning a Ph.D. in Metaphysical Sciences.\"Heather Hummel is a Writer's Writer.\"Victoria Moran, Best Selling Author and Radio Host\"Heather Hummel is a wonderful writer.\"Lynn Goldberg, President, Goldberg McDuffie\"Heather Hummel is a very talented, extremely organized writer.\"John Aherne, McGraw-Hill",
  "genres": [],
  "author": "Heather Hummel Gallagher",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/13235931-signs-from-the-universe"
}