{
  "title": "A Man Rides Through",
  "description": "“Someone will stop you,” she said as if she were accustomed to defiance. “If Geraden doesn’t do it, I will. You’re going to be stopped.”“Geraden?” spat Gilbur. “You? How are you going to stop me?”How?Like this.She didn’t need to say it aloud. He was still bearing down on her with his bloody hands when he seemed to run into a wall. Surprise wiped the violence from his face: his eyes sprang wide as he saw what was happening to the mirror behind her.She didn’t look. The last time she had done this, she had done it entirely by accident, without knowing what she was doing; she didn’t try to coerce it now. In any case, at the moment she didn’t care whether she lived or died. She only cared about escape.still astonished, but recovering his wits, Master Gilbur reached for her.Gently, Terisa closed her eyes and drifted backward into the dark.Terisa Morgan desperately needed to escape. Gilbur was trying to kill her, Castellan Lebbick wanted to torture her, and she needed to find Geraden. Orison was being attacked by the Alend army poised at the gates…Eremis, the traitor, was working with Gilbur in league with the hated Cadwals and the Arch-Imager Vagel…King Joyse’s actions could not be explained.Everything that Geraden loved was about to be destroyed—unless the two of them could find a way to prevent it by using the talent for mirrors and Imagery that Terisa now knew they both possessed…a talent that made them extremely powerful and extremely dangerous to Eremis. And Terisa knew that Eremis would use all the evil means at his disposal to insure the success of his master plan, which meant that the kingdom would be lost and she and Geraden would surely die.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Science Fiction",
    "Epic Fantasy",
    "Romance",
    "High Fantasy"
  ],
  "author": "Stephen R. Donaldson",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/979507.A_Man_Rides_Through"
}