{
  "title": "Time's Magpie: A Walk in Prague",
  "description": "Sometimes a city can be like a bird. Just as the magpie is an inveterate collector, hoarding beautiful eclectic bits to line its nest, so Prague retains fragments from bygone regimes and centuries past to create a city of juxtaposition that is alternately exquisite and bizarre.Prague’s personality is expressed as much by its obvious beauty as by its overlooked details. This unforgettable place is brought to life by acclaimed author Myla Goldberg, a former Prague expat, whose first novel, Bee Season , captivated so many with its unique voice and exhilarating prose.Myla Goldberg lived in Prague in 1993, just as the process of Westernization was getting under way, the city straddling a past it wished to shed and a future it was eager to embrace. In 2003, she returned to see what the pursuit of capitalism had wrought and to observe the integral ways in which Prague’s character had endured. In Time’s Magpie , Goldberg explores a city where centuries-old buildings have become receptacles for Western values and a generation defined by the Communist regime coexists with a generation for whom Communism is a rapidly fading memory.Wander through the narrow alleyways and cobblestone streets to places most tourists never see—to a neighborhood eerily transformed by the devastating flood of 2002; to an anachronistic amusement park that is home to a discomfiting array of Technicolor confections; and to the cabinets of curiosity in the Strahov Monastery, where hidden among deceptively modest displays of butterfly specimens and ladies’ fans are creatures that defy the laws of taxidermy. This imaginative, individualistic journey will show you the odd and unique corners of a city often seeking to erase what its very stones will not allow it to forget.",
  "genres": [
    "Travel",
    "Nonfiction",
    "History",
    "Audiobook"
  ],
  "author": "Myla Goldberg",
  "average_rating": "3.22",
  "url": "https://www.goodreads.com/book/show/97915.Time_s_Magpie"
}