{
  "title": "Democracy: The God That Failed",
  "description": "The core of this book is a systematic treatment of the historic transformation of the West from monarchy to democracy. Revisionist in nature, it reaches the conclusion that monarchy is a lesser evil than democracy, but outlines deficiencies in both. Its methodology is axiomatic-deductive, allowing the writer to derive economic and sociological theorems, and then apply them to interpret historical events.A compelling chapter on time preference describes the progress of civilization as lowering time preferences as capital structure is built, and explains how the interaction between people can lower time all around, with interesting parallels to the Ricardian Law of Association. By focusing on this transformation, the author is able to interpret many historical phenomena, such as rising levels of crime, degeneration of standards of conduct and morality, and the growth of the mega-state. In underscoring the deficiencies of both monarchy and democracy, the author demonstrates how these systems are both inferior to a natural order based on private-property.Hoppe deconstructs the classical liberal belief in the possibility of limited government and calls for an alignment of conservatism and libertarianism as natural allies with common goals. He defends the proper role of the production of defense as undertaken by insurance companies on a free market, and describes the emergence of private law among competing insurers.Having established a natural order as superior on utilitarian grounds, the author goes on to assess the prospects for achieving a natural order. Informed by his analysis of the deficiencies of social democracy, and armed with the social theory of legitimation, he forsees secession as the likely future of the US and Europe, resulting in a multitude of region and city-states. This book complements the author's previous work defending the ethics of private property and natural order. Democracy - The God that Failed will be of interest to scholars and students of history, political economy, and political philosophy.",
  "genres": [
    "Politics",
    "Economics",
    "Philosophy",
    "Nonfiction",
    "History",
    "Sociology",
    "Society"
  ],
  "author": "Hans-Hermann Hoppe",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/980031.Democracy"
}