{
  "title": "Singularity Rising: Surviving and Thriving in a Smarter, Richer, and More Dangerous World",
  "description": "In Ray Kurzweil’s New York Times bestseller The Singularity is Near, the futurist and entrepreneur describes the Singularity, a likely future utterly different than anything we can imagine. The Singularity is triggered by the tremendous growth of human and computing intelligence that is an almost inevitable outcome of Moore's Law. Since the book's publication, the coming of the Singularity is now eagerly anticipated by many of the leading thinkers in Silicon Valley, from PayPal mastermind Peter Thiel to Google co-founder Larry Page. The formation of the Singularity University, and the huge popularity of the Singularity website kurzweilai.com, speak to the importance of this intellectual movement.But what about the average person? How will the Singularity affect our daily lives—our jobs, our families, and our wealth?Singularity Rising: Surviving and Thriving in a Smarter, Richer, and More Dangerous World focuses on the implications of a future society faced with an abundance of human and artificial intelligence. James D. Miller, an economics professor and popular speaker on the Singularity, reveals how natural selection has been increasing human intelligence over the past few thousand years and speculates on how intelligence enhancements will shape civilization over the next forty years.Miller considers several possible scenarios in this coming singularity:-A merger of man and machine making society fantastically wealthy and nearly immortal-Competition with billions of cheap AIs drive human wages to almost nothing while making investors rich-Businesses rethink investment decisions to take into account an expected future period of intense creative destruction-Inequality drops worldwide as technologies mitigate the cognitive cost of living in impoverished environments-Drugs designed to fight Alzheimer's disease and keep soldiers alert on battlefields have the fortunate side effect of increasing all of their users’ IQs, which, in turn, adds a percentage points to worldwide economic growthSingularity Rising offers predictions about the economic implications for a future of widely expanding intelligence and practical career and investment advice on flourishing on the way to the Singularity.",
  "genres": [
    "Science",
    "Technology",
    "Artificial Intelligence",
    "Nonfiction",
    "Singularity",
    "Futurism",
    "Philosophy"
  ],
  "author": "James D.  Miller",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/13236178-singularity-rising"
}