{
  "title": "Remembrance of Things I Forgot",
  "description": "“It’s safe to say your relationship is in trouble if the only way you can imagine solving your problems is by borrowing a time machine.”            In 2006 comic book dealer John Sherkston has decided to break up with his physicist boyfriend, Taylor Esgard, on the very day Taylor announces he’s finally perfected a time machine for the U.S government. John travels back to 1986, where he encounters “Junior,” his younger, more innocent self. When Junior starts to flirt, John wonders how to reveal his identity: “I’m you, only with less hair and problems you can’t imagine.” He also meets up with the younger Taylor, and this unlikely trio teams up to plot a course around their future relationship troubles, prevent John’s sister from making a tragic decision, and stop George W. Bush from becoming president.            In this wickedly comic, cross-country, time-bending journey, John confronts his own—and the nation’s—blunders, learning that a second chance at changing things for the better also brings new opportunities to screw them up. Through edgy humor, time travel, and droll one-liners, Bob Smith examines family dysfunction, suicide, New York City, and recent American history while effortlessly blending domestic comedy with science fiction. Part acidic political satire, part wild comedy, and part poignant social scrutiny, Remembrance of Things I Forgot is an uproarious adventure filled with sharp observations about our recent past. InSight Out Book Club, featured selectionBob Smith named one of Instinct magazine’s Leading Men 2011Winner, Barbara Gittings Literature Award/Stonewall Book Awards, American Library AssociationFinalist, Over the Rainbow Selection, American Library AssociationFinalist, Green Carnation Prize, international prize for LGBT LiteratureAmazon Top Ten Gay & Lesbian Books of 2011Best Books for General Audiences, selected by the American Association of School Librarians Best Books for General Audiences, selected by the Public Library Reviewers",
  "genres": [
    "Fiction",
    "Gay",
    "LGBT",
    "Science Fiction",
    "Time Travel",
    "Humor",
    "Gay Fiction"
  ],
  "author": "Bob   Smith",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/9796473-remembrance-of-things-i-forgot"
}