{
  "title": "The Department of Magic",
  "description": "“Rod Kierkegaard, Jr. does a great job of hooking the reader right in the beginning... One just has to keep reading to find out just what they got themselves into... a life filled with magic and far too many paranormal creepies.” – Shay Williams, Goodreads reviewer comic writer and cartoonist behind Rock Opera, Rod Keirkegaard Jr builds on the success of Obama Jones & The Logic Bomb with his latest paranormal tale, the Department of Magic. Mixing a gory rainbow of supernatural beings with love-hate tension of the highest order and some things you really hope never to discover about your ex-girlfriend, the Department of Magic is Federal bureaucracy as you have never imaged it. \"Deep in the bowels of the American government's intelligence community is the Department of Magic. Comprised of only a handful of people, including newcomers Jasmine Farrah and Rocco Di Angelo, their purpose is to stop the destruction of America by a South American god/demon. Battling all manner of supernatural creatures, Farrah and Di Angelo work to collect the items needed to raise a hero who will protect America from the invaders. Part conspiracy theory, part history, and part political fantasy.” – Shiloh Carrol, Goodreads reviewer Fans of The God Particle should be sure to check out Rod Keirkegaard’s other For a high-concept technothriller and Rod Keirkegaard Jr’s newest release, search for The God Particle** For hilarious political commentary on the (hopefully not inevitable) extrapolation of political correctness into 2049 America, search for Obama Jones & The Logic Bomb** For murder, money and family tensions with a gallows humour edge, search for Family Cursemas** And for more excellent paranormal fiction from Curiosity Quills Press, search for Worlds Burn Through, the first in Vicki Keire’s Chronicles of Nowhere trilogy",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Fiction",
    "Romance",
    "Supernatural",
    "Paranormal Urban Fantasy"
  ],
  "author": "Rod Kierkegaard Jr.",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/13236097-the-department-of-magic"
}