{
  "title": "The Great Destroyer: Barack Obama's War on the Republic",
  "description": "Obama has been a one-man wrecking ballWhen it comes to our prosperity, our freedom tradition, and our constitutional government, President Barack Obama has been the great destroyer—knocking down the free-market economy and principles of limited government that have made America the envy of the world.As New York Times bestselling author David Limbaugh documents in chilling detail in his new book, The Great Destroyer, the Obama administration has waged a relentless, nearly four-year-long war to transform our nation into a country where federal bureaucrats have more power over our lives than we do; where leftist crony capitalism dependent on government subsidies is replacing the real thing; where, in an Orwellian inversion of meaning, a savagely weakened national defense somehow makes us stronger and trillions in deficit spending on counterproductive government “stimulus” and welfare programs somehow makes us richer.Limbaugh unveils the reality behind the administration’s rhetoric. In The Great Destroyer you’ll learn:The true costs of Obama’s crony capitalism scandals—it’s even worse than you thinkHow Obama spends our economy into oblivion while relentlessly demonizing those who try to stop the bleedingHow the Obama administration has repeatedly, almost systematically, violated the Constitution to achieve its goalsHow the Obama administration has empowered shadowy unelected bureaucrats to determine how we live, and the successes they already have in doing thatAnd much more …In irrefutable detail, David Limbaugh, like a prosecuting attorney, makes his case that the Obama administration is a real and present danger to America’s future. There is no more comprehensive indictment of the Obama administration as it seeks re-election than The Great Destroyer. It is a book that every American worried about the future of our country must read.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Cult Classics",
    "History",
    "American History"
  ],
  "author": "David Limbaugh",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13236224-the-great-destroyer"
}