{
  "title": "The Terrible Old Man",
  "description": "\"The Terrible Old Man\" is a very short story (less than 1200 words) by H. P. Lovecraft, written on January 28, 1920, and first published in the Tryout, an amateur press publication, in July 1921. It's notable as the first story to make use of Lovecraft's imaginary New England setting, introducing the fictional town of Kingsport.The Terrible Old Man is a strange elderly man \"so old that no one can remember when he was young, and so taciturn that few know his real name\". He lives alone in an ancient house on Water Street in the town of Kingsport. Even among the locals, few know the details of the Old Man's life, but it is believed that he captained East Indian clipper ships in his youth and had accumulated great jewels and riches throughout his life. Those who had visited the property had seen bizarre collections of stones in the front yard and observed the Old Man carrying on conversations with bottles on his table. Most locals care to avoid the Old Man and his house.The story focuses on three robbers, Angelo Ricci, Joe Czanek and Manuel Silva, who are \"of that new and heterogeneous alien stock which lies outside the charmed circle of New England life and traditions\". They little heed the locals' cautionary whisperings and disregard them completely when they hear that the Old Man possesses a treasure. They act immediately on their avarice according to their natures, and go to the Old Man's house to commit robbery. Ricci and Silva go inside to \"interview\" the Old Man about the treasure and its hiding place. Czanek waits outside in the motor-car. Czanek waits impatiently for a long while. After a time, the gate of the house opens, but it is not his accomplices who emerge but the house's inhabitant.The bodies of the three robbers are later found horribly mutilated down on the beach, \"horribly slashed as with many cutlasses, and horribly mangled as by the tread of many cruel boot-heels\".",
  "genres": [
    "Horror",
    "Short Stories",
    "Lovecraftian",
    "Fiction",
    "Classics",
    "Mystery",
    "Audiobook"
  ],
  "author": "H.P. Lovecraft",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/9805769-the-terrible-old-man"
}