{
  "title": "Looking For It",
  "description": "Mike Monaghan is the bartender at the Engine Room, a meeting place for the small but thriving community of gay men in Cold Falls, New York. As Mike pours beer, wipes glasses and hears everything, he's also witness to the men who come here looking for what they need - sex, direction, friendship, spiritual fulfillment, and love. People like: Stephen Darby - As an accountant, he knows many secrets. But Stephen has his own secret, one he's never been able to share with anyone close to him. Being the perfect son costs him dearly, and now it may take from him the one man he longs for. Pete Thayer - Playing it straight, Pete takes out his frustrations on transmissions and engines during the day, then spends his nights trying to quench his needs through anonymous sex. John and Russell - The golden couple in town has the ideal relationship everyone wants. But behind the scenes, their storybook marriage is on the verge of facing some explosive trials. Father Thomas Dunn - More and more the gentle priest is feeling a need to express the secret desires that conflict with his devotion to the church, sending his faith into a tailspin and making him question what he really wants from life. Simon Bird - He's a fixture in town, an old queen everyone finds amusing and entertaining. Still mourning the loss of his longtime lover, Simon yearns to find love and a place in a culture that worships youth and beauty.With unflinching honesty, keen insight, and his trademark humor, Michael Thomas Ford weaves together the unforgettable stories of these seven men, chronicling their dreams, hurts, heartbreaks, joys, and hopes, while taking readers on an emotional journey to find what it is we're all looking for.",
  "genres": [
    "Gay",
    "Fiction",
    "LGBT",
    "Gay Fiction",
    "Romance",
    "M M Romance",
    "Queer"
  ],
  "author": "Michael Thomas Ford",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/98082.Looking_For_It"
}