{
  "title": "Rescue Dog of the High Pass",
  "description": "RESCUE DOGof theHIGH PASSJim KjelgaardAUTHOR OF \"SWAMP CAT,\" ETC.Illustrated by Edward ShentonJim Kjelgaard has long wanted to tell the story of the gallant dogs who have gone out with the monks of St. Bernard Hospice to rescue travelers lost in the deep snows of the Swiss mountain passes. Unable to find the facts, he decided to reconstruct the tale as he feels it might have been. The result is this very moving story of a simple mountain boy and his devoted dog.Franz Halle felt he was worthless because he could not manage book learning, but his schoolmaster and the village pastor knew that the boy had a priceless knowledge all his own. The kindly priest secured work for Franz at near-by St. Bernard Hospice, helping a gentle giant of a man who made it possible for him to keep his beloved Alpine mastiff, Caesar, although the huge animal refused to earn his keep, even by turning the spit. When the scarcity of food forced Caesar's reluctant banishment, Franz—who had joined the monks in their daily patrol of the dangerous passes—proved that where even he, with all his rare knowledge of the ways of the blizzards, might fail, a dog could detect a man buried under an avalanche! So Franz and his brave helper initiated the rescue work of the St. Bernard dogs that was to become famous throughout the world.DODD, MEAD & COMPANYSWAMP CATJim KjelgaardAUTHOR OF \"DOUBLE CHALLENGE,\" ETC.Illustrated by Edward ShentonAn outstanding writer about the outdoors gives us two heroes in this fascinating book. One is a young boy who lives alone most happily on the edge of a swamp, earning his living from it. The other is, astonishingly, a black house cat. At least, Frosty started off as a city kitten, but by the time he proves his ability to survive the perils of the swamp wilderness and decides to share the boy's cabin with him, he is as much a part of his rugged environment as the deer, the horned owls, and the muskrats.The boy decides to stock the swamp with muskrats, without realizing that there are other enemies besides the predatory swamp creatures in this location where ancient family feuds have been allowed to hang on.There is the very feel of the wild country in all its moods, death-dealing or life-giving, and a wonderful closeness to the sensitive feelings and seesaw development of a boy.Edward Shenton's pictures are wonderful, as always.DODD, MEAD & COMPANY[3] JIM KJELGAARDwas born in New York City. Happily enough, he was still in the pre-school age when his father decided to move the family to the Pennsylvania mountains. There young Jim grew up among some of the best hunting and fishing in the United States. He \"If I had pursued my scholastic duties as diligently as I did deer, trout, grouse, squirrels, etc., I might have had better report cards!\"Jim Kjelgaard has worked at various jobs—trapper, teamster, guide, surveyor, factory worker and laborer. When he was in the late twenties he decided to become a full-time writer. He has succeeded in his wish. He has published several hundred short stories and articles and quite a few books for young people.His hobbies are hunting, fishing, dogs, and questing for new stories. He tells \"Story hunts have led me from the Atlantic to the Pacific and from the Arctic Circle to Mexico City. Stories, like gold, are where you find them. You may discover one three thousand miles from home or, as in The Spell of the White Sturgeon, right on your own door step.",
  "genres": [
    "Animals",
    "Childrens",
    "Historical Fiction",
    "Adventure",
    "Dogs",
    "Fiction"
  ],
  "author": "Jim Kjelgaard",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/9805074-rescue-dog-of-the-high-pass"
}