{
  "title": "Take a Walk with Me",
  "description": "\"Cozy!\" her grandma called in a loud whisper. \"I'm in the kitchen. Hurry!\" Cozy frowned, and her heart leapt as worry consumed her for a moment. Yet as she hurried to the kitchen to find her grandma kneeling at the window that faced the new neighbor's yard and peering out with a pair of binoculars, she exhaled a sigh of relief. \"Grandma! You're still spying on him?\" she giggled. \"Get down! They'll see us. Get down!\" Dottie ordered in a whisper, waving one hand in a gesture that Cozy should duck. Giggling with amusement at her grandma's latest antics, Cozy dropped to her hands and knees and crawled toward the window. \"Who'll see us?\" she asked. \"Here,\" Dottie whispered, pausing only long enough to reach for a second set of binoculars sitting on the nearby counter. \"These are for you.\" She smiled at Cozy and winked as a grin of mischief spread over her face. \"And now, may I present the entertainment for this evening-Mr. Buckly 'Hunk of Burning Love' Bryant...and company.\" \"And company?\" Cozy asked, accepting the binoculars. Slowly she rose to her knees, peering through the binoculars as she began to adjust them. Mr. Bryant came into focus. He was raking more leaves, but this time he had assistance. Cozy felt her mouth drop open-audibly gasped at the sight of the man helping him. \"I know!\" Dottie whispered. \"Va va va voom, right?\" \"Holy cow!\" Cozy exclaimed as she adjusted the binoculars further. \"Who is that?\" \"I have no idea,\" Dottie answered. \"But he's something you don't see every day, right?\" Cozy watched as the man, much younger than Mr. Bryant, picked up another piece of wood and set it on a chopping stump. The man splitting the wood had discarded his shirt somewhere, providing a perfect view of the sculpted muscles of his back and arms to Cozy and her grandma...",
  "genres": [
    "Romance",
    "Clean Romance",
    "Contemporary",
    "Christmas",
    "Contemporary Romance",
    "Fiction",
    "Holiday"
  ],
  "author": "Marcia Lynn McClure",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/9807645-take-a-walk-with-me"
}