{
  "title": "Last Summer",
  "description": "Michael Thomas Ford delivers a triumphant first novel about a group of gay men looking for love, losing the past, and finding themselves in the bars and on the beaches of Provincetown.Josh Felling has always been a romantic--up until the moment his lover Doug announced that he'd had an affair with a guy from their gym. Now, with his life playing out like a very bad movie of the week, Josh impulsively heads to the Cape for a few days--long enough to figure out where his relationship--what's left of it--might be going. But the summer has other plans for Josh, and his trip to P-town will bring bigger changes than he ever imagined.With its windswept dunes, lazy summer days, and starry nights filled with possibilities, Provincetown holds special appeal for those who call it home. . .and for those who come seeking its open welcome. People like Reilly Brennan, son of an old P-town family, whose days are caught up in wedding plans, even as his nights are increasingly taken over by heated fantasies about other men. . .Wide-eyed, blond-haired, All-American Toby Evans, an escapee from the Midwest ready to spend the summer in the equivalent of gay boot camp for anyone who will tutor him. . .Elegant Emmeline, age unknown, a southern belle straight out of Faulkner, with a mean drag act and almost enough money for her permanent gender transformation. . .Ty Rusk, one of Hollywood's hottest new stars hiding an ages-old secrets about to explode.Weaving in and out of these and other lives like the concierge of a Grand Hotel, Josh is in for the summer of his life, a time of turning points and bridges burned, of second chances and new beginnings, of renewal and hope that will bring him closer to becoming the man he needs to be.\"This is a cut above more mainstream gay fiction offerings, thanks to Ford's crisp prose and snappy, contemporary dialogue. . ..the sandy, barefoot-friendly setting morphs all the melodrama into a satisfying beach book--and a pleasant fiction debut for Ford.\"--Publishers Weekly",
  "genres": [
    "Gay",
    "LGBT",
    "Fiction",
    "Romance",
    "Gay Fiction",
    "Queer",
    "M M Romance"
  ],
  "author": "Michael Thomas Ford",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/98084.Last_Summer"
}