{
  "title": "Dean Spanley: The Novel",
  "description": "The classic humorous novella about an alcohol-loving clergyman who thinks he is the reincarnation of a dog. Complete with the screenplay and photos from the new film starring Peter O’Toole and Sam Neill.Dean Spanley is the very archetype of a bland churchman: affable, conventional, prudent without being a prig. Only his keen interest in the transmigration of souls and almost excessive enthusiasm for dogs betray any shadow of eccentricity. And then, richly primed with a few glasses of Imperial Tokay, he slips over the threshold between past and present and becomes a dog. Or are his canine memories no more than fancy? Surely no mere dean could speak so vividly, with such total conviction, of the joys of hunting, of rolling in fresh dung, of baying the moon? No human could know so much of rabbiting, the importance of buying bones, the contemptibility of pigs. My Talks With Dean Spanley, first published in 1936, is certainly Lord Dunsany’s funniest book and, in its unique way, a remarkable tour de force.Now adapted into a new comedy-drama feature film, DEAN SPANLEY follows a father and son as they encounter the eponymous eccentric in this story of reincarnation and reconciliation set in Edwardian England. Adapted by Alan Sharp (Rob Roy) and directed by New Zealand-born Toa Fraser (No.2), a truly impressive international cast is led by eight-time Academy Award nominee Peter O'Toole (Venus, Lawrence of Arabia) and also features Jeremy Northam (The Winslow Boy, Gosford Park), Bryan Brown (Cocktail, Gorillas in the Mist) and Sam Neill (Jurassic Park, My Brilliant Career).This special edition includes Lord Dunsany’s witty and inventive original novel, as well as Alan Sharp’s hilarious screenplay, which faithfully adapts and also expands upon the events in the book. Complete with colour photos and interviews with the principal film-makers, this whimsical, wintry tale about dogs, reincarnation and the effects of alcohol makes perfect Christmas reading for lovers of classic humorous storytelling.Edward Plunkett, Lord Dunsany, was born in 1878. Early passions for chess, guns and dogs stayed with him on his path through Eton, Sandhurst and the Coldstream Guards. His untidiness and eccentricity set him apart from his fellow officers, and the Irish peer left the army after the South African war to concentrate on hunting, cricket and, increasingly, wriiting. He wrote nearly 50 books and plays between 1905 and his death in 1957.Alan Sharp was born in Dundee in 1934 and is an award-winning screenwriter, from TV plays for the BBC and ITV in the 1960s to major film scripts, including Rob Roy (1995). He now splits his time living in Scotland and New Zealand.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Humor",
    "Classics",
    "Short Stories",
    "20th Century",
    "Literary Fiction"
  ],
  "author": "Lord Dunsany",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/9814967-dean-spanley"
}