{
  "title": "What the Moon Brings",
  "description": "What the Moon Brings is a short story by American horror fiction writer H. P. Lovecraft, written on June 5, 1922. This story was first published in the National Amateur in May 1923. It is shorter than most of Lovecraft's other short stories, and is essentially a fragment. It is based on one of Lovecraft's dreams (a common technique of his).This story is told in the first person the narrator is never named. The story describes a surreal dreamscape. The narrator wanders through his garden one night and in the moonlight sees strange and bizarre things. He comes to a Silent and sparkling, bright and baleful, those moon-cursed waters hurried I knew not whither whilst from the embowered banks white lotus-blossoms fluttered one by one in the opiate night-wind and dropped despairingly into the stream, swirling away horribly under the arched, carven bridge, and staring back with the sinister resignation of calm, dead faces.He sees that now the garden has no end, and where the walls used to be there are now more trees and plants and terrifying stone idols and pagodas. The dead faces urge him on farther and farther, as the stream becomes a river and leads him to the shore of a sea. Here the frightening moon makes the lotus-faces And as I saw therein the lotus-faces vanish, I longed for nets that I might capture them and learn from them the secrets which the moon had brought upon the night. But when that moon went over to the west and the still tide ebbed from the sullen shore, I saw in that light old spires that the waves almost uncovered, and white columns gay with festoons of green seaweed. And knowing that to this sunken place all the dead had come, I trembled and did not wish again to speak with the lotus-faces.What the sea has uncovered are the ruins of an ancient city, a city of the dead. The narrator sees a black condor and wishes to ask it about the people he knows that have died. He watches the sea for a time and sees ripples in it, attributing them to sea worms. He suddenly feels a chill and notices something far off beneath the Nor had my flesh trembled without cause, for when I raised my eyes I saw that the waters had ebbed very low, shewing much of the vast reef whose rim I had seen before. And when I saw that the reef was but the black basalt crown of a shocking eikon whose monstrous forehead now shown in the dim moonlight and whose vile hooves must paw the hellish ooze miles below, I shrieked and shrieked lest the hidden face rise above the waters, and lest the hidden eyes look at me after the slinking away of that leering and treacherous yellow moon.Fleeing this monstrous thing, he dives into the city of the And to escape this relentless thing I plunged gladly and unhesitantly into the stinking shallows where amidst weedy walls and sunken streets fat sea-worms feast upon the world's dead.The speaker clearly prefers death among horrors to this perceived-even-greater-horror revealed in carven grandeur. The tale ends, but does not confirm whether this was the ending of the speaker's life.",
  "genres": [
    "Horror",
    "Short Stories",
    "Lovecraftian",
    "Fiction",
    "Fantasy",
    "Classics",
    "Audiobook"
  ],
  "author": "H.P. Lovecraft",
  "average_rating": "2.90",
  "url": "https://www.goodreads.com/book/show/9808350-what-the-moon-brings"
}