{
  "title": "selected unpublished blog posts of a mexican panda express employee",
  "description": "Poetry. Megan Boyle's debut poetry collection is at once confessional, sociological, emotional, detached, funny, sad, delightful, reckless, and meditative. Written in the naturally meticulous, defaultedly complex, always affecting voice of a person too imaginative and self-aware and intelligent to be fully consumed by depression and loneliness but too aware of the meaninglessness and ephemeral nature of existence (and too depressed and lonely) to write on any level but an existential, emotionally-driven, unsimplified one, Megan Boyle's debut poetry collection is the rare work of art that conveys troubling and scary information, undiluted, about humans and the universe but in a way, ultimately, that makes you excited to be alive, eager to be troubled and scared, grateful to simply be here.\"...unbelievably engaging and mesmerizing. Boyle writes with such openness about living in a world that constantly mystifies you, the strange act of watching yourself do things you can't quite understand, making a mess of things and figuring out how to keep living [...] I can't think of another book quite like it, can't think of a voice as distinctive and strange as Boyle's.\"―Kevin Wilson, author of The Family Fang\"Just reading this collection, [Megan Boyle] immediately became one of my favorite modern poets.\"―Benn Ray, WYPR's The Signal\"[O]ne of the funniest, most satisfying, most original, most satisfying books of poetry I've come across in years.\"―Rachel Whang, Atomic Books\"[A] blunt work that challenges the reader, dares the reader to find out what this woman has on her mind. Boyle exhibits a generous exhibitionist quality that leaves one wondering if she might be the next Laurie Anderson.\"―Nicolle Elizabeth, The Brooklyn Rail",
  "genres": [
    "Poetry",
    "Memoir",
    "Nonfiction",
    "The United States Of America",
    "Short Stories",
    "Humor",
    "Comedy"
  ],
  "author": "Megan Boyle",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/9811933-selected-unpublished-blog-posts-of-a-mexican-panda-express-employee"
}