{
  "title": "Wild Wishes",
  "description": "A Happy Effin Valentine by Stephanie BurkeEffin had nothing but bad luck and misery until that pretty kitty passed her way. Suddenly bad dates, bad clothes, worse sisters were a thing of the past. To add to her change in fortune, it turned out that her new cat was actually a lucky, lusty shape-shifting Neko. But could she believe in the staying power of her luck and her sexy lucky charm? Into Temptation by Lena MatthewsThemed parties are never a good idea, especially when they incur the wrath of a God. All Billie Fowler wanted to do was spend a little extra time with her office crush, Tomas Mendez. And if it was after hours at a party, where she could wear a little slinky number, even better…or so she thought. The notion that a small Anti-Valentine Day’s party might turn into the craziest night of her life never entered her mind, but on the other hand, she had never been on Cupid’s bad side before.Tired of being cast in the role of ‘just friends’ with Billie, Tomas couldn’t resist the opportunity to spend the day of love with the woman he’d fallen for. However, Tomas hadn’t counted on Cupid showing up and turning one misspoken wish into reality. Now under a spell, Billie and Tomas are locked on a sensual roller coaster that’s been engineered by a sulking love deity who's gone missing. Giving into temptation might be their only saving grace …but then again, so might love. Tag's Folly by Eve VaughnNothing makes Dr. Taggert Webster wearier then the two words “love” and “marriage.” Having grown up in an environment where “marriage” meant “the time before divorce” and “love” meant nothing, he wants to avoid them both. Unfortunately, his live-in lover Alex doesn’t share his opinion. Her need for his love and a deeper commitment is driving a wedge between them and ruining what he considers a perfect relationship.During a heated argument, Tag mutters, “I wish you’d leave me alone…” And soon discovers the true meaning of the words “be careful what you wish for.” Not only does Alex leave his life for good, she doesn’t remember their past year together. With Alex gone Tag realizes his folly; he’s loved her all along.Little does Tag know that Psyche granted him a wish in exchange for saving her life. Now they’re both in hot water. With her help, Tag must get Alex to remember what they’d shared before Valentine’s Day or the wish will become permanent.",
  "genres": [
    "Interracial Romance",
    "Romance",
    "Paranormal",
    "Erotica",
    "Anthologies"
  ],
  "author": "Stephanie Burke",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/9817430-wild-wishes"
}