{
  "title": "Life, the Truth, and Being Free",
  "description": "After over a decade of captivating audiences and readers world-wide, Steve Maraboli re-releases this \"Steve 101\" style book which is sure to ignite that fire within. The select pieces included in this book span over a decade of Steve's words. Some pieces have been individually published around the world in more than 20 languages. This is a must-read celebration of the empowered mind. Reviews -\"Radio star, Steve Maraboli's book, Life, the Truth, and Being Free, is a masterpiece of wisdom. Filled with pearls of insight on all areas of life, it speaks directly to the primary issue of our day: How to save this world without losing ourselves. Courageously, Steve maps out the only plan that works - Engage life, stay aligned with the truth, and find the freedom to create something better for those we touch every day.\" - James Redfield, author of The Celestine Prophecy\"In this book, Steve shares the brilliant ideas and empowering philosophies that have gained him international recognition as a leader in personal development. He lays out a practical guide to living your true beauty and potential.\" - Kristine Carlson, author of Don't Sweat the Small Stuff for Women\"Steve Maraboli has done it again! No one journeys through the mucky water of life with such vibrancy for living as Steve. After reading this book, you will be ready to choose happiness and glide towards achieving all that you want in life. Steve shows us a masterful and magnificent way to have joy be second nature to us.\" - Dr. Pat Baccili, host of The Dr. Pat Show\"Finally! No more having to quote Steve Maraboli from memory. This is pure inspiration and excitement, start to finish, Maraboli-style!\" - Mary Anne Radmacher, Author - Artist - Trainer\"Steve Maraboli is one of the great positive influences of our time. His book is filled with inspirational gems of spiritual wisdom, practical advice, and the poetry of our humanity.\" - John Welshons, One Soul, One Heart, One Love",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Philosophy",
    "Psychology",
    "Inspirational"
  ],
  "author": "Steve Maraboli",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/9817952-life-the-truth-and-being-free"
}