{
  "title": "The Meaning of Freedom: And Other Difficult Dialogues",
  "description": "What is the meaning of freedom? Angela Y. Davis' life and work have been dedicated to examining this fundamental question and to ending all forms of oppression that deny people their political, cultural, and sexual freedom. In this collection of twelve searing, previously unpublished speeches, Davis confronts the interconnected issues of power, race, gender, class, incarceration, conservatism, and the ongoing need for social change in the United States.With her characteristic brilliance, historical insight, and penetrating analysis, Davis addresses examples of institutional injustice and explores the radical notion of freedom as a collective striving for real democracy - not something granted or guaranteed through laws, proclamations, or policies, but something that grows from a participatory social process that demands new ways of thinking and being. \"The speeches gathered together here are timely and timeless,\" writes Robin D.G. Kelley in the foreword, \"they embody Angela Davis' uniquely radical vision of the society we need to build, and the path to get there.\"The Meaning of Freedom articulates a bold vision of the society we need to build and the path to get there. This is her only book of speeches.\"Davis' arguments for justice are formidable. . . . The power of her historical insights and the sweetness of her dream cannot be denied.\"—The New York Times\"One of America's last truly fearless public intellectuals.\" —Cynthia McKinney, former US Congresswoman\"Angela Davis offers a cartography of engagement in oppositional social movements and unwavering commitment to justice.\" —Chandra Talpade Mohanty, Women's Studies, Hamilton College\"Angela Davis deserves credit, not just for the dignity and courage with which she has lived her life, but also for raising important critiques of a for-profit penitentiary system decades before those arguments gained purchase in the mainstream.\" —Thomas Chatterton Williams, SFGate\"Angela Davis's revolutionary spirit is still strong. Still with us, thank goodness!\"—Virginian-Pilot\"Long before 'race/gender' became the obligatory injunction it is now, Angela Davis was developing an analytical framework that brought all of these factors into play. For readers who only see Angela Davis as a public icon . . . meet the real Angela Davis: perhaps the leading public intellectual of our era.\" —Robin D. G. Kelley author of Thelonious Monk: The Life and Times of an American Original\"There was a time in America when to call a person an 'abolitionist' was the ultimate epithet. It evoked scorn in the North and outrage in the South. Yet they were the harbingers of things to come. They were on the right side of history. Prof. Angela Y. Davis stands in that proud, radical tradition.\" —Mumia Abu-Jamal, author of Jailhouse Lawyers: Prisoners Defending Prisoners v. the U.S.A.\"Behold the heart and mind of Angela Davis, open, relentless, and on time!\" —June Jordan\"Political activist, scholar, and author Angela Davis confronts the interconnected issues of power, race, gender, class, incarceration, conservatism, and the ongoing need for social change in the U.S. in her book, The Meaning of Freedom: And Other Difficult Dialogues.\" —Travis Smiley RadioAngela Y. Davis is professor emerita at the University of California and author of eight books. She is a much sought after public speaker and an internationally known advocate for social justice.Robin D.G. Kelley is the author of numerous books and a professor at the University of Southern California.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Politics",
    "Race",
    "Essays",
    "Philosophy",
    "Social Justice"
  ],
  "author": "Angela Y. Davis",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/13237073-the-meaning-of-freedom"
}