{
  "title": "The Basque History of the World",
  "description": "The Basque History of the World is the illuminating story of an ancient and enigmatic people. Signs of their civilization existed well before the arrival of the Romans in 218 B.C., and though theories abound, no one has ever been able to determine their origins. Their ancient tongue, Euskera, is equally It is the oldest living European language, and is related to no other language on Earth. Yet despite their obscure origins and small numbers (2.4 million people today), the Basques have had a profound impact on Europe and the world for more than 2,000 years. Never seeking more land, they have nonetheless fiercely defended their own against invaders ranging from the Celts and Visigoths to Napoleon and Franco. They have always been a paradoxical blend of inbred tradition and worldly ambition, preserving their indigenous legal code, cuisine, literature―even their own hat and shoe―while at the same time striving immodestly to be leaders in the world. They were pioneers of commercial whaling and cod fishing, were among the first Europeans in the Americas, Africa, and Asia during the age of exploration, and were prosperous capitalists when capitalism was a new idea, later leading the Industrial Revolution in southern Europe. Their influence has been felt in every realm, from religion (the charismatic Ignatius Loyola founded the Jesuits in 1534) to sports and commerce. Today, even while clinging to their ancient tribal identity, they are ready for a borderless The unique Basque concept of nationhood has never been more relevant, at a time when Basques are enjoying what may be the most important cultural renaissance in their long existence. Mark Kurlansky's passion for the Basque people– their heroes and commoners alike-and his exuberant eye for detail shine throughout The Basque History of the World . Like his celebrated book Cod , it blends human stories with economic, political, literary, and culinary history into a rich and heroic tale.",
  "genres": [
    "History",
    "Nonfiction",
    "Spain",
    "Travel",
    "European History",
    "Politics",
    "France"
  ],
  "author": "Mark Kurlansky",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/982217.The_Basque_History_of_the_World"
}