{
  "title": "The Gatecrasher",
  "description": "A collection of five erotic stories with mixed BDSM, lesbian and submission themes. The Gatecrasher by Stephen Albrow - Curiosity killed the cat is a saying with which Charlotte is familiar, but she doesn't intend to pay it any attention. When she hears that a new lord, Richard Parker, has moved into the local manor she is immediately intrigued, particularly when he is featured on the local news and she sees how good-looking he is. Rumours of wild parties have been spreading amongst the local population. The new lord of the manor has been vigorously discouraging ramblers from walking near his property and it has been said that he doesn't want his neighbours to know exactly what is going on at his house. This only adds to the thrill Charlotte feels when she finds herself climbing over the wall of the manor house. It's even possible that Richard Parker will deal with her severely; that's what Charlotte is hoping, anyway. The Gift by Dolores Day - Susanna is bored and bored women are dangerous, especially if they have the money and leisure to feel time weighing heavily on their beautifully clad shoulders. Married to the much older Lord Marksbury, whose skills in the bedroom are not so much inferior as non-existent, Susanna longs for a companion who will understand her needs. Luckily for Susanna, help is at hand in the shape of an old friend, Leonie, Contessa Lambertz, who is happy to recommend someone who has the outgoing nature to help her to forget her unhappy marriage. Arleta is an expert in the bedchamber and has all the skills that Susanna could possibly desire. With this liberation comes a surprising conclusion, one that Leonie could scarcely have imagined when she first agreed to help her friend. Fairground Attraction by Mimi Elise - Fairgrounds are fascinating places; the sparkling lights, the screams of the riders on the waltzers, the tantalising smells wafting across the field from the hot food stands. And, most of all, the exotic strangers that man the stalls and the rides and bring a touch of light and glamour to the most boring provincial town. Fairgrounds are also places where risks are taken and people behave with less constraint than they display in their everyday lives. This is a place where you can cast off the uniform of normality and release your wild alter-ego. When our heroine decides to submit herself to the skills of the fortune teller she little imagines what the night will bring. She expects to be told that she will meet a tall, handsome stranger, but this prediction hardly describes what will eventually happen to her when she visits the fairground and is taken on the ride of her life. Rodeo Girl by Matt Pascoe - Penny is a good girl. She works in accounts. So when she finds herself, sick with nerves and apprehension, waiting to perform onstage as a lap dancer at a gentleman's club, it's clear that some encouragement is needed. She is relieved to be rescued by her far more experienced colleague, Candy Cane, who leads her to a deserted dressing room, mixes a lethal cocktail and offers some welcome advice. After a couple of glasses Penny is invited to explore her creativity and, to her surprise, she finds that the cocktail has worked its magic. Candy knows exactly what to do with her body and invites Penny to find her inner exhibitionist which, after a shaky start, she does. Just one masterclass with Candy is enough to expose a wild side that she never knew that she had. The genie is out of the bottle and the audience is in for a performance that will have them all begging for more. The Boss by DMW Carol - He is so arrogant, so sure of his authority. He struts as he moves around the office (his own little fiefdom) and his alpha male attitude is guaranteed to bring out the worst in any employee who questions his power.",
  "genres": [],
  "author": "Miranda Forbes",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/9831785-the-gatecrasher"
}