{
  "title": "State of Emergency: The Third World Invasion and Conquest of America",
  "description": "Pat Buchanan is sounding the alarm. Since 9/11, more than four million illegal immigrants have crossed our borders, and there are more coming every day. Our leaders in Washington lack the political will to uphold the rule of law. The Melting Pot is broken beyond repair, and the future of our nation is at stake.In this important book, Pat Buchanan reveals that, slowly but surely, the great American Southwest is being reconquered by Mexico. These lands---which many Mexicans believe are their birthright---are being detached ethnically, linguistically, and culturally from the United States by a deliberate policy of the Mexican regime. This is the \"Aztlan Plot\" for \"La Reconquista,\" the recapture of the lands lost by Mexico in the Texas War of Independence and Mexican-American War.Comparing the immigrant invasion of America from across the Mexican border---and of Europe from across the Mediterranean---to the barbarian invasions that ended the Roman Empire, the author writes with passion and conviction that we have begun the final chapter of the Death of the West. Unless the invasion is halted now, Buchanan argues, by midcentury America will be a country unrecognizable to our parents, the Third World dystopia that Theodore Roosevelt warned against when he said we must never let America become a \"polyglot boardinghouse\" for the world.President Bush's failure to halt the invasion and secure America's border, Buchanan writes, is a dereliction of constitutional duty that, in other times, would have called forth articles of impeachment. In the final chapter, \"Last Chance,\" he lays out a sweeping immigration reform and border security plan, which, he contends, if not pursued, means George W. Bush's legacy will be to have lost for America a Southwest that was the legacy of Sam Houston, Andrew Jackson, and James K. Polk. With an estimated ten to fifteen million \"illegals\" already here and tens of millions more poised to pour across our borders, few books could be as timely---or important---as State of Emergency . It is essential reading for all Americans.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Philosophy",
    "American History",
    "American"
  ],
  "author": "Patrick J. Buchanan",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/10355.State_of_Emergency"
}